{
    "BORUTO: Two Blue Vortex - Chapter 11 Links and Discussion": {
        "title": "BORUTO: Two Blue Vortex - Chapter 11 Links and Discussion",
        "score": 32,
        "url": "https://mangaplus.shueisha.co.jp/viewer/1021245",
        "content": "",
        "num_comments": 235,
        "comments": [
            "Alternative VIZ Media link: https://www.viz.com/shonenjump/boruto-two-blue-vortex-chapter-11/chapter/43170?action=read",
            "please GOD let us see Sarada do SOMETHING. can’t believe we’re waiting months at a time to see everyone except for Boruto fail to do anything important",
            "Poor Sarada and Himawari; get a couple panels of being cool and competent only to having to be bailed out by Boruto once again. Why ever have the focus leave Boruto if he’s going to be the only one who actually accomplishes anything?",
            "I swear almost everytime Konahamaru does something cool, he gets owned. It's like he's not allowed to actually shine. \n\nThat being said that new guard type rasegan was a pleasant surprise.",
            "A brief history of Sarada's journey getting her ass saved in the entire series:\n\n1.Ch11 - Sarada lets her guard down and gets snuck by a fodder mujina bandit to which Boruto has to bail her out. No sharingan active\n\n2.Chapter 58 – Sarada lets her guard down and gets tricked by a shadow clone from Kawaki and needs to get bailed out by Boruto. No sharingan active\n\n3.Chapter 79 - Like 5 people tell Sarada that Kawaki is crazy, so Sarada decides to go face to face against Kawaki without her sharingan on which causes her to get caught of guard and Boruto has to save her ass.\n\n4.TBVCh1 - Code pulls up on her - Boruto has to bail her out (i'll let it go because it introduces Boruto back but did the first showing of Sarada after the TS have to be her needing to be saved???).\n\n5. TBVCH2 – Let’s her guard down and gets caught off guard by a fodder claw grime – needs to be saved by some fodder shinobi.\n\n6. TBV Ch11 - Boruto has to save her ass against Hidari.\n\nTruly peak writing - Kishi has certainly improved his pen for female characters. \n\nSeriously though, her overall introduction over the TS has been terrible.\n\nLike every time Sarada appears in battle, instead of fleshing her out by herself, he's gotta press the summon Boruto button every single time. I can't believe this is the same man that wrote the Uchiha in the original series. \n\nBtw, I'm not even expecting her to win against Hidari but I expect her to do something and actually showcase her growth from the 3 year TS (exclusing the MS). This battle should have been what Mitsuki vs Boruto was - Boruto was clearly outclassing Mitsuki, but Mitsuki was able to showcase what he had learned over the TS so that we as the readers can gauge where he is at.\n\nThe fact that Sarada was snuck kinda helps with how I originally felt about Sarada this issue. That being said, Sarada knows how the claws work - she's seen Hidari, code and the claw grimes travel between claws, yet she positions herself next to one??? Like where is her brain??? Where is her spatial awareness??? The truth is they need Sarada to be an idiot so that Boruto can play the knight in shinning armour as per usual. I also love the way that most of the fandom are defending Sarada getting snuck but clown on Kawaki when he got snuck by Mitsuki like wtf???\n\nAt this point I just hope Boruto take Sarada away from the village and sends her ass to Orochimaru for training. Give her an upgraded version of Sasuke's timeskip training with Orochimaru's up to date knowledge. Might as well slap on a curse mark too cause this girl clearly did nothing but whine at Shikamaru about Boruto's innocence for 3 years.",
            "Himawari getting random power that more than Naruto is beyond me. Lol",
            "Ikemoto's drawing is so bland, speed lines used for background not artistic. They should find a better mangaka. or Masashi should take over his drawing.",
            "Naruto had to learn rasengan as fundamentals on top of train with Killer Bee in order to master biju bomb\n\nand now Himawari with baby Kurama no less able to master bijuu bomb out of the gate lol",
            "Himawari‘s power-up still feels shoehorned in for me. \n\nYes, she isn’t dominating Jura but the whole speech about her surpassing previous Jinchuuriki, transcending the jinchuuriki, effortlessly healing Inojin (who was likely dead at this point), wielding Kurama‘s powers more or less from the get go and more is nonsense to me. \n\nPeople trying to compare her growth to Minato‘s (WA KCM) is even more nonsense. Hima apparently trained for 3 years, yet we got one training sequence of her and Ino-Shika-Cho plus some ominous statement, and people try to tell me her growth is natural?\n\nI like Hima as a character. It’s her power trajectory that reeks of plot-induced power-up to keep up with Boruto (Another can of worms). \n\nKawaki getting clowned on yet again makes me dislike this scene even more.",
            "Himwari randomly able to control her hair, use biju bomb, and heal people. She has no cloak but can put up a fight somehow.",
            "Naruto could only heal others besides himself after receiving the power from the sage of 6 paths so why can himi just all of a sudden heal completely punctured torso.",
            "I have read fanfics with better writing. No wonder why the sales look the way they do.",
            "Was this chapter censored last minute or something? The who sequence on pg 32 and 33 were her shirt rips from an attack that doesn't leave any marks seems wrong...",
            "This chapter is a patriarchal W",
            "I’m sorry, but the repeating formula of-\n\nEnemy shows up in leaf village>Everyone freaks out and struggles against enemy>Boruto suddenly shows up>Easily handles enemy that everyone else is struggling with>Boruto Leaves>Enemy shows up in leaf village\n\nIs starting to get old.",
            "It’s weird how these kids are handing these threats but we still have a whole lot of veteran Shinobi. Where is SAKURA, KAKASHI, ROCK LEE? Are they dead wtf is the old cast",
            "Its funny the boruto sub is parading this chapter as peak while this sub is actually critiquing the chapter for its weak points.",
            "No fucking way can Himawari instantly control a biju bomb...\n\nThis bullshit is truly off the chats",
            "So every character that’s not Boruto is worthless got it. At this point the only reason Sarada is still alive is to be a kitchen maid like Hinata to Naruto.",
            "The art is still bland backgrounds and speed lines 😐 bro is addicted to making the backgrounds just lines despite having a literal month between chapters unlike other mangakas",
            "How long has it been since (in the real world) Sarada unlocked her Mangekyo Sharingan? And we *still* don't know what it's ability is. If Mitsuki and Himawari can have cool moments (even if the power scaling is whack) while still being beaten, why can't Sarada? Even Konohamaru got to show off a new ability this chapter.",
            "I like how Treesuke can just spit fire without doing shit.",
            "This is so ass bro.",
            "Hima uses a Bijuu Bomb within 10 panels of inheriting Kurama. This shit is so ass 🤢",
            "TBV started off hype, but it's quickly falling off super hard. Nobody knows why sakura, Lee, kakashi, tsunade, shino, Kiba, temari, kankuro, any other village/kage, etc aren't helping. Like where are they?????\n\nPlus the power creep is insane. I can understand boruto getting all his stuff in the time skip bc although it's all strong stuff, it isn't anything impossible. Mainly flying raijin, kenjutsu, and a new rasengan. \n\nKishimoto HAS to show the side cast doing things next chapter or I feel like the manga is just cooked and done for. Himawari, sarada, the new ino-shika-cho, mirai, sumerei/nue, or ffs even just showing what other villages and kage are thinking or what's happening with naruto and hinata?",
            "I wish Himwari's power was tied to her character development in some way. Like she's a prodigy that devoted the time skip to mastering the rasengan in several variations. And her motivation for mastering was because it's a connection to her father. All this could have been shown or just mentioned during the training scene a few chapters ago.",
            "Sorry Kodachi. perhaps i treated you too harshly\n\never since Kishimoto or whoever take over the writing. this manga has turn into total dogshit. both story and pacing. Kodachi writing isn't very good but his pacing is way better and i enjoyed it more than the current. writing.\n\nand of course he treated Sarada way better than the current writer. Now Sarada reduced to damsel in distress and being a trophy wife for the main character so he can looks cool and awesome. yeah of course there's instance during Kodachi part where Sarada gets into trouble and need saving but it's like once from what i can remember. TBV is only 11 chapters and Sarada alread been saved 3 times!. Did the writer foget she had mangekeyo? even if you make excuses she didn't want to go blind and will only use the MS when it absolutely neceessar, isn't this a best time to use it with her tied down to a tree and all his friends are knocked out? not even Sakura was this bad\n\nDelta constantly disrespect Kawaki is the only good thing in the last couple of chapters",
            "[It's lowkey offensive how often this series does this where they try to say the asspull on screen to lampshade it being an asspull.](https://i.imgur.com/PrdBT3I.png)\n\nLast month Kurama did the same thing where he [stared directly at the audience saying the explanation for Kurama being with Himawari doesn't matter.](https://i.imgur.com/l0Zwhs0.png)",
            "What a shitshow of a story",
            "I like how Himawari is basically what Kushina could’ve been if she and Kurama worked together \n\nLike not I’m convinced the only reason she has long hair was to simulate the nine tails look and do tailed beast bombs lol. I dig it, more similar to baryon mode than Kurama chakra mode. Which I prefer\n\nNice to see Konohamaru show off something new and at least successfully block an attack. I also like that Hidari can’t use the chidori perfectly cause he doesn’t have a sharingan lol\n\nLast note: still waiting on an explanation on why Sarada and Sumire are immune to the rewriting. Seems like Sumire sensed something from Hidari that tipped her off to Sarada being his target. Gah I gotta know what’s going on there",
            "I dont think these villains are gonna be too interesting for final series villains they are kinda bland and generic. it just seems like boruto doesn't know what its doing with all its pieces. Tbh at this point even zetsu and Kaguya are more compelling story wise.",
            "Love this as a new Dragon Ball Super chapter. As a new Naruto chapter? Not so much.",
            "This chapter was very meh to me. \n\n* Maybe I’ve been spoiled by other series, but the Inoji resurrection was very…. mundane. Anyone could have guessed that they wouldn’t have the guts to keep him dead. \n\n* Nine-tail Himi artstyle is cool. Interested to see how it develops. \n\n* My biggest gripe right now is that Boruto is the ONLY person capable of ANYTHING. It makes for a boring manga because like Ten Tails said, everyone seems so incompetent.  \n\nNew Sadara powers? No. New team dynamics? No. New entry of past cast? No. Let’s not write god-tier villains ya can’t make it entertaining. \n\n* At least the cool frogs are back lol.  \n\nI enjoyed the chapters preceding this, but I hope we see SOMEONE outside of Boruto do something other than get folded like a lawn chair. \n\n*Edit: My hope is that they’re setting up Boruto to be overwhelmed by the responsibility of everything. He has be in constant surveillance of Konoha, literally had to be in 2 places at, and the whole world is against him (I think? Because no one outside of Konoha has even breathed lmao). Him battling the weight of this burden would be great, but it’d be a Berserk manga at that point.",
            "LET HIMAWARI AND SARADA FIGHT OMG 😭😭",
            "I liked everything I’ve seen in tbv so far but my biggest critique is the lack of side charcters where og konoha 11 , metal  , kakashi the cast feels so small I’ve said it time and time again boruto does not work on a monthly schedule for these reasons either the pacing is going to feel to slow or too fast .  There so much lore and depth to charcters that need to be fleshed out where monthly dosent work for this type of series . Prime exsample code invaded konoha they don’t show none of the other side cast not evacuating civilans fighting off claw grimes nothing I’m not asking for a chapter even a couple of panels is more then enough. I know theyll fix that in the anime adding scenes  but how do you expect manga sales to ever be good when thats a glaring issue .",
            "Konohamru took a W since he actually reacted to Hidari teleport chidori attack, and protected himself with a new rasengan wind barrier. I consider that a W since he would’ve had a doughnut through his chest from that chidori. Sarada getting folded makes sense to me because Hidari explained it’s hard to use chidori, because he has the tunnel vision problems just like Kakashi did before obito gave him his eye.\n\nSarada exploiting that weakness while using her sharigan to counter attack, seems like it’s a plot point kishimoto is setting up to make Hidari want to steal her eyes to perfect chidori. I kinda wish kawaki saved Hima instead of them flexing Boruto speed, but i think Kawaki is probably gonna fight Jura again. If he uses his V2 state with his horn, he probably puts up a better fight with delta helping shooting her light beams that counter juubi healing abilities.",
            "The tree people are more interesting than the otsuki but I wish they were all copies of important characters instead of random people",
            "why does boruto even run from cringawaki when boruto low diffs everyone crigawaki struggles with",
            "The reason hima is so naturally attuned with the 9 tails is because it wasn’t sealed in her, it’s literally been growing back inside of her. She and kurama are more together than naruto and kurama ever could be.",
            "Himawari did well and still has lots of room to grow. ",
            "I need the random red shirt who hasn't yet been murdered to survive this, lol",
            "I started playing the Storm Connection game. Same game as the others but it feels more fluid. \n\nBut all the Boruto Characters look so weird and have weird as hell color palettes. They have like two or three colors to them, and very simple designs to them.",
            "for a sub that allegedly hates/dislikes boruto y’all sure do be keeping tabs on it lol…",
            "I knew they were going to butcher her character when they had Sasuke spend all his time with Boruto when there's no one else to train her how to use the sharingan.",
            "That's what I have been saying. Boruto is the only character allowed to do anything. Instead of making Boruto cool by being better than other characters, they just make everyone else useless.",
            "I've been waiting for months to finally see konoha 12 actually show up and do something instead of Ino just communicating and Shikamaru sitting on a chair.\n\n\nLike  Moegi could have developed before she became a tree. The excuse that it's monthly doesn't work as AoT is monthly yet has good pacing heck versus is biweekly having roughly same pages yet development is pretty solid ",
            "She destroyed the dude's arm with a Chidori before he regenerated and only lost cuz the dude's the second strongest in the group and can create his own escape/summon routes for sneak attacks. \n\nNo one's giving Sumire and Konohamaru the same heat for being blindsided. \n\nLike let's be honest with ourselves, Boruto lost against all four of them together. He came in with the save for one, but would we have called it good writing if Sasuke was able to beat full power Orochimaru in the Forest of Death.",
            "Kinda makes sense why they can't do anything against characters far above them in strength tho",
            "I can give Himawari a pass on that front since she at least got a decent fight scene and it was her first real fight (though having instant perfect control over her new powers is questionable). Sarada getting clowned over and over and over again is just inexcusable.",
            "i mean do you realize what are they fighting?...",
            "You gotta remember he’s along with team 10 are  going to have to face moegi shinju . Do I expect konohamru to win he’ll no but I would be highly disappointed if he Dident debut a monkey sage mode . I’ll say this since  kishi arrived he been giving konohamru way more screen time",
            "And to think he was supposed to be the new Kakashi.",
            "Considering Kishimoto is supposed to have only recently been involved in this series, and his writing for Sarada in the Scarlet Spring was actually pretty good... I blame the new writer. Ikemoto is also to blame for making questionable design choices for the women. Kishimoto doesn't have the best track record but he never sexualised 12 year olds. I can see Kishimoto's influence on more recent chapters in regards to plot, but I don't blame him for the characters as that has been consistent throughout. I'm guessing most supervising original creators don't get much say anyway.\n\n\nEdit: edited to change the blame to the new writer as well",
            "He created a new claw behind her while they was questioning his connection to Sasuke, that’s why the sneak attack worked.",
            "It also cheapens every \"death\" that will come in the future. \"Just heal'em!\"",
            "Something something unlimited Kyuubi power",
            "Yeah, somehow Himawari was just given a powerup that took Naruto years to attain and she surpassed him in using that power despite this being a chibi Kurama and Naruto being not only the Jinchuriki of the nine tails, but also the Jinchuriki of every bijuu, making him the pseudo Jubbi Jinchuriki",
            "Not to mention getting Naruto’s ninja Jesus power to heal others instantly and having better healing 😂",
            "Kishi just being kishi doing bad decisions. With hima he should have taken time making her follow hyuga path gaining tenseigen.",
            "It’s not that surprising when you consider who her parents are. She’s half Hyuga, and now she’s technically a Jinchuuriki. She doesn’t have “Half” of Kurama’s Chakra; she might have all of it.",
            "Nothing about this is shoehorned it's just a new discovering of a character that was born in being a biju literally explained in the chapter.. she just lacks the necessary power and experience to face against current threat",
            "Exactly what I was thinking. Naruto needed training from Killer Bee to learn how to make bijuu bombs. Himawari can somehow just do it on her own instantly on her first transformation without even knowing what a bijuu is.\n\nAnd by Jura’s own words, her super-healing is even better than any other normal jinchuriki’s, literally Ten-Tails Madara/Six Paths level healing.",
            "All that with a baby Kurama",
            "Kurama did say that she had a better bond with him than all the previous jinchuuriki(likely due to her being a Hamura and Hagoromo's son's reincarnation's descendent(that's a lot of apostrophes)), maybe it's similar to the avatar state where she can gain the knowledge/he can pass on techniques or knowledge to make it easier for her to learn idk\n\nJust throwing out ideas and that one makes sense to me I guess, and tbf she was getting her ass kicked when the guy started to actually try",
            "It feels weird as heck to me too. But I’m feeling like Kiddy Kurama is flowing his chakra through her hair as a medium. She looks shocked about the Bijuu bomb forming while her hair formed the 9-Tails form",
            "Seems like it was supposed to be a micro bijuudama destroying her left side, but they censored everything by keeping all the flesh on her",
            "[Meanwhile in the OG series.](https://64.media.tumblr.com/8e9e3411b97b7eb75894cb8a497a4e0e/tumblr_inline_pandmdSWj21rz7u5u_500.jpg)",
            "There are holes on her skin. I'm guessing that was the attack. Miniature energy bullets.",
            "Mind you were only 11 chapters in and they have already reused this trope",
            "\"Starting\" to??",
            "I mean it’s the second time to happens huh",
            "Boruto easily handles enemy:\n\nUm...he ran away from the Shinju who tried to kill him in chapter 4.\n\nFighting two of them is gonna be easier, no doubt, but like he's not winning against two people who can fight Himawari, Team 10, Sarada, Sumire, and Konohamaru without getting bruised up in the process.",
            "It Litteraly the same day 🤦🏽‍♂️🤦🏽‍♂️ I can see if it happened for multiple arcs but all this is taking place Litteraly in one day . Your either hating or not understanding the power gap between the new gen and these threats",
            "You're forgetting when Isshiki showed up for Kawaki in the anime he bodied all of them minus Kakashi😂. The olds casts minus Naruto and Sasuke both who are out of commission btw are basically non existent.",
            "The Boruto sub is delusional",
            "Echo chambers do be like that. They are just kids after all, easy to tell by the way they are writing.",
            "You say that but I've seen plenty of valid criticism over there too. It's just not framing everything as complete dogshit or complaining about how Hima can do Bijuu Bombs and have better healing/regeneration than Naruto even though it's already explained as her having a better connection to Kurama in part *because* of Naruto.",
            "Just an theory of mine It can make sense. I am willing to believe her and Kurama spiritually fused when in that mode as she gained newfound high tier fighting prowess out of the blue and much greater raw power (enough to send jura back who is an humanoid tentails with six path markings and a small portion of code's karma mark chakra which has isshiki's chakra and shibai as claw marks was one of  his many abilities) during the fight (and likely his battle iq and knowledge and his powers including the bijuu bomb transferred to himawari which puts her somewhere above kcm2 war naruto)\n\nIt's gonna be better explained in the anime thats for sure. But the power jump is huge, but likely because of what kurama said her potential with her is far greater than naruto and kushina and she ain't even a jinchuriki but something alike. I think its her version of BAYRON MODE without the risks rather than KN0 AND KCM,but its different than the actual modes naruto progressed through since kurama now is more fond of humans and she isn't an jinchuriki, but is far weaker than bm naruto (as for now) since adult naruto base is mid kage and he had full kurama with 100% of his chakra post-war and as I said already she isn't an jinchuriki but something totally different as she has no seal. Her being a better pair with kurama than both her grandma and father  is just the way kishimoto wanted it since hes the headwriter (thank the overpowered cyborgs that kishimoto introduced to the narutoverse post-isshiki death), and she is destined to surpass prime naruto and sasuke at some point in tbv as the powerscaling reaches DBZ. Daemon was astonished by her presence alone despite him in the same league as jigen and stomping no limiters code, so she will be an powerhouse aside boruto and kawaki. Her 10% air palm alone as an adult would probably obliterate someone like juubidara in mere seconds. It's just the way it is.\n\nKurama is controlling her. For all we know kushina could probably have been the same if kurama hatred for humans wasn't there. but himawari has more potential being born with the chakra of hamura and hagaromo, being child of an reincarnation and having an dojutsu that could potentially become an tenesigan if she has relations to otsutsuki clan, and kurama is actually working with her now. Case closed?",
            "man at least hiatus has the excuse of being a side character but Sarada should be a super important character for the series.",
            "Remember that movie where they made Hinata a super strong Otsutski princess just for her to become a baby factory?\n\nSarada better start taking notes.",
            "Were you expecting the main antagonists who were introduced only 7 chapters ago to lose to the main characters that were struggling against their inferior copies?\n\nSarada cut off his arm, and Hidari tagged her, Konohamaru, Sumire, and a random chunin/jonin,  it's weird to only put the blame on her for that when Hidari just sucker punched them.",
            "That has to be first time I seen standard fire style be that effective towards an enemy in narutoverse.",
            "And in the other sub people downvoted me for this statement and justified this nonsense by stating that due to Naruto‘s friendship with Kurama, it’s only logical for Himawari to wield Kyuubi‘s powers, plus she transcends Jinchuuriki (Whatever that means). \n\nCool, but Kurama granting her his powers ≠ Himawari using his powers from the get go.",
            "The last like, 6 chapters have taken place in a span of 20 minutes. We're 11 chapters in and I feel like we've gotten absolutely nowhere.",
            "yea its started getting annoying that theres just so much that just isnt being addressed since the time skip and they just keep jumping from one fight scene to the next.  like would maybe take a good 5 panels to explain where some of the best fighters in the village have disappeared too, like i would understand if kakashi or sakura or whatever are on a secret mission, but like, they could at least leave hints suggesting that or a brief comment from shikamaru/konohamaru.  i feel power creep is more to be expected i just wish they implemented it better, like the fact that himawari just suddenly unlocks all this power at the exact right moment.  compare that to naruto finally making amends with kurama and unlocking KCM.",
            "Help us Boruto anime staff. You're our only hope.",
            "Kishi is confirmed not to be writing lol",
            "Kodachi wrote the entire thing before leaving",
            "Kurama‘s statement is Boruto in a nutshell, isn’t it?",
            "There is no asspull",
            ">It's lowkey offensive how often this series does this where they try to say the asspull on screen to lampshade it being an asspull.\n\nIt's not really lampshading if the characters are taking a keen observation and the author uses dialogue to go into detail about it later.\n\nAlso in the second image, wasn't like three pages before he was theorizing why his synergy was working well with Himawari and was surprised to learn his resurrection happened inside of her?",
            "Only read the first chapter after the time skip. Instantly knew this series is gonna turn from worse to worsest.",
            "> Last note: still waiting on an explanation on why Sarada and Sumire are immune to the rewriting. Seems like Sumire sensed something from Hidari that tipped her off to Sarada being his target. Gah I gotta know what’s going on there\n\nI wonder how stupid the explanation will be.",
            "At this point it's lazy writing that disrespects the original series. I really enjoyed when they got off screened by Isshiki in the anime.",
            "Nishi?",
            "Very interesting generalized sweeping statement you've made there.",
            "Sasuke had to spend all this time with Boruto because Sarada told him too, Boruto’s a wanted criminal and Sasuke’s the strongest person on the planet who would keep him safe",
            "I'm all for supporting the health of writers/illustrators and making sure they're not overworked, but there's gotta be \\*something\\* better suited to this series in terms of release strategy. The art and story just don't reflect a monthly release schedule to me, and honestly I've read weekly releases that are of higher quality and consistency. Keeping up with this manga month after month feels more like a punishment than a reward at this point lol. I think I'm better off just binging it once a year or so.",
            "Shikamaru leads the village right?",
            "I’m not hating on Sarada at all. I’m solely annoyed with how they’ve written & used her in the plot thus far. Despite having a full-fledged sharingan for a while now, we’ve barely seen her use it in combat situations for more than the 3 seconds it takes to strike with a chidori. Her big mangekyo reveal has amounted to absolutely nothing because the writers refuse to let her use it so Boruto can get bonus points for saving her *again*. \n\nI wouldn’t be half as upset with her trying and struggling/failing against overwhelmingly strong opponents if she was allowed to even attempt to use any of the strategy or jutsu that we know she’s capable of. I was so hyped for a female Uchiha with a new mangekyo and the strengths of Sakura and Sasuke, and yet we get to see maybe 1% of her potential at any given time. It’s annoying that they highlighted how intelligent & powerful she was at the beginning of the series, hyping her, Mitsuki, and Boruto up to be a fantastic team, and then they’ve refused to elaborate on that ever since.",
            "Sumire ain't shinobi anymore and Konohamaru people gave up on him for a while now",
            "Konohamaru and Sumire are not main cast. Konohamaru has been a jobber since chapter 1 so no one expected anything from him. and considering Sarada possess mangekeyo she shoule be more capable than this",
            "Then there’s no hope for anyone not named “Boruto” and the power cliffing already ruined the story before it began.",
            "But then why even include them in the story at all if you want to make that argument?",
            "I would be ecstatic if he did some sage mode thing, though I think as the older character he'd probably be doomed in that fight. Though it seems very unfair and uncool to kill him after Sarutobi and Asuma both died. I'd prefer that he get, like, knocked out or trapped to let the kids get the win but still keep him alive.",
            "The number of people who thought Konohamaru was going to die before he fought Matsuri is nuts.",
            "Ikemoto is just the illustrator you can blame him for the designs, art and fight scenes but he isn’t in charge of the characters development ",
            "Ikemoto is the artist, so he's to blame for his terrible designs - Literally just k-pop stan that wants this characters to look like Idols. \n\nKishimoto took over the manga since the chapter 50 range. before hand Kodachi was writing. Although Kodachi was underusing her, he was definitely allowing Sarada to do more when she got panel time and you could actually see that he was setting things up for her.\n\nThat all got dropped when Kishi took over though and since the, we've just been getting typical ship bait and damsel writing for Sarada.",
            ">Considering Kishimoto is supposed to have only recently been involved in this series\n\nKishimoto has been the writer of the manga since november 2020.",
            "Surely this healing power would be super useful in the war. like for example to SAVE NEJI WHEN HE WAS DYING?",
            "Kishi ain’t writing",
            "I know you mean well but this whole explanation (Boruto’s not yours!) takes me back to my childhood, when me and my friends pretended to be some self-insert characters with various powers, using shoehorned in explanation that can be chalked up to \"It is what it is, believe it\". \n\nHimawari has the genetics, yes. But the whole process on *how* she got those powers feels unnatural and plot-induced to the maximum.\n\nEdit: \n\nLike: Oh damn, super powerful intruders coming to Konoha -> Kawaki gets clowned on (?!) -> Random Shinobi get impaled -> Inojin gets impaled -> Hima, Shika & Cho are in danger -> Guess what: Kurama reincarnated in her just in time (or maybe even in Part 1? Who knows) and grants her his powers. Throw in some \"Not sure how this happened, but you‘re basically even closer to me than any previous Jinchuuriki\". \n\nAnd in regards to Kawaki: He gets clowned on left and right and people be like \"Because he hasn’t trained in 3 years, what a loser\". It’s complete nonsense how Kawaki - Mister \"I need to get rid of all Otsusuki including Boruto and Code\" - just sits on his butt for 3 years without honing his skills.",
            "This kurama likes humans so I can suspend a little belief but they still went too far. She can perfectly mold yin yang chakra instantly and doesn't need chakra cloak. And why does she have hair powers? Jiraiya had to weave hand signs to do hair jutsu but her it's like extra limbs.",
            "Which doesn't make any sense given that jura has never observed jinchuriki in action before. He must've read somewhere but if he thinks that what he's seeing is beyond what he read then he must be mistaken because we've seen Naruto heal a hole in his chest in no time.\n\nAnd also tentails jinchuriki have passive Regen, while others don't. Even the bijuu themselves don't have the tentails passive Regen.",
            "Tbf and correct me if I’m wrong naruto didn’t actually learn how to make a tailed beast bomb during that training he tried to but failed. He didn’t get it until he and Kurama were synced together and even then he got it on the first try despite not being able to do it before.",
            "Kurama's helping her out and both of them had their Jinchuriki sealed inside of her. Kurama's born inside of Himawari so he can access and flow his chakra much easier, but since she's not an Jinchuriki she doesn't have the clock.\n\nWe don't know if it's Ten Tails Madara level if she had to ask Team 10 to go get Inojin proper medical treatment.",
            "Naruto had no training to master the Bijuu powers the MOMENT that Kurama began to cooperate with him. KCM2 and above had Naruto not need to learn or train, but automatically know how to do easily.\n\nHimawari already having Kurama's full cooperation, and even stated to have far better affinity than Naruto does means just that.",
            "She's the first person ever born with a bijuu other than maybe Hagoroma and Hamura and the aliens",
            "Damn that's pretty sad, it completely ruins what's supposed to have been this epic reveal of her regeneration abilities.",
            "Damn! This is brutal",
            "Tiny little bullets of energy love!",
            "Whats funny is that this happend 4 times lmao",
            "4th*",
            ">Um...he ran away from the Shinju who tried to kill him in chapter 4.\n\nYeah and he's running from a group of Frieza is all it takes to pressure a borderline Stu. This is a complete low for his character that supposedly have struggle.",
            "Which is the point and way worse",
            "Lee 8 Gates would definitely give us a show.",
            "You’re forgetting that Sakura and Hinata along with Kakashi didn’t fight him",
            "Kishi dropped the ball not giving himawari tenseigen instead of kurama",
            "Buddy, you’re completely missing the point. \n\nNobody is complaining about the main antagonists not being beaten by the protagonists. People rightfully so complain about characters not named Boruto getting either no spotlight, little spotlight or just so much spotlight till Boruto jumps in to save the day. And don’t even get me started on the power-scaling and its trajectory.",
            "You're not wrong. I was wondering how the other sub found the Himawari and Kurama stuff exciting. I'm still trying to wrap my head around how Kurama popped inside her and how she can instantly do biju bombs and stuff on the fly.",
            "To be fair, why would Kurama restrain his power when he's trying to help her. She's not a Jinchuriki, Kurama was born inside of her so the influx of power isn't one where she has to limit the seal.\n\nPlus, why would Kurama not want to help his only friend's daughter? That just seems out of character.\n\nPlus she lost so she still has a way to go before mastering it.",
            "I don't see your complaint considering it's not valid.. using the power doesn't take any effort",
            "Same pacing as “part 1” had after Kawaki was found. Like remember when Naruto got sealed then team Sarada immediately frees him? Then Jigen is destroyed and Isshiki invades the village\n\nAlways been my number one complaint with the series",
            "This is why the anime was good for acknowledging this stuff cause the manga never has",
            "This isn't the same format as naruto making amends with kurama you guys are such lame complainers is ridiculous there is no power creep considering himawari is still losing to Jura in the fight what are you even complaining about?",
            "doesn't matter he still editor and supervisor. he still has the final say of the story direction. he can shut down or tells the writer to change if he think the story is shit\n\nthe fact that this shit is released means Kishimoto approved it. either he didn't give a fuck anymore and just wanted his quick check or he actually like this direction. he is equally guilty",
            "Perfect tagline, yes.",
            "It is a monthly manga, how many months should people who hate it read it and hate it and complain about it? I would say you shouldn't spend your time complaining.",
            "i bet the explanation would be like they already like Boruto and since he is an otsutsuki, Eida power is useless to them",
            "What Iritates me the most I know why kishimoto Dident want to do weekly it took a toll drawing but why can’t we get bi monthly hire more artist to help ikemoto I genuially don’t understand this shit bra . For a new mangaka with no funds I understand they have to get it out the mud and won’t  have the resource to get assistance etc . But for a multi million dollar owner and a billon dollar brand can’t get get even 10 more artist makes no sense . I heard a usuals manga has 8-10 assistants boruto has 3 what’s stopping them from getting 15 more . \n\n\nLike even with togashi HxH yuyu hakesho creator he’s been in pain for years that why they been on hiatus and both unfinished why not have people who are qualified to draw do all the heavy lifting like thier logic makes no sense to me it’s outdated . We live in era people would even do it for free as an internship just to have on thier resume or purely fans of franchise . I understand if this was beserk or one punch and the art was good he Dident want it to fall off because it’s damn near impossible to replicate but that isn’t the case .",
            "I am not u/Dicey12 but i think they are talking about before that whole fiasco, in the manga they barely spend time together, [heck sarada complains about that issue](https://imgur.com/a/qWJwZ3K) and the only times they do train is like anime filler which is already confusing cause in the anime sarada is a chunin while in the manga she is a genin still, sad thing is that doesn’t seem like she trained with Sakura or even anybody but ima wait for more chapters to confirm that",
            "Sasuke should of never been his mentor in the first place. The uchiha clan is gone and you would think training the only other uchiha living would be on the top of Sasuke's priority list when he's in the village. Could of easily made konahamaru be his trainer or",
            "The only time she's been in a fight before chapter 11 was the Claw Grimes, where she was taking out more regular Claw Grimes than half of Team 10 and even random chunin/jonin. Why do we want Sarada to use her ultimate potential powerup on fodder mooks meant to test the strength of the new generation?\n\nAlso, that Chidori proves that with her as the only Sharingan user, she's got an advantage over Hidari since any Chidori technique he uses won't have the eyes for the tunnel vision she can exploit. The problem is she didn't know the Shinju could make more marks than what was planted.\n\nI agree I want to see her use strategy and jutsu like she did in the Boro fight or any of the other fights she has in the anime, but this is not the first time in the series where a character got decimated in the past by a fighter to establish their threat level and then used that loss to grow and develop into a future fighter: Shikamaru lost to Hidan and Kakuzu and figured out how to beat them through seperation, Sasuke got decimated by Itachi and performed much better in the rematch, Choji did nothing against Kakuzu but was able to take him out in the war.\n\nBut right now Boruto's trying to bring the team back together while he's the only one barely able to keep up with the new threats. It's only chapter 11 of who knows how long we have and it's really weird to assume this isn't the start of Sarada having a future rematch with her evil dad's doppelganger now she knows what to expect. You have to break down your darlings first to see them rise up",
            "Yep. That's why Boruto powerscale is utter garbage",
            "No idea, they could have introduced weaker enemies first but they started with the big ones quite early.",
            "This is my theory from a couple months ago how I see everything playing out \n\n\nhttps://www.reddit.com/r/narutoborutoverse/s/g9qlQADoOD",
            "Lol I don’t understand it neither 😂😂😂 these match up have been forshadowed even inojin team 10 as a whole is going to be apart of that fight. Now what happens from there is a whole diffrent story to me the only people I know won’t die is konohamru and shikidai . Even sarada she’ll end up 2 v1 hidari with boruto revealing her ms people are crying way to premature . This to me is humbling arc I always felt that way since before the invasion this arc where they barley come out alive scarred having a dramatic change . Which is needed people forget they grew up in the era of peace this will be a reality check shifting the tone people will die  !!!",
            "Thanks, I edited it to add the new writer in. I've only ever seen people mention Ikemoto on these discussions so I forgot there was a new writer as well. Especially as Kishimoto did the whole thing himself originally.",
            "It baffles me how people try to justify Sarada acting like an infantil in battles by saying \"But Boruto trained for 3 years with Sasuke and Jiraiya‘s Clone and is Otsusuki (however that’s spelled)\". \n\nWell and Sarada did nothing in those 3 years I suppose?",
            "Edited, thanks I forgot about him. I only ever see people mention Ikemoto on this sub. I'm used to manga having one creator, maybe that's part of the problem when you have the three of them plus an editor, too many cooks.\n\n\n\nIdk, Kodachi had 50 chapters to do something cool with her, but he didn't. If he was going to he would have, that's 50 whole months. (Side note: damn this series has been going a long time, feels like yesterday it started.) Kishi's writing was so good for Scarlet Spring, but maybe it's both of them combined that are bad at writing women. Sometimes Kishi hits it out of the park and other times not so much.",
            "I think it was also kishi choice for the design. Why do you think other characters with potential get sidelined so boruto can look cool kind of like in solo leveling",
            "Feels like I only heard it last year, weird. I guess covid took a few years off. I wonder how much he actually contributes overall. Although the first 50 chapters the women still did nothing. There's definitely a recent effort to cast Boruto as the hero, at the expense of the women.",
            "That’s been debunked",
            "Isn't he? [He took over in 2020 and I haven't read anything announcing a change since.](https://www.animenewsnetwork.com/news/2020-11-16/masashi-kishimoto-takes-over-as-writer-for-boruto-manga/.166377)",
            ">takes me back to my childhood, when me and my friends pretended to be some self-insert characters with various powers, using shoehorned in explanation that can be chalked up to \"It is what it is, believe it\". \n\nThis is how i feel about every character and their powerups in this series.\n\nIt feels like a fanfic writter making up their own OC and basically giving them everything under the kitchen sink, for the sake of making their character \"Strong\" and \"cool\" and \"edgy\".  I am still fully expecting there to be a Sharingan under Borutos damaged eye. Cuz thats what a 15 year old edgelord teen would write.",
            "If I had to compare Kawaki to another character, it would be Sai. He is essentially a product of the wrong organization. The difference between Sai and Kawaki is the the Root foundation was still based in shinobi arts.  If you you remove the 9 Tails, Himawari is still a Hyuga.   If you remove the Karma, Kawaki might be severing ramen.",
            "It shouldn’t be about taking her powers away from her.",
            "> I know you mean well\n\nHrm. Weird tone there, dude.\n\nIt is a fantasy story, things can happen in fantasy stories that were not previously established.",
            "True, I can accept an already-friendly Kurama making it easier than normal and maybe doing it for her, but yeah, it’s too much all at once.\n\nEven if it turns out as some people speculate that Himawari’s >!half-bijuu herself!< and just knew how to do these things instinctively, in the context of Boruto’s power creep problems it comes off as forced. We’re still talking about a “baby” Kurama and a child after all.\n\nThe hair thing I assume is just an alternate version of the chakra cloak tails and a callback to Kushina.",
            "He literally trained with Bee and they gave him tips during the war",
            "Technically Gaara, too, since he received Shukaku before his birth.",
            "Was she born with kurama? I thought she only got him after Naruto went baryon mode",
            "impaling a 16 year old boy with a Wodden spike with the diameter of a car wheel ?  ye.. feels good !. \n\nIndicating even a single scratch at himas body after tanking a miniature bijuu bomb? That's where we draw the line !",
            "He’s running from a group of Frieza. If you’re talking about the claw grimes, the only reason he beat them in the present was because he couldn’t beat them in the past and actively trained to try and improve that. \n\nIf you’re talking about the Shinju…. Who are still trying to develop their personalities so the Frieza argument doesn’t work either, almost every Sasuke said in the next chapter that he and Sarada are the key to stopping them and he has to actively find a way to get his allies on the same page in order to fight them properly. \n\nAlso, can we please stop using Gary Sue’s/MARI suit to describe character we don’t like? \n\nAnd Boruto has struggled, but anytime he actually had floss to overcome you all called it bad writing. Like when his arrogance caused him to lose fights even before he graduated the Academy, or when his desperation for Naruto’s approval motivated him to cheat even though he would’ve won had he believed in his own power, or how he only wins team fights because his sporadic nature means he can’t counterattack properly without teammates who are stronger, or the fact that his jutsu on his own and are inherently strong so he has to combine them in order to make it stronger attacks.\n\nOr in the Vessel arc where his bad experiences with Ninja Tech made him disavow them until he saw how it could benefit ala the amputees and tried to get Ao to go back to being a Shinobi, or how his actions with Momoshiki resulted in him having to converse his chakra otherwise his body could’ve gotten taken over or have his consciousness swapped for the guy who took out his mentors eye. \n\nOr in the Code and Prophecy arc where he lets himself get blind to Kawaki’s ambitions and naively thinks getting himself killed would end the threat instead of actively fighting back Kawaki’s extremist attitude all for the sake of wiping out Otsutsuki.\n\nAnd how that flaw resulted in his entire life getting stolen from him. Plus, the fact that he has to be very careful about how he fights otherwise he can risk getting taken down and getting absorbed by the 10 tails which would end up destroying the planet and killing all life on humanity, having to navigate due to village without putting his allies in danger",
            "That make no sense how’s that way worst when it’s one momoent as opposed to reoccurring theme yall are over dramatic just because y’all fav charcters Dident beat somebody they have no bussiness beating which woulda made no sense powerscaling . Alot of y’all don’t understand the purpose of this arc this is the humbling arc the wake up call for the new gen to not only get stronger but switch the tone of the series . You gotta remember naruto generation grew up in conflict not as bad as previous generation but as weve seen in pt with konoha crush the yougings had the mindset to face conflict at any moment . \n\n\nIn boruto generation thanks to naruto breaking the cycle of hatred the new gen grew up in era of peace they Nvr legitmally had to have a mental switch . That’s why a guy like kawaki was a breath of fresh air because he reminded the fans that essence of pt 1 naruto cast with having an edge to him this new gen Dident have . Boruto had to face adversity and litterly power up he the number 1 most wanted man . Which brings me back to my point we are in arc the new gen are going to be faced with adversity and they’ll step up or fold . In specific to sarada she has so much potential her ms and rinnegan could be the most op broken ability then there other things she could stack like sage mode become a jinuriki etc . My point is let it happen naturally instead of wanting kishimoto to not honor powerscaling so she can get a highlight that ruins the show !!!",
            " You mean, Vs code? I would have accepted it",
            "did he even show 7 gates once ?",
            "They would die",
            "Okay let's go in reverse order:\n\nThe power scaling: what did the type skip establish.\n\n* The Claw Grimes are around new chunin to jonin tier, which the new generation that aren't team 7 can beat, but have to work together with hordes.\n* Boruto is above Code.\n* The Shinju are above Code and Boruto. Three of them could fight Boruto and force him to retreat and two of them were the weaker one.\n\nPeople are complaining about characters weaker than Boruto not getting the spotlight...downplaying they spotlight is being used to show how far they have to go to beat the new antagonists or in the case of Himawari and Sarada, the fact they can damage Jura and Hidari means they have the potential in the future to defeat them, but can't right now thanks to the former's lack of an experience, and as most villains in Naruto are introduced, being able to outpacing the heroes because of their skillset outwiting them.\n\nMitsuki had the focus in chapters 6 and 7, Team 10 and Himawari had it in chapters 9 and 10, chapters 8 was on Eida and Mitsuki, and five was on Sasuke telling the readers Boruto and Sarada will have to face the new threat together while setting up what the new antagonists were after they were introduced in four.  This was a problem in part 1, but part 2 is trying to split the focus, but we're too busy in knee jerk reactions and feelings to ignore logical writing.",
            "What I/we mean is: Just because you give a child an AK47 with full munitions, in perfect condition, special edition made just for them, doesn’t mean that said child will be able to hit a target at least trice immediately (Bijuu-Bomb, Inojin, Hair acting like Bijuu tails).",
            "thats the problem with monthly scheduling that isn't properly thought out the naruto series is use to a weekly schedule and it shows. It feels like boruto the series is running really really fast but is just in the same place and isn't going anywhere",
            "i mean i think its kind of odd to claim theres no power creep thats the most easiest thing to prove, its clear theres a ton of power creep even if yea himawari still lost and she could be more overpowered.  but like, they kind of fucked up with the introduction of code.  code is suppose to be like the strongest person ever, stronger than naruto and sasuke and madara and whatever.  hes much stronger than jigen and jigen was suppose to be around madara's level given it took naruto and sasuke working together to beat him.  yet since code's introduction hes been defeated several times.  basically it only seems like the point of him being introduced was to show how much more powerful everyone else is.  like literally boruto can supposedly kill code whenever he wants now cant he? he used his rasengan attack thats suppose to be able to kill someone whenever he wants to?  the introdcution of shinjutsu and stuff is pretty clearly trying to raise the power scaling.  you suddenly get new abilities and moves that can just change reality itself or make you literally invincible or see anywhere in the world.  and i have no clue what theyre doing with himawari now, she only just unlocked the abilities of kurama but she doesnt gain a cloak around her like naruto did and shes instantly able to use tailed beast bombs.  that seems overpowered compared to naruto when he first tapped into kurama's chakra, he became much stronger but he was still relatively normal, and naruto wouldnt have been able to fight a madara level or higher enemy as a 12 year old in part 1.    and as i said in my other comment they dont address any of these questions i have so what am i suppose to think besides power scaling?  if they explained why himawari is so much stronger than naruto when he gained kurama i might have less issues with it.",
            "That’s just dumb tho. He’s only in that position cause jump wouldn’t green light it without him there\n\nHe was very honest with the Boruto manga only existing so Ikemoto could have a job. The only things he wanted to see was the chocho arc and the timeslip arc in the anime",
            "I expected something logical, like Eida wanting them to be immune, but the way this Manga is written will be something like you wrote, simply simping for The Greatest MC™",
            "The people who work on manga do not consider the anime filler because they treat the anime as basically an expanded version of the manga that tells the complete story. Because of the actions that happened towards the end of part one, the anime is probably gonna explain that she got demoted.",
            "Konohamaru believes that Boruto murdered Naruto thanks to Omnipotence, Sasuke only fought it because Sarada’s bond with her father was strong enough for him to forget.",
            "I didn’t downvote you for what it’s worth. I do see merit in what you’re saying, because you definitely make some good points, but at the same time it’s inevitable that people are comparing the start of this timeskip to the start of Shippuden. Compared to the growth shown by Naruto, Sakura, Sasuke, and even the side characters at the beginning of Shippuden, these last few chapters have been like if Shippuden started with Naruto entering Sage Mode and fighting half the Akatsuki himself.\n\nI don’t care if we see Sarada start an attack and be stopped before it can land (a la Sasuke’s Kirin at the beginning of Shippuden), or see her pull out a new move and it just doesn’t really phase the enemy. I just think it’s dumb to even initiate a timeskip (and have us wait months in between the initial series ending and the new series beginning) if you’re not going to take advantage of what it means for narrative & character growth.",
            "Well we haven't seen Matsuri or Bug's Shinju and they're probably going after Eida in secret.\n\nBut Sarada managed to destroy Hidari's arm before he regenerated. Nice.",
            "Fr - yes Sarada's potential takes a hit with Sasuke leaving her but there are other people in the village that can help i.e Sakura or Kakashi. \n\nAlso, Orochimaru seems to be working with the leaf village, so Sarada could have got permission to train with him. Would have made sense with the omnipotence since team Taka genuinely care for Sasuke and wouldn't care that he's a criminal, and the researcher in Orochimaru would hear her out. He could have turned her into a beast like Sasuke did in his TS.",
            "I mean Kawaki I also has done nothing for three years but stare at Naruto in deep sleep",
            "Not like she could have gotten genjutsu training from both kakashi and Kurenai.\nSharningan training from kakashi.\nByakugo training from tsunade and Sakura \nAnd you training from Might Gai especially since she was demoted so she has more time to train",
            "Sarada didn't do nothing dude. She obviously trained but that doesn't mean she would be able to compete at all with Jura or Hidari. Boruto's training was simply unique as he was personally trained by the most skilled shinobi alive out of absolute necessity. Not to mention he easily has the highest latent potential in the franchise as well as being an Otsutsuki.",
            "I agree with your point about Kodachi but it's more of the set-up that he was giving her that interested me. The only big moment he gave her was the the Boro fight but he did give her small moments in the earlier arcs which Kishimoto doesn't even do. \n\nThe set-up I was appreciating was the potential set up for Orochimaru being her master. Ninja cards are really important in this series with Boruto wanting the SSS rated Sasuke card which implied his bond with Sasuke. Kawaki trades his card with Boruto to get the Naruto SSS Ninja card (Ironically, the card Kawaki trades with Boruto is the Minato card which must have been done on purpose since Boruto now knows FTG)\n\nSarada in CH15 of the manga pulled the Orochimaru SSS Ninja card which implied to me that they were gonna set him up for her. Mitsuki in CH38 then states that Orochimaru has been studying the Byakugou seal which further pushed that idea. If anyone is gonna help find a new level to the seal, it's gonna be the genius researcher that wants to find the mysteries of the universe.\n\nKishimoto then takes over the writing and Sarada just stopped getting those kinds of hints between her and Orochi. Her ship bait writing drastically raised tho.\n\nIt's a shame since Orochimaru would have been a really good teacher to get her to the desired level in a reasonable way that makes sense.",
            "Please enlighten me.",
            "The original announcement was more so the story would follow very rough outlines by Kishi. \n\nHe hasn’t been credited as writer like Ikemoto and hasn’t said a word about the series in 4+ years. Only talked about the Minato one shot\n\nRecent French interview clarified it too: https://www.reddit.com/r/Naruto/s/EZH2nZUkA1",
            "Prepare for shitshow then",
            "Why do we keep using \"fanfic\" for writing choices we don't agree with?\n\nAlso, whining about OCs in a story that it built around characters having genetics, a magic system where the deutragonist and protagonist had at least five nature transformations by the end of the story makes no sense.\n\nAnd who is edgy? Boruto? For showing concern for his sister and old teammates and trying to keep them safe? Sumire: who's done edgy things like....keep her friends mentally stable. Or Konohmaru...who's trying to keep his loved ones safe. Or Chocho..what's edgy about Chocho?\n\nAnd how would you expect a Sharingan to be under Boruto's eye? The only Uchiha who would do that to him is Sasuke and Sasuke can't even move right now.",
            "Wouldnt Kurama or Shukaku have noticed that there was a half bijuu around.",
            "Being half bijuu would explain it but then shouldn't she be powerful 24/7?",
            "It’s likely a callback to Kaguya as well since she used to use her hair to attack as well. \n\nSidenote, it’s the latest chapter discussion thread, you don’t need to tag spoilers here",
            "He trained with Bee that was nothing but failure. Naruto never succeeded. But the second he got cooperation, Naruto started to pump out moves and jutsus like nothing because of Kurama's cooperation. \n\nAnd let's not even forget how easily Naruto had it when he got the Six Paths Sage Mode power. No training, but knew automatically how to do literally everything in his arsenal without any practice. Even Sasuke had to have SOME form of practice to get used to his Rinnegan abilities. \n\nBashing on Himawari learning how to use Kurama's power when she has Kurama's cooperation from the literal getgo and is already stated to have the strongest affinity with Kurama only means that Himawari WILL be able to perform feats fast. \n\nWhining about Naruto having to train with Bee means nothing when the training with Bee was about the Bijuu Bomb that Naruto failed at without cooperation.",
            "Wasn't that as a fetus? I don't remember if it was before he was conceived.\n\nBut, yes, you're technically correct there.",
            "I don't know, Minato being able to split him was already weird. (And Minato  being perfect at using the power just because Naruto could seems even more odd)\n\nBut, yeah, I think there was a little bit of Kurama inside of her the entire time and that happened to be where he appeared again as opposed to in the wild. Though I still maintain that our Kurama never realized he wasn't really dying since he would have mentioned that to Naruto.",
            "Did Daemon's statement about her come before or after Baryon mode, genuinely can't remember. I'd venture after but that's not a concrete answer I guess",
            "Mitsuki‘s focus in the chapters you mentioned was tied to who exactly? Boruto (with him focusing on this sun-moon connection he has with Boruto, how Boruto is his sun etc.) \n\nEida‘s \"focus\" in the chapters you mentioned tied to who exactly? Boruto (with her only purpose being a borderline simp and having omnipotence) \n\nSasuke \"focus\" in the chapter you mentioned tied to who exactly? Boruto (to some extent Sarada but come one man…) \n\nHimawari got focus in the chapters you mentioned due to what exactly? Kurama power-up \n\nTeam 10 \"focus\" in the chapters you mentioned tied to who exactly? Himawari (Boruto‘s sister) \n\nAnd who exactly saved Himawari? Boruto\n\nSarada‘s focus in the chapters you didn’t mention tied to who exactly? Boruto \n\nAnd who exactly saved Sarada 2x despite her having MS and only showing us Chidori? Boruto\n\nLet us not even get started on all the other characters getting sidelined for Boruto or completely clowned-on to show how great Boruto is.",
            "Yeah but the child is going to put in the effort to try and when she has somone helping her aim the gun, it's gonna be the lack of experience and the skill of her adversary that's gonna force her to have to grow.",
            "You acting like Kurama is said mindless gun that leaves it all up to Himawari to figure it out lol",
            "Eida has always been a simp not a surprise and all she said was that he was cool and blushed and suddenly everyone is like yep she loves him",
            "That’s why i say it is just weird, i understand this \"expanded version of the manga\" thing for the anime fillers but to this day in the anime we have jougan but in the manga it still has not made an official debut, there are some times where the anime just does whatever and is off track of that \"expanded version of the manga\" line and tries to make it’s own thing, we can’t just hang on the anime to do everything that the manga barely tries to do, especially with people saying that it might be monthly now (unless they do a demon slayer and just make an entire season of just anime only stuff to expand shit like the current hashira training arc)",
            "Im talking about before the current events this is not the first time Sasuke trained Boruto",
            "Kawaki doesn't have to, he has Karma v2. The problem is he hasn't shown it yet",
            "I thought she just pulled that card as a reference to Scarlet Spring, though I haven't read that exact chapter in years. Him studying the seal could just be a nod to him being a scientist. I think it would be cool, but I think she is supposed to be with Naruto, Boruto with Sasuke, and Mitsuki with Orochimaru. Seeing as Sarada isn't walking the darker path like Sasuke did, I think they will avoid the comparison.\n\n\nThough they might not do the three masters, three students at all this time. It seems to be all Boruto and Kawaki focused. I thought at the end of Naruto the two brothers fight cycle was supposed to be broken but I guess not. I'm kind of disappointed on what they chose to focus on for Boruto. I saw some image floating around when it first started of Boruto, Sarada and Mitsuki in the future, Sarada had mangekyo. I thought we would head towards that but it never happened. I just really want to see if she would get a female Susano'o. She was the one I was most looking forward to seeing, my enthusiasm disappeared after the first up-skirting.",
            "I mean idk why this always gets downvoted. Kishimoto was doing a Toriyama like outline for a few chapters and since then his presence has definitely diminished. He doesn’t talk about the series, he isn’t credited anymore and most importantly this writing doesn’t give off any of his writing style. It’s clearly not him, even the side characters are used less in this",
            "Huh, I see. Thanks for the clarification.",
            "She's half Bijuu, so it's only half the time she's powerful. They've only shown us the non-bijuu half in the manga currently. That's why she *seems* weak. It's pretty obvious to understand for people like me (I have severe brain damage and make things up)",
            "How was the training with Bee a failure when the whole goal was for him to get Kuramas power under control which he did.",
            "His reemergence really takes away from his \"sacrifice\"",
            "After\n\nHis character wasn't introduced until after Isshki died",
            "The main character being a prism to help the other characters grow and shine is the definiton of using a protagonist and their supporting cast. \n\nMitsuki's entire character revolves around finding his will and sun, something that was rewritten. He's obsessed with someone who he was brainwashed to forget was his best friend but instead the person who tried to kill both of his teammates and was the first people in the village to accept him. The fight allowed him to actually dive deep into those feelings and make the first step into breaking the Omnipotence.\n\nEida has always been more than a simp. She desires connections and the only people who can do for her were people who either only see her as a plot device, Boruto who she dismissed until he showed her maturity by proving he wasn't going to blame her for what happened, Kawaki's treatment of her getting red-pilled, and leading her and Mitsuki to even have the conversation.\n\nTeam 10's focus was tied to Himawari because they're the ninjas who she's been to closest too outside of her family. Inojin and Himawari have a whole friendship explored in the anime and nvoels that was carried over to later and it's asinine to argue she wouldn't be motivated by her loss and fracturing of her family she wants to help.\n\nHimawari's focus and fight with Jura didn't bring Boruto involved directly until after he saw she was hurt. The only thing you could argue is that Boruto's actions caused Jura to even awaken, but that was Code who caused that because of the Claw Grimes he experiemented with.\n\nSarada ran into the fight because they were told two intruders were breaking into the village and one of them had her dad's chakra signature. \n\nSarada doesn't even know she has the MS yes. Kakashi didn't know he had it for years. And Sarada being saved after being blindsided by an attack she had no idea her opponent could do is not an anti-feat, why would Boruto not go out of his way to help his teammate and sister. It'd b emore out of character it he didn't. \n\nAnd it's not about making Boruto look great. Boruto has every reason to get involved in these fights:\n\n* The Claw Grimes and Code were responsible for incapacitating Sasuke\n* Code went after the Leaf to draw him out after leaving the village alone for 2 to 3 years.\n* Why would Boruto not get invovlved in stopping the threat responsible for imprisoning Sasuke and stopping it from claiming more victims?\n* The Shinju tried to murder him and feed him to become the means to end the world.\n* Mitsuki's being mindwiped into thinking they're enemies \n* His sister's under attack by the main villain he was also forced to run against.\n* Hidari was able to block his Uzihiko and now take on his old mentor, best friend, and classmate\n\nIf you're saying the character with the most incentive to be an active character is bad because he's being active in the story because the side characters have to also feel the same threat so they can grow stronger, I don't know what to say",
            "We’re still talking about a literal child and mini-kurama performing feats near WA Naruto & Kurama. That’s such a huge jump from the get-go.",
            "It’s ultimately up to the creators if they want to use the anime to flesh out the manga. If they wanted to cut the Jougan they wouldn’t have made it into an actual thing in the first place. There’s no rule saying that they can’t.",
            "Sasuke has trained Sarada before though, even in the Kara actuation arc, he chose her over him",
            "He hasn't shown it or there's nothing to show? He got bodied by 3 people so far with number 4 on the way ",
            "> this writing doesn’t give off any of his writing style.\n\nSeeing the one shot about Minato - I would say you are right.",
            "Toriyama did far more for DBS than Kishi ever did for Boruto, Toyotaro included Toriyama’s inputs in volumes, how he corrected his art and gave him advice etc., nothing like that has been said about Kishi by Ikemoto",
            ">I have severe brain damage and make things up\n\nYou could be the writer of this manga. You've got all the qualifications.",
            "No, the goal of the training was to try and master the Bijuu Bomb. Which Naruto NEVER succeeded.",
            "Cool, tyvm. I couldn't be bothered to go back and read it haha",
            "Sorry, but reading the first sentence made me clock out immediately. That’s the complete opposite of what is happening in Boruto where the supporting cast resolves around the protagonist - only around and for the protagonist. \n\nI‘m glad that you can enjoy this series tho.",
            "Naruto was only finally able to do a bijuu bomb with ease after properly bonding with Kurama which Himawari has already done from the get-go. I don't really understand why she wouldn't be able to do it. Especially if Kurama has partial control.",
            "A child to young teenager being give huge powers from the jump despite their character flaws and using it to fight opponents normally stronger than them in the Naruto franchise\n\n* Naruto using the Nine Tailed Fox powers to keep up with Haku, Orochimaru's snake, Sasuke with the Curse Mark, and the Deidara who defeated Sasuke\n* Gaara going from a child who could murder assassin level ninja as a child to summoning Shukaku as a pre teen and lifting up all the sand in his own village\n* Sasuke and Lee without tailed beasts having the speed to outpace a Jinchuriki through sheer training and honing their talent.\n* Temari being able to destroy a whole forest and 1/4 of the team responsible for a barrier jutsu that could lock the Hokage inside of and kill ANBU members.\n\nYeah kids doing jonin to kage level feats in Naruto is nothing new.",
            "That’s true, i just hope we get our answers for that",
            "Thats my issue with the way he is written, why the fuck doesn't they let him show Karma v2 for once? They jerk Boruto off instead to show how cool he is",
            "Undeniably true. Toriyama was extremely involved in both the manga, movies and anime. From character designs, to rough outlines, corrections, notes and advice and even mandates that something specific must be included in the anime and manga versions. Kishimoto has never been that deep especially when you think about how Super had two different continuities. He was just the closest example I can think of",
            "I agree about the bad writing in Boruto but you’re absolutely right. Bijuu bomb didn’t work in KCM1 despite the training. He only got it the moment he and Kurama synced. It stands to reason that a Tailed Beast’ cooperation is the most important factor in making a bomb.",
            "When you judge an entire story's treatment of it's cast in only the first arc of the story:\n\nYes the same story that's set up:\n\n* Boruto and Sarada having to work together to stop what Sasuke figured was a new threat.\n* Jura, Hidari, Bug's Shinju and Matsuri setting up Himawari & Kawaki, Sasuke, Eida& Daemon, and Konohamaru & Team 10 having to fight them, and only two out of three has happened so far.\n* Code's actions with the Claw Grimes and his escape from the story.\n* Kashin Koji being the personification of escaping his fate to be used as a tool like his genetic source to back up someone also destined to lose everything.\n* Shikamaru having to figure out how to break out of Omnipotence and manage Boruto's information with the world's affect of Omnipotence\n* Mitsuki potentially breaking out of Omnipotence\n* Jura's fascination of Team 10's abilities\n\nand only one of those has barely had pay off yet because it's at the start of the story, I have to wonder if it's just knee jerk reactions combined with lacking media literacy. It's the same thing as criticizing Uraraka from My Hero Academia for only having their development tie to Deku based on just the first 40 chapters of the manga the same time Deku's also pushing the growth of All Might, Bakugo, and Todoroki when the future valid criticism of Uraraka's wasted opportunity in future arcs by not letting her fight someone who opposes her ideologies in Stain or tying her goal for money for good persons against an antagonist in Overhaul's organization hasn't happened yet.",
            ">Sorry, but reading the first sentence made me clock out immediately. \n\nI don't think you're supposed to reply to posts if you only read one sentence",
            "»Naruto using Nine Tailed Fox powers to keep up with Haku, Oro and Sasuke with Curse Mark, Deidara«. \n \n=> In all the instances you mentioned, Naruto did not have the same level of access to Kurama’s chakra and powers as Himawari. With Deidara, he could only go up to 4-Tails before losing control. Against Orochimaru, Haku, and Sasuke, Naruto was more or less controlled by Kurama, acting like a wild beast. You can’t compare those situations to Himawari’s power-up, buddy.\n\n\n»Gaara (…)«.\n\n=> No feat Gaara has demonstrated with the 1-Tail comes close to matching Himawari's Bijuu Bomb, Inojin healing, Chakra Hair. \n\n\n»Lee & Sasuke (…)«.\n\n=> Lee gained his skills through sheer training, which is not comparable to Himawari's power-up at all. Sasuke's abilities were a combination of training and the Sharingan. Comparing Part 1 Sasuke's & Lee’s progression with Himawari's should make the difference quite clear, if I may say so.\n\n\n»Temari (…)«\n\n=> You still can't compare Part 1 Temari's feats to Himawari's. Also, let's not forget that Temari had difficulties against Shikamaru in the Chuunin exams.\n\n\nYou’re comparing apples and oranges\n\nEdit to the person below: Compare Himawari‘s trajectory to **all the other trajectories from Pt 1 & Pt 2** and you‘ll see what I mean. Before the 3 years time-skip, Hima had nothing to do with the Shinobi (Manga). Time-skip ends, she gets Kurama reincarnated (?) into her just  in time and is now some kind of Bijuu (?) fighting against a thread that out-scales all of the Pt 1 and nearly all of the Pt 2 threats (save Kaguya, Madara and Obito 10-Tails). \n\nWould‘ve made much more sense if Kurama took over Himawari against Jura, like he did with Naruto during the WA.",
            "They haven't jerked Boruto off at all tho? Boruto has yet to even use Karma. Boruto is heavily nerfed in comparison to Kawaki.",
            "Bc Naruto had a seal on him that only allowed him to access a sliver of an uncooperative Kurama. Himawari has Kurama’s full support and power ",
            "Yeah, Naruto before full access to Kurama's chakra wasn't a guarantee but it helped him bridge the gap and show Kurama wasn't playing nice or a easy power up option. Himawari's powerup came from a Kurama who had long grown past his hatred for humanity, was willing to even help someone like Kawaki out, chose to stay with naruto despite the option of going to roam free, and was willing to sacrifice himself at the time to take on a threat that could destroy the whole world. I can compare the two because one was from a dysnfuctional relationship that grew into a a loving one now become one where the matured person in said relationship is willing to guide the next kin in his old partner's life. Himawari has the Kurama whose development and wants to mold her into someone who can properly wield his chakra, much like Kurama taking the first step to work with Naruto.\n\nGaara lifted an village of sand in part 2 at the age of 16, only two years older than Himawari when he protected his entire village from a C3 explosion that's comparable to the small Juubi blast Himawari was able to fire.\n\nLee gained his skills through training, and while Himawari doesn't have as much training as he does, she's on the road to figuring out her power much like Lee had to figure out how to use the Eight Gates. If Lee had to get his start off screen, Himawari should be allowed to do so onscreen.\n\nAnd Sasuke started his training at the age of 7. Hima only properly had hers between the end of the series and the timeskip, yet Sasuke was giving a power he learned to embrace and get adapted to take on people who were taking on his classmates easily while Himwari got a power meant to help her and did the best she could until her lack of experience proved too be too much.\n\nTemari was also the child of a Kage and had an elite jonin as her mentor and Himawari also has her own struggles: her raw power and potential is held back by her lack of combat experience",
            "You writing that unironically when he onetapped Code. Also by jerking him off I meant that he is literally in every chapter saving everybody being so cool and shit"
        ]
    },
    "OG Naruto was the best": {
        "title": "OG Naruto was the best",
        "score": 134,
        "url": "https://i.redd.it/dv4jhwea338d1.jpeg",
        "content": "",
        "num_comments": 6,
        "comments": [
            "Man this scene is what sealed Naruto for me. I already loved the show from episode 1 but I am a sucker for rage induced power up and beatdown and this scene showed how much of a badass Naruto was.",
            "Both are equally good",
            "All is peak. This just makes me want to rewatch everything ",
            "I agree",
            "I'm watching this for the first time and just got to the part where Naruto and Jiraiya are looking for Tsunade.\n\nI'm enjoying a lot so far:)",
            "Shippuden >>"
        ]
    },
    "Why did Minato seal the Yang half in Naruto?": {
        "title": "Why did Minato seal the Yang half in Naruto?",
        "score": 124,
        "url": "https://i.redd.it/xaa2h48wr28d1.jpeg",
        "content": "",
        "num_comments": 45,
        "comments": [
            "Minato does NOT have control over whether Yin or Yang will be sealed inside his child during the separation process. Do you really think someone as serious as Minato would do that for shits and giggles?",
            "Yin/Yang in this series has nothing to do with good and evil, it has to do with spirit/physical energy. Kurama in general was evil it’s not like he has an evil side and a good side. He just has yin-yang chakra and Minato separated them. \n\nNaruto has the Yang Kurama which is why when he fights the Zetsus they turn into trees they’re reacting to the Yang chakra. Or why he can sense hostility/negative power.\n\nThis was explained way back in part 1: Yang is related to physical abilties like Choji’s body expansion jutsu, Yin is related to spirit/mental stuff like Ino’s mind transfer jutsu or Shikimaru’s shadow possession.\n\n\nhttps://naruto.fandom.com/wiki/Yang_Release",
            "It was implied that the ying half of the 9 tails was the good half and yang half was the one filled with hatred…so the question is why Minato left the bad half with his kid",
            "Because Minato thought Naruto couldnt handle all the Ninetails.",
            "Not sure exactly what you mean but if you are asking generally why Minato sealed half of the 9 tails into Naruto instead of all of it, it's because Minato was taking precaution since Kurama had a vast amount of Chakra and he didn't think Naruto would've been able to control it in full. \n\nSo Minato sealed half of Kurama's chakra within him and gave the other half to Naruto. Considering that Naruto was an infant, it would've been somewhat deadly to give that much chakra to a infant (assumingly).",
            "Because he couldn't control which half would go into whom\n\nAnd Naruto wouldn't survive the entire 9 Tails being sealed into him. I honestly think he could have as he survived one half like It was nothing",
            "Isn’t the whole concept of ying and yang that there’s not really a “good” or “bad” one? It’s a philosophical principle that implies that the greatest good still contains darkness and the deepest darkness has a flash of light. Neither is outright good, neither is outright bad, they’re a multilayered balance.",
            "It was an easy way to give naruto another powerup late in the series.",
            "Watch the anime lol",
            "He had to divide ninetails somehow and maybe his choice is based on the arsenal he saw the masked man using so he used whatever half he thought would be more useful and a good counter? Because all jutsu is categorized as either yin or yang.",
            "I dunno if it's Canon but I think it was because he trusted Naruto to win it over and if he was able to do that, there was nothing he couldn't do.",
            "Yang IS the good Part. Yin the evil part",
            "Cause fuck em",
            "Watch the show",
            "Likely because Yin is spirit energy, whereas Yang is physical energy. He could only take the nice half, leaving the angrier physical half in Naruto.",
            "How much would change if naruto got the good half of kurama",
            "Why didn’t he sealed whole nine tiles into him instead of baby Naruto.",
            "Quick correction, it wasn't part 1. This was explained around the time Naruto was learning which element he had, when he was starting his Rasenshuriken training.",
            "Cuz fuck them kids.",
            "Is it not the other way around? Yang means Sun so I would’ve thought minato sealed the side with less hate in naruto (it’s been a good while since I touched naruto so forgive me if I’m wrong lol)",
            "Can you specify where that was implied?",
            "imagine how bad it would've been if minato turned bad😭😭",
            "Yin and Yang don't mean good and bad.",
            "Do you failures not pay attention? The other half of the Kyuubi was intended to be controlled ",
            "Because Naruto has the power of both his mother and father. He is the son of two people who have a great amount of chakra and his mother has the power to stop the 9 Tails, Minato put her chakra in Naruto where Minato can't put her chakra into himself, there's a reason why the Bad Kurama was in Naruto.",
            "Why didn’t he sealed whole nine tails into him instead of baby Naruto",
            "Because he believed that Naruto could learn to harness the nine tails power.",
            "The side inside Naruto was definitely the hate filled one",
            "It is nowhere stated that Minato has good amount of chakra only Kushina",
            "Because leaving Konoha without a Tailed Beast is stupid.",
            "So he don’t trust his son to become powerful on his own. Even without nine tails Naruto has uzumaki genes and sage mode",
            "I doubt it. The other Kurama just had the luxury of bonding with Minato for several decades inside of the belly of a Shikigami",
            "No one controlled nine tails before so it’s useless to keep with konaha and it was a burden to people. There is hiruzen, jiraiya tsunade, Kakashi, guy. they are capable of defending the konoha against other nations.",
            "Even without Full Control, the first stage of the Chakra Cloak still makes any ninja an instant threat.\n\n\nPlus the other villages don't need to know that, all they know for certain is that Konoha has the Fox.",
            "Pretty much the seconrd arc in naruto or smt is the sand using their jinchuriki to their advantage, they were the balance of power all youd have to do if no1 else had a tailed beast would be drop your jinchuriki inside their village and let the bijuu go rampant and pretty much no1 would be able to stop it and at the very least a LOT of destruction would happen",
            "Actually they can control the nine tails because they had a whole clan with the ability to do so: The Uchihas.\n\nThe massacre only occurred years later.",
            "Beacuse of nine tails konaha lost an important asset and master jiraiya.",
            "Hiruzen ,jiraiya ,tsunade , Kakashi, guy are capable. No village would dare to attack konaha even if they attack they will lose.",
            "Only madara and few uchihas can control not all have the ability. If they could control why would they seal nine tails in Mito and kushina.",
            "Blaming the Ninetails for Pain killing Jiraiya is definitely a take, especially considering you can expand this logic and conclude that the Ninetails is the only reason Pain was stopped.",
            "Bro like youre arguing against the show, even WITH kurama the sand DID attack and would be all the easier if naruto didnt have kurama, yes it was bcs of orochimaru but still it clearly shows Konoha isnt as impervious as you think. Plus as hokage minato cant just think as ah its ok jiraiya and hiruzen got this, its much more than that its not about the next couple months you cant just trust 2 ppl are enough to protect the village the bijuu were the pillar that holded the nations from attacking each other, its the whole point of how they even began in the first place with hashirama, without some major differences to the whole world the bijuus were required especially in konoha, one of the most powerful villages, any sign of weakness and theyd all be coming we also see this worry after pain attacks, the bijuus are the irl equivalent of nuclear weapons, if major nations just stopped making them wed all be talking russian in a while",
            "Have you read or watched the series. It was stated by the author that beasts are a huge asset to a village, I don’t know what you’re making up right here.",
            "The reason pain attacked was because of nine tails ,if not he would never interfere with konoha and he respects jiraiya.",
            "Yu are underestimating konoha, no village can defeat konoha Beacuse there are ninjas like hiruzen,minato,Kakashi, Guyyyy,Itachi (he would help too if village in trouble),Naruto,sasuke.",
            "They are asset for other villages, konoha always have good ninjas who are powerful than beasts. Konoha lost jiraiya and minato who are the most important assets of the village Beacuse of these beasts."
        ]
    },
    "Did Naruto lose this battle?": {
        "title": "Did Naruto lose this battle?",
        "score": 92,
        "url": "https://i.redd.it/9qzkgtgm638d1.jpeg",
        "content": "",
        "num_comments": 70,
        "comments": [
            "If he had won, he wouldn't have to look for Sasuke in Shippuden.",
            "Did Naruto lose a battle he lost?",
            "Well, Sasuke was the one who was left conscious at the end so I'd say yes.",
            "Depends on how you interpret the fight and how it could've gone differently\n\nNaruto scratched Sasuke's forehead but his headband protected him.    \n\nHowever, Sasuke was about to pierce Naruto's chest but instead curled his hand.",
            "YES!!!",
            "Yes Naruto wanted to bring Sasuke back, but didn't manage to do so and Sasuke left so he won.\n\nSasuke would also beat Naruto (without Kuruma) at Orochimaru's hideout. \n\nBut at the bridge after Kakashi and Sasuke fought, this form of Naruto would destroy him (as Zetsu said, post pain Naruto is stronger than Sasuke). \n\nAnd in the end he did win by forcing Sasuke to give up on his entire vision of the world and accepting that Naruto is the one to follow.",
            "He didn’t win, that’s for sure.",
            "Yes, bro died 3 times that fight even with kuramas help",
            "OP showcasing his reading comprehension jutsu",
            "Yup",
            "OP’s next post\n\n“Did Tenten lose this battle?”\n\n*shows pic of Tenten hanging on Temari’s fan*",
            "Yes because by the end of it Naruto was unconscious and couldn't stop Sasuke",
            "He didn't win. In fact, the entire plot of Naruto Shippuden makes no sense if he did.\n\nNaruto contested Sasuke in terms of his physical strength and also in terms of his emotional and moral position (bonds are enough to give power). He lost.\n\nBy Naruto losing, it sets up the theme of \"Chasing Sasuke\" which predominates throughout Shippuden, and also serves as a backdrop to the reflection of the Sage's Sons, and the reflection of Hashirama and Madara.",
            "He lost, plain and simple, Sasuke was looking down on his unconscious body wondering if he should finish him off or not, that constitutes a loss in my books.",
            "Yes, but only because the plot dictated it. Suddenly sasuke's bones became adamantium and getting beat on like bongos by a jinchuriki wasnt enough to cripple him.",
            "Yes, the 9 tails saved him out dozens of times in this battle and each time gave him a boost",
            "No. He neither got what he wanted nor was still standing when it was over",
            "Naruto lost. No other answer. He possibly could’ve won or drew if he went for Sasuke’s chest instead of forehead. But he didn’t take that chance, for the sake of proving a point.",
            "Duh he whoop naruto so bad, he needed the 9tails to carry him after getting beat vs 3 tomoe sasuke. The 1 tails cloak gave kurma complete control of his body, since he was running on all 4’s and easily made a rasengan with 1 hands. Naruto needed his clones to be able to use rasengan until the war arc. If Sasuke wanted he could’ve awakened a MS, if he killed Naruto defenseless body before Kakashi got to him but didn’t want to follow Itachi path.",
            "1 person walked away from this fight",
            "Yes, curse mark v2 sasuke was stronger than naruto one tail , if they didn’t decide to clash  and the fight went on longer, 2-3 tails came out, it was a wrap for sasuke. But this fight had more thematic winner.",
            "Poor kid was chasing on empty chakra reserve. \n\nSasuke though won the fight **was weak** if he went head on fully fit naruto.\n\nNaruto was wasting kurama chakra during kimimaro fight and did not use summonings too which would have changed the tide of fight easy.",
            "He may have won the battle (he was able to scratch Sasuke's forehead protector) but he has lost the war (Sasuke was the one left standing).",
            "Yes. Absolutely.\n\nFor those saying Naruto only lost cuz he wasn't trying to kill Sasuke, you can fight at full power without trying to kill someone, he knew he couldn't win the clash at the end so instead of fighting a losing battle he wanted to be petty and scratched Sasuke's headband, meaning there was no single point in the fight where Naruto could've just killed Sasuke but didn't.",
            "He would of won if he didnt lose",
            "I mean if another tail came out then sasuke would be dead...",
            "It was less a loss & more a draw, yes Sasuke didn't get knocked unconscious like Naruto did but he was in terrible condition, that snot kid that follows konohamaru around could probably kick his ass",
            "I think Naruto had the fight when he unlocked first tail but as soon as Sasuke got that third phase sharingan it was lowkey wraps",
            "Battle of intentions. I'd say it was a tie.",
            "I do believe people argue that the reason Naruto lost is because he wasn't trying to kill Sasuke. If this had been a real deathmatch with Naruto fighting to kill then he would've won but because that wasn't the case then Sasuke won.",
            "Still makes me think why Naruto didn’t summon Gamaoyabin.\n\nI understand the author wanted Sasuke to win and leave Konoha. But completely forgetting Naruto's toad summon was bad.",
            "He scratched the head protection so he won",
            "Yes *but* we need to take in account one thing, Sasuke aimed his final chidori to take down Naruto while Naruto aimed for his headband.",
            "He threw the battle away. If he had gone to Sasuke with the intent to kill, like he did in the 2nd Battle  when he summoned Kurama's triple headed avatar, then he would have been successful in restraining and bringing Sasuke back like he did during the 2nd battle. At least they could have incapacitated each other until Kakashi reached the valley. Sasuke had no real answer to the Summoning Jutsu and Multi-Shadow Clone Jutsu on the scale of what Naruto did against Gaara and Mizuki. Even if Gamabunta refused to help him (which he would  just remark about but ultimately help, that's just Gamabunta's personality), he would just have to use the summoning on Sasuke himself and have a massive Bijuu size toad fall on top of Sasuke.",
            "naruto pulled his hand at the last second and scratched sasuke headband",
            "yes and no, sasuke was trying to kill him naruto wasn't just like the 2nd final battle sasuke was trying to kill him naruto wasn't.",
            "We have no way to know cos this battle never happened at all at the valley of the end",
            "Obviously not, gosh I can't believe naruto fans didn't watch the show",
            "Actually everyone lost! But not Sasuke tho, Sasuke definitely won.",
            "I think what OP is really asking is, who was stronger at this point of time.\n\nSasuke winning this clash doesnt mean he was stronger imo. Sasuke fought the whole time with the intent to kill,like sure he spared him at the very end after the fight was over but not during the fight,that was when he was trying to kill Naruto cuz itachi told him it was a way to get stronger.\n\nNaruto was trying to beat him while trying to make sure not to kill him - he was holding back. Naruto's rasengan was proven stronger than Sasuke's chidori on the rooftop but the next time they clashed (right here at the valley of the end- which was the very next day) , their attacks cancelled out, showing naruto was holding back(he even implied he was) .\n\nAnd we forget before this fight naruto had to fight kimimaro, he had to chase the sound 4 the whole day and clashed with some of them which tired him out - all while sasuke was sleeping nicely and was fresh for their fight.\n\nSasuke only surpassed naruto after using Orochimaru's cursed mark.",
            "I'd like to see you awake after being roughly fisted without consent.",
            "Also Naruto went for the headband to prove to Sasuke that he could scratch it (Sasuke said at least twice that he couldn't). And as you said refused to go through with Itachi's recommendation. In the end, both would have been able to kill each other. It is just that Naruto wanted to prove Sasuke wrong and Sasuke wanted to prove Itachi wrong.",
            "I think what OP is really asking is, who was stronger at this point of time.\n\nSasuke winning this clash doesnt mean he was stronger imo. Sasuke fought the whole time with the intent to kill,like sure he spared him at the very end after the fight was over but not during the fight,that was when he was trying to kill Naruto cuz itachi told him it was a way to get stronger.\n\nNaruto was trying to beat him while trying to make sure not to kill him - he was holding back. He possibly could’ve won if he went for Sasuke’s chest instead of his forehead which had the konoha metal headband on it.  \n  \nNaruto's rasengan was proven stronger than Sasuke's chidori on the rooftop but the next time they clashed (right here at the valley of the end- which was the very next day) , their attacks cancelled out, showing naruto was holding back(he even implied he was) .\n\nAnd we forget before this fight naruto had to fight kimimaro, he had to chase the sound 4 the whole day and clashed with some of them which tired him out - all while sasuke was sleeping nicely and was fresh for their fight.\n\nSasuke only surpassed naruto after using Orochimaru's cursed mark imo.",
            "Almost like he got some massive amp in that exact arc",
            "True 😅 Naruto smashed Sasuke on a mountain too.",
            "What does that have to do with the very clear end result? I don't care if Zoro wandered in and fed Naruto a senzu bean mid match, it was still Sasuke who was left standing.",
            "And Sasuke's sharingan evolved during the fight and he relied on both versions of the cursed seal which had just been boosted in that barrel",
            "I think what OP is really asking is, who was stronger at this point of time.  \nNaruto without Kurama vs Sasuke before using Orochimaru's cursed mark, who is stronger?\n\nSasuke winning this clash doesnt mean he was stronger imo. Sasuke fought the whole time with the intent to kill,like sure he spared him at the very end after the fight was over but not during the fight,that was when he was trying to kill Naruto cuz itachi told him it was a way to get stronger.\n\nNaruto was trying to beat him while trying to make sure not to kill him - he was holding back.He possibly could’ve won if he went for Sasuke’s chest instead of his forehead which had the konoha metal headband on it.   \n  \nNaruto's rasengan was proven stronger than Sasuke's chidori on the rooftop but the next time they clashed (right here at the valley of the end- which was the very next day) , their attacks cancelled out, showing naruto was holding back(he even implied he was) .\n\nAnd we forget before this fight naruto had to fight kimimaro, he had to chase the sound 4 the whole day and clashed with some of them which tired him out - all while sasuke was sleeping nicely and was fresh for their fight.\n\nSasuke only surpassed naruto after using Orochimaru's cursed mark imo.  \nBoth Naruto and Sasuke got free buffs but when you take them away naruto wins.",
            "But Naruto's intention was to have Sasuke come back, and Sasuke wanted to leave. Sasuke left. That means he won.",
            "Many reasons, Naruto wanted to do this by himself and most likely Gamabunta wouldn't have helped him there.\n\nIt's one thing to fight against Ichibi or Orochimaru having summoned Manda but beating up a teenager wouldn't be acceptable.\n\nHe'd most likely k-o Naruto for such disrespect lol",
            "Gamabunta would've just said \"Nah, deal with your own beef\" and left",
            "He wouldn't have helped naruto anyways,  it would've been just a waste of chakra.",
            ">Sasuke had no real answer to the Summoning Jutsu and Multi-Shadow Clone Jutsu on the scale of what Naruto did against Gaara and Mizuki.\n\nSasuke at this point is easily capable of dealing with a lot of shadow clones simultaneously, we saw him easily beat like 30 on the rooftop without his sharingan, in this fight he has a better curse mark and a 3-tomoe sharingan, those clones would not stand a chance. Gamabunta wasn't guaranteed to help him, plus Naruto doesn't want help when fighting Sasuke",
            "He was holding himself back in how he used his chakra due to curse mark didn't he?",
            "Didn't sasuke curse mark amplify his chidori and speed?",
            "Sasuke was more skilled than naruto, and just like saskue thanks to curse mark, naruto has thanks to kurama",
            "That doesn't make Naruto any less defeated though, does it?",
            "I think there are videos about that online and they just tank it.",
            "So Sasuke using Curse marks is a cheat? But Naruto using KC is not a cheat??",
            "Expecting to see Zoro and Korin traveling through fiction now",
            "I’m not sure why you got downvoted \n\nBut ppl seem to forget \n\nSaskue without the cruse mark won’t have survived\n\nSaskue eyes did evolve to 3 tome \n\nThe only thing different is saskue had fought garra who was a one tail and Almost died because he try not to relay on the mark and at that time he still haven’t been to the next stage with the sound 5 where he take certain pills 💊 and dies and comes back to life.\n\n\nSo saskue was enhanced just as much as Naruto has the 9 tails.\n\nThe only thing I can think of is saskue if he was to use genjsuto he would win tho he never used it on Naruto and he never used it on garra… \n\n\nSaskue in that fight had power ups.\n\nNaruto did not fight with the intent to kill saskue \n\nWhere saskue basically decides not to kill Naruto because that’s what his brother wants him to do and he saskue refused to kill him…\n\nWould a non curse mark saskue at that time win such a fight against Naruto 1 tail 9tails form..",
            "But Sasuke wanted to kill Naruto... and didn't. Still couldn't bring himself to do that.",
            "naruto has more chakra and his rasengan was stronger. He also showed better taiijutsu and used clones to do taijutsu combos. I think they were pretty much equal but naruto had an edge because he could last longer in a fight, Uzumaki chakra reserves shouldn't be underestimated.",
            "No is it not , and naruto holding back (sarcasmus off)",
            "A decision he was free to make... Because he won.",
            "That's why sasuke had the upper hand in taijutsu with 3 tomoe sharingan",
            "Because Naruto beat him with \"talk no justsu\"",
            "Except Naruto wanted Sasuke to come back to the village, and that very clearly didn't happen. Because, again, he lost the fight. The image of Sasuke standing over Naruto's unconscious body tells you everything you need to know about this outcome. Pretty cut and dry all things considered."
        ]
    },
    "Name something wrong with the Fourth Great Ninja War Arc.": {
        "title": "Name something wrong with the Fourth Great Ninja War Arc.",
        "score": 415,
        "url": "https://i.redd.it/67dvp1yp808d1.jpeg",
        "content": "",
        "num_comments": 261,
        "comments": [
            "Tsunade and Hashirama barely interacted. And Tobirama didn’t even acknowledge that she existed when brought up",
            "We should've seen more exhaustion / running out of chakra than we did -- big time.  Obviously people hate the power scaling, the Black Zetsu killing Madara \"ass pull,\" tagging-in Kaguya as the final boss, the Neji death that many feel lacked impact / no build-up / he could've normally defended that attack.  The size of the United Shinobi Forces didn't mesh with the quantity of ninja in the world at any other point in the story.  The fact that Pac Lee barely got any screen time during the war is unforgiveable.",
            " pacing. it some how feels like the most rushed and most drawn out arc at different points.",
            "Kakashi was just spamming kamui like he had EMS or something",
            "> Too long for a single arc\n\n> Too many fillers\n\n> Too many ass pulls from both the hero's and enemy's sides\n\n> Neji's sacrifice could have been avoided if only Hinata tried to pull Naruto away from the spikes\n\n> They tried to give Tenten a character arc 15 years too late\n\n> And to top it all off, they pardoned Sasuke, Orochimaru and Kabuto because they helped in ending the war. (Sure, that made sense.)",
            "Everybody getting a got damn nine tales chakra power up",
            "Where were the toads and the other summons?",
            "Pretty much the war itself is a problem\n\nthis is not a war but large scale skirmish battle. it only took 2 days in the universe. what kinda of war only took 2 days? lmao\n\nin war you don't want deploy all your troops at once. you need to preserve some of your troops. there also few important strategies like scouting. preparation to ambush, knows when they need to fall back, decoy, etc. but here. both parties decided to deploy all their troops at once. no one decided to fall back when they meet with serious situation.\n\nfor example when Itachi break free from edo tensei, Kabuto should know itachi will try to sabotage his plan and just cancel all edo tensei. this will stop Itachi on his track. then retreat and regroup with Obito to think the next plan. but no, he decided to stay fight pointless battle against a corpse even though he of all people should have know edo tensei is unkillable\n\nas someone who love watch war documentaries and play some RTS video game, i just laugh at how bad the planning in the war are was",
            "Edo tenseis that wouldve had more meaning\n\n- Fugaku Uchiha and an interaction with Sasuke and edo Itachi. This would have given more clarity to the tensions between the village and the uchiha. Also allow Sasuke to finally be accepted by his father.\n\n- also, other uchiha shouldve been revived to give more lore to the uchiha clan. Show the power of uchihas who are not prodigies (itachi, shisui) or anomalies (Madara, sasuke). Just fully strong basic uchihas\n\n- Sasuke should have had a fight that showed his full new abilities with the ems. That kabuto fight was mainly carried by itachi. We never saw Sasuke fully show off his new style with his new eyes.\n\n- the focus on certain support characters like omoi and samurai vs hanzo was a complete waste of time. \n\n- make it seem like a actual war. It shouldve been more gloomy. A lot of death. I mean a lot of death. Show characters running out of chakra and trying to retreat. Show the Villages fighting amongst each other as well. Gaaras speech should not be enough to quell tensions. \n\n- the hashirama flashback needed better pacing. I believe in show dont tell. Show the battles with the senju and uchiha. Show their strengths and weaknesses so we could really know how bad the warring states really were.\n\n- we needed a flashback of Madara and his family. We shouldve seen more izuna so we can understand Madaras pain better\n\n- madara individual ms abilities were never shown",
            "The sheer amount of fodder ninja",
            "Kakashi should’ve lost his mask also when he 1v1’d Obito. That would’ve been the perfect time to reveal his face to the audience and it actually hold some narrative weight, rather than being used as a silly little fan-service moment.",
            "Magically none of the uchiha got revived by kabuto",
            "The foundation never having a role after Danzo dies is BS. Danzo should have had a number 2 who would have a role in the war arc, maybe have some suspicion of the cloud, since the foundation was killing cloud Jonin with anti leaf beliefs. If they make him Hyuga, that clan can finally have some relevance, and he can have a personal grudge against the Raikage for trying to kidnap Hinata. Also, most of the kages, guy and bee should have died.",
            "The whole thing.\nBut most notably the absurd degree of coincidence that took place with the Edo matchups. You mean to tell me everyone just happened to meet an emotional connection during the war? Like Kabuto in his infinite wisdom fucking saw Sai as meaningful enough to set his brother up against him 😂? No, absolutely not.\n\nAlso the stupidity of the squad matchups is...I get having specialized squads but to have entire armies worth of people with a single expertise is beyond stupid. That's not how arrmies would be set up at all. Especially since they didn't even have Intel on Kabuto's side yet, they just knew about the zetsu clones. Why do you need an entire goddmaned taijutsu division?? Split the specialists in with everyone else.\nEdit: Kabuto should've revived/manipulated the dead bodies of fallen shinobi like he did in part one. That would've made for a much better \"they were my allies\" moment since their bodies don't regenerate",
            "1 I hated the idea that this was supposed to be a war. This joined Military Operation lasted two days. It was not a war.\n\n2 Also sure, technicaly its a large army of Ninja.. but they didnt do anything. They were mostly there to put Madara into some sort of context. \n\n3 Naruto gave a bunch of characters his chakra. But we only get to see the konoha people perform with it. And it wasnt much.\n\n4 How Kyubi is as strong as 7 other tailed beasts.\n\n5 The whole Kaguya and Zetsu crap.\n\n6 Kabuto. His Agenda remains a joke.\n\nThats of the top of my head.",
            "Kaguya really stole all of Madara's momentum and resulted in a climax that didn't feel earned.",
            "Too many people. There's no way that many ninjas existed at this point in time none of the villages could have supported that many people",
            "The war is like “ok let’s make big army vs edos and madara/obito juubi ing. Make it a war that somehow lasts less than a week compared to every other war in the series that lasts either years or generations. Make it a clusterfuck of retcons, plot holes, basically every character ever devised plus more, and make the only thing we get out of it being the ability to power scale literally everyone in the series one way or another for funzies 😁😭💀”.\n\nLike yes, all the kage are interesting characters as they are usually innately op and would have unique character, but in a show that was like 80% flashbacks at some moments, they couldn’t just develop said characters there? Or perhaps just make alternate series for fan favourites like minato, the younger sannin, early konoha, other villages (which would be good in order to both develop the world to a greater extent, and to make viewer/readership less konoha biased. Maybe some early akatsuki moments etc.",
            "It wasnt a war, it was a battle.\n\nWish we couls have seen a multi-prong land campaign by the shinobi alliance to fight through the thousands of zetsu's to reach the tree. We get to see the rookies and team 7 stepping up into leadership positions. Interactions by the new blood and old veterans who survived the past wars. We get to see army scale weapons used like the ones suna had.\n\nThe alliance manages to push the zetsu horde back until the ninja armies surround them and merge together. Ninja from rival villages who were just following kage orders begin to truly bond with their \"enemies\" as they fight to protect each other. The offensive stalls after edo tensei begin to appear and push back. The five kage join together and break the lines and smashing through past kage edo tensei, showing that the younger generation always surpasses the old.\n\nTHEN madara appears and does his thing. Cue the 2 day battle we got in canon.",
            "Power scale",
            "Naruto and Sasuke spent longer beating the snot out of each other than they spent fighting Obito and Madara and Kaguya",
            "How did the war only last 3 days ?",
            "There weren't many deaths to make this war impactful. A weird complaint, but we only saw Neji get killed along with Shikaku and Inochi. It would have made the war dramatic if more characters kicked the bucket.",
            "Power scaling all over the place, lack of exhaustion, the fact it took place over a span of 2 days, Neji dying despite his character having no development or relevance since his last appearance hundreds of episodes prior. As much as I love Naruto, the war arc feels like it was a mad dash to end the story.",
            "Almost everything that involves Madara. He himself is a cool character, but he is covered in bullshit energy.",
            "I looked up how long the 4th great ninja war was two days 💀💀",
            "Powercreep.",
            "Very rushed",
            "Everything really. There needed to be more time for character development. Also Neji dying I swear was to just to piss people off. Lol",
            "The fact that a WORLD WAR lasted for only 3 days. It didn't even feel like a war more like a large scale battle ",
            "The escalati g Power Levels\n\n\nSasukes Goals and Motivation Change too much too fast making IT feel forced",
            "When everything the alliance ever tried any attack *togheter* as a well coordinated *team* with a great leader, every time it failed miserably, only for them to be saved by **one particular godly-strong guy**\n\nIt kinda goes against it’s core theam of bonding, team work and collaboration 💀 I always hated that, dunno what Kishimoto was thinking. I understand he had to show how strong the bad guys were, but at least one strategy could’ve worked? AT LEAST ONE?",
            "some the worse filler in the series",
            "The moment Naruto joined in, everyone fighting that war became irrelevant and it became “asspull galore” with a handful of characters.",
            "It's too short in universe\n\nIt should've been like a month long process of Kabuto slowly reviving groups of Fighters, some of the zetsu infiltration, and then the final fight with obito and madara \n\nBecause as is its just like 2-3 days",
            "You can't do a war on several battlefields in, what, was it three days? Every other Naruto arc, it takes time for the ninja to travel. And armies in general move slower than a small team (that's the value of a small team) because they can't move much faster than their slowest members. \n\nSo in my mind, Kishimoto simply doesn't *show* the travel time, for the sake of pacing.",
            "Flashbacks (yes, still a problem in the manga version)",
            "Pacing",
            "Way too fucking long",
            "Too short. Not enough people died.",
            "Kaguya",
            "It dragged itself way past it's welcome.",
            "Happened in like 2 days which is just weird",
            "Still cool anime",
            "way too fucking long",
            "THE FUCKING PACE",
            "Neji got killed by a projectile",
            "The Fourth Great Ninja War Arc.",
            "Neji",
            "I got a lot of problems with the arc, but Obito’s character might be Kishi’s best work and Madara’s appearance was absolutely menacing in the perfect way\n\nEdit: idk how I read this in the opposite way. \n\nThe biggest problem is probably Kaguya. But I still can’t wrap my mind around the war plans and even if some of the reincarnation fights are cool, they feel ultimately like we’re killing time until the arc actually starts. \n\nKankuro talking about the vanguard fight swinging the direction of the war. Being like “we gotta protect the feudal lords. We’ve always cared about them”. \n\nSplitting the army up into a long range, short range, medium range, support, and medic team mixed up the villages well, but other than the medics, that ultimately didn’t matter much. \n\nAnd this all comes from obito’s declaration of war. He declared war when he had kisame (who was basically already on a long term mission), sasuke’s team (maybe), and zetsu. He was really banking on Kabuto to come through with basically every single famous person in history or else it would have been zetsu army. \n\nAnd ultimately, that Naruto Bee Kakashi guy vs óbito fight looks really different without madara or the jinchuriki’s",
            "It should’ve lasted longer than 2 days. As it stands, it’s a revolt, not a war",
            "Neji's death being pointless and forced\n\nThe whole show just becoming \"Who has the bigger Nuke\"\n\nNone of the 5 Kage dying, they literally got crushed by Madara.\n\nApparently everyone had unlimited Chakra.\n\nThat Black Zetsu bullshit \n\nObito's spirit literally inhabits Kakashi's body and makes him hundreds of times stronger \n\nObito becomes good again despite all the shit he has done, if his willpower and dedication to his cause were that brittle then he shouldn't have become a Villain at all.",
            "Neji dies, side characters really had a chance to shine but didn't get any real meaningful power buffs outside of Shino.. but even that was just rolled through casually.",
            "That entire sequence in the ocean shore is honestly very skippable \n\nYou just need to know “oh yeah Kabuto revived the other nine tails Jinchurikki”\n\nAnd there’s also how inconsistent in quality that entire climax is",
            "Neji died for what reason did we need to kill him off",
            "Neji dying was unnecessary and ZETSU fisting",
            "I have a whole list of things but it's somewhere in my old account years ago lol. To put it simply - it could have been way better if dome properly.",
            "Black Zetsu",
            "Name something right",
            "Fillers,Nejis death.",
            "That fact that half of it was filler",
            "Naruto and Sasuke keeping the same power/stamina even though they fought the most powerful Shinobi to ever exist",
            "Honestly the reanimation allows us to settle a lot of storylines but at the same time I hate it because the kages are literally telling you how to defeat them. \n\nJust not as enjoyable",
            "to much filler",
            "It wasn’t long enough",
            "For some reason, a United Shinobi Forces vs a few people seemed kinda funny to me. They could have removed the United Shinobi Forces and just had a few characters from each nation make a United Strike Force to fight them. Then slowly have them each die to make it insanely more impactful. Or even just to have a few countries worth of armies on Madara and Obitos side alongside the Zetsu. So Mercenaries, Rogue Shinobi, Other Countries joining in and attacking them (Such as the ones from the West: Sky, Demons, Night, Volcanoes, etc), Criminal Organizations, etc. Having an actual 4th Great Shinobi War between West and East.\n\nAlso to have a build where the jinchuriki of each country is finding their own way away from their own countries since the beginning of Shippuden. Then all 7 unite for the war and kick ass.\n\nSidenote 1: \n\nI would also change initial Naruto show to still focus on Naruto of course but give development to Sakura, Ino, TenTen, and others that needed it. Along with have a sub series to introduce all of the jinchuriki in Original Naruto Timeline but have it where they are all doing their own things and none of them are in contact with Naruto. That way we can get to know each of them all and where they are from/ who they know. To give a better idea of how each will either aid or get in each other's way during Naruto Shippuden until the end.\n\nSidenote 2:\n\nFor Boruto, I would have had the show take place in missions where they are sent to the Western Countries Post-War (Since they have trains, etc) and that would allow for the Universe to be expanded on so much more in new ways since we haven't really been there much. New allies, enemies, etc since the West wouldn't be fully civilized yet/ haven't gotten over the 4th Shinobi War. Then for Otsutsuki instead of having them be from space just have their whole society living underground pulling all the strings and slowly reveal them to be beings that enjoy toying with those they perceive to be weaker than them. An invisible eye causing havoc and mayhem for thousands of years. Also, have them blind from living underground for so long. With Hinata, her clan, etc unveiling their lineage with Otsutsuki and the power they possess. Something I wish we saw in any point of regular Naruto or Naruto Shippuden was having Naruto and Hinata kick ass together\n\nSidenote 3:\n\nThis next idea way more so for a Fan-Made Manga/ Show. Just to humor the space thing and taking place a few generations ahead of Boruto. It would be interesting if they have space travel via jutsu and technology. Have them discover other planets, dimensions, & species who can also use jutsu and other new things to expand on jutsu & chakra overall in all kinds of new ways. Calling the show Faruto or something as it's going to be the farthest it can get for travel. Sure it won't resonate with many of ya but how I'm envisioning it would be something people would really enjoy when done well.\n\nBattles taking place on asteroids or outside spaceships while Wall-Walking and fighting in Zero-G would be a unique twist. New forms of chakra usage aside from Genjutsu, Ninjutsu, Taijustu, and all the eye forms would be sick too! Maybe even a species that has 4 arms and is able to conduct 2 jutsu at the same time or even make a much more complicated one that we haven't seen before due to that (Kinda like how Naruto used a shadow clone when he first making rasengans). Other forms using the ears, touch, smell, etc enhanced by chakra. Exploring other forms that are different from Rasengans, Chidori, Lightning Blade, those are just 3. But most likely there are way more than those!! And so much more that can be done.\n\nDamnit I want to make all 4 of those now. So much can be done to improve each idea",
            "Can we put the bs aside and all agree Neji's death there was no need to do him dirty like that",
            "Everyone has the exact same clothing in the super army",
            "It should never have been white Zetsus.\nIt should have been summons that the regular folk had to deal with (apart from the revived kages/enemies).",
            "Madara dying.",
            "The bs with zetsu taking out Madara. Which then led to Kaguya's introduction feeling very rushed.",
            "Fillers were rough",
            "Everything",
            "I mean, elephant in the Room, Pacing. This arc is nearly 1/3rd of the manga. It's insane how long this arc took. (From chapter 516 to chapter 700) That's without taking into account that before the start of the War, there was another arc leading up to it. \n\nNtm, this arc is only 48 hours long. Like, it's a war. A WAR, war's are like weeks, months. We should have seen far more of platoons just, sitting in place, resting. More of our MC's getting tired, trying to hide. More tactics, more of things that I expect too see. Instead the majority of the war is a bunch of 1v1's or people getting ressurected, which is cool don't get me wrong but A LOT of this arc seems like padding for run-time as a result. It get's really boring. \n\nThen there's the powerscaling, and, like, i don't care much about it but holy hell does this arc crank up the power scaling to 11 all of a sudden. Boruto's power scaling is bad, but it's because THIS arc started it lol \n\nTLDR: Despite it's sheer length, a lot of the arc feels like unnecessary padding and we didn't really get to see much of what we expect to see for a \"War.\".",
            "People died",
            "neji dying",
            "Kaguya was definitely an ass pull, more people should have died permanently and that includes Guy (sorry, but imagine if the thumbs up was his final exit)",
            "The amount of people that they first had",
            "More named characters should have died. \n\nLike, who even died? The original inoshikacho and Neji? Obito? Is that all?",
            "Reanimation Jutsu is cracked. Didn't make any sense that Kabuto could control all the immortal zombies with infinite chakra because he got Anko? Early in the jutsu he has to retreat, knowing he didn't have enough chakra to win with the mist swordsman, but somehow has infinite chakra for the fight with Itachi/Sasuke.",
            "Not sure if it’s something wrong more of an overlooking per say, that moment when Shikaku died and Choji went to say something to Shikamaru and he completely shakes it off. I already had respect for him but my god that dude is such an elite shinobi",
            "Lowkey I felt like it was farming for interactions lol",
            "Neji’s weak ass death",
            "Neji’s death, Might Guy not dying, how Black Zetsu/Kaguya just appeared (we should have gotten more hints or something, the impossible number of Shinobi just to show off how strong Madara was, the Madara cop-out death, and the fact that it was only 2 days all come to mind.",
            "Sakura is supposed to catch up to Naruto and Sasuke, but it doesn't really feel like that because she immediately plays the medic ninja role. We should have gotten her fighting alongside them more before side lining her, or just say she is skilled enough to heal everyone and fight at the same time.",
            "Removing the white zetsus and moving the entire Shinobi alliance against Obito with Jubbi. \n\nI seriously don’t understand this decision, why would Kishi bring the fodder army as support when not only are they literal useless fodders, Naruto had to bend over backwards and work overtime to protect them. Keep them busy with white zetsus and only move key players by Naruto’s side, so that these people can actually assist Naruto",
            "Naruto's classmates all needed a major fight",
            "One word. Filler.",
            "Guy sensei getting bailed out by naruto a la deus ex machina.",
            "There's a ninja clan that uses dogs\n\nOnly one dog in the war",
            "That the war only took 2 days",
            "Other than the fact that it happened at all, I would say that edo tensei is extremely overused. It's one thing to bring back important characters with a few loose ends like itachi or even using it to bring back the big bad overpowered boss. But using it to bring back a bunch of dead guys that have never been hinted at from villages that aren't explored at all is really dumb.",
            "The overuse of naruto",
            "How tsunade's boobs didn't spill out of her torn clothes",
            "Neji’s death",
            "Neji dying.",
            "everything after Madara died and nejis random death after not being in the story at all leading up to it. both had zero impact for me. Also sakuras \"finally I caught up to them\" moment being instantly overshadowed",
            "pacing and kaguya",
            "It was way longer than it needed to be",
            "The whole black zetsu asspull\n\nOne of the worst things I've ever seen in my life",
            "Mostly long and boring. And some moments who look out of context",
            "The way it ended was not it. I did NOT like the way they killed madara. I think kaguya was just thrown into the story. And there is way too much filler in between canon episodes.",
            "The annoying one is sheer incompetence from obito on the final plan\n\nOh the tree can be activated with just partial biju not needing the full thing?, so what was this war about again?   Once kabuto rolls up with the gold/silver twins, who have that chakra, grab them, kamui to the other side of the globe, and do your main plan there while kabuto and white zetsu pretend the war is still on, heck, tell him to save Madera for later, so he's not resurrected for any of this if you plan on betraying him",
            "Too many ideas happening at once with no breathing time. I have seen the final battle about 3 times and I always forget half the things that happen",
            "Gai is alive / Neji's death was executed poorly / Sasuke's character arc while good felt rush/ Kaguya was introduced poorly / Sakura's developpment went to trash as soon as Naruto and Sasuke became demi-gods / this reincarnation thing is terrible even if I understand what Kishimoto had in mind which makes it a little redeemable",
            "Boring af. An excuse to reuse character designs with a disappointing finale by introducing a character out of nowhere as the final boss who can't even talk and somehow is behind everything...",
            "Forth great ninja war arc",
            "Author should have jave just taken a break and come back",
            "Too many characters",
            "Hinata in the back:  N- Naruto-kunn",
            "It exists.",
            "It was dumb the war lasting two days. \n\nI couldnt take the threat of a zetsu army seriously, because only the fodder we’re getting killee by them  \n\n\nNo real large scale tactics just thousands of shinobi doing the naruto run in one large group in one direction",
            "Filler.  Could have done woth just madara as am enemy. Betrayal by black zetsu seemed a bit much. Though if is good that zetsu's forms were explained.",
            "Sasuke survived/got away with no real punishment post war, orochimaru was revived, neji died, and so many other things",
            "Neji died",
            "Nothing so far",
            "200episodes 2 days",
            "It went to long.\n\nAbsurd power escalation that never knew when to stop.\n\nObito not being the final villain.\n\nMadara in general with the amount of powers he's handed by Kishi that makes strategies against him end up amounting to nothing and never shutting up about how \"awesome\" he is that feels grating. \n\nThe convoluted explanation about Uchiha clan's genetics in regards to \"Curse of Hatred\" that feels childish and can be adequately explained via Sharingan storing memories hard into the brain. \n\nItachi shilling. \n\nSasuke being forgiven too easily that makes his actions and behavior feel completely pointless.\n\nReincarnations that feels needlessly shoehorned into the series, has little development in how it works and exists just to exalt Naruto as a messiah who \"ended Curse of Hatred\" that feels forced, contrived and irritatingly preachy that has become a major writing problem for his character.\n\nAnd lastly Kaguya Otsutsuki and saying how much of the conflict and \"Curse of Hatred\" is entirely due to her and Black Zetsu's actions that renders the whole thing absolutely contrived and makes the narrative of Naruto \"ending\" it feel completely shallow due to the whole thing being artificial.\n\nSeriously though the show's writing absolutely tanked during the Fourth Great Ninja War arc and left many people like me who were fans of the series with a very strong sour taste of this, although the series did have decline in writing during Part 2 so it's not entirely new, it just ended up reaching extreme lows not seen before.",
            "No stakes, no relevant casualities besides Neji, the whole thing doesn't make much sense. The number of Shinobi and white Zetsu mentioned is absurd. And I'm not even gonna start about the ending.",
            "literally most of the things.",
            "Kaguya's existence.",
            "Kaguya",
            "Talk no jutsu didn't work.",
            "Neji’s death",
            "Kaguya",
            "Too long",
            "Yall are all bitches mannn if you don't like the fucking show don't watch it",
            "Way too many ninjas involved given the size of the nations",
            "Too goddamn long. There’s no, and I mean *no* justification for that shit. I went into the series knowing I wasn’t going to watch the whole thing. I didn’t,  and I don’t plan to.",
            "Neji dying \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nChange my mind",
            "Could the heroes have accomplished the same result if they just let all the fodder ninja stay home and only the ninja close to kage level come to the fight?\n\nSeems like a lot of unneccesary death.",
            "The repeated \"OK, it's finally over\", only to have yet another antagonist or power level come out of nowhere.",
            "Not enough death",
            "It’s easier to list what wasn’t wrong with the arc than the other way around… sadly",
            "Let's start with what isn't wrong with the Fourth Great Ninja War",
            "It lasted too long.",
            "The first half",
            "Not enough jutsu animated in, just lots of ninja running into the meat grinder without using any abilities was just painful to watch and dumb. \nReincarnating a ton of ninja but mostly only ones that were relevant to the main storyline was meh also.",
            "i wish obitos rinne rebirth brought back all the edos",
            "I hate that they used their low budget artists to draw most of it.",
            "The fourth great ninja war arc.",
            "Only one thing? \n\nIt’s over 200 episodes long, yet people only talk positively about the first ~256 episodes of Shippuden. \n\nYou tell me.",
            "Should have been like a week long instead of 2 days \n\nChakra exhaustion \n\nSome more impactful deaths , I mean we are talking about the greatest war in the history of Shinobi world atleast show some deaths \n\nNeji's death wasn't necessary for the story. he would have been better as a instructor in future , teaching peoples about his mistakes (you don't have to be born with talent in order to become a strong Shinobi and you are not bound by fate and stuff like that because he used to think that lee can never become strong without ninjutsu)\n\nHinata should have died but after her confession\n\nSakura should have died \n\nTsunade should have died \n\nRaikage also should have died while protecting Naruto and he should have said something like he trusts Naruto to win the war (because he didn't trust Naruto at all first time they met)\n\nOther tsuchi and mizu kage should have been beyond saving till orochimaru arrived to heal them \n\n(Kages were already old enough and they already had their successors)\n\nSasuke should get atleast 20 years in prison \n\n\n\n\nIk a lot of peoples will hate these changes because most of Naruto fans like \"fairy tales\" but there is no way you can fight a war without literally any casualties \n\n\n\n\n\nThere are a lot of things like \n\n\nFix zetsu stuff and I literally wanna rewrite whole war but ik no one is gonna read that so I won't",
            "Not enough death",
            "the till this day neji had the perfect move setup to defend the attack he died to yet he decides to use his own body as a meat shield. it still baffles me to this day. Even naruto would’ve thought to shadow clone it or something.",
            "Filler",
            "The whole resurrection thing killed any respect I had for the series. It made all the character development cheapened. Yes, Kishimoto, we get Gaara has changed. No, we don't need to hear Asuna say he's proud of Ino,Shika, and Choji. And really? This is the seven swordsman of the mist? In reality they should've resurrected a few and not just \"oh, this will cause emotional damage\" characters. Hell, in the end, they even figured out that the \"emotional\" shit undid the zombies anyways so why was it a thing in the first place!",
            "The Divine Tree is just the Ten-Tails. So how the fuck did Madara become the Jinchuuriki of the Ten-Tails while the Divine Tree was just standing there around?",
            "I mean.....",
            "Not much. Overall, it is the best arc in Naruto. ",
            "Where do i start...",
            "Black Zetsu",
            "Shinos beetles could have been a war winning weapon fr, but let's ignore him like the writers did.",
            "Madara forced to fight these maggots",
            "No 3 way between naruto hinata and road to ninja hinata",
            "Hell Sasuke never even asked Minato a question. Orochimaru told the hokages that he brought them all back because Sasuke wanted to ask them questions but he totally ignores the fourth.",
            "Wish we saw an interaction both are similar but very different",
            "Neji's death to me was just fucking awfully made for multiple reasons. You can tell what it was TRYING to be, but it was clearly rushed. Neji needed more presence before it happened, we hadn't been given a reason to give af about Neji in literally YEARS and the way he died itself should've been done differently ofc.\n\n\"I don't have time to do rotation\" Seriously? You have time to jump at it and block it, but not do rotation/kaiten? So let me get this straight you're faster at fucking jumping like 30m in the air, than doing kaiten often hailed as \"the ultimate defense\" especially against projectiles?? The spikes were shot before he even jumped, and were still less than a quarter of the way towards him when he made it up... And you had time to turn around and block the spikes with your back, but you couldn't fucking hit the things? And you couldn't use an air palm to blow them away instead of even jumping in the first place?? Whatever bro fine die who cares we'll see you probably more than before (AKA pretty much not at all since the 1st arc) through flashbacks now.",
            "Agree with all of this. The size of the army didn't make any sense. Assuming the other ninja villages were about the size as the leaf village....then it seemed like a couple hundred ninja per land? That should put the total number of shinobi in the world at like 1k or so? \n\nHowever, the war arc is still 🔥🔥. Some of my favorire battles in all of anime",
            "Chakra reserves just ceased to exist and everyone was spamming S-rank jutsus like it was just regular Ki blasts.\n\nRemember when Rasenshuriken was such a powerful jutsu that Naruto needed Sage Mode to utilize it properly and using it twice drained all energy used for Sage Mode and Sasuke's jutsu Kirin drained a lot of his chakra due to how powerful it was?",
            "This ☝️💯",
            "I used to hate the way they killed off Neji but after a rewatch I noticed it’s a parallel to the way his father died by freedom of choice taking fate into his own hands",
            "We saw plenty of people running out of chakra/stamina lmao",
            "i though tit was common knowledge that a lot of ninja stayed behind in respective villages to protect the citizens",
            "Nah, overall it had enough exhaustion. Literally, people were drained during the fight and had to use Naruto's chakra who also kept losing chakra too.\n\n\nNeji should have died back in P1. His character was done back then. \n\n\nNah, power scaling was just fine. Ot was gradual and took time. ",
            "Absolutely.\n\nThey rushed all the power and jutsu capability they could have started on before rasen shuriken because it was dry for Naruto before that jutsu wise and then dumped a billion jutsus at the last minute.",
            "The talking was always more than needed. \n\nThey would repeat the same points 3-5 times to the point that you’re screaming at your screen",
            "Yep, it was totally rushed.  Honestly should've lasted 600 episodes.",
            "Nah, it was paced just fine",
            "He only used it like 4 times before getting a massive chakra boost from Naruto and Kurama. He then lost Kamui and didn’t use it until he got DMS Six Paths asspull out of nowhere",
            "He has one Mangekyo Sharingan, and has only used kamui maybe a 12x total why he be experiencing blindness?",
            "Actually curious when was the last time you watched Naruto? And did you watch the anime itself?\n\nCuz the way you speak is clearly based on your memory but your memory is wildly different than what it was",
            "The fillers were ridiculous. Like I’m sorry to anyone who feels different but I wasn’t on the edge of my seat for the kinkaku and ginkaku fight against darui and some others.\n\nIt doesn’t even feel like an arc just episode vomit",
            "It's funny because I think I remember Gamakichi (forgot his name, Gamabunta's son I believe) saying \"dad is busy\" \n\nBusy doing what? The world is on the line lmao",
            "They are safe and happy. Not used for war anymore hopefully",
            "This and also the fact that the shinobi alliance lost half their numbers in the first day. This is some next level military incompetence, and the leaders of thr divisions were, a kage, the equivalent of a kage for a smaller nation, 2 guys that became kage and a random dude. I'm sorry but how the fuck noone talk about the fact that kakashi lost 8000 shinobi in 1 day and like a month later was named hokage.",
            "Obito deployed all the forces at once in order to force out the jinchuriki, he wanted to divide their resources as much as possible since his main goal was not to win the war but to capture the tailed beasts. The allied forces were forced to follow suit to avoid being overwhelmed. His training is as a ninja not a military general, \"strike fast, strike hard\" makes sense in that capacity.\n\nKabuto believes himself unkillable too, and itachi using izanami proves that to be true. Kabuto was unaware of the bs hax available to itachi so allowed itachi to come to him and try out his new abilities while still contributing to the war, ending all the edos without warning would have been catastrophic to their side, and obito would not have appreciated kabuto taking so many zetsus just to kill them all himself because he was scared of itachi. Kabuto planned to just toy with itachi until obito completed his objective and maybe reattain control.",
            "war has taken less than 2 days in the past lol",
            "\"What kinda war lasts only 2 days\"\n\nTo be fair, in this war, every general and leader of their respective villages/countries all participated in the war and they all could blow massive fireballs, fire dragons, space time eradication, space time magic, time control, mind control, medical healing, revival and lightning control all day by that point - its hard to compare that to our real life where wars are only participated by the troopers and none of the leaders actually fight",
            "The shortest war in history was in between 38 and 45 minutes",
            "What kind of war only took two days? Marineford’s a few hours.",
            "Good points \n\n\n>Also allow Sasuke to finally be accepted by his father.\n\nBut didn't Fugaku acknowledge Sasuke already? Or was that an anime only moment?",
            "Everything but the Hashirama flashback. It was interesting but super boring.",
            "I agree with everything except the Omoi/Mifune fight being a waste of time. Everybody in the Akatsuki was defeated by Leaf Ninja, goddangit. Let other villages have their time to shine. It's good worldbuilding.",
            "would have also been cool if more uchiha as well as senju were brought back and they fought together as well",
            "Especially against the 10 tails. Shukaku's plan literally did nothing.\n\nThey came together for no reason",
            "I think the counter to this is that Kakashi's face doesn't actually have any narrative weight, and is just a face.",
            "Exactly.  Except for Itachi.  And Madara.",
            "The fact that I've mever thought about that... \n\nHe managed to revive people who probably died before he was even born (the twins who killed Tobirama) but couldn't get us a few Uchihas?",
            "He'd have to go to the leaf and collect DNA from their corpses, the Leaf probably would recognize him the moment he entered the village.",
            "And that was a waste. We needed more uchihas to give us a more perspective of how the clan was.",
            "Kabuto does say he’ll let some edo tensei have their awareness so he can emotionally fuck with some of the other ninja so I think part of that was very intentional",
            "Also things like Tsunade moving shinobi to different divisions and setting them up different than originally intended during the war planning. Like... why not place them in the same division to begin with, if you want them to fight together?\n\nFor example Ino-shika-cho were originally on different divisions, and on a different setting, and Tsunade joined them together as an emergency and sent them off to fight Ginkaku/Kinkaku and edo-Asuma.\n\nIf they switched around every single troop on a whim, this would soon make things very chaotic, however in the story it's presented as a good thing.",
            "The whole point of 3/4 man squads was to maximize their strengths and cover each others weaknesses 😂.  It’s funny now that you mention it. Now that I think about it, what good is a sensory unit for. The war arc just wasn’t very planned out",
            "Don't worry, it's just 1/2 of the kyubi that is as strong as 7 other tailed beasts",
            "Can you explain a bit more?",
            "Every 5 seconds it's like sure, he can do that too because why not, fuck it lets give him so many things we forget to even give him unique ms abilities, perhaps one of them can be the ability to cancel edo tensai, but not really cancel it, just keep full control of the immortal body that now can never be canceled lol",
            "For someone who wants to bring peace to the world through endless calming dreams, he sure does seem to love killing people and getting excited about how many deaths he is about to cause. \n\nIsn’t being infatuated with war and the art of shinobi the same thing he is constantly preaching against? \n\nI like Madara a lot but his talk about perpetual hatred in the world is bull, he even says during the war that he enjoys getting revenge on Tobirama for killing Izuna. He makes no effort to stop his feelings of hatred that he constantly berates the world for",
            "Ikr? 💀",
            "The hashirama flashback i would see as a exception. But they rushed that one",
            "Anime tone is werid. Just look at the HxH Ant Arc. They were at those stairs forever but in reality it was like 15 minutes",
            "Obito became good again because once he saw Kaguya he realized he was getting played and did all that for nothing",
            "Neji's death and Obito becoming good again is linked to Naruto being Kid Obito. Kakashi and Obito both point out how Naruto is just like how Obito was as a kid. Neji's death was supposed to do to Naruto what it did to Obito, open him up to the darkness of the world and it did, but unlike Obito who succumbed to that darkness, Naruto pushed on by realizing Neji lived on within him, Hinata, and others. After seeing Naruto not succumbing to the same darkness that he did, Obito starts to question if joining Madara was the right choice and eventually thinks about what could have been if he hadn't joined Madara and become nihilistic.\n\nNaruto reminded Obito of who he was and made him question what could have been, that's why Neji's death is important and why he became good again.",
            "So Naruto could face the same darkness that Obito did with Rin's death and overcome it.",
            "Neji dying is Naruto's versions of Rin's death, but unlike Obito, Naruto succumb to the darkness. It's one of the reasons why Obito becomes good again, he sees Naruto as his old self and is pushing him to turn but he never does, causing Obito to question and regret joining Madara.",
            "Neji's death is Naruto's version of Rin's death. It is very important to his character. I'll agree I wish Neji had a little more screen time to make it feel more impactful and what not, but Neji's death is necessary.",
            "That leads into a better question, how did Obito create the God Tree while still being a Jinchuriki? Either Obito split his Ten-Tails or he created a new one.",
            "His beetles were super OP. I'm surprised he's not in Boruto utilizing  these insects to protect the Leaf. He really could have shut that war down. \n\n[Shinos Strongest Justus ](https://www.cbr.com/naruto-strongest-shino-aburame-jutsu/#:~:text=The%20Parasitic%20Giant%20Beetle%20Infestation%20Jutsu%20is%20one%20of%20Konohagakure's,cause%20their%20body%20to%20explode.)",
            "To be fair the fourth didn't have much to add, even he admits that died before he could do anything.",
            "Yeah. I want to see her reaction to Hashirama asking whether the village was ok under her rule",
            "Neji had to be silenced due to what's gonna happen later... T_T A blast from the past, a whistleblower :(",
            "Nah, you failures just don't pay attention. The reason he didn't have time to do rotation was because the rod was going towards Hinata. He didn't have time to stop ot. Simple, the anime slowed it down for the viewer, but you people just lack the ability to pay attention ",
            "The sand and the leaf lost a significant number of ninja when they fought each other, and then the leaf lost a bunch more to orochimarus forces and then even more dealing with most of the akatsuki by themselves. The leaf takes out over half of the akatsuki with no support besides the sand sending an old lady to rescue their own kage. When tsunade first takes over as hokage she makes a huge deal about not having enough soldiers to fend off an invasion, hence why shikamaru has to take a bunch of genin to retrieve sasuke. 3 years is not enough time to offset that amount of losses. The other villages outnumbering the leaf and sand makes complete sense during the war.",
            "Nah bc remember the third ninja war they sent 1k stone ninja and minato had to assist with that so a platoon of 10k is a decent size but i expected more and more important figures to be in critical conditions like giy",
            ">and Sasuke's jutsu Kirin drained a lot of his chakra due to how powerful it was?\n\nI could be wrong but doesn't Kirin require no Chakra, just manipulation of the lightning from the user ? That's what I remember from when Sasuke explained it for the 1st time.",
            "Damn bro u really all over this post starting every reply with “nah” like buddy these are peoples opinions, just because you disagree does not make them wrong, it means your opinion is different from theirs. Just post your opinion and be done with it, there’s no need to scan thru all the comments and respond to each one with your own opinion specifically",
            "no it should have been fewer or the same ammount of episodes with less fluff. like i said it felt both rushed and drawn out at different points due to the pacing, this is because there were times where fights were completely cut  which made the arc feel somewhat rushed such as the fight between kakashis unit and mangetsu whilst other fights lasted way to long or simply did not need to exist such as the fight between deidara, kabuto, and the tsuchikage which did not need to exist and the final battle between the allied shinobi force and madara, obito, tentails, and kaguya which was way to long. it was a pacing issue not a length issue.",
            "Is this satire?",
            "which is why its the longest arc by a mile yet still did not have enough time to include fights that their was a lead up to such as the one between kakashis unit and mangetsu.",
            "The thing that bothered me was that the manga ended and yet they were still adding filler to the final arc.",
            "Also they can choose who wants to be summoned? I remember that it takes Chakra to perform summoning but I don't remember if it takes time or if they want to be summoned.",
            "\"Busy doing what?\"\n\nGamakichi's mom- (I had to.)",
            "they’re frogs who cares",
            "And after lost half of it's troops in single day you think the shinobi alliance will revise their strategy and use different approach? instead they using the same exact strategy the next day lol",
            "There was no time to plan an actual war strategy, the zetsu disguises were undetectable by even the most skilled ninja, the edo tensei kabuto had access to were much stronger than the average ninja. Thats like arguing that some random dude with a sword should have just knocked the bomber plane out of the sky before it dropped the bomb. Most ninja have no way to defend themselves against the level of attacks that were being thrown around by the reanimated kage level fighters.",
            "I mean….. the war only lasted like 2 days.",
            "Your last paragraph forms a very smooth curve on the right hand side. I'm laying here in the dark thinking I've got my thumb over my screen.",
            "Game of thrones war for dawn lasted 30 mins",
            "Your right he did acknowledged sasuke",
            "He did, when he saw Sasuke’s fireball. Sas doesn’t have a problem with his family, or acceptance from his father. First it was Itachi for killing them, then at Konoha for allowing / forcing Itachi to kill them.",
            "It's hard out here for a gravedigger",
            "The more you think about Edo Tensei, the less it makes sense lol. ",
            "Orochimaru didn´t give a shit about the clan until he met Itachi. They didn´t do anything impressive when he lived in the village, which is multiple decades.",
            "I mean sure but it's still obnoxiously coincidental. And I mean having their emotions just adds to the weirdness of fighting a zombie you want to feel human so your enemy is reluctant. HAVING ALL of them match up with people they fought in life is just meh writing in my opinion. Like if he revived jiraiya absolutely send him against leaf shinobi and Naruto. Sai meeting his brother ...first of all Sai's brother being revived in the first place is a stretch, having him fight Sai directly...no\n\n\nAlso also, (yeah this is a mini rant now )I just realized Kabuto can literally use dead bodies like we saw in part one and probably to a much greater effect in sage mode. THAT would've been the perfect jutsu for all the emotional crap in the war. Granted more named characters would've needed to die for it to hit hard but still",
            "Thanks for reminding me. The other half was somehow revived in the vessel it had for 12 seconds, with a technique where chakra regenerates limitless, wich is never made use of by the good guys.",
            "Pretty soon after the arc starts, the 99% of the army that were jonin or lower were useless. eventually, even the kages were useless versus the antagonists who were literal gods",
            "Minato was buffed up to the absurdity but he pale in comparation with tobirama.\n\nIm supossed to believe that somehow sasuke Is relative to naruto.\n\nThe power of the bijuus are a joke",
            "Or when they were in the same area in he 4th war especially when she was speaking with Hashirama",
            "Neji was supposed to die in the sasuke retrieval arc. That's why he had next to zero screentime after this. And kishimoto saw an opportunity and took him out. That's the reality of it. Though I think it would have been interesting and gave hinata a better character/made for an interesting plot in boruto if he was still sound. But I digress.",
            "Fucking kick Hinata and Naruto in the dome and push them away from the spike",
            "While i agree with the sentiment that his inner thoughts work at instant speed much like talking in anime does all the time, i still think there are several issues with how his death played out.\n\n1. He has the ability to launch an air blast to knock the projectile away instead of jumping in front of it so its a stupid move from an otherwise smart person.\n\n2. Him dying to save hinata defeats the whole point of his character arc in part 1. He was supposed to have thrown away destiny when he was defeated by naruto, then he still dies defending the main family and naruto is actually the son of the 4th hokage and the reincarnation of ninja jesus destined for greatness the whole time. The war arc completely spits on nejis whole development as a character and proves the narcissistic condescending asshole he used to be right.\n\nThe fact that neji chooses to defend hinata because he wants to and not because of family bs is irrelevant to the fact that his initial argument of destiny is proven true, he just didnt know that naruto was destined for greatness from the beginning.",
            "Lol I like how you're calling people \"failures\" who \"just don't pay attention\" (Nice way to have a discussion about anime btw, dork xD) even though you apparently can't read past a couple of sentences. I understand though, it got you fired up so you had to reply before you could even finish reading right?",
            "It doesn't make sense when you consider how many shinobi participate in the chunin exams and how many chunin receive promotions in any given exam.  The Leaf had 1 whole promotion?  And there was repeated remarks that the amount of ninja who made it through round 1 and round 2 were excessive and this was the first time they needed a pre-lim round 3 in 5 years.  The Leaf got 1 promotion, the Sand got 3, and none of the other 4 villages had ANY.  And the chunin exam isn't held every 6 months like clockwork, because we see numerous occurrences where it gets skipped for spans like 2 or 2.5 years.  So, in a 30 year span (e.g. ninjas aged between 16 and 46), they're probably promoting about 150 chunins across all of the villages who participated.  And of those 150, probably about 75 or 90 of them are gonna die on missions before they reach 30 years old (that's not even including Konoha Crush).  So all of those villages -- Grass, Rain, Leaf, Sand, etc. they all collectively only have something like 60 surviving chunin or higher.  I imagine almost anyone allowed to fight in the Great Shinobi Alliance were chunin or higher, aside from specific freak genin like Naruto; e.g. it's probably 75,000 chunin and 5,000 genin.  So then the other villages who didn't participate in the Leaf exam, like the Cloud and Stone, they're contributing about 74,940 of the 75,000 chunin+.  If the Leaf and Sand were that much smaller than the Cloud, Stone, and Mist; then they wouldn't be great nations at all.\n\nOr you might think the Shinobi Alliance was consisted of mostly genin.  So that's about 60 chunin+ from the Leaf / Sand / Waterfall / Grass / Rain, maybe another 100 from the Stone / Cloud / Mist / other minor villages (figuring they're about in proportion to the Sand and Leaf), and that leaves 79,840 genin.  So is it your theory that only 0.2% of all shinobi are chunin+?  I'm pretty confident that most ninjas inevitably make it to chunin by the time they're 17-18.  So I doubt that the proportion of ninja who are chunin+ is as low as 0.2%.\n\nNo, the numbers truly don't make sense, no matter how you look at it.  Not if you're not trying to fool yourself into thinking there's a way.",
            "By that much? The army was around 80k total...ifbthe other villages had 10-20k more ninja than the leaf...seems like they would have done something about it. Especially the Stone, who admitted to using the Akatsuki and still having aggression towards the leaf",
            "Verbal irony",
            "That part is realistic, specially if you refer to WWI here.",
            "Don’t remember me, I will have nightmares",
            "You damn right lmao",
            "The fact that It can reanimate people without ADN or that It can revive dinosaurs with rocks",
            "💯yes! Exactly",
            ">Im supossed to believe that somehow sasuke Is relative to naruto.\n\nYeah when Naruto unlocked KCM idk how exactly was Sasuke supposed to be relative to him, but he was for some reason. \n\n>The power of the bijuus are a joke\n\nWaiting for a decade to see more about them. They show up and combine an attack against Madara ***who wasn't even using Susanoo***, Madara gets back up like nothing happens and then one shot them. \n\nBruh.",
            "Poor planning is what it was.",
            ">Him dying to save hinata defeats the whole point of his character arc in part 1. He was supposed to have thrown away destiny when he was defeated by naruto, then he still dies defending the main family and naruto is actually the son of the 4th hokage and the reincarnation of ninja jesus destined for greatness the whole time. The war arc completely spits on nejis whole development as a character and proves the narcissistic condescending asshole he used to be right.\n\nWhat a dogshit opinion.  He CHOSE to die of his own free will to protect hinata,  \nthats the whole fucking point of his character arc - he didnt die as a slave protecting his master, forced to die against his will , he was someone who hinata and hiashi loved as an equal and he chose to die to protect his family, much like his father who also did it of his own free will.\n\nHe lived and died the way he wanted to - he picked his own destiny, no one was forcing him to do anything. Are we forgetting **he literally tried to kill Hinata during their fight** in the chunin exams because he was spiteful (which was against the rules)?\n\nThis might just be his way of making up for it. He believed he was a slave to the main clan back then because he thought his dad was sacrificed for the main clan as a slave. He changed his mind when he found out the truth\n\nYou could argue the execution of it was bad but thematically it made perfect sense for his character. and he was out of chakra from fighting tons of white zetsus so he couldnt use hyuga clan jutsus to protect hinata.\n\nHow was neji right? Neji believed people cant change, that if you are born a loser you stay a loser. Society determines your value as an individual. Stop misinterpreting his belief what he said about fate.\n\nIt wasnt about hardwork vs talent.\n\n Naruto vs Neji was about a guy trying to change his circumstances (being hated by others) VS a guy who believed people can never change and wasn't even trying to change his own circumstances.\n\nNeji was wrong and hypocritical on so many levels its insane how people say this shit.\n\nAnd after the fight we found out those were *self-believed circumstances cuz he was never treated as a slave by Hiashi or Hinata,they loved him and treated him as an equal human being,it was all in his mind cuz he didnt know his dad died of his own choice*.",
            "He was trying to act like neji from back in the day lol",
            "The whole chunin exam doesn't make sense. \n\nLook at how many children most couples in Konoha have. Almost none of more than 2, most seem to have only 1.\n\nAnd then you are sending the few children you have into ht chunin meat grinder or on dangerous genin missions?",
            "The 80,000 includes the samurai who make up a huge number of the soldiers as they are mostly just normal swordsmen, very few were ever shown to use any kind of chakra based abilities. The chunin exams in part 1 is an exception as it was cancelled and the hokage who oversaw the exam was killed and the kazekage was a fake the whole time so it makes sense that they didnt promote a lot of people as the new leadership never saw what happened, plus gaara and his siblings were brought in order to use gaara as a tool of war they likely should have already been chunin before the exams. Also the chunin exams in part 1 was not all of the nations. Most of them have been holding their own exams separately and likely promoting much more members as the ninja of other villages seem to have a lower standard for what is considered \"skilled\". Almost every ninja thats not from the leaf or sand is complete fodder. The cloud has only shown like 3 ninja capable of defeating any of the konoha 11 during the war. The stone has no one qualified to take the tsuchikages place which is the only reason he hasnt retired, his broken back is from carrying his whole village through multiple wars by himself. And the mist has been dealing with civil unrest since before the series started. Having larger numbers means nothing when the leaf has shown in multiple wars the ability to have 1 guy wipe out entire battalions singlehandedly.  Hashirama, minato, the sannin, kakashi, when a village consistently pumps out ninja that make the other army scared just by hearing the name it makes sense to stop trying to fight that village.",
            "That also includes the samurai who are shown to mostly be unskilled troops with limited ability to manipulate chakra, as well as a ton of fodder ninja that were useless against powerful ninja. The leaf may have had less people but their alliance with the sand would mean declaring war on them would be declaring war on both, most villages would be pretty afraid of fighting 2 jinchuriki and famous ninja such as kakashi and 2 of the sannin. Minato took out like 10000 guys by himself you really want to test his protégé and mentor at the same time? We see alot of ninja from other villages in the war but almost none of them are actually shown to be very strong. The stone used the akatsuki because they needed the extra strength. I mean look at the old man with the broken spine that is supposed to be their strongest, you dont think he would be retired if he could find someone worthy to replace him?",
            "The leaf took out all akatsuki basically obito n sasuke from da leaf so they kills count as leaf kills",
            "Bro this is ww4 in the Naruto verse.",
            "No they detected from the leaf so no they don't."
        ]
    }
}