{
    "Stel dat de hel een kantoor is, wie zijn dan je collega’s?": {
        "title": "Stel dat de hel een kantoor is, wie zijn dan je collega’s?",
        "score": 493,
        "url": "https://www.reddit.com/r/nederlands/comments/1dlou87/stel_dat_de_hel_een_kantoor_is_wie_zijn_dan_je/",
        "content": "Hallo.\n\nStel dat u sterft. Aan longembolie bijvoorbeeld. Terwijl uw nabestaanden rouwen krijgt u slecht nieuws: helaas, u gaat naar de hel! Had u maar geen belastingfraude moeten plegen. De duivel legt u uit dat de hel een kantoor is waar u 12 uur per dag moet werken. Ik ben benieuwd hoe jullie persoonlijke helkantoor er uitziet. Ik begin, want zo ben ik dan ook wel weer.\n\n**Bernd, 36, IT.** Heeft op vrijdag altijd een Rick & Morty trui aan. Stinkt. Ademt KEIHARD door z’n neus als een soort te vroeg geboren hond met de levensverwachting van een speelfilm.\n\n**Sophie, 30, HR.** Zogenaamd hippe kantoormuts die altijd vraagt hoe je weekend was maar liever doodgaat dan oprecht naar het antwoord luistert. Kantoor-gestapo. Schutzstaffel onder het systeemplafond. \"Rookt niet\", maar heeft deze maand al 8 peukies van je lopen bietsen.\n\n**Brainpower (de rapper), werkgever** lijkt mij de meest verschrikkelijke baas. Die zegt dan dingen als “ja, weetje, NAS zei het al op Illmatic, snap je, sleep is the cousin of death. In onze sector kunnen we gewoon niet lopen suffen, snap je? Er zit veel management-kennis in die old school shit. Aight, stuur jij die e-mail nog? Dope, dope, dope”.\n\n**Harko, 48, Aanwezig.** Heet Harko dus daar ga je al. Zegt dat zijn vrienden hem \"Harko Barko Neukmachien\" noemen. Enorme beschuitlul die om wat voor reden dan ook jouw afdelingshoofd is. Baliekluiver van de hoogste orde. Vraagt de hele tijd \"zou je haar doen\" ie buiten een vrouw ziet lopen.\n\nNu ben ik benieuwd naar jullie persoonlijke hel.",
        "num_comments": 286,
        "comments": [
            "Klaas (60). De collega die 10 jaar geleden jouw functie deed maar toen een burn-out kreeg. Na een lang traject zijn ze erachter gekomen dat hij die functie niet aankon. Gelukkig hadden ze een passende functie voor hem gevonden en zit hij nu vlak bij je. Bemoeit zich met alles wat je doet en denk dat hij het het best weet. Want hij is ouder en heeft deze functie gedaan. Als je iets naar de printer stuurt haalt hij het op, leest het door en geeft er ongevraagde kritische opmerkingen op. Ook alle stukken die op je scherm te zien geeft hij ongevraagd advies. Na ieder telefoongesprek vraagt hij waarover het gaat en zegt hij hoe hij het dat zou doen en dat zijn methode de beste was.",
            "Jennifer, 20 jaar. Heeft een aura om zich heen van goedkope parfum die in een omgeving van 30 meter de haren uit je neus doet branden. Verder heeft ze intens lange nepnagels die je de HELE dag hoort tikken tegen alles wat ze vast heeft. Al haar eten maalt ze onder een luid smakkend geluid. Belt 6 van de 8 uur, het liefst privé, met haar telefoon in de hand op speaker stand met een heftig aangemeten accent, waarbij het altijd gaat over de loser-vriendjes van haar vriendinnen, die altijd vreemdgaan. Waar je ook zit, ze zit altijd op het bureau tegenover je.\n\nBonuspunten: ze eet in de lunch alleen maar tonijn met ui.",
            "Marcel 38 jaar. Heeft de behoefte om alles wat hij doet ook hard op te zeggen. \"Zooo even naar de printer lopen\", \"Ik heb net zus en zo afgemaakt\". Vind het ook nodig om e-mails die naar iedereen zijn gestuurd voor te lezen.\nControleerd 2 keer per uur zijn app en roept uit hoe efficient de zonnepanelen van zijn vinex huis dit uur zijn. Vanaf juni kan hij het alleen nog maar over zijn caravan en de route naar Zuid-Frankrijk hebben. Iedereen weet wel dat hij op zwarte zaterdag gewoon achteraan gaat sluiten.",
            "Conny, 58, aan haar 2e man en 3e burnout bezig. Emotionele stabiliteit van een thermometer, kan al 15 jaar niet meekomen met technologische veranderingen, alles is te veel en moet vooral veel rust pakken en haar werk begrenzen van haar reïntegratiecoach. Is 15 weken per jaar op vakantie.",
            "Irene, 53. Enorm onzeker, vraagt voortdurend om hulp maar zonder t echt te vragen, gewoon doorgaan met t bloed onder je nagels vandaan te halen tot je uit wanhoop je hulp aanbiedt. Geen zelfreflectie en altijd enorm gepikeerd als ze niet gevraagd is te wandelen ook al ga je elke dag om dezelfde tijd.",
            "Jan Wim (64). Is de hele dag aan het bellen en maakt dan 10x het zelfde grapje aan de telefoon. Verdient 4x jouw salaris, maar moet wel 3x per dag vragen hoe je ook alweer dat pdfje in een mail doet. Print elk mailtje uit voor het geval hij het nog nodig heeft.",
            "Judith, 32, is altijd negatief. Over alles, maar dan ook echt álles. Zucht 200 keer per dag. Printer kapot? Natuurlijk dat overkomt háár weer! Slecht weer? Precies, Judith is op de fiets en jij mag haar onvree 12 uur aan een stuk horen. Alles is 1 groot management complot om haar weg te pesten en te kloten.",
            "Dit is een geweldige post overigens. Wat een herkenbare verhalen. Werken we allemaal bij elkaar op kantoor?",
            "Maria (gefingeerde naam), 42 jaar, Helpdesk. \nPraat aan 1 stuk door over van alles en nog wat. Totaal geen touw aan vast te knopen. Ik ben serieus al 10 minuten uitgecheckt en gaat maar door. Moet op maandagochtend eerst aan haar directe collega haar weekend vertellen, wat altijd een heel lang verhaal is over haar cavia's. Echter zit ik in dezelfde ruimte en hoor deze lange verhalen dan ook altijd. Maria Junior en Marco de derde doen echter nooit iets spannends, zelfs niet voor cavia standaarden. Maria huilt ook vaak om van alles en nog wat. Altijd in tranen.",
            "Yowendiah, 23, junior medewerker: \n\nClaimt constant dat ze over 5 jaar 'deze tent runt'. Geeft jouw onrealistische deadlines voor werk dat ze eigenlijk zelf zou moeten doen. Je baas vind dit om één of andere reden ok. \n\nNaast haar werk influencer. Komt langs als je in diepe focus zit om je even het onderwerp van haar livestream te maken, waarin ze kritiek op jouw kleding keuze uit. \n\nLoopt regelmatig kantoor uit om een koffie van EUR 8 te halen, om die vervolgens op te drinken bij het kantoor koffie apparaat en zeikt over hoe slecht de koffie op kantoor is en verteld hoe dat het eerste is dat ze over 5 jaar gaat veranderen. Vraagt je waarom jou waarom je zo lang pauze neemt wanneer haar werk nog niet af is. Er wacht een super belangrijke klant op.\n\nWordt boos als je haar naam verkeerd spelt.",
            "Barrie: de 24 jarige financial die geen financiële achtergrond heeft. Barrie is heel luidruchtig en kijkt de hele dag tiktoks terwijl we genoeg te hebben en zijn collega's het rete druk hebben. Maar omdat Barrie het verschil niet weet tussen debet en credit voert hij geen flikker uit. Wat misschien maar beter is ook.",
            "Martijn, 32, engineer. Staat continue bij de stagaires om ‘iets uit te leggen’. Komt alleen thuis om te slapen, want gebruikt zijn vrije tijd obsessief voor activiteiten met collega’s en zijn andere vrienden. Om zich te bewijzen tegenover de enige vrouwelijke engineer gebruikt hij alleen in haar bijzijn heel trots de vaktermen correct in plaats van de spreektaal waarin de rest praat.",
            "Bob, hippe veertiger in een skinny jeans en nauw  aansluitend blousje. Felgekleurde leren puntschoenen met bijpassende riem. Tweede huwelijk, heeft een dochter (sofie) bij vrouw nummer 1 een een zoontje bij vrouw nummer 2 (Vince is de ster van het plaatselijke voetbal eftal) ze hebben daarnaast een grote hond. \n\nBob doet iets met sales, hij is slecht telefonisch bereikbaar omdat hij met klanten een netwerkborrel heeft waar hij van alles beloofd (wat door collegas van de binnendienst daarna rechtgepraat moet worden) Bob roept ondertussen: make it happen en klapt in zijn handen. Bob praat veel, zegt weinig en belooft gouden bergen, daar is hij goed in..zo jongens ik heb nu weer een lekkere  deal gesloten!!  Als hij dat zegt weet je al dat je bergen werk en een hoop gezeik met de nieuwe klant gaat krijgen.\n\nBob krijgt een lekker bonus, daarmee gaat hij drie weken per jaar met vrouw 2 en vince naar het gardameer. Hij doet zelfs daar interessante connecties op.\n\nBob is zelden op kantoor maar als hij er is is dat altijd in de buurt van de stagiaire, op te scheppen over Vince  die later uitkomt voor oranje. Als je hem ziet bij de koffie automaat begroet hij je altijd enthousiast \"hey kerel' ga je lekker?\n\nBob is hip, hij speelt padel en rijdt een tesla..\n\nZijn vrouwtje doet de boodschappen,  en zorgt 1 x in de 2 weken voor sofieetje als ze komt. Bob staat langs de lijn bij Vince.",
            "Fred, 58. Vindt iedereen die thuis werkt 'niet productief'. Zelf staat hij 15 x per dag bij het koffie-apparaat en belt zijn vrouw (zeer luid) 5 keer per dag.  Neemt 9 van de 10 keer de telefoon niet op want 'daar is hij niet voor aangenomen'.",
            "Ricardo, 28, sales. Denkt dat hij alle winst voor het bedrijf eigenhandig naar binnen harkt met de onmogelijke beloftes en fantasierijke leugens die hij vertelt aan potentiële klanten tijdens dure lunches die door het bedrijf worden betaald. Daarom denkt hij dat iedereen op kantoor er zit om hem te dienen, en niets te doen hebben totdat hij ze een onmogelijke opdracht geeft om vanavond nog zijn afspraak met die megagrote lead voor te bereiden.",
            "Brainpower lijkt me oprecht een chille baas.\n\nVoor mij zou het Peter (50) zijn, leidinggevende. Hij probeert je de hele tijd met allerlei extra werkzaamheden en verantwoordelijkheden op te schepen. Geeft je zeg maar senior verantwoordelijkheden voor een junior salaris. Als je dan over salaris begint zegt hij \"ik hoor wat je zegt, ik hoor wat je zegt. Ik ga kijken wat ik voor je kan regelen\" en het volgende gesprek zegt hij dat het toch nog niet mogelijk is, dat je ook weer niet zulke uitzonderlijke prestaties hebt, en dat hij op jouw leeftijd een lager salaris had (in de vorige eeuw).\n\nJantien (64): zit een paar jaar voor haar pensioen en is al een jaar of 15 in de menopauze blijven hangen. Elke ochtend zie je haar zitten met een moker zure bek alsof ze een pot augurken en zilveruitjes heeft leeggevreten. Niks wat je kan zeggen is goed, ze moet overal een bitter zure opmerking overmaken. Ze heeft één of andere nies ziekte waardoor ze regelmatig een stuk of 7x achter elkaar moet niezen als een hond met ademhalingsproblemen. Je kan 0 feedback of kritiek geven aan haar, want ze is oud en zielig en heeft wat dingen meegemaakt. Oh ja, en ze moet jou instructies geven over het ERP systeem, maar doet al jaren alles op routine, dus ze heeft geen idee wat ze eigenlijk doet en dus is haar enige uitleg dat je daar en daar moet klikken terwijl ze over je bureaustoel hangt.\n\n* Namen zijn gefingeerd, maar gebaseerd op echte gebeurtenissen",
            "Als ik zou sterven en naar de hel zou gaan, zou het maanden duren tot ik iets door had.",
            "Charmaine, 18 (stagiaire) is dommer dan een blok kaas.",
            "**Marie-Jose, 45.** Noemt zich zelf 'Sustainability Counselor'. Is eigenlijk aangenomen als inkoper, maar heeft het voor mekaar gekregen om alles duurzaam in te kopen. Papier is gerecycled, de koffie is Fair Trade, maar wel de goedkoopste, iedereen heeft een koffiebeker met zijn eigen naam (O, die van mij is verkeerd gespeld.) De tafels zijn gemaakt van duurzaam mangohout, maar trekken wel krom en zijn niet in hoogte verstelbaar. Dat bespaart namelijk energie.\n\nIn haar laatste actie heeft ze besloten om de parkeerplaatsen bij de ingang om te vormen tot een bijenreservaat, waar vooral muggen op af komen. \n\nIn de weekenden organiseert ze in de kantine het 'Vegetarisch Borstvoedingscafe' waar ze met een aantal collega's aan dromenvangers werkt die de boze dromen moeten vangen. Het werkt niet echt. Je zit in de hel namelijk.",
            "Bob, 53 jaar. Kan alleen maar praten over werk, maar levert niets op. 1 uur vergaderen over een klusje van 5 minuten is hem niet vreemd. Verder heeft hij 3 kinderen bij twee vrouwen waardoor hij regelmatig ongepland afwezig is en anderen zijn werk kunnen opknappen. Is ook regelmatig een weekje ziek van maandag tot vrijdag. Is daarnaast zeer gepikeerd als hij niet betrokken is bij dingen",
            "Sanne, 44. Werkt al sinds haar 19e voor het bedrijf en maakt nooit stappen vanwege een gillend gebrek aan ambitie en skills. Zal printjes maken en inklapperen tot haar pensioen, maar roept toch ieder jaar dat ze sollicitaties heeft lopen en daar veel meer gaat verdienen. Komt in de ochtend binnen met opgedroogde yoghurt in haar mondhoeken. Wijst je erop als gaatjes niet perfect op a4-formaat geperforeerd zijn.",
            "Peter, 62, Nog 5 jaar en dan mag hij met pensioen.\nWilt geen nieuwe pc meer van ICT, want alles wat veranderd is niet goed. Maar belt wel elke dag naar de helpdesk om te zeuren dat alles traag is.",
            "Wilma (48) is de baas. Wilma heeft 3 kinderen die ze nogal laat heeft gekregen, en dus zijn dit haar wondertjes die op dit moment nog altijd een oppas nodig hebben. Haar favoriete collega's zijn Femke (33 met 2 jonge kinderen) en Jose (35, vrijgezel met 2 probleemtieners) en dit laat ze duidelijk blijken. De rest van het kantoor kan stikken en iedereen moet altijd de problemen van dit trio oplossen. Eén van de kinderen ziek? Dan mag jij lekker overwerken. Jose overspannen door de thuissituatie? Blijf maar lekker thuis meid, maar als jij met 40 graden koorts in bed ligt dan stel je je gewoon aan. Wilma kwam immers zelf ook naar kantoor toen ze corona had, want zo ziek voelde ze zich niet.\n\nJose loopt ook de hele dag tegen iedereens kop te zeuren over hoe vervelend haar kinderen zijn en hoe moeilijk het is om een single moeder te zijn, maar enig goedbedoeld advies wil ze niet aannemen, en opmerkingen zoals \"daarom heb ik geen kinderen\" worden al helemaal niet in dank afgenomen.\n\nFemke lijkt op het eerste gezicht nog wel een leuke, relatief positieve meid, maar je komt er al snel achter dat ze gewoon bij Wilma onder de duim zit. Wilma heeft stiekem namelijk illegale regeltjes in het contract gezet, en zodra jij er iets van zegt, springt Femke er direct tussen om Wilma te verdedigen en jou een slechte collega te noemen. Ze zal nooit echt ruzie zoeken met je, want daarvoor is ze te zacht, maar ze zal ook nooit jouw kant kiezen.\n\nDe rest van je collega's zijn niet erg spraakzaam, mogelijk omdat ze weten dat ze er toch nooit bij gaan horen, maar misschien hebben ze ook gewoon totaal geen interessante persoonlijkheid. Ze hebben ook geen interesse in het werk wat ze nou eigenlijk moeten doen en schuiven het regelmatig door naar jou. Of ze komen gewoon helemaal niet opdagen. En dan wordt Wilma boos op jou omdat je je driedubbele werklading niet af hebt gekregen voor het eind van de dag.",
            "Harry, 53, die altijd net te dicht bij je komt staan, eventjes je haar aanraakt, zijn hand op je schouder legt en nét te lang blijft hangen als hij wat af komt geven. \nEn in de zomer vraagt hij of je misschien een keer slippers aan wil doen, of in elk geval schoeisel waarin je tenen te zien zijn.",
            "Henk, 45, leidinggevende. Wil dat je op kantoor komt voor de 'productiviteit' maar lult dan de hele dag tegen je omdat werk de enige plek is om zijn eenzaamheid te vullen nadat zn vrouw bij hem weg is gegaan omdat hij alleen maar met werk bezig was. Hierdoor moet je in het weekend alsnog thuis werken. \n\nZegt de hele tijd, 'hierna laat ik je echt gaan' met nog een onnozele anecdote, maar dat moment komt nooit.",
            "Is iedereen nu gewoon zijn grieven aan het uiten over zijn collega's?",
            "Harry (62), is een absolute controlfreak die daardoor al 3 burn-outs heeft gehad. Hij laat je je werk doen maar ondertussen doet hij zelf hetzelfde en in plaats van jouw werk te gebruiken, verwijdert hij dat op het laatste moment en gebruikt wat hij zelf heeft gemaakt. Als je er vervolgens iets over zegt dan ontploft ie in een tirade en als je daar met zijn manager over probeert te praten dan zegt die „Harry is nou eenmaal zo“.",
            "Johan(60).  HR Directeur. Heeft heel zijn leven heeel hard gewerkt om dat te bereiken en laat iedereen dat merken. Hij houdt van wat hij ' doorvragen ' noemt en doet dat net zo lang tot hij zijn collega's in tranen heeft want dan ' komt hij tot de kern' en is hij trots dat hij dat bereikt heeft. Want hij is ontzettend sociaal, dat laat hij wel merken bij de bedrijfsborrel waar hij het meeste drinkt en het hoogste woord heeft, en ruzie maakt met de andere directeuren. Wordt door zijn directe collega's ' wolf in schaapskleren ' genoemd want hij is zelf overtuigd dat hij heel aardig is, hij heeft alleen maar een kort lontje en dat is geen probleem want dat merk je alleen maar als je iets zegt dat hij als kritiek opvat. \nIs de hele dag bezig met ' people management ', of wel micromanaging zoals in de gaten houden hoe vaak iemand naar de wc gaat en hoe lang dat duurt.",
            "Maria\nCollega OR-lid. Heeft nooit iets in te brengen, stelt nooit vragen, luistert maar half wanneer je iets verteld.\nStaat voor aan bij locatie bezoeken of workshops wanneer er een gratis lunch of afsluitende borrel is.\nHaar werkhouding is verder hetzelfde tijdens de locatie bezoeken en workshops.\nHeeft inmiddels meerdere afdelingen gehad waarbij ze altijd ruzie had met collega of leidinggevende en altijd het slachtoffer is.",
            "Dylano en Romana. Die bij het slootwaterapparaat gaan lopen mekkeren dat alles de schuld is van Sigrid Kaag. En dat de vluchtelingen de reden zijn van haar ww fraude. Want die werken ook niet. Romana heeft een asbak in de keet staan waar non-stop een peuk brandt, terwijl Dylano een emmer Monster Energy naar zn stoel heeft staan. Ze kijken elkaar aan, zuchten een keer diep en gaan weer verder met de lava schoffelen.",
            "Henk 62, weet zogenaamd alles maar niet hoe de printer werkt, hoe de personal computer aan moet. Bammetjes zwetende kaas mee. En langzaam, vooral heel langzaam.",
            "Dennis 29 van Sales, heeft een leuke babbel aan de telefoon maar in persoon is hij goooooooooor. Als hij iets zegt zit hij -terwijl hij tegenover je staat- in z'n neus of aan z'n kruis! Gatverdamme! Hij veegt hetgene hij uit z'n neus heeft gehaald ergens aan z'n bureau, en hij wast nooit z'n handen als hij naar het toilet is geweest. Op een gegeven moment heb ik hem gevraagd om niet meer goor te doen als hij met me praatte en hij wist niet waar ik het over had. Vanaf dat moment ben ik hem op het moment zelf -als een puppy die zindelijkstraining krijgt- gaan aanspreken: Hand wég van je kruis!!!\nNooit geweten of het effect zou hebben gehad want hij werd op staande voet ontslagen omdat hij onder kostprijs zaken had verkocht aan het bedrijf van z'n vader, die vervolgens de rekening niet betaalde van bijna 30k.\nDaarna is hij bij een stakehouse gaan werken, hell to the no dat ik daar ooit ben gaan eten. Iew.\nMaar het is de hel, dus nu werkt hij bij me in de bedrijfskantine en zijn zijn snotjes de stukjes in de sladressing.",
            "Jopie, 50, komt uit de horeca en heeft IT-ervaring, maar wilde graag wat anders doen. Blijkt echter dat het een enorme opschepper is. \"Ik heb nog een ongebruikte Jura in mijn garage staan, ik heb een veel mooiere machine gekocht!\". Snapt de opmerking die ik maakte \"opscheppen is ook een vak\" niet.\n\nGescheiden, in een rechtzaak met z'n ex. Zeurt altijd daarover. Zucht extreem hard en ramt de muis bijna door het bureau heen als hij ook maar even moet wachten op de computer. \n\nOh, en hij is niet zo goed in het vakgebied wat hij nu doet, want doet 2x zo lang over iets wat in de helft van die tijd klaar kan zijn. En vindt zijn verbouwing belangrijker dan zijn (al lang ingeplande) examen voor een cursus die voor hem wordt betaald, dus gaat hij daar niet heen. \n\nHeeft geen zelfreflectie, want nu hij eruit wordt getrapt, zowel bij het bedrijf als bij het uitzendbureau, snapt 'ie er niks van waarom dat nou gebeurt.\n\n^geen ^woord ^van ^gelogen ^helaas, ^alleen ^de ^naam ^heb ^ik ^veranderd ^:)",
            "Peter, de middel  manager van 26 die ontzettend carrière gericht is en vooral geeft om cijfers. Die zwangerschap en andere dingen onzinnige vrouwenproblemen vindt. Sowieso is ziek zijn onzin laat staan mentale problemen. Een gezin en kinderen kunnen in zijn ogen vooral zorgen voor lagere presentaties en als moeder tel je niet mee tenzij je het tegendeel bewijst. Ben je vader of heb je gewoon een partner, dat maakt niet uit. Werk gaat voor alles, dat moet je nummer 1 prioriteit zijn, je levensdoel en de reden van je bestaan.",
            "Eveline, 36, heeft weinig meegemaakt in haar leven. Werkte eerst als HR-adviseur, maar wilde \"wat anders\" en is nu jouw directe collega. Niemand weet wat haar aan deze functie aantrekt. Haar vriend betaalt de hypotheek, de boodschappen en andere vaste lasten en haar ouders zijn rijk. Als Eveline geen zin zou hebben, zou ze niet hoeven werken. Hierdoor heeft ze weinig empathie voor collega's die krap bij kas zitten of het zwaar hebben en geeft ze hen onrealistische adviezen.",
            "Frederic, 54, iets managementachtigs: Is \"persoonlijk bevriend\" met de directie van het bedrijf en haalt dit graag aan tijdens gesprekken. Staat voor aan de rij om iedereen onder de bus te gooien bij diezelfde directie om maar een wit voetje te halen. Krijgt ook een grijns op zijn gezicht als hij de kans krijgt om dit te doen. Zit permanent im vergadering.\n\nMaria, 37, boekhouding: Is altijd heel erg druk, en praat enorm snel om dit te benadrukken. Staat desondanks minstens twee uur per dag naast de koffieautomaat te roddelen over collega's. Raakt in blinde paniek als haar computer/telefoon/printer het niet doet. In 95% van de gevallen ontstaat dit doordat ze \"te druk\" is om te kijken of het apparaat daadwerkelijk aan staat. Kan niet tegen verandering, want \"zo hebben we het toch altijd gedaan?\"\n\nBen, 48, sales: Houdt enorm van technische snufjes en dikke auto's. Snapt desondanks niks van techniek. Hangt dagelijks aan de telefoon met IT om ze te vertellen hoe ze hun werk moeten doen. Wordt boos als je zijn wearable een smartwatch noemt. Vindt zijn gloednieuwe laptop te traag en heeft hem binnen een week van ontvangst laten vallen. Noemt dit gebruiksschade.",
            "Levi, 23. Is net afgestuurd van hbo-ict en heeft zijn functie via een kennis gekregen. Levi vindt zichzelf  heel wat omdat hij een hbo diploma heeft en vindt daarom dat hij beter is dan zijn collega’s.\nLevi vindt faciliteiten voor mensen een beperking maar niks, deze mensen zijn in zijn mening niet productief genoeg. Zelf zit Levi na een paar regels code zijn zoveelste rookpauze te houden of op autoscout te kijken naar BMW’s",
            "Elke collega die over F1 praat en puntschoenen draagt. Pure hell.",
            "Marc Dutroux op HR",
            "Willem (57) vind dat hij wel gewoon met pensioen mag, en is mentaal ook al met pensioen. Begint zijn dag door op marktplaats naar boten te kijken terwijl hij 5 hoog in een flatje woont. Aan einde van de dag zit hij te reageren op Telegraaf artikelen.",
            "DIT IS GEEN KANTOOR! DIT IS DE HEL MET TL-VERLICHTING!\n\nZo, die gebruik ik in t echt ook wel eens 😅",
            "Joris (46) vindt zijn eigen stemgeluid het mooiste ter wereld. Zorgt er persoonlijk voor dat elke vergadering 1,5 uur duurt ipv een half uur, door bij alles wat wordt besloten te reageren met 'dat roept vragen bij mij op..' gevolgd door een onsamenhangende anekdote die verder weinig met de beslissing te maken heeft. Als Joris eenmalig de ruimte niet krijgt om zijn zegje te doen, stapt hij direct naar de manager omdat hij 'zich niet gezien en gehoord voelt'.",
            "Saar, 29, switcht elke paar jaar van baan maar doet elke keer praktisch hetzelfde werk. Jij bent verantwoordelijk om haar in te werken. Ze heeft overduidelijk geen feeling of interesse met het werk, maar doet het alleen om een inkomen te hebben. Zelf nadenken is aan haar niet besteed, ze kan eigenlijk alleen maar compleet uitgekristalliseerde werkinstructies volgen. Ze is er eigenlijk niet klaar voor om zelfstandig het werk te gaan doen, maar je weet dat ze nooit ontslagen zal worden. Als er iets georganiseerd moet worden dan heb je helemaal niks aan haar. Ze zit er wel bij maar blijft stil en hoopt dat anderen alles oppakken.",
            "Iemand zei ooit al: De hel dat, zijn de anderen. En het is zo waar.\n\nMaargoed, voor mij is het Bart Peter.\n\nBart Peter komt graag een praatje maken, alleen is hij zo on-interessant dat alles wat uit zijn mond komt een zin is waar je alleen Ok op kan antwoorden.\nGeen enkel verhaal of twist of spanningsboog. \n\nGister pannenkoeken gegeten.\nMijn nieuwe schoenen zijn aangekomen.\nMijn katten grind is op.\n\nOok kiest hij het drukste moment van de dag terwijl jij je probeert te concentreren op dit ene cruciale dingetje om te vertellen over zijn nieuwe krabpaal.",
            "Matthijs 58 jaar, oprichter van het bedrijf. Zegt dat hij creatieve ideeën stimuleert. Zodra iemand met een goed idee komt, is er geen tijd of budget om het uit te voeren. Elke maand tijdens de maandelijkse meeting klaagt hij er over dat hij creativiteit mist in het team. Hij heeft een team vol enthousiaste collega's die allemaal een verschillende achtergrond hebben. Maar hij ziet zichzelf als de eindverantwoordelijke voor alle creatieve uitingen. Als alle ideeën gehoord zijn voert hij op het laatste moment toch zijn eigen (slechte) idee door.",
            "Rob (55) weet niet hoe de computer werkt. Zelfs met duidelijke instructies, uitgeprint naast de pc, lukt het hem nog niet om outlook te starten. Ook is er bij elke kleine tegenslag een woedeaanval. Heeft om de een of andere reden extreem veel overuren en neemt die op de meest random, irritante tijden op.\n\n(Misschien gebaseerd op een echte collega van mij)",
            "Klinkt gewoon als het dagelijks leven. Pretty prepared for hell.",
            "Hoe kom je erop om brainpower te gebruiken als baas, hahaha",
            "Oh ik kan er een paar opnoemen waarmee ik dus echt heb samengewerkt:\n\n  \nHans (45). Alleenstaande collega, die omdat hij thuis geen aanspraak heeft, de hele dag probeert grappig te doen en aandacht te trekken. Zomaar omdat het 'grappig' is, midden tijdens dat jij over een moeilijk probleem nadenkt 'loe loe loe' begint te zingen. Als je hem dan aankijkt van kan het wat minder dan zegt hij: Ja sommige mensen hebben gevoel voor humor en andere mensen niet.\n\nAnton (30) Computerprogrammeur die werkelijk niks anders doet dan computers zijn hele leven al. Als hij een stukje code geschreven heeft en hij moet even wachten, gaat hij opgewonden met zijn vingers op de tafel zitten. Kan werkelijk over niks anders praten dan dat, en verwacht dat jij net zo enthousiast bent, anders ben jij gedemotiveerd.\n\n  \nAndreya (35) Totaal onverstaanbare Servier, die slechter Engels spreekt dan een Nederlandse tienjarige, maar dan met een zwaarder accent. Ondertussen zit hij jou wel uit te schelden als jij iets fout doet. 'That no good, you bad!' Maar hij mag onbeschoft zijn van de teamleider, want dat is 'alleen maar geen Engels spreekt'.",
            "Reinier, 51 jaar, systeem architect. Reinier was vroeger een aardige netwerkbeheerder, echter omdat Reinier nooit zijn kennis vernieuwde werd zijn functie overtollig en werd hij weggepromoveerd. Reinier moet het ontwerp van elke applicatie goedkeuren, Reinier heeft echter geen kennis en is vooral van: \"Mag niet\". Daarnaast is Reinier de bedenker van het security board samen met wat andere lotgenoten die een hekel aan vernieuwing hebben keuren zei elke vorm van vernieuwing af.",
            "Jan Willem; ergens in de 40. Autistisch en developer. Heeft altijd gelijk en deelt nooit enige kennis. Niemand kan langer dan een week met hem samenwerken maar omdat hij alles weet komt hij er altijd mee weg.\n\nPien; begin 20. Blond, jong, vrolijk en scrummaster. Praat heel veel maar zegt niks. Alles is storypoints, t-shirt sizes en als iedereen er al lang klaar mee is komt er een leuke \"energiser\". We gaan weer rare vragen aan elkaar stellen als \"welk soort fruit ben jij\"? Jan Willem haat Pien. Pien wil graag dat Jan Willem meedoet met alle scrum rituelen.\n\nDanielle; ergens in de 20. Heeft volgens eigen diagnose ongeveer alle aandoeningen. ADD, autisme  en fibromialgie zijn haar hele persoonlijkheid. Niemand weet wat ze doet eigenlijk.\n\nPrakash; 30 maar kan ook 60 zijn. IT architect. Indiaas. Is niet te verstaan. Je ruikt hem voor je hem ziet.\n\nHenk; 67. Bijna met pensioen. Man van de werkvloer. Is 40 jaar postbezorger geweest. Schrijft elke dag een hele rant over de CEO en \"kantoorpersoneel\" op de interne facebook. \n\nMootje. Bezorger. Niet in de regenboogbus willen rijden is zijn hele persoonlijkheid. Druk en luidruchtig maar wel een grappige gast. Heeft het IQ van een pinda.",
            "Marc (45). Zit diep in de alt right rabbit hole en gelooft in alle complottheorieën die er bestaan. Anti WEF, anti vaccin, heeft meegedaan met de Corona demonstraties. Verteld de hele dag door over hoe onze roverheid ons hersenspoelt tot makke schapen. Stuurt regelmatig linkjes door van ‘nieuws websites’ die eindigen met .info, met angstaanjagende artikelen die op 0 feiten zijn gebaseerd.",
            "Jan: 68.(met pensioen) Na 30 jaar trouwe dienst heeft ie een breed repetoire van wel 3 hele anekdotes, een voor iedere pauze. Komt iedere week precies op het drukste moment langs voor de gezellig om het halve personeelsbestand op te houden.",
            "Daniëlle. Rond de 50, maar doet zo krampachtig haar best om er jonger uit te zien dat ze net het tegenovergestelde bereikt. Heeft zich ten koste van een aantal (intussen ex-)collega’s een positie weten te verwerven waar ze zelf niets meer uitricht en de haar toegewezen assistente al het werk laat doen. Gaat er iets verkeerd dan is het altijd de schuld van de assistente, maar Daniëlle is altijd heel zichtbaar aanwezig om lof te ontvangen voor de opdrachten die wél goed afgewerkt zijn. Loopt de ganse dag te kwekken dat haar man “voor een zeer belangrijk internationaal advocatenkantoor werkt; hij is daar IT’er en heeft zelfs, stel je voor, een “eigen dienstwagen”. Als die dienstwagen voor enkele dagen vervangen wordt door een Lexus loopt Daniëlle, om te de tonen hoe “belangrijk” haar man wel is, voortdurend alle kantoren in en uit, met de autosleutels - Lexus embleem goed zichtbaar - in haar hand. \n\nDaniëlle is een achterbakse stoker die niemand ontziet, maar is de eerste om zich schijnbaar erg bezorgd te tonen als een collega door de slechte sfeer die ze mee veroorzaakt onderuit gaat. Schijnheilig dus ook. \n\nZo, die is eruit :-)",
            "Joop (43), accountmanager. Getrouwd met een vrouw van 28 met zo goed als geen zelfrespect, twee jonge kinderen thuis. Zeikt de hele dag door over zijn partner én zijn kinderen, krijgt alleen levensvreugde van staren naar de tieten van zijn jongere collega’s (hij vindt oogcontact niet nodig en doet niet bepaald geheimzinnig over zijn voorkeur voor boezem) en als ze erover klagen kraamt hij uit dat al die jonge meiden tegenwoordig veel te laag uitgesneden topjes dragen.",
            "Emma, 20 jaar. \n\nBedoelt het goed, maar ziet er constant uit als een konijntje in de koplampen. Draagt hippe kleding. Je werkinstructies landen op droge grond en je komt er niet achter of ze je niet begrijpt, of gewoon stilletjes weigert te doen wat je zegt. Het liefst praat ze alleen met de mensen die ze kent, bij bezoekers op kantoor duikt ze weg. \n\nDurft niet te bellen met de telefoon en werkt daarom heel omslachtig. Kan niet echt hoofdrekenen en analoog klokkijken is ook een ding. Beweert dat je gekookt water niet opnieuw kunt koken, want dan hopen de schadelijke stoffen zich op (heeft ze gezien op TikTok).  \n\n\nNaast haar zit Jeroen (48), een magere, morsig ogende IT’er met stoppeltjes en kleding van de kringloop, die ieder trefwoord dat te maken heeft met gezondheid of vaccinaties aangrijpt om te oreren over de meest recente complottheorieën. Wacht nog steeds likkebaardend op The Great Wipe, als alle gevaccineerden massaal doodgaan en hij Gelijk had. Spuit verder onsamenhangend over zijn overtuigingen, en wanneer kritisch doorgevraagd wordt, trekt hij een rookgordijn op door met nóg buitenissiger theorieën en termen te komen. 5G, chemtrails, WEF, Klaus Schwab, lizard people… \n\nHet is dat Jeroen de enige is die nog weet hoe het bejaarde softwaresysteem uit 1992 werkt dat sinds 2003 geen updates meer heeft gehad en eigenlijk nodig vervangen moet worden, want met al dat gewauwel komt hij aan werken de meeste dagen amper toe.",
            "'Maagband' Henk.\n\nHenk dankt zijn bijnaam aan het feit dat hij al heel zijn werkzame leven minstens 200 kilo weegt, tot drie keer toe een maagverkleining heeft gehad, na elke operatie een beetje afvalt maar daarna weer net zo snel aankomt omdat hij letterlijk heel de dag zit te vreten. \nHet enige moment van de dag dat hij niet zit te eten, is hij weg om te roken.\nHenk verspreid dan ook de penetrante geur van zware van Nelle, heeft zo'n gele nicotine vlek in zijn snor en twee van die gele shagvingers. \nDaarnaast houdt hij er onsmakelijke gewoontes op na zoals zijn nagels knippen aan zijn bureau waarbij hij zijn afgeknipte nagels op de grond laat liggen voor de schoonmaakster. Ook snuit hij 40 keer per dag zijn neus in een kleffe stoffen zakdoek, die hij dan uitgebreid moet opvouwen alvorens hem terug in zijn zak te steken.\nDaarna raakt hij met zijn vieze snotvingers allerlei spullen aan die voor algemeen gebruik zijn.\n \nHij is in de glorietijd van het bedrijf (38 jaar geleden) opgeleid in de bedrijfschool, heeft 36 jaar geleden één keer gevraagd om een hogere opleiding te mogen doen, wat toen niet mocht omdat hij eerst ervaring moest opdoen. Daarom roept hij nu al 35 jaar dat ze toen hun kans hebben gehad. Ondanks dat hij daarna 20 keer het aanbod heeft gehad. \n\nZijn jarenlange overgewicht heeft ertoe geleid dat zijn lichaam op is en hij zijn werk niet meer normaal kan uitvoeren, waardoor jij zijn werk erbij krijgt. Om een of andere reden word dit geaccepteerd.",
            "Princes Laurentien is je middle manager.",
            "**Klaas, 63, Chef;** Draagt altijd hetzelfde, of heeft hij 5 dezelfde outfits? Niemand weet het. Heeft altijd wel een of ander lulverhaal over 'vroeger', en hoe ze toen meer moeite deden zonder te klagen. Heeft altijd stinkende kliekjes bij zich, die steevast tijdens de lunch in de magnetron gaan. Doet alles nog met pen en papier, tot het op jouw bureau terecht komt, en het alsnog de computer in moet.\n\n**Hidde, 35, CEO;** Het luie zoontje van Klaas. Gaat als hij binnen komt altijd eerst tot een uur of 10 schijten. Dan is het tijd om iedereen te vertellen wat er allemaal beter en sneller kan. Vreet altijd mee uit de magnetron pot van pa, want hij woont alleen en zelf koken kan die niet. Reageert nooit op interne mail, en heeft altijd oordopjes in. Is altijd minstens een half uur vroeger naar huis dan de rest.\n\n**Femke, 34, Werknemer;** Zit tegenover je. Gierend veganist. Haat alles wat van plastic is. Al in paniek als er 10 mailtjes in haar inbox zitten. Geeft je de hele dag passief agressieve 'weetjes' over het milieu. Tijdens lunch blijft ze je aankijken alsof je babies eet, want er zit vlees op je boterham. Komt altijd naar het werk op haar bakfiets, die ze ongemakkelijk voor de poort van het parkeerterrein wegzet. Vertrekt ook altijd pas 10 minuten na sluiting.\n\n**Helma, 55, Werknemer;** De gene die jij eigenlijk zou vervangen, maar ze zit er nog steeds. Oudere vrouw, maar nog steeds botergeil. Weegt 130 kilo. Heeft zin in jou. Komt de hele dag dingen bij je vragen, waarbij ze ongemakkelijk aan je zit. Iedereen ziet het, maar dat interesseert niemand iets, ook haar niet. Brengt je elke ochtend een mok met koffie met een vies smaakje.. Wat is dat toch.. is de koffiemelk zuur.. ?",
            "Hardop gelachen bij een volle vliegtuig gate om Harko de beschuitlul 😂😂😂",
            "De huidige 😂",
            "Als hel een kantoor is is het waarschijnlijk zo'n kantoortuin.",
            "Doet me denken aan deze [YouTube serie](https://youtube.com/playlist?list=PLE7j5FieXSTf1_gNwhix5n-SA_Ahfcvy1) over iemand die in een gigantische kantoor werkt om te bepalen of mensen naar de hemel of hel gaan. Sws erger dan hel.",
            "Berend, 38 jaar. Lid van t management team omdat hij zich overal mee bemoeid en iedereen \"onder hem\" wegpest. Gebruikt zijn machtspositie geregeld om zijn gelijk te krijgen. Omdat hij zich overal mee bemoeit, gaan 80% van de taken deels via hem zodat hij nergens tijd voor heeft, maar wel lekker iedereen de schuld geeft dat ze altijd hem moeten lastigvallen. Vindt dat hij over alles meer weet dan zijn collegas. Verteld geregeld sterke verhalen om cool proberen te doen. Ondervraagt je als een krijgsgevangene over willekeurige onderwerpen om zijn kennis te showen.\n\nFuck you Berend. Het moment dat ik wat beters vind dien ik mn ontslag en vertel ik gewoon eerlijk dat jij me hebt weggepest.",
            "Bibi, dame die op de dagen dat ze aanwezig is, niet begrijpt hoe ze de kas moet opmaken. 'Ik begrijp er niks van!' blijft roepen. En zich ziek meldt als er iemand van de afdeling naar de hemel gaat.",
            "Wat de neuk is een baliekluiver",
            "250 mensen die de helpdesk proberen te vermijden en maar meteen naar jou de systeembeheerder bellen of op het kantoor langs komen om hun ICT probleem te vertellen terwijl je met ingewikkelde zaken bezigt bent die uitgevoerd moeten worden wegens een wettelijke deadline,  maar of je even wil kijken naar hun probleem want ze moeten toch echt weg om 16.00 uur, en of jij het nog even kan oplossen na 16.00 uur zodat ze morgen weer verder kunnen met iets waarvoor ze bij de helpdesk horen aan te aankloppen.",
            "Anne, 42. Werkt sinds haar HBO opleiding in hetzelfde bedrijf. Is uit angst nooit van baan gewisseld en blijft hier zitten tot haar pensioen zonder enige ambitie, vaardigheid of enthousiasme. \n\nHeeft al twee keer een burn out gehad en is toen overgeplaatst naar een afdeling die haar minder belastend leek, maar aangezien niet het werk maar Anne het probleem was is dat alleen het verschuiven van het probleem. \n\nAnne heeft zoveel verschillende onbelangrijke neventaken dat ze feitelijk weinig bijdraagt aan het daadwerkelijk verzetten van werk, dus de rest van de afdeling moet dat opvangen. \n\nZe zit uiteraard in de OR, en in elke beschikbare commissie of werkgroep die veel vergaderen maar waar nooit iets uit voortkomt. In overleggen is haar meest gebruikte zin ‘maar dat is gewoon verplicht’ naast ‘dat moet eerst langs de or’. Verandering en innovatie zijn eng en dat wordt dan ook zoveel mogelijk tegengehouden. Denkt in problemen en ziet alleen nadelen. \n\nAnne heeft twee kinderen waarmee ze in diagnostische trajecten zit. \nZelf noemt ze ze hooggevoelig net als zijzelf, maar feitelijk zijn ze zo autistisch als een deur. Omdat Anne dat niet wil onderkennen heeft ze véél gesprekken op school en met hulpverleners. \nHaar man doet iets belangrijks dus die kan daar uiteraard niets in betekenen (en is eigenlijk net zo autistisch dus aan zijn schema wordt niet gemorreld.)\n\nAnne stevent op haar 3e burn out af, is totaal niet bereikbaar of aanwezig en als je haar eens vraagt hoe het gaat krijg je enkel ‘oh ik heb weer zo’n hoofdpijn, ik denk dat ik een migraine aanval krijg, ik heb ook zoveel op m’n bord’ waarna ze zich weer een paar dagen ziekmeldt. Als ze terugkomt komt er via de manager de mededeling dat Anne wat taken gaat afstoten (uiteraard niet de onbelangrijke neventaken maar de core business, dus meer werk voor jou) in verband met haar belastbaarheid.",
            "Jochem (65), is de hele dag bezig met lamellen verstellen, lades open en dicht doen, opstaan en de ruimte in en uit lopen, begint te praten met collega's als er iemand aan de telefoon is, werkt zo chaotisch als de pest.",
            "Sanne (53), teammanager. Is op de oppervlakte heel gemaakt vriendelijk, maar de ijzig koude blik in haar ogen verraadt dat zij enkel daar zit om targets te halen en een dik management salaris op te strijken. Ze heeft geen enkele interesse in haar werknemers maar gebruikt jouw naam te vaak in elke zin die ze uitspreekt om toch een band af te dwingen. Is alleen geïnteresseerd in goed voor de dag komen voor haar leidinggevenden en gaat over lijken om dat te bereiken. Is werkzaam bij twee andere locaties en gebruikt het excuus \"ik ga nog een paar uur naar locatie X\" om eigenlijk vroeger naar huis te gaan. Hoewel ze niet 12 uur per dag op kantoor is heeft ze mollen in het personeel zodat ze wel altijd weet wie ze een bitchy mailtje moet sturen omdat ze 5 minuten eerder weggaan. Is goed in het laten verdwijnen van collega's, maar je durft daar niet naar te vragen omdat je niet wilt dat jij in hetzelfde traject beland. \n\nSander (48), Assistent teammanager. Is het zachtste ei wat je ooit hebt meegemaakt. Heeft wel humor en heeft veel medeleven voor iedereen maar heeft geen idee wat er gebeurt. Is het schoothondje van Sanne en moet zodoende op de andere locaties haar tornado opvegen. Heeft dus nooit genoeg tijd om echt goed werk te leveren en op de hoogte te zijn van wat er speelt. Bij een vergadering als er gesproken over een onderwerp wat al maanden speelt en tig mailtjes over zijn verstuurd is hij heel verbaasd van de gang van zaken en moet helemaal bijgepraat worden waardoor een groot deel van de vergadering verspild wordt aan het hoewatwaarom van het probleem. Komt altijd te laat omdat hij tot in de late uurtjes het werk van de teammanager heeft opgelost.\n\nLiesbeth (60), Floormanager. Een ouwe rot in het vak die in een ver verleden vast heel goed heeft gewerkt. Echter heeft de overgang en overspannenheid ervoor gezorgd dat ze nu een zure, chagrijnige en onvoorspelbare vrouw is geworden. Maakt beslissingen uit haar moodswings en gaat als een olifant in een porseleinkast door de afdeling heen. Heeft geen tact en al helemaal geen geduld.  Is een bodyguard van Sanne en zullen elkaar tot in de eeuwigheid een hand boven het hoofd houden. Is in een burn-out traject geweest en claimt nu helemaal genezen te zijn. Echter zie je geen verschil, sterker nog: ze is erger geworden. Als er een kleine tegenslag is dan flipt ze helemaal de pan uit, waarbij ze soms zelfs fysiek agressief kan worden. Vooral aan mannen heeft ze een hekel. \n\nCleo (35), administratief medewerker. Is nog steeds student, bezig aan haar zoveelste master. Voelt zich verheven boven iedereen omdat ze studeert aan de universiteit. Maar in de werkelijkheid is zij zo gek als een deur. Onthoud alles wat iedereen ooit heeft gezegt en kan niet wachten om dit tegen je te gebruiken. Is grensoverschrijdend naar de klanten, door bijvoorbeeld over haar tepelpiercing te praten of dat ze net is gewaxt en het nogal brand naar beneden. Start geruchten alsof het waarheden zijn en speelt de vermoorde onschuld als ze daarmee geconfronteerd wordt. Komt in ongepaste outfits naar het werk. \n\nMaya (50), klantcontact. Deze vrouw praat NON. STOP. En alleen maar over zichzelf en op zeer luid volume. Heeft een bewogen leven achter de rug met verslaving en dakloosheid en vertelt daarover in geuren en kleuren, ook op momenten dat het zeer ongepast is. Rookt zware shag en laat overal die friebeltjes van haar tabak achter, ook in jouw smeerkaas. Heeft een ongezonde obsessie met Afrika en claimt dat witte mensen niet kunnen koken. Is zelf zo wit als sneeuw en de paar keer dat je haar kookkunsten heb durven proeven ben je een week beroerd geweest. \n\n(Had niet verwacht dat ik zoveel zou schrijven, maar blijkbaar zat het hoog. Namen en functies zijn veranderd.)",
            "Jan-Erik (48), denkt dat hij bedrijfsleider is maar is dat niet. Een man die als een tikkende tijdbom rond loopt en waarvan je nooit weet wanneer hij weer explodeert. Iemand die de sfeer in een ruimte tot het nulpunt weet te brengen, maar die ook enorm zijn best doen om er bij te horen, alleen niet snapt dat voetbalkantine humor niet werkt in een professionele omgeving. \nHij doet alsof hij alles weet, maar heeft ondertussen 3 teamleiders een burn-out in gejaagd omdat hij de druk zo opvoert en tegen ze uit valt als ze de urennorm overschrijden of de doelen niet halen, die hij nooit aan ze heeft gemeld.",
            "Petra, 49. \nPetra is op zich een best mens. \n\nZe is alleen zo ontzettend veel ziek dat ze altijd ofwel aan het reïntegreren is, of net loopt te kwakkelen voor een full blown ziekmelding. Is an sich best kundig, ze is er alleen nooit. \n\nZe is ook niet nep-ziek, er is altijd iets serieus. In de afgelopen 7 jaar heeft ze een darmoperatie, een goedaardige tumor, een hernia, een oogziekte en een vechtscheiding gehad, allemaal volledig buiten haar schuld. Niet omdat ze dat zelf denkt, maar gewoon omdat het echt zo is. Je kunt haar dus geen enkel verwijt maken. \n\nZe wil ook graag werken, dus steeds vlak voor een kritiek punt is ze weer voldoende opgebouwd en werkt dan net lang genoeg tot een volgende ziekmelding als een losstaand feit telt. \nAl je gesprekken met haar gaan over het herstel/de ziekte/het overnemen van werk omdat ze net weer is uitgevallen. \n\nAlleen, ondertussen heeft ze een fulltime baan vanwege die scheiding, is ze er nooit en wordt ze ook nooit vervangen omdat ze tussendoor steeds even werkt en ziekmeldingen pas na 1 of 2 jaar vervangen worden. Heel veel extra werk voor jou dus, en het steeds onverwacht opvangen van haar workload als ze weer eens uitvalt. \n\nEn je kunt er niets van vinden, JE BENT TOCH GEEN MONSTER! Het arme mens vindt het zelf ook vreselijk. \n\nDus je schrijft maar weer een beterschapskaart, leest haar mails aan de afdeling met het ziekte of herstelproces en regelt maar weer een bloemetje vanuit het team. Terwijl je probeert te achterhalen waar ze is gebleven met haar dossiers en haar werk bovenop dat van jou ernaast doet.",
            "Gerbert 58. Werkt op de salesafdeling en houdt van ‘kleedkamerhumor’, maar is eigenlijk altijd racistische shit. \n\nMaar hij heeft het nooit over jou, want jij bent 1 van de goede die accentloos Nederlands spreekt. \n\nEet stiekem zijn snotjes, alleen is dit nooit stiekem genoeg en zie jij m uitgebreid zijn 5-gangen maal verorberen. \n\nWilt t altijd over politiek hebben, maar raakt geïrriteerd als je het niet eens bent met z’n voorliefde voor de VVD",
            "Philip (29): In het proces van een promotie. Werkt 2 dagen in de week nog bij jouw team, maar schept eigenlijk alleen op over hoe belangrijk hij is en maakt jou belachelijk dat je niet weet dat de directeur een nieuwe Porsche heeft. Doet eigenlijk niks, of half maar toch loopt iedereen met hem weg. Hij zit tot z’n elleboog in iedereens reet die ook maar een klein beetje boven hem staat. Spreekt iedereen aan met “vriend”\n\nSimone (38): Procesmanager, ook al weet niemand hoe ze aan die positie komt. Als ze iets in 2 zinnen zou kunnen zeggen, neemt ze er 10 minuten de tijd voor. Ze is  getrouwd met een gescheiden man en probeert een goede stiefmoeder te zijn. Ze is altijd een beetje verstrooid en nooit echt 100% aanwezig.\n\nJessica (35): Heeft al voor 3 levens aan bagage bij zich. Ze is ontzettend onzeker maar “what doesn’t kill you makes you stronger” staat op haar arm getatoeëerd. Ze werkt 5 kwartier in een uur maar wordt altijd overgeslagen voor promoties. Rookt niet, maar staat altijd met een sigaret in haar hand als je haar kant op kijkt.\n\nMaaike (43): Drie keer gescheiden en 2 burnouts verder. Ze is manager van sales en het is publiek geheim dat ze alcoholist is. Ze is altijd binnen 30 minuten dronken op een borrel, maar is vorige week gestopt met drinken. Als ze op kantoor is, is ze extreem luid. Als je iets van haar nodig hebt, krijg je eerst een kwartier gezeur over haar leven. Ze komt altijd aangelopen voor een praatje als jij net aan het werk wilt gaan.\n\nMichiel (51): De selfmade directeur die de afdeling heeft opgezet. Hij zit in zijn midlife crisis en noemt iedereen “dude”. Hij doet alsof hij je kent, maar noemt je altijd bij de verkeerde naam.\n\nJaap (35): Heeft zijn baan te danken aan zijn vriendin, de manager. Ze doen alsof niemand het weet, maar iedereen prikt erdoorheen. Doet altijd heel erg cool, maar doet precies wat zijn vriendin zegt. Op een borrel bietst hij altijd je hele pakje sigaretten leeg.",
            "De zoomer, die alles te veel vindt. En loopt te zeuren over de vibe op kantoor.",
            "Jennifer (25) strugglet met haar gewicht, maar doet alsof er niks aan de hand is. Heeft fases dat ze intens naar de sportschool gaat en dan mealprept. Het kantoor ruikt dan naar vis en broccoli uit de magnetron, want door haar mealprep mag ze geen koolhydraten. \n\nGeert (42) heeft niets tegen homo’s zolang ze maar niet aan hem zitten. Is niet racistisch want had op de basisschool een (1) vriend die oorspronkelijk uit Ethiopië kwam. Is ook niet vrouwonvriendelijk want hij is getrouwd. Maar toch kan Geert het niet laten om continue nare opmerkingen te maken. Ook snap hij niet ‘waarom al die letters nou nodig zijn’ en vraagt hij hardop wanneer straight pride nu gevierd wordt. Wordt boos en zegt ‘dat is totaal appels met peren vergelijken’ als jij antwoord met ‘dat komt tegelijk met de opening van de parkeerplaatsen voor niet-invaliden’. \n\nEls (60). Elk kantoor heeft een Els. Els denkt dat ze de beste secretaresse ooit is en heeft voor iedereen advies over letterlijk alles. Maakt niet uit dat het genoemde advies uit een glossy uit 1988 komt.  Els heeft een kort pittig kapsel en staat er op ‘s ochtends de koffie voor iedereen te zetten, luidkeels klagend dat ze daar eigenlijk geen tijd voor heeft naast haar o zo belangrijke takenpakket. Els zet deze koffie al sinds de eeuwigheid voor je, maar doet er toch ELKE FUCKING KEER suiker in terwijl je dat niet lekker vind.",
            "Die omschrijving van Bernd. Kwam niet meer bij😂😂",
            "Moest echt lachen om brainpower en zn illmatic knowledge",
            "Mijn collega is een roestende spijker wiens baan het is om de hele dag in en uit mijn ogen te gaan.",
            "Ik moest hieraan denken. Zo'n organisatie cultuur lijkt me redelijk close to hell. [https://www.visionair.nl/ideeen/misvattingen/het-verhaal-van-de-brugwachter/](https://www.visionair.nl/ideeen/misvattingen/het-verhaal-van-de-brugwachter/)",
            "Richard, voor wie een dag zonder anderhalf uur zeiken over het management,  de werkdruk en het beleid, niet compleet is. \nGeen werkoverleg zonder kritiek en alle vormen van verandering zijn uit den boze.",
            "Harmjan (42) werkt er al sinds het bedrijf nog klein was en heeft altijd alles 'al een keer gedaan'. Zijn baan bestaat uit elk kantoor binnen slenteren en zijn geweldige ideeen vertellen, die meestal nergens op slaan en vooral slecht voor het bedrijf zijn.\n\nZelf denkt hij dat hij eigenhandig de boel bij elkaar houdt, maar de rest hoopt dattie binnenkort ontslagen wordt zodat ze aan hun werk toekomen zonder dwaas roepgetoeter in hun oor.\n\nDat gebeurt trouwens nooit, want Harmjan is aan de zijlijn geplaatst door de directeur die een zwak heeft voor hem. Hij mag echter nooit meer een team leiden, en je behoort hem te negeren.\n\nDesondanks staat Harmjan toch weer elke dag een nieuw gouden idee te pitchen. Ik ben als onderdeel van mijn straf verplicht hem een schouderklopje te geven en te vragen hoe hij dat idee precies voor zich ziet.",
            "Erik (58) maakt de hele tijd seksuele grapjes. Maar dat niet alleen, hij lacht er zelf ook enorm om. En als je zegt dat hij klinkt als een kalkoen tussen de deur, lacht ie nog harder. Zon vies lachje.",
            "**Henny, 37**\n\nWie is het ook alweer? O ja, die gast die alles wel prima vind en geen mening heeft. Ook geen hobbies of interesses om over te vertellen. De intense saaiheid straalt af naar iedereen om hem heen. \n\nIs zo erg meningloos dat hij gewoon altijd meegaat in wat andere mensen zeggen, puur om confrontatie te vermijden. Als hij tegen je praat heb je na 2 zinnen al zin om uit het raam te springen.\n\n**Michel, 52**\n\nTeamleider. Is eigenlijk gewoon enorm introvert maar heeft veel cursussen gevolgd om beter te worden in persoonlijk contact. Is goed in zijn werk maar niet in het managen van mensen. Dit maakt het alleen maar ongemakkelijker. Zijn baas is blij want de resultaten zijn goed. Zijn werknemers vinden hem enorm ongemakkelijk en houterig. Is ook niet mis van een ongepaste opmerking over vrouwen/buitenlanders.",
            "Elke 45 - is hyper sensitief en gaat op elk geluidje dat je maakt reageren/ vragen stellen met de bedoeling om u op een vriendelijke manier duidelijk te maken dat het haar stoort. Zr kan dit jaren volhouden.",
            "Lijkt me hele toffe collegas. Hoezo hel?",
            "Theo, 55. Plaatsvervangend afdelingshoofd. Zit de hele dag op kantoor achter zijn computer. Theo is vooral met Theo bezig en zo min mogelijk met de aan hem toevertrouwde werknemers. Niemand van zijn afdeling heeft enig idee van wat hij doet. Theo gebruikt graag eau de toilette. Veel. Heel veel. Theo heeft een ander idee van aangename geur dan de anderen in het kantoor. Als Theo je ziet en je hebt geen excuus om te vluchten ben je op zijn minst een uur zijn monoloog over ‘Het fantastische leven van Theo’ aan het ondergaan. Achteraf vraag je jezelf af waarover het gesprek ging en realiseer je je dat je dit uur van je leven nooit meer terug zal krijgen.",
            "José (58) is teamondersteuner. In theorie houdt dat in dat ze het team ondersteunt met administratieve taken, in praktijk houdt het in dat ze soms onder veel gesteun en gemopper iets voor je doet maar dan moet je wel door het stof voor haar. Doet af en toe wat dingen die in de taakomschrijving staan, maar houdt zich voornamelijk bezig met de roddelcultuur op gang houden (vooral als iemand niet voldoende door het stof is gegaan) en becommentariëren of anderen wel genoeg werken. Levert strikt gezien eigenlijk alleen maar meer werk op en heeft de neiging klanten ruw te benaderen waardoor door anderen eerst tijd genomen moet worden voor het gladstrijken van de nekharen. Bij een kritische noot komt er een emotionele uitbarsting (woede of huilen, het is een tombola) en dan komt de manager sussend zeggen dat je José maar even met rust moet laten, want haar man is 5 jaar geleden overleden. Is sinds jaar en dag onderdeel van het interieur, dus haar disfunctioneren heeft nooit enkele consequentie",
            "Richard (67): gescheiden en financieel uitgemolken door zijn ex. Twee kinderen die beide lang en breed volwassen zijn maar schijnbaar hun eigen kont nog niet kunnen afvegen. Is eigenlijk al met pensioen maar is parttime aangebleven omdat het bedrijf echt niemand anders kan vinden. Werkt hier al 20 jaar en denkt alles te weten. Is retetraag, ongeorganiseerd en maakt knoeperds van fouten die hij onder het tapijt probeert te schuiven en als dat niet lukt, geeft hij iemand anders of de situatie de schuld. Reageert als een kleuter op kritiek.",
            "Jan, 62 jaar. Extern ingehuurd ivm een grote migratie.  Is tijdelijk onmisbaar en is daarom in staat voortdurend tergend lange monologen te houden in standup. Maakt graag grappen maar de weg naar de punchline is lang en begint vóór het ontstaan van de eerste levensvorm op aarde. Vorige week vroeg je per ongeluk om vijf voor vijf, met je autosleutels in de hand naar zijn vakantieplannen omdat hij naar de jouwe vroeg. Je staat nu nog je plas op te houden bij de koffieautomaat. Hij gaat met de camper naar zuid Frankrijk. Je telt af tot de verlossing komt, maar die komt nooit.",
            "Oef lastig. Sophie is vervelend omdat ze nep is, maar Harko is ook verschrikkelijk\n\nMijn collega waarmee ik moet samenwerken zal dan Storm heten. Storm is 53 jaar oud en met een volle pens en met een verkapt plat accent verteld hij de meest sexistische oude grappen die 20 jaar geleden ook al matig waren. Hij is luid en schept vaak op hoe vaak het hem is gelukt om troep te verkopen met een belachelijke marge. De achtergrond op z'n telefoon is Andrew Tate.",
            "Mark (34), IT: Functioneert niet en probeert dit te maskeren door altijd anderen de schuld te geven. Wijst bij storingen altijd naar andere teams maar weigert vervolgens mensen bij elkaar te brengen om gezamenlijk aan een oplossing te werken, want dat is niet zijn taak. Geeft als dit niet werkt of doorzien wordt altijd het management de schuld. \n\n\n\n\nOh wacht, dit is een echte collega in mijn huidige werk, dat was niet de bedoeling, of?",
            "Marjan, 35. Komt altijd een half uur eerder om doelloos rond te lopen op de productievloer. Begint zich te mengen met dingen waar je zelf al mee bezig bent. Heeft gelukkig maar 5 stopwoordjes en zinnen die ze maar al te blij door de tent schreeuwt voor de volledige 10 uur. Zegt alles met 5x zoveel detail dan nodig, natuurlijk ook op geluidsniveau luchtalarm.\nEnige voordeel, het lijkt altijd rustig als ze weg is.",
            "Mark (41), zelfde functie. Zitten naast elkaar. Mark denkt dat jullie vrienden zijn vanwege het feit dat jullie dezelfde functie hebben en naast elkaar zitten. Mark is helemaal geen fijn persoon. Heeft altijd extremistische politieke standpunten (kan links of rechts), laat je om 9:30 in de ochtend een filmpje zien van een hele gore porno of iemand die bloederig om het leven komt en kan niet stoppen met lullen over zijn eigen interesses. Vraagt nooit iets terug, wilt elke vrijdagavond een biertje doen en begrijpt never de hint dat je niet kunt. Blijft het elke week opnieuw proberen.\n\nIsa (21), social media marketing. Van Gen Z’ers heb je altijd twee uitersten en zij is de niet leuke. Werkdag start 9:00. Zij komt vrijwel altijd tegen 10:00 want “openbaar vervoer”. Komt altijd ongevraagd een camera in je neus drukken. Durft geen belletjes te plegen. “Kunnen we niet beter een mailtje sturen?”\nZet haarzelf op nummer 1 want “goed voor mental health”. Wanneer je vraagt of zij een deadline zou kunnen halen vraagt ze of iemand anders het kan doen omdat zij toevallig elke donderdagochtend een pilates klas heeft. Heeft om de 4 maanden iets waarvoor ze naar de huisarts moet en kan dan een aantal dagen/weken niet komen want ze moet uitzieken en vervolgens zie je haar op haar Instagram story rennend op het strand in Bali in de zomervakantie.\n\nDouwe (49), office management. Niet de kantoor manager maar houdt een beetje structuur in het kantoor. Titel is naar zijn kop gestegen. Hij zou er in eerste instantie voor moeten zorgen dat de telefoontjes worden opgenomen, agenda wordt bijgehouden en dat de nietjes en koffie altijd op voorraad zijn. Wijst je graag op de “huisregels” van het kantoor. Waarom je 17 minuten weg was i.p.v. 15 minuten. Of je het kopje direct in de vaatwasser wilt zetten. Je kan tegensputteren dat je graag nog een kop koffie wilde en dat terwijl de telefoon overging even was vergeten maar dat wilt hij niet horen. Een slap excuus voor een lakse mentaliteit. Is nooit ziek of op vakantie, 100% aanwezigheid\n\nGert (31), Assistent manager. Zoon van de baas (brainpower dus). Nooit echt hoeven werken. Doet van die uitspraken als “als het teveel wordt ga je toch even een weekje naar boven in de hemel?” Heeft niet door dat alleen hij dat kan vanwege privilege. Nooit tijd voor negativiteit. Alleen positieve uitspraken en een doorzetters mindset zijn geaccepteerd. Doe je dit wel zit je vast in een 30 minuten pseudo motivational speech en loop je achter op je werk. Zegt dat hij een goed woordje voor je gaat doen tegenover zijn vader maar doet het nooit.\n\nJulia (43), PR. Vroeger een beetje populair, nu niet meer. Kattige gedrag is ze nooit van af gekomen. Heeft altijd een opmerking klaar liggen over wat beter kan. Zelf wilt ze het liever niet horen. Ze werkt hier eenmaal het langst van allemaal. Gaat om de 30 minuten een rookpauze houden. Koffieadem gemixt met goedkope parfum. Dunne wenkbrauwen die constant in een frons bewegen als jij een vraag stelt. Vraagt wel wat over je leven maar meer zodat ze kan zeggen “mijn vriend doet ook…”",
            "Wim(46), een mannetje van de trade afdeling die de kwaliteitscontroleurs bij alles wat ze tegenhouden overruled. Wim heeft een partij met voedingsmiddelen met een THT datum uit 2021 door laten gaan, omdat ze alleen maar aan het geld denken. Toen ze deze terugkregen van de klant omdat deze voedingsmiddelen niet meer goed waren en niet te eten waren, was Wim verrast.",
            "Destiny (23) de baliemedewerkster/receptionist die de hele dag tiktoks zit te kijken. Heeft de werktelefoon op stil gezet omdat mensen de hele dag bellen. Heeft het de hele dag over de helende werking van kristallen. 100% de reden dat er de hele tijd klachten binnenkomen dat het kantoor niet bereikbaar is. Denkt dat ze pam is uit the office, zoekt nog haar jim.",
            "Vet lang verhaal om Brainpower te kunnen dissen. Hulde!",
            "Jan-Jaap, manager, minstens 10 jaar ouder dan jij. Komt als je een vraag hebt altijd even meekijken op je computer waarbij hij beide handen op je schouders legt en te ver naar voren beweegt en met zn gezicht in je nek hijgt.",
            "Kevin. De vadsige en kalende ZZP-er die al 12 jaar lang een klein en onbeduidend deel van het werk doet wat ieder jaar \"volgend jaar\" stopgezet wordt. Er wordt daarom geen vaste kracht ingehuurd, waardoor Kevin al 12 jaar lang 3x meer betaald krijgt dan jij voor het werk wat een schoolverlater tegen minimumloon kan doen.\n\nKevin \"werkt\" elke dag van 10 tot half 4, want zo \"vermijdt hij de file\". Behalve op woensdag en vrijdag, dan \"werkt hij thuis\". Hij heeft je vorige week nog laten zien waar je op Aliexpress de beste \"mouse wigglers\" kan kopen zodat je altijd online lijkt op Teams.\n\nHet liefste vermijdt je Kevin, want ieder gesprek waar hij bij zit gaat binnen 32 seconden over Kevin zijn onbeduidende werk of zijn nieuwste complottheorie. Met het EK draagt ook hij een Nederlandse vlag, maar wel ondersteboven. Want dat EK is hoe de illuminatie pedofiele lizardpeople de gevaccineerde 5G-schaapjes zoet houden.\nJij drinkt zeker water omdat het gezond is he? Weet je wel wie in '40-'45 het kraanwater regelde? Precies!\n\nHelaas heeft je baas je net gevraagd om het werk van Kevin over de afgelopen 6 jaar te controleren, dus je ontkomt niet aan hem. Het blijkt een grote puinhoop te zijn die jij moet gaan herstellen. Bij iedere fout die je tegenkomt zegt Kevin \"ach ik heb het maar gewoon zo gedaan, want ik wist niet hoe het moet\". Terwijl jij de puinhoop van Kevin opruimt neemt hij jouw taken tijdelijk over, want na 12 jaar heeft je manager het volste vertrouwen in hem.",
            "Johanna (54) (gefingeerde naam). Alleenstaande vrouw met 2 kinderen die al lang uit huis zijn. De kantoor haaibaai, weet van iedereen te benoemen wat er fout gaat en laat dit graag over de hele afdeling horen. \"Noem geen namen hoor maar...\". \n\nZit al jaren vast op haar functie en heeft voor de afwisseling er een taak bijgekregen waardoor ze zich verheven voelt. Ook dit laat ze graag weten. \n\nBrandt elke maandag los over haar \"wilde weekend\" waarin ze tot laat is opgebleven omdat ze helemaal in haar tweede leven is blijven hangen op 'SecondLife'. Hier vertelt ze met gemak een uurtje of 2 over aan iedereen die het niet wil horen.",
            "Sharon, 52 (AKA de karen backstabber); Iemand die omhoog wou goeien, maar dat niet gelukt is. Omdat ze ongelukkig is met haar eigen gescheiden/\"lage\" leven, heeft ze altijd kritiek op collega's en de werksystemen. Ze maakt zelf meer fouten dan jou, maar als jij een klein foutje maakt, vertelt ze dat meteen aan de manager in de hoop zelf beter te lijken. Ook doet ze dit als je zaken niet op \"haar manier\" doet, terwijl het probleem wel is opgelost. Verder deelt ze vaak bewust geen informatie, zodat ze zelf beter lijkt te functioneren dan collega's, en hoopt echt nodig te zijn. Daarnaast werkt ze op zulke manieren dat het onmogelijk is om aan hetzelfde we werk op te pakken met haar, zoals ; ze pakt al het werk deels op, op zo'n manier dat collega's niet weten wat er nou wel/niet al gedaan is, en dat alle relevante en belangrijke info op haar kladblokje staat zodat alleen zij het kan verkondigen/oppakken. Naar het management is ze totaal het omgekeerde van de negative nancy die ze normaal gesproken is.",
            "Beschuitlul?!",
            "Dit laat me denken aan mijn vriend die ineens anders praat als hij een vriend aan de telefoon heeft. “A’ight a’ight, man, dope.” Dan loop ik even weg uit de kamer want ik trek dat niet.",
            "Kees, de oude chef die blaffend zijn carrière heeft geplaveid tot directeur. Bezuinigd op alles, maar eist wel de hoogste kwaliteit. Micro manager pur sang en dat weet hij, maar anders gaat het he-le-maal mis. Staat iedere week aan je buro zich af te vragen waarom activiteiten niet af zijn en kwaliteit niet goed is. Ouwe jongens krentenbrood netwerk waarbij het belangrijker is wie je kent dan wat je doet. Wordt gezien als tiran van de afdeling en is er trots op.",
            "Johan, 38jaar en hoofd IT( de enige IT’er dus)\n\nHeeft het systeem zelf gebouwd, dus verwerpt elke suggestie ter optimalisatie.\nLoopt heel druk door het pand, waarbij zn sleutelbos van pak em beet 15 dingen meer herrie maakt dan een verbouwing bii de bovenburen.\n\nLunch is altijd in de magnetron opgewarmde kliekjes van zn avondeten, dit is minstens 2x per week zalm..\n\nAltijd te druk voor directe hulp bij problemen, maar als je langs loopt heeft hij of voetbalzone of dumpert op zn scherm staan.",
            "Kees, de sarcastische manager die graag van een grapje houdt. Communiceert veel in passief agressieve toon. Zend graag, ontvangt liever niets. Kees is het liefste de hele dag hardop aan het communiceren hoe zijn dag gaat.",
            "Waarom moet er een doodsoorzaak in deze hypothese zitten? :')",
            "Paul, Willem en Klaas, plannen een jaar van tevoren vakantie in de laatste week van juli en de eerste twee weken van augustus zodat je in je eentje zit en waanzinnig druk bent.\n\nBen als wraak onverwacht met prepensioen gegaan, uiteraard per 1 juli een paar jaar geleden.",
            "Wim (57): Zeikstraal die op alles kleine beetjes verandering of aanpassing weer wat te zeiken heeft. Niet pragmatisch, alles moet volgens de regeltjes. Gaat tijdens vergaderingen met externe partijen de discussie aan over het interne proces. Zeikt over de jeugd die maar 4 dagen wil werken, maar gaat zelf rond kerst 3 weken weg en de zomervakantie 6 tot 7 weken. Maar nog liever heel juni en daarna heel september. Om natuurlijk in juli en augustus te zeuren dat er niemand is.",
            "Mees (52),\nEen kettingroker die elk uur een kwartier buiten staat te roken om vervolgens zijn smerige lucht mee naar binnen te nemen om daarna weer vrolijk naast je te komen zitten.\nHeeft het niet zo op de \"mainstream\" media en volgt alternatieve kanalen. Elke dag is het klimaat onderdeel van gesprek en zegt dat co2 niveaus vroeger veel hoger lagen, dat het allemaal onzin is en water een erger broeikasgas is.\nVerder hoor je hem telkens zeggen dat Nederland naar de klote gaat en dat hij daar wel lekker van kan genieten want hij heeft toch geen nageslacht.\nSinds hij gestopt is met roken, omdat dat een abces in zijn kont heeft veroorzaakt, wil hij elke dag erkenning dat hij zo goed bezig is en dat het zo zielig is dat er pus uit zijn derriere loopt. Toegeven dat dat inderdaad zo is, is de enige manier om van hem af te komen.",
            "Shelley (35 jaar). Heeft 5 jaar geleden een maagverkleining gehad en benoemt dat bij iedere traktatie (inmiddels weegt ze wel weer hetzelfde als vóór de maagverkleining). Heeft alle dingen altijd een tikkeltje erger meegemaakt dan jij en neemt daarom ook altijd het gesprek over als jij iets aan het vertellen bent. Dit hoeft niet eens in het gesprek met haar te zijn; ze spring ook ineens met haar verhaal ertussen als je met een andere collega in gesprek bent. Verder meldt ze zich iedere maand wel een keer voor langere tijd ziek vanwege migraine.",
            "Fabian, 48 jaar oud. Heeft dezelfde functie, maar doet 50% van de tijd het werk niet of niet goed (en dus mag ik het doen). Heeft een ego dat past bij zijn six pack en bovenlichaam (groot, want 6x in de week sportschool en veel kip/rijst eten). Is nog een beetje blijven hangen in de periode dat hij 20 was, dus hij gaat nog steeds alle festivalletjes af (incl. alle feestmiddelen). Dus op maandag 'moeten we maar niet al te veel van hem verwachten'.",
            "Iris (23) - Chief Happiness Officer...\n\nIris is het nichtje van de directeur. In haar studie HRM (6 jaar over gedaan, want voorzitter studievereniging en de UAS was echt ruk) geen stage kunnen vinden, maar ome BrainPower had nog wel een plekje. En toen mocht ze blijven tegen 4k/maand plus lease auto (electrische mini) omdat ze ook naar de andere vestigingen moet als CHO. \n\nIs de drijvende kracht achter de tafelvoetbal-tafels, het vervangen van de koffiehoek door een loungehoek met barista, en het herontwerp van de kantooromgeving met planten muren.",
            "Raymond, 39 jaar oud, medewerker planning en productie.\nWat je noemt een echte company man. Zijn wereld is het bedrijf, en die van jou ook als het aan hem ligt. Geeft vaak ongevraagd zijn advies op een manier alsof hij een kind uitlegt dat één plus één twee is. Gooit jou ook gerust voor de bus als het hem uit komt en delegeert zijn taken als het moeilijk word, liefst naar jou.\n\nChristel 25 jaar oud, klantenservice center/sales\nJong moeder geworden en alles is zo zwaar, daarom was het tijd voor kind 3 en hond nummer 2.\nDe leuke dingen in het leven kosten geld en hier gaan de gesprekken dan ook vaak over als ze weer een of ander onmogelijke vakantie heeft gepland.\nOok heeft ze 16 hobby s, nog een weekend baan en moet ze met de girls nog stappen. Standaard  een half uur te vroeg weg.\n\nGerrit of Maria 48 jaar oud, kwaliteits/complex medewerker(ster).\nIs ook een mooi figuur. na in een burnout te zijn geraakt door  Raymond, is deze gaan soul searche en tijdens die zoektocht de kristal grot in geflikkerd.\nAlles gaat over aura's, de kwartieren van de maan, de sterrenbeelden en de goeroe die hij/zij volgt.  Gebruikt dit ook als valide excuus als het even niet lekker gaat. Want hoe cupidus nu aan de hemel staat heeft invloed op de amethist die ze dragen en dat heeft volgens goeroe paskwi invloed op de mentale gesteldheid.\n\nBert 36 jaar oud, je nieuwe baas.\nBert had eerst een klein bedrijfje in dezelfde branche, na het pensioen van je oude baas heeft hij het overgenomen van de familie. Zijn eerste bedrijf had 1 medewerker en het leidinggeven was makkelijk. Als een echte Stalin zwaait hij de scepter.\nNu heeft deze een visie (net als Stalin) en meer medewerkers, maar om de kosten te drukken na de prijzige overnamen gaat het bedrijf terug naar Excel sheets, papieren boekhouding en word er waar het (niet) kan bezuinigd.\nMaar de teruglopende productiviteit ligt hier niet aan volgens Bert. Alle goedbedoelde raad van de accountant word in de wind geslagen en de medewerkers zijn de rede dat het niet lukt.\n\nEventueel overeenkomsten met de werkelijkheid zijn puur toevallig en hier kunnen geen rechten aan ontleent worden.",
            "Koen, 43, Sales. \n\nVindt zichzelf enorm belangrijk voor het bedrijf. Zeurt dat andere collega's niet zoveel verkopen als hij, maar draagt zelf niet bij aan alle neventaken. Ook worden grote aanvragen een uur voordat iedereen begint met werken al door hem toegeëigend zodat de rest er niet aan kan zitten. Hij is blij dat alles als een team gedaan wordt, terwijl zijn team klaagt dat hij niet als team werkt. Zijn wereld gaat niet verder dan zijn eigen scherm en hij belooft met regelmaat zaken die niet kunnen, maar dan toch echt opgelost moeten worden want 'anders maakt deze klant me af'. Zelf weet hijs echter niet hoe, dus andere collega's moeten dit doen. Is een beetje de clown van het bedrijf, en alles moet vooral heel gezellig zijn. Na lang klagen en zeuren is er eindelijk op donderdag een donderdagmiddag borrel geregeld, want dat maakt het echt gezellig. Vrijdag kan niet want vrijdag werkt Koen thuis. Maar op donderdag moet Koen sporten dus een borrel dat kan helaas niet.",
            "Hahahaha! Ik ben die collega! Zie je daar.",
            "Tinneke, 36. Zij denkt echt dat zij recht op de oren van mensen heeft. Dus, zij verwacht dat mensen de hele dag naar haar verhalen en meningen over letterlijk ALLES en alles dat je mag terug zeggen is \"JA\".\nZij is ook de enige die de werkzaamheden kent en doet haar best om alle nieuwe vrouwelijke collega's weg te jagen.  De mooier de nieuwe collega's zijn,  de heftiger wordt het aanval.\n\nInga, 28. De grootste slijmbal op aarde. Loopt de hele tijd achter de leidinggevende,  probeert te anticiperen ALLES wat hij zou willen en lacht naar ALLES dat hij zegt. \nBonus, zij lacht echt als een varken met een zware griep.",
            "Julia (48) is de visieloze manager die altijd te laat in actie komt. Problemen zijn onvermijdelijk omdat ze nog geen walvis van te voren ziet aankomen. Julia is te druk om stukken en mails te lezen, op mail te reageren en komt overal te laat. Volgens haar werkt ze \"lean\" waarmee ze verhult dat ze niet begrijpt waar het over gaat. Het is volstrekt onduidelijk wat ze ûberhaupt doet, behalve onderweg zijn en bellen. Haar probleem is opgelost als ze een schuldige kan aanwijzen. In je gezicht doet ze overdreven aardig, maar achter je rug om gebruikt ze je bij elke gelegenheid als zondebok.",
            "Michiel (39) van HR. Heeft het idee nog student, jong en \"hip\" te zijn. Zijn kleding stamt ook nog uit die tijd en men twijfelt of hij zelf wel door heeft inmiddels tien jaar en twee maten ouder te zijn. Ook weet men niet zeker of hij nou gel in zijn halflange, golvende haar smeert of het niet vaak wast. Hoe dan ook, men wil het niet aanraken. Je ziet hem een paar keer per dag een babbel maken waarbij hij maar al te graag de net iets te jonge stagiaires opzoekt en flauwe grappen tegen ze maakt. Of hij is met zijn jongere mannelijke collega's bezig een verbale piemelmeting te voeren waaraan alleen hij zelf meedoet. Op bedrijfsfeestjes altijd net iets teveel gedronken waardoor zijn gedrag naar de vrouwelijke stagiaires nog net iets ongepaster wordt.",
            "Marie, 46 jaar oud werkt al 25 jaar op hetzelfde bedrijf, komt binnen en begint meteen te ratelbanden tegen haar collega. Ze praat 10 uur in 8 uur werktijd. Waarvan dan goedgeteld 0,5 uur het daadwerkelijk werk gerelateerd is. Ook is alles op het werk altijd bedoelt om haar meer werk te geven wat heel oneerlijk is. Als ze overging gevraagd wordt te helpen dan kan het niet, weet ze het niet of is ze te druk. \n\nMaar vereist wel dat jij binnen 15 minuten haar een antwoord kan geven op elke mail die ze stuurt.",
            "Peter, 41. Als een van de eerste mensen aangenomen als hoofd gebouwbeheer, een opgewaardeerde conciërge. Op zich niks mis mee, maar doordat hij sinds het begin bij het bedrijf werkt loopt hij rond alsof hij mede eigenaar is. Eet als ontbijt en lunch frikandelbroodjes en vindt dat een maaltijd zonder een flinke homp vlees geen maaltijd is. Staat bij elk gesprek wat je voert ernaast, maar voegt eigenlijk nooit wat toe. Wel ademt hij stevig door zijn neus, wat klinkt alsof er een constructie van kleine oude bamboefluitjes in verstopt zitten. Als je enthousiast probeert te vragen wat hij heeft gedaan afgelopen weekend, zegt hij altijd \"niks eigenlijk\" of \"beetje gefifa'd\".",
            "Anne Marie (52).   \nLoopt steevast vijf minuten achter in elke meeting, maar weet haar oeverloze zinnen perfect te verpakken met een paar nietszeggende Engelse termen als “synergy” en “low-hanging fruit”. Steekt te pas en te onpas verhalen over haar pubers in het gesprek om te bewijzen dat ze een hippe moeder is. Iedereen op kantoor weet echter dat haar opvoedmethoden net zo effectief zijn als een snooze-knop op een rookmelder. Ondanks haar rol in het duurzaamheidsteam, verschijnt ze pas weer echt fris en fruitig na haar jaarlijkse Bali-retraite.",
            "Haha, als ik Harko had geheten had ik deze slogan van je gejat",
            "Glorian (30): zodra hij je ziet begint hij een gesprek waar je niet aan kan ontsnappen. Glorian ziet in alles een complottheorie en praat hierover alsof het feiten zijn (denk: de overheid heeft ons tot slaaf gemaakt omdat we moeten werken en hersenspoelt de mensheid met vaccins tot we hersenloze drones zijn voor onze AI overlords). Hij geloofd ook plechtig in sterrenbeelden en beoordeeld iedereen op basis van hun geboortedatum. Waarom hij altijd uitgerekend met jou praat vraag je? Nou, jij bent een vrouw, en dus kan er meer tussen ons ontstaan. Alle andere collegas vinden hem geweldig. \n\nDeze persoon bestaat echt, zit ik al in de hel?",
            "10 agile coaches per team, iedereen is manager van iets, het grootste deel van het bedrijf maakt PowerPoints of gaat naar meetings om PowerPoints van anderen te kijken. Jij bent de enige die het productiewerk doet.",
            "Roderick.\n\nDe vloer manager met de \"we zijn een familie hier\" en word boos als je een dagje ziek bent en of een uitvaart hebt waardoor je niet kan werken omdat het dan \"de familie niet helpt\". Altijd uncany met zijn positieviteitpraat, en maakt altijd hele slechte grappen bij het water vat.",
            "Brenda, van een moeilijk te schatten leeftijd ergens tussen de 50 en 65. Is één keer teveel gepromoveerd. Ze is de manager dus ze houdt de afdeling als een havik in de gaten, micromanage't alles en iedereen, maar als je haar echt nodig hebt is ze 'druk'. Als je vijf minuten te laat bent trekt ze een kwartier van je uren af (en noemt je onbetrouwbaar), maar als ze jou na werktijd nog een half uur aan de praat houdt over iets onbenulligs mag je niet klagen 'want daar krijg je voor betaald'. Ongeacht of je plannen had die middag/avond.",
            "Oooh leuk! Laten we beginnen. \n\nSam, 30 jaar, marketing. Is manager van het marketing team bij een bedrijf waar marketing nauwelijks een rol speelt. Voelt zich heel wat omdat hij op kosten van de zaak cursusjes mag doen en in het verleden een keer goed heeft verdiend aan een schoolproject. Zit ramvol ideeën, maar iets zinnigs uitvoeren ho maar. Heeft totaal geen idee hoe je als marketeer rendabel kan zijn voor het bedrijf en geeft liever tienduizenden euro’s uit aan gadgets en stickers die hij vooral gebruikt om een posterclub in stand te houden. Ook vind hij het heerlijk om op een sneaky manier te laten weten dat hij een Mercedes heeft en ooit een Macbook gekocht heeft van €5000. Elke ochtend vraagt Sam welke kleur je vandaag bent, rood, oranje of groen. Want Sam wil graag rekening houden met jouw mood, maar niet heus. \n\nDide, 23 jaar, marketing. Het slaafje van Sam. Officieel is zij een marketing coördinator, maar in werkelijkheid is zij niet meer dan een secretaresse die dingen moet notuleren en regelen omdat Sam dat zegt. Ze wil dolgraag de manager rol een keer overnemen, maar omdat dat niet gaat, gedraagt ze zich maar als een kreng tegen anderen. Dide is altijd druk en gestresst. Alles moet in de gemeenschappelijke agenda anders heeft ze geen tijd voor je. Daarbij is ze de kantoor snitch. Alles wat jij doet of zegt, komt bij Sam. \n\nNicky, 24 jaar, management trainee. Een figuur om van te kotsen. Haar LinkedIn staat vol met quotes en posts over hoe zij de toekomst gaat zijn van leiderschap binnen een grote organisatie. Ze komt net van de uni af maar denkt vooralsnog dat ze het allemaal zo goed weet. Ze geeft collega’s een naar gevoel door zich te bemoeien met hun financiën en ze weet zich totaal geen houding te geven tijdens een normaal gesprek. Nicky schrijft mails die totaal niet stroken met haar persoonlijkheid, waardoor ze gezien wordt als een persoon met een ontzettend nep karakter. Met haar incompetentie en afstand tot de rest van de groep, ruïneert zij levens van anderen door ontslagen uit te delen en met leuke feedback sessies te werken. Iedereen haat Nicky. \n\nBram, 28 jaar, teamleider. Bram is teamleider geworden omdat niemand anders het wilde doen. Hij snapt er geen hol van, maar is wel erg trots dat hij de functie heeft. Elke dag praat hij over zijn huizenjacht en wanneer de hypotheek eindelijk rond is praat hij elke dag over zijn nieuwe huis. Bram heeft altijd een mega strak gezicht. Of hij nou vrolijk is, boos, verdrietig of opgetogen, Bram kijkt altijd op dezelfde manier. Bram vind het leuk om zichzelf beter voor te doen dan hij is als hij met klanten en partners praat. Zo is Bram gewoon. Ja we hebben dit kwartaal echt kut werk geleverd, maar hey, raad eens wie volgend kwartaal plannen heeft? Of die plannen werkelijkheid worden is een tweede maar dat terzijde. Lekker Bram, hele deal naar de kloten. Bram eet gruwelijk veel op een dag en heeft de ballen om een compleet onderzoek in de prullenbak te gooien omdat de layout van het rapport hem niet aanstaat. Toppertje. Maar, wel een leuke gast buiten werk om. \n\nEn dan hebben we tot slot Marco, 44 jaar, planning. Zo kaal als een bowlingbal. Marco praat niet veel en komt over als een lomperik. Hij doet zijn werk goed, maar heeft een ontzettend kort lontje. Maak jij een klein foutje, dan slaat hij helemaal door. Terwijl het leven op aarde gewoon rustig door gaat, staat de wereld van Marco in brand. Alles is kut en verdoemd en iedereen moet het weten. Na zijn tirade en paniekaanvallen komt Marco de volgende dag sorry zeggen, om de week erop precies hetzelfde te doen. \n\n\nZeker drie personen uit deze lijst zijn niet fictief en mogen van mij de tering krijgen. Gemene scharminkels dat ze zijn.",
            "Henk, 55, sales manager \n\nZegt “je moet A doen”. Aangezien je Henk al een beetje kent herhaal je “okay dus je wil dat ik A doe?” “Nee nee wacht, doe maar B!” “Okay, dus je wil dat ik B doe?” “Ja ja, dat zeg ik toch” \n\nAls je vervolgens B uitvoert komt hij 5 minuten later verhaal halen “ik had toch gezegd dat je A moest doen!!”\n\n\n\nBert, 47. Niemand weet precies wat hij doet, Bert zelf nog het minst. Komt binnen en gaat zitten. Als jij even je hielen licht komt Bert in actie. Airco gaat aan/uit, radio op een andere zender en alle fakking lichten aan op standje bouwlamp. Als je terug komt erger je je de tering en 5 minuten later is Bert vertrokken om op een andere locatie verder te werken of weer 87 rondjes door het bedrijf te lopen, alwaar hij ook alle lichten aan/uit doet, radio’s omzet, etc etc. Ook “leent” hij vanalles maar komt het nooit meer terug. \n\nRobbert, 55, totaal andere functie dan jij. Vraagt bij alles wat je doet “weet je wel zeker dat dat goed gaat”??",
            "Berend (53). (Ja, er zijn er een hoop mannen van 53 op dit kantoor, trek er zelf je conclusies over.) Vroeger was hij je manager, maar hij was nou niet zo'n goede teamleider en zat ook vooral te klagen dat hij door alle vergaderingen en overleggen niet meer aan het echte werk toe kwam. Hoger management had dit ook wel door en iemand anders heeft het stokje overgenomen en Berend is afgescheept met een nietszeggende titel van plaatsvervangend teamleider en moet nu het echte werk weer doen. Ondanks dat hij zijn vorige functie haatte heeft hij nu een permanente deuk in zijn ego en kan geen enkele weerstand met accepteren. Loopt boos weg als je vraagt uit te mogen praten in een vergadering, \"je had niet meteen zo kattig hoeven te doen\". Maakt niet uit dat hij je de eerste twee keer dat je het vroeg straal negeerde. Je wordt geacht elkaars werk te controleren. Bij jou legt hij op elke slak zout. Bij hem mag jij alleen ja en amen zeggen, enige suggestie dat er iets niet perfect zou zijn wordt als vijandig beschouwd en als je voet bij stuk houdt loopt hij boos weg. Houdt vol dat hij geen seksist is, maar is nog nooit bij een man schreeuwend weggelopen uit een situatie waar hij zijn zin niet kreeg.\n\n  \nEn dan is er ook nog de nieuwe teamleider. Capabeler dan Berend, maar heeft wel een \"waar twee vechten hebben twee schuld\" mentaliteit dus je had altijd aardiger moeten zijn.",
            " Canta, 48 jaar werkt voor afdeling HR. Moet tussen jou een een collega mediated betreft een conflict. Zij geeft jou de schuld van het conflict, en beschuldigt jou van racisme. Om dat je collega een donkere huidskleur heeft en minder dan 10 jaar geleden is gemigreerd . Praat over hem dat ze trots is op hem, als of het haar eigen kind is.\n\nNiet weten dat je zelf ook een imitatie achtergrond hebt.",
            "De meeste collegas die ik had.",
            "Gemene boys en safia (zogenaamde beste vriendin)",
            "Kantoor? Waarom zou Lucifer mij in een kantoor aan het werk zetten en niet in de martelkamer? Ik ben nou eenmaal iemand die met zn handen werkt.",
            "Bemoeizuchtige managers en finance mensen. Gooi er wat PR mensen en HR mensen bij, en ik voel me niet op m'n gemak.",
            "Jasmijn en die bol.kadom chick",
            "Anita, 56 j. Heeft de allernieuwste flagship telefoon, maar begint te steigeren als je voorstelt om ipv alles handmatig op te schrijven, een Excel bestand te maken. Haar standaard antwoord is \"Zo doen we het al 20 jaar!!\". Weet altijd alle roddels, lult met iedereen mee over iedereen, maar \"je kunt me wel vertrouwen, over jou zeg ik niets\". Neemt net lang genoeg pauze om haar eten naar binnen te schuiven, om snel weer aan het werk te kunnen, en verwacht dat anderen dat ook doen.\nHoudt bij hoevaak je naar het toilet gaat, en geeft dit door aan de leidinggevende.\n\n\nEigenlijk is dit gewoon precies een beschrijving van een oud collega. Heel dankbaar dat ik daar niet meer werk.",
            "Wat een fantastische herkenbare verhalen, hahahaha.\n\nVishal, de externe (ingehuurde) IT quality tester. Hij test de software die ik bouw volgens een vast patroon op allerlei devices. Hij vind de meest exotische bugs die niet reproduceerbaar zijn. Hij heeft een negatieve leercurve en is tijdens calls onverstaanbaar. Elk half jaar gaat hij terug en komt er een nieuwe Vishal, Arjun, Krisha of Manish voor terug en begint de hele cycle waarbij je het hele process moet uitleggen weer opnieuw.",
            "\n\nIrene, (40) \nManager maar weigert met je in gesprek te gaan over je burn-out en vind dat je je aanstelt. Doet geen fuck op het werk en zit alleen maar online te shoppen en koffie te drinken en te kletsen met collega’s\n\nMaria (60) is “eigen baas” maar werkt hiernaast om rond te komen en wilt dat je ook eigen baas wordt en neemt eerst de “moeder/therapeut” rol aan en wil vrienden worden zodat je geen keus hebt maar te vallen voor haar piramide spel.\nWordt niet ontslagen als je het verteld tegen de manager die zegt dat ze dat bij iedereen probeert en dat ze in gesprek gaat erover. Maria gaat overigens elke maand op vakantie en werkt daar “thuis” \nJe kunt niet om haar heen omdat ze je altijd opzoekt\n\nNooit meer kantoor voor mij lol",
            "Maar vervang Brainpower door een willekeurige \"coole\" character gespeeld door Oscar Aerts 🤣🤣",
            "Effe wat anders: dit zouden prima personages zijn voor een film. Of een serie.",
            "Joun hell is mijn hell…\n\n\nEn die sophie heb ik real life als me buurvrouw",
            "mijn vorige manager dje mee een hele donderpreek gaf over een naamplaatje dat ik niet droeg nadat ik haar vertelde dat mijn moeder kanker heeft",
            "Toch wel grappig dat 9/10 van de genoemde mensen 50+ is loop",
            "Oh nee... 12 uur werken in een saaie kantoor omgeving. Jij noem het hell, ik noem het 20 jaar van mijn leven.",
            "Mona Keijzer, Dilan Yesilguz, Henri Bontenbal, Pieter Omtzigt en Caroline van der Plas",
            "Mijn kantoor bestaat uit tuinen en planten perken (groen onderhoud).\n\nDus tussen de helse vlammen door onkruid weghalen, samen met:\n- Marc D.\n- Donald T.\n- Pim F.\n- en Geert W.\n\nZou voor mij een enorme hel zijn, maar… hun hel zal erger zijn: w e r k e n zullen ze (en voornamelijk tussen de brandnetels, distels, overige doornstruiken en Reuzen Berenklauw)!!",
            "De hel bestaat niet, net als de hemel en alles wat je daarna vertelt is om die reden volkomen onzinnig.",
            "Hoi satan doe je even rustig?",
            "Oef, deze zit diep merk ik",
            "Ik zit nu in deze situatie  - dit klopt zo erg dat ik maandag nog in een deuk lig.",
            "Shieeeet",
            "\"Klaas\" is de belangrijkste reden dat ik bij mijn vorige opdrachtgever vertrokken ben. Bemoeide zich met alles, vond alles wat ik deed niet goed en vrijwel elk kritisch mailtje over mijn werk ging in de cc naar de teamleider.   \nStuurde hij een mailtje naar mij (TL in de cc) dat hij al aan half jaar niks gehoord had over het werk en dat ik mijn werk dus niet deed.  De teamleider ging in eerste instantie volledig mee in zijn verhaal, totdat ik mijn \"sent\" liet zien in outlook waarin ik hem continu vroeg om reactie op eeen ontwerp zodat we verder konden.. \n\n  \nDe excuses van de teamleider na een kwartier doorgezaagd te zijn waren voor mij onvoldoende. Tijd voor een nieuwe plek.",
            "De betweters zijn het ergst..",
            "Man man man.",
            "Toch niet de Klaas die bij een bedrijf op de Maasvlakte werkt, hè?",
            "Deze is heel herkenbaar",
            "Als iemand een burn out heeft gehad, ga ik hem echt niet verwijten dat hij niet meer zo snel is. Dat vind ik geen argument.",
            "Fuckin Klaas.",
            "Oei die is geweldig beschreven. Bloedirritant, nu al 😀",
            "Ach ja vreselijk dit soort types. Meestal zonder kinderen en daardoor geen inlevingsvermogen en geen besef van de acties. Wel goed bedoelt maar alsnog.",
            "Waarom praat je er niet over met hem? In ieder geval dat hij jouw prints leest lijkt me niet acceptabel gedrag.",
            "Jeetje.\nIk durf te wedden dat ze die tonijn opwarmt in de magnetron. Lang. Op hoge stand. \n\"Om zeker te weten dat alle bacteriën dood zijn\"",
            "Je hebt nog een betere hel collega voor mij omschreven dan dat ik zelf kon verzinnen. Draagt ze ook een luipaardprint?",
            "Volgens mij kom ik haar regelmatig tegen in de trein",
            "Oh die nagels, vreselijk 😭😭",
            "Ik denk dat ik dit de ergste vind tot nu toe. Iemand die eigenlijk niks opzichtigs verkeerd doet, maar gewoon het bloed onder je nagels vandaan haalt. Heel goed.",
            "Dit is zo treffend. Net laten lezen aan mijn vrouw en die wist ook precies zo'n collega op te noemen. Wauw.",
            "Als er een gemiddelde Nederlander bestaat is het Marcel denk ik",
            "Besef dat Marcel \"pas\" 38 is en dit de komende 10 jaar in rap tempo erger gaat worden",
            "Heeft hij een elektrische bakfiets waarin Jip en Rijna naar de opvang gebracht worden? \n\nEn een Nissan Qashqai? \n\nMarcel werkt hier volgens mij.",
            "Hey dat doe ik, sorry daarvoor!",
            "Ik ken een Conny. Ze is ook overtuigd dat er niets met haar is en al haar problemen aan anderen liggen waardoor ze steeds opnieuw in een burnout komt. Inmiddels nummer 6 in 6 jaar. Ze weigert therapie of welke vorm van hulp dan ook.",
            "Conny deelt ook veel op Facebook en gebruikt daar onnodig veel emoticons.",
            "Ik had een Conny als collega. Addendum: de plotselinge woedeuitbarstingen en geloof in complotten omdat een deel van haar emotionele instabiliteit onder de oppervlakte zit. Maar nooit voor lang.",
            "Haha wow, we hebben een winnaar.",
            "De Conny op mijn werk heeft geen wenkbrauwen en haar ex man is er vandoor gegaan met zijn beste vriend. Die is nu zo rijk dat hij de kinderen mee kan nemen naar Disneyworld en rondreis door Amerika. Conny zonder wenkbrauwen blijft alleen achter met haar 9-5 baan en alle roddels over haar ex man",
            "Ik weet vrij zeker dat tik weer waar Irene werkt nu ze nog niet in de hel is.",
            "Klinkt als de hond vd buren",
            "Deze! Het was nota bene mijn chef! Ze printe alles uit en vroeg altijd om confirmatie aan een duur accountantskantoor dat elk telefoontje van haar voor 150,- berekende. Zo dom als het achtereind van een varken.",
            "Deze herken ik wel, maar dan in de leeftijd 40-55. Elke dag weer zeiken over de kleinste dingen. En je moet er echt voor waken dat je daar zelf op termijn niet in meegezogen wordt en ook een chagrijn wordt",
            "Ik ken deze Judith maar ze is 34. De rest klopt.",
            "Dit is genoeg materiaal voor een nieuwe nederlandse serie. Een soort van kruising tussen 'The Good Place' en 'The Office'.",
            "Volgens mij zit ik ook in dezelfde ruimte 🥲",
            "Je zou verwachten dat sirCries-a-lot wel goed met Maria's gehuil om zou kunnen gaan",
            "Ik geloof dat ik weet waar Maria (gefingeerde naam) werkt nu ze nog niet naar de hel is.",
            "Oh wow. Deze wint voor mij. Ik ben nu zo geirriteerd dat ik ga stoppen met lezen. Heb het voorgelezen aan mijn partner en die had de schouders ook direct naast de oren zitten. Zeer goed verzonnen.",
            "Debet is deur en credit raam zei de docent handel vroeger",
            "Ja, die mensen die zelf geen familie hebben, en dat dan compenseren met constant team building activiteiten te willen doen. Het erge is, de baas die team building wil stimuleren is juist gek met hem.",
            "Yugh, die ken ik. Thuis vrouw en kinderen die worden verwaarloosd, op kantoor de \"toffe peer\" uithangen. Heeft een ziekelijke behoefte om \"one of the guys\" te zijn en bij \"the cool kids\"  te horen, terwijl die groepjes er helemaal niet zijn. Continu vrouwen lastigvallen met te sneue dubbelzinnigheden, de boel zo organiseren dat de stagiaires met hem alleen zijn en het slachtoffer uithangen als er wat van gezegd wordt. Bij extreme pech heeft Martijn ook een veel te strakke broek aan waarvan de gulp op springen staat.",
            "Op deze zat ik te wachten!",
            "Ik ken een Bob die precies zo is. Hebben wij het over dezelfde Bob?",
            "Het enige wat ik enigsinds kut vind, is dat hij gouden bergen belooft, en dat anderen hier harder door moeten werken. Verder is het zeker niet de ergste collega.",
            "Lijkt mij de beroertste niet! Tenminste geen azijnzeiker.",
            "Je weet dat we regels hebben tegen doxxen he.",
            "Deze is zo accuraat😂",
            "Deze heb ik ook op kantoor. \n\nVond thuiswerken zelfs tijdens de pandemie maar onzin dus bracht nog steeds zoveel mogelijk tijd op kantoor door. Na de pandemie meteen weer voltijd op kantoor gaan werken. Klaagt altijd bij de koffieautomaat over de mensen die die dag thuis werken. Klaagt ook altijd als er iemand digitaal aan een overleg deelneemt hoe slecht dat werkt, ook als niemand anders problemen ervaart. Plant overleggen met je in zonder in je agenda te kijken of af te stemmen en is dan boos als je niet kan. Meldt zich zelf 2 uus voor een overleg af wegens \"andere prioriteiten\", ook als iedereen's werk op dat overleg wacht om verder te kunnen. Weigert alles wat niet 'bij zijn functie hoort', al is het een e-mail doorsturen naar een andere collega.",
            "Whahahahahaha zelfs de naam en leeftijd kloppen hahahahaha",
            "Waarom ken ik Peter ook 😭",
            "Hehehe",
            "Maar uit uitvoerig onderzoek door Harko blijkt dat iedereen haar zou doen.",
            "Een blok kaas is een schimmel cultuur en in theorie dus intelligenter dan Charmaine.\n\nMáár is ze wel leuk om naar te kijken? Anders wordt het helemaal een zware tijd in de hel.",
            "Met zo’n voornaam verwacht je ook niet anders. Alleen een Destiny of Charity is waarschijnlijk nog erger.",
            "Oh shit ik ken haar.",
            "Dit is toch gewoon elke stagiaire van tegenwoordig.\nGeen idee wat er op school gebeurt maar veel is het niet.",
            "Oh ja! Nee ik had er ook zo eentje van Marketing, die was ik nog vergeten op te schrijven. Maar inderdaad, linkse woke lui van Marketing of HR die je dat soort woke dingen opdringen, en kijken alsof ze water zien branden als iemand een andere mening heeft.",
            "Als de naam niet gefingeerd is denk ik dat ik deze persoon ken 😂",
            "Heel herkenbaar. Maar voordat ie naar de helpdesk belt komt hij met zijn ict problemen bij mij want ik ben een millennial “en weet iets van computers”.",
            "Zorg dat jouw manager klaagt bij de manager van Peter. Oude spullen van boomers zijn vaak ongeupdate beveiligingsrisico's.",
            "Contact opnemen met bedrijfsarts of eventueel UWV als je ziekmelding niet geaccepteerd wordt. In principe ben je zelf in Nederland degene die besluit over of dat je te ziek bent om te werken of niet. Enige wat hier tegenin kan komen is een beoordeling op werkweigering, maar dat is erg moeilijk hard te maken.",
            "Gratis voetenfoto's? Nee, Harry kan zelf op het internet kopen.",
            "En het liefst komt Henk om 5 voor 5 met iets urgents waardoor je uren moet overwerken, terwijl het achteraf helemaal niet zo urgent bleek te zijn. Overuren mag je echter niet schrijven, compenseer de uren maar een keer. Maar die keer komt nooit want er is altijd een reden dat je het niet op kan nemen.",
            "Absoluut! Leuk toch?",
            "Klinkt gezelliger als die stelende consipracy snuifduif bij mij op werk. Iedereen is altijd heel behoedzaam op zijn of haar portemonnee als die oude crackjunk weer dienst heeft. En iedereen zucht in koor als hij weer eens over Covid of aliens begint.",
            "Tenzij het examen buiten werktijd valt ruikt dit al heel erg naar werkweigering.",
            "Als je ook managers mag toevoegen? Eens met je bijdrage, maar eentje die ik heb meegemaakt:\n\n  \nAnnelies! Manager van een ICT afdeling die zelf totaal geen verstand heeft van software. Is zover gekomen via slangenkuil-eigenschappen en vooral amateur psychologie: Als je niet blij kijkt, ben je niet gemotiveerd. Dat wil dus zeggen probeer je een probleem op te lossen. Lukt het niet, en heb je er een beetje de pest erin, juist omdat je gemotiveerd bent het te fixen? Gaat zij denken dat je gedemotiveerd bent, want ... je kijkt niet blij. Amateur psychologie. Effect. Zodra ze langs komt begin iedereen fake te lachen en blij te doen want dat is goed voor je jaarlijkse beoordeling.\n\nOh als die bij de koffieautomaat stond, stelde ik het koffie tappen een kwartiertje uit.",
            "Klinkt als ongeveer elke calco en qqwest junior mendix engineer.",
            "Overhemd met bloemetjesmotief",
            "Wat is er mis met F1?",
            "Hij schijnt het archief in de kelder wel efficiënt te hebben ingedeeld.\nIk dacht trouwens dat de kelder daarvoor altijd groter was. 🤔 Maar dat zal wel aan mij liggen.",
            "Marc zet zich keihard in om meer jeugd op de werkvloer te krijgen. Er is altijd wel een stageplek beschikbaar. \n\nGek genoeg zijn het overwegend minderjarige meisjes die Marc aanneemt als stagiair.",
            "Mag dat niet dan?",
            "Weet vreemd genoeg wel hoe Teams werkt. Als de andere collega's naar huis gaan - en er dus niemand meer op zijn Teams berichten reageert - dan merkt hij dat er nog werk is dat door hem moet gedaan worden. Ach ja, dan werkt Rob maar weer langer dan de anderen; overuren verdienen goed en hij kan ze later toch terug opnemen. Heeft een collega, Sjaak (26) die zelden overuren werkt, maar wel steeds vreemd kijkt wanneer Rob zijn zuurverdiende overuren opneemt. Rob vind dat de jeugd wel eens wat productiever mag zijn in plaats van steeds op hun mobieltje te zitten tijdens de werktijd.",
            ">weet niet hoe de computer werkt\n\n>uitgeprint naast de pc\n\nValt nog mee dat Rob weet hoe hij moet printen. :) Had verwacht dat hij de instructies met balpen op een briefje zou schrijven.",
            "Zo een Serviër kende ik ook maar dan een vrouw. Ze had een onuitspreekbare naam maar werd \"screenshot\" genoemd omdat tijdens demos om screenshots ging gillen.",
            "Zijn reactie op elk probleem dat aan hem voorgelegd wordt is tevens ‘ja, maar hoe vaak komt dat nou eigenlijk voor’ om daarmee het probleem volledig te negeren. Enkel de problemen waar hij zelf last van heeft worden meteen (slecht) opgelost. \n\n\nIk denk dat ik een Reinier ken.",
            "Emma heeft waarschijnlijk dyscalculie en autisme wat een bekende combi is",
            "Ja ik had er zo een. En omdat hij zo dik was, moest constant de airco zo hard aan, dat de rest in de zomer binnen met een jas of een trui aanzat.",
            "En zijn bureaustoel kraakt en piept.",
            "Die Michiel!",
            "Deze comment heeft wel een negatieve vibe hoor",
            "Ik kan me 100% vinden in het geklaag van een zoomer",
            "De fuck is een zoomer nou weer?",
            "Voor een komisch effect",
            "Ja sommige mensen moeten in ieder onderwerp politiek erbij halen.... Doei,. Ook trouwens 1 van de dingen die irritant zijn aan collega's: Mensen die op ieder onderwerp even hun politieke mening moeten ventileren.",
            "Jammer!\n\nIk dacht dat de vraag hier heel duidelijk was: wat is jouw persoonlijke hel?\n\nHelaas wordt mijn persoonlijke hel hier gedownvoted (kennelijk te politiek gevoelig?), en lijkt het er enorm sterk op dat alleen maar “sociaal onbelangrijke typetjes met stereotype namen” geaccepteerd worden.\n\nMet andere woorden, als ik “Peter; politiek leiders type met extreme normen en waarden, die aan iedereen die niet puur Nederlands is een hekel heeft” had gebruikt (in plaats van “Geert W.”) was het wèl geaccepteerd?\n\nMaakt mijn hel echter voor mij wel een heel stuk minder persoonlijk! Jammer dus.",
            "\" Hee, collega, ook hier?\"",
            "Als je er maar weer uit komt",
            "Sterkte. Scherm afsluiten als de collega binnenkomt of even weg moeten. Thuiswerken is helemaal een goede optie",
            "Heftige stelling dat mensen zonder kinderen geen inlevingsvermogen en geen besef van acties kunnen hebben.",
            "Dit was een wat extreem uitvergrote versie van een collega, die gelukkig niet elke dag langs mijn bureau kwam. Wel wekelijks. Maar graag de stukken van je bureau pakte om er commentaar op te geven, want oude functie en (veels te erg) betrokken bij de organisatie. En ook nog oud leraar. Ik ging meestal maar even naar de wc/ik moet dat nog even navragen bij een collega/andere lulsmoes. En beeldscherm ging op zwart. Want als je van je bureau weggaat moet je beeldscherm op slot.",
            "[Iedere dag is tonijn dag](https://www.reddit.com/r/mildlyinfuriating/s/hDjVkzxCCR)",
            "Natuurlijk maar dat was toch al gezegd? Ze heet Jennifer. Wel opletten hé?",
            "Geef haar eens ongelijk.  Meeste therapieen zijn gewoon geldrovers :p",
            "en vooral geen interpunctie of leestekens waarom zou je die gebruiken je kan toch prima zelf lezen wanneer die er zouden moeten staan dan nog wat gekke verkeerd geïnterpreteerde emoticons pluspunten voor overduidelijke ge-auto-correcte woorden die voor extreem ongemakkelijke zinnen leidt",
            "Man is ervandoor gegaan met de overwaarde en alimentatie kan ze wel vergeten. Net als de keer ervoor. Haar nieuwe vlam zit in de intakefase van de schuldsanering óf is in de jaren '80 afgekeurd op rugklachten toen hij 19 was ofzo.",
            "Inderdaad. Ik ken een heel battalion in de leeftijdscategorie die jij noemt.",
            "Er kan maar 1 drama queen op de afdeling zijn, en dat ben ik!",
            "Die heb ik nog nooit gehoord.",
            "Ja.",
            "Niemand zit op bob te wachten\n\n🤣",
            "Hoi bob",
            "Jij kent hem ook? 🥲",
            "Ligt eraan, hou je van moddervet, tijgerprintjes en opgespoten lippen?",
            "Nou, ik werk samen met zowel linkse als rechtse mensen. En als er iemand de boel bijelkaar schreeuwt vanwege een politieke discussie, dan zijn het vrijwel altijd de pvv aanhangers. Maar ik ben dan de vieze \"extreemlinkse figuur\", als ik vraag of ze stil kunnen zijn, terwijl ze het halve gebouw bij elkaar gillen hoe alle Turken en Marokanen moeten opflikkeren naar hun eigen land.",
            "Ik werd op mijn eerste serieuze kantoorbaan uitgeroepen tot \"ICT-expert\", omdat ik onder de 30 was, computerspellen speel en snapte hoe het factuursysteem werkte (ik was als enige van de afdeling naar de cursus van 2 uur gegaan).\n\nIk ben serieus als adviseur op een IT project gezet om deze redenen.",
            "Ik denk niet dat het uwv je komt helpen in de hel",
            "Hoewel dit based on a true story is, werk ik daar gelukkig niet meer. :)",
            "Het internet in de hel is van 200 mbps op belasting sites maar kan noch porno noch games laden",
            "Ik vind het geweldig. Smullen dit.",
            "Ik krijg echt supervaak Calco advertenties. En het klonk wel tof. Zijn de mensen daar echt zo :(?",
            "Jullie kennen Otto?",
            "Specifiek met F1 is helemaal niks mis. Al die puntschoenen die op maandag de race gaan bespreken alsof ze zelf Adrian Newey zijn maar nog nooit een andere racesport hebben gekeken want \"Verstappen\" Als je dan uitlegt dat je naar de Nürburgring gaat voor een 24 uurs race krijg je het antwoord. O ja maar daar is geen formule 1 he. Interessant doen om interessant te doen. Vaak zijn het ook van die mensen met 2 kids, elk jaar naar Italië want wel dezelfde plek. Eigenlijk nooit iets meegemaakt maar meneer heeft ook ooit een Surinaamse buurman gehad dus bakabana kent hij wel. Zulke shit.",
            "Dat printen heeft de stagiair voor hem gedaan.",
            "Dat is op zich dan weer logisch, want waarschijnlijk kan ze tijdens de demo's het Engels niet volgen en dan wil ze een andere manier om te begrijpen en te onthouden wat er getoond en uitgelegd werd.",
            "Ik heb het niet over serieus kritische mensen die hun kritiek onderbouwen maar over de mensen die hun kritiek niet onderbouwen en dat wegwuiven in bureaucratisch geneuzel, ik zit nu bij een bank en die organisaties zijn daar echt heel sterk in.",
            "Zo bekend, dat bijna alle gen-Z-ers waarmee ik heb gewerkt, er last van hebben..? \n\nHet is een bekend probleem dat deze generatie massaal niet durft te telefoneren, en op school/van huis uit onvoldoende heeft geleerd klokkijken en hoofdrekenen. \n\nDaar staat tegenover dat ze veel beter zijn in grenzen aangeven, dus ik weet niet of het een achteruitgang is of gewoon verandering.",
            "Gen-Z\n\nVariatie op boomer.",
            "Nogal een domme stelling idd",
            "Niet helemaal gek, heb er ooit een filosofische dialectiek over gelezen, immoreel en weinig inlevingsvermogen komt toch echt duidelijk vaker voor bij mensen zonder kinderen. Als je wil kan ik de argumentatie wel wss nog ergens vinden!👍",
            "*pssst, mensen hierboven, ze staat achter je*\n\nHeee, Conny, alles goed lieverd?",
            "Ik😂",
            "Denk zelfs in het meervoud 🥶",
            "Mijn geheime fetish.",
            "Wimpie (58)",
            "Dus de hel heet de Verenigde Staten?",
            "Oké die kant van het verhaal.\nJa die kan ik ook wel schieten.\nEn eigenlijk kijk ik uit naar de dag dat Verstappen met F1 gaat stoppen.",
            "Ik ben technisch ook gen-Z (‘97) maar heb wel officiële diagnoses sinds kinds af aan. Mensen gooien het wel makkelijk op maar nee, niet iedereen heeft het. \n\n\n\nWat je schrijft over Emma doet mij het wel denken aan een mogelijkheid maar goed, ik ken Emma niet persoonlijk. Vooral over de werkinstructies ken ik mijzelf aardig terug. Ik hoor en begrijp het best wel maar mijn hoofd is te druk om te reageren of ik ben zoned out (te veel prikkers op dat moment)",
            "Ah zo Gen Z die op hun 25ste ouder eruit zien dan millenials.",
            "Getuigt van een gebrek aan inlevingsvermogen, laten we hopen dat hij/zij geen kinderen heeft.",
            "Conny: beent naar buiten voor de derde rookpauze die dag om met een Camel tussen haar trillende vingers af te koelen.",
            "Was er nog vergeten bij te vertellen dat hij ook graag ongevraagd een Jiskefet imitatie doet en oplossingen heeft voor de gehele wereldproblematiek.",
            "Dankjewel voor je openheid! ‘Emma’ is een compilatie van eigenschappen die ik veelvuldig heb gezien bij de jongere werknemers. Ik durf dan ook te betwijfelen dat zij allemaal massaal autisme en discalculie hadden. \n\nDesondanks ben ik jaloers op hoe ze hun grenzen aangeven, op zo’n jonge leeftijd al. Een gen-Z’er gaat ECHT niet doen waar ze geen zin in hebben, en dat vertellen ze ook gewoon. Lastig voor werkgever op korte termijn, maar mogelijk goed op lange termijn.",
            "Camel light* \n\nJe wil natuurlijk geen kanker krijgen he!"
        ]
    },
    "Omvolking?": {
        "title": "Omvolking?",
        "score": 105,
        "url": "https://i.redd.it/aojy1b4xn28d1.jpeg",
        "content": "De laatste dagen zie ik veel ophef over de term “omvolking”. Dit vind ik begrijpelijk gezien het woord, al klinkt het neutraal, oorspronkelijk uit het Nazi-gedachtengoed lijkt te komen. Daarnaast wijst het volgens de definitie op het planmatig vervangen van een bevolking, wat het technisch gezien inderdaad een complottheorie maakt.\n\nAan de andere kant kunnen we moeilijk ontkennen dat er in West-Europa een ethno-demografische verschuiving gaande is. Het aantal Nederlanders met een niet-Westerse migratie-achtergrond is de afgelopen decennia toegenomen, en ze krijgen gemiddeld meer kinderen.\n\nAls deze trend zich voortzet (wat niet met zekerheid te zeggen is) kan dit er op lange termijn toe leiden dat autochtone/blanke/witte Nederlanders die lang de meerderheid van de bevolking hebben uitgemaakt, een minderheid zullen gaan vormen.\n\nEven los van of dit je waarschijnlijk lijkt, en wat je van dit (hypothetische) fenomeen vindt. Wat zou een gepaster woord zijn om het te omschrijven?",
        "num_comments": 267,
        "comments": [
            "De term waar je naar opzoek bent is 'vervangingsmigratie', ['replacement migration' in het Engels.](https://en.m.wikipedia.org/wiki/Replacement_migration)\n\nHet verschil in de kern is dat omvolking de moedwillige intentie verondersteld van een 'elite' of overheid en dat vervangingsmigratie een fenomeen is dat nou eenmaal plaats vindt als daar economische en demografische redenen voor zijn.",
            "In je post doe je alsof het eigenlijk vooral een beetje een semantische discussie is. Maar dat is het niet. De demografische veranderingen die jij beschrijft zijn helemaal niet hetzelfde fenomeen als omvolking. Omvolking als term impliceert een soort sinister complet van 'de elite' om demografische veranderingen te forceren in combinatie met een racistisch/ethnische hiërarchie die impliceert dat bepaalde 'demografische elementen ' minderwaardig zijn. Dat is iets heel anders dan zomaar een veranderende samenstelling van de bevolking.\n\nKom dus alsjeblieft niet aan mee die soort 'ja nou ja potato potato we weten toch waar we het over hebben, namelijk over veranderende bevolkingssamenstelling'. Omvolking is echt iets heel anders.",
            "Mensen kunnen hoog of laag springen wat ze willen wat betreft deze term, het is en blijft een term die door Nazi Duitsland werd gebruikt voor de plaatselijke bevolking die zou worden verdrongen en ondergeschikt worden gemaakt.\n\nDan is het denk ik vooral de vraag of je je daarmee wilt (laten) associëren. Lijkt mij van niet",
            "Ik vind etnische verschuiving niet interessant, maar maak me wel zorgen om culturele veranderingen",
            "Het is het best te vergelijken met de migratie van de Germanen naar wat vandaag de dag Engeland is. Dat is geleidelijk gegaan (honderden jaren), en waarschijnlijk ook op uitnodiging van de Kelten zelf. Ook zijn de Kelten als grootste bevolkingsgroep vervangen door Germanen. Hoe je het noemt is verder minder belangrijk.\n\nMaar het is zeker niet iets waarvan ik hoop dat het in West-Europa gaat gebeuren met betrekking tot de grote aantallen niet-Westerse migratie.\n\nDe grote migratie lijkt me een gepaste term, als modern equivalent van de volksverhuizingen. Het hele complotterige van de term omvolking moeten we niet willen gebruiken.",
            "Waarom moet er een specifiek woord voor zijn? Je kan als je het over dit onderwerp hebt toch gewoon praten over de gevolgen van massa-immigratie,  de etnische verandering van de bevolking, een etnische verschuiving, of, als je er echt heel nodig 1 woord voor wil hebben, dan zou je iets kunnen verzinnen als: volksverandering.\n\nHet is echt niet zo moeilijk om hier een andere term voor te verzinnen die niet geleend is van de Nazis.\n\nDaarnaast kan je je ook nog eens afvragen in hoeverre dit wel de correct probleemanalyse is. Je afkomst of huidskleur is namelijk niet bepalend voor wat je geloofd, denkt, doet of zegt. De reden dat mensen over dit onderwerp praten, is echter vrijwel altijd wel gebaseerd op die aanname.\n\nJe hebt deze term dus helemaal niet nodig om de daadwerkelijk problematiek te bespreken. Zo zou je bijvoorbeeld kunnen zeggen dat er te veel immigratie is in een korte tijd, wat de sociale cohesie onder druk zet, en dat Nederland er ook te weinig aan doet om mensen daadwerkelijk te integreren. Daarnaast mogen er ook best wat strengere eisen gesteld worden. Enz enz.\n\nVoor dit alles heb je de term \"omvolking\" echter niet nodig. Dus nogmaals: waarom moet hier een woord voor bestaan? Wat is de noodzaak en relevantie van die specifieke term?",
            "Je zou ook kunnen zeggen dat Nederlanders steeds minder kinderen krijgen. Als elk Nederlands stel 4 tot 6 kinderen krijgt dan is die omvolking zo klaar.\n\n\nAls je dat niet doet maar wel verwacht dat allerhande werk gedaan wordt dan is er geen plan nodig.",
            "Het is simpelweg een woord dat is bedacht omdat het neutraal KLINKT. Omdat je in bepaalde kringen niet meer weg kan komen met \"die vieze vuile buitenlanders zijn het probleem\" zeg je gewoon dat je \"bezorgd\" bent over deze \"omvolking\". Maar wat ze nog steeds wíllen zeggen is \"ik haat [vult u maar een bevolkingsgroep in]\".",
            "Dit soort \"ja het is wel een nazi woord maar is het ook niet een heel klein beetje waar\" is niks meer dan gewoon iedere keer die grens een klein beetje proberen op te schuiven.",
            "Maakt het wat uit dat blanke mensen een minderheid worden? Zijn we wereldwijd toch ook al?",
            "Dit is trouwens niet alleen een nazi-dingetje. Het land dat het daadwerkelijk in de praktijk bracht was de soviet unie. Die plaatste grote russische groepen in de sattelietstaten, zoals dus Oekraine, Estland, Letland, etc. En die groepen zijn het excuus voor Poetin om die landen onder druk te zetten. \n\nIn Nederland is het een beetje suf om te stellen want de groep is niet erg homogeen. \n\nMaar ik vond het wel frappant dat het alleen maar als ongunstig wordt gezien. De grote volksverhuizingen van na de val van het romeinse rijk waren ook omvolkingen. Is dat zo slecht? En is het uberhaupt slecht dat de wereldbevolking in beweging is?\n\nEn om het heel edgy te zeggen: ja, ik voel er wel wat voor om de gemiddelde pvv-debiel te vervangen door een gemotiveerde asielzoeker die in ieder geval nog moeite heeft gedaan om hier te komen.",
            "Ik weet niet wat de bron is maar juist de 2e definitie is precies de definitie die de nazi's gebruikte. De \"linkse elite\" zou massa immigratie aanwakkeren om de autochtone \"witte\" bevolking te verzwakken of zelfs te vervangen. De eerste definitie is totale onzin want het doelt absoluut niet op etnische zuiveringen zoals de holocaust. https://www.aivd.nl/onderwerpen/extremisme/rechts-extremisme",
            "Hitler heeft ook de termen autobahn en volkswagen in de mond genomen. \n\n\nDat een groep slechte mensen een woord ooit heeft gebruikt betekent niet dat het woord dan maar geschrapt moet worden.\n\n\nAls kenia en nederland morgen van bevolking zouden ruilen zou nederland nederland niet meer zijn en andersom ook.\n\n\nMassa immigratie heeft gewoon een grote invloed op de samenleving, en \"omvolking\" lijkt taalkundig gezien een van de betere begrippen om het te omschrijven. \n\n\nNaar mijn inzien hoeft dat woord an sich niet gelijk te betekenen dat je gelooft dat een joodse elite de macht over de wereld wil overnemen door het blanke ras uit te roeien, of whatever ze nu weer verzinnen.\n\n\nJuist door de term wat vaker in een minder complotachtige setting te gebruiken kan het misschien een deel van de negatieve lading kwijtraken.\n\n\nDaarnaast lijken veel mensen te denken dat het puur om kleur gaat, maar ik denk dat de meeste stemmers van zelfs de PVV liever een cultureel nederlandse arabier zien dan een cultureel arabische nederlander.",
            "Ik ben zelf van mening dat 'omvolking' gewoon term is die van een non-probleem een gigantisch opgeblazen iets maakt waar populistisch rechts naar kan wijzen en angst om kan zaaien.\n\nCulturen mixen en mengen al eeuwen, waarom zou 'de witte mens' zich nu in het nauw gedreven moeten voelen? Omdat pvv graag stemmen wil halen.",
            "Is er sprake van *ethnische zuivering* of vind er een *planmatige vervanging van de autochtone bevolking* plaats? Nee dus.  \n\n\nVoor wie dat essentiële onderscheid heeft gemist: \n\n\n- Werk alsjeblieft aan je leesvaardigheid Nederlands. \n\n\n Voor wie het niet heeft gemist en nog steeds denkt dat het een gepaste term is:  \n\n\n- Je bent aanhanger van nazi ideologie. Ga alsjeblieft niet beweren dat dat niet zo zou zijn. ",
            "De tweede betekenis lijkt me prima, en de term 'omvolking' ook.",
            "Waarom moet er een catchy woord zijn? Waarom kunnen we niet gewoon zeggen dat het gaat om een verschuiving van de etniciteit van de bevolking?\n\nIets wat constant gebeurt. De witte Nederlanders van nu zijn niet hetzelfde als de witte Nederlanders van toen. Het enige wat nu anders is, is dat witte Nederlanders nu ook interetnische relaties hebben met mensen buiten het westen.",
            "Makkelijker gezegd dan gedaan.",
            "Voor de exacte Duitse betekenis, die toch afwijkt van hoe omvolking door de huidige populisten wordt gebruikt, zie de wiki. In het Duits is het beste:\n\nhttps://de.m.wikipedia.org/wiki/Umvolkung",
            "Stel je hebt een 5 schakels. Die kunnen of op A staan of op B. Je weet dat als alle 5 de schakels (A) leiden tot het vervangen van de oorspronkelijke bevolking op de lange termijn (AAAAA). Dan moet je er dus bewust voor zorgen dat niet alle schakels A zeggen. Als je dat wel doet dan ben je als groep dus bewust bezig AAAAA te creëren.\n\nAls diezelfde groep ook nog eens bewust schakels naar B gaat tegenhouden op alle mogelijke manier dan doe je dat ook bewust.\n\nOok het symphatiseren van welke schakel A dan ook draagt altijd bewust bij aan een AAAAA.",
            "Klinkt ongunstig.",
            "Nou zoals ik het begrijp gaat het er bij omvolking om dat het opzettelijk en planmatig gebeurt, bijv. (*zet alu hoedje op*) door een kwaadaardige overheidsorganisatie/illuminatie/Bill Gates/Soros",
            "Who fucking cares",
            "Hmm, Russen zijn er anders ook ijzersterk in",
            "Ik zou zeggen: er vindt demografische verandering plaats.   \nEn met deze zin heb ik een mooie samenvatting van de hele wereldgeschiedenis gegeven.\n\nDe Batavieren en Cananefaten zijn allang uit ons land verdwenen, en ook de Friezen hebben we weten terug te dringen naar een kleine provincie in het Noorden.  \nDe Britse Kelten zijn vervangen door de Romano-Britten die op hun beurt weer zijn vervangen door de Angelen, Saksen en Denen. Toen moest Willem de Veroveraar nog komen. \n\nDe volgende zin komt uit ons Nationaal Archief:   \n\"Na de Tweede Wereldoorlog neemt het aantal emigranten enorm toe. Vanwege de sombere economische situatie, de hoge werkloosheid en de woningnood besluiten tussen 1945 en 1967 bijna een half miljoen Nederlanders te emigreren. \" Waar ik maar mee wil zeggen: E/Immigratie is van alle tijden en overal.\n\nOmvolking suggereert een vooropgezet plan, en is politiek gemotiveerd.",
            "Dus iets wat niet gebeurt?",
            "Mensen verzinnen graag excuses om te ontkennen dat het overduidelijk gebeurd voor hun ogen",
            "natuurlijk is het ongunstig, zou raar zijn als men (PVV in dit geval) boos over iets is dat gunstig is..",
            "Evolutie?",
            "Ah, dus wat ze in Australië hebben gedaan. Jakkie bah. Ja ik snap dan wel waarom er zoveel ophef over deze woordkeuze word gemaakt.",
            "Je weet dat volkeren zich al tienduizenden verplaatsen over de aardbol? Moraal: dit is niets nieuws.",
            "Van de rechtse rakkers hier die klagen over omvolking en demografische verandering, gaat het dan om cultuur/denkbeelden of gewoon om de huidskleur die je niet aanstaat? Want mijn familie is zo Hollands als maar kan maar ik heb meer gelijkenissen in mijn denkbeelden en levensvisie met mijn Syrische buurman dan met een SGP'er uit de biblebelt, ook al zien jullie mij en die christenextremisten waarschijnlijk als \"echte Nederlander\" en mijn buurman als iemand die de Nederlander komt \"vervangen\".",
            "Welke website is dit? Ik snap niet waarom ze het nodig vinden om toe te voegen wie bepaalde definities ongunstig vinden",
            "De VOC mentaliteit heeft er voor gezorgd dat wij de \"omvolking\" hebben gestart in andere delen van deze aardbol.\n\nAustralië, Canada, Verenigde Staten van Amerika. Zijn daar de oorspronkelijke bewoners in de meerderheid? Hebben zij er ook tegen gevochten en verloren? En is de ideologie van de winnaar daar nu overheersend?\n\nDit is hoe de mens is. We verplaatsen ons, creëren andere samenlevingen en culturen. En er is altijd iemand de heerser die bepaalt.",
            "Wat een goedpraattopic zeg. Idiote complottheoristen. Ja, Zuid-Afrika is ook omgevolkt. Geen donker mens meer te bekennen.",
            "Je kunt hetzelfde zeggen over het hakenkruis of de Hitlergroet, deze werden voor de Nazi's het gebruikte ook al eeuwen gebruikt in hele andere en verschillende contexten.\n\nNou is omvolking natuurlijk een woord dat redelijk normaal klinkt wanneer je de geschiedenis ervan niet kent. In principe moet een politica dit wel gewoon weten, vind ik. \n\nEn als iemand je er dan op wijst, neem je het terug en maak je excuses voor je ongelukkige woordkeuze.",
            "De mensen die zo fel reageren tegen de term \"omvolking\" weten dat het gaande is. Maar ze willen het niet erkennen omdat ze diep van binnen zelf vinden dat het niet een positieve uitkomst is, hoe pro-immigratie je ook mag zijn. Je kan best pro-immigratie zijn en vinden dat omvolking een natuurlijk proces is dat altijd al plaatsvindt over de hele wereld of wat dan ook. Maar wees ten minste eerlijk over het feit dat het gebeurt, janken dat mensen de gebeurtenis bij de naam noemen is erg zwak.",
            "> Wat is een beter woord?\n\nJe noemt het betere woord zelf al: ethno-demografische verschuiving. \n\nHet woord \"omvolking\" is ethno-demografische verschuiving **plus de doelmatigheid hiervan door de heersende macht**. Zolang die doelmatigheid niet te bewijzen is (en dat is die in Nederland niet) moeten we ver van de term omvolking weg blijven.",
            ">Als deze trend zich voortzet (wat niet met zekerheid te zeggen is) kan dit er op lange termijn toe leiden dat autochtone/blanke/witte Nederlanders die lang de meerderheid van de bevolking hebben uitgemaakt, een minderheid zullen gaan vormen.\n\nIn theorie, over een jaar of 150 ja. Als er niets anders verandert in de wereld (wat dus nooit het geval gaat zijn). Ga nou niet doen alsof dit een probleem is waar wij ooit iets van gaan merken.",
            "Er zijn eigenlijk best veel nazi dingen die we dagelijks gebruiken maar waar niemand zich druk om maakt. Snelwegen, Volkswagen, sociale zekerheid, etc. De ophef om het gebruik van omvolking komt m.i. vooral van mensen die bepaalde zaken willen ontkennen en de ander in een nazi hokje willen plaatsen.",
            "Noem alsjeblieft een eeuw in die er geen ethno-demografische verschuiving plaats heeft gevonden in de lage landen.\n\n\nEn vergeet niet emigratie. Waarom heeft men het er nooit over om de *emigratie* van bepaalde bevolkingsgroepen aan de grens tegen te houden? \n\n\n\nEen gepaste term zou dus zijn historische *continuïteit*, danwel *behoud\" van Nederlandse culturele identiteit.\n\n\nLaten we oer-hollandse waarden alsjeblieft niet vervangen door het prullarische gedachtegoed van de globale identitaire beweging, daarvoor is Nederland te bijzonder.",
            "Ik noem het zelf The Great Migration. Over duizend jaar zullen historici volgens mij terug kijken op de periode tussen 1945 en nu ongeveer als de periode waarin de meeste migratie heeft plaats gevonden in de geschiedenis van de mensheid. \n\nOmvolking is naast een racistische term volgens mij express gekozen zodat mensen zichzelf als slachtoffer kunnen zien en zodat ze een boeman kunnen aanwijzen.",
            "> kan dit er op lange termijn toe leiden dat autochtone/blanke/witte Nederlanders die lang de meerderheid van de bevolking hebben uitgemaakt, een minderheid zullen gaan vormen.\n\nWant 'autochtone/blanke/witte Nederlanders' zijn volgens jou beter dan mensen die jij niet rekent tot 'autochtone/blanke/witte Nederlanders'?\n\nOf begrijp ik je nu verkeerd? Stel dat er minder 'autochtone/blanke/witte Nederlanders' zouden zijn, wat maakt dat dan uit?",
            "Het is misschien wel gewoon het makkelijkst de term omvolking gewoon aan te houden en te normaliseren door frequent gebruik. ",
            "Mensen kunnen omvolking een kwaadaardige theorie vinden maar de cijfers liegen niet.",
            "Dit concept gaat er van uit dat een externe bevolking niet integreert. Natuurlijk veranderen culturen elkaar, maar zoals Ieren en Italianen in Amerika van minderheden naar onderdelen van de blanke bevolking gingen, zo kan dat ook gaan met elke andere bevolkingsgroep. Het concept is dus problematisch omdat het een gevoel van verdringing als werkelijkheid presenteert, terwijl het simpelweg de indruk is van de korte termijn. Terwijl op de lange termijn mensen prima met elkaar kunnen samenleven.\n\nVan een werkelijke verdringing is bijvoorbeeld spake in het geval van de Han Chinezen in Tibet. Dat is een bewust plan van de Communistische partij, omdat over langere tijd een uniforme samenleving beter te controleren is. In het geval van moslims in Nederland is er duidelijk geen sprake van een plan. Omvolking is simpelweg racisme.",
            "Weet je wat ik nou echt miep gedrag vind? Zelf geen enkele moeite steken in kinderen maken want carriere en rijkdom is God. En dan ineens janken wanneer de bevolking krimpt en arbeiders geimporteerd moeten worden om de baantjes te doen die niemand wilt. Ga dan zelf lekker babies lopen maken in plaats van dat constante angstklagen en vingerwijzen. Sorry hoor maar kies iets.\n\nEn dan wel tegelijkertijd lekker samen apengeluiden maken tijdens voetbal want oh zo grappig en shit als - \"Nederlands\" elftal ha ha ha - roepen.\n\nEen gepaster woord: Jankepieterij",
            "Als mensen zich zorgen maken over “omvolking”, dan moeten deze mensen zich ook als konijnen voortplanten en mintens vier kinderen krijgen, maar dat doen de meesten ook niet.",
            "Het is een feitelijke term. En het gebeurt ook om ons heen. Schijnbaar zien weinig mensen dat, maar alle ellende die we hebben overal is een feit.",
            "De mensen die zich druk maken om omvolking zijn over het algemeen dezelfde mensen die je prima uit de samenleving kan fokken dus geen probleen",
            "Hoe komt dit woord niet uit de gouden eeuw of uit de tijd waar Amerika gevormd is? Daar is ook planmatig de hele bevolking \"vernietigd\" of weggepest om plaats te maken voor de blanke mensen? Hoezo is dat pas een term geworden in WW2? Iemand?",
            "Het fijne aan het aankomende kabinet is dat we als Nederland eindelijk de rechtsextremisten in de full spotlight hebben en kunnen terechtzetten. \n\nDit geldt voor politici als burgers die \"alleen maar vragen stellen\". \n\nWacht maar, deze clownshow kabinet wordt vervangen door Kabinet Jetten 1.",
            "1 is dus 99% van de Nederlandse geschiedenis waar jullie zo trots op zijn 😂",
            "Nederland is echt nog steeds vooral wit, als de trend zich voortzet zoals dat nu gaat, duurt het nog ontiegelijk lang voordat witte mensen in de minderheid zijn. Daar hoef jij he zeker niet zorgen over te maken, gaan de komende generaties niet mee maken (als het überhaupt ooit gaat gebeuren, want de trend zet niet oneindig door). Het wordt vooral ontzettend overdreven \n\nEn het grote verschil is dat de mensen die hier naartoe komen hier niet komen om witte mensen te vervangen, ze komen er gewoon bij. Niemand wil ons vervangen of wegmaken… we zien een langzame verschuiving in demografie geen omvolkinh\n\nOmvolking is een complot theorie die vandaag de dag gewoon uit racisme voorkomt en gebruikt word door witte suprematie",
            "Nee domme tiefuslijer. Nederlanders zullen altijd de meerderheid zijn. Leer hoe genetica werkt. Tiefus idioot. Over tweehonderd jaar zijn er gewoon een heleboel Pieters en Jannen die er achterkomen dat hun grootgrootgrootgrootvader Mohammed heette.\n\nZo werkte het ook met al die \"Spaanse\" kinderen die geboren werden in het zuiden van Nederland tijdens de 80 jarige oorlog.\n\nGodverdomme, leer eens logisch nadenken.",
            "Niet-blanke mensen worden massaal toegelaten in Nederland. \n\nKrijgen eerder een woning aangeboden dan blanken.\n\nBedrijven, omroepen en overheidsorganisaties vervangen in hoog tempo blanken door niet-blanken op hun websites, in reclames, enz.\n\nDus overal moeten blanke mensen wijken voor niet-blanken.\n\nOmvolking is een prima woord om deze anti-blanke ontwikkeling samen te vatten \n\nHet mag alleen niet benoemd worden door links Nederland want het moet lijken op toeval/natuurlijk verloop.\n\nHeel goed dat PVV politici zich niet langer laten muilkorven door de linkse gedachtenpolitie!",
            "Ik vind het woord goed genoeg. Het omschrijft wat er gaande is. Nederlanders worden een nog kleinere minderheid wereldwijd gezien.",
            "Omdat het ergens in een nazi boekje is genoemd is het nu ook nazi eigendom of een ieder die het woord gebruikt staat gelijk aan een nazi, heel apart. Zo kunnen we een heleboel woorden laten afvallen, moeten we haast een nieuwe taal uitvinden.\n\nDaarbij hoor ik vanuit een andere hoek vaak dat wij te weinig kinderen krijgen, dat dit wel moet voor onze economie, anders geen pensioen etc. etc.  Wanneer we onze nieuwgeborene vervangen door immigranten kun je volgens mij objectief spreken van omvolking. Hier wordt actief op gestuurd, dus planmatig.\n\n-Edit- Ik zie dat ik je vraag niet heb beantwoord, bevolkingssuppletie zou ik het noemen.",
            "Ja, een goed excuus om het anders te laten klinken :P we worden gewoon gen**kt",
            "Maar hij vraagt toch heel duidelijk wat voor term je dan wilt gebruiken? Daar geef je echter 0 antwoord op",
            "> In je post doe je alsof het eigenlijk vooral een beetje een semantische discussie is. Maar dat is het niet. De demografische veranderingen die jij beschrijft zijn helemaal niet hetzelfde fenomeen als omvolking. Omvolking als term impliceert een soort sinister complet van 'de elite' om demografische veranderingen te forceren in combinatie met een racistisch/ethnische hiërarchie die impliceert dat bepaalde 'demografische elementen ' minderwaardig zijn. Dat is iets heel anders dan zomaar een veranderende samenstelling van de bevolking.\n\nDat was er ook. Daarom is de EU heimelijk gefinancierd door de CIA en de Paneuropese unie door Max Warburg, die uit dezelfde familie komt die de Federal Reserve heeft opgezet.",
            "Zelfs dhr. Wilders zou volgende OP’s definitie een symptoom van omvorming zijn, met zijn ‘niet-westerse migratie-achtergrond’.",
            "Andersom ze gebruikte zelf het om landen als polen meer duits te maken. Omvolking zelf was dus nazi beleid, het benoemen er van dus juist niet.",
            "Dus als we een nieuw woord verzinnen die in principe zegt dat \"blanke\" \"autochtone\" Nederlanders een steeds kleinere groep wordt in Nederland (of het nou planmatig is of niet) is dat wel oke? Zolang dit niet een term is die door Nazi's gebruikt werd?",
            "Nee. De nazi’s waren niet bang dat zij werden ‘omgevolkt’.   \nZij wilden (vooral) Oost Europa omvolken en Duits maken…\n\nhttps://nl.wikipedia.org/wiki/Omvolking\n\nOmvolking is een begrip dat vanaf de jaren 1930 in Nazi-Duitsland werd gebruikt (Umvolkung) voor een politieke strategie om grote groepen mensen uit Duitsland naar andere aangrenzende landen te laten emigreren met als redenering dat die gebieden tot het Duitse Rijk hoorden.",
            "Dus als de Nazi's ergens gebruik van maakten, is het per definitie iets waar je niet mee wilt worden geassocieerd? \n\nHoop dat je geen Volkswagen rijdt...",
            "Ik vind dit een beetje hetzelfde als dat je je niet wil associëren met vegetariërs omdat Hitler ook een vegetariër was.",
            "\nHet is een feit dat de moslim gezinnen meer kinderen krijgen dan andere Nederlanders. \n\nAls deze trend zich voorzet en er ook nog steeds meer immigranten uit moslimlanden zich hier vestigen zal dat de Nederlandse samenleving veranderen. Wat je daar van vindt is iets wat iedereen zelf moet bepalen. \n\nOok is het een gegeven uit wat er zich in andere landen (oa in afrika) heeft plaatsgevonden dat moslims zich beroepen op de vrijheid die democratie hen geeft tot het moment dat zij de meerderheid zijn en dan hun wil opleggen en die democratische vrijheid intrekken. \n\nHoewel ik de term omvolking niet zou gebruiken door de associatie met het Nazi regime en het verwerpelijke karakter daarvan. \n\nVind ik wel dat we de immigratie van moslims naar het westen moeten beperken tot alleen die mensen die vluchtelingen zijn. \n\nHopelijk zullen velen van hen de voordelen leren van de vrijheid die wij hebben en dat omarmen.",
            "Het is echter natuurlijk een term. Omvolking gebeurde ook in china met de han-chinezen (in mindere mate nog steeds), het gebeurde ook bij de spanjaarden in amerika. En de arabieren in spanje. Maar ook de tsjechen en de polen na de oorlog.\n\nHet is een fenomeen, niets nazi er aan. Het is in die zin hetzelfde als het woord: apartheid.",
            "De Nazis hebben heel veel woorden en dingen gebruikt. Als je dan consequent wilt zijn moet je ook Volkswagens, Hugo Boss pakken en alles wat Duits is verbannen en de Duitse taal afschaffen. Je zou ook het verleden het verleden kunnen laten en vooruit kijken. Het is heel er van nu om alles terug refereren naar gebeurtenissen van generaties terug omdat je graag iemand in dat daglicht wilt plaatsen, ik vind dat goedkoop mensen wegzetten, je kan beter het gesprek aangaan.",
            "De kabouters overlopen dit land!",
            "wat is dat voor een laag IQ conclusie.",
            "Culturen zijn nergens ter wereld ooit statisch geweest",
            "Sorry makker maar dat is geen omvolking. Omvolking is toch echt een complottheorie, dat er doel bewust rassen en culturen naar Nederland worden gehaald. Om ons blanke ras te verdrukken of te verwateren.",
            "En wat boeit het jou nou of je blauwe of bruine ogen hebt? Als ik jou goed heb begrepen, zeg je dat het de Kelten in alle vrede is overkomen. Dat is dan geen 'vervangen', maar samensmelten.",
            "\"Daarnaast kan je je ook nog eens afvragen in hoeverre dit wel de correct probleemanalyse is. Je afkomst of huidskleur is namelijk niet bepalend voor wat je geloofd, denkt, doet of zegt. De reden dat mensen over dit onderwerp praten, is echter vrijwel altijd wel gebaseerd op die aanname.\"\n\nEn ondertussen woont mijn gezin in een straat waar de voertaal niet Nederlands is.",
            "Omdat de term omvolking veel pakkender of \"catchy\" is dan de hele alinea die jij nodig had om de kwestie te beschrijven.\nIedereen weet waar je het over hebt als je het over omvolking hebt. \n\nAls je daar een beter wordt voor hebt die niet geleend is van de Nazi's zou dat al beter zijn.",
            "De term \"omvolking\" is de harde werkelijkheid maar dat mag dus niet. Iets precies noemen voor wat het is mag schijnbaar niet meer.",
            "Of een nazi het heeft bedacht of onze koning, veranderd niks aan de definitie. De vraag is niet of nazi's gelijk hebben, maar of de definitie waar is. Het betekend ook niet dat het goed of slecht is, de vraag is gewoon of het gebeurd al dan bewust of niet",
            "Volgens mij is het juist het “Ja het is best een beetje waar, maar het is een nazi-woord dus we doen alsof onze neus bloedt.” dat mensen verder naar rechts doet opschuiven.",
            "Ben jij historicus? Want op Wikipedia staat toch echt dat het om het germaniseren van oost-Europa gaat. Als jij het beter weet kun je dat misschien aanpassen?",
            "De originele Nazis gebruikten het als eufemisme van etnische zuivering in een bepaald veroverd gebied (drang nach osten etc), moderne nazis gebruiken het op de manier die jij noemt.",
            "De eerste definitie is onderdeel van het nazi 'lebensraum' concept",
            "Ben ik niet geheel mee eens. Onder punt 1 kan ook een genocide vallen, nou bepaald een non-probleem. In het geval van Nederland is het inderdaad gewoon een conspiracy dingetje net zoals vaccinatie dit 5g dat etc.",
            "Het is blank en Geert Wilders is een halfbloedje. Overigens wilt elke partij graag stemmen halen. Het is ook geen angst het een feit. Een feit benoemen is geen angst zaaien.",
            "Waarin zie jij precies de 'planmatige vervanging'?",
            "Ja de vergelijking met indianen of aboriginals is inderdaad geruststellend.",
            "En je punt is dat je dat ook graag in Nederland ziet gebeuren..? Ik denk niet dat de nazaten van bijvoorbeeld die inheemse bevolking van Amerika, die nu in reservaten wonen, erg te spreken zijn over hoe ze behandeld zijn en wat er van hun volk terecht is gekomen. Als jij dat hadden geweten en er wat aan hadden kunnen doen hadden zij dat natuurlijk ook gedaan. \n\nNaast het feit dat het menselijke natuur is om te verplaatsen en samenlevingen te creëren is het ook inherent aan ons dat wij onszelf en onze nakomelingen proberen te beschermen, en daar hoort het voorkomen van een snelle politieke wending ook bij. Punt is nu eenmaal dat als je binnen enkele generaties opeens allemaal conservatieve moslims binnen haalt, zij ook naar hun geweten zullen stemmen. Dat zie je ook aan het feit dat Nederlandse Turken vaker op Erdogan stemmen dan Turken zelf. Ik denk zelf dat als je deze verschuiving heel geleidelijk laat gebeuren er (hopelijk) genoeg tijd tussen zit, zodat er een liberalisering van de moslim-bevolking plaats kan vinden. Maar wees nou even eerlijk; zou jij graag in een samenleving wonen waar Denk de grootste partij is?",
            "Waarom zou je het terugnemen? Het mag dan wel een ongelukkige woordkeuze zijn maar dat maakt je punt verder niet slecht of onwaar.",
            "Omvolking als natuurlijk proces is wel erg selectief shoppen uit het begrip. Wat jij noemt is migratie en dat is -inderdaad- van alle tijden. \n\nOmvolking gaat per definitie uit van een bewust ingezet middel, migratie inzetten met de bedoeling om de 'oorspronkelijke bevolking' te vervangen. En dat is een complottheorie die kwade wil zoekt achter dat natuurlijke proces.\n\nDaarbij gaat het uit van een 'witte cultuur' in een land waar je 2 eeuwen geleden nog een kopstoot kreeg als je katholiek uit je ogen keek maar nu hebben we blijkbaar cultureel iets ondeelbaar gemeen met iedereen die binnen 5 minuten aan de playa verbrandt.\n\nToch als je dezelfde lui vraagt wat ze van hun buurman vinden dan is het een botte hork die je niet op je verjaardag uitnodigt. \n\nVan die onverdekte rassensprookjes voor mensen die eigenlijk niets meer hebben om echt kwaad op te kunnen zijn.",
            "Je schuift me wel een hoop emoties en beweegredenen in de schoenen, vriend.",
            "Aangezien jij weet dat het gaande is, waaruit bestaat het planmatige deel (wat essentieel is bij de term omvolking)? Wie heeft het bedacht? Wie voert het uit? Liggen we op schema? Waar kan ik het lezen?",
            "Bullshit\n\nWat jij niet snapt is dat de term omvolking slaat op het BEWUST vervangen van een bevolking door een andere groep.\n\nDus geen immigratie van mensen die een beter leven zoeken, maar mensen die hierheen gestuurd worden om ons te verdrijven.\n\nImmigratie is normaal\nNiemand is \"pro immigratie\" \nImmigratie is als wind\nJe kan last hebben van de wind\nJe kan profijt hebben van de wind\nMaar niemand is \"pro wind\"\n\nMaar een trieste groep mensen waar jij blijkbaar toe behoort heeft besloten dat ze niet anti storm, of anti orkaan zijn, maar anti wind.\n\n\nNaast dat alles is er nog een punt dat mensen als jij consequent blijven negeren.\nImmigranten krijgen meer kinderen dan gemideld\nMaar kinderen van immigranten al nauwelijks meer\n\nCijfers cbs 2023\nGemiddeld aantal kinderen moeder met migratieachtergrond 2e generatie\n1.55\nGemiddeld aantal kinderen moeder zonder migratieachtergrond\n1.44\n\nKortom\nDie hele omvolkingstherorie is racistisch EN feitelijk onjuist",
            "Je zou hetzelfde kunnen zeggen over klimaatverandering.",
            "Geert Wilders een halfbloedje die in Israël heeft gewoond en Israël steunt. Als je zulke mensen als Nazi's gaat bestempelen dan ben je oprecht de wanhoop nabij.",
            "Het eeuwige \"de nazi's deden ook goede dingen\" argument. Nee het feit dat ze auto's bouwen was niet persé laakbaar, maar die hele fucking rassenleer en etnische zuiveringen was nou juist waarom de nazi's als de bad guys worden gezien toch? Dus als je dan een woord van de nazi's gebruikt dat een onderdeel is van die bredere rassenleer en zuiveringsstrategie dan is dat gewoon superfout.\n\nMaargoed ik ben een beetje bang dat types zoals jij de nazi's uberhaupt niet de bad guys van de geschiedenis vinden.",
            "Ik denk niet dat dit achteraf de periode van veel migratie zal blijken te zijn. Ik verwacht dat klimaatverandering een nog veel grotere migratiestroom op gang zal brengen.",
            "Is het echt zo erg dat mensen in een land willen leven waar de oorspronkelijke bevolking de meerderheid vormt, inclusief haar cultuur, gewoontes, religie, etc. Overal ter wereld lijkt dit te mogen, behalve in europa mag je die wens niet hebben",
            "Ja, blanken zijn inderdaad \"beter\" dan Arabieren die zodra ze in de meerderheid zijn de macht grijpen en je land omvormen tot een totalitaire theocratische shithole.",
            "Het is een kwaadaardige theorie want omvolking houdt in dat dit een bewust en gestuurd proces is.",
            "waarom? de nederlandse bevolking hoeft niet te groeien? de economie ook niet.  \npersoneelstekort kan prima stijgen, is helemaal geen probleem en goed voor de lonen.",
            "Je kan moeilijk een gezin starten als alle huizen worden weggeven en miljarden per jaar naar migranten gaan ipv het in de bevolking te investeren en mensen aan te moedigen om kinderen te nemen. \n\nDe Nederlandse bevolking groeit al duizenden jaren en mijn opa en oma hadden ook 6 kinderen, het wordt hedendaags voor de oorspronkelijke bevolking gewoon onmogelijk gemaakt om 3/2 kinderen te verzorgen. In de huidige nieuwe generatie zullen Nederlanders al een minderheid zijn. Mijn nichtje van 3 is de enigste kind met blond haar en blauwe ogen in haar klas.\n\nOok met dingen als hook-up culture kan je geen gezin bouwen. In de islam gebeurd dat niet en kijk hoe hard hun bevolking groeit.",
            "Als het een 'feitenlijke term' is, wie zitten er dan achter? En waarom? Essentieel voor deze term is het bewuste en planmatige karakter. Maar aangezien het volgens jou een 'feit' is kan jij deze vragen vast makkelijk beantwoorden!",
            "We wuz omvolkers ‘n sheit.",
            "Jij bent een heel goed voorbeeld van waarom die complottheoristen gevaarlijk zijn.",
            "Ok nazi",
            "Je kunt er inderdaad wat van vinden dat het voor ons vrijwel onbetaalbaar gemaakt wordt om grote gezinnen te hebben terwijl buitenlanders (waarvan de vrouw meestal niet eens werkt) schijnbaar gewoon kunnen rondkomen op 1 laag inkomen terwijl ze 5+ kinderen hebben.",
            "Nou simpel: demografische veranderingen?\n\nZijn post veronderstelt wel degelijk dat omvolking in principe ook gewoon demografische veranderingen aanduidt, maar dat die term besmet is en we dus op zoek moeten naar een ander woord. Mijn punt is nu juist precies: omvolking duidt een heel ander fenomeen aan dan waar OP het over heeft.",
            "Sorry hoor maar hoezo is Wilders niet westers? Zijn vrouw is Hongaars. Hongarije valt onder westen, dus zij wordt gezien als westerse.",
            "Dit is inderdaad iets dat mensen niet begrijpen. Duitsers gebruikten het als boosdoener, niet als slachtoffer",
            "Makker, dat heet nou een Dog Whistle.",
            "Ik denk meer dat het idee achter \"omvolking\" in verband wordt gebracht met Nazi's. Het hele \"we moeten het Arische ras puur houden\" gebeuren. De nadruk ligt bij hen bij het beschermen van het ras. \n\nAls je bezorgd bent over de *culturele* impact van massamigratie is een ander woord misschien inderdaad minder geladen en controversieel.",
            "Daar heb je gewoon woorden voor. \nDat noem je 'verandering van de demografische samenstelling'. Dat is al millennia gaande, waarom zou die term niet oké zijn? \n\nMaar het lijkt me verder absoluut verstandig om je complottheorie niet de naam te geven welke de Nazi's voor het beleid gebruikte waar de complottheorie op gebaseerd is. Tenminste als je niet met Nazi's in verband gebracht wenst te worden. \n\nZeker niet wanneer het een xenophobe theorie is die alleen door zwakbegaafden en rechts extremisten worden aangehangen. \n\nOf is dat een pleonasme.",
            "Dus een ethno-demografische verschuiving zeg maar?",
            ">Dus als we een nieuw woord verzinnen die in principe zegt dat \"blanke\" \"autochtone\" Nederlanders een steeds kleinere groep wordt \n\n'Pandaïsme'\nHet Nederlandse volk is te lui om te neuken.",
            "Nou ten eerste is het nog maar de vraag of dat zo is. Ten tweede boeie. En ten derde als het dan perse moet: ja een neutrale term lijkt me beter dan eentje die tot op het bot racistisch is.",
            "Die woord ja?\n\nLeer eerst eens jouw eigen taal voordat je het idee krijgt dat je iets bijzonders bent.",
            "Het zou de mensen die kiezen deze term te gebruiken wel helpen. Als iemand nu 'omvolking' roept weet je vrij zeker dat je met een xenophobische nationalist te maken hebt die gevallen is voor een verhaaltje dat ook door nazis vertelt werd. Als je bijvoorbeeld 'demografische verschuiving' zou zeggen ben je in ieder geval wat genuanceerder en eerder serieus te nemen.",
            "Laten we dan de sterren op de borst ook maar herintroduceren. Het is immers maar een sticker",
            ">Het is een feit dat de moslim gezinnen meer kinderen krijgen dan andere Nederlanders \n\n\nNederlandse moeders krijgen gemiddeld evenveel kinderen als moeders met een migratieachtergrond. Turkse vrouwen bijvoorbeeld krijgen minder kinderen dan autochtone vrouwen, maar Marokkaanse vrouwen wel weer meer. Dat aantal gaat echter ook weer omlaag en komt steeds dichterbij het landelijk gemiddelde. Het is lastig om het specifiek te hebben over moslim moeders, omdat het CBS dat niet bijhoudt. In islamitische landen krijgen ze inderdaad meer kinderen, maar kunnen we dan meteen zeggen dat moslims in Nederland ook meer kinderen krijgen? Ik zie niet waarom wel.\n\n\n\n\nhttps://opendata.cbs.nl/statline/?dl=274BB#/CBS/nl/dataset/83307NED/table",
            "Jouw eerste zin klopt niet.\n\nhttps://www.quest.nl/maatschappij/geschiedenis/a25601507/hitler-uitvinder-autosnelweg-fabeltjeskrant/",
            "Sorry, maar ik stopte met lezen toen je de uitvinding van de snelweg vergeleek met een essentieel onderdeel van de Nazi strategie om de bevolking op te hitsen tegen een minderheid. Fijn weekend",
            "Dan ben ik benieuwd, zijn ongelovige Arabische economische migranten wel welkom?",
            "Waarom wordt deze persoon voor het geven van zijn/haar mening direct gedownvoted. Mag je over dit onderwerp alleen maar een linkse woke menig hebben dan?",
            "Nou vertel, ik ben benieuwd naar jouw hoog intellectuele kijk op deze zaak",
            "Gehaald of gestuurd? Je kan niet echt ontkennen dat Rusland en Witrusland migranten invliegen om vanuit die kant onrust te kweken in Polen en Europa.\nWat minder zichtbaar is is de invloed van Rusland op de stroom migranten via andere routes dus dat zou je een complot theorie kunnen noemen. Maar erg veel fantasie heb je er niet voor nodig.",
            "Ja dit is waarom ik niet begrijp dat FvD in het begin als redelijk gezien werd, hij had het vanaf het begin al over \"homeopathische verdunning\" en bescherming van de \"boreale mens\"",
            ">Omvolking is toch echt een complottheorie, dat er doel bewust rassen en culturen naar Nederland worden gehaald. Om ons blanke ras te verdrukken of te verwateren.\n\nOmvolking is een fenomeen dat er met opzet mensen van elders naar een regio worden gehaald. Niet per se om het blanke ras te onderdrukken.\n\nDe Han deden het in china, de spanjaarden in amerika, de arabieren in spanje, de palestijnen in Libanon, de duitsers in polen en tsjechie, de polen en tsjechen in eigen land, etc etc.\n\nHet is een fenomeen, de redenen lopen echter uiteen van wraak tot culturele hegemonie, tot economische factoren (aka geld opstrijken) tot kolonisatie, etc. Voor zover er beweegredenen zijn voor een mens zijn er mogelijke redenen voor omvolking.",
            "Hoe moet onderstaand berichten gezien worden in deze discussie?\n\n“Erdogan urges Turks in Europe to have 5 children”\n\n[https://apnews.com/general-news-67b6b04cb5f94d61b8dddc9a551014d0](https://apnews.com/general-news-67b6b04cb5f94d61b8dddc9a551014d0)\n\nen:  \n  \n“Imam tells Muslim migrants to 'breed children' with Europeans to 'conquer their countries' and vows: 'We will trample them underfoot, Allah willing'”\n\n[https://www.dailymail.co.uk/video/news/video-1215180/Top-Iman-Conquer-Europe-breeding-Europeans.html](https://www.dailymail.co.uk/video/news/video-1215180/Top-Iman-Conquer-Europe-breeding-Europeans.html)",
            "En wat is daar precies het probleem?",
            "Ik geef letterlijk een alternatief woord. Jij hebt die hele (blijkbaar indrukwekkend lange) eerste alinea dus niet eens gelezen. \n\nOf is dat ook niet pakkend genoeg? Moet de politiek een soort sociale media worden? Om vervolgens flink te gaan huilen als mensen kritiek op je controversiële woordkeuze hebben.  \nOver huilie huilie slachtofferrol gesproken...",
            "“Je mag tegenwoordig ook niks meer” is geen normale reactie op “kap effe met nazi-jargon”",
            "Er is geen bewijs voor omvolking of significante verschuiving van ethiciteit. Donder op tyfus fascist.",
            "In het asielbeleid van Nederland in de afgelopen 15 jaar.",
            "Honderdduizenden migranten uit niet-westerse landen toelaten en het verheerlijken van diversiteit (lees: minder blank) zijn van Nederland. \n\nAls blanke Nederlanders massaal naar een niet-westers land zouden vertrekken zou dit gezien worden als kolonisatie.",
            "Mijn punt is dat het hypocriet is om geen andere culturen toe te laten als de geschiedenis leert dat de voorvaders hun cultuur hebben opgedrongen aan anderen. \n\nEn iedereen die denkt dat binnen een halve eeuw de helft van Nederland uit conservatieve moslims bestaat begrijpt wereldpolitiek niet. Wij zijn dusdanig klein en van ondergeschikt belang dat geen enkele wereldleider (van een land of vanuit religieuze gedachten) ons land wilt overheersen.",
            "Wat zijn de culturele overeenkomsten tussen Aboriginals en Europeanen precies als het hierom gaat in jouw idee?",
            "Na 50 jaar ‘nieuwe’ immigratie haalt Denk 2,3% van de stemmen…",
            "Dat is het punt ook niet, het woord het een vervelende connotatie gekregen vanwege de Nazi's, daarom gebruik je het woord niet meer.\n\nBeetje hetzelfde als dit[artikel](https://www.hartvannederland.nl/regio/zuid-holland/hitler-vlag-zorgt-voor-veel-emoties-in-voorhout-die-moet-zo-snel-mogelijk). Hitler heeft het gezegd, je mag vinden dat de quote klopt. Maar vanwegen het verleden van Hitler is het niet echt smakelijk om zo'n vlag op te hangen.\n\nIk wil hem nog wel verder voor je trekken; Als je een kamp wilt beginnen voor kinderen met ADHD die zich moeilijk kunnen focussen, is de naam concentratiekamp misschien wel feitelijk een juiste benaming, maar dat woord gebruik je gewoon niet vanwegen de connotatie.\n\nEnfin, als je dus per ongeluk een woord gebruikt met een vervelende connotatie, en je wordt erop gewezen, dan neem je dat woord terug en maak je excuses. Zeker als publiek figuur.",
            "> Omvolking gaat per definitie uit van een bewust ingezet middel, migratie inzetten met de bedoeling om de 'oorspronkelijke bevolking' te vervangen. En dat is een complottheorie die kwade wil zoekt achter dat natuurlijke proces.\n\n\nPrecies dat, ik krijg nooit een goed antwoord op wie het dan aan het uitvoeren is, en wie er profijt bij heeft.",
            "Tering, wat een aannames zeg.",
            "Daar komt ie dan he, 'de Joden'... En een duidelijker antwoord komt er nooit van die wappies.",
            "Ik denk dat we het erover eens zijn dat klimaatverandering sowieso slecht is. Veranderende etnische samenstelling is dat niet.",
            "Dat is niet waar, want dat zien we nu al. Maar zelfs al zou ik je gelijk geven, je geeft nu zelf toe dat je eigen rampscenario niet op waarheid berust is.",
            "Dat is het beste wat je kan doen. Motieven invullen en dan bang zijn van die types. Jij komt er wel",
            "Een land waar de oorspronkelijke bewoners de meerderheid vormt? Overal behalve Europa? Euuhh. Dan moet je dus niet naar de VS kijken. Canada. Mexico. Heel Zuid Amerika. Australië. Nieuw-Zeeland. Moet ik doorgaan?",
            "Wat er stond was:\n\n> autochtone/blanke/witte Nederlanders\n\nVertel mij nu eens hoe jij de oorspronkelijke bevolking, cultuur, gewoontes, religie etc. precies ziet. Is dat katholicisme? Of protestantisme? En die Friezen met hun suikerbrood in Limburg, is dat een problem?",
            "> blanken zijn inderdaad \"beter\" dan Arabieren\n\nEn zulke uitlatingen noem je dus wit-superioriteitsdenken en is een van de elementen die rechtsextremisme kenmerkt volgens de AIVD. Dat betekent dus niet dat jij een rechtsextremist bent, maar wel dat jij huidskleur als determinant ziet van gedrag. En dat lijkt mij volkomen flauwekul.",
            "Totdat je de geschiedenis induikt en ziet dat Arabieren ook hun eigen gouden eeuw hadden en zij toen ook \"beter\" waren. \nHistorisch gezien verschuiven veel civilisaties heel erg en zien we veel grote civilisaties bestaan en uit elkaar gaan. De Egyptenaren, de Romeinen, de Perzen, de Grieken etc etc.",
            "en dat is het ook? waarom liegen ze anders dat het \"nodig\" is?\n\nik hoor het ze steeds zeggen, \"wie gaat dan je asperges steken?!?!\"  \nkan mij dat nou verrotten? banen die niet iets produceren wat gewild is moet gewoon verdwijnen.\n\neconomische krimp is te behappen. lonen moeten omhoog, spaargeld en huiswaardes moeten vernietigd worden.   \n  \nDat immigratie nodig is, is een linkse leugen. afgetopt met een rechtse leugen dat economische groei nodig is.",
            "En precies dat is het juist niet. Kunnen we niet-westerse immigranten echt blamen dat ze meer kinderen nemen dan Henk en Ingrid? Nee natuurlijk niet.",
            "Hoe is het NIET bewust en gestuurd is als er vanuit de EU word geforceerd dat je immigranten/vluchtelingen altijd moet opvangen en dat het anders in tegen bepaalde wetten in gaat. Dat is in mijn ogen bewust en gestuurd.",
            "Zolang Nederlandse vrouwen niet meer kinderen gaan krijgen, moeten wij in Nederland een combinatie van meer migratie, meer uren per week werken en langer doorwerken accepteren.\n\nPersoneelstekort in sectoren als de zorg, onderwijs en openbaar vervoer is helemaal niet prima en moet met alle mogelijke middelen bestreden worden. Dan maar meer migratie en langer doorwerken.",
            "\"Alle huizen worden weggegeven\". Het gaat om 5-10% van alle sociale huurwoningen die vrijkomen. Dat er te weinig huizen zijn is vervelend maar word je zelf ook niet een keer moe van altijd de buitenlanders overal de schuld van geven? \n\n\"De enigste kind\", volgens mij moeten sommigen onder ons eerst zelf op taalcursus voor ze over asielzoekers mogen klagen.",
            "Ik denk niet dat het een complot is. \n\nGewoon teveel mensen op invloedrijke posities die die woke-onzin geloven dat elke achterstand bij niet-blanken de schuld zou zijn van blanken en dat er \"dus\" aktie nodig is om e.e.a. recht te zetten.",
            "Jij bevestigt maar weer eens hoe kortzichtig extreemlinks is.\n\nIk heb net zo'n afkeer van nazi's als jij.\n\nMaar omvolking is gewoon een feit.",
            "Zo kun je zien dat levenstandaard en economie niet hand in hand gaan ;)",
            "Maar demografische verandering is een extreem breed fenomeen terwijl wat we nu iets vrij uniek is\n\nDit is niet vergelijkbaar met de grote verandering in noord Amerika nadat de europeanen kwamen of de grote volksverhuizing als gevolg van de Hunnen.\n\nHet enige waar het enigszins mee te vergelijken valt is de enorme influx van germanen in het romeinse rijk of in de britse eilanden die de kelten uiteindelijk vervangen hebben.\n\nMaar dan nog is het vrij uniek. Men mag daar een specifieke term voor gebruiken. Omvolking en demografische verandering zijn beiden niet passend.  Welke term echter wel",
            "Ik gok eerder dat ze doelen op zijn Nederlands-Indische afkomst.",
            "1000x dit. Er zit echt wel een stukje waarde aan vrijheid en democratie die onderdeel van onze cultuur is. Het zal mij een worst wezen hoe je er uit ziet, maar als jouw cultuur daar recht tegen in gaat dan hebben wij wel een probleem. Dus Volk is niet het juiste woord. Ironisch genoeg zijn het vaak dan juist weer de mensen die woorden als omvolking gebruiken die zelf een stuk vrijheid aan een sterke leider willen geven als oplossing.",
            "Mensen kunnen ook gewoon leren te luisteren naar wat er bedoeld word in plaats van zich focussen op wie het eerst heeft gezegd, of een woord horen wat ze niet aanstaat en daardoor het hele bericht maar naast zich neer te leggen en de andere persoon te haten.",
            "Die was ik vergeten: demografische samenstelling. Lijkt me prima. Persoonlijk boeit het me geen reet. Alsof de zogenaamde echte Nederlander hier niet ook ooit is komen aanwaaien.",
            "Wat we nu in west Europa zien is niet wat al millennia gaande is. Waar jij het over hebt zijn grote militaire veroveringen door 1 volk op een ander.\n\nWat we nu zien is misschien enigszins te vergelijken met de gigantische instroom van (onder andere germaanse) \"barbaren\" tijdens de neergang van het Romijnse rijk maar verder is dit een vrij uniek fenomeen wat met name ondersteuning is door grote corporaties om heel veel geld aan te verdienen door o.a. goedkope werkkrachten terwijl je de rest van de bevolking laat betalen voor de kosten.\n\nBeetje vergelijkbaar met de bankencrisis. Zij gokken met ons geld, de winsten houden zij, de verliezen betalen wij, en als ze op hun gat gaan dan volg er een bailout",
            "Makker, 'verandering van de demografische samenstelling' is geen woord",
            "Die hele zin is niet zo pakkend vind je wel?\n\nWaarom zijn mensen daarnaast toch zo vrijgevig om Nazi's zoveel macht te geven? Pak de woorden terug. Geef ze een een andere betekenis!\n\nHet mag dan wellicht Xenofobisch zijn, maar kun jij mij beweren dat het onjuist is dat \"oorspronkelijke\" Nederlanders een steeds kleinere groep wordt in Nederland en in meerdere steden zelfs in de minderheid?\n\nRechts extremisten en zwakbegaafden is zeker geen pleonasme. Veel rechts extremisten waren en zijn zeer intelligent. De top van de Nazi's hadden bijvoorbeeld vaak IQ's waar je U tegen zegt. Hoe graag je het ook zou willen, empathie staat niet gelijk aan intelligentie.",
            "Ongeacht wat je van het woord en de theorie vindt, wat is er precies 'racistisch' aan de term omvolking? Wie discrimineer ik als ik dat woord gebruik? Ik zou wat minder te pas en te onpas het woord gebruiken, daardoor verliest het op een gegeven moment alle waarde en betekenis.",
            "Huh. Als je het over Nazi's hebt.\n\nZie hier een taalnazi in zijn natuurlijke habitat.",
            "Totaaaaal ander argument. Jij trekt het zo breed, dan hoort VW er ook bij.",
            "En vaak is meer kinderen krijgen gecorreleerd met arm zijn en met wonen in een gebied waar de staat slecht is in ouderenzorg. Dus om dat \"probleem\" (als je het een probleem vindt) op te lossen moet je de mensen waarvan je er minder wilt juist goed integreren en zorgen dat ze goede banen krijgen en kunnen vertrouwen dat de overheid voor ze zorgt als dat nodig is",
            "Weer wat geleerd en verwijderd",
            "Sorry ik stopte met lezen toen jij stopte met lezen.",
            "Omvolking was geen strategie om het volk op te hitsen tegen een minderheid.\n\nOmvolking is een begrip dat vanaf de jaren 1930 in Nazi-Duitsland werd gebruikt (Umvolkung) voor een politieke strategie om grote groepen mensen uit Duitsland naar andere aangrenzende landen te laten emigreren met als redenering dat die gebieden tot het Duitse Rijk hoorden.\n\n[https://nl.wikipedia.org/wiki/Omvolking](https://nl.wikipedia.org/wiki/Omvolking)",
            "Dat is juist niet waar het in die tijd om ging. Het woord werd gebruikt in de context van expansiedrift. De PVV heeft die totaal niet, daarom ook dat het zo grappig is dat de vergelijking wordt gemaakt.",
            "Geef ons dan een nieuw woord om te gebruiken om te omschrijven wat er hierboven staat. Als je dat niet kan is er letterlijk niks mis met een woord gebruiken wat bestaat om iets te omschrijven.",
            "Dat maakt jou alleen maar dommer, van lezen kan je veel leren. Onder andere dat ik helemaal niets met nazisme heb maar omdat die een term gebruiken of iets anders doen maakt iets niet inherent fout.",
            "Also het aan mij ligt niet, want dat is discriminatie op geloof. \n\nIk vind dat we vluchtelingen moeten helpen.\n\nWat hun geloof of ras ook is. Iedereen heeft het recht op vrijheid. \n\nEconomisch vluchtelingen bestaan niet dat zijn mensen die niet vluchten maar geluk zoeken, die zouden beter hun eigen land opbouwen.",
            "Blijkbaar wel een genuanceerd verhaal mag niet meer.",
            "Dat Rusland migranten stuurt in de richting van Europa om Europa te destabiliseren ontken ik zeker niet. Het is erg duidelijk dat Rusland dit doet. Alleen dat is geen omvolking. Omvolking gaat echt over het weg hallen en rassen en culturen en is ook vaak een onderdeel van genocide.",
            "als ik in het midden-oosten wil wonen, dan migreer ik wel.",
            "Dat we hier in Nederland wonen waar de voertaal Nederlands hoort te zijn? De mensen die nu Engels onderling spreken moeten dat uiteraard zelf weten maar als ze hier in Nederland wonen is het niet meer dan normaal dat ze ook naar de buitenwereld in het Nederlands communiceren.\nDat klinkt misschien kinderachtig maar een van de simpelste argumenten hiervoor is juist het integreren.\nAls je stug in een andere taal blijft communiceren zal je nooit echt binding hebben met de Nederlands sprekende bewoners.\nAls ze in ieder geval proberen in het Nederlands te praten kweken ze meer goodwill dan het gewoon niet te doen.",
            "Rustig kerel/dame. Denk aan je bloeddruk.\n\nIk had het over je 4e alinea. Niet je eerste.\nVolksverandering is inderdaad niet heel pakkend nee. Niet als je een populistische politicus bent. \nVolksverandering klinkt onschuldig, van alle tijden en compleet natuurlijk. Hoe kan je daar mensen angst mee aanjagen? ze aan het denken zetten en misschien de geschiedenis in laten doen duiken van wat massa-immigratie (bewust of onbewust) voor invloed had op de oorspronkelijke bewoners van meerdere landen?\n\nPolitiek hoeft daarnaast geen social media te worden. Dat is het al jaren. \n\nAls het aan mij ligt moeten ze gewoon de term omvolking blijven gebruiken en gewoon door het te blijven gebruiken en uitleggen dat het een andere betekenis krijgt. Stop met Nazi's woorden te geven en pak de termen terug.",
            "Er vertrekken jaarlijks duizenden Nederlanders naar Belgie, zijn wij dan de Belgen aan het omvolken?",
            "Het is niet hypocriet omdat ik niet mijn voorvader ben. Ik kan dus niet verantwoordelijk gehouden worden voor iets wat hij (of beter, zijn generatie) heeft gedaan. Wat ik wel kan doen is leren van wat er toen gebeurd is, namelijk dat West-Europeanen andere culturen hebben gekoloniseerd en verdrukt, en dat in mijn achterhoofd houden. \n\nWat je met dat tweede stukje bedoelt begrijp ik niet. Ik zeg niet dat het een complot is van andere staten of religieuze leiders; ik zeg zelfs niet dat het de bedoeling van onze leiders is om een culturele shift te veroorzaken in Nederland. Wat ik zeg is dat als je mensen uit een bepaalde cultuur laat immigreren zij logischerwijs die cultuur meenemen en dat zij en hun nageslacht niet bijzonder snel de cultuur van het gastland overnemen. En dat het een natuurlijk gevolg van intensieve migratie is dat de cultuur van een land verandert. Ik denk dat het niet meer dan logisch is dat daar ook rekening mee gehouden wordt als het migratiebeleid besproken wordt. \n\nEn dat over dat een land te klein is begrijp ik trouwens al helemaal niet. Juist kleine landen worden gemakkelijk overrompeld door grotere machten..? Kijk bijvoorbeeld naar Nieuw-Caledonië.",
            "Exact, die zijn er niet. Daarom dat Australië een nationale vlag en een eerste taal heeft van een Europees land.",
            "Gelukkig ben ik geen publiek figuur. De opmerking voor het adhd kamp heb ik heel vaak vroeger als grap gehoord en zelf ook een paar keer gezegd",
            "Ja, de illuminazi natuurlijk. Want dan kunnen de krabmensen eindelijk heerschappij overnemen.",
            "Iedereen die voor open grenzen stemt, maar in een koopwoning woont.  \nbijvoorbeeld? maar jij woont vast in een koopwoning.",
            "Daar spreken linkse mensen toch over “Land back” en “decolonization” ? En de kolonisatie wordt toch als iets slechts gezien?",
            "Je noemt hier kleine verschillen, wat je nogsteeds allemaal binnen de nederlandse cultuur groep zou kunnen beschouwen, ik heb het over culturen die haaks staan op nederlandse waardes. Denk als voorbeeld hierbij aan de lhbt rechten in nederland en de doodstraf hierop in een islamitisch land.",
            "Bij Arabieren is het eerder de religie die het gedrag bepaalt. De religie is waar we ons zorgen om moeten maken, niet de huidskleur.",
            "Tja, je kunt dat een leugen vinden maar niet één partij zou ook maar één zetel halen als hun boodschap zou zijn dat we flink moeten versoberen en onze portemonnee heel hard moet slinken met oog op de toekomst. \n\nWe willen allemaal liefst meer economische groei. En daar hoort ook constant nieuwe aanwas bij.",
            "Of dat ze hun heil elders zoeken.",
            "De omvolkingstheorie houdt in dat de originele bevolking bewust wordt vervangen door een club of partij. \n\nDat er grote migratiestromen op gang zijn en waren heeft daar verder niets mee van doen. Dat zijn nogal 2 verschillende zaken.",
            "Inderdaad ja, mensen die daaraan twijfelen zouden het verdrag van Marrakesh eens moeten bestuderen.\n\nAlles wat landen doen om immigratie te ontmoedigen (bv. redelijke eisen stellen) en/of om te voorkomen dat de eigen bevolking een te hoge prijs betaalt voor het opvangen van immigranten wordt in dat verdrag een stuk moeilijker gemaakt.",
            "Ik vind je (historische) onderbouwing van waarom deze situatie echt extreem uitzonderlijk is nogal dun. De wereldgeschiedenis wordt gekenmerkt door voortdurende en frequente veranderingen van bevolkingssamenstellingen. Waarom 'onze' situatie dan opeens zo uniek is snap ik niet. De ironie is dat een complottheorie zoals omvolking nu juist precies wordt gebruikt (feitelijk onjuist lijkt mij) om de uniekheid van de situatie te onderstrepen. We geraken zo een beetje in een cirkel waarbij het belang van een unieke term in de trant van omvolking als relevant wordt gezien omdat al wordt verondersteld dat er zoiets als omvolking plaatsvindt.",
            "> Dit is niet vergelijkbaar met de grote verandering in noord Amerika nadat de europeanen kwamen \n\n\nHoe bedoel je deze? (ik vind het ook niet vergelijkbaar, maar weet niet of ik je punt begrijp)",
            "Nee hoor. Het woord bestaat al, het heeft al een betekenis. Als je iets anders bedoelt moet je een ander woord gebruiken.",
            "Ergens ben ik het met je eens, echter is dat niet hoe (geschreven) taal werkt toch? Dat OP er wel een passend woord voor wilt vinden is eigenlijk alleen maar mooi toch?",
            "Dit heeft enorme “het beïnvloed mij niet, dus anderen vast ook niet” energie",
            "Ik vind jou een teringlul. Daarbij moet je wel gewoon begrijpen dat ik daarmee \"willekeurig persoon die ik niet ken en waar ik verder geen mening over heb\" bedoel.\n\nWellicht is het slimmer om woorden te gebruiken zoals ze bedoeld zijn, zodat iedereen snapt wat je wil zeggen.",
            "Migratie is een van de grootste successen van de homo sapien.  Onze mogelijkheid ons aan te passen is een belangrijke factor in onze dominante positie. \n\nMensen hebben zich altijd verplaatst op zoek naar betere omstandigheden. 200 duizend jaar geleden en nu ook nog. \n\nRedelijke kans dat de mensen die beweren 'echte Nederlanders' te zijn migranten in de stamboom hebben als je een paar generaties terug kijkt.",
            "Mijn ervaring is dat de personen die denken een monopolie te hebben op de nederlandse cultuur (als ze voor ethniciteit gaan dan is het, zoals je aangeeft, eigenlijk al niet meer serieus te nemen) over het algemeen niet de meest exemplarische waardes en eigenschappen hebben.",
            "Nee, dit is daadwerkelijk al millennia gaande. Sterker nog, de periode dat we niet meer allemaal migreren is vele malen korter dan de periode dat we dat wel allemaal nog deden.\n\nWist je dat we als homosapiens allemaal vanuit Afrika komen? Welk woord denk je dat we gebruiken voor het verspreiden van de mensheid over de rest van de wereld? \n\nToen was het op zoek naar voedsel en veiligheid. Migratie draait daar nu in principe nog steeds om. \n\nEr is niets unieks aan migratie. Je zou haast kunnen zeggen dat het menseigen is. \n\nWat je zegt over grote corporaties klopt natuurlijk ook niet. Die hebben momenteel absoluut belang bij migratie. Maar het is niet zo dat er geen migratie meer zou zijn als we deze bedrijven zouden dwingen een normaal salaris te betalen.",
            "Ik zeg derhalve ook dat er 'woorden' voor zijn. \nMaar je mag het best inperken tot alleen 'verandering'.",
            "veranderingvandedemografischesamenstelling\n\nEn nu dan?",
            "Ik denk dat je een fout begaat door een bepaalde groep de \"oorspronkelijke\" Nederlanders te noemen. We zijn allemaal een mengelmoes. \nDe mensen die jij hiermee bedoeld zijn nergens een minderheid. Ook in grote steden niet. \nIn Amsterdam heeft 42% van de bevolking geen migratieachtergond. Ik ga er vanuit dat je die \"oorspronkelijke\" Nederlanders noemt. Dat is ruimschoots de grootste groep. De tweede groep zijn Marokkanen met 9,1% \n\nVerder klopt het absoluut dat de demografische samenstelling aan verandering onderhevig is. Dat is altijd Al zo geweest. \n\nEn waarom zou je een pakkend woord willen hebben als er gewoon prima terminologie voor is? \nVoor propaganda doeleinden? \n\nOok is het niet zo als bijvoorbeeld een swastika. De term is door de Duitsers het leven in geroepen. Ze hebben het niet ergens anders gejat. We kunnen het dus ook niet terugnemen. \n\n'Zwakbegaafdheid is een ander woord voor laagbegaafdheid. Iemand die zwakbegaafd is, heeft moeite met leren en loopt qua ontwikkeling achter op zijn medemens'\n\nIk denk dat we wel degelijk kunnen stellen dat een rechts extremist achter loopt qua ontwikkeling op zijn medemens.",
            "> Het mag dan wellicht Xenofobisch zijn, maar kun jij mij beweren dat het onjuist is dat \"oorspronkelijke\" Nederlanders een steeds kleinere groep wordt in Nederland en in meerdere steden zelfs in de minderheid?\n\nde vraag is meer, waarom denk je dat dat een probleem zou zijn als \"oorspronkelijke Nederlanders\" in de minderheid raken",
            "Hmm, waren die propagandisten die voor Hitlers regime werkten nou echt racistisch? Hmm, lastig te zeggen. Daar komt de term vandaan.",
            "Ik zou als ik jou was me dan eens in de historie van het woord verdiepen. Het is door en door racistisch. Hier een link, doe er je voordeel mee. \n\nhttps://www.historischnieuwsblad.nl/angst-voor-omvolking/",
            "Ok, dan is het nu voor mij tijd om te beginnen met het lezen.",
            "Weet je als je een hakenkruis in spiegelbeeld zet is het ook gewoon een boeddhistisch teken, maar ik zou het persoonlijk niet groot op mijn voordeur laten zetten. Een term als omvolking is perfect niet te gebruiken als je het over iets anders wilt hebben dan de Nazistisch versie. Dus als je er dan toch voor kiest om het wel te gebruiken moet je wel een heel erg goede reden aankomen vind ik en niet met \"ja maar vroegah in een andere context was het niet racistisch\". Oke fijn, maar bedoel je dat ook? Want die types die dat zeggen geven wel vrij veel reden tot twijfel.",
            "Ik zou zeggen lees mijn reactie nog een keer. Hetgeen wat je doet is juist hoog en laag springen om het goed te praten\n\nIk blijf erbij dat je je niet moet willen associëren met een Nazi ideologie wat gebruikt werd voor het uiteindelijke resultaat",
            "> Economisch vluchtelingen bestaan niet dat zijn mensen die niet vluchten maar geluk zoeken, die zouden beter hun eigen land opbouwen. \n\n\nDat is wel zwart-wit gesteld. Je kan ook economsich schrijnende omstandigheden, waarbij je bijvoorbeeld iedere dag honger lijdt, ontvluchten.",
            ">‘We moeten moslim immigratie beperken tot alleen vluchtelingen’\n\nMaar\n\n>‘Ongelovigen Arabische economische migranten binnenlaten is discriminatie gebaseerd op geloof’",
            "Je hebt ook gewoon economische migranten he, die hier komen werken.\n\n\nHoe sta je dan tegenover economische migranten uit bijvoorbeeld de VS?",
            "Als een land tering arm is en je kunt nergens werk vinden waar je jezelf mee kan onderhouden, of je kindje heeft kanker en je wilt naar een land waar geld en mediche kennis is om er wat aan te doen, zou ik zeggen dat het wat wanhopiger is dan \"gelukzoeken\". Sowieso als je met een lekkend bootje over de Mediterraanse zee vaart, is dat niet voor de lol.\n\nWat je er mee doet moet je zelf weten, maar het verschil tussen politieke vluchteling en economische vluchteling is vaak niet zo groot. \n\nEn dan heb je nog de hypocrisie van hoe makkelijk het is een visum te krijgen is voor burgers uit rijke landen vs arme landen. Tenzij we opeens \"gastarbeiders\" nodig hebben natuurlijk.",
            "Bij welke genocides was omvolking er onderdeel van? En dan is het niet racistisch om dat woord te gebruiken? Haha",
            "Het weghalen van rassen en culturen is geen voorwaarde voor ‘omvolking’, dit kan een gevolg zijn. Waar de angst kwekers gebruik van maken zijn de oproepen van extremistische imam’s om veel kinderen te krijgen en de Islam op die manier te verspreiden (gekopieerd van de katholieken in het verleden).\n\nHet is lekker makkelijk scoren voor de media, en levert veel clicks/advertentie inkomsten op.",
            "Ik wil weer dat jullie Germanen terug naar Scandinavië gaan en hier weer tussen de oorspronkelijke Keltische bewoners wonen. En nu dan?",
            "Haha nice, je legt precies uit waarom het allemaal onzin is.\n\nPopulisme is niet wat je van serieuze politiek moet willen, dat is voor cabaretiers of influencers of talk shows oid. Laten we t bij feiten houden en niet \"angst aanjagen\" door nazi terminologie te gebruiken (en daarmee ook nazi terminologie weer te normaliseren).\n\nDe geschiedenis in duiken voor feiten is wel een goed plan! Dan kan er een inhoudelijk debat zijn over volksveranderingen door de eeuwen heen, of en wanneer dat schadelijk was en of er nu iets soortgelijks is of iets anders. Net als of temperatuurveranderingen door de eeuwen heen anders is dan nu? Men denkt van wel, door debat en wetenschap. Vraag t bvb aan de demografische wetenschappers die professionals zijn. Niet een paar politici die graag meer clicks willen.",
            "> Iedereen die voor open grenzen is én in een koopwoning zit, is kwaadwillig deel van een complot om de 'oorspronkelijke bevolking van Nederland' te vervangen.\n\nVind je dit zélf gezond klinken? Klinkt dit als het resultaat van een realistisch wereldbeeld?",
            "> wat je nogsteeds allemaal binnen de nederlandse cultuur groep zou kunnen beschouwen, \n\nWaarom dan? Ik denk dat veel mensen vinden dat Limburgers en Friezen behoorlijk van elkaar verschillen.\n\n> ik heb het over culturen die haaks staan op nederlandse waardes\n\nWat zijn dan Nederlandse waardes en waarom zouden die in steen gehouwen moeten zijn? Vrouwen geen kiesrecht? Vrouwen weer achter het aanrecht? Slavernij weer invoeren? De doodstraf weer invoeren?\n\nAllemaal 'Nederlandse' cultuur uit het verleden toch?",
            "Maar jij schreef:\n\n> blanken zijn inderdaad \"beter\" dan Arabieren\n\nEn dat is ook waar de OP op leek te wijzen met de tekst\n\n> autochtone/blanke/witte Nederlanders\n\nMaar huidskleur is natuurlijk geen determinant van gedrag.\n\n> Bij Arabieren is het eerder de religie die het gedrag bepaalt.\n\nEn wanneer is iemand dan een 'Arabier'? Als je in Limburg woont? Roemenië? Griekenland? Turkije? Ander land? Of heeft het niets met landen te maken?",
            "Doen ze ook, Turkije heeft bijvoorbeeld miljoenen Syriërs opgevangen. Ook blijft Europa gewoon een droom voor de armen in het zuiden. En dat niet alleen, kijk hoeveel Oostblokkers naar Nederland komen.",
            "toch raar dat je  steeds meer jongeren met met de normen en waarden van die migratiestroom op scholen ziet.",
            "Het bewust zo veel mensen opnemen leidt tot vervanging van de originele bevolking. En onder andere de EU bepaalt dat.\n\nOok oorlogen leiden tot immigratiestromen. Denk aan Afghanen, Syriërs, Irakezen etc. En hoe komen die oorlogen? Doordat de NAVO denkt dat regime-change werkt. Ook dat is bewust.",
            "Dit is een klassieker. Mijn geschiedenis docent zij ooit jaren geleden tegen ons \"Iedereen vindt z'n eigen tijd uniek tegenover het verleden\"",
            "Je bent nu alle vormen van migratie en demografische veranderingen op 1 hoop aan het gooien en dat is een bekende retorische tactiek om het niet over een onderwerp te hebben\n\nTermen worden gebruikt om specifieke verschillen te benoemen.\n\nDat mensen al millennia seks hebben is geen reden om verkrachting geen verkrachting te noemen of SM geen SM, anale seks geen anale seks en pijpen niet pijpen te noemen. Het is allemaal seks maar het is allemaal net wat anders\n\nNu zul je wel een drogreden verzinnen waarom de bovengenoemde metaforen niet mogen zodat je niet op het kunt in hoeft te gaan dus ik zal nog wat voorbeelden noemen\n\nEr zijn een hoop dieren maar er zijn maar als we het over een huisdier hebben hebben we het niet over een krokodil\n\nMensen sporten al jaren maar als je zegt dat je met een voetballer getrouwd bent weet iedereen dat hij zijn geld niet verdient door in een bootje te gaan zitten en hard aan de riemen te gaan trekken",
            "Dat iets al heel lang bezig is is geen argument om ergens mee door te gaan. Moord, pedofilie, verkrachting en oorlog is al even lang bezig.",
            "Comment waar je op reageerde had het over een nieuw woord verzinnen. ‘Verandering’ is in ieder geval kunstzinnig onspecifiek naar deze situatie.",
            "Helemaal kut",
            "Omdat er wereldwijd  historisch gezien haast geen voorbeelden te bedenken zijn wanneer het goed uitgepakt heeft voor de \"oorspronkelijke bewoners\" wanneer zij in de minderheid raakten door immigratie.",
            "Mooie metafoor die ik onlangs op Reddit las: je geeft een feestje, en er komen onverwacht gasten op je feestje die je niet uitgenodigd hebt. Los van het feit dat je er niet op gerekend had (niet genoeg hapjes in huis, stoelen te kort), gaan deze mensen ook eisen stellen aan het menu,  willen ze ook meebepalen tot hoe laat het feestje duurt, maar vertellen ze je ook dat je intolerant bent als je niet meegaat in hun eisen. Als je zegt okee, blijf maar, nodigen ze hun familie uit, vertellen ze hun vrienden hoe goed je verzorgt word op het feestje en proberen zij ook binnen te komen, terwijl je er zelf zeker van bent dat de woonkamer nu toch echt wel krap wordt. Tuurlijk ze passen nog wel in je slaapkamer, maar echt fijn is het niet. \n\nKort antwoord op je vraag, degene die hier geboren en opgegroeid is moet zich aanpassen aan een groep die inmiddels niet meer bepaald \"minderheid\" is. Sommigen vinden het fijn om in een winkel gewoon Nederlands te kunnen praten, op een universiteit niet intolerant genoemd te worden omdat ze Nederlands spreken of aan een studentenkamer kunnen komen omdat er niet duizenden internationals op de opleiding zitten. Ik snap de hondenfluit die je blaast, maar je kan om hele praktische redenen opzien tegen het huidige migratievolume.",
            "Een van hen werd in ieder geval vrijgesproken en later zelfs bondskanselier!\n\nhttps://nl.wikipedia.org/wiki/Kurt_Georg_Kiesinger",
            "Wat voor voordeel?",
            "Heb je je zelf er wel goed in verdiept? De term zelf is niet racistisch, hij wordt niet gebruikt om onderscheid te maken tussen rassen. Omvolking als term racistisch noemen is hetzelfde als de holocaust als term racistisch noemen. Beiden zijn de benaming van een proces waarin mensen  (in meer of mindere mate) aan racisme onderworpen zijn. Bij omvolking is dat zeker niet altijd om racistische gronden geweest. Racisme is de opvatting of doctrine dat er menselijke rassen te onderscheiden zijn met daaraan gerelateerde verschillen in karaktereigenschappen, fysieke capaciteiten en/of geestelijke vermogens.\n\nWanneer je kijkt naar een voorbeeld van omvolking in de praktijk, is het Sudetenland een goede. Deze geannexeerde gebieden telden 3.630.000 inwoners waarvan 2.900.000 Duitstalig waren en de overigen Tsjechisch- of tweetalig. Zoals je ziet waren er hooguit kleine culturele verschillen, maar er was geen onderscheid te maken op ras, de bevolking had dezelfde etniciteit. De omvolking die in dit gebied plaatsvond had dan ook geen racistische inslag, maar een politiek-militaire, omdat zich veel grondstoffen in dat gebied bevonden die nuttig waren voor de Duitse militaire industrie.\n\nZoals ik eerder al zei, te pas en te onpas het woord racisme rondstrooien zorgt ervoor dat het woord aan belang en kracht verliest. Gebruik het op moment dat het echt van toepassing is.",
            "Dat is toch precies wat ik zeg? Ik zou die term nooit gebruiken. \n\nIk geloof ook niet dat er een complot achter zit.",
            "En als je leest wat ik zeg dan begrijp je dat ik het totaal niet goed praat en me ver houdt van nazi ideologie en het woord nooit zou gebruiken.",
            "Maar dan vlucht je dus niet om het financieel beter te krijgen maar omdat je honger hebt. \n\nDat is volgens de wet gewoon een vluchteling. \n\nEconomische vluchtelingen is gewoon een mooi woord voor gelukzoeker.",
            "Geen maar, en. \n\n\nIk ben geen discriminerend persoon hoe graag je me ook zo wil afschilderen. \n\nVluchteling helpen zeker, maar wel alleen echte vluchtelingen",
            "Heel eerlijk: meer negatief dan ieder ander land. Want de VS heeft met veel landen inclusief Nederland afgesproken dat immigranten uit de VS hun belastingen blijven betalen aan de VS en Nederland krijgt daar niks van. Ik vind het duidelijk racisme dat partijen als de PVV alleen alarmerend doen over Oost Europeanen en moslims, en niet daarover.",
            "Of je gaat je inzetten om je eigen land op te bouwen ipv de vruchten te willen oogsten van welvaart die anderen hebben opgebouwd.",
            "Oke, dus de oorlogen die je noemt zijn bewust gestart met als doel om veel vluchtelingenstromen op gang te laten komen?",
            "Jij beweert dat we in een unieke situatie zitten. Dat klopt niet. \nHet is le verder totaal onduidelijk wat je met deze vergelijkingen probeert aan te tonen. \n\nAlle seks gaat om het vervullen van een behoefte. Buiten verkrachting dan. \nNet als dat alle migratie gaat om het vervullen van een behoefte. \nHet is niet echt relevant of de slechtere omstandigheden die migratie drijven hun oorsprong hebben in oorlog, natuurrampen, hongersnood of politieke regimes, minder carriere mogelijkheden of armoede. \n\nMensen migreren op zoek naar betere omstandigheden en dat is letterlijk altijd zo geweest. \n\nIn de kern is elke vorm van migratie dus gelijk.\n\nEdit: Buiten gedwongen migratie natuurlijk. Die mag een eigen groepje samen met verkrachting.",
            "Je hebt het dus duidelijk niet gelezen. Dan houdt dit gesprek op. Op bewuste domheid ga ik verder niet in.",
            "Onzin, iedereen discrimineert.",
            "Maar kan je begrijpen dat ‘moslim immigranten beperken’ discriminatie op geloof is?",
            "We hebben zelfs een verdrag waardoor iedere Amerikaan met 5000 euro startkapitaal hier een bedrijf kan starten en kan wonen.",
            "Alsof veel arme landen in de eerste plaats niet zo zijn geworden door kolonialisme en uitbuiting door rijke landen. En het is niet alsof niemand daar z'n eigen land wil opbouwen, maar dat gaat een beetje moeilijk  als je eerste prioriteit is of je savonds kan eten.\n\nDe wereld bestaat niet geïsoleerde landjes die zich door de wilskracht van individuele burgers ontwikkelen, we leven in een wereld waar elke historische ontwikkeling en elke geopolitieke stap, gevolgen heeft voor andere ontwikkelingen.",
            "Dat zeg ik niet. Maar het is wel effect op effect. En aangezien je het effect na één keer al wel merkt, kijk met Oekraïne, dat weet je dat het op een gegeven moment niet meer houdbaar is. En als je er dan tóch mee door blijft gaan, dan is het ook niet onbewust.",
            "Lastig om te winnen met inhoudelijke argumenten hè? Dan maar op de persoon spelen. Typerend voor mensen bij wie het aan elke vorm van logica ontbreekt.",
            "Niet als je all niet vluchtelingen wil tegenhouden en alle vluchtelingen wil helpen ongeacht hun geloof. \n\nJij trekt een zin uit zijn verband. \n\nEr is een groeiende moslim gemeenschap in het westen en Nederland en dat is een slechte zaak. Ik geloof heilig in vrijheid van geloof maar het versterken van deze gemeenschap met personen die geen vluchtelingen zijn zou moeten worden voorkomen. \n\nAls jij dat niet uit elkaar kan houden, is dat een gebrek aan hersenen capaciteit bij jou en daar kan ik je helaas niet bij helpen.",
            "Ja ja het is allemaal de schuld van het westen. Kolonisatie is ondertussen ook al een tijdje geleden. \n\nVeel voormalige koloniën zijn opgebloeid. Die waar het slecht gaat hebben meestal daar zelf een rol in gespeeld",
            "Tja, dat is wel waar de omvolkingstheorie op neerkomt. En dat is nu net hetgeen flauwekul is.",
            "Het is geen wedstrijd. Ik geef je een stuk waarin historici het uitleggen. Als je dat negeert, het niet kunt of wil begrijpen is dat verder niet mijn probleem.",
            "\"Ik ben geen discriminerend persoon hoe graag je me ook zo wil afschilderen.\"\n\n\"Er is een groeiende moslim gemeenschap in het westen en Nederland en dat is een slechte zaak.\"",
            "Dus niet. Gezien ik toch heel vaak hoor dat we die mensen juist nodig hebben voor arbeid wat Nederlanders niet willen doen. En dus houdt men het BEWUST in stand.\n\nIk denk oprecht niet dat het bewuste omvolking is wat we zien, maar alle bewuste keuzes tussenin leiden wél tot omvolking.",
            "Ik heb het gelezen hoor, en ik begrijp prima dat de omvolkingstheorie kan voortkomen vanuit angsten die zijn ingegeven door racisme. Dat maakt de term omvolking an sich niet een racistische term. De historici die je citeert zijn geen Neerlandici. \n\nOverigens loopt de scheidslijn van de omvolkingstheorie momenteel veel meer over culturele en religieuze lijnen, dan over rassen, waardoor de term racisme sowieso niet van toepassing is. Ik denk dat praktisch niemand moeite heeft met seculiere individuen die zich aangetrokken voelen tot democratische normen en waarden en hierheen emigreren. Wel met individuen die hier pleiten voor Sharia wetgeving of individuen die hier in Den Haag hun eigen burgeroorlog komen uitvechten met alle gevolgen van dien.",
            "Ja kan je dat niet combineren? Ik wel en veel mensen met mij. Sommige slaan door door het op de persoon te spelen ipv op de ideologie.",
            "Als het geen bewuste omvolking is, is het ook geen omvolking. Dat we mensen de kans geven om hier asiel aan te vragen en dat dat ook in ons belang is op de lange termijn is geen omvolking. Dat immigranten initieel een hoger geboortecijfer hebben is ook geen omvolking. \n\nOmvolking houdt in dat er een partij aan de knoppen zit die doelbewust en actief mensen hierheen haalt om zo de blanke of witte Nederlander te vervangen. Zoals je zelf ook al zegt: daar is geen sprake van."
        ]
    },
    "Soms ben ik er even helemaal klaar mee": {
        "title": "Soms ben ik er even helemaal klaar mee",
        "score": 250,
        "url": "https://www.reddit.com/r/nederlands/comments/1dle92l/soms_ben_ik_er_even_helemaal_klaar_mee/",
        "content": "En da  bedoel ik met de gebruikelijke file op mijn woon werk traject. Het gezeik van vriendinnen over andere vriendinnen en het zwarte gat van 30 zijn en nog geen eigen woning hebben of een vriend. Laat staan kinderen of de wens hierin.\nHet meest ben ik soms klaar met de mensen I'm het verkeer die zo hard weerspiegelen hoe de maatschappij werkt. Moet jij invoegen? Lekker je eigen probleem. Ik weer 1,5 km omrijden. Ik ben er zo zo zo klaar mee. En dan moet ik de volgende generatie ook opvoeden zonder respect naar anderen, docenten of producten op school. Hoe dan?!? Ik haf zoveel respect en was al bang voor een blik. Ik snap echt niet meer wat er nou veranderd is.",
        "num_comments": 128,
        "comments": [
            "Niks mis mee om gewoon even van je af te schrijven! Laat de zure reacties maar los. \n\nFijn weekend, probeer wat op te laden. En hopelijk komt er binnenkort iets leuks op je pad waardoor je ineens héél anders tegen de dingen aankijkt.",
            "Zo is de maatschappij, wees zelf lief naar anderen. Zodra ze het zien zullen ze veranderen. Lekker gaan slapen, morgen is er weer een mooie zonnige dag. Het komt wel goed ;)",
            "Het is sowieso niet al te best gesteld met respect in NL en het wordt steeds erger. Als ik uit een ander land terugkom van vakantie is het vaak nog opvallender hoe egoïstisch en roekeloos onze cultuur over het algemeen is geworden. \n\nCultuurrelativisme is hiervoor niet op z'n plek aangezien er echt iets asociaals in onze maatschappij zit door de \"IK doe wat IK wil\"-mentaliteit door het verheerlijken van ieders recht op wat ie dan ook maar wil zonder rekening te houden met de ander, aangewakkerd door de kapitalistische ratrace uiteraard.\n\nDe relatie tussen het individu en het collectief is compleet zoek in onze maatschappij.",
            "Misschien ben jij wel veranderd? Misschien een gekke opmerking, maar het zijn dezelfde eeuwenoude patronen van opbouw en verval die zich uitspelen in de samenleving, in de stad, dorp, de wijk waar je leeft, de straat, het buurtje, de familie, het gezin.\n\nTegelijkertijd leven we blijkbaar nog in voldoende luxe om ongestraft elkaar (en daarmee onszelf) als objecten te behandelen, het gevolg is leegte, onbestemd zijn, een gevoel van er niet bij horen, compensatiegedrag, maar niets kan echte gemeenschap kopen.\n\nIk ben iets over level 40 en heb gelukkig niet echt de behoefte om mezelf voort te planten, dat ligt ook een beetje lastig :) maar uiteindelijk ligt de rust, veiligheid, warmte, liefde - dit mag gek klinken - in mezelf. En dat geef ik je dan maar mee. Laat je niet ophitsen door de ophef, door al die onzin waar zo driftig over wordt gedaan in de media, laat je niet teveel meevoeren in de waan van de dag. Dat onbelangrijke werk, dat achterlijke verkeer. Stuur er liefde naartoe. Blijf bij wat goed voelt voor jezelf <3 <3\n\nWe hoeven er niet in mee te gaan. Nou ja, er zijn natuurlijk wel zaken waar we bedacht op mogen zijn, maar we mogen er vooral zijn. Probeer de waanzin niet te begrijpen. Stel dat het lukt en je begrip zo sterk is, dat je deelnemer wordt. Blijf trouw aan jezelf. Niet dat ego-deel dat mee kan gaan in de hysterie, maar de geest.\n\n  \nSorry voor de preek.",
            "Effe lekker ranten op zn tijd moet kunnen! Is ook niet altijd een feest. Fijn weekend",
            "Ik snap ook niet waarom files zo populair zijn.. maar mensen staan ervoor in de rij! ;)",
            "Er was gisteren een jongen/man op een motor die langs mij reed terwijl ik zo'n 30 minuten naar huis aan het lopen was op een verlaten landweggetje. Hij keerde om en vroeg of ik een lift wilde. Was niet heel praktisch omdat ik een laptoptas meezeulde en er ook geen voetensteuntjes waren, maar ik vond het een erg aardig gebaar en was blij verrast dat dit nog gebeurt in Nederland. Bedankt, vreemdeling die dit nooit zal lezen!",
            "Tip: niet in de Randstad gaan wonen helpt serieus",
            "Ik heb geen idee of het vroeger beter was, relativeren is lastig als je vroeger nog niet dezelfde verantwoordelijkgeid hoefde te dragen. Ik kan mij eerlijk gezegd niet herinneren of ik een beter kut kind was dan het gemiddelde kut kind van tegenwoordig",
            "Ik voel me ineens heel oud dat ik dit ga tikken...\n\nZelf zit ik net aan de 40 en herken deels je gedachten van vroeger. Ik was eind 20 toen mijn toenmalige relatie uit ging. Ja ik had een woning (aftands huurflatje), maar woonde wel \"alleen\" op ±100km van mijn directe familie. Werk was werk en het voelde als een vervelende sleur.\n\nToen ontmoette ik mijn vrouw; en de afgelopen 12 jaren zijn ineens voorbij gevlogen. Een huis, trouwen en ons eerste kind gebeurde in een kleine 5 jaar.\n\nMoraal van het verhaal: ja, het leven kan soms uitzichtloos voelen, maar het kan ook ineens weer omslaan.\n\nTip: kijk of er dingen in me omgeving die je irriteren zijn die je kan/wil aanpassen. Bijvoorbeeld je woon-werk verkeer; zou je het zien zitten om hier wat in aan te passen... Dus een andere baan dichterbij, of een baan verder weg in een stad/gebied waar je misschien (iets) makkelijker een woning kan vinden?",
            "Motorrijbewijs halen en dan op de motor naar het werk. Het voelt heerlijk om langs de auto's te rijden en je hebt een hobby erbij om je hoofd leeg te maken in het weekend en op zomeravonden.",
            "Dit stuk tekst sluit letter voor letter aan waar ik de laatste maanden ook last van heb. Alleen ben ik een man haha.\n\nIk ben zo teleurgesteld in hoe mensen zijn. Het lijkt wel alsof er maar een handje vol mensen zijn die niet egocentrisch zijn, of gewoon een plaag voor de samenleving. Die vrouw van afgelopen week die haar hond sloeg in 't gezicht (ik heb haar hierop aangesproken), die man diezelfde week die zijn eigen zoon de huid vol schreeuwde dat ik het buiten hoorde. Ik had zelfs de politie gebeld want dat klonk oprecht niet goed daar binnen. Mensen die afval dumpen op straat omdat de prullenbak 4 meter te ver is. Die man in de bus, die aggresief werd en dreigend begon te schreeuwen en schelden omdat de busschafeur voor de 2e keer vroeg of hij wilde inchecken. Ik kan wel even doorgaan.\n\nSlechte dingen onthoud je vaak langer dan goede ervaringen, en vriendelijke mensen vallen minder op, maar ondanks dat, ben ik vooral erg teleurgesteld in hoe mensen zijn.\n\nEdit: grammatica.",
            "Helaas een hoop negativiteit in onze 'samenleving'",
            "Tradwife worden, sta je enkel nog in de file naar het strand op zonnige dagen.",
            "Ik ben moe!",
            "Je bent er ff klaar mee en dat is heel normaal. Herinner je wel dat dingen snel kunnen veranderen. En dan gaan dit soort dingen je ook minder interesseren (al geef ik je gelijk). Houd vol!",
            "Tsja geen kinderwens, maar nu mag je wel de experimenten van anderen opvoeden. Nooit helemaal begrepen eigenlijk. Na 3 stages had ik dat eigenlijk al wel door, hier ligt niet mijn carrière. \n\nGoed dat je het even van je af geschreven hebt, nu weer ademhalen en maandag weer braaf met naïeve hoop dat je die koters ooit iets bijbrengt, met bammetjes in alufolie (bonuspunten als ze zijn ingepakt door mama) naar school.",
            "Nou ga een keertje naar Japan! Dan zie je hoe het ook kan! Vriendelijkheid en respect naar iedereen en geen gezeik met autorijden want de trein is sneller, goedkoper, comfortabeler en altijd op tijd. Kinderen zijn er schaars (enorm lage geboortecijfers).\n\nIk heb mijn ouders er rondgeleid. Mijn ma is docente en doet nu haar best om dat Japanse respect in Nederland te verspreiden.",
            "Last van de dagelijkse file? Zoek een andere baan! Ze liggen voor het oprapen!\n\nEn wees blij dat je vriendinnen hebt! Gooi het eens in de groep; wat kan er gebeuren… als het echte vriendinnen zijn kom je misschien wel een laag dieper terecht met veel mooiere vriendschappen! \n\nEn ik snap dat geen huis hebben ook vervelend kan zijn in deze huizencrisis. Maar ik (m38) ben jaloers op jouw vrijheid! Koop een camper, verhuis naar een andere stad of een heel ander land! \n\nDat geldt ook voor het niet hebben van een vriend en kinderen. Ik heb er drie, zou echt niet zonder ze willen maar het is ook een hele verantwoordelijkheid en het kost een heleboel tijd en geld (kinderopvang voor één kind twee dagen in de week kost mij meer dan de hypotheek).\n\nGeniet van je vrijheid; ga (een andere) stad in, zoen een leuke kerel, reis, maak vrienden, ontdek jezelf!",
            "Je moet geen kinderen hebben. Tis gelukkig nog optioneel. Is ook rete duur met kinderopvang. ",
            ">Ik snap echt niet meer wat er nou veranderd is.\n\nIkke ikke ikke en rest kan stikke.\n\nAnyway, mijn life hack pro tip is een tesla kopen met autopiloot en in de file lekker slaapje doen of netflixen. Evt met beide handen tegelijk de middelvinger opsteken naar verkeersaso's.",
            "Misschien moet je een nieuwe politieke partij oprichten?",
            "Gaat het?",
            "Laat het lekker lopen en geniet van je weekend alvast. Ik deel grotendeels van je mening ook. Soms is het moeilijk om aan je normen en waarden vast te houden als je ziet hoe mensen buiten, onderweg of op werk zich gedragen. Dan voel je een buitenbeentje omdat je denkt van ''ben ik de enige hier met een beetje fatsoen?''. Gelukkig is het weekend en de zon begint steeds meer te schijnen. Hou je hoofd hoog. Er zullen betere tijden komen.",
            "Maakt niet uit wat je doet je spekt toch de huisjesmelker",
            "Mijn ervaring is anders. Ik stond ook dagelijks in de file, maar door infarct werk ik nu niet meer. Wat ik wil zeggen is dat mijn beleven is dat constant mensen hulp aanbieden en ik merk weinig individualisme ( behalve dat iedereen teveel met z’n telefoon ipv elkaar bezig is). Mijn situatie is nu bijna 5 jaar, en ik heb letterlijk nooit meegemaakt dat iemand vervelend tegen me doet.( misschien moet ik er bij zeggen dat ik o.a. moeilijk loop, dus eea hebben mensen snel door).\nKortom: de maatschappij is veel specialer dan ik soms om me heen hoor/lees",
            "Tijd voor een welverdiende vakantie. 🍹",
            "Invoegen is een bijzondere verrichting: niemand hoeft plaats voor je te maken, maar jij moet zelf je auto er tussen gooien. Dan moet je niet te defensief rijden als het spits is, want dan raak je er nooit tussen.",
            "Lekker verhuizen. Je woont waarschijnlijk in de Randstad, maar Nederland is groter dan dat. Als je op een school werkt dan kun je prima een baan vinden ergens anders in Nederland en je zal zien dat de mentaliteit daar totaal anders is en er geen files staan en iedereen elkaar de ruimte gunt op de weg.",
            "Tegenwoordig moet je ballen hebben in het verkeer, zelfs met een zebrapad krijg je als voetganger soms geen voorrang. Mensen kunnen behoorlijk egoïstisch zijn zodat zij zelf wel uitgerekend 30 seconden eerder thuis zijn.\n\nEn over geen vriend hebben laat staan het kunnen overwegen van wel of geen kinderen zou ik me ook niet te veel druk overmaken. 30+ daten is echt verschrikkelijk, vooral met dating apps en het zogenaamde overschot aan opties die mensen (denken te) hebben. Het is ook lastig om iemand organisch tegen te komen als je al full-time werkt. Ik kan zelf geen advies geven, maar ik was ook lang single (5 jaar) en gaf op een gegeven moment bijna de hoop op maar uiteindelijk toch gevonden vorig jaar (33) en met 30 ben je nog jong zat. Ik heb wel nog wat single vriendinnen die ook echt 30+ strugglen met daten. Ook vrienden trouwens. Of zij haken snel af of die ander haakt snel af.. Alsof hoe meer aandacht en interesse je geeft hoe meer het wordt gezien als desperate en mensen willen niet iemand die te veel interesse in ze hebben ofzo. Daten tegenwoordig is zo raar en ingewikkeld. Beter maak je gewoon vrienden. Met mijn vriend was het ook eerst meer een vriendschappelijke band ook omdat wij op afstand zitten.",
            "*\"Als je elke dag in dezelfde file staat ben je niet erg intelligent\"* (uitspraak van een of andere NL cabaretier maar kweet niet meer wie)",
            "Ik ben een paar jaar geleden vertrokken en woon nu grotendeels in Aziatische landen.\n\nIk krijg een dikke cultuurschok elke keer weer wanneer ik terug kom in Nederland.  \nEr is amper begrip of verbinding tussen de mensen.\n\nIk waardeer mijn tijd nu meer wanneer ik in Nederland ben maar ik ben ook blij om weer te vertrekken.",
            "Zoek alsjeblieft hulp, deze subredddit is echt en echokamer aan het worden van depressieve mensen.",
            "Wanneer je je realiseert dat de meeste mensen klootzakken zijn gaat er een deur voor je open.\n\nJe hebt nu de mogelijkheid te kijken of jij er ook een bent, of niet. En verandering aan te brengen.",
            "Kom gezellig  hier wonen, ik heb een eigen huis, kinderen heb ik al, ze opvoeden doe ik zelf wel, buiten komen mag je niet meer dus geen gezeik meer met vriendinnen of familie, al je problemen ineens opgelost!",
            "100k jaarlijkse netto import van nieuwe mensen in Nederland zal vast wonderen doen voor de druk op voorzieningen zoals de wegen....",
            "Het verkeer is de slechtste plek om onze maatschappij mee te maken. Het spijt me dat je elke dag met files moet dealen. Maar laat de mensen daar niet je beeld vormen van de rest van de maatschappij. Nederland verhuftert wel, maar er zitten nog steeds veel goede mensen tussen. Zolang je het gevoel hebt dat je er zelf ondanks alles nog één van die goede mensen bent, dan ben jij er zelf het beste uit gekomen!",
            "Helemaal eens: dat zijn allemaal dingen die heel uitzichtloos kunnen voelen. Wat invoegen betreft: gaspedaal werkt beter dan de rem, om in te voegen. Niet een plekje zoeken maar een plekje pakken.\n\nDe wet is ook: invoeger moet voorrang verlenen, niet andersom. Dat mensen aan de kant gaan of ruimte maken is een vriendelijkheid die niet altijd kan. \n\nHopelijk scheelt dit één frustratie in de toekomst.",
            "Je hoeft je kop niet in het zand te steken om het zelf anders te doen, lijkt me. Juist niet. \n\nDe valkuil (althans voor mij) was het idee dat ik dacht te weten hoe \"de mensen\" zijn. Alleen daar zitten nogal wat nuances in. De werkelijkheid is niet binair (zwartwit) maar juist oneindig complex / non binair (het oneindige grijs tussen dat zwart en wit).\n\nJa, we hebben inmiddels een maatschappij waar egocentrisme welig tiert, maar dat wil niet zeggen dat iedereen een egoïst is. Helaas is dat wel het narratief wat ons via o.a. de media wordt voorgespiegeld.\n\nToen ik zelf de stap nam om daar niet in mee te gaan en mensen als mensen te benaderen (niet meer angstig voor mijn eigen kwetsbaarheid, emoties en gevoel).en die media grotendeels liet voor wat het was, zag ik dat de theorie (de wereld volgens de televisie) en de praktijk (de dagelijkse omgang met anderen) nogal ver uit elkaar bleken te liggen. \n\nJa, je hebt asos, toxische personen en mensen die enkel en alleen op eigen gewin uit zijn (we kiezen ze vaak als leiders), maar er zijn zeker ook (in mijn ervaring veel meer dan ik, vanuit mijn conditionering, dacht) mensen die juist heel sociaal zijn, empathisch zijn en het beste met een ander voor hebben. In die zin heeft \"anders naar dingen kijken\" voor zowel jezelf als een ander wel degelijk impact.\n\nMocht je (of iemand) dat een zweverig onzin verhaal vinden, dan kan en mag dat uiteraard ook, maar de ervaring hier heeft geleerd (en als er iemand cynisch was, dit aangaande, was ik het wel) dat \"het zelf anders doen\" wel degelijk afstraalt op anderen.\n\nIk ben misschien beide.\n\nNaar bekenden toe ben ik erg loyaal en sociaal ,maar de rest boeit mij gewoon niet.\n\nBen wel respectvol naar anderen toe  in het verkeer of gewoon op straat,maar daar houdt het wel mee op.",
            "Proost",
            "Hoewel ik je rant snap en het soms echt lekker is om dat ff te doen; probeer je (vooral van het verkeer en de verkeershufters) niet teveel er van aan te trekken. Ja, die file is kut. Maar de enige wie haar dag slechter wordt door hier geirriteerd over te raken is die van jou. Zelfde met verkeershufters; als zij jou afsnijden en je hierdoor opgefokt in de auto zit, wie heeft dit invloed op? Niemand behalve jij! Laat het gewoon lekker gaan, en bedenk dat die gasten die zich zo gedragen echt een triest leven hebben.\n\n  \nZo zit ik elke dag, als ik niet met de motor ben, ook in de file bij barneveld op de A1. Allemaal van die gastjes die allemaal gehaast baan wisselen om vervolgens toch nog naast me te staan, 200 meter verderop. En in die tijd heb ik lekker rustig aan gedaan, ontbijtje gegeten en een leuke podcast zitten luisteren. Vervolgens komen hun gestrest aan op werk, en ik lekker relaxed",
            "Ik snap precies wat je bedoelt. Er wordt vaker terecht gesproken over een verhuftering van de samenleving. Ben in een jaar tijd twee keer aangereden.  De eerste keer zou de schade volgens de tegenpartij niet het gevolg van de aanrijding zijn geweest, de tweede keer ging de tegenpartij er vandoor. In het verkeer wordt je geen cm gegund en als je in de rij staat bij de winkel zijn er geregeld mensen die denken dat ze een fastlane ticket hebben. \n\nNu ik een zoontje heb die naar school gaat zie ik daar hetzelfde gebeuren. Het contrast wat je ziet is enorm. De kinderen die door de ipad worden opgevoed en ouders die nauwelijks investeren in de toekomst van hun kroost beloven niet veel goeds. Gaat er iets anders dan wat men hoopt/verwacht, ligt de oorzaak altijd bij een ander of wordt de slachtofferkaart getrokken. Gelukkig zijn er nog steeds genoeg kinderen die wel liefdevol, ruimdenkend en met goede normen en waarden worden grootgebracht.\n\nHoe moeilijk het ook kan zijn, probeer er nooit spijt van te hebben als je goed bent voor de verkeerde mensen. Jouw gedrag zegt alles over jou en de reactie van een ander zegt genoeg over hen. Je gevoel zegt misschien dat iemand jouw positieve energie niet verdient, maar als je hierin meegaat raak je snel je innerlijke schoonheid en idealen kwijt. \n\nHelaas blijven negatieve ervaringen vaker en langer in ons hoofd spoken. De realiteit is gelukkig dat er nog altijd meer positieve dan negatieve dingen in het leven zijn. Soms vergeten we alleen om hier wat langer bij stil te staan.\n\nBlijf hoopvol en een goed en puur mens. Gegroet, de stille medemens.",
            "Heb je al eens naar werk buiten de randstad gekeken? Ik woon in het oosten op 10-15 minuten van mijn werk afhankelijk van het weer. Woningen zijn niet moeilijk te vinden dus mensen wonen zelden ver van hun werk.\n\nMet diezelfde tien minuten reistijd ben ik buiten de stad in het groen op de fiets of met de auto. Of gewoon groen in de achtertuin want de huizen hebben hier ook nog steeds een tuin.\n\nIk moet voor mijn werk wel eens naar de randstad maar dat voelt alsof je afdaalt in een riool. Ik snap niet dat mensen er vrijwillig willen wonen.",
            "1,5 km omrijden? Leg uit.",
            "Vooral geen extra mensen op de wereld zetten. Daar zit namelijk mede de oorzaak. Veeeeel te veel mensen op de aardkloot.",
            "Je levensgeluk af laten hangen van  \nexterne factoren of vergelijken met anderen.",
            "Heb je al tot tien geteld?",
            "Ik ben al 20 jaar vrachtwagenchauffeur, nog nooit moest ik 1,5 km omrijden omdat iemand moest invoegen. Overdrijf lekker meid. ",
            "Kom elke dag klaar...",
            "Inderdaad he! Maar.... je hebt een aardig betaalde baan,  hebt alle vrijheid,  want geen man, hypotheek,  of kinderen. Je hebt een auto. \n\nMaatschappij is pretty much fucked. Die kinderen worden niet beter.  Verlaag jouw verwachtingen van de medemens.\nVoeg agressiever in. Koop desnoods een barrel waarbij blikschade slechts een toevoeging aan het patina is\n\nDoe vandaag wat leuks.",
            "Tip, tijdens invoegen (ruim) op tijd richtig aangeven en gewoon gaan. Ze moeten je ruimte geven, en anders pers je jezelf er maar tussen.\n\nNu rij ik in een zware elektrische SUV, dus speel ik wel het spelletje van recht van de sterkste, maar zo goed als iedereen zal afremmen als ze je neus naar rechts zien gaan.\n\nIs het netjes? Nee. Maar ondertussen wel een beetje noodzaak.",
            "Take a Snickers",
            "Over dat invoegen: dat is, heel bot gezegd, ook daadwerkelijk jouw probleem. Het verkeer op de hoofdrijbaan heeft nu eenmaal voorrang. Wat vaak helpt is op tijd richting aangeven, een beetje tempo maken (dus geen 60 blijven rijden) en gebruik maken van gaten die vallen.",
            "Herken hier niks van eigenlijk.\nMijn directe omgeving is helemaal top.\n\nMaar ik woon ook niet in die verrotte randstad.\n\nMisschien woon jij wel tussen de kut mensen.\n\nEn misschien ben je zelf wel een waardeloze chauffeur die veelte laat haar afslag wil nemen en dan boos word dat er iemand anders al rijd. Je kan gewoon anticiperen en alvast in de juiste baan rijden 1km van te voren. Kan gewoon navigatie op je telefoon aanzetten als reminder.\n\nBen er eigenlijk wel van overtuigd dat het deels voornamelijk aan jezelf ligt, sorry niet sorry.",
            "Ik ben naar een dorp verhuisd. Beste keuze ooit.",
            "Amen! 🙏🏻",
            "Okee",
            "Super vervelend als die voor een stoplicht en op de 'verkeerde' baan staat. Sprint stoplicht voor rechtdoor op groen, blijft die flapdrol staan omdat die naar links (of rechts) moet.\nWat is er mis met doorrijden en volgende terugrijden of andere weg pakken, wat een flapdrol.",
            "First world problems",
            "Niks mis met soms even lekker klagen. Maar wat bij mij dan helpt is bijv een docu kijken over kinderarbeid in Bangladesh of sloppenwijken in Zuid-Afrika. Dan besef ik me ineens heel erg hoe goed we het hier hebben, met onze luxe.",
            "Emigreren?",
            "Niet zo kankeraanstellen gap",
            "Hahaha jij gaat serieus omrijden omdat mensen je niet laten invoegen? Gewoon knipper aan en ertussen gooien, niet bang wezen.\n\nVroeger gaven mensen je wel ruimte, tegenwoordig moet je het zelf opeisen en schijt hebben aan de regels.",
            "Ik herken me als 33 jarige eigenlijk totaal niet in de problemen van mijn leeftijd genoten. \n\nIk heb een koopwoning, vast contract, geen studieschuld, een mooie lease auto, 100K+ spaargeld. \n\nEn ook de files weet ik meestal wel te ontwijken door of thuis te werken, of door lijp vroeg te vertrekken. Ik heb een klant in Eindhoven. Ik vertrek meestal om 6:30, dan ben ik vaak al ruim voor 8:00 bij de klant. Terwijl als ik om 7:30 wegrij ik er waarschijnlijk pas na 9:30 ben.",
            "Fijne comment, mee eens",
            "Ja ff een rant op z’n tijd is lekker. Daarna ff douchen of een frisse neus halen of zo. Beetje bewegen is goed voor alles.",
            "Ik waardeer je optimisme, maar ik ben het wel met OP eens. Anders tegen dingen aankijken omdat je zelf wat positiever bent, klinkt voor mij een beetje naïef. De problemen die er zijn verzin je niet, die zijn er. Je kan het zelf goed voor elkaar hebben en als een struisvogel de kop in de grond steken, maar dat betekend nog niet dat de egocentrische maatschappij dan verbeterd. Ik ben net zoals OP teleurgesteld in hoe mensen zijn. En dat is niet pessimistisch maar realistisch.",
            "Een deel van de maatschappij. Helaas wel een sterk aanwezig deel 😀\nMaar ik kom gelukkig dagelijks nog leuke mensen tegen die groeten en terug groeten, tijd hebben voor een praatje en behulpzaam zijn of hulp accepteren. Het is er nog.",
            "Nederlander hebben een hekel aan regels en autoriteit. Iedereen, stuk voor stuk. Dat zie je o.a. terugkomen in het gedrag naar elkaar: \"Niemand vertelt mij wat IK moet doen.\"\n\nWe verkopen ons naar het buitenland ook vaak als direct, maar niet zelden zijn we gewoon ontzettend lomp. En daar zijn we nog trots op ook.",
            "In derde wereld Landen zie ik pas roekeloos op de weg. Niemand kent de verkeersregels en doden zijn gebruikelijk. Je gunt elkaar daar geen cm.\n\n\nMaar we wonen wel constant dichter op elkaar en er onstaat steed meer wrijving.\nKlein voorbeeld, vroeger zei ik nog hallo als ik langs iemand liep in mijn buurt, zo vaak negeerd dat ik er maar mee ben gestopt.",
            "Op vakantie heb je ook een roze bril op en omdat je zelf een goed humeur hebt (en met geld strooit) hebben anderen dat dus ook. Ik heb gewoond in Zuid Europa, zuid-oost Azië en Engeland en overal is het nagenoeg hetzelfde. Ja, Nederlandse cultuur is minder warm en wat individualistischer maar meer roekeloos en egoïstisch is het echt niet.\n\nRij maar eens in een auto in Jakarta of Zagreb, dan kan je niet wachten tot je in Nederland een BMW tegenkomt die zijn knipperlicht vergeet of te dicht voor je invoegt.",
            "Mooi stuk tekst. Ik deel de mening van OP dus ik kan deze comments ook goed gebruiken.\n\n>Probeer de waanzin niet te begrijpen.\n\nHaha dat is een lastige. Maar wel een goede tip. Wie weet werkt ie. Dankjewel.",
            "Lief <3",
            "Prachtige stukje tekst",
            "Ze toeteren zelfs van vreugde als ze in de file staan.",
            "Ach, het positieve aan in de file staan, is dat je in iedergeval niet de enige bent.",
            "Ben zo blij dat ik er niet woon, zou slecht zijn voor m’n mentale gezondheid",
            "Niet in de Randstad gaan werken al helemaal 🍻\n\nFijn weekend allemaal",
            "En ik klaag al over het verkeer op de A2 in Limburg...",
            "Opgegroeid in de jaren 70 en kan beamen dat we toen net zo kut konden doen als de kinderen van nu :).",
            "Ik heb dus m'n motorrijbewijs maar heb een ongeluk gehad 2 jaar geleden en 2 wervels verloren erdoor. Nu met pinnen in rij ik wel weer!",
            "En dan aangereden worden door een auto die niet oplet",
            "Rip",
            "Mensen blijven hangen. Als je in een baan zit die je niet bevalt, zoek dan een andere. Waarom in de file staan, of werken met collega's die niet leuk zijn? Als je iets anders wilt, moet je het zoeken.",
            "En later in de file voor de voedselbank als je relatie uitgaat.",
            "+1 voor het niet hebben van kinderen meer normaal maken",
            "Daarvoor moet je toch echt bij BMW zijn. Autopilot in NL werkt slecht.",
            "30 Plus",
            "Partij voor het Invoegen",
            "Ja, goede vraag. Het zijn wel de mensen die de wegen aanleggen en het werk doen wat moet gebeuren. Zie tegenwoordig nauwelijks stratenmakers die Nederlands zijn.",
            "Wellicht dat ze jou met je vrachtwagen er sneller tussen laten dan OP in, bijvoorbeeld, een Fiat Panda 😉",
            "Je moet niet ruim optijd richting aangeven, je moet richting aangeven wanneer je gaat. Als je vijf minuten met je knipperlicht aan rijd gaat niemand er meer vanuit dat je daadwerkelijk gaan en ook niemand weet wanneer je gaat. Gewoon snelheid maken gat kiezen, richting aan en gaan.",
            "Inderdaad",
            "Hij bleef met z'n witte bus ten hoogte van mijn spiegel rijden en ik heb laatst ook dat filmpje op dumpert gezien van die auto die aan de kant werd gegooid toen hij afsloeg.. ik kan me die schade niet veroorloven",
            "Ok fijn voor je",
            "> Lijp vroeg vertrekken\n\n> 6:30\n\nHuh?\n\nWel mooi voor elkaar verder, doe je goed!",
            "Misschien ook even wat empathie kopen dan.",
            "Mijn werkgever staat thuiswerken of flexibele werktijden niet toe. Ik sluit dus mooi dagelijks aan als het weer bal is. Zoals nu omdat die fucking A7 dicht (omdat de vrachtwagens zo nodig het verbod moesten negeren) is en daarom een groot deel van dat volk over mijn weg komt.\n\nMaar even eerlijk: Heb je gewonnen op eigen kracht of hebben jouw ouders je, net als bij mij, een voorsprong gegeven door je studie (grotendeels) te betalen?",
            "Je hoeft je kop niet in het zand te steken om het zelf anders te doen, lijkt me. Juist niet. \n\nDe valkuil (althans voor mij) was het idee dat ik dacht te weten hoe \"de mensen\" zijn. Alleen daar zitten nogal wat nuances in. De werkelijkheid is niet binair (zwartwit) maar juist oneindig complex / non binair (het oneindige grijs tussen dat zwart en wit).\n\nJa, we hebben inmiddels een maatschappij waar egocentrisme welig tiert, maar dat wil niet zeggen dat iedereen een egoïst is. Helaas is dat wel het narratief wat ons via o.a. de media wordt voorgespiegeld.\n\nToen ik zelf de stap nam om daar niet in mee te gaan en mensen als mensen te benaderen (niet meer angstig voor mijn eigen kwetsbaarheid, emoties en gevoel).en die media grotendeels liet voor wat het was, zag ik dat de theorie (de wereld volgens de televisie) en de praktijk (de dagelijkse omgang met anderen) nogal ver uit elkaar bleken te liggen. \n\nJa, je hebt asos, toxische personen en mensen die enkel en alleen op eigen gewin uit zijn (we kiezen ze vaak als leiders), maar er zijn zeker ook (in mijn ervaring veel meer dan ik, vanuit mijn conditionering, dacht) mensen die juist heel sociaal zijn, empathisch zijn en het beste met een ander voor hebben. In die zin heeft \"anders naar dingen kijken\" voor zowel jezelf als een ander wel degelijk impact.\n\nMocht je (of iemand) dat een zweverig onzin verhaal vinden, dan kan en mag dat uiteraard ook, maar de ervaring hier heeft geleerd (en als er iemand cynisch was, dit aangaande, was ik het wel) dat \"het zelf anders doen\" wel degelijk afstraalt op anderen.",
            "Heb je er weleens gewoond? Het is echt niet zo slecht.",
            "Helemaal niet werken, nog beter!",
            "Misschien moet ik maar gaan emigreren naar een onbewoond eiland idd",
            "Als ik tradwife zou worden (en dat is lastig want ik ben man) zou ik dat alleen doen in gemeenschap van goederen",
            "Goeie rijke uitzoeken en eerst trouwen? 🤷‍♂️",
            "Wil ze zelf wel graag uiteindelijk maarja mensen moeten zich niet geobligeerd voelen. En tja, tis nu nog gewoon erg duur.",
            "Werkt prima. Misschien ben je in de war met full self driving (FSD).\n\n\nAutpilot is gewoon de rijbaan volgen met adaptive cruise control en dat gaat heerlijk in de file.",
            "Partij Voor Vluchtstroken!\n\nIs poëtischer",
            "Beetje remmen en dan erachter? Je hoeft er niet perse voor in te voegen",
            "Je kan ook even wachten. Daarmee bedoel ik: er zijn echt mensen die je dan alsnog laten invoegen.",
            "iemand kan er duidelijk niet tegen dat u/Th3_Accountant tevreden is met zn leven…",
            "Jij werkt in de bouw zeker dat je daar niet van opkijkt?",
            "Heb je hier al over gesproken met je werkgever? \n\nIk ben me ervan bewust dat zonder mijn ouders ik waarschijnlijk een kut baantje zou hebben (of werkeloos zou zijn), alleen in een klein sociale huur appartementje zou wonen en waarschijnlijk de hele dag zou gamen en blowen. \n\nMijn ouders hebben Luzac voor mij betaald, mij als langstudeerder langdurig financieel ondersteund, een jubelton gegeven voor de aankoop van mijn eerste woning, die ik onder de marktprijs van mijn oma heb gekocht en daar bovenop nog de verbouwing betaald. \n\nDaar bovenop krijg ik nog steeds regelmatig grote schenkingen, betalen ze mijn zorgverzekering, mijn aanstaande bruiloft en betalen ze jaarlijks de wintersport.",
            "Ik vind dit zeker niet zweverig. Mooi om te horen dat je er wat positiever tegenaan kijkt dan ik. Misschien zal ik er ooit op een dag ook zo naar kijken, maar met mijn huidige ervaring laat dat op zich wachten.",
            "Ik kom er vaak vanwege familie en ik kan niet zo goed tegen drukte, ik moest er wel eens rijden tijdens spitsuur en ik vond het echt vreselijk. Ook de hoeveelheid mensen die altijd ergens zijn is niet fijn. Ik vind het mooi dat anderen er met plezier kunnen wonen, maar ik zou het niet kunnen. Ik ben blij dat ik in het midden van nergens woon lol.",
            "Laat deze man koken",
            "Als ze de uitkering eens wat hoger maakten, hoefde je er ook niet zoveel bij te doen.",
            "En ik zou dus, als vent, door wat ik nu al heb opgebouwd eigenlijk nooit in gemeenschap van goederen willen trouwen.\n\nOverigens zoek ik ook geen tradwife, dus dat scheelt. Ik zou knettergek worden van een vrouw die niet wil werken.",
            "Moet ‘ie wel echt ranzig meurend rijk zijn, en wel in gemeenschap van goederen trouwen, want partneralimentatie is volgens mij al zo goed als afgeschaft.",
            "Hey Hugo! Alles kids?",
            "IT! Koos ervoor om mijn kantoordag vroeg te beginnen met het idee dat er vast nog geen file staat voor 6 uur op de A4. Bleek helaas niet het geval..",
            "Ik wens je alle goeds en voor nu, hopelijk, een fijn weekend!",
            "Ah oke, ik dacht dat het meer ging over de mensen zelf niet de hoeveelheid mensen. Het is inderdaad een stuk drukker dan mijn dorpje in Brabant. Ik heb een tijdje stage gelopen in een stad met 10.000.000 mensen, sindsdien voelt centrum Den Haag een stuk rustiger.",
            "Dat klinkt verdacht veel als werken",
            "Serieus ja? Files om 6:00? \n\nGoed, het kan altijd een keer voorkomen dat een of andere idioot op dat tijdstip al een ongeluk heeft veroorzaakt. Maar dat zijn uitzonderingen naar mijn ervaring.",
            "Dankjewel jij ook! \nKomt goed hoor. Alleen omdat ik denk dat er teveel egocentrische mensen zijn betekend niet dat ik niet van mijn weekend kan genieten. :)",
            "Ik zou willen dat ik het verzon... Maar de keren dat ik dat traject zonder files heb kunnen rijden kan ik op één hand tellen.",
            ":D :D"
        ]
    },
    "mephis moet even wisselen": {
        "title": "mephis moet even wisselen",
        "score": 219,
        "url": "https://www.reddit.com/r/nederlands/comments/1dlcxlq/mephis_moet_even_wisselen/",
        "content": "ik vind dat memphis even moet wisselen.",
        "num_comments": 150,
        "comments": [
            "Hij is de zwakste schakel. Tot ziens",
            "12 keer balcontact, 10 keer verloren. Onzichtbaar voorin. Tijd voor wat anders.",
            "Tsja, veel beter hebben we niet voorin. Weghorst is leuk om af en toe wat te forceren, maar heeft wel minder kwaliteit. Niet echt een spits om er vanaf de 1e minuut in te hebben.",
            "Gespreekt",
            "Memphis moet visser worden, wie weet heeft ie daar wel passie voor!",
            "Hij heeft toch een paar hele mooi passes gehad waar goede kansen voor Frankrijk uit voort kwamen, ook een kwaliteit.",
            "Ik vindt 💀",
            "Memphis heeft op 4 eindtoernooien (huidige meegeteld) 3 doelpunten en 1 assist gemaakt. \n\nNiet echt cijfers die schreeuwen om een onvoorwaardelijke basisplaats. \nMaar denk dat hij precies weet hoe zout de ballen van Koeman zijn, een andere verklaring heb ik er ook niet voor.\n\nEdit: 5 doelpunten en 1 assist. Anderhalf doelpunt per eindronde. Nog steeds geen indrukwekkende cijfers.",
            "Gelukkig komt nu Wijnaldum, kunnen we ons ergeren aan een speler die echt, écht, maar dan ook écht geen ene tering meer in oranje te zoeken heeft",
            "Memphis moet gewoon de selectie uit.",
            "Ik had het hier dus vandaag met een collega over. \n\nDie Depay heeft een hele nare uitstraling imo. Ik kan m’n vinger er niet opleggen, misschien het patsergedrag, of omdat ie nog steeds omgaat met Promes, geen idee. Gewoon nee. Krijg altijd een beetje agressieve neiging van dat mannetje.\n\nHeb liever een van Dijk of zo.",
            "Iemand voetbalplaatjes van Lidl hebben? Ik heb nog enkele Franse spelers over...hebben wel een paar keer op de grond gelegen",
            "Grote mond kleine voeten",
            "Ik vind hem Var gezocht",
            "En gauw!",
            "Ik vind dat scheids even moet wisselen.",
            "Manmanman ik corrigeer taalfouten bijna nooit, maar kom op.. ik vindt?",
            "Van haarband of voor Mr. Weghorst? ;)\n\nDe eind pass is ook gewoon echt niet goed, maakt niet uit wie er staat als je zo slordig bent voorin, imo.\n\nEdit: Gaat echt niet goed zo.....",
            "Deze antwoord ga ik niet bevragen",
            "Lekkere tekst weer! Memphis moet wisselen? Nee, Koeman moet wisselen, Memphis moet gewisseld worden.",
            "Zou Memphis weten dat de zweetband boven de wenkbrauwen gedragen wordt ipv eronder?",
            "Vind hem een beetje overschat, en denk vaak over het gros van de voetballers \"is dit nou miljoenen waard???\".\nKrijgen een belachelijk salaris en dan zo lopen stunten.",
            "Ik vind dat mensen die “ik vindt” schrijven eerst even in de spiegel moeten kijken voordat ze een mening uiten over anderen.",
            "Ja, met een van F jes van Koedijk 6",
            "100%",
            "Hij is zo ontzettend slecht. Meest overschatte speler in Oranje ooit",
            "Malen > depay",
            "Atouba > depay",
            "Van de beukering > depay",
            "Mephis moet is een beetje normaal gaan doen of de  sterren van de hemel gaan voetballen",
            "Ik ga zo opstijgen met mn vakantievlucht en heel het vliegtuig is verbroederd op vol volume bij elkaar aan het kijken",
            "Eens",
            "Memvis drama. Simons drama. Onbegrijpelijk dat die basis staan.",
            "Als ie nou 5 doelpunten maakt. (ik kijk geen voetbal maar dat is goed toch?)",
            "Kunnen we Engeland niet een zet geven zodat we geen scheidsrechters meer tegen komen. Na een taylor in 2010 hebben we weer een taylor tegen🤬🤬🤬🤬🤬",
            "‘even’ 😂",
            "Hahahha precies",
            "Memphis eruit, Malen of Weghorst erin.",
            "Even serieus, hebben we überhaupt iets van een 90 minuten spits in Nederland op het moment?",
            "je advies wordt in beraad genomen",
            "Z’n zelfreflectie is al net zo beroerd als\nz’n voetbal.",
            "WUTRUUUUUUU",
            "Hij zwemt in het water, en eh.. scoren kan hij niet.\n\nMemphis de haai",
            "Als we toch bezig zijn, koeman ook graag even wisselen.",
            "Weetje.. ik ben allang blij dat babel eindelijk weg is lol.",
            "Wisselen ??? Gewoon helemaal uit de selectie ! Zoekt alleen maar aandacht met zn gekke haarbandje en zijn voetbalkunst is ook vergane glorie.",
            "Ze hadden gwoon Robben erin moeten plaatsen. Die maakt gwoon een goal jonguh.",
            "Zet mij erin",
            "Even wisselen Pietertje",
            "Goede spelverdeler zoals Wijnaldum had een groot verschil gemaakt. Geen gevaar van de zijkanten maar vanuit de as van het veld en dan kan Memphis een gevaar zijn meer dan weghorst",
            "Ik mis Van Persie, Robben en Sneijder...\n\n\nLang geleden alweer. Jammer genoeg, heeft de formatie van nu geen aanvallers die initiatief nemen.",
            "Waarom al die haat voor Memphis?",
            "Nou doe je wijnaldum te kort, al is dit bericht denk ik van ver voor zijn invalbeurt.",
            "Die gast scoort al jaren niks wat een willekeurige eredivisie spits niet ook zou scoren. Maar wel tering tof doen als hij er een keer een penalty in jaagt.",
            "Samen met simons",
            "Dus daar staat die 10 voor die op z’n zweetband staat..",
            "Die 2 overige keer balcontact die niet verloren werden, waren van de 2 vrije trappen die hij nam.",
            "N = 12\n\nTe weinig data om conclusies uit te trekken. Ik denk dat 'ie nog steeds heel goed kan zijn in voetballen",
            "Denk dat je beter kunt kiezen voor een Zirkzee op dit moment. Je hebt een verrassing nodig die de ballen erin legt, en hopelijk is hij dat.\n\nVorig WK zijn we enkel zo ver gekomen door Gakpo die opeens warme voeten had, anders was het ook al groepsfase eruit",
            "Malen?",
            "Had ik kunnen zijn maja die knie hè",
            "Erger dan Depay kan gewoon niet.",
            "En Memphis heeft de kwaliteit om ...... ? Vul maar in en noem een voorbeeld.",
            "Memvis",
            "Mephis 💀",
            ">Niet echt cijfers die schreeuwen om een onvoorwaardelijke basisplaats. \nMaar denk dat hij precies weet hoe zout de ballen van Koeman zijn, een andere verklaring heb ik er ook niet voor.\n\nWe hebben niet veel beter, dat is meer het probleem.",
            "Je vergeet voor het gemak wel even 2 goals he ;-)",
            "Meer goeie acties van die zandbak voetballer in 20 minuten dan van Memphis in 90…",
            "Virgil en Aké zouden het verdienen om topscoorders te zijn.",
            "Heb je memphis wel eens horen praten. Hij accentueert zijn alochtonen accent terwijl hij gewoon normaal kan spreken. Enough said over zijn karakter",
            "‘Deze’?",
            "Nee hoor. Het was toch echt Memphis die wisselde met Wijnaldum en Koeman die ze heeft gewisseld.",
            "Vint ik ook",
            "Ja knap dat je dat weet hoor. Denk niet dat je heel veel toevoegt hiermee aangezien iedereen ziet dat OP zijn best niet eens deed met \"Mephis\"",
            "Ik vind mensen die zeiken over DT fouten altijd zo zielig. Dan merk je echt dat iemand bevoorrecht is opgevoed en een saai kutleven heeft.",
            "En het erge is dat deze man nog topscorer aller tijden gaat worden ook. Om te huilen",
            "Gaaf.",
            "Ja of 6, nog beter.",
            "2010 was het toch Webb",
            "Ik denk dat je in de war bent met de Taylor die we in 2022-2023 tegen hadden. Dat is een andere Taylor. Dat was geen Engelse scheidsrechter, maar een Nederlandse middenvelder...",
            "Van Persie, hoewel niet zeker of die momenteel in Nederland verblijft of ergens in het buitenland in een retirement villa",
            "Haat vanwege die haarband vind ik triest. Haat vanwege zijn spel of zijn omgang met criminelen (promes) zijn volledig terecht.",
            "Verliest steeds de bal...",
            "Kijk jij dezelfde wedstrijd?",
            "hij mept-niks de goeie kant op",
            "Een goede actie en hij is weer de held. Accepteer nou gewoon dat dit is hoe hij speelt. Hij kan niet voor niets topscorer worden.",
            "Omdat mensen er niet tegen kunnen dat hij een opvallende persoonlijkheid heeft en niet binnen de lijntjes kleurt, en soms hebben ze daar naar mijn mening (over promes) wel gelijk in.",
            "Simons valt mee, maar Depay staat constant buiten positie of verliest de bal zodra hij hem aangespeeld krijgt, dus dat maakt het niet bepaald makkelijker voor de anderen.",
            "Een van de betere vandaag maar oké",
            "En Reijnders, samen de Bermuda driehoek waar al het balbezit verdween.",
            "10/100",
            "Hij kan goed voetballen. Het probleem is dat zijn ego veel te groot is en hij altijd voor iets veel te moeilijks gaat, wat onvermijdelijk tot balverlies of in ieder geval het einde van de dreiging leidt. Maar als dat niet verandert dan maakt het niet uit wat hij kan, want hij speelt slecht. En dit is also heel lang zo.",
            "Als je een balbehoudt van 0.8 wilt (vaak een streven), dan is een waarneming van 10/12 verloren genoeg om een significante conclusie te trekken met P=0.99\n\nDus ik weet niet wat je probeerde te zeggen daarmee.",
            "Snap zelf ook niet waarom Zirkzee niet gebruikt wordt, gozer heeft echt een top jaar gehad bij Bologna. Hij zal echt wel klaar zijn voor deze stap. \n\nEn tsja, zal wel geen echte spits zijn. Maar als ik naar Real Madrid kijk, is dat tegenwoordig niet eens meer nodig.",
            "Dat zou denk ik de beste optie zijn. Malen scoort sneller dan Depay, en hij betrekt zichzelf bij het voetbal.",
            "Meer als rechtsbuiten",
            "Uit te blinken tegen kleine voetballanden.",
            "Heel hard te roepen dat hij goed is.\nVoorbeeld: Zijn carriere.",
            "Heilige koe! Die is goed zeg",
            "Nepvis",
            "mephis",
            "Memvis",
            "Mephis",
            "Ik heb op dit punt nog liever Weghorst.",
            "Letterlijk zijn eerste balcontact was rond de middellijn, er komt een beetje druk op hem en dus kapt hij terug naar achteren, haalt al het tempo uit een potentiële counter en verliest meteen de bal. \n\nWijnaldum moet echt direct op het vliegtuig terug naar de zandbak worden gezet, waarom Koeman die prutser toch steeds laat meedoen...",
            "Zoals? Niet mee-verdedigen, 0 kansen creëren, de bal niet vooruit durven spelen je man (kante) helemaal vrij laten lopen. De ergste was nog als 9de man terug de middenlijn overkomen bij balverlies nadat je toch al 15 minuten lang niet de longen uit je lijf rende.",
            "Echt jammer dat zulke goede verdedigers met zon slechte aanval moeten spelen",
            "Dat is nog niet eens het echte probleem denk ik.\n\nIk heb dus begrepen dat hij regelmatig met z’n dikke auto door Rotterdam rondjes gaat rijden. Elke keer hetzelfde rondje, meerdere keren op een avond. En als de politie hem dan aan de kant zet dan is het etnisch profileren voor, racisme na.",
            "Ik denk dat het zo bedoelt is.",
            "En antwoord bevragen ontging je even? Haha",
            "Het is wel grappig dat rond een EK of WK totale voetballeken behoefte hebben hun onkunde te ventileren.",
            "Mempis",
            "Ik kom uit een arbeidersgezin. Mijn ouders hebben alleen lagere school gedaan en zijn op hun 14e gaan werken. Dat heeft ze er nooit van weerhouden om aandacht te besteden aan taalbeheersing.  Het heeft niet met voorrecht te maken maar met keuzes en mentaliteit. Het is niet moeilijk: Ieder kind van 10 kan het leren. Het is gewoon lui en moedwillig dom.\n\nWat betreft saai kutleven heb je dan wel weer gelijk.",
            "Damn je hebt gelijk, oké maar wel een Engelsman🤬",
            "Van Persie heeft ook nooit wat gepresteerd op het Ek/WK. Van Persie stond gelijk aan balverlies, net als Memphis hier.",
            "Ja eens. Maar heb wel het idee dat alles wat hij doet 10x zwaarder gewogen wordt dan bij anderen.",
            "Topscorer? 3 goals over de laatste 3 grote toernooien.\n\nLeuk dat je ze er dan inprikt tegen Letland in de kwalificatiewedstrijden maar dat is natuurlijk niet genoeg.",
            "Indd. En dat in combinatie met een donker kleurtje maakt mensen kennelijk boos",
            "Een van de betere vandaag is Aké",
            "Die gast rapt liever dan dat hij voetbalt",
            "Any voetballer lijkt wel tegenwoordig. Mooie show maken en vergeten dat je een teamsport doet.",
            "Nice, iemand die denkt dat n = 12 nooit genoeg is verbeteren met een daadwerkelijke statistische analyse.",
            "Je legde de bal voor het doel, en u/creativemind11 trapte hem erin, zeg maar.",
            "Bepis",
            "Ik zou zelfs nog eerder Van Basten uit de mottenballen halen",
            "Hej, in vergelijking met “ik verlies alle ballen die op me gespeeld worden” Depay valt het best mee. Maar ik ben het wel met je eens.",
            "Tja, altijd handig zonder context.",
            "Whoosh",
            "Ik zei niets over je ouders. Ik zei dat je zelf bevoorrecht bent.",
            "Hij was ook kaal 🤣",
            "Ben echt geen Memphis hater maar hij speelt echt dramatisch vandaag.",
            "Hij heeft tot 65 minuten weinig goeds gedaan",
            "Wat de neuk heeft ras hier mee te maken?!\n\nIk zie alleen wat hij doet, hoe hij zich gedraagt en hoe mensen hier op reageren. Dit heeft niets met ras te maken.",
            "Inderdaad want de rest van het elftal is zuiver Arisch ras",
            "Ja, vandaar ook dat Ake en Van Dijk ook zo gehaat worden...\n\nOh nee.",
            "Ja hoor, daar is ‘ie weer! Iemand wordt een lul genoemd en dan komt dat vast door zijn huidskleur 🤷🏻‍♀️🤷🏻‍♀️🤷🏻‍♀️",
            "Ohja het is weer zijn huidskleur. Jij bent de enige racist omdat jij je alleen daarmee bezig houd. Je kijkt waarschijnlijk niet eens voetbal.",
            "(om eerlijk te zijn heb ik mijn inschatting uit mijn duim gezogen, maar met de voorkennis dat 1/2 ^6 ongeveer 3% is, waardoor ik zelfs makkelijk voor de \"sample\" kan compenseren zonder daadwerkelijk te hoeven rekenen)",
            "Helaas is de goal afgekeurd",
            "Van persie of the hunt",
            "Heb je ook wel gelijk in, een logische conclusie zou zijn allebei niet meer opstellen, maar Koeman lijkt daar helaas anders over te denken.",
            "Je bent vast niet de slimste thuis.",
            "Dat ben ik dus niet, althans niet bevoorrecht opgevoed. Maar mijn punt is dat niet bevoorrecht zijn op geen enkele manier een excuus is om zo lui en laks om te gaan met de Nederlandse taal.",
            "Reddit mod stond hinderend buitenspel",
            "Cruijff",
            "We spelen sowieso maar raar. Iedereen is lyrisch over die Schouten maar hij speelt letterlijk alles terug. Die man had moeten gaan dammen.",
            "Het is maar waar je je druk om maakt.",
            "Taal is het belangrijkste fundament van onze beschaving, dus zeker iets om je druk over te maken.",
            "Wat een onzin. Noem een belangrijke uitvinding en een al dan niet gemaakte DT fout heeft daar geen aandeel in gehad.\n\nDe enige plek waar dit oprecht van belang is, betreft juridische documenten.",
            "Oprecht, lol."
        ]
    },
    "Balkanker": {
        "title": "Balkanker",
        "score": 83,
        "url": "https://i.redd.it/esg900doa08d1.jpeg",
        "content": "",
        "num_comments": 17,
        "comments": [
            "Waarom moet ik toch zo lachen?",
            "Ik werkte ooit in de bouw, en een attribuut dat veel wordt gebruikt, werd serieus een \"hoerenjong\" genoemd.",
            "Ouch",
            "Ook veelvuldig gebruikt door [DAFAK GmbH](https://www.dafak.de/)",
            "Balk anker",
            "ik vermoed gewoon bij de praxis, gamma, karwei of hornbach.\n\nEn anders bij de afdeling smakeloze humor. Je moet niet spotten met ziektes, jochie... dat is niet cool.",
            "Dak- en kapverkankeringen",
            "Balkanker is helemaal niet grappig.",
            "Loop niet zo te janken omdat iemand een keer kanker zegt. Dat is niet spotten of het iemand toewensen of wat dan ook.",
            "Hou je kanker bek ouwe",
            "Er spot niemand mee, dit is gewoon een product dat wel een spatie had kunnen gebruiken. Het ontbreken van de spatie is pure humor.",
            "Kanker vervelend weer dit",
            "Als je het hebt niet. Maar dit is gewoon pure humor. \nBen je wel on par met Rapper Sjors trouwens. Al weet ik niet of dat een compliment is.",
            "Nope. Been there, done that.\n\nHelemaal niet leuk.",
            "Met een spatie zou het weer slecht Nederlands zijn. Een koppelteken (-) kan in dit soort gevallen wel.\n\nBalk-anker",
            "Ik heb er meerdere.",
            "Als je het hebt is het pure tumor."
        ]
    }
}