{
    "Some New Rules, Some Reminders: Elevating Quality on the Sub": {
        "title": "Some New Rules, Some Reminders: Elevating Quality on the Sub",
        "score": 56,
        "url": "https://www.reddit.com/r/nhl/comments/1c2gym2/some_new_rules_some_reminders_elevating_quality/",
        "content": "Some things that we need to do here as playoffs approach. \n\n1) No duplicates.  If there is already a post on the subject, put yours as a comment instead of making a new thread. This includes posting a meme. If you want to post a picture, post the link to it. \n\n2) Don't editorialize titles.  A title should reflect what is in the link/thread.  A title of \"hilarious\" doesn't do so. \n\n3) No more pictures without any context.  Just posting a picture of an old player is low effort and will be removed. Again this includes memes.  \n\n4) No posts solely for the purpose of sexualizing players, fans, etc.....\n\n5) All Playoff Brackets at this link... https://www.reddit.com/r/nhl/comments/1c84h3o/mod_announcement_all_playoff_brackets_and/\n\n6) It is bigotry and unacceptable to make fun of a religion in our comments. If it was judaism or Islam, you wouldn't do it and would expect to be banned. For some reason, some of the posters here think its okay to make fun of Mormons in the comments.  This is a reminder.... this violates rule 6 and will be an insta-ban. \nhttps://www.reddit.com/r/nhl/about/rules/\n\n7) Don't blame entire fanbases, troll them, or take shots at them.  Fanbases are diverse things and a few fans never represent all fans of a team.\n\n8) No, who should I cheer for posts.  Strangers on the internet don't pick your team.  Watch games, watch highlights, find the team you fall in love with.  Your team picks you, not strangers on the internet.",
        "num_comments": 11,
        "comments": [
            "Thank goodness for #3!",
            "#1....my thumb wheel finger thanks you.",
            "Can I suggest an insta-ban for the 100th \"Name the new Utah HC\" post? We must be close.",
            "7. Seems like it’s enforced for everyone except Vegas and Leafs fans cause the mods think it’s funny to make fun of them",
            "Hooray for #3! I was thinking that if someone wants to do something like that, they should at least put something interesting about the player in the title to start the discussion off.",
            "Can we just make an exception for the Leafs fanbase?\n\nWe all know they aren't quite right.",
            "wow",
            "And there was much rejoicing.",
            "yessir",
            "To be fair, it is"
        ]
    },
    "Game 7 Pre Game Discussion": {
        "title": "Game 7 Pre Game Discussion",
        "score": 34,
        "url": "https://www.reddit.com/r/nhl/comments/1dlluv5/game_7_pre_game_discussion/",
        "content": "Putting this up now... We'll have a GDT as always on Monday, but feel like people will want to talk this weekend.",
        "num_comments": 133,
        "comments": [
            "As a Floridian sitting in this Chilis.\n\nIt's fuckin embarrassing.",
            "Thirty years of hurt never stopped me dreaming.\n\nIT'S COMING HOME LADS",
            "If the Oilers score 1st, it's gg.\n\nPlus, McDavid's been quiet tonight.So, it's going to be the Mcdavid's show on monday. If they score 1st, he will have 2+ goals... as a Flames fan that makes me mad 😠 😆",
            "Game 7 as everyone expected in the epicenter of hockey.... Florida.",
            "I’m sure I’m the minority but as a Canucks fan I’ll be ecstatic if we bring the cup back to Canada.",
            "Panthers looking shell shocked.  Like they were just forced to watch their parents fuck.\n\nNot exactly a bold prediction, but I think whoever scores first in Game 7 wins.",
            "I've been watching the NHL since the 70s and I think this is the biggest playoff momentum shift that I have ever seen.  I'm guessing that Edmonton must be the favorite now for game 7?",
            "And here we all thought, \"Well, looks like a 4-0 sweep for Florida...\"  \nBut, look at Edmonton, TRYING TO MAKE THIS INTO A STANLEY CUP FINAL! I shall watch Game 7 on Monday... I don't really care who wins, TBH... I just know this better be the game of the year to end the NHL season.",
            "Skinner been going off the last two games.",
            "The whole country of Canada will literally be shut down to watch game 7.",
            "Back from the brink, tied at 3-3. If the Oilers pull this off on Monday, it will be the first reverse sweep in the finals since 1942. \n\nTake it home boys!",
            "Ruh roh raggy.",
            "I deleted my comments about how the panthers shouldn’t be concerned about the game 4 loss. \n\nPerhaps that reverses the jinx.",
            "I wonder how many non Oiler Canadian fans are rooting for them at this point. Calgary will never convert, but I’m curious about everyone else.",
            "Perry gonna be in the lineup and have the game winning goal in game 7. Calling it now.",
            "WE'RE OILED UP BOYS",
            "I am European. Game 7 is 1am my time, and will probably finish 4/5am. I have work at 9am. \n\nIf the sleep deprivation doesn't kill me, the tension will",
            "Connor McDavid is walking out of that arena Monday night with at least one trophy.",
            "Florida better find something or they are SOL",
            "I just cannot comprehend what the hell is happening with Panthers.",
            "Florida looks like they are out of gas and out of ideas",
            "Damn, what a game. Needed my smelling salts a couple times (mostly when the refs were deliberating if Florida had a goal or not), but fuuuuuuck. Going into a game 7 is not what I was expecting. I was fine with the 8-1 win because at least it wasn't a straight 4-0 loss, but to get to this point...\n\nHoping Oilers continue to stand on business.",
            "Like holy @#$%!. We're talking about Game freaking 7. Completely unimaginable when it was 0-3.\n\nSo totally pumped, but really hoping the Oilers don't let up.\n\nWhat a series. Somebody get me a Oilers jersey!",
            "This shit insane. Honestly thought florida was the better team. I think edmondon is going to play like they want it",
            "Maurice has made no adjustments, it’s the same super aggressive forecheck with pinching defenseman that hasn’t worked for 3 games. They just keep giving up breakaways and odd man rushes. His stubbornness is about to cost him the cup. Oilers win 5-2.",
            "Even if Edmonton doesn’t win. They’ve become heroes.",
            "The Stanley Cup finals are what the NBA finals should've been",
            "Florida is cooked",
            "While I’m here for a McDavid cup, seeing Nurse, Ceci, Kane, and Perry raise that thing would bother me.",
            "Florida looks completely lost out there and it might get worse",
            "The most surprising thing I noticed is that Bobrovsky hasn't been at fault for most of the goals against over the past couple of games. His team is just getting outplayed in front of him. I think Florida gave Edmonton their very best in game 5 and still lost. \n\nIf Florida loses the Stanley Cup it's because Connor McDavid decided to go cheat code mode and will his team back into a series (last time I saw anything like this was Lemieux in 91). I'm sure this caused major shrinkage in the FLA locker room.",
            "PTSD from losing game 7 will last more than a decade, remember that",
            "The Oilers are in the Panther's heads now.   Oilers take it.",
            "All to plan.",
            "Damn",
            "Panthers have looked slow and lost for a lot of the last 3 games, I hope they can bring some speed and determination into game 7 it has been a bad look for them.",
            "I hope everyone who said it was a boring final eats their words. Every final people whine that it’s boring. Just enjoy the hockey because stuff like this can happen. If you’re bored watching finals hockey, you’re not a hockey fan.",
            "Start the plane",
            "I don't care either way...I just ❤ game 7's in any sport.",
            "how often does this reverse sweep happen? ",
            "Ok, everyone thought it was over after Florida went up 3-0.\n\nNow everyone thinks it’s over because Edmonton has won three in a row. Practically nobody thinks Florida’s winning Game 7.\n\nFlorida could very well make the same kind of adjustments that Edmonton made following Game 3. Their backs are against the wall for the first time this playoff year. \n\nThis may look like Edmonton’s got it all sewn up, and they probably do to be honest, but I’d be remiss if I didn’t point that out.",
            "Paul (Mr. Smug) Maurice not having so much fun at press conferences now that his team is choking.",
            "How come I couldn't find the game thread last night?",
            "Panthers played great in the 2nd and 3rd periods of G5.  If they lose Monday - how Maurice couldn’t get this team ready for the 1st period of a G5 at home with the cup in the building - will haunt him and them forever.",
            "This is going to be one for the ages.  Unfortunately, most casual American hockey fans can't find Edmonton on a map.",
            "Florida is going to help Perry end his recent cup curse.",
            "Panthers are washed up just give mcdavid and team the cup already",
            "If FLA loses this series the only way you can now lose this series, where do you go as a franchise?  Two years straight, a 4-1, and a 4-3 (after being up 3-0) loss.  \n\nYou send everyone on your roster to the D-league, pack up the franchise and move it to another city.  There is no coming back from this for decades.  This loss is a generational wound that will never heal.",
            "0% chance McDavid and Drai let the Oilers lose now.",
            "Hockey doesn't mean in Florida what it means in Edmonton so would be nice to see Edmonton win (even though it sucks they won the McDavid sweepstakes)..... I'm all about minimizing suffering and less people will be hurt in Florida if Florida loses than the other way................",
            "[deleted]",
            "Fuck this sub and every putz that hares the oilers. Cup assholes.",
            "Look forward to some pretty sketchy officiating.",
            "The offsides call exposed the NHL for the WWE it has become",
            "I'd buy you a round if I wasn't a wanted felon hiding somewhere in Australia.",
            "My man falling to his knees in a Publix rn",
            "Crying in my non alcoholic IPA at Margaritaville, swatting cougars away",
            "🗑️ need this?",
            "Funny thing is, this could be about either team!",
            "There will be like 3 people there who are actual Florida fans.",
            "I had a similar thought about how comparatively shitty the ice must be in FLA and how it is probably an advantage for the Panthers.",
            "Honestly I just want to witness the history of a Stanley Cup reverse sweep.",
            "It’s almost like a curse at this point. The Bettman Curse. I feel like it is a pressure that keeps on building each year. But once one Canadian team wins maybe it will open the floodgates and other teams will follow suit. \n\nI feel like Vancouver and Winnipeg are on the cusp. The other Canadian teams not so much. ",
            "Same boat\n\nThough I wouldn't be too upset if Florida won it too, I always like a first time champ",
            "18-5 in the last 3 games, when leading the series 3-0. They better be and start playing again cause they looked 100% dead inside at the end there",
            "Biggest swing in momentum since 1945",
            "Interestingly EDM are slight underdogs for game 7. I can’t see them losing. Might have to wager a few $ on the oilers.",
            "80’s and same. Wild series and one of the most entertaining I can remember.",
            "Guilty as charged, I'm euphoric I was proven wrong",
            "guilty. never imagined we would be here.",
            "Only way they were coming back from 0-3 was Skinner outplaying Bob. Didn't look likely but what a turnaround. No matter how good the team is you aren't winning 4 in a row without your goalie also winning that battle.",
            "The guy turned into patrick roy and Martin brodeur when he faces elimination.",
            "As a Canadian I can confirm the government has sent out a nationwide mandate to watch the game",
            "No it won't",
            "Will it be the first reverse sweep in the SCF series, or has that happened before? I have to look again, but I thought the reverse sweeps that have happened were in the 1st of 2nd round, never the Championship series.",
            "It still exists in Reddit's backup archive servers. \n\n[The Internet never forgets](https://external-content.duckduckgo.com/iu/?u=https%3A%2F%2Fcdn.vox-cdn.com%2Fthumbor%2FEBI6wT2cxeBupAlanvrm9YG2xk4%3D%2F0x0%3A443x644%2F1320x0%2Ffilters%3Afocal(0x0%3A443x644)%3Ano_upscale()%2Fcdn.vox-cdn.com%2Fuploads%2Fchorus_asset%2Ffile%2F7933653%2FScreen_Shot_2017-02-05_at_11.21.48_AM.0.png&f=1&nofb=1&ipt=6296d442592d7d8b7ea3dc0340c12cedb3546e49a6415e3dd50df46081d17e1a&ipo=images)",
            "I was in a full packed restaurant in Gatineau Quebec tonight and people erupted in cheer and applause at every Oiler goal, super hype",
            "Didn't at first, but since half way through game 5 I knew we were witnessing something special. Go Oilers.",
            "*monkey paw curls* … Own goal.",
            "I'm in Australia, game 7 is during working hours on a Tuesday. Genuinely considering taking the day off for it",
            "Same thing that happened to the Atlanta Falcons maybe? Hit a wall and ran out of gas?",
            "Tbh man oilers have played really really well in all of the games. It’s not like they e been outplayed or out skated. The play a forward up top now to stretch the ice and skinner plays the puck quick and it’s basically gassed the panthers forecheck. \n\nIdk what PM can do other than try to roll the dice with the same thing or change his entire philosophy of his tactics.",
            "It's not the Panthers, the Oilers woke up.",
            "The only game I felt like they panthers truly outplayed us was game 2.\n\nI don't think anything \"happened\" to them",
            "They looked okay game 5 on the forecheck. However, tonight game 6, you are right they looked lost, if not stunned that Edmonton has figured them out.",
            ">thought florida was the better team.\n\nIt's hard to say they were the better team the last three games. I didn't watch any Panthers hockey in the other rounds. Did the Panthers really just give up? What's going on?",
            "Hockey > Basketball",
            "Most casual Americans may have trouble finding their own state on a map (speaking as an American)",
            "Most American hockey fans want Edmonton to win game 7. Love watching that team play and Edmonton is a great hockey city. Florida? is anyone seriously a diehard Panthers fan?",
            "as a Ducks fan I will feel kinda stupid if 2 of our former players get a cup in this run lol\n\nNot as dumb as Florida though, so all gucci",
            "It will be the 28-3 of hockey if the Panthers lose, even down to the team searching for their first ever championship vs team with a once in a generation talent. I don't see the panthers just suddenly falling off the face off the earth, probably still a playoff team for another year or two before inevitably retreating into mediocrity",
            ">I'm all about minimizing suffering and less people will be hurt in Florida if Florida loses than the other way\n\nThere's a difference between \"it's disappointing we lost but what a phenomenal effort to get back in the series in the first place\" and \"we just blew 4 chances to win our first ever championship in what's going to be one of the most infamous SCF in history\". Maybe less people will be hurt but  the hurt could be generational if the Panthers lose",
            "Fuck you… it’s still important to the actual fans in Florida… that’s a shit take.. we’re allowed to like hockey in Florida you dumb fuck",
            "Leafs fans just can’t help but bring the leafs into every conversation",
            "🍼",
            "The number is 6",
            "If they could read they would be upset with you",
            "As much as I hate to say it, Toronto has been close for a few years, they just seems to be missing one or two important pieces that could push them over the edge.",
            "Vancouver, absolutely on the cusp, I think they're going to be a contender for the next few years.  \nWinnipeg, I feel like they're coming down from the top, but I'd like to be wrong!",
            "Make it a parlay with Foegele getting a point, dude has been rock solid reliable since game 3.",
            "Literally after Game 3 I was like \"Congratulations Panthers on winning the Stanley Cup\"\n\nDoesn't look so certain now",
            "He sure as hell comes out of the net as much as Roy did. Gives me just as much anxietly now as it did 30 years ago.",
            "Not officially silly. But anyone who is not working will be watching this game.",
            "Mate, I haven't watched a game in years. Not a single one. \n\nBut I'm watching Monday for sure. If I'm watching... Half the country is",
            "I believe Toronto did it 82 years ago on the scf",
            "Toronto did it in 1942 over Detroit",
            "1942 is the only time it happened in the SCF, it has happened a couple other times outside of the SCF",
            "Lolol. I'm all for that as well.",
            "If this really happens, how hard would you shit?",
            "Remindme! 3days",
            "I mean, the man has his own curse to uphold as well, right?",
            "Yeah, it’s not like the Oilers were really dominated in the first 3 games. In fact Game 1 they came out looking like they were going to steamroll the Panthers. They just worked out their kinks at the last minute.",
            "They're probably in their own heads at this point. They need a good head cleaning, day to woosah everything away, then remember that they're there for a reason and fully capable of winning one game and how that the crowd comes to life for game 7 and doesn't let up. \n\nThat or a Florida Man sized dose of meth right before the game.",
            "They seem to have gotten away from the game they play. That 8-1 loss seems to have shaken them badly. Against the rangers bob was outstanding, just like games 1-3. Since game 4 he hasn’t been their savior so it looks like they are questioning everything.",
            "Dude idek, I just thought the east conference seemed solid. I had a feeling florida would blow through and win after playing boston. I'm still surprised edmonton came back",
            "American here rooting hard for the Oilers, no one outside of south Florida wants them or their fake ass fans to win.",
            "As a Tampa fan, this is poetic justice for me. After getting swept by Columbus, we go on and make three consecutive cup appearances and won two of them. The Panthers got swept in 2021, goes on to two consecutive cup appearances and so far, it’s looking like it’ll be 0-2.",
            "Well the Oilers gifted you Pronger so you guys could win a cup…",
            "Hockey isn't as big in Florida as it is in Edmonton and Canada. The average person in Florida doesn't care and Panthers fans are a statistically weak force compared to fans of Canadian teams and most Northern teams in terms of numbers and impact \n\nThe facts and not feelings of the matter show Edmonton winning would be more meaningful. \n\nSorry your butthurt over the facts but Florida as a hockey market is a small blip compared to other teams and I'd rather see a much more deserving city with a stronger fan base and a country with a stronger fan base win it.",
            "3 of those 6 are just bandwagon fans from last year",
            "Come on, you can barely read. And all you know and have in life is oil and ice.",
            "It's been a big difference in this series actually. He's been huge in negating the Panthers forecheck.\n\nPlus he already fucked up and cost them a game with it, so hopefully lesson learned.",
            "Dude, this is just entertainment.  You're in a bubble.  Go Oilers!",
            "And then avoided the \"No, you\" Uno Reverse in 1945.",
            "I will be messaging you in 3 days on [**2024-06-25 04:39:20 UTC**](http://www.wolframalpha.com/input/?i=2024-06-25%2004:39:20%20UTC%20To%20Local%20Time) to remind you of [**this link**](https://www.reddit.com/r/nhl/comments/1dlluv5/game_7_pre_game_discussion/l9pzy0a/?context=3)\n\n[**1 OTHERS CLICKED THIS LINK**](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=Reminder&message=%5Bhttps%3A%2F%2Fwww.reddit.com%2Fr%2Fnhl%2Fcomments%2F1dlluv5%2Fgame_7_pre_game_discussion%2Fl9pzy0a%2F%5D%0A%0ARemindMe%21%202024-06-25%2004%3A39%3A20%20UTC) to send a PM to also be reminded and to reduce spam.\n\n^(Parent commenter can ) [^(delete this message to hide from others.)](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=Delete%20Comment&message=Delete%21%201dlluv5)\n\n*****\n\n|[^(Info)](https://www.reddit.com/r/RemindMeBot/comments/e1bko7/remindmebot_info_v21/)|[^(Custom)](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=Reminder&message=%5BLink%20or%20message%20inside%20square%20brackets%5D%0A%0ARemindMe%21%20Time%20period%20here)|[^(Your Reminders)](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=List%20Of%20Reminders&message=MyReminders%21)|[^(Feedback)](https://www.reddit.com/message/compose/?to=Watchful1&subject=RemindMeBot%20Feedback)|\n|-|-|-|-|",
            "Jedi mind tricks apparently",
            "Yeah, I havent paid attention to them. I heard Bobrovsky was amazing and saw that in games 1-2 and parts of three. Today, Bobrovsky just looked, average. I'm not complaining, I'm just surprised. Hockey is like that. When you're on fire you're on fire. When you're cold it's hard to turn it on deliberately.",
            "Yep. Florida and Boston are the only 2 teams that could possibly make me root for the Canadian teams that aren't Montreal or Toronto.\n\nHere we are.",
            "0-3…they did lose to the Avs back in the 90s",
            "True! Take a cup give a cup. Ok, it all works out haha",
            "Our game day emails remind fans to wear red.",
            "Edmonton's got a big freaking mall too (gotta have something to do when it snows 8+ months out of the year)",
            "Womp womp going to game 7 how sad is that",
            "It'd come with a hockey rule book linked to it but they know their fans can't read."
        ]
    },
    "The Edmonton Oilers win Game 6 against the Florida Panthers and have comeback to tie the series 3-3. ": {
        "title": "The Edmonton Oilers win Game 6 against the Florida Panthers and have comeback to tie the series 3-3. ",
        "score": 1373,
        "url": "https://www.reddit.com/r/nhl/comments/1dlltca/the_edmonton_oilers_win_game_6_against_the/",
        "content": "The Edmonton Oilers will have their first opportunity to win the cup on Monday night while the Florida Panthers will have their fourth opportunity to do something.",
        "num_comments": 519,
        "comments": [
            "For some reason I knew after hearing Florida was dressing Cousins and the organization decided not to fly all the player’s families to Edmonton that they were going to lose.\n\nAlso Edmonton the first team in 78 years to force a game 7 after being down 0-3 in the Cup Finals.",
            "The Florida bench staring into the abyss while the whole stadium sings Shania Twain's Man I Feel Like a Woman is going to be seared into my memory.",
            "Game 7 Stanley cup finals… what more could we ask for",
            "If I’m the cats, I’m pooping in my litter box right meow.",
            "The oilers may have lost the first 3 games, but they adapted and learned how to counter the Panther plays.. the Panthers  clearly can’t do the same.",
            "EDM fans were treated to 8-1 and 5-1 Stanley cup home game wins. \n\nAmazing. \n\nAlong with a now potential reverse sweep.",
            "It’s been a hell of a series to watch",
            "I don't particularly like the Oilers, but they officially have the opportunity to lay legendary humiliation on the Panthers and I like that",
            "Oilers look locked in. They didn’t look satisfied with that win tonight they really look focused on the cup. They got that mamba mentality",
            "Bring on the Zito memes!!!",
            "Go on Oilers, take the one thing the Leafs have left.",
            "The fans singing Livin’ on a Prayer was magical",
            "I hate the Oilers but that crowd at the end… unreal.",
            "The Florida Panthers are on the verge of the most epic bedshitting not only in hockey, but in all of sports",
            "The Oilers want to win in Florida because it has better clubs to party at after. \n\nThis was all part of the plan.",
            "Florida looks dead out there",
            "Sure sure, it's been fun to watch, but who's the blonde?",
            "This is insane, from how the Oilers started the season, then making the SC final. Now potentially coming back down 0-3 in final... INSANE. Feels like a movie. Let's go Oilers!",
            "This is the worst I've ever felt as a sports fan.",
            "Loving the Oilers and the insane comeback! Such a thrilling game and series! Hope they bring the cup home to Canada finally on Monday. \n\nQuestion though; what’s the significance of La Bamba being played at end of each win here?",
            "Break out the dawn dishsoap and call the EPA. Cause There's gonna be oil in southbeach",
            "My god. It’s happening",
            "It's an elaborate scheme to win a game seven in Florida. You fools, you've been duped!",
            "The scream I scrumpt after seeing that Skinner assist",
            "Well I sure picked one hell of a season to get into hockey. GO OILERS!!!",
            "no state deserves going down in infamy more than the state of Florida",
            "Absolute Cinema\n\nalso can someone go over games 1, 2 and 3 threads and make a quick lil compliation of all the comments saying Edmonton has no chance",
            "I can’t fucking believe after the first 3 games we’re about to see Oilers in 7 ",
            "Oilers won so many foot races tonight. They just looked way faster and like they wanted it more. I’m not rooting for them but I can’t even be mad they won this one.",
            "I'm an Edmonton fan for life now.",
            "2nd latest Stanley Cup final game besides 2021 which was in July",
            "Panther fans on Reddit were turning the game off after the second period. Now that’s belief.",
            "What a complete 180. Oilers have made this a series to remember, have momentum and are outplaying the Panthers who are clearly shook and have all the pressure on their shoulders. \n\nIt’s going to be up there in the biggest choke jobs of all times category. Monday night’s going to be insane",
            "All other fan bases your welcome.  We’re handing out the golden ticket of “Nah that’s not embarrassing, embarrassing is the Panthers getting reverse swept in the 24 Cup.”\n\nEspecially leaf fans losing to your own Zamboni driver is nothing compared to this.",
            "I wish someone would make a compilation of last week posts when all florida fans were celebrating winning the cup. And saying how they were too strong. \n\nEdmonton now had the advantage in 5 out of 6 games. Not surprised they came back. Florida had a 3-0 lead only because of Bobrovsky stealing game 1 and 3.",
            "This is making me incredibly happy and giddy. Fuck the panthers and their fans.",
            "LMAO @ the Panthers....\n\nBut game 7 is all that matters now.",
            "LETSS GOOOOOOO",
            "I lost it on the 2nd open net goal in 20 seconds. I get it's a viable strategy to go 6 on 5 if you're down by 2 goals in the last 4 mins...\n\nBut they're cursed. The Oilers see an open net and it's like an aphrodisiac. They go *hard*. Learn, Panthers!",
            "This game should have completely MURDERED all the brain-dead narratives about the Oilers. \n\nThe Oilers didn't score a PP goal and McDavid was POINTLESS in a 5-1 W facing elimination in the cup finals.\nSkinner was excellent, the depth scoring has been excellent, the PK has outshined the powerplay...\n\nWhatever happens now, this has been unbelievable to watch, so proud of this group and this city.",
            "I talked a lot of shit about the Oilers over the years. No more. That comeback was brutal",
            "OILERS IN 7 baby!!!",
            "I’m so confused about the complete switch on both sides after game 3.",
            "That was amazing. Game 7 is gonna be wild ",
            "this whole finals series has just been a rollercoaster of emotions, i never know what’s gonna happen next but it would genuinely be dope as hell if the oilers came back from a 3-0 by winning 4 in a row",
            "Ok this is just fucking nuts,  like absolutely fucking crazy.",
            "I'll go get the Adam Sandler clip ready for Monday... Had 1 fucking job... Win 1 of 4... Not let Skinner try to avenge his families namesake in the NHL",
            "I, for one, am glad that this has shut up my gloating panthers bandwagon fan of a 10 year old. Does that make me a bad mom? 😂",
            "the panthers just want to win the cup at home right? Hahahahaha\n GO OILERS!!!  \nAnd long live the oilers girl! Thank you!",
            "Let's go, I'm a Blues fan through and through, but Oil are my Canadian team",
            "Yeah. Florida is a team that looks built for winning the cup. Grind teams down by making it hats for them to get out of their own end. That team's been MIA the last three games. Oilers are also getting depth scoring",
            "Honestly whatever happens on Monday it’s gonna be funny as shit. Either Florida chokes a 3-0 lead and loses the cup. Or Edmonton claws all the way back just to lose in 7.",
            "Speaking from experience, PTSD from losing game 7 is real and last more than a decade",
            "What a collapse by the Panthers ",
            "Man oh man, that is going to be the longest flight home to Florida. They are cooked.",
            "Monday's gonna be awesome...",
            "No coming back from a reverse sweep in the cup as a franchise\n\nOnly question for the cats is… Kansas City or Atlanta?",
            "This makes me feel better about the stars losing to Edmonton.  Them winning the cup is apparently ordained by god.",
            "I can think of some twins in Edmonton who are pretty happy right now",
            "As for me, I’m enjoying the series",
            "I know I'm salty... But I'm enjoying these last 3 games. \n\nGo Canada!",
            "Monday Oilers will get the cup and McDavid will get the Conn Smythe trophy!!!!",
            "Yikes. The Panthers blew a 3-0 lead. This is even worse than the time the golden state warriors blew their 3-1 lead in the 2016 NBA finals. 💀 Being a Panther Fan must be hella demoralizing right now. Things aren’t looking good for them at all.",
            "Edmonton started to gain their momentum as an offense towards the end of game 3 and skinner started becoming a rock for the oilers from the 3rd period of Game 3 onwards. Florida can still show they can turn the momentum in an instant (Game 5 after going down 3-0), so Edmonton cannot rest lightly. They need to be relentless on the forecheck. And for Edmonton to complete the reverse sweep, they need to strike first on Monday.",
            "Nice. Game 7's are the best!!!",
            "Holy smokes",
            "I thought my Pittsburgh Penguins were the biggest chokers, blowing how many 3rd period leads\n\n\nFlorida will take that title if they get reverse swept",
            "Remember when everyone was saying sweep when the series wasn’t even over. This just proves that it ain’t over til the fat lady signs",
            "Panthers are just shitting themselves",
            "Florida teams allowing a series to go to game 7 after being up 3-0, two years in a row lol",
            "Worst collapse in nhl history.",
            "If the Panthers lose, I can't wait for the 30 for 30:\n\n\nAnatomy of a Choke: How The Cats Were DeClawed\n\nMaybe:  How The Panthers were DePants",
            "This went from a sweep in game 3 where everyone was sure we were going to lose to a genuine game 7. I was graduating high school the last time this happened. Can't believe we're here again",
            "Winnipeg fan here, now converted blue and orange. Go oilers!",
            "The game 7 will be legendary. Damn kinda wish my father was still alive to see it",
            "Florida looks deflated. I think oilers have this.",
            "Its down to 1 game. If I’m a Panthers player/fan and they win, none of it matters. A SC win is what the goal was and it doesn’t matter how it was accomplished. Edmonton fans can tell you that, it would still be a great final and they are happy with the teams resiliency and gusto, blah blah blah. The Edmonton players will not feel the same way. As Draisaitl said , cup or bust. The mission is not complete for either side. Gonna be a great game. Gonna come down to goaltending and special teams, imo. You can throw out the previous 6 games, they no longer mean anything. There is no “pressure” advantage as it is now equal on both sides. 1 win for the Stanley Cup. Who’s gonna take it?",
            "I am literally gonna cry if the oilers can pull it off on Monday. What a thrilling series. I would be curios to see what kind of number this series has pulled in terms of views and how many people tune in for game 7.",
            "What is going on?! This is more of a Bruins thing and yet they're really getting Floridians worried.",
            "⏮️🧹",
            "2006 vs Hurricanes, never forget. Let’s go Oil!",
            "Oilers winning makes for a great finale. Panthers deserve to lose for blowing it so hard",
            "Generally the team with the best player wins a game 7 match I say.\n\nI feel like mcdavid is doing his Lebron impersonation",
            "That place was a madhouse last night. As a Red Sox fan who watched the impossible happen in 2004, I hope they complete the comeback.",
            "My team had a dumpster fire of a season, but I want Edmonton to win so I can at least say i was at the game when we beat the eventual SC champs. Anything is possible. Also fuck everything about Florida",
            "I’m rooting for Florida, but they deserved this loss tonight.",
            "The Panthers need to be investigated what the hell is this",
            "Bring it home Edmonton. wtg",
            "Florida is a poverty franchise lol",
            "LFGOO OILER!!!",
            "The classic \"win three games to give the fans hope and lose in 7\" story line",
            "If only Tatum didn’t sprain his ankle in game 7 last year this would be THAT much better",
            "Hockey gods (maybe): well, we officially nuked the confidence of panthers fans and gave the oilers the most hope they’ve had in decades. But, hear me out, what if…",
            "A bunch of reverse swept bitches. Go Kings go",
            "play",
            "Their 4th opportunity to do something. That pretty much sums it up!! Unbelievable that they dominated every team through the playoffs, won the first 3 games of the finals, and now ~ so much CHOKE!! 😳",
            "Idk why, but somehow I know that Florida is gonna just roll over and die in Game 7. They don’t have any belief or confidence in themselves right now. It’s over.",
            "I saw a Edmonton guy in here the other day saying something like \"Good series Florida\". I wanted to tell him it isn't over. \n\nHere ya go bud!",
            "Go Oilers ..!",
            "I wanted any Canadian team but the Oilers to bring the cup back to Canada. Their performance at the beginning of the season wasn't great and I wasn't impressed with their playoff performance either. \n\nBut goddamn, Florida doesn't deserve it now either. They're getting blown out of the water, it isn't even *close*.",
            "This is just nutty. I'm loving this soap opera.",
            "Thanks, Greg Cote!",
            "Thank god this happened to Florida and not the Celtics. I was more concerned about the celtics doing this I figured Florida would have won it by now",
            "This year when Edmonton has lost 3 games in a row they have come back to win at least 4 in a row afterwards.",
            "Im just happy to see a Canadian team in the mix.",
            "Bolts had Sergachev healthy and the Panthers would never be in this series.",
            "Any Canadian who was or is not cheering the Oilers now has to be on crack. The image of McDavid's face on the bench in December is seared into my brain. That look of sheer anger after they lost their 3rd or 4th in a row. Commentators were saying that McDavid would be looking to get traded at the end of the season. Those people do not understand hockey or human nature. The new coach came in, they went on an epic win streak and qualified for the playoffs. That angry face was a man saying to himself that he will not allow his team to lose anymore. It was a promise he made to himself that he will turn things around. And, he did. Go Oilers!",
            "The Florida Panthers have the chance to do the funniest thing ever on Monday",
            "This Game 7 will be beautiful drama and someone is getting their hopes crushed. If Florida loses, they suffer the embarrassment of an epic choke job and become a punchline for their historic 3-0 collapse. If Edmonton loses, they suffer the heartbreak of another Canadian team losing the finals (7 in a row I think) and the letdown of fighting all the way back only to come up short. What a fucking saga I can't wait.",
            "Has anyone read any good articles looking at the lineup and strategic changes that the Oilers have made during this series?",
            "Watching the panthers blow this is absolutely glorious",
            "As a Devil's fan.... let's go, Rico!!!! lol",
            "Game 7 has the makings of a doozy. Bobrovsky looks rattled. Skinner looks more and more confident. Edmonton seems to have solved the ability to stop Florida’s sustained pressure. Really looking forward to Monday night.",
            "More like Florida PantTurds",
            "Just found out Hyman was drafted by the Panthers.",
            "Fans singing was probably the loudest I've ever heard a building.  Was kinda nuts",
            "I’m conflicted. I hate the Florida players but understand the plight of a hot weather fan base.\n\nI don’t have much against the Oilers players, and hate their fucking fans above all else.",
            "Congratulations to Edmonton, your Stanley Cup Champions.",
            "They’re (Florida) already lost",
            "I don’t know how any Florida panther player wasn’t given a game misconduct for those atrocious penalties, nhl should be embarrassed",
            "newbie here, why didn't panthers have a goalie for goal 4 and 5?",
            "Florida, please",
            "This shit is honestly rigged. More money if they go to game 7.",
            "Shits fkn wild. Oilers win game 7 , Florida has to be deflated after failing to close out the series...oilers are in their heads.",
            "imo oilers have 55% chance winning at game 7, whilst panthers have 45% chance, especially after this game it went relatively smooth except for a few close calls and the offside decision, and oilers have all the momentum. OILERS IN 7!",
            "I think NFL should do best of 7 for superbowl.",
            "Leafs fan here with some skin in that history hoping with all my might that the Oilers match that record on Monday.",
            "Most important question: Where is the Oilers Girl?",
            "And the last time a team did It it involved a suspended coach who punched a ref",
            "say what you will about the broadcast quality, but the comedic timing of their bench reaction shots has been incredible lol",
            "A thousand yard stare if I ever saw one",
            "Even Vegas couldn’t produce such a beautiful spectacle last year. \n\nWe owe you everything Edmonton.",
            "Oh oh oh!",
            "Any links to this? That sounds hilarious ",
            "Does someone have a clip bc that sounds amazing lmao",
            "[I clipped it for us to enjoy forever](https://youtu.be/GPYWle50MXQ)",
            "Holy hell, it reminded me of the scene in Boogie Nights where the camera just sits on Mark Whalberg while he realizes how screwed he is.",
            "Game 7 OT!",
            "Game 7 OT",
            "Game 8?",
            "Super excited!",
            "The oilers are taking them to the vet right now. No matter how much I hate the oilers, i gotta cheer for the reverse sweep cause itd be cool oh and canada getting a cup.",
            "Need more rats",
            "All to plan. 3 games and blow outs after. Sweeps dont make money. Let's make the nhl money.",
            "Panthers coach said they weren't going to change a thing and blamed the (game 5) loss on the bad penalties aka the refs. At that point I knew Edmonton was winning game 6. Let's go Stu and the gang, fuck yeah",
            "Thats what’s being lost in all this. It’s not like these games are 50/50. We are being schemed out of our entire game plan. We’ve been smashed 3 games in a row with 0 chance of winning any of them.",
            "Knoblauch has been unreal all playoffs at making ballsy decisions and adjustments to lines, personnel and tactics. Even if they lose game 7 he deserves a ton of credit for his work getting the Oilers there",
            "Panthers need a real coach like Tocchet not the guy who quit on Winnipeg and thinks he’s the smartest guy out there. Vancouver Edmonton series was so great because of the in game adjustments and adjustments between games, and you have to still think damn if Demko had been healthy, he probably steals one game over seven. Maurice on the other hand acting like a dinosaur yelling at the refs and drawing Cousins/Lomberg into the line up. \n\nPanthers would already be toast with a healthy Draisatl!",
            "Yeah, after game 3 Knob basically changed everything about the lineups and different line match ups, and look where we are now.",
            "Had a thought like in The Matrix when Neo figures out how to slow everything down.\n\nThe Panthers look like they’ve been figured out.",
            "New to hockey and I love electronic music so this is gonna take some getting used to lmao.",
            "What a playoff run!",
            "Whichever team wins, we all win with some epic hockey.",
            "Bamba mentality",
            "Only thing i dont like is how they tend to turtle when they lead by 2-3 goals and stop playing offense. They were lucky it didnt backfire yet",
            "Them not skating around the rink saying farewell to their fans was the biggest indication to me that they are dialed in",
            "The memes from this series will live on forever.",
            "Dude look like he wanted to actually murder the refs after the goal was called back. Never seen someone so angry looking lol",
            "haha I didn’t even think of that… brutal!",
            "As unfortunately a leaf fan, I'm pretty sure my team is so dismal it does not even belong in this reddit post.  There is no sentence about winning anything meaningful in 60 years that also involves the leafs.\n\n\nMy team will have no chance at glory until the management is passed to someone who actually understands winning, success and sports.",
            "That'll finally shut Leafsnet up about that record no one really cared about.",
            "Reverse sweep when the league was full of guys with uneven feet and shin splints because it was in the middle of world war 2 and most of the league was overseas. \n\nReally something to hang your hat on leaves.",
            "Be careful,  Oilers!\n\nLeafs fans will attach themselves to your hip after this. \n\nDo you really want to share fame with the leafs?",
            "They did that in the ~~LA~~ Vancouver series and the Oilers scored off a faceoff with them singing, and it absolutely looked like ~~LA~~ Vancouver didn’t even know the play started and the crowd won the goal.",
            "I’m not a hockey fan at all and I got hyped to fuck hearing the crowd sing that.",
            "I was singing with them in front of my TV. My husband was giving me dirty looks 🤷‍♀️😂 It was cool.",
            "That was a top heel getting his ass beat by Bret Hart on the fiery babyface comeback",
            "That Albertan passion ;)",
            "Hear that Columbus!?\n\nWe're not afraid of you anymore!",
            "28-3 is the benchmark but if they blow this, they might have it beat",
            "Still think the Bruins of '23 was worse. Presidents Trophy. A fan base that never shuts the fuck up. Up 3-1 in the series. Nope, go home lol",
            "Potential back to back Stanley Cup Final losses 💀",
            "As a wise man once said about Edmonton, \"I mean, there is pretty much nothing else to do in that city except watch hockey...\"",
            "Can you blame them? After going up 3-0 with some close games. To getting slammed on in 2 of the 3 losses to force game 7.",
            "Hahahaha, the one behind the oilers bench right? With the fake tiddies? I think she's some OF chick..",
            "hahah that’s what I noticed too",
            "Was waiting for another tiddy pull lol",
            "I missed that… screenshot me !",
            "Yet.",
            "Hey I hear Utah is getting a hockey team!",
            "I want Edmonton to win, but I will also feel really sorry for your team if they lose the cup two years in a row.",
            "As a Falcons fan...\n\n1. I wonder if this is worse than 28-3\n\n2. Has anyone in any major mens sport come back from being down 3-0 in the finals? I know it hasn't happened in the NBA.",
            "My best friend is a Panthers fan. I feel terrible for him. It's awful.",
            "I can positively say that if your team wins game 7 all those feelings will drain away. It ain’t over yet.",
            "So far.",
            "Give it time.  There's further depths to plumb.",
            "Lmao I’m a Cats and Sabres fan so I’ve never known sports happiness",
            "Panthers just have to win 1 game at home on Monday, and the pain will go away.",
            "Cheating isn’t the way, pumpkin.",
            "Wait till monday 🙌",
            "Yeah it’s gotta suck for the fans but fuck the panthers. Sorry mate, it is what it is.",
            "The worst you've ever felt, so far...",
            "Welcome to hockey! 🙃 \n\n\nLol I've learned early on as a Canucks/ Luongo fan... 2010-2011 was amazing ... but 2011 cup finals was utterly heartbreaking... I cried from game 7 in finals till start of next season after....\n\n\nOver time, I have become numb to it. 🫠",
            "You could always not care. I mean that honestly. Look, we all know that Edmonton is going to win Game 7. Florida just has no fight left in them, especially after Edmonton gets the first goal, Edmonton is dominating both ends of the special teams battle, and Maurice is too stubborn to change what isn’t working.\n\nSo why torture yourself? There are millions of other things to do that are better for your mental health than watch this “team” bomb a fourth game in a row. Your team obviously doesn’t care one way or the other. Why should you?",
            "That’s  in memory of their dressing room attendant Joey Moss who loved that song. He had Down’s syndrome and died a few year’s ago",
            "r/brandnewsentence",
            "Scrumpt lol",
            "Hell to the yes",
            "You ate your scream?\n\nBut it was only scrumpt and not scrumptious?",
            "Tuesday headline:    \n\n Florida man loses Stanley Cup *again*",
            "No doubt, go Oilers!!!",
            "You know you’re cooked when Cody Ceci is winning puck battles",
            "Love to have you pal 😁",
            "Welcome aboard! The most exciting time since 06. This will definitely be one of the most memorable playoffs for us, win or lose.",
            "We are all Canadian this weekend",
            "I haven't been a big hockey fan since my dad passed. He was a Canucks fan. I do have a general rule that you need to cheer for the home team (we live in Edmonton now) and I am also cheering them on as they are a Canadian team.",
            "Makes it tricky to keep the ice in good condition. Especially in Florida",
            "Zamboni driver lives forever. They lost to their own employee. \n\nMcDavid definitely was a monster in the past couple of games, but tonight was really the first one where the Oilers won by committee. If Edmonton wins, years from now, it will be looked at as ‘that McDavid year’. \n\nOn the other hand, the Panthers posts up 3-0 that Bob/Barkov were Connor Smythe locks didn’t age well. .793 save percentage/minus 6 respectively in games 4-6. Never taunt the hockey gods! Maybe they’ve not forgot how Paul Maurice quit on the Jets mid-season. \n\nThat being said, plenty of examples of a team getting to 3-3 then losing.",
            "But leaf fans losing their claim of being the only team to ever reverse sweep in the finals. In 1942. Against my red wings. \n\nYou guys will be fine. There is always a deeper pool of Torontears to drink.",
            "It’s moments like these where a franchise’s fans show their true colours.  Your boys brought you to game 7 of the Stanley cup finals and you call them embarrassing?  These are the 2 best teams in the league this year, trading streaks.  Nothing embarrassing about being here.  You should be proud of your guys at this point, no matter how game 7 goes.  We all want our team to win, but it’s toxic as hell to treat your team like they failed at this point.  \n\nFlorida Panthers probably got their own fans in their heads at this point more than anything.",
            "I'm a Falcons fan so if it happens I feel your pain. I'd really appreciate someone else being the new go to reference for epic sports collapses. I've heard enough \"28-3\" for one lifetime.",
            "I hope some bumblefuck down there got a Stanley cup tattoo",
            "Bob and Barkov for Conn Smythe. So many posts how McDavid didn’t deserve it and how he was a choker. Literally LOL. Barkovs -2 for the series and -6 the past three games, Bobrovsky can’t stop more than 80% of the Oilers shots over the same span. \n\nTkachuk saying that Kreider wasn’t doing anything. I’ve been looking for Tkachuk since the series started! \n\nThis is the greatest gift since Leafs fans went wild up 3-1 to Montreal in 2021 or up 4-1 in game 7 with 12 minutes to go against Boston in 2013 for a fan base getting ahead of itself.",
            "Don't forget all the oiler fans talking about how much it will cost to buy out Nurse, how Drai can't perform on the big stage and they shouldn't pay too much for his next contract and so on. Just as many oiler fans thought the series was over after game 3 as florida fans.",
            "I made one a few days ago, actually! https://www.reddit.com/r/EdmontonOilers/s/5N1usgyIiN",
            "And fuck every Tkachuk",
            "Fuck the haters, because if there’s one thing I’ve learned in these playoffs, is that for whatever reason, the Oilers do have a lot of haters.",
            "Honestly you guys and Boston are probably living the dream. After this series loss, there my not be a Panthers team much longer. Losing this series will absolutely kill the franchise. They’ve only just begun to build a small fanbase and having a historic collapse will quash that completely. I imagine the team will be gone after the lease expires for Amerant Arena. Tampa will be the only team in Florida after this.\n\nPity whichever city gets the Panthers though. You’ll be inheriting a franchise that has losing mentality in their genes. They won’t be seeing a Stanley Cup anytime soon.",
            "WE. WANT THE CUP!!!! 🏆",
            "I BELIEVE!! McJESUS GUIDE US THE GRAIL!!",
            "Panthers have done crap with the man advantage this whole series. They’ve shown zero ability to control the puck when they have the man advantage. They’ve let in two short handed goals against the Oilers. It’s a given Oilers are going to get the open net goal.",
            "It’s funny cuz the oilers have struggled to get the puck into the empty net during the regular season.",
            "Hop on the bandwagon, you shiny golden turd. We’re gonna crush the Panthers like you did last year",
            "I wouldn’t be surprised if there was some sort of sport betting involved at this point",
            "There wasn't a switch, Oilers were better team in 1 and 3, but Florida got luck on their side plus they were shooting wrong (low) vs Bob.\n\nCats been better 1 out of 6 games this final.",
            "I'm in Edmonton. The nervousness was palpable all day today. No one said it but people I've talked to after the game all felt how I did: it was a good run but it was ending tonight. So the game going how it did just had people more apeshit than I think I've ever seen in person.",
            "Nope",
            "Wings over cats",
            "Hop in, fucker. We’re driving this stinkwagon all the way home.",
            "I never want to hear the phrase built for the playoffs ever again after this. Teams built for the playoffs don’t choke away a 3-0 series lead in the finals.",
            "Disagree, I think this is embarrassing for Florida even if they win. Edmonton showed a lot of character even if they lose",
            "I'd \"first time\" ya but you've been there at least twice",
            "Low chance, but it has happened. 41 leafs and the 45?  Redwings. \n\nEither way, game 7. Gonna be fun to watch, no matter the outcome.",
            "As an Atlanta resident if they choke this series away they can relocate to fucking Houston. We already have one massive choking ass franchise in this city. We don’t need another.",
            "On the sixth day mcjesus hoisted the cup",
            "Me too.. all year it was Florida coming back to beat the Bruins after their \"magical season\"... then Garry Galley these playoffs in love with Barkov and his \"big body\" and crap.  And then there is Tkachuck.  Sheesh.  I just want to be hear the collapse talked about all next year instead of hearing about the Bruins this past season.",
            "Yup, as an Oilers Fan I am happy they clawed back. But the job isn't done. Both teams have 1 game, 1 shot. Everything that happened before is meaningless. Panthers absolutely still could take this and I wouldn't be surprised. Cart before horse and all that.\n\nThat being said, I believe in my team too. I'd love to see RNH hoist that cup after everything he's been through. Monday is going to be a heck of a ride either way...",
            "They’ve been blown out the last four games. Only game 3 they got the bounces and did play well in the third P of game 5.",
            "If making it to game 7 after being down 3-0 doesn’t qualify as strong performance, I don’t know what does!",
            "How come? Genuinely curious.",
            "another game another bunch of posts bitching about the officiating ",
            "When a team is down and trying to score in the last few minutes of game, they can pull their goalie and put an extra skater on the ice to try and generate more offence.",
            "No, Florida thought they were hot shit and threw game 4. Now they lost momentum and are fucked. The cups going home to Canada now instead of that shit hole  state.",
            "If you’re just being sarcastic or salty, fair enough. If you’re serious, can you explain to me how does one rig a hockey game? If you think anything that includes the word “referee”, I don’t believe it’d be a sure enough way to guarantee the outcome of a game.",
            "I hope you're right but I can't imagine Florida is going to be very excited by the prospect of being back-to-back losers. They're going to put up a hell of a fight",
            "3rd time Florida reach the finals and they cant even win the cup. Must be a record. \n\nHow many other team went to the finals more than 3 times in their history and never won the cup?",
            "Doubt strikes again!",
            "Rent free",
            "The second McDavid said “we are gonna drag them back to Edmonton” and then delivered, I knew they were forcing 7. What a brilliant quote.",
            "Momentum is not real- PK Subban",
            "The numbers don't lie",
            "But what about when you add Kurt Angle into the mix",
            "I didn't catch who the player was on the panthers but when it turned to him in the final minutes on the bench, holy shit his face looked red with anger.",
            "Been loving the cuts to the panthers GM too",
            "Anyone have a link?",
            "I don't know, those shots of Zito. Guy knew they were losing it halfway through game 5.",
            "And the Panthers GM lol",
            "The job isn't done but goddamn if we don't have a shot at the cup now! Like we legit have a chance. It's bedlam for Oiler fans right now and win or lose,  this has been crazy fun.",
            "Just paying Boston back for 2011",
            "GO TOTALLY CRAZY",
            "[I got you](https://youtu.be/GPYWle50MXQ)",
            "[Enjoy](https://youtu.be/GPYWle50MXQ)",
            "Thank you Mr Vaginafoot",
            "Game 7 2OT!",
            "No. Just no. My heart couldn't take it.",
            "Yes!! Give my heart some free cardio!",
            "Do you want to kill me man, cuz that would kill me.",
            "Please no! My sports bar closes at midnight this Monday lol.",
            "There’s no question that the panthers are frustrated as hell. Maybe if someone other than Barkov shows up to play, it could be interesting. \n\nBut if the last 3 games are any indication, the reverse sweep likely plays out. RIP cats if they lose two SCFs in a row.",
            "Hell yeah man, making history more than one",
            "The story line would be one of the best of all time of any sport, movie making material. All down to one game with Connor on one team.",
            "And game 7 to overtime as per the script.",
            "Honestly if they truly blow this, the owner should fire everyone. GM/Coach, release all the players. Complete 100% reboot.",
            "Hilarious 😂 looks like a bold move, let's see how it works out. Anyone else get a sense of arrogance from Paul Maurice?",
            "His response post game to why he switched RNH and Foegle for this game was hilarious. Must have got the numbers mixed up.",
            "I just cannot see them losing game 7 at this point.",
            "Makes me wonder if Q was back at the helm if it would be different,  but who knows if they would have got this far, twice.",
            "The oilers pre game party had Loud Luxury perform tonight.",
            "La Mamba Baby",
            "Bamba Bentality",
            "Yeah it’s crazy how they build these massive shot differentials in the first couple periods but then by the end of the game they’re even or outshot.",
            "It's almost like this is their strategy. Get up a few and then showcase their insane defense. But Drai said it in an interview this morning when a team is down by two goals they are pushing as hard as they can, and sometimes, all you can do is play defense. You don't want to take chances on offense and make a mistake, and give up a chance.",
            "They are fortunate that Florida can't actually generate any of their own offense. They can only capitalize on mistakes.",
            "I noticed that but I am beginning to think it's more a combo of being tired from going all out to get those goals + the other team is still an NHL team and they just take back some momentum",
            "Maybe the other team is good enough that when they start to seriously push for offense, all the Oilers can do is play defense? I mean you didn't really see them do that against LA in the first round lol.",
            "I was expecting lasers to come out of his eyes lol",
            "No need to be a dick about it, man",
            "It's all good because we have something they will never have. Connor McDavid.",
            "*Vancouver series game 6 but yeah it was hype",
            "Was there singing. It was wild.",
            "You’re in the nhl sub after game 6 in the finals  and talk bout how you got hyped up from a previous series game 6 moment but you’re not at all a hockey fan. Own up and admit you’re a fan cause it’s clear that you are my friend. Happy to have you aboard:)",
            "It's great to get upvotes from fans in CALGARY! \n\n:sneak attacks Bret with Mister Socko in a shocking geriatric heel turn",
            "Bud you mentioned Calgary and Bret Hart. Auto upvote as far as I’m concerned",
            "we beat those demons, in 5ot mind you.",
            "Tampa got swept in the first round in 2019. To a team that lost in the next round. Bruins in 23 was bad but winning 3 games is still better than 0 in the first round as the Pres Trophy winners.",
            "It's only going to get worse",
            "Also harder road to the finals.\nThey had to battle against the Bolts, Bruins and Rangers while the Oil played shinny with the Kings and Nucks..",
            "Yep, usually sits behind bench in Dallas",
            "I assume she’s making good money being behind the bench for 3 home games. Or was it just this one?  I honestly don’t remember games 3 and 4.",
            "I gotcha: https://imgur.com/a/zdFP3BF",
            "Oh that Maple Leaf flair holds a lot of weight in that single word post.",
            "This is no longer about supporting a club. This is now national pride. The cup must come back to Canada.",
            "After watching the Tkachuk's party like a-holes in the stands when we played Calgary 2 years ago? I'm living my dream right now.",
            "1942 Maple Leafs is only time it’s ever happened",
            "2011 still haunts me in my dreams",
            "Also Ben stelter, a young oilers fan who had terminal brain cancer, would always say  Play 'La Bamba,' baby when they won. Unfortunately he passed away at 6 years old in 2022",
            "That’s very touching and a great reason to play it. Even more reason to cheer for them! Let’s go Oilers!!!",
            "Oilers would play the song after a home win in recognition of Joey. Additionally a young fan named Ben Stettler, who was diagnosed with a type of brain cancer, was taken in by the team (very touching story, look it up and see how classy the players were). His catch phrase was “play la bamba baby”. Sadly he passed away, but the spirit of the two lives on",
            "For some reason, Edmonton was like the only team that was consistently on streaming to watch. It's been really fun watching their season and I'm pulling for them on Monday!",
            "I’d love to be proven wrong but this wasn’t the case of the best team lost.  I haven’t seen the best effort for\n This team in a while so I don’t have confidence in them.\n\nI’ll still watch and root for my team but I’m not confident they’ll pull it off.",
            "What I should be happy that we just blew 3 games?  I didn’t say I’m done being a fan.  I have every right to say they are embarrassing.  If it was a back and forth series to 7 that would be one thing but they just lost 3 in a row.\n\nThey gave up in the blowout loss and there are a number of examples of them being sloppy and even lazy with their play in the cup finals.  Yes that is embarrassing.\n\nFinishing 2nd in the league is failure when the goal is the cup.  Failure when you give it your all is not embarrassing.  I’m not even saying they’d win this thing if they gave it their all, Edmonton is rolling, but we will never know and that is the embarrassing part.",
            "Bro, their fans have every right to be angry with them. You don't see Atlanta Falcons fans celebrating 28 - 3 do you? Buffalo Bills fans don't celebrate the 4 straight Super Bowl loses? It sucks when your team loses in the big game. Like you can still be happy for their achievement. But it's a whole different game when they blow something like this. I hope for the players sake they can actually learn how to play and win Game 7 otherwise they are toast and going to be playing in the minors the rest of their careers.",
            "That’s easy to say when it’s another team. But if your team was up 3-0 in the finals with a chance to secure their first Stanley Cup in franchise history, after you watched them be perennial basement dwellers for two decades, them allowing their opponent to tie the series and complete what would be the worst collapse in sports history is absolutely worth calling embarrassing.\n\nI’d rather the team fucking suck than this happen. At least when they suck, I can take delight in some young prospects maybe giving me hope for a brighter future. When they collapse like this, you’ll never trust them ever again and won’t care what they do because you know nothing good will ever come of it. Because if they can’t win with this roster than they can’t win ever.\n\nI know this feeling well because I’m a Falcons fan and that’s the mentality of the fanbase after Super Bowl LI.",
            "Sorry dude, 28-3 is still etched in American fan’s heads. This would be an epic collapse, but it’s happened before, so it won’t be as earth shattering.",
            "'Stanley Cup Champians'",
            "It’s Florida… someone likely did that AND robbed a 7-11 while having an alligator on a leash or something equally fucked up",
            "or as the guy at the bdubs bar I was at called him, \"fuckpuck\"",
            "Absolutely, I've never seen a team so consistently doubted, it's actually incredible 😂",
            "It’s because of mcdavid. Same thing happened with Sid and the pens",
            "The enemy of my enemy is my friend, god this is going to be funniest finals ever if yall keep this up.",
            "Tbf the panthers have more haters than the oilers as of today",
            "I honestly thought he'd learn after game 5, but nope, just go with the age old \"throw more men at them\" strat...oops, 2 more goals to the other team. I never thought I'd see Skinner get an assist. How often does the goalie get an assist in the playoffs!?",
            "Edmonton’s special teams are unreal. It’s what killed Dallas last round, too.\n\nNo joke, how is it possible they are at an advantage when down a player? \n\nOn a power play? You’re probably about to get short-handed, but you’re for sure not scoring. Pull the goalie for a 6 on 5? Congratulations, you played yourself.",
            "Turns out Panthers PP was really Oilers PP",
            "Us golden shower fans are rooting for you!",
            "Got room for a jets fan?",
            "Totally. Florida was always favored to win.",
            "Actually of nhl teams who went down 3-0 and forced a game 7 it’s 4/9 of them going on to reverse sweep. At this point I think it’s really 50/50",
            "Im not an Oilers fan but I can’t imagine my nerves. Id be shattered, lol. 1 game take all. We haven’t seen an OT game yet. Can you imagine it goes down to 1 goal takes all? I’d be happy to see McDavid win it all, Cup and Conn Smythe. Nobody has earned it like him.",
            "I see, I was wondering if he got into the penalty box or something since I only watched the highlights",
            "Hate on the panthers all you want but leave my state out of this",
            "Since I refuse to pretend that the \"shithole state\" comment isn't about you shoehorning your chronically online political beliefs into an opinion of a state you've never been to or lived in, the Panthers live dead center in the most concentrated liberal area of the entire state.",
            "It's gonna be the game of the decade... Or century...\n\nwe're witnessing an historic SCF",
            "I feel like the Oilers have been the better team in at least 4 out of the 6 games. They should have won game 1, but Bob was invincible. \n\nI feel like since the 8 goal game where he got pulled he hasn’t been the same and that’s where the tides have changed.",
            "But why weren't they fighting the last 3 games? They got crushed 8-1, 5-3, and 5-1 in those games. 18-5. Maybe Edmonton is just better than them!",
            "A Lot of panthers could not get a fire under their ass today",
            "They had 3 chances to get it done. Now it’s in their heads that it’s their destiny to *not* hoist the cup. Each one of them feels like Moses looking at a treasure they cannot possess. Couldn’t have happened to a nicer bunch of lads.",
            "What have they been doing then, waiting for a game 7 to show some intestinal fortitude? 😂",
            "Vancouver has been three times and lost each time. Twice in Game 7s.\n\nEdit: extra factoid",
            "Meanwhile you got Colorado who’re 3-0 in the finals",
            "Vancouver is the only one I think. Losses in 82, 94 and 2011.",
            "Three times the St. Louis Blues went to the Stanley  Cup during three consecutive seasons from their founding and got swept every time.\n\nTheir fourth time in 2019, they won it all .  It took 7 dramatic games, in a rematch of the 1970 Stanley Cup against the Boston Bruins.",
            "You will be very surprised. \n\n\nhttps://en.m.wikipedia.org/wiki/Stanley_Cup_Finals\n\n\nBoston with 14.",
            "It's not over. They have one more chance.",
            "St Louis made it to the finals in 68, 69, & 70 and got swept each time.\n\nThey did eventually win it...",
            "PK “how many playoff games” Subban. \n\nJesus there was a very prominent rumour of a PK for Leon trade back in the dark times. I also remember thinking that the Nashville got the better end of the eventual trade.",
            "Probably Ryan Lomberg. He stormed off in a fit. I went to school with him. Always a hot head, but in this case, very understandable.",
            "Especially when they showed his Aquafina bottle next to him just waiting for something to happen",
            "Zito looks like he is going to have an aneurysm. It's hilarious.",
            "They are just itching for another viral reaction",
            "At this point you know it's intentional just to be like \"lol, look at this asshole\".",
            "Can't find a pic, but there was a guy dressed up as a Dasani bottle in the stands tonight.  I don't know what we are all going to do with ourselves when this is over.",
            "[lol](https://imgur.com/9JmoIa0)",
            "[Here ya go :)](https://youtu.be/GPYWle50MXQ)",
            "I’ve never wanted a team that wasn’t the Bruins to win the cup more than I want it for the Oilers rn.",
            "🫡 Respect",
            "Legend",
            "Game 7 3OT!",
            "No, I need to get up in the money to work…",
            "Game 7 2OT with Dallas rules. You have to score twice..",
            "An OT goal that gets called back.",
            "I’m still recovering from game 6 against Dallas 😅",
            "Lmfao",
            "But have you lost 4 in a row and had another team not make the playoffs since 2011?",
            "All down to one overtime. With Connor skating up the ice on a breakaway. And he finishes the game with a highlight goal for the ages.\n\nOne can dream.",
            "Quadrupole overtime ",
            "😂 Maximum money milkers",
            "Comments like this remind a person why redditors do not work in hockey management lol",
            "Yeah fire a team that closed out the East and made the finals s/",
            "You know getting reverse swept in the finals means you made the finals right?",
            "🅱️amba 🅱️entality",
            "I think it’s because they build a lead and switch to defensive styles. They give up shots but not any high quality ones. But fuck I don’t know, whatever they doing it’s workin",
            "That’s been oilers hockey since 2017 tbh.",
            "They gave us the best sendoff to Joe Louis Arena that anybody could ask for. Half my friends are leafs fans and half are red wings fans. It tends to be a mutual rivalry. I love the Leafs. Always root for them when I can. \n \n\nAll of you non O6 teams can stop piling on the Leafs though. That's our thing.",
            "Dude is still traumatized about it 😂",
            "Whispers in LAKings.",
            "\n\nIt's all good because we have something they will never have. Wayne Gretzky.",
            "You’re right, got my series mixed up",
            "Mick Foley cheap pop. \n\nYou can totally trust me as you pose for the fans for a suspiciously long time now....",
            "This was Bret beating Ric in Saskatoon.\n\nThat was for a fake championship but felt real enough.",
            "Apparently an influencer",
            "I’m pretty sure she’s a different person?",
            "Don't know, but I do feel like I seen her more then once. If I was a player I'd b distracted checking her out, 😂",
            "The technically real MVP. :)",
            "JFC huge tiddies.",
            "God forbid a family has fun watching their kid play pro hockey lol god you are a tool",
            "I still get angry thinking about what happened in the finals.....thinking \"if only...\" \"if it wasn't for....\" \n\n\n😭 I still watch every winning game from 2011 playoffs from Rd 1 to finals. . Just to relive the dream team era.. the good memories.. and just nostalgia from key moments: Burrows slaying the dragon OT goal. Bieksa stanchion goal in 2OT to send us to the finals. Torres getting the lone goal on Thomas in first game (I think. Lol may have been game 2)..",
            "Glad to have all you guys with us",
            "Never said you should be happy.  I said you shouldn’t call your team embarrassing.  Big gap between those two extremes, melvin.  Don’t put words in my mouth so you can argue for pity.",
            "As a Bills fan... Some kinda do celebrate the 4 losses because it's the closest we've ever gotten. Personally have never and will never watch the Four Falls of Buffalo because I have vowed not watch an alternate ending to Superbowl 25.",
            "\"I'd rather the team suck right now than be in position to win their first Stanley Cup in franchise history because I'm a Falcons fan scarred by 28 - 3\" \n\nAbsolute stupidity, see Bills fans after the four Super Bowl losses. Some even celebrate the Super Bowls as I mentioned in a comment above because it's the closest we've ever gotten. All Bills fans want is another chance. Florida has their chance, and it's right there for the taking.",
            "It happened over 70 years ago lol. Not even the same game at this point. At least I'm Canadian so I hear less about it than if I was in the States.",
            "They'll follow it up with \"no regerts\".",
            "“I’m looking forward to people doubting us again” \n\n-Connor McDavid after the game 3 loss.",
            "Fucking love you mosquitoville turd burglars. Get into the wheel well.",
            "Sorry",
            "Yeah. This is something we will bore our grandkids with. It truly is legendary no matter how it ends, but especially if Edmonton can pull it off.",
            "I know nothing about hockey lmao. But I know what might potentially be history when I see it, and I want to experience it as a complete stranger to it all. Game 7 of this will be the first hockey game I watch.",
            "It might be, but it might not. \n\nThere has been a time or two in the past when you expect a team to show up and fight, and they basically just roll over and die. Panthers have been bloodied, and they don't show much fight.",
            "I forget which podcast it was, but they said from the 3rd period of game 3 through game 6 Bob was only like .760",
            "It probably started in the 3rd period of Game 3 tbh. No 0ne thought it'd matter though since they went up 3-0.",
            "This is what happened last year. Bob came crashing down right before the Knights showed up.",
            "He reverted to his real form.\n\nThis almost always happens with him...",
            "Sorry this is going to sound rude but… YOU DONT SAY, OF COURSE HES NOT THE SAME THE TEAM HAS BEEN EMBARRASSED BY THE INTER FAN BASE OF EVERY TEAM IN THE WORLD",
            "I've used this metaphor a few times this playoffs, but the oilers are like that octopus that gets handed a sealed bottle with a fish in it. Sure they might be unsure of what to do at first, but inevitably they feel it out and before the other teams even understand what has happened, they're lunch.",
            "Nah, Bettman wanted more games so he ordered it.",
            "Tbf, the last 2 games were 3-1 and 4-3 without the empty net goals, so a little bit closer than what the final score would indicate.",
            "🤫🤫🤫 we do not speak of dark times lol.\n\n\nThanks for thinking of us 🙃",
            "True forgot about them",
            "Don’t remind me :(",
            "This makes every Nordiques fan cry.",
            "But they eventually won the cup. I mean teams that never won it ever even after reaching the finals several times",
            "Required: Fuck the Habs!",
            "The tension between him and that water bottle was was fuckin thiiiicc",
            "Did you see the fella a few rows back from the Cats bench dressed as a water bottle 😂",
            "It’s the cocaine. He can’t help it.",
            "“Can you find confidence on a plane?”  Great line.",
            "Thank you for this. I've been trying to explain to my brother (he's in Montreal and I am in the UK). I can finally share with him what I saw last night!",
            "Agreed. As a Bruins fan, thank you, and go Oilers!!!",
            "Same (but redwings)..go Oilers!!!!",
            "Game 7 4OT!",
            "Game 7 3OT and McDavid penalty shot!",
            "the year is 2032, earth is uninhabitable, somehow the 2024 SCF has reached the 7361st OT. The ancestors of the original inhabitants of the arena don't realize that the world has moved on, for they were born in the overtime. May the overtime prosper for eternity.",
            "This is like your nephew thinking up ways to torture you.\n\n\"...and then there's a VOLCANO!\"  \\*mad cackling\\*",
            "It physically hurts me to even contemplate the possibility of that happening. Please no.",
            "Like Womens world champs 2019: Finland won! Even though referees thought otherwise.",
            "Who could that be. Such a team must be such a disappointment to their fans",
            "Yeah that’s pretty much exactly what they’re doing.",
            "Yeah. My absolute only criticism of Knoblauch is that he doesn’t seem to know how to coach a +2-3 lead. Great problem to have, but that +2 disappears real quick.",
            "But now we're not outscoring our mistakes. We're just scoring.",
            "Celebrating every goal like you just won the cup? Lol, that's a douche bag move and I'll always love watch them lose.",
            "Not at all arguing for pity, as a Panther fan I don’t expect support or pity from anyone.\n\nTell me what word would you use to describe a team going up 3-0 then for the first time in nerely 80 years let the series go to a game 7 with a couple of blowout losses some short handed goals and overall low effort play.  \n\nIf you still think proud is the appropriate word simply because they made it to the finals, I have to ask do you tell Canucks fans they should look back at the 2011 Cup performance with pride?\n\nMaking the finals is an accomplishment and something to be proud of.  Giving up in the finals is absolutely embarrassing.  It’s a slap in the face to how difficult it is to get there.",
            "It was over pretty much the moment he said that.",
            "Man I live in Edmonton and I'm visiting family here in Manitoba and holy fuck the mosquitoes are bad here compared to home lol",
            "It’s ok, we definitely do have some shithole parts… like sunrise.",
            "If (and only if) Edmonton pulls it off, it's probably gonna be the best SCF of all time I'm not gonna lie...",
            "Makes sense. The Oilers have scored like 20 goals since the third period of game 3.",
            "Imagine winning against Vasilyevsky, Swayman, and Shesterkin, only to lose to Stuart Skinner.",
            "Every podcast lol guys getting blasted at the moment",
            "They said something like that on SDPN but it’s a stat a lot of people are probably talking about",
            "I heard Jesse Blake say it on the Steve Dangle Podcast.",
            "32 Thoughts?",
            "I heard that on Spitting Chiclets.",
            "Are you calling Knoblauch an octopus? I'll buy it.",
            "I was rooting for you guys for two of those three series. I wasn’t alive for the first one.",
            "I remember the fires.",
            "boston works for that. we dont know that florida wont win one in the future. theyre also a much younger franchise.",
            "I'm waiting for someone to make a funny meme or gif of a stare down between him and his water bottle",
            "I wonder if he and dana white are pals...",
            "Hey some of us have to work Tuesday morning!",
            "Game 7 5OT!",
            "😂 👍",
            "So long as it happens to the other team.",
            "Never! Because we know our lacrosse team will pull through!",
            "Excuse my ignorance but what team is this?",
            "My brother lives there too. I don't even live there anymore, and used to joke that Edmonton has three seasons: Hockey, Construction and Mosquito. But then I went to college in North Dakota, just south of winnipeg, and learned what wind, snow and mosquitoes REALLY are.",
            "as an edmonton fan who can't remember 2006 this has been by far my favourite finals yet lol",
            "The individual games though haven't been the most exciting and many were one sided. It's really just the story of the series as a whole. This ranks far from the best IMO.",
            "Literally 20",
            "Skinner is a good goalie, just inconsistent. But when he’s on mentally he can be elite.",
            "Game 4-7 stuart skinner was 9-0 with a .936 and a 1.53 gaa\n\nNow hes 10-0 with better stats",
            "Knoblauchtopus",
            "♡ I heard only Montreal & Winnipeg fans cheered us on in 2011.. while rest cheered for bruins.\n\n\nFor that, forever grateful for the support! Habs & Jets always have our support too!",
            "Lol I remember feeling embarrassed because of those dumb rioters.. <-- they get 0 sympathy from me.. (documentary: those caught & charged were playing \"victim\"... saying it was \"just a mistake\") ",
            "For some of us watching on the other side of the world, I will be forced to take the morning off.",
            "Especially on the east coast. 4OT will be what... 2AM EST? Woof",
            "I guess you'll have something to watch on your way to work.",
            "I’m in Europe my bro stop",
            "Game 7 6OT!",
            "Game 7, 5OT - Oilers on the powerplay...  and the Panthers get SHG and win.",
            "The '06 run is what really made me fall in love with this team. But as magical as that run was, this run was magical in it's own way, and I firmly agree with you that this is now my favourite finals yet too",
            "I was in the riot. I was 13 years old lol",
            "nah seems like yesterday",
            "Elite may be a stretch. He’s playing “good enough” but he does not look confident nor comfortable out there. He has been the weakest link for the team but I hope he can hold it together and get his name on the cup.",
            "lol this time last week I was getting laughed at for suggesting that skinner has flashes of brilliance and is a year or two away from being considered an above average goalie. how quickly things change.",
            "From a Montreal fan, that’s only because you were playing the Bruins. There is no team we hate more than the Bruins. lol",
            "Appreciate you for watching from across the world.",
            "Where are you? I'm watching from the UK so it's a 1 am start for me. Last night was totally worth it to stay up until 4!",
            "At least they are starting the games at 8pm EST. I grew up in the western time zone and now live in the east. You miss so much hockey just simply because it's not feasible to watch a game starting at 10pm.",
            "Tkachuk scores the same way that he saved the ENG in game 5. Face on the ice, just swatting at it since everyone is dead tired.",
            "I’m laughing at you because you said that AND also said you can’t remember the 2006 series",
            "Thailand"
        ]
    },
    "Barkov makes it 2-1 but after coach’s challenge is disallowed for offsides.": {
        "title": "Barkov makes it 2-1 but after coach’s challenge is disallowed for offsides.",
        "score": 709,
        "url": "https://v.redd.it/zqi66cz9018d1",
        "content": "",
        "num_comments": 328,
        "comments": [
            "i started watching hockey today bc of this series and holy shit what a rollercoaster of emotions",
            "Might legit be the deciding factor of this game or even this series from this point on. Kind of crazy?",
            "Offside by a cunt hair.",
            "So damn close. I could have seen it go either way but still surprised they called it back\n\nEdit - spelling cause fuck",
            "New to hockey, what exactly is the rule and why does it exist? Even giving me something to google would be helpful I'm just over here like a dumbass asking alexa what the blue line in hockey is.",
            "Close call? Obviously. But it is clear on the still that the skate is beyond the line.\n\nAnnoying? Maybe. But considering that it was a challenge all fair and square. \n\nWould be stupid to have the challenge system and then be like “yeah close call we’ll decide whatever”",
            "Great challenge",
            "This is the shit angle. Watch the SN coverage on this play. Clearly offside.",
            "Some fans may not like it, but this call was the right one. This was clearly offside when you get a look at it from a better view. And hey, I’ll take a 7 game series any day of the week.",
            "take it one frame back, still going to be offside",
            "I'll never understand why players make an extra move right at the blue line 😂",
            "It was offside.",
            "Sorry Panthers you don’t get to join Flames and Sabres fans complaining about SCF game 6 calls. Those teams at least had a chance.",
            "It was a good overturn. The video showed it was offsides, it was just by millimeters. It’s currently 3-0 though so I don’t even know if it matters at this point other than possible momentum",
            "BEST PLAYOFFS OF ANY SPORT IS HOCKEY",
            "To be fair, the tv camera degree is terrible for seeing if this was offside or not,\n\n  \nThe refs made the right call. You must remember the NHL has blue-line cameras for this type of call.",
            "It was close but it was offside.",
            "I know it stinks, but IT WAS A fair review call.  His skate shows white ice behind it while the puck is still on the blue.",
            "This has got to be greatest challenge in NHL history.",
            "offside not offsides",
            "REFS WANT AMERICA TO WIN: 👌👌👌👌👌\n\nTHIS CALL: (Doubt).",
            "This must have been such a hit to the Panthers morale",
            "I don't understand the \"spirit of the rule not the letter of the rule\" people because they're arguing for what? 1 inch offside is ok? 6 inches? 1 foot? It's an absurd slippery slope when your argument is \"its only a little offside!\"",
            "Crazy close call! Go EDMONTON!",
            "I really didn't think there was enough \"evidence to overturn it\" but was pleasantly surprised",
            "Title gore. Jesus christ",
            "Fuck this team.  Bums with no fucking heart or balls whatsoever",
            "Was the right call",
            "Rules are rulez",
            "Offside, not offsides.",
            "Im sorry league.. Vancouver came up ...justt short!! To prevent this...",
            "An amazing win....and a terrible lost on game 7 for both!!+",
            "Enjoy the call all you offside review lovers.",
            "Nah nah nah nah nah nah BUTTMAN!",
            "This has been one hell of a series. Here's hoping for 7",
            "At least the reffing is more consistent today.",
            "Didn’t matter in the end",
            "LMAOF ..the panthers are finally on the wrong side of a challenge and it Is about time they started getting called for the penalties  that they have been getting away with in every series ….",
            "To close. You can't over turn that goal.",
            "3-0😎",
            "Dk how I feel about these close less-than-an-inch offsides challenges. They should have 30 seconds to decide an offsides coach’s challenge. If they can’t, it’s too close to make a difference.",
            "Sketchy - how do you overturn a call off that",
            "That was super close, it was like 2 millimeters offside. Personally didn’t think that was enough to overturn. But smart call by Knoblauch.",
            "Matt Duchene has a lot to answer for",
            "I hope Jomboy does a breakdown of Paul Maurice turning into Joe Pesci",
            "Wow this finals series really has taken a turn",
            "Just one offside..",
            "The Flames 2004 goal was in.",
            "*Offside.",
            "My heart is with Edmonton but back in April I put all my $$ on Florida. 🤷",
            "Serious question: In the post-game interview Paul Maurice implied that he thought, based on video available to his team, that the Oilers shouldn't have challenged. He was really clear that he wouldn't have challenged based on what his team's video showed. Does anyone else think he was implying that the NHL video review crew leaked information to the Oilers that prompted the challenge? It sounded that way to me. On the bench, he went full tilt and at the time I was like, **Why is he so mad about video given that it's pretty objective?** but after hearing the interview I've concluded that he's mad that the Oilers had the confidence to challenge the call and the only reason to be mad about that is if you think they got inside information almost instantly that the review would overturn the call on the ice.",
            "Lets hope we dont get these kind of situations in game 7.",
            "kindly inbox me",
            "I hate the panthers, but reviews of offsides need to go. A player being offsides by so little that the linesman couldn't see it in realtime has no impact on the player's ability to score. Having a goal overturned like that is so anticlimactic it ruins the narrative of the game.",
            "What if they changed it so if the puck and the player are ever breaking the plane of the blue line together, it's onside? A foot isn't going to give any positional advantage and it's the only way you can give some gray area without having a stupid amount of discretion.",
            "Paul Maurice just can’t get it done, and now he’s choking on it",
            "This video replay has become very ticky Tac , it was meant for missed calls . The linesman called the play onside to get over ruled after minutes of play is ridiculous",
            "I'm no Oilers fan, but if the refs are going to swallow their whistles the entire playoffs and Toronto calls that video review, then I'm officially irritated.",
            "This coaches challenge changed the entire game. Was offside by a nut hair.",
            "The league started not changing these mid season. For some reason they felt like game 6 of the postseason was a good time to start allowing hairline offsides again.",
            "😂😂😂😂 I love it",
            "Maybe it is the right call, maybe it's not. I personally didn't see conclusive evidence to overturn. \n\n\nQuestionable calls and the NHL playoffs, name a better duo! At least it's entertaining",
            "Rigged!!",
            "That’s 2 awful calls against FL now.",
            "The humiliation of the Florida cheats will be incredible if they lose this cup- this will\nfollow these clowns around the rest of their careers if so",
            "no goal lol.  Big sad 😞",
            "That was a terrible call by \"Toronto\" because if the game was in Sunrise, it would have been called a goal.",
            "It was so close … if you will change the decision with a call as close as that, then why not using the available technology to be sure… why not a chip in the puck or something like in tennis ?",
            "Before the Oilers-Florida.. I told my co worker... its Florida.. after Florida won 3 in a row... I told him its still Florida but its still game 7.. im hoping for Luongo to win in game 7 ;-)",
            "I'm not a fan of the offside challenge.  Even though the challenge has benefitted my team (Vancouver) as much as any other team, I think there are too many good goals disallowed.\n\nHere are the changes I would make to the rule.\n\n\\* Only review the offside in real time. If you can't tell a player is offside in real time it should be a good goal.\n\n\\* It should be a clear offside, like 1 to 2 feet offside, not millimeters like this disallowed goal.\n\n\\* An offside review should only be able to rewind the video 20 seconds. Any offside older than 20 seconds  Does Not Matter. All the defensive players will be back in the zone, and the puck will have changed possession numerous times, thus negating the advantage of an old offside.\n\nIn this case, even though I'm cheering for Edmonton, I would not have disallowed that goal. When it's that close the tie should go to the offensive player.\n\nFollowing the rules of the offside challenge, the goal should have been disallowed. I just think the rules need refining.",
            "Not a fan of these reviews. At least I don't think I am. Conflicted after this went the Oilers way.\n\nIt's like the second baseman waving his foot at the bag while turning a double play. Close is good enough. What would it be like if baseball video reviewed those?",
            "refs should always just have decisions corrected like VAR in Europe.\n\nThe coach requesting it and going shorthanded if the decision goes the other way has got to be the dumbest rule I've even seen.",
            "Bro the refs are giving the game by game to the oliers",
            "Istg the Oilers coach is the biggest cry baby back bitch on the planet and the refs are happy to oblige.",
            "This overturned goal has solidified my belief that the NHL is meddling heavily to change the outcome of series.",
            "The overturn was suspicious since we never got to see a good angle on the broadcast, but either way, the rule is bullshit. Reinhart never even played the puck, and the goal got overturned because he was MAYBE in a fraction of a second early. This needs to change 10 years ago. If it's too close to call on the ice, it's not worth reviewing.",
            "Too bad the union agreed on this stupid review rule change.  I want the Oilers to win, but this call has no place in the sport.  Bad rule.",
            "I hate this call. That close the call on the ice should stand. Overturning goals is the worst outcome that can happen and should only be for egregious missed calls.",
            "I hate this call. That close the call on the ice should stand. Overturning goals is the worst outcome that can happen and should only be for egregious missed calls.",
            "What an absolutely terrible call lol, Scott Foster is that you ?",
            "Offsides reviews are such a buzzkill, offsides should be called but when it has zero effect on the goal it just fucks up the game.",
            "If they had conclusive evidence, they’d have showed it by now. The fact they showed that one still shot where the stick blocks the puck passing that off as the proof is highly suspect. There’s no way they would have overturned this if the panthers challenged. Because there was no conclusive evidence.",
            "Welcome to the party, grab a helmet",
            "What a series to get started with. Don't worry, the regular season is just as good too.",
            "Welcome to a hell of a series to begin watching the sport my friend",
            "An Edmontonian all my life, this was the first game I've ever watched the entirety of. And *holy shit*.",
            "Good day and welcome to the great white north. Horser",
            "This is the best time of the year and in my opinion the best playoffs",
            "Well hello buddy",
            "You picked a gooder",
            "Doesn't even make sense. After this series?? Karma harvesting?",
            "McSorely illegal stick moment?",
            "zach hyman has entered the chat",
            "This could haunt Florida fans as hull in the crease, gelinas no goal, Gretzky high stick Gilmour.",
            "No game is decided by one action, but rather the nearly countless actions and decisions that occur in 60 minutes of play.",
            "It was. If that was counted (like it should be, not enough evidence) the game could have been 3-2 or 3-3 and been a lot closer.",
            "They might as well give him the goal it didn't come close to mattering",
            "That’s not a very nice thing to call Reinhart.",
            "In Brazil.",
            "A red one at that.",
            "More of a cocks length in my opinion",
            "The real question is what color of hair? Red being the thickest...followed by black then blonde. It's an ongoing discussion with my buddies. Many things are off by a cunt hair... but the color is the real deciding factor.  I'd say this call was a blonde one.",
            "It's spelled *offsides*.",
            "Shocked it got over turned.  So close.  Very risky challenge",
            "I though it was close until they said foot in the air count",
            "Imo too close to turnover and that was kinda BS. Might as well just watch esports if every pixel matters. \n\nI say that as a neutral fan who wants this to go to 7 for the extra hockey game",
            "Why are you shocked.  The league has rigged it for Edmonton game 5 and 6",
            "A player can’t fully enter the offensive zone before the puck crosses the blue line entirely.\n\nIt exists for the same reason offsides exist in soccer/football. If it didn’t, a team could just park someone in front of the net all game.",
            "Your team mates are not allowed to cross into the offensive zone before the puck does, or else you could just park a team mate 2 feet from the opposing goalie the entire game and bomb the puck the whole length of the ice to them\n\nEdit: the rule is offside, so the goal was reversed because it should have been whistled dead when it happened",
            "So you basically, the puck MUST cross the last blue line before the first player does. It's to prevent teams from being able to just peace a man on the opposing zone abs drop him the puck at their leisure. It's called offside and had the same function as it does in football(soccer)",
            "People have answered what the rule is but [this](https://m.youtube.com/watch?v=R7pN56VZOfM&pp=ygUlUHJlZGF0b3JzIGJsYW50YW50IG9mZnNpZGUgbm90IGNhbGxlZA%3D%3D) is why it is reviewable. Just figured I’d give you some history on the rule as well.",
            "The puck has to enter the offensive zone before any player on the attacking team.  \n\nIf the puck is cleared outside the blue line, everyone has to leave the zone and the puck has to again go in first. \n\nIt exists to stop players from “cherry picking” and just standing beside the other team’s goalie. \n\nSo the entire puck needs to be in the zone. \n\nLook up the offside rule. \n\nIt’s also a little nuanced because if you have possession of the puck, you could technically go in backwards and the puck goes in after you it’s still considered onside.  But basically. Puck has to go in first.",
            "So for this instance in particular. Hit pause around the last 30 seconds. \n\nBasically one Florida player is ahead of the player with the puck. \n\nThe Florida player with the puck dekes towards his right side to get around the Edmonton players. \n\nThis delay of crossing and movement of the puck caused that other Florida player to cross the blue line before the puck does. \n\nThis is offsides. \n\nParticularly why this is called and can callback a goal is because an unfair advantage occurred (offsides) on the direct play/sequence that lead to a goal. \n\nSometimes the challenges on goals have occurred long after the original missed offsides, and the review and dismissal of a goal seem ridiculous. \n\nBut in this case, Florida crashes the blue line offsides and has the unfair advantage to crash the net scoring almost immediately. So yeah, penalty on the goal.",
            "Google - Matt Duchene offside. That’s the play that bought in offside reviews",
            "You may have noticed it before and wondered why there was another player on the attacking team just standing there while his teammate breaks toward the goal. They have to wait for the puck to cross the opposing blue line before they can. \n\nIt changes depending on the period and the home net location, but your goalie is behind the blue line in your defensive zone, the neutral zone is the middle of the ice between the two blue lines, and the other side of their blue line is your offensive zone. \n\nThose zones come into play for making line changes, penalties like offsides and icing, and faceoff locations.",
            "It was offside, the blue lines mark where each team’s attacking and defending zones begin, and basically when you are attacking the puck has to make it past the line before any of the players do. It exists basically for the same reason offside exists in other sports, to prevent players from standing at the other end and wait for their teammates to bring the puck over to score.",
            "Standard Panthers fan ^",
            "Yeah, as a hockey fan Im annoyed.  However, if it were my Penguins defending and the other team had done this, I'd be yelling at the tv that it's offsides, so.....",
            "Yeah, good on the coaches for that, it really changed the momentum of the game.",
            "I don’t think a PP for the panthers If they had lost the challenge would have mattered",
            "We just need the tech to be able to *immediately* call it offside in the moment so that we don't have the momentum swings when an actual goal happens later.",
            "Yeah it took me a while to get the right angle but it was offsides by a centimeter…. I’m sure it’s frustrating for Florida fans cause it had no impact on the scoring play but it’s the rule, gotta call it.",
            "They only beat the lightning with close calls so they should know not to leave it up to the refs.",
            "Close only counts with horseshoes and hand grenades.",
            "And they have all angles synced together, so when they do find the frame they need, they can compare them on screens side by side. On the TV replays, they only show one at a time,  and keep stepping through the frames instead of pausing where it matters.",
            "Then show it. Simple. Otherwise you’re gonna get this back and forth.",
            "There's only one feasible explanation.\n\nBETTMAN > AMERICA",
            "yes, my daughter said the rule should bend as well, and I said the blue line is the easiest place to judge which went first, thats why we use it.",
            "There was video evidence. Did you miss it?",
            "Sure there was. Reinhart was completely in the offensive zone before the puck (that he wasn’t in control of). ",
            "Definitly not enough evidence. Nice seeing Florida get screwed for a change lol.",
            "Look again. There’s a perfect still frame that shows it clearly",
            "I think you absolutely have to overturn that. Too close to call during gameplay, but no doubt about it during the video review. That play is offside.",
            "Get your eyes checked. It's right there in the video.",
            "Close your eyes and imagine being intelligent, then open your eyes and weep. Clear as day bud. Either learn the rules or pipe down.",
            "Agreed. Not 100% conclusive",
            "The rule isn't \"if the offside player makes a difference\" it's just offside.",
            "The NHL needs to invest in better cameras. Half the time there is a challenge it’s a blurry mess that doesn’t show what you need to see between frames. \n\nCompare that to MLB which has synchronized high speed camera for replays. So they can literally find the right moment to compare multiple actions from the best angle.",
            "Felt like football watching that,  close but legit call",
            "I agree. I think the commentators said it best the instant reply is for blatant mis calls not millimeters",
            "Easy. It was offside.",
            "What is it with Americans and thinking everytime something doesn't go their way it's rigged or fraud?",
            "Cope",
            "Was  close but legit",
            "You’re not wrong about it haunting us but flair up you pussy",
            "I completely agree with you, and the refs are 100% selling the game, but the refs might make Florida win in game 7.",
            "You’re just salty your team lost to the oilers. It was a good challenge, and a good overturn",
            "you could see white between the line and his skate while almost a 1/5 of the puck was still touching the line. whether you guys like it or not thats the official definition of an offside. Those boys have been taught since they put on hockey skates that they cant fully cross the blue line unless the puck is across. the one waiting for the pass shouldve held back a fraction as he shouldve been taught.  The rules the rule",
            "So you're suggesting that there should be a margin of error for offside? Like an arbitrary fudge factor of half an inch or so, and a \"fuck it, he was offside, but only by an inch, so count it\"?\n\nIt's a black and white call, and they got it right. Blame ESPN for lack of a good angle; Sportsnet showed it clear as day.",
            "the blue line is the place all players since babies learn to respect, they're trained to not fully cross it til the puck is fully across.  Two Florida Panthers decided they'd disregard everything and play footsies with the line, and they got dinged by a coach that paid attention. The only bs is Florida for trying to pull a fast one. The rule is the rule.",
            "then the refs HAVE to be absolutely certain every time. and they were WRONG they shouldve called the offside. If Oilers lost the challenge, they wouldve gotten a penalty for delay of game, and the goal wouldve stood. so the rule seems fair",
            "They showed a clear still in the intermission coverage on sportsnet. It was offside ",
            "Grab a beer*",
            "Grab a jockstrap!",
            "Why would you lie to them like that?",
            "Regular season when mcdavid is passing up goals to get 100 assists, Matthews teammates don’t shoot on breakaways to pass it to him to try and get 70 and the whole caps trying to help Ovi break Gretzkys record.",
            "Neigh, eh?",
            "I’m a huge NBA fan and follow basketball really closely. Now that the NBA finals have ended, I heard about a potential series comeback and McDavid’s heroics. Thought it would be cool to see potential history and tuned in today for Game 6, was thoroughly entertaining!",
            "Nah that was worse. Gretz even told him not to use that stick and he did it anyway.",
            "Go Blue!!!",
            "Lol his name is still hymen.",
            "Couldn't have happened to a better fanbase.  \n\n\nFor crying out loud, Fla fans boo O Canada.  Who does that?!\n\nFreaking disgrace.",
            "As a Flames fan, the Angelina’s no-goal call still burns.",
            "Pretty backtracking tho, and especially considering how close it was. Definitely a key moment",
            "2-1 plus going on PP would have given Panthers massive momentum. Instead it went back to 2-0 and deflated them",
            "Good words for coaches… but a big action definitely influences the following actions that lead to the outcome of a game.",
            "2002 Red Wings vs Canucks was completely decided by Lidstroms long goal on Cloutier.",
            "Game winning goals are now called \"goals that may have affected the outcome of the game\" ",
            "They showed an angle tonight that clearly showed it was over by just the slightest amount, but it was still offside regardless.",
            "It becomes a completely different game if it’s 2-1 not 2-0. I want the oilers to win this thing but there’s no doubt this took some wind out of the already deflated sails in Florida",
            "Yeah panthers were in shambles the whole night",
            "That's not a nice thing to say about cunt hair.",
            "Leave Sam Bennet out of this one...",
            "It's not a risky challenge when the panthers PP has less goals than Edmonton's PK",
            "Not at all risky with FLs pp. I'm surprised Edm isn't laying more penalties into gimpy FL with the FL pp.",
            "If they were in Florida it wouldn't have gotten overturned",
            "If it were the other way around..... I'd be pissed. Very close from the tv angles we were shown. Officials have better camera angles to review, so there must have been one that showed it clearly offside",
            "Ehh, I'd have allowed it. The Oilers are dominating SOG and will win this anyway. Gotta throw the cats some merciful scraps.",
            "The pixels simply matter, because the rules are very clear. And they managed to find an angle, that proves it was offside. If they weren't sure, the call would stand",
            "r/Logical_Strike_1520 this is not Nam, this is hockey. There are rules. \n\nI know you wanna say, “C’mon man it’s Sam Rheinart, so his foot slipped over the line a little, it’s just a game man”\n\nBut this is a Stanley Cup Finals game. This determines who gets to host Lord Stanley’s Cup. Am I wrong?",
            "It clearly wasn’t too close to call because it was offside by a few inches and the goal was overturned.",
            "they actually show a better angle later on and it was actually the right call. it wasnt by pixels dude was like a foot offside. the exact moment they were showing and discussing on the broadcast was the wrong moment",
            "Nah the line as to be clear you can’t allow something because it’s close to be ok. I think the call was totally fine.",
            "Because the rule book is like \"this is clearly an offside, but if it's only a tiny bit of an offside that's okay, let it slide\"",
            "Wait until the dude hears about when 2 line passes were a thing.",
            "Is this so you can’t skate to the end and cherry pick of the start or am i misunderstanding ",
            "The \"goal suck.\"",
            "Oh man, that's one was brutal. Linesman should never ref another game after that.",
            "Lol wtf. Thank you!",
            "I didn't see the other player so this makes total sense. They kept zooming in on the puck and I thought they were looking at if the player was ahead of the puck. I'm dumb, thanks for the clarification.",
            "I mean barely an advantage he was offside by like an inch but still",
            "That's not going to happen any time soon because the rules dictate the officials on the ice make the initial call. The officials on the ice are humans and it's ridiculously fast paced game.",
            "Agreed, this should be like tennis where they show the pucks exact location within a second.",
            "You gotta bring that up with ESPN. Watching on SN, it was pretty clear in their coverage. Seems to be a broadcaster issue.",
            "Bettman : highest tv viewership for a Stanley cup final you say. Mmmmmmmm Ameri-money.",
            "The SECOND Florida is in the opposite position and it's clearly offside that \"oh it's just a LITTLE BIT offside, what's the big deal?\" stance would get reversed REAL quick.",
            "Get your brain checked. Your a moron.",
            "I know the rules, tough guy. You close your eyes and imagine not being an asshole.",
            "If it was not 100% conclusive it would not have been turned. They have camera angles and tools we dont have watching tv...",
            "They just showed a conclusive angle on Sportsnet during the intermission.",
            "It was offside. It’s the finals. You can’t let that goal go through. Sorry.",
            "Honestly I saw enough angles to call it imo. I think it was a good overturn, just a SUPER close one",
            "Oilers challenged it. It was offside. You think because it was close the Oilers should get a goal against them and a delay of game penalty? They risked it and won.",
            "Yeah it’s not an obvious miss.  Just let it go.",
            "lol I don’t have a horse in this race, could careless either way. But if Americans are involved, it’s highly probable it’s corrupted. Silly Canadians still believe in Santa",
            "The absolutely dripping irony of this statement",
            "Yea I would drink if I were a Leafs fan too",
            "Fill said Helmut with said beer.",
            "drink a beer from a helmet",
            "Tissue*",
            "**grab a helmet and a beer, the Oiler way",
            "Yeah lol the fun players to watch are out with injuries and it's 82 games of grind. Once your team doesn't clinch a playoff spot you stop caring at all until playoffs and then pick a team you want to win and ride with them.",
            "Shhhh let them suffer",
            "It depends on the match ups for sure and who's hot and who's cold. My dad just started watching hockey and he says just about every game in the regular season has been a good and fun game to watch.",
            "If you don't watch the games and just look at the stats it's a rollercoaster of emotions rather than 2 months of depression",
            "Honestly if you watch the Oilers it's pretty entertaining all the time.  Obviously not SCF comeback entertaining.  We are spoiled getting to watch McDavid and co every night.",
            "And McDavid didn't even have any heroics this game, just wait until the next one",
            "i think ur hy, man",
            "Canadians taunting Bob during the US national anthem is ok by you though. Hypocrite",
            "I remember watching this at a kegger in university outside. Someone threw a beer bottle at the tv.",
            "Or lead to yet another SHG.\n\nLet's not pretend the Cats power play has had any affect in this series. Also, the Oilers are what, ~96% on the PK throughout the playoffs. Fucking legendary.",
            "Cause momentum has done a lot for the Panthers this series...",
            "Yep, that 1/19 powerplay does nothing if not build momentum for the Cats\n\nEdit: it's actually 1/19, for a whopping 5.3%",
            "Did the saints lose that game because a missed pass interference call or because drew breeze went 26-40 and the team rushed for 48 yards overall?",
            "There’s nothing worse than an offsides challenge.",
            "They've been absolutely dominated 5 out of 6 games and haven't been good for 3 games straight. 2-1 ends the same way.",
            "That’s a not a very hair thing to say about cunt.",
            "That’s true lol",
            "Knobs just trying to get back on the PK for a chance to get the goal back.",
            "panthers have small PP",
            "I’ve honestly not looked at it that way……this guys right everyone.",
            "Yeah the Oilers are probably pissed they won that challenge",
            "Commentators were saying that they have a camera right on the ice at the line that broadcast doesn't have. \n\nMust have been more clear, I guess.",
            "Since I know you’re gonna be tempted to delete this comment because of how dumb it is and other people are gonna want to know what it said…\n\n“Ehh, I'd have allowed it. The Oilers are dominating SOG and will win this anyway. Gotta throw the cats some merciful scraps.”",
            "That's like the opposite of how that works. Try and get rid of the bias not add more",
            "They should show the angle that was used to overturn it.",
            "Made me feel better once they said the analysts can zoom in and get much better angles than they can provide on the live feed",
            "I guess I just don’t think missed calls should be challengeable. A *wrong* call sure, but not missed calls. If it was too close to tell live and the linesman missed it, play on.",
            "That's not what replay is for though.  \n\n\nReplay is to correct clear fuckups.\n\nIf you're down to debating pixels, it's a goal.   \n\n\nNo, I'm not a Fla fan -- far from it.",
            "\"We found an angle that only we can see. Trust me bro.\" - Bettman\n\n🤡 league.",
            "He's saying that it's too close to on the ice.  At game speed, that inch doesn't really offer any practical advantage for Florida and it happens too fast to see or call.  \n\nAs much as I hate Florida, that kinda sucked.",
            "Blast from the past right there",
            "You mean there was a time defencemen were drilled into the boards on icings?",
            "which used to be called a red line offside.",
            "Yeah pretty much, disincentivizes players from just going and hanging out at the opposing team's net when the play is elsewhere",
            "Yes",
            "It’s similar to soccer. Except the blue line is stationary instead of the last player.  And it’s not from the time\nIt’s kicked, it’s once the puck clears the blue line. The. You can go anywhere inside",
            "That is actually not dumb at all. If the player handling the puck were too turn around so they entered before the puck, that can also be considered offside. In that situation they are looking at total puck control. It doesn't happen often, but it has happened.",
            "I think a lot of people were only looking at the player with the puck and didn't understand why this was offside.",
            "No problem. There has been no shortage of confusion this post season. But this seems consistent for an offsides as far as I can.",
            "That’s just the basics of what happened. Florida entered the zone before the puck. \n\nAt least it wasn’t those weird reviews that happened where zone time was 1:15 before a goal. \n\nLike those are ridiculous. At least in this instance, the ensuing goal occurred fairly quick after the missed penalty.",
            "Then it shouldn't be challengeable. Unless you make every missed penalty challengeable too and that also should not happen.",
            "It's, uhh...it's actually \"you're a moron\", not \"your a moron\". \"You're\" is the abbreviated form of \"You are\", which is what you were trying to say here when you called the guy a moron.",
            "You don't. The goal was overturned fairly by those who bleed the rulebook. End of story. Walk off the embarrassment.",
            "Oh please. Stop with this shit. There was no way it was 100% conclusive. And if you are so sure about this, why wasn’t Nurse’s blatant knee to knee held up on review?",
            "So if you agree with that, why wasn’t Nurse’s blatant knee to knee held up on review? Don’t give me the excuse Bennett wasn’t hurt. Penalty is a penalty and that wasn’t even close to being accidental.",
            "Nope. Not conclusive",
            "I sure didn't.",
            "In our defense, his address is in Canada, postal code H0H0H0",
            "Why's the leafs fan catching strays dawg were out too lol 😭",
            "Edmonton winning on Monday is the closest Leafs fans will ever get to a cup win.",
            "Ask him again after watching 5 seasons",
            "if you are actually asking, it was because of the missed call. like that season when they had 57 rushing yards and brees was 27-40 and they beat the steelers. those arent super unusual stats for them.",
            "What first 3 games were you watching?",
            "That's not a very Reinhart thing to say about Sam",
            "I'm cheering for the Oilers buddy",
            "they definitely should, but the broadcast and the nhl dont always have the same camera angles.",
            "It would for sure be much better for transparency, like in soccer with the offside line",
            "They did, repeatedly.  I'm not a fan of the rule, and think there should be additional conditions for overturning something that was incidentally offsides, but it was clearly offsides, even if it was only by half a second.",
            "Agreed. I think calling a goal back due to a missed offside is a detriment to the NHL.",
            "Agreed, and the spirit of the penalty is to prevent cherry picking, which is does and if it’s close enough a linesman can’t tell, there’s no reason it should be reviewed",
            "If they're unsure I'd rather they let it play on and then be challenged if something consequential occurs. In most cases, nothing of consequence will have occurred and so it'll just play on.",
            "There are no wrong offside calls. When the call on the ice is offside, the play Is stopped immediately. No chance to score a goal and challenge it after. Soccer has a different system, where they let the play happen and check for offside afterwards, when a goal was scored after an unsure offside situation.",
            "Exactly, you cant tell me this fraction of a millisecond gave anyone an advantage.\n\nI hate this rule and a horrible way to utilize instant replay to \"improve\" the game.",
            "100% agree",
            "The current system is fine because it is applied evenly to both teams and offsides is objectively measured.",
            "There are three options. Clear onside, clear offside and if they can't tell, the call on the ice stands. The refs decide, if it's clear enough for them. But the rules are clear, that's why the lines are there.",
            "Then you've got this grey area though.  Rules are much better when they're black and white imo",
            "Yeah well panthers got lucky with some calls to, just the way the game works",
            "bro the other panther player had NO part of his SKATE on the blue line while the puck completely crossed the blue line. (im a experienced hockey player)",
            "Not if they have possession. A player in possession of the puck could skate in backwards and would not be considered offsides.",
            "What about the still shot that 100% conclusively shows his skates fully past while the puck is still on the line? Are you looking for a different 100% conclusive photo?\n\nDo you think because you saw some different angles that don't 100% conclusively show the offside that means the photo that does 100% conclusively show the offside somehow doesn't count? \n\nDo you refuse to look at the photo that 100% conclusively shows the offside so you can tell yourself what you saw was inconclusive?",
            "Very silly comment. Regardless about how somebody feels on the knee it is inherently a subjective decision. This case is totally different because whether a play is offside or not is 100% objective (regardless of if there’s evidence which in this case there was). \n\nYou’re comparing apples and oranges as if they’re both bananas",
            "Ha! Nice one!",
            "Leafs fans were built to catch strays",
            "You must be new around here.",
            "Drinking",
            "https://youtu.be/25j6s-ZY3mY?si=05Qo7D4bDG4h84Ps",
            "Says the Bruins fan with 1 Cup win in the last 50 years and 6 in franchise history. 🤣🤣. Bobby Orr and Phil Esposito played in the era of the last Leafs Cup, those were the Bruins “heydays” lol",
            "Well you gotta go to a live game every once in a while to revamp it haha, I still enjoy them. Nothing like tuning into a game after a long day of work and having a couple beers.",
            "So the other 13 incompletions were pass interference too? You can’t blame an entire games outcome off of one call. It negates the other 99% of the game.",
            "The close games that Bob literally carried. Did you watch different ones, or do you just not look at anything but a final score?",
            "They showed a much clearer still shot later in the broadcast.",
            "But where do you draw the line? Is it ok if he’s 8 inches offsides as long as he wasn’t cherry picking? 6 inches? 3 inches? \n\nAnd then once you allow that then when you call something that’s 9 inches over the line people will bitch about it being the same play as the one you let go that was 8 inches over the line. And that would also add additional judgement responsibilities on the ref or linesman to determine if it was in “the spirit of the rule.” That’s why you just have to draw clear lines and stick to them. There’s no judgement of spirit required. You were either over the line before the puck or you weren’t. And it’s consistent for everybody. You have to draw the line somewhere, it’s the only way to do it.",
            "Only halfway though. The ref can still blow it off immediately, he's just told to let it go and have the video assistant check it.\n\nCase in point: the Bayern - Real champions league game from two months ago.",
            "NHL officials don't whistle it if it's close anymore.",
            "Obviously pissed about this one but I’ve hated this rule since it was implemented for exactly the reason you mentioned. It’s not improving the game.",
            "The only alternative is to remove the review for offsides completely.  And I think with the Duschene one a few years ago it’s kind of necessary.  \n\nThere’s not really any other way to utilize it than for it to be black and white.",
            "That's easy to say.  They don't call every cross check or slash unless it's super blatant or interferes with the play.   To look at every pixel for an offside call seems pretty bogus.",
            "Yep, see Sabres loss in the Stanley Cup with the No Goal Incident where gray area finished the Sabres (similar goals had been disallowed earlier in the year in other games/called \"no goal\")\n\nBetter to be black and white.",
            "It shouldn't be challengeable to begin with.",
            "Wonder how many of Gretzky’s goals would’ve been called back? The whole point is that it shouldn’t really be reviewed if there’s no clear advantage and the ref, sitting on the line, can’t even tell. I get the arguments for replay, but offsides is so damn annoying every time",
            "Not really but ok",
            "Like fucking what? 🤣",
            "I would've been ok with that being a \"nor enough evidence to over turn the call on the ice.\"  We're talking about pixels at game speed.  It didn't matter on that play.",
            "It’s not 💯conclusive. Show me the me still shot. Only still shot, and the puck was hidden. So how is this conclusive? Again if you are calling this 💯 conclusive, why was Nurse’s blatant knee to knee overturned? You can’t state that offsides is conclusive with limited angles and overturn Nurse’s blatant knee because there wasn’t intent.",
            "You are missing the point but keep making excuses. Ridiculous",
            "But not to win more than one game in the second round.",
            "nah, you definitely can. it was a close game, but the saints were going to win until that missed call. normally im with you about this kind of thing. this game is the exception.",
            "No I watched the whole series, and the Oilers looked like they did at the beginning of the season when they were setting records for suck.",
            "Empty netters at the end of games aren’t dominance. Hope you get what you deserve and lose Monday",
            "Are you talking about the still they showed in the third with both the puck and the skate already in the zone? Or was there a second still that I missed?",
            "If your linesman is missing offsides by 8in, then you get a new linesman lmao",
            "Never heard of that, interesting",
            "Those are judgement calls though, and people get upset because they aren’t consistently called the same way. Do you want to start making offside a judgement call by the refs based on whether they think it offered an advantage? It’s basically the “C’mon it’s Smokey, so his foot slipped over the line a little” mentality. \n\nDo you think the goal line should not be rigorously enforced either? What if the puck is 9/10ths over the line? Should we just call that a goal because it’s close enough or what? \n\nYou have to have one black and white standard that’s consistently applied to line rules, otherwise if you make them a suggestion rather than a rule it opens up a Pandora’s box and you don’t want to go there. \n\nNow if you just want to get rid of replay altogether then that’s another argument.",
            "When does it matter though?  He can be an inch over? Ok.   What about two?  Three?  Six?  A foot?\n\nOpening rules up to interpretation is silly.",
            "Only a little better than the canes that can't win a game in the third round",
            "Do you have any stats to back that up?\n\nEdit: still waiting on any stats.",
            "The oil have two shorties.  How many PP goals do the cats have?",
            "I saw one where it was clear the skate was past, and the puck was still a hair on the line.\n\nIt was the right call, but holy crap a single video frame may have changed the whole game, or even the who holds the cup in the end.",
            "Either way the principle is the same no matter what numbers you want to plug in. The point is it’s either black and white, or you open it up to the linesman going, “ehh close enough.”",
            "A crosscheck is a crosscheck and a slash is a slash.  That offside could've easily been a judgment call at game speed.  I would've been ok with that being a \"not enough evidence to overturn the call on the ice\"  we're talking pixels at game speed.  It didn't affect the play at all.",
            "3-0",
            "It’s not though? My comment specifically said to call offsides where it’s offsides, but it shouldn’t be reviewable, if the linesman didn’t call it at the time then that’s that. There’s no “oh 3inches is ok, oh okay now 6, etc” like it’s literally just if you can’t tell without reviewing the play and putting it into a still then we’re all good",
            "There was definitive evidence that it was offside though. You just don’t like the idea of the game being decided by something so minuscule that didn’t effect the play. And I understand that sentiment, but that’s not the rule. It’s black and white, offside or on. Otherwise that would be giving the Panthers special treatment because, “C’mon dude that’s such a small difference”. Well they need to change the rules then if they want to be able to say, “Yes it was offside, BUT….”\n\nI would be in favor of taking away replay for offside calls, and that would effectively give you what you’re asking for, where the refs eye at real speed should be enough for the spirit of the rule, but once you introduce replay and the refs know for sure if it was off or on, you’re committed to calling what the evidence shows.",
            "I'd be ok with taking away the replay.  You're not going to change my mind.  That was a weak call.  I'm not convinced it was offside.  If that was offside, then I want to see every cross check, slash, high stick, boarding, and penalty call be reviewed too.  Let's get it right."
        ]
    },
    "[FLA 1-(5) EDM] Skinner clears the puck out the crease on a close chance and Nurse adds another empty netter": {
        "title": "[FLA 1-(5) EDM] Skinner clears the puck out the crease on a close chance and Nurse adds another empty netter",
        "score": 168,
        "url": "https://v.redd.it/kkyd8wx9f18d1",
        "content": "",
        "num_comments": 7,
        "comments": [
            "If I had put a $100 on Nurse to score and Skinner have the assist I would be a millionaire lol… who would have thought",
            "Skinner with more points than Bennett and Tkachuk in game 6.",
            "THE OILERS ARE MAKING THIS AN ACTUALLY GOOD STANLEY CUP FINAL!",
            "And that’s a primary assist!",
            "fuck 101 street is going to be crazy.",
            "When they put their goalie back in it felt like they were just giving up. \"Okay, we've got to kill three minutes until we lose, might as well not get run over too badly.\"",
            "And McDavid lol"
        ]
    }
}