{
    "[Weekly] Team Building and Questions Megathread": {
        "title": "[Weekly] Team Building and Questions Megathread",
        "score": 15,
        "url": "https://www.reddit.com/r/NikkeMobile/comments/1dhvche/weekly_team_building_and_questions_megathread/",
        "content": "Commanders, \n\nthis megathread serves as a place to ask questions about team building or other NIKKE-related topics.\n\n*Share a full list of your NIKKE roster in order to receive proper team building advice.*\n\n&#x200B;\n\n**Other Useful Megathreads**\n\n[Recent Banner Megathreads](https://new.reddit.com/r/NikkeMobile/search/?q=title%3Ashare%20your%20title%3APick%20Up%20Recruitment%20title%3Ashare%20thy&restrict_sr=1&sort=new&f=flair_name%3A\"Megathread\")\n\n[Team Building](https://www.reddit.com/r/NikkeMobile/comments/ym7o2k/post_your_teambuilding_qa_here/)\n\n[Share your Milestones](https://www.reddit.com/r/NikkeMobile/comments/17fpslq/share_your_latest_gameplay_milestones/)\n\n[Gacha Rolls](https://www.reddit.com/r/NikkeMobile/comments/yliznq/share_your_pulls/)\n\n[Share Your Strategies](https://www.reddit.com/r/NikkeMobile/comments/1d8t3hf/gameplay_strategies_and_guides/)\n\n[General Story Discussion](https://www.reddit.com/r/NikkeMobile/comments/1d8stg8/story_discussion/)\n\n[Banner Decorations](https://new.reddit.com/r/NikkeMobile/comments/1cd7no7/have_you_tried_the_new_profile_decoration_feature/)\n\n[Looking for Friends](https://www.reddit.com/r/NikkeMobile/comments/ymza0p/megathread_looking_for_friends/)\n\n[Promote your Union](https://www.reddit.com/r/NikkeMobile/comments/yonygi/promote_your_unions_here/)\n\n[Bug Reports](https://www.reddit.com/r/NikkeMobile/comments/yscfmr/megathread_bug_reports/)\n\n[Feedback](https://www.reddit.com/r/NikkeMobile/comments/ynmdyk/megathread_your_feedback_positives_negatives/)\n\n&#x200B;\n\n&#x200B;\n\n**Helpful Databases**\n\n[Nikke.gg](https://nikke.gg/)\n\n[Prydwen](https://www.prydwen.gg/nikke/)\n\n&#x200B;\n\n**Helpful Archives**\n\n[CD Keys / Promo Codes](https://www.reddit.com/r/NikkeMobile/comments/1075806/archive_cd_keys_promo_codes/)\n\n[Moderator Applications](https://www.reddit.com/r/NikkeMobile/comments/14dcs01/moderator_applications/)\n\n&#x200B;\n\n**Frequently Asked Questions**\n\n[FAQ](https://www.reddit.com/r/NikkeMobile/comments/15eci5l/nikke_faq/)",
        "num_comments": 456,
        "comments": [
            "I need some help defeating the final challenge stage of the current event. \n\nI could defeat the previous stages of the challenge events just fine using a team of Liter, Marciana, Alice, Maxwell and Naga.\n\n But for the final stage some of my Nikkes keep getting one-shot by the turrets quickly after they are spawned by the Boss.",
            "Hi, just got my first SR MG doll, I have crown with a lv5 R doll and haven’t pulled Mordina yet, should I give it to crown or wait for mordina?",
            "Hey guys, so I just started playing about a week ago, my synchro device is at level 93, with both credits and battle data limiting any further levelling.\n\nI just bought out all the energy refills for the event, but I was wondering if I should be spamming the core dust stage (1-11) as a newer player? Or should I just be hitting the credit/battle data stages? Thanks!",
            "I need to switch out Liter in my team and could use some good suggestions. My current line-up is as follows:  \n\\* Dorothy (main B1)  \n\\* Liter  \n\\* Crown  \n\\* Modernia (first B3)  \n\\* Helm\n\nLiter is good and all, but Dorothy currently does her job much better in my line-up.",
            "Does this game need dupes? For instance, needing dupes to max a skill or smth?",
            "based on wording (obviously since she's not out yet) would Clay skill 2 negate the raptures that stop you from bursting?",
            "for arena is better to play with pvp meta characters with low investment (for example Noise with skill 4-4-4 and no overload gear) or invested pve meta character (for example Liter with max skills and overload gear); i play from long time but i never cared too much about pvp but i keep using pvp characters",
            "The collectables are a good start, but is there an official reason for not just straight up buffing weaker Nikkes?  \nI would have lost my f2p status (and opend the floodgates for spending >.<) if I had any reason at all to use Folkwang.  \nBut why buy a skin for a Nikke I won't even play?",
            "How many materials does it take to fully upgrade Exias treasure do I have to collect? I'm currently at 56 for her specific material, I just want to know when to stop so I can then focus on Laplace.",
            "Hi. Any tips and advice for a new player? Just started and I pulled for Soda. Any special banner I should hoard my currencies for? Or should i just pull for any banner for now?",
            " Can someone tell me every single exp source? I thought you could  only get it from outpost defense, few people from the same  server as mine have a commander level 14+ higher than mine, even though  we are in a similar cp range",
            "is material h z.e.u.s' hitbox broken? a lot of my shots on its core just seem to deal no damage",
            "https://preview.redd.it/bg242v9vf57d1.png?width=1561&format=png&auto=webp&s=0456ec5e991008730f062ecb82f85db19146e558\n\n  \nHi guys, I got some SSR and I don't know which team I should use, my current team is: N102, Anis, Bunny Soda, Helm, Maid Privaty.\n\nWhich characters should I use in campaign?  \nAnd should I use a different team for boss fights in campaign? Thanks.",
            "I was lucky and got Privaty before getting the free Privaty. Should I use the 200 silver mileage tickets to get her to 2-star? Or should I save them?",
            "https://preview.redd.it/7360b25i267d1.jpeg?width=1792&format=pjpg&auto=webp&s=120b3a0c4f03d5cf5f025152f43635c15533e89b\n\nI started playing a couple of weeks ago, what nikkes should I focus on leveling up and using?",
            "Posting again to see what would be my best team, got some new characters and would appreciate any advice to help out https://imgur.com/a/HtMPKoT. Thanks in advance!",
            "https://preview.redd.it/4dmb6n85277d1.jpeg?width=2360&format=pjpg&auto=webp&s=6bb185e3c2effa8757a272b47dfa8c808aba56a3\n\nUnlocked Interception EX, need improvised teams to get tier 9 manufacturer gear",
            "Hey all ! I wanted to know when/if i want to upgrade my gear early on ? I can only clear Intercept S up to stage 7 ( ive been playing for 7 days) so i got mostly tier 6-7 gear.\n\nShould i level like glove helmet for attacker etc or just wait until T9 gear and stay at 0 in the mean time ?\n\nAny tips would be appreciated , thanks !",
            "&#x200B;\n\nhttps://preview.redd.it/515mnun7577d1.jpeg?width=1080&format=pjpg&auto=webp&s=5c5b9280eaf69f1ca0e4867253a8315ded020341\n\nWanted to get a gut check on this. Given if I rerolled again I'd need to lock the first line (making 2 locked lines), I'm better off keeping the useless second line than chasing perfection with a max ammo roll there, right? Especially since Line 2 isn't even guaranteed?\n\nAlso, while none of her other pieces are finalized, she does have a locked tier 11 (initial) max ammo roll on her boots on the third line, which is pretty dang good. I'm still chasing her second charge speed, though.\n\nPS - This is for Alice if it wasn't obvious!",
            "Is it worth spending gem on the standard banner to get over the 160 wall faster ? Just started 7 days ago , Level 120 Nikke with 65k gem saved (Wanted to use them for the summer event). Got lots of gems since i bought some packs from the chapter complettion etc ( about 120$ )\n\nI would 100% prefer just saving for the summer limit but i know the 160 is really important too..",
            "Hi i’m new and wanted to ask what kind of team can i make with these characters for pve\n\nhttps://preview.redd.it/3iizhs2vh77d1.jpeg?width=1600&format=pjpg&auto=webp&s=abb85fe7e847fac5961e290687b168f2335e5b0c",
            "Anyone know why my event always has an * like I'm missing something? I'll clear every daily, challenge, complete daily missions, get all minigame rewards, all hidden items and it still has an * on it.",
            "Do abilities that say \"activates when recovery takes effect\" activate when anyone is healed or just the unit in question? like Crown's Royal Attire for example. Also what constitutes \"group healing\" since Royal Attire says it won't activate when that happens, does Bunny Alice's Carrot and Bunny Party not count as that for example? because I've tried testing it and that ability seems to activate Royal Attire.",
            "Just pulled Volume. My 4th attacker. Have a spare SMG doll. Is she worth using it on?",
            "I dont have drunk scarlet but I want to make Doro/S.Anis/privaty last bullet team. Who should be a good replacement for Drunk scarlet?\n\nI was thinking of Guillotine or Maiden just because S.Anis buff. but Guillotine need to be on low HP and I dont really like that meanwhile I'm not sure if maiden is good enough.\n\nnote: Meta B3 is already used in other team and I have every character except Drunk Scarlet, Harran, SW, Noah and limited character.",
            "Hi again it's been awhile but I just wanted to share my collection to see if my squad needs a upgrade I'd love to add trony and bunny soda if possible so if any of you guys can let me know if I should switch out anyone or keep my current line up let me know and thanks! Also what is a good way to spend my diamonds? I just usually use them to get bunny Alice but I don't know if there better spent elsewhere. Also if you ask I'm looking for a team who is basically versatile good anywhere story, mission, tower all that good jazz thanks again!\n*",
            "PLEASE tell me 26-17 is a common/well-known wall stage so I feel better about being stuck here and needing to let the idle game do it's thing more.\n\nI'm not asking for help (I more or less know what my problems are), I just want to be reassured it's normal to get walled here, haha.",
            "I just want to confirm something.   \nI'm stuck at hard stage 6-6B-1 with a synchro level of 211. Another player is also stuck at this level at 205.\n\nNow there is someone with a synchro level of 160 who surpasses our wall and reached Hard stage 8 - 5.\n\nIs this possible ?",
            "https://preview.redd.it/g5vl3g7iva7d1.png?width=2154&format=png&auto=webp&s=193e6777db6d305ee49b3bbb1cd642514eee018e\n\nGot some help earlier but would like to see what y’all would recommend I do next. I was thinking about getting the bundle that would let me get Volume, if I do that who should she replace on my team (Julia, Noir, Dolla, Soda bunny, N102)? Also is there any character that can replace N102? I really don’t like her character/design and would prefer to use a different Nikke",
            "Hello, I started the game around 2 weeks ago and was looking for some help with team building and advice on units that I should be prioritizing investments into. Posted my units below. Thank you very much!\n\nhttps://preview.redd.it/v26u0qw6qb7d1.jpeg?width=1170&format=pjpg&auto=webp&s=cc94d42ca6a061a9e2c2d4f9b3ca41f5001d6869",
            "Is red hood as burst 1 or 3? I've been looking around and I see a lot of mixed. If she is better burst 3, is her best teams with 2 burst 1s and 3 burst 3s?",
            "Aight, little question here: finally got the 141 capsule for the freebie dupe. From the options available i have to of interest, what is better: Centi Star 1, or Miranda Star 2 (using both). ",
            "Which list do you recommend to invest in skills?:\n\nhttps://www.prydwen.gg/nikke/guides/skill-investment\nhttps://nikke.gg/skill-priority-guide/",
            "Hey all ! I would need some advice for a Grave Digger Team for Intercept S.\n\nSo far my record as been with Anis/Maid Privaty/Modernia/Leona/Liter. Most of the time i can get to stage 8 , 13m dmg , record 16.5m.\n\nIve put leona in there since i saw that shotgun are good for the red circle and im struggling with that a lot.\n\nAny thing i could change from my list below ?\n\nThanks in advance for any tips !\n\nhttps://preview.redd.it/ib9j02tkbe7d1.png?width=1576&format=png&auto=webp&s=3511233388c1d78924709e14e7ed39ab913e1dd8",
            "Does anyone have a rule of thumb on rerolling dispatches or buying core data for credits in the daily shop?\n\nSeems like there should be a way to just spreadsheet it out and assign each non-gem dispatch a gem value and draw a line like \"if X low value dispatches then reroll\" but I figure someone has done it already. Also not sure if anyone actually buys the 1h core dust for 150k credits in the daily shop, right now it seems like my credits outpace my gear fodder but it seems like I'd go negative pretty fast if I bought core data with credits every time I showed up.",
            "All these bunnies, which to choose? Or skip, because they will probably be in the general pool, right?",
            "are we going to get a new surface character investigation this year?",
            "MoG is leaving after today right?",
            "Question about the detail screen for Nikkes. Do the weapon stats when you click on their weapon icon take your OL lines into account or does it just list the base?",
            "Do we have a good MG support? I was looking through the characters and maybe I did miss one but none come to mind. If there is one, is she worth building? I think Elegg is the only MG support (kinda)",
            "I was banned or something? Because from yesterday, When the New event started, the game throws me \"system error\"",
            "Will bunny soda be on the standard banner in the update today? ",
            "Where is Rem in all of this meta? I'm wondering if [treasure frima, Clay, rem, laplace, filler] is a good theory comp. Open to suggestions, i can see the lack of cdr being an issue ",
            "I can not find the last curiosity(44out of 45) in the event please help",
            "how much favorite items does a nikke require ?",
            "Trying to work my way through Lost Sector 11, where you get 6 nikkes. Side 1 is going slow, but making progress with my starting team at ~90k and fights in the 95-100k range, but then side 2 is 57k for your solo unit? \n\nIs there supposed to be a huge downtime between lost sector 10 and 11, waiting for your top nikkes to go from 18k each to 25-30k each? \n\nLooking at threads from a few months ago and they are saying side 2 fights are around 19k. Was there some kind of really steep buff to the difficulty recently?",
            "I know a good while back Nikke banned auto-clickers for botting etc... But I dont use one and still get the pop up. I had thought that maybe it was my Razer mouse software (and some posts from a year ago that suggest this might be the issue), but even turning all of those off and even completely closing the software doesn't stop the game from thinking I am using one.\n\nWhat are people doing to get it to actually work?",
            "[deleted]",
            "Anyone having system error when starting the game?",
            "First time to experience summer in Nikke, what is usually in store during summer?",
            "Can anyone help me build some SP teams? I've rapidly discovered that PvE teams are NOT built for PvP\n\nhttps://preview.redd.it/ofj4x5k94p7d1.png?width=2312&format=png&auto=webp&s=3bd47449bbe2a37b727869e5d0a10f60fd0b6a2c",
            "what are the best 3 teams for sp arena defense? i have all units (minus folkwang) and im not sure how to build the best teams",
            "Can Rupee skill 1 add stack to skill without stacking? And not even activated? Like Sugar s1?\n\n\n Similar thing to Bunny Alice and Water code. \n\n\n Not sure how this mechanic work. As I have seen different answers on Google with bugs included.",
            "Stuck in a rut in campaign. What’s the call on my team comp and who should I replace?\n\nhttps://preview.redd.it/gue1auhf9q7d1.jpeg?width=1170&format=pjpg&auto=webp&s=9db3857d682c57ed4484cf9230bc55a8d454b35d\n\n(See reply for roster)",
            "Can someone tell me if there's a better team comp amongst this roster. Currently I'm using:\n\n* Campaign/General: D: Killer wife, Rupee, Scarlet, Laplace, Maxwell\n* Arena: Jackal, Rosanna, Centi, Scarlet, Anis\n\nhttps://preview.redd.it/xf4us30i3s7d1.jpeg?width=1418&format=pjpg&auto=webp&s=6df4a7bc3bc2d60da0e9753cb09182b8cf30c642",
            " What does damage to the interruption part and damage dealt when attacking the core mean? \n\nDoes damage dealt when attacking the core only apply for a rapture with core parts like Modernia, Mother  Whale, **or** the critical part of every rupture (when your crosshair glows  red)?",
            "So, apparently you can use 2 Liter in the event stage now? I thought you were blocked before",
            "What are the best pvp teams I can make? Most units besides the first 8 don’t have too much invested in them\n\nhttps://i.imgur.com/ut14rGN.jpeg \nhttps://i.imgur.com/R6YUjoM.jpeg \nhttps://i.imgur.com/NUoeSu6.jpeg",
            "Is the ssr being rotated in the shop(For the favorite item) random or does it follow a set schedule? Feel like I've seen Diesel and Frima a lot more than the others.",
            "So I've been playing for a little over a month now and I feel like I've had some decent pulls during my time.  I haven't whaled but I've definitely but some money into the game since I've been enjoying the hell out of this game.  Here's my current [NIKKE roster](https://imgur.com/a/5gOXmkL)\n\nSome general notes/questions I had:\n\n* I used silver mileage tickets to finish rounding out my 5th overlimit unit, so I'm able to break the 160 wall in a few more levels when I reach it.  I have a spare body selector leftover, should I be holding on to this, or just immediately slap it onto someone like Alice who is part of the limited pool of candidates?\n* The main omissions from my wishlist are currently Noir and Liter so I'm going to leave them, but now that I have 5 units at MLB, should I change my standard recruit wishlist to be entirely NIKKEs I don't have?  Or should I do a balance of new units + OL meta units I already have like Alice?\n* Overall it seems like I'm entering the phase where the game slows down.  I made my first piece of T9M gear which was very expensive, finished Chapter 18 which has been very difficult (daily use NIKKEs are becoming less and less effective), and started doing Interception EX.  Is the main focus now to just play small amounts, farm EX gear, let resources build up, and save for limited recruit pulls?\n* Seems like the incentive to do standard recruit pulls with gems is very low now that I have 5x MLB.  I would still like a Liter pull but the odds of that are super low, do people just generally stop doing standard recruit pulls completely once you break 160?\n* I've barely touched the collection items and have no idea what favorite items are but I think I just unlocked that tat the tactics academy",
            "https://preview.redd.it/pjf7obqv9u7d1.png?width=1689&format=png&auto=webp&s=ac1b518fbfca3cd37d7f2f0d7fd68b4930c7318d\n\nHit the 160 wall today. Now, do I keep levelling up the MLB unit or hoard resources and level them up evenly once I have all 5 unit MLB?",
            "Ok... please help me take out Mother Whale. I've looked up so many strategies and still can't get it. What is my best team? [Imgur showing my top Nikke separated by burst level.](https://imgur.com/gallery/Myy0YVZ) Also, outside of the Mother Whale fight, what is my best team? I've been doing pretty good with bunny Soda, Noir, Blanc, Tia, and Tove. I would love and appreciate any guidance.",
            "[deleted]",
            "When should I invest in the syncro device?",
            "so i saw D killer wife as sss tier in prydwen, whats her team comp? i wanna try her",
            "Is it me or seems they really put a lot of one shot jumping raptures behind buildings or other raptures in later chapters make it almost impossible to kill them before jumping. \n\nOnly way it seems i can get past them is to try iframe cheese.",
            "is there a fix for the pc client network error ID:4/28?",
            "Other than Anis for burst gen in PVP, what other SR units are worth adding to Synchro after breaking the MLB wall?",
            "Barely started playing mid-May and need help making a team for PVP and regular PVE (barely at 11-1 in the story) that isnt just generated by clicking auto on the team lineup. Also some suggestions for the wishlist for the pulls would be great. Thank you all 🙏🏻\n\nhttps://preview.redd.it/ls9v0gixnz7d1.jpeg?width=2420&format=pjpg&auto=webp&s=956dc16360457a702b126be6a9ea22cc06e77586",
            "Hey. Just started playing a few days ago and I'm loving the game so far. Mostly looking for PvE only but I'm not sure how to build a team... Is there anything in my roster I can work with right now? \n\nhttps://preview.redd.it/yk4dxevgrz7d1.jpeg?width=1786&format=pjpg&auto=webp&s=470e31ed7ff177d65f44de5b5dce24c4bb80c3ea\n\nCurrently stuck in campaign. Need to find ways to generate some exp or wait it out for a while before trying again.",
            "https://preview.redd.it/wcfcons8008d1.png?width=1920&format=png&auto=webp&s=b9d3802353bfda3723b0c12c22a8e20261b3b025\n\nSo, uh, I pulled Scarlet on a random discounted standard pull!\n\nI've been using Tia | N102 | Naga | Privaty | Red Hood currently. Should I swap Privaty out for Scarlet?\n\nTia's skills are 7/4/4. N102's are 3/1/4. Naga is 5/4/4. Privaty is 4/4/4. Red Hood is 6/6/6.",
            "What's the best campaign and raid teams I can make? I've been investing in the first five but honestly I just wanna hear if there are better options. \n\nhttps://preview.redd.it/0izpkol4r18d1.png?width=1896&format=png&auto=webp&s=3a1e21b08a91a08d5b5d38fd3ea337cd14b91288",
            "I'm about to start rerolling to try and get Red Hood and I have a question. My question is about how the salted emails work. I have an email I use all my mobile stuff with that I want to use for the game, so if I do the salted email method and get the the roll I want on emailname+9 for example would my googleplay account I use for the game still be using just the normal version of the email (emailname@ instead of emailname+9@)? I have OCD so I'm super particular about things like this and I'm just confused with how it works.",
            "https://i.redd.it/tytimhut628d1.gif\n\nThe first line is my general team for PVE / Story / Bosses and below is all the units I have. Would welcome any advice on other team combinations that would be strong for these and PVP. I'm very new to the game and you can see who I have invested into based on level and just trying to work out some combos to give me an edge",
            "Hey y'all. New player who just started playing 2 weeks ago, does anyone wanna be friends on Global?",
            "Hello everyone, been playing the game on and off for a while and now I'm interested in pushing the campaign as far as I can, I'm in world 20 I think, can anyone tell me what's the most meta team I can build with the characters I have?\n\nhttps://imgur.com/a/Bzm2TtD",
            "Will the new bunny girls be added to the summoning pool?",
            "Is there any new for Anis: Sparkling Summer coming back?",
            "Just started the game a few days ago and currently on chapter 6 of the main story. I still don't know how to properly build a team with my nikkes so can someone recommend a team I can use for story mode\n\nHeres my characters\n(https://imgur.com/gallery/cyMi7bF)",
            "I have obtained new characters and am once again here to ask for team recommendations for both pve and pvp, here is my list of characters https://imgur.com/a/7dMnBJs, thank you in advance to anyone who may decide to help.\n\nAlso, should I be levelling gear at all or just waiting until I get all gold gear first? Because I've only levelled the one gold thing I got from anniversary so far.",
            "So I finished Rehabilitation for Guilty, Sin, Quency and Nihilister. Does that mean that this system is useless now? Can't I rerun them for Spare Bodies?",
            "Just got to chapter 27 and met Raptilion but I've never seen them before and everyone acts like they know him, did I skip something?",
            "When did nikke start using the silly S-SS-SSS tiering? Is this just normal for gachas now because people hate seeing their waifus in low tier? It's a bit silly when it's like SS-SSS = meta, S = good, A = usable, B = bad, C and lower = utter gutter trash dogshit",
            "I'm losing my mind.  \nSeveral collection item mileage boxes, got ten R-grade items and one SR-grade but none of them were MG!!! HOW ON EARTH??!  \n  \nI know we can just use the SR selection box, but I watched from the guide we're supposed to upgrade the collection item from R to save resources..  \n  \nMan I don't know anymore",
            "Okay… I have a serious question… I need your utmost focus and brainpower in this…\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nWhy there is no nikke with Jack-O pose?",
            "Should I overload liters gear?",
            "Specifically how many hours after reset does union raid start? Asking cause my union has to start immediately when it drops ",
            "Hi! What are the best five teams for solo raid?",
            "https://preview.redd.it/858tf5ab118d1.png?width=720&format=pjpg&auto=webp&s=5fa9410b7df31177f2c9891510e08bf34d1ca3fd\n\nSo uh....what the actual fuck. I downloaded this game three days ago and this is like my 6th ten pull? And I've been looking at tier lists because I'm curious and aren't these two both really good units too? Though I was stupid with my first three ten pulls and pulled for Clay with my eyes instead of my brain. And I literally got D: killer wife before this in a standard pull. And from what I see she's ALSO really good.",
            "If you're getting oneshot you're probably just undergeared. While the game does synch you for challenge stages, gear plays a massive role in the levels themselves.",
            "hypothetically there should be a low damage front turret spawn. can retry for that.\n\nWhy are you running both marciana and naga, that is a waste. if needing strong healing, use marciana, if not, use naga. put in another DPS unit instead (free privaty or noir or drake as buffers).",
            "Firstly,\n\n> Mordina\n\nSecondly, just hold onto it and swap it out for Crown's doll once it reaches level 15. Optimal leveling path is to bring up an R doll to max level 15 before swapping. Otherwise you're leaving resources on the table. What about Modernia you might ask? You'll have more opportunities to get more dolls. You get a selector every solo raid if you can clear level 7, and you can bank one to ensure another SR MG doll if you want. Pulling Modernia herself is likely going to be the bottleneck rather than the doll.",
            "core dust is always the better resource. you will get heavily gated by core dust later on. on another note , i wouldn't recommend buying event refills unless you can spend it in hard mode 1-11 ( dunno if you're there or not, just saying). if you're low level i would recommend holding on to your gems for summer event, and pull for a meta nikke.",
            "If you really wanted to commit to this build, then Privaty would be a natural fit in this team. Privaty's mag size debuff will help proc Dorothy's CDR more often (Not to mention Helm has last bullet effects too), and her reload speed buff will synergize with Crown's buff to allow Modernia to near instant reload.\n\nThat being said, I think you'll find most people will urge you to build around Liter instead since she is the more meta B1 for campaign, especially as you approach closer to endgame and pull more strong DPSs (you didn't post your roster, do you have any other DPSs of note?) Right now Dorothy and Liter might perform similarly on your team because of investment differences, and also by the fact that your only DPS of note is Modernia. Liter's strength (among many others) is that she is a highly potent attack buffer, but without another strong DPS in the place of Helm, you might not be able to appreciate that effect at the moment, with Dorothy being able to pick up the slack, so to speak, with her own decent damage output. \n\nStick with Dorothy if you'd like, especially in early/mid game, but I would highly suggest to invest into Liter on the side, as there will be a time where she will eventually outperform solidly over Dorothy for campaign. If you have an attachment to Dorothy, then no worries, Dorothy is still very relevant in raids, being part of the current highest damage team in a neutral setting (Dorothy/Crown/SBS/Alice/Privaty)",
            "Just kick Liter out if you want. It won't affect your team much even if meta slave said so. At most you team would only be able to beat xx0000 instead of xx1000 if you use Dorothy instead of Liter. Big fucking deal, still way better than using 2 fuck burst 1 like now.",
            "No point in running two B1s. Pick between liter or dorothy.\n\nLiter is better for general story as she has faster CDR, cover repair, and big atk buff at start of burst. Dorothy's main skill is her brand, but it is too slow for story to screenclear (by the time it goes off, you already killed everything it will hit or you are already dead). She is more for bossing. Free privaty helps improve her CDR and brand dmg, and free privaty+crown can lead to infinite ammo during burst if reload speed >110%.\n\nendgame with liter = Crown / liter / Naga / Modernia / pick another B3 - ideally RH\n\nendgame with dorothy = Crown / dorothy / naga / modernia / RH or free privaty (bursting for AOE stun) OR crown / dorothy / modernia / RH / free privaty (nonburst for atk/reload buff)\n\nCrown+naga is typically stronger than Crown+free privaty.",
            "You need dupes to break through  what is called the 160 wall, enough dupes to max limit break 5 SSRs which are the ones you should level past 160. Until you do  all your synchro units are effectively capped at 160.\n\n\nSo that's a total of 15 dupes (plus the base units). \n\n\nBesides that, dupes are just 2% extra stats. ",
            "for the most part no",
            "only the treasure system nikkes gain different skills from having 2 dupes(you also need to level a SR doll to 15). besides them, dupes only give raw stats a a cool wallpaper at 3 dupes(MLB)",
            "from what I recall, I don't think any of the debuffers/cleansers stop silence or chain stun.",
            "If cp difference is <15-20%, meta characters for sure. A difference of 20+% is nearly impossible to overcome even with meta units.\n\nOtherwise, if similar cp, outside of invincibility/indomitabolity mechanics, it's a matter of speed. First to burst essentially wins hence why the meta is mostly RL units. SMGs have terrible burst gen in general.\n\nFor more reading, see https://www.prydwen.gg/nikke/guides/pvp-intro/",
            "usually you should have enough units to do a aoe jackal team 2-2.5rl and 3rl noah-biscuit team. all 3rd teams are relatively easy to beat so a CP padding team for 3rd team is a decent strat if you have higher cp than your bracket. stat nerfs start at 15.4% cp higher but you usually need 20-24% cp higher to hold against toptier pvp teams.",
            "they don't do it because there's no incentive for them to. Why would they buff weaker units when they could release a new unit/alt instead. Or when there's people who will consistently buy vouchers in hopes of getting someone stronger. Or when they could milk 4-6 months' worth content by locking their buffs  behind a grind or convoluted system.\n\nnote that almost every gacha does this; some just manage/disguise it better.",
            "Some various reasons\n\n-having bad units exist isn't a bad thing, bad units make good units look better, and fill up the perma pool to make people pull for the \"real\" ssrs and not the purples with gold paint.\n\n-it costs dev time to fix a unit that could otherwise be spent on making a nee unit, especially in a game as p2w as nikke if they fuck up and overbuff a mid unit and make it feel like they will be top tier it could cause people to stop spending to set very high expectations their old units will compete with new ones\n\n-more work with new art or animations (not really an issue with nikke but other gachas can give a reworked unit new art)\n\nIf you look at how nikke did it they basically did the \"create problem sell solution\" thing where not only do you need dupes but you also need the doll mats that people will spend gem refreshes to get faster or potentially spend on units for solo raid rosters they otherwise wouldn't. \n\nJust to give examples of previous gachas I played:\n\nGirls frontline - buffed units with new \"mod\" system cost a bunch of resources and redid all art and massively buffed skills - took story units and made them SSR top top tier units\n\nAzur lane - retrofit system took units and upgraded their rarity 1 up and added or buffed skills. Cost a chunk of resources but very achievable, bunch ended up meta\n\n(Just to note the above 2 games are more collectors that made money with skins so had less reason to worry about potential power creep although power creep still happened)\n\nDragalia lost - mana spirals which were basically just kit updates and reworks, a bunch of which made even 3 and 4* units very meta and strong. In some cases it was just temporary for weaker ones but then they reworked former-meta units into total monsters. Cost some mats you could whale for but everyone who played for long enough had way way too many extra mats so it didn't matter. In the end this game died because it made no money, too f2p friendly and whaling felt awful (for reference imagine if nikke had 5x the free pulls but 4x lower ssr rate, but pulls cost like 4x as much real money, but you didn't need dupes, also it didn't have good pity/spark until a year in + super skill based and turbo grind endgame)",
            "> is there an official reason for not just straight up buffing weaker Nikkes?\n\nFrom what I understand, it's just how laws and liability works in south korea.\n\nIf they change something you paid for and you are no longer happy with it, you are potentially entitled to compensation. The only thing that seems to avoid this are straight numeric buffs - not \"making a kit better\" but \"taking that 2% and turning it into a 5-10-20%\" which often doesn't fix underlying problems. Whatever you bought (even in gacha form) could have this apply, so if you spent a few hundred (because gacha's are fucking expensive) optimizing laplace for a last bullet setup and they just straight up deleted that and put in the \"new\" post treasure full charge laplace, you could sue and have a reasonable chance at getting your money back. If they make \"treasures\" as an optional upgrade they didn't actually change anything and there is no liability for them there.\n\nTo an extent I appreciate it, especially when I look at games like league of legends where they periodically just delete old/underplayed champions and re-use their names for new ones. It does however have its own problems and issues though.",
            "treasure system is a way to buff nikkes that encourages spending (more pulls for 2-stars, then having to max bond, then having to RNG for dolls and doll XP mats).\n\nit is also a tedious very RNG-heavy farming system to give endgame players something to do. Heavily RNG systems are best for games with insanely huge whales, because they need to overwhale to overcome RNG.\n\nthe nikke formula is like 85% trash nikkes, 10% semi-useful niche nikkes, 5% meta nikkes. if you realize that, you know how to save/spent your pulls.\n\neven the treasure nikkes change from trash nikkes to either still trash or trash/semi-useful into semi-useful niche nikkes... so it doesn't really even matter much realistically.",
            "I'm assuming it's the same as Laplace so, 1st phase -> 2nd phase use 50 and 2nd phase -> 3rd phase use 110.\n\n160 total.",
            "**- Any tips and advice for a new player**\n\ngeneral tips can be found in [nikke.gg](https://nikke.gg) / [https://www.prydwen.gg/nikke/database/](https://www.prydwen.gg/nikke/database/) \n\nand in my opinion as a low spender, browsing those site can give you an advantage in the long run (ie. meta units/team, recommended build, etc) it will smoothen your progression\n\n**-  Any special banner I should hoard my currencies for or  should i just pull for any banner for now** \n\n  imo, and i think is the general consensus,  it's best to wait for the summer event",
            "I'd recommend rerolling for a meta dps unit. Generally you'd be looking for something like Red hood > modernia/scarlet black shadow > scarlet = (support units) crown/bunnies/schoolgirls > other support units like liter.\n\nThis isn't 100% needed if you don't care about progression speed but they are extremely rare to get off banner (like 1/2000 for an individual pilgrim) and extremely overpowered relative to the rest of the roster.",
            "it is mostly from who pushed story the further. higher outpost level will give more commander exp. commander exp doesn't really mean anything or do anything so it doesn't really matter.",
            "As they said you can click their name and see their story progression. I'm the highest commander level in my ranking group by like 7 or more but I'm also 2 chapters ahead in both main and hard story which is a lot of xp from clears + more outpost.",
            "....so i wasnt hallucinating. Ye, it felt odd when i tried it yesterday. ",
            "Are you breaking the shield with iron units? The purple shield needs iron units to break it.",
            "if there are enemy minions, it has a shield over the core (different than the big purple shield) and you can't hit it, except with piercing/elemental nikkes. Just shoot right above it.",
            "You want one solid team first before making more teams. Right now. Voluma+Anis+maid soda+2xprivaty should be your best bet for a team for both boss and campaign.\n\n\nPvP: Jackal+Blanc+Anis+Maid Private+Noise.",
            "Save. You'll get another free one and might get more before you're breaking the 160 wall",
            "Save them unless you've already got five MLB SSR Nikkes. Eventually you're going to hit the level 160 wall where you need five MLBs to raise the synchro machine above level 160, you should save up your mileage until you reach that point and breaking through the wall is actually in reach (like if you had 4 MLBs and one 2-LB). LBs don't matter much outside of that, outside of min-maxing for PvP and raid scores.",
            "Just pick 5 SSRs to level for the time being, also reset the rest of your units that you manually lveled and synchro them instead. \n\n  \nFor the time being you can use bunny alice/ B soda/Privaty /sugar/N102. Not a great start but should do for a while.",
            "Crown/D:KW/ Red Hood/Scarlet/Naga\n\n  \nYou can replace Scarlet with Alice once you have her fully invested.",
            "crown/liter/rapunzel/pick two DPS (probably picking between maid privaty vs free privaty vs maxwell).",
            "https://preview.redd.it/fc5bdcmb277d1.jpeg?width=2360&format=pjpg&auto=webp&s=de0c4e430a561f78fb4060bd6632d54daf7f3188",
            "wait until t9 gear if possible. the early story chapter can be cleared pretty quickly just by how fast you level. don't need to level gear and your leveled gear gets out of date too quickly to be worthwhile.\n\nyou can reinvest lower tier gear as gear fodder for better gear with 90% gear XP return, but you lose out on the credits. early game, you are capped by credits due to needing to upgrade tactics academy and late game also can find yourself in a credit crunch if overloading a lot of gear (should have enough boxes to cover though, should always be gated by core dust post lvl 200).",
            "For alice, she needs x2 charge speed (total 7.18%) + x3 max ammo (ideally). rest atk and elemental.\n\nit can take 80-100+ rocks to reroll for just the x2 charge speed + x3 max ammo.\n\nWould wait on rerolling on that piece. You may get x2 charge speed on other pieces, then can just reroll this piece without locking 1st line.\n\nLock 3rd line only (if atk or elemental or max ammo... maybe charge speed too but only need x2). Can reroll percentage if really low roll before locking the 3rd line.\n\nYou already have x1 atk and x1 max ammo on 3rd line. the rest of 3rd lines looking for atk vs elemental vs max ammo vs charge speed. when you have all 3rd lines locked, you can see what you need for 2nd/1st lines. \n\ncan stop as soon as you get x2 charge speed (of 7.18%) if you aren't trying to min-max. you can run alice on a crown+free privaty team for infinite ammo during burst so missing x3 max ammo is not as big of a dealbreaker.",
            "I wouldnt reroll on this gear again unless I'm swimming in stones. It's already very decent. I'd keep rolling on other gears to get that second line of charge speed though. From personal experience, playing Alice with two lines of charge speed is so much smoother and will increase your overall Dps.",
            "no. not worth it.",
            ">Level 120 Nikke\n\n\nThere's no point in going out of your way to break the wall when you aren't even anywhere near level 160, it doesn't give you any special benefits (you'll get a little more stats and combat power from the MLB Nikkes but not enough to matter), it just lets you level the Synchro device past 160. By the time you reach 160 who knows what you'll pull with standard tickets, molds, and friend points even before considering how you want to spend your gems.",
            "You are far from the 160 wall, just save for the summer banner or upcoming limited banner since you will be more likely to break the wall that way since you have higher chances of getting a single unit multiple times.",
            "It is entirely okay to be at the wall for a bit as long as you are continuing to progress via things like special interception. The lowered campaign difficulty and loaner units made it much easier and quicker for newer players to get to the wall, which means there's a lot more panic about trying to get over it, as they haven't had to slow down a bit and get their extra standard pulls from another month or two of waiting to get there.\n\nJust be patient and wishlist standard aggressively until you're over the wall.",
            "n102 / viper / free privaty / bunny soda / flex (rapunzel for healing probably best)\n\nskill priority\n\n1) N102 1-1-4, free privaty 7-4-4, bunny soda 4-7-4, rapunzel 4-4-4\n\nwishlist: liter, dkw, volume (b1 cdr), dolla (b2 cdr), tia+naga (schoolgirls meta combo), blanc+noir (bunnies meta combo), centi (b2 burst spam when you get b1 cdr), marciana (b2 healer), helm (b3 healer).",
            "did you get the challenge rewards on the 2nd tab?\n\nfor the story missions, need to do all 5 attempts.",
            "crown needs to be personally healed for her skill 2 to activate. bunny alice does a teamwipe heal (even if crown is max HP), so will trigger.\n\nFor naga (only heals 2) or rapunzel (only heals 3 during nonburst), crown needs to be in position 1 on far left to get heals when at full health as they heal left to right.",
            "> Do abilities that say \"activates when recovery takes effect\" activate when anyone is healed or just the unit in question?\n\nYou're not thinking granularly enough. The skill is local to the unit, so it cant be checking other units for when they're healed unless it has some sort of condition like biscuit's \"when defender drops below x hp, make them invul for 5s and heal them for y amount\".\n\nCrown's skill is like Nero's, it's checking for when recovery is applied to them. What counts as recovery? When a unit receives an instant heal, or is affected by a buff that gives them healing over time or lifesteal. Things that increase Max Hp are not \"recovery\". The \"when applied\" will apply to every instance of instant healing, but it will only apply to buffs when they are first applied or when they fall off and re-apply (eg crown works fine with marcianna, does not work with yuni).\n\n> Also what constitutes \"group healing\"\n\nAs far as I know, players haven't encountered anything that constitutes \"group healing\". The wording doesn't affect any of the skills we currently have on existing nikke. If I had to speculate it'd be something like killing a rapture that heals the whole party.",
            "not really, but there aren't any worthwhile SMG nikkes to put dolls on except liter right now. I would personally save one and then next one can put on volume (unless volume is on your main story team, then give her the doll now).\n\nVolume just raid nikke (other raid SMG nikkes are miranda, mast, novel). Her personal DPS does not really contribute and her skills do not scale up with higher stats. Mast is the only one that would scale with higher stats (scales with HP), but she is extremely low priority in raids, does not typically make the 5 team rotation if you have a full roster.",
            "You can run an electric comp with Doro/Bisuit/Elegg/S.Anis/Privaty.",
            "Any electric DPS that can make good use of S.Anis's Atk and Reload speed buff will do. (Which is only Maid Priv or Guillotine that are meta? Maiden can work as just an auto attacker, idk about Haran or Isabel)\n\nAlso to share in case you were not aware, Dorothy and Privaty has seen more usage in the Crown/SBS/Alice team recently (Looking at recent 2 solo raids).\n\nThe electric team is also looking to be using Exia (with Treasure) as the B1 in the future it seems. So far testing shows that it peforms better than the Doro version, but we couldnt test it during the recent gravedigger SR, so will have to wait till the next Union Raid for more concrete results.\n\nEither way S.Anis/Priv/Doro are all safe to build regardless.",
            "https://preview.redd.it/x4lkarw4d97d1.jpeg?width=1080&format=pjpg&auto=webp&s=8a2b1f71d36b2c34c76d5a4c35a14997b9896718",
            "bunny soda (4-7-4) can be a sub for kilo (4-4-4). trony is trash. otherwise, your team looks good\n\nskill priority\n\n1) emilia 4-7-7- or 4-7-4, rem 7-4-4, dolloa 4-1-4, bunny soda 4-7-4 or kilo 4-4-4, n102 1-1-4\n\nwishlist: liter, dkw, volume, tia+naga, blanc+noir, maid privaty (alternative aoe), centi (b2 burst spam when you have b1 cdr), marciana (b2 healer), helm (b3 healer), drake vs maxwell (nonburst buffers)",
            "I'd generally just google nikke XX-YY stage and have found some of the same walls I had happen to other people. Stuff like 25-18 and one of the ch24 ones.",
            "you have to be walled at somewhere man, and like one of every 3-6 stage we have an elite stage that is a bit harder than others.",
            "I'm at synchro 160 at the last stage (boss) of chapter 7 hard, so yes it's probably possible.",
            "Up to like 35% deficit is possible as long as you have meta nikkes. I've seen some push to 40%",
            "Synchro level doesn't really matter. Look at their CP. I'm at synchro 208 and I'm in the middle of ch11 hard because I have like 195k cp. You can look at lowest cp clears of that stage in the last week to see what other people are doing and gauge tour progress.",
            "If you really dislike N102, just buy Volume and use Anis for burst charging instead of N102. (If you burst charge with N102 you will have to look at her ass half the time anyway, rather look at anis ass no?).\n\n  \nofc it's defend on your wallet and reference.",
            "don't buy the bundle, not worth it. dolla already gives CDR.\n\nUpgrades for N102 is liter>DKW/dorothy>volume. just don't look at her when running her on your team lol.\n\nonly reason to buy that bundle is if one of those nikkes is the last piece to break 160 wall after using silver tickets + spare body selector. volume is the worst b1 cdr unit out of all the options, not worth it to buy her.\n\nn102 (general atk buff/burst spammer) / dolla (CDR/burst spamer) / bunny soda (AOE burst) / kilo (AOE burst) / noir (nonburst buffer with atk/ammo buff) is a better team. julia is really bad, should be replaced as soon as you have other options.\n\nskill priority:\n\n1) n102 1-1-4, dolla 4-1-1 or 4-1-4, bunny soda 4-7-4, kilo 4-4-4, noir 7-5-4.",
            "I would run Volume/Naga/Privaty/MaidPrivaty/Maxwell. Maxwell can be used to spam shots for burst charge if needed. You're a Tove away from an SG team, but the SG team quite heavily relies on Tove's buffs, so I wouldn't run it without her for now.\n\nYou can see below for skill investment guides to inform your priorities\n\nhttps://www.prydwen.gg/nikke/guides/skill-investment \n\nhttps://nikke.gg/skill-priority-guide/\n\nTo prioritize long term investments, your most meta units are: Naga>Alice>Noir>Maxwell>Privaty, where everyone after Alice is more of a priority in a raid setting. Alice only shines once fully invested.\n\nWhat you're really needing right now are some decisive meta DPS units (Redhood>Modernia>ScarletBlackShadow>Scarlet) and to a lesser extent, a better B1 CDR unit (Liter>D:KW>Dorothy)",
            "https://preview.redd.it/wgsg659bqb7d1.jpeg?width=1170&format=pjpg&auto=webp&s=548c55bc6063c6dfc19b311552189f5c651c3601",
            "You have the \"Meta SG\" team that is Bunny Alice + Bunny Soda + Maid Privaty + Leona + flex burst 1 (N102, Neon, Miranda, Volume all work). just use them for now for everything.\n\n  \nThe team doesn't need a CDR unit so dont need to force yourselves to use Volume either.",
            "just beware of the burst charge speed though. You may want N102 or Neon if you can't charge fast enough.",
            "red hood is every burst. but due to her 40s cooldown she's mainly a burst 3. Her B1 is strong enough that (if playing manual) it's worth using it \"once\" with the cooldown reset to boost her own B3 burst. \n  \nunless you can end the fight in 1 burst you will use a standard team: B1 B2 2xB3 and RH (with RH counting as a B3).  \n  \n  \n> with 2 burst 1s and 3 burst 3s?  \n  \nB2 is RH's worst burst, so you typically don't want to use her B2 if possible. and again, this team only works if the fight ends in 1 burst cycle, as RH will have a 40s cooldown",
            "Red hood as burst 1 can be used 3 time without countdown. If a fight needs to be longer than that then she won't be useful.\n\nNormally, she is good last resort burst 1/2 fail save when you burst 1/2 die. I had a fight yesterday when all my other units died but she burst by herself and killed the boss,",
            "save it until using all your silver tickets + spare body selector breaks you through the wall. if you use too early, you can spook the same nikke and waste the spare body selector. use it at the very end when you are guaranteed to break the wall by using it.\n\nsilver ticket shop = all original nikkes (not including alice/dolla/novel)... currently has treasure laplace for a limited time\n\nspare body selector = all original nikkes (including alice/dolla/novel) + helm and laplace.",
            "save it towards breaking the 160 wall",
            "Use it when you only need 1 limit break more to 5 max limit break.",
            "use both as reference and figure it out your roster yourselves. If you want to ask for building advise, just post your roster.",
            "both are solid references. [nikke.gg](http://nikke.gg) was the original reference. prydwen's list is nice as it gives the build up order and pvp investment separately. [nikke.gg](http://nikke.gg) has a short explanation of the reasoning. can use both or either, they should say the same thing in most cases.\n\nimportant things to keep in mind. if new player, non-end game nikkes not used in other content only to lvl 4 max (for just 1 or 2 skills). for non-end game nikkes that can be used in raids or pvp (can bring 1 or 2 skills to lvl 7). would not max out any non-end game nikkes to lvl 10 until you finish building your main endgame story team (crown/liter/naga + two meta endgame pilgrim DPS - ideally RH+modernia... alts include SBS or drunk scarlet). then you can decide on building raid units or pvp units.\n\nfor general skill priority for a team, usually everyone to lvl 7, then endgame DPS to lvl 10 for good skills, then everyone else to lvl 10 for the good skills.",
            "liter / viper / maid privaty / maxwell / modernia\n\nfocus on maxwell and spam uncharged shots with maxwell for fast burst.\n\nskill priority\n\n1. Modernia 7-7-4, liter 7-4-7, maid privaty 4-1-4, maxwell 4-1-4\n2. modernia 10-10-7 (skill1>skill2)\n3. liter 10-4-10\n\nright before you break past lvl 7 health into phase 3, you need to have a burst saved to kill the 1st set of QT circles (if not, teamwipe attack). during phase 3, you can only miss 1 qt circle, so you need to spam burst with maxwell during missed qt circle.\n\ncan try with modernia as nonburst or as bursting. need maxwell (or alice) for fast burst spam.",
            "Disclaimer while my method is loosely based on researched discord guides, I can't guarantee that I followed their recommendations exactly. I'd direct you there if you want to do more reading. This is just what I do and feel comfortable with based on my personal risk tolerances.\n\nI manually dispatch any missions that give cores or credits or at least 25 gems. For treasures I lock in everything except for x2 or x3 beginner kits, or x1 SR box (the RNG openable one). I also pass on any doll mileage x30 or below, but that's up to you if you want to pull for more dolls. After all that, if there are at least 7+ rerollable slots, it's usually worth spending the gems to reroll once. Doing this, mathematically you get about as good of a return on gems as buying out event stamina for hard mode core dust.\n\nWith regards to the shop core dust purchasable with credits, if you do the conversion, you are losing out technically. You are buying 1 or 2 hours of core dust for usually more than 1 or 2 hours of credits, but the idea is that you are always bottlenecked by core dust especially before level 300. If you're finding yourself running out of credits a lot then you don't have to - I find that the deal shows up in the store rarely enough for it not to make a huge difference in the long term. Personally I usually buy it, especially if it's a sale.",
            "for uber whales, they reroll shop for core dust (for credits or gems) until the refresh cost is 400 gems and they refresh dispatch for coredust until the last two slots. this is not 'value'/cost-effective, but basically just trying to get as much core dust as possible.\n\nfor core dust farming, all players should farm hard mode 11 (buy event tokens with gems when hard mode unlocks).\n\nnext best core dust value is extra wipe out (2nd to 4th) and buying core dust in shop for credits/gems without refreshing. you need to minimum be doing all that before considering doing gem refreshes on daily shop/dispatch. you buy core dust with credits because you are always gated by core dust... you only start dipping into credit boxes if you overload extremely heavily (like all your gear fodder), but you still have enough credit boxes to keep up with core dust income.\n\nthen the real money shop, you get weekly core dust, 30 day selector for core dust, 2nd event package on big events for 180 1-h core dust for $20.\n\nthen you are wiping out 11 times... and considering doing gem refreshes on shop and daily dispatch.\n\narnph's policy of reroll daily dispatch once if 7 open slots may be worthwhile prior to getting all the way down here.",
            "If you have to ask, skip. They are like \"meta in 4/5th best team in solo raid but also need a lot of investment/right units to make their team archetype work\".",
            "Think it's safe to assume that liberation is just an abandoned system. It's clear SU won't put good units there and people would rather pull for a unit and have them be good than have a useless unit like nihilister for free.",
            "Nope, it's permanent. ",
            "pre-CP padding buff, OL lines were not added into atk stat. not sure post-CP padding buff, but don't think it adds your OL lines into the atk dmg.",
            "really only crown and rem are worth building. Diesel for treasure.\n\nelegg only buffs distributed dmg (aka dorothy, sbs, 2b, and trony)... but currently dorothy does better in last bullet team, sbs does better on top 1-2 teams (crown vs schoolgirls) paired with alice, and 2b does better with mast and trony is high investment for medicore performance (only excels on fire weak bosses with core and basically just hits around 2b's dmg while 2b is more versatile) so trony is really not worth building. there isn't a top-tier distributed dmg nikke to pair with elegg that is worth running in solo raid.",
            "what is a MG support? B1 & 2s? units that boost MG damage? MG units that provide buffs\\healing (eg Crown & Rem)?",
            "If you mean what I think you mean, then Crown is hands down the current best MG support (yes, technically a defender).",
            "I mean diesel I guess , Emma?",
            "Rem, Crown, Elegg.\n\n2 are hard to get now so yeah. only Elegg available easily,",
            "That's usually a network issue. ",
            "that happens to me when I'm trying to get into the game with weak / bad wi-fi.",
            "bunny alice still has a week to go, so they will probably be added after clay event",
            "No, read the patch notes. ",
            "Only with app store updates they also update the pools.\n\n\nIf its only an ingame update the pools stay the same.",
            "Any team with clay is probably not going to be a \"good\" comp. Rem is a good burst 2 but the true damage \"archetype\" just isn't really there yet. Any team that can consistently full burst is \"functional\" but in terms of being the top 5 or 6 or whatever teams for solo raid? Probably won't make the cut.",
            "clay's downfall is she is 40 second B2. Even with her big atk buff and then true damage buff, the loss of another DPS slot may not make up for it. true dmg doesn't do much more than normal dmg because it just ignores defense and defense already barely does anything.\n\nThe issue with that team is no real healer (rem is a really weak healer unless max OL 5/5 helmet/arms and max skill 1 and then additional skill 2 investment and then still a weak healer) and no CDR. can drop 2nd b2 for either healing or CDR, but will always be missing either CDR or healing on that team (unless running a b3 healer which is a big DPS drop off).",
            "Just walk around everywhere, look at the blue  circle around your squad, it lights orange when you are near it. Should take seconds to find. ",
            "160 of the gold mat to max it, but before then you need a lv15 SR doll on them + 2*/30 bond + complete some missions.",
            "https://nikke.gg/lost-sector-11-walkthrough/\n\nHaven't done it in a while but the 57k is likely for 3 units, when you step on the yellow pad it increases the amount of nikke you can deploy.",
            "The software is not the only thing razer installs though, drivers are also installed and a few services may be running on the background which are detected by kernel level anti cheat engines like nikke uses.\n\n\nAs for what people do... Not using Razer hardeare certainly helps. ",
            "ideally she wants 3 max ammo. 2 max ammo, she still reloads once during full burst (only 14 ammo with x2 68.93% max ammo). also wants x2 charge speed for total 7.18%. ideally, the other lines are atk/elemental.",
            "Purportedly maintenance just started, but I got kicked out about 4 hours ago and haven't been able to log in",
            "Roster continued\n\nhttps://preview.redd.it/687awhmb4p7d1.png?width=2311&format=png&auto=webp&s=541f2c4786a332fb1bb77767b910ad7bd751d1c7",
            "team1: drunkscar / a2 / centi / rapunzel / jackal\n\n\nteam2: Blanc/ RH /Biscuit / sugar / anis\n\n\nteam3: Noise / SBS / Bay or viper / Noir / drake",
            "It's very defending on the power of your units too. A crown with 50-70k power will always better than a Bay with 20k power even for PvP.",
            "there are a lot pf combos depending on your roster/investment but usually a 2-2.5rl scarlet-jackal aoe team, 3rl biscuit stall with sanis, and a 2.5-3rl leftover team that nukes with rh vs maid privaty (with 1-2 atk buffers) vs sbs vs alice vs emilia (paired with either blanc or noah)",
            "https://preview.redd.it/c9ynvdnh9q7d1.jpeg?width=1170&format=pjpg&auto=webp&s=d8a13b606f3826af879fe40ed963efef72d29816",
            "Use the 3 free lv200.\n\nLiter > Volume.\n\nMacarna > Privaty,\n\nAlice > Scarlet RL/Modernia/Privaty\n\nThere you can clear 9 times more a day.",
            "for story: \n\noption1: DKW / rupee (dps) vs centi (burst spam) / drunk scarlet / free privaty / maxwell (for burst spam). free privaty's AOE stun is usually better than laplace's burst. \n\noption2: DKW / rupee (dps) vs centi (burst spam) / drunk scarlet / bunny soda / (either maxwell (for atk/charge speed buff and works as burst spammer) or free privaty (for atk/reload buff). Use centi if running free privaty so you have a burst spammer.\n\nskill priority\n\n1) DKW 4-7-4\n\n2) Drunk scarlet 7-4-7, free privaty 7-4-4 (bunny soda 4-7-4), rupee 1-4-4 vs centi 4-1-4, maxwell 4-1-4\n\n3) Drunk scarlet 10-4-7 to 10-4-10\n\nwishlist: liter, tia+naga, blanc+noir, marciana (b2 healer), maid privaty (alt AOE burst).\n\nfor pvp: rosanna needs high investment to work in PvP on a jackal team (lvl 4 skill 1 to stop jackal feed + lvl 10 burst skill for her B1 nuke + OL 5/5 helmet/arms + multiple atk lines).\n\nProbably would be better off running:\n\nscarlet / laplace / centi / anis / jackal (until you get noah or blanc to use instead of laplace. noah slots to position 1, blanc slots to position 2).",
            "interruption part is the QT circles. core is the red glowing thing in the center of raptures (get bonus bonus hitting it... you will see red core shot dmg numbers if you are hitting the core).\n\nall minions have cores. most bosses have cores (gravedigger doesn't and train has a hidden core below his turret). chatterbox has a protected core (need to pierce to hit but you don't want to break it as it enrages him), modernia's core breaks and respawns sometimes.",
            "[deleted]",
            "You don't need meta tea, especially for your level.\n\nUse Mica, Neon and N102 for burst 1.\n\nSplit your invested unit into 3 team.\n\nGoogle \"Burst generation pvp nikke\" and fill the rest of your 3 teams with those higher tier unit.\n\nI was Top 10 in special arena at your level with similar roster to yours.",
            "Here is few tip to consider:\n\nScarlet+Anis Combo. Plus high burst regen.\n\nFull shotgun team. (maybe +1 dps)\n\nScarlet RL and Alice can be dps in 2 other team.\n\nBay and Noah protection for slower burst team, but you need burst regen to at least cast their s3 before opponents entering full burst to protect again wipe.\n\n  \npower press is a thing so bring the high investment unit with OL gear would be often better than just Meta team.",
            "you don't really have enough units for x3 pvp defense teams. lacking PvP b1s (jackal, noise, rapunzel, pepper).\n\nrookie: noah / drunk scarlet / purple neon / drake / sugar",
            "it is random.",
            ">I have a spare body selector leftover, should I be holding on to this\n\nWith treasure system needing 2LB, I would save silver mileage/selector for a treasure unit you want, the stats aren't very important.\n\n>should I change my standard recruit wishlist to be entirely NIKKEs I don't have\n\nThis is up to you, personally I added the meta pvp and off-meta team nikke to it until I got 1 copy then put back meta units. But realistically it's personal preference if you want collection, small amount of stats or burst screen from MLB from a particular nikke, want units to fill out solo raid teams, ect.\n\n>Is the main focus now to just play small amounts, farm EX gear, let resources build up, and save for limited recruit pulls\n\nBasically, but you'll gain a TON of power from interception once you start overloading gear, getting dolls, ect. Push story with the temp units every day if you can until you cant clear stages even with all 3.\n\n>do people just generally stop doing standard recruit pulls completely \n\nNo reason not to use tickets but generally yeah you shouldn't be pulling with gems besides maybe the daily 1/2 cost one if there are still a good amount of units you want.\n\n>collection items\n\nJust look it up honestly, it's not that complicated.",
            "1. save the spare body selector. Either alice or 2nd star for a meta treasure unit (currently laplace and exia are the strongest treasure units but neither are really OP meta or solidly moves into top 5 raid teams... they release treasure units every 2 months... wait until there is a unit that boosts so that they become part of the top 5 raid team rotation or use on alice). when your alice is fully maxed (10-4-10 + x2 charge speed of 7.18% + x3 max ammo) then can consider using it for alice... but really only if the extra 2% stat bump will help push you to a higher raid ranking.\n\n2. wishlist can now be on either missing raid units or missing pvp units. can keep endgame meta story nikkes for CP padding (liter, naga).\n\nfor you, I would recommend:\n\nelysium: marciana, helm (x1 copy for high priority raiders), guillotine (x1 copy for low-medium priority tower/raids), mast (x1 copy for low-medium priority for raids). vesti (x1 copy, low priority for tower burst spammer). can add miranda (x1 copy for SW team, but that will be a very very low time before you get there), next is poli (low priority raider, rarely used now except in small niches).\n\nmissilis: liter (meta), naga (CP padding for story/raids), jackal (x1 copy for pvp), drake (x1 copy for pvp), pepper (x1 copy for pvp)... swap to maxwell (for dups for stat padding for raids) for the next open slot.\n\ntetra: noir (meta combo), alice (dups for stat padding for end-game DPS), biscuit (x1 copy for pvp), noise (x1 copy for pvp),   novel (x1 copy, low priority raider, barely makes top 5 raid teams, but will be next b2 unit to drop off when powercrept)\n\n3. yes, game slows down a lot. will get worse when you hit lvl 200 where it is 10k core dust per level. basically main power boost is right MF gear for story team. Prioritize leveling MF atk gear helmet+arms to lvl 5 and OL then level OL helmet/arms to lvl 5/5. Note that RH and Modernia and SBS are higher priority than drunk scarlet so may want to wait on OLing pilgrim atk gear. OL gives a big CP boost, so should try to OL endgame meta story units asap (x2 DPS > naga > crown > liter).\n\n4. depends on the player. I pulled regular recruit when still missing raid/pvp units, but now I have basically all the units I need, I've been saving until enough wishlist spots change to new nikkes where it is worthwhile to pull again (waiting for more new elysium units). My endgame wishlist is Free privaty, helm, maid privaty, DKW, guillotine (may swap one spot for diesel for treasure) // liter, tia, naga, maxwell, flex (will do laplace and tove) /// blanc, noir, alice, biscuit (for pvp), noise (for pvp) (will drop pvp nikkes for x1 copy of bunny soda/bunny alice).\n\n5. Put R dolls on all your meta story units. For your main DPS, level the R doll to lvl 15, then convert to SR doll, then lvl to lvl 15. This is a endgame very tedious process. Would recommend R dolls for full story team + SR15 for DPS first. Then consider raid DPS or pvp nukes or treasure nikkes (laplace/exia/diesel). The treasure nikkes aren't so powerful that they get higher priority than meta raid/pvp DPS (RH, modernia, SBS, alice, maxwell, drunk scarlet, s-anis) imo.",
            "1. you can use it for meta (Alice is a good choice) or for someone that you want the lobby burst animation  \n2. up to you, you can aim for collection or you can aim for meta or you can aim for waifu  \n3. that is essentially it. you push as far as you can to increase your passive outpost earnings and then you keep doing your daily stuff until you're able to do more.  \n4. that's what the standard blue vouchers are for. F2P players try to only use the blue vouchers before and after the wall, since gems are better used on the rate up banners to get golden milleage tickets.  \n5. it's an extra gear slot. it's quite slow to get and raise so you'll have plenty of time to read up on it. favourite items also serve as a skill upgrade to their respective nikke (only 4 exist so far). and while they provide a nice boost to those nikke it's not enough to displace the top teams and, again, extremely slow. you'll be too busy giving OL gear to your good nikke's to bother with them for a while",
            "keep leveling the MLB units. stop at 199. reset them and level evenly  once you break the wall.  \n  \n(at 200 you can no longer reset)",
            "can keep leveling kilo and use her to push story. Crown / liter / kilo / free privaty / flex (either maxwell or noir).\n\nwishlist: naga and marciana... rest dups. drop marciana if you pull naga.",
            "For mother whale, units like smol white, dorothy, or modernia can take care of the trash. At your synch level it shouldn't be much of a challenge, what's your main teams cp? From what you have in those pics you can do tia-liter-naga-modernia/smol white-[whatever burst 3] (unless this is hard mode..?)",
            "Tia / Liter / Naga / Flex / Smol White with bastion. Smol white with bastion will autoclear all the minion waves (works fine at 4-4-4, no need to level any higher, may work at lower levels as well). flex slot is ideally RH to snipe the core. Tia will taunt master class raptures. Probably modernia or x-ludmilla is your strongest flex slot. Bunny soda will struggle as mother whale is far range. Core 6 bunny soda is really overkill unless you are a huge whale.\n\nskill priority:\n\n1. tia 7-4-4\n2. Modernia 7-7-4, Liter 7-4-7, Naga 7-4-7, flex DPS (probably bunny soda for normal stages, use smol white for mother whale)\n3. Modernia 10-10-7 (skill1>skill2)\n4. Tia 10-4-4\n5. Liter and Naga 10-4-10\n6. Naga 10-7-10 to 10-10-10\n\nlooking for crown (replaces tia) and RH (replaces your 2nd b3 slot) as upgrades.",
            "you're fine. you have modernia.\n\nwishlist: liter, tia, blanc, noir, dkw.",
            "needs more info.   \n  \nyou're always investing in the synchro device.  \n  \nso you'll need to narrow down your question.  \n  \nyou can play the whole game without buying a single slot. or you can buy as many slots as you want, they are cheap enough.",
            "For campaign, something like Crown/D:KW/Redhood/(Modernia or Alice)/Naga\n\nFor raids, something like Tia/D:KW/Naga/Redhood/(Winter Lud or Maxwell or Alice)",
            "Mainly Red hood, Alice team, as she is better than liter in supporting them.",
            "she is a b1 cdr. so any team if you don't have liter",
            "sadly I dont have tia and alice, ill use her some other time then",
            "\"Red hood can pierce so pull for her poor shit. Or build Alice\" - Dev probably.",
            "use a piercing nikke like RH or max alice or instant screenwipe like drunk scarlet or a good AOE like SBS / modernia.",
            "Idk what chapter you're on but I'm at ch26 and I usually just reset over and over until I can shoot them mid-air since it seems like they got 1shot if you hit them during the jumping animation bit I could be completely wrong",
            "N102, Neon, Mica, Belora defending on if you lacked good units for special PvP or not.\n\nNeon is the most used of the bunch with clips SG.\n\nEdit; Special mention, Ether if you need a defender burst 1.",
            "Delta has had like one or two raid showings as a taunter and damage sponge. Not worth a permanent slot though.",
            "none. really should just be anis.\n\npurple neon is if you have no other PvP b1 options, but when you have 3 of (jackal, noise, rapunzel, pepper, and RH), shouldn't be using her.\n\nn102, mica, belorta are slow RL burst gen. should be using faster RL or clip SG for burst gen instead. if you are using those units, you don't have enough pvp units... probably just swap to a CP padding team instead.",
            "story = DKW / marciana (if healing needed) vs purple anis (for burst spam) vs viper (for dps placeholder) / kilo (aoe) / modernia (aoe) / noir (atk/ammo buff)\n\nalice needs high investment to work as carry bursting DPS in story (aka 10-4-10 skills + full OL with x2 charge speed of 7.18% and x3 max ammo)... not going to be able to use her as a carry bursting DPS early to mid game.\n\nskill priority\n\n1. DKW 4-7-4\n2. Modernia 7-7-4, kilo 4-4-4, noir 7-5-4, marciana 4-4-4 vs purple anis (don't invest) vs viper (don't invest)\n3. Modernia 10-10-7 (skill1>skill2)\n\nsave skill mats for better untis.\n\nwishlist: liter for B1 upgrade, Tia+naga for schoolgirls combo, blanc (for blanc+noir bunny combo), maid privaty for alternative B3 AOE, centi for placeholder B2 burst spam (upgrade over purple anis).\n\nrookie pvp \n\n* option1: 3RL free privaty AOE stun nuke + noise HP buff: noise / Free privaty / purple anis / noir / sugar\n* option2: 2.5RL free privaty AOE stun nuke (faster team): pepper / free privaty / purple anis / noir / sugar\n\nnot enough good pvp units for x3 competitive SPA teams. Missing 2nd and 3rd team nukes.\n\n* team1: 3RL free privaty AOE stun nuke with noise HP buff: Noise / free privaty / viper / noir / Sugar\n* team2: 3RL biscuit stall with invul ludmilla taunting single target nukes + alice nuke: Ludmilla / Pepper / Biscuit / Alice / Purple Anis\n* team3: you are out of PvP units. stack the highest CP team that can burst",
            "Copium shotgun team: D Killer Wife / Leona / Noir / Sugar / Anis\n\n\nAlice is not great until Overloaded equips and high skill levels, so she's out until then.",
            "DKW / Purple Anis (burst spam) / Alice / Sugar / Noir.\n\nYou have B1 CDR with DKW. Focus on purple anis during nonburst and spam her shots for fast burst gen. You are lacking good AOE clear nikkes. Alice is late-game unit, needs high investment to do well. Sugar is close range SG with single target burst. Both will struggle in story early to mid game. Noir is a really good nonburst buffer (atk/ammo buffs) and she has a weak AOE burst, can try using her burst if needing AOE clear.\n\nComplete the 2 week day-by-day quests ASAP. Free privaty will be an upgrade AOE stun burst that can help carry your team.\n\nskill priority\n\n1. DKW 4-7-4, Noir 4-1-4 to 4-4-4 to 7-5-4, free privaty when you unlock her 4-1-1 to 4-4-4 to 7-4-4. no skill investments in any other units. they will be replaced.\n\nwishlist:\n\n* elysium: maid privaty (AOE burst option), free privaty (dups for 160 wall, will get copy with day-by-day quests), marciana (b2 healer placeholder), helm (b3 healer), probably DKW for last slot for dups for 160 wall\n* missilis: liter (b1 upgrade), tia+naga (schoolgirls meta), centi (b2 burst spam placeholder), pick between maxwell or drake for last slot. Maxwell is late game unit (top-tier bossing/raider when highly invested, can be used at low investment as nonburst buffer for atk/charge speed and burst spam). Drake is an early-mid game unit (nonburst atk buffer) and used in PvP as fast clip SG burst filler\n* tetra: blanc (for bunnies combo with noir), bunny soda when added (aoe burst option), probably noir for dups. x2 flex slots (can consider rupee for placeholder B2 dps unit for story, alice for dups, sugar for dups, or volume/dolla for CDR for raids or noise/biscuit for pvp).",
            "Congrats! I think I'd make the switch. After bringing her skills in line with other other units. (4/4/4, then eventually 7/4/7-> 10/4/7), Scarlet will likely outperform Privaty in most situations. None of your other units particularly benefit from Privaty's mag debuff skill too (although the team ATK boost will be missed). Overall should be a net positive though. I would keep Privaty in your back pocket for those stages where you'd really benefit from her stun on burst, like stunning a group of mobs who charge up for a OHKO kill on multiple Nikkes, she sometimes sees sporadic use in early-mid campaign depending on your other units. Scarlet will start performing even better once you unlock OL gear and get her several lines of Max ammo (although you should probably focus on overloading Redhood first)",
            "yes.\n\ndrunk scarlet to 4-4-4 and focus on RH to 7-7-7.\n\nThen drunk scarlet to 7-4-7, then naga 7-4-7. then RH 10-10-10. Then drunk scarlet 10-4-7 or 10-4-10 (lvl 7 is sufficient to screenwipe in story). Tia 10-4-4. Finally (liter if you pull her to 10-4-10) and Naga 10-4-10 to 10-7-10 to 10-10-10.\n\nLiter is better than DKW / dorothy is better than volume. if you pull Liter, go 7-4-7 in step 1. if you pull DKW go 4-7-4 in step 1. if you pull dorothy, 7-4-7 in step 1. if you pull volume 1-4-4 in step 1.\n\nFor pilgrim OL gear, OL RH first. consider delay drunk scarlet OL gear as Modernia and SBS are higher priority and more useful in story mode. SBS is more useful in raids. Drunk Scarlet OL is mostly for PvP.",
            "Use Tia / Dorothy / Naga / SBS / RH.\n\nSkill priority:\n\n1. Tia 7-4-4\n2. RH 7-7-7, SBS 7-4-7, Dorothy 7-4-7, Naga 7-4-7\n3. RH 10-10-10\n4. SBS 10-4-10 to 10-7-10\n5. Can consider Dorothy skill 1 to lvl 10 for faster CDR (or save those skill mats for Liter>DKW)\n6. Tia 10-4-4\n7. Naga 10-4-10 to 10-7-10 to 10-10-10\n8. Can consider drunk scarlet to 7-4-7 to 10-4-10 for alternative DPS (helpful for chapter 27-28 electric weak stages and helpful when you need instant screenclear to beat a stage).\n9. Can consider Alice to 10-4-10 all at once if you can full OL alice and reroll for x2 charge speed (7.18%) + x3 max ammo. Wait until you can full max Alice all at once. her huge powerspike is after full max when she unlocks 1-frame manual spam without needing to reload during burst. Prior to that she will not work as endgame carry DPS.\n\nwishlist: liter and DKW, they will usually be more useful than dorothy in general story. Liter has faster CDR than dorothy (unless doro skill1 maxed to lvl 10), big atk buff, and cover repair. DKW has fastest CDR in the game and piercing sniper buffs for RH and general dmg buffs.\n\nIf you get crown, replace tia with Crown 7-4-7 in step 1 to 10-4-10 (with liter) to 10-7-10 to 10-10-10. If building crown team, can delay naga skill 3 as she is nonburst on that team so she goes 10-4-4 after crown 10-4-10 and lastly she goes 10-7-4 to 10-10-4 after crown maxed.",
            "You would log in with the +9 every time.",
            "You only have one B3 on that team so cannot go into 2nd burst at 20 seconds.\n\nCrown / Liter / Free Privaty (AOE stun) / Kilo (AOE burst) / non-burst either Noir (atk/reload speed buff) vs maxwell (atk/charge speed buff and can use her as burst spammer) vs bunny alice (can use her as healer if healing needed and she will proc crown's skill2).\n\nSkill priority\n\n1. Crown and Liter 7-4-7, Free Privaty 7-4-4, Kilo 4-4-4, Noir 7-5-4, Maxwell 4-1-4\n2. if you pull meta endgame pilgrim DPS, they max out here (RH vs modernia vs SBS vs drunk scarlet)\n3. Crown and Liter 10-4-10\n4. Crown 10-7-10 to 10-10-10\n\nwishlist: Naga (for upgrade nonburst flex slot, she is a healer that procs crown's skill2 + gives cover repair + gives core dmg buffs, she is BIS pairing for crown). Marciana (nonburst healer that procs crown's skill2, not as good as Naga, but decent if needing healing). maid privaty (alternative AOE burst B3).\n\nMaxwell needs high investment to nuke elites/bosses, but she will struggle in story stages that need more than 2 burst cycles as only single target burst. She is more a raiding/bossing nikke. would recommend leaving her low investment as a nonburst buffer instead. She needs 7-1-7 or 10-1-10 + OL gear to be effective boss nuke.",
            "Another thing, you should only level 5 Nikkes, and use the [Synchro Device](https://nikke.gg/synchro-device-and-leveling-guide/#Synchro_Device) in your outpost to sync other Nikkes you want to use.\n\nSo choose 5 Nikkes you will likely use in the main campaign, and reset everyone else's level (you can leave the ones that are under lvl 50 if you want to save some gems). Then with the resources you get back you can probably get your main team to 130.\n\nYou can unlock more synchro slots from the Tactics Academy.",
            "just spam requests in the nikke game.",
            "Crown / liter / modernia / pick 2nd strongest DPS (ideally want RH in this slot) / flex slot: helm if healing needed/also can burst spam with her vs noir for atk/ammo buff (ideally want naga in this slot)",
            "likely next update",
            "useless now.",
            "Raptillion is from side quests throughout the early game. He's a Rapture enthusiast who built himself a suit to interact with them... somehow.",
            "it's the content creators that make that kind of dumb ranking system.\n\nrealistically, you can just do a normal S tier to A tier to F tier. it is just a way to make trash units seem less trashy by ranking them C/D. realistically all the C/D tier nikkes are already F tier (aka worthless)",
            "Nikke doesn't use tiering. Nikke content creator websites do, in particular prydwen which people have numerous gripes about. Take it up with them.",
            "My dude, sorry to hear, but this isn't that unlikely. There are 6 different weapon types. The chances of getting 11 dolls in a row and no MG is about 13.5%, which is about as likely as doing 5 multis with no SSRs. \n\nIs this for Modernia? If you are in a huge rush, then I guess you can use your selector box if you want. On average you'll have to use a good amount more instances of beginner maintenance kits to max it out if you don't use an R doll first, but if you're okay with that, you'll be able to give her a power boost right away rather than waiting for an R MG doll. Consider if this is really worth it for you right now though - will the immediate power gain allow you to meaningfully push campaign/raids enough so that it's worth using your selector and more upgrade kits and potentially delaying another Nikke from also getting an SR doll?",
            "I didn't even use that trick for my Scarlet and Red hood and I'm doing fine. You only really need to upgrade the doll level if you want to get their favorite item. So unless you are Diehard fan of Diesel you are fine.\n\n\nAnd it's all luck in the end, the R has higher chance to trigger crit upgrade but fill less of EXP when trigger. ",
            "With enough time, I wouldn't be surprised if it eventually happens. I mean we did just get Crown, which is a step in that direction.",
            "Yeah",
            "Make sure her attack isnt higher than your dpses\n\nSince she'll take the buff instead from skills that buffs highest attack like Maxwell etc.",
            "7 hours after next daily reset",
            "That's like asking what are the best five colors to paint with. It highly depends on your personal roster, investment, and most importantly the boss that is featured that season. There are common archetypes that see consistent use. You want Blanc/Noir team, a Tia/Naga team and a Crown team. DPS's will differ depending on the elemental needs. Other archetypes that see niche use are a last bullet team (Dorothy/Scarlet/SummerAnis with Marciana or Biscuit/Poli), Snow White team (usually with Miranda/Yulha and other flex supports) and the new Shotgun Team (Tove/Leona/BunnySoda/MaidPrivaty/BunnyAlice). You can browse here for more team comps from the top players: https://enikk.app/soloraid",
            "Depends on the boss, check the bosses element and use a main dps or a subdps to counter the element. Support cores are isually pretty same so just build a few good b1 and b2 units and mix them depending on the team.\n\nIf you don't like thinking and reseaching then look into these:\n\nBurst 1: Liter, Tia, Dorothy, Volume, D killer wife, Mica Snow bunny and Miranda\n\nBurst 2: Crown, Naga, Blanc (only use her with Noir), Dolla, Guilty, Helm aquamarine and Marciana",
            "typically it changes slightly depending on the boss, but the current meta core raid teams are\n\n1. crown + rapunzel OR crown + free privaty: sample: crown/volume/SBS/max alice/rapunzel\n2. schoolgirls tia+naga: sample: tia(minimum lvl7 skill1)/b1cdr(dkw)/naga/RH/x-ludmilla\n3. bunnies blanc+noir - sample: (b1cdr except for dorothy) = liter/blanc/maxwell/noir/modernia\\[nonburst\\]\n4. dorothy/flex b2(marciana for healing vs novel for dmg taken vs rem for dps)/s-anis/drunkscarlet(or biscuit if needing more surviability)/free privaty\n5. either SW or SG team:\n   1. SW team = miranda / dolla / b2 buffer (novel) or b3 healer (helm) / SW / yulha (or maxwell)\n   2. SG team = Tove(lvl9 skill1)/leonna/bunny soda/maid privaty/flex slot: alice for healing or drake for atk buffs\n   3. random team = pepper/dolla/pick three DPS",
            "Red Hood and D are both top tier, congrats! With those two, you already have a really amazing start for your pve teams. Bunny Alice is ok too, but I'm not sure she'll see much use outside of solo raids.",
            "I see, thanks for the advice!",
            "Thank you for the advice! I'll definitely be holding onto my gems from now on haha.",
            "Fantastic analysis, thank you! I'll add some additional info.\n\nMy synchro level is 275.\nI have almost all characters except a few from the last couple of banners (Rem, Alice:WB, Tove, Elegg, Trony, Nero, Leona, etc).\nI tend not to chase meta builds and instead build around waifus or characters I like (booba). \nIt would be enough if Liter's replacement only had nice non-burst skills or passives.\nI will definitely have a closer look at using Privaty! Thing is, I'm quite fond of my burst rotation. Modernia brings the dps during the first burst and then Helm heals when Modernia is on cooldown. So it might be a bit difficult (though not impossible) for me to let go and change it up.",
            "How long would it take to do those F2P?",
            "thanks, probably I've done wrong so far,  im not using a lot of my pve units (Liter, Crown, Modernia, Naga) and CP difference is sure >20%",
            "thanks a lot, sadly i dont have noah or biscuit (i found Jackal a couple of weeks ago), and im not a very fresh player (i've already ended normal campaign)\n\nwhat does 2-2.5rl mean (rl should be rocket launcher)?",
            "> Azur lane  \n  \nand later added augments, which is really similar to the dolls system. (generic blue\\purple variants for everyone - add a small number of ship specific gold ones that provide a buff to a single skill. some strong, some trash) - but also completely different in that there is no RNG to craft them and no new art",
            "Thank you! Now I'm off to the grind!",
            "thanks, and yeah it doesn't matter, im just figuring out what am i missing",
            "I uploaded a video of it too, but it seems like it's core spot is almost just completely broken and isn't working properly",
            "I am breaking the shield with iron units, the hitbox is just fucked from what I can tell",
            "I couldn't hit it with redhood or alice consistantly when there were minions, so either it doesn't work like that, somthing is wrong with the boss or I'm just completely missing something.\n\nBut I'll have to make do with not hitting the core from now on I guess.",
            "for PvP, should order noise / maid privaty / blanc / anis / jackal. want two highest atk nikkes (noise and maid privaty in P1 and P2) to trigger jackal's feed and jackal in P5 in case they are dumb enough to use SG against a jackal team. Noise taunt's so on the edge like P1 is best. You want noise to burst over jackal, so noise to left of jackal.",
            "👍",
            "Thanks, would I replace with bunny Alice or the original one?",
            "For who?\n\nThere’s 5 of them on a rotation, remember?",
            "Yeah i do change some piece pretty much every day atm , im at Chapter 15-21 with a 23% deficit so im stuck with the 9 lvl 200 i can borrow atm.\n\nI will wait until t9 then , thanks !",
            "She wouldn't be primarily run on a Privaty team, so the max ammo is important. I'll keep this one like this at least for now then, thanks!",
            "Just gonna pull on limit like i wanted then ! Tyy",
            "Thats definitely true , just dont know how long its gonna be 120-160 since 0-120 was really fast. Ita gonna be ike what , one more month until 160? But yeah im just gonna save and see later where im at !",
            "I will ! Ty :)",
            "Yeah that makes sense, you can still progress your Nikke a lot even at the 160 wall and just accumulate ressource in the meantime.\n\nEveryone on my wishlist are people i already own beside 3 (Noir blanc and Naga) Which i think could help me a lot if i pull them and lets be real they look peak.\n\nty :)",
            "Thanks!",
            "https://imgur.com/xfW8izq\n\nTook a vid because I feel like I've checked everything\n\n-event story mode + hard mode fully clear + attempts used\n\n-challenge mode fully clear + attempts used\n\n-minigame have all rewards + daily done\n\n-all hidden items found\n\n-all log in rewards claimed\n\n-all daily + 2nd tab challenges cleared and claimed\n\n\nThis has been happening for every event for me iirc, the unread marker doesnt go away",
            "thanks, I was curious how the naga thing would work. would it be better to bring bunny Alice to make sure crown is always getting procced? or is naga still a better choice",
            "very helpful, appreciate it",
            "My main story team right now is Liter, Centi, Modernia, Privaty, and Alice, all dolled. I started on the last day of the Trony banner and still need to replace Alice something fierce, which makes me think that Volume should be on my story team (I could be dead wrong, but she is much higher CP than any other options except maybe Rapunzel or Marciana).",
            "right thats an option too. \n\nI was tunnel visioning to B3 only because of Drunk Scarlet, but I guess I can also run two B2. \n\nI'll try it in shooting range for now.\n\nThanks",
            ">Any electric DPS that can make good use of S.Anis's Atk and Reload speed buff will do. (Which is only Maid Priv or Guillotine that are meta? Maiden can work as just an auto attacker, idk about Haran or Isabel)\n\nMaid Privaty is on my SG team so shes out of option. And I dont know about guillotine, I just dont like how she need low HP. For now I'm gonna try using biscuit I guess.\n\n>Also to share in case you were not aware, Dorothy and Privaty has seen more usage in the Crown/SBS/Alice team recently (Looking at recent 2 solo raids).\n\nI am, in fact, not aware of this. My guess is privaty is used for infinite ammo alice tech with privaty+crown(?) but why would doro is used too? and does that mean last bullet team is not the 4th team anymore?",
            "https://preview.redd.it/nuysfby5d97d1.jpeg?width=1080&format=pjpg&auto=webp&s=05f584ee4b7c313f9f9c5018e6655d9ab9574f7c",
            "This is the current squad that I went with last time I asked",
            "I did see a video with the meta team at the time cussing and screaming and that sure made me feel better. They were probably at a greater deficit but knowing even RH meta users hated it helps!",
            "Thanks.",
            "Thanks. Was just wondering, cause I got hood, scarlet, bunny duo and liter and fail.   \nThe other player has hood, modernia, crown, naga and liter and is stuck or doesn't push.",
            "I might do that lol, so if I get Volume who should she replace on the team? And I really like Anis so I’d like if she stayed for as long as she can haha",
            "Who would you say is good to replace Julia? I was told to pick either her, Rapi, or Mihara so I figured she was decent enough haha",
            "this is really good advice. would use the team he recommended. Volume/Naga/Privaty/MaidPrivaty/Maxwell. SG teams do not do great in story because they are limited to close range and story stages has a wide variety of ranges.\n\nskill priority\n\n1) Free privaty 7-4-4, maid privaty 4-1-4 or 7-1-7, maxwell 4-1-4, naga 4-4-4 (or 7-4-7), volume 1-4-4\n\nwishlist: liter, dkw, tia, blanc, centi, marciana",
            "You can only use two B1s on low cooldown,  not 3. And her B1 is actually stronger than Liter's for damage,so you either want to start with it on spammy stages or use it during the boss.   Her B2 is what is  only used on extreme cases.",
            "Ahhh, so thats it. Bad fucking luck that my 3 main dps are all non ogs ;-;\n\n\nThanks for the answer, that was definitely the most helpful one. ",
            "Thanks , will try that tomorrow !",
            "I appreciate the perspective. Which discords are you in? I currently am not in any but am interested.\n\nI ended up just making my own spreadsheet and came to basically the same conclusion of 7 bad dispatches = reroll. Why do you keep credit boxes though? I cannot imagine a world where I am low on credits, since my fodder cannot keep up with my credits as is. I guess I am below 250 synchro and credit costs increase at 251+ and 301+. I kinda have trouble evaluating how much value you are getting from rerolling dolls though, since it's a new system, your strategy makes sense to me though.",
            "Hmm... Are you perhaps omitting the gem recouping that occurs with dispatch refresh? The original strategy involves (along with credits/cores) locking in all the gems upon daily reset, regardless of the number of gems. When you refresh the dispatch slots with 50 gems, not only are you expected to get a certain amount of core dust proportional to the slots refreshed, you \\*also\\* are expected to get some gems back by virtue of simply rerolling into more gems. \n\n  \nThere's a good calculator here written by Prydwen writer Kisenix [https://docs.google.com/spreadsheets/d/1t\\_OTPCzEklWK5OQ6YzmpnCanfUWxprEivrDUpSLKeoc/edit?gid=0#gid=0](https://docs.google.com/spreadsheets/d/1t_OTPCzEklWK5OQ6YzmpnCanfUWxprEivrDUpSLKeoc/edit?gid=0#gid=0)\n\nIt basically shows that at 7 dispatch refresh slots, you are expected to use 13 gems (50-37 recouped) for an average of 1.52h of core dust. An overall value of 1h core dust for 8.7 gems, which is only rivaled in value with the event stamina buyout. Extra wipeouts already cost 25 gems per 1h of core dust. Of course, the fine print here is that you are reliant on RNG, so you would have to do this consistently over time to converge on these values.",
            "I disagree on your priority list. Here is the personal math I did on dispatches.\n\nFor dispatches, I assigned each individual dispatch a \"gem-equivalent\" value. For core dust, you'd have to value it between these numbers: **1h=5gems** (buying stamina), **1h=11 gems** (equivalent to buying 30 day resource pack, and comparing to special recruit pack 1 at $20 = 20 pulls = 6k gems, and $15 = 1210 gems +300h dust, gives 1h core dust =11gems), or 1 wipe out at 50gems = 2h core dust, so **1h=25gems**. I then gave credits a \"gem value\" of 1/4 of core dust, because like you said you'd pay 150k credits for 1h core dust, which for me personally is ~4h of credits. I then did some math on molds and some relatively conservative estimations put 1 SR mold at 5 gems and 1 SSR mold at 15 gems.\n\nSo from there, you'd take the average of your 1 dispatch, and then reroll if it is below that average. Then see how many rerolled dispatches you'd need to reach 50 gems. For me this was about 7.\n\n[Here is the math with a value of 1h core dust = 5 gems](https://cdn.discordapp.com/attachments/609963920056254467/1252804715423469578/image.png?ex=66738cd0&is=66723b50&hm=8015309fc5e2613c5d34f8f3b4ff30723fdb5e743e44ed8f1a0fa7678140395c&)\n\n[Here is the math with a value of 1h core dust = 11 gems](https://cdn.discordapp.com/attachments/609963920056254467/1252804895304843264/image.png?ex=66738cfb&is=66723b7b&hm=09231b882f240dd180a837bf0259b20d6aa7314f5c8843dd0302525c223314ee&)\n\nThe number at the bottom is the average gem value you'd gain from rerolling X 0 value dispatches. With the first it was 7 bad dispatches and with the second it was 6 bad dispatches. This isn't even taking into account collection dispatches at all and I'm not even going to try to assign gem values to such an abstract system. I know this isn't perfect and you may disagree with my assumptions but I think this logic is sound.\n\nI do not understand the logic of doing even 1 or 2 wipeouts for core dust. If you are a paying player in any way focused on value, wipeout at 1h core dust = 25 gems is way way worse than monthly resource pack at 1h = 11gems if you'd be spending a small amount of money to get the best packs at 300gems/dollar otherwise. I understand that once you start going past the \"best value\" packs for pulls/gems the pulls/gems per dollar go down fast. But personally I would never buy them so that's what my math assumes.\n\n[Here is the link to the google doc](https://docs.google.com/spreadsheets/d/1aGk1-82NFQrSlCuHBZ0zkDif6C05kVT1_gk7HbiVqP8/edit?usp=sharing)",
            "I wouldn’t say they’ve abandoned it, but it does need a rework.\n\nPutting heretics in there seems to have been their intention(such as indivilla), but that’s such a waste of potential if the units won’t be good ",
            "oh hell yeah, thats fucking sick!",
            "I forgot about Crown (maybe cause I keep using her), is there like a specifically MG supporter? Like they only buff MGs? I don’t think we have one do we?",
            "I mean I guess? When I think of a buffer, I think of Liter, Crown, Naga & Tia, Blanc, or how shotgun users have so many buffers or supporters (Tove, Bunny Soda and Alice)",
            "found it, I'm dumb. been trying to find it for the last couple of days, began loosing my mind. btw now that I've done the event fully can I rewatch it  somehow. I saw archive pop up on main menu for 1 sec and now its gone and it needed some special currency.",
            "quite a lot , but i guess it's like the prison liberation thingy",
            "I didn’t particularly want to resort to buying another mouse just for Nikke. A Razer (or other brand that uses similar software) is hardly uncommon, and I had thought those people may have found a solution that isn’t “buy a new mouse”.",
            "Thanks",
            "No Centi :( Probably just sub in Crown for that spot",
            "got it, thank you so much",
            "You have a good comp already, could replace privatey for a healer like marciana or bunny alice which helps you stay alive + procs crowns damage buff. But as the other comment said using your temp nikke will help a ton.",
            "Thanks for this! Tragically I've just pulled Liter and am gonna have to rejig, would Liter be a straight swap for DKW in these?",
            "im hardstuck plat 2 in val",
            "Okay thank you for the information, I'll have to read up on treasures",
            "Wow a very thorough writeup!  Thank you so much, it's late today but I will read this more thoroughly tomorrow and adjust my recruit wishlist :)",
            "Thank you for the reply and information ^^",
            "It's normal mode. I've tried a few different teams and keep getting wiped out after about a minute. I have no clue what I'm doing wrong. I'll try the combination you mentioned. I believe my CP is almost 300,000. 270 something to be more exact.\n\nEdit: It worked.... smh. I was stuck there FOREVER.",
            "Oh i wish i could just pull RH.",
            "I am using SBS/Modernia with Liter/Crown/Naga since i don't have RH and drunk Scarlet and Alice is low investment for now. ALso because how modernia works it takes a while to start her up by wich time is alredy too late and someone is dead.\n\nAnyway got stuck on 26-25 and judging by post gone be there for a long while.",
            "At ch26, I just stopped if auto doesn't solve it lol, no time to manual now when it makes little difference in the long run. The increase in outpost resources isn't much after lv177 and 200 to warrant try hard for.",
            "They still Regen faster than randomunits of other weapon. And they don't feed scarlet. Especially Mica, idk how but she Regen better than N102 and Belora according not Prywen and GG list.\n\nAt newly break 160 wall player won't even have enough units for CP padding team as they don't have many units with OL. You don't really remember much about 160-180 don't you? That's when purple units being used for Pvp as non OL gear can be changed. \n\nI was top 6 in special PvP with purple at around 160-180. Only switch to CP padding team when I actually have them at around 200.\n\nTL;DR: Don't Tell people shit you don't know.\n\nEdit: Disclaimer that what I said is only for those who break early and compete for the top spots. If you broke wall late and already had many units with OL ready then that's not for you.",
            "There's a Modernia there hidden on the bottom left",
            "As in my Nikke account AND my google play account would be the +9 one or just the Nikke? One of the guides said something about linking it to a different google account after you get a roll you're happy with but I'm wondering if that's true or not. I'm fine if the Nikke account itself says it's the +9 account in game but I want the actual googleplay account I use to get other games and make payments to be the same.",
            "Wow! This is such a detailed and thought out response that educated me on something I never knew. Thank you so much for taking the time to respond. I'll be putting this into action right away :)",
            "Wait,then how to get their spare bodies? I saw you can buy for Nihilister in union shop but what about others?",
            "How do I do the side-quests and are they important story wise? I feel like the story has been pretty self-contained so far I've never had something happen that I didn't understand but now a character just pops ups that I've never seen before.",
            "Should have clarified content creators/sites. Obviously the game itself doesn't tier the units.",
            "I mean fair enough, but it’s not full Jack-O. I kinda want a sniper who is shooting from lying down position but in Jack-O pose",
            "I think I spent all of my luck though. I play Honkai Star rail too and I'm probably gonna get shit rolls there to balance it out 😭 I'm happy to get more units though. And good ones on top of that.",
            "You should be able to full clear hard mode with the temp nikke. They have unlimited uses in events. If you do buy stamina use it on the 4 core dust stage (hard mode final repeatable stage usually X-11)",
            "Oh! Well given that information, from a meta perspective I probably would suggest a high damage dealing DPS like Redhood then. I only mentioned Privaty since in the absence of a roster, I just made the safest assumption regarding your available choices, with everyone obtaining Privaty from the Day by day missions eventually. \n\nIn spite of that, if you're here to just enjoy your specific waifus, then I salute your dedication - no one here can really take that away from you. If you're still working your way through the main campaign, just know that although you could progress faster with a meta team, any useable team is capable to clear the campaign with enough combat power, so it'll just be a matter of grinding out the levels.",
            "that team is a bit weak compared to the best team you can build.\n\nNaga as nonburst can act as a healer that also crown's skill2 and gives cover repair and core dmg buffs... she will be much stronger than a bursting helm. Then you have a free B3 slot for a powerful B3, ideally RH.\n\nwhen you get stuck, can consider trying a normal endgame meta team (if you can spare to invest it) and you will see the big power difference. Crown (7-4-7 to 10-4-10 to 10-7-10 to 10-10-10) / Liter (7-4-7 to 10-4-10) / Naga (7-4-4 to 10-4-4 to 10-10-4 to 10-10-10) / RH (7-7-7 to 10-10-10) / Modernia (7-7-4 to 10-10-7)\n\nSkill priority is everyone to lvl 7, then RH and modernia to lvl 10, then crown and liter to 10-4-10, then naga 10-4-4, then crown 10-10-10, then naga 10-10-4... can max naga for cp padding, she is nonburst so can delay skill3 until you build schoolgirls raid team.",
            "Depends on how early you prepare for it, but, average probably 3-4 months +/- 2",
            "You get 1 free MLB every 6 months. So the longest should be 2 years and a half if you do not pull at all or absolutely shit luck. \n\n\n Clearing up to ch19 should be doable without breaking wall 160 should generate around 200 silver credit. Also the free box dupe from ch17. That's 2 ticket to another 2 MLB should your luck being super shitty and ended with many 2 limited break after hundreds of pull. Plus, golden tickets + Hundreds  of pull if you willing to save for a MLB. You can also get nearly enough for 2 MLB the free \"bait out of jail\" from guild point units in a year. \n\n\n\n\n All in all, the longest would be 1 years if your lucky being absolutely shit and you invest everything you have to it, including guild points. But I would wonder why you are still alive with that kind of luck.",
            "speed of burst (# of rocket launcher shots before burst). 2RL is bursting at 2nd rocket hit. 2.5 is bursting between 2nd and 3rd rocket hit. 3rl is bursting at 3rd rocket hit.\n\nread this if you care about learning more about pvp: [https://www.prydwen.gg/nikke/guides/pvp-intro/](https://www.prydwen.gg/nikke/guides/pvp-intro/)",
            "Yes, when there are minions, there is a shield around the core that blocks your hits. need to kill minions first. RH should pierce through as iron weak. alice probably won't.",
            "Sure sure man. I didn't really mind the order just listed the unit. But you should have replied to the first comment instead. Upvote for the effort hope they read your comment.",
            "Original alice",
            "for all of them. you will be using the same support core (crown/liter/rapunzel) for everything because that is your strongest support core if you need healing (blacksmith, chatterbox, modernia all probably need healing at lower levels)\n\nfor gravedigger when you don't need healing, can drop rapunzel to run x3 dps (maid privaty, free privaty, maxwell - either free priv or maxwell as nonburst).\n\nfor train, you likely need better DPS to full clear. widescreen mode, kill right side turrets/missilis launcher before they go off screen. need to kill missile launcher before it shoots. can retry for turret miss glitches (every 3-6 times). need to kill turrets within 2 burst cycles with miss glitch. without miss glitch, need to kill turrets before they shoot.",
            "for last raid, the highest DPS team was crown/liter/sbs/alice/free privaty so it is possible.\n\nfree privaty with last bullet team, but if your summer-anis has lvl 9 skill 3, she can run without free privaty.",
            "I can't remember how long it took me and there's not a linear relationship between the resources needed and the time (because you've got higher outpost income, etc) but [this calculator](https://nikke-db.pages.dev/tools) shows the cost of leveling from 120 to 160 at roughly 4 times the cost from 1 to 120.",
            "Note that once you reach the wall, the game does give you some limited 3 usage a day units for Story and Tower so you are not 100% stuck once you hit the wall. They give you a 10/10/10 Liter and Alice so it will help you out a lot.",
            "oh, that is just from the event notification. click into the event notification banner and it should go away.\n\nalso, if post-lvl 200, should skip buying battle data boxes... just get more 30 core dust.",
            "Naga>bunny alice (and all other healers) for crown because naga also gives cover repair + core dmg buffs.\n\nrunning two healers on any type of team is too much DPS loss. will not have enough DPS to be able to clear.",
            "no, liter is much better than volume even if volume has higher CP.",
            "I can test Guillotine for you when I get off work.\n\nEdit: But only can test outside of S.Anis team since I dont have S.Anis. I'll test Guillotine vs Scarlet directly in a team with and without healer (So at low HP and full HP)\n\nThe Doro/Crown/SBS/Alice/Priv team is either Team 1 or Team 2 now. \n\nI'm not sure where if the S.Anis Electric Team dropped to since S.Anis was not used much by the top rankers during the GraveDigger SR since the Shotgun Team outperformed it (B.Soda being Iron was big for this SR)\n\nThe reason Doro Privaty found its way into that team is because of this train of reasoning. \n\n1. SBS + Alice is the highest DPS B3 combo in the game currently.\n2. SBS and Alice both have huge Atk% Self buffs, so to fully utilize it, they needed a multiplicative effect. Crown (Atk Damage buff) or Blanc (Increase Damage Taken) were the candidates here. Crown was the better option since her buffs were stronger and allowed for more team flexibility.\n3. Now the B1 and 5th unit spots to further buff the duo is even more limited since Atk% and Atk Damage buffs were mostly covered. Privaty's reload speed was another way to buff the team when paired with Crown's own reload speed buff. (More hits for Alice and SBS to fit in during their burst window with instant reload). \n4. Now B1 needs to be a CDR unit, and Liter was not as good since Crown/Priv both have Atk% buffs as well as Alice and SBS's own massive self buffs. \n5. This pushed our CDR options to Dorothy or Volume since KW:D doesnt work well with SBS/Alice.\n6. Volume buffs just performed worse since Crit scaling in this game is not very good. The crown and privaty buffs on the other hand were big for Dorothy's personal damage. So Dorothy ended up as the B1 slot. \n\nThings might change though since Crown hasnt been out for long. We might see the teams evolve again with summer coming soon.\n\nIt might also change depending on the boss itself since the highest DMG version of this team against Gravedigger was actually Crown/SBS/Alice/S.Helm.\n\nBut that is only because S.Helm's increase damage taken for enemies weak to Iron was a multiplier in this equation and she didnt need to burst.",
            "https://preview.redd.it/wihpkqe3tb7d1.png?width=664&format=png&auto=webp&s=99f4de5d00c0984e8a8cb29d8ff5ff44c7db267c\n\n  \nTesting methodlogy:  \n1. Testing was done on Union Shooting Range (3 Min Boss, Fire Weakness)   \n2. Dorothy, Crown, Scarlet, Guillotine were using level 8 reload cube in all 4 runs.  \n3. Crown here is to simulate S.Anis (For atk buffs and reload speed buff), all 4 runs did not use Crown in the burst chain.  \n4. Top 2 runs used Marciana as healer, bottom 2 runs no healer  \n5. All 4 runs ensured Guillotine and Scarlet had equal number of bursts  \n6. Left side runs had Scarlet burst first  \n7. Right side runs had Guillotine burst first  \n\n\nFor reference my units stats are the following:\n\nScarlet (1 Dupe/1 Star)  \nSkills Levels: 10/10/10  \nATK in Homepage: 81831  \nOLs:  \nIncreased Ammo: 271.61% (68.93% + 68.93% + 68.93% + 64.82%)  \nIncreased Atk: 11.81%  \nHit Rate: 17.28% (11.81% + 5.47%)  \n\n\nGuillotine (4 Dupes/Core1)  \nSkills Levels: 1/7/1  \nATK in Homepage: 82139  \nOLs:  \nIncreased Ammo: 198.57% (60.71% + 68.93% + 68.93%)  \nIncreased Atk: 35.43% (11.81% + 11.81% + 11.81%)  \nHit Rate: 11.81%  \nCrit Rate: 5.71%  \nCrit Damage: 23.08% (16.44% + 6.64%)\n\nMy Scarlet and Gullitone has similar base atk in homepage despite the dupe difference is due to Scarlet having an SR Doll.\n\nMy Scarlet has much higher skill investment,  \nMy Guillotine has better overall OL lines. (Hella lucky OL NGL)\n\nHope this helps.",
            "https://preview.redd.it/793d41v6d97d1.jpeg?width=1080&format=pjpg&auto=webp&s=a8a76fb68bf7f04439d3db029b754b6da0bf75bb",
            "Yeah certain stages suck even with the full meta comp, think I ran into 1 major wall in ch 23, one in 24, one in 25 so far, think I'm only a few stages behind you in ch26 atm and I have full meta team currently around 198k cp. Some of the bosses have been surprisingly easy though lol.",
            "Volume+Anis+3 burst 3.",
            "Volume+Anis+Soda bunny + Sugar/Kilo defending on the stage/Noir.\n\nFor your specific roster. Uncharge shot with Anis when you need fast charge. But she charge very fast anyway so you likely don't even need to uncharge shot with her.\n\nAnis isn't very good but she is Meta in PVP, you will keep use her there until end of game.",
            "Also if you really like Anis, her summer Swimsuit limited version which is one of the best units in the game for both PvP and PvE will come back in a month.\n\nSave 200 golden ticket to get her for sure as her off rate in the summer banner will be very low.",
            "probably before you got noir. noir is an upgrade for nonburst slot.",
            "Thank you both, I just got Tia today, should I replace someone with her or run same team mentioned?",
            "She is strong than liter sure but unless you are sure what you are doing, keeping it for when your burst 1 die on the first time you get to a stage is more efficient than just yolo it ",
            "Yeah I just redid this math myself and got similar results. Don't love how this spreadsheet is laid out though since it includes credits at the same value as core dust. If you just set credits to 0 then you get:\n\nRefresh 5 -> 21.8 gems/1h core dust (still better value than 1st wipeout)\n\nRefresh 6 -> 14.1 gems/1h core dust\n\nRefresh 7 -> 8.65 gems/1h core dust\n\nRefresh 8 -> 4.54 gems/1h core dust (better value than hard mode stamina)",
            "that is a good point.\n\nI wasn't familiar with this strategy for locking gems and core dust daily refresh, but this is an average positive over the long-run.\n\nI was thinking of the uber-whale daily dispatch refresh strategy where it is just continually refreshing for core dust.\n\nThis strategy is much more value-orientated and gives good return for core dust for gems. May do it on my spender account.",
            "That is an interesting perspective.\n\nThe reason you come up with that conclusion is because you are converting all core dust value to fixed best gem value (from farming hard events) and then calculating based on that. the gem value of core dust actually fluctuates depending on where you are getting it from. AKA you are actually spending much more gems via daily dispatch per 1-h core dust compared to farming core dust from events, so using the farming core dust gem value for core dust gives misleading results.\n\nHere is how you should look at daily dispatch and you will see how it is giving a much lower value for gems to core dust conversion than what you are thinking.\n\nFrom daily dispatch, the probability breakdown goes like this:\n\n* 23.43% for gems\n* 66.86% for trash (including credit boxes, molds, bond tixs... it is not actually worth converting gems into any of those items, so it is really a net loss)\n* 9.71% for core dust = (4\\*0.4286+4\\*1.4286+4\\*0.5714)\n\nAverage core dust per success = 2.2353 hour of core dust = 2h\\*(4\\*0.4286/9.7144)+2h\\*(4\\*1.4286/9.7144)+3h\\*(4\\*0.5714/9.7144)\n\n* For 7 open slots = 51.09% of hitting at least once on 9.71% core dust option\n* For 6 open slots = 45.83% of hitting at least once on 9.71% core dust option \\[this will be even less if one of the claimed dispatch slots is already a core dust option\\]\n\nIt costs 50 gems to refresh daily dispatch once. On average, it will take two daily refreshes (which is 100 gems) for average 2.2353 hour of core dust.\n\n**So the true value of 1h core dust from daily dispatch is \\~44.73 gems spent on average, and 2h core dust from daily dispatch costs 89.46 gems spent on average.**\n\nFrom wipe-outs, it is 50 gems for 1st gem wipe out for 2h core dust, so 1h core dust only costs 25 gems. 2nd gem wipe out is 70 gems for 2h core dust, so 1h core dust costs 35 gems. 3rd gem wipe out is 100 gems, so 1h core dust costs 50 gems.\n\nThe average gem value of daily dispatch refresh core dust is better than the 3rd gem wipe out, but worst than the 1st and 2nd gem wipe out.\n\n* **1 year of 1st 50 gem wipe out will give 720 hours of core dust for 18,000 gems**\n* **1 year of 1st 50 gem daily refresh for 7 slots will give average of 399.705 hours of core dust for 18,000 gems**\n\nLast point is that you may think you make up for the loss in gems due to the probability of getting gems via daily dispatch. On average, one successful gem dispatch is 22.475 gems \\[math is 15 gems \\* (0.7143\\*7 / 3.1456) + 20 (0.4286 / 3.1456) + 25 \\* (1.4286 / 3.1456) + 30 (0.5741 / 3.1456)\\]. That means you need at least three successful gem hits to come out ahead in gems. There is only a 21.21% of getting three successful gem dispatches out of 7 dispatches with rate of 23.4478% for gem dispatches, so 78.79% of your dispatches is a net loss of gems. So you will lose more gems than you gain over prolonged daily dispatch.",
            "I don't think there's a dedicated MG buffer, no. Most MG units are self-sufficient anyway.",
            "I guess diesel could buff with her treasure ",
            "Honestly the dolls and dupes are the main issue. You'll get the mats eventually.",
            "It's not that common for peripherals to use software as intrusive as razers' . E.G. iCue by corsair and Options+ by logitech work perfectly fine with nikke/ACE. And other premium  brands for esports don't even use extra  software. \n\n\nYou could also try removing all traces of razer drivers/software. Additionally if your pc  is a pre-built check for  software/drivers installed by your vendor. ",
            "can't use crown, she is way too slow burst gen. probably drunk scarlet / a2 / viper / rapunzel / jackal on team 1 and noise / sbs / bay / noir / drake for team 3.\n\nread this guide for pvp: [https://www.prydwen.gg/nikke/guides/pvp-intro/](https://www.prydwen.gg/nikke/guides/pvp-intro/)",
            "yes, usually liter is an upgrade.\n\nLiter goes 7-4-7 in step 1. then 10-4-10 after drunk scarlet 10-4-7 (or 10-4-10). I would do liter to 10-4-10 when drunk scarlet is 10-4-7 and then finish off drunk scarlet 10-4-10 after. lvl 7 burst is typically enough to screenwipe if you aren't too heavily below CP deficit.",
            "Try using auto play while knowing burst and cover timing",
            "darn people auto it long before reaching your level...",
            "Gz on clearing, you should pretty easily zoom past the rest of the story, I'm at ch26 with like 200k cp and people have full cleared story as low as like 230k before. ",
            "turn on autoaim to max.",
            "Prepare 1 million usd and you will pull her eventually even if you luck being slabsolite shit.\n\nMaybe you can just buy RH directly from the dev if you have 1 billion. How? Just buy their company shares.",
            "focus on sbs for faster burst gen during nonburst. consider swapping naga for low investment alice for sbs buffer and burst spammer.",
            "That's fair lol, a lot of the time I'm just hanging with friends in vc and maybe watching something so I prog campaign when I feel like it while doing something else. Often you only have to manual the very start or when the boss spawns on harder stages.",
            "i rmb 160 wall. was NOT running n102 or mica or belorta. if you are using that, your roster is rly bad for pvp and can't compete. i can see you still needing purple neon at b1 for a 3rd team but if you dipping into mica or belorta or n102.... those pvp teams are literally not viable. just swap to a cp padding team. \n\n\nif you are competing with more than purple anis and purple neon  that your bracket is hella weak and doesn't know what they are doing bc that means your 1st or 2nd team is alrdy using a rly weak purple neon at b1 and is ez to beat. that n102/mica team is only hitting 3.5-4rl unless you are running full clip SGs. might as well use product 23 at that point to hit 2.5rl. \n\n\n3.5-4rl teams are extremely ez to counter if they know what they are doing. a 3rl team with bad purple unit is not rly going to do well either.\n\n\nthey don't feed scarlet rotfl. they literally are 3.5-4rl or slower unless you run full sg with them (which will feed scarlet). scarlet teams hit 2-2.5rl normally. feeding jackal is the least of your worries when you dip into those units and your base speed is alrdy super slow. those units are losing to 3-3.5rl non-meta teams. that is why it is pointless to run it.\n\n\nwould love to hear what your amazing spa challenger 6 setup was running multiple purple units beyond purple anis and purple neon. only way that works is basically trash 3rd team and scarlet-jackal-anis team 1 and noah-biscuit team with purple neon in team 2 and jist relying on opponents not have counters to biscuit and jackal.",
            "So there is! I forgot what base form looked like. \n\n\nDKW / Anis / Modernia / Alice / Noir \n\n\nAlice now being included because you aren't buffing the shotgun users to viability, so Alice is there by default. Need a decent B2 still but Anis still at least feeds burst gen super well.",
            "Your Google account is the same, it's just the Nikke account that you used the salted email for.",
            "They are all in the union shop.",
            "Leftmost tab of bla (texting) sends you to do side missions in the maps.",
            "Sounds like you've been ignoring your text message quest. If you're at this part of the story, you can definitely burn through most of them as they open up by chapter. So any of the lower ones you could easily do fast.\n\n  \nI reccomend you catch up on side quest, they add a lot of lore and give out some nice rewards. Gift affection is kinda meh, but you can never say no to more gems though right.?",
            "RNG doesn't work that way, literally the Gambler's Fallacy.",
            "Thank you for your input, but I don't really want to regress back to what's considered the best. I mainly want to play with a core of the characters I like the most and build around them. It just happens that I had one spare slot over with Liter as I'm not a big fan of lolis.",
            "thanks!",
            "But I can hit it when there are minions, half of the time if just doesn't want to hit. You even said I can't hit unless im using pierce, which I was using, so I don't understand.",
            "Thanks Cid_ya!",
            "Thanks, but widescreen does not bode well for me for some reason…\n\nScreen freezes up but everything still works, it’s just I can’t see shit because the screen’s visuals froze up",
            "I'm primarily building her for campaign as a \"we have Red Hood at home\" alternative.",
            "Thats a good estimate for sure , so 3 week to 1 month should be about right since i will have a higher outpost during the process , thanks a lot :)",
            "i have them since day one ! Def a nice addition for new player ! :)",
            "I've clicked into the event from the notification icon -> banner and it's still there. From googling around it doesn't seem like many people have this exact issue but have other issues regarding the unread/red dot appearing on other menus and not going away. I'd try reinstalling but I get it on mobile too.",
            "good to know, appreciate it",
            "Liter already has a maxed doll though this is my second SMG one. And Volume would be replacing Alice",
            "wow thats really deep explanation. Its all makes sense to me now.\n\nMan I'm really out of touch with this meta and I cant really keep up with how scarce the resource. Not to mention the RNG for favorite item too.\n\nWelp at least I know which three team I should use now for the next guild raid.\n\nThanks\n\nedit: Holy shit, ur right. I just tried in shooting range and my alice/sbs team score is doubled. Ofc it might be different when the real raid start but I'm definitely gonna try this team instead of my usual Tia/DKW/naga/alice/sbs team",
            "wow okay so they both almost similar in term of damage. and even with healer, the damage is not that much difference.\n\nI might consider using guillotine depending on the boss.\n\nThanks for testing",
            "https://preview.redd.it/wk9kpm28d97d1.jpeg?width=1080&format=pjpg&auto=webp&s=c268fd4eaab94b548d1479c67cbb40a6209672f3",
            "Let me know how 26-17 treats you if you remember, lol! I'm lacking RH from the meta Comp and my 213k is getting kinda whomped.",
            "Got it! So I should do Volume, Soda bunny, Anis, Noir, and who should be the 5th? Should I keep Dolla on the team?",
            "I’ll do my best to get her! I failed to get her when she first came out and that’s when I quit the game for a long time",
            "Sorry I’m not sure what you mean",
            "yes. level tia to 7-4-4 immediately. she needs lvl 7 to cooldown fast enough to keep up 20 sec burst rotations.\n\ndrop maxwell.\n\ntia/volume/naga/free privaty/maid privaty",
            "It's usually the opposite, going all in into damage is  the way to avoid your supports getting killed in the first place.  The only reason to save that burst is if you notice that the boss is bringing too many trash mobs and you are better bursting it down before they even attack.\n\n\nAlso, there's plenty of  high deficit  strats that use  RH as  the only B1 with some  delay in between. ",
            "Cool, thanks for these numbers. I agree with you that the introduction of the treasure dispatches kind of muddies the optimal protocol, and I'm sure there's a way to quantify the values (possibly using the expected treasure income over time to assign a specific numerical value to each kit rather than the pure exp given), but at the moment, I'm fine with just viewing the extra treasure rerolls as a slight added value above and beyond the original dispatch protocol. Where as I may have not rerolled before with only 4 or 5 dispatch slots, I may be more inclined to do so if I can also simultaneously roll for 3-4 bad treasure slots in hopes of getting better treasure upgrade materials. The extent of this willingness will depend on each person's subjective value judgement of the treasure system as a whole.",
            "I understand why you view it this way, but it just seems like we are coming at this from 2 completely different angles: You are trying to force progression by pumping the maximum amount of gems possible into X system to get Y output. I am trying to just take the best value for minimal gems/spending. I agree that trash like molds and credits probably isn't worth refreshing for and should not be taken into account in the calculation.\n\nBut your math just doesn't add up to me. You are calculating it backwards, like X % to gain back gems on 1 refresh, but you can't calculate daily refreshes that way in a vacuum.\n\nTaking into account ONLY gems + core dust:\n\n1 dispatch is worth 5.26 gems 15x0.0643 + 20x0.03 + 25x0.10 + 30x0.04. So 6 dispatches is 31.6 gems and 7 dispatches are 36.85 gems.\n\n1 dispatch is worth 0.217h of core dust 2x0.0743 + 3x0.0285. So 6 dispatches is worth 1.3h of core dust and 7 dispatches is worth 1.52h of core dust.\n\nCombining the 2 above means if you get 6 \"bad\" dispatches and reroll you expect to spend 50 gems and gain 31.6 gems and 1.3h of core dust. Spending 14.15 gems for 1 hour of core dust. For 7 you spend 50 gems and gain 36.85 gems and 1.52h of core dust. Spending 8.65 gems for 1 hour of core dust. Both of these are cheaper than wipeout.",
            "For the math on paid packs vs wipe out/hard mode farming/daily dispatch. You need to convert everything to the actual dollar amount for relative comparison (rather than using the gem-to-core-dust value from farming hard mode core dust... because none of the other methods of gaining core dust in game or via monetary packs will actually hit that excellent gems to core dust conversion rate). You can convert gem to dollar using 30-day supply value ($4.99 for 3000 gems). Pick an arbitrary value for 1h core dust for better visualization of the differences, I used 60 core dust per hour here.\n\n* For farming hard 11 for core cost (typically 900 gems for 180-1h core dust) = $1.497 spent = 7,214.43 core dust per dollar = $1.39 per 10 k core dust\n* For 1st 50 gem wipe out = $0.0831 spent = 1,442.89 core dust per dollar  => $7.49 per 10k core dust\n* For 2nd 70 gem wipe out = $0.1164 spent = 1,030.63 core dust per dollar  => $9.70 per 10k core dust\n* For 1st 50 gem daily dispatch (average rate is 44.73 gems per 1h core dust) = $0.0831 spent = 807.09 core dust per dollar => $12.39 per 10k core dust.\n* For 3rd 100 gem wipe out = $0.1163 spent = 721.44 core dust per dollar  => $13.86 per 10k core dust\n* For paid golden package 1 = $19.99 for 180 core dust + 1,500 gems is 540.27 core dust/dollar => $18.51 for 10k core dust.\n* For paid weekly core dust set = $14.99 for 90-1h core dust+1200 gems is 360.24 core dust / dollar => $24.06 to get 10k core dust.\n* For paid 30 day selector pack and using core dust = $19.99 for 120-1h core dust +1,500 gems is 360.18 core dust / dollar => $24.30 to get 10k core dust.\n* For paid monthly growth pack = $19.99 for 60-1h core dust + 1,500 gems is 180.09 core dust/dollar => $48.60 to get 10k core dust.",
            "I gave up for a while. I tried not too long ago and still got wiped out. I don't know what I was doing wrong.",
            "Will try when i will get around to properly invest in Alice. I am still a bit resource starved whne it comes to skills and gear.",
            "Anyway, how was your rank when you 2 months in, 4-5 months in, and how about now?  How many real whale in your basket to reduce that out? Did you basket too crown they even move out player instead of adding new one in?\n\nDid you play super efficient and get all the level possible? Did you start getting OL gear as soon as 3 week in? Did you among the first 5-20 to break 160 in your basket and start competing asap?\n\nIf you didn't  and not in top 10 even then you didn't know anything about early game high level play as of now.",
            "Nah as early wall break, I doubt you were one. Other than the 2 whale in the basket, rest don't have fully developed roster.\n\nScarlet+Blanc(could add Belorta here to will burst gauge race if see the chance)+Mica+Anis+Maiden (beat same comp with Liter easily)\n\nBay+Emilia+ N102+Belorta+ Clip SG/rl (Beat slow Scarlet+Jackal +Liter+Blanc+AR of same power) and Noah wall team easily enough.\n\nFull shotgun Neon+Sugar+2 clip SH + 1 defender burst 2  (Goodbye flex Privaty team often kill most team of the same power before they even burst, so long as they don't  have immortal ability, sometime even Scarlet team of same power because scarlet just fucking dead)\n\nI was the only one on the top 10 using many Purple, some people ended up started using purple to fight because they lose to me.\n\nYou likely broke your wall too late and ended up rush to level 200 in a week many level behind the rest of your basket too so ofc you didn't know.\n\nNow at 221-250 level in the basket, I'm the only one in top 20 without a Jackal, Top 3 to be exacted because 1 whale just quitted a month ago. Ofc I no longer used Purple aside from Anis in my team. But I know how to compete in SpA dude. Especially in early level, at least more than you who just assumed less than 2 months old people having everything.\n\nUnlike, those who look at guide for their team building bitching about 2-2.5-3 RL team, even a bit difference like 0.1 second in burst gauge fill in early pvp matter.\n\nSwitching your team around also help with getting your opponent off balance thanks to burst timing difference. Nah ofc that irrelevant in later game so ofc you don't know.",
            "Thanks. I’ll give it a try.\n\nI was under the impression that Leona was better because of the critical buffs",
            "Sorry I'm really tired right now so I want to clarify so I'm absolutely sure, does that mean I can have it linked to my googleplay account which is the non-salted email but the Nikke account itself will still say +9?",
            "Thanks",
            "👍",
            "If possible, try to use Red Hood since you have her. She alone would make the game much much easier, unless you hate her.\n\n\nLiter or any other units doesn't matter. She alone will carry story mode team by herself with any other units.\n\n\nNow that aside.\n\n\nDorothy+Crown+Mordenia+Red hood+Privaty \n\n\nWould be very good already if you only play casually with the story mode.",
            "change graphics settings to all low except FPS keep at 60fps.",
            "no point in running two B1s. liter is better than volume. don't run both.",
            "Glad I could help. \n\nIf you have redhood and xludmilla, I'd do Tia/Naga/DKW/RH/XLudmilla.\n\nFor now a safe bet for team 3 would be Liter/Blanc/Maxwell/Noir/Modernia. Unlikely for any of those units to fall out of SR or UR meta for awhile too, at most reshuffled to other teams.\n\nYeah the slow skill books gain really hurts, especially with no Overclock Sim this month. Rocks too.",
            "Np :)",
            "Currently at 26-15 with 197k cp @ synch 207 I'll let you know if I get there how it goes",
            "You can use Dolla instead of Anis if you want. Dolla can also do uncharged shot to help burst Regen but beware that it's much slower than Anis. Instead, Dolla offer some damage buffs which Anis doesn't have so Dolla higher tier. \n\n\n Generally you want 1 burst 1+ 1 burst 2 + 3 burst 3 in a team. One of them you want to be RL or SR to help charge burst faster with  uncharged shot. \n\n\n CDR units help reduce full burst countdown which is also very important to burst faster. (Even if you full charge, you can't burst if your burst in still on countdown). But Soda Bunny increase burst duration so you might not even need CDR in your team with her. Both Volume and Dolla can be replaced when you pull units with better buff.\n\n\n In case you get Anis Summer, you could use Volume+Anis/Dolla+Summer Anis+Private+Kilo/Soda Bunny.",
            "a normal team rotation is 20 sec b1 to 20 sec B2 to 1st 40 sec B3... then 2nd rotation is to 2nd 40 second B3. there is a 5th flex slot that will not burst, usually use a B3 buffer like Noir who gives atk buff and ammo buff without having to burst personally. Other nonburst buffer B3s include free privaty (atk/reload speed) vs maxwell (atk/charge speed) vs drake (atk buff). can also slot a healer in that slot (like rapunzel who has strong healing without bursting or bunny alice who is a 40 second \"B0\" so will re-enter B1 or helm - need to manual trigger helm's burst to heal as she is a B3 healer).",
            "That's when you know what you are doing. You need to know the stage inside out and already lose it many time already. \n\n\n Rh burst 1 team also beat the stage quickly so as to incorporate little burst timing, that require lots of specific investment that a common new player won't be able to make.\n\n\nYou are giving advise as if the one using it need that advise anymore. If you were at the stage when you can use red hood burst 1 team then you no longer need any team building advise.",
            "You are right if locking for gems as well, then refreshing daily dispatch net value over time is better than wipe out. The whale daily refresh strat I had seen before was just purely rerolling for core dust, not locking gems and the value is very bad. Your strat is much much better.",
            "alice is fine as nonburst for sbs buffer/burst spam at low investment. sbs and modernia is carrying, she is just burst spamming/giving extra buffs to sbs. can try at 444 alice. alice needs full max + ol w ideal lines if bursting carry dps",
            "rotfl. you are exactly who I remember. loves bragging and flexing about idiotic stuff.\n\nyou realize that starting with a meta roster and fast pushing and breaking 160 wall the fastest doesn't make you a good player? it just means you had good starting luck and have a leg up against your opponents... not that you have better skill. in fact, if you took away that advantage... you likely are not doing well in pvp because your defense teams sound terrible.\n\nfast pushing story post-story nerf is not the same as fast pushing story pre-story nerf lol. it used to require level 160 to fight ch 16 boss and lvl 200+ to beat nilhilster. now there are players that are in chapter 24+ still at 160 wall with 2 meta story units leveled. you don't realize what the actually skilled players are accomplishing now. you were the guy literally bragging about beating story faster compared to older players due to CP nerf. lol.\n\nyour pvp knowledge is lacking. you don't know how to set-up a real competitive emilia nuke team (you have both noah and blanc but not using them with emilia), don't know about burst speed break points (there is no in-between lol). not even fighting the real meta pvp teams yet. just winning because you broke 160 earlier.\n\nno, neither of my accounts had amazing luck to start with meta rosters to fast push or break 160 wall fast. but both accounts are now the farthest in hard mode compared to same synchro level players in my pvp bracket. my secondary account was delayed more than 4+ months at 160 wall, but still caught up and surpassed non-whale players who broke the wall earlier and only players with 42+ higher synchro lvls are farther ahead in story. My 2ndary account is even still missing OL gear on main team and saving all core dust boxes as well for next story update lol (can boost 20+ levels on that account if I open core dust boxes).\n\nmy pvp bracket has whales going down into top 30 lol. main account rank 4, 24%+ cp penalty for top 3 players, can beat their teams if not CP gapped. only 2 players in my bracket can beat my defense (with one player having CP advantage and other player insanely pvp-invested, has an expensive scarlet-x-anne-rosanna-jackal team). f2p holds diamond 1, CP gapped by whales in top 10 challenger and missing noah and biscuit and drunk scarlet and noise. No PvP investments in either account. Holding and beating teams purely based on pvp knowledge lol.\n\nIf you are top 10 challenger without jackal, that is not a competitive pvp bracket. sorry to burst your bubble. It is currently impossible to beat the two best meta PvP defense teams without jackal.",
            "lol. oh, you don't have a full roster but literally has a ton of meta pvp units with drunk scarlet and emilia as top-tier nukes and noah and centi as a top-tier B2 and multiple clip SG. Aka already have the four fastest burst gen fillers + multiple clip SGs. Don't need to dip into n102/belorta/mica with that roster.\n\nScarlet teams won't be using liter unless with jackal and if you are running maiden against that, it is 2RL and you are team wiped before blanc's indom. No one who actually knows what they are doing will run both blanc+liter on a scarlet-jackal team, that is not a competitive PvP team at all. a 3RL jackal team is already too slow. if the team doesn't even have jackal and is running liter+blanc+scarlet... rotfl, that is not even a pvp team... that is 4RL with clip SG, needs BOTH centi and anis to only be 3RL (aka that set-up guarentees 2nd/3rd teams autofail as used up all best burst fillers for an average 3RL team).\n\nfull clip SG + B2 defender at 2.5RL is only possible with centi since your anis is on another team. LOL not saying the unit to try to make your team look weaker. So you are running centi in that slot to be 2.5RL and bursting first over a 3RL free privaty stun team. If you are only 3RL with full clip SG with sugar as the nuke, you only kill position 5, but a lvl160 pvp teams 3RL free privaty team will stun you and win as long as their P5 is not B1 or B2. post-lvl 160, free privaty stun doesn't have enough DPS unless paired with dorothy, and that team maxes at 3RL or an uber expensive quiry stall based team. Full clip SG team is countered by jackal.\n\nA 3RL non-blanc/non-noah emilia team is extremely easy to counter. A 3RL AOE clear or 4RL noah team wins. emilia's nuke is 1RL slower so you die to 3RL aoe nukes before you burst or they can do a delayed noah at 4RL to save burst filler for another team. Emilia is not a viable nuke without blanc or noah if facing competitive teams.\n\nLiterally anyone with jackal or noah and ability to make a 3RL AOE nuke wins against your defensive team setups. if you were holding your slot, your bracket is not competitive. early brackets a lot of people are missing jackal and other meta pvp units, so random teams can rank high... doesn't mean that they are competitive teams. sounds like you were winning against trash teams and now have a big head lol.\n\nlol now I remember you. you were the guy always bragging about how fast you pushed after the story nerf and all this other random wannabe flexing/bragging.\n\n...there is no 0.1 second burst gauge difference. you either burst at 2RL or 2.5RL or 3RL or slower. there isn't any inbetween bursting. there are hardbreak points that you hit with your burst gen and then you burst at the faster breakpoint. a 3RL team with 99.9 burst gen at 2.5RL bursts at the same speed as a 3RL team with 50 burst gen at 2.5RL. You only burst at 2.5RL when you are over that breakpoint. that misinformation shows that you don't know pvp as well as you think.",
            "Crit and Core Hits share a damage modifier, and Modernia gets free Core Hits, so crit is less effective on her.",
            "Salted email just means you log onto nikke with the \"+number\" email address but the emails Nikke sends is just to your regular email address.",
            "Huh, I'll consider it.",
            "I’ll see if that helps\n\nAlso, I was suggested Laplace for Black Smith\n\n(Also beat Chatterbox first try with Laplace)",
            "I'd totally be able to (just...) make it if it wasn't for the waves of kamikaze raptures that appear not too long after the boss. That's what's ruining my good runs at the moment. If I had a built Red Hood nuke I feel like they may not even have time to spawn, but alas.\n\nOr I had like... 10 more seconds.",
            "Thank you!",
            "It's not a competItive basket because you said so? Okay.\n\nAnd are you even talking about early game basket? Your current basket should be the result of merging with older server because your early basket being completely death after awhile. So it would be full of older player with higher power than you, it doesn't mean they were whale. Whale are more with more core nikke and much higher synch level comparing to those who start same time at them.\n\n\nAt early pvp speaking: Are you sure you fighted whale and not just players who played better than you? Focus on PvP units? Or just start sooner than you? Because I sure look like whale to other of my basket, power quite, just because of OL gear.",
            "You know 2.5 RL mean anywhere between 2nd and 3rd RL shot right? Not all 2.5 and  3.5 reload are equal. Ofc they don't explain that to you in school. 30fps means the difference can be as much as 0.033 sec defending on the weapon at play. The more smaller different weapons in a team the more the result will vary.\n\n2 scarlet+Blanc burst at exactly the same time. The one that actually burst bit later win thanks to Blanc immortal buff. That's an example where 0.1 second matters. Ofc it could be anywhere from 0.1 to 0.5. But both side will exactly die at same time and and only win over 1 bullet.",
            "Dude it's normal for any one to have Sugar, Villainess, maiden and Noir early on. That was  all I had for burst Regen aside from Emilia that everyone and their mother had. If you don't have even that how do you even pvp?\n\n I lacked Viper, Biscuit, Noise, Jackal, basically all top pvp option that everyone one else have and can beat them with right attack roster.\n\nScarlet too, I had exactly one Pligrim. She is strong in Arena but not like half of top 10 in arena didn't have her either.\n\nFull development roster, means those with OL gear and skill, no one have them at that level so you could just use them and CP fillers stronger than Purple. If you want full roster of all nikke then sure, no one have that either but that's not what I was talking about.",
            "How fast I clear story after story nerf? You cant judge, but I'm currently among the fastest out of the ones who started playing similar time as me on different servers. Enough of a brag now? All the people in top 10 in my special Arena are those with gold medals, if they aren't amongst the best of the time I started I don't know what is.",
            "laplace is fine, she is good against chatterbox's parts.\n\nfor blacksmith, she can clear the projectiles with her burst and can act as a burst spammer. shoot core against blacksmith, you don't have enough DPS to kill the arm cannons. need healer for blacksmith",
            "Ok I finally killed it, I maybe had 30min+ of attempts at it though.\n\nUnits: crown 3OL lv10 R doll, liter 2OL lv1 SR doll, RH 4OL lv10 SR doll, modernia 3OL lv15 R doll, naga 3OL lv1 R doll, 203k CP synchro 209\n\nI tried a bunch bursting with modernia first but had issues with the 2 jellyfish + silencer guy wave but managed to get it to the boss on 1 good pull but fucked up burst so didnt kill boss. Tried replicating this a bunch before swapping.\n\nI changed to then bursting with liter-crown-RH to clear the silencer guy and jellyfish way faster, got to boss, bursted liter-crown-modernia (should have RH burst 1'd) and just aimed at the boss and killed it maybe 5sec after modernia burst ended. Never had issue with suicides at end since I think modernia burst just killed them.\n\nCrown died before the end of the fight but everyone else lived. Total damage done crown 3.8m, liter 1.7m, RH 19.9m, modernia 11.7m, naga 425k. My RH has 2-3 ele damage rolls and ch26 is iron weak.\n\nHope it helps and gl with your attempts brother",
            "yes, it isn't a competitive bracket if you are not running jackal and top 10. You are basically there due to CP padding due to lucky starting roster. All pvp defensive teams can be countered, even the best three meta defensive teams with both jackal and biscuit teams. A x3 defensive team without jackal? rotfl. literally just a no thought-required jackal team + 3RL biscuit stall wins against that defense 100% of the time.\n\nMy bracket has all jackal + biscuit teams down to top 30. if your bracket is missing the best pvp team in the top 10-30, how is that a competitive bracket?\n\nnone of the brackets will merge with earlier start date players. brackets only merge with same start date.\n\nlol. no, you don't look like a whale. whales are 42-50+ synchro levels higher than everyone else post-lvl 200 with multiple high starred and max cored nikkes.\n\nit is 10k core dust per level. A few chapter difference in story doesn't give extra levels post-lvl 200. it costs 10k core dust per level. 1 chapter (35 stage difference) gives 1 extra core dust per hour. It takes 416 days for that difference of income to become just one extra level post-lvl 200.\n\nthe reason there are big core dust gaps between players is either due to whaling vs doing hard mode core dust farming vs not playing daily vs being stuck at 160 for multiple months vs not spending core dust boxes. that's it. being further ahead in story won't boost your level any significant amount. Being 1.5 chapters ahead gives 1 extra level after 1 year lol.",
            "gold medals in server ranking just means whaling. doesn't mean they are good at pvp.\n\nexactly. you are bragging about something idiotic. how fast you clear story is just based on your starting roster. it doesn't mean that you are oh so skillful. and hint, no one cares.\n\nyour pvp server is a small fraction of the people with the same start date. it doesn't mean anything.\n\nif you really want to measure your own dick, look at the lowest CP clears and see if you are hitting that. that is much more impressive than speed. speed is just how fast you got meta endgame team (aka just luck). the skillful players are clearing at much lower CP than everyone else using that same team (aka how fast of a time you are clearing doesn't mean anything... if you started with endgame team earlier, you clear earlier).\n\nIf you knew what you were talking about and wanted to brag about how skilled you are, you would be bragging about beating elite stages at 45% CP deficit.\n\n...but you are literally bragging about something that requires no skill at all (bragging about pulling end game team faster than other people) rotfl.",
            "Sorry if I’m not getting these terms but what do you mean by “burst spammer”?",
            "UPDATE: I FEEL LIKE YOUR SUCCESS BROUGHT ME LUCK.\n\nI pulled a Crown dupe today and the 2% increase to her stats raised my Combat Power buy about 800... and I was able to pull it off!! Probably just got lucky, but I'll take it! Modernia was outputting just enough damage to kill the boss before the airborne kamikaze raptures were able to launch themselves at me, haha yes!!!!",
            "Oh man, congrats!!",
            "I was there because I built my PvP units with OL gear. My level isn't higher than those in my basket. It take planning at early level like I had said.\n\nLucky game? Yes, a bit but the rest of my basket top players has similar roster and better so that's not a point.\n\nYou are just butt hurt you can't be top in your arena ever and it's too later into later game when you got kick down by much older players than you.",
            "Didn't I just said I'm not a whale and the whale are having high level gap and multiple MLB nikke? \n\nI just look like a whale power, thank to OL gear and I doubt you remember your early game. \n\nThis back to the discussion. At below sunch level250-300 at least, when everyone still building their team, the one who sweaty spent time to beat SI the earliest win on the number of OL gear thanks to the upgrade mats drop, not the lucky to getany Manu gear. Also, rushing to outpost 177 give more mats tk upgrade too.\n\n\n Of course you don't know this too as you never have a good early game to begin with.",
            "No one care but in this case when we are comparing experience it matters.\n\nEven if they aren't good at pvp, they can consult you oh so skillful copy pasta Meta guide and best me no? If they spent lots of time looking at PvP and changing teams to fight me in an hour you would be darn sure they would be learning about pvp.\n\n\nHalf of the medal in server belong to those who play, not those who whale. You need to clear most of the game first in the server to earn them. Unless their server being completely death they won't do that easily. Ofc, you have no experience with medal to spew such nosense.",
            "Gz gz, I progged up to 26-25 and didnt feel like tryharding any more after trying it a few times.",
            "the servers don't merge with older players. it reshuffles the same start date players and remove inactive players.\n\naka all brackets eventually will have whales. lol I've been top 6-10 for the past 12+ seasons with more and more whales joining the bracket. yup, I am really butt hurt that I'm holding challenger 4-5 with my defense holding against all players except for 5 players (4 whales - 30-40+ levels higher and one pvp maniac with a maxed out rosanna) while my pvp team has zero investment.\n\nmy self-worth is totally tied to how fast I clear Nikke and my pvp bracket level and I have a compulsive need to brag about it on reddit forums when responding on unrelated topics.",
            "since you're so proud of how amazing your early game progress is, when did you start, what is your synchro level, and where are you in story/hard mode?\n\ndidn't need a good early game. I was clearing within top 5 lowest CP clearing teams as soon as I got a full meta team. literally blew past all the people who broke 160 earlier or started with more meta starting rosters ages ago unless they are whaling for core dust.\n\nyou can get OL at lvl 160 pre-nerf. that is when you clear chapter 16 to unlock EX bosses. nowadays you can clear at 120 or so, so that is way below level 250 lol. at lvl 250 you already have all your raid DPS and pvp nukes fully OLed with lvl 5/5 helmet/arms. lvl 300, you can full OL your x3 SPA pvp teams.",
            "hahaha. you are pretty funny guy and proving my point the more you talk.\n\nif you have one whale in your bracket, you aren't earning gold. no one cares about server rankings, it is pretty just whale trophy or you are in a dead bracket without any whales. you clear first out of a small pool of 50 randos. are you even top 10% out of the same start date players? (the answer is no lol). My 2nd account earned gold medals but my main account is much stronger and pushed much faster. My 2nd account is just on a dead bracket lol. It literally means nothing.\n\nlol, if you are fighting trash pvp teams... no they aren't learning pvp. beating up on 3RL pvp teams is easy.\n\nsince you are so knowledgeable about pvp, tell me what you think:\n\nwhat is the counter teams for these set-ups?\n\n* scarlet/x-anne/centi/rosanna/jackal\n* scarlet/emilia/blanc/centi/jackal\n* blanc/emilia/RH/biscuit/jackal\n* blanc/scarlet/centi/anis/jackal\n* noah/biscuit/s-anis/rapunzel/purple anis\n* noah/biscuit/rh/centi/jackal (without s-anis or emilia on the counter team)\n* noah/biscuit/emilia/centi/jackal\n\nAnd some easy questions:\n\n* what are the counter options for AOE nukes vs single target nukes vs distributed damage nukes vs s-anis nukes?\n* what is the counter options for blanc indom?\n* what is the speed difference you need to hit to avoid blanc indom, noah shield, noise hp buff, and emilia nukes?"
        ]
    },
    "【Pick Up Recruitment】Clay - Share Your Gacha Results!": {
        "title": "【Pick Up Recruitment】Clay - Share Your Gacha Results!",
        "score": 186,
        "url": "https://i.redd.it/7sq7k66d3o7d1.png",
        "content": "",
        "num_comments": 126,
        "comments": [
            "\" The 「CLAY, MORE」 version update is completed.  Apart from new Nikkes, Archives and story events, we have also fixed some issues. \"\n\nhttps://preview.redd.it/v8b0o85l3o7d1.png?width=1080&format=png&auto=webp&s=a48d98df9ec260640e22b670825343f0a4b74c31",
            "https://preview.redd.it/t8loiag6co7d1.jpeg?width=1290&format=pjpg&auto=webp&s=4fa151b03d2553cb0c73064467cb40cbf7e48f00\n\nBoth rewind members in single 10 pull",
            "https://preview.redd.it/dvxfbxqlzp7d1.jpeg?width=1242&format=pjpg&auto=webp&s=bed9876b787f0a4f4ab4fbf236233df393d130eb",
            "https://preview.redd.it/zzlt3oh19o7d1.jpeg?width=3024&format=pjpg&auto=webp&s=7b477e3ad82e5137d74dabbac4e3fc02b211132a\n\nOne ten pull!",
            "Got the squad in one ten pull\n\nhttps://preview.redd.it/7jngchx7wo7d1.png?width=1920&format=png&auto=webp&s=a4ef36943b13825f11650a62d3cb2e717423e0d6",
            "https://preview.redd.it/irfjerjego7d1.jpeg?width=1080&format=pjpg&auto=webp&s=62c3ef5c1f755b2a30162e89f41a786a4e068969\n\n40 pulls! Thank God, I can go back to saving for summer",
            "https://preview.redd.it/o6k9uoj2oo7d1.jpeg?width=1242&format=pjpg&auto=webp&s=6f7af572e1edcd82d3e53bfd6512a0a581bbef9a\n\nI came looking for Clay, and I found… what are Doros made of, again?",
            "Thanks RNGesus\n\nhttps://preview.redd.it/jrm4pudhaq7d1.jpeg?width=1280&format=pjpg&auto=webp&s=fb2f67f1a8299d3b9004816baa5e4e6c70c5b984",
            "https://preview.redd.it/loyamejg2r7d1.jpeg?width=1080&format=pjpg&auto=webp&s=461684ed9968e41a65d2fa16bd0058369573f52e\n\n3rd 10-pull. I know Clay isn't supposed to be very good, but I wanted her and a Doro spare on top is easily worth it",
            "https://preview.redd.it/wzfy76xp8o7d1.png?width=693&format=png&auto=webp&s=ed6a50213cb418e9541809e70a5d0dea59404691\n\n\"OK I'll use up my 19 tickets, see if I pull her. If not, I'll just wishlist when its time!\"  \n\\*a 2nd multi pull later...\\*",
            "https://preview.redd.it/2bzlfcheto7d1.jpeg?width=1170&format=pjpg&auto=webp&s=602d7fdc273e66c5817b574f4345996ba755f0d6\n\nTask failed successfully",
            "https://preview.redd.it/z8a095gdyo7d1.png?width=1920&format=png&auto=webp&s=7a3d29b4325ced25f90d85989a0b92c19c99f3e2\n\nfirst x10. saved my 21k gems for the summer units.",
            "unless you are rolling for simp reasons, save your resources!!! Her kit is terrible. She's a 40s B2 buffer that currently no one can benefit from, not even Laplace, who needs her treasure to be phase 3 to even have a chance to receive the buff. The true damage multiplier is low and has trouble reaching full stacks consistently. She has no utility as she lacks CDR or heals. Even if SU releases true damage DPS units, you are better off using Frima or any other atk buffers.  \n  \nEven Quency does a better job than her, and she's free!",
            "https://preview.redd.it/2s5er9htsp7d1.png?width=826&format=png&auto=webp&s=5c7441041b92d39ed3045234e7562536a781af98\n\nFree Pilgrim",
            "50 pulls, 1 Harran\n\nTempted to go in one or two more times. Would leave me with 100 vouchers for summer. Hmmm",
            "30 pulls and nothing. Not even a single SSR 😬",
            "Didn't get her with the single 10 pull I can spare. I did pull a Scarlet though, so I guess I should be happy..?",
            "Good luck to anyone pulling. I hope you guys get clay early.",
            "Dont want/need to mlb her but I did want her for collections sake as I do like her character. Threw a single 10 pull and got her once. Perfect.",
            "Nice. Clay on 30 pulls.\n\nMy Gem funds are ready for Summer.",
            "2nd multipull... The RNG Gods knew I was waiting patiently for her to drop one day.  She's right up there with Naga, Bunny Rupee & Killer Wife D for me\n\nhttps://preview.redd.it/d3gtyw8k6o7d1.png?width=562&format=png&auto=webp&s=458fe0a30d57c978ea7db8b83ebeed545a895d67",
            "Got nothing in one multi so I’m just waiting for summer now lol",
            "https://preview.redd.it/e94rtscgko7d1.png?width=1440&format=pjpg&auto=webp&s=24ff779ddfb13948e19316cee6ce92c02945e200\n\n40 pulls. That's it for me.",
            "I got Harran twice in a row with single pulls. At least I can push even further in pilgrim tower now.",
            "https://preview.redd.it/q04dvv3ycq7d1.jpeg?width=1691&format=pjpg&auto=webp&s=0fc32c38066c26a951865febfc650ba5388b4f1a\n\nGot her on the first 10 pull with using tickets...I dont think I will be getting any of the Nikkes in the summer event folks",
            "Got three on my 1st 10-shot. Luck gone for the summer pulls.",
            "20 pulls so I’m in good shape for summer.  Just gotta fool the desire sensor…",
            "got her on the first pull along with Rapunzel.\n\n\nDon't ask me why.",
            "I’m sure I’ll get her on wish list so it’s fine ",
            "https://preview.redd.it/1ppwnv7w9s7d1.png?width=1920&format=png&auto=webp&s=1e2babe161959becb1f43d0c82389f3b2d69b445\n\n30 tikets and 6k gems 😬",
            "https://preview.redd.it/h3mhd2p8ms7d1.png?width=1663&format=png&auto=webp&s=2fb402edfd452b48d4b4447f57cf7ff738173131\n\n2 Multis....hope my luck for summer didn't go out the window there.",
            "Was barely keeping myself from pulling because she's so hot, but after most of the event story I gave up and decided to give her at least 1 multi\n\nhttps://preview.redd.it/vdg7pmpdws7d1.png?width=1080&format=pjpg&auto=webp&s=04c74ca4344bfd02b801a993c486861ea9d48761\n\nCaught Frima sleeping and Rapunzel admiring the thirst that went into it. Still want Clay, but I kinda wanna take that win and walk with it",
            "50 pulls. Only got 1 SSR which was Clay. These rates getting worse I feel like. Took 70 to get Soda bunny :(",
            "I ACCIDENTALLY PULLED ON THE BUNNY ALICE BANNER. I thought I got an easy multi one tap 😩",
            "Lol. Just pulled her on the first multi. Trying to get more gold mileage for S.Anis",
            "Pulled first pull demnnnn",
            "Got her on the first ten pull. She's a cutie.",
            "Got her with my alt in 20 pulls. Totally skipping her on main since she's not that good and has no synergy with Bay. What a shame.",
            "I got Clay on my first pull, and honestly I'm pretty happy about it:)\n\nhttps://preview.redd.it/ps4n565jit7d1.png?width=1080&format=pjpg&auto=webp&s=f00c4164a3f2c24946b90c2521990dff84c537a8",
            "Welp. lmao  \n18 tickets, 13000 gems\n\nhttps://preview.redd.it/0k7pvuf9kt7d1.jpeg?width=795&format=pjpg&auto=webp&s=b085e3f7cbde5c82779569b89b17de961c20f2ec",
            "https://preview.redd.it/3yhb6gd13x7d1.jpeg?width=1080&format=pjpg&auto=webp&s=55fe82fc908508ddb42254e5dc8ada7c94ffafaa\n\n20 pulls got Rupee and Clay. My luck with waifu Nikke is higher than strong popular ones. Like 100 pulls for the bunnies and nada. Trony also came home in 20 pulls or less.",
            "Rolled around 90 times, got her twice in the last 10-pull.",
            "Got her in 30 pulls, I'm good now lol",
            "https://preview.redd.it/739itm2e318d1.png?width=584&format=png&auto=webp&s=3a725e8760a58a8193184c5790205a1f26cc99b5\n\nFirst 10 I got Clay and somehow managed to pull Red Hood as well I wasn't even expecting to pull a Pilgrim of all things but I, not complaining here. (Though I feel all my luck is gone now T\\_T)",
            "First 10 pull. Where was this during the bunny event?",
            "https://preview.redd.it/og7s1mpbko7d1.png?width=705&format=png&auto=webp&s=d6f02b9322991cdb2aaf496373a314dd044c6e8f\n\nHooray except I already have Crown and Modernia.",
            "Might use the shop tickets later this week but other than that, well, 200 tickets might not be enough for summer",
            "Pulled her in the first 10, neat",
            "I got her in 40 pulls. Also finally pulled Eunhwa as well.",
            "Good for those who got her.\n\nSkip for me atm. I'm more lucky to get them on standard banner than their actual banner.",
            "I could only draw 3 times and I GOT THE SAME R NIKKE\n\n\n\nNot \"an R nikke\", the exact same one three times !!!!",
            "i did 4 multis and got clay and noah, i guess its okay",
            "https://preview.redd.it/ywg7dz3jup7d1.png?width=1080&format=pjpg&auto=webp&s=82495d9e2729b3ad5f1bc7d84719c2dc419482e7\n\neven better",
            "One multi and I got red hood, she’s now 3*\n\nI won’t push my luck",
            "First drop on a x10! Now back to making a little stockpile for summer event(s).",
            "https://preview.redd.it/xnkiqf1r0t7d1.png?width=2408&format=png&auto=webp&s=454e68f5d4a40fb5f3c3394f1f182bd118056cd2\n\nFirst Multi",
            "as always, one 10x pull for the memes\n\nhttps://i.imgur.com/erI4Upc.jpeg\n\n---\n\nI'm going to pay this in blood to the RNG gods next patch, aren't I...",
            "Took 50 pulls, 25 of those using gems.\n\nhttps://preview.redd.it/hn0rdoq8ut7d1.jpeg?width=1284&format=pjpg&auto=webp&s=685930e515d3a6d0b17e82681f9c9082f70e7587\n\nI then decided to spend another 6k gems on wishlist in my continued efforts to break the 160 wall lmao",
            "Got her in one pull with a ticket. ",
            "Got her twice on my first pull.",
            "I did 11 multies and chose to pity her. Couldn't waste the other 10 multies I had left.\n\n\nI was pissed of wasting so much and reaching pity... but after the first 5 chapters of the event, fuck it. Clay is worth it. She has a smile worth fighting for, meta or not.",
            "Easy skip. Such a disappointment.",
            "Never pulling more than one multi again, got shafted so badly after the first pull (which was STILL all blues aside from one Clay)",
            "20 pulls. Got 1 copy of Clay and a Soda for her to be Core +1. No gems were used only the free tickets from the last events, so I'm 110% ready for summer.",
            "https://preview.redd.it/bulqu997op7d1.jpeg?width=750&format=pjpg&auto=webp&s=3edae00c6721dd41a34c07baf02dd706b00b54dd\n\nFirst pull",
            "40 pulls and got nothing, so, I used 200 tickets to get her, it is okay tho, still have 30k gems and 420 tickets, let's hope my summer pulls are better.",
            "How did I not notice that Clay has permanent Heart eyes?",
            "10 vouchers, 1 pull, GOT EM.  Glad I had some luck so I didn't have to waste my summer gems.",
            "Got Rupee, both gonna got benched anyway so at least I like Rupee a bit more.",
            "First multi with tickets and got her, but 40CD II Burst rn is the last thing i need for my teams, all 2 1 2",
            "0/30",
            "Meta-wise, is it worth pulling for Clay? I’ve been trying to get Alice the past few days with no luck. Should I just stick to her?",
            "Took me 15k gems, woooorth it",
            "Cocaine.",
            "https://preview.redd.it/onfnre473r7d1.jpeg?width=1818&format=pjpg&auto=webp&s=53e167fa761f21e0f602f65d555e75cc48abdb40",
            "https://preview.redd.it/cl2xswry8q7d1.jpeg?width=2560&format=pjpg&auto=webp&s=975a0c9d52ef4dce8e79ab778c389a0a07aee613\n\nSame",
            "Event spoiler/speculation… or just harebrained head canon: >!possibly long lost squad mates?!<",
            "Thank you for that information.\n\nAs someone who dosent know much about different teams and who goes with who i appreciate that.",
            "You looked for Cooper and found a Diamond",
            "Wouldn't she be more tia while bay is Naga?",
            "Nvm I did another multi and got her",
            "I just started the game like 2 days ago... soo it'd be really nice to get some advice regarding spending the gems. Can i like empty them over the special event character or is it wise to save them up ?",
            "Two Pilgrims is insane! Lucky you ✨",
            "...Damn. what kinda luck are you on?",
            "REWIND! ONE MORE TIME!",
            "https://preview.redd.it/rtynzon7qp7d1.jpeg?width=1290&format=pjpg&auto=webp&s=55a4e8d866689978450ce5f5210a3b8f52381b8b\n\nSame",
            "Unless you're pulling for waifu, she's not worth it",
            "She's not meta",
            "She buffs a niche that literally doesn’t exist (one single character with a fav item) and the buffs are negligible and mistimed on top of that. She’s a 40s B2. She’s an SMG.\n\nShe’s horrific DO NOT pull for meta. You are literally never going to use her in a team ever",
            "Idek why I’m getting downvoted. All I did was ask if she’s worth pulling 💀💀💀",
            "Bunny need you to have tove upgraded or bunny soda at least to worth it. Otherwise she would be just a healing bot.\n\n  \nClay also need new true damage unit to worth it, otherwise she just a 20% atk buff flex slot a bit worse than Noire without Blanc but need more investment.",
            "Checks out.",
            "https://youtu.be/ACUvjfxq2PQ\n\nHope this guide helps.",
            "She isn't that bad as he said. She is an atk buffer that work for whole team without needing to burst even without the true damage part. While she is bad, she is at least better than a trash tier liberation unit.",
            "Is this Twin Peaks or Big Bang Theory collab?",
            "I meant by shes right up there on my top 10.  But I actually made a post when Bay came out showing my gratitude that Clay and Bay didn't come out as Gacha Costumes for Naga nd Tia",
            "save them up. the unit has 40s cd and true damage support kit. it wont benefit new players",
            "After this event we should get summer part 1, with 2 limited units, then 2 two week events, then summer part 2 with 2 more limited units. Highly recommended to grab at least one copy of the limited units, they're usually quite good.",
            "Thank you.",
            "No, she’s that bad. You can like her for waifu reasons, but her kit is horrifically terrible. She literally has the ability to buff one character in the entire game that requires the leveled up favorite item almost nobody has, and the buff is garbage and negligible on top of that. The stacks required for the buff also are MISTIMED with Laplaces true damage phase. She’s also 40s burst 2. She’s also an SMG. \n\nShe is calamitously awful. There is no redeeming this kit. She is so trash that even IF the true damage archetype existed, she would still be bad enough to not earn a slot. She’s garbage lmao",
            "Who should i save for ?",
            "20% atk buff all the time is anything but garbage. She is supporter, not defender so it's a respectable amount with enough investment.\n\nIf it was the start of the game she would be a good burst 2.\n\nShe right now is kind of bad with all the powercrept but if she were to be called garbage then 70% of SSR in this game also are.\n\nNow if they were to make a meta burst 2 true damage with strong non burst skill and 40s cd on burst then Clay would immediately see play,",
            "We don't know who the banner units are going to be this summer. I would try to save 200 gold mileage to grab summer anis on the summer part 2 banner though as she will be a rerun unit (quite likely at least) that has a huge amount of value in pvp and raids.",
            "70% of the SSRs are indeed garbage, or at best mid af. I’m not sure why you said that like it was some bizarre notion when it’s widely criticized that the bulk of the nikkes in the game have poor kits while the those at the top are busted to high heaven. The balance and how shit so many nikkes are has probably been the most highly criticized element of the game there is lmao\n\nAnd that was a problem even at release. Liter was the best B1 at release by a country mile. Liter is the best B1 still. It’s less powercreep and more that there’s a minority of units with insane kits and then a ton of really mid to straight up unusable units. The balance in the game is ass. I love the game but you gotta admit the balance sucks",
            "> 20% atk buff all the time is anything but garbage.\n\nIt's not \"all the time\". It's when she has one stack of her true damage buff on s1, which can only stack during full burst - typically it activates 3s into full burst but sometimes it will activate earlier and fall off faster out of full burst. It only checks shots fired during full burst. On average it should have about a 40-60% uptime with the lower end being without cooldown reduction and the higher end being with cooldown. It's also based on casters attack so *if* you have her fully overloaded she will provide *maybe* about 16% of an attackers attack.\n\nThese are very low numbers for how niche she is (buffing only laplace and frima with treasures) and you're much better off using a different b2.",
            "Sorry, I just speak to a meta slave lol. Should've not bother.\n\nIt's not a notion, as any unit can clear hardest content with enough investment in game like this. Powercrept is just a common sense, after 10 year, current Red hood would be garbage in your eyes.\n\nIt's just your standard as a meta slave is just too over arrogant. Anything in powercrept live service game would just be garbage in your eyes, But to common player with sense of normalcy, anything mid or above average would be at least not garbage.",
            "After the full burst it will be almost all the time. Unless your team being so suck you don't know how to CDR and your burst cycle higher than 15 seconds.   \n   After around 3 second into the first burst it would be activated. The buff last 6 second. After the end of first burst it would be with around 4-5 second left after last trigger. A well build team should fill their burst in 4 second and come to next full burst.        \nHer count for attack during burst save over, so the next one only need about 2-1 seconds. That's 15/16-17 second uptime. Around 90% up time. \n\n\n You could even make her s2 ATK buff infinity because a burst cycle normally could be as low as 13 sec. It's the same thing that make rem 6 second ATK stack last all the time, just more strict in execution.",
            "Now, comparing that to Noir 14% ATK buff on 70%+ HP. It would arguably a bit better depending on the boss.\n\n\nWithout Blanc, Noir would also be a flex slot to the core 1-1-2. But she has Ammo bonus so a bit better here. And Noir without Blanc is already deemed very good although some Nikke doesn't need that Ammo buff at all. Then Clay should be ok to mid as a flex slot at least.\n\n\nOfc we only comparing Flex slot here as Clay won't ever be a main burst 2 in current meta.\n\n\nThat add to my other point, if they make a Meta true damage burst 2 with good skill 1-2 that doesn't  need self burst and 40s burst count down then Clay would immediately see play in her team in Solo raid.",
            "The thing that make Clay Viable as a flex unit is that she doesn't need to burst to activate her buff in s1-2. \n\n\nPeople often flex a burst 3 as they deal more damage but so long as her buff benefits the whole team she also work as a flex slot. And 20% isn't awfully low as you make it out to be. Drake for example a flex unit since start of game only offer 12%. Ofc her 20% isn't same as drake 12%, but she is supporter so it's not that bad and would better buff for units like Kilo for example.\n\n\nThat help her being better than 50% of SSR that want to compete for the 4 main burst to be useful when they aren't strong enough already.",
            "Dawg. You’re on a comment thread discussing her place in the meta, complaining about caring about meta. You’re upsetting yourself here. There’s nothing wrong with pulling for or caring about meta or waifu. Sorry your feelings got hurt.",
            "> The thing that make Clay Viable as a flex unit is that she doesn't need to burst to activate her buff in s1-2. \n\nWe have other characters that already do that, while providing bigger buffs and more damage, and they already struggle to fit into teams.\n\nClay is not good and the three different messages you have sent me are pure cope. We already knew she was going to be bad and the testing that has occurred has already demonstrated it. Maybe she gets better in the future if there's another true damage + extends full burst duration unit, but for right now she's too niche and too weak.",
            "Since when did I said she good? I said she bad to mid but not garbage. We have much worse units out there, like D, Soline. Etc\n\nDid you even read and just argue for the sake of it?",
            "> I said she bad to mid but not garbage.\n\nAnd you would be wrong.\n\n> We have much worse units out there, like D, Soline.\n\nSoline has seen use recently. D was purpose built to help people with modernia special interception, she is extremely good at the thing she was designed for."
        ]
    },
    "Who tf made this ☠️☠️☠️": {
        "title": "Who tf made this ☠️☠️☠️",
        "score": 975,
        "url": "https://www.reddit.com/gallery/1dlpx8b",
        "content": "Rizz god drake shirt",
        "num_comments": 94,
        "comments": [
            "Guys will see this and just say \"hell yeah\"",
            "NGL It's kinda funny, would wear for shits and giggles 10/10",
            "hell yeah\n\nedit: this shirt is sick! tried to find it online but it’s only sold in Ross/DD Discount type stores irl. I’ll just make a custom shirt just like this one myself i guess. Drake artwork is made by [https://x.com/imlllsn](https://x.com/imlllsn), seems they deleted it but danbooru page is still up here [https://danbooru.donmai.us/posts/5842236?q=drake\\_%28nikke%29+](https://danbooru.donmai.us/posts/5842236?q=drake_%28nikke%29+) thanks for sharing OP, this shirt rocks! (except the rizz part)",
            "Who ever tf made this ... thank you.",
            "Bro, I'd rock that everyday. Probably wear it too!",
            "First time posting here, and I didn’t see an appropriate tag for this, so remove this if this isn’t allowed. I saw this shirt at a discount store ☠️☠️☠️",
            "Drake must be the said \"Rizz God\" here.",
            "I'd wear that shit",
            "Honestly, it's pretty fire 🔥",
            "The real question is how many shirts did you buy?",
            "This is the hardest fit I've ever seen",
            "10/10 would sma- i mean wear to formal events",
            "the katakana on the right saying \"HIGH LIFE\" kinda brings the whole design together",
            "Omw to DD’s discount",
            "Real question here is: Did you buy it? It's pretty cool, and I would've buy it even if it's not my size lmao.",
            "I'll wear this at my friend's wedding fr",
            "Dammit Drake, appearing on a shirt knowing I cannot buy it. A real villainous move there. ",
            "He'll yeah",
            "Hell yeah",
            "Hardest shirt ever made",
            "If someone manages to get one I'll zelle for one.",
            "This is actually good deal",
            "maybe check alibaba or temu?! lol",
            "*breaths in \n\n\nWhere",
            "Shift up needs to track this person, and hire them as their official merch maker.",
            "I don't care who made it. I'm asking why it ain't a skin yet!",
            "Where can i buy",
            "Dang shit i need this one rn",
            "Unfathomably based",
            "I'll take your entire stock",
            "Immediate exchange of currency 💴 💵 💷 💶",
            "yes please",
            "https://i.redd.it/swfuf6esy38d1.gif",
            "this would make a bad ass gym shirt",
            "Speer hoodie but Nikke",
            "Idk but looks HELLA COOL🥊",
            "Ngl i feel like if we taught what rizz is to drake she'll definitely call herself that",
            "https://preview.redd.it/gglj5hw2448d1.png?width=269&format=pjpg&auto=webp&s=9eaa5f97c6f0a76906c7370f9e2d813244394e34",
            "What does high life have to do with anything",
            "HELL YEAH!!!",
            "Idk, but it should be easy to find out. How many people have over 1000IQ, after all?",
            "Brought to you by Skippy Toilet and Ticktock.  How do we prevent stuff like this from existing, please?  Like how do we stop people from wanting it?  \n\nIf there's one good thing about the internet and Reddit, it's that they instantly help you find the stuff that needs to be cancelled.",
            "INVEST!!!",
            "BRO I WOUDL WEAR THAT",
            "7$? BUYBUYBUY!",
            "Hell yeah",
            "Hell yeah",
            "Hell yeah",
            "HELL YEAH",
            "Hell yeah",
            "Hell yeah",
            "Hell yeah",
            "Hell Yeah",
            "Hell yeah",
            "hell yeah",
            "Hell yeah",
            "Hell yeah",
            "Hell yeah",
            "hell yeah",
            "Hell yeah",
            "Hell yeah",
            "Hell yeah",
            "Hell yeah",
            "Hell yeah",
            "Hell yeah",
            "Hell Yeah",
            "Hell Yeah",
            "Hell yeah",
            "Hell Yeah",
            "There are a lot of Stone Colds in here!",
            "Hell Yeah",
            "\\*glass breaks\\*",
            "Hell Yeah",
            "hell yeah",
            "Hell yeah brother",
            "Hell yeah",
            "Hell yeah",
            "Hell yeah",
            "Hell yeah",
            "Hell Yeah",
            "Hell yeah",
            "Huh why \"shits and giggles\"?",
            "Hll yeah, if I do find it bargin bin hunting Ill buy it",
            "how would u make a custom shirt out of it? i would like to know how to do that 😭😭😭😭",
            "Did you buy it though?",
            "Hope you copped it, OP.",
            "69 God",
            "Hell yeah!!!!!",
            "Hell yeah and that’s the bottom line cause stone cold said so!",
            "> shits and giggles\n\nIt's a decades old slang phrase",
            "Asking the real question.",
            "Run run run run run for your life",
            "WHAT?",
            "Sorry ... I didn't know that. English is not my mother tongue."
        ]
    },
    "The cycle that never ends ": {
        "title": "The cycle that never ends ",
        "score": 821,
        "url": "https://v.redd.it/so76c2ll728d1",
        "content": "",
        "num_comments": 25,
        "comments": [
            "https://preview.redd.it/6hqjy14x928d1.jpeg?width=520&format=pjpg&auto=webp&s=5a40e5dea9d6659cf412bfc91dccd8f11a432d59\n\nPeak",
            "Suffering builds Nikkes",
            "Average Scarlet lifestyle.\n\nhttps://preview.redd.it/hqgsp5r6g28d1.jpeg?width=1080&format=pjpg&auto=webp&s=e949ccf2a7d10005c33af7b2a98318ec51e07b7b\n\n[Scarlet‘s bond story in a nutshell (by Chokilicious)](https://www.reddit.com/r/NikkeMobile/comments/137vjh0/scarlets_bond_story_in_a_nutshell_by_chokilicious/?utm_source=share&utm_medium=web3x&utm_name=web3xcss&utm_term=1&utm_content=share_button)",
            "The illusion of work.",
            "It's even worse now that I've finished the campaign, lost sectors, advised all my Nikkes, and plateaued in the hard campaign and tribe tower 😭",
            "You roll and then you roll and then you roll and then you roll.",
            "The perfect loop doesn't exi...",
            "My with 24,000 gems and 40 tickets to get clay and nothing",
            "you used your 10k gems and didn't get any ssr\n\n*IMMA JOIN THE DAMN RAPTURES*",
            "Me sitting on my 130k gems for summer",
            "if the video ended with opening a pilgrim mold to receive a R unit, it would be perfect",
            "This is hilarious",
            "Most realistic version of this meme yet.",
            "Vietnamese MENTIONED",
            "broo that stage you showed, i was close to pulling my hair out. anyway back to drinking",
            "Meanwhile some psycho in my SP arena team spent 1400 gems today to try and get my spot",
            "The irony here is that...I have more luck pulling in Nikke than any gacha games i've ever played....like fr how do I get the new character in one pull?!?! 😭🤣😭🤣",
            "The F2P experience",
            "This truly was our N*gga Mobile, I MEAN NIKKE MOBILE",
            "Madlad",
            "Stop rolling for Nikkes that are going to get put in the common pool. I'm like 3-4 away from 100% ownership and I'm f2p. I have a Maxed 2B (10 copies). How you ask? I don't roll on useless-ass banners.\n\nYou're way more likely to get new Nikkes from the Wishlist system than you ever are rolling on their banner.",
            "![gif](giphy|Snd51fjjX6s0M)\n\nTHAT'S BECAUSE YOU DON'T HAVE FAITH IN THE HEART OF GEMS, KAIBA!\n\n*cries in 20K gems without SSR*",
            "Unfortunately it Thailand ad",
            "Well, statistically speaking, if you are rolling on a banner of a particular Nikke, then you have much higher chances of getting that Nikke that you will ever have when you put her on a wish list and then roll for her there cause over there it's still the same chances + 1 to 15 that it will be that one Nikke you wish... so yeah, when you want a specific Nikke, then rolling on their banner will always be the best chance for you to get her... granted, if you are missing multiple Nikkes, then putting them all on wish list and rolling for them there is the best course of action. But at the end of the day, this is a gacha we are talking about, so it all comes down to luck in the end. Some guy might be a f2p just like you with the same amount of saving up and skipping and pulling and he might not have half of what you have, cause he just didn't get lucky, it's that simple. It all comes down to luck, you can save up as much as you want, but you can easily go 100+ pulls without a single SSR, while some other guys can get 15 SSRs in 100 pulls, it's all just random so there is no rule or a set example of what to do here.",
            "That's why Wish List is a more efficient form of hedging your bets. You go from a 2% chance of getting one thing you want, to a doubled chance of getting *something* you want. If someone has truly awful luck they shouldn't be rolling on banners to begin with, because they're never going to roll the final 50/50 on their 100~ rolls to get what they want, whereas with wish list rolling it will be something they want no matter what, when it does eventually happen.\n\nComparing these odds is also not fruitful because the amount of tickets you get for each of these roll types is not even remotely close. Limited tickets (and gold milage) are simply too precious to spend on a character you can eventually max out over time, **especially** when armed with the knowledge that there are going to be limited banner Nikkes coming up, and soon."
        ]
    },
    "Anachiro Summer Outfit 👌👌": {
        "title": "Anachiro Summer Outfit 👌👌",
        "score": 522,
        "url": "https://i.redd.it/dep18vmws28d1.jpeg",
        "content": "",
        "num_comments": 23,
        "comments": [
            "[Anachiro in Bikini](https://x.com/lunati_nk/status/1804381194584211543)\n\nhttps://preview.redd.it/9cd309rbt28d1.png?width=4000&format=pjpg&auto=webp&s=16afffef5440e3da1e04734deeb78036e890ac59",
            "I want to spend my summer with her.",
            "Gyaaaaaaat. I hope the main story or anni redeems her. Then we can get this too 🔥🔥🔥",
            "You know its not the swimsuit that does it for me here, its that cute little happy smile she got.  \nMan i love her",
            "\"She's a heretic, something that can kill me without hesitation. I should avoid her.\"\n\nhttps://preview.redd.it/2m2s7ui6f38d1.jpeg?width=720&format=pjpg&auto=webp&s=f6da3d3e9ef7aadb00b98aa3290cb13489e7a680",
            "2nd Anniversary Pilgrim? Yes pls! ❤️",
            "This is so beautiful~",
            "She's gonna be a silent possessive girl once she's added to the roster, isn't she",
            "More art to add to my collection of her! I’m pretty sure I have every piece there is on the internet rn at this point. For sure I did at some point if I don’t now lol",
            "😳",
            "It’s always the villains that look so hot",
            "We all do 😊👍",
            "Just please don’t let her be liberation. I don’t want to see another Heretic get the Nihilister treatment.",
            "Yessir 😊👍,  I hope we can get her on 2nd Anniversary 🤗🤗.",
            "Pog theory",
            "Same :D",
            "Her smile is precious I agree 👍👍👍",
            "Understandable 🗣️🗣️🔥🔥",
            "REAL 🗣️🗣️🔥🔥",
            "In an Famitsu Interview, ShiftUP has stated that they don't plan to use Liberation Mode anymore. They will consider a revamp of the system, but they will likely put the Heretics in a banner.",
            "That’s good news, didn’t know about that.",
            "Thank god 🙏🙏🙏",
            "I figured. Nihilister was just a ball drop. \n\nAlthough I’m curious what these “revamp” will look like. "
        ]
    }
}