{
    "Welcome to r/NonPoliticalTwitter where you can browse Reddit without any concerns about politics showing up in your face.": {
        "title": "Welcome to r/NonPoliticalTwitter where you can browse Reddit without any concerns about politics showing up in your face.",
        "score": 827,
        "url": "https://i.redd.it/qfbfw4p7d4g91.png",
        "content": "",
        "num_comments": 24,
        "comments": [
            "White people twitter's subreddit is just politics, and it has gotten extremely unfunny and depressing. I am so thankful this subreddit exists because I just want to see some glorious fuckery on Twitter",
            "Any other major sub involving either Twitter or Facebook screenshots is just super political or stories about how shitty people are\n\nNo cat puns anywhere",
            "Please keep this a political free subreddit and respecting everyone's opinions.\n\nReport all rule breaking posts and i'll remove them as soon as possible.\n\n&#x200B;\n\nHope everyone has a great day.",
            "Holy shit, this is exactly what I was looking for.\n\nAll the other r/(x)PeopleTwitter subs just suck.",
            "Hey this is awesome.  Yeah WPT began as jokes and fun, but eventually turned into just a political activism sub.  Thanks for making this!",
            "Is this a challenge?",
            "why did you just randomly tweet “Escape the stress of the real world” lol",
            "*Image Transcription: Twitter Post*\n\n---\n\n**NPT**, @NonPoliticalTwitter\n\nEscape the stress of the real world\n\n---\n\n^^I'm&#32;a&#32;human&#32;volunteer&#32;content&#32;transcriber&#32;and&#32;you&#32;could&#32;be&#32;too!&#32;[If&#32;you'd&#32;like&#32;more&#32;information&#32;on&#32;what&#32;we&#32;do&#32;and&#32;why&#32;we&#32;do&#32;it,&#32;click&#32;here!](https://www.reddit.com/r/TranscribersOfReddit/wiki/index)",
            "Crazy stress",
            "Lol",
            "What's with the different colored flair tags? Is the red bird for Cardinals fans?",
            "Also r/facepalm has become way too political",
            "Yeah, it’s really been over the course of the past 3-4 years. Used to be hilarious, now it’s just constant zingers aimed at conservatives. It’s so unoriginal and exhausting.",
            "Exactly",
            "The issue is what’s political to you? Some thing such as REAL social issues affecting lives are unfortunately considered ‘political’ when it shouldn’t be. Some things  are a subjective perspective to what’s political. It’s depressing cus these are real issues that showcase the real depressing part of the world and how sadly they’re reality",
            "Yes",
            "Good human, and happy cake day",
            "It's the whole damn front page. When the problem was just starting most of the shills and propaganda were in the actual politics sub. Now theyve expanded to *every* sub possible. Finally had to filter /r/technology the other day.\n   \n Interested to see where this subreddit goes. We could use a whole collection of non political X subs",
            "Bro stop you just proving the point holmes",
            "just lookin for 5 minutes of humor, dude.",
            "No I’m not. Nowadays for instance a girl is the lead in the video game and it’s pOltiCal. Everything seems to be political nowadays. It’s a perspective thing when it shouldn’t be that subjective",
            "The top posts of white people twitter are almost guaranteed to be people talking about politicians needing to be replaced. If that's not political, then what the fuck is."
        ]
    },
    "Addressing the community regarding the \"No Politics\" rules": {
        "title": "Addressing the community regarding the \"No Politics\" rules",
        "score": 576,
        "url": "https://www.reddit.com/r/NonPoliticalTwitter/comments/1asphum/addressing_the_community_regarding_the_no/",
        "content": "Dear r/NonPoliticalTwitter,\n\nFor those of you who’ve never interacted with me, I am u/Aspect-Infinity. I’ve been a member of the r/NonPoliticalTwitter moderator team for almost a year now. The opportunity to address you all for the first time on behalf of our team is a humbling honor. \n\nI want to talk to you about some very valid questions that have arisen throughout my tenure here regarding our rules and how we enforce them. I’ve taken note of as many of these questions and concerns as possible so could escalate them to the rest of the team for discussion. This announcement is the result of that discussion and I’m glad to issue some much-needed clarification on what we consider political content, what we consider inciting political discussion, and how we’ve taken steps to address it. \n\nThis is gonna be a long thread so I encourage you to grab a snack while I go over this rule-by-rule. Let’s begin!\n\n**“ 1. No Politics or Political Discussions/Commentary. - That's the point of the subreddit”**\n\nThe most important and sacred rule we hold dear as a community. It’s a reflection of why this subreddit was created in the first place, to create a space similar to Twitter where public discussion can flourish, without the toxicity of politics. One of the questions that has arisen is “What do you consider political content/commentary?”, and so, we’re providing an answer to that.\n\n**We define political content as anything that has the potential to ignite political discussion, commentary, or discourse**. This potential is taken into consideration when we believe the content in question can be intentionally viewed through a political lens. \n\nLet's break it down further. We consider political commentary to refer to comments that try to insert a political angle where none existed before, or that shift the focus towards a political interpretation. We consider posts, comments, and even usernames as \"content\" within our subreddit. \n\n**Directly/Indirectly referencing political figures, policies, or movements:** \n\n* A tweet comparing two political candidates with derogatory and inflammatory labels\n* A post expressing strong opinions on a specific government policy and calling for action.\n* A comment on a non-political post that attempts to connect it to a political event or movement, regardless of relevance. \n* Posting a tweet sharing news articles about political events with clear commentary promoting a specific viewpoint.\n\n**Posts or comments encouraging debate or argument on political topics:** \n\n* A post asking users to choose sides on a contentious political issue.\n* A comment starting a debate about the merits of a political ideology.\n* Sharing controversial political cartoons or infographics designed to elicit strong reactions. \n* Encouraging users to vote for a specific candidate or party.\n\nStill confused? That’s alright we have some examples! \n\n**Example A: (Non-Political Content)**\n\nA post containing a tweet memeing a celebrity known for their political views doing something funny. The humor focuses on the action, not their political stance. \n\n**Example B: (Political Content)**\n\nA Redditor makes a post with a tweet that features a masculine, caucasian man with a MAGA hat and a shotgun with the caption “This guy isn’t playing with those liberals”. This would be taken down because its primary focus is political (particularly the Second Amendment). \n\n\\--- \n\nIt’s important to remember that we don’t consider tweets focusing on sexuality, gender/gender identity/gender presentation, religion, or nationality inherently political. Although, should a subtext be present that is political we will take action. \n\nWe hope this clears up our stance and intention behind setting these rules in place, we encourage anyone with any questions to comment below, and we will respond. \n\nHappy New Year to you all!!\n\nYours,\n\nThe r/NonPoliticalTwitter Moderator Team",
        "num_comments": 87,
        "comments": [
            "Me again - Just wanted to remind everyone that I and possibly other moderators will be responding to questions or concerns here.  We ask that you remain respectful towards us and your fellow Redditors.",
            "One of my favorite subs bc yall don’t allow political shenanigans in it. And yall do great!",
            "I gotta tell you, this is definitely one of my favorite subs. Absolutely love the job you guys are doing. Thank you. \n\nThis is where I go when I need a laugh. I am constantly sharing content with family, friends and others. I always seem to find something that picks me up. You have made some dark times better.",
            "This. I mod a small sub, r/Eevee to be exact. Just recently, mods decided to, and I quote from another moderator and a user on the sub, enforce “martial law” >!not political lmao!< in order to get posts back in check. We were too nice about the NSFW rule and it caused a lot of trouble, though the full story doesn’t matter here (if you care enough feel free to ask I guess lol, no offense otherwise).\n\nIt’s what I imagine being a middle school teacher is like, people trying to cause trouble just for the sake of it. Sometimes, strict rules are just the best because if you give an inch, they won’t take a mile they’ll try to take the whole sub, and it’ll ruin the fun for everyone. Hell, it’ll ruin the sub for you because moderating posts from rogue users sucks. Ever since we banned a single person, everything has been easy, for mods and for users. Good job at the fight for keeping this an innocent safe space, even if some think it’s strict! It’s nice to have a place to hide from the world, yaknow? \n\n~ Eevee Mods",
            "I had one comment removed from here for being political.  I think it was super edge-case-y, but I do appreciate the hard-line approach because otherwise it's way too easy for that stuff to bleed through otherwise",
            "Ok cool\n\n![gif](giphy|MDJ9IbxxvDUQM)",
            "Just want to say that I really appreciate what the mods have done with this subreddit. I've seen so many subreddits ruined by political \"discussion.\" It just destroys the vibe, even when it's a political stance I agree with. It's nice to have a subreddit that's just here to have fun.",
            "> we don’t consider tweets focusing on sexuality, gender/gender identity/gender presentation, religion, or nationality inherently political\n\n\nStrong disagree, if you're still taking input. Tweets focusing on those topics often involve people's socio-political views.",
            "I honestly have a ton of respect for the mod team on this sub.\n\nHonestly, it astounds me how many miserable redditors come to this sub and try their hardest to weasel around the rules and make the discussion political.\n\nI'm tired of mods who claim to be non-political and then also defend politically charged posts because \"this clearly isn't/shouldn't be political (and also I agree with it) so it stays up\"",
            "As you may guess from my post history, I actively like politics, but it's so refreshing to have a subreddit *with* genuinely funny stories, observations, and gags, and *without* uneccessary political commentary alongside it.",
            "What prompted this explanation? The sub hasn't been in my feed too much. Has there been some politicization?",
            "I really appreciate this sub. Given the nature of politics it is obviously going to be difficult, and there will always be a need to be arbitrary with some more ambiguous posts. You're doing a good job mods :)",
            "Honestly some of the best modding on the site. Not like party x am I right or am I right?",
            "Thanks for this. This is one of the best subs of Reddit at the moment in my opinion",
            "Honestly, I would take an even harder line. Though, to be honest, I don't have high hopes for the sub anymore, it's really hard to moderate because politics is a large part of the culture these days and it seems to me like there was an influx of new users the past year or so that lead to lot more political content being missed / ignored. Here are a few examples:\n\n[Legitimacy of bi women dating men](https://old.reddit.com/r/NonPoliticalTwitter/comments/1890rrs/what_do_you_think_bi_stands_for/)\n\n[Capitalism's negative effect on city landscape](https://old.reddit.com/r/NonPoliticalTwitter/comments/17681rg/europeans_cannot_comprehend_this/)\n\n[What men should carry to avoid being labeled as feminine](https://old.reddit.com/r/NonPoliticalTwitter/comments/14iop95/carrying_anything_is_a_feminine_trait/)",
            "https://www.reddit.com/r/NonPoliticalTwitter/comments/1anrk6t/glad_they_got_it_straightened_out/\n\nCould you clarify why this post wasn't considered to have \"potential to ignite political discussion, commentary, or discourse?\"\n\nA twitter argument about the pride flag is absolutely politically charged, unless we're pretending that gay rights is *not* a hot-button political topic (whether it should be or shouldn't be, it is). Sure, sexuality isn't inherently political or politically adjacent, but this twitter spat absolutely is.",
            "What about users with the Palestine flag emoji in their twitter names? Unfortunately that causes a reminder of politics and real world stress for some",
            "I agree with this but, \n\nIn your example, wouldn't the MAGA hat be the political item? A shotgun isn't inherently political lol",
            "Just wanted to say that I love you guys. I hardly interact here, but it’s the sanest place on Reddit.",
            "I appreciate your efforts here. It's one of the only subs left that's continuously funny and not full of grandstanding or bellyaching.",
            "What is the stance on inherently political topics that are not technically political but are hot topics in politics right now? It seems anything to deal with transgenderism / transgender children / trans or queer pride for children ignites political discourse in almost every circumstance, yet it falls under sexuality and identity, which is not considered political? There are probably a lot more of those types of topics that many would not consider political, but unfortunately are now.",
            "Great job on the sub so far. I feel there’s room to be even LESS political. Ideally, I’d like to see no content which would rely on sexuality, gender, gender identity, religion, or nationally. A focus on more irreverent humor. Although these topics aren’t inherently political, the decision as to whether each joke is political *is* political in and of itself.",
            "Thanks for this. I love that there's a space with no politics and I usually enjoy this sub. I'm glad for the clarifications.\n\n\nI am a teacher and last month I mentioned something about capitalism, which is an ECONOMIC SYSTEM, and was banned for a few days, which I felt was unfair. People talk about capitalism in a political way, but it IS, itself, an economic system and I don't think mentioning it should equal banishment. I do understand it can become a political discussion, but I was not engaging in a political discussion. I was talking about it as an educator. I get you don't know I'm a teacher, but I beg you to think about whether something is inherently political or not before banning people. I know it's a busy job to be a mod, so I definitely try to avoid potentially political topics in here now. I just hope this is something to consider. Thank you! ",
            "Deciding what is and isn’t political is in and of itself inherently political. Ironic. \n\nNah jk I like this sub and I think the mod team is doing a great job for the most part already : )",
            "After coming back from Lemmy (literally everything, from top to bottom, is unnecessary politicized, no matter how unrelated it is), I appreciate the moderators of comedy communities more, specially this one and r/ funny. It's so easy to derail a comedy focused community into political rambling because \"everything is political\" or use a \"joke\" which is just clearly disguised propaganda. Some people are unwilling or unable to understand that no, I don't want to be bombarded 24/7 with politics and develop depression.",
            "Im a mod at r/politicaldebate, we could help your cause potentially. \n\nWe're partners with various subreddits like r/askmen and r/quityourbullshit as a outlet for political discussion, we could partner with you all as well. \n\nThey list us in their rule descriptions, something like \"no politics, if you want politics go here: r/politicaldebate\".",
            "\\*looks at watch\\* Happy New Year? This is some Chinese govn't propaganda! Get 'em! </s>\n\n&#x200B;\n\nSerious question, tho - what if example A wasn't a \"celebrity\" but a political candidate or pundit? Someone who is only known for their political standing?",
            "realized what a fucking weird place some of the other twitter subs have become and this is a relief. thank you guys,",
            "I do think anything pertaining to \"identity groups\" (religion, sexuality, ethnicity, etcetera) is a fine line, and I've noticed people from political communities seeing what they can get away with. Also a bunch of political usernames, but that's harder to make a call on.",
            "Reminds me of r/CasualUK, which thrives with a rock-solid no politics rule.",
            "I DON'T VOTE... AND NEITHER SHOULD YOU!!!",
            "You can hold a rat underwater in a bucket and it’ll kick and scratch, but eventually it will go limp and you’ll have a drowned rat in your hand",
            "A bit late to the party, but first and foremost, thanks for making this a great sub!\n\nOne thought I'd like to float to you guys: recently, there have been several times when someone's posted a screencap of some inane influencer/celebrity drama from Twitter with little or no context. This seems like it's tailor-made to stir up arguments and drama in the Reddit comments here when people are discussing it, usually because the influencer in question has done something especially heinous or stupid to anger a lot of people.\n\n\nThose drama-bait posts seem like they defeat the whole point of this sub, which the subreddit header describes with, \"Come vibe with us as we escape the stress of the real world around us!\" \n\nIs there any chance you guys can add a rule about not posting Twitter drama in here? Thankfully the mod team here has usually done a good job of getting rid of them, but I think it would help make your lives easier (and keep the sub a calmer place) if the rules specifically mentioned it. Thanks for considering it!",
            "Thanks, it's a struggle but we try!",
            "Agreed!  Send the political hacks back to their echo chambers. You know the ones. All the same users constantly post to the same subreddits like r/politics, r/whitepeopletwitter, & r/smallcock",
            "I feel you. We're glad the sub has gotten you, and your family/friends so many laughs. Here's to less dark times 🍻",
            "as a browser of r/eevee, thank you for that by the way\n\nthe uh... \"questionable\" glaceon art (and comments on the normal art) was kind of irritating lmao",
            ">eevee\n\n>nsfw \n\ni should not be surprised...\n\nthings like this would make me lose faith in humanity. but at this point im not sure if i have any left lmao",
            "Love that sub, appreciate what you guys do!",
            "Perhaps, this hasn't been the case in our experience. Nevertheless, I'll escalate this to our team. For now we remain firm in our stance.",
            "On other non-political styled subs i'll sometimes reply to a non-sequitur political comment with how many replies until a political figure is brought up for no apparent reason. It's a fun game.\n\n\"I love this book!\", \"Oh, you must vote for \\[politician\\].\", \"Replies until politics: 1\"",
            "\\>checks history\n\nYou seem pretty chill",
            "We've had an uptick in comments requesting clarification on this rule in particular. It's been something I've made note of for a while and since we're a decent ways into the New Year we thought it would be beneficial to put forth an explanation.",
            "The first and third examples are allowed, the second could be considered inciting political discussion but it would have had to be viewed through that lens. I'll escalate this to our team anyways so we can improve on how we handle stuff like this. Thanks for raising this our attention.",
            "We've commented on why that post isn't an issue before but I suppose additional clarification is needed. \n\nThe post didn't mention or display any political ideologies, it didn't talk about gay rights, and it wasn't promoting an obvious political agenda from either side. Given the context we didn't believe the content in question would result in political discussion but we were prepared to moderate any instigating comments which we did ultimately end up doing. This was evident by the significant mod presence. \n\n  \nIn short, there was no subtext present that we determined was worth a complete removal. If the post had a subtext that was so significant we couldn't just take the conversation at face value nor expect others to do so we would've removed it for violating rule 1.",
            "Ohhh, interesting question. They wouldn't be taken down assuming the flag or the on-going conflict isn't the focus of the tweet/post. If the Redditor has either flag in their username they will be permanently banned until they change it. I hope this answers your questions.",
            "It would be taken down for the shotgun because of the implications of the MAGA hat. You're right that the shotgun on its own isn't inherently political but we also expand the scope of our investigation to see if other stuff in the post could have certain subtexts that might violate rule one.  Great question!",
            "I honestly do agree with you and try to remove most “controversial” posts but as the subreddit grows we also get stretched thin.",
            "They have to have a hard, because, even if your comment is not political itself, the followings comments will get it to that direction \"capitalism bad, Am I right folks?\". Just like a meme or meme template with a politician can be funny by itself, the comments can turn sour pretty quick (bashing the politician).",
            "Thanks for sharing your experience, but I disagree with you on the capitalism front. As a team, we've seen when economic systems like capitalism or communism or just economic systems in general are mentioned it can cause rule-breaking behavior. \n\nI've looked into this situation a bit further and it looks like your comment spawned multiple political-based comments which is something we try to avoid.  As for banning, we often issue\"ban warnings\" which are warnings accompanied by a 1, 3, or 5-day ban to get our point across so to speak. That looks to be what occurred here, I wouldn't take it too seriously since you've seemed to learn from that experience.   \n\n\nFinally, we don't know the person behind the screen, and we genuinely try to look at it from their perspective. Even as an educator, we do not permit discussing content contrary to any of our rules even if it's in an educational context. For moderation purposes, it's simply easier that way and for that I'm sorry. But I hope you know we will consider your feedback when handling future situations like this one.",
            "The mods need to ban themselves now",
            "Sounds interesting, I'll escalate this to my team and we'll get back to you via ModMail if anything comes of it.",
            "Under normal circumstances, we'd say that it depends on the context they're being used in. In this case, we'd remove it and evaluate if the OP tried to intentionally incite political discussion and if we believe the latter to be true we may issue a 1,3, or 5-day ban warning. Awesome question!",
            "Yeah, we don't stand for that mess here. We permanently ban users with blatantly political usernames until they change them.",
            "Doesn’t that apply to all animals you could fit into a bucket and your hand?",
            "Hmm, interesting thought. Definitely noticed people trying to insert Twitter drama into threads. I'll bring it up to the team. Thanks for giving us feedback!!",
            "Hahaha! Truth!",
            "Mod Idea: Ban those who participate in those subs :thinking:\n\nEdit: was joking dw",
            "Yeah, and the thing that makes it worse is that the sub has a noticeably young user base.",
            "Thanks, I try",
            "I moderate a very large politics sub you've probably never heard of, and I know how hard modding can be. I've also been around this sub (r/NonPoliticalTwitter, that is) since the very start. I'm also a big advocate for LGBTQ rights, and belong to that group myself\n\nThat said, I think it's kind of interesting that the only one of those three that caused a lot of political discussion and nothing else was the first. I think it's not only a trite and drab tweet, it's also intentionally incendiary and ragebaiting.\n\nThe second one, barring the title added by the creator, is obviously just a joke and everyone understood that. No political discussion ensued, really.\n\nThe third is also obviously political.\n\nI agree that LGBTQ-related content and such isn't political in itself, but there's a big difference between \"I [M] took my husband [M] to the movies yesterday and he kept yelling fire\" (or whatever), and something that's obviously designed to be political bait.",
            "‘If gay people have a flag, then straight people should too, that’s not fair.’\n\nthat’s 100% a politically charged statement, and the idea that that doesn’t have the strong potential to ignite political discussion is a bit mind-boggling to me.\n\nFrankly I disagree strongly with what you’re saying, but you guys do this for free and I appreciate, so I won’t press on it any more. Thanks!",
            "Honestly this was refreshing to see, especially when so many communities with \"no politics\" rule will just use it to remove anything even remotely LGBTQ adjacent. My existence is not a political statement!",
            "This feels like an algebra problem ",
            "What if it was just the shotgun, with no hat? (No clue why a picture of a guy holding a shotgun would fit here, but regardless).\n\nReal world example: that picture of post malone open carrying in (I think) a supermarket",
            "Gotcha, makes sense now",
            "I meant the twitter usernames, which is why it's tricky.",
            "Appreciate you!",
            "It’s crazy how they all post to those subreddits. And it doesn’t seem like a coincidence…",
            "Maybe don't, there are a lot of refugees from whitepeopletwitter that aren't always ready to fully let go of a sub that's become a pale shadow of itself.",
            "I don't agree with banning people who belong to a sub you don't like.",
            "nah, just because theyre in those subs doesnt mean its guaranteed that theyll be political here",
            "You are free to disagree, and I'm sorry this has proven to be confusing. If you have any additional questions or want to discuss how this works more I'm always free to chat.",
            "They do have a flag. Its all white, so you can never see it",
            "It's not, but it's still politically divisive for no reason whatsoever.\n\nDitto for being an atheist.\n\nThat's my rule: If it gets both sides divided in any way, it's political. No exceptions.",
            "Lol, it's like that sometimes.",
            "It is the Elmer Fudd inequality.  Fudd with shotgun, “just a guy hunting wabbits.”  Fudd with a red hat?  Something different entirely.",
            "If it was just the shotgun, no hat, and the caption wasn't antagonizing more than likely it would be left alone unless it was violating another rule.   \n\n\nAs for your example, that depends on the context and what other factors that could lead to removal. Let's say the caption wasn't antagonizing, and there's no political subtext. In that case, we wouldn't remove it, but we may monitor it by using features such as crowd control so we can catch those pesky instigators. \n\nExcellent question and example, hope this clears it up.",
            "Depends on the username and how much we feel it could invite political discussion.",
            "Seriously, anyone that makes politics their entire personality is the whole person equivalent of genital warts.",
            "In that case, 99% of the subs content would be declared political and ban rates would skyrocket.",
            "The problem with that is that many generally apolitical topics can get particularly over-invested, unreasonable people riled up along political lines.\n\nYou have to assume reasonability. The average reasonable person probably isn’t going to feel strongly one way or the other about the appearance of a video game character. \n\nBut some unreasonable people may get angry that a female video game character, like Aloy, for example, isn’t attractive enough to them and turn it into a discourse with political overtones quickly. That doesn’t mean the topic of Horizon: Forbidden West is inherently political. Most reasonable people would discuss its story or its gameplay, or talk about how the machines are neat or something. \n\nA loud minority will bitch about the main character’s physical appearance instead, and make it political when it really never needed to be.\n\nSorry if this example actually veers into politics. I tried to keep it vague but I wanted to explain how a generally apolitical topic can be turned political when a loud minority of angry people gets involved, and how that doesn’t turn the base topic inherently political.",
            "That would be allowed unless the caption or the post title is trying to frame it in a political context. If it's just as you described then we'd focus on the comments and deal with any instigators.",
            "Well his hat does have red on it. It’s not much, but its still there.\n\n![gif](giphy|3oFzmpOB6IYecRY5eo|downsized)"
        ]
    },
    "Brooklyn seems like an insane place to be": {
        "title": "Brooklyn seems like an insane place to be",
        "score": 3544,
        "url": "https://i.redd.it/c9uryghs028d1.jpeg",
        "content": "",
        "num_comments": 64,
        "comments": [
            "Guy driving that DOT truck might want to go into hiding himself",
            "86, just a fuckin’ kid\n\nit’s sad when they go young like that",
            "Did NYC DOT enact street justice or was it just a clean sweep?",
            "This guy had a huuuuuuuuge ass",
            "Lmao this whole comment section reads like it's an AI prompt to generate jokes written by mobsters",
            "Tony cakes gone too soon. I'll miss his glorious cakes as he walked away.",
            "This is some Quentin Tarantino shit",
            "decapitated?????\n\nedit: Holy shit there's a video on Twitter and yea it's rough. That poor fucking driver",
            "We had a funeral for a bird.",
            "Somewhere Jerry Orbach is looking down and smiling at this",
            "Tony [Pan]Cake[ed by a dump truck]",
            "Sounds like someone in the Department of Transport was on the take ... On the take for Cake.",
            "Jimmy the \"DOT\" truck driver sends his regards. ",
            "Lol you think the police were going to give a mobster a favorable quote? Guys prob responsible for the death of hundreds",
            "I'd watch an isekai with an old mobster protagonist.",
            "![gif](giphy|mks5DcSGjhQ1a)",
            "Casual victim blaming. He was a mobster, but it could have been anybody. You aren't allowed to run someone over just because they are in your way. It's always the driver's responsibility to not hit things or people with their vehicle. Walking down a street is not a crime, killing someone with a truck is a crime.",
            "Police Brutality",
            "He’s a mobster, so it’s not out of the question to say it was intentional",
            "Jake Peralta?",
            "*Look how they massacred my beautiful Cakes*.",
            "JoJo Part 4 spoilers",
            "A truck that does Damage Over Time?",
            "the older thay get the more you have to hide from the rest of the family",
            "At least now we know what kind of truck Frank Castle drives.",
            "Mobsters are often associated with waste management companies, at least that’s what I learned on The Sopranos.",
            "Eh, idk, that quote kinda sounds like the person knew him. I could see them going either way with it.",
            "![gif](giphy|i4bA5JVSuzMnZH1N8W)",
            "Carma",
            "Miserable bastard, but the guy was caked out like a Kardashian. That’s why we called him Tony Cakes, because the nickname always starts with Tony and this guy had fucking CAKES. And they were soft.\n\nMay his soul burn in hell and his cakes rest in peace.",
            "WHEN THEY GO???",
            "That animal Blundetto, can't even say his name.",
            "Tony Cakes, whatever happened there",
            "\"He shoulda been in tha club!\"",
            "When they go!?!",
            "Your brother, Tony Cakes, whatever happened there.",
            "Very allegorical tho",
            "dot fuck him up",
            "I googled Tony Cakes + Ass",
            "Thats because all redditors have been trained on the same dataset and have the creativity of a King of Queens rerun. Oh and they have start inbreeding their jokes resulting in a degenerating dataset.",
            "r/thesopranos is leaking",
            "Everybody immediately assumes you're mobbed up. It's a stereotype, and it's offensive.",
            "Jokes? It’s a fuckin nickname, his family name is jokarelli ",
            "How old are you? Reddit was like this long before ai was a thing.",
            "That video is way crazier than I expected",
            "posting this shit without sauce should be illegal",
            "You're not real man!",
            "Tony Cakes, 97. Pancaked by drunk dump truck driver.\n\n\n> They dont stay babies forever, idiot!",
            "Absolutely. I drive with a CDL, and all of your instructors warn you explicitly and over the top how it's your responsibility to always be aware of your surroundings. This is on top of the notion that pedestrian is always right. This guy drove impulsively and without care about either of that.",
            "Cakes? it’s a fucking nickname, his family name is Cakerelli",
            "They 86ed the Cakes!",
            "Legendary mob baker.",
            "COME ON EH? It was Little Carmine for that whore he was fucking",
            "wop wop wop wop wop",
            "Yea, but when this guy said “it’s caking time” and caked all over the place \n\nBest shit ever ",
            "You didn't have to do my boy, Doug Heffernan, like that.",
            "Oh, with the fuckin water heater again? *[hand gestures]*",
            "Yeh same lame joke spammed non stop for years on end. Atleast i havent seen them doing that comment pyramid thing as much as theh used to.",
            "Probably why the driver looked like he was gonna off himself if you watch the video. I'm sure he knows everything you just said and it's keeping him up at night.\n\nNot defending him I agree with you of course I just felt it's worth remembering that everyone in this video is just human and sometimes shit just happens",
            "The nickname is based on a  prominent family characteristic. His great grandfather was Duncan Hinders.",
            "> whore\n\nwhoour^^^^^gabagool",
            "In hindsight might not be the best choice for an Italian person",
            "Imma do my shtuff.",
            "A Hind-D?!"
        ]
    },
    "Baked": {
        "title": "Baked",
        "score": 4593,
        "url": "https://i.redd.it/bukm3dyqky7d1.jpeg",
        "content": "",
        "num_comments": 37,
        "comments": [
            "Having flashbacks to the time I was high as fuck and looking for my phone in the dark....using my phone's flashlight. The worst part is it really took a good 5 minutes of tossing things around for me to realize I was holding the shit the whole time.",
            "Makin shitty cookies cups. I too have done this while high. Admittedly, with greater success.",
            "I mean, they still look edible….",
            "Flip them over and put a scoop of ice cream in them",
            "My main issue with this I dont trust the cleanliness of the bottom of my baking pans.",
            "Literally Baked",
            "Ice cream bowls",
            "I miss the time when I could get so high that I would fill my Britta with water from my other Britta",
            "Puzzle cookie :)",
            "Now use them as ice cream bowls",
            "Niffum.",
            "Dude, I’m stoned af and that looks amazing. I kinda want to try prying it off and just eating top to bottom like a cartoon mouse eating a cracker.",
            "This dude eating beans. Accurate username",
            "I understand why someone would think this would work",
            "Hold up, let him cook",
            "https://www.youtube.com/watch?v=aEW-j_OLh5U",
            "icecream bowls are made",
            "\"am I cooked\"mf when they have cookies to make",
            "The thing that keyed me in to what I was doing was when I realized I would be able to see better if I covered the back screen of my flip phone that was lit up...",
            "And im sure those 5 min felt like a year",
            "At least you had the excuse of drugs. I've done that shit sober :(",
            "One time I had just moved into a new apartment and needed scissors and was getting upset I couldn’t find an app for scissors. So.. ya.",
            "Just add ice cream!",
            "In fifteen minutes that mofo would be gone in our house.",
            "Actually looks like a huge win , considering you still have a house,1,and those don't look burned,2,you got them out of the oven without burning yourself,3!!",
            "Superior if you prefer the edges. It's like those all-edges-brownie trays you can buy.",
            "I was thinking the same thing. That or whipped cream.",
            "...do you not wash the bottom?",
            "I’m not too concerned with the cleanliness of anything I routinely bake at 350 degrees.",
            "You really britta’d that one.",
            "I think this is a normal thing that happens to people from time to time. Looking for the thing you're holding.\n\nEveryone who wears glasses has searched for their glasses while wearing them at least once.\n\nThat shits worse, cause you're not blind while you're doing it, lol.",
            "Yeah I don’t weed to be tired and disoriented. I get that for free 🤩",
            "This man aint washing his bottom",
            "Bottom of the muffin pan is like legs.  Wash if visibly dirty, otherwise the runoff will take care of it.",
            "Nor his ass",
            "Eewwwww"
        ]
    },
    "A message from today’s sponsor": {
        "title": "A message from today’s sponsor",
        "score": 2260,
        "url": "https://i.redd.it/g4umjbz31z7d1.jpeg",
        "content": "",
        "num_comments": 10,
        "comments": [
            "“And I’m sure you’re wondering, Sheev, how did you successfully hide not being dead for so long? Well, let me tell you: NordVPN.”",
            "Palpatine's master was actually Raid Shadow Legends all along",
            "Anakin: but how do I get the title of Lord?\n\nLet me tell you about our second sponsor",
            "Only a sith deals in ads",
            "And the teacher is named Ziro, the Basic-speaking Hutt.",
            "1200 upvotes, 7 comments.  Either this is guerilla marketing or someone isn't being paid enough for the advert.",
            "Thought the Nord VPN plug in Acolyte was, to be completely frank, really weird and off-putting. It's really a shame to see the franchise headed this way.",
            "[If Movies Ended Like YouTube Videos](https://youtu.be/HRf5gMTDdcU?si=ia8tLyFlIerK7SL_)",
            "Do It!!!",
            "\"Ruling a galactic empire can be stressful. That's why I use today's sponsor: Better Help. Better Help can put you in contact with licensed xenotherapists who specialize in over 260 species and counting.\""
        ]
    }
}