{
    "this guy got -1 comments": {
        "title": "this guy got -1 comments",
        "score": 1188,
        "url": "https://i.redd.it/lejzptynb18d1.jpeg",
        "content": "",
        "num_comments": 81,
        "comments": [
            "He owes someone a comment",
            "Bro got downcommented",
            "How do they know what house keys taste like",
            "there is no hill more noble to die on than that one",
            "Yeah they taste like house keys, but no place like home  baby as they say",
            "House keys taste like office keys",
            "This subreddit really is the antidote to the general internet.",
            "How the fuck 😂",
            "I’m tempted to lick my 6 years old house keys",
            "Is this saying that nipple piercings taste like house keys or that a pierced nipple with nothing in still tastes like a house key?",
            "[deleted]",
            "Imaginary or negative comment.",
            "I love tasting house keys",
            "dang",
            "As he deserves.",
            "House keys be tasty asf tho",
            "I know it’s not interesting, but I’d actually die on two hills… from metal poisoning 😵🪦",
            "I don't talk to people who suck on house keys either.",
            "He's right.",
            "He deleted a non-existent comment ",
            "#-1",
            "have you not gotten bored as a kid and tried to eat them",
            "Have you been late driving your kids to school while carrying lunch bags, work backpack, workout bag, science projects, and a leashed dog to dropped off at doggy care? You would be chewing the keys to your home and/or your car while you almost fall putting in your shoes and almost fall again when your happy dog pushed you to the car as if he is not taken to doggy care three times a week.",
            "They taste slightly metallic, usually a coppery taste",
            "\"Hey, 80 bucks is 80 bucks.\" is mine.",
            "It brings back childhood memories",
            "Hot take",
            "Its metal",
            "That was going in a VERY different direction in my head until I finished reading it",
            "or is it the nipple itself?",
            "Well that really depends on your personal taste.",
            "L take",
            "All piercings or just nipple piercings?",
            "There's no comment in ba sing se.",
            "#",
            "###-2",
            "I eated battery once",
            "Kid? Brother I chew on them all the time!\n(Autism)",
            "Never",
            "I use to hear “Hey, 20 bucks is 20 bucks”. Damn inflation is getting out of hand.",
            "Dirty pennies",
            "LMAOO It wasn’t supposed to be an intentional double meaning joke 😭",
            "[deleted]",
            "[deleted]",
            "Elliot Sang moment",
            "#-3",
            "Yeah i can tell",
            "I accidentally put a little buttery deep inside my nose as a kid. That was funny (funny ride to the hospital lol. never do that)",
            "I drank detergent once",
            "And then my tongue itched and developed some little hills",
            "Username.......... Checks out? I guess???",
            "they tasted so good...",
            "cool, sausage.",
            "Not everything people do is an attempt to seduce you",
            "I believe you missed the \"taste\" joke",
            "You made this way weirder than it needed to be.",
            "Yep although earrings usually don't count.",
            "Never be 4th reply",
            "Cyclowop",
            "#-4",
            "I laughed so hard at this omg",
            "my dad was a nurse and there were so many stories of kids getting stuff up their noses",
            "One day as a child I randomly decided to just put a hexagonal nut into my ear, it just perfectly fit and sat there for a while that I forgot it even existed. It caught my mom's attention and she made a big stressful deal about it for a minute, then I just grabbed a tweezer and took it out the first try and went back to making Transformers out of clothespins. I also remember trying to put a digital scale battery in my ear but it didn't fit, that one would be a nightmare to deal with.",
            "WHAT DID IT TASTE LIKE IVE NEEDED TO KNOW THIS FOR YEARS UPON YEARS!",
            "And I almost (I think) drank a gasoline, thinking it was a freaking grape juice \n\nIt was contained on a soda glass bottle\n\n\n\n\nI still remember that green hospital walls",
            "That's brilliant, Detective!",
            "What'd they say",
            "But as a downcomment shouldn't it be upvoted?",
            "… but I’m the third, my comment literally says it. You’re the fourth",
            "Now that's right",
            "So Noses are the kids version of assholes basically",
            "Just some weird tangent about women wearing makeup to biologically seduce men and why that makes piercings a fetish.",
            "No",
            "You may have the third number but you are the fourth comment in the thread",
            "your username 💀💀💀",
            "The Extract Expert over here.",
            "LMFAO",
            "*no*",
            "They said the fourth reply",
            "It's reddits fourth comment rule, I don't make the rules I just enforce them",
            "Not so Sunny now are you?",
            "Now wait, fourth reply or fourth comment?"
        ]
    },
    "I have 7 AA batteries and you don't": {
        "title": "I have 7 AA batteries and you don't",
        "score": 133,
        "url": "https://i.redd.it/t0q6zwzrl38d1.jpeg",
        "content": "",
        "num_comments": 47,
        "comments": [
            "This! So not interesting! Thank you.",
            "my loss",
            "Ok ok you won i lost",
            "Yes I do",
            "Menetys",
            "suomi",
            "jokes on you i have 78 AA batteries for my final project",
            "I loss my word",
            "I have more than 7 AA batteries BUT they aren’t *Rainbow* branded batteries.\n\nYou win.",
            "Nah, I'd win.",
            "[Yes i do](https://imgur.com/a/C8ec1mN)",
            "i have 12",
            "Damn i got only one.",
            "You’re right, I have 48",
            "so many batteries, i'm at a loss for words",
            "Ha jokes on you, I do\n\n(Sadly can't post images in the comments so here's a [link](https://cdn.discordapp.com/attachments/868904887067488307/1254055483304575016/20240622_144724.jpg?ex=667819ae&is=6676c82e&hm=b5a3a71c43acebae589cc67144df796007a1344f0084958b2454c6d73c4b03e4&)",
            "I do actually",
            "I'm better. I have 9 AA batteries 😎",
            "And you’re from Finland!",
            "i think average capacity is around 500mah what do u guys think",
            "Is that all?  I buy the jumbo packs",
            "loss",
            "Nah, I have. Even more",
            "Is this loss of power?",
            "Is this lost",
            "Can I have one?",
            "I bet I have more battery operated equipment than you non the less🤓",
            "actually i do! but on different brands so that might not apply",
            "Damn you're right I only have 4",
            "I have 26 for no fucking reason 😂",
            "WHAT THE FUCK?!?!?!!?",
            "I had a lot but they seem to be *loss*",
            "I WOULD have 7 if only I could stop EATING THEM ALL.......  \n\n\nGosh d\\*rn duracell, making their batteries so frickin' delicious.......",
            "I counted mine and, you're right, not even close :(",
            "I'm at a Loss to what this means",
            "Oh well",
            "But I do have 7 aa batteries",
            "bro has AAAAAAAAAAAAAA",
            "OMG sooo funyyyy hahahaha",
            "I have 18. That implies that I have 7, and a few more in addition. You know what? I give 11 batteries to my cat. There. Now I have 7 and no more.",
            "Yes I do too, altho not with this print",
            "nah, I'd vim.",
            "i think its more like 420",
            "What does your cat need 11 batteries for?",
            "My man!"
        ]
    },
    "i slipped 🤕 ": {
        "title": "i slipped 🤕 ",
        "score": 3933,
        "url": "https://www.reddit.com/gallery/1dl7p8j",
        "content": "now who left that there? ",
        "num_comments": 173,
        "comments": [
            "top 10 tragic events in history",
            "Banana peel for scale",
            "Wasn't me i swear",
            "Smol guy :3",
            "Sry i did it",
            "🍷 \\*gulping\\*\n\nit was ME.",
            "#STAGED",
            "Good news, I have this cool new pill of fentanyl.",
            "I'm not sure why, but I internally played the mario death sound effect in my head",
            "it was me, but you'll never know WHERE will be my next move",
            "Not a far fall thankfully",
            "This is so sad. Alexa, play the last 17 seconds of Viva la vida",
            "Are you still failing?",
            "Oh no! 😧",
            "dang bruh nice shoes.",
            "Yo he’s cute",
            "Does Willy Wonka provide workers compensation?",
            "Luckily the ground isn't that far though",
            "NOOOOOOOOOOOOOOOOOO",
            "Learn how to walk",
            ":O",
            "Is the banana ok?",
            "oops, my bad",
            "You look fairly content ... until tragidy hits and drags you down",
            "I always knew Bruce Lee never died!",
            "Slipping is bad but the batteries in your fire alarms running out is probably worse",
            "This doesn't belong here.  It's interesting",
            "Did you die?",
            "You in David Dobrik's old kitchen?",
            "This is the first ever post I saw on this sub, I'm loving it already",
            "Good thing you didn't fall from too high up.",
            "I smell dwarfism :0",
            "rip 😔",
            "I am the banana 😭",
            "I Don’t Like The Look Of It….. 💃🕺",
            "You still slippin??",
            "#𝓨𝓸𝓾?",
            "At least you wouldn't fall that much.",
            "Just remember to be big about it, and don't get a short temper.",
            "Love this",
            "Are you harder to twist like a thick but small towel?",
            "That was soooo not set up",
            "O’Doyle rules. O’Doyle Rules.",
            "These would be great reaction images",
            "Doesn’t look like to far of a drop, you aight",
            "How's Gru?",
            "make it slip on you back for revenge.",
            "this is clearly fake you guys 😡 how are you really thinking this is real",
            "You fool! You foolish fool!",
            "Fake slipped for 995 fake internet points which are meaningless and can never be converted to dollars.",
            "There was a banana peel in the way. \n\nMe pointing that out is not interesting.",
            "Wish I was that banana peel right about now",
            "Omy gaaaawd dude are you ok? You hurt?",
            "Alright, which one of you guys did this?",
            "LOOK PUT FOR THAT BANANA PE- OH GOD NO!",
            "Yes you are",
            "Noooooooooo",
            "Looks like it hurt a little.",
            "Bae caught him slippin.",
            " He slipped",
            "Don't worry it's not a high fall",
            "Looks like you’re still slipping though???? Have you finished slipping???",
            "But you dit not fall",
            "Need 3rd pic with you in the air and 4th pic with you flat on the floor or it never happened.",
            "Graceful falling form I dare say. 10/10 would look at more frames",
            "Good thing it was a short fall.",
            "At least you don’t have far to fall",
            "It's okay you didn't tell from high enough to get hurt",
            "This guy, this is the guy I wanna be friends with",
            "Don't laugh, Oddwin.",
            "He slip and make a backflip",
            "Damn. Can’t believe this",
            "NOOOOO WWTCH OUT FOR THE BANANA PE\n\ndamn",
            "So that’s where my emotional support floor banana peel went",
            "Boo",
            "I wasn’t expecting banana peels to actually be slippery like in cartoons and almost hurt myself in high school lol",
            "Eh you don't have far to fall 😜",
            "Idiots like me sometimes do that with air \nBut idk about bananas they toooooooooooooooooooooooooooooooooooo\nRisky",
            "The fact that it’s a big community makes it interesting therefore it contradicts itself",
            "My condolences 😞",
            "You're okay, you were pretty close to the ground anyway",
            " you're lucky you approximately 3 ft tall..\nAnd if you hit the ground  wouldn't be very hard \nNow if you're 6 ft 2 like me ...I would injury my self",
            "Thank you for this",
            "You ok",
            "It’s literally how I imagined roach slipping on banana:",
            "Were you playing Mario Kart IRL?",
            "Can’t confirm as you are not on the floor.",
            "This isn't uninteresting, just lame.",
            "I was the banana and it extremely hurt. 😡 I want my compensation of 2.500.000$.",
            "You deserve it for stepping on that defenseless banana peel.",
            "If he was taller he wouldn't have slipped",
            "dio stopped the time",
            "Second pic has some jojo vibes to it lmao",
            "Ban this man instantly! This is interesting!",
            "Hopefully you aren't a very short tempered person",
            "Wrong sub buddy. Get yourself checked out.",
            "Comedy gold",
            "Equivalent of me tripping on a smart car.",
            "Never thought a face could recede into a face /jk",
            "Oh god he slipped!",
            "Don't worry I saved you by not swiping 🫡",
            "You seem like the absolute perfect person to become a new mascot of the sub",
            "Does no one else think this is weird?",
            "A little mistake",
            "Is he funny cause he's funny, or is he funny because he's a little person?",
            "Handsome… what’s your name?",
            "u short",
            "Easily top 9 even",
            "That's probably the biggest banana peel I have seen.",
            "Holy fucking shit why did this make me laugh so hard",
            "It's fine the person below your comment did it.",
            "With a Big... Heart.",
            "Look where you throw your bananas next time",
            "You monster. Listen here you little shit. Don't you ever fuck about with a banana peel again okay?",
            "Donkey kong moment",
            "honey! get off the wii! all that mario kart is getting to your head!",
            "All along? After all that time?",
            "He is clearly slipping off that Bananapeel.\nWhat are you talking about?",
            "care to split it with me?",
            "Beet me to it.",
            "That's a terrible thing to say.\n\nThank you for saying it so I didn't have to.",
            "(Verse 1)\nOoooooh ooh oooh oooh.\n\n(Verse 2)\nOoooooh oooh oooh ooh.",
            "It wasn’t that far down tbh",
            "aw haha thanks ☺️",
            "Stand up, then",
            "eh, what's the worst thing that could happen?",
            "as long it satisfies my ultra mega ego, that's all it matters",
            "i slipped only after i came\n\nguess who's becoming a father?",
            "hit me up!",
            "DAMMIT YOSHI",
            "yes",
            "jaden",
            "i am....and you're tall",
            "Is it worse than 9/11 though?",
            "Or the smallest person and kitchen",
            "You know what they say about guys with big… hearts",
            "Okay,i will",
            "😈",
            "yes!\n\n[i did it like this](https://youtu.be/oiuyhxp4w9I?t=112)\n\n🍌 \\*yeet\\*",
            "You did look like you were having fun.",
            "Yes",
            "Obviously",
            "LIKE THE GOOD OLD DAYS BEFORE 9/11! (Metal gear reference)",
            "Less funny, fer sure.",
            "Or that too—we will never know for sure.",
            "No, can’t be",
            "Health problems ?",
            "Pushes on all their organs",
            "Big bananas?!",
            ">The following content may contain suicide or self-harm topics.\n\nwhar",
            "WOOP DEE DOO  \n\nThat's a joke lads",
            "haha i was",
            "after",
            "Fer",
            "no its the funny",
            "fer",
            "Wher ter yer terking erbert",
            "bro is fr*nch 🤮",
            "Yep, cholesterol 😔",
            "So Big D>!ebts!<",
            "when animators don't hold anything back",
            "HAHAHAHAHAHHAHAHHAHAA",
            "Yep, penis 😔\n\n\nEdit: HOLY GUACAMOLE thx for the likes fellas 🤙",
            "It was *Burp* him",
            "Yepenis",
            "UGH! HOW DID YOU KNOW?",
            "I DIDNT! *GULP* THATS AJOKE TOO",
            "hee hee hee AHAHA!\n\nTHATS RIGHT, IT WAS ME!",
            "You monster"
        ]
    },
    "Am my hat cool?": {
        "title": "Am my hat cool?",
        "score": 124,
        "url": "https://i.redd.it/bfmgexlii38d1.jpeg",
        "content": "",
        "num_comments": 38,
        "comments": [
            "Hat am cool, proteck sun from",
            "The hat, yes. You on the other hand, are a Redditor.",
            "Yeah, hat cool, you cool\n\nWeather not so cool\n\nHot",
            "Yes, it are.",
            "Cool look hat you have",
            "am you’re english good?",
            "“Am my hat cool”\n\nIs an anagram of\n\n“My moolah cat”",
            "Ok",
            "Your hat am very cool",
            "No, that hat are not",
            "Lookin' drippy, king",
            "Yes it äm! Dount meik juu swet during hot samö deis!",
            "your hat are cool",
            "White hat✅\nWhite t-shirt ✅\nWhite walls ✅",
            "Very",
            "Very hat\n\nVery good\n\nMe steal very hat from you",
            "Your have the hat nice",
            "Not as cool as your glasses",
            "Ccool hat",
            "Hat very cool!!!",
            "True cool with you glasses",
            "Whut?",
            "no.",
            "Hat am cool. You look Pharrell.",
            "No",
            "You am chicken, not everyone am native English.\n\n_Edit: added grammatical errors_",
            "Shaka, when the walls fell",
            "I am not fat",
            "Hat defend you from hot",
            "Thx",
            "Thx",
            "Thx",
            "Oh no I am in big sad 😢",
            "True redditor",
            "But your dress is sweaty.",
            "they either fat or skinny, never normal",
            "Imma be honest. I'm just a bit chubby 😞",
            "Can confirm, am way too skinny"
        ]
    },
    "I own a PS20 and you don’t ": {
        "title": "I own a PS20 and you don’t ",
        "score": 104,
        "url": "https://i.redd.it/nbukdse0738d1.jpeg",
        "content": "",
        "num_comments": 38,
        "comments": [
            "Bro is living in year 3024",
            "PS5 ain’t shit, you got the 20",
            "Let me guess it has -1 games?",
            "this is actually very interesting, what is it?",
            "bro own PS20 before GTA VI",
            "thats the Coop item scanner lol, can you just buy those?",
            "How do you even get a barcode scanner? I thought that they would only get sold to Companies",
            "Is this to measure your Diabetes?",
            "I don’t know what that is.",
            "Now tell me your dad works at Sony",
            "I used one of these today and the piece of shit restarted on me at least 5 times whilst doing my shopping",
            "I don’t care!",
            "fuck that prolly ain't got no games",
            "Did you steal it from a store? What do you use it for outside a store?",
            "PlayStation makes a new console roughly every 5 years, so he’s actually living in the year 2100 (ish).\n\nMath being very not interesting, might be fitting for this sub.",
            "It runs subway surfers",
            "I know a store (Globus) where you can take one of these things at the entrance and you scan everything you are buying and pay at the end without having to stand in line and wait",
            "Scan&Go barcode scanner from a grocery store. I bought it to then find out it was stolen from a Rewe.",
            "We have these(or very similar looking) gadgets that you scan groceries while shopping and then use it at self checkout.",
            "Some stupid retail gadget. You’re lucky if you never have to use anything made by Zebra tbh. The one I have to use doesn’t even look like a gun 💀",
            "New for around 800€ but I got mine for 30€",
            "EBay",
            "It’s to buy your diabetes",
            "My dad works at Zebra",
            "That’s fun",
            "It runs Android soooo",
            "I bought it but it was stolen from a Rewe store I’m pretty sure, they run a modern version of Android and I’m in the process of cracking it so I can play Subway surfers on it",
            "1994- PS1\n2000- PS2\n2007- PS3\n2013- PS4\n2020- ps5 \nSony on average releases a new playstation every 6.5 years so he's technically living in 2118",
            "Oh I see, now that's actually interesting",
            "Yeah mine is from a Rewe",
            "After looking at EBay I'm quite surprised at how many there are you can just buy. Thanks!",
            "Neat, might be cheaper then ordering a hundred Pipsi's",
            "Actually it was the exact opposite of fun",
            "put GD on it",
            "I work at ~~Nintendo~~ Sony (Edit: lol did I really write Nintendo?) and the official release date of the PS20 will be November 20, 2120 20:20h JST. Japan and Zimbabwe only.",
            "The -ish accounts for about 20 years.",
            "Sure as fuck",
            "Cop out"
        ]
    }
}