{
    "'It was just gone': Playground stolen from Jacksonville school for children with autism": {
        "title": "'It was just gone': Playground stolen from Jacksonville school for children with autism",
        "score": 4869,
        "url": "https://www.firstcoastnews.com/article/news/local/playground-stolen-jacksonville-school-for-children-with-autism/77-98275235-f2aa-4dd4-ba96-273dc5d2baa8",
        "content": "",
        "num_comments": 174,
        "comments": [
            "This is Lex Luthor levels of cartoonish supervillainy...\n\nCouldn't they just steal 40 cakes?",
            "No low is too low for some scum.",
            "If you are in a country besides the U.S. and are having problems accessing the OP website, this link should work:\n\n[https://www.news4jax.com/news/local/2024/06/18/who-would-steal-a-playset-designed-for-children-with-autism/](https://www.news4jax.com/news/local/2024/06/18/who-would-steal-a-playset-designed-for-children-with-autism/)\n\nI think the original post's link has a better headline than this one.\n\n\\[Edited for more clarity.\\]",
            "I hope the thieves get dick cancer and their dicks just rot off in the most painful manner.",
            "I'm deeply suspicious of the contractors who installed the playset -- washers hand-welded to rebar doesn't look like an appropriate way to anchor something that needs to take a person's weight.",
            "Can’t have shit in Florida",
            "Gotta be an inside job, either the installers or someone with the school. They knew it was there, knew where the cameras were, and came prepared to disassemble and move a fair amount of material.",
            "Some say addicts, some say the installers. I split the difference.  \nOne or two of the installers are on drugs, and have a druggy idea to steal and sell/keep the playground equipment. And drugs leave no intrusive thought unacted upon so...",
            "The playground for autistic children was just sitting on pavement?",
            "Some people just need as whoopin.",
            "As an Ohioan living in Florida, that’s the most Ohio Florida shit ever. I feel oddly at home right now.",
            "Inside job, I’m going to go with the installers, the pink tape was a dead giveaway, who uses pink tape?  Not only did they know where the cameras were but they disassembled and removed it within a few hours, clean, nice and neat, no parts or cut pieces lying around.  \n\nDrug addicts wouldn’t have been this clean.  The whole thing was done in the span of a few hours starting at 3:30am on Monday…what kind of person is up and ready Monday morning with tools and a truck ready?  Installers.",
            "Check the local scrap yard",
            "There is now way that is $5-10,000. It appears they were robbed twice.",
            "Meth. Not even once.",
            "It's in a bathroom in Mar a Lago.",
            "Yikes. Maybe a neighbor didn't want the noise? Or someone was pissed about losing the parking spaces?",
            "It was either for the copper, or the catalytic converters.\n\nSeriously down the wtf rabbit hole.",
            "Let’s get r/evilautism on the case to take revenge.",
            "Remember when a woman's entire driveway was stolen?\nAnd of course this one is in Florida as well.",
            "OK, but can someone explain to me how that play ground is worth 5-10 Thousand  dollars?\n\n Like that same set is $1500 a costco and why the f would anyone steal it.",
            "can't have shit in jacksonvile",
            "Duuuuvallll!",
            "Access to article denied, how is a playground stolen? Someone disassembled it at night or something?",
            "Also whoever drives a lifted pickup truck with a 5 foot tall blindspot in the front to a school for children with autism, get a more appropriate vehicle. Those things kill children all of the time, especially at low speeds in parking lots.",
            "Americans are why America can't have nice things....",
            "Probably the neighbors",
            "Who the fuck steals a playground?  This is some Saturday morning cartoon villain shit...",
            "Florida keep showing the world what kind of trash it is.",
            "Back in the 90s, someone stole the playground from the Burger King on Old St Augustine Rd. Police assumed it was supposed to be happening because they had lights and everything. Nope, it was straight up theft. Sad too, because it was a really cool all wood playground. Just seems like another Duval thing for playgrounds to get stolen.",
            "Someone's taken it for their own kids, but hopefully a neighbor will rat them out. Scumbags.",
            "Dammit, Carmen Sandiego!",
            "WTF level 6",
            "They installed the park structure in the middle of a parking lot? Wtf?",
            "Why is it in the middle of a parking lot?",
            "Florida is such a shithole. I can't wait  until God punishes all those child molesting christian fundamentalists and wipes that entire shit stain of a state out with a flood.",
            "Sounds like a Carmen San Diego heist!",
            "Who would steal 30 bagged lunches??",
            "What else can you expect in the largest Republican run city in the country and the murder capital of Florida?",
            "Should have bolted it to the ground",
            "I'm not surprised it was stolen, they're expensive and Jacksonville is Jacksonville. What does surprise me is that a center for autistic kids thought it was a good idea to erect a playset on a hardtop parking lot ffs.",
            "We need higher levels of punishment for crimes that are just evil.  \n\nCrimes where people are just trying to feed their families are one thing, but crimes just to hurt other people, take from the most needy, wage theft, etc. should be punished in a way that the next person to think about doing such a thing shakes uncontrollably at the thought of what would happen if caught.",
            "They set the playground up in the parking lot- on asphalt, with no shade? \n\nThat is a bigger WTF than it getting stolen.",
            "Anyone else imagine it was an autistic telekinesis savant kid like El wishing the offending equipment into the cornfield.",
            "Has anyone checked next door at the school for children with sticky fingers?",
            "Who installs a playset on friggin concrete?!\n\nHopefully there are prints on that pink duct tape.",
            "FFS, nail it down at least what do you expect",
            "Alexandria Ocasio-Cortez says it was taken by a poor family that needed it more, so stop crying.",
            "This is why I think the death penalty should still be around.",
            "The Kaboom! Guy is doing this. He's building a hospital in a poor place China!",
            "That’s 4 tens, and that’s just terrible!",
            "That's as many as four tens!",
            "It's only 39 cakes, one of them is falling off the cart.",
            "https://s3.crackedcdn.com/phpimages/article/9/1/1/91911.jpg?v=1",
            "I understood that reference.",
            "Lex Luther would never do that. That's such a terrible example. \n\nMore like the villains from Rocky and Bullwinkle",
            "Someone at my friend's school when I was younger melted their playground down with napalm",
            "Just putting this out there. I'm autistic and I've noticed in the past year the amount of hate for autistic people is rising dramatically. It seems out of nowhere we're becoming a focus of hate and attention. \n\nWhen gay marriage was legalized I remember saying to myself, \"they're going after trans people next.\" And sure enough that's where we are now. But I've heard people try to connect trans and autism and include autism in the trans hate. \n\nWith more and more push back against trans hate, it feels like bigots are actively searching for their new target right now. They need a target most society knows about, but that's different enough to \"other\" and make them seem bad. I feel like in the next year we're going to see more attacks on autistic people as they search for a backup target to hate. \n\nAll that to say, I wonder if this was targeted because it's a playground for autistic kids. And in the idiots mind they went \"school for autism? They're teach the kids to be trans!\" I've seen that sentiment before, though this would be the first time I've seen that sentiment being carried out into action. If that's what actually happened. \n\nI really hope I'm wrong.",
            "I wonder if it was neighbors who didn’t want Those Kind Of Kids near their homes.",
            "I like how this headline implies that nobody would want a playset designed for children with autism like that is the problem, lol.",
            "No no no. Testicular torsion with a twist(yes pun intended) when it ends up killing a testicle or it is removed it will just come back and happen again. Never ending testicular torsion.",
            "Their dicks have thief cancer.",
            "Probably just poor people trying to feed themselves, but yeah. Dick cancer.",
            "Everything about this whole situation is suspicious.",
            "I agree, if that photo is of the actual playground, I question the strength of the materials and quality of the construction. The base is placed on a shim which seems to me that the weight would not be evenly distributed.  The shim could easily disintegrate, or the frame slip off that little piece of wood. Also they seem to have a makeshift playground, having placed it in a parking lot with those tiny cones as some sort of barrier.  Does not look safe at all.",
            "Back in my day we didn’t even anchor these things.",
            "\"That'll show them vaccinated kids.\" --Florida Man",
            "Never insert a conspiracy where a meth head will fit.",
            "It's Florida, they probably thought that the park was making the kids woke.",
            "who the fuck is organizing an inside job to steal playground equipment? who are they gonna sell it to?",
            "An ‘inside job’— like this is a heist?",
            "I wonder if it's some cheap ass family with a bit of land who want a private play park for their darlings.",
            "They build the play structures first,  the mulch and fence were the next steps.\n\n>Growing Together just spent $12,000 on mulch for the ground of the new playground, so the team is hoping they can either find the stolen play set or the community will support them in getting a new set so the children will have a place to play when school starts on August 12.",
            "It was installed and ready until the thief uninstalled it?",
            "Official playground have much higher material and safety standards than what you would find in a private backyard. And simple swing set can easily cost more than a thousand, and that’s before even thinking about installation.",
            "Prices have gone up for a few years due to the supply chain.",
            "It’s specifically designed for children with autism.",
            "The copper and catalytic converters in a wooden play structure?",
            "Hey chief, where do you think they keep the catalytic converters in a playground?",
            "Can’t speak to this set personally but I manage HOAs and playgrounds that used commercially vs a private yard are a LOT more expensive.",
            "Seriously, sketchiness abounds from the beginning of this entire situation. That does not look like the kind of playground equipment you'd see at a school. It's too flimsy for a school full of kids to play on daily. It's not made for that. Then there's the price, which is exorbitant considering the materials. I too have seen this for less than 2000 at Lowe's(I think. Might've been a different hardware store). Then there's the fact that they just left it sitting in an unsecured parking lot while waiting to have the playground site mulched. Even accepting that it's Florida, none of this makes any sense. ",
            "Where in the world is carmen sandiego?",
            "I mean expecting people to not steal a playground to me sounds like something natural",
            "in this economy, Lex stealing 40 cakes from a small bakery is unfathomably devious",
            "That they took without permission ",
            "And that's terrible.",
            "Tell that to the previous owner of the 40 cakes. I'm sure it means a world of difference, despite having still lost it to Lex.",
            "I would have never thought of that, but that might be the case. Why else would someone go to so much trouble to do this?",
            "I'd think they'd just wreck rather than take it with them if that were the case.",
            "I’ve heard of boomers who have gone full eugenicist when simply having to live next to autistic children. I remember a news story a few years ago where some Karen wrote a letter to her neighbours, saying that they should euthanize their son because he’s too loud when playing outside.",
            "Those kinds of neighbors vote extremely consistently. ",
            "Then why not just burn it? Stealing a giant swing set like that is actually a lot of work.",
            "Or just kids/crowds",
            "Yeah, I understand that they meant \"who would be so awful as to steal from autistic children.\" But the wording of the headline does not convey the sentiment they were going for. ",
            "Teticular tortion is overplayed, now its Mend Buttcrack and explosive diarrhea",
            "I don't want cancer ☹️",
            "Yeah, poor folks ate that swing set. Ate it right up.",
            "Most likely poor people trying to feed an addiction, in which case cancer will get them whether we ask for it or not",
            "Feed themselves with a swingset?",
            "And the taxpayers will foot a bill for cancer treatment that looks like a Pentagon invoice.",
            "Yeah no, the thieves can die from falling off a cliff and into a bear enclosure, and I would continue eating my fettuccini Alfredo like nothing happened.\n\nWaste of life.",
            "> You assume, that I can't operate an angle grinder...",
            "I thought that was a picture of the playset before it was installed, but the caption in the article says that it was after. WOW. Cannot blame the contractors on the choice of location though.",
            "Back in my day anchor meant boat thing",
            "*How do you think they got the autism?!*\n\nFlorida man, probably",
            "Sounds like a conspiracy. Waaait a minute, are you on meth?",
            "It was bound to happen when the entire playground was made of copper.",
            "The meth is coming from inside the house.",
            "This is one of those humble bits of wisdom that will linger forever. Thanks!",
            "We all know autism is just a tool of the liberal media.",
            "Somebody in South Georgia with acreage and unemployed relatives.",
            "Original installers have already sold the playground to another school? Buy once, profit twice?",
            "that makes way more sense 😅",
            "In a way, thankfully at least this isn't taking something away from kids that they already have.\n\nWhen I first read the headline I thought it was doubly terrible that the kids might not deal well with the change of having something they loved taken away from them, and struggle to understand and deal with it.\n\nStill an utterly shitty move, but at least it's not that double whammy. Hopefully.",
            "12 thousand on mulch for that tiny playset?\n\nI would expect like $4,000 to mulch it and still have plenty of room to run around. \n\nAlso, I don't mean to downplay the theft or anything, but that's like a $1,000 Costco playset. I wonder what they said it cost.\n\nThe whole situation is weird.",
            "$12,000 for mulch?\n\n\nWere they buying it in those small bags from home depot?",
            "I'm pretty sure I've seen that exact playset before, and I've built a couple variations of it, guarantee it's about $1000 depending on where you look. \n\nLabor is high on those because they come flat packed in a thousand little pieces, but the materials are super cheap and they are meant to be shipped by UPS, or bought at big box stores and built by dads for their kids (cheap+lots of free labor=still cheap).\n\nAny reasonable school will buy the big metal playsets because they are 1000% more rugged for daily use, and when you have to pay for labor, buying the more expensive sets with *way* fewer parts makes much more sense.\n\nSo I personally think something is extra fishy. Even tiny little daycare centers around here have metal playground equipment.",
            "At best that's $2k at home depot",
            "The future is now",
            "They needed the galvanized square steel and eco-friendly wood veneer",
            "The person who stole it probably thought so yeah.",
            "I suspect below the swings myself.  \n\n(if you cannot tell, OP was taking the piss)",
            "Hey buddy, it was sarcasm.",
            "Do you see a quality difference in construction? Or is this just a charge more because it’s being sold to a business situation?",
            "Playground for their own kids or scrap metal.",
            "Some people see something, doesn’t matter what, and they take it. No rhyme or reason to it. Some people just take stuff. Seriously. It’s fucked up.",
            "[removed]",
            "I've heard the same thing about regular kids from kids on Reddit. Hell they have an entire subreddits devoted to hating children.",
            "Link or it didn’t happen.",
            "Recycling metal, smart ass.",
            "It’s a Meth-spiracy!",
            "Uuuuuhhmm... No?",
            "prolly gonna get replaced by r/reallyshittycopper after this",
            "You joke but I’ve heard similar comments from coworkers over the last few years.",
            "Playgrounds are bigger than a playset.",
            "Hmm. Steal playset, make public pay for new playset, re-install stolen playset and pocket the money?",
            "It's a private school in Florida. The price is inflated because the school has ties to the company they got the mulch from. Spend 12k for 4k worth of mulch, that's 8k to be split between the mulch company and the scumbag running the school",
            "Hm, now that you mention it, the play set in the photo does look like the one you can buy at a hardware store. Never seen anything so cheap look at a real school or kindergarten.",
            "Maybe that's all the school could afford.",
            "I mean … the cost of labor?",
            "Just need screws from David's aunt!",
            "It would have lasted 10,000 years!",
            "Scrap metal probably. We have no shortage of meth in Jacksonville rn.",
            "It looks like wood, so I think the scrap metal angle is out.",
            "Sorry, but your account is too new to post.  Your account needs to be either 2 weeks old or have at least 250 combined link and comment karma.  Don't modmail us about this, just wait it out or get more karma.\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/nottheonion) if you have any questions or concerns.*",
            "Shit, I just said \"it must really suck to have schizophrenia\" last week and some little asshole came into my replies to say 'we should make sure all of the people with those have the resources to sterilize themselves.' \n\nSome motherfuckers really just want to reinvent nazism.",
            "[Found it again](https://nationalpost.com/news/canada/ontario-family-shocked-when-they-receive-letter-telling-them-to-euthanize-autistic-child)",
            "That was a lumber swing set. There isn't much weight in metal there.",
            "It’s clearly a wooden swingset.",
            "Methception!",
            "I am so happy that this is a sub",
            "Fuck Ea Nasir, fucking copper scamming asshole.",
            "Seriously? What, do they think kids w Autism and their families are just \"crisis actors\" or some bullshit? 😒",
            "Sure, and I'd expect about $4000 in mulch would well and truly cover enough playground to accommodate that equipment plus a couple of smaller pieces.\n\n$12,000 is enough to cover a very large playground in deep mulch.",
            "Was $8k for something dad's do for their kids on weekends?",
            "Almost no playgrounds are made with metal anymore other than monkey bars. But for this kind of school I’m going to gather metal wasn’t the vibe",
            "Even if you're desperate, stealing a playground for a couple cents worth of scrap steel screws/brackets seems a bit much. The wood is going to be worth a hell of a lot more secondhand, even as firewood, but still not too much.\n\nI feel like checking over some fences might solve this crime in a jiffy though. One would think for their kids, but you're right, it's Jacksonville. A meth head looking for a place to burn off their energy is definitely on the table.",
            "So you tell me what you think the motivation is. Are there professional rings of playground thieves shipping them out of country like in Gone in 60 Seconds?",
            "Playgrounds are commonly using rubber mulch now because it’s “safer” in impact tests and 6 inches seems to be the recommended depth. That would make the playground about 50’x50’ for $12k worth of mulch at current prices in my area. That’s not including any type of border or anything for holding the mulch in place or any possible delivery fees or labor that they may also be including in their numbers.",
            "I did a small project in college for a playground, and the mulch was almost half the price because it has to be a certain type, certain grain. Just big enough to not be appealing to eat for the tots, just small enough, so not choke the older kids if they are dumb. It has to be a certain treated wood as well, or you have to set up a yearly scrap and mulch during slow periods. Most places go with rubber, but the church wanted \"natural\" so we had limits because fake wood rubber wasn't worth the price per sqft. \n\nThat wasn't taking into account heat since we were working with a shaded church playground. We even had to cut back on the theoretical play set to keep child safety standards.",
            "You need it installed by a properly licensed and insured construction company, because of all the liability potential.  If you get your brother-in-law to grab something from a hardware store and install it on a weekend, and a kid breaks their leg on day 2 because something falls apart, things get messy.\n\nNot saying that's the way it should be, but it's the way it is right now.",
            "School for children with autism. The answer is hate. ",
            "Thanks for the info. I didn't think of that. Would it still be that expensive? Second question: would that take more than a day for something that small?",
            "Assemble it yourself and claim it was done by a random defunct company, easy. ",
            "No idea about what it would cost.  The article doesn't say how long the install took, but since it mentioned the set being installed on studs, which I don't see in the picture, I suspect that they put the play set together in the parking lot and eventually carried it over to the mounting points.  Those would likely be holes dug in the ground, which you would then fill with concrete and rebar before putting a 4x4 or something in that you would eventually mount the actual structure to.  That could easily take multiple days--excavator, concrete truck or mixer on site, gradual pour to make sure that the interior is curing properly rather than staying mushy, etc. (Assuming that the process is the same there; Jacsonville's only about 30ft above sea level, and I'm not sure what that does to construction. And I'm not a construction expert so I don't promise the process I described was correct.)",
            "Permits are a thing.",
            "Thanks for all the info!"
        ]
    },
    "Florida school district bans book about banning books. Says it ‘questions their authority’.": {
        "title": "Florida school district bans book about banning books. Says it ‘questions their authority’.",
        "score": 2833,
        "url": "https://www.kxan.com/news/national-news/florida-school-district-bans-book-called-ban-this-book/",
        "content": "",
        "num_comments": 164,
        "comments": [
            "Pretty pathetic excuse for authority if it cannot stand up to the scrutiny of a book.",
            "That doesn’t sound fascist at all",
            "RESPECT MY AUTHORITAH!",
            "A true nottheonion post, well done.",
            "Ban books about fascism next because \"stops copies me\"",
            "Hopefully the ACLU takes them to court. They’re not even trying to hide under the veil of it being pornography.",
            "If you live in Florida and need to register to vote: [registertovoteflorida.gov/eligibilityreactive](http://registertovoteflorida.gov/eligibilityreactive)\n\nIf you want to volunteer with the Florida Dems:\n\n[floridadems.org](http://floridadems.org)",
            "Are they going to try to burn \"Fahrenheit 451\" then?",
            "What a bunch of fragile fucking snowflakes.",
            "Resist fascism",
            "The party of free speech and small government!",
            "I question their authority. Can they ban me?",
            "What is it with Florida and consistently being bat-shit insane?",
            "Imagine stepping on trap with a neon sign saying “Trap” and a blinking lights arrow pointing to it",
            "Couldn't have put it better myself. And they wonder why we accuse them of authoritarianism. The First Amendment is for what exactly?",
            "The quiet part out loud. Their \"authority is not to be questioned.\"",
            "So they're admitting it's not about \"pornography\".",
            "Oh look Fascism",
            "Someone needs to ban banning books about book banning",
            "Ironic name. \"“Ban this Book” was itself challenged by Jennifer Pippin, chair of the Indian River chapter of Moms for Liberty, according to The Tallahassee Democrat.\"\n\n\nmoms against liberty, oh shit wait they are moms for liberty, sorry got the name mixed up...",
            "When you cut out a man's tongue you aren't saying \"don't listen to this man.\" you're really saying \"I'm scared of what this man has to say\".",
            "'Moms for Liberty' is banning books.\n\nPerhaps, and hear me out on this, if they read more books they might know what that word REALLY means.",
            "They finally admit it’s all about their authority",
            "Question thier authority? Just bypass it and plant the banned books in the libraries. Fuck those twits.",
            "_RESPECT MY AUTHORITAH_",
            "Only f**king dictators worry about \"questioning authority. Literally.",
            "Florida’s living in 1984…",
            "Authority should ALWAYS be questioned",
            "Who else but florida",
            "So now Cartman is education?",
            "Now we need a book about the banning of books simply because they are about banning books.\n\n-Directed by Christopher Nolan",
            "It sounds a lot like sentencing Socrates to death for corrupting the youth. Same corrupt councils.",
            "Republicans have altogether given up on Constitutional principles. They’ve tossed them right in the trash.",
            "Literally 1984",
            "They jumped right on the ban wagon.",
            "So God damn Anti American it makes my bald eagle scream",
            "Hello?   Yes?  You wish to speak to Florida?  Just a second...... Hey, Florida.  George Orwell is on the phone and wants to speak to you.",
            "Authoritah?",
            "You will respect my athoriti !!",
            "They sound like pure fascist",
            "Florida really does seem like such a shit hole state.",
            "Moms for Liberty.  That’s the boldest lie I’ve heard today.  Oxymoron.  Show me where the book touched you, you poor fragile thing.  Like all fundamental religions, it’s about control.  Being fearful of words is sad pathetic way to live.  Mr. Montag will prevail.",
            "What about books about the 'decision to ban books' that talk about books that talk about 'banning books'?",
            "This is a good one",
            "And how is this book ban about \"protecting children\"?",
            "The irony is becoming so ridiculous it feels unreal.",
            "What's next? Replacing the Bible by reintroducing the \"Slave Bible\" where all verses mentioning resisting abusive authorities are removed, emphasizing only those verses that are talking heavily on submitting to the authorities?",
            "Holy shit! Florida has schools?!",
            "Someone should sue them on the basis that this proves the district wasn't doing it to protect children or eliminate obscenity or whatever dumb fuck excuse they use, but to control people.",
            "When you ban books, you are banning ideas. If you don't want people reading about banning books, you know what you are doing is wrong. Isn't this obvious to everyone? Also, ban a book and guess what, more people will read it. Well, that didn't work so well for the Book of Enoch, but I'm reading that anyway. \"Angels lay with the daughters of men.\"",
            "Cartman has entered the chat!",
            "That high heeled freak governor is so damn thin skinned.",
            "That's a bad look",
            "How dare you question the authority of.......the governor? Someone would think it is a democracy or something, the way you complain!",
            "So are the crowd who usually gets so upset about censorship when it's stuff like slurs going to speak up about the banning of questioning authority, or is that fine?",
            "It’s like banning swimsuits at the beach because you hate nudity",
            "Wow. This post took off.  I posted it and went out for the evening and come back to this.",
            "Questioning authority is un-American. /S",
            "I think there is a word for the banning the questioning of authority... wait, is it freedom?",
            "They just keep treading on themselves....",
            "Time for the author to write a new book called “Banning a book about book banning”\n\nIt will be a child who is confused why people are banning books and ask questions to the adults who ban it and they refuse to answer her.",
            "\"We don't need no education\", no?\n\n(and it might be a british song, but the absolute-authority of british boarding-school headmasters _is_ what the song is about, parallels (not)well)",
            "Give me one example from history where the book-banners are, in retrospect, viewed as being in the right. I just want one single example. I will wait.",
            "Is this the \"cancel culture\" that I've been hearing so much about? 😏",
            "This entire country is based on questioning authority lol",
            "Yes, that’s literally what it’s doing. Glad we’re on the same page. Now put it back.",
            "Well..... At least they understand the point of the books, I guess",
            "[removed]",
            "https://images.app.goo.gl/WobZjKuJ8ZQ3wGZC6",
            "Jorjor wel",
            "Just sad",
            "So they banned Fahrenheit 451? When I was in 10th grade 2015, we read it and my teachers made a massive deal about the government banning books and how we need all need to be highly aware of what’s going on if it occurs. This was public school IN MISSISSIPPI!",
            "Truly a great use of this subreddit",
            "Heil DeSantis Next step Floridas Flag will be changed to the Flag of the third Reich.",
            "I'd say the irony here was enough to kill a large rhinoceros, but these are the types of people who rarely comprehend satire, let alone irony.",
            "https://youtu.be/sAuMERnj-FU?si=z0c_P1hxKjKvf8ZZ Hello from fellow Russians, lol",
            "P\n\n \n Pu",
            "Redacted comment: Yo dawg, I heard you _____ _____ so we _____ _____ so you can _____ while you _____.",
            "Re re re re repost\n\nSeen variations on this for at least a week by now.",
            "“The Party told you to reject the evidence of your eyes and ears. It was their final, most essential command.”",
            "Florida? A fascist state?? \n\n*pretends to be surprised gasp*",
            "And questioning authority is a bad thing?",
            "Eric Cartman",
            "Isn't that the point.",
            "They ain't even trying to hide they are going authoritarian, are they?",
            "\"I am the leader!\" says the man who shouldn't be",
            "Yikes! We have it in our school library. Maybe they should try reading it?",
            "We should have bookmobiles full of banned books. Banned-bookmobiles.",
            "Why is there such controversy? School districts decide which books to carry and which not to carry. What school has enough space across libraries to carry every book? You can bet your butt liberals don’t call not carrying conservative books a ban.",
            "We are talking about books for young children’s classrooms and school libraries right? Not public libraries for adults. Doesn’t seem like an appropriate topic for young kids",
            "We just have to get those groomer books back into the hands of those kids!",
            "The man who must insist that he king is no king at all.",
            "Sadly in my experience, there is always at least one or more control freaks elected to things like school boards and city councils and even home owners associations. \n\nThey literally have mental issues and can’t do much of anything else. They can’t work for someone else without getting fired, can’t run business because no one wants to work with them \n\nThe only place they find success is some type of elected position where it’s very hard to get rid of them and no one is in a position to question their authority \n\nBut its still amazing to hear them say this outloud",
            "Would love to hear these Moms for Liberty explain how censorship = liberty",
            "It's how children think",
            "The CCP bans movies about time travel because it opens up the possibility of an alternate reality where the narrative does not follow the one set by the CCP. This is literally the same shit.",
            "That's the point! Authority should be questioned and undermined when unjust!",
            "The Florida School District has no clothes.",
            "Have you ever met people make decisions for schools? There is no other place in the world that would let any of them make any decisions whatsoever.",
            "“The Chair recognizes School Board Member Cartman…”",
            "Beatings will continue until morale improves!",
            "*batons shin*",
            "So, are you telling me there's a chance that Ron Desantes will get his ass kicked?",
            "[https://www.reddit.com/r/MediaMemes/comments/1dlkeoz/respect\\_my\\_authoritah/](https://www.reddit.com/r/MediaMemes/comments/1dlkeoz/respect_my_authoritah/)",
            "Why thank you.  I had hoped it would be received well and it has elicited appropriate ridicule of this mindset.\n\nEdited grammar.",
            "Thanks Big Bens,  now I knows what times it is",
            "They mades me sweeps the snow",
            "ACLU can’t save most of these local laws fall within the realm of power given to school boards. \n\nYou need local elections won on these boards and city councils/etc. \n\nLocal elections are significantly more important than they ever get credit for.",
            "Maybe if they actually *read it*. They probably unironically think the \"firemen\" of today are coming after their bibles or something.",
            "Nope, just the party of free guns and small peepees.",
            "in a few years, yeah. In Nazi Germany the first ones to go were mostly leftists",
            "FL leadership is in a race to the bottom to see who can be more batshit insane.",
            "Alabama, Louisiana, almost all of Central America or any Red states in general.\n\nThe GOP is full of BS and pure morons trying to de-evolve the human brain",
            "Or Stephen King",
            "Was",
            "the country was founded by religious extremists who enacted numerous authoritative laws banning religions other then their own. ",
            "Sorry, but your account is too new to post.  Your account needs to be either 2 weeks old or have at least 250 combined link and comment karma.  Don't modmail us about this, just wait it out or get more karma.\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/nottheonion) if you have any questions or concerns.*",
            "Keep licking the boots of fascists and supporting fascist policies. Great look man! Let’s try to be even more like nazi germany!",
            "You don't think it's appropriate for kids to know that they shouldn't be mindlessly subservient to the government and should think for themselves?",
            "you're right, kids need to be hidden from every single bad part of the world. ",
            "Grooming is a specific thing ,and you look like an idiot when you toss around the term casually and inappropriately like that",
            "watering down \"grooming\" this way gives actual groomers athe benefit of the doubt, which seems to be a feature, not a bug. ",
            "sooo all kings",
            "https://youtu.be/4sJY7BTIuPY?si=a7y4z7ijeHseh7u_",
            "Yeah, at least once a year one of the school board members are arrested for so many reasons. Just this past year one was arrested for stealing $40,000 from a scholarship fund and the superintendent got arrested for \"diverting\" funds. The sketchiest people get elected. Oh, I'm sorry, the ones who are backed by the \"business as usual\" politics get elected.",
            "Tell me about it.\n\n\nHead of my HOA is retired military police guy. He truly believes he runs the place and house owners are his subordinates...",
            "Give it some time, eventually they'll all be in prison for soliciting or abusing minors...",
            "Easy.\n\n\nLiberty for them to decide what's appropriate and correct for everyone else.",
            "War is peace. \n\nFreedom is slavery. \n\nIgnorance is strength",
            "They will say that they are protecting the liberty of their children to grow up without being poisoned by horrific ideas like free thought and other such Communist concepts.",
            "I thought we were rid of these crazy kooks since their fat-right conservative leader got called out on a three-some and their representatives around the country lost school board elections.",
            "“The Chair recognizes School Board Member Margaret…”\n\nI JUST THINK THAT",
            "They shouldn't be. Local hicks always do this shit. We need universal public school rules from progressive leaders it's that simple.",
            "I guess the problem is that these decisions have to be made by someone and it can be for nuanced reasons. A library isn't stocked with every book, so not including something isn't inherently censorship. But when specific agendas get involved, things start to get real messy...",
            "you think these people *can* read? Mighty funny of you",
            "Then go to canada",
            "Well I was going for Inception",
            "Yeah now it's just power trips from roles that don't matter lol",
            "Good to know you don't know history.",
            "The first amendment literally says Congress can’t play favorites with religion, and the fourteenth amendment says the constitution applies to all states in case there was any confusion.",
            "Lamo ever school district decides which books to carry and which books not to carry regardless of political leaning. They are not doing anything liberal or leftist leaning school districts did not do. You are getting riled up about nothing. Do you think under a left leaning school district every book is available in the libraries?",
            "I don’t believe I’ve ever seen an actual king do that.",
            "https://preview.redd.it/iz1qde9qyx731.jpg?auto=webp&s=0d08f333bca44ffa7336e49aa5c31d721baa4437",
            "I remember there was a \"funny\" post of someone trolling one of their Facebook groups and pretty easily got them to speedrun 1930s Germany. Moms were gung ho on burning books and finding somewhere else to put all the undesirables",
            "They are at liberty*",
            "If you had to choose, which dystopia would you rather be in? 1984 or BNW style?",
            "'fun' fact: free thought was/is not appreciated in the soviet union, or it's successor",
            ">universal public school rules... it's that simple.\n\nThe problem is... the beginning and the end part of what you said there?  That's what the Fascists want, too.  But, of course, they wanna go total Handmaid's Tale with this \"simple\" plan...",
            "But then how will boomers be able to rant and rave about the world changing before they die?  Won't somebody think of the Boomers!",
            "Sure and after that I need a sparkly saddle for my unicorn.",
            "What?",
            "Oh, okay. Sorry. (Stephen King suggested that when a book gets banned, go to a bookstore and get it right away. Fine out what *they* were trying to keep from you.)",
            "How many kings you seen?",
            "there are a lot of people like that. They say some \"mild\" shit as a \"joke\" but if you take the bait... hoo boy. You'd think you are talking to Hitler",
            "SU is not the definition of communism and neither is China. In fact people on the libertarian left side call SU and China state-capitalist. So not even socialist, let alone communist",
            "Free thought, liberty, and any kind of regulation that they don't like is called \"Communism\" by American right-wingers, is the joke.",
            "You’d be disappointed to find out how many post-Gen-X people are totally on board with this. You think boomers are people with kids in school?\n\nHell, Trump is polling better with people under 35 than he is with people over 65.",
            "Whenever someone complains i offer them an alternative",
            "In person? One. On TV? Several.",
            "Boggles the mind.",
            "Not surprising. People switch sides because they think they will have it better under new leadership. And the under 35 crowd has it so bad they figure it can’t get any worse..",
            "You made a comment, I expanded on your exact commentary. You have now rendered your commentary useless.\n\nGood day",
            "What were you doing with that Florida comment?",
            "Personally, I think that’s a shit alternative. I’d rather make the U.S. a better place for more of us than run away, even if fleeing was actually an achievable option"
        ]
    },
    "Americans Take Less Vacation Days Than Any Other Country and Half of Us Are Okay With That": {
        "title": "Americans Take Less Vacation Days Than Any Other Country and Half of Us Are Okay With That",
        "score": 18686,
        "url": "https://country1025.com/listicle/americans-take-the-least-vacation-days-in-the-world-and-almost-half-love-it/",
        "content": "",
        "num_comments": 2101,
        "comments": [
            "I'm working on a project between my company and one in Europe. Just seeing the shear number of days they get off for various holidays is mind boggling to me and then the entire company shuts down for four weeks mid summer. ",
            "Fuck no I’m not okay with that",
            "I get 6 weeks and use every hour every year. Maybe we could see some legislation help the average worker out in the future cuz this is BS.",
            "I just got back from 14 days in Europe. Part of that I stayed with my French cousin. He was complaining that he struggles to use the 9 weeks of vacation time he's given every year. I told him I get 4 weeks as a federal employee and he was like, isn't that normal? No, I get a crazy amount of vacation time compared to the average American",
            "This is why I’m going to keep my government job despite the lesser pay. It’s nice being able to take leave with minimal fuss as long as I have the hours on the books.",
            "Fuck yeah!!! Wanna die in my chair at the office 🇺🇸🇺🇸🇺🇸🦅🦅🔥",
            "It's wild the 5 weeks of vacation I've earned over 22 years (union electric utility company) is a lot here in the US, but the bare minimum elsewhere in the developed world.",
            "It looks like the feeling is that you (have to) take vacation in big chunks like at least a week at a time and make it an event. Don’t want to do that for whatever reason, take vacation days one day at a time like a Friday or Monday and make long weekends over the summer. You don’t have to take a big trip, you get a decent break, and not much to catch up on when you get back.",
            "Man, I work for a US company in Europe and work very closely with the equivalent US teams. With some of them I talk casually and I mentioned how crazy it is when I watch them take ONE week as their main holidays throughout the year and then a “long” weekend here and there. Absolutely insane.  \nThe more insane part is how the company there switched to no vacation limit and they still take a week only.  \nI really really really love my US ppl because they are all sweet and kind souls but damn that just seems brainwashed.",
            ">Meanwhile, Americans tend to take vacation days in chunks. Only 5% of us take at least one day off a month compared to 32% of Japanese people.\n\nThis is the key point. Americans make going on vacation an event, instead of just using up days for many long weekends over the course of the year, which likely contributes to why they don’t use vacation days as extended family vacations can be costly and stressful. \n\nWe need to recondition ourselves to not feel\nlike a vacation has to be whole National Lampoon’s adventure, and just take more extended weekends to actually enjoy ourselves and not feel like needing a vacation from the vacation when it’s done.",
            "It's how American middle class workers measure their worth: their perceived indispensability at work.\n\nFacing up to the alternative would likely mean a major political reorganization that it appears few have the stomach for.",
            "I work in the UK and have been here straight out of college. I saw a job advert back in the USA 9 days holiday. I get 28 at the moment not including public holidays. Yeah not going back for a long time I think. Sad",
            "I feel like the younger gens are starting to move the needle towards valuing quality of life over work. Our culture has always been work-centric, and it would be one thing to provide the benefits and pension to match the commitment, but we let the rich manipulate us into thinking that any accommodations to our lives is tantamount to hanging a picture of Stalin in our living room. We need to realize that healthcare, time off and a pension is the least we should be provided as members of the workforce.",
            "Fewer",
            "You know the end of Animal Farm, where they see the pigs in the house wearing clothes? I feel like we’re there",
            "The world’s most housebroken nation 🦮",
            "Japan? Lmao Japan second. WOW",
            "Something something distressed millionaires",
            "Non American countries did not get  their days off because of some rational reason or benevolence- they seek as much profit as they can as well - they have the days off because they fought for them. \n\nThat Americans have somehow told themselves that democracy does not belong in the workplace (or told by their billionaire media owners) confuses most of us elsewhere. \n\nThe crazy shit of someone voting *against* having a union (as in car plants in the south, even when the management went worker representation in key decisions)is the clearest example of turkeys voting for Christmas I can imagine.\n\nAnd then *shocked Pikachu face* huge concentration of  wealth by the capital owning class.",
            "Propaganda. No we are fucking not ok with that.",
            "Haha jokes on you if I take a vacation I starve to death. Vacations are for losers.",
            "Fewer not less.",
            "My family never went on vacation because we didn't have any and were poor, so there wasn't anywhere to go. Now that I'm older with a good job, I still don't really take vacation or even know how much vacation time I accrue. Vacations were some thing that other people did. I would probably fall into the not caring about vacation category, but only because I can't really miss what I never had.",
            "It seems we get punished for it that's why",
            "I’m very happy that my workplace has given unlimited PTO to salaried staff while also mandating 15 days off per year. You can take as many vacation days as you want with a minimum of 15 per year. If you make it to December 15 without taking PTO, you can’t come back until January 1st. Hourly employees are also given 21 days PTO + 6 holidays.\n\nI just wish these were benefits given to everyone else in the country. It’s not fair for it to be so employer dependent.",
            "Fewer.",
            "Fewer",
            "Fewer *",
            "I’m in the half that isn’t and I do everything I can to make enough money to take time off and enjoy my life.",
            "Fucking fewer…",
            "\"half of us are okay with that\", I think they mean most of us are wage slaves.",
            "The fuck am I gonna do on vacation? I can't afford to go anywhere and if I take time off I end up behind on my work dealing with a half dozen people telling me I'm holding up some critical process because no one at my work has a single contingency for what to do if someone is not immediately available to deal with or respond to something.",
            "Most Americans have no *idea* how oppressed we are.\n\n***Exceptional Democracy!***, we've been trained to parrot, inside our demented propaganda construct.",
            "Because we have been brainwashed into an abusive relationship to think that the more we work the better we’ll be and it will all be worth it. \n\nExcept now your purchasing power is disappearing and the basics are cost more then your pitiful 2% raise. The premise of homeownership is getting harder for regular people and future generations. \n\nSo you’re working more and getting less these days. \n\nIt’s not just holidays and pto. Other countries have great maternity and paternity leave as well. But then people wonder why people don’t want kids. \n\nWe need to embrace work to live not live to work. Work should provide what you need and allow you to enjoy simple things in life.",
            "It's worse than that. People get in competitions over how many more hours they worked than everyone else, and how much less sleep they got doing so.",
            "I am definitely not ok with this. Who do they pick for these polls??",
            "Not having vacation days is one thing. Having them and not taking them is another. Fuck peer pressure or guilt, I’m taking every vacation day I get plus unpaid time off. No point in making a bunch of money if you don’t have time to spend it.",
            "Who the fuck is answering for us?! \n\n\"Half of us are okay with that\"\n\nMost of us are okay with whoever said that to coming in to work in our stead during our vacation....fuck outta here",
            "What are vacation days?",
            "They didn't ask those of us who are not okay with that.",
            "I'm not okay with it, but what choice do I have?  I can't afford to live let alone take a vacation.  I need to work to survive.",
            "I knew we were getting scammed when I found out it’s normal in many other countries jobs to have more than a month of paid vacation time per year. Meanwhile a week of paid vacation time a year is the norm over here. I will never not laugh when foreigners say we’re just a third world country with a Gucci belt 😭",
            "The article starts as if Americans were really devouted to work like the Japanese. Actually, the reasons are “no money,” “too much work so they don’t want it to pile up,” “boss discourages it.”\nThose are not workoholic reasons, those are sad reasons",
            "I barely take vacation here in the USA.   I’m on incentive pay through commissions and I don’t want to waste any opportunities to make a sale.    Even though my wife and I make 6 figure pay, everything is so expensive here we need every $ we can make.",
            "I don't take vacation because I don't get sick days. Have to save vacation for days I'm sick, or the kid is sick, or I have an appointment.",
            "Back in around 2000 I was in France and made friends with a woman that worked at a museum there. We stayed in touch after I returned home, and it was astonishing to me how basically every week it was me asking “so what are you up to?” And the answer was almost always “oh, planning a little trip” or “taking a break to do something fun”. It seemed like she was more or less always on vacation (though I know she was working too). Meanwhile she’d ask me what was up and it was always “just working”. Work was my whole life. It was something she barely thought about.",
            "Americans seem more like corporate brainwashed zombies than actual people. Life is supposed to be lived and enjoyed, not worked all the time.\n\nI guess it's similar to working class people supporting tax breaks for the rich. Smh",
            "No I am not. Stop gas lighting us. Should be a mandatory 2 week paid vacation time. And give us separate sick days back and not wrap it all up into one PTO bucket.",
            "I can take a week off. It means working 60+ hours the week before and the week after. It means getting emails and phone calls while I'm away. It means missing deadlines and losing all my metrics. It also means playing catch-up for the next 2 months. \n\nWhy don't I take my vacation? \n\nI can't take the stress.",
            "Taking my 30 days of PTO this year. If my employer didn't want this, they wouldn't be offering it to all of us.\n\nFolks that don't like to take their PTO are insufferable.",
            "Now US companies are pushing this bs system of “unlimited PTO” which carries no burden for the company and you get nothing cashed out.",
            "Also, more vacation days is SOCIALIST PROPAGANDA!!",
            "Are you saying the meaning of life isn't to help my rich boss make more money?",
            "It’s called social engineering, and no country is a more willing servant to their corporate masters than the US. Most don’t even realize they’re enslaved, much less by whom.",
            "I'm convinced that a lot about the U.S. just boils down to the fact that Americans hate each other and are totally ok with anything that makes other American's lives shitty.",
            "Unlimited vacation days was the biggest revenue/tax scam created by american companies to give the illusion of free will and choice…\n\nWhen in reality all it does is save the company millions of dollars when they dont have to pay you out for unused days…and make workers feel guilty for taking days off so they dont appear to be “abusing” the intentionally vague and unclear “unlimited vacation” guidelines",
            "As a Brit, my planned vacations for this year:\n\nI had a week away in York in April\n\nTwo weeks in Florida in July\n\nA week in Barcelona is September\n\nA week in Tenerife in December \n\nThis was all paid time off, plus I get 8 paid public holidays off work. This is a normal amount of time off work.\n\nI work for a US company and to book time off it’s an automated system where my request gets auto-approved. So your employers can do it, they just choose not to.",
            "The problem is most Americans dont have the money to use those vacation days.",
            "Vacation for me is kids draining my energy, wife spending my money, driving long long distances, and coming home to an inbox 100’s of action items deep. \n\nYMMV",
            "Me being an early career civil engineer:\n\nUS starting salary - $80K\n\nEU starting salary - €40K\n\nGuess I am okay with my 2 weeks vacation.",
            "I'm afraid to look for a better job because my friends who make more money get less than a week vacation every year and it isnt even paid for some of them, I have 3 weeks paid vacation every year and I really don't want to give that up, I usually take 2 weeks out of the year for relaxing and use one week to fill out sick days or take an extra day on long holiday weekends, I can cash out my vacation at any time too which has helped in some very difficult situations",
            "The economic press is being squeezed on us further and further. My generation can't afford homes or families if we don't already have assets and wealth. \"Work/life balance\" is increasingly a luxury thought one can only have after leaving survival mode.",
            "I get 30 days of PTO, 2 mental health days, special summer hours from Jun to Aug, and I am also fully remote.\n\nI can't remember the last time I actually took a vacation and didn't end up working some part of my vacation. I wish I could learn to enjoy taking vacation and not feeling like a guilty POS for taking time away knowing someone has to cover my workload (it's enough for at least 3 people to do but I'm an overachiever and probably workaholic because I manage it just by myself). \n\nThe one time I took a full week off and didn't work on anything I came back to work and was put about a month behind worth of work because people failed to keep up for 5 days and created disasters that I had to clean up.\n\nIf I worked with people who were as competent and organized as me then I think I could work on taking more vacation days but so far in the almost 8 years I've been in my position, not one person has met the challenge and succeeded.",
            "Going in every day and half-assing your job is the American way",
            "Yeah, I’ve never been okay with this. It’s weird how so many people around me are just accepting with 2 weeks a year.",
            "Im not ok with it",
            "which half is okay with that? I'm of the opinion that employee treatment in the US is absolute garbage tier",
            "Hard to take what isn't provided.",
            "No we aren’t, that’s just propaganda.",
            "I'm in Florida and work 100% remote, am an introvert, hate to travel, and keep hovering above my max hours off. \n\nI'm sure others are similarly demotivated.",
            "One thing I don’t want to be doing on vacation is driving, and as it so happens, I live in a place where I have to drive to do basic stuff.  \n\n That and my social life is pretty nonexistent. I simply don’t have a reason to take vacation. ",
            "I am definitely not okay with it.",
            "Thank you capitalism, never stop making money for the masses!",
            "I hire a person in Europe and they get 6 weeks, immediately, no questions asked.  They also get the 15 company holidays, about a dozen local state holidays, and of course all the sick time they want, although we do the sick time for US staff too.  \n\nIn the US, I give 3 weeks and it's prorated on hire.  \n\nRemind me again how awesome we are?",
            "Can’t afford a vacation even with PTO. Even ~~taking~~ requesting a day off is a chore that ends up not being worth it.",
            "I get 6 weeks for my job. \n\nI have only been able to use 3 days cause I’m so over worked right now. \n\nAnd I’m definitely not okay with that.",
            "That \"OK with that\" is some stockholm BS.",
            "I took three days off for the first time in the six years I’ve been at my company. I didn’t realize how tired I was until yesterday. Now I never want to go back.",
            "Companies and corporations get away with whatever the fuck they want.",
            "I feel bad for you guys. You really need to unionize across every industry and demand civilized working conditions.",
            "Alternate headline: other countries have far lower incomes than Americans and yet are OK with that",
            "I get 2 weeks of vacation I reserve for the really bad insomnia nights my work refuses to acknowledge after getting a note from my dr they requested",
            "We can’t afford to care! The people we vote for on all sides are screwing the hand working people",
            "I have German friends that are constantly talking about the trip they just took, are just about to take, posting pictures of all the gorgeous places they're visiting... People need to wake up in this country and stop selling their entire lives away for pennies. I'd like to see some of this planet before I die :|",
            "This is really sad. Especially considering that you don't get healthcare either.",
            "stupid is as stupid does.",
            "Honestly, taking a vacation just gives me major anxiety because of the amount of work I'll come back to. I'm better off just never vacationing.",
            "I am sitting on 160 hrs of PTO, I have 80 hrs scheduled for July, and 80 hrs for end of the year. I will likely take another 40 in Oct. and roll 160 or so into next year.  \n\nAfter that, I will no longer carry more than 40 hrs over each year.",
            "My French friend came to visit me in NY. Stunned to see people eating at their desks. Also the fact that people were walking to work drinking coffee in paper cups. He was like.  Sit down. Have a proper coffee. Relax. Then walk to work",
            "Sociopaths",
            "I get five fuxking PTO days a year. 11 unpaid holidays. Gotta deal with it tho so i can pay the fucking bills. Fucking american dream",
            "If Kim K can pull her socks up and strap her boots so can I!!!!",
            "Friday next week i have 3 weeks paid vacation.",
            "I haven't taken a proper vacation in over 8 years.  Have to keep working to pay child support. Don't make enough to save.\n\nMeanwhile my ex takes vacations all the time with the kids.  Just recently a 3 week European vacation.",
            "Yeah it’s the stupid half.",
            "Back before it didn't roll over and was  \"use it or lose it\", I'd wait and take a ton at the end of the year.  Sometimes every Friday in Nov/Dec.  \n\n\n\n\n\nNow it regenerates per pay period, and I'm using it throughout the year.  Week off for wife's birthday, week off for mine.  Week coming up for the FFXIV Dawntrail release...  Love not having to be stingy with them until the last minute.",
            "And we are poorer on average by comparison to our European counterparts. Because all the money gets siphoned to the top. 🙃 We sell our health and lives for a pittance to not-quite survive economically. It’s ok.",
            "And yet, most ppl refuse to leave, and most immigrants and other nationals still want to come in. \n\nAmerican is not a country for the poor. It's for the rich and conniving that functions on the back of the poor and stupid. It is easily still the most advanced country in the world capable of doing things other countries wish they could. Whether you like it or not, America is still the only country capable of making other large nations think twice.",
            "32 paid vacation days and unlimited sick days. Belgium has has a big history of fighting for workers rights& I'm so thankful I don't work in the US",
            "Yeah, who needs unions and labour rights orgs, right America? Those are just for socialists and commie trash.",
            "The sheer magnitude of abdication of human dignity for the sake of chest-beating for out-hustling fellow members of the working class is a persistent bug of the American way of life that I will never understand",
            "Nice try corporate. We would take more if we had the pto/vacation/ annual leave.",
            "*Fewer. You illiterate dotard",
            "We have a bit we could learn from Europe still. ",
            "Me, grabbing the nearest employee by their shoulders and shaking them aggressively: \"BECAUSE YOU'RE ***PROGRAMMED*** TO BE OKAY WITH THAT\"",
            "Americans are okay with a lot of stuff that is exploitation and borderline slavery:\n\nHealth insurance being tied to workplace. So it traps people to keep the job, unless they don't want to lose insurance coverage. \n\nUnrealistically high tuition fees for higher education. Trapping them into taking a loan to study and paying it off for decades.\n\nWaiting staff having low wage to heavily rely on tips. So it makes them think only about getting tips, instead of actually attending to customers.\n\nI did my Master's in Germany as a foreigner and studied solely in English. I learned an elementary level of German to interact with the locals.\n\nThe tuition fee was around 250 EUR/semester. Which is basically around 40 EUR/month. \n\nI had public health insurance (around 150 EUR/month). \n\nLived in a WG (shared apartment) and paid  around 150 EUR/month.\n\nWorked part time as waiter and earned \\~960 EUR/month from wage which was enough to cover all costs. \n\nGot my degree with zero debt. Didn't have to worry about health insurance coverage. Didn't have to worry about tips while working as waiter.  \n\nIf I were to do the same in the US, it wouldn't have been possible at all, lol.",
            "the only people okay with it are the ones that dont know how bad they actually have it. that or theyve been brainwashed into the work first loyalty \"family\" mentality corporations like to pull.",
            "Work to live, versus live for work.",
            "Yeah I work for a German based company and I started with a month of PTO can confirm US PTO structures are criminal.",
            "“We’re okay with it” is a weird way to spell “conditioned to not expect differently from years of incremental negative change”",
            "The amount of hoops by brother and sister go through in order to take PTO is crazy. I live in Europe and just took every Friday for the next 4 months off and not a single question asked.",
            "America is such a propagandized country. So many ppl believing in things that are against their own interest",
            "We gotta fund the the largest military on earth somehow.",
            "We aren’t ok with it, we just can’t afford to care.",
            "I am OK with that.\n\nIf you want to lead the world in productivity you don't do it by taking August off.  And 35 other days per year.\n\nMy wife's US based company was recently purchased by a huge European company.  In the interest of fairness they try to give US employees as many days off their counterparts.  So she had Juneteenth off.  She spent it working.  She had shit that needed to get done.",
            "I’m not sure what’s worse, the fact that the US workforce is treated like modern slaves to endgame capitalism or that you actually love being treated like modern slaves to endgame capitalism",
            "I fucking hate it here",
            "They also have a shit social infrastructure system and no public medical care. \n\nAmerica, a historical land of exploitation. \n\nYou can make it in America….if you do the exploiting. \n\n….and you have the freedom to\n\n….because the government doesn’t stop you.\n\n“Capitalize” take take take and watch your country go to shit but who cares that huge income gap is what provides you with the monstrous disproportionate wealth\n\nA country built off slavery and indentured servitude",
            "It is a wage and benefits problem. Americans don't have the same wages or benefits and thus have to work more or cannot take vacations to ensure they have the money and benefits they need.",
            "Just because I have 2 weeks off doesn't mean I can afford 2 weeks off.",
            "I've organized my work to be pretty sustainable, I work 3 days a week in Healthcare (12 hour shifts) I occasionally go out of town taking zero days off, and once in a while take an actual vacation.  I've probably taken a total of 10 days off in 10 years excluding the birth of kids.  I don't think it's the case with most Americans but I much prefer having work structured so I don't need vacation days than using as many as I can.",
            "Yea I’ve both lived in countries outside the US and have worked with clients globally through remote work and man did I realize just how little time off we are afforded, even just federal holidays in most other countries will give near 2 weeks off where in America you get 6-7 federal holidays that are mandatory off. It’s wild to me that the US military (am vet) gives more off time than any corporate job I’ve had so far.\n\nEdit: I have been enlightened to the fact that the holidays are NOT mandatory, what a sad fact to learn 😭",
            "I worked for a European company for 24 years - August closed in addition to 2 months PTO and a 32 hour work week. It was glorious.",
            "Yep cultures grounded in life > work exist outside the USA. Think if i go back to work for a company ill do a europe based remote job.",
            "Working for an American company that's owned by a German conglomerate gets me:\n\n- 26 paid time-off days\n\n- 3 \"summer leave\" days\n\n- 5 community service days (if I want to use them)\n\n- The week off between Christmas and New Year's Day\n\n- All federal holidays\n\n  \nIf we were not owned by a European company, it would be nowhere near this generous.",
            "We give our employees 30 days off with addional 12 days of bank holidays in the region of Germany we're based in.",
            "My Swedish coworkers are all off today for Midsummer",
            "We have offices in UK, Ire and US and we do get a lot more holidays over here. Americans get paid more but not enough more to make it worth it. I'd rather the  time off.",
            "Stockholm syndrome comes in many forms.",
            "I kind of feel the same way until I remember that I make more than double what my colleagues in Europe do. I mean that quite literally - in the US, most of our mid level sales and marketing team are making $120-$150k a year. In England, they make 45£-50£ a year and apparently, that's pretty good money.",
            "Ferragosto, where my family in Italy takes the entire month of August off. 💁",
            "All of the Italians I work with take all of August off. Its so crazy.",
            "Exactly the same. I work with a European team but I’m the only one with American benefits.",
            "Yeah, I worked remotely to a Swedish company, and in July/August, we just would get a lot of backlog tasks to do because almost no one was working in the Swedish office to give us new tasks. \n\n\nBut I did had a Sweden in my team who would work normally in these months. \nHe saved his vacation time to use on Winter to travel to somewhere that wasn't snowing.  \nHis logic did made a lot of sense",
            "I work at a large corporation and have many coworkers who often brag about how little PTO they take and/or teasing others about taking their allotted PTO.\n\nPro tip if you're like this: you're not going to get promoted by not taking vacation, the people making those decisions don't care enough about you to remember how little PTO you take.",
            "What I can say is a lot of young Taiwanese here enjoy working in American companies not because of better salaries but mostly for the much better working conditions and culture compared to the local.",
            "Yeah I never got to take this poll. \n\nMy name is Mitch Connor, I’m an American, and I am not ok with that. \n\nThis is bogus!",
            "*laughs in Japanese*",
            "This isn’t a real study, just a survey. It would be more accurate to say half of responders were not comfortable saying they want more vacation.  \n\nAlso a proper study would ask those on vacation how satisfied they are. Not only  those with a  variety of other potential factors. If you have no one to watch your kids or pets, or older family members, maybe you are happy with less vacation even if you would enjoy it if you had the resources to actually fully take one.",
            "Well are you charging into the C-Suite, screaming with saber and flintlock held high, or are you going to work under those conditions?",
            "Name a Republican who would pass anything like that, just ine.",
            "Agree. I get 4 weeks and that shit is gone each year. I have many coworkers that think they are too valuable and can't take time off. Yeah right. My wife has unlimited PTO and she probably took 60 days off last year.",
            "Our government is about money, giving people more vacation is less money",
            "Man, I wish I had that problem",
            "I get 3 weeks vacation, 1 week personal holiday, 2 weeks sick time, and we get a measly 8 holidays which our company has acknowledged everyone is asking for more of.\n\nThis article is saying 12 days a year off average? That's less than 1 week of vacation time if you're counting holidays.",
            "Everyone in France knows that Americans don't have many holidays. Well, everyone except your cousin.",
            "You get double what I get as a mom&pop employee in a small town. I have been here since 2016 and struggle to find the time to even use them. Would love to get them paid out at the end of the year.",
            "Wow even as a European 9 weeks is really long so he's lucky. I'm not sure what the average is but I normally see 5-6 weeks.",
            "yea dude i get 40 hours a year PTO hahahahahahaha",
            "Same. I could make 20% more probably. I'd rather stay under-employed. WFH more, work less than 40 hours, and enjoy ALL of my 5 weeks PTO and 2 weeks of holidays.",
            "Yep, for all the issues I've had at a government job. The stability and the benefits have been worth it.",
            "On the other hand the low pay makes it harder to enjoy the time for me. Things have gotten so expensive I'm afraid to use my time for the vacation I planned. I can't imagine going and then having car issues. \n\nAt least they'll pay it out when I leave.",
            "Also one of the benefits of teaching. We have multiple breaks built into our year. Never having to worry about working the major holidays is amazing. (I worked retail for about 10 years. That time is hell on earth!) I truly wish more people had the equivalent of a summer break.",
            "I’m still blown away I haven’t seen this happen at all in my office career yet",
            "It's less than the minimum in the UK. Everyone is entitled to the equivalent of 5.6 working weeks of annual leave a year. So for a full time employee working 5 days a week, that's 28 days. Hourly paid employees accrue holiday pay at (I think) 11.6%, which works out the same. \n\nThe minimum does include the 8 public holidays, so most people have 20 free days, although an employer can mandate you take leave at specific times such as Christmas and factory shutdown periods. \n\nI've earned an extra 5 days for time in service, and my workload makes it difficult to take time off sometimes.",
            "That’s the standard in Norway from day 1 of your job. \n\nMost companies offer bonus PTO days. My husband is close to 45 days at this point.",
            "It's better than Canada where you get 2 weeks. Some provinces increase it to 3 weeks after a specific time with the company. This can be anywhere from 5 years (Ontario, BC, Alberta,Manitoba, Quebec) to 15 years (Newfoundland). Yukon never gets a 3rd week. It's worse than all developed countries other than the US with 0. Since we constantly use the US as a measuring stick for our social programs people don't seem to care.",
            "Yep that’s what my husband does. We take around two big trips a year, with a few long weekends sprinkled in. I’ve known some people to take a vacation day or two to stay home and play a new video game they were excited about.",
            "That’s not really enough time to completely switch your mindset and recharge. \n\nHere the standard is 2-3 weeks over July and it takes at least one full week before I am mentally away from work.  By the second week my brain is relaxed and I can fully enjoy the next 2 weeks. \n\nI look forward to July vacation every year.",
            "Unlimited vacation is meant to save money for the company. With no days being accrued, you don't get paid out for unused days when you leave.\n\nIt also has the effect of allowing you to be fired for excessive vacation. You just aren't told what excessive means and thus take less vacation as a precaution.",
            "I'm an American and that's exactly how I use mine.\n\nThis year I took a full week in April. I turn any three day into a four or more day weekend. I'll usually set aside two weeks for the end of the year and roll over any leftover time.\n\nI'm allowed to bank up to six weeks, so I use that as a buffer to take pretty much as much as I want off. The issue is my wife, who recently changed jobs and only gets 80 hours. I prefer my time off to be with her, so I struggle to take a lot off.",
            "Because there's always a proverbial gun to the backs of our heads. We don't want to appear dispensable or at the bottom of the pack or else lose your job etc. etc. etc.",
            "They really are. Many of them also don't understand and try to shame others for taking time off like they are the weird ones.",
            "Unlimited PTO=no PTO",
            "But then you don’t get to travel",
            "My question is, where am I going to go in 3 days that I couldn’t go in 2? If it’s a 3 day trip, I can do that on one of the 3 day weekend holidays that are already on the work calendar and which don’t require PTO, like Labor Day.\n\nAnywhere else I want to visit takes longer than 4 days if I actually want to enjoy myself. I have a 12 day vacation planned for later this year and took a 7 day vacation last month.",
            "“We” don’t *need* to do anything\n\nPeople can spend their vacation however they want, in chunks on big trips or slowly over long weekends \n\nStop policing how people spend their vacation days….\n\nThe only thing we need to unify behind is guaranteed minimum vacation time by law.  How people spend it is up to them, we don’t need to “recondition ourselves” or whatever because you think people should be more like the Japanese ",
            "I prefer to use mine to give myself random 3 day weekends throughout the year. Taking too much time off work just backs up all the things I need to do. ",
            "Yes. Because the U.S. is a vast country, and if I want to see my family, I'll have to spend 2 hours at the airport, 2 hours flying, then another hour collecting my things just to travel there. No way I'm taking only 2 days off and spending half that time traveling. So 1 week chunks it is.",
            "What middle class.",
            "I want to move the the UK and work there, but my salary would halve. Do you find that COL is doable with a lower salary?",
            "When I meet new people I make a point to *not* ask what they do for work - my small contribution to the movement lol",
            "Glad I am not the only pedant on Reddit",
            "I came here for exactly that. Fewer vs less is a common grammatical mistake.",
            "Shut up, Stannis.",
            "What?",
            "I control effed to make sure someone hadn't beaten me to it. Well done.",
            "Or like the farmer told the pigs he’s smarter and stronger and better than them and he was going to help them punish the horses for being disobedient and they cheered him to the echo.",
            "Fucking hell. So perfectly put.",
            "As an American, I would make a great pet. Ò_o",
            "Japan probably does way more overtime than most Americans though so they work even longer days.",
            "It's the notion, drilled into us in schools and media, that the MLK civil rights marches are the *ideal* form of protest.  Any or all of the following *will* result in being tarred and feathered:\n\n\n * Out of date permit / not following the route\n\n * No clearly identifiable leader at *all* marches\n\n * Blocking traffic in any form\n\n * Disrupting work in any form\n\n * Striking / missing work\n\n * Union / union adjacent language\n\n * Carrying firearms in any capacity (except for status quo favorable causes)\n\nThe unspoken / underlying message is that any implication that one needs to work outside the bounds of the system is to enact change is not only unacceptable, it *by definition* means the cause is un-just.  Because the system *is.* Just.  That's what the civil rights marches did.  Fix everything left that was still broken since the civil war :)\n\nI completely appreciate not wanting the chaos of Jan 6th to be a standard for protest and transfer of power.  The issue I see among Americans in general is being simply *blind* to moral grey areas and the idea that sometimes you have to judge a cause by what it's fighting for rather than how it's fighting it.  We do this *all the time* with power struggles *outside* the borders of the US.  Yet within it, anything that upsets the apple-cart is tantamount to treason, regardless of reason.\n\nThe example I usually fall back to is the Hong Kong protests where people were literally fighting with police and in some cases using what would be considered \"life-threatening\" weapons against them.  This is not to say that US police == Chinese police.  But that such a comparison at all serves to shatter the idea that protests must always be peaceful.  We dress up ideas we like in noble notions like \"peaceful protest, non-violence, well-dressed, mannered, eloquent,\"   because the alternative is to struggle with the fact that maybe our moral compass *is* a bit relative and sometimes fighting for a cause within that system's bounds is the same as tying your own hands or asking another to tie theirs.  A noble sacrifice certainly, but there's an ever thinning gap between \"noble sacrifice\" and \"suffering in silence.\"",
            "> No we are fucking not ok with that.\n\n\nI suspect many of the folks who are \"okay\" with not taking vacation are those living paycheck-to-paycheck and who don't get any paid time off from work. If \"vacation\" means you can't pay your rent because you got five fewer shifts of work this month, then you might feel the same. ",
            "It’s not propaganda, it’s literally what the study says. \n\nThe propaganda is that you should be grateful to have a job at all, which is what our working culture shoves down our throats all day long",
            "It's not propaganda.  Maybe you're not okay with it and I'm not either but there are tons of people who are. It's especially common in blue collar work and places that run lean. For example my dad works in a place where they do \"rate\" meaning they've got a set number of things to build and if they finish early they go home early but get paid for a full day. They can usually knock out the work load in like 4 hours and then go home with a full 8 hours of pay but they work really lean so they'll have like 2 people who can do each job if one person takes a day off it can make everyone else on the team have to work an extra 4 hours and if it's a situation where one person is great and their partner sucks it can result in then working even longer.  Then there's some where they just have to stop. My brother is 1 of 2 electricians on his team and if they're both gone no work can get done. He had people all pissed off at him recently because the other electrician took vacation time and my brother took 2 days off when his wife went into labor early so all work had to stop and his coworkers ended up with 2 days with no work and no pay. \n\nIt's not uncommon to hear them complain about people taking vacation time or sick days and saying things like \"we get a week off over the 4th and a week off during Christmas that should be enough for everyone\" nevermind that those are unpaid shutdowns and not vacations.",
            "Many are not, but there are also many that are so ok with it, you will see them defending it lol.",
            "A lot of people are.\n\nDon't get me wrong, they're all morons, but a certain type of person is actually proud of never taking a vacation and martyring themselves for the company they work for.",
            "No need to go anywhere. Taking time off doesn't need to be a vacation from home, just a vacation from work. For example, I am taking the entire week off next week. I'm going to sleep in a lot. Stay up late. Work on projects around the house in the time I want instead of the time I have available after work.",
            "This makes absolutely no sense. Take a week off and chill at home if you don't feel like going anywhere.",
            "Wow. You Americans really don't know what to do with your free time. You are working, or you have to do a pre-planned vacation where every step is accurately studied.\n\n\nI just happened to take my days off by staying in my city and having fun (without going bankrupt).",
            "Y'all don't have a hobby that keep you busy for a week? Week 1 of vac doesn't count, that's rest and catching up on business.\nWeek 2 is when you setup the Marshall stack and learn that led Zeppelin solo you told yourself you'd learn and maybe jog some special park trails around town. Then build that raspberry pi project you bought last year! Let yourself get bored do some YOU things.",
            "Isn't there anywhere you would like to go, something you would like to see, anything you would like to experience?",
            "In some places in Europe they send you on mandatory leave if you have too many days accumulated. In other places they company begs you to take them, since it locks in their budgets and can cause issues in the next fiscal year. You don't even have to go anywhere,  you can just sit at home and get paid.",
            "You can do what my coworker did. He had so much pto saved up that he was being forced to use it. He took 1 extra day off per week for like 3 months. So he had a 4 day work week that whole time.  Got to stay at work because he felt like it and then just got a longer weekend.",
            "Vacation began as an Old French word, meaning \"**freedom or release**\"",
            "Same.  My company had unlimited vacation.  I have no idea how much I actually take but prolly around 2 weeks or less.  I take time off when I want to, but the reality is I love my life and my routine.  I’m a creature of habit and stability.  I’d absolutely advocate for other people to have more time available to them, and to take it (work can always wait!) but it’s just not something that’s super valuable to me.",
            "Ok, ever heard of taking a break? Vacation doesn’t mean go to Cancun for a week.",
            "Unlimited PTO is not a substitute for actual PTO.\n\nHaving a specific amount of PTO, that isn't laughably small is much better. I'll take 30 days PTO over \"unlimited\" nonsense any day.",
            "Unlimited seems a bit strange to me. You could just take every day off if it was truly unlimited, and if not, then it's not really unlimited",
            "Hence the problem. It’s a work culture problem",
            "My company has the exact same problem. Key players leave on vacation and everything grinds to a halt. They’ve spent year trying to meticulously craft our PTO policy to avoid this and get around, yknow, actually hiring more people, and it just never works. \n\nWide, sweeping changes year after year - every trick they can possibly think of to avoid hiring anything that could even remotely be considered a redundancy.\n\nI can think of a handful of people off the top of my head that, if they suddenly left or died, this building would have a for-sale sign in front shortly after. We’re heavily regulated and there is just no one that is capable of performing at their level in any reasonable time frame.",
            "Pretty much what everyone in the comments on the story said. Either can’t afford one or they’re too stressful because when you come back work just accumulated.",
            "wtf is this comment? who said that you need to go anywhere to use up your days off? There were times I took 2 weeks off and literally didn't do jack shit. Just sat home watched movies, series and whatever else I wanted to pass my time, pretty much anything aside from working myself to death. God damn you are such pushovers over there...",
            "Upvote.",
            "According to the Bureau of Labor Statistics, workers with unlimited vacation take 12 days off, on average: https://thehill.com/homenews/nexstar_media_wire/4040297-is-unlimited-vacation-time-really-unlimited/",
            "Well, you can use them - you just can’t go on vacation.  \n\nUse your days.  Stay at home and chill out for the week - sometimes that’s more therapeutic than an actual vacation.",
            "When you get back from vacation:  Delete all the emails you received during that time.  If it’s actually important and you were the only person who could do it, it’ll show up again.",
            "And that doesnt include the higher taxe rate either.",
            "That's part of it, but having just visited Italy where restaurant prices were just a little more than half what I'm used to in a Phoenix suburb goes a long way too.",
            "Lol ok. Engineer here. 40k€ per year starting salary, 55k€ after 10 years of experience. I get everything I need and then some. Taxes are taking some part but I've had 1000€ extra per month to invest through my whole working career... Even after having two kids, a new car, holidays, own apartment... 40k€ year in Europe gives you a good life, probably the same as $80k in the US.",
            "Exactly. I can't imagine a scenario where getting on a plane to travel would be part of a vacation.",
            "As someone from Stockholm, I would prefer my city not to be dragged into this.\n\nIncidentally, the term was coined by the psychologist Nils Bejerot, who worked with police during the 1973 hostage drama that was the origin of the term. Except, he called it the \"Normalmstorg syndrome\", named after the plaza where the bank in question was located. In foreign media, \"Stockholm syndrome\" was used, and that term was then reimported into Swedish: https://sv.wikipedia.org/wiki/Stockholmssyndromet [in Swedish]",
            "Part of it is that we're conditioned.  And part of it is that the social safety net is so broken in the US that if people lose their jobs they're kind of fucked.",
            "We get paid more than basically anyone else and most of us live super comfortable lives",
            "We get paid comparatively very well and we're free to do whatever we viably can. I find it very disrespectful to equate slavery to any system with flaws.",
            "Americans earn more money than other countries. It’s our work culture that is broken.",
            "Bro... Americans make way more and are taxed less.",
            "us wages are higher, but everything cost 10 times more\n\nhealthcare alone cost you guys so much i dont understand why you actually fought to keep it privatized when every nation where its socialized showed it cost 90% less and people dont die from preventable diseases like fucking diabetes\n\nyou dont have public transportation, you dont have healthcare, you dont have vacations, you dont have unlimited sick days, you dont have parental leave, you dont have retirement, you dont have anything\n\nlike why the fuck are you even working ? you dont make money and you dont live, and then someday you die without having enjoyed life a single day\n\nsome of yall work 80+h a week when most of us work less than half\n\nand you still cant pay rent or your medical bills\n\nyou dont even go see a doctor when you're sick cause you're afraid of that bill and thats why your moortality rate is so high\n\nyou have a infant mortality rate that we find in 3rd world countries\n\nthe fuck",
            "Paid time off is... paid. How can you not afford being paid the same rate, except not working?",
            "Right? I just took 3 days off and had 2 weeks between shifts. I have 6 weeks of PTO amassed, and literally can’t use most of it because of chronic understaffing in our department.",
            "Start looking at maternity leave. It's WILD how different America is. Most places give AT LEAST 6 months.",
            "US Federal jobs have a ton of time off as well, might look into it if you miss the work life balance. Your military service will count towards getting to the next tierin vacation days",
            "There are no federally mandated holidays in the USA. If your employer forces you to work on a federal holiday, you will have to work. You might get paid more, but you can't decline to work.",
            ">in America you get 6-7 federal holidays that are mandatory off. \n\nNot if you work in the private sector, they are not required to give you any paid holidays, or any vacation time for that matter.",
            "There's a reason salaries are much higher and companies choose to operate base functions here where they can get year around productivity ",
            "Work in a hospital where no holidays are time off. Then the amount of work you have to come back to when you return makes you think twice about taking PTO.",
            "5. Memorial Day. Labor Day. Thanksgiving. Christmas. New Years.",
            "I Love working for the state, I had last Wednesday off and it was awsome",
            "American CEOs choking in rage.",
            "The... the *entire* month of August - closed? And you still got paid?\n\nPLUS TWO ADDITIONAL MONTHS PTO AND A SIX-HOUR WORKDAY ... ?\n\nHoly shit. What the hell are we doing here?",
            "That's unbelievable. Like as an American I quite literally can't believe you. the most I've ever gotten is 3 weeks and I'm so lucky to have that.\n\nIf they're closed down in August, and you get 2 months PTO you're only working 9 months of the year? AND THIRTY TWO???\n\nMy life would be infinitely better with those conditions. Even if it were a lower wage than I make.",
            "I am an American that works for a huge Nordic conglomerate in the US. My boss in in Sweden but local policy is based on American HR models.\n\nThe difference is insane.\n\nIn the US office, the management level all maxed out PTO and have stopped accruing. \n\nMy European counterparts take either August or April off completely.  Also if the don't use their time off by the end of the year, the company is penalized and so they go around in December and toss people out of the office 😂 \n\nIn the US it's like _\"Oh Johnny hasnt taken a day off in 2 years...what a dedicated man!\"_",
            "What country and is your former company hiring?",
            "That is beautiful",
            "do they hire americans to work temotey for them)",
            "My husband worked for a European based company, but out of the U.S. office. Unfortunately they don’t offer the same benefits for the U.S. employees that the Europeans receive.  You have to be living and based out of said country. This is why you’ll get “scandals” periodically, like how IKEA USA employees don’t get any of the benefits afforded to their Swedish employees despite the country of origin.  \n\nI will say though, most internationally based companies do a better job guaranteeing holidays off than their American counterparts. At least the non-retail based ones.",
            "My company has a German branch (sadly is owned) and the German branch has more holidays than us🙃 they currently just upped our holidays to add one more day to “try and equal things out” and I’m like 🙃🙃🙃 thanks for the peanuts I guess",
            "This. *Cultures grounded in life*\n\nExplains American misery and massive mental health crisis.\n\nIn America humans are a commodity. To be traded and sold on the market \n\nOh slavery is very much around, just without the shackles and blatant title to “own”\n\nYou’re shackled from upwards mobility, you are sold and traded in the “market”.  \n\nDon’t like your job? You’re *free* to move to another shit paying crap job.\n\nThose shackles are on the form on debt built from our “pay to play” exploitative system.  \n\nIf you’re young in America, you’re screwed. They OWN you.",
            "I’ve always wondered what life is like beyond the walls of Shawshank Prison(The USA)",
            "Please share the name if you dont mind in the dm. That's beyond generous here in US!",
            "please drop the company name in the DMs.",
            "Meanwhile I get 0 \"free\" time off. I accrue PTO at a set rate and any time off work I want needs to be covered by that, whether a Tuesday in May or Christmas Day. They get away with it because it's a \"fun/desirable\" industry so there's always people lined up to work under these conditions. If the job market didn't suck so much better companies would prolly be hiring more intermediary/low mid level employees.",
            "That's amazing.\n\nI'm in the US, our company has an \"unlimited time off\" policy.\n\nI've taken 3 days off this year, and a half day.\n\n\"Unlimited time off\" is a scam to the highest order. Literally today I took my 4th day off in over 6 months, they tried to negotiate with me to make it a half day.",
            "They are not coming back girl",
            "Wait I saw Modsommar be careful!",
            "Tell them not to pee on any old tree",
            "My sister lives in the US. She makes double what I do, but I have 5 weeks off a year and statutory sick pay - she has 10 days combo of sick days and annual leave.",
            "Raw numbers don't mean anything. Purchasing power is what's important.",
            "I work in IT and often access people's work computers remotely. So many people 1) leave personal information on the screen when they know I'm accessing the computer and 2) have PTO banks of well over 100 hours\n\nTAKE YOUR DAMN TIME OFF",
            "Until they need excuses to say no to you for anything. Then suddenly, you've taken too much PTO to be considered for it as you are too unreliable.",
            "Putting on the company t-shirt, as we say in Argentina, never pays off.",
            "I made a random friend who moved from South Korea to America working for Samsung. He loves the work life balance here in the USA, he says he has time for his young son and spends time with his wife. While he misses family back in South Korea, he would never move back just because of the work life balance there.",
            "Yeah but Asia isn’t Europe",
            "TSMC is largely built on Taiwanese work culture.",
            "They draw a false conclusion in the article.  They conclude that over half of the people are OK with their vacation time because the same people don't use the vacation they have. They then proceed to give evidence that people don't take vacation due to pressure from their boss or financial issues.",
            "Japan and the US are practically tied here…",
            "My republican Governor hates hand outs so much that he refused federal aid for unemployment during parts of covid while at the same time taking the PPP loan.\n\nThen again, he thinks finding Social Security Numbers in a web page's html is \"hacking\" and spends over $1 million to get the state highway patrol to harass news reporters.",
            "Hell man most democrats are the same. The ones who push workers rights are the extremists in America.",
            "Shit, name a Democrat that would.\n\nEven on the state level, I'm in MA and there's virtually no laws for workers. They even just took away Sunday overtime to raise the minimum wage to almost livable.",
            "I actually am too valuable. There are things I can do that nobody else in my office can, and it's a pretty critical job. You know what? That's the company's problem, not mine. Any vacation day or floating holiday that I don't take is a day I worked for free. I value my time too much to give it away for free. If something comes up that nobody else can handle while I'm off, they'll just have to wait until I'm back.",
            "60 days off? So she basically just works 4 days a week?",
            "From my personal experience, it seems 50/50 split between no PTO at all and maybe 2-3 weeks, with no distinction between sick and personal time\n\nLots of jobs don't even acknowledge holidays besides Christmas, Thanksgiving, New Years and the 4th of July if you're lucky",
            "The concept of 'sick time' is just so messed up. Sickness is not something you can schedule, you just are sick as long as you are sick.",
            "I guess he's an optimist lol",
            "Man, that does sound great! Does that PTO figure combine sick leave with annual leave?",
            "I feel that, I have over 400hrs of sick leave built up so far and that’s with me not being shy about taking sick leave on random days to attend my appts. I also have over 90 hours of use or lose annual leave I have coming up that I’m going to use for my first South American trip.",
            "You can find a job getting paid more and the same vacation time. I worked government, I hated it. Found a new job making over double my old pay and I started with 5 weeks PTO and all the holidays. Just saying you should look what's out there.",
            "Ive seen someone have a stroke from overwork because she was trying to save up her pto which is also the same bank as your sick days. And this was at a company that was comparatively more generous with pto accrual than other companies. (Healthcare Industry)",
            "12.07% rounded up to the nearest hour.",
            "I remember one of the guys explaining that it’s definitely beneficial for the company. \n\nDon’t like the second part, because that’s the toxic environment I would not like.",
            "I just don’t understand how you can really recover from work and the everyday routine with so little breaks in between. The body and mind needs it.  \nBesides, every time I come back from a longer vacation I have a refreshed look on work processes and issues. It’s beneficial for everyone.  \n\nBut I understand your aspect and honestly never considered it that their SO’s vacation availability might play a role too.",
            "You can choose to travel or not. The problem is that Americans feel they must travel when they take any time off, resulting in them not taking any time off when they can't afford to travel.",
            "[deleted]",
            "I think the point is that you don’t have to *go* anywhere. It’s perfectly valid to just spend a day at home and if you take time off work it doesn’t HAVE to be for a weeklong+ vacation, even if it’s not really the mindset of the average American.",
            "That’s the whole point, why do you have to go somewhere just to take a day off?",
            "Just take the day off to relax, recharge, work on personal projects, catch up on chores or tasks that have built up, etc.\n\nI’m a teacher and I occasionally take a day off and stay home (and maybe get some non work stuff done that I haven’t had time for) just because I feel mentally drained. I come back being a better teacher for the reprieve.\n\nI don’t use all my PTO, though, for a variety of reasons. One is that it also includes things like sick days, it rolls over and accumulates, can be used for things like medical emergencies, and can be used to either retire early or be cashed out at retirement. Missing work can also sometimes be stressful, as we have a fixed number of days to get through the curriculum. On top of that as a teacher I get plenty of vacation compared to most Americans, so using all my PTO days as they come isn’t worth it.\n\nBut if I had a more standard job and all my vacation were in the form of a few weeks I’d PTO you can bet I’d be taking all of it. I think some worry about falling behind on work, but that’s part of the cultural problem. If it became the norm that people use all their PTO, then work expectations would adjust to accommodate that.",
            "Thinking fewer vs less is actually a firm \"rule\" is a common baseless pedantic complaint. Just because your 4th grade English teacher told you something doesn't make it true.\n\n\n\nOrigins of The Fewer vs Less Rule\n\nThis isn't an example of how modern English is going to the dogs. Less has been used this way for well over a thousand years—nearly as long as there's been a written English language. But for more than 200 years almost every usage writer and English teacher has declared such use to be wrong. The received rule seems to have originated with the critic Robert Baker, who expressed it not as a law but as a matter of personal preference. Somewhere along the way—it's not clear how—his preference was generalized and elevated to an absolute, inviolable rule. \n\n...\n\n\nA definitive rule covering all possibilities is maybe impossible. If you're a native speaker your best bet is to be guided by your ear, choosing the word that sounds more natural in a particular context. If you're not a native speaker, the simple rule is a good place to start, but be sure to consider the exceptions to it as well.\n\n\n\n\nhttps://www.merriam-webster.com/grammar/fewer-vs-less",
            "Nothing.",
            "You can count vacation days. So if you are comparing the amount to another amount, it is \"fewer\" and not \"less\".",
            "They probably also see it as disrespectful to not take time off that their employer allowed them.",
            "I don't see anywhere in the study that says that. It actually says 65% of Americans believe they deserve more time off. So I don't know where they pulled that headline from.",
            "Yeah the article says \"more than half of americans don't use their full vacation days\" and then randomly extrapolates from there to the bullshit explanation that \"they must just not want to\"\n\nBut the section below listing reader responses is full of the real reason which is pressure from the workplace. People feel like they can't use their vacation days because their boss will retaliate, or because their workplace is too busy, or they'd be \"letting down\" their coworkers.",
            "It's literal PTSD. When taking any time off could result in you being homeless, you simply compartmentalize taking time off and never think about it again. It can take actual therapy to convince people the rules of living their life have changed.",
            "The Marshall stack vacation is the best vacation.",
            "I didn't have a job that paid above minimum wage until I was 37 years old. It took me another 4 years to get comfortable with the idea of going on trips, or even to games or concerts or doing anything other than staring at my bank balance. Sometimes it takes a while to acquaint yourself with your life's possibilities.",
            "That's how I feel. I had over 4 weeks of PTO leftover at the end of last year (we have rollover so it's not wasted) I love my job and get antsy after being away from routine for long.",
            "How is it better? wtf.",
            "Did you miss the part where it said a minimum of 15 days? I’m taking 30 days off this year.",
            "It’s just a new way for companies to not pay out PTO if a person leaves. Mostly it’s just PTO with manager approval.",
            "In application, you're typically only allowed to take days off with careful planning and during fair weather (low/no workloads). There is a control element to unlimited PTO, you feel an inherent pressure not to take (m)any days off and we don't have a culture that supports or facilitates a leisurely work schedule.",
            "Well the expectation is that you do actual work still, not that they'll give you free money. It's unlimited in regards to situations you'd use pto for. It's nice for flexibility and options, but it also psychologically makes people take less overall too. That's why corporations love it.",
            "Right, the cost cutting CEOs make the shareholders happy for a time, but then the cost cuts mean there's no redundancy to handle treating workers like actual human beings who need rest, have to visit doctors, have family emergencies, and family events that aren't emergencies.",
            "One of our department heads has spent the last year training their team in each other's work, hiring on new people and partnering them with senior employees, making sure everyone is at least partly aware of how to do everyone else's job and making sure there are enough engineers around that if anything needs to get shifted around there are people available to pick up the slack. They were the hardest worker last year by a mile, and this year they've been on PTO at least once a month, and in the meantime her department is consistently ahead of schedule and able to adapt to shocks even if she is not immediately available.\n\nMeanwhile, one of the C-level folks took a two week vacation earlier this year and all work came to a near complete halt because they wanted final say on basically anything that happens in the company and don't trust any of the teams to make decisions without checking in first.",
            "Okay? My point still stands, companies are not giving you “unlimited” vacation days, under the truly unlimited, i could take months off…\n\nThe reason they do this is if you have set vacation days as a paid benefit. Say 3 weeks per year, if you dont take and you leave the company, you are paid out for what you accumulated.  Tech companies realized they could cut costs and discourage employees from taking vacation days with “unlimited”. 12 days is 2 weeks per year…i was getting 4 weeks off with limited experience when i worked in finance.\n\nSo, unlimited to me means if i wanted to take 7 months off, im allowed to do that.  But companies also write vague policy around how it can be used…\n\nIm not sure what your point is, if your trying to disprove or agree",
            "That’s what I use sick days for. \n\nVacation days to go on vacation. Sick days to take mental health days to relax and mentally destress. Could be going to the spa or staying home playing video games. \n\nMake sure you use up your sick days folks. Even if it’s to mentally recharge!",
            "It partly does because of pay roll tax. The effective income tax itself for a salary like that is 20% in Sweden at least and the US has taxes we don't, like property taxes.",
            "Health care access being tied to employment is at the core of this. If people had health care access that was theirs no matter what, then more people would be able to demand other benefits, be able to quit toxic jobs, and be able to take risks as entrepreneurs and small business owners. Therefore the C class fights tooth and nail against it and calls it socialism so the low IQ MAGA crowd (and it's predecessors under names like \"Tea Party\") will vote against their own interests.",
            "It really is insane to me. Combined with the chart from the other day, showing that US women are back at work, 2 weeks after giving birth. Man I couldn’t stand being under constant pressure and being afraid to take time off because I won’t get paid or run the risk of getting fired",
            "We also have astronomical housing/healthcare costs. You don't lose your families life savings if you get sick in Europe, it's almost guaranteed without insurance in the US. Hell it's almost guaranteed if you have it and you're not well off.\n\nTLDR that extra money goes to a few extra things other countries aren't worrying about.",
            "People also only compare the really high earning parts of Western Europe while ignoring the places where working people with both parents working don't even make $45k per year.",
            "Even after adjusting for higher pricing, US workers make way more than almost anywhere else: https://en.wikipedia.org/wiki/Median_income\n\nVirtually everyone in the US has healthcare. Yeah, we waste a lot of money on a suboptimal system, but workers still get more their wallets afterwards than in Europe.",
            "The US gives… nada. Not paid anyway. You could go through FMLA and get about 70% of your pay for six weeks depending on your insurance.",
            "Here in Norway it’s 49 weeks maternity leave with 100% pay (or 59weeks with 80%), and 15 weeks for fathers.  \n  \nAlso minimum 2 weeks for both right after birth.",
            "Or hell, PATERNITY leave. I got offered \"non-paid\" paternity leave of 2 weeks for both of my kids. I am the sole breadwinner. How exactly that is going to work? \n\nTell me we don't value fathers without telling me we don't value fathers.",
            "Imagine 18 months for maternity! My wife took every single day and spent it loving our son and life overall. She was the happiest person ever. I think she cried more than my son on his first day of nursery school because she realized she had to go back to the office.",
            "And even in the US there is so much variability between companies. I'm the dad and with our first I used all my PTO and a chunk of  sick leave, and with fmla got 70% of my pay. Our second child, with a different employer, I got 12 weeks with full pay.",
            "I have a young business in Spain and just hired my first employee. She called me up a few days before I was to send her the contract and seal the deal, to tell me she literally just found out she was pregnant and was telling me before she even told her parents because “if I decided to not hire her, she would understand.” \n\nI mean, shitty timing on my end- literally just getting started and i’m not sure how well I can float the cost and coordination of having my new employee be on maternity leave. Talk about trial by fire, but at the same time, she quit her old job to work with me, and I felt this weird responsibility, like “I’m part of the system now,” and the system here definitely isn't ideal for the average worker. And I can’t claim I care about my employee(s) and that I treat them well if I’m not willing to back it up when things like this come up. I also really believe that if you work *with* your employees to really promote their work-life balance (including finances/respectable salary), it’ll be positive in terms of building a loyal team. We’ll see how it goes.. check back in a few months to see if I’m too socialist for my own good.",
            "Termination protection isn't as universally better as vacation days and any form of sick days (dudes, even China has a more humane law in that regard), but guys as a German it was really hard to get my head around how easy it is to fire even guys that have been with the company for decades.",
            "I work for the US government and I, the FATHER OF OUR NEWBORN, got 3 months paid family leave while my poor wife who works a part time job got absolutely nothing. Screw this system.",
            "THIS, I’ll never forget how upset I was when my first niece was born and my sister went back to work in less than a week. That really opened my eyes as a teen.",
            "Even my municipal government job gives me way more time off than any private sector job I've had.",
            "idk about that, define \"a ton\" 😄",
            "Unless your air traffic control 😂 we don’t get all that time off",
            "but that's only the direct fed employees.  there's about 4x that many people that work as contractors on federal projects and it wildly varies on what you get based on the contract.  heck most of them have yet to get the juneteenth federal holiday, even though the building they work in is closed.",
            "As a Title 5 employee you start off getting 4 hours of annual leave and 4 hours of sick leave per pay period. The SL accrued never changes, but never expires... You can only carry over 210 hours of annual leave from year to year.  At 6 years you accrue 6 hours of AL. At 15 years you get 8 hours of AL.  Military time counts in this progression.\n\nYour military time only counts in FERS if you buy it back.  3% of your base pay. You have two years in which to buy back your military time interest-free.  After that you have to pay additional interest to your military deposit.\n\nI just hit 15 years combined between military and federal.  We're horrendously understaffed and I didn't take a lot of leave this last year. This year I'm taking 3 weeks off in July and plan on taking another week off in September when the kids are in school, mostly use or lose.\n\nPlus the new 3 months of paid paternity leave is a pretty swell deal.  My wife (46) and I (48) are far past that concern but it's a pretty outstanding benefit for younger employees.  \n\nIf you have twins, no, you can't have 6 months.",
            "That’s even sadder to hear. I always thought there was a couple that were mandated. We really gotta do something about the work culture here. I feel like we’re regressing from all the work that workers unions did for us decades ago.",
            "They are mandated, but only for the federal government and businesses that can't run if the federal government isn't -- that is , banks, who need the Federal Reserve.  Post offices still take them off.  Other businesses take them off for patriotism or because they like the idea of the holiday, but can pick and choose -- my pharmacy is officially closed on federal holidays but was open on Martin Luther King Day.  (Yes, I live in a red state.)",
            "There are studies upon studies that prove that shorter work week and more pto equal increased productivity and ingenuity",
            "Heh while they make millions in stock options on top of a paycheck most of us can't even dream of and barely working compared to the sweatshop they run.",
            "I should add I didn’t start at that - I think I started with August, holidays, and 3 weeks vacation. The 3 months off was after a decade or so and then I was maxed out.",
            "Making the shareholders happy so they can fly into their ski resort town for the weekend or hell anytime they want. ",
            "> What the hell are we doing here?\n\nWell we ave a LOT of billionaires here, so... making them money?",
            "Funding our military industrial complex so we can have the boats and yell at people to not touch the boats.",
            "We spend most of the 8 hours chatting about weather in order for Parkinson’s law to run full effect",
            "You should know this is not normal here, either. As a European, I’d kill for this job.",
            "Yeah, really hard to leave the job - would’ve stayed there forever - but they relocated to Germany and I cannot move at the moment. In a few years I’ll see about rejoining them. My first week I was working late and the CEO came in to say “the only people who will remember you work late will be your family. Go home.” And that summed up my 24 years there.",
            "American here in the US. I get 12 days off for federal holidays (including Juneteenth and the day after Thanksgiving). I also have 6 weeks of vacation, a week of sick time, and two personal days. During the summer I also get to work four 10-hour days to get Fridays off, too. Pay is not outstanding, but it'll do.    \n\n(I've worked for the same company since '98, though.)",
            "I was written up twice in my 24 years - once for not using my PTO, and once for taking a call while on vacation and not letting them know so they could credit me.",
            "This is such an important point that often gets missed. PTO is useless if you feel guilty or you're kinda shamed into not using it. The culture here is so different that, like you said - your boss forces you to take it.",
            "Germany and not at the moment. Apparently I did a good job filling my position ;) I was one of three who did not relocate.",
            "The inverse is also true. While some American companies may pay higher than local companies, I’ve known some people who ended up incredibly disappointed when they moved to Europe to work for an American company’s office there and they got a massive pay cut.",
            "Worked for a company based in the US, but most workers were in India. I was one of the few stateside employees that wasn't management+. 11 firm holidays, plus a few floaters. As it should be in any US job - as a minimum.\n\nHad to get a new job in October as that one's contract was not renewed as a whole (MSP). Worked it for 4 months, but got such a good job offer from someone else that even my boss told me *he* would take it. Anyway. About 2 weeks before I'm out of there, we get a memo that that Xmas and New Year's Eves are no longer holidays, are half day instead of full day, and if you want 8 hours of pay you need to use 4 vacation hours.",
            "Yup. I made a lateral jump in my field to work for a UK business. Half the pay, but no NHS. Hell, not even any business covered insurance.\n\nEdit: Important note on why I get neither. It is a UK business and I am working remote from the US",
            "There’s no such thing as a good company. They only exist as a consequence of the laws they are required to follow.",
            "You probably get much higher wages than the German branch though. I was a Engineering Manager in a US company but in Germany. I made 110k. My counterpart in the US made 160k.",
            "The whole country is set up for watered down slavery.\n\nA new prison is being built in my area and 2 huge buildings are just devoted to manufacturing with prison labor. Can't even go to jail to get a break man.\n\nWage shackles for student loans imposed upon younger low earners.\n\nHigher earners have no life because all we do is work.\n\nService industry makes you have multiple jobs because your wages are absurdly low compared to your rent, most of which offer no PTO.\n\nI know adults in their 40's and 50s that don't take any breaks. literally once a month they get a day off if that, then turn around and somehow judge those that get that \"luxury\". Man you know it sucks, but why must everyone be miserable.",
            "Highly depends on the company.   I'm at my 6th different company with unlimited PTO and all of them have been generous with time off. I normally take at least 5 whole weeks off In addition to single days here and there. Usually about 30-35 days total. Most I ever took off was 90 days. Lowest was 20, but that was because I had to cancel a weeklong vacation at the last minute due to medical issues.\n\n\nSalary and PTO are two of the biggest things I'm concerned about when interviewing. I would probably never work for a company with a set number of PTO days again.    But I also dig into what the culture is around unlimited PTO when interviewing.",
            "Yeah that depends on the company. I just took a week off to the Caribbean and am about to take two weeks off for Japan. I work for a small consulting firm. 🤷‍♀️",
            "My spouse got chastised for “taking too much time off” at the company where he works that has unlimited PTO. He’s actually worked every single day he’s been on PTO too, so he hasn’t actually taken any time completely off, but it’s still too much somehow.",
            "> 2) have PTO banks of well over 100 hours\n\nThat's a little over 2 weeks, that's pretty normal, especially if you're saving up for a longer vacation",
            "That's like 12 days, seems like a fairly normal amount to have early on in the year that you just haven't taken yet.",
            "For many of us the PTO stash is the emergency savings (payable at separation where applicable) in case we find ourselves on the wrong side of the \"at will\" employment scene.  So yeah I'm going to keep that baby filled up and take off Fridays as needed when I approach the cap.",
            "Yeah, America looks real bad when compared to Europeans, but compared to Asia it's closer to par for work life balance.",
            "Yep SK makes the work culture in Japan look sane by comparison",
            "Which is kinds nuts to think about because US companies generally don't have the best work life balance either.",
            "No they're not. Source: me who moved from the US to Japan and works twice as much now for half the money.",
            "No, they are really not. *Maybe* for Japanese working at American companies. I know my colleagues in Japan have a better work life balance than if they worked at a Japanese company.",
            "Almost every Democrat in Congress voted for Biden’s BBB bill which would’ve provided paid family leave. But the bill was blocked by every Republican + 1 Democrat (Joe Manchin). \n\nYour attitude is exactly why we’re in this mess. Spreading fake news like that convinced people not to vote, and then Republicans win, thus continuing the problem that Democrats are trying to solve",
            "Nonsense.  All the democrat led states have minimum paid sick leave and extended paid parental leave laws, in addition to higher minimum wages.",
            "Most Democrats wouldn't hesitate for more vacation time. The problem is the 25% who don't want it donate 75% of the funds .....................",
            "Most democrats are absolutely not the same. Any legislation passed in favor of workers’ rights is almost always passed by democrats. Republicans are actively working against them…so no, not the same.",
            "Bernie. easy question\n\nedit: additionally, all the other democrats that have sponsored [this bill](https://truthout.org/articles/sanders-democrats-introduce-bill-to-guarantee-workers-paid-time-off/)",
            "PRO act.  It ain't much, but I never see Republicans even trying to pass stuff for regular people, only making sure rich special Interests can't get sued for anything.",
            "That's what America does. Want something nice? We're gonna have to make something else shitty first.",
            "AOC",
            "[Congressman Mark Takano introduced a bill that would reduce the standard workweek from 40 hours to 32 hours a week](https://www.usatoday.com/story/news/politics/2023/03/15/congress-4-day-workweek-bill-california/11477292002/) Multiple Democrats also signed onto it.\n\nBut nah, both sides are the same amirite?",
            "Yeah something like that. She also got a week off in summer and Christmas just because, and half day Fridays in the summer. Plus a bunch of other holidays I don't get. I included all that in her time. It adds up quickly. Consulting firm",
            "Yeah, that about sums it up. The only places I ever saw advertise fewer than 2 weeks vacation and 3 days sick time, plus holidays, were fast-food places with something ridiculous like \"1 paid vacation day per year\" in fine print while advertising a fast-food job with paid benefits.",
            "Consider that most Americans don't get sick leave and have to use vacation time for that. For most of us, sick time is an amazing concept we'll never get to enjoy.",
            "I have a state job. We have accrual based leave. I accrue 10 hours a month annual(pto) time and another 10 hours a month sick leave. Plus 2 weeks of holidays. That's three weeks of annual and three weeks sick per year. We can roll time over up to 360 hours annual and 720 hours sick. I took a pay cut to work here. I am not complaining.",
            "Also federal, amount of leave depends on how long you’ve been there and what type of job you have, but in general AL and SL are two different pools. I’ve been federal for ten years and have 19 days annual leave, 13 sick days, and 11 federal holidays. In 5 years I’ll bump up to 26 days annual (my husband has a clinical fed role and started with 26, jealous). This alone is a huge factor in why I will probably stay federal.",
            "I have over 1600 hours sick time accrued and it’s getting kind of ridiculous.",
            "Definitely a gatcha, my company just switched to it. Not a big deal, but depending on your manager it can have an effect on your career.",
            "I’m a pharmacy tech at a really busy location and honestly… I kinda thrive off the chaos of work. I like my job, I like being there, I like helping people. \n\nWhen I’m not there, maybe someone doesn’t get the lowest price possible, (they call me the coupon queen lol), or maybe someone paid for a medication they didn’t have to because their insurance only covers *one* specific NDC, but you have to know that ahead of time. \n\nI think about my patients while I’m gone and I want to be available for them. I’ve been at my location long enough now that some customers ask for me, specifically. Sadly, the medical world *never stops*. It’s 24/7/365. People are never not in need of medications.\n\nI guess I don’t need to recover from work nearly as much because my work is rewarding and that fulfills me, it doesn’t weigh me down. I might go home physically tired, but rarely mentally/emotionally drained. Are there moments or customers that test me? Of course, but overall, I absolutely love it.\n\nI do enjoy my time off too and make sure to take a solid week off at least once for myself, then a couple long weekends for the rest to impact the pharmacy (and my patients) as little as possible.",
            "It’s more so that I want to travel so I choose to travel rather than take a bunch of single days off. I get 3 weeks off a year. I tend to take 2 separate weeklong trips and the rest are sick days/chores/long weekends. \n\nIf I could take a day off every month and also take my 2 trips I would.",
            "This is what I do, I take several \"staycations\" a year. Just chill at home for a week and not deal with work.",
            "Yeah like if enough people are using the word like that, then the definition and usage have clearly changed. 90% of native speakers can’t be wrong.",
            "No, I know. I was just hoping you were doing a Stannis.",
            "Thank god you clarified, I had no idea what they meant otherwise",
            "It's the opposite, they have a law here that forces everyone to take off at least 5 days per year because no one was using them.",
            "Surreal. You've been conditioned. I love my job but I also love actually living my life any enjoying time away from a corporate wheel that doesn't give a shit a out be or my wellbeing.",
            "How many days do you get cashed out if you quit?\n\nI don’t have to ask my boss for some extra off, I tell them I’m using my accrued PTO.  \n\nIf I quit or am fired, they owe me pay for every day of PTO I have accrued. \n\nHow is unlimited PTO better than a PTO balance if we end up effectively using the same time off?",
            "That’s why I made sure to mention my own company’s 15 day minimum. Some companies do try to weasel out, but I feel like the minimum time off mandate shows that they were operating in good faith. The intention was to relax the need to constantly report PTO days and clutter managers with extra timekeeping work, not to deprive employees of vacation days.\n\nOther organizations have nefarious intentions with these policies though.",
            "Maximizing shareholder value is bad for companies long-term, but hey, monke see immediate number up, monke happy",
            "If you live in a blue state you can be insured on the health exchange in 30 minutes to an hr after you get fired quit.",
            "No civilized society would set up health care and insurance the way it has developed in the US.  Tying health care to employment is incredibly stupid.",
            "It really depends on the type of position someone has.  A salaried employee is typically going to get a decent amount of paid leave.  Not like Europe, but not two weeks either.  But an hourly employee won't get any paid leave and probably needs to go back to work ASAP to pay bills.",
            "Western Europe is going through an extreme housing crises as well.  Their health care systems are also starting to crack and will likely have huge issues as many of these countries make their transition from industrial economies to retirement communities.",
            "Isn't it also largely American public that somehow refuses to fix that ? Each time someone even tries to discuss changing the system, one side starts screaming about communism, entitlement and low taxes. Can't really make meaningful progress on anything if people keep electing people who want dismantle even those existing safety nets.\n\nIt's frankly insane to me how many people in the US can get their lives absolutely fucked by losing a job while (or because) being sick. How anyone looks at that system and thinks \"this is good\" is beyond me.",
            "Even after healthcare and housing, Americans get paid more than Europeans.  \n\n\nAnd free healthcare doesn't mean that Europeans aren't worried about money if they get sick.  Gofundme is just as active there as it is here.  ",
            "> Virtually everyone in the US has healthcare\n\nThis is straight-up wrong.  I assume you mean health *insurance*, which millions of Americans still do not have.  And over half of American adults report that they struggle to afford health care. 28% have reported denying or delaying care due to cost.\n\n>US workers make way more than almost anywhere else . . . workers still get more their wallets afterwards than in Europe\n\n[Still wrong](https://www.worlddata.info/cost-of-living.php).  The US is fairly high on the list, but it's a pretty big leap to make your claim.  It's also silly to compare a country to a continent.",
            ">   but workers still get more their wallets afterwards than in Europe.\n\nNo they don't.  To claim this you had to completely zero out an enormous about of benefits, which is objectively wrong.",
            "We got billionaires to feed!",
            "“But wahhhhhhhh. Y’all aren’t making more babies!”  \n— Our Trash System",
            "Yeah, 6 weeks? At %70 pay can be card on a family.\n\nMy wife took her 2 weeks paid vacation, then I took my 2 weeks paid vacation when we had our twins. Certainly couldn’t afford to loose out on 30% of her pay for that long.\n\nWe just can’t seem to stop fighting long enough to make something basic like workers rights happen.",
            "New York just made maternity a law. We get a whopping 12 weeks.",
            "California to Washington, Colorado, Illinois, DC, and New Jersey to Massachusetts give 18 to 20 weeks paid leave for birthing moms and 12 weeks to dads.  ",
            "Unsure about other states but in NY it’s ~70% of your weekly wage, up to a cap of 70% of the New York State average weekly wage. This works out to a maximum benefit of 1151/week pre tax.",
            "I got 12 weeks at 80% pay for paternity. Finishing up my last day unfortunately. I'm in the US, and it was mandated by the state.",
            "yeah it's like 13 for federal holidays over the course of the year",
            "2000 pounds",
            "I would always work with urgency - not panicked or rushed, but with an understanding that all our time and resources are finite and valuable. Combined with meaningful work there was a drive to work intelligently and creatively. I’m now at a 40 hour a week job and the amount of time people waste chatting or deciding what to order for lunch is astounding. I’m moving my staff to a 35 hour week to see how that improves efficiency and morale. Board is watching us to see if it makes sense to move the entire org in that direction.",
            "WFH raised productivity too, but yet we're all dealing with RTO.",
            "Yeah but then they can't micro manage to the same level",
            "You think CEOs make data driven decisions?\n\n* Laughs then cries in data engineer",
            "studies show work from home equals increased productivity but nobody gives a fuck.",
            "> I think I started with August, holidays, and 3 weeks vacation\n\nI've been at my company for nearly 20 years and I still don't get seven weeks of vacation each year.",
            "having vacation days and using them are two different things though.  Plenty of people have PTO days but most won't even use a fraction of it due to the culture and stigma of taking days off.",
            "I suspect most fail to recognize that not having to pay for things like health insurance or a car means they probably made about equal or more. Depending on how much those cost them stateside, of course.",
            "11 days?  In the uk I get 28 days plus bank holidays a year!  It’s mad that you accept such a low amount.",
            ">11 firm holidays, plus a few floaters. As it should be in any US job - as a minimum.\n\n11?! My company- one of the top 3 largest in the world in my industry, gives 5.",
            "This is unusual, most multinational companies have pay/conditions based on the local market for each country.\n\nMy US colleagues have lower holidays and higher base salaries for similar roles, for example.",
            "In the US, we don't get socialized medicine. My union-negotiationed family plan runs about $400/month (which is 29% of the actual monthly premium). And it still has a several thousand dollar deductible before it pays *anything*. Also makes you less likely to jump ship, because, if you leave or get fired, you lose your insurance. Oh, but COBRA is an \"option\", if you can afford to pay the full monthly premium (which will increase by 3-5x what your share was on the job).",
            "> My counterpart in the US made 160k.  \n\nA huge chunk of that is probably going to health insurance premiums. You subtract anywhere between $12-$15,000 for healthcare, subtract another $20-30,000 for vacation/holidays and suddenly, it doesn't look that different. I'd honestly take your deal over his.",
            "Prisoners built America’s original road ways. \n\nChain gangs and smashing rocks in the Deep South was how labor was done.\n\nHousing is the latest and greatest American “fuckining”. \n\nThe rich are hoarding houses and land….then you not only pay your mortgage and rent…you pay it through them *and you can bet your ass they’re getting some*\n\nReturn to company housing and the company store.",
            "Yeah I hit 30+ days off last year",
            "Normal and pitiful in terms of the amount. In 3 months, I'll be hitting a year and have 40ish hours saved up. But yeah, upper management can go take golf days during the week and no one bats an eye.",
            "> saving up\n\nI’m originally from the UK and PTO is given to you in one big lump once a year, usually in April, and you take days off that balance when you take time off. When I got my first job in the States, I was blown away not only by the paltry allowance (10 days a year vs 36 in my last job in the UK) but a;so the fact they gave you a few hours every time you got paid. I’ve been in my current job for 12 years and still only earn 6.5 hours per pay period. What are they afraid of, that we will take all the leave and never come back?",
            "Our PTO is an accrual throughout the year, so no one starts the year with anything other than what they rolled over. I'll also add, this is a hospital setting. So everyone is overworked and burned out. So again, TAKE THE TIME OFF.",
            "People either horde their time,  or they burn through it as soon as it arrives.  Parent comment must be the latter.",
            "Facts. Exactly that. Never know when they’ll call your name in so many companies. That’s a huge bonus to have banked.",
            "Depends where in Asia.\n\nJapan’s [work hours](https://en.m.wikipedia.org/wiki/List_of_countries_by_average_annual_labor_hours#OECD_list) are around the European average, improving tremendously over the last 30 years. The figure also includes paid and unpaid overtime, based on actual surveys of workers (not employers) by independent NGOs.\n\nJapan’s [suicide rate](https://en.wikipedia.org/wiki/List_of_countries_by_suicide_rate) and [fertility rate](https://en.wikipedia.org/wiki/List_of_sovereign_states_and_dependencies_by_total_fertility_rate) are both around the Nordic average. \n\nIn fact, Japan’s [quality of life](https://www.numbeo.com/quality-of-life/rankings_by_country.jsp) and [median wealth](https://en.m.wikipedia.org/wiki/List_of_countries_by_wealth_per_adult) and are higher than that of Sweden this year.\n\nMexico on the other hand…",
            "To be fair that’s cause the work culture in Japan isn’t what people think it is. Lots of what people think it is stopped a while ago. \n\nYeah there’s still people that work too much, but it’s not the 60 hour work week everyone thinks it is. \n\nPlus we have 10 vacation days by law a year and most companies get golden week, Obon (a week), and a winter break week off. Plus scattered little holidays. \n\nThe small national holidays give us about 4-5 extra days off, the big ones give us about 15 days, and we get 10 a year by law (with it increasing every year you work)",
            "Ohh HELL NO",
            "In Korea they can't leave work unless the boss leaves and the boss often doesn't leave until past 11.",
            "The bar is so so low",
            "Not entirely true. If your company is small enough, you do not have to offer sick pay in NY",
            "Independent, not a democrat",
            "Bernie has always been an outlier",
            "AOC, too.",
            "I'm state, and if I stayed for ten years (2 currently), I'd get 17.5 days annual leave (20.5 at 15 years), 12 sick days, and 12 holidays. I'm not sticking with this state though, so I will have to start over at the next state. That's an advantage of working federal - you can move & still maintain progression in your benefits. Also, federal pays a bit higher salary.",
            "If you're on a pension plan, see if that gets accrued towards earlier retirement.",
            "Thanks for your insights. Honestly this just made me question my life lol. But seriously, a lot of food for thought because what is true about it is, you definitely should not *need* a vacation, it should be a nice little extra.",
            "I've had a pharmacist tech just like you who helped make sure my elderly parents got discounts and it was so amazing and helpful since I had to pay for everything with them being on such a limited income. So THANK YOU for what you do.",
            "3 weeks off in the entire year sounds utterly soul destroying.",
            "Man I hate both these sentiments above - that large groups of people can't be wrong, and that something done a way for a long time means it can't have been wrong the whole time.",
            "Next time I see someone write \"I did it on accident\" or \"by accident\" I'll refer them to you for validation because I sure as fuck ain't going to give it to 'em.",
            "Which is why regardless and irregardless mean the same thing now.",
            "r/StannisTheMannis",
            "That’s why the companies on the stock market have dropped from over 8,000 to just barely 4,000 in the last 10 years.",
            "Yes, but often either lesser insurance or more expensive.",
            "You work way more. Of Course there’s more in your wallets.",
            "Well it's not babies they actually care about it's more workers in the future and it's always about controlling women",
            "This comment would make more sense if European countries had higher birth rates than the US",
            "Part of the problem is we’ve been heavily brainwashed into thinking anything positive for people is socialism. And so people vote for the non-socialists either because god forbid our money went to help me some black people or simply because they’re just convinced into voting against their own interests. \n\nA lot of the fear mongering in the US about how much it would cost to have universal healthcare is straight up lies. On average we pay more for healthcare than any other developed country while having worse outcomes. The propaganda machine is strong and a certain percentage of the population plugs themselves in for several hours a day.",
            "Technically, it’s 6 to 8 weeks for disability for the mom to recover from birth, and 12 weeks for bonding for mom and dad, separately.  \n\nCA to WA, CO, IL, DC, and NJ to MA also have it.  In other words, Democrat led states.",
            "I mean…it’s better than Texas",
            "That’s a start, but still pretty shit.",
            "i know employees with 15+ years of service end up with 26 days in a year. that's pretty sweet but...it's also 15 years.",
            "Lol dafuq. You dont even get 2 weeks off a year?\n\nI am from the UK and you just reinforced my already low opinion of US domestic life/politics.",
            "Depends on the employment, but typically a Federal Employee will accrue 4 hours annual and sick leave in a pay period (2 weeks).\n\nNo Caps on Sick leave, but a Cap on Annual Leave that can be carried over to the next year (240 hours per year or 30 days). Theoretically you can take over 30 days as long as its before the years cap and you have enough (say you carry over 240 every year, halfway through you use accrued 120 hours that year plus the 240 you carried for a total of 45 days)\n\nIt goes 4 hours first 3 years, 6 hours of annual after the third, then (this part sucks) roughly 15 years to get 8 hours per 2 weeks.\n\nSick leave stays at 4 hours per 2 weeks and does not change.\n\nAt the end of the day, all dependent on local management. If you got a good boss/department you're gonna be fine. \n\nYou can also have shitty ones that deny crazy stuff. Typically Fed Employee's are represented by AFGE and we have a collective bargaining agreement that management is supposed to follow that is differentiated between agencies (I.E CBP would have a separate one from TSA or ICE).\n\nSome management may choose to ignore it, and if they do the response to get it rectified really depends on your own gumption to have it corrected or alternatively if you have a reliable and competent local union rep that can navigate the issue with you.\n\nIt's nice in the sense that it is really clear on what you can and cannot do in terms of leave, how much you should have, etc.\n\nThe inflexibility and bureaucracy oftentimes is the sucky part and can take a long time to have a problem resolved and causes a lot of disillusionment or suffering.\n\nSource is anecdotal - Fed Employee 4 years and local Union rep, Father is a lifer at 23 years.\n\nEdit: Expanded on Management and Union relationship",
            "Yay! Everyone needs a boss like you.",
            "Also, WFH tanked their office real estate.",
            "No, they still pay for health care in Europe, it's just deducted as a tax rather than insurance. ",
            "It's not that I accept it as much as it is keeping us too reliant on our jobs to do anything about it on a meaningful scale.",
            "The 11 days are our bank holidays. I get 12 of the federal holidays plus 25 vacation days plus 2 personal days. Plus 10 sick/mental health days. \n\nIt's all dependent on company here. Some are way better than others",
            "That's ridiculous, I'm sorry",
            "\nOh boy wait till you hear about retail.\n\nI got Christmas day and New Years Day. Thats it.\n\nSo glad I’m out, corporate retail is literally hell on earth.",
            "???\n\n>You subtract anywhere between $12-$15,000 for healthcare\n\nAverage cost of premiums is $8K.\n\n>subtract another $20-30,000 for vacation/holidays and suddenly, it doesn't look that different.\n\nWhat does this even mean? Who is spending $30,000 per year on vacations?",
            "ya load 16 tons, whadda ya get?",
            "My credit card is stuck in the floppy drive; why do you worry about my time off?",
            "No wonder they have such a high suicide rate",
            "It’s a big country with freedom of movement.  There is only so much one state can do when the adjacent one is available for a business to move to if regulations get too onerous.",
            "Moving the goalposts. Ya it can and should be better but Democrats and Republicans are absolutely not the same on this issue",
            "Good point, forgot about that exception.",
            "I assume you mean on the national level, because Illinois passed a 5 day pto for all workers bill.\n\n5 days is still super low, but it's better than nothing, considering the bar is in the depths of the deepest ocean trenches",
            "It’s never too late look at things and decide you want a change. Not until the day you die, imo.\n\nI’ve done a lot of different things in my life; I’ve worked at GameStop, Meijer (produce), a utility locating company, then finally a pharmacy. They’re all very different jobs and I was “okay” working any of them, but I wanted something I *enjoyed* so I kept my eyes open for opportunities and took them.\n\nThis job has ignited a love so deep I’ve been looking into the path to pharmacy school, which thankfully, my job assists with. I can intern right with them as well. \n\nI know it’s not quite as simple as “just change it”, but if you’re questioning… just keep your eyes open for those opportunities.",
            "I assure you, it is.",
            "A large percentage of us get 0, I currently get 40 hrs/year and have been denied the PTO request the last 2 years I asked (and I was forced to use vacation time when I had covid). I haven't been able to take vacation time in years. Dying seems like a better option than America.",
            "Living to work is lit",
            "That sounds amazing. 3 weeks off each year would be great. So much better then 2 weeks off.",
            "lol, if I stay with my shit ass Amazon delivery job for another ten years, I might have a week off every year.",
            "This kind of semantic drift makes me want to literally kill people.\n\nSigh.\n\n[Disclaimer because subtlety is fucking dead: This is a joke.]",
            "The one true king!",
            "Yup. World population is at 8.1 billion; it's projected to hit 9.4 billion by 2050.  I'm assuming there are some words missing when they talk about population decline. Colors, perhaps?  Something.",
            "It makes sense if you look at when the laws were implemented. You can easily spot an uptick in birth rates when laws that help new parents go into place. No one thing solves maternity rates like a magic wand. Plenty of people right now are looking at the political climate in the world and what is being done to keep the planet livable in the near future before deciding whether to have kids or not.",
            "We’ve been brainwashed into “peaceful protesting” bullshit where you’re not allowed to inconvenience anyone. Like France will shut down entire cities and riot at the first sniff of bullshit meanwhile in the U.S. the government can decide that corporations funding election campaigns is “free speech” and nobody bats an eye.",
            "All of the problem is believing that socialism is bad.  \n\nAmericans seem to think that either socialism and communisim are indistiguishable from each other or socialism invariably leads to communism.\n\nI live in a country that has many features of socialism and it grieves me to watch us slowly slide towards a society that resembles the USA.\n\n“A society grows great when old men plant trees in whose shade they shall never sit.”\n\n\\~Greek Proverb",
            "But but but I was told Republicans were pro-family?!?!",
            "It sounds like a great start to me. I had to take a lot of PTO while pregnant because of hyperemesis (basically bad morning sickness). I ran out of PTO, so I had to go back to work after the 6 weeks of FMLA. It was so hard, I cried every time I had to leave my baby. My husband only got 2 weeks off which I remember thinking was pretty good at the time lol. New parents deserve better!",
            "The absolute legal minimum in the UK is 28 days a year. And in any mid-level professional job or higher, that would be miserly. They would normally start at 33 (25 + 8 days bank holidays) typically, and go up from there.\n\nhttps://www.gov.uk/holiday-entitlement-rights\n\nEdit: doh someone in a collapsed comment for me gave the same info :) So let me add, in France it's a 30 day plus federal holidays minimum.",
            "Most lower jobs give 0 vacation days a year.  Maybe you get off for Christmas and Thanksgiving.   I went on a job interview once that bragged about their time off.  Year 1 you got 0 days off.  Year 2 you got 2 days.  Each year after that you got 1 extra day.  So in year 3 you had  days, year 4 you had 4 days.  But it capped out at 7 days.",
            "GOOD the bankers need to suffer",
            "Which is an absolutely huge cost savings it is important to note.  It's amazing how much more healthcare you can afford when half of the costs aren't going to useless, parasitic insurance companies.",
            "Actually the us spends more tax $ on health than most European countries with universal coverage.",
            "The taxes are dramatically cheaper than private insurance. The taxes exist solely to pay for negotiated Healthcare prices, whereas private insurance is as expensive as possible because a bunch if parasitic corps that add nothing to society do their utmost best to deny care and charge as much as they can.\n\nPrivate Healthcare is a massive scam.",
            "Americans already pay more per person in taxes for healthcare than literally any other country, and they pay for private health insurance on top of that.",
            "The person you replied to said they don’t pay for health insurance. They didn’t say they don’t pay for health care.",
            "That’s a pretty awful situation to be in. If I only got a couple of weeks off work a year I’d get burned out so quickly. Happy and well rested employees tend to be more productive after all.",
            "Well that makes more sense. You probably get around the same as we do then.",
            "Another day older and deeper in debt\n\nYou move 16 tones what do *they* get \n\n….another 15,000 shares and a new Corvette.",
            "And low birth rates",
            "I mean honestly some of these Republicans have admitted it so they've also admitted they want more white babies which is also fucked up to say",
            "Yeah but European labor laws are way better, universal healthcare etc and their birth rates are way lower than the US and other countries. I don’t think maternity leave has much of an impact",
            "Say what you will about the French but they know how to fucking protest.  The way they handled protests against the police was fucking A+.\n\nThey also got a history of properly dealing with despotic rulers - I think America could learn a thing or two.",
            "True but many of the countries, like France, have also seen a rise in right wing political parties so you can’t just look at the French farmers.   There are obviously French who don’t agree with the protests.",
            "In the land of the free? Who would have guessed?",
            "Hahahhaa seriously 🤣🤣🤣",
            "i always think about this when people make fun of americans for not traveling and experiencing the world outside of our borders. like WHEN would we even be able to do that!",
            "Guys guys the insurance companies say your both right! They would be happy with taxing us then gouging us when we get sick! You know like god or lincoln or whatever bullshitty patriotic pill intended!",
            "Pay more per month, then you'd best not *dare* to actually use it in any significant way without a hefty amount of equity in your home.",
            "Agreed,  I took today off simply because I felt like it.  I don't need to worry about not having enough holiday to last the rest of the year",
            "Maybe the person you are responding to does, but that 12 + 25 + 2 + 10 setup is waaay better than average in the US.",
            "I oweeeee my sooooooooooooul…\n\n^to ^the ^company ^store",
            "If you don’t think maternity leave has much of an impact, try turning it around and polling Americans: “how do you feel about having a kid when you have no support in that way?“.\n\nThere are tons of polls with data supporting the notion that Americans are having fewer kids because they don’t feel that they can afford them.\n\nCherry-picking one variable, (or one small set of data) will not give you anything other than just that: decontextualized data.\n\nNot trying to come off like a jerk. I believe we ought to point out that there’s more nuance to discussion than we are having here.",
            "Most of Europe knows how to protest. I am convinced that the major reason is because Europeans are unarmed. It is a fight and in a fight you may want to take your best weapons, in Europe this would be their fists and their mouths, in America it would be AR-15s. The weapons Americans cherish so is actually a weapon against them being able to effectively and peacefully protest.",
            "Yep, even the most generous package gets you two weeks off, so subtract family obligations at Christmas and Thanksgiving, and that's that. \n\nIf an American wants to travel, it's before college or after retirement. \n\nFor a European, it's \"I'm bored, let's get on a train and go to a different country.\"",
            "🦅🦅Land of the free, let's gooooo (nowhere because no vacation time) 🦅🦅",
            "2 weeks of paid vacation time definitely isn’t the “most generous” end of the scale in the US, it’s very average. The BLS tracks all this stuff - the average private sector employee at 3-5 years of service had 15 paid vacation days and 7 sick days. This is across all industries, so some are much lower (service industry jobs generally) and some are higher. I say this just to clarify so that people don’t think they’re getting great benefits when they get 14 days off a year; that’s average in the US so don’t let companies lie to you lol"
        ]
    },
    "A pet donkey disappeared in California five years ago. He’s been spotted living with a herd of wild elk": {
        "title": "A pet donkey disappeared in California five years ago. He’s been spotted living with a herd of wild elk",
        "score": 3197,
        "url": "https://www.cnn.com/2024/06/20/us/donkey-elk-herd-california-cec/index.html",
        "content": "",
        "num_comments": 61,
        "comments": [
            "I love this for him. Living his best life with the wild elk.",
            "I've seen pictures of the donkey among the elk all over the Internet but I had no idea he had a known backstory.",
            "That's probably working out pretty good for the elks. Donkeys are known for being extremely \"proactive\" when it comes to dealing with predators.",
            "It's where I'm going to go when I run away",
            "Aw, he has so many elk friends. If the donkey is happy, I'm happy for him.",
            "I mean, with rents in California, can you blame him?",
            "If you watch closely he is absolutely the herd leader....when he turns to walk the whole herd reacts to the donkey... not once but twice,that tells me DonKeyxoti is the Boss with the Sauce.",
            "\"Call of the Wild\"......answered!",
            "I was hoping the Seattle zebra would have this life.",
            "Animal escapes captivity to live with a wild herd is one of my favorite genres of animal story. thank you for sharing.",
            "sounds like a new Pixar movie script!",
            "He went out for a carton of milk ...",
            "So glad that previous owners are happy to let donkey be and won’t try to catch him! Best wishes to donkey and his new family",
            "Wish I could be spotted living with a herd of wild elk one day.",
            "Shut up, he is an Elk now!",
            "Donkelk.\n\nElkey.\n\nHmmm. I guess we'll find out.",
            "So cute.",
            "The herd was blocking the road, and a driver yelled, \"Hey, get your ass out of here!\" The head elk said, \"No, we like him.\"",
            "I've seen my share of wild ass in my time, but this one take the cake.",
            "When you herd, I herd, we herd!",
            "Nice to see him living the dream.",
            "“We’re nine American Elk… and Donkey. But we’re rocking with Donkey, ‘cuz Donkey’s rocking with us!”",
            "The funny thing is, he is probably the only one in the herd who doesn't know he's a donkey.",
            "In the video i saw, the parent [ a woman] said the donkey bucked at something. Threw off the rider. And ran off , while still saddled and loaded with stuff.\n\n\n\n\n\n\n My question was. Is ? So who took off the saddle etc then . lolol  As that donkey, is running free. Buck nakkked lol.",
            "Elk-eys incoming ",
            "That video was worth the click and ads. I love this for him.",
            "It has an alternate universe Bojack feeling",
            "This new CA approach to wildlife management seems to be quite interesting. \n\n\nMaybe they will be embeddeding secret chihuahuas with the wolf packs as well soon.",
            "The same thing happened in Colorado, but with a yak and only for a few months.\n\n[https://www.aspentimes.com/opinion/vagneur-what-is-that-among-the-elk/](https://www.aspentimes.com/opinion/vagneur-what-is-that-among-the-elk/)",
            "I read this as monkey not donkey :/",
            "This is brilliant to read, I pay a small amount every month to the donkey sanctuary, in memory of my mother, who supported them for many years. Also my sympathy for them, having seen them mistreated In Morocco, Tunisia, and also in half of the rest of Africa where I lived for many years. \nYes they are bloody nasty if you piss them off, and can deliver a killer kick to an enemy. But ELK!! brilliant and I hope to read more 👍🙏😂🤷",
            "Pack animals gunna pack.",
            "Student exchange program",
            "Maybe this is how he identifies",
            "The Elk are just Orcs in disguise im telling you.\n\nAnd during night they eat waffles",
            "Im glad he's safe, but why is this news again? This was reported almost a year ago.",
            "Let me guess, the herd is LGBTQ.",
            "\"My elk people are calling me!\" He said.",
            "My first thought, he is now the strongest fighter in the herd. They kick, bite and are know for their temper, basically protective professional boxers.",
            "This is one of my favorite facts to tell people. If you ever see a single donkey with horses or cows they’re the body guard!",
            "The hunter who found him said that apparently a mountain lion in the area had been killed by a hooved animal. That would explain a lot",
            "Short kings.",
            "STOMP STOMP STOMP",
            "Yes! The elk were grazing in a rent-controlled meadow.",
            "It looks like a herd of female elk, which means that he either took the place of the head matriarch or she has given him control of the herd. Which probably happened after he killed that mountain lion.",
            "Escaping in North Bend was so close to this.",
            "This who I am now, *Mom!*",
            "In the article I read it just said they were on a hike with him on a leash (most likely a lead, not uncommon for donkeys and mules) and something spooked it and it took off, dragging the dude holding onto the lead for a bit.",
            "r/onejoke",
            "It's exactly why my sister keeps a donkey with her horses. Anything that gets into the pasture that shouldn't be there is in for a bad time.",
            "Same thing with geese, they will take other animals “under their wing” and protect a flock. They can hit hard enough with their wings that they can break people’s legs, they are loud and frenzied feathery fighters.",
            "^^^Tiny ^^^horse\n\nBIG ANGRY",
            "That’s so neat! Like they’re domesticated working animals but for domesticated working animals.",
            "Donkeys be stompin'.",
            "Stomp stomp stomp stomp stomp Donk fuck him up",
            "I mean If I killed a mountain lion with kicks in front of all the villagers I'm automatically making myself the leader....the old regime gotta understand that they never killed a mountain lion and if they did, it was with weapons....not these beautiful kicking legs",
            "They are perfect anti Coyote and Wolf animals. The largest Honey Badger.",
            "Bird bones are hollow and cannot break adult human bones like that. It's a common myth. \n\nGeese will still put the hurt on though, especially animals whose faces are at their level.",
            "Yeah only problem is they aren’t very good at distinguishing dogs from Coyotes 😬",
            "Yeah, geese sound the alarm, but I've had dogs kill my geese, and a fox nearly got my gander. Lots of things can kill them. \n\nAnd I'm pretty sure a cougar could handle a donkey.\nEdit to add a link that explains why: https://donkeyrescue.org/news/pvdr-ears/the-truth-about-donkeys-as-livestock-guardians/"
        ]
    },
    "Zambian Pastor Dies After Being Buried Alive Hoping to Resurrect Like Jesus": {
        "title": "Zambian Pastor Dies After Being Buried Alive Hoping to Resurrect Like Jesus",
        "score": 1698,
        "url": "https://www.mwakilishi.com/article/lifestyle-news/2021-08-22/zambian-pastor-dies-after-being-buried-alive-hoping-to-resurrect",
        "content": "",
        "num_comments": 196,
        "comments": [
            "The problem is he skipped the crucifixion bit. It's a very important step in resurrection.",
            "I am no biblical scholar, but I don't recall the bible saying anyone other than Jesus gets to do Jesus stuff.",
            "Look, fellow grifters milking innocents for money and power.. you can tell people whatever you want, make up ridiculous claims, the more ridiculous the better and history shows us they'll eat them up. Just remember, don't drink your own flavor-aid. You can drink the kool-aid, but never drink your own flavor-aid. You'll just waste all that money you worked so hard to get them to give you.",
            "Stick his corpse in a cave and wait three days.\n\nBingo!",
            "Well, death is the first step. Now we wait.",
            "Isn't religion a hoot? I wonder if more pastors will follow his lead?",
            "He wanted to become a Zombian pastor.",
            "Needed a comfy tomb with a stone to block the entrance. Rookie mistake.",
            "\\* In Nelson's Voice \\*\n\nHa Ha!",
            "3 years ago. This is some old \"news\".",
            "The real NEWS is that a PASTOR actually believes the Bible, because most Pastors are unbelievers who use religion for self-gain.",
            "Commitment 👍",
            "\"Turns out his abilities may have been exaggerated a bit\" [Jesus](https://youtu.be/Ejn4YBOOntM?si=GZl8OgqB_N_6hhUn)",
            "Sounds like everybody wins.",
            "Dude gave 110%.",
            "He didn't follow procedure. Be born of a virgin, perform miracles, be arrested, crucified, buried INSIDE A TOMB, (not in the ground), then resurrect. You can't go to step F without following steps A though E.",
            "They didn't bury Jesus though, they put him in a crypt",
            "Now I’m not an expert in Christianity, but this sounds pretty darn blasphemous",
            "\"Sounds like a skill issue\" - Jesus, probably",
            "!RemindMe 3 Days",
            "Did they wait three days?",
            "Dying is an important step in resurrecting. ",
            "Someone give that fucker a Darwin Award! You gotta love when people die doing something extremely stupid because of their \"faith.\"",
            "But imagine the payoff if it worked? It didn't of course, but what if the guy pulled it off?",
            "Feels very blasphemous to think you would resurrect like Jesus. Dude clearly never read the bible that well.",
            "I’m thinking he actually resurrected the same amount as anybody, including any guy called Jesus ever did.",
            "He chose...poorly.",
            "The problem is the guy skipped having a seance with Harry Houdini to figure out how to escape from the grave",
            "Give it a couple days.",
            "Did they give him 3-5 days?  Can't expect him to beat the record on his first attempt.",
            "\"Are you sure they buried Jesus?\"  \n\"What? Do you think I actually read the Bible? Just throw more dirt on me, idiot.\"",
            "I mean, it sounds like he’s right on track so far?",
            "Don't start to believe your own bullshit ",
            "You might have to wait a few thousand years if nothing happens in the first few days, I think it says it in the instructions.",
            "Well.... Jesus wasn't buried, he was placed in a tomb... I think that was why this pastor didn't make it.",
            "$5 says one or more of his subordinates he trusted to install the secret escape latch betrayed him so they can try and take over the scam.",
            "\"Do not test the Lord your God\"",
            "Wait has it been 3 days yet?",
            "Well, he isn't wrong yet.  Jesus died before he was resurrected.",
            "Play silly games....",
            "Don't get high on your own supply.",
            "Leopardsatemyface",
            ">Reports indicate that Sakala’s soiled gown was covered with mucus and blood, an indication that he struggled to death. \n\nouch",
            "Give him a few days",
            "Did he try some of the easier miracles (water into wine etc.) before trying the difficult one?",
            "Did he wait three days? Maybe he’s yet to rise",
            "Alternate headline: Death cult claims another life. The tote board at the Vatican clicks over to 2,492,503,992.",
            "I hear that the average IQ just went up in Zambia thanks to him",
            "Give it time…",
            "Kenneth Copeland has to be so much holier than this guy, the private jets say so!  Why doesn't he give it a try, I'm sure God will ensure he comes out of the coffin resurrected!",
            "He definitely didn't think that one through.",
            "He was dedicated ill give him that but i don't see him becoming Canon",
            "No way this could be avoided",
            "*Zombian",
            "OK, he’s completed step 1.  This could still work, people!",
            "It’s like jumping off a roof thinking you can fly.",
            "I think it probably worked. Presumably the whole resurrection thing is changing from one state (dead) to another state (alive) \n\nHe just got the whole deal backwards in the planning stage.",
            "Hold up yall. Let’s go put him In a cave and wait three days. See what happens for science.  /s",
            "Death is a prerequisite for resurrection. He is on the right track!",
            "You know what he'd be doing if he were alive today?\n\n>!Scratching at the inside of his coffin. !<",
            "It said they dug him up on the 3rd day. But did they wait the full 72 hours? Maybe be wasn't fully cooked yet?",
            "are they just going to leave him there, or re-bury him? seems kind of like extra work",
            "Darwin award",
            "You're supposed to die *first*",
            "Give it about three days.",
            "God: no",
            "They didn't bury Jesus...",
            "Jesus wasn't alive when he was buried though...and it was in a tomb. With air.",
            "Well, he's halfway there.",
            "Just needs a little more practice.",
            "Guy believed in fairy tails and got the expected outcome. Hard to believe people look to religion for leadership moral or otherwise.",
            "Jesus Was not buried, he was entombed, but not any tomb, but the tomb of Joseph of Arimathea (according to Gospel), one of the *RICH* Disciples.",
            "Did he not know Jesus died first? There’s a workflow to this whole thing he may have glossed over",
            "Well yes, that's how it's supposed to go, at first. Geezzzz, give the guy a chance, could ya... Eat, eat, eat Jesus Christ, doesn't anyone just want to F#@k anymore?",
            "A true Darwin Award. Usually I only see honorary ones.",
            "\"Get fucked, poser.\" - Jesus",
            "Oh no!.  Anyways....",
            "[removed]",
            "\"Skill issue.\" - Jesus, probably.",
            "😐",
            "Surprise!  JUST like Jesus!",
            "Skill issue.",
            "Now we wait.",
            "As a betting man, I would’ve liked been able to that bet before they did it. Whatever odds you want to give me. I’ll take them. \n\nPeople die when you bury them in the ground even if they say they are going to resurrect. \n\nSlaps table. Let’s go. I got 5 on that!",
            "The comments on that article are fucking wild",
            "Nice try, but I'm going to continue worshipping David Blaine (buried for 7 days).",
            "Darwin Award contender",
            "Lmao",
            "“Get fucked Poser”\n-Jesus prolly.",
            "See you can fix stupid lmfao",
            "Funny thing is, he DID end up just like Jesus.",
            "Always look on the bright side of life!",
            "So he was resurrected exactly in the same way Jesus was, is what you are saying.",
            "I think we can all come up with several reasons why this plan didn’t work.",
            "Death by stupidity",
            "Cynics, just give him a few more days",
            "Talk shit all you want, but THERE is a true believer.",
            "Pentecostals are fucking nuts.  And uh... why were his hands tied?  Did he think he was Houdini?",
            "Oof... forgot to set the respawn timer ahead of time.",
            "Religion. What a disappointment",
            "I was thinking what, again? Then I checked. It's from 2021.",
            "Start to a pretty shitty isekai anime right here.",
            "Skill Issue",
            "Ill bet he was disappointed",
            "\"Today on BibleBusters...\"",
            "Cult status when?",
            "Trump called 911, but sent them to Nambia.",
            "Give him some time. No need to rush. ",
            "Where do religious people get these stupid ideas? 3rd world dumbasses.",
            "Let this be a lesson of the dangers of misunderstanding the proper order of operations. Mess up 3+6×(5+4)÷3−7 and you get 17 instead of 14, no biggie. Mess this up and BOOM, no messiah.",
            "Cue Zuul “are you a god?” scene.",
            "Womp womp",
            "Doesn’t tRump believe he’s Jesus, too? Just saying I’d volunteer to dig the hole for him.",
            "Never get high on your own supply. This may be from 2021 but it's still relevant",
            "Well, let's hope this trend catches on.",
            "I’d have gone with baby steps, like turning water into wine. If that works, then start resurrecting the dead, and then try crucifixion. He should have tested his Jesus Christ powers before going balls deep.",
            "And Jesus wasn’t buried. He was laid into a tomb. If Jesus would have been buried, when he resurrected, he would have suffocated.",
            "Generally, if one is not the Messiah, trying this is _both_ a bad idea and a heresy.",
            "Nailed it",
            "He skipped the whole \"place the body in a *cave* and roll a stone in front of the opening\". Jesus never tried to breathe through dirt.",
            "These preachers want the resurrection but they’re never willing to take the spear in the side.",
            "So close 😅",
            "Well, you cannot be resurrected until you die. Put him in a cave with a huge stone over the entrance for three days.",
            "Hey…go big or go home.",
            "If only they had buried Jesus instead of using a tomb. We wouldn't be having these problems.",
            "Maybe a crown of thorns is needed to? 🤔",
            "Now he committed suicide, and going to hell.",
            "Oops looks like the pastor missed a verse:\n\nJesus answered him, “It is also written: ‘Do not put the Lord your God to the test.’",
            "I'd say it's a little further upstream than that. You know, the whole God's son bit.",
            "You sir speak like a true theologian.",
            "Also Jesus was laid to rest in a cave and they put a rock in front of the door, they didn’t bury him in dirt. ",
            "Maybe start with the water into wine and see how it goes.",
            "Well it feels like God's chosen is really just this Jesus fella. The rest of us get, what, diabetes?",
            "Not it any way condoning this act of mental illness but unfortunately The Bible says just that:\nJohn 14:12\nESV\n\"Truly, truly, I say to you, whoever believes in me will also do the works that I do; and greater works than these will he do, because I am going to the Father.",
            "Actually that's wrong. It says that the true spiritually reborn disciples filled with the Holy spirit, will do the same stuff Jesus did. And everyone will get resurrected for the final judgement at the end of the world.",
            "There’’s a Life of Brian comment here somewhere but it escapes me",
            "It can be difficult to separate the grifters from the true believers, but dying for your belief is a pretty solid clue.",
            "I approve of people testing their beliefs personally.\nWhat i dislike is those that forcibly convert everyone else to believe in their nonsense.",
            "I think it would be better for the rest of us if they drank it.",
            "This might have been a mental health issue…",
            "Oh yeah, that's the problem. This guy forgot to use the cave technique. It's a lot less work.",
            "I think the first step is: Be Jesus. If you skip that part, step 2 doesn’t work so well.",
            "We can hope",
            "This ain't religion....this is stupidity and either mental instability.\n\nThis is someone/s either not bright enough to realize that death is permanent and the group just went along and buried him believing in the resurrection.\n\nsomeone who knows death is permanent and wanted to get buried alive and the group obliged him.\n\nOr a sham preacher who got confronted by his flock for something corrupt and buried by the mob as a form or mob justice.\n\nI really feel the first reason COULD be the one but I have my doubts....though dumber shit has been done by dumber groups...but that usually involves every member of the cult not just the leader.\n\nBut imma bet on reason 2 and 3 and I have my doubts  that this preacher believed in a real resurrection and would be forced to believe (based on it never happening in history) that he was mentally unstable and the group obliged knowing it was suicide.\n\nAnd that leaves reason 3....preacher was corrupt and trying to get rich off the flock and the mob was like \"you wanna use the story of Jesus to manipulate the poor so you can get a new Bentley!?....we gonna bury you in that hole there and we can see if you resurrect like Jesus!\"\n\nStory comes out that he believed in the resurrection cause he felt he was the new Jesus....everybody buys into it.\n\nMission complete",
            "The Bible doesn't say that Jesus's *followers* would be resurrected on Earth.\n\nTherefore he either mis-read the Bible or came to believe he was the second coming of Jesus.\n\nHe fully committed to the bit, however. So, partial credit.",
            "Three years, so far (article is from 2021).",
            "In a Snopes article on this, it sounds like he actually did that, and this was his second time.",
            "Bet he didn't even try spitting in blind peoples eyes.",
            "Quite probably a different church, ours (Catholic) says this is something only Jesus can do, so if you are not Jesus, you should not try it.",
            "Alternative headline: nutcase pastor does probably one of the most heretical things you can do and claims he can do the things only the Son of God could do. \nDies trying to prove it",
            "Are you sure? They might see him as a martyr now.",
            "Sorry, but your account is too new to post.  Your account needs to be either 2 weeks old or have at least 250 combined link and comment karma.  Don't modmail us about this, just wait it out or get more karma.\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/nottheonion) if you have any questions or concerns.*",
            "Same.",
            "Don't forget to magically copy and paste bread loaves and fish to feed few thousand folks.",
            "Yeah baby steps, like hooking up with a girl named Mary Magdalene first.",
            "I guess his motto was go hard or go home",
            "You never go balls deep into Jesus Christ. Everyone knows that.",
            "No, he should have walked on water first.  \nFor science.",
            "[removed]",
            "ah i made the same joke :P",
            "I propose that this becomes a crucial test when trying to become a preacher, lets see how many churches and preachers suddendly find something better to do.",
            "so you're saying Beatrix Kiddo is more powerful than Jesus?",
            "African Christianity is wild",
            "C'mon people, where the heck are all the upvotes for this?  The simple ones are always the best. Where did everyone's sense of funny go?",
            "To be fair the list to lease the lance of longinus is quite long.",
            "\\* go to hell",
            "I mean. There was likely dirt above the cave, so he was under dirt.",
            "Hmm, I'd have sent God a follow-up email just to clarify, because this leaves a lot of room for interpretation.",
            "Then I guess this fella shoulda prayed harder.",
            "Apparently, he successfully pulled this trick before, but this time it didn’t work: https://www.snopes.com/news/2021/08/24/pastor-dead-buried-alive-zambia/\n\nSo I’d say he’s more likely to be a grifter who was enthusiastic about pulling impressive tricks and he had a way to make those work, but this time something went wrong.",
            "[or the secret release on the side failed](https://youtu.be/Qx6sPRlcafA?t=55)",
            "[removed]",
            "no cave skip no pb",
            "Remember lawyer jokes? We need those with evangelical pastors now.",
            "It would save a lot of kids from being sexually molested.",
            ">This ain't religion....this is stupidity and either mental instability.\n\nI mean....",
            "The original Missingno item duplicator\n- Jesus Christ",
            "Maybe just get your feet washed? See how that feels…",
            "Mary Magdalene was most likely a very wealthy older woman who bankrolled her friend’s unemployed son",
            "Sorry, but your account is too new to post.  Your account needs to be either 2 weeks old or have at least 250 combined link and comment karma.  Don't modmail us about this, just wait it out or get more karma.\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/nottheonion) if you have any questions or concerns.*",
            "That's a damn fine idea, right there...",
            "Well, did Jesus train under Pai-Mei?\n\nDid he taught him the Five-Point-Palm Exploding-Heart-Technique?\n\nHmm?",
            "It's not just that, his options were  \nA) Wait until the end of the world like everyone else  \nB) Have someone who IS actually in sync with the Holy spirit and have that guy resurrect HIM, but that would only work if he DIDN'T kill himself ON PURPOSE!  \nC) Even if he was in tune with the Holy spirit (he's not, and this action is the 100% proof of this)  \nhe can't resurrect himself, that's actually the true part, disciple or not, you won't resurrect yourself. In that regard, Jesus was unique.",
            "Nice find. Overconfidence is a killer.",
            "Sorry, but your account is too new to post.  Your account needs to be either 2 weeks old or have at least 250 combined link and comment karma.  Don't modmail us about this, just wait it out or get more karma.\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/nottheonion) if you have any questions or concerns.*",
            "I chose to believe that most believers do so for healing spiritually....maybe as a form of soul searching like in the therapeutic sense....there are people who believe in God on a spiritual level but don't go to church and don't really mention religion in their day to day....I don't think every believer is dumb or mentally unstable.",
            "Exactly! Dude JUST said you can’t start off balls deep",
            "Foot baths! Fuck yes!\n\n\n- god",
            "Perhaps a roll-away style door in case the angels don’t have a shovel?",
            "Maybe being baptized underwater for 5 minutes.",
            "Jesus' sugar mommy essentially",
            "Yes. It is mentioned in Pauls letter to Djengis Khan.",
            "Slow and insidious, yes.",
            "agree to disagree?",
            "Agree to disagree."
        ]
    }
}