{
    "This most likely breaks the rules but it needs to be said": {
        "title": "This most likely breaks the rules but it needs to be said",
        "score": 140308,
        "url": "https://i.redd.it/xymttw7wlgi91.jpg",
        "content": "",
        "num_comments": 1623,
        "comments": [
            "The mods from r/TerrifyingAsFuck asked me to point out that if you answer \"yes\" twice on this flowchart, that they'd love for you to go post it there.",
            "Nah I'm glad someone fucking posted it..  we need to ban karma farmers.",
            "Thank you for your service. Now do nextfuckinglevel and interestingasfuck",
            "Mods please pin this",
            "The best oddly terrifying content is when you look at something and you aren't even sure why it terrifies you.",
            "jarvis i am low on karma post a picture of freddy krueger on r/oddlyterrifying",
            "This frightens me in a bizarre and novel way!",
            "THANK YOU! people will post a character from a horror movie and be like “tHiS Is oDdly TerRifYing”",
            "This should be the god damn logo",
            "Wow, this flownchart should be in the rules for this sub and you have to acknowledge seeing it before posting.",
            "We should do the thing that r/unexpected does. You need to explain in a spoiler in a pinned comment why it’s oddly terrifying.",
            "Scariest post this post month",
            "I think it should get pinned too",
            "I agree with everything here. A giant spider eating a bird is *not* \"oddly\" terrifying. That's just regular old terrifying.",
            "Mfs will post someone being murdered or something and be like “wow isn’t this oddly terrifying”",
            "[deleted]",
            "I think this passes strictly because of how oddly terrifying it is people can't grasp the concept of \"Oddly terrifying\".",
            "I fucking hate that when this sub got big, things that are supposed to be scary or terrifying just started appearing everywhere and getting upvoted.",
            "People will be posting people on here straight up getting dismembered and will be like “this is just a little terrifying to me, idk”",
            "*Posts picture of Nuke exploding* \nODdLy TeRrIfYiNg",
            "Needs to be at top of the sub as a sticky.",
            "\"wHaT iF a LiOn BiT yOuR aRm OfF?!\" .. yes that would be terrifying.. now go away",
            "I saw a post on r/interestingasfuck and it was just an abandoned car with the title \"at the rate of $28/day for parking, this car has a 2000 something dollar ticket\" like people really need to learn what qualifies as applicable for a sub",
            "\"this most likely breaks the rules\" \n\n\\*gets pinned\\*\n\nFunny how things work out 🤣",
            "Yes. This sub has gone soft lately. 90% of shit posted here is not terrifying at all",
            "You know a sub has gone to shit when you need a pinned post explaining what the sub’s supposed to be about.",
            "Yes.... Finally the revolution",
            "It needs to be fucking stickied",
            "I nearly shat my pants reading this",
            "Jesus Christ, instructions, now that is oddly terrifying.",
            "And yet, people still don’t heed this warning",
            "There’s a train near me and the tracks are raised maybe 2-3 feet above the footpath which runs parallel to them for a few hundred feet as you both pass under a viaduct. It’s a bit out from the city and the 2 interconnecting stops are a few miles apart so trains shuttle through there at pretty high velocity and to witness it is pure horror becaus there’s just this huge, massive, metal machine pummelling through, towering over you, wheels and carriage right at face level then whooshes past your head with all the sounds reverberating around the walls that surround you. Idk I get a mad rush every time anyway. I’m sure some of you have bullet trains and maglev aiming at your face and in half a second lobbing past your cranium and off into the distance as a daily occurrence anyway so whatev.",
            "This is terrifying and I don’t think you intended it to be",
            "Oh no! Arrows! The most oddly terrifying image to exist!",
            "Oddly terrifying: Inside of a leatherback’s mouth\n\nNot oddly terrifying: Horror movie clip",
            "Needed to be said",
            "So many subreddits need to crack down on posts that go against the purpose of the sub",
            "This sub has fallen the most of the sub's I regularly enjoy. The things are either not at all terrifying and/or it's completely expected why they would be. Do we need better/more strict moderation?",
            "If this breaks the rules then to hell with the rules. +1",
            "Yeah this sub kinda lost its purpose. People just use it to karma farm anything slightly unusual at this point.",
            "Finally leaving subreddit because there is just no filter for actually \"oddly terrifying\" things here like there was a year ago when I joined.",
            "i once saw a post here that literally shows a dead fetus, i dont think thats oddlyterrifying, thats extremely terrifying bro",
            "This is the way.",
            "Meh.. what is terrifying to some may not be terrifying to others. It's completely subjective.",
            "This sub be like:\n\n*shows an adorable kitten*\n\n“HOLY FUCK GUYS SO SCARY WTF!!1!1!2”",
            "people will ignore this and post it heare and in TerrifyingAsFuck for the free karma farming anyways",
            "My worst fear - decision trees!",
            "The amount of people in this sub who don’t understand this is oddly terrifying",
            "As a person with flow chat anxiety, this is oddly terrifying",
            "It's oddly terrifying it had to be laid out like this.",
            "Posts chart about what is oddly terrifying, isn’t oddly terrifying.",
            "The is r/oddlyterrifying that people need to explain what oddly terrifying means.\n\n/I got you OP.",
            "For most people here this is terrifying and it should not so it fits /joking",
            "Yeah, lot of people mistakes \"weird\" with \"terrifying\" and the the sub is full of shit.",
            "This gave me goosebumps",
            "I don’t understand why mods haven’t been removing posts that don’t at least somewhat follow this logic?",
            "My phobia is charts so this is appropriate",
            "Also enough of insects filled with parasites.",
            "It’s hilarious that this is the most gilded and respected post on here in a while.",
            "Can we also agree that if it has an agenda or political undertones that it’s not appropriate either? I really don’t come here for that.",
            "Recently I was with someone who said they are afraid of many small holes clustered together. I thought it was funny until I googled \"fear of small holes\" and now I'm terrified too.",
            "Ok, but what are we supposed to do about stuff that is not terrifying but it is supposed to be?",
            "Dont blame the posters, blame the updooters. They be changing the whole algorithm for a minor nasal exhalation.",
            "Based",
            "I used the rules to break the rules",
            "Could we at least get a trigger warning for this post?",
            "So, can i post my energy bills here?",
            "Breaking News: r/oddlyterrifying post down 91%, more at 5:00.",
            "Fortunately I have a debilitating fear of decision trees.",
            "hey r/oddlysatisfying posters and mods, please take note",
            "I had never seen this sub till today and 5 minutes in I can see this graph is necessary. I understand fear is a personal thing, but some of this stuff isn't terrifying to anyone.",
            "This post isn't terrifying",
            "“Likely breaks the rules”\n*gets pinned by a mod*",
            "I don't think this picture belongs in oddly terrifying .",
            "It terrified me, but shouldn't. So it is not breaking rules.",
            "Holy 102k upvotes batman!",
            "This got a lot of upvotes very quickly",
            "Holy shit I haven't seen a more accurate and brief description of this sub in my life.",
            "Withh this diagram, I can easily find what is not supposed to be in this sub",
            "yep",
            "I'm sick of all the AI bs.",
            "word",
            "Nah this is oddly terrifying to the posters",
            "Yet 99% of posts don’t seem to follow this. Doesn’t seem that hard to understand yet the whole sub is over saturated with deliberately scary things.",
            "Is it created by AI?\n\nNo -> follow diagram posted \n\nYes -> get lost",
            "Choosing beggars needs something like this",
            "OP: \"This most likely breaks the rules.\"\n*gets pinned instead*",
            "By the rules of this post, this post is not supposed to be here.",
            "Too many people just post blatantly terrifying shit. The term “oddly” means it should be unsettling in a way you cannot easily describe.",
            "Almost nothing posted is for real oddly terrifying at all... 😔",
            "It's still a problem",
            "Is there something we can do about all the constantly non terrifying posts? About to unsubscribe",
            "Happy cakeday",
            "r/memesistaken join",
            "I just unsubbed because people are apparently terrified of everyday things… it’s stupid karma farming and people on here are encouraging it.",
            "👍 This post definitely gave me chills! It's oddly terrifying, but I couldn't help but be mesmerized by it. 😱",
            "👍 Great post! It definitely gave me some chills. 💀👻",
            "Wow 😳 This post gave me chills! 👻👀 Definitely not something I see every day, but it's oddly intriguing at the same time... 😅😬",
            "👀👻😱 This post gave me chills!",
            "👀👻😱 This post gave me chills!",
            "Why is this the most confusing ever",
            "👀😱 Wow, this post really gave me the chills! It's so strange and creepy, but also intriguing. Good find!",
            "😱 This post gave me shivers! 😨",
            "Can we get some moderation on the influx of posts that don't fit?\n\nlike, some dude posted used condoms as terrifying.",
            "I'll just point out that this post does not meet the requirements it set.",
            "This post doesn't do anything, because the mod team doesn't care or is incapable.\n\n\n\nOver on RealOddlyTerrifying, you won't experience the same thing. \n\nAnd we won't delete your post just because someone thinks it's fake, if it's oddly terrifying.\n\nhttps://www.reddit.com/r/RealOddlyTerrifying/s/JV4QRiZBgQ",
            "Take note people.",
            "quality post been thinking this the last couple of days",
            "The fact that you needed to make this chart, because people don't understand what is \"oddly terrifying\" is... actually oddly terrifying.",
            "Are there mods in here ? Could they just pull out their eyes from their ass and start applying this shit ?",
            "Wait you mean this blood covered serial killer with a machete gun isn't *oddly* terrifying???\n\n/s",
            "Some people keep saying terror is subjective, but the oddlyterrifying sub should actually be one of the more unifying ones where we actually can all agree what is oddly terrifying. It’s pretty obvious what is truly terrifying, and what the spirit of this sub is supposed to be if done right. For example: creepy dolls, random situations, and supposedly fun things that resemble something dark are oddly terrifying to me. Dead/mutated animals, people jumping or hanging off buildings, and gigantic spiders are not because they are straight up terrifying, or just sad, which is the worst.",
            "Needed to be said since day 1.",
            "Thanks! I agree",
            "Please make it fixed",
            "According to this post this post is not oddly terrifying",
            "I needed this, this sub has been broken for so long",
            "Please pin this",
            "You know it's actually oddly terrifying? How many times people actually break these rules, this chart show exactly what to do yet people and still finna fuck it up . ... And THAT scares me.",
            "Wow this is oddly terrifying",
            "I fear no man, but this thing… it scares me.",
            "I feel the same way about oddlysatisfying, too. A lot of things are just plain ole satisfying. Oddlysatisfying should be, \"That's satisfying, but it feels strange that it is.\"",
            "This is oddly terrifying that we need to be reminded what it means",
            "This is not odd nor terrifying. Sub has gone to complete shit.",
            "Needs to be pinned at the top of the sub.",
            "Based",
            "If you understand why it is terrifying, it's not oddly terrifying. If you don't understand why it's terrifying, it's oddly terrifying",
            "If i post a massive fire going on, should it be here or on r/TerrifyingAsFuck?",
            "This isn't terrifying.",
            "Does this community have no moderators?",
            "Ok but \"is it supposed to be terrifying\" is kinda subjective.  \nOr we need an australian special oddlyterrifying sub.",
            "Actually oddly terrifying is a feeling and therefore highly subjective / different from person to person.",
            "The post is excellent, love the effort to do the flow diagram.  The reason that so many posts perhaps don't fall neatly into the category of \"Oddly Terrifying\" is that the determination is SUBJECTIVE.  What I find oddly terrifying may not be the same for someone else.  Here's a bad analogy: I may like a film that you hate, because it is subjective.  Here's another bad analogy: I like Olympics races, they are not subjective but I don't care as much for the judged events because they are subjective.  But I do APPRECIATE your post.  VERY WELL PUT!",
            "😱 This post had me on the edge of my seat! It's definitely one of the most oddly terrifying things I've seen in a while.",
            "👽 This post is both intriguing and unsettling. It definitely gives me an oddly terrifying feeling.",
            "👀😨 This post gave me chills. It's definitely odd and terrifying at the same time. 😱😬",
            "😱👽 This post gave me chills! It's so creepy and fascinating at the same time. Great find! 😨👍",
            "👀😱 This post had me feeling some type of way...it's both fascinating and terrifying at the same time. 勞👻",
            "👀😱 Wow, this post gave me chills! It's like a mixture of odd and terrifying all rolled into one. Definitely had me on the edge of my seat. 😨",
            "👀😱 This post definitely gave me the chills! It's a perfect mix of creepy and intriguing. Well done, OP! 👏",
            "👀😳 This post gave me chills! The combination of odd and terrifying really hit the mark. 😨👻",
            "👀😱 This post definitely gave me a strange mixture of curiosity and fear! It's odd, yet terrifying at the same time. Well done 👏",
            "Just block the karma farming users. If everyone does it they might as well be banned.\n\nI've been thinking about making a subreddit that tracks and lists karma farmers so that people can just block them all enmasse.\n\nEdit: So I went ahead and made one, but I'm busy at work today, so let me know if you're interested in helping out or have any ideas. /r/SayNoToKarmaFarmers/",
            "[deleted]",
            "[removed]",
            "[deleted]",
            "Why do people farm karma?\nLike what do you do with so much karma?",
            "Karmers",
            "I think the only solution is a temp ban for posting obviously terrifying things, instead of a post removal",
            "I’m actually fine with karma farmers so as long as their content is good. However, as seen in the 4.4K upvotes on your comment, karma farmers, at least on r/oddlyterrifying are posting very low quality content.",
            "And blackmagicfuckery",
            "And half of the posts in r/mildlyinteresting are less interesting than posts in r/notinteresting.",
            "[someone doing something mildly interesting]\n\n#NEXTFUCKINGLEVEL",
            "Na, he needs to go to r/Mildlyinfuriating and tell them that most posts are not mildly and are actually fucking atrocious",
            "Also mildlyinfuriating",
            "Please GOD do /r/unexpected",
            "nextfuckinglevel has become so bad recently",
            "Need to add has it been posted a billion times already?",
            "Instructions unclear :  stuck is foreva loop",
            "r/interestingasfuck \n\nIs it interesting?\n\nIs it really though?\n\nr/nextfuckinglevel\n\nIs it a person or a thing doing something cool?\n\nIs it impressive?",
            "i mean, 'interesting' is entirely subjective, so that sub is always going to have issues",
            "Murderedbywords, too. The place has become \"milddisagreement\".",
            "don'thelpjustfilm is the worst in my opinion",
            "Those are waaay beyond fixing.",
            "And mildlyinfuriating. Most of the stuff on there should be in extremelyinfuriating",
            "Add damnthatsinteresting and unexpected to that.",
            "Nextfuckinglevel is a lot better than oddly terrifying at least. Much more actually impressive things there than scary things here",
            "The amount of subs that need posts like this is getting sad",
            "And mildlyinteresting, and mildlyinfuriating",
            "wtf needs your help as well.",
            "And unpopular opinions",
            "Is it a repost >>yes>> is OP a karma farming bot >>yes>> it belongs\n\nIs it OC >>yes>> is OP a human >>yes>> does not belong",
            "Omg this was my next thought!",
            "Omg so much not interesting things on interestingasfuck",
            "interestingasfuck is mostly just gore at this point.",
            "Please add perfectfit to that list.",
            "Turns out the real terror was the number of bots and farming accounts we made along the way.",
            "/r/nextfuckinglevel is the WORST. Oh, someone was upset about something and spoke about it at a town hall? NEXT FUCKING LEVEL MAN!!! A politician believes women should have rights? NEXT FUCKING LEVELLLL! Person does thing that they were literally supposed to do,\n\nNEXT\n\nFUCKING \n\nLEVEL!",
            "nextfuckinglevel would be a perpetual tree where the questions are \"is it really next level?\" \"is it really really next level?\" \"is it really really really next level?\" with any no along the way indicating it's not \"next fucking level\" and probably same with interestingasfuck.",
            "Is nobody going to mention /r/funny?",
            "/r/suspiciouslyspecific needs this as well.",
            "Add mildlyinfuriating as well",
            "And r/ cats 😔 everyone and their aunty asking about what “breed” their cat is in practically every post",
            "There's nothing that can be done. Once a sub hits the front page it's fucked",
            "Don't they all have the same mod?",
            "Is it Interesting? \n\nYes    No\n\nCan you fucking believe it?\n\nYes      No",
            "And r/surrealmemes and r/weird",
            "r/nextfuckinglevel\n\n>Is it just some dude doing a good deed?\n\nYes\n\n>Go ahead and post it here.",
            "Also wholesome memes and mademesmile",
            "And natureisfuckinglit",
            "And suspiciouslyspecific. That sub has become \"FunnyAndAlsoDetailed\"",
            "And no stupid questions. It's just become dae",
            "Or technology \n\nThat place is more like political news than technology",
            "I leave that subreddit for a while, instead of seeing things like the boy who hovered with a light at night I saw things like guys doing good deeds which isn't bad but it's not something to the next level",
            "And oddlysatisfying",
            "What’s funny is on popular this post was directly above an r/nextfuckinglevel post that was legitimately next fucking level… for once\n\nEdit: https://reddit.com/r/nextfuckinglevel/comments/wrgf2l/smart_dog_helps_his_human_move_tires_and_figures/",
            "r/mildlyinfuriating, too. Everything trending there is usually extremely infuriating or infuriating as fuck.",
            "Ok, done.  But everyone can help us out a bit by downvoting shitty content that gets posted here.  Mods aren't gods, we're just people who spend our free time sweeping up an internet forum for some reason instead of doing something more productive with our time.",
            "Why would mods pin your message? Say something important and they might. The sun don’t revolve around you.",
            "thats how i got to /r/submechanophobia",
            "Just like the Uncanny Valley.",
            "I actually find this graphic oddly terrifying...\n\nIt's supposed to be helpful but all it's made me feel is that I have a 2/3 chance of posting the wrong content.",
            "Thats what ALL the content should be, even the bad ones.",
            "Some mf posted a picture of freaking vegetables in jars here. \n\nr/oddlyterrifying users when they see a fucking vegetable: 😨😨😨",
            "But was it supposed to?",
            "Ya, here's my issue... does the flowchart make sense?  Yes.  Is it needed?  Yes.  Is it oddly terrifying?  No.  Does that mean it should be removed?!?",
            "Or the 10,000 skinwalker posts",
            "I was out for a walk today and tripped over this decaying corpse, how oddly terrifying!",
            "like a literal facehugger…",
            "Especially considering the current one *is* meant to be creepy… >_>",
            "OMFG somebody needs to take this format over to r/OddlySatisfying ASAP",
            "[removed]",
            "Please? Because there is nothing remotely terrifying about a salamander walking down a river or a drawing of an ape.",
            "The truth is terrifying",
            "People think the sub’s name means something like “unusually terrifying” when it’s supposed to mean “terrifying in an unexpected way”",
            "No, it would be *oddly* terrifying. There is just something terrifying about a lion biting your arm off, *but I really cannot explain what it is*. Hence the “oddly”.",
            "Yeah I can’t say I was expecting that to happen",
            "I think what we need is *any* moderation.",
            "Yeah it is. But posting a creepy mask or a dead animal isn’t oddly terrifying. It is just terrifying or gross but there’s another sub for actually terrifying things",
            "Odd",
            "Damn, and I thought I was so clever when I wrote basically the same quip two seconds ago 🥲",
            "THIS!!! SAY IT LOUDER FOR THE PEOPLE IN THE BACK!!!",
            "Not even oddly terrifying.",
            "If someone has over 500,000 karma, I instantly block. Makes reddit more enjoyable.",
            "Hmu if you do make this subreddit.  I'd appreciate it.",
            "Not exactly the same focus but check out r/TheseFuckingAccounts too",
            "I never understood one thing . What is the exact reason for karma farming? Like you cannot get anything out of it  right? Except virtual dickpoints?",
            "I noticed, these days that I am scouring for leaks here, that there are many double posts and the likes, are these Karma farmers as well? And what does Karma do exactly? I still don't get why it seems people are so interested in it, I did notice some subreddits have comments deleted \"due to too low karma\", but I can't imagine people farm Karma just to post somewhere, or is it?\n\nThank you for making that though, I will check it out to learn more!",
            "No, there is no way to \"ban\" karma farmers, nor \"downvote bots\". People who \"swim with the stream\" are not exactly bright people, and they will always be the majority. That's why they \"swim with the stream\", because they aren't bright, and want to earn some applause from their \"heroes\". \n\nIt's a system in which reason is \"murdered\", and the mob shouting [\"We want Barabbas\"](https://biblehub.com/matthew/27-17.htm) are the absolute winners.   That's why it seems that anti-war activists are dead silent. In fact, they aren't, they are merely expelled from social media and MSM.",
            "Yep. This is the fate of all subs when they grow large. Always has been, always will be. Unless the sub is a very special case, they all become low-effort karma farms once a certain subscribe count is reached.  \n  \n/r/oddlyterrifying won't be exempt.",
            "My theory is, due to the way reddit is most commonly viewed (with content from lots of different subreddits in the same list, as opposed to just browsing one subreddit at a time), people don't often check/notice the subreddit name - they just read the title and click the link. If they see something they like, they upvote and move on without ever considering that the post they're upvoting might not fit the subreddit to which it was submitted. This could contribute to ill-fitting content getting upvoted to the top of the subreddit.",
            "Just had my first encounter with a shit mod this week and it ruined my view of the job as a whole.",
            "Why is karma farming a thing when it’s fake internet points. Are the accounts sold to sneak past bot moderation?",
            "Too be fair you have to imagine how much work it would be to try and fully stop karma farming. I doubt that even if the admins decided to do more it would be enough",
            "That's the sad part.\n\nAdmins could so easily add anty repost bots. And imagen bots that downvotes post if they are karma farming....",
            "If you block like the top 10 post karma users on reddit, the experience is much more user friendly. It's insane how a few people can spam the site as much as they do.",
            "Stop it stop it stop it this is literally a comment bot?!\n\nARE YOU KIDDING?\n\nEDIT: for clarity, it was a comment bot that responds to comments about comment bots. That was dark lol.",
            "Well /r/anime_titties is disappointing",
            "Some people will eventually sell their accounts. From my understanding, one reason is that old and high-karma profiles are seen as trustworthy and therefore private parties interested in selling things will use said profile to market things. \n\nI can still remember the conspiracy that claimed anyone recommending a bidet on reddit. was actually a plant by bidet makers. \n\nIt isn’t that bidets are seen as bad, or something. It was just that literally anytime something even remotely concerning using the bathroom or being clean several users will mention owning and enjoying a bidet. These posts would literally read like reviews. \n\nCommenter 1: “Uh oh, bad idea to visit Taco Bell before a date!” \n\nCommenter 2 replies: “I wouldn’t be concerned, because I own a bidet. Honestly, it has literally changed my life. I seriously feel so clean, and using public restrooms makes me feel so dirty in comparison. Its like a mini shower. Its perfect.”",
            "Is it black?\n\n      ^",
            "And r/imsorryjon\n\nHalf the posts are AI garbage. I don't mind good AI generated posts, but people post vague orange blobs and go ooooohhh scarrryy garfield",
            "That sub just turn into absolute garbage that can only entertain a 12 year old kid that lives in a cave on the Himalayas.",
            "[removed]",
            "And coolguides",
            "This one is simple. Its when your girlfriend/wife gives birth to a black baby, and you are not black. Black magic fuckery.",
            "...and all the NSFW's too please.",
            "thats sometimes just science channel",
            "r/notinteresting is basically r/antimeme and r/antimeme is usually more like r/comedynecrophilia but with a different meta.",
            "Add r/HolUp and r/tifu to the list",
            "r/trees needs fixing as well, it's out of control",
            "What? Is the hair on my big toe moving when you blow on it not interesting?",
            "*Guy does something nice for someone that they don’t get any compensation or credit for*\n\nNextfuckinglevel BeAmazed HumansBeingBros MildyInteresting MadeMeSmile Interestingasfuck \n\nLike god damn even Facebook isn’t as spam filled with this garbage!",
            "I remember back when r/nextfuckinglevel had just been made and had maybe 5 posts. I was initially amused to see some guy, likely the creator, promoting it in some comment threads. This shortly turned to annoyance, as he was in *every* thread on the front page that was even the slightest bit interesting, saying \"Haha, wow, now that's what I call r/nextfuckinglevel\".\n\nI thought there was no possible way such an unspecific, spammy approach could make the subreddit succeed, if his chosen niche was just \"Anything cool\". And yet somehow it did and I slowly watched the subreddit appearing on the front page more and more.\n\nI'm not surprised people feel like this about the subreddit, it was like it from the start, it's never been anything other than a meta-aggregator for basically anything.",
            "It's always just some amateur lol. Should be a sub celebrating people who are incredibly skilled and on another level to their peers. People who post there think any video of someone doing something they can't do themselves is nextfuckinglevel lol ...",
            "Also, when someone does post something that’s actually mildly interesting in the mildly interesting sub, people always say “this extremely interesting!”",
            "Something truly enraging: top post on r/mildlyinfuriating.",
            "Or something really depressing like \"American child with cancer gets to have the chemotherapy her parents couldn't afford after all her classmates spent weeks raising money doing child labor\"\n\n*MadeMeSmile*",
            "When teens post about their parents on that sub 👀",
            "Normal post on r/mildlyinfuriating: a drunk driver ran into my car and it totaled it and knocked out my AC unit and it's 115 outside.\n\nThough, to be fair to that sub, the custom layout is chef's kiss for sub topic.",
            "Found a toe in my soup.",
            "Agreed",
            "Lmaoo It should be simple since it’s only two options: Did you expect this, Yes or No 🤣🤣🤣",
            "Always has been 🌎  👨‍🚀 🔫 👩‍🚀",
            "Recently?",
            "Yes it really has",
            "Not as worried, if it is genuinely heeby-jeebies worthy seeing it once a week will still make you have a little eep feeling.",
            "Yep",
            "Pretty much all the subs I like have gone downhill for the same shit",
            "Nextfuckinglevel has an absurd amount of just like, humansbeingbros kind of material. I feel it should be more like, difficult feats to achieve",
            "I agree that it's on average an okay sub but I still see a lot of posts like \"Man is good  father\" and it's like... yeah that's the fucking point. I'm glad but that's what you're supposed to do. \n\nNow when a random dude climbs 3 stories up the side of a building that's on fire to save 2 children then that's next fucking level.",
            "I think I've only seen an actually unpopular opinion there once. If your post succeeds, you failed.",
            "Probably",
            "My man roasted himself",
            "> by downvoting shitty content that gets posted here\n\nAnd **reporting** posts that don't belong. I'm more likely to see something that's reported than something that's not.",
            "The problem is that once a subreddit has gotten big enough, the core community that cares about subreddits maintaining their integrity when it comes to the topic it covers gets drowned out by the \"normies\" (I don't like that term, but it does explain the difference) who just see funny post and upvote without a second thought if it's even truly relevant to the sub's topic.\n\nThis gets exacerbated when a post hits the frontpage of the subreddit, and even more when it reaches the frontpage of r/all or r/popular. At that point the genie is already out of the bottle and it becomes impossible to downvote the post even when it's not properly relevant to the niche topic of the subreddit.\n\nI pretty much always downvote posts that aren't true to the spirit of the subreddit's topic, even when they hit the frontpage. I also report the posts for not sticking to the topic of the subreddit. But I'd be lying if it doesn't feel like it doesn't do anything at times and like a waste of effort.\n\nUnfortunately reddit mods have an impossible task here. Either you help out and remove these kind of posts and risk having a horde of \"normies\" screech at you, slinging shit at you, and calling you nazis for daring to keep a subreddit's niche in tact. Or you slowly let the subreddit deteriorate and let its subject get watered down more and more to the point where it becomes nearly unrecognizable to what it used to be. You'll still have a popular subreddit most likely. Just one that lost its niche to the people who really enjoyed the subreddit for what it was in the past.\n\nDefinitely don't envy your position here!",
            "> Mods aren't gods\n\nThere are several subreddits where that sort of talk will get you banned with prejudice.",
            "Ouch, loud and clear.",
            ">\"Mods aren't gods\"\n\nI don't think this guy's really a mod",
            "You *are* doing god's work tho! Keep it up",
            "This is the one time mods get hate I don't agree with. THE PEOPLE are the ones upvoting the stupid shit. And if a mod deletes it everyone calls them a nazi. If they allow it people get butthurt and post this shit.\n\nPinning was good,  maybe it will work",
            "You're hillarious hahahahaha this made my day. We thank you for your services and time wasted",
            "Never understood why posts with thousands of karma that don't meet the goals of the sub don't get removed.",
            "> Mods aren't gods\n\nSounds like a slogan for a t-shirt, maybe?",
            "We salute you… the ones who don’t have lives. Don’t kill me… it had to be said. Thank you for all that you do!!!",
            "Respect.",
            "But he’s right tho, whoever the half brained idiots that upvote the most obvious terrifying content are the ones who are pushing the content to the front page. Y’all need to ask yourselves why tf this shit content keeps thriving. It’s not the mods promoting it",
            "*cracks neck* Gladly.",
            "This is why we love you though",
            "You moderate 400 subs, you know full well this reasoning is bullshit. Once a sub reaches a treshold, anything remotely funny gets upvoted even if it's against the sub rules.",
            "I am witnessing the first self aware mod I love you",
            "r/KamikazeByWords",
            "U dont get paid?",
            "Why don't you step down if you don't have enough time to effectively do the job you have volunteered for? Perhaps get more mods. There's options here.",
            "Lol \"Mods aren't gods\" is great also love that gods not capitalized :)",
            "\"Mods aren't gods\" says the guy who moderates 415 subs. Yeah, tell us more about your sad story.",
            "Haha you won't get me this time that link stays blue",
            "r/thalassophobia",
            "Hahaaaa... fuck all that.",
            "Love that sub",
            "Wow, 500k subscribers gor such a niche (guess not?) subreddit.",
            "Oh no",
            "If you aren't sure, dont post I guess. Every time I post on here its when I see something and think \"Why the fuck is that so unnerving?\"\n\nI'd say if there are teeth, or skeletons, or spikes, or spiders, anything related to death or violence, evil, then its probably just creepy. If its like, a cat walking backwards in an odd way that seems disturbing or unnerving, then post it. Usually there is some juxtaposition but not always. There are some great examples in this subs top post but also some bad ones. \n\nMods should have some guidelines and enforce them, that would make everyone understand what is acceptable/appropriate.",
            "Only in the manner in which this very specific flowchart decided it should be.",
            "This looks like a karma bot account",
            "You can't explain what it is? Anything that'll kill you would be terrifying because .. well.. you'll die?",
            "true. it sucks, i feel like the sub could be just so much more interesting than it is :/",
            "Id argue that some people wouldn't find that terrifying.",
            "you'll love my karma count then lmao",
            "You're absolutely right on that one. Nothing to learn from people shouting \"Amen!\" to every nonsense.",
            "*celebrities exists*",
            "i personally delete my accounts at 10k. its kind of embarrassing to have that much karma.",
            "!RemindMe 7 days",
            "If you have \"bad karmas\" you're blocked from most posts and groups. Therefore, if you want to say tome truths then and when, you have to farm karmas, because truth isn't loved by most people, and you will lose your \"good karmas\" in a heartbeat.\n\nSimpletons don't like it, when truth is told.",
            "There are subreddits that require decently high karma to post. \n\nBut that is not why a majority of karma farmers, farm. \n\nReally could be anything from -- wanting to sell high karma reddit accounts to getting a quick boner from seeing all those upvotes 🤷‍♂️",
            "r/distressingmemes is going the same way too. Half of the content is plain trash or just rehashed concepts/gifs.",
            "Because the same set of power mods take them over. They’re put in place by Reddit admins when subs grow too large for a regular mod team, with lives and responsibilities, to manage. These subs all become clones of one another, looked after by people with absolutely nothing to do with their lives.",
            "Oddly enough, what you've said (and how true it is) IS oddly terrifying",
            "I just rarely upvote posts anymore. They're often bots too, so I reserve my likes for comments.",
            "I think the same. It's impossible for most things to reach as many up votes as they do if people aren't mindlessly up voting them",
            "Who are the top 10 people?",
            "Nothing is real, and all of Reddit is just you and a bunch of bots. Sorry, man.",
            "Wait, are you sure?  The 10 month old account with default username and activity starting today does fit the pattern, but I can't see any copying or other evidence.",
            "The magic part is.",
            "And r/mildlyinfuriating",
            "Black can be viewed as a color and as a pigment. As a color, or part of light, black is the absence of light. As a pigment, all colors mixed together create black.\n\nBlack is also a term that can describe African or African American racial heritage.",
            "I'm pretty sure that sub peaked with this post:\n https://www.reddit.com/r/imsorryjon/comments/gqxe91/the_forgiveness_of_jon/\n\nAs far as I'm concerned it's a retired sub lol.",
            "And r/HolUp\n\nNM that place is not even on the train track",
            "Amen. I used to love what got posted there, as soon as it gained popularity it went to shit.\n\nEdit...and like it was queued up...the same superchilled water turning to ice post is on the front page.",
            "The people complain that every post isn't actual black magic (and never submit any posts themselves) are the worst part of that sub.",
            "ironically, this is a karma farming bot. The comment is copied from elsewhere in the thread.",
            "Plot twist: Your girlfriend is black.",
            "Those belong there more than magicians doing magic tricks.",
            "Have you tried LightningTendr?",
            "Not interesting has lost its way where now there's more circlejerk than actually quality not interesting content. I stay because of the occasional good post, but it's close to lost.",
            "God I hate r/HolUp. Just the most blatant karma whoring, unsurprising gifs/memes.",
            "> Like god damn even Facebook isn’t as spam filled with this garbage!\n\nDid you say Facebook? Have I mentioned yet that Zuck looks like an Android? Did you know that teens are leaving FB in droves? Has anyone told you in the last five minutes that they left FB seven years ago and since then they've lost 50 pounds, married a supermodel, and started their own gym, and have never been happier?\n\nNo!\n\nThen let me post to r/technology about it!",
            "right after this post i scroll down and it’s a r/NextFuckingLevel post of a dog carrying some tires LMAOOO",
            "But this dude actually watched a 10 minute YouTube video to learn a reduced version of the theme from Interstellar, and played it on their keyboard for a few friends. Absolutely insane, next fucking level stuff right there.",
            "FB just has better cross-spam flow. You hardly notice that a post was spanmed on 50,000 pages, because it consolidates them into one to show you.\n\nReddit, well....",
            "Nevermind",
            "when was that sub created?",
            "I remember that shit, too and am surprised that Redditors didn't rage them into the dirt for \"self promotion.\" Or that very few people seemed to notice at all.",
            "I think we’ve had the same experience with that subreddit. I’ve hated it since I saw someone (I assumed the creator or a spambot) promote it on every single sub. The term “Nextfuckinglevel” is also not specific at all, I was sure it would fail. Oh well.",
            "The referee who essentially does a pull up to dislodge a basketball.\n\n“Oh my god, so crazy!”\n\n“It’s just a pull up…”\n\n“Well most people can’t do a pull up!”\n\nIt’s not next level if it takes a few weeks of training to do.",
            "Well said. The content should really be something exceptional. Something that only maybe a handful of people in the world can do. You know, like some savant knowing 50 languages, a golfer doing 18 hole-in-ones in a row etc.",
            "My dad put a passcode on the thermostat 😡😡",
            "Some dude at my work keeps sending bomb threats to me via email. It is so annoying!!!",
            "Custom layouts are one of the main reasons I stick with old.reddit on desktop site. And you’re right about theirs. That hair gets me every time.",
            "Was hunted down and battered to death by a horde of raging Karens, fml.",
            "Yeah you would think... I just don't think people understand the concept of something being truly unexpected. Literally the top post right now is a guy stopping a couple in the mall and asking them if they trust each other, they say yes, then asks them to switch their phones, and lo and behold THE GIRL IS TALKING TO OTHER GUYS! like...that's NOT the extent of \"unexpected\" that the sub was originally intended. \n\nIf you can stop the video half way thru and guess what happens at the end then it isn't unexpected. A truly unexpected post would be the same set up- guy stops a couple and asks if they trust each other, blah blah blah, and then a thief runs out of the store behind them with a shit load of jewelry being chased by the owner of the store.",
            "Same here.",
            "also lots of videos of people doing something for the first time, like a kickflip or something. that's not NFL, that's.... learning a skill",
            "At least he's self-aware, which is more than what some mods of other frontpage subs can say.",
            "self-aware mods are oddly terrifying",
            "How should that be reported though? Mod discretion? I wish there were a report for just \"It's not oddly terrifying\"",
            "It’s almost like most people could care less about subreddits and only use Reddit as the content aggregator that it has always been. Basically, nobody really cares about it other than some weirdos who take things on the internet way to seriously.",
            "[deleted]",
            "Not gods? I’ve been misinformed…",
            "Maybe only a demi-mod",
            "No he's not, he's doing reddit's job for free.",
            "God is a janitor?",
            "The people upvoting irrelevant posts aren't ever going to see a pinned post.",
            "[deleted]",
            "It’s just mostly drowned machinery",
            "Its just submerged ships",
            "love this one too...or hate it idk haha",
            "The state of this sub is both odd and terrifying, maybe the real content was the AI karma farms we made along the way",
            "I was just being sarcastic, come on :D",
            "Yeah but it is still not oddly terrifying",
            "How the hell do you only have one karma?! You literally have upvotes on this comment, doesn't that count towards karma?",
            "This comment is endorsed by Reddit™",
            "I asked somewhere else as well about this question, and some people told me that there are some that also sell high-karma accounts and the likes, there are a lot of other reasons too that I found (like addiction to receiving an imaginary positive feedback), but I didn't know/think of this reasoning.\n\nI did notice a lot of \"problematic\" truths being removed or downvoted by a mass of people, more than once, incredibly sad. I had a friend that knew of just about everything, if not to an expert level, he knew enough of it to hold a conversation. He spoke with a cadence and intellect I have no words to describe. He died many years ago, I have not found anyone such as him again. Something I dearly miss, that I did not appreciate enough, perhaps, when I was younger, is when we disagreed, as it opened incredibly interesting topics and discussions. I hate it that I have seldom seen anyone, if ever, have anything like that, it is always vicious, oblivious, \"I say my piece just to tell my slogan, don't care what you say, I won't listen to it, I will make up what you said based on the words that my brain picks up as offensive/recognizes, no matter the context\" or \"I will silence you and keep talking/talk over you\", this is how children quarrel. People I have around these days are also of this type, so I guess it is not only restricted to the Internet, but it breaks my heart to know that \\*that\\* is almost \"normal\" these days, horrible. I am glad some people do what you described if it means being able to speak, like preparing a parachute when one takes the jump, that is one good use of this karma thing for sure, thank you for letting me know!",
            "I had a conversation with another guy about this just some time ago, they also SELL accounts!? Goddamn, thank you for the information! Is Karma, also, the red number I see beneath the username on my right, top right for me, beneath the account nam- oh my God I just checked and it says right there that is Karma XD  Well then! So, I wanted to ask, so aside from posting and things it's useless, correct? Or is there more use to it I am unaware of? Can you give Karma to others? (my Karma, I mean, I don't care for this stuff, so it could be of use to someone else seeing as there seems to be quite the big thing the more I know of how this works)",
            "I thought it was just me getting more used to it.",
            "Why tho\n\nI mean how utterly sad would you have to be to be one of these power mods I genuinely can't comprehend it",
            "As a mod of r/oddlyspecific i can tell you this is NOT how it works. Moderating is a large job and community driven.",
            "Yup",
            "Comments aren't bot-free either, though.\n\nSincerely,\nA Fellow Human",
            "[removed]",
            "What about the fuck part?",
            "big brain time",
            "Maybe we should stop naming subs after subjective feelings.",
            "Came here to say this. Everything that ends up on popular from r/mildlyinfuriating is actually infuriating. Mildly infuriating means you got cut off on the way to work or you opened up a bag of snacks and there was only one item inside.\n\n**NOT YOUR BATHROOM DROP CEILING ROTTING OUT AND YOUR LANDLORD DOING NOTHING ABOUT IT.**\n\nThat's actually infuriating. And dangerous.",
            "And r/unpopularopinion",
            "Those two words don't go together anyway.  If it's infuriating it can't be mild.",
            "No?\n\n   \\\n\nNot blackmagicfuckery",
            "In the term \"black magic\" it doesn't refer to any of those things.",
            "Good bot.",
            "Goddamn, thank you for sharing this",
            "u/rojom basically carried the sub for a long time with his series. My favorite being the teletubby series.",
            "true",
            "Electrified chicken tenders?",
            "Man nobody hates technology more than people in /r/technology \n\nEverything that comes up from that sub in r/all is basically \"tech is bad, here is how\".",
            "Not surprising at all lol",
            "About four years ago.\n\nIt stuck with me because part of what I most enjoy about Reddit, if only for novelty, is the way content is usually divided into hilariously niche communities, and therefore I love when a sub has a unique place and purpose that resonates with people. On the first day of that sub I already disliked the direction it was headed by trying to siphon from everything so lamely, so I always wanted to see it fail.\n\nThe creator himself is gone now, got himself suspended.\n\nYour empire yet stands, u/Gaenya, but I'll always remember you in rags.",
            "It’s next level when the person in the video has spent years of their life training, dedicating everything to their craft so much so as their demonstration appears preternatural \n\nBut yeah it’s not r/nextfuckinglevel to pop a kick flip. Or to do a bottle flip.",
            "My manager said we can't have our friends hang out behind the counter while we're working 😡😡",
            "Lmao",
            "If that’s “next fucking level”, I wonder what the previous fucking levels looked like",
            "And when you say it you get downvoted for being rude",
            "\"frontpage subs\" is exactly the kind of addition a mod roast needs. It's the 90-10 rule; most people forget that A LOT of subs are very small and those powerhungry \"put 'Reddit mod' on my résumé, moderator is a job\" weirdoes are mainly found at the huge subs.",
            "I mod one and know that I must always either show up self-deprecating or wrong.",
            "No this guy is known for being a twat across Reddit, the number of times I’ve seen posts concerning him on r/SubredditDrama…",
            "Rule 8 is typically what I use for that sort of removal.",
            "Then why the fuck even **have** ***sub***reddits?",
            "When people crosspot the same things to 7 subs and the 7 ends up on the frontpage because mods enforce 0 rule, it's not a problem of the weirdos but a problem of poor sub curation.",
            ">as the content aggregator that it has always been\n\nIt's a content aggregator with sub communities. If a community doesn't enforce its own rules or guidelines, then only the most general, popular content will be upvoted.  Imagine going into /r/aww and seeing political posts or /r/EarthPorn and seeing actual porn.  \n\nContrary to popular belief, when a moderator removes a rule breaking post, they are not 'nazis', they are serving the reddit community as a whole.",
            "Reddit isn't just a general content aggregator, though. Never has been. You can browse r/all and skip the subreddits if you want, but to say that *nobody* cares about subreddit curation is complete bullshit. Subreddits are what makes Reddit awesome. You're missing out.",
            "Maybe it's just you.\n\nYou definitely missed out and will miss out on many things that make up a community with a specific purpose that unite them.",
            "Could not care less*",
            "> gets ignored by mods\n\nThat last bit is the real kicker.",
            "What can I say except 'you're welcome'",
            "Could you imagine if reddit paid all the mods a full wage?  The site would be bankrupt in a day.",
            "Curating a user-created sub isn't reddit's job",
            "that's what they all say",
            "In murky waters",
            "Was hoping you were but didn't catch it from the text",
            "Even now. That’s… huh.",
            "Jan '24 and they still only have 1 karma. Curious if anyone knows the answer",
            "I'm new to reddit, and was wondering how Karma farming works, but now I stumbled upon this non Karma farmer with only 1 karma, really Odd experience",
            "yeah wtf is this sorcery????",
            "I barely know what karma even is lol I'm only on reddit sometimes, i don't get why karma is a big deal but oh well",
            "No! Thats the wild thing there is really no further use of Karma but bragging rights\n\nBut still people are willing to pay 100s of dollars for reddit accounts. \n\nIt'd be more understandable if there were other utilities you could use the karma for -- some of which you were asking about\n\nbut there isnt that is the sad part people pay just to look cool 😎",
            "Heres one website people sell accounts on\n\nhttps://signals.sh/services/buy-reddit-accounts/?utm_term=buy%20reddit%20accounts&utm_campaign=Focused+campaigns+%232&utm_source=adwords&utm_medium=ppc&hsa_acc=3461511260&hsa_cam=1618018060&hsa_grp=142909622361&hsa_ad=612287684371&hsa_src=g&hsa_tgt=kwd-302692363608&hsa_kw=buy%20reddit%20accounts&hsa_mt=p&hsa_net=adwords&hsa_ver=3",
            "ITS THE MODS DONT TRUST THIER LIES",
            "Ok but power mods exist and this exact scenario has happened multiple times. \n\nDoes Reddit pay you for this job? Because there are individuals who spend a work week + moderating on this site. I’m not saying that you yourself do, but there are power mods who have wayyyy too much time on their hands.",
            "I would upvote you, but maybe you're lying about the human thing.",
            "*Wow, what an advanced bot!*\n\n>!This is not serious.!<",
            "Mandigo",
            "The fuck part can come in all different kinds of colors and non colors",
            "Best part",
            "Insemination\n\nEjaculation\n\nCu",
            "True I mean a lot of those posts in those subs may be oddly terrifying or mildly infuriating to the poster but not other people.",
            "Only objective feelings from now on",
            "\"God, this is infuriating.\"\n\n\"Really? It bothers you that much?\"\n\n\"No, not really. It's just mildly infuriating.\"\n\nIt's only an expression bro; people don't need full-fledged fury to use the word.",
            "It's unfuriating.",
            "Its not an oxymoron, it means something is just a lesser form of infuriating. \nSounds better than r/SlightlyIrritating",
            "I’ve always argued that “dark magic” should be a thing.",
            "You're very welcome. It's a beautiful and surprisingly touching piece of art that feels like the appropriate final scene of imsorryjon imo. Here's a comment where the artist lists many of his favourite eldritch art pieces: \n\n[https://www.reddit.com/r/imsorryjon/comments/rf06k9/comment/hob0dpu/?utm\\_source=share&utm\\_medium=web2x&context=3](https://www.reddit.com/r/imsorryjon/comments/rf06k9/comment/hob0dpu/?utm_source=share&utm_medium=web2x&context=3)",
            "Right? It's freaking gorgeous.",
            "It belongs in a museum! Damn is it good.",
            "Ok I was about to say… I think I remember seeing those comments that you described lol. Some guy endlessly promoting his subreddit in the same fashion",
            "Tripping on nothing while walking around",
            "If I had to guess: not being able to do a kickflip.",
            "Also many of the troubles a sub runs into like all of the afformentioned ones are *because* that sub frequently hits frontpage and people just upvote the neat thing infront of them. What can a community even do about this? So many subs blur together now and reposters feast on this.",
            "*shudder*",
            "whats a karma farmer 😂",
            "I still don't understand what's there to brag about about Karma, particularly if it's just to open some comment sections and the likes (unless one is REALLY adamant on wanting to comment somewhere for one reason or another), but I recall there being a similar thing somewhere that was about reputation or seals or titles, or something, so I am guessing it is similar to that? Damn though. I don't think Reddit is that new of a site, I am surprised they are letting account selling as a thing exist.\n\nThank you once more for the explanation!",
            "Wow, I am always wondering \"who would buy that!?\" but I am learning more and more that there is ALWAYS someone that would want to buy the strangest things, damn. Thank you for your information once more!\n\n(AH! Before I forget, again, is upvoting what gives Karma or are the seals, or something else? I am guessing the upvote just because it shares the same reddish colour, but do seals do anything also? I give things left and right if I have them, as I saw people being happy to have them, but am unsure what their use is)",
            "SHH NOT TOO LOUD, IM UNDERCOVER",
            "What? What proof do you even have that this exists? Mods dont get paid. Mods have 0 association to reddit employment. Thats the entire reason WHY subs decline as they gain more followers. Moderating is something you choose to do for free. \n\nIts not like we can spend every hour of the day looking at posts for the subreddit for things that might not align (ESPECIALLY when content is more subjective, like in these subreddits). We just get notified sometimes of posts that are reported a ton. The biggest thing that helps is using mod mail if something is really out of place. \n\nEven then, its difficult. There's no winning for us. Its really hard to keep the vision of the subreddit without smothering the fanbase and getting complaints. \n\n\"Oh, you removed my post? But its related to the subreddit, these guys are power mods that just spend all their time removing everything!\"\n\nSo you try to be a little more relaxed with moderating posts. Then it turns into:\n\n\"This sub has gone to shit! None of the posts are really what the sub is for!\"\n\nModerating tools are pretty minimal, we basically purely rely on the community to tell us which things to look into. And a lot of the reported stuff actually ends up being perfectly fine. We're not given much of a heads up on posts that dont fit the subreddit, and the stuff that actually doesnt fit gets diluted and buried by people reporting posts that do fit. And youd have to spend a ton of unpaid time to work on some sort of solution to take care of reposts and karma farming bots (which is an EXTREME amount of time spent coding bots to detect it, only for the bots to resurface around your system).\n\nMost people moderate out of the goodness in their heart. I genuinely dont know where youre coming from with the \"paid power mods\".",
            "Ha. Ha. Ha. I wouldn't lie to a fellow human!\n\nSincerely, \nThat Guy's Dead Wife",
            "Sploosh",
            "it’s comments like this that wish i could ban people from this site myself and say “just fucking do better. christ.”",
            "Maybe moderately frustrating is more what he is looking for, because he isn't wrong, being infuriated is supposed to be an intense emotion.",
            "It is, in virtually any fantasy universe.",
            "Bro doesn't even know Yugi Muto's favorite card",
            "Damn, that comment it's a great collection, Thanks again haha",
            "I see you’ve met my family",
            "Yes very much. Whenever I scroll through the Popular, I so often see stuff that's funny but in completely the wrong sub... I've recently noticed that especially r/HolUp and r/OddlySpecific are becoming frequent transgressors.\n\nRelated: it bugs me when people on r/AskReddit start with \"Women of Reddit\" or \"Men of Reddit\", as if r/AskWomen and r/AskMen aren't subreddits with a very respectable number of members (both around four million), where your question immediately has a higher chance of being seen by the people you're asking. Post a question only for men or women on r/AskReddit and I feel like you're really only doing it for the karma.",
            "There are moderators on Reddit who spend 40+ hours a week doing this work for free. You are not one of them. Congratulations. \n\nNone of your examples are related to my initial statement. It has happened multiple times in my time here. I don’t have time to deal with a mod who got their feelings hurt.",
            "I too am that guy's dead wife",
            "^ /r/blackmagicfuckery",
            "[removed]",
            "Don't get it. Isn't Mandingo the name of a black pornstar? The comment isn't funny but like what's to ban? Not American so if I'm missing some cultural thing please do enlighten me",
            "Not gonna stop him from continuing to argue it",
            "> Yugi Muto's favorite card\n\n( ͡° ͜ʖ ͡°) and sexiest",
            "Think of it like this instead: millions of really stupid stuff gets posted every minute. \n\nThe thing is,  people are out there upvoting these things.  It's hard to control something by blaming OP when someone else is just going to post it anyway, the people will upvote it bc they laugh without thinking",
            "Except ask reddit is 9x bigger than either of those subs.\n\nWith 37 million members assuming a 50/50 split \n\nYour question has the chance of being seen by 18.5 million people of the appropriate audience.\n\nThe scale is much much much higher even if the concentration is lower.",
            "And they assume everyone is heterosexual when they ask those questions.",
            "My comment wasnt because my feelings were hurt, it was to say what *actually* happens behind the scenes. You said reddit admins put mods in place to be \"power mods\", and somehow make clones of other subreddits intentionally or something. Which is why im confused why you drop that and instead of replying you just deflect to my feelings being hurt after all i did was give you a rundown on why thats not true.\n\nI genuinely doubt you even read my post, which you dont have to. Just dont send a reply. \n\nSome people do take modding very seriously and spend a good chunk of their week doing that, but i dont see what that has to do with your other points.\n\nI agree that people probably spend time moderating too much, but what does that have to do with subreddits declining? It just sounds like youre disgruntled at mods in general because some spend too much time managing a community",
            "Can't believe he married and killed again",
            "boutta manipulate the votes on your mother",
            "I'm American and there's nothing you're missing. It was a solid joke",
            "Whoa whoa whoa I wasn't talking about kuriboh 😏",
            "... Can I blame the people who blindly upvote *and* the OP misposting?",
            "Good point, I stand corrected. I guess it's just annoying to me then, when people don't go for the specialised Ask sub.\n\nI was thinking of saturation too though I didn't put it in my previous comment, but I'm guessing that's not enough to offset the imbalance.",
            "Those numbers really don't mean anything once a post reaches the front page. This is regularly hit by subs with even fewer numbers than you have mentioned here. After a certain threshold it really does not matter.",
            "You sound exactly like a reddit mod who got their feelings hurt. What they're saying is true, a lot of the top subreddits and defaults are moderated by the same jumbo reddit accounts who do nothing but use reddit and farm karma. Your experience on the subject means about as much as a pile of sands experience, since you're not one of the said users. But they absolutely do exist, just look at some of the mods of the big subreddits' accounts and you'll easily see they all moderate multiple massive subs. so once again your comments and argument are useless and stupid and easily disproven and most people on reddit already know about powermods anyway so it's kind of odd you haven't heard.",
            "oh shit",
            "nah, it wasn’t",
            "( ͡° ͜ʖ ͡°) a man of taste",
            "I don't know if I corrected you however, it's probably is still better to use those targeted subreddits.\n\nAskReddit used to be a default sub, so it likely skews toward longer time users, it may skew older, it may have more defunct users (people who no longer use the site, lost accounts, throwaways), and it may have more subbed users that never intended to interact with the subreddit in a meaningful way (trolls, lurkers, shit posters), so depending on the nature of your questions, those other subs could very well lead to a better discussion..."
        ]
    },
    "Justin Timberlake’s eyes": {
        "title": "Justin Timberlake’s eyes",
        "score": 7891,
        "url": "https://v.redd.it/r5om2lnoy18d1",
        "content": "",
        "num_comments": 719,
        "comments": [
            "That's a man who wakes up everyday with less than 24 hours on his clock.",
            "That dude seems mainly cocaine there.",
            "“Cocaine is God’s way of saying you’re making too much money”\n\nRobin Williams",
            "Bro, blink.",
            "Cocaines a hell of a drug",
            "The beginning of the downfall. Maybe he’ll snap out of it.",
            "Ok yeah this might effect the tour.",
            "Drugs are a hell of a drug",
            "He doesn't even look like himself that way.",
            "Not how 12 year old me assumed this would turn out",
            "He could have at least thrown on some shades, why the hell did anyone let him walk around publicly this geeked out of his fucking mind lol. This could ruin the tour...",
            "Holy shit he is coked out of his mind.",
            "Dude is in the nether realm and on auto pilot haha",
            "Ozempic and cocaine. \n\nHollywood is gonna start telling us this ghoul look is actually attractive",
            "What did he say Britney was for drinking too much, sloppy?",
            "Rodney Dangerfield eyes but on cocaine",
            "The eyes, chico. They never lie.",
            "That compound V is wild.",
            "My guys had a bag of bash",
            "Someone’s got a mucho problemo",
            "Looks like Bam passed the curse onto JT.",
            "This is gonna ruin the tour",
            "My best friend from school has those eyes… it is like he looks like my friend, but it is not him…. Like he is dead or trapped inside the shell of his body.",
            "Can't unsee this now, so creepy!",
            "He's coked out",
            "This is hilarious to watch without the sound on😂",
            "That lady reacts like JT’s breath stinks",
            "He looks like a demon",
            "you’ve never performed in front of 7,000 people (on cocaine) before have you",
            "Explains the DUI",
            "Looking like 90’s Lindsay Buckingham with those curls, sweaty red face, and coke eyes",
            "So typical.\nRich.\nCan get any possessions you want. \nEnd up doing all the things you wanted to do since you can afford it.\nRealise materialism only makes certain people happy for the moment\nGet bored\nTake drugs. \nLife over",
            "Never thought JT would look like Gary Sinise lol",
            "I know that I can't snort no more\nIt ain't no lie\nI want to see you on the floor\nBaby ‘I’m so high’",
            "Soulless",
            "Bro Justin Timber meth",
            "Imagine being coked up and ready to fucking party but you realise you’ve got to sing teenybopper music to middle aged woman.",
            "Hahahaha",
            "r/tooktoomuch",
            "He's on a good one💪",
            "Looks like his backup female dancer smelled something from him  maybe alcohol??",
            "this subreddit 's avatar irl",
            "His eyes will ruin the tour...",
            "Oh my, how the mighty have fallen",
            "I’ve never liked him and never understood the appeal.",
            "I kills me how his eyes in his mugshot are basically the same color as his skin lol.",
            "Definitely looks cracked out",
            "This is gonna ruin the tour",
            "How he looked after that DWI. \n\nCan't tell me that's not drugs",
            "He looks like if Blake Shelton was less fat.",
            "Straight-up fluid karma, man",
            "They look a bit yellow 😬",
            " Crazy eyes",
            "He high asf",
            "All that coke for what? So he can wander around letting out very mild yeeah’s and hell-yeah’s?",
            "I’m not addicted to cocaine, I just like the way it smells.”",
            "Bro thinks vaccines are bad for you but will happily snort Cocaine. Make it make sense.",
            "this guy is aging very badly",
            "Help I’m out of the loop why do people keep saying “this is gonna affect the tour” “what tour” “the world tour!”\n\nI assume it’s a reference to something.",
            "Is JT on drugs, or are Drugs on JT",
            "Personally I hope he gets better. He has children and a wife. I won’t take joy in his downfall.",
            "[deleted]",
            "Maybe he doesn’t enjoy touring anymore & needs something to get him through these shows.",
            "Possession",
            "Just an FYH but social media also mocked the shit out of Britney back in the day when she was in crisis. Now people recognize she was going through it and are more sympathetic. Hopefully JT survives to get to that point someday. \n\nDon't get me wrong, it's fun to kick someone when they're down. I mean, what better time to kick them, honestly? But he's still a person and definitely going through it. Just something to remember.",
            "Instead of bye bye bye it’s bump bump bump",
            " never just did things just to do them, come on. I menan, what am I gonna do? Just all of a sudden jump up and grind my feet on someone's couch, like it's something to do? Come on, I got a little more sense than that. Yeah, I remember grinding my feet on Eddie's couch.",
            "He’s in his 40s, maybe he’s tired and restless. My eyes look like that when I get little sleep but I have a million things to do and I don’t drink or do drugs.",
            "Lol holy fuck",
            "It's snowing like a mf over there.",
            "Y’all are out here acting like yall have never done an 8ball in the back. \nLeave the man alone",
            "That's sad. I hope he gets help before it's too late.",
            "That booger sugar has him on a macho man randy savage level",
            "I'm not denying what people say about drugs here. But common, you can grab 10 seconds of footage from anyone and depending on the gestures you can look like that. \n\nThere is a viral video from Barcelona's football player Joao Cancelo doing a post match interview where he looks like he was in rave for 3 days straight",
            "He needs his daily dose of adrenochrome",
            "It’s just(in) really sad to watch 😔",
            "There’s no way Hahahahahahahaha this is hilarious",
            "He's a drunk for sure",
            "lookin like Sean Parker",
            "Never noticed how eerie his eyes could be.",
            "shit, who wouldn’t be doing it? bet he’s having a grand ol time.",
            "Did he just free dive a new world record?",
            "bro is cooked through and through lol",
            "Reminds me of Arnold Schwarzenegger’s eyes popping out in Total Recall",
            "Where have I seen that look before? Oh yeah [https://www.youtube.com/watch?v=P9eKIOXDOy8](https://www.youtube.com/watch?v=P9eKIOXDOy8)",
            "Just a question, as I’m not the most experienced user of cocaine. What does he do when he need to reload and he is still on stage?",
            "That boy is zooootin",
            "I think he also has bad botox",
            "He's been tipped coke right in his fucking eyes dude.",
            "I miss when he was trying to be an entrepreneur, he seems washed up now sadly. :(",
            "Is there a better use for cocaine?",
            "JT should perform I want a new drug by Huey Lewis in his concerts regularly.",
            "Redbull got nothing on Coke",
            "Rotschild eyes",
            "There’s a space on Instagram next to Britney for him",
            "This is going to ruin the tour.",
            "Bro had a venti with seven extra shots",
            "The synopsis is missing a conjunction. It should say, When an alligator eats a bunch of drugs AND all hell breaks loose in Florida.",
            "There is absolutely nothing going to ruin this tour now. lol.",
            "I don’t like durgz but the durgz like moi",
            "si this is the tour that will be ruined",
            "\"Crack is wack, Diane...\"",
            "Coke , speaking of which ….",
            "He's shimmed right the fuck up",
            "My man is lit up",
            "Being a functional addict is a curse I’m telling ya.",
            "this subreddit became a shelter for content that is pretty f\\_cking far from terrifying. please stop it.",
            "I mean, I am not at all surprised that artists get hooked on coke.\n\n\nImagine doing a fucking world tour without being a zen master. Being a high energy performer every second day for a year. \n\n\nWe all have off days, but they do coke and then all days without coke become off days. \n\n\nI have tried coke... Three to five times. I have adhd so to me it was... Not as great as for other people but I can see what people get from it. \n\n\nIf I had lots and lots of money I would simply just try to relax for the rest of my life, but I guess that's why I don't have lots and lots of money. ",
            "not funny, obv not well",
            "Awfully low energy show for being on that much coke lol ",
            "Dude is fuuuuuuuucked up .",
            "Hes bringing cocaine back",
            "This is gonna ruin the tour",
            "cocaine is a hell of a drug",
            "I remember seeing him on the dallas cowboys all or nothing and he looked off his tits then",
            "So maybe he has just one martini before every concert.",
            "It's like the herd found another prey to hunt. \n\nWhat's the sudden hate toward this guy we didn't care at all about for like 10y?\n\nAnd he looks normal to me for a guy performing in front of a huge audience. What are you people seeing weird in there?",
            "He’s more coke than man",
            "Justin in his Gollum Era",
            "La coka nostra",
            "The eyes Chico they never lie!",
            "Cocaine is a hell of a drug",
            "EEEEEK",
            "He looks fucked!",
            "So fresh and so sheen!",
            "Cocaine is a hell of a drug! Lol",
            "Slurms MacKenzie is tired, so very tired.",
            "How much Cocaine is too much?",
            "He’s yakked out of his mind",
            "Cocaine is a hell of a drug.",
            "Sir, thats a DUeye",
            "The audience is ancient",
            "Poor Jessica Biel",
            "Got dem Will smith eyes",
            "He's coked out of it hahaha",
            "This is not just alcohol",
            "Celebrity worship is actually stupid.",
            "I wonder if it was Taylor's success with the world eras tour that made every other artist try the same. Lately seems everyone is doing some \"world tour\" and none of them are going well",
            "JT is going through something.",
            "Cocaine is a hell of a drug.",
            "Its sad when even the people dancing around him know hes out of his mind on whatever drugs he took",
            "mans zooted",
            "He's in the zone. Gimme a break. You perform in front of multiple thousand of adoring fans and then look at your eyeballs in a mirror. A rush better than any drug I'm betting.",
            "Justin timbercoke 🤪",
            "As a kite!",
            "Dude needs some downtime.  I hope he gets some soon.",
            "Jimmy Fallon come get your boy.  He stole all your coke, lolz.",
            "Imma see those when I close mine now.",
            "Bugging",
            "Lord of Cocaine",
            "u/that-1-lame-kid\n\n\nIt's gonna be may",
            "Cranked",
            "Autopilot",
            "Cry me a *cocaine* river...",
            "Drugs and Botox.",
            "That fame monster hard to dodge",
            "Those are I’m rolling my dick off eyes",
            "Cocaine is a hellva drug",
            "Colombian Bam Bam!",
            "Bro is on the tenth planet right now",
            "Cocaine is like steroids for drinking booze lol",
            "Hope he gets the help he needs, but I just don’t get how he’s so popular.  Not a fan.",
            "Allergies suck",
            "mans high as fuck and i ain’t talking about weed",
            "There’s some Justin in that powder",
            "Looks like Slurms Mackenzie",
            "I could imagine his blood pressure would be peaking between performing and singing. Not sure whether it would be \"eyeballs popping out of your skull\" level pressure...",
            "Performance-enhancing substances, not necessarily legally available.",
            "Cocaine",
            "Reddit wants to believe so bad that the people they don’t like are miserable. Reality check, he’s selling out shows and you’re still a nobody. Nobody is ever going to hear about the terrible things you’ve done in your life because nobody will ever care about you.",
            "He done took the sunshine in his pocket.",
            "He was on the coke",
            "He's on something",
            "His nose is going to melt the way he’s hitting that booger sugar.",
            "Tell me youre on coke, without telling me youre on coke",
            "Dayum. I hope the best for him.",
            "Fo' shiz! Fo' shiz!",
            "Jim Breuer looking eyes",
            "Tour",
            "Homelander vibes",
            "Everyone at silent disco looks this good",
            "Damn, he is not well. I say this with experience.",
            "Okey cokey",
            ",,,",
            "Wait, I was the last one in the Mickey Mouse club to freak out and get the public’s eye!?",
            "Poor lads just got hay fever",
            "Jax vibes",
            "He's about to cry a river",
            "I like how his homegirl laughed and said that's Timmy",
            "Stay high until you die, or get caught driving while drunk. Then go find HeyZeus (Jesus) like every other slime ball that finally faces consequences. Go rip off another female’s outfit in front of millions of people again. See how that works!",
            "Blink dude",
            "I AM CORNHOLIO!!",
            "Cocain a hellava drug",
            "Forget tomorrow tour",
            "Panda eyes lol",
            "I thought it was the crying filter for a sec.",
            "And you should have seen his pupils...",
            "FREE MY BOY JT 🍆🎁",
            "Bruh thats Tustin Jimberlake what the fuckkkk 💀",
            "Money doesn't buy happiness, but it does buy unlimited booze and drugs.",
            "Man…. Never been less jealous of a celebrity.  Quad me nutrí me destruit",
            "It's early and I'm not quite awake, but it looks like he's inadvertently doin a Jim Breuer impression.",
            "Baking soda... no doubt",
            "Damn brodie can't even do a concert on a dangerous amount of cocaine without y'all hopping on his dick about it. Like I get He hasn't slept 17 days straight, but come on. So what if he looks like an alien discovering porn for the first time? That's the price to show business, baby",
            "Este Especial K, a very powerful derivative of that\n\nThey don't do coke no mo. Can't get high enough. Sad af but true. \n\nAnd they got this pink powder shit. that looks like Coke. I go to these parties and I'm like what the fuck are these people even doing. \n\n Huevo pero no",
            "Just let me rock you, til the break of day",
            "Wait a minute! That is Justin Timberlake? Last time I saw him he was a teenage boy! Man, I am getting old!\n\nThat's what I expected to see. 😅  \nhttps://assets4.capitalxtra.com/2013/13/justin-timberlake-curly-hair-1364982840-view-3.jpg",
            "David Silverman vibes",
            "Those aren’t eyes. They’re dinner plates.",
            "cocaine is a hell of a drug",
            "I'd say a mix of energy drinks, maybe drugs, and alcohol could cause this.",
            "Mroe meth",
            "It happens to the best.  I hope he will pull through.",
            "Wth was that weird walk?",
            "Drugs life",
            "Looks like me when I’m fucked up on coke",
            "Reminds me of the live action scooby doo. He’s been possessed.",
            "Dude looks like he’s finally having fun with life",
            "Justins cocaine era",
            "Fresh from his DUI",
            "my phone kept freezing on his eyes since I'm in the car seeing this , what a trip. this dude is either coked out of his mind or this is him on a good day lol 😂",
            "Seems like normal eyes to me.",
            "Best dressed junkie i have seen in a long time .",
            "Cocaine is a hella of a drug",
            "Drink will do that to you just ask the officer who arrested him for DUI recently",
            "Sloan on YouTube said he was “giving Zuckerberg” lately 😭😭😭😭",
            "Give this man some eye drops",
            "What did that girl smell on him that she flinched so hard?",
            "Im failing to spot any weirdness and that's frustrating",
            "Probably stayed up all night and told himself he could substitute sleep with cocaine 😂",
            "How high are you?\nYes.",
            "He’s a bit stressed don’t ya think? 😅",
            "too many drug",
            "I know people are dogpiling because it’s Reddit and he just got a DUI, but he could just be high on adrenaline here.\n\nSome performers don’t get over it, and if you’ve ever been nervous standing in front of your class presenting your crappy art project before you get it.\n\nJust playing devils advocate.",
            "“Their eyes were watching Coke.”",
            "Tom Dwan winner takes all",
            "This is his “only one martini” face.",
            "What men goto this show???",
            "He’s looked like that for a while now. There was a mugshot or something of him recently and all I could focus on was his eyes.",
            "This bro needs some B Dubs council in his life.",
            "Looks like his mug shot",
            "JT began to fall more and more. Apparently there was a special white powder involved.",
            "One martini.",
            "Reddits feed must be better than mine, the .2 seconds of heavily compressed video doesn't scream cocaine abuse to me. JT and the crowd also seem to be doing something Reddit doesn't like, having fun so that may have made them even more of judgemental sheep than usual.",
            "The cop who pulled him over watching this after will be like \"Ohh you're a singer\"\n\nDouche.",
            "r/tooktoomuch",
            "Cocaine is a hell of a drug.",
            "He’s slowly turning into Brittany spears😂😂 karma for what you did at the super bowl before dvr was out",
            "Wow. I've (sadly) been around coke heads before but still never witnessed such a cocaine stare until just now. Narcotics experts should study this.",
            "This is so funny",
            "what does this meaannn???  XD PLEASE",
            "And he says something like \"Times like these make me realize the clock is always running \"",
            "His blood type is cocaine positive",
            "As an ex cocaine addict, 100%.",
            "Half mane half cocaine",
            "I'm 41, he's older than me. I could not do what he does without some serious pharmaceutical assistance.",
            "Serious question. Does he really take cocaine ? Or his behavior gives it ?",
            "No way, he'd be high for 25 minutes and you'd notice him get fidgety after and he'd need another line. This is pure adrenaline, I think.",
            "Nah that’s not just cocaine that’s several drugs mixed.",
            "Well, modern problems (drunk-driving) require modern solutions (don't do booze)",
            "I'm saying. There's nothing terrifying about his eyes when you know it's just performance enhancing drugs",
            "That's some eye opening stuff right here damn\n...",
            "I love his \"I don't know why they call it FREE basing. It'll cost you your home!\"  line!",
            "Or at least slip an eye moistener into the entourage",
            "His forehead is working harder than Atlas trying to keep those veins in.",
            "FORGET COCAINE BEAR.... MEET COCAINE J.T.",
            "Maybe but hes drunk as shit too. I guess its kinda like peeing without pooping. He looks like he got up 6 hours before he woke up. Like its a mugshot on stage.",
            "Rick James, bitch",
            "UNITY!",
            "Cocaine isn‘t bad… It‘s too good.",
            "Drugs are a helluva cocaine.",
            "Gotta have it if you don’t want to get that second DUI in one week.",
            "When it’s running through the veins of a small time thug",
            "He probably asked Professor Utonium mix something for him.",
            "https://www.youtube.com/watch?v=RZ16H0hsQiQ",
            "Hopefully he doesn't kill someone drunk driving before he does!",
            "\"this will ruin the tour\" is gonna come up again",
            "How many celebrities go down for drinking too much? Went to jail and didnt hurt anybody doing it, yet.\n\nWay more likely his publicist hijacks the redemption arc.",
            "Or he could just be tired. He’s in his 40s. I’m similar age and my eyes get like that from lack of sleep. I don’t drink or do drugs.",
            "Some of y'all seeing him like this for the first time and somehow you know \"it's the end!\" 😂😂",
            "How is this a down fall, nobody ever said that about ozzzy osbourne . If a rock star does drugs nobody cares , but if it's a pop star doing drugs it's a downfall ?",
            "He’s really trying to be like Michael Jackson rn with this drug use. I remember people claiming him as the next MJ but not like this. Did is high asf",
            "He sucks. I want Jessica to divorce him.  Being a shithead is catching up to him.",
            "He and Britney Spears are going to start partying again.",
            "What tour",
            "affect*",
            "Backstreet's back. **ALRIGHT?**",
            "Holy shit...get out of my head.",
            "Drugs are a drug of drug",
            "He looks like he has no soul. His eyes are just off in a bad way. Hope he gets it together",
            "He looks like he’s lost a lot of weight",
            "And they lived happily ever after...",
            "What tour?",
            "Seriously. Fail on his PR team. They probably the ones chopping up his lines",
            "Hell yeah he is. Wonder what day out of the bender it is for him here. I say day two",
            "Oh God I hadn't even considered that combination. I guess 2000s heroin chic is gonna be coming back\n\nMan I'm not ready for that shit, my self esteem is still recovering",
            "Seen female celebrities lately?  They're getting that buccal fat removal surgery making their faces age 20 years in a day, making them look like the crypt keeper.",
            "Okay, is it just me or does ozempic make people behave weird and look fucked? Tiny pupils etc?\n\nBoss at my job started it, he brags about how it has no side effects meanwhile he is a different, completely insane looking person since he started.\n\nNo chance he's doing hard drugs. My boss, not Justin. Justin is fucked.",
            "I do a prescribed legal version of this combo. Would not recommend to anyone who isnt already used to bleeding caffeine and hitting the gym regularly.",
            "Why Ozempic…?",
            "Rodney wasn't on cocaine?",
            "I gotta agree",
            "Bam seems to be doing better these days",
            "What tour?",
            "Then your best friend from school is on cocaine",
            "Get out",
            "Indeed! Dude just tap the fuck out. Dude got enough money to live the rest of your life comfortably anywhere in the world. He needs to stop torturing himself and the corpse of his career.",
            "Coke breath. I have it right now and it's rank.",
            "His eyes look the same in his mugshot.",
            "Did this happen before or after the DUI?",
            "About as much as any of us could hope for ",
            "And the fucking Trollz theme song 💀",
            "When he got pulled by the cop for his recent DUI, they didn't know who he was apparently the interaction was:\n\nJT this is gonna ruin the tour\nCop: what tour?\nJT: The world tour",
            "Considering he was a very active participant in that kicking (as well as the s.lut shaming that Janet got) I will respectfully disagree with you and hope he gets what us, old timers, like to call “a taste of his own medicine”.\nOr we can call it Karma, if you prefer",
            "Do you remember why you did it?",
            "Professional athletes would never get pumped full of performance enhancing drugs!",
            "Either a glass vial in a pocket, off stage 15 seconds, bump, on stage, or maybe a mirror sitting just off",
            "What tour?",
            "What tour?",
            "They hate him because he's successful and they are not....so they have to find something wrong with him in order to vilify him and justify their hatred.   In reality, they just hate themselves and their situations, and seek to transfer that hatred onto anything else so they can look at themselves in the mirror each morning without crying.",
            "Yeah, I can't figure out why everybody is so sure drugs are involved.\n\n\nEdit: his pupils are small, as I'd expect them to be under such bright lights. Cocaine causes pupil dilation. The drugs that cause the pupils to contract are painkillers and barbiturates, which I would not expect a person to consume before an energetic performance. I see no reason to think this guy's on drugs.",
            "High Voltage",
            "Oh shit, that guy has huge plates.",
            "In reference to his movie In Time, I believe. Good movie. I liked it a lot.",
            "No one knows what it means, but it's provocative",
            "Believe it’s a reference to the movie In Time, which he starred in.",
            "[JT with less than 24 hours on his clock in the movie In Time (2011)](https://youtube.com/shorts/I0vg03Qr6L8?si=yo_48wFdJzASgDsa)",
            "It means the man's nose could suck the sugar out of a pound cake.",
            "He doesn't like coke, you guys. He only likes the way it smells.",
            "Ah the sheen treatment ",
            "Some of you guy on here should write comedy. Spat out my redbull laughing.",
            "They found traces of blood in his cocaine stream",
            "He needs to stay aware of things",
            "😂😂",
            "i just mixed the Tylenol with heroinwayne",
            "Cocamayne lol",
            "If he's an addict there will come a time - and I'm not sure if he has reached it yet - but there will come a time when it will probably be easier for him to perform without a debilitating addiction to drugs and alcohol.",
            "I mean, people run marathons way past 41...",
            "He is probably much healthier and fitter than you.",
            "the eyes are very telling. i bet 90% plus hes on coke or something similar",
            "There have been false stories about drugs in his DWI test. I originally commented about this but have amended this so as not to perpetuate the hoax",
            "It doesn’t have to be cocaine per se, but he is absolutely on an upper(amphetamine like) based on his eyes. But since he is a celeb, it is most likely cocaine because it’s a popular drug amongst them.",
            "He's rich and famous and in the music industry. If he didn't do coke it would honestly be miraculous.",
            "Possibly Adderall, I had a little run with Adderall years ago and if I didn't have Xanax to come down with I'd look just like him.",
            "Pure amphetamine",
            "Justin saw that quote and his eyes have been like that ever since.",
            "One I like is  \n  \n\"Ten million motherfuckers freebase, *I* gotta blow *myself* up!\" - Richard Pryor",
            "Moisturize me!!",
            "He would give that bear a run for its money.",
            "That was a dope movie",
            "Darkness!",
            "That's not drink",
            "I'm giving you a vehemently against murdering someone upvote. But yeah, you don't know how far that downward spiral will take you and let's hope it isnt this far",
            "I feel like the lack of sleep thing is the biggest part of feeling fucked up from drugs. From a guy who has done a lot of drugs.",
            "I'm in my 40's too, with 3 kids...I've definitely woken up from my 3 hrs of sleep looking like this.",
            "its not just about how he looks, he was arrested for DWI a few days ago",
            "it's if they look cool and like they're having a good time vs if they look all fucked up",
            "How tf is anyone supposed to keep up with all the flights rehearsal screaming lunatics for so many years and keep sober without loosing one's mind. I haven't heard from him in a decade so he must be a reasonably together person. None of ya business how much ginzeng he needs to bring it back every gig.",
            "The world tour...",
            "I steal these, man!",
            "Drugs drugs drugs drugs gruds",
            "Always see it on T.V.\nOr read in the magazines\nCelebrities they want sympathy\nAll they do is piss and moan\nInside the Rolling Stone\nTalkin' about how hard life can be",
            "THE WORLD TOUR",
            "> Wonder what day out of the bender it is for him here.\n\nyes",
            "As someone who used to go on coke benders this looks probably twice that. 2 days is light work, he looks on the verge of death here. Maybe he's throwing other shit into the mix.",
            "It came back when buccal fat removal became a thing",
            "It is back. I've lost 20 lbs from a stomach illness and female doctors always write that I look well nourished in their notes. Male doctors believe me when Im like this is not healthy please help. Buccal fat completely gone, I aged ten years in a few months.",
            "2000s was not the time of heroine chic.\n\nIt was already “out” by like 1997",
            "I love that there's already a buccal fat removal emoji 💀",
            "Distracted me way too much in The Boys",
            "Is it reversible, or at least something where their face can go back to normal if they stop having the procedure done? Starlight looks depressing now, and Emily Blunt is nearly unrecognizable.",
            "Buccal fat removal is way older than ozempic",
            "Adderall and ozempic?? How’s that working? Asking for a friend.",
            "Surprisingly no he wasn't, big weed smoker though",
            "Probably because he passed the curse on to JT.",
            "The WORLD tour!",
            "Yes he is..",
            "but all the vampires cashing in on his popularity REALLY NEED for him to step up and do the thing",
            "Oh my god that’s so fucking funny, thanks for filling us in!",
            "Well I woke up to get me a cold pop and then I thought somebody was barbequing. I said oh lord Jesus it’s a fire. Then I ran out, I didn’t grab no shoes or nothin’ Jesus, I ran for my life. And then the smoke got me, I got bronchitis ain’t nobody got time for that.",
            "The world tour",
            "It got kind of crapped on in reviews, but it's a good sci-fi flick.",
            "Awesome allegory for capitalism. Time is money so what if there was a world where all money was time? Plus everyone stops aging after 25 indefinitely.",
            "I liked the premise of it. Interesting concept and world building in a magic-realism concept - almost believable it would potentially be a thing if it were possible.\n\n\nBut, the writing was ass and I wasn't much of a fan of the acting outside of Amanda Seyfried and Cillian Murphy. Couldve been a lot better than what it was, but it wasn't the most terrible movie I've seen.",
            "I like the concept/plot. When they crashed that convertible and nether the passenger or driver was gruesomely killed I checked out. Also a lot of the montages were sooo fucking cheesey.",
            "Next time I watch it I wanna do a \"take a shot every time there is a time pun\" challenge",
            "I love JTs music but I wouldn't say that is a good movie lol",
            "It gets the people going",
            "Good Ole booger sugar!\n\nDude probably has a felony ring around his nose that he walks around with 24/7",
            "I love the smell of cocaine first thing in the morning!",
            "Literally everyone did cocaine in the 70's and 80's. We're all, genetically, partly cocaine at this point.",
            "This is open source comedy 😜",
            "The ‘Weezy Special’",
            "Tell that to Keith Richards.",
            "Did anyone else notice how the dancer is cracking up at his face?",
            "Looks like tweak",
            "Where’d you get that info from?",
            "Adderall works in many of the same ways as adrenaline. He very well may be on adderall, but this could just be addrenaline and stress from the thousands of people there to see him perform. Who knows tho?",
            "How many mg?",
            "Your joke but worse",
            "Nobody outruns cocaine bear",
            "That dope movie pun slipped through the cracks",
            "Thats at least a 2 day bender on his face. \n\nAnd hes got people telling him what to do. Look at the autopilot in his eyes when they shuffle him on. You wish you had coaches when you get that hammered.",
            "He just got a DUI a few days ago ; you think he takes his coke without drink?",
            "He just got a DWI, assuming why he said that",
            "Correct. That is all the things.",
            "He had was arrested for a dui a few days ago",
            "Also a guy who’s done a lot of drugs and am currently reading Drugs for Grown ups. Sleep is by far the most important element to doing drugs right.",
            "Yeah, I’m sure he’s tired, but it’s more than that. His robotic stare, glassy eyes, pupils. I had issues myself and am now in recovery….you never look rested on drugs.\n\nPlus, he should have no problem getting plenty of rest before a show. He’s got his wife, nannies and plenty of other people at his beckon call. Unlike us common folk.",
            "sir your at a wendys",
            "Is it his world tour or cocaine's tour?",
            "I have a feeling this exchange is going to make me laugh every time for a long time",
            "Siri, call me a hospital, man",
            "Well I'd like to see them spend a week. Livin life out on the street. I don't think they would survive. But they could spend a day or two. Walking in someone else's shoes but theyd probably stumble and they'd fall.",
            "Mr worldwide ",
            "I'm just trying to figure out where you guys are coming from with the \"cocaine thing came back\", as if it ever stopped lol",
            "I'm morbidly obese and my Dr. notes all say \"well nourished.\"",
            "I had the same issue in the early 2010s. I dare say that if the comments are the same, it never went away. I wish you luck in your health, though. It’s tough.",
            "The difference between season 1 Starlight and season 4 Starlight is jarring. It's actually sad what she did to her body. ",
            "Nah phentermine and ozempic. Pretty well actually Im down like 40 lbs.",
            "yeah it was fun. cheesy acting, but the concept was cool and there were actually some decent names in it",
            "I wouldn't mind having a watch built into my skin like that. Am I remembering the right one?",
            "I never understood why it was panned. As far as sci-fi goes it's one of my favourites of all time. I thought the concept of the film was actually quite brilliant and that he performed quite admirably in the role",
            "It starts great, concept is awesome. Endings now... Just bc two people have guns the whole society shouldn't crumble",
            "Lol no it's not. That movie fucking sucked.",
            "Leonardo Di Caprio upvoted it! ❤️‍🔥",
            "Basically future dystopian robin hood",
            "Nose beers!",
            "Helps ya poop! Nice way to start the day off with a bang!",
            "It's free (as in freedom) comedy, but it isn't open source. We don't have access to the thought process and the logic, or developer comments, on how the joke came to be\n\nWe'd need r/explainTheJoke to reverse engineer it",
            "For whatever unholy reason, it isn't debilitating for Keith Richards lol",
            "My first thought was… She knows something we don’t, and is getting a good laugh about it",
            "And someone else taps him on the shoulder to remind him to move along",
            "I just found out the headline I saw was falsified :(",
            "I would think that after 1000s of shows, you do not get that stressed anymore",
            "What about meth gator? Coming 2024",
            "As someone who has seen that reflection in the mirror, yep. That’s the face of someone who hasn’t slept in a couple days at least, and been going hard. Why the fuck someone with his money and access would decide to drive himself somewhere I have no idea. Addiction sucks, hope he can get himself real treatment",
            "I just have ADHD and I feel like I could really benefit from a team of handlers tbh.  Someone to stop me from starting to clear the yard from sticks when I just went outside to get the mail. That sort of thing.",
            "He got a DWI, not the same thing.",
            "Man if only drug dealers gave out these helpful tips when selling.",
            "My what?",
            "Sir you are Wendy!",
            "Hi welcome to JT's touring bus; featuring the human condition of parading around in a questionably pointless space circus, along with some sing songs in between breaks\n\nIt's kind of like the polar opposite of Steve O's touring bus; who accepts his whore existence, likes to dog chill & intentionally hurts himself",
            "Lifestyles of the rich and the famous\n\nThey're always complainin'\n\nAlways complainin'\n\nIf money is such a problem\n\nWell they got mansions\n\nThink we should rob them",
            "Mr. Ay in your Oh\n\n\nDALE",
            "They are talking about beauty trends not drug use trends. \n\nObviously cocaine was always there, but the messy, underweight and sunken eyes look, i.e. 'heroin chic' has been more and less popular over time.",
            "How did you get ozempic?",
            "Wait you are on both of them?   I thought phentermine caused heart issues.  I did the fen/fen in the 90’s before everyone started schitzing out on it.  Bad $hit, fucked me up.  ozempic/semaglutide works sooo much better",
            "cool concept and executed well enough imo. i liked it.",
            "Yeah that's what I always remember about that film, great concept, mediocre execution.",
            "Yep, cool concept, pretty empty movie.",
            "It was a cool concept, but that concept was just stolen wholesale from an actual interesting movie The Price of Life",
            "And Amanda Seyfried was in it. Which is always a massive plus for me.",
            "Yes.",
            "~~watch~~ death clock\n\n(More accurately!) lol",
            "It's not very good. Interesting concept, but the movie doesn't hang together very well, just kind of clunky and insubstantial, kinda hollow, a lot of not-great acting. There are leagues better sf movies, tho no accounting for taste, of course",
            "Leo produced it",
            "He looks like future dystopian Robin thicke",
            "Ah the good ole coke shits",
            "Richards isn't addicted to drugs, drugs are addicted to Richards.  Why would drugs do something to harm their supply?",
            "No. I want cocaine bear vs meth gator. A b movie knock off of Godzilla vs Kong.",
            "No kidding, where were the coaches then lol",
            "You can kill people while driving on prescription pills too, turns out.",
            ">if only drug dealers gave out these helpful tips when selling.\n\nIt'd make sense to.\n\nKeep your clients alive, healthy, maintaining a job.\n\nIt's about the long game. Building trust.\n\nThen adding in fent.",
            "That’s it. That’s gonna be the book I write.  \n\n*A Drug Dealer’s Guide to the Galaxy*",
            "YOUR ATAWENDYS",
            "You forgot your banana",
            "Your dead-end-jobs i.e. attawendys",
            "No, this is Patrick!",
            "https://russianmeds.com/",
            "Im diabetic.",
            "Yeah I am. My blood pressure has actually gone down. I went from 140s/90s to 120/80~",
            "A particularly lethal drinking game of mine is finding every occasion where they just searched/replaced \"money\" with \"time\" in the script.",
            "I only vaguely remember it, I did think the concept was neat but iirc it just became a standard \"gun and run\" flick. like Cocomelon for MEN!!",
            "Assuming if he got pulled over, the \"do you know who I am\" routine would work. \n\nThey didn't bet on a young cop who DIDNT , in fact, know who he am.",
            "Keep moving goal posts. The amount of assumptions going on in here are wild. My favorite are the people analyzing he’s a coke addled fiend because of his eyes during a concert?\n\nYall are fucking crazy",
            "Ah, yes. Erm that.\n\nYou keep it. I’ve more at home.",
            "people in reddit comments talk about ozempic like its some magical hollywood drug like in Limitless lmao. it's just a diabetic drug, my 70 year old dad takes it for his type 2.",
            "Makes you wonder if or how many times he got away with it before.\n\nLike, he might think he can play that card but you wouldnt let your buddy drive and play cards. Theres an enabler there somewhere.",
            "Yeah, thinking he’s above the law is definitely part of it. But at the same time he’s more than wealthy enough to have someone in his entourage to take him whenever he wants. Even if you don’t think you’ll get pulled over wouldn’t you just have someone drive you if you’re that rich and intoxicated? We see this shit happen over and over so it’s not surprising but damn",
            "lmao \"do you know who i am?\" like bro yourself a washed popstar, why would your status get you out of this DUI? You're not a politician with connections ",
            "This exchange reads like Discworld, and I'm here for it",
            "Semaglutides are quickly becoming a proven weight loss strategy that works for almost every single person who uses it. \"Just a diabetic drug\" or not, it's still pretty miraculous. And there's plenty of reason to think it far, far above other \"weight loss\" pills/medicine. Especially, considering the fact that side effects seem to be minimal.",
            "Eh, maybe. I think im above the law after about beer 4 and im not famous.\n\nBut like you said, why wouldnt you just let somebody else drive? Hes a meal ticket for at least a dozen people, how stupid do you have to be to not jump in the drivers seat?",
            "Why is that upper comment referring to it as \"Ozempic and cocaine.\", is there some combined effect of this?",
            "It’s the overinflated confidence and ego. He thinks he’s untouchable and doesn’t need someone else to drive. It’s the faulty pride."
        ]
    },
    "Spiky contacts used by morticians to keep the eyelids of the dead closed at funeral viewings.": {
        "title": "Spiky contacts used by morticians to keep the eyelids of the dead closed at funeral viewings.",
        "score": 779,
        "url": "https://i.redd.it/59e23l3yl38d1.jpeg",
        "content": "",
        "num_comments": 43,
        "comments": [
            "Lets thank the mortician because I would never want to see a dead person‘s eyes open",
            "The story goes my Dad died when I was 7, mid way through first viewing the cotton ball they used, let's say failed, and his eyelid collapsed. Needless to say trauma ensued for a few, thankfully I walked in, took a look, said \"that ain't my Dad\" and promptly left to greet people at the entrance with the news. Everyone thought it was cute, man the 80s was a wild time huh.?\n\nEdit: Should mention, he did donate his eyes to someone in need, thus the cotton ball, still not entirely sure why they didn't use more but hey I was 7 and didn't find out til I was like 20.",
            "I don't understand funeral viewings. I wish I could erase the memory of seeing my grandmother dead.",
            "Never got a complaints though.",
            "Open casket funerals are wild to me. Went to two of them. If I have a funeral it will be closed casket. You can remember me how I was when I was alive thank you.",
            "Coins for the ferryman.",
            "Sometimes super glue too.",
            "This is why I had a closed casket funeral for my husband. I could bear for them to do any of that embalming or spikey contact shit to him.",
            "This is true. I use to harvest cornea donors after they died. Sometimes the eye lid did not want to stay down. It is a muscle after all. Or if cutting to deep you can blow the eye ball. Basically punctire it and all the gel comes out. So these would also help reshape the eye to help it look normal when the eye lid was closed rather than have a big indentation. They are plastic with little barbs on them. See you later.",
            "Forbidden spaghetti strainer",
            "I work at a funeral home and these things used to be one of the only things to creep me out",
            "Stuff like this really make me hope being dead isn't just the same as being in permanent sleep paralysis",
            "I worked in a funeral home and the eyes turn to mush. They would super glue them shut. \n\nAlso, the cremains you ask to be placed in a necklace or smaller urn? They would open it on their work desk alongside paperwork and their morning coffee.\n\nYes, I quit.",
            "Like carpet grip strips. Nice.",
            "I'm glad a photo of a closed eye was provided otherwise I'd have no idea",
            "My uncle died when it was my turn to sit with him (hospice was involved, we knew it was coming.) Before I went to tell my mom I did that thing you see in the movies…passed my hand over his eyes to pull his eyelids down. I felt really stupid because it definitely didn’t work, they popped right back open.",
            "Just another reason my family believes in cremation.  I don’t want anyone looking at me dead for a long time.. \nlol I have been resisted  🤔 have been seen dead.",
            "Talk about eye-popping fashion choices!",
            "Grate eye dear",
            "I should have been a mortician.",
            "[removed]",
            "Oooh my dad’s eyes got donated when I was little too! Trauma twinsies. \n\nBut we had him cremated and had a memorial service, no wake or viewing. \n\nI really can’t understand why they would use cotton balls of all things?",
            "It's not for everyone. When my grandmother died, my mother took pictures of her. It was the last time we would ever get to see her.\n\nSome people just want to be able to say goodbye.",
            "I work with young people, and have been to some open caskets for children...that's even wilder.",
            "It's not.",
            "Oh god, that’s a tasteless bot-like comment",
            "You still could, didn’t take much for me to get into the trade",
            "Bot stole [this comment](https://www.reddit.com/r/oddlyterrifying/s/zTmhvtSCee).",
            "This is what I don’t get either. I don’t want my last memory of a loved one to be them laying lifeless in a box.  I also understand some see this as being at peace and may be better than their last moments alive too, so I can see it being a personal preference.",
            "Yep.  Burn me, give me to science, let med students work out how I died, whatever.  Just don't display me in front of my kids/grandkids/friends as a corpse.  I was a vibrant being of light, not a lifeless plank of flesh.  Remember how I was!",
            "I wanted to see my mum in the chapel of rest after she died, but I couldn’t get there and didn’t have childcare. My mum died suddenly and I was struggling to believe that she was really gone. I’m still angry I didn’t get to say goodbye to her, 2 years later.",
            "Yeah, I understand that. I remember my cousins and I didn't want to see her but it was important to my mother and uncle. I may feel differently about my own parents one day.",
            "Yeah, I find it really important personally...I feel like seeing the body gives me closure, it's much harder for me to process grief when I haven't been able to see someone I love knowing that this is the last time. \n\nDifferent strokes for different folks I guess!",
            "Great job, take this fake gold 🥇",
            "I can’t remember my grandma when she was healthy. I only remember her being in the casket and when she was really sick beforehand. I don’t know why…. /:",
            "I'm 28 and we found my mom in her room. Wish I could get it out of my head. Whites of her eyes were black.",
            "I agree but for me thats not how I want to remember them.",
            "I found my mom dead when I was 46 and I will never forget it. Or the 911 operator arguing with me and telling me to give her CPR when she was already cold.",
            "I'm sorry you had to go through that.",
            "Sorry, that person is obviously too dense to be an operator",
            "I'm getting over it but maybe it'd be a different scenario if your parents were elderly. Like a send off. She was 49 and it was semi unexpected.",
            "It was bad enough to see her sprawled on the floor and touch her once and realize she was gone. I wasn't touching her again and giving her CPR! It was awful.",
            "I’m so sorry for your loss. I found my mom, too. Fortunately no trauma was involved, but still, it was an experience I will never forget. It was a shock to my core, and yet I had a sense of peace because she no longer suffered."
        ]
    },
    "A road in Ireland": {
        "title": "A road in Ireland",
        "score": 80,
        "url": "https://i.redd.it/agq9dfrra48d1.png",
        "content": "",
        "num_comments": 13,
        "comments": [
            " Ah, the roads in Ireland! Full of twists, turns, and surprises.",
            "Lovecraftian vibe.",
            "Nope...",
            "The road to Mag Mell.",
            "That's where the local fae live, they're harmless as long as you don't tell them your true name",
            "black metal band album art template (mandatory unreadable logo)",
            "Pretty!",
            "That's how you get kidnapped by the Fae",
            "Now imagine driving down this on the left side when you’re used to driving on the right and any oncoming cars easily doing 100 km/h despite there being no shoulders, no passing room, blind hills and turns, etc.  Add in the occasional pedestrian for extra laughs.",
            "The street lights on the roads look like their covered in gold coins at night flying to and from shannon.",
            "I must bike that road at midnight on a blood moon.  #BucketList",
            " Ah, the roads in Ireland! Twisty, turny, and full of surprises.",
            "This forest begins just after the ”leprechaun crossing” sign"
        ]
    },
    "My cover pic that Spotify put for my Classical mix": {
        "title": "My cover pic that Spotify put for my Classical mix",
        "score": 92,
        "url": "https://i.redd.it/c876lciy438d1.jpeg",
        "content": "",
        "num_comments": 11,
        "comments": [
            "Lol, looks pretty standard for Aphex Twin honestly.",
            "Yep that's Aphex Twin for you",
            "Aphex Twin, isn't it?",
            "Knows you well",
            "Well, yeah. It’s got Aphex Twin in it",
            "Most of Aphex Twin's music is very experimental electronic music however he has produced some very beautiful piano music which I guess is why he was added to the classical playlist!",
            "Lick a window with the Windowlicker",
            "That's just Dichard J Rames",
            "It truly is   I never even heard of the guy I thought it was some AI bug or something 😅 creepyAF",
            "i love the piano stuff reminds me of being a kid for some reason",
            "Come to daddy!"
        ]
    }
}