{
    "Welcome Back": {
        "title": "Welcome Back",
        "score": 144,
        "url": "https://www.reddit.com/r/OlderThanYouThinkIAm/comments/18hh9kq/welcome_back/",
        "content": "Hello everyone.  \n\nAs most of you probably know this sub was banned around six months ago for being unmoderated.  I recently requested it, and was granted permission yesterday.  \n\nThe rules are going to remain the same as they were before.  If you're new to the sub or just need a refresher you can find them here:\n\nhttps://old.reddit.com/r/OlderThanYouThinkIAm/about/rules/\n\n\nI had to clean the sub up a little last night, the former head mod threw a bit of a tantrum when he deleted his account over the API changes, and the title and description had quite a few obscenities directed to the admins.  If I missed anything, let me know.  \n\nOutside of that if you have any questions, concerns, changes you would like to see, please feel free to comment them here.  \n\nI most likely will be looking for mods in the near future, but right now I just want to see how active this sub actually gets after being banned for the past six months.  \n\n\nSo again, welcome back everyone, and we all look forward to any new stories you would like to share.",
        "num_comments": 12,
        "comments": [
            "[deleted]",
            "I thought I dreamt this sub up for a minute there. Glad to have it back! Maybe we can have a monthly discussion thread,  since this is story's only? I'd love to ask general questions to the sub, and talk experiences in general. It's tough living in this world with a baby face, it'd be cool to have a place to rant without having a good story.",
            "I was so heartbroken when this sub got banned for un-moderation. I do not know a thing about being a moderator so I was learning how to bring it back. Thank you so much for keeping this sub active! Let me know how I can help, should you need it! 😄",
            "Yay It's BACK :D I missed this sub lol.",
            "Nice work. Happy to have the sub alive again.",
            "Thank you so much for bringing this sub back, just loved to lurk but I've got s few stories of my own that are just waiting to be posted.",
            "Thank you",
            "As a 33-year-old redditor who looks 19, I'm glad to see this sub is back up! Thanks OP!",
            "Thank you for bringing it back!",
            "Same, if I don't see posts for a while I tend to forget I'm subbed.",
            "Yes, that's definitely something I think we could do.  \n\nIt may be a little while before any changes are implemented.  This is the first sub I've modded on reddit, so I'm getting use to things.  It's actually helpful that the sub isn't *too* active at the moment.  The last time I moderated a message board was back in I think 2004.  As much as I like to think that was \"just a few years ago\", it's obviously not lol.  \n\nBut I'll try to start monthly discussion threads after the holidays."
        ]
    },
    "Fresh out of school": {
        "title": "Fresh out of school",
        "score": 40,
        "url": "https://www.reddit.com/r/OlderThanYouThinkIAm/comments/1dlgs1s/fresh_out_of_school/",
        "content": "At work, we ended up talking about age. We come to learn that the supervisors are mostly 22 years old. And some of the regular employees are also 22 years old. Everyone there learned that I was turning 25 that week. One of the supervisors told me that when they first saw me, they thought I was just fresh out of school, cause apparently I looked that youthful.\n\nI was surprised again. This literally tells me that I will forever look like a perpetual young person. I don't think I even look like a college aged person. I don't know how young this supervisor thought me to be... But it still kind of hurts to know.",
        "num_comments": 8,
        "comments": [
            "I’m older than you and people have genuinely asked me if my school is closed that day when I’m working",
            "I had coworkers at my new place of employment horrified when I asked for time off for my wedding. They felt 19 was too young to be getting married. I was 30.",
            "Trust me it follows you for a long time. I always get asked if I’m my 22yo daughter’s older sister. I’m like no I’m her mom but thank you. You just made my day.",
            "In the 70’s in my twenties I had a beard and mid length hair. (I know but it was the thing then. )\n\nI was an Estate Agent (Realtor) I decided to remove the beard. I lost the confidence of clients who now thought I was fresh out of college (18), I grew the beard back and all was well as I know looked my age, apparently that was (32). In fact I was 22",
            "I'm 24 and people still mistake me for 15 like no I have a 2 year old 😅",
            "At your age, I found it insulting too.\n\nNow I'm in my forties and still get asked for ID to buy wine (where the drinking age is eighteen!), I find it more funny than offensive. Especially as they turn bright red when they realise I'm their parents' age.",
            "Bruh. It really does get worse as you age up. You're literal proof.",
            "Everyone tells me one day I’ll appreciate it, we shall see"
        ]
    },
    "Husband's coworker asked if we had ever considered having kids": {
        "title": "Husband's coworker asked if we had ever considered having kids",
        "score": 1228,
        "url": "https://www.reddit.com/r/OlderThanYouThinkIAm/comments/1dkb78z/husbands_coworker_asked_if_we_had_ever_considered/",
        "content": "So my husband and I live alone with our little dog.  He has a coworker friend who has stopped by two or three times. \n\nThis guy has a new baby, so of course he was showing us pics of the baby and telling us how great it is to be a dad.\n\nThen, real serious,  he asks the question.  Have you two ever thought about having kids?  It's the best thing to ever happen,  it will change your life, blah blah blah...\n\nI'm 49 years old so I just laugh.  My husband then tells him that his daughter is married and our grand baby is 2 years old.  \n\nGuy was shocked.  He said he thought we were 'like almost 30'.  ",
        "num_comments": 54,
        "comments": [
            "This is hilarious! One of our nurses that I work with had a baby shower that most of ur work aquaintances went to. We all played shower games and then got the cake that has a metal baby baked into it.  The ‘tradition’ cake says the person who gets the baby will be the next to have kids. Everyone got so excited for me getting it saying its my time to next be pregnant! I laughed and told them I already have 5 kids and my oldest is 28. It went dead silent in that room. Apparantly everyone thought I was in my early 20’s!?!??  Like no, omg.  It made me feel good though.",
            "My ex husband and I have two daughters. They’re 5.5 years apart in age. When my younger daughter was 8, I had multiple people ask if we were going to try for a boy. So my normal answer was “my daughters have been able to wipe their own butts for a long time and I’m not going backwards now.” And then they’d ask “don’t you really want a son?” Nope, if I did, clearly I would have kept trying 🤦‍♀️ but I’m 41 now and people still ask if I regret not trying for a boy. It’s so weird to me??",
            "A couple of years ago, I was flirting and chatting up an acquaintance, hoping to ask her out. When I broached going on a date, she said something about the age gap between us. Her comment was she doesn't date anyone younger than herself, then said her age. She was quite surprised when I told her I'm actually 10 years older than her.",
            "This is hilarious! My poor son (I had him at 26, so I am NOT a young mom) gets accused of being my boyfriend/ husband all the time, and he hates it! Once I turned 40, I started enjoying getting carded and watching the expression on their face when they see the birthdate and scan the license! I hated looking 10 when I was 15, but it sure is great now!",
            "We had our kid late (conceived a couple weeks after my wife’s 39th bday). \n\nOn one hand we have some people who know us wrongly assume our kid is a miracle after years of infertility (we waited on purpose and got pregnant quickly once we decided it was time).\n\nBut we chuckle when we still have strangers ask/tell us it’s time for us to get started on baby #2.\n\nWe’re 44.",
            "I had sort of the opposite of this when I was a nanny in my 20s - I looked like a teenager, and people would see me out with my 4 and 2yo nanny kids and give me censorious or sympathetic looks. Over the years, several people gave me comments in both veins about having children at my age. I don’t know why people assumed that, since I live in a city where nannies are pretty common and I look nothing like those delightful little humans except for sharing an ethnicity lol",
            "At work there is a guy who has been around me for 15 years off and on (contract work) and just was talking about some TV show from my childhood. He said \"You probably never heard of this....\"  and I asked him how old he thought I was.  He said 47?  I'm 60 and we were just talking about my teenaged grandson staying with me.  Boost to the ego.  All coworkers are either old, young or peer. And this really isn't an age thing, it's a competence thing.  If you're my peer I think of you as about the same age as me unless there is an office birthday cake with your age on it. And this applies to people you know well.",
            "People tend to think others are the same age as they are. They want to find similarities with people the like and admire.",
            "34 and love being carded. Yeah they *need* to scan it but still, take that whenever you can get it. ",
            "We had our first young like 17/18, (which obviously I don't advise) all our friends around the same age would constantly ask me when I was gonna have another, give him a sibling ECT, so I just started replying \"when you guys start having your first.\" Eventually they stopped lol\nWe did have a another child, 10yrs later when we were married and much more established.(Funny enough like 4 of my friends were all pregnant at the same time with their first same time as me) 🤣",
            "I had something slightly similar happen with a coworker, but it was more weird. The dude was insisting that I should have children. At first I was being polite, and playing it off like I’m not ready for children. But the dude for some reason kept pushing and insisting that I should have children(honestly not his business). I started getting pissed off because he wouldn’t drop it, and ended up going off on him about how I can’t have my own children, and how he shouldn’t stick his nose in something as big as someone deciding if they want to have children or not. At that point though in him working with me, he was really starting to piss off a lot of the people there with stupid things he would say and do",
            "LMAO ... The ultimate uno-reverse.\n\n\"Here. Let me show you pictures of my grandkid.\"\n\nThis is oddly wholesome and I love it.",
            "I finally got my partner's mom to stop bugging me about kids when I reminded her that I'm 45 LOL.  She's known me since 2006, so I can only think the wishful thinking about grandchildren had obscured her memory of my actual age...",
            "Ok Softy… this was just to gloat, right? \nI had the very same situation just the other day… cept it wasn’t a friend from work but and undertaker who was also about 20 yrs off on my age😞\n\nLove your story & congratulations!",
            "My mom is 50 with her oldest grandchild being 14 and youngest being 4 people still think he is is in her 30s I hope I look like her when I'm 50",
            "I'm 31 but my 12 year old son's friends mistook me for his older sister 😂. Dressing like a grungy degenerate still helps I guess 😂😂😂",
            "Had something like that happen to me at work, I have been working there for 11 years. A colleague told me to watch out for partying because \"when you'll reach your 30s it will become rough the next morning\". I just chuckled and was like \"thanks I'm much much aware of what the 30s feels like.\"  She looks at me sideways and was \"Nooo, Nooo way, how old are you?\"  When I told her I was a few months shy of 40 she almost fell down her chair, her facial expression was priceless. She thought I was 26, 27 at most. Girl at what time did you think I started working here hahaha\n\nAlso got ID'd for booze at a chinese-owned store and the lady couldn't decide if she didn't read properly or if I had a top quality conterfeited driver's license, had to ask her husband to double check. He then proceded to tell me I must sleep in a freezer, only valid explanation in his eye.\n\nI'm just a plump, rosy skinned, child free person that stays out of the sun, I guess it helps. But my first white hair showed up for my 39th birthday so I guess I won't play the \"guestimate my age\" game much longer hahaha",
            "Older gen looks younger then the new 20yos so makes sense",
            "I would’ve called my daughter and tell her I guess I’m in my 30s lol 😂",
            "Listen. Take that as a compliment. ;)",
            "Best problem ever!! I’m mistaken for being younger than I am, too. I hated it as a teen, but love it now!",
            "Why would your husband's co-worker friend ask if you wanted to have kids ? He can't be that good of a friend if he doesn't know how old the two of you are. He sounds creepy.",
            "Ignorant coworker",
            "5 kids and your that well kept?\nKudos!",
            "Yeah, people are weird.  My twin sister and I are the youngest out of a large family.  Our older siblings were 5 to 13 years old when we were born.  \n\nI guess several people asked my mom if we were an \"oops\" baby.  Mom loved telling people that the first 5 kids were all accidents but they planned us.",
            "We have 6 kids. 5 girls and 1 AFAB. \n\nAfter the 2nd girl ppl kept asking us if we were trying for a boy. \n\nMy husband started asking “No, but we might try for another girl.” He’s the GOAT.",
            "My young SIL asked me if we were having more kids (we have one) and after her mom told her she isn’t supposed to ask and I told them it was okay I simply told them “no, I had to be medicated for unpleasant thoughts, another pregnancy might institutionalize me” and I was completely honest in that. That and my son really is enough for me. I do not want to go backwards and restart and have another infant, I will have to split my attention and someone will feel hurt.",
            "I watched a woman go up to the counter at the dollar store in front of me. She had a basket full of those $1 preganancy test. It rang up to be $23 and some change so I assume she bought about 20. She was friendly and talking to the cashier and said she was in panic mode at the moment and then said she had 4 kids and her youngest was 27! Baby I said a prayer for her (silently, of course). I could not imagine having to go back thru all that again as my kids are about the same ages as hers. I told her we would be praying that the missed periods are meonpause instead and she laughed but you  could see the absolute sheer panic on her face that she thought she might be pregnant  again.",
            "I'm the son in this situation 😞",
            "My twin sister has a kid in kindergarten.  She is so mad when people ask if that's her grandson.",
            "I’m gonna be 36 this year and people keep asking when I’m having another. My first is nearly 14 months. When I say I want to feel like myself again, grow my hair back, and feel a little normal (physically) again first, I get met with “but your clock is ticking! You have to have one NOOOOWWWWW or it will be too late and you’ll be too old.”\n\nUhh no. If I decide I want another, I’ll have another, in my own timeframe. (I have other reasons like: my first is a son, I would want a daughter too to even it out lmao. But the gender is a 50/50 shot without medical intervention that costs a crap ton of money I don’t have. And I only want to be pregnant one more time *if at all*. Definitely wouldn’t want to be pregnant 3 times.)",
            "Jesus. My babies were all grown and gone and we had many grandbabies by the time I was 44. And I honestly just do not have the patience or the energy to keep up with the grandbabies most of the time. Having a kid again at that age would kill me! More power to you hun! Aint no way I could do it again.",
            "My first thought would of been, you being an older sibling to the kids over being their nanny/mother.\n\nThen again, I don't put much thought into how people are related to the kids that are with them. (I know a lot of people with adopted kids of different ethnicities) I just look to see if the kids are not in distress or confused why they are with said person.",
            "I agree that someone like that is awful.  I met my husband when his daughter was 5 years old.  I don't have biological children.  I have a great relationship with her, she moved out of our home when she finished college. \n\nI was in my 30's when I told my GYN that I wanted to get my tubes tied,  that jerk told me that I was put on earth to make babies and that I should have a boy and a girl and then he would do the procedure. \n\nI remember one time when I was probably 22-23 a guy telling me that I needed to hurry up and get married and pregnant before it was too late.  I told him that I had no plans to do that anytime soon.  He went off and told me that I was wasting my life, that I was selfish,  that I would regret it later.  I remember that he was really angry and I laughed at him.  \n\nThis interaction with my husband's friend was NOT THAT.  He's just a new Dad, excited about having a baby.",
            "Thanks, I was seriously just laughing while my husband explained.  Nice compliment that he thinks I'm late 20's but I turn 50 in a few months.",
            "Damn I had white hairs at 16. But I also am pale and ppl always always always think I’m 24. I’m 32",
            "It was funny to me.  He really said it to both of us, not just me.  It was more of a new dad being excited about his baby thing. \n\nI can definitely see a scenario where that could come out as creepy or gross.  Or some people who would be offended.  \n\nWe moved to this town not too long ago, they just started working together and he's been over like twice before.  We have not known him for very long.",
            "Guy here, I don't know anything about my work friends' personal lives.",
            "He also didn't know that he had a nineteen year old daughter.  Strange friendship. 🤔",
            "What is the secret? I’m bout to turn forty and had twins 5 years ago and feel like I went from looking 10 years younger than I was to 15 years older than I am in that time frame.",
            "Yah, my younger daughter is almost 17. I cannot imagine having a 7-8 year old right now.",
            "Guess she didn’t inherit your youthful aging genes?",
            "We met at 14, got together at 20 and married in our late 20s. Not long after marriage we decided we would only have one kid and that we didn’t want to start trying until we were in our late 30s.\n\nBy the time we decided to start trying a bunch of people we knew, most in their mid to late 30s, started having kids too. We know of at least 10 kids born to friends/coworkers/acquaintances around our age born within a 2-3 year window of time (ours is now 4 going on 5).\n\nIn fact my coworker is turning 42 this week and he and his similarly aged wife just had their 3rd in December.\n\nAll this to say that in my world, a 36 year old still planning to have a/more kids is so normal.",
            "I get it. We all can only speak from the prism of our experience.\n\nOur relationship is old enough to be the mother of our daughter. We had a kid 25 years after we met at 14 years of age. We made the decision in our 20s to wait until our late 30s to even try for a kid. In fact my wife, as teenager, always envisioned being an “old” mom (both of our moms had all their kids over 30, with their last kids arriving when both were 38). And having kids at this age is so very common where we live.\n\nWe could’ve had kids at the time you chose to. And I totally get the appeal too. But neither of us wanted to. We’re glad we had ours exactly when we did.",
            "A gynecologist should know that picking gender isn’t cheap or easily done. 🙄  Nor is it his business.",
            "I second this. Even with our actual friends we don’t have to know every little thing about each other.",
            "I try to never know about work peoples lives",
            "She is 22 years old and married and lives in another town.  They have worked together for a few months.",
            "So many of my parent’s friends have no clue how old I am. They know my parents have kids just no clue how old I am. They think I’m a young child or sometimes in my mid teens. I’m 26. Whenever I respond to their questions about school with “I’m not in school anymore” their assumption is always high school dropout. My parents apparently neglect to add any sort of time frame to their stories or any kind of Jin that their kids are adults. It drives me nuts because I keep having to tell people I’m not a middle school (someone asked me once how I was allowed to make that decision) or high school dropout and I graduated college.",
            "Go ahead and blame the twins. That's what my mom did!  I remember her saying that she didn't gain any weight with her previous pregnancies, but having twins ruined her body. \n\nMaybe don't say it in front of those twins, I definitely remember feeling kinda bad about it as a kid, lol\n\nShe also said some great things about having twins!  \n\nShe said that we were way easier than the first five, because we kept each other busy.  We also just naturally looked out for each other's feeling.  \n\nHopefully, people are not so rude anymore,  but mom said that several people would tell her that they wouldn't want twins.  Mom said that she cried the first time someone said that to her.  Then she started saying that God didn't ask her!  Which I think is great,  especially because that's about the only time I remember her talking about God.",
            "Haha, when we were kids, I was happy to tell her that I was the oldest by 1 minute.  She does look older than me now.\n\nWe have definitely lived very different lives.",
            "Thank you!!! That feels so validating. It’s hard when the people around me (my gramma, my mom, my sisters) all had kids early so that’s the norm. My sisters started in late teens so my oldest nephew is 20 (21 in a month) and my oldest niece is 18 (19 in December). It feels odd that I’m just starting but also I felt ready. \n\nAgain, thank you so much.",
            "Thats awesome! I can definitely say none of mine were planned. They just sort of happened, lol. We eventually figured out what caused it though 😆 But now when the grandbabies go home after a weekend with us, my body feels like it has been beaten. I thankfully have lots of vacation time saved up and can take off on those Mondays to rest and recuperate. Makes me feel super old even when I know logically that I’m not 😢",
            "You would still think it would have come up in conversation if they actually hung out together.  \"Hey do you have any kids?\""
        ]
    },
    "Twice now I've been asked what school I go to": {
        "title": "Twice now I've been asked what school I go to",
        "score": 107,
        "url": "https://www.reddit.com/r/OlderThanYouThinkIAm/comments/1dksact/twice_now_ive_been_asked_what_school_i_go_to/",
        "content": "I'm a 28 year old woman. The first time was a couple months ago. I was taking an Uber home from Walmart, and the driver was making conversation. Then he asked what school I went to and was shocked when I told him my age.\n\nMore recently, I was going through a rough patch and ended up visiting a church to get some quiet to think. A nice lady at the church was checking in on me to see if I was okay (they let me sit in their church library) and asked me if I went to school in town. I told her my age and she was shocked. Apparently I look like I'm the same age as her 17 year old daughter.",
        "num_comments": 8,
        "comments": [
            "I was once told by an older gentleman on a bus in Minneapolis \n  that I should stay in school and stick to math, because my people are good at it. By the end of the conversation (that I played along with) I determined that this man thought I  was a 16 y.o. Asian boy. I'm Puerto Rican & German, was 32 at the time, and am not a dude. Dykey, sure. But definitely not a dude. \n\nPeople are people.",
            "Well. At least they clock you in as an older teen. I'm 25 and people thought I was 15... Which I heard is only going to get worse as I age up. I think that people perpetually thinks that I'm a 15 year old. A supervisor at work thought I just finished high school. Y'know, fresh out of school. I don't even look remotely college age.",
            "Congrats. Continue to take care of yourself.",
            "I'm 35, I still get asked that occasionally too.",
            "Seriously",
            "That's a crazy mistake to make!\n\nWhat confuses me about the church lady is she asked me what school I went to after I mentioned having a husband.",
            "Do you know what subreddit you're in?"
        ]
    },
    "You’re how old???": {
        "title": "You’re how old???",
        "score": 73,
        "url": "https://www.reddit.com/r/OlderThanYouThinkIAm/comments/1dkol60/youre_how_old/",
        "content": "I got one more (well for today) lol \n\n  This really handsome man wanted to take me out & I must say he was persistent. I was separated for a while but still wasn’t sure if  I was ready. Eventually, I finally agreed & had the best time! We went out a few more times & our ages finally came up (not sure why it took us 6 months then 3 dates in.)  But it did &  that’s when I 34f found out he was a 24m! He looked and acted older (look/career wise) & well he thought I was his age & vice versa. Well I didn’t like the idea of being a cougar (I thought) & he needed to go through life so I knew there was no chance of something serious. I even went NC for a while. However on and off to this day we still see each other from time to time. (My BFF says 8 years but you won’t BE WITH HIM) 🤷🏻‍♀️",
        "num_comments": 13,
        "comments": [
            "I would think during general conversation talking about past events in history/life and/or music (songs) something would have come up to make you realize he was not close to your age.",
            "Honestly if you enjoy his company and he's a mature guy, just go with it and have fun. Don't worry about what may or may not happen. You're way too young to be a cougar anyway. Have fun. Life is too short to worry about things like this when you're not even 40 yet.",
            "Meh, i was 19 and brought home a 30 year old.\n\nWe've been married 34 years now. It's more important that you're compatible, than close in age.",
            "I find that most people who post here are women. As a man who looks very young do you think it affects women more often or are women just more open about talking it?",
            "I think men as just more vocal into pointing it out to women",
            "That’s what happened on the 3rd date",
            "When I was a 19-year-old man, I was briefly engaged to a 29-year-old woman. We both had obscured our age a little by telling selective truths. We were both going to college. I told her I was going to graduate soon (which was true, because I was in an accelerated program — I graduated with my BS in Physics when I was 19), and she told me where she was going to college (but she failed to tell me she was going *back* to college and was in graduate school).\n\nWe had a good laugh a few weeks after we started dating when we figured out how old the other one was. Frankly, I think her parents were more bothered by it than mine. Ultimately, though, we were incompatible, probably because I wasn't really finished growing up yet.",
            "I’m 43 now and he’s 33 \nWe started when I was 34 and he was 24 lol",
            "https://imgur.com/a/YxdDC7M\n\nThis is me",
            "That’s what I was thinking. His need to grow where I’ve least been. I think I’ve been only one bothered lol. Congrats on Degree at 19 ! I got My BA at age 33 with a full time job at USAA & 5 kids !!",
            "....is she hotttttt?",
            "You have a baby face but you do look 34 yo to me",
            "USAA is awesome! I hear about complaints from other people about their insurance companies when they need to use them, but the one time we really needed help, USAA was there for us."
        ]
    }
}