{
    "One Piece: Chapter 1118": {
        "title": "One Piece: Chapter 1118",
        "score": 3747,
        "url": "https://www.reddit.com/r/OnePiece/comments/1dkas3v/one_piece_chapter_1118/",
        "content": "##**Chapter 1118: \"Being Free\"**\n\nSource | Status\n:-----|:-----|:-----\n[Official Release](https://mangaplus.shueisha.co.jp/titles/100020) | [](/cross) OFFLINE\n**TCBscans website** (TCBscans (dot) com)| [](/tick) ONLINE\n[TCB Discord](https://discord.gg/tcbscans) | [](/tick) ONLINE\n[/r/OnePiece Discord](https://discord.gg/onepiece) | [](/tick) ONLINE\n\n\n---\n\n[Ch. 1118 Official Release (Mangaplus)](https://mangaplus.shueisha.co.jp/titles/100020): 23/06/2024\n\nCh. 1119 Scan Release: ~27/06/2024\n\n---\n\n## Please discuss the manga here and in the theory/discussion post. Any other post will be removed until 24h after the release.\n\n## Please also remember to put the chapter number in the title for any future post talking about this chapter.",
        "num_comments": 5235,
        "comments": [
            "Am I hallucinating?\n\nNo break next week???!!!!!",
            "Please no one ask Dorry and Brogy who can dance better!",
            "Warcury looking mad SWOLE",
            "Luffy making the ocean bouncy and all the marines freaking out thinking it’s the ocean rising was pretty dope",
            "Rebecca is so done with how Leo is so Naive.",
            "Imagine going back to Sabaody and telling people that Bonney's fruit might even be more busted than Law's",
            "Bonney became Joy Boy before Kaido. 💀",
            "I love how Saturn said Bonney was fed a useless fruit as an experiment. Yet here she's now, using that fruit to become his worst freaking nightmare.",
            "We’re all focusing on Bonney, for obvious reasons.  But we need to pay our respects to Edison.  He was a real one.  Really hoped he would make it out of this arc alive.",
            "Everyone :  Luffy's gonna eat the mother flame and became invincible.\n\nOda : Two Nika's, take it or leave it.",
            "The first thing Luffy does is ask \"where's Usopp?\" when he gets on the giants' ship. I love it. He knows his boy is going to love this.",
            "Marine ships look like the Iron Giant's bath toys.",
            "Wtf 2 Shens?",
            "That panel with kuma was beautiful",
            "There is something very poetic about how all of Saturns efforts to ruin Kuma’s life, and take away the hope from him and his family, resulted in another Nika.\n\nThe kidnapping of Ginny, the experimentation on both her and Bonney, and forcing the robotization on Kuma.  It’s only because of all that he did that Bonney reached this point.\n\nMan did all he could to try and make people lose belief in Nika, but that belief only got stronger.",
            "The giants preparing a bunch of food prior to Luffy boarding is really sweet! Also means Luffy will be at full power to kick some ass!",
            "SHE CAN DO THAT?????",
            "The fact Bonney can transform into Nika means that despite the horrible tragedies she’s been subjected to that she really can envision a future where she’s as free as Luffy one day and I think that’s such a feel good moment for her",
            "we’re all Nikas",
            "What's better than one drum of liberation?",
            "I love how Warcury just knocked the Iron Giant onto a bunch of Marines with no concern for their safety lol\n\nWarcury: \"Eh fuck 'em\"",
            "Edison :(",
            "Nikas in Egghead",
            "Imu-sama …\n\nThere’s been a second Nika.",
            "TWOOO NIKAAAAAS",
            "Saturn effectively gave the daughter of a Revolutionary Army leader (or I guess two of them) a Devil Fruit which ended up turning her into a clone of their greatest enemy. I don't care how senior you are. That's a mistake that gets people fired.\n\n\nAnd he had the audacity to call it a bad fruit, even though it's being used to completely solo Vice Admirals. And giant machines, who can apparently age now? Too bad that was only found out after the Iron Giant submerged...",
            "I don't know where people are getting the idea that Luffy can turn anyone into Nika. It's clear that this is a specific case for Bonney's fruit and a temporary ability. She can transform because of her fruits abilities, not because Luffy can make anyone Nika. I suppose that could change, but there would still have to be context for it.",
            "Sometimes you gotta pop out and show Nikas",
            "#BONNEY'S POWERS ARE ABSOLUTELY BUSTED LMFAO",
            "Prepare for trouble! And make it double!\n\nTo protect the world from devastation! \n\nTo unite all peoples within our nation! \n\nTo denounce the evils of truth and love! \n\nTo extend our reach to the stars above! \n\nNika 1! \n\nNika 2! \n\nTeam Joyboy blasts off at the speed of light, \n\nSurrender now, or prepare to fight",
            "That panel of Bonney and Luffy really put a smile on my face.  She finally not only gets to see the source of Kuma's faith and hope but becomes it in at least a small way.\n\nI really want the Marines to find out that the monsters they are seeing that have no regard for them are the Elders.  That could be an interesting storyline, and its one that I feel like Oda is trying to set up.\n\nOne random thought I had too is that this arc is turning out to be a great training arc for Gear 5.  He's had to go in and out of G5, fight, take multiple hits, and refuel multiple times.  He's pulling new moves out of nowhere, learning to conserve and refill his stamina and also finding out what his awakening can actually do.  I would not be surprised that if in Elbaf, he's essentially mastered G5.",
            "Bonney's fruit is even more busted than previously thought. The Elders are going to get PTSD by the end of this arc.",
            "kizaru has been laying down for how long now?",
            "Are those ships at the end bouncing in water ????\n\n\nIf Luffy can turn the Sea into rubber, i'll freaking lose my mind.",
            "I think the bird is gonna get knocked in the water and just fly out of it revealing that his powers are, in fact, not from a devil fruit.",
            "Bonnie and Luffy have such big sibling vibes. It's like Luffy is her big brother. I mean, they both have the same appetite and powers that rely on imagination.",
            "The Robot is that kind of employee who starts working as soon as it hears the boss's voice.\n\nYeah it does need to apologise!",
            "DOLL IS DOLL SIZED! SO CUTE. And lmao Sanji simp mode is funny when done right (poor Usopp). And apparently it's contagious! The Giant Robo activated Simp mode... R63 Nika too OP.  Great chapter.",
            "Sometimes you gotta pop out and show Nikas",
            "As much as I trust the Strawhats, I'm thinking I'd much rather be Atlas right now than Lilith...\n\n* Atlas - Sitting on a Giant ship out to sea with two Nikas, Sanji, Franky, Kuma, and the entire legendary crew of giant warrior pirates themselves with only *one* flying Elder...\n\n* Lilith - Still sitting on the island *(why has the Sunny not launched yet??)* with Zoro, Jinbe, Nami, Robin, Chopper, Brook and Usopp and ALL the other Elders are coming at you.\n\nAlso does this mean Edison's confirmed dead, or did he just 'disconnect' from Punk Records for some reason, maybe to sneaky escape?",
            "At this rate the Grand Fleet should have a buffet division, to feed Luffy mid battle and keep him peak form.",
            "Kuma lived his whole life as a slave just so Bonney could envision a life where she is free",
            "I love the fact that Bonney is finally free from her trauma, and when she did, she became Nika herself, a warrior of liberation, just like her father, the selfless pacifist.",
            "A thought crossed my mind this chapter, though it might have already been posited before, I don't read all the theories. \n\nIf Joy Boy was the first pirate, that means he had a crew. Seeing how much the story is about parallels, it wouldn't be unlikely for Joy Boy's pirate crew to mirror Luffy's. \n\nThis chapter confirms that the giant is a thinking being with what seems to be individuality. What if he was Franky's equivalent in Joy Boy's crew ? Someone who has gone full machine with the help of the advanced Void Century tech, allowing him to survive on low power mode until today.",
            "The best thing about all of this, imho, is that the Gorosei are absolutely, 100% at fault for everything that's going down right now. It's a fuck up of epic proportions on their side, and i hope Imu knows that and is going to give them a piece of their mind.",
            "I was wondering when we would get to see Bonney use the Nika form, and I was starting to lose hope to see it in egghead.\n\nNice to see her do it. \n\nShe started to lose [faith](https://scans-hot.leanbox.us/manga/One-Piece/1103-009.png), but got to see the [real thing](https://scans-hot.leanbox.us/manga/One-Piece/1106-011.png), and had no more [doubts because of it.](https://scans-hot.leanbox.us/manga/One-Piece/1107-009.png)\n\nShe knows Nika is *real*, so just like how she could use rubber power, she can also become like Nika.",
            "Get Bon Clay here so we can get 3 Nikas!",
            "A second Joy Boy has hit the Gorosei",
            "Idk what took longer, Yamato leaving the Capital, or The message ending.\n\nEdit: The ship is still getting chased, even if they sail away, Bird Elder can just fly to them, and attack non-stop.",
            "Right, so I see some folks here thinking Edison is dead already...however, York is only basing her claim on those currently still interfacing with the Punk Records, which we know from her own actions can be halted voluntarily\n\nSo don't mourn him yet, get hype for what the little guy is scheming",
            "In hindsight I wonder if Saturn sees Bonney's fruit as useless because he and the rest of the Gorosei view themselves as Gods so why would they imagine being anything else?",
            "[Oh my god, I actually called it!](https://www.reddit.com/r/OnePiece/comments/18s55uz/comment/kf5cpy7/?utm_source=share&utm_medium=mweb3x&utm_name=mweb3xcss&utm_term=1&utm_content=share_button)\n\n\nAlso, all those poor marines below the rank of Vice Admiral are gonna die for having seen the Gorosei's demon forms, and Luffy's going to be blamed for killing Vegapunk *and* for that massacre.",
            "I must see doubles! FOUR NIKAS??",
            "why doesn't luffy simply just stick his ass out and twerk into the water while in G5 to propel the ship? should the clapping of his cheeks not provide enough force?",
            "It's gonna be hilarious when the Iron Giant starts broadcasting from underwater so the Gorosei can't do shit about it.",
            "I was joyfully smiling ear to ear at that Nika panel, until Oda just sucker punched me with that Kuma panel, leaving me drowning in my own pool of tears.",
            "I can't believe Franky hasn't hit the pirate button and blown up Egghead yet.",
            "Good grief now there's two of them.",
            "\"This is getting out of hand!\n\nNow there are TWO of them!!\"",
            "The contrast between Yamato's quaint outing and everything happening on Egghead",
            "Let's just a take a moment to appreciate Luffy's intuition, knowing that Bonney could use her power to imitate him even at that level. He only saw her mimic him once and immediately started coaching her. His ability to see potential is amazing.",
            "Bonney's connection to Luffy through their fathers being comrades, their interactions this arc and the fact that she's learnt to use her power to replicate Nika makes her feel like Luffy's cousin.",
            "Bonney can theoretically replicate any zoan transformation if she fully believes in it. Such a busted devil fruit in the hands of a 12 year old who has boundless imagination yeah, Saturn sold his side so badly it's baffling how much this guy has set up their demise.",
            "Bonney's future imagination of freedom **=** Luffy's present free reality.",
            "So are we ever gonna find out who gave Luffy that food when he was fighting Kizaru or...",
            "\"Protect the little people!\"",
            "***Everything that humans can imagine... Is a possibility in reality*** \n\n\n\\- Physicist Willy Gallon",
            "I firmly believe that Nika is the origin of all Devil Fruits, and that Joyboy's ability to bring whatever he imagined to reality (sortof) ended up being manifested into the devil fruits after his death. The Devil Fruit Encyclopedia was probably made by World Government so they could track down, record, and counter any devil fruit they came across reminiscent of Nika's powers during the Void Century, only leaving out the Gomu Gomu No Mi specifically so readers who would pursue the devil fruits would never know or go after the Gomu Gomu No Mi.\n\nThe only common factor that actually ties them together to their origin with Nika isn't exactly the \"rejection by Nature\" stated by Vegapunk, but from the fact that he couldn't swim due to his body being rubber, the only thing that translated into every devil fruit.\n\nTwo examples off the top of my head would be Bonney and Kaido's DFs, Bonney's is pretty explanatory as we see as she is capable of replicating rubber attacks. But with Kaido, there's really only one hint... how he moves. Very specifically, when he imitates Jet Culverin, just like how he states that rubber shouldn't be able to work in the way Luffy uses it, a body like that can't make such sharp movements identical to rubber.\n\nTransforming the body, affecting the environment, and the only limit is their own imagination? What greater turmoil would such power unleashed on the world for anyone to use be?  What greater threat to the divine presence of the Imu, the Gorosei, the Celestial Dragons, and the World Government, than an entire people with powers like Nika? And what better name to give a food that threatens the heavens, than the ***Devil Fruit?***",
            "I'm hoping Saint Marcus Mars gets knocked out of the sky by Usopp, aiming the Thousand Sunny to Coup de Burst and snipe him out of the sky.",
            "Imagine Imu's face when the elders tell him there's two joyboys now",
            "So first Zunesha and now the robot. Were all of nika's allies turned into weird giant things?",
            "    await giant.on_boot.say(\"Nika is here.\")",
            "Robot : I want to meet you nika\n\nLuffy : bro meet the whole gang",
            "The whole point of Nika is that he brings freedom and joy to others. He’s encouraged Bonney to embrace freedom, and her power allows her to take the shape of “herself from a possible future.” She imagined a future where she was as free as Nika, so now she looks like Nika. Doesn’t mean she’ll have rubber abilities or be able to “copy” Luffy in fighting style or anything; she’s effectively just a giant. She’s just learning to embrace true freedom, and that’s what One Piece is all about.",
            "Oda: Powerscalers hate this one trick",
            "Lmao a guy who doesn't even know what's going on and a 12 year old girl are giving the World Government the biggest headache they had in centuries\n\nHell of a coincidence that two kids of Revolutionary founders became Nika though. Come on, Iva, show us your secret kid that can also transform into Nika",
            "I don't GIVE A SINGLE F. BONNEY for NAKAMA. SHE IS THE GOAT!",
            "Honestly the biggest surprise of this chapter was Luffy remembering Oimo and Kashi's names. He didn't even call Dorry and Brogy by their names when they reunited.",
            "Mannn was not expecting bonney to jump in power like this! Question is if she can mimic everything else g5 can do. She doesn’t have the haki for it for one",
            "Nika Luffy: Can bend space.\n\nNika Bonney: Can bend time?",
            "I'm more interested in the backstory of the iron giant than anything else right now. Seems like its sentient",
            "Interesting to see where in the previous chapters Bonney said give me a Nika-ish future, she doesn’t turn into it but when she said give me a future when I’m the “most free”, she transforms into Nika.",
            "Entire One Piece universe becoming Nika through Bonney's awakened DF slowly turning into reality just like when Naruto coated the alliance with 9 tails chakra lol",
            "damn joy boy/nika is so fuckin inspiring of an aura\n\nsome true hope of deliverance from the darkness that surrounds us",
            "We gon talk about the iron giant at the end?? WE NOT DONE YET BABY",
            "The amount of brainrot theories we're gonna get out of this chapter",
            "I completely forgot Bonney had supreme control over the seraphim. So now we basically have a Nika that also controls the governments greatest weapons. The elders really fucked up messing with the Kuma family.",
            "I like the Bonney transformation, honestly I thought it would be further in the series but we’re also in the endgame things need to happen. \n\nHaving her achieve her fathers dream of liberation by being inspired by Luffy is a cool character culmination. After this her bounty is going to be insane.",
            "For like a decade people were saying Bonney is the weakest supernova but I kept saying wait for her arc, shonen progression is always real. Urouge up next too.",
            "Im starting to believe Ju. Peter is the \"Useless Captain Mid\" of the Gorosei",
            "Seems vegapunk now is officially female only",
            "The end to this chapter looks like the kind of wild theories you see online and think, \"yeah that's never gonna happen\".",
            "So... Her power is the power of self-gaslighting \n\n  \nBonny is the true monster of this show!",
            "We're about to see the greatest combo attack by Luffy and Bonney together on that dumb elder Pterodactyl!",
            "Vegapunk: And their name was JOHN D. CENA!!!\n\n\"The Time is Now\" starts playing furiously underwater, causing massive earthquakes followed by the sea beginning to rise further*",
            "Seeing Luffy act like the cool older brother, first with Momo and now with Bonney\nI'm gonna cry 😭",
            "Bonney's awakening her fruit where she can distort everyone's future to one where they are most free. Gorosei's worst nightmare.\n\nWhat an incredible fruit. Up there with Ope Ope No Mii. Top 5 Devil Fruit.",
            "I'm starting to wonder what's wrong with Bonney's DF at this point.\n\nI mean, her ability looks a lot like what Vegapunk described to be the essence of what a devil fruit is in the first place : she can become any kind of alternative future reality humans may think about.\n\nShe could go \"give me a dragonish future\" and turn into Kaido's form for example.\n\nIn a sense, her power looks like the essence of devil fruits in general, which could explain why Saturn was trying to recreate this power in particular. It looks broken af, even more so than any fruit we've seen so far.\n\nIt is possible that her fruit is more important than what we may have thought.",
            "You know that meme with the like 60's housewife that usually 2 panels? \n\nPanel 1 her face \"the . . .\" \n\nPanel 2 zooms in \". . . what!?\"\n\nYeah that Marcus Mars big bird ass when he saw TWO NIKAs.",
            "[the gorosei now](https://youtu.be/lD_ag67tH3I?si=TJdLm-LC7m6TiYfh)",
            "Yamato just like me, starts the trip and immediately eats the supplies. lol",
            "I must be drunk, 4 Nikas!",
            "NO BREAK NEXT WEEK?",
            "This chapter honestly makes me think how strong and how important urouge will be in the story. Since he’s the last supernova Luffy hasn’t met them in the story.",
            "I'm a fan of those marines who are just confused about a giant boar. Priorities I guess.",
            "*Squidward voice* There's TWO of them!?",
            "*Luffy after seeing Bonney transform*\n\n“My Nika”",
            "[Imu and the Elders right now](https://m.youtube.com/watch?v=VcwE29vN-Ik&pp=ygUcc3F1aWR3YXJkIHRoZXJlJ3MgMiBvZiB0aGVtIA%3D%3D)",
            "Waaaaaait did Luffy turn the ocean bouncy?",
            "Beyond ironic that these elders have tried there best to keep everything secret and stop nika from even becoming a thing twice.. and now they’ve fucked uo twice , made 2 of them and one of the major secrets it out to the world.",
            "I like how it never seems random who gets which devil fruit power.\n\nEvery DF user seems to get the power he/she wants or needs. At least I can‘t think of a real exception.\n\nIt‘s like the DFs choose their user.\n\nAlso, has there ever been mentioned a DF user who actually drowned? I have the feeling they repel death by drowning pretty well.",
            "Instead of Vegapunk telling us, I wonder if Oda just showed us what he was going to say.\n\nThat there was another Nika",
            "Holy Moley, I'm so filled with questions right now, yes, I had this possibility at the back of my mind for a while now when we got an explanation of how Bonney's powers worked, but how did Luffy know Bonney could do this?\n\nAlso, Oda will literally give random characters Nika powers and not get Dragon up for some tiny action lmao.",
            "*Elder after seeing Two Nikas*\n\n“Well Shit.....”",
            "just crossed my mind, Robin probably knows about Nika right? how come she never mentions to Luffy about it?",
            "I swear that boar scares me more than it should have",
            "Straw hats will learn Bonney’s true age after this transformation. Bet she gets hit with a recoil just like everyone else & their ultimate moves. Seemed like she was forced to transform back to her true age after distorted giant.",
            "I'm honestly still curious if Bonnie will be able to use G5 powers , all hear distortion so far changed only her body. I'm fine either way but it's possible she  can only mimick the body",
            "Totally something that I was expecting to see happen...\n\nRemembering Bonney is still in her early teens... How far has she got to go!",
            "Wait, Vegapunk said \"Among you there is - and their name was\"\n\nIt's interesting that he went from present tense to past sense  right? He's got to be referencing Imu.\n\nOr am I overanalyzing? The official translation has last week's message as \"within you there is\" so it doesn't seem to be a translation issue unless it's just this week.",
            "It's a small moment, but I love Kuma looking on and remembering his promise to Ginny, to \"raise Bonney well.\" Looking on, seeing her turn into the liberator Nika the symbol of freedom, originally being the orphaned child of a slave who was tormented to death by her oppressors is beautiful. I literally don't understand how people don't like this, especially as the limitless potential of her devil fruit has been showcased and hinted at several times now.\n\nAlso the \"countdown\" of Vegapunks feels very death-flaggy. I'd be shocked if both the Satellites survived. I think only one will make it out, and it'll be their trump to countering York on the WG's side. I bet it'll be Lilith, considering she's the one we met first and has the most rapport with the crew - but I could see it potentially being Atlas!",
            "The giants dancing to the beat of the drums of liberation, Kuma seeing her child grow up to emmulate their god, the embodiment of freedom, this chapter warmed my heart :)",
            "I feel kinda sad now.\n\nSeeing 2 Nikas.\n\nI'm going to have to wait so long to see this animated. \n\nIt's going to be so damn adorable watching the both of them fight the bad guys in Nika form!!!!!!\n\nBonney MUST get revenge. She MUST punch a hole in at least 1 Gorosei!",
            "Bonney's distorted future being able to tap into Nika powers implies that theres a potential future where EVERYONE could be Nika-ish in some way. The callback to Luffy explaining that this form is simply him when he's most free was very intentional. There's also Tonjit's explanation of how Long Ring Long Land works, with the creatures naturally stretching (as well as Chopper and Usopp in a goofy scene).\n\nI had been throwing around the idea in my head that Luffy will eventually be able to grant that level of freedom to other people for a few weeks now, and I believe it fully now. I think that by the end we are going to see all of the Straw Hats in a \"Nika-ish\" form and that its actually the form humanity was always supposed to have before some unknown event with the void century and the world government.\n\nI can foresee Luffy doing something like  (Naruto Ending and Black Clover Manga Spoilers)>!How Naruto shares his Chakra with all of his friends or how Asta in Black Clover grants the Black Bulls Anti-Magic Power!<.",
            "My theory from 5 months ago / Chapter 1103:\n\n> So when Bonney sees Luffy as G5/Nika, she'd be able to transform into a more whole version and Saturn might end up fighting two Nikas at once?\n\nKinda right! Wasn't expecting all the Gorosei to show up.",
            "Crazy prediction but I think Bonney’s ability will play a big role in the final battle. I think she will give all the strawhats a “truly free future” and that we will see what each of them are like with the freedom of Nika-like powers.\n\n-Nami just grabs clouds and changes the weather on a whim\n\n-Franky builds super fighting robots out of whatever junk instantly \n\n-Zoro surpasses asura and reaches thousands of swords at once\n\n-and every lie Usopp tells us the truth, “YES THAT HAMMER IS 4 TONS”",
            "If Bonney got this much of a plot and especially stat boost this late in the story, I can’t even imagine Urouge who will be the last supernova to meet the strawhats. \n\nWatch him be Imu’s younger brother or something.",
            "Did Luffy turn the entire ocean into rubber? Can he do that?",
            "It's funny to think how they're using their burning ship as campfire while dancing to the beat.",
            "So boney if she imagines the future can get Kaido, BM or whitebeard.'s devil fruit. That's nuts.",
            "The giants are having a blast unlike the Elders.",
            "200 years ago the ancient robot went on a rampage on mariejoa, it must have sensed joyboy there then?",
            "Saturn \" I fucked up \"\n\nas luffy and bonney turn him into a vollyball and spike him into the sea",
            "That little Ginny reference on the last page really got me again.\n\nDamn, I wonder how it will turn out for Kuma. I take Vegapunks death if it means that Kuma survives. He will be quite the asset in the end and I want Bonney and Kuma to really reunite somehow.",
            "I predict luffy and Bonney will punch mars to the water and the giant robot will prevent mars from escaping and drag along down to the ocean floor",
            "GOT MY NIKAS IN EGGHEAD",
            "Yeah, I think now im sure Luffy's dream is getting everyone to the sea and/or becomes a pirate and be free.\n\nBetween the raising seas and Bonny getting Nika. It seems the main theme is spreading liberation.",
            "2 Nikas > 1 Nika",
            "Bonney and Luffy in the next chapter: https://youtu.be/4DO7eQGSvqE?si=cB7X9R_179d89u3c",
            "Just like that, Bonney's smiling after Luffy convinced her to transform into Nika.\n\nJoyboy actually made her smile.",
            "Seeing bonney also pull out gear 5, I am 100% on board with her joining the crew as cabinkid",
            "Prepare for trouble... and make it double Nika",
            "I’m seeing double. Four Nikas",
            "Edison is probably still alive.   Looking back at 1115 and 1116 his antennae are are broken so he likely cannot sync to Punk Records.",
            "So does this mean giants can hear the Drums like Zunesha",
            "I feel like most people's problem with this is they think Bonney is super strong now when let's be real her form is gonna wear off in like a chapter or 2",
            "Bonney has the \"Elden Elden Fruit: Model Mimic Tear\".",
            "Party on Elbaf gonna be wild",
            "Wait isn’t Edison alive?",
            "Every1: Oda stop surprising us\n\nOda: there are (at least) 2 Nikas",
            "What's wrong with Warcury? Was he always that huge? It seems like he gets bigger in every chapter!",
            "And their name was.... JOHN CENA!!!",
            "I do not understand the hate for Bonney this chapter. The Nika thing was set up chapters ago and I don't see how you could see this and not find it heartwarming. Bonney is a CHILD who has gone through hell and back, as well as witnessed her own father's trauma. When all seemed lost, her hero shows up and saves her. And then she gets the chance to be like her hero and fight beside him. \n\n\nLike imagine if this was about some kid who got to meet Superman and was given a limited time, once in a lifetime chance to be like Superman for one fight against Lex Luthor or Brainiac. Same thing here. \n\n\nAnyone taking this as a powerscaling exercise is way off base and should take a step back and remember what series we are reading. Obviously Bonney isn't going to have the full power Luffy does, but she can at least live the dream. I'm really pumped for the next chapter. ",
            "What makes Bonney's transformation more amazing is that Luffy is the one who told her she can do it, His ridicules imagination even exceeds the ones of a 12 years old girl.",
            "Oh man what Oda's come up with for Kuma and Bonney is outrageous!! For 15 years Kuma was the most menacing warlord and Bonney was the least relevant supernova, but in 20 chapters they're both two of the most compelling characters in the whole story. I'm so blown away. Bonney is the only character in the entire godaverse that can match Luffy's powers and what a payoff that is.The little Kuma panel!!",
            "The gorosei's actions resulted in the creation of TWO sun gods. Isn't that just beautiful?",
            "I am really enjoying seeing how silly and jovial the Giants are, like Luffy. As soon as they hear his drum-like heartbeat they burst into dance in the middle of battle lol",
            "Mars about to get jumped by Nikas 😈",
            "Well it’s not called Ichi(1)-ka…\n\nIt’s NI-KA!\n\n\n\n…I won’t be showing myself out",
            "So someone with Bonney's fruit turned to Nika 200 years ago and that's why the Robot attacked Marygeoise ?",
            "Maybe the real treasure was the nikas we found along the way..",
            "[I knew it](https://www.reddit.com/r/OnePiece/comments/18s55uz/comment/kf5de6a/?utm_source=share&utm_medium=web3x&utm_name=web3xcss&utm_term=1&utm_content=share_button)!!! \n\n6 months ago I said that we would get 2 nikas.\n\n>So are we going to get a fight between 2 nikas vs 1 elder?\n\n>For what I understood Boney's power works better if she believes harder on whatever future she wants to transform right?\n\n>So if she actually sees Nika she could transform into a better version of her Nika distorted future right?",
            "I fucking love this arc, holy shit.\n\nThe giants are so great. Elbaf is gonna be *mad* fun. \n\nWe kinda figured people were gonna blame Luffy for it since nobody knows about the Elders forms outside the island atm....until my man Morgan's has the best day of his media producing life.\n\nAND BONNEY'S FRUIT IS SO OP. Please, please, please let her slap the shit out of that spider bastard for everything Kuma went through. It would be the most cathartic way to end the arc as they escape. \n\nAnd this might be why they fear anyone that can awaken Nika, al la Joy Boy so much. He inspires others to chase their dreams and freedom and hopefully beat the shit out of these demon assholes.",
            "Luffy inspires Bonney to realize there is a future where she can be free. Not to get too religious, but he is what she believes in and that is giving her strength. Between the hope Luffy brings people throughout the series and the passive benefits of his ability to make things rubbery/cartoony around him, HELL YEAH, GO GET 'EM!!!",
            "Little Doll and little Bluegrass are very cute, but even cuter is the Sea Giraffe.",
            "So Bonney's fruits limits really just entirely depend on whether the user is a pessimist or an optimist.",
            "My takeaways are that the iron giant is definitely going to save them and that the limiter for Bonney is probably going to be haki, which we know is the truest form of power in OP. But, then again, who knows with her fruit..",
            "My only complaint is that Luffy and Bonney are probably going to attack Mars first thing next chapter. Really want Saturn to take the blow since this is entirely his fault.",
            "Wow. This arc has been wild.",
            "Bonney will either imagine a future where she can permanently hurt the elders or the robot is taking that bird into the sea",
            "I've got a feeling Bonney's going to be able to do the stretching/effects on environment, but she won't be able to do anything because she doesn't have the haki to actually make it count. So she'll help Luffy in the gags, but he'll be doing the damage.",
            "Edison should be still alive with Stussy I hope they plot something to kick York's ass",
            "Nika's in Egghead",
            "Ive seen the degrading discourse on the latest chapter, and how people feel that nika is being disrespected and brought down to not being something special. I think thats the point. Here's my thoughts and reading of it.\n\nThematically this chapter is perfect cause it shatters the \"luffy is a chosen one\" narrative. In my reading, this is a visual representation of how all of us and everyone in the OP world has it in us to be nikas. To be warriors of liberation. Just cause luffy has the fruit doesnt make him any more special than anyone else. He just happens to be freedom and the striving for freedom personified, and in philosophical terms this chapter signifies bonneys journey from childish romanticism to existentialist freedom. She goes from losing her innocence and being unable to transform as saturn brings her down from romantic innocence and transcendance to grim reality. In this chapter, shes spiralling towards nihilism, believing theres no point and she cannot be free, she cannot be nika. Luffy is a nietzsche-esque figure bringing the proclamation that \"life is meaningless, Rejoice!\" . In other words, hes informing her that there is nothing essential about being free. Its not a matter of whether you can or cannot do it. Everyone is and always has been free to make their own meaning and decide for themselves who and what they are. All core ideas of existentialism.\n\nShe decides and is responsible for herself. If she wants to be nika, the embodiment of freedom, then she can. Her life and meaning is what she wants to make of it.",
            "The state of One Piece fans.\n\n\n\n\n• This chapter is so bad, I could die!!!.\n\n\n\n\n• This chapter is so good; I could die!!!.\n\n\n\n\nMeanwhile, Oda: Lmao. \n\nThe real One Piece is the money I made along the way.",
            "Well Im just hyped about the story getting the stakes higher and higher.\n\n\nSad that many fellow Fans are disliking the direction of the story.\n\n\nFrom my part I'm happy for Bonnie to be able to obtain freedom(in all the sense of the word) againts all odds I wonder if she could transform others in that way like herself.\n\n\nVery divisive chapter.",
            "Bonney should watch some DBZ and make herself a Gokuish future lmao",
            "Pure speculation here, but this is the kind of shit that makes the robot going on a rampage 200 years ago make all the sense in the world. When there was supposedly no one who had awakened the Nika fruit since the void century, maybe it was a slave in Mary Geoise who was fed the Age-Age fruit that was capable of imagining a future where they were \"the most free\", turning them into a possible version of Joy Boy and activating the robot who then began to climb the red line. Just a thought... 👁",
            "I believe that Luffy will spread FREEDOM like a disease now. First he set countries free. Now it looks like he is going to set individuals FREE.",
            "I think Oda wishes for a world where his daughter can be as free as Luffy.   \nAnd just that thought is enough to make me cry..",
            "man fuck the narratives I want Yamato and Bonney and Lilith on the crew. so many awesome moments",
            "the robot saying 'how strange' to the joy boy's presence disappearing makes me think that Joy Boy from 800 years ago could constantly maintain gear 5",
            "This chapter made me re-read about Boneys ability...\n\nOdas kinda clever that he made Boney a kid.. This DFs power can only be fully realised by a kid who has imagination and believe it or someone like Luffy who is kinda childish in his own way...\n\nAs and when the user grows, this fruit can be limited to what the user can imagine without doubts.....\n\n\nBut I still feel a bit odd tho...... \n\nLet's see what happens... Next week I'll try not to read any spoilers....",
            "It didnt botter me. There are plenty of DFs who are OP as hell. I mean, look at Boa DF, she almost KOed a good part of an Younkou crew in one fell sweep just on the basis of how powerfull her DF was.\n\nSugar... has basicly a One Shot KO DF. \n\nLuffy is not just his Nika powers, his haki is not only massive but he probably one of the best users in the world, having dominated advance forms of all 3 types of haki. \n\nBonney is gonna be powerfull as Nika, but not as nearly as powerfull as Luffy. Like logias are insanely powerfull, but just because someone is a logia, dosent suddenly make them on Aokiji, Aikanu or Kizaru level. Those are two separe things.",
            "Bonney getting a Nika form was not expected but she certainly deserves it after what's she has been through.",
            "A 12 year old girl who was born the child of rape, raised in captivity, watched her father get stripped of his humanity trying to save her from a terminal illness, and then is marked for death by literal fucking demons gets to experience true hope and joy for the first time in her life, and the fandom bitches about it.",
            "This is getting out of hand, now there are TWO of them!",
            "Bonney's fruit actually being OP makes sense when you remember she is literally a 12 year old child who dreamed about Nika for most of her life.\n\nBelief, creativity, and dreams can strengthen a devil fruit user. We've seen it time and time again. Naturally, a child will excel in those areas more than an adult. Luffy was able to bring his \"Gomu\" powers to their literal limit and beyond due to his childlike imagination.\n\nThat Luffy was the one who helped push Bonney to become like Nika just brings a tear to my eyes.",
            "Bonney is totally gonna join the straw hats as an apprentice.  Shanks copied Roger’s fighting style and now Bonney will be able to fight like Luffy.",
            "Everybody's acting like Bonney transforming into Nika means she'll be able to keep that form for just as long as Luffy, that she'll be as strong as Luffy and will have all the abilities that Luffy has. We don't know any of that yet. Most likely, she's not going to be all that strong compared to Luffy. It's a symbolic thing I feel, with her finally being free like Nika is. Luffy will do most of the fighting and she'll be a support while getting to fulfill her dream to be like Nika. Y'all who think we have a 6th yonko need to fucking relax.",
            "Drums of Liberation❌\nOrchestra of Liberation✅",
            "So Bonney's ability is OP as hell if it can mimic Gear 5.",
            "Man these chapters go by so quickly",
            "A Giant burning to death.\n\nSanji : i owe you one.",
            "Mr. President, a second Nika has just hit Egghead.",
            "Banger.",
            "Kuma must be so proud of his girl :’) beautiful chapter.",
            "Vegapunk will not let the government cover up his death & turn luffy into a villian. Was hoping Nika Bonney would require her to revert back to her actual age. Still, design is great. Was Luffy, Kuma size when he got on the ship or was that just oda making luffy big. Sanji looks so small. Seems like we are going to get the livestream. Only way everyone gets away is if Imu pulls the elders back during a livestream.",
            "So glad the Iron Giant isn't useless.. and hopefully the broadcast will resume. \n\nWhy a video vegapunk.. show something besides your face.\n\nThe dozens of theorists saying it was a live broadcast, in denial of everything.. are put to easy I hope.",
            "Luffy and the Giants got off the island.  LET’S GO!!!  Now we just have to deal with getting rid of yet another plot excuse for Team Sunny to not get off the island.  Nami, Usopp, Chopper, and Robin haven’t done anything except plan their escape this Arc.",
            "What caused that seaquake? Was it really Luffy when going gear 5?\n\n\nAlso, Gorosei \"sensing something is amiss\" seems to be about the iron giant rather than there being two Nika's.",
            "I knew Luffy would turn the sea to rubber one day",
            "Edison is still alive too. He might make it out of this unnoticed. 2 Joyboys running around is kinda nuts",
            "Luffy isnt a joy boy, his fruit is. By the end of the series he himself will become a joyboy, not his fruit",
            "Also, this chapter confirms that the Gorosei are absolutely not getting rid of York. They need her and Punk Records. The Robot could end up destroying the whole island though.\n\nLilith is in serious danger, though, since Atlas is safe now. I always thought only one allied Vegapunk would survive, so my bet now is that Nusjuro will be successful in killing Lilith. Rob Lucci could also sneak around the Sunny and do it.",
            "Mars bro is fucked.",
            "Let's Fucking Go, Bonney! Tag team Gear 5 ass whooping coming, just wish it was that shithead spider about to get demolished",
            "The Gorosei are surely about to get serious here now that there's literally 2 Nikas",
            "Luffys powers can affect the sea???",
            "How many of you thought that girl eating pizza at Sabaody Archipelago would be this impactful, even when she was introduced as a Supernova?  Let's not forget she has command over the Pacifista Army as well.",
            "I think Oda initially considered giving Luffy an ability based on imagination. However, since Luffy was established as having a Devil Fruit that grants elasticity, such an ability might feel redundant. It would overshadow the core concept of his rubber powers. This is where Bonney comes in – her power revolves around manipulating reality based on her imagination. \n\n\nThis opens the door for even more bizarre and unexpected scenarios during fights. \n\n\nImagine Luffy using Kaido as a jumping rope during the fight!\n\n\nBonney might imagine weirder than that.",
            "Now give me 2 bajrang gun",
            "Is Edison dead dead? Like I last saw him letting Stussy go...",
            "Nikas in Egghead by E. Oda\n\nfeaturing Jay-Zebec und Kanye West Blue",
            "Man Urouge doesn’t deserve all this pressure. Last supernova left, I hope he delivers",
            "Things are getting out of hand…\n\n#Now there are TWO of them!!",
            "Luffy to Bonney: \"What's up my nika?\"",
            "People who say Bonney’s transformation undermines Luffy’s transformation are entirely missing the point.\n\nBonney did not just easily achieve this in a short time when it took Luffy years to achieve it. She couldn’t have achieved the transformation in the first place if it weren’t for Luffy. He is the one who inspired her to become the most free version of herself. This is more Luffy’s achievement than it is Bonney’s.\n\nIn a sense, Bonney’s transformation is an advancement of Luffy’s transformation.",
            "Naturally, it's a nika bargain sale",
            "The Drum of Liberation\n\nSomething i talked about with a couple of friends is that this is the peak of Luffy it's ultimate freedom and the ability to inspire others to be free. It's what makes him so dangerous as it is the power to help peolpe follow their dreams thus ignoring the oppression of the government and other dastardly forces.",
            "Luffy turning the water into rubber so the sunny can land safely",
            "I'm a Nika, he's a Nika, she's a Nika... We're all Nikas.",
            "Some random guy in skyrim guard voice: \"may be I am Nika, I just don't know it yet.\"",
            "Exactly",
            "How are you able to tell? Is there an announcement at the end of the chapter if, say, there is a break? Sorry I am new to this.",
            "3 in a row (this was 2 of 3) and then break then 3 more. So 6 out of 7 weeks we get a chapter. The most chapters that close for the rest of the year.",
            "Lmao the followup to One Piece is just another 100 year battle between the two for the King of the Giant Dance Pirates",
            "Of course, since we know it's clearly Dorry.",
            "Just a chonky boar",
            "The marines have now seen a giant boar, bird monster, spider, a horse cutting up the pacifistas, a giant robot, a gargantuan ship, two nikas and more. Wonder what would happen to the average marine after all of this is over…",
            "Can't stop the TOP!!",
            "I'm pretty entertained by the fact that Oda hasn't actually drawn Warcury \"running\" really so you just get the impression that he's vrooming and drifting at 100mph like he's got rockets instead of legs.",
            "Absolute unit",
            "Oh that’s what that was?",
            "Had me thinking Blackbeard was going to make a surprise appearance, was a great show how strong his  awakening is time and time again.",
            "Oh so that's what happened, I didn't get it at first",
            "Leo later : \"But Isn't Imu a good guy?\" \n\nWell, there is a reason why their entire race was enslaved by the donquixote before the void century.",
            "He's like Chopper kinda",
            "I would have had trouble believing she would even be this relevant",
            "It already seemed broken as hell there. Turning the people around you into toddlers incapable of fighting without having to touch them especially since we didn't know haki could defend against devil fruits.",
            "That's Oda for you. He went from coming up with a fruit that could grant enteral life to a fruit that allows you to pretty much mimic anyone's powers.",
            "That actually doesn't sound that unbelievable. Age manipulation is already kinda busted.",
            "Honestly I had high hopes for guys like Hawkins and Drake( Urouge still hasn’t had an arc) and didn’t even bother with Bege and Bonney…\n\nAnd now I love the Castle castle fruit and I want Bonney to stay with the crew XD",
            "Such is the power of actually having a fleshed out and good backstory. You need a powerful past for a powerful DISTORTED FUTURE.",
            "He also tried to make her lose faith in Nika, to make sure she couldn't even think about using his powers anymore.",
            "I've said it before, but feeding people you have tortured like Bonney and the Gorgon Sisters Devil Fruits is like beating someone up really badly, then deciding to give them a gun immediately after. Unless you were sure it was like the Jacket Jacket Fruit or the Dachshund or Axolotl Fruits, why would you do it?",
            "even without the distorted future ability. manipulating age is still broken.",
            "Now I am starting to think these elders are quite stupid. Looks like they did not know the full extend of each devil fruit and assumed it superficially. So much for being an “elder” hahahaha",
            "Ya I hate fans getting so upset over this. This is a pretty epic moment. It really solidifies how powerful Nika is with inspiration. He inspired her to join him.",
            "Edison is damaged, that might be why he can't currently connect, or doesn't appear to York. \n\nMaybe.\n\nHopefully.",
            "I still have hope :(",
            "There's still hope. York can't tell who's dead, just who's still connected to Punk Records. If Edison stopped communicating with PR, accidentally or on purpose, he could still be alive.",
            "At least he made Stussy realize that she's a real human and decide to live her life on her own.",
            "FUUUUUSSSSIOONNNNNN . . . .",
            "Five Elders: What could be worse than a giant ~~paint bubble~~ Nika?  \nLuffy: I know, two giant Nikas!",
            "They BOTH eat the mother flame after cutting it in half with a knife and plate like a Bugs Bunny sketch",
            "This is getting out of hand! Now there are two of them!",
            "Yeyy for Usoop",
            "I can't wait for Elbaf. The giants are gonna be an absolute blast.",
            "LMFAO what a throwback",
            "Hopefully one of them is the one true river Shen",
            "unexpected reference",
            "Brings a tear to my eye.",
            "If you saw this reference live, you're now qualified for senior discount",
            "Luffy is showing bonnie how to use principle in the past ch. That how ahe can become NIKA.",
            "Same Same *but* different.",
            "I never thought I'd see the day",
            "Old memory successfully unlocked",
            "That one throwback to 1098 got me choked up. I'm not gonna survive Kuma's baackstory in the anime",
            "That's a Self-fulfilling Prophecy for you. Everything Saturn did to try and prevent all this from happening is exactly what NEEDED to happen so all this could.",
            "Not only has Bonney superior authority on pacifistas than the elders', she can also now transform into NIKA. Saturn's Karma is coming back to him in the worst way possible.",
            "In general, trying to make someone lose faith in something, for better or for worse, usually winds up making their faith in that specific thing even stronger.",
            "Bonney and Kuma background is the arc that I like most in One Piece.  I didn't care about Kuma before that, and then in a few chapters he became my favourite character ever.",
            "Senzu beans",
            "Shit it’s a giants ship filled with food to server to giants for months. It will last a day with luffy on broad",
            "I guess she might as well since she did the rubber attack earlier this arc.",
            "Yes her fruit appears to be taking into account possible futures. So a future/reality where she is Nika or has Nikas fruit is possible. If that really is the case though her fruit would be so broken.",
            "It was building up to this for a little while since the arc began. Her fruit is the epitome of the hopes and dreams that Vegapunk theorized as how devil fruits came to be. \n\nHer abilities are based off what-ifs e.g.: what if she ate the gomu gomu no mi, what if she was born a buccaneer, what if she was younger or older…",
            "You can feel how proud Kuma must be seeing this.",
            "It’s also because of that child like imagination. No different than a kid saying they gonna be a superhero when they grow up",
            "I dont think the world goverment will allow us the n word pass",
            "You will always be, My Nika",
            "The real Nikas were the friends we made along the way",
            "Hes nika, shes nika, IM NIKA, any more NIKAS i should worry about?\n\n“Meow”\n\n\nIm outta here",
            "You might be more right than you think. Since Bonney can change people’s ages what’s saying she can’t distort their futures and make an army of Nikas.",
            "Drum of liberation in double tempo",
            "Drums of liberation in stereo",
            "Does this mean he is dead? I was surprised by York stating that only 2 other Vegapunks remain, I thought that Edison was in critical conditions but alive :(",
            "Yeah does this mean he died or just disconnected?",
            "BALL SO HARD MFS WANNA FINE ME  \nSO I BALL SO HARD MFS WANNA FINE ME\n\nThe drums of liberation were Kanye beats all along?! Icant",
            "It would make a hilarious couple of panels. The elders return to Imu:\n\nImu-sama: is it done? Is he dead? \n\nElders: No and now there's two Nikas. \n\nImu-sama: At least Vegapunk is dead and we secure York. \n\nElders: Yeah about that..... there's also another 2 still alive.",
            "A second Nika just hit the island.",
            "Robonosuke is about to go Super Saiyan God Super Saiyan 3",
            "This is getting out of hand, now there are two of them. \n\nAnd maybe more since Bonney will now be able to transform people into a Nika form.",
            "Really putting the \"ni\" in \"Nika\"!",
            "I’m reading this and all I can hear is Dennis from Always Sunny",
            "Saturn is going to have to have a meeting with HR soon to discuss his \"performance\".",
            "I think it makes sense for him to say the fruit is useless, because it would be useless to him. Imagine if such a miserable old man like him had that fruit. Do you think he allows himself to imagine anything different than what he already is? Do you think he imagines things as being better?\n\n  \nSaturn is a myopic, self-sentered fool who doesn't understand that not everyone is as much of a bastard as he is.",
            "People can't read some times.",
            "Certified rubberman, I'm the one that up the score with 'em",
            "* Stretchy ass Nika he a white sun god\n* Stretchy ass Nika he a white sun god\n* Hey hey Gorosei run for your lives\n* Hey hey Gorosei run for your lives",
            "*cue Luffy and Bonney beating the Gorosei's ass to WOP WOP WOP WOP*",
            "Bonny: look at me. I’m the ~~captain~~ main character now",
            "This means that she and Luffy can run Looney Tunes skits on people now, this is gonna be hilarious lmao",
            "Seriously I adore her so damn much, JOIN THE CREW ALREADY BONNEY",
            "Until the next chapter where she collapses immediately and says she's too tired.. I'm not guaranteeing it, but I think it's likely she is being used as a device here to be a beacon for the iron giant.\n\nShe might also be able to fight as a mastered Nika without any stamina issues who knows.",
            "Literally protagonist powers and I'm all here for it!",
            "Damn Kuma would be so proud if he was still capable of feeling",
            "Bonney def feels like a SH apprentice and def have great chemistry together.",
            "I totally agree that the little moments where we see the marine fodder looking around horrified and confused by the events is intentional set-up for \\*something.\\* It's happened enough times that I think it's building up to something. Even something as small as seeds of doubt in the ranks, or even full out rebellion if the Elders try to \"silence\" these marines who witnessed their demonic forms running around the island.\n\nWith Koby being posed as the \"future of the marines\", there's no way the Marine will be totally dismantled - I think it'll be restructured and changed into something much better with people like Drake, Koby, Smoker, etc running the organization. But that's further in the future. If these little moments with the marines DO lead to that... well, it shows how good Oda is at this planning and set-up.\n\nI also love the idea of Elbaf being a \"Gear 5 training arc\" for Luffy. Like the final step to achieving his strongest state of being.",
            "I’d like to think she deserves it for all of the suffering that she, Kuma and Ginny went through.\n\nHer being this busted, I’d imagine that she would travel with Kuma and be out of the picture after Elbaf for a while until the final war happens.",
            "For as long as he need to not be ordered to kill someone he doesn’t want to kill.\n\n“Is Bonney still here? Yea…? aight imma stay down for another 10 minutes”",
            "Yeah so Kizaru is down morally mora than physically tbh. He won’t fight any more because he didn’t even want to in the first place",
            "If aokiji can transfer his cold trough seawater, whitebeard his quakes, oven his heat and perospero his freaking sugar boat island, you can be sure as shit that luffy can make it rubber.",
            "The panel of them together at the end definitely gave sibling vibes",
            " Certified pirate king I'm the one to up the score with them",
            "Just last chapter we saw Zoro fighting the horse swordsman elder, im assuming he is causing delays to the launch.",
            "I think the elders might prioritize 2 Nika’s over the Vegapunks. All the bird elder has to do is land and summon the others(or they can swim somehow).",
            "Atlas also has the \"benefit\" of already almost dying earlier in the arc. If Oda plans/planned to kill her off he could have easily just done it right there with little change to the rest of the arc. Would seem kinda weird to have her almost die, get fixed then just die a bit later anyways.\n\nLilith is probably fine too though. It just doesnt really feel like she's the type of character to be killed off.",
            "Also interesting that the robot could be referring to Bonney as well, since he felt \"nika\" before and is feeling \"nika\" again just now",
            "I wonder if Chopper = Zou?",
            "The names of his crewmates were probably the same as those with the d intial. Monkey, marshal, gol, portgas, trafalgar…",
            "I didn’t even consider JoyBoy having a crew, but you are so right!\n\nWhat if the mermaid princess from Fishman Island was a crew member, and the apology comes into play with it…\n\nAnd JoyBoy helped Lilli the same way Luffy helped Vivi!",
            "the moment bonney used gear 3rd  on alpha, it was obvious to me this was gonna happen eventually - im just suprised oda is doing it now and not during the final war as culimination of bonneys character journey",
            "Bon Clay and Catarina Devon make 4",
            "Wouldn't it be funny if the sunny launched from the labophase and hit Mars in the head knocking him out? Lol",
            "They thought they took her freedom by force. And they did. But Nika gave it back.",
            "Probably.  Luffys bounty is going to be off the charts.  \n  \nIn the span of 2 months in world Luffy has taken down Doflamingo, Big Mom, Kaido, and Vegapunk as far as the government is concerned.",
            "If I saw that before today I would have called you crazy.",
            "Why would only luffy do it. Now Bonney can also join for 2x speed. No way for  Gorosei to catch them.\n\nClap dè burst!!!",
            "Let's hope the snails waterproof and has a strong enough WiFi signal",
            "They might as well be siblings with that kind of dynamic lol and I'm all here for that",
            "Wouldnt surprise me if Saturn got offed by Imu after this arc.\nHe fucked up on such a scale that the world will never be the same..",
            "The first NIka might even be a giant since it is their legend figure.",
            "Let's be honest; the robot is just gonna go \"…!!\" once a month for another 2 years lol",
            "But she's used luffys rubber abilities before, when Luffy told her that's not how you throw a punch, she inflated her arm and threw a punch",
            "Nah, Iva can’t afford a child when they are being too awesome",
            "So is just Palkia and Dialga then?",
            "Because when she said \"Nikaish future\" she was doing so based on what Kuma taught her about Nika and what she believed Nika was like.\n\nNow she has the embodiment of Nika in front of her, reinforcing her belief and giving her a better idea of what Nika is about.",
            "Oh yeah I didn't think about how you apply this to someone else. It's all been \"make them old or babies\" so far. I wonder if the target has to believe just a little too. It's easy enough to imagine yourself old or remember one's youth but anything else could be trickier.",
            "[This is becoming more and more real.](https://preview.redd.it/there-is-no-way-oda-angels-are-actually-ok-with-this-idea-v0-nbj5yosg6j7d1.png?width=1080&crop=smart&auto=webp&s=bc9e0b24e122770275e1ececbb3928339af03aff)",
            "She just has control over the Pacifista that resemble Kuma. (So maybe S-Bear) The other Seraphim are 100% in the government's hands.",
            "Wrouge stocks are going to rise so hard",
            "Vander Deckan is trapped on the ocean floor, the only reason he didn't drown is because he's a fishman.",
            "I think she hasn't seen Luffy use it directly until Egghead. I have a feeling she will mention more once she a Luffy are reunited after escaping Egghead.",
            "The older she gets, the harder it is to imagine the future where she has Nika powers imo. Her fruit is broken for children who can imagine any future for themselves.\n\nShe could easily have been written as the same age range of the main cast and other supernovas, but it is critical for her power that she is a child I think. This is reading between the lines but I don't think it's a stretch at all.\n\nShe will always be able to power herself up, but I think the Nika-ish future is the equivalent of modern kids imagining themselves as Mr Beast or past generations imagining themselves as the next James Bond.",
            "Pretty sure she's 12, so not even a teen yet!",
            "It kind of reminds me of the mindset where people can be free and can achieve anything as long as they have the will to take the necessary steps to reach their dreams. \n\nEveryone has the potential to be Nika. To be free. To follow their dreams. They just have to believe. And Luffy can help them do that.",
            "I personally imagine it more like: [https://www.youtube.com/watch?v=np0\\_3GqYuD0](https://www.youtube.com/watch?v=np0_3GqYuD0)",
            "Cabin kid.\n\nI'm mad at myself for not realising this is a valid position in the straw hats too.\n\nGood guess, I hope it does happen now.",
            "That's my theory too!",
            "Got me tearing up, especially with her setting kuma and stella down on the ship right before. And the panel of kuma looking up lifeless. Bitter sweet",
            "Drumline of liberation",
            "He's at least not connected to punk records anymore. Of course, we know York could willingly dosconnect, so perhaps Edison did as well and is currently lying low.\n\nOr he's just dead.",
            "Yup, if there's a break next week, it's written at the bottom of the last page. \n\nAlso if You take a look at the post, just below the table Youu will see planned release date for next chapter",
            "It's usually announced at the very end of the chapter.\n\nAlso welcome new nakama! Take this strawhat, you'll need it someday.",
            "Someone will ask this question once they escape the egghead island, and all the giant peace will be gone for another 100 years.",
            "Imagine it f Joyboy crew was called dance pirates so the will of d is will of dance.",
            "The hell are you on?! Brogy can bust moves Dorry could never even dream of!",
            "Truly the TOP MAN",
            "Yeah the ships all start bouncing on top of the waves and the drums of liberation are playing loudly so that’s the moment when he transforms and lets the dogs out",
            "**Leo:** Whaaaat? Luffy-land wants us to be free from slavery and create a free world. That's so cruel.",
            "Even pre timeskip chopper wasn't that bad",
            "Imagine telling your past self that Bonney is extremely relevant and Kidd gets oneshotted",
            "I absolutely *love* how every supernova has had time to shine and be relevant in the new world. It's inevitable that Urouge will show up soon.",
            "Yeah she didn't give main character vibes at all in Sabaody. Now she is as significant as shanks or blackbeard.",
            "At that time, none of them were. He made them like the week before.",
            "Exactly why.\nThe most busted DFs are always almost useless, because otherwise they would solve everything.\nImagine a top tier fighter with foxy’s or sugar’s fruit, especially before haki negging DFs",
            "Exactly, it was already very powerful and pretty busted just being the age age fruit but atleast it had a set and defined power. Now, beyond that, it seems to be the \"do and be anything you want\" fruit.",
            "I think a child's imagination is key to the mimic",
            ">He also tried to make her lose faith in Nika\n\nTbf it would have worked too, if not for the coincidence that, in Yamato's words: there are as many pirates as stars in the sky, and among all of them, somehow _he_ was the one she'd met and brought to this country.",
            "Seeing Kuma looking at his daughter as free as she can be after remembering his last words to Ginny almost made me cry in this chapter exactly because of that. The elders tried everything thay could to humiliate and kill Kuma and Bonney, and even after all that, they are the ones that won in the end. Very \"the humiliated shall be exalted\" of Oda!",
            "I'm going go out on a limb and say it's because the celestial dragons thought it would be better if they had ubique slaves to brag about. It's why they loved renting out Kuma.\n\nWell MY slave can turn into a cool snake!\n\nShortsighted but makes sense to me",
            "Wouldn't the axolotl fruit give you ridiculous regeneration abilities?",
            "> Unless you were sure it was like the Jacket Jacket Fruit\n\nTBH - If the Jacket Jacket user were put in a similar spot as Bonney and the sisters there's a good chance we would have seen that consent has nothing to do w/ the fruit and the user could take over literally anyone if they're strong enough to fight their will/haki.",
            "I said it before, they assume all humans are insects, they can't fathoms the possibility that some insects can sting back, or punch back in this situation.",
            "Apparently so, because some Devil Fruits have powers that sounds dumb on paper, yet their users manage to make very good use of them.\n\n\nAnd, in a way, I can't blame them.\n\n\nIf you were reading this manga for the first time, would you really believe a boy that can stretch like Mr. Fantastic would make for a genuinely fearsome pirate?",
            "Suddenly them not making an effort to kill Luffy pre-awakening makes sense now. They have their heads up their own asses.",
            "This is super hype, love it",
            "I am crossing all my fingers(including my toes) that some VPs make it out of this. I am going to be heart broken if they all die and York is the only one alive. \n\nThis is probably how JJK fans feel when their fave gets fucked by Sukuna lol",
            "ha?",
            "The scuttle crab’s natural predator",
            "River Shen",
            "I don't get it and i play league",
            "I feel old",
            "\"You were too strong gorosei, that's why you lost.\" -Tokita Nika",
            "I'm not the only one who thought this was a kengan reference then lol",
            "There are so many things that the five elders have done which have made things worse for themselves: \n\nTried to eliminate Luffy by sacrificing Guerinica, that cp0 agent back in Wano. \n\nTrying to kill Vegapunk, turning him and his satellites (except York) as allies of Luffy and messing things up massively. \n\nExperimented on Bonney and driven Kuma to lose his personality, subjecting them both to so much hardship. \n\nDestroying Ohara with the sole survivor on the Straw Hat crew.",
            "That’s prophecies in general for ya. You build the trap and walk right into it.",
            "That's how Ragnarok happened.",
            "Senzu beef*",
            "I don’t think she can just wish a future into existence, I think she has to truly believe that future is possible. ",
            "Dad of the Millennium",
            "F the world government, Nika",
            "Can't wait for the anime adaptation for its music",
            "York just said that only two of them were connected to Punk Records, so its still possible that he’s alive but so damaged that he went dark. But being dead is the most likely outcome tbf",
            "York used the words “interfacing with punk records”. As you said he could be disconnected, but things were looking grim for him.",
            "I'm.assuming jumping into the barrier broke his connection",
            "WHATS 3BIL TO A NIKA LIKE ME CAN YOU PLEASE REMIND ME?",
            "Everyone wearing Kurama's cloak again",
            "So far she only ages other people up and down basically as they are, no? I think the more creative changes are limited to herself and we are safe from everyone having Kyuubi powers in the final war.\n\nCorrect me if I'm missing some example, but I think her distorted future isn't as capable on others. In fact I'm not sure it's actually *distored* future on others.",
            "I don't care about tbh, Oda won't ruin the story, but i love the fact that her fruit that was described as \"useless\" by Saturn, has turned her into his biggest nightmare, AKA Nika.",
            "The question is, will HR be imu or will it (hopefully) be some little old lady imu hired that just chews saturn tf out",
            "Everybody say \"Don-do-to-to\" \"DON-DO-TO-TO\"",
            "\"The future in which I'm the main character\" -> Luffy dies in the next panel for character motivation",
            "I am so hyped to see bonney use her powers. They're 100% going to play tennis or wack-a-mole with the marine ships.",
            "Omg I hope they do rabbit season duck season and end up on the gorosei",
            "I want her and chopper to bond sm. She doesn't really have any other home so she gotta be adopted by the straw-hats. That would be so wholesome 😭",
            "I feel like there's no chance that Oda does this and doesn't have her and Luffy clown on people with Looney Tunes skits",
            "***BONIKA: One Piece Next Generation***",
            "I still think we have to see Kuma do the Nika dance before the end of this arc. Maybe right before he dies. It just feels like that would be a nice full circle from Slapp to Bonney.",
            "Walk him down, whole time I know he got some ho in him",
            "In the panel with Nami you can see Nusjuro emerging out of a cloud in front of the Sunny, they are fucked right now",
            "Luffy was out of form until now, it could still be referring to him. But it makes me wonder if the robot was active 200 years ago because of someone with Bonney's fruit who had the same idea.",
            "i can see it going ether way, since luffy is in g5 too now.\n\nalso love how the giants just started dancing to g5 drums when luffy went",
            "One reason imo is that the truth to who holds the strongest minds/creativity/imagination are children. Because Bonney is still a child, despite all the trauma she's gone through, the will hasn't been completely beaten out of her. Even when it happens, children bounce back again and again and again until they just can't anymore.... by the time they reach teen years and adulthood years, if all they experienced was disappointments, it's much harder to bounce back from that. \n\nRobin is a good example of this because it took like 28 years of existence before she met the Straw Hats, and building and recovering that trust and inner-world was much harder then. Same can be applied for Nami who was I think 18? As well as Sanji who went through so much as a child, survived it, and then went through yet again another traumatic experience with Zeff, and then ignored all that until he had to face his past in WCI. It heavily affected his mental state and his ability to make healthier decisions because trauma by adulthood is not functionable.\n\n  \nIt isn't functionable for children either of course, but I've seen this with children and when I was a kid, how much I'd bounce back and restore my faith in humanity/myself by myself, for no good reason at all, other than to hold onto hope. Anyway, to me this is why Bonney is able to back bounce so quick and suddenly gain that confidence and ability to transform into Nika (because children have limitless potential and imagination). Even when she told Luffy she couldn't keep up with him in that form, there were no sweat marks that usually indicate a nervousness/insecurity/etc (this emoji 😅 lol). Usually someone would have some level of insecurity and express that emoji when acknowledging there's no way they could keep up with Nika form let alone against literally demons lol. Children can feel that sense of comparing oneself to others of course, but again I hope you get my point. Children rule. It's both amazing and incredibly tragic that Bonney is currently TWELVE 💀\n\n  \nI also think Oda is aware that we the individuals living here on hell-like earth, need genuine hope right about now and the messaging with Bonney and the iron giant is pure gold for that. The concept that \"there's Luffy who can save us and that's it\" is instantly rewritten with \"you can be Nika too\" which is the whole point of Nika- to inspire confidence and freedom to everyone, to empower others. Bonney, a 12-year-old character who deserves to show the world what is possible when you tap into a potential future that WASN'T fked up by dystopia, further unrecoverable trauma and abuse, and corruption, is the perfect way to represent that. I often wish I had a different upbringing. I can see exactly how, when, and where my childhood stripped any bit of potential I had and did everything in their power to kill it. The gorosei successfully did this to Bonney's entire life and her family. It's incredible she gets to finally get a brighter future and I'd like to believe she's going to either stay with Luffy, or find somewhere safe to live with Kuma (if that's even possible with his current state) much like Rebecca+Kyros. I'd love to see her stick with Luffy between those two ideas though.",
            "Yeah, we even saw her use a buff version of herself, similar to muscle Luffy, and recently a giant form as well.\n\nSo her being able to have a Nika form was built up really well in my opinion.",
            "I could see it. Ussop being at the helm as well, to sort of parallel how he landed on a celestial Dragon in Sabaody.",
            "Same way Franky and Brook hit Big Mom wirh the bike, bur this time a full coup de burst hit against Mars would be bonkers.",
            "Might actually happen, knocks him into the water.",
            "Bro I love their big bro and lil sis dynamic",
            "Fun idea, that would make me take Imu more seriously than Lulusia, honestly.",
            "The straw hat that Imu had was also giant, so you're probably right.",
            "Have we seen “distorted future” used on another person?  I don’t think we’ve seen that at all.  Her fruits base power is to increase or decrease the age of things, distorted future may be limited to only working on her",
            "Bonney will probably ask this question, since she's the little girl.",
            "Ayo keep cooking!",
            "This doesn’t sound that far fetched man",
            "The One Piece world is just a long retelling of the movie Footloose.",
            "So this negates Luffy's sea weakness. He can just bounce off the sea instead of sinking into it. Then again, he can also just bounce off air.",
            "Sick",
            "Which is funny because Leo is older",
            "He literally couldn’t tell who  his crew mate was behind a mask when his literal nose was sticking out. Chopper is that bad lol.",
            "*After* delivering a coup de grace on a Yonko no less, in Kidd's case.",
            "Imagine coming back to this comment in a few months when Ma D. Monk Urouge makes his move and overshadows both.",
            "Well not to the same degree though, Hawkins and Apoo were essentially just shoved in Wano because Oda wanted to put them somewhere but they had very little relevance. Compared to Law and Bonney it's night and day",
            "It's also kinda genius to add in that people/fruits tend to pair up based on personality and dreams. So the idea that foxy's fruit and Sugars fruit would land into the hands of a fighter aren't impossible but unlikely. I bet of we learned more past fruit users you'd see a trend of similar uusers for each fruit.",
            "It’s a “access any future of yourself you believe possible” fruit, which is incredibly busted in the hands of a kid who is easy to convince the most ridiculous things are possible.",
            "I think it's only that powerful because she's a kid\n\nShe has a child's imagination and tons of possibility \n\n\nAn adult with the fruit most likely wouldn't be as effective in \"doing anything you want\"",
            "I love that quote",
            "Yeah, that does make sense. Also don't forget that many gladiators in Ancient Rome were slaves, armed and trained by or at the behest of those who held them in bondage. [It did cause problems sometimes.](https://en.wikipedia.org/wiki/Third_Servile_War)",
            "They're likely also fed to people who have already had their self-esteem and self-respect severely damaged. So they don't believe they're capable of being more or escaping. The Celestial dragons know that they're not going to escape because they don't actually have the will to do so.",
            "I feel like every single DF is dangerous and powerful\n\nBut it all depends on the user\n\nAnd giving the user motivation and a revenge motive certainly helps to make the most out of it",
            "Yeah they can regrow limbs.",
            "It’s awakened powers might give the user to mind control people on a mass scale by controlling their clothes like in Kill La Kill.",
            "Fucken' insects! \\*kicks hornet nest*",
            "Reminds me of Three Body Problem and the bug allegory.",
            "It's also implied from some flashbacks with young Luffy that without superhuman strength and training people with his fruit are basically useless gummy bears and can't even throw a punch.",
            "It's just some dumb kid, we'll probably have sunk the world before he can become a threat. why even bother",
            "If any of the vegapunks are coming out of this alive it's probably going to be Lilith",
            "I'm neither Luffy nor Bonney. My name is Lunney :D\n\nKinda like in Looney Tunes, guess it makes sense since they have Bugs Bunny powers.",
            "Like 11 years ago, Korea used to do blind pick for game 5s and Shen was good then.",
            "My memor's a bit fuzzy but back in the day in the old Korean league (OGN) they used to play best of 5 matches and the last match would be blind pick, so in the last match both teams picked shen and people were like \"wtf 2 shens\" since we didn't see blind picks in pro matches in NA or EU\n\ne: also this was probably over 10 years ago",
            "id argue they achieved exactly what they wanted in ohara. The others are totally examples of them ironic justice tho",
            "Prophecy is like a half-trained mule. It looks as though it might be useful, but the moment you trust in it, it kicks you in the head.",
            "shes also only 12, anything possible when your still a kid",
            "> I think she has to truly believe that future is possible.\n\nStop, you're making me cry even more.",
            "That makes a lot of sense too and is plausible.",
            "Like a child's imagination.",
            "Peoples dreams never end.",
            "Happy Father's Day, Kuma.",
            "Yeah, he was heavily damaged by the shield.\n\nAnd we could consider what he said to Stussy as his last words.",
            "A lot of people early on said that Luffy’s fruit was weak too.  A fun parallel",
            "I feel like he said that to demoralize her and limit her imagination tbh",
            "Boneny's df is an isekai generator confirmed.",
            "Absolutely, plus the shenanigans she'd get up to with Luffy, Chopper and Usopp would be comedy gold",
            "I want Sanji to have a little sister he can cook for!",
            "Say Saturn. I hear you like them young",
            "Dude you’re firing up the burners with this one. Someone from 200 years back who’s researching the void century, learns abt nika and has / knows someone with the age fruit? I could v easily see it\n\nThey do a nika transformation for unrelated reasons and it’s all tied back to activating the robot",
            "Then we would really find out if they are devil fruit users or not.",
            "Maybe the Awakened state of her fruit would let her apply Distorted Future to others? Speculation on my part, but that's what makes sense to me as things are right now.",
            "True—but he’s already shown in gear 5 being able to run on air when his legs go all hot wheels/roadrunner beep beep. But I think this is super cool to see. I love the bouncy house aspect of gear 5 so much",
            "The government didn't know",
            "Neither could Luffy or the Government",
            "Eustass fell off harder than the Iron Giant after getting tackled by the Gorosei.\n\nHopefully this humbling moment motivates him to train harder.",
            "Monk d urouge doesn't need to be emperor or pk, he achieved enlightenment, he transcends this world",
            "There's also a big differentiating factor between the two groups, one stayed true to being free, the other decided to side with Kaido and oppression. Oda needed to show both side because if there's one thing Oda loves to show is that the way to stay on top is to yearn to be free",
            "Yup insanely powerful in the mind of a kid. A fruit who's power is pure imagination. People were calling Luffy busted b/c he seemed to have that limitless power. But Bonnie actually has it",
            "”A five percent raise future”\n\n”A back pain free future”\n\n”A mortgage paid future”",
            "Its like handing a gun to someone you've abused their whole life. They're not going to shoot you, they're already halfway convinced they can't live without you, or don't deserve to. Its fucking sad.",
            "\\*One Piece theme song starts\\*",
            "YOU ARE BUGS\n\nthat whole reveal/sequence was so good",
            "People seem to forget about this. Luffy is already superhuman without his fruit. That base is what made him so fearsome with it. The BB pirates commented on Ace being the same way.",
            "I recall Ace making fun of Luffy as a kid that all his fruit gave him was resistance to bludgeoning.",
            "*Buffy",
            "And yet, they still failed to completely destroy the books. Some important stuff might be hidden in those.",
            "Its not just plausible it was explained earlier in the arc.",
            "You better never go to Impel Down level 1",
            "I feel like distorted future might actually be the awakened power, but it’s really hard to say",
            "Can’t wait for his return in Two Piece: next generations",
            "Yeah they both basically gave up and submitted and that's what happens when you do that",
            "And now Toon world Luffy is ever increasing her span of imagination too",
            "You can't just want it, you have to imagine it to be true\n\nYou know deep down back pain is coming for you",
            "certified pirate boy? certified CROCODILE",
            "He is in two piece right now lmao",
            "Spot on, the story would be way worse if all the Supernovas were \"correct\".  Some of them needed to be failures.",
            "WOP WOP WOP WOP WOP NIKA FUCK EM UP",
            "Yes and Bege is a great example of one of the supernovas doing both and being smart about it. Really ups my opinion on him compared to when we first see him in Sabaody.",
            "WOP WOP WOP WOP WOP \n\nDo more rubber stuff",
            "I really like him for the same reason.  Competent, made some bad plays, got out with his life and crew, and happy with not being Pirate King.",
            "He's living his best gang boss life with a loving wife and son. Plus he's on good terms with Emperor Luffy."
        ]
    },
    "One Piece: Chapter 1118 - Theories and Discussions": {
        "title": "One Piece: Chapter 1118 - Theories and Discussions",
        "score": 48,
        "url": "https://www.reddit.com/r/OnePiece/comments/1dkwy1d/one_piece_chapter_1118_theories_and_discussions/",
        "content": " **Chapter 1118**\n\nPost all your theories and discussions for the current chapter in this thread. We also have poll related to a question/event of the recent chapter!\n\n**\"Which Good Vegapunk will survive?\"**\n\nJoin us at [http://discord.gg/onepiece](http://discord.gg/onepiece) to discuss One Piece instantly with fellow nakama!\n\n[View Poll](https://www.reddit.com/poll/1dkwy1d)",
        "num_comments": 278,
        "comments": [
            "So now we just need : \n\n- The Sunny to go down from the top of Egghead. \n\n- Jinbe and Zoro to jump Down. \n\n- THe Giant Robot emerging from the water to stop the Gorosei while trying to help Joyboy. \n\nI also hope both Lilith and Atlas survive this.",
            "Remember, there was no flashback before Vegapunk \"died\". 😂",
            "Thematically, this chapter perfectly encapsulates what One Piece is about, and especially what is being built since the reveal of G5.\n\nMy personal theory: The reason the elders and the WG want to get rid of the fruit so badly is not only because of what it symbolizes or the power it gives to the user, but because it can also power up other people around it. The drums of liberation not only inspire people, they give them the tools to free themselves.\n\nI am **not** saying that Luffy has the power to give anyone G5. However, I do think his awakened form can power up people in multiple ways if they are inspired enough by it.\n\nBonney's fruit for example. She can tap into potential futures, unless she learns the truth and cannot believe it will happen. She turns into a Nika form multiple times, although she only takes the rubber characteristics, because that is all she knows about him at that point. Once Saturn tries to break her spirit and tell her Nika isnt real, she conjures a very weak form, because she doesnt fully believe a \"Nika future\" is possible.\n\nHowever, now that she **sees** right in front of her that Nika is very much real, and that liberation is possible, she manages to come up with a fully \"free\" future of herself, which copies the physical characteristics of G5.\n\nThat, I believe, is Nika's true power. Luffy isnt simply metaphorically freeing people, he inspires freedom to the point that they get powered up as well. I dont know how this would interact with other devil fruits, or with those who have no devil fruits at all, but I believe this wont be the last time someone seeing G5 will gain themselves a new form as a result.",
            "Bonney is starting to really seem like the last crew member under the title of \"luffy's protege\" \n\nShe's the youngest person there and luffy seems keenly interested in teaching her how to stand up for herself and be free.  He was showing her how to throw a punch a few chapters back and now he coached her into being a nika herself.",
            "Everyone is too busy on Bonney but what about the last bit of vegabunk recording saying among u there are….and their names are…. And the recording cuts off\nDoes that mean there is sort of other major figures besides joy boy that the D clan members inherits their will.",
            "The real question is: does Bonney just appear as Nika or have Nika powers",
            "I love how amongst all the tradegy  6 years old bonney faced, she has the power of becoming whatever future she envisions herself. This is poetic.",
            "This chapter just proves, just like back in Wano, that a lot of OP fans can't read.\n\nWe literally dee Bonney turn Luffy into his old man self from the bad timeline.\nWe see her use a weaker version of the Muscle Muscle form in her \"Nika-like future\".\nWe literally see Bonney turn into a giant, an entirely different race.\n\nHow the hell some people are acting as if this came out of nowhere?\n\nBtw, each time, her power lasted for a very short time, far shorter than Luffy's so calm your panties powerscalers\n\n\n\nAlso, this moment isn't about a power up for Bonney. If you were actually paying attention, you'd see how connected Nika is to Bonney's family. How the idea of Nika finally setting them free was around from Kuma's childhood.\n\nBonney becoming Nika for a moment isn't a power up to day \"Bonney is top 5!!!\". It's a cathartic moment for her whole family and them finally being free from being slaves and victims of the WG.\n\nThat's why this is Bonney at her most free (and there is no one freer than Joyboy/Nika), why the flashback to Kuma talking to Ginny exists, and why Bonney heavily resembles her mother in her Nika form.",
            "How I see the \"Is Bonney OP and can she literally do anything and copy any fruit\" debate:\n\nBonney's distorted future is based on if she believes that future is possible. As she learns more about how things work her distorted transformations become more limited as she will no longer believe them to be possible. E.g. if she knew for a fact and she believed people couldn't grow an extra arm later in life, she wouldn't be able to distorted future where she had 3 arms.\n\nCan she copy any devil fruit power? This is unclear because we don't know if she knows people can only eat one devil fruit. If she knew this then she cannot believe in any future where she is using someone else's devil fruit powers (unless she also knows blackbeard has two).\n\n\"But what about Nika transformation, she is copying Luffy's DF powers\" Yes, we as readers know this, but Bonney would have to know this too. The only people we have seen talk about the fruit are the elders who know its the nika fruit and Vega Punk who said the gum gum fruit isn't in the old devil fruit books.\n\nLuffy isn't telling her \"This is just my gum gum fruit gear 5 form\", he is saying \"this is how i look when i am totally free\". It is entirely possibly in Bonney's child mind that there is a disconnect between this transformation and his fruit.\n\nNow back to the blackbeard thing I mentioned earlier: If she knows about Blackbeard having two powers then all bets are off. Nobody knows how he did this. Is it special to him because of his body, is it special to him because of his fruit or can anyone potentially do this? Without knowing the how but knowing someone has done it, this would open her back up to seeing a possible future where she has another power.\n\n\nSo to all the people saying \"can she just say give me a magma future and get lava powers\" I would say possibly but it's unclear, depending on what she actually knows about DF.\n\n And I wouldn't be shocked if an elder literally tries to tell her during the fight that she cannot be nika because of XYZ and possibly breaking that belief and forcing her to de-transform.",
            "People are missing the thematic nature of Bonney transforming into Nika. Her powers limit is her belief a future event could have ever happened. So with Luffy telling her that anything is possible she believed she could trully become free. In doing so she turned herself into the person who is the most free, turning herself into Nika. We have seen Bonney use her powers in similar fashion but she lacked the conviction to go all in until Luffy encouraged her. Now that she trully believes she can be Free she is able to become Nika. Powerscallers themselves put limits on characters which is the opposite of what Nika is about. He is the God of Liberation, the one who will free all the people's of the One Piece world from the yoke of the World Government. Bonney turning into Nika is but the first step towards a Liberated future.",
            "Two questions: \n\n1) Does only Mars reach the giant ship or the other Elders too?\n\n2) which hit/move will defeat Mars and the other Elders forcing them to go back to Marijoa?",
            "I wouldn’t be surprised if vegapunk has another protocol installed that if all vegapunks die a back up satellite would be made",
            "The biggest thing that I'm anticipating right now is what Kizaru will do next. \n\nHe's said multiple times how sad he is about what he's being made to do, then he killed Vegapunk and (presumably) heard the broadcast. My money is on him doing some sort of sacrifice that allows everyone to escape. \n\nMaybe finally time for logia awakening? If logia awakening is what Akainu and Aokiji used during their battle on Punk Hazard, then something that bathes Egghead in light would also be symbolic of the Sun God's victory. At a minimum, Kizaru has to do something else this arc given how much characterization and flashback he's gotten at Egghead.",
            "I think seeing Bonney as Nika will completly break Kizaru and he will fight back the gorosei together with luffy",
            "This is to all the people that dont understand why bonney can become Nika   \n\n  \nBonney was born as a slave and used for experiments by the WG and then when she got that crystal disease stuff, she was thrown away like trash. And now she has been \"freed\" by the god that she has looked up to for so long, who is the warrior of liberation by the way, and now has the power that the WG feared the most.   \n\n  \nThat's what makes this \"peak writing\"",
            "Luffy and Bonney knock mars into the ocean, then he just flies out like nothing is wrong, showing that the Gorosei are not devil fruit users but actual demons.",
            "I would love if Oda used this chance as a way to show why Luffy is still the reason why this fruit is so strong. Like yes, Bonney can do the same things, but she mimics him. She can’t be as creative as he is nor use it as imaginatively. I think this is a good thing to really put all the people who say “Gear 5 is broken” when in reality LUFFY is what makes the fruit appear to be so strong",
            "Im conflicted about Nika Bonny. I knew it was gonna happen after seeing how her powers work. Luffy went to hell and back just to get to gear 5, and here comes Bonny. She's able to do it just because she believes. It all depends on how it plays out.",
            "This chapter is packing so much hype!!!",
            "How long do you think one piece will last? Me:![gif](emote|free_emotes_pack|scream)😓\n\nWonder whether sogeking will come back ( all ussop's other lies did, why am i talking about usopp he dosen't ware a cape or is born on the island of snipers)",
            "Bonney can change the age of other people and also of herself. So if she can transform to Nika, she could also change other people to Nika.\n\nFinal war will be WG vs army of giant nikas.",
            "If the Iron Giant gets activated by Nika's \"Drums of liberation\" and if Luffy is the first to awaken the fruit since the void century, what made the giant move 200 years ago? Was it Bonney's fruit? And if the Giant moves towards Joyboy, was whatever caused it to move 200 years ago in Mary Geoise?",
            "Been seeing Bonney using her fruit to spread G5 theories and I think it's extremely plausible. While it makes more sense for Bonney to simply be able to force Gear 5 on people with insufficient haki to resist, it's possible that a Nika distorted future requires someone to be in the right state of mind to access. If this is the case, then Bonney could end up with the Revolutionaries, since Belo Betty could use her fruit to get people in the correct Nika-ish mindset. The Revo's being able to instantly create an army of Yonko-tier combatants at any kingdom they visit would dissolve the WG in no time, especially if they can get Kuma active again, which might be why the CD's have the drastic measure of destroying all life on the planet. We've already seen Cross Guild give the marines trouble; the Revo's might very well defeat every Admiral and demolish the entirety of the Marines as an institution before tackling Mary Geosse.",
            "seems like all the pacifistas are left behind. say bye bye to Bonney's pacifista army, the WG will replace the command hierarchy coding now that they have york.",
            "I hope Lilith survives, but I kinda feel like you need to compare what happened to the SH crew on Sabaody with what  is happening with the vegapunks. One by one they're dying, and right when you think the final one can be saved they'll die too.\n\nI'm still shook Shaka is dead. Out of them all, he seemed like the most interesting character next to Lilith.",
            "Was it just me… or did it sound like the giants (at the least the two captains) couldn’t stop dancing to the beat?",
            "So I guess Bonney's fruit is strongest now than ever since she's a kid? The imagination of a kid and the naivety to actually believe that could be possible makes this fruit OP af if it works like that. Maybe as she gets older and knows more about the world her fruit won't be as powerful, unless she remains dumb af",
            "I feel like Atlas will survive. She's on the boat with Luffy and the others so it feels like she has the most plot armor protecting her. I doubt Mars is going to kill her seeing as how Luffy and Bonney are probably going to beat the crap out of him next chapter.\n\nI'm more concerned about Lilith. She's currently grouped with some of the weaker Straw Hats while Zoro and Jinbe are away from them. Assuming Zoro can deal with Nusjuro by himself, that means 3/5 Elders are probably going to be gunning for Lilith, Nami, Robin, Usopp, Chopper, Brook, and debatably Jinbe if he shows. That's more than Lilith's side can handle. Hell even if Lucci, Kaku, and Stussy decide to help them out, 3 Elders still feels like way too much for them.",
            "My boy Edison is alive!!! I have faith!!!",
            "In a thread asking who the strongest female character is, I got down voted saying it was Bonney.  How do you like me now bitches? lol her power is fueled by imagination a lot like Luffys, and she had the imagination of a child. Come fight me.",
            "personally, I think both Atlas and Lilith will survive. But if only one of them was to survive I think it will be Lilith mainly because I think Oda is more likely to keep the more stereotypically attractive girl alive.",
            "After this last chapter, it just solidified my confusion on how bonneys power works. Does her power only work like this because she’s a kid and can’t actually grasp how the world works?",
            "I hope Blackbeard wins at this point",
            "Crackpot theory: Luffy having the Nika fruit subconsciously allows him to control the sun, therefore \"stretching\" the days out and explaining the short timespan",
            "So everyones a super saiyan now",
            "How come Bonney can become Gear 5. Could her Devil Fruit pull from different timelines? One where she eats the Nika Nika no mi instead of Luffy? Like there needs to be an explanation here. Could this all be Luffy’s doing from his DF? She’s not just taking the aesthetic she has the awakening clouds and is indeed floating with Luffy’s ass. I personally don’t like it because it makes gear 5 less valuable. Similar to how Saiyans in DBZ becomes go super saiyan easy af after Freiza saga. My reaction was “oh…..you can do it too…cool I guess?”",
            "What if all Devil Fruits have the possibility to turn into a Nika, when the user feels like being unlimitedly free? Just thinking of how Bonney finally achieved to transform into this form.\nAdditional thought is how awakened devil fruits do look in general having the white clouds floating around the user's neck. What if this is an incomplete nika form as well? ",
            "People aren’t realizing that Bonney has no interest in being Nika. She wants to be free and this is what her transformation is all about. It’s complete unrestrained freedom to do anything she wishes. And indeed that is the mindset that the devil fruit requires. I don’t know why people are getting so mad about it.",
            "Bonney is DEFINITELY joining the crew imo, I think it's a big reason why she has an earring by her eye, to differentiate in Nika form from Luffy. Also Luffy calls her Bonney now https://i.imgur.com/ofxfgWJ.jpeg",
            "HUH? There are 2 Nikas?",
            "Right now Bonney could copy Nika's power thanks to her fruit, but I predict that Luffy will eventually be able to share the Nika form with those around him. Specifically, his nakamas.  \n\nMy theory is that during the eventual fight with Kurohige's crew, Luffy's will be against the ropes, and as the shonen trope states, the power of their friendship will allow Luffy to activate Nika mode on all of them, allowing his crewmates to beat the titanic captains with cartoonish powers.",
            "Could the Mother Flame be a fire that JoyBoy or Nika had turned rubbery? Because some rubbers can take thousands of years to decompose, could it create a rubbery fire that lasts thousands of years that has the properties of rubber. Making it an endless supply of energy for several thousand years.",
            "Need a poll on peoples thoughts on joygirl Bonney. Seems very divided",
            "Momo is a good example",
            "Is it possible that the robots awoke only when Bonnie used her Nika related ability (precisely *distorted future*)? what if the robot sees her as the real Joyboy for some unknown reasons (for example, what if Joyboy had the *Toshi Toshi no Mi*)",
            "Is it break week?",
            "I actually like the stuff with Bonney but think people are making way too much of it. Because of how it fits into the context of the arc. It's not unlike how a lot got easily misled by what made Yamato and obvious red herring.\n\nVegapunk's broadcast was the third time we've had this like, side story going on where the main focus steps away from the Straw Hats for a while. The first two sorta did something like this, had a chapter where the main cast leaks in a little more and a different sidestory gets a big moment to keep em tied together before the one we were on shifts gears. Bonney at the Reverie then Stussy getting her first moment hinting at what we were doing recently with her in the Kuma flashback. \n\nI still think we'll get back to some of that as the broadcast finally fades out. Because this chapter has the stuff floating around that ties it altogether. You're not entirely wrong to think this is kinda silly and gratuitous, our first lesson of Zoan awakenings is there's a danger of losing yourself to them and you have the Giants playing with that idea right before the big climax. To me it's one of those things were you maybe can't see the full ending just yet but you can see the type of twist it's setting up, the big mystery is still what happened last night and the stuff around that.",
            "Edison is still alive",
            "I guess because people complained about Luffy being special.  That Luffy isn’t special any longer.",
            "If Bonney has Nika powers what tandem attacks would you want to see for her and Luffy?\n\nLike one becomes a flail for the other to use as a weapon",
            "My body is ready to receive the presence and blessings of Urouge this upcoming arc",
            "You think we will see some of the Gorosei drown? they are now fighting on the water and i wanna see if they have devil fruits or its some different power they have.",
            "We know Nusjuro has the first Kitetsu right. Why tf does a gorosei have a kozuki sword?? It boils down to 3 theories.\n\nBoring Theory: In the past probably like 100-200 years ago maybe even close to the giant robot awakening or who knows maybe 800 years ago Nusjuro killed a Kozuki who crafted Kitestsu and toook the blade\n\nCool Theory: Also like 100-200 or 800 yearaas ago Nusjuro was GIVEN kitetsu by a kozuki which would be an insane plot twist cuz Kozukis would kinda be like betrayers to the Ancient Kingdom but allied temporarily with WG.\n\nAlso Cool Theory: The Kitetsu swordss are from Wano in the Kitetsu School right? And they wereee the ones who made the \"Cursed/Demonic blades\". So wouldn't it be insane to think that Oda connected the Gorosei being devil demon dudes, Wano being ancient land, Cursed Swords being demonic prseence, Black Blades having some involvance with Devils/Demons, and Zoro being the one to surpass the devil so he can REACH THE HEAVENS OVER 800 CHAPTERS AGOOOOO??????????????????????????????",
            "Luffy is gonna absolutely hate the idea that he’s inherited the will of Joyboy, Gil D Roger and Nika. I expect his reaction to be “that’s dumb I’m Luffy”",
            "Joyboys natural form is gear 5 the reasoning is the robot thinks joyboy is gone when hes still  there",
            "I haven't seen anyone talking about the fact that they just experienced another earthquake right before Bonney went Nika-form. Does this mean that Imu may have just destroyed another island while all of this was going on?",
            "Will Zoro slash something on his way down or that’s it for him in this chapter? It would be cool if he cut the elder bird’s wing with Enma.",
            "Where all my Nikas ?",
            "“You get to be a Nika and you get to be a Nika and you get to be a Nika and you get to be a Nika” - Oprah Winfrey",
            "Great episode! I think Bonney is the biological daughter of the being sitting on the throne and maybe that's why she gets G5.",
            "I think all devil fruits lead to a joyboy transformation",
            "i think the existence of 'two Nika' will serve to highlight who is the 'Joyboy' among the two.\n\nwould be interesting if the Iron Giants end up recognize Luffy as 'Joyboy' despite there is two Nika there.\n\nwhich could mean that Nika and Joyboy might refer to different separate things. Nika might be just refer to the Joyboy's ability but in the end the person itself still the Joyboy. so if there gonna be end up 100 person with Nika power, in the end there is only one Joyboy.\n\nso this is not about the devil fruit. what make it special is not the power but it is about the person itself.",
            "Nika is a figure, an entity. So it is achievable when Bonney see herself to be as an entity of Nika, a figure of sun god a figure of freedom. She wants freedom, joy, and laugh, she want to be like Nika, and Luffy already give her an image of what Nika is and capable of, so she just distorted the future of what she interpret as what Nika is and looks like. \n\nSo in short, Bonney wants to be like Nika, but doesn't know what Nika looks like, hence the \"gear 3rd-esque\" transformation, and now when she saw what the \"Pseudo-Nika\" looks like, she can achieve that power from her imagination of her alternate future self as Nika, so much so like she distorted her future as a giant.\n\n  \nAs I quote from the onepiece wiki:\n\n>Dr. Vegapunk theorizes that Devil Fruits are a manifestation of the possibility for human evolution, with all the **different powers representing the many branches for humanity's future**, brought into existence by human hope and desire: thoughts along the lines of **\"if only I could do this\"** or **\"if only I could be like that\"**. Vegapunk claims that those with powers exist in different dimensions dreamed up by others before them.\"\n\nWho knows, maybe another DF can make you a Pseudo-Nika or something else with their imagination on how they use it.",
            "Big Theory: It was mentioned that Nika fruit's power make everyone happy around him, but with how Bonney turned into 5th gear form it might be what it meant. That Luffy's power can inspire 'freedom' in others and that might not be Bonney's own power causing that. That can also mean that on the other side Imu might have a similar dark power and the Elders's similar powers are a result of that. That would explain why the Elders have their own unique fruit-explained powers and unexplained similar dark powers.",
            "Losing all hope is freedom. -Tyler Durden",
            "This is Bonney situation is why I would've preferred to keep Luffy's fruit the paramecia Gum-Gum Fruit, separate from the idea of Nika/JoyBoy. Because that way he can easily inspire others and \"make them\" become their own Nika. Luffy is JoyBoy/Nika because of who he is and how he views the world, not because he ate one specific devil fruit. Would've been a better fit imo to keep Nika this idea of freedom instead of an actualy god/person tied to a devil fruit.",
            "The haters for this chapter make me sad. Gear 5th embodies why I love One Piece so much, it just brings me so much joy and happiness. ",
            "Kakashi getting Perfect Susanoo. Which Madara called destruction incarnate, made a big deal out of it.\n \nCaulifla goes super saiyan because she gets a little angry and feels a tingle in her back.\n  \nNow Bonney transforms into Nika. There's got to be some serious limits to her power. Like not being able to turn other things / people into rubber.\n\nIf there is no limit, she just copied a mythical zoan's awakening bar for bar. Can she copy Marco? Kaido? Sengoku? The Elders?\n\nCan she copy paramecia's like Whitebeard's? Kidd's? Law's? Blueno? Bege?",
            "Ok so my theory is that bonney actually accessed another timeline where she ate the books fruit and unlocked gear 5, because she used the move \"distorted future\" and what I think is that it just gets her the powers or abilities which she had in another timeline since previously she used \"distorted future\" and became a giant",
            "I'm surprised to see people still convinced that Bonney will actually become a member of the crew. Do you really think that Oda will have a strawhat that just imitates other people's powers,the protagonist on top of that? Plus she expressed no interest in joining the crew so far, unlike Yamato. It's like they want her to join just to have a shallow parallel with Roger and not because of her actual character",
            "So in the cover page... Is Yamato setting sail? Maybe finally joining the SHs?",
            "We NEED the Giant Robot to BEAR HUG the HELL out of Mars and take him down into the depths of the ocean, nullifying the immortality and drowning him so the Straw Hats and Giants can make their getaway. Mars is the only one capable of pursuit after they leave so he needs to be eliminated if he isn't going to permit their retreat.",
            "The chapter is sloppy im sorry",
            "BONNEY copying a devil fruit awakening..idk how to react on this... Copying a devil fruit and its awakenings r different 🤦🤦 can't defend Oda on this..",
            "I wonder what will happen to York after Egghead? ",
            "Am I missing something or Bonney just got a Deus ex Machina??\n\nBonney is like:\n\nAm i dueling against Zoro? Sure, let's distort a future where I trained swordsmanship every single day of my life.\n\nAgainst Akuma no Mis? Make me train Armament instead.\n\nThe only downside that I can see, are things that are inheritated through birth, like Hakushoku and modified DNA, like Sanji for example.\n\nBut who cares? Garp has no Hakushoku and still is one of the strongest ones because of his strong Armament. So she can just distort a future where she intensively trained Armament for 50 years or something just like Garp did.",
            "Call me crazy, but I still have hope for Franky upgrades. I think Edison is gonna die, and so is Kuma. Franky will get kuma's df and push the sunny to safety.",
            "I feel like there's valid complaints about the Bonney Nika thing but as usual the conversation is about all the invalid complaints. No its not an \"asspull\" or \"made up from nowhere\" or \"makes Luffy less special\", and it makes sense thematically and with Bonney/Kumas storyline. \n\nTo me the *actual* problems and why it felt underwhelming to me are: \n\n1) not enough time/background with Bonney and her perspective. The bulk of her character was introduced this arc, and most of that coming in the last 20ish chapters, and now she's suddenly a massive piece of the puzzle. And most of the stuff we know about her is from the flashback that's from *Kumas* perspective, we only got like 1-2 chapters of Bonneys perspective \n\n2) lackluster buildup in this chapter, the actual transformation happens kinda suddenly in a situation where it felt like the strawhats had the upper hand anyways. All it takes is basically two simple sentences and boom the transformation happens\n\nI expected some type of Bonney -Nika stuff coming, but this just kinda feels off because it feels so soon and kinda like overkill given the situation. For example if this happened when she was facing down Saturn, outnumbered and pushed to a corner, then I think the hype climax vibe would've hit harder for me.\n\nI'm sure alot of people will disagree, but I truly believe alot of people who aren't fans and can't articulate why probably feel some of these things^.",
            "Luffy is not Nika, Bonney is.",
            "For anyone curious, I posted an objective analysis using Color Law that will explain why Bonney is as powerful as she is. Observing Color Law allows you to understand literally any story, and you will come to an absolute understanding of how and why characters act they way they do because of it. The simple answer for Bonney is, it's because of the colors she was given, which represent the objective story roles a character has and will undoubtedly follow no matter what. Here's the analysis for her colors.\n\n\nBonney's pink hair gives her the proactive story role of being dedicated towards something and someone. Hair color also dictates the type of origin story that character has, and the origin of one with pink hair is also one where the dedication of that character is based on the opposite of their origin, which we know for Bonney is by being born from the celestial dragons, but Bonney herself absolutely opposes them. Bonney's personal dedication is, as you guessed, Kuma. (side note, think about Big mom's origins and you'll see what I mean.)\n\n\nThe type of power pink gets in a story is considered open ended, as pink is the story role and color adjacent to blue (who has a similar type of power, but the rules behind it are different). the potential of that said power is based entirely on how motivated that character is at that moment (think about Koby with his Honest Impact earlier this arc). The color that determines how motivated that character can be and how they use their power is based on their eye color.\n\n\nBonney has purple eyes, which gives her the reactive story role of causing conflict, but also being the the one to resolve them, and hiding a secret (purple eyes means that the character reveal the secret themselves, in this case it's the fact that Kuma is Bonney's father). if purple was the hair color, then the type of power purple has is considered one that is overwhelmingly strong, but also hard to control. So when purple is an eye color, it uses their hair's power in an overwhelmingly strong way, but it can be hard to control, but based on the hair color, some stability can be possible.\n\n(side note, a character with silver hair with purple eyes is an example of a character being able to control their power and can go overboard with it freely, though initial training is usually involved beforehand. Examples would be Noelle Silva from black clover and Enrico Pucci from JoJo.)\n\n\nIn Bonney's case, she needed a clear idea on the type of future that can give her one that resembles Nika. The fact that all she needs to do is think of something a certain way is certainly representative of an open ended power based on being dedicated towards something, so to have an very emotional color like purple who can utilize that power in an overwhelmingly strong way, we get the result we see here, ANOTHER FREAKING NIKA like damn I felt like I Should've seen this coming but I didn't think it would go this far and I'm super excited to see what Bonney ends up doing in her new form.\n\n\nMaybe only day I'll find the time to objectively explain why Luffy acts the way he does in gear 5th (obvious hint, its due to his colors and hairstyle changing). someday the time will be right.",
            "I think we're just mad that Oda decided to empower a Vvoman.",
            "What about Kidd being cooked by shanks do you think he is a vegapunk or what",
            "Atlas is safe now. She's on a ship with two Nikas, giants and Sanji. Come on.\n\nLilith's only protection is a half baked Zoro. The other Straw Hats can't do anything (Jinbe and Robin can, but Oda doesn't care about them and never lets them go full power). Not to mention that Lucci is still around.\n\nIt's either both, or only Atlas.",
            ">Lilith will survive, and will become the scientist of the Strawhats.\n\n\n>There were two Nikas during the Void Century; Joyboy and Lili.  Bonney is the one who inherited Lili's will.  \n\n\n>Lili was never actually allied with the 20 Kingdoms.  What actually happened is that Imu offered her family a position as Celestial Dragons as a consolation for losing the war.  Lili declined, and was sentenced to death by Imu as a result.  The reason Imu is so hellbent on finding Vivi is because Imu wants to exterminate the last of the Nefertari bloodline.\n\n\n>And perhaps my spiciest theory: after Egghead, CP0 will betray the World Government and will become part of either the Grand Fleet or SWORD.",
            "The best option is Revolutionary Army coming in to save One Vegapunk, Strawhats and Giants.",
            "THEORY: Bonney's fruit is a fruit generator. Probably it was the first devil fruit ever in the past and its user created all the other ones using their imagination.\n\n\nGorosei was experimenting on artificial devil fruits on another front and now that Bonney imaginated Nika future, they can somehow make an artificial Nika fruit using her.\n\n\nI think they'll retreat kidnapping Bonney. ",
            "If Oda only let's Lillith live, I'll be a little bit disappointed. Not surprised but still disappointed.",
            "I feel like the time skip training arc is the origin of the powerscalers for one piece.  Before the training arc I don't really think there was really the idea of (training = getting stronger) in one piece.",
            "I wonder if Joyboy is meant to be two people, Joy and Boy, or if Nika inspire the original Joyboy (the person who had Bonney's abilities in the erased history) to imagine being as free as them. Besides manifesting Luffy's powers, she is also the child of a revolutionary, wanted to travel to Skypea and see Fishman Island. Seems like whatever the case, Oda dropped hints at Luffy and Bonney mirroring eachother. I'm also curious was the actual goal of that Elder's experiment was.",
            "Or we need something big enough to happen, it'll keep the Gorosei busy, as the Giant robot grab the Giants' ship and fly away.",
            "Can’t kill Atlas twice, surely?",
            "While I personally think Lilith will survive, I'm not as sure about Atlas. She still has the \"Chekhov's light-touching gloves\" and Kizaru has been out of action for a while so he may be coming back soon. I'm personally guessing that she'll heroically sacrifice herself to give everyone else a chance to leave.",
            "does Kuma's flashback count?",
            "Your interpretation goes perfectly with what Mihawk said about Luffy attracting those around him, mainly because he inspires freedom.",
            "Mihawk and Fujitora are just two characters I can think of who are shown pondering that Luffy’s true strength is not physical, but rather is ability to win people over to his causes. I believe there were others. Inspiring people is a big part of who Luffy is.",
            "Luffy has been doing this from the start.  Buggy was resigned to being a nobody until Luffy beat his ass and now he's an Emperor going after the One Piece.  Alvida was a miserable, stagnant captain of a no-name crew until Luffy beat her and then she made it to the Grand Line.  Dorry and Broggy let the whole world pass them by until the Straw Hats knocked them out of a 100-year stupor.  Crocodile was content with dominating a *kingdom*, but now he's after the world.  Jimbei was a miserable slave to his duty.  Lucci was content with slaughtering innocents.  Big Mom had grown fat and contented in her safe little archipelago and forgotten she ever cared about the One Piece.  Helmeppo was a piece of shit.  Law was running headlong into pointless suicide.  Hachi was a racist gang bastard.  Wapol was a waste of space, now a genuinely successful king.\n\nEvery single person the Straw Hats meet, even the terrible ones, are made better people afterward.  Every person they encounter who was stagnating and wasting their life away remembers their dreams.  This is the POINT!  It's not and *never has been* \"Luffy saves the world\", it's always been \"Luffy makes everyone in the world a better person\".",
            "This comment made me like the chapter significantly more.  \n\nRemember how we saw the revolutionary arm liberate towns?  The RA doesn’t just do all the work and everyone moves on their merry-way. They arm and inspire the people to liberate themselves!\n\nNow we have Nike, the “first” warrior of liberation. Luffy is not going to physically liberate everyone in the world of One Piece, but he will inspire others and will give them the tools to, again, liberate themselves.  \n\nOP is spot on as to why the elders are afraid.  Nika inspires others to liberate themselves. Those under the WG thumb all have a possible future where they know true freedom. They may not all look like Nika when are fighting back, but you could say they become part of the “liberation army”.",
            "I agree with your whole post except for this part:\n\n> However, now that she **sees** right in front of her that Nika is very much real, and that liberation is possible, she manages to come up with a fully \"free\" future of herself ...\n\n  \nI think it's almost right. I don't think only seeing Nika gave her the belief that she could become free. It was only after Luffy *said that she capable* that she was able to believe it.\n\n  \nBut I think both of us are on the right track.",
            "Yeah I agree this this interpretation. It's a literal power-up, sure. That's what her fruit lets her do. But the symbolic freedom is more of an issue to the WG.",
            "I mean... It kind of depends on what Nika's actual power is. For all intents and purposes it's actually a bit wild that despite it not really being a \"gum Gum\" fruit,  luffy has been able to use it like one without any problem at all... So, does it just alter himself and the world to how he believes it can be?\n\nRemember, Luffy still thinks he ate the gum gum fruit right? Noone has ever mentioned to LUFFY that he has some other mythical fruit. and everything he's done SO FAR are things that someone who THINKS they are using an Awoken Gum Gum Paramecia Fruit would be able to do.\n\n\nSo in theory there's still one more \"level up\" left from luffy, HIM finding out he might have more than just Rubber in his arsenal (without any knowledge of the prior joyboy or nika, that's hard to say what it might be though)",
            "What Bonney does is a symbolic/thematic representation of what Luffy has done for at least one character per arc, what Luffy represents as Nika/Joyboy, and what Luffy will do for the world as King of the Pirates.",
            "What one piece is about doesnt matter because pretty much everything before the reveal of G5 doesnt matter.",
            "One piece is about individualistic freedom versus collectivist control.\n\nSouth Korea vs North Korea",
            "He's known her for like 24 hours and she's the first person in the world ~~short of Big Mom~~ who can keep up with him at the dinner table, it'd be shocking if they weren't best friends by now.",
            "I think she'll definitely be absorbed into the Straw Hat crew, but in what capacity or to what extent, I'm not sure. I could see her being like a Momo-like character for the last saga, where she'll eventually reunite with her crew and sail with the Straw Hat Fleet, since she is a captain in her own right.   \n\nThe Straw Hat Grand Fleet needs someone to direct it since Luffy will not, and as we've seen the Fleet captains have been doing their own things, raiding Shanks' territory and stomping Celestial Dragons, so someone Luffy/Nika-like would best reign them in.",
            "Yeah there seems to be some importance. King Cobra also gave sabo the mission to give luffy theie real name",
            "Honestly, just too ambigious to really say what the hell that was supposed to be. There's too many possibilities to guess. (and there's plent of YT channels that have made the list of guesses already)\n\nI was hoping that Vegapunk would just drop what \"D\" stood for before getting cut off and have everyone react and spit out insane theories after finding out their full names were Monkey Database_error Luffy or or Monkey Dragon Dragon",
            "Maybe Vegapunk was about to reveal other monarchs that also carry the moniker of D., and so they would be great allies to the SH and others of the Clan of D. Just before Egghead we saw Cobra, in his dying breath, urging Sabo to tell the SH and Vivi that they were of the same clan. It would've truly caused the start of the upcoming civil/world-wide war if Vegapunk named the previous monarchs of D. who knew/did not know, thus unifying some kingdoms who would challenge the WG for more info.",
            "With how her fruit seems to work, she probably has what she believe should be Nika's powers. So probably not exactly the same as Luffy's but still some toonforce stuff.",
            "she has whatever powers she believes are possible",
            "she had gear 3rd powers so its possible she has em",
            "She 100% has them because it was already foreshadowed and explained. Vegapunk said that Devil Fruits are kind of like alternate paths human evolution could have taken. Her \"Distorted Future\" ability allows her to choose a different future for herself. Narratively, it has been set up why she can attain new powers this way, and at this point, she fully believes in Nika.",
            "since she has the appearance so she should has similliar power but it should be limited unlike the real one since she is not the actual users but more like a mere 'possibilities form'",
            "Dang, I didn’t even notice the resemblance to Ginny until you mentioned it. It is weird that Bonney’s usage of her DF is controversial all of a sudden, because I know for a fact people would’ve questioned “Why didn’t she do x” after having an entire arc of showing her DF’s potential.",
            ">Also, this moment isn't about a power up for Bonney. If you were actually paying attention, you'd see how connected Nika is to Bonney's family. How the idea of Nika finally setting them free was around from Kuma's childhood.\n\n> Bonney becoming Nika for a moment isn't a power up to day \"Bonney is top 5!!!\". It's a cathartic moment for her whole family and them finally being free from being slaves and victims of the WG.\n\nListen, I agree that this is a great moment for her story arc... but it's ALSO kind of OP if she actually is able to go full luffy G5 on them. It can be a great story moment AND OP as hell.\n\nThat being said: I 100% agree with you. I feel like everyone I talked to saw this coming as soon as she did the first distorted future, I thought it was pretty clear it was leading to this moment for her.",
            "[removed]",
            "Methinks her fruit power is about \"tapping\" realities, you know the whole concept of the spider-web that marvel uses on spider-man? its not only about believing, but also reality-in-another-dimension.\n\nBasically her fruit is able to warp her body to any dimension she \"believes exist\", so when she goes full giant mode, its a reality she IS a giant, this time she IS nika herself. Just like Luffy being able to do something so absurd like bending reality, she is basically time-space bending too. This also would explain why she can only change other people age, being young or old is basically the only thing she can make a third party tap.\n\n  \nAbout copying fruits.... i don't think its possible though, this Nika copy seems very specific to Luffy's power himself. She didn't copied his fruit, just a future where she is free, maybe this form IS the peak someone can be free, not the fruit but joyboy herself.",
            "For the record, With what we CURRENTLY know. Her powers do seem insanely strong and OP. She is a kid, kids have very active imaginations and are easily convinced of things. \n\nConvincing her she could grow up and become unstoppable is not something that's impossible to convince a 12 year old, and Bonney's fruit would Let her make that real. \n\nIn the specific case of bonney and her situation, yeah, it's strong as heck. \n\n\nHOWEVER: I strongly suspect that next chapter we will see that there's some major flaw/weakness/limitation to her abllity, wether it's something like what you said, where her self certainty gets broken and so does her ability, or some simple limitation of \"once you pull that version from the future it can't exist again exactly the same.\"\n\nI don't think she's going to pull the Nika future out again after this fight one way or another.",
            "Good question, they can only be incapacitated somehow due to regen. Guessing some kind of Punk or ancient technology not destroyed at this point will help. Maybe a \"lock\" technique like Diamante used to turn off something that was turned rubbery with gear 5 back to a solid?",
            "There is that vat of organoids that we saw in chapter 1075.  I can see Pythagoras and Shaka being restored from their last memory backups.  Shaka will be harder, better, faster, stronger!",
            "He will do a solar flare and blend everyone. Oda loves DBZ and I could see Kizaru having such technique.",
            "Separately, it always being sunny at Ennies Lobby could be foreshadowing for Kizaru's awakening. That light was said to serve as a stark reminder of the government's presence (or something), but this light would serve as a stark reminder of the coming dawn.",
            "I think seeing Bonney turn into Nika will break his brain like a twig.  He's already at the edge after this whole incident, and I don't think witnessing that will let him stay in the \"gray area\" anymore.",
            "That could be wild. If \"Light logia\" awakening means he can just control all nearby ambient light and pull it into himself, he could in theory just basically make an eclipse for just egghead.",
            "I've really been enjoying Kizaru in this arc for the way he's been portrayed: Clearly in a highly conflicted situation, but giving very little insight into his thought process. What's he actually thinking about the Elders and the orders they're giving him? Does he still see them as the authority on Justice? Is Vegapunk actually deserving to die, for his \"sins\"? \n\n\"Unclear justice\", indeed.\n\nI've long thought of the admirals as a very nicely crafted themeatic element that they are \"forces of nature\". In one sense that dovetails with the way Logia powers were introduced to the story, and though they don't have a monopoly on them, they do take the concept one step further when it comes to just how daunting it is to face them. Earlier in the story, an admiral being in play was a sign that the situation is truly hopeless. The theme also extends to drive home just how much of a beast Garp is, that he was considered for promotion but refused for ethical reasons, and it's also nicely fleshed out with the addition of Fujitora with his on-theme paramecia.\n\nNow that the story has reached a point where that thematic wall has been passed, I'm very interested in how Kizaru ends up. Kizaru feels to me like he's due for a retirement, and I expect it to happen on his terms. Earlier in the arc I was imagining he'd end up sort of breaking off to go be the \"don't bother us\" factor for the \"Vegapunk family\", but now it feels like that group is going to be more a few scattered individuals.\n\nI wonder if he could end up awakening and in the process just sort of ascending to a level that's like, scarier that admirals currently are, but also in a zen-like way just becoming a presence, rather than a player. Like, anywhere the sun is shining he's \"present\", but maybe he's just kind of screwing off, doing the Nika dance, casting shadows in that likeness and in theory able to manifest and wreck things, but... will he? Unclear.",
            "I don't think we'll see kizaru's awakening - it's just too overpowered. If he's able to convert mass into light that's some nuclear shit",
            "im not surpise Vegapunk message end up opening his eye and this gonna affect his next action later. not necessary during this arc but what he could do in future plot.",
            "Oh shit, yeah. I don't know how Kizaru emotionally recovers from that one.",
            "Listen, I have no issue with Bonney going into Nika mode, I think it was pretty obviously leading to this. \n\nI Agree that it makes sense that Bonney can become nika. But I don't think that your explanation answers the questions you attempted to answer. \n\nYou just talked about her story arc and character growth story beats, that wouldn't actually explain WHY she CAN become nika. It justifies why from a writing perspective it makes sense that she would.  It doesn't explain Why she has the ability to do so. \n\nThe explanation for why she can become nika, is because her devil fruit has the pretty crazy ability to let her age herself  and not just into an older version of the current Bonney, but into any future version of herself that she has the ability to believe in. That's why when Nika-Luffy had that moment with her, she could then become a version of herself like that too.",
            "Yeah not sure why people have an issue with this tbh - seems pretty well explained and obviously she won't be as powerful as Luffy with it",
            "Apart from the gags and the not-deaths, one piece has been quite logical for the most part. So, this bonney-nika, which is a result of desire and belief to be free, must be powered by something (something with the power to convert imagination into reality). What is it?\n\n1. Is it Luffy's fruit?\n2. Is it Bonney's fruit?\n3. Is it the combination of both?\n4. Is it the underlying nature of people in One Piece?",
            "“Peak writing” man the koolaid being guzzled down in this subreddit is insane",
            "Dunno why you were downvoted. I'm quite sure elders do not use devil fruits. After all, they want to sink the world - a clear jab at the \"fake gods\" that are df users.",
            "Where?",
            "I mean she was able to turn into a giant and the distorted future broke pretty damn fast. It's probably going to only last for a few attacks. Nika-Luffy drains him and he's had a rubber body for like 10 years.",
            "And everyone fighting as they please; honestly I think it really fits.",
            "My money is still on Lilith ending up with Neo-MADS somehow.",
            "Pretty much. If she believes something is possible, she can use Distorted Future to make it happen. She turns herself into whatever form that may take.",
            "Naturally, It's a Super Saiyan bargain sale!",
            "kinda begs the question as to why Saturn experimented with this power, there could be a sinister timeline with an even more op transformation out there",
            "> How come Bonney can become Gear 5. Could her Devil Fruit pull from different timelines? One where she eats the Nika Nika no mi instead of Luffy?\n\nHer fruit operates on belief in potential futures. Nika inspires her to believe in a future where she has the powers of Nika. She borrows from that future, and a form where she is Nika manifests. If she truly believed that one day she'll have Kizaru's fruit, she might be able to manifest a lightspeed punch.",
            "Its not timeline\n\nShe just changes her lineage factor to that of the desired fruit",
            "in another timeline she eats the Nika fruit and awakens it. If you pay attention to her character you'll see that she's worthy of awakening it",
            "I agree. Bonney being able to pull something like becoming Nika-like is really downplaying the hype we have for G5. Then what’s the difference between the two? Also I’d like to have thorough explanation for her powers",
            "Yes, she's turning into an alternate timeline version of her future self that had eaten the Hito Hito no Mi: Model Nika. One where presumably Luffy never ate the fruit and she ended up with it instead.\n\nThis isn't some new revelation, we've known she's been able to transform into alternate future versions of herself for ages now.",
            "first thing i think of when you say that: the Nika Fruit is like a stem cell that hasn't derived it's purpose and thus can do anything.\n\nevery other devil fruit is \"matured\" and has a purpose. But by paring the fruit's effect back and think of how to be fully free can tap the powers of Nika-- unlimited freedom and dreams",
            "Your theory is great but it will ruin the excitement",
            "Nika is literally her childhood superhero she def its interested in being Nika lol",
            "She's really easy to tell apart from G5 Luffy tbh. Different clothes, different figure, Kneehighs and boots compared to luffys sandals, Similar Face, except the makeup, eyebrows and cheek peircing, Similar but not exactly the same hair, No hat...",
            "She also called him Luffy not Strawhat. Don't know if that is something, but I noticed it somehow.",
            "I’ve been saying this. I remember everyone saying I was stupid, BUT I think she’s gonna join the straw hats or join the revolutionary army (given that she can control pacifistas and they need an army) but as a straw hat, she’ll fulfill that cabin boy role like Shanks/Buggy did, and now she can even replicate Luffy’s powers. I think it would be so cool to see Luffy train someone else, but I’d be more than happy to see her with the Revs. Either way, super excited to see what Oda does next for this character",
            "I definitely agree and have been thinking this as well since she entered the Kuma room. And yeah Luffy’s been super consistent with using her actual name since the beginning of the arc which is pretty big (and she’s also started calling him “Luffy” since the flashback, and even though she called called him “Straw Hat” maybe twice I don’t really see that as outweighing everything else)! \n\nAs this arc continues it feels like everything is falling into place for this possibility with all of the pacifistas getting neutralized, her getting to interact with the crew quite a bit, Luffy teaching Bonney how to throw a punch (and now inspiring her this chapter) and Vegapunk asking Luffy to look out for her (just like with Robin).\n\nPersonally I would be shocked if she didn’t join the crew after this, she’s easily the strongest candidate since Jimbei",
            "Not surprising since Ni = 2",
            "Have you not read the chapter that this reddit post is focused about discussing theories around?",
            "while they all yell \"Freedom\" at the top their lungs braveheart style",
            "I thought about this as well. I was also thinking about the luffy is going to eat it theory and thought about what if that is the one piece, like laugh tale is a place this flame comes from but for some reason only manifests every so many hundreds of years. Why Roger was “early” and they laughed is because of a ridiculous story of zunesha accidentally eating the flame which could also explain zuneshas longevity. In this imaginary scenario I could see the “mother flame” being the origin story for devil fruits as well.",
            "It's pretty much exactly the same as gear 5 reveal.\n\nPeople who prefer battle mangas are mad, people who like adventure are happy",
            "Depending on how old the gorosei are, Nosjuro (a pretty Wano style name) could BE a Kozuki.",
            "Yeah, that's what's supposed to happen considering how he has been written.",
            "That's presumably from Luffy transforming in that panel. I don't think the WG has any more charges left and the big earthquake was an aftereffect that happened 6 days after Lulusia was destroyed.",
            "It would be really funny if truly Luffy did NOT have a mythical zoan and he was right about not being nika. Its possible the legend of joyboy and nika were created around the fruit and possibly not the other way around. What made the fruit special is that the only two known users of said fruit were warriors of liberation, Luffy and Joyboy. Although i admit this thought has its flaws esp with how weve seen G5 with the clouds on his back unlike doffy/law/kidd with their awakened paramecia\n\nedit: also bonney being able to access this nika form is funny because when she thought of a nikaish future, she did not look like nika(probably because she did not realise G5 was how it looked like). Could lend more to the fact that truly This awakening form is not neccessarily that of the sun god nika but what joyboy and now luffy make of it, their ideas of absolute freedom. Hence why Bonney only accesses this form when she imagines herself absolutely free",
            "So now fans can't even criticise a chapter they r following for years?? 🤦🤦 I ain't hating ..just want an explanation for Bonney copying a df awakening (not a devil fruit but its awakening too I repeat) is not something you can expect everyone to \"accept\" .",
            "Have the same question and I hope she will join.",
            "The Giant Robot has to swim back up to the surface. I hope he has propellers tucked in for a day like this",
            "Finally rewarded with Celestial Dragon status!\\*\n\n\\*(TN: \"locked in a windowless room and given nothing but the tools and orders to make weapons for the rest of her life\")",
            "That would be an appropriate limitation for her DF. Like in Naruto the sharingan can't copy kekkei genkai(blood line trait). \nHowever couldn't she just be like \"Show me a future where I was born as a Germa 66 super solder\" and it would work just the same",
            "She became a giant, I actually don’t think there are dna or genetic limitations. The fact that she’s able to copy devil fruit powers despite it being impossible for her to obtain two fruits means that as long as she can imagine it she can become it. It is a huge deus ex machina, and definitely not what Bonney’s powers were originally. She has reality warping powers where she can effect her own and your body however she pleases.",
            "Only if she believes it's possible.\n\nRead the previous few panels.  Bonney was not for a second going to be able to turn into Nika until Luffy specifically told her she can totally do it.\n\nIf Zoro or Mihawk told her that they believe she can match them in a sword fight if she puts the work into it, then she could totally Distorted Future to do it.  But prior to one of them telling her that, she probably does not believe she can become a sword master.",
            "You put into words my exact issue with it. Plus i'm just not really feeling that much of a connection between Bonney and Luffy. It's almost like she only cares about Nika and not really about who Luffy is as a person, and the fact that she barely interacted with the rest of the crew makes this moment feel really detached from the actual protagonists.",
            "They are kinda cornered tho, Mars is flying around and presumably has regen like the other elders. They need a hail mary to stop Mars from pursuing them, in addition to all the other elders now coming for them.",
            "Hopefully so luffy can stop using G5",
            "I'm confused, since Big Mom, Perona, Rebcca and Bonney have pink hair... They all have the same aspects which \"represent the objective story roles a character has and will undoubtedly follow no matter what.\"?\n\nAnd that these story roles also apply to character with the same eye hair combo, Like bonney who in the manga art very clearly has brown eyes making her match up with what Kakyoin has in Jojo, Madoka, Natsu Dragneel, and Itadori Yuji in terms of their story roles?\n\nAm I reading this right?",
            "wtf bro",
            "Guys y’all downvoting just to feel good about yourselves but deepdown you know it’s true.\n\nIf it was Ace that Oda brought back from the dead to make Nika2, or even Sabo, Kobby, or Usopp, you would be screaming ‘Oda is a genious’, ‘master Oda’ ‘foreshadowing master’, blablabla.\n\nBut because it’s Bonney,…",
            "no we’re mad because it’s stupid",
            "Edison is still alive too, York doesn't know about him because he disconnected from punk records",
            "doesnt really make any sense. Then why did Imu let the Nefetari live for 800 years? Lili is Vivis grand grand grand grand aunt. After Lili disappered her brother took the throne, so Lili and Vivi are not really 100% blood related.",
            "Bonney posessing the origin of the fruits seems plausible to me because why else risk letting out the biggest threat to your power unless you knew you could benefit greatly from controlling that power. Seeing as at least one elder was immune to Bonney's aging ability, perhaps Joyboy betrayed Imu/the elders or their ancestors and Nika was the ultimate expression of liberating the world before the war ended with cataclysm.",
            "Am i the only one who thinks the Gorosei need something to happen on their side in order to bring back the sense of foreboding? They have been getting cleaned and are Sorry as hell.\n\nI feel like they all 5 ulted and they missed their skillshots.\n\nI think they might use Uranus on the Giant Island, especially since ALL of the important giants seem to not be on it right now. (is shanks still there? I don't know. Also... Does Uranus destroy a poneglyph?)\n\nBut like with the Double Nika on Strahats side, it really does FEEL like the WG isn't the big threat they have acted like so far. Not to mention Bonney can still override all the Pacifistas iirc, (im not sure on the seraphim, but maybe them?) \n\nLuffy still has other folks that are on his side that aren't even here, but like 60% of the big hitters for the World Government are on deck. The Gorosei, An Admiral, All the Seraphim, Lucci's Gang... \n\nBut Luffy and Co have been walking all over them for the most part? Sure they are \"running away\" but Luffy's crew is just one small crew (even if they are an emperors crew now). \n\nLike imagine for example, The Gorosei actually do capture Luffy and try to execute him like Ace. \n\nI'm pretty sure the people that would show up to free luffy would easily jump the WG even with 3 admirals, the Seraphim and all 5 gorosei.\n\nRedhair Pirates, The Strwhat feet, White Beards remnants and the Revolutionary army, Wano Freinds, They would EASILY stomp out the full WG forces at this point. \n\n\nThe WG needs to show off some power or their ass is looking weak as hell.",
            "Zoros since of direction is so bad he's gonna jump up instead of down",
            "That big thing is going to be the giant coming back",
            "The gloves will be given to Usopp, that`ll integrate their technology  into his Kaubto and Nami’s clima tact.",
            "She's literally in a ship with\n\nGiants\n\nSanji\n\nTwo Nikas\n\n\nPretty sure she will be fine. Lilith is the one I'm worried about .",
            "I still think the hologram touching gloves might have just been for some fun flavor and not a thing specifically for Kizaru.\n\nLike the Infinite food machine isn't a chekhov for \"infinte duration g5\" despite it's introduction at the same time.\n\nI might be wrong, but it feels like that chance has passed.\n\n\nBut also, Yeah I agree with you on the Lilith part, I hope she's the one that gets to come along, I think she's got the most interesting personality and fits the best for the crew if she's gonna be a short or long term Strawhat. Atlas is fine too, she's just a bit flatter of a character in terms of being a satellite  IMO.",
            "im not suprise turn out all Vegapunks aside Stella is survive. Oda rarely kill character. after this the remaining survivor that not with Strawhat might end up go on their separate path and we gonna has chapter cover story for that.",
            "Vegapunk flashback. 😄 We know typically when someone would die in manga, there's a flashback of their life. There was none for VP. 😁",
            "The best part of this is that Luffy does this by being an example, by actions, instead of talking people out of their genocide minds.",
            "Shout out to sanji transforming Duval",
            "Until their buddy Kuma needs some help then the RA just looks east",
            "I mean, it's possible. \n\nCould also technically be both. \n\nAFAIK all of Bonney's Distorted futures have been futures that bonney would reasonably think are kind of possible even from a juvenile understanding of the world. SHE thinks of herself as Kuma's daughter so of course she could have been a buccaneer etc.\n\nThat being said. Nika's actual abilities could still be anything up to full on reality warping tier.\n\nWho knows what Luffy can do, He doesn't even know what he can do.",
            "I'm just going to say that one way or another, I think this will be the last time we see Bonney turn into Nika.\n\nEither it's revealed there's some limitation, or she dies, or she just bails and goes to live with Atlas and the Kuma,  I don't think we will be seeing Bonney doing this ever again. She's definitely popping her ult.",
            "Truly an insane devil fruit for an kid and comical that some old dudes thought it was useless.",
            "ironically enough, that described Nika almost to a T",
            "It's really insane. \n\nSome of them are clearly powerscalers made about their headcanon. Some have an agenda from a certain subreddit, but for the rest?  Many have predicted this for months now, and the story has been building up for it! Like are we even reading the same arc?",
            "I'm not really that worried about it because have we seen her use Distorted future for more than a single attack? At most, I think she could keep it up for a few moments, but nowhere even close to Luffy's limit. Strong, but not too OP.\n\nNot to mention, I don't think I saw Haki around her, so she's nowhere close to being as strong in Haki to Luffy or other Yonko. At least that's how I see it.",
            "[removed]",
            "[removed]",
            "That is interesting but goes against how saturn described it working",
            "> For the record, With what we CURRENTLY know. Her powers do seem insanely strong and OP. She is a kid, kids have very active imaginations and are easily convinced of things.\n\n> Convincing her she could grow up and become unstoppable is not something that's impossible to convince a 12 year old, and Bonney's fruit would Let her make that real. \n\nthis. it is a power that fit a kid as they has bigger imagination than adult while adult imagination is bound to logic and limit. this is also indicate what she could do would gradually lesser once she grow up later. not suprise if she can has Nika form right now but once she grow adult, she cant do it anymore.",
            "Her precence is sufficient to activate the robot, so she can rest on the bench while luffy does all the work",
            "That, that don’t kill you only makes you stronger",
            "Oh interesting. I was thinking the opposite and that he makes eternal light. Like how paramecia turn everything to strings/mochi/rubber, logia would also alter the environment by awakening in the form of permanent weather changes.\n\nWhen the Straw Hats first got to the New World, there was an island plagued by never ending lightning. Maybe a previous user of Enel’s fruit awakened there?",
            "Oda never kills characters, but him atoning for HIS sins to his friends by sacrificing himself feels heavy and appropriate. Maybe the elders just capture him, but the foreshadowing of him breaking free from their control is too heavy for it not to happen in some way.\n\nBut also yes I agree that what the admirals represented pre time skip has been made largely irrelevant now, so what’s the role for them in the rest of the story? Especially given Vegapunk’s revelations? They have a misguided sense of justice, sure, but they don’t want to drown the world and kill everybody",
            "It might take something like that to stop the 5 elders from getting to the Straw Hats now that the giant robot is out. We still don’t know what logia awakening is, so super speculative if Kizaru uses that or just generally gets in their way",
            "The problem that most people had was that they were saying that is is bad writing and that one piece is a Disney series and other nonsense so that was what I was trying to clarify. Most people I see already know her her fruit works",
            "I'd like to believe the fourth option because I highly believe in the theory of two sides combining to become one piece and seems like a bit of a foreshadowing to it.",
            "It’s Bonney’s fruit. This is a pre-established power",
            "I see it as the original warrior of liberation probably had several followers, other warriors of liberation. so the powers tapped into each-other *somehow*.\n\nbut I think what is happening here is that bonneys fruit is doing most the heavy lifting here, not nika.\n\nbut idfk at this point, let oda cook before freaking out is my motto",
            "It's Bonney's Fruit. \n\nJust Bonney's Fruit.\n\nBonney's Distorted future to this point has shown exactly 2 requirements. 1. She has to have seen or heard about the ability (incredibly easy) 2. She Seems like she has needed someone she trusts to tell her she can be like that person somehow.\n\n\nBonney Has Transformed into a buccaneer via Distorted Future. Bonney is not a buccaneer. Kuma told Bonney she is his daughter. Bonney knows what Bucaneers can do. \n\nBonney Transforms into Nika the first time.\nBonney uses a gear 3 punch, Bonney has heard some tales about Nika from Kuma. Kuma says you can be free like nika.\n\nBonney Transforms into G5 Nika. Bonney has seen G5 Luffy, Nika/Luffy who she trusts tells her she can be free. \n\nShe fulfilled her fruits requirements to Pull a G5 Nika Bonney from the distorted future. \n\nWhy are people not thinking the same fruit that Turned Bonney into G3 Luffy in her flashback couldn't also do G5 Luffy/Nika?",
            "I don't know why you got downvoted, vegapunk literally told us his theory is that devil fruits were manifestations of people wanting to be like this or that. Somehow, somewhere, people's desires turned physical. It makes the most sense it's an innate ability of humankind in one piece instead of devil fruits making devil fruits.",
            "Peaking writing is a bit effusive, I agree, but OP is a story about people, their history, and their beliefs. That Bonney can transform into \"Nika\" as a new manifestation of her power is merely a means to an end, the end being her realizing she's finally free from the horrors of her and her family's past at the hands of the CDs. By becoming one of the elders' worst nightmare, she's ready to bring justice to her parents' pain.",
            "No you just don’t get it! This was heavily foreshadowed at the beginning of THIS ARC! It is you who is too dim to understand that this was fore skinned for such a LOOONG time. Huge foreskinning! You just don’t get it!",
            "They live on the Red Line and hardly ever leave it as Saturn mentioned. I don't think they worry about the sea level rise/world sinking.\n\nUntil it's obviously stated or shown otherwise, they're likely DF users as their zoan forms are consistent with awakened DFs--i.e., the black clouds. Just because their intro names didn't have \"x fruit: model y\" doesn't mean they are \"demons.\" Not sure why people leap to this conclusion as they could very well be seraphim-like constructs.",
            "Just another case of them being conflictingly inept. They seem to be reasonably wise on some matters, such as the Ohara eradication, the witch hunt for Roger's offspring, and to provide a more relevant examples: them weighing the option of angering kaido or the eliminating luffy directly on the off chance he awakens (if you ignore the fact it took them this long into the series to start thinking about it lol), and Saturn himself even knows how Bonney's fruit works as he explicitly tells her why her initial mimcry of Nika failed. Knowing all this, you'd think he'd have some implicit knowledge of the potential capabilities the fruit holds, but eh. Now that I wrote out all this, I guess it is consistent with how they treated luffy and his fruit.",
            "I think it amped the hype up, personally.   \nIt makes Nika something much more than a SSJ4 Luffy, it makes it a true symble of liberation that it's not exclusive to the wielder of the fruit.",
            "I feel the same way. It's gonna come down to how it's written. Guess we'll wait and see.",
            "Obviously clothes are different, mostly talking about close ups on the face, like in this chapter",
            "not really? i absolutely love g5 but this is only making me dislike bonney thing even more",
            "ayo i never thought about that. what if he is the ancestor of ryuma LMAO that would make him  and zoro relatives.  thers no way nusjuro is kozuki tbh cuz the only kozuki we know that actually fought is oden but everyone else just MADE swords so idk.",
            "With the smoke its confirmed that Oda wanted to move it to the zoan class. I'm still sad about it. Like it would fit narratively and thematically much better to have a weak fruit but thanks to his creativity and mindset he can make it work and thus becoming the Warrior of Liberation, instead of this heavy handed mythical zoan sun god route.",
            "We already knew she can distort her future depending on what she believes it's not like this was asspulled out of nowhere. Also, Power replication can be a power in of itself, Monoma from my hero academia has the ability to copy other people's power. Just because she can go gear 5th also doesn't automatically mean she's powerful like luffy is, she doesn't even have haki. Having a strong devil fruit doesn't mean your just yonko level now, look at Momo he has a copy of Kaido's devilfruit but he's still weak af outside of dragon form. Haki is all that matters.",
            "Yea one of those things where she's like immediately more important to thr story than most of the strawhats now but we've only really known her for 1 arc",
            "Personally I don't see them as cornered at all, especially when Luffy alone is enough to handle Mars and Sanji is there too but he's not doing anything. I think they were actually cornered earlier in the arc when all 5 gorosei pulled up, or when it was Saturn and Kizaru against them. This feels like they're almost home free and they need one last push.",
            "What's wrong with G5?",
            "Yea but thing is with Bonney is that the anime has her with purple eyes and her reactive story role follows the story role of purple exactly. It's the same with how Araki will color his characters any way he likes on cover pages and the like, but he has to give the anime producers certain colors that actually represent the objective story roles that character was given. It is interesting that Oda changes up the colors for some of his characters, like he did for Law by changing his hair iirc but just like Bonney, the colors that Law has in the anime are the ones that represent his objective story roles. \n\nAs much as I feel like I should be following the manga's colors, by observing Color Law over time I've come to understand that the story is actually bigger than the author themselves.\n\nSo for your examples, I know for a fact that Natsu and Itadori share the same story roles when it comes the combination of their hair color (the proactive story role that the story gives the character and the character themselves are aware of it) and their eye color (the reactive story role that represents the characters own personal arc and growth). Since storytelling is a subjective act, they clearly won't act the same way since that is entirely dependent on the author (and the hairstyle of the character but I won't go into that for now) but these characters do follow the same objective path and will hit similar crossroads, but it will just be told in a different way. \n\n\nBrown is a special color in storytelling since it is the representation of realism, whereas the colors on the typical color wheel represent idealism. When brown interacts with an idealistic color, it \"hinders\" the role of that color, making it act outside of its objective purpose. This means that with pink's role of dedication, a character with pink hair and brown eyes would be one who doesn't stick to being dedicated to one thing, but would rather take on multiple things or people to dedicate themselves to. This also causes that character to lose motivation easily, as ideally the story role of pink sticks to one thing and person to be dedicated to and they will put their absolute all into it. Pretty idealistic outlook, right? This is what makes brown such a fun color to observe in storytelling because it forces every color it interacts with to act outside of its objective, idealistic role.\n\nWith Kakyoin though, he does have pink hair, but his eyes are considered burnt orange, so he would have the reactive story role of desire and naivety, which are the objective story roles of orange. I don't recall Kakyoin doing anything where his reactions would be considered part of the role of brown.\n\nAnd for Madoka, she seems to be someone with both pink hair and pink eyes and from what I remember from watching it years ago, yea Madoka would definitely have to have pink eyes in order to pull off what she did in that anime and movie.",
            "The immortality factor and their designs still make them frightening, IMO. It's very T-800/T-1000 for me - you can knock them down, but they keep coming back.\n\nAlso, Atlas is totally dying before this is over. Dune Sand Worm has been too quiet.",
            "> Not to mention Bonney can still override all the Pacifistas iirc, (im not sure on the seraphim, but maybe them?)\n\nVegapunk stated that she has authority over all the clones of her Dad, anyone who looks like Kuma, so that she can never be killed by her dad, basically. So the only seraphim she has power over is S-Bear.",
            "enel will come back with an army and also black beard is a threat i think its going to be a FFA",
            "- theve been fighting with their hands tied behind their backs due to not wanting to blow up the entire island. \n\n- invested heavily into a robot army which backfired\n\n- they are the WG, they don't exactly have a track record of fair 1:1 fights. They use the marines or subterfuge. This embarrassment will piss them off. \n\n- Imu hasn't even arrived yet",
            "Vegapunk's still alive in his satellites tho, they could be the ones narrating his story",
            "“…”",
            "If Oda is not even willing to kill Spandam what makes you think he will kill a child",
            "TBF that actually makes sense.\n\nAnd old guy set in his ways knows how the world works and already knows his limits.\n\nA child doesn't.",
            "Maybe the most powerfull fruit in One Piece as long it is in an kids hands.  \nLuffy with that thing as a Kid would terrify the world.",
            "The only moral thing to do is to antagonize powerscalers by being:\n\n1) inconsistent and wrong\n\n2) really smug about it, insistent that you're right and they're stupid\n\nThis is the most annoying thing for a powerscaler to read. Teach them the pain of trying to make a 25 year manga adhere to strict continuity and powerscaling rules. Remember, the goal is to be incredibly un-fun to talk to and constantly present in their spaces, so much so that they either quit the series or quit powerscaling. This is how we purify our community.",
            "[removed]",
            "[removed]",
            "... What? I mean, I guess i don't know for sure that it's not option 4. \n\n\nBut I feel like when we see the girl who has a devil fruit power which we have seen turn her into 3 different versions of herself all as copies of people she trusts/respects. (Kuma, Story-Nika, Giant) \n\nWhen she has a very clear moment of bonding with G5 LuffyNika, and then she turns into a copy of G5 luffyNika. \n\nI feel like it's Probably just the same thing we've seen happen 3 times before, Bonney's Fruit doing exactly what we have been told, and shown it can do. \n\nIs there ANY evidence that it's not just her power? I mean... just before she turns into G5 Nika-bonney, she calls out \"distorted future\"",
            "It's more so that the Gorosei seem to be pretty unable to imagine or think outside the box on most things. \n\nIf they see one person with a power and that person uses it poorly they think \"oh that's a weak ass power\" and don't try to think of creative aspects of it's use. \n\nIt also fits into the overall thematic of them being contrasted against freedom and creativity.",
            "Reddit didn't exist when Vegeta figured out Super Saiyan but I assume if it did, there'd be people screaming about how it \"devalues\" Goku's achievement.",
            "I don't understand your perspective. Personally, the second we first saw distorted future, I saw this coming, and when it was revealed by Saturn that Bonnie's perception of reality affected her powers, it 100% cemented that when she saw luffy in action she would mimic G5. I thought this was well developed storytelling and really completes Bonnie's growth in the arc in a way that complements Kuma's backstory in a really satisfying way. These are the kind of stories I've enjoyed in one piece since I started reading in 2006, and the reason I am still reading (I took a 3 year hiatus I hated punk hazard so much mind you lol so I can't judge anyone reacting). Different enjoyment reasons are why people are reacting, just like when G5 was revealed or when Luffy and Lucci fought on egghead or when Greenbull was spooked by shanks. Weekly reading as opposed to reading in bulk changes the way we take things in as well. I first caught up in Marine Ford and mentioned I got so fed up by Punk Hazard I quit for years, lol. I get it I swear!",
            "Mars regenerates and continues his pursuit. Luffy et al haven't figured out how to address that bit. I suppose he could just punch Mars into the sea and that takes him out of commission, assuming they are DF users.",
            "I mean, \"dies\" could also mean \"injured and cant do anything for a while\" I just think she won't be going Nika again in the future.",
            "He didn't even kill Tama when *Kaido* attacked her lol",
            "If they had access to the fruit for experimenting they probably went through a few trials with it too, you could imagine them feeding it to various Celestial Dragons over a few generations who don't have any hopes or dreams whatsoever, and it would indeed be truly useless then.",
            "Assuming that like Nika and like the Flame Fruit, most of these fruit have gone through multiple users. \n\nIf the last user of the Age fruit was a older to middle aged person, yeah the fruit could have sucked.\n\nBut there's a LOT of fruit that seem like they would suck that have been absolutely insane after someone made them that way. \n\nLook at brooks fruit and what brook can do now. On paper Yomi Yomi is borderline worthless.  If you die of old age it probably wouldnt even save you, as long as you instantly find your body, it doesn't do anything for you till you die... It's like F- tier of fruit.\n\nBut Brook has found a way to use it in some wild ways that weren't in the bingo book of devil fruit, and he's like... legimately up in the top 6 most powerful members on a Yonko's crew? He can probably run the Ones with a Vice Admiral.",
            "I can't tell if this is serious or not an that's concerning.",
            "Im ngl i l sort of like the new chapter but this is a crazy thing to say, dont generalize them as all \"toxic\".",
            "Vegeta went super saiyan, because he was obsessed with being the strongest and trained hard AF and self-reflecting after feeling 2nd to goku. Bonney just does this shit, imagine if vegeta went SS as soon as he had seen gokus form.",
            "I don't think 1 gorosei chasing them counts as \"cornered\" when we know how strong G5 Luffy is, and he just recharged off a fresh pile of food. Maybe for you it felt like \"an all odds stacked against the strawhats\" moment but it didn't for me.",
            "Their whole MO is pointing out illogically argued logical fallacies and shitting on the series. It's incredibly negative, sad, and toxic in its nature. It's fine to point out flaws but if that's your only thing then why are you even following the series. It's absolutely insane.",
            "Bonney was conceived from two years of rape of a woman who had previously escaped slavery then was captured again, in an isolated fascist capital city, experimented on by an immortal demon, inflicted intentionally with a terminal illness in the womb, cast out of the city like a broken toy to die and rot, raised by her mother's beloved locked inside a church like a vampire due to being deathly allergic to sunlight, watched her homeland be slowly and progressively ravaged by a deplorable king who did it all to impress the very same fascists who destroyed her parents' families, forcibly abandoned by her father trying to cure her disease on condition he never sees her again *given as a condition by the creature who inflicted the disease on her in the first place*, had her father's letters stolen from her, had her father unknowingly transformed into a mindless cyborg under the orders of the man who ruined her family's lives, was imprisoned in her own home despite promises to the contrary by the fascists' secret police, at the age of 10 the subject of being WANTED DEAD OR ALIVE for the crime of leaving her own home, watched the man who destroyed her family kill all the rest of her friends, finally met her mindless husk of a father on his last inch of life, and then;\n\nThe man who wholly embodies the spirit of freedom and liberation to such a degree that he no longer even has to obey the laws of reality, and whose worship is the exact reason that her family was targeted by the immortal demon in the first place, looked directly at her and said that she is allowed to be as free as him.\n\nAnd you would prefer if the answer to that was actually **NO**?  She's not allowed?\n\nYou need to take a break.  Log off now."
        ]
    },
    "[Breaking News] Furuya Toru has resigned from voicing Sabo of One Piece (alongside his role in Detective Conan)": {
        "title": "[Breaking News] Furuya Toru has resigned from voicing Sabo of One Piece (alongside his role in Detective Conan)",
        "score": 241,
        "url": "https://www.oricon.co.jp/news/2332992/full/",
        "content": "",
        "num_comments": 30,
        "comments": [
            "**Context:**\n\nIn relations to the incident revealed on May 22nd which revealed Furuya Toru and his relationship with a woman of 37 years younger than him which involved physical assault, forced abortion and etc., Furuya Toru has decided to remove himself from voicing Sabo of One Piece and Amuro Toru of Detective Conan.\n\n>(No mention of what will happen to his future roles for Amuro Ray of any Mobile Suit Gundam related media such as the mobile game Mobile Suit Gundam U.C. Engage)",
            "And here i was hoping that Sabo vs Shanks could happen for shits and giggles. \n\n  \nSabo is voiced by Amuro and Shanks by Char's VA repectively.",
            "Looks like Imu successuflly bombed Sabo in the anime",
            "Now who's gonna voice Sabo now?\n\nHope they find a good replacement",
            "Yuki Kaji would be good for Sabo.",
            "Would be cool if they bring back Naruto’s VA for Sabo ",
            "What is this r/nba? We got VA free agency?",
            "Imu sama power extends beyond dimensions",
            "Sabo’s such a bit part character that I wouldn’t notice the difference. Also he looks like a snooker player in this photo.",
            "Just have Naruto VA voice old Sabo too! (not sure why they changed it when he did young Sabo)",
            "🫡",
            "Damn, another abuser. Hate to see it, get him tf out of here.",
            "For those wondering, he's 70 and she's 33.",
            "\"And etc.\" just feels so dehumanizing of the whole situation.",
            "Too soon.  Nah jk🤣",
            "Japan has a lot of great voice actor. Don’t worry.",
            "Ace’s voice actor",
            "Would be a decent choice, he's a huge VA who somehow hasn't had a  proper role in One Piece, just a minor character in Film Red.",
            "Datebayo",
            "That would be a weird af transition.. having a deep man voice and then going back to his kid voice randomly",
            "Doesn't fit the character",
            "Nopes it should be katsura and elizabeth",
            "What?",
            "Sabo is definetely not a bit part character. What you on about?",
            "She actually",
            "Yeah bro maybe uh take a look at the why he resigned before saluting him",
            "Yea, salute to the abuser.",
            "Well ya but she voiced small sabo",
            "Sabo has so many episodes in between appearances that fans are unlikely to notice a big difference in voice. \n\nUnlike that time Ikue took leave and we got a different VA for Chopper during Aqua Laguna or even Franky -- where even though it's the same actor you can tell Kazuki has been sounding different since Egghead started\n\n&nbsp;\n\nSo long as they get someone who sounds vaguely like Furuya then it'll be fine."
        ]
    },
    "The Name of The Ancient Kingdom is........": {
        "title": "The Name of The Ancient Kingdom is........",
        "score": 1882,
        "url": "https://www.reddit.com/gallery/1dlh3mr",
        "content": "",
        "num_comments": 175,
        "comments": [
            "Incomprehensible, take my up vote",
            "damn bro already cooking up a theory like this, it's not even a break week",
            "I'm curious, how much freaking time did it take to brainstorm / research / create the pics? Because holy shit.",
            "This actually makes sense and offers a very detailed explaination. The One Piece channels are likely going to eat this up.",
            "There’s so much research that went into this!\n\nAll in all, I’m most excited about the prospect of having Enel back in the story",
            "It’s been a long time since I’ve watched the skypiea saga but didn’t Bellamy mention “the emerald city” as one of those legends he was trying to mock as “untrue”?",
            "Skypie skippers in shambles..",
            "I won't read all of that, but here you have your Upvote hahah",
            "It's devil kingdom where devils fruit comes from",
            "If the one piece was Sweden I would ban Japan",
            "Moon Key",
            "Love the attention Hidden Island got here",
            "I think you’ve got a lot of solid stuff here, but honestly it could use some trimming. There are definitely some superfluous details that you could do without. I highly doubt that Luffy pointing up while saying “the sky” was any big foreshadowing for example. There aren’t many, but there are a few things like that. Otherwise this is awesome. I like a lot of the ideas you’ve got here.\n\nWhat exactly did you mean by shadow’s Asgard by the way? I’m not saying it’s not relevant but I couldn’t really understand what the point you were making was. How could Moria’s fruit possibly be related?",
            "This is how some academic papers are made - a paper just reviewing/collecting data from a lot more papers - in an effort to derive a conclusion. \n\nYou should probably switch to academia, lol",
            "Maybe. Maybe not. Who knows? We‘ll see.\n\nBut nonetheless the World Gov wants to know your location ",
            "I hope Oda will actually do something cool like this with Emerald City",
            "Some youtuber gonna steal this and make a 2 hour long video on it",
            "Thank you for the meal",
            "Insane",
            "Emeralds, Rubys, and Sapphires are all the same mineral but in different colors. Sapphire Scale must fit into it all somewhere.",
            "I’m glad my attention span isn’t cooked because reading this theory is so incredibly through and plausible, I can’t even describe it in words",
            "so gear green is canon?",
            "All this for Oda to name the kingdom something dumb like \"Freetopia\".",
            "What races are the shandians, I got lost reading\n\nAnd do you know what race Imu is from?",
            "YOU MIGHT BE ONTO SOMETHING. I believe about half of the things you explained might come true.",
            "Deez Nuts",
            "So what's the final name of ancient kingdom? \nIt's to long to process so tell me here",
            "This is the kind of crackpot schizo horseshit I come to this subreddit for.",
            "A lot of this sounds like nonsense to me...\n\nThe Weatherians had the secret of the mother flame and then gave it to Kuma who gave it to Vegapunk? \nLike, what?\n\nThe point of those scenes is to show Kuma making friends all around the world to explain why he then sent the strawhats to those locations.\n\nLike a lot of this is a reach built on what little we already know for sure to try and make imaginary connections. If y'all wanna see One Piece as a mystery box type of show that's totally cool, it's evident that Oda does too, a little, but I still think that in his mind the characters and the adventure and the romance come first.\n\nAlso, I don't want to be overly critical, but if you're really intent of seeing the show as an interconnected mystery box to solve, and you're trying to fit the pieces together, a theory should have a conclusion. A lot of these are lines in the sand about disparate moments in the series, without offering any real answers about the mystery you are intent to solve.",
            "Did you just upload what could have been a 40 minute YouTube video essay as a Reddit post? Mad respect.",
            "Interesting",
            "I'm all in!",
            "Neat",
            "Fire shit dawg 🔥🔥🔥🔥🔥🔥🔥🔥",
            "Holy shit this was awesome. ",
            "5-star meal, compliments to the chef.",
            "GLORY TO SVERIGE 🇸🇪🇸🇪🇸🇪🇸🇪🇸🇪🇸🇪🇸🇪🇸🇪🇸🇪🇸🇪🇸🇪🇸🇪🇸🇪🇸🇪🇸🇪🇸🇪🇸🇪🇸🇪🇸🇪",
            "Let him cook",
            "Don't know if this is going to be true, but this is one fun of a read. \n\nThe Emerald City... is real!!",
            "Gear green confirmed",
            "Damn that's actually impressive, after hearing the name first thought popped into my mind thats where DF originated.\n\nAnyway you cooking big time homie, this is insane.",
            "Bro, you deserve the Cook title. This is incredible, I wish someone made a video about this",
            "Great research I believe this theory 100%",
            "I've visited Birka in Sweden some years ago😎",
            "Monkey with a typewriter",
            "![img](emote|t5_2rfz5|32513)",
            "As a Swede, I really hope it's Birka lol",
            "I feel like I should be paying for this",
            "This deserves more upvotes than I can think of. This is probably the best and most detailed one piece theory out there.",
            "[removed]",
            "Man can someone use theories that don’t use influences outside of one piece? Seriously the best theories imo are the ones that use clues strictly from the animanga and do not take outside inspirations.",
            "Its Disney Land! I mean it has a D on it and its the happiest place on earth where imagiation runs wild!",
            "On the top of page 10, the dance scene, any idea what the character looking like dancing people translate to?",
            "Sun- Luffy\n\nRain- Dragon (if his devil fruit is rain, if not then Law)\n\nEarth- Blackbeard\n\nForest- who?? Maybe Vivi has something to do with it? Like maybe Alabasta was a forest kingdom in the past",
            "I ain't reading all that but good theory.",
            "\"There is no Pepe Silvia, the man does not exists\"",
            "So I read everything, but maybe I didn't understand something haha. You say that the Ancient Kingdom was Birka, which is also the sky island where Enel comes from, right? But Enel destroyed Birka only 6 years ago (at the time of Skypiea arc). I assumed the \"Ancient\" Kingdom was more ancient than that.\n\nI'm either stupid or I got confused reading all that.",
            "Since i read so much about the creation of clouds here , is there a possibility that the whole sky ocean and the sky islands where actually created by the ancients descendants of the moon to flee from the Water Catastrophy in the Void Century ?",
            "a",
            "I like the theory some YouTuber put out a few days ago that we've already seen the Emerald City in Alabasta. The Green City Erumalu. Because the Emeralds were important to the Egyptians and Albastaa is based on ancient egypt.\n\n\n\nAlso the One Piece is a Philosophers Stone.",
            "I don’t know what that floating island is, but all I know is Imu is on that thing",
            "Cannot concentrate long then 30 second",
            "I don't know if you're a genius or a madman, but I'm on board with this theory. It connects everything so neatly and I'm coping for Enel comeback.",
            "This theory is a cluster fuck of good and interesting points and borderline random bullshit\n\nThe whole section about Uranus being the emerald city, the missing eye of Jaya and stuff is interesting, very far fetched but a remotely plausible far fetched at least\n\nThe green line and lunarians stuff idk, doesn't seem too convincing also quite random \n\nThe part about how Kuma was the key to Vegapunk making the clouds stuff and the mother flame just makes no sense to me. He simply split into 6 himselves which made it so that he could have and implement so many more ideas, achieving more than he did at PH when a collaborator was the sabotaging Ceasar.\n\nBirkans and weatherians possessing some kind mother flame also makes no sense. Like, having some past remembrance, told tradition from the time sof the moon yeah sure, but any surviving or similar technology nah, not talking about the og moon Birkans ofc. \n\nThe moon murals stuff you pointed out is in part basically confirmed, like the mother flame, in part idek what you mean with the serpents stuff (those colors aren't even canon, they could be red for all we know), and the tontatta stuff makes no sense. That face is just like all the others on the mural, idk why you'd think they'd represent a tontatta, sure they have some ancient history, but that's like any other race, it doesn't mean they came from the moon at all. \n\nThe stuff about the Adam tree being from Elbaf (except the Warland being at constant war with the WG explaining Vp's message. I feel like VP's message just meant it more broadly, as in \"fighting\" against Ds and cause the other 2 ancient weapons are still around ready to be awakened/born), Enel with weatherian/Birkans technology since he's from there, defeating Urouge, them coming back to relevance in Elbaf those are things that I've considered extremely plausible for a long time and wouldn't be surprised if they turned out to be true",
            "I think the name must be something that will actually make the readers of One Piece react in a \"holy shit, no way!!!!\" And not just a word where we will all be \"eh.. cool\".\n\nSomething that would have a actual importance into being kept a secret.. why would the Gorousei get very concerned if someone uttered the name of the kingdom?\n\nIf the civilians reaction to the name is \"eh? What is this name never heard of this\" I guess it's a wrong theory.\n\nBut hey.. I thought that Vegapunk had a valid reason to broadcast a video instead of making the world wait 10 minutes when time was up the essence.. just so he could show everyone his face, bow in apology and refuse to elaborate on that... And had the transmission cut.",
            "After Oda started talking about rise of the water level, I was thinking that the ancient kingdom is probably the Atlantis or something inspired by the lost city of Atlantis. In any case your theory makes sense, so I wouldn’t be surprised if it is actually Birka.",
            "I'm not reading all that, but I read Uranus. Good work 👏",
            "Enel destroyed Birka before coming to Skypeia or are you making a distinction between his hometown Birka and the ancient Kingdom Birka? as in they named their land after the ancient city? \n\nAlso the Germa are north inspired, they’re a nation without land forever bound to the seas and are highly technologically advanced \n\nmaybe they have some ties? remnants of ancient city Birka maybe?",
            "Dunno if it would be relevant, but Ireland is known as the emerald isle because of its greenery",
            "Such a great post. Thank U",
            "Wait, isn't this just what you posted yesterday, but with the slides rearranged? I enjoyed the read the other day and think it's some great connecting, but ifk how to feel about posting it again but different\n\nIs there a reason or is it just because?\n\nEdit: makes sense, cheers",
            "Must be a break week",
            "A large problem is your theory about Enel. Enel didn't know about Shandora when he destroyed his home sky island of Birka. His large ego thinking himself a god, combined with the belief sky islands are unnatural, is the reason he tried to destoy Skypeia too.  \nHe wanted to get to the moon because of the \"endless vearth\" and vearth being sacred to sky islanders. Clearly, a \"god\" like himself would live in such a sacred place.  \n\nAnother thing about the shadows Cricket talks about is about the sky islands which have existed for a long, long time.  While the all but confirmed Uranus, sacred treasure of Marijoa, does produce the same shadow as sky islands two things can do the same thing. Especially since we know sky islands move throughout the sky.",
            "I agree.\n\nBirka.\n\nThis also connects with the missing left eye theory..",
            "Nope.\n\n\nUranus got nothing to do with Emerald City and certainly the Ancient Kingdom was not Emerald City.\n\n\n\n\nYou just really want whatever you want and bend over backward trying to find anything to fit your wish.\n\n\nEven used ANIME color interpretation of Uranus nuking Lulusia..\n\n\nThe anime that say Drake was the person who had 1% chance to live in OnigaShima which turn out it was Hawkin.\n\n\nThe anime that make NON G4/G5 Luffy FLYING IN THE SKY fighting Kaido like a DragonBall Z character..\n\n\n\n\nThe anime that added Hody Jones and his crews had a flashback when they were kids and almost got kidnapped by HUMAN pirates thus NULLIFYING the original message and plot of the manga where Hody and his crews had NO/LACK of valid reason to do what they did.\n\n\n\n\nSo exactly people in ONe Piece world got their hands on Treasure Tree Adam again for all this time?\n\n\nAre you saying the World Government didnt WIPEOUT the entire country from existence despite the WG never hesitate to WIPEOUT an entire country/Island like Lulusia or God Valley for far less REASON \n\n\nAnd YET the kingdom/island/country that was The World Government greatest ENEMY 900 years ago not only still exist today but also the people can go there and got some Treasure Tree Adam?\n\n\nMy point is not about the Island still exist and never got destroyed or not but its about human can have an access to it and even got some legendary tree from it and sold the trees.\n\n\nIf this were the case, didnt the WG might do everything that can to wipeout the country and stop the Selling if Adam Tree?\n\n\nJust my 2 cents..\n\n\nThere more problems with your theory but I am tired",
            "Everyone this is stolen from the hidden island, his video on it is from months ago.",
            "Cool, but I ain't reading allat I'm sorry.",
            "That's the city. Now the kingdom.",
            "Isn't Enel from Bilka?",
            "Am I the only guy who realizes this man has been right about York being the traitor AND the den den mushi being inside the robot. This guy’s track record for theories is insane rn.",
            "Yeah, too wild and unfounded. Not enough connective tissue between the theories.",
            "I’m here to cook and serve the community🧑‍🍳",
            "> it's not even a break week\n\nI actually had to check to see if it was one and I missed it lmao",
            "This is the Short version. the long one was 100 pages and explains the Identity of IMU and her Yokai form",
            "Appreciate it that you took a detailed look at it I’m here to cook for the community",
            "I’m so hyped for Elbaf we need Enel back",
            "So much backwards justification!",
            "[deleted]",
            "Yea but the whole thing was that he was wrong the legends are true",
            "Skypeia skippers lost out on one of the best arcs in one piece",
            "Tl,Dr: Weatheria has the original mother flame to fuel their technology and Enel can recreate their technology with his energy powers. Enel will come back to fight Urouge. And Uranus is a moving city in the sky.",
            "That’s what I’m thinking exactly Devils and Angels an ancient battle",
            "I mean the Birka thing has been around for a while. With the Giants being basically Vikings and having connections to the void century it's all gotta be connected somehow",
            "Same here, am Norwegian so this would kinda piss me off.",
            "Your coooking 🔥🔥🔥🔥",
            "He’s one of the absolute goats 🐐",
            "Shadows Asgard was possibly an early hint at the emerald city lacking the Sun/Motherflame. so instead of glowing green the sky island forms a shadow",
            "Lots of filler and weak links in the theory.",
            "Don't. Academic papers arent taking a theory and searching for any evidence despite there being none.\n\nSometimes, proving wrong a theory is good enough.",
            "It would make alot of sense because I think the weapon was also used to kill the Lunarians",
            "Lol atleast ya heard it here first thanks for reading :)",
            "And ppl will skip to the \"most watched\" parts at X2 speed because those YouTubers suck",
            "👨‍🍳",
            "Not exactly, you're thinking rubies and sapphires which are pretty close to impure diamonds, emerald is different",
            "🙏",
            "Shandians are the natives of Shandora, the golden city in Skypea, they descended from the moon too but didn't stop at the white sea like Birkans and Skypeans",
            "True. Kuma only sped up the process of what Vegapunk was gonna do anyway and it is for the cloud making machine and not the Motherflame.",
            "👨‍🍳👨‍🍳👨‍🍳👨‍🍳👨‍🍳👨‍🍳 Anyone who’s is hungry will always get served",
            "🫡🫡🫡🫡🫡🫡🫡🫡🫡🫡",
            "Nice 👍 Congrats I guess you found the Ancient Kingdom was it cool?",
            "My ancestors are from Sweden so I hope so also",
            "[removed]",
            "There’s going to be a Part 2 that explains why the rain God is ViVi and I think the forest god is Usopp flowers are suns Usopp is the going to be the next Sun god Nika",
            "I would give it another re-read it’s a jammed packed theory. But basically the name Birka is passed down in a similar manner as the title Saint which I predicted IMu had that title. The technology that was from the moon city birka was passed down too Vegapunk. The shandians are the Ancient kingdom but they would still be considered birkan because there from the moon city birka",
            "Yea I like that Parvision has great theory talking about how the Void century was likely covered in clouds",
            "Dak made a short about the Green city eramalu a few months ago also. I think the real Poneglyph on laugh-tale is the Emerald tablet which has the information for alchemy",
            "Urouge Vs Enel and Shiki is Coming back elbaf here we come",
            "The Tontattas are from the moon city Birka is called  fairy Vearth in the cover story because the Tontattas are named fairies. The red line is made up of interlocking islands and was orginaly green hence the multiple snakes eating each other which in mythology represents the Jormunagandr a snake eating it’s tail but in this sense it’s multiple snakes.",
            "The real Poneglyph in laughtale is going to be a an Emerald Tablet based onThoth the Atlantean",
            "👍🫡",
            "it needed to be reworked and rewrote in order for more people to understand it",
            "Enel knew where shandora was the Skypeians knew when and where it was destroyed they even knew about the point of high west and how you needed to island hop to get to Skypeia. Enel just didn’t know where the gold was because it was hidden under the clouds",
            "Reading crinkles your brain, not that you would know anything about that.",
            "Thanks for reading those also I’m hoping to update the IMU theory",
            "Yeah, we should only post theories when they are already proven.",
            "I found that a lot of the time these theories are made from conclusion to \"proof\" (think up of the theory and print screen everything from manga making a slightly vague connection to it) instead the other way around and when you don't go in with the conclusion in mind it makes little sense.",
            "Sanji IRL",
            "Thank you for your service",
            "> I’m here to cook and serve the community\n\nD:",
            "[deleted]",
            "You have my attention",
            "Damn. This might top the like 40 page theory someone made about Quintessential Quintuplets. [For anyone curious.](https://drive.google.com/file/d/1o8JbWk5SalcNZqAPXQdIfwfG7G3pgzQS/view)",
            "Keep cooking master",
            "Please make this a video before others steal this - even if its you just reading the text with your posters as background",
            "Plz just go on and make a video about it .",
            "It’s *just a theory* lol, you got a better one?",
            "Yeah he mentioned sky islands, laugh tale and the emerald city as “fairy tales” iirc. So the emerald city has been mentioned in canon, even if briefly",
            "im baffled to think that 'one piece fans' skip an arc that centered around 'romance'. this arc basically embody the spirit of this manga itself which is adventuring and piracy.",
            "BRO PLZ SEND THE IMU THEORY MY BALLS WERE ITICHING THE WHOELE TIME I READ UR EMERALD CITY THEORY PLEASE BRO EEVERY SINGLE SLIDE I WAS PRAYING IT DIDNT END ![gif](emote|free_emotes_pack|sob)",
            "(Ancient Kingdom Name = BIRKA)\n(URANUS = The Emerald City = LUNARIA)",
            "Yes! I've always been in the camp of Enel coming back and being relevant again. I hope this is true.",
            "Nanatsu no taizai would like their concept back",
            "I look forward to when Oda reveals angel fruits. Maybe eating one makes you unable to breathe air so that you must live underwater or risk drowning lol",
            "Wano also has connections to the old century. And arabasta.\n\nSeriously, the theory is just gasping at straws.",
            "Thanks king and thank you for a novel take",
            "You're clearly too much of a \"goody two shoes\" to be in academia.",
            "The only place those bastards would never have seen it coming, from above them...",
            "Well it was very, very small, literally like 4 small wooden houses, there were actors pretending to be people from that era, was cool to visit, there was also a small museum. Also the town was basically an outdoor very small museum!",
            "[deleted]",
            "You can post whatever crackshot theory you want, but people will dissect it and punch holes (donuts) in it, if it's weak. \n\nLike, are you surprised that's how reality works?",
            "[deleted]",
            "Now that I got this one done I will polish up the IMU theory and post it",
            "If my theory is right there is a reason why he did this because it’s one of the Key pieces to the Ancient kingdom",
            "I’ll reply to you when it’s done I’ll probably post it Tuesday",
            "So why is Enel coming to fight urouge?",
            "Well yes, after eating too much avocado my ass produces an emerald mountain, but I don't name it lunaria, that's gross...",
            "Shiki is coming back in elbaf also trust",
            "We both. Now go and keep protecting the agenda.",
            "Got infused into the DNA of the fishmen on accident 😅",
            "Angel Vegggies",
            "Exactly the ain’t no way the gorosei are taking out a clan of Lunarians especially if they have Angel powers the direct opposite of the Gorosei who are devils",
            "Lol maybe that’s why ODA made the Tontattas originate from Birka because it’s Tiny",
            "[removed]",
            "You didnt dissect and punch holes in the theory though. You called it unfounded, which I commented on.\n\n\nMy point being: theories wouldnt be theories if we already had enough proof to know it's going to happen. Zoro becoming the best swordsman isn't a theory. All manga theories are unfounded.",
            "Wrong thread butt, sorry.",
            "I will be waiting",
            "If u post on tuesday make sure its long af cuz ur theories are fire",
            "Urouge is the former God of Birka that enel defeated so a rematch in elbaf. Enel is always looking for Vearth  which always leads him to the Ancient kingdom and Elbaf is the Center or main part of the Ancient kingdom the biggest piece.",
            "My theory is Nami Tanegrines will be the new devilfruits EOS called Angel Fruits",
            "No, you didn't comment in me saying this theory was unfounded. \n\nYou said: \"Yeah, we should only post theories when they are already proven.\"\n\nWhich is hyperbolic and stupid.",
            "I couldn’t have said it better I’m 99% sure we learn the name of the Ancient kingdom in Elbaf where the O’Hara knowledge is",
            "🫡",
            "Well, it's established without a doubt, that that knowledge exists on Elbaf, so that's a reasonable thing to expect.",
            "Please have a text only version. Some of us do better with text blocks.",
            "We also fw image version. Post like this next time."
        ]
    },
    "What's so bad about this level?": {
        "title": "What's so bad about this level?",
        "score": 717,
        "url": "https://i.redd.it/xhx8f9xzi18d1.png",
        "content": "I've been thinking about this for a good while, but what is so bad about Level 6 in Impel Down.\n\nLevel 1 = forest with blade trees\n\nLevel 2 = wild beasts trying to eat you\n\nLevel 3 = desert where you starve to death\n\nLevel 4 = fire every \n\nLevel 5 = neverending winter\n\nYou can see why all these levels are absolute hell to be in, but I haven't seen anything like that in 6. Level 6 is the one that's closest to being just regular prison where your caged up and that's it. Is there a reason why or am I missing something? Please let me know.",
        "num_comments": 121,
        "comments": [
            "Most of them might actually get stronger if they were left on the upper levels",
            "They are strong enough to survive the other 5 hells pretty easily. Only torture that can be done is psychological, so they are trapped in a lonely cell without anything to do although the inmates won't care about the loneliness anyway.",
            "Irrelevance and obscurity is the main punishment, if you are locked up on level 6 you are erased from history and all of your influence on the outside world is (in theory) removed\n\nAlso, most of the level 6 prisoners are just too powerful and durable for the other levels to even serve as a true punishment to them",
            "No amount of torture is enough for maniacs",
            "Most ambitious pirates go there after passing through the other levels. Going to a place where you’re forgotten about is Hell itself when you have grand ambitions. Look at Doflamingo he can’t do anything to the world at large.",
            "The others are torture this one is just a place to dump the people you want the world to forget. The people who are down there aren’t really the type to really feel the punishment from the other floors anyway",
            "There are the most dangerous criminals in the world with life sentences or death penalty, this is a secret level and everyone who is there is \"erased\" from the world \n\nI mean, his punishment is loneliness, greater vigilance... etc.",
            "The upper levels have the mercy of a (somewhat swift) death. All there is to do in level 6 is wait, knowing that the world outside has forgotten about you entirely. Every aspiration, dream, goal was essentially for nothing.",
            "It’s basically a more extreme version of solitary confinement where you’re just waiting to die. Imagine spending the rest of your life in a room with nothing in it",
            "Some lunatic might break in and force you to fight with other insane people to get a chance to be his crewmate.",
            "You're erased from history and will spend the rest of your life down there in darkness. Shiryu, and look how powerful and confident he is, was only there temporarily and he already wanted to kill himself because of how bored he was.",
            "Nothing. Thar's the point. When you're unreceptive to everything else, when you're tough and evil enough (that last part is from WG perspective), you get sent into level 6.",
            "That's the level where Magellan empties his toilet.",
            "LvL 1-5 have entertainment.  \nLvL 6 just doesn't.   \nBeing caged up in a small cell with nothing is one of the worst things you can do to a human long term.  \nThe human mind just deteriorates.\n\nIf the regluar prison in your country looks like lvl 6, you life in a very dark place.",
            "Nothing it's just a great vacation home. All the inmates actually love it",
            "They are in the Oblivion, to be forgotten for the rest of their lives.",
            "In order to escape level 6 you must - assuming you have a devil fruit - escape through the other levels. \n\nIf you're a sheer haki user, yeah, no clue why this is the worst lol.",
            "I mean… do YOU wanna give a Level 6 Prisoner access to either fire, ice, wild beasts to train self, or blades? Honestly I don’t see much of what they can get out of level 3, maybe some stuff in try ruins?\n\nMy point is, people destined for Level 6 are too strong for the other floors to do much except for like- annoy them, while also giving them stuff to work with. Atleast in Level 6 they are at the lowest floor, able to be constantly monitored in their lone cell, are given nothing they could use to break out, and are wiped from the history books, doomed to obscurity.\n\nSo if your desire was just to “survive” and you were plopped into Floor 3-5, yeah, making a pilgrimage to Floor 6 and going “yeah, I’ll take this cool cell and stale rations plus conversation with other evil people across the halls, thank you,” might actually be the best move. \n\nOf course, unless Luffy comes around, every floor you go down makes it 10x harder to escape, and it was almost impossible at floor 1. But again, if you were put in say… floor 4, and you have resigned yourself to your fate, you are ok with giving up ANY chance of escape, trying your hand at getting to floor 6 might be better for you then getting burned alive. I’m not saying you’ll actually get there, but in my mind it would be better to try and die in the attempt then die of almost certain death from heat/cold in my regular imprisonment.",
            "Mostly boredom and being erased from history, forced to waste away down here with the worst of the worst and be reminded of the \"loser\" you are",
            "It’s a commentary on how the solitude in our real life prisons are more hellish than extravagant torture",
            "They've only got dial up down there",
            "Nothing really, when your that bad, torture doesn't matter, they just want you out of the way.",
            "They get beat on by the awakened zoan jailers",
            "Level 6 is the worst punishment in the OP world: Oblivion.\n\nIf you're forgotten, your dreams die with you and your will can't be inherited by anyone. It's as if you've never existed.\n\nWhen does a man die? When he's forgotten. And that's what level 6 offers.",
            "Should have been an asylum down there so they can give in to the insanity",
            "It's the ultimate punishment. Locked up and throw away the key. While everything including your name is slowly wiped from history.\n\nI'm more wondering why there wernt executions since it seems that'd be easier. Seems like the marines still try to be good in general. However, the people are probably too strong that normal executions are no good.\n\nAlso a side note, it seems that while impel down is apart of the world gov. It isnt fully under its wing. Where it is associated more with the navy and just answers to the wg. While those in charge may try to prevent unnecessary problems. Looking at you Doffy , since he is bound to be assisnated. Where the wg would want him dead for loose lips. While the navy is more keeping him going.",
            "They don't want to give them a reason to fight back",
            "Never thought about it, but after looking at the comments I came to same conclusion of yours. It’s absolutely bs and there’s no reason at all for them not to be locked in other levels lol. Irrelevance? Like bruh",
            "For starters I saw your mom down there the other day, boom roasted :)",
            "Level 6 is like an oubliette. To be forgotten. Level 6 are for pirates who are serving life sentences or waiting for their death sentences, like Ace did. Pirates who are sentenced to Level 6 have committed unimaginable crime or pose a threat to the public and even the WG. They can even survive the tortures present in the upper levels.",
            "well dofffy just tied to the floor for months now lol",
            "Lets be real as well, these guys are probably all stronger than anyone bar Magellan/Shiryu in the prison (and some stronger than those likely). All you’d be doing by torturing them with lesser guards etc. is giving them chances to escape and kill people.",
            "The torture only exists to scare people into following the law. Level 6 is a secret, so there's no reason for them to waste money on it.",
            "As usual tax fraud",
            "I think the biggest problem with Level 6 is its execution. The overall idea is that when all physical torture doesn't work, you go with psychological. Level 6 would have made much more sense if it was complete sensory deprivation. No light. No sound. No contact. No food. You just waste away with nothing. The fact that they're all kept in cells within eyeshot of each other or in many cases, with cell mates, really negates the impact of Level 6. I guess it was tough to convey, but it definitely feels like a let down after all the previous levels.",
            "they might be like absolute serial killers & rapist, possibly cannibalism too so they gotta keep them locked up at all times\n\nalso some of them might know truths that the government doesn’t want out",
            "I think it is the lack of worldly anything that is meant to break them of wanting to do anything in the world cause they woudl reach a tyoe of enlightment. Being stuck with nothing but themselves and no worldly possessions, no friends, no one to really talk to. They can only contemplate their actions. Can accept make peace and possibly reach a stage where won't need the world and the world won't need them. Having Sengoku as head of marines might have been part of why I am thinking that. \n\nBasically each layer is a condition they use to temper the body and  to extremes. Physical discomfort, fear, hunger, heat, cold, Tolerate extreme conditions physically so body is a peak condition and all that is left is the mind which is given nothing but itself to work on.",
            "Those who say it is the devil fruit thing, why can't they just keep fruits next to them and then kill them then",
            "There was a theory that WG were trying to erase the crumble from memory, that if there will/ dream were strong enough they could create new Devil fruits. So by erasing them from the puppies memory the eliminate the threat of future problems",
            "They don’t really wanna torture them, in fact most L6 inmates are probably strong enough to not be bothered by the other levels. They’re put down there for the sake of being completely forgotten by the real world",
            "Because down there its just you and your failure.",
            "The smell",
            "They can be executed whenever the warden thinks. Magellan was kinda a good guy. Other levels were torture level. Nothings happening to these guys if they were put into those level. So execution at will is the treatment.",
            "There's no reason to keep those prisoners alive, it is just done so Oda can bring the popular characters back into the story",
            "Minor offenders?",
            "i love this scene so much",
            "Cause the tortures form the upper levels would hardly be tortures for them, so they just let them rot chained up unable to do nothing, without even torturing them which the only thing it might do would be to ease their unending boredom",
            "These are the worst prisoners you can imagine. They’re too strong to torture. Too evil to put to work with other prisoners. Too messed up to deal with in any typical way. So what’s so bad about this level?  \n\nNothing. \n\nIt’s literally nothing. The most they would get is food, just to keep them going at minimum energy. The ultimate torture for the ultimate criminals.\n\nBoredom.",
            "The reason why it’s so bad is because the boredom of absolute silence that would make people go mental",
            "I mean its the floor where people go to not exist anymore, just removed from existance",
            "This is the OP equivalent of being buried under the prison. You might as well not exist anymore",
            "L'enfer, c'est les autres...\n\nThe company is just really that bad.",
            "Level 6's Canon monikor is literally \"Boredom Hell\", so... y'know...",
            "Like for example, if Rocks was detained and not killed, he'll be there or even in Level 6. \nThose 2 levels house the most fked up human beings to ever exist",
            "Because if you put kaido in any other level he’d just end up getting stronger, he’d be able to withstand the heat and the cold and can use that to his advantage \n\nIn level 6 you are just stuck there… there is no weather conditions so you cannot get stronger in anyway and you are just forgotten about",
            "Level 6 is basically an oubliette where some times they remember to bring you food. Other time they remember to come beat you. Other times they don't show up at all. Eventually you're forgotten and waste away.",
            "It's hell",
            "Yeah they’d basically see it as training, like Luffy in Wano. There’s no way in my mind that Daz Bones and Bentham weren’t getting stronger in their own respective hells.",
            "Free exp",
            "This is the most interesting answer I've ever seen for this question.",
            "At this point you wonder why they don't just execute them.",
            "That was still always bs to me. Irrelevance is already included in almost every Impel Down sentence. They're never meant to see the light of day again, with very few exceptions. So I'm supposed to accept that **just irrelevance** is somehow worse than **irrelevance plus you're starving/freezing/...**?",
            "I think it just has to do with practicallity. \nImagine all the lvl 6 prisoners bein able to walk around and work or whatever. E.g. kaudo or similar.  They would definitely be able to escape. Locking them up with seastone handcuffs, chains and in a seastone cell makes sure they are going nowhere.",
            "It's funny to think that one piece 's worst level of prison is just prison irl",
            "I mean… won’t you also be forgotten in any of the other levels too?",
            "But it is not even solitary.",
            "LMFAOOOOOO \"hey guys, i really enjoyed our crying session today. same time tomorrow?\"",
            "His legs are likely atrophied into jelly.",
            "Devil fruits mainly. If you kill them, the fruit respawns. Leave them in a cell and you eliminate a threat for ~80 years.",
            "I wondered about that too. My headcanon is, they're kept alive in case the WG needs them. For what exactly? No idea. But having some bloodthirsty monsters the strength of Croc around could be quite a good method to destroy a county or weaken an emperor",
            "It’s possible that they do still. Ace was sent down there before he was executed. It’s possibly he “jumped the line” so to speak since he was an important prisoner, but it feels very much like the WG to have a backlogged and unorganized death row.\n\nWe see Roger in some sort of cell as well talking to Garp, I don’t know if it’s impale down or not, but we do know they tend to lock you up before killing.",
            "Kaidoitis",
            "Preventing the spreading of Ideologies and truths.... Roger did an everlasting damage right before his execution. Imagine the prisoners knowing some sort of secret and it gets released on the execution platform.. WG won't want that.\n\nCroc knew about Pluton while Doffy knew about Mary Geoise's secret. Even WB's death led to an increase in piracy due to his last words.\n\nIn the OP world, there will always be people who follow you and the ideologies you leave behind\n\nEven secret executions can make you question the truth behind it which other factions can use to their advantage against the WG",
            "It sends a message! If they are alive they can't escape, even though they are strong af. Makes impel down quite impressive.",
            "Because its a show made for teenage boys and murdering everyone means Blackbeard doesn't get his crew.",
            "so they can experiment on them",
            "They are used for experiments and they might need them to repopulate the pirate world.",
            "I think it’s because there are real efforts made by the WG to erase level 6 prisoners from history. At least we’re lead to believe so, I’m not really sure how much this idea is supported or explored later on in the story.",
            "big brain time!",
            "The WG doesn't erase your name from history unless they send you to level 6",
            "Perhaps in terms of obsolescence, sure, but Level 6 enforces that by scrubbing your name out of historical records. To the extent that the WG can control it, your notoreity is erased when you’re jailed in that level. You can’t live on through your fearsome reputation because you’re simply not acknowledged anymore, as a matter of public policy.",
            "It can only be the explanation if every single one of them has a Devil Fruit. Otherwise it's something else.",
            "Jimbe didn't have a devil fruit though.",
            "Can't you just kill them and keep an apple nearby.",
            "On First glance I agree, But punk Hazard and fruit near by stuff?",
            "Why they don’t just hold an apple in the hand while executing them?",
            "Unless, they're handpicking problematic fruits, this can't work as an option.  Multiple known DF-users are interned at higher floors.",
            "Even if they have devil fruits, when a user is killed it just respawns to the closest similarly shaped fruit, they can just have someone walk around with a bucket full of different types of fruits and have someone execute prisoners one by one",
            "Like Jinbe?",
            "I get the feeling that with all the fate stuff devil fruits can do, locking the user won't work unless the devil fruit is chill.",
            "To create some sort of Suicide Pirate Crew",
            "But then why not just execute in private didnt who’s who say a prison guard was talking about Nika got killed",
            "You would think the government would be trying their hardest to get their hands on Sugar's hobi hobi fruit to just do that exact thing and have an army of useless toys",
            "To be fair it’d be pretty hard to get a bounty in the 100s of millions without a devil fruit and they probably do execute the ones that don’t have them",
            "Inherited will?",
            "That something else is that they’re pirates.  Right?",
            "Executing Jimbei would be a diplomatic nightmare. This would've sent Fishman Island in a frenzy",
            "You'd need to know the type of fruit it reincarnates to. They aren't all apples.",
            "I thought it respawns randomly within the entire world",
            "Happy cake day!",
            "Yeah but anyone strong enough to be on level 6 is probably strong enough to use a burst of haki to reverse the transformation like law did with doc q",
            "Avalo Pizzaro and Shiryu didn't have one",
            "Most in BBs crew from level 6 (or was it all?) Didn't have one",
            "He was a new prisoner too.",
            "I think the world goverment would be able to have all kinds of fruits next to the execution platform. If blackbeard pirates were able to steal dfs, surely the wg would be able to.\n\nThe easy answer is because oda wrote it like that, and dont think too deeply about it",
            "Nah when smiley dies in pink hazard caeser keeps a basket of apples around specifically so the devil fruit will take over the nearest fruit",
            "Don quinjao literally has conquerors haki and he got turned into a toy",
            "Word Government probably let them live because one used to be a king and the other used to work for them",
            "Shiryu was probably left alive because they didn’t want to kill one of their own people even if he was a monster",
            "Considering the Blackbeard Pirates m.o., Katerina probably didn't have hers yet either.",
            "San Juan Wolf definitely had a Devil Fruit.",
            "Idk for sure but the only explanation I would be able to think of is Shiryu and Pizarro were left alive due to their ties to the World Government and Devon and Vasco were kept alive because the World Government possibly thought they could use them if needed without too many problems since they were some of the strongest people in the world that could’ve been controlled by someone with a devil fruit at the time",
            "not even a prisoner necessarily. Its likely he was just under arrest until after the execution. Sengoku still considered him a warlord when they arrived at marinefort.",
            "then they SHOULD execute those people, have multiple fruit around and use those powers to strenghten the marines.\n\nWhy are people so sure that it workls exactly that way, even if it was only shown ONCE during a controlled experiment?",
            "Ah, right, forgot about him\n\n\nStill, the point stands that DF respawns probably aren't the main reason to keep'em alive in level 6, given the majority of BBs crew",
            "What? We saw Jesus try to kill Sabo and Luffy while holding a fruit. There's no reason for him to do that if it wasn't how it worked",
            "I mean we don’t know it always works that way but that’s why caeser had the fruit with him, if it doesn’t always work that way we have no evidence to the contrary",
            "Because we also know Blackbeard was somehow able to take whitebeards fruit power and is actively hunting down and taking them, so presumably he also has a way to make it respawn nearby",
            "Jesus also tried to kill them with a knife, just like Teach killed Thatch.\n\nDoesn't mean a lot, yet.",
            "true, but then again, if that is indeed how it works and its common knowledge the marines would definitly abuse that system",
            "I agree but look at the opposite \n\nIf that isn’t how it works what are the chances that ceasers plan actually worked \n\nIt would be 1 in trillions"
        ]
    }
}