{
    "Overwatch 2 Retail patch Notes - June 20, 2024": {
        "title": "Overwatch 2 Retail patch Notes - June 20, 2024",
        "score": 5,
        "url": "https://www.reddit.com/r/overwatch2/comments/1dkifyt/overwatch_2_retail_patch_notes_june_20_2024/",
        "content": "# OVERWATCH 2 RETAIL PATCH NOTES - JUNE 20, 2024\n\n# SEASON 11 – SUPER MEGA ULTRAWATCH\n\nJoin Ultrawatch for an action-packed season! Suit up and battle the forces of evil led by the fallen Mythic Calamity Empress Ashe and her sidekick B.O.B, then claim and customize Mythic Ashe's diabolical dark mage style for your own. Celebrate as Overwatch reaches 100 million players, marked by the long-requested return of Pink Mercy alongside a new Rose Gold Mercy Bundle. From June 25 – July 8, 2024, Blizzard will donate 100% of the purchase price (excluding any applicable platform fees and taxes) to the Breast Cancer Research Foundation. Continue the celebration by unlocking the Aztec Sombra Bundle through challenges and enjoy a fun Community Crafted mode curated by beloved streamers.\n\n# COMMUNITY CRAFTED MODE\n\nDive into a new Community Crafted mode, featuring creative and chaotic balance changes and fun hero tweaks designed by your favorite content creators. Emongg, Custa, TQQ, and Eskay bring their creative touches to Tank, projectile Damage, hitscan Damage, and Support heroes, respectively. Experience wacky hero abilities such as Baptiste sharing his kit with Ana, and Reaper's Wraith Form getting an extra sting.\n\n# HERO MASTERY UPDATES\n\nSharpen your kunai and master your aim when Hero Mastery single-player courses for both Kiriko and Soldier: 76 launch this season. Practice your Swift Step and power up your Tactical Visor as you take part in new challenges in a limited-time event from June 20 to July 9. Plus, earn new rewards and up to 22,500 Battle Pass XP.\n\n* Hero Mastery Courses for Solider: 76 and Kiriko have been added.\n* Hero Mastery Gauntlet Co-op has been removed.\n\n# NEW MAP: RUNASAPI\n\nHike your way up the new Runasapi Push map, to a town hidden high in the Peruvian Andes. Amble through marketplaces full of fresh produce and pay a visit to the Inti Warrior Historical Museum and Monument. This exciting Push map is vibrant and challenging as you escort TS-1 through tight streets. Watch out as some fights may take place precariously close to the steep cliffs overlooking the sunny farmlands below.\n\n# CHALLENGE UPDATES\n\nWeekly Challenge Catch Up\n\n* All past incomplete Weekly Challenges can be completed at any time in a given season.\n* When the Weekly Reset occurs on Tuesdays, incomplete Weekly Challenges gain an additional copy of that challenge. When a Weekly Challenge is completed, if that challenge has copies remaining, the Challenge will refresh and can be completed again.\n\nWeekly Milestones\n\n* Weekly Milestones are challenges progressed by completing other Weekly Challenges.\n* Each week, a new Weekly Milestone is unlocked. All past Weekly Milestones can be completed at any time in a given season.\n* Weekly Milestones progress one at a time. All past Weekly Milestones must be completed to progress a Weekly Milestone.\n\n# COMPETITIVE PLAY UPDATES\n\n* Rank Percentage is now displayed on the Competitive Progress page allowing you to check your exact percentage without playing another match.\n* Renamed the Modifiers \"Win Streak\" and \"Loss Streak\" to \"Win Trend\" and \"Loss Trend\" to more accurately convey that these modifiers are calculated by weighing the most recent games more heavily, but that they are not true streaks.\n* Added more parameters for how the matchmaker handles wide groups, so that it can ensure better queue times.\n* A button that allows you to view the match’s final Scoreboard has been added to each page during the end-of-game flow.\n\n# HERO UPDATES\n\nGeneral\n\n* Knockdown time when two charging abilities collide reduced from 2 to 1.7 seconds.\n\nDeveloper Comments: This stun time reduction applies to the knockdown that happens when two charging abilities collide and result in a tie (with Reinhardt, Doomfist, Brigitte, Mauga, Bob). The counterplay and interaction of two charging abilities impacting each other is great, but it took both players out of the fight a little too long.\n\n# TANK\n\n# [D.VA](http://D.VA)\n\nDeveloper Comments: These changes will improve D.Va's effectiveness against smaller targets as she became less effective against armored enemies in the previous patch.\n\nFusion Cannons\n\n* Weapon spread reduced from 3.75 to 3.375 degrees.\n\nBoosters\n\n* Impact damage increased from 15 to 25.\n\n# JUNKER QUEEN\n\nDeveloper Comments: The Tank knockback resistance passive was affecting Junker Queen's pull effect more than intended. The distance can be affected by their movement, but Tanks are now pulled in about 5-6 meters instead of only 3 meters or so.\n\nJagged Blade\n\n* Now pulls tanks further.\n\nRampage\n\n* Startup time reduced from 0.75 to 0.5 seconds.\n\n# ORISA\n\nDeveloper Comments: Orisa's survivability was reduced more than necessary in her last round of changes so we're partially reverting the cooldown increase to Javelin Spin.\n\nJavelin Spin\n\n* Cooldown reduced from 9 to 8 seconds.\n\n# ROADHOG\n\nDeveloper Comments: Roadhog's already-powerful survivability increased significantly with the headshot damage reduction from the tank role passive so these changes are to help bring that back in line.\n\n* Base health reduced from 650 to 600.\n\nTake a Breather\n\n* Damage reduction reduced from 50 to 40%.\n\n# DAMAGE\n\n# CASSIDY\n\nDeveloper Comments: We’re reverting the Magnetic Grenade ability to be deployed like Cassidy's previous Flashbang ability, but it will keep the Hinder effect instead of a full stun. We've heard feedback surrounding the Magnetic Grenade ability and agree that while the fantasy of a homing grenade was fun, the moment-to-moment gameplay of it often felt too unpredictable as to whether it would land or not. The Hinder effect has been a useful tool to act as a counter to highly mobile heroes without going back to a full stun and the enemy player losing the ability to fight back.\n\nThe Deadeye ultimate is getting an adjustment to increase its flexibility toward the end of its duration, enabling it to get value outside of buying time for Cassidy or his allies, though it may be riskier to hold it for a long time as the damage reduction will fade away along with the movement speed penalty.\n\nPeacekeeper\n\n* Secondary fire \"Fan the Hammer\" damage reduced from 50 to 45.\n\nCombat Roll\n\n* Damage reduction reduced from 75 to 50%.\n\nFlashbang\n\n* Magnetic Grenade ability is now Flashbang.\n* Hinders enemies instead of Stunning them for 1.2 seconds.\n* Movement speed reduction increased from 30% to 50%.\n* Hinder now prevents crouching movement.\n* 45 explosive damage.\n* 12 second cooldown.\n\nDeadeye\n\n* Movement speed penalty now scales down over time, from 70% to 35%.\n* Damage reduction now scales down over time, from 40% to 0%.\n\n# MEI\n\nDeveloper Comments: Mei's damage output over time is intended to be on the low end for a Damage hero, as she offers strong utility and survivability through her ability kit, but we would like to make the secondary fire icicle more rewarding by increasing the damage and slightly more difficult to land consistently.\n\nEndothermic Blaster\n\n* Secondary fire base projectile size reduced from 0.15 to 0.12 meters.\n* Secondary fire damage increased from 75 to 85.\n\n# REAPER\n\nDeveloper Comments: With the previous patch change to how armor reduces damage, shotgun weapon heroes like Reaper lost some value since much of their gameplan revolved around pressuring large tank heroes. To help shift Reaper toward being more effective against smaller targets we're tightening the weapon spread on the Hellfire Shotguns and reducing the amount of time enemies have to react to his Shadow Step teleport.\n\nHellfire Shotguns\n\n* Weapon spread reduced from 6.5 to 6 degrees.\n\nShadow Step\n\n* Cast time reduced from 1.5 to 1.2 seconds.\n\n# SOJOURN\n\nDeveloper Comments: This change is reducing the burst damage potential of the secondary fire Railgun shot to both lessen frustration from playing against that burst damage, and to shift power into her sustained primary fire damage. This should smooth out the feast-or-famine nature of Sojourn consistently hitting the secondary fire shots.\n\nRailgun\n\n* Secondary fire damage scaling reduced from 30-130 damage down to 1-100 damage.\n* Secondary fire projectile no longer requires Overclock to pierce enemy players.\n* Primary fire shots per second increased from 14 to 16.\n\nOverclock\n\n* Energy charge rate increased from 100 to 120 per second.\n\n# SYMMETRA\n\nDeveloper Comments: To help solidify Symmetra as a close-range threat, we're increasing her health to better survive in that range, along with how quickly her primary fire beam damage ramps up.\n\n* Base health increased from 100 to 125 (Total health increased from 250 to 275).\n\nPhoton Projector\n\n* Primary fire charge rate increased 25%.\n\n# SUPPORT\n\n# ILLARI\n\nDeveloper Comments: Illari's Healing Pylon is intended to be useful for healing her team in relatively safe positions without much focus required, which enables her to either apply pressure with her primary fire or spot heal in bursts from her more limited secondary fire healing beam. To encourage this, it now has improved health and healing output, but is less effective when Illari uses it to heal herself.\n\nOutburst\n\n* Damage increased from 10 to 25.\n\nHealing Pylon\n\n* Healing per projectile increased from 30 to 40.\n* Pylon healing is now only half as effective when targeting Illari.\n* Max health increased from 100 to 125.\n\n# KIRIKO\n\nDeveloper Comments: \"Hard knockdown stuns\" refer to most all of the existing knockdowns where the player is stunned and laying on the ground (such as Reinhardt's Earthshatter), with the exception of Ana's Sleep Dart effect, which is removed upon taking damage or Protection Suzu's cleanse.\n\nSwift Step\n\n* Cooldown increased from 7 to 8 seconds.\n\nProtection Suzu\n\n* No longer cleanses hard knockdown stuns.\n\n# MAP UPDATES\n\nCOLOSSEO\n\n* Removed the glass and added stairs at first checkpoint for additional pathing and combat opportunities.\n* Extended the map with a new lowered section and mega health pack behind the second checkpoint for flank/rotational strategies\n* Added a route through a building that connects spawn/final point to second checkpoint.\n* The initial spawn building has been pulled back to give players more room to smoothly navigate the area out front. There is no added run back time with this change.\n* The stairs and cover surrounding the final point have been adjusted to improve the flow of the space and to help teams safely defend the final point.\n\n# PUSH MAP UPDATES\n\n* Reduced the match time from 10 minutes to 8 minutes in Quick Play.\n* Increased push robot speed by 10% when pushing the barricade for both Quick Play and Competitive.\n\n# BUG FIXES\n\nMaps\n\nNumbani\n\n* Fixed pieces of the environment that allowed abilities to pass through it.\n\nNew Junk City\n\n* Fixed lighting in some areas of the map.\n\nHollywood\n\n* Fixed areas of the map that could cause players to become temporarily stuck.\n\nHeroes\n\nJunker Queen\n\n* Fixed a bug that caused Junker Queen's Commanding Shout to play the audio again when using a Teleporter.\n\nReinhardt\n\n* Charge now correctly damages Ice Wall and Tree of Life.\n\nVenture\n\n* Fixed an interaction that allowed Venture to stay burrowed indefinitely.\n* Fixed the description of Drill Dash to match its functionality.\n* Fixed a bug with Tectonic Shock that could allow it to charge Venture's Ultimate Meter some situations.\n\nZarya\n\n* Fixed an interaction where a Particle Shielded Zarya standing on a Teleporter could prevent teammates from using the teleporter.\n\nAdditional information, such as before/after graphics for the map changes can be found here: [https://overwatch.blizzard.com/en-us/news/patch-notes/](https://overwatch.blizzard.com/en-us/news/patch-notes/)",
        "num_comments": 31,
        "comments": [
            "The colloseo map change is huge. That window made the first approach a nightmare",
            "Finally a Hog nerf",
            "Interesting changes overall indeed, they'll probably have more impact as the new meta develops.",
            "I dont hate this game at all but I struggle to understand how there's even a noteable amount of positive feedback on patches like this, come on now. And yet another series of random, brainless changes that feel like a weird slap across the chops 🤔.  I know they came out and said they like shaking up the meta or whatever but I think a monkey could produce better quality patches than this. 2 buffs for DVA? Orissa buff. Back to Cree flashbang? Illari buff, no Kiriko net nerf, pointless Piggy nerf.  Supports will be getting molested by DVA's worse than ever and there is virtually no changes in the support lineup. Grim stuff.",
            "It was nice playing you Cass, you are back to be useless   \nsee in you future seasons when the dev will fix this insane nerf",
            "So about Cass's nade  \ni dont quite understand how did it get back to flashbang without stun  \nwhat does it do then",
            "Good notes, good changes, good mode stuff\n\n\nI'm into it",
            "> Developer Comments: \"Hard knockdown stuns\" refer to most all of the existing knockdowns where the player is stunned and laying on the ground (such as Reinhardt's Earthshatter), with the exception of Ana's Sleep Dart effect, which is removed upon taking damage or Protection Suzu's cleanse.\n\nHonest question: what knockdown effects are there apart from Earthshatter and Sleep? I know I must be missing one, but I can't think of any.\n\nMaybe they're talking about the knockdown when like Doom punches a Rein charge (I assume; I don't actually know if that works the way I think it does).",
            "[deleted]",
            "Wait so pink mercy isn’t available until the 25th?? Goddamnit",
            "Illari remains trash, turret's cd is too much punitive.",
            "Wtf were they smoking when they came up with the Sojourn change???\n\nYet again another patch with no real buff or change to help out Hanzo.",
            "The fact that Hanzo still can't oneshot with an HS and Widowmaker can is insane too me",
            "Because of the tapping its still powerful, but they just nerfed E to be an absolute useless spell,they might as well just remove it",
            "hinders movement by 50%",
            "Slows you down significantly, prevents you from crouching, locks out all movement abilities.",
            "Mauga stomp\n\nSigma rock\n\nAny two charging things running into each other",
            "This is r/overwatch2 you're thinking of r/overwatch\n\nAlso questions about purchases are best sent to Blizzard support rather than random people on Reddit.",
            "I take back what I said about Sojourn the piercing railgun just scared me a bit but she’s actually not that to play against now",
            "I personally hated the random bs headshots from hanzo flinging arrows blindly into a small space.  At least Widow has to charge up and aim.",
            "1. Hanzo can bust tanks even without one shot\n\n2. Widow can ONLY oneshot, she has 0 other use and nerfing her one shot would just make her the worst hero.",
            "So they went back to the \"flashbang\" name and nerfed the magnetic grenade by making it low-range and non magnetic / tracing  \ndoesnt cancel skills like flashbang i assume",
            "Thank you! I should have thought of Rock, but I thought Mauga worked like Bob (toss you up instead of knocking you down).",
            "Indeed but hanzo just feels useless long distance now, you just drop people low hp with an HS they wait for regen and that's it",
            "Thing he is a sniper , you can't play him long distance.\n\nJust frustrating to land an headshot they go to cover then go full hp again.\n\nNerfing Storm arrow and giving him back the possibility to get one shots again would be nice.",
            "Yep pretty much.",
            "Yep but now has an AOE and can hinder multiple targets at once",
            "Mauga stomp has two circles. The outer circle knocks up and back. The inner circle knocks down and counts as a crit.",
            "Waiting for regen practically removes the enemy from the fight.   If they are hiding and waiting it's almost as good as killing them,  except now the enemy isn't annoyed At one shot bs",
            "This might be true, but still comparing widow and hanzo is a bad idea",
            "the range it has it too low, its gonna be useless in most cases for sure",
            "Definitely not. The point of cass is to counter and punish dive characters - characters that literally come to you, this nade fits that more than the buggy mag nade"
        ]
    },
    "Overwatch 2 Known Issues - June 21, 2024": {
        "title": "Overwatch 2 Known Issues - June 21, 2024",
        "score": 9,
        "url": "https://us.forums.blizzard.com/en/overwatch/t/overwatch-2-known-issues-list-june-21-2024/908458",
        "content": "",
        "num_comments": 7,
        "comments": [
            "To the heroes of Overwatch,\n\nWe want to keep you up to date on some of the bugs and issues we’re aware of that are affecting the game. This is not a complete list of all currently tracked issues affecting Overwatch 2, rather, this is a targeted list of some known specific issues with this release.\n\nWe’re sorry for any inconvenience, and we appreciate y’all’s understanding. Our team is working to resolve these issues, and we will provide more information as soon as we have updates!\n\nCurrent Issues\n\nWe are investigating issues with graphic quality and performance for those playing on PlayStation® 5. We will provide updates as we get them here.\n\nWe are currently investigating an issue with new Voice Lines from the Season 11 Battle Pass. We have temporarily disabled these voice lines from being equipped even if you earn them at this time and will appear as if the tiers for those voice lines are empty. They will be accessible in the Hero Gallery once we resolve this issue at a later date.\n\nRecently Resolved\n\nWe fixed an issue causing game crashes when playing Moira in the Community Crafted mode. You can now play Moira again in this mode.\n\nFor a full list of resolved issues, check out the June 20 Patch Notes 104.\n\nLast updated June 20, 2024",
            "I'd love if they stopped Aztec Zenyayta from shooting his balls out of his balls lol. It's funny but I feel like it's fucking with my aim.",
            "Keep getting booted from comp, no penalties just says I have been removed from voice chat when I’m kicked from the game",
            "I think? All the sprays from the battlepass are not showing up for me. At all. It's just dots loading + the name of who the item belongs to. Is it just a me bug or is it doing this to everyone? It's not a huge problem tbh but it's still annoying as i don't have them unlocked, like they do show up through the hero's sprays at least, just locked. I hope they fix this lol",
            "Genji dash hitbox",
            "Can the Moira they fixed in the community arcade mode crit or is it just regular Moira?",
            "It's the voice lines that were disabled. They're mentioned in the post."
        ]
    },
    "K. Y. S. should be a permanent ban with 0 tolerance. ": {
        "title": "K. Y. S. should be a permanent ban with 0 tolerance. ",
        "score": 302,
        "url": "https://www.reddit.com/r/overwatch2/comments/1dlpggc/k_y_s_should_be_a_permanent_ban_with_0_tolerance/",
        "content": "Some massive douchebag on voice chat told me to kill myself, and when I responded that my friend killed himself on Christmas last year he said \"You should be like him.\" Absolutely abhorrent behavior. I'm of pretty sound mind, but I can't imagine some p.o.s. talking like this to someone truly down already. This post is mainly to vent, so thanks for listening. And if anyone out there gets told this, please report them and just know that you did not deserve to be treated like that no matter how you played or what you said. Getting called out for being toxic is one thing, but this line is _never_ ok to cross. ",
        "num_comments": 135,
        "comments": [
            "Absolutely! I hope that POS gets banned for good. Unfortunately they’ll just make another account and do the same thing over and over. I’m so sorry for your loss though 🖤 This is one of the reasons why I have chat turned off completely",
            "If you reported it and typed a description, you should almost more than likely get a response saying action was taken. \n\nMake sure you type in the Report Box. Details matter.",
            "While I agree, why would you even tell them that information?",
            "What the fuck are these replies saying OP did the wrong thing?\n\nThey're trying to educate this piece of shit on why saying kys is unacceptable. Naive yes but wrong no. \n\nThis game is completely cooked, glad I quit if it means I don't have to play with you freaks.",
            "So should hard R and any racial slur \nWhy GG EZ not aloud to be typed in chat but any racial slurs is aloud??? Blizzard just doesn’t care about toxicity! They have a weird stance on it but it’s not genuine.",
            "Kinda silly to just give him more bait",
            "Okay I agree but why would you tell someone over the inernet who you’re arguing with that your friend killed himsef. You are just asking to be kicked while down",
            "It’s weird how that’s not banned but saying “gg ez” is .",
            "And this is why I keep voice chat off. People suck.",
            "Tons of people will say the report system doesn't work but they're all doing stuff like this and then wondering why they got suspended. \n\nReport and wait for the \"thanks for reporting\" message. Feels great. \n\nI'm sorry you had to deal with this. Lots of people play games to have fun and can handle losing and it's a real downer when someone is so emotionally stunted that they pull some shit like this.",
            "I don’t know why you’d ever give more details that they can use to make you more upset tbh, still wrong obv",
            "i mean no offense to you, but you shouldn't have shared that information to a stranger on a videogame. with all the vitriol people have in competitive games, sharing personal information like that is just asking for something like this to happen, and that information to be used against you.  you should be more careful with what you share next time.",
            "I mean no offense here. When it comes to competitive online gaming (comp or not) you will meet toxic people. These are people who WANT you to get angry. And I'm no stranger to reacting to it and it is easier said than done to not let it break your stride. I've quit OW on and off because of it and it's easy to wrapped up in. If someone says that to you? Report and block, engaging with them gives them what they want. To tell someone that vile over a video game will always be disgusting. That is not what gaming is about.",
            "Just ignore thrm it is the only real solution",
            "someone told me they hope i get dead buried in the desert sand or something (super weird) and i absolutely reported him. weird thing is i wasnt throwing and my teammates were confused too lol.",
            "People in the comments saying \"why would you give them more bait?\" or \"why would you give them more info?\" and similar etc -   \nMaybe to make the person saying it actually think about what they're saying and the fact that there's an actual real human being on the other end of the screen?   \nMaybe to make them feel like the total piece of shit that they are for doing/saying that?  \n\n\nThere's a middle ground between ignoring it and letting them essentially \"get away with it\" thinking it doesn't affect people/it doesn't matter, and giving them a \"big\" reaction.  \nYou can make someone feel guilty for being a shit person without rising to their bs and giving them what they want.",
            "They should def be permanently voice chat banned, but the problem is they don’t know what you’re saying and they have no way to do so. Their ban system is fully automated so enough reports and they will see a ban regardless of what you say. Someone could potentially say nothing but gg and see the same bans, but people aren’t going to continually report that person. \n\nIn theory though sure voice ban them permanently. \n\nIn reality they can’t control people rage hacking and pure trolling games so it will never happen ",
            "Yeah no one is going to give you sympathy on oveerwatch bud. You kind of walked into that one.",
            "Why would you tell them that? Did you think they were going to get on their knees and beg for forgiveness… \n\nYou guys would NOT survive MW2 COD lobbies man.",
            "What the f*ck it wrong with that person?! Having a relative commit suicide is a terrible thing to happen and that person had the nerve to use it in a random insult?\n\nIt's just wrong to say that to someone in general, but to keep going after the other person says it actually happened?! That's just low. 😒😤",
            "Don't respond to people who say that. And 100% never mention anything personal. They will use it as ammunition to insult and hurt you more.",
            "Not condoning this but if you’re that triggered by toxic losers in online games then maybe they aren’t for you \n\nThis shit was way worse back in the days of CS Source, COD 4, Halo 2. Y’all need to develop thick skin. That shit should make you angry enough to play better and pop off",
            "These people really don't know what to do with their life...",
            "Different game. But I played with some racist shit stain who thought it was alright to spew his hatred and the N word in a ranked play ccracker. Just because he was native american. He wouldn't stop and then just started blowing himself up on the map spewing his trash. I had to express myself because that shit is disgusting. Needless to say I'm just a stupid, Biden supporting cracker. People are shit.",
            "You can always mute them",
            "hey, im a lucio/mercy/junkrat/torbjorn main and i don't settle for this. im not amazing at the game but im okay after some warmups if you're every interested in some non-toxic games that we're still trying to win and have fun im sure my friend who i play with would love to have you join us as a 3-4 stack depending who is around. \n\nthat kind of loss is something you're never going to be okay with, and it's always going to feel daunting to think about. im glad you're here, if anything just to spread this little psa. thanks for sticking around and carrying on his legacy in your own way, i see it.",
            "I’m sure I’m mirroring a thousand other comments here but here’s my little story:\n\nI have agoraphobia. I love Overwatch but I shut off most communication aside from in game callout and pings. I see a therapist. I try to just literally unmute chat. Only in team chat. Just to expand my horizons. In quick play, open queue.\n\nWithin 3 minutes:\n\n“K*ll Yourse*f tank” (censoring for Reddit, but he said the whole thing, I think with a cleverly placed number or something to bypass automated censoring). \n\nI admit I wasn’t having my best game. I was struggling. Their team was symergizing like crazy. I couldn’t keep up. \n\nI reported him. \n\nBut like… man… the one time I tried. Wasn’t competitive. My stats weren’t abysmal. I was just not keeping up with Red’s tank. They was better than me. But to say that? Come on. \n\nUnfortunately this is why I stick to Fortnite ZB. Nobody can talk to me. They can emote. But they cannot speak with me. That and Diablo. Hard to be a bully there.",
            "They are more concerned with a nice message going into chat when someone types gg ez",
            "Saying stuff like that is really immature and cringe, but honestly why even care what some random stranger online says. Im not saying its ok to say those kind of things, but if you cant handle hearing it without getting upset, then maybe the internet and playing online isnt for you.",
            "soft",
            "You all are soft as hell and would never survive an original MW2 lobby lol",
            "Try to avoid sharing personal information in game. It gives them material to work with. Unfortunately the best thing to do is stay silent or tell them off with no explanation to why it’s wrong and then report them.",
            "lol expecting actual enforcement from blizzard a company infamous for shit employs, sexual harassment and dogshit management is laughable tbh.",
            "Such a weak mentality. I really feel pity for you.",
            "keep yourself smiling",
            "All computers should be standardized to have a pneumatic boxing glove so that you can literally punch trolls like this in the face. They would never do this shit in real life.",
            "I don't disagree but simply mute, report and move on. This is a slippery slope to accepting Karens. Maybe bullying isn't exactly a bad thing in society because everyone is so damn soft these days. I'm sorry about your friend.",
            "You are not of sound mind, you really think a random cares about your backstory. This is the internet and stuff like that is nothing new. People  saying shit like this has been around forever. OW players are the softest around.",
            "Why would you care and engage?",
            "I’m sorry this happened, and I’m sorry for your loss. I agree with what other people are saying, you shouldn’t share something like that. I know your heart was in the right place but some people will only see weakness",
            "[deleted]",
            "if someone tells you to kill yourself online & you take it super personally and say 'u should feel bad for me because a year ago my friend actually did kill themselves' - you have already taken it personally. brother it's an online game not a single person should feel bad that the person on the receiving end is too sensitive to be on the internet and can't take trashtalk over a competitive online game. plz if u feel threatened online just turn the device off and go outside, don't seek justice over an online game",
            "it is justified as long as someone deserve that",
            "Tbh this is fine, you can everytime just mute and block him, everyone gets angry specially in compet so idk just mute him and be fine",
            "I do hope you report it and it is abysmal, but friend, as someone who also has a huge history with suicide, don't share that with people telling you to kys. It isn't the sympathy card you think it is, most people will double down and say the most horrific shit about your past, they will use that against you and it HURTS. \n\nIt's gross behavior I wish didn't exist, but it happens (semi) frequently in videogames like OW. Best you can do is report and move on, don't let it get to you.",
            "Don't mean to sound sweaty, occasionally killing oneself in game is beneficial to your team to prioritize a switch or  avoid a stagger. Ahem, enemy team ult charge shrug. Not what the person meant in chat no doubt, I mute/block typist mains anyway. I don't know about banning the accounts, just place them in lobbies that are a guaranteed loss with hidden mmr. Say something like \"kys\" in chat-experience a 19 loss streak. I swear negative space made by actual plebs who practice self worship. Banning an account leads to an old player on a fresh account, an imposed loss streak forces the ignorant to grind themselves into meal to win back a rank.",
            "And all this over a video game smfh…",
            "I started playing this game a few months ago\n Jesus christ the player base is so soft.",
            "You want more moderation? Wth?\nM rated games should have zero moderation, and if there's a mute function, voice chat should never be moderated.\n\nWhat's wrong with you? Were you homeschooled by zealots or something?",
            "You want more moderation? Wth?\nIf there's a mute function, voice chat should never be moderated, and rated M games should have no moderation.\n\nWhat's wrong with you? Were you homeschooled by zealots or something?",
            "Just don’t understand. This is competition and no one can change this; this happens in chess to overwatch - just focus on yourself and really dig deep on why this affects you? Because it really shouldn’t",
            "They wont do anything. You only get banned if it involves pronouns. Trust me i know",
            "So true xister",
            "womp womp",
            "they ate",
            "I think it's important to know yourself. If you don't then how can you improve?",
            "What do you expect sharing information like that with idiot children online? Like honestly? It's always the same when women complain about being harassed online for having a feminine username. \"Don't interact with them.\" \"Change your username to something gender neutral.\" \"Mute them.\" \n\nThere's almost no point in joining voice chat anymore unless you're high elo. People don't make correct callouts in plat and below anyway even when they try. Unfortunately even if that moron gets banned another moron will take his place while the idiot makes a new account. This is one of the prices paid for the game going free, less consequence for shit actions. Report and don't bother next time. Literally bricks have higher IQ than these stupid boys online.",
            "How do people like you even survive day to day 💀. When someone in a game tells you that they will not care about your sad backstory lmao",
            "Apart from the million other things it made worse, going free-to-play also wasn't a good choice for fostering a healthy community.\n\nHaving the game cost $40 to play made people a lot more aware and careful about what they said in tc and vc even if just because a ban would mean they would need to spend another 40 bucks to continue playing.",
            "Details don't matter nearly as much as your rng in getting paired with snowflakes",
            "To make clear that this is a real and important topic and a lot of people people are struggling with their mental health and suicidal thoughts and to get at least a little bit of empathy. I'm sure op did not expect that asshole to respond like a cold blooded psychopath",
            "I agree, make up a fake story if you want so that they can't twist it to hurt you.",
            "Wrong can mean \"morally wrong\" (i.e. if you do it, you're a bad person) or \"not in your best interest\" (i.e. if you do it, bad things will happen to you). I haven't seen people say OP is morally wrong, just that it wasn't in their best interest. \n\nIt sucks that that happened, but the best strategy is still to not feed the trolls. Not because it makes you a bad person, but because it's not in your interests",
            "Blizzard doesn’t give a fuck about their community",
            "Exactly. Legitimately makes no sense to me - like in what permitted context are people using kys and racial slurs if saying ggez as a joke isn’t allowed?",
            "Racial slurs were (at least last i saw) already filtered. Unless they've walked back the filters (unlikely, considering Twitter is still blowing up about getting auto banned by them) or players are intentionally bypassing the filters they should still flag.\n\n\nI do wish there were smarter ways to catch bypasses. Nintendo apparently has a system on their platforms, but you also lose 3/4 of any game related conversation because ot chops words in half and filters random stuff.",
            "Blizzard ban people at the drop of a hat and don't even condone curse words so that's not really true at all",
            "Racial slurs are censored unless someone intentionally bypasses the filter. I report any time I see a string of *******s because it's almost certainly someone being racist.",
            "That’s victim blaming…",
            "Were you any of the characters (I seen, and have been cursed at multiple times because of playing these characters)\nD.va (dislike of Bomb and second life mechanic)\nRoadhog (Meta, and people don't like being hooked)\nOrisa (So many abilities and 75% of the time eill painlessly kill squishes)\nMauga ('No skill' I don't agree vut its a common veiw)\nWreaking ball (speed and mobility)\nMoira ('no aim' required)\nLife weaver (People don't like being dragged when their about to ult. Or to hsve a kill 'stolen' away from them cause you dragged their victim)\nZenyatta (Discord' nuff said)\nMercy (I don't actually know why, but some people call it a 'throw pick' and also hate having their vixtims rez'd)\nWidowmaker (or any other sniper) (people for some reason sre under the impression snipers are unfair.)\nPharah (Flyinv and explosion)\nBastion (some people never grew from 'nerf bastion' mindset)\nSombra (..I feel this one requires no explanation)\nSymmetra (turrets)\nTorjorn. (Turret)\nThis is not a exausted list. Anyone can hate any character for any random reason.",
            "i know people love being nice and can’t expect people to be rude for no reason, but we really shouldn’t try and better individuals who are shouting at others to kill themselves. it quite literally is best to report and ignore",
            "Yeah--but you also shouldn't respond with personal information to give them further bait, either.",
            "It's not fully automated and if you write a description with your report you are more likely.to see action.",
            "The person was telling him to kill himself before they mentioned their friend. If you think that's appropriate or are not sympathetic to why that's harmful you are the anomaly.",
            "Ran into it face first with the \"acktually\"",
            "This just is the truth\n\nThey wouldn't even survive CS2 lobbies let alone that",
            "and? he wouldn’t survive auschwitz either. so what? shit on terrible people not good people surprised at shit behavior. you’re like every other toxicity apologist online.",
            "Or they need to grow up and not let losing a game mess up their mental so much that they lash out at other people.",
            "This is the answer. The world isn’t your safety bubble. Learn how to exist",
            "Sad but true. We spend too much time trying to teach kids/people not to offend others and not nearly enough time teaching them how not to be offended.\n\nPart of it comes from the stigma created and perpetuated by society around certain words/phrases. Building these words up so astronomically like they are a literal weapon only makes toxic people want to use them more. And it gives *more* power to those who do use them. \n\nI wish people could see that.",
            "or we could just get rid of the \"toxic losers\" and fix this problem",
            "This is not helpful, learn to read the fucking room.",
            "This op and most people in this sub were obviously not around for H2 or COD mw2. I heard worse than this almost daily. I responded by talking shit back in response 😅 don't let random nobody's get under your skin. Just tell them to suck your d or call their mom a hore",
            "Ah yes the I suffered therefore you should suffer fallacy.",
            "If you can't see how serious those three letters are then you need more than help.",
            "[deleted]",
            "No one should ever be told to kill or harm themselves, so yeah monetization should be in any online game to ban shitty people like that.",
            "Xister??? Oh hell nahh, y'all weird",
            "I have to agree with VC stuff…I feel like the game and voice lines tell me all I need to know lol. \n\nI don’t need someone’s commentary it rarely helps if anything it’s distracting to me. So yeah turning it all off is super peaceful and you do get used to it 🤣",
            "Honestly, with the ignorance of the first threat, it isnt very surprising. OP did nothing wrong, but unfortunately there are some stupid dumbfucks that dont have their head in the right place. \nI guess the take away is, dont disclose personal information to those ppl, they dont deserve attention, much less reasoning with them.",
            "why would we NOT expect someone telling others to kill themselves to continue to do so after being given more information that can be used against people?",
            "Why would you ever expect that to work? You're just giving the troll more ammunition to insult you with, you're never going to get through to their conscience. Best you can do is mute them immediately and report them after the game. People love feeding the trolls.",
            "They haven’t since before Microsoft took over",
            "you can turn off the filter and see every message in the game. but only one phrase in the chat is auto changed, and that’s the ggez line. \n\ntheir critique is why do that instead of changing the lines of slurs to something else",
            "It is very reasonable and accountable to acknowledge individual details like that with criticism even when they’re not in the wrong. You are not immune to having made mistakes in a situation like this just because you are a victim. It’s not “both sides” and it’s not “victim blaming” it’s just a tone-neutral and normal assessment",
            "No its not. It's common sense. There's no victim here.",
            "You're comparing an actual ww2 death camp to a video game nice.",
            "Totally the same thing?? a death camp and mean comments?? Why stop at an account ban - get them to Hague at once for war crimes / execution.",
            "If you think being told kys is the same as auschwitz...hmmm you know what, carry on.",
            "This sub and community can’t handle toxicity",
            "Yo im not American. People don’t tell me to k.y.s in real life. And kids get not shoot in school. So I don’t have to accept that nobody has to. The world isn’t the Wild West either.",
            "You'll never get rid of all toxic people, that's the unfortunate reality, they exist in literally every aspect of life. Learning not to let trolls get to you is far more productive than imagining a world where toxic people don't exist.",
            "Which F2P games don't have toxic players?\n\nWe can then copy what they do?",
            "How you gonna do that? It’s impossible 😭",
            "There is no end to toxic… that’s the point.. everytime a ceiling or floor for toxic is set it shifts again over time… some people get offended when people use the No voice emote in game and report that. You can’t fix the world, but you can’t fix yourself. \n\nIf you find your mental health being affected by a game, step away and avoid it. The only one it’s going to hurt in the end is yourself.",
            "The room wouldn't need to be read if everyone wasn't so fucking sensitive lol. Remember the old saying that the little kids say??\n\n \"Sticks and stones may break my bones but words will never hurt me\"\n\nStop being snowflakes because someone said a mean word",
            "You know what's helpful? Growing some thick skin and learning not to get touched by words.",
            "Gonna cry?",
            "raul menendez grindset",
            "im not gonna kms because someone on the internet video game told me to, every other fucking post on this subreddit is complaining about this, just submit a ticket and move on holy shit we dont post about it every time we meet a new asshole",
            "Triggered over words and letters from an online random in a video game. You bruise from the breeze don't you",
            "[deleted]",
            "Honestly, people that don’t see the gravity of these types of words probably haven’t experienced love in real life and all their life experience comes from anime.",
            "I have my filter off and racism that isn't intentionally misspelling the word is filtered. I see people swearing still.",
            "I don't disagree, but to be fair to OP there is also another argument to be made that if everyone ignores the behaviour and just silently reports etc that that doesn't help the situation either - That person will continue to do and say those things because they don't see the person on the other end of the screen as a person, they're just saying random things with no guilt associated with it.  \n  \nIf OP is \"sound\" in his own mind as he said, like.. why not?  \n  \nIt's more things to report the guy for, more evidence, and on top of that by communicating that info in a calm way and not \"rising\" and giving a massive reaction you're more likely to make the shithead remember that he's talking to actual real people.  \nSure some people have no guilt and literally don't give a shit and never will, but they're probably a minority and I'd wager that if enough people reminded the bell end that players are humans with lives, he may well eventually start to feel some semblance of guilt and one day eventually stop",
            "[deleted]",
            "Not handling and not accepting are two different pair of shoes. The op is handling it by having a conversation about it. You and the others accepting this behaviour and letting it slide are in fact not handling it.",
            ">Which F2P games don't have toxic players?\n\nI don't play it anymore but I never encountered a toxic person on Warframe.",
            "? i just meant we should chatban overly toxic people",
            "It's not about normal people. It's about people who are already down in the dumps, have a weak mental state or are mentally weak in general. Chat like this can be the final nail in the coffin.\n\nTbh people like that should have nothing to do with a competitive game like this. \n\nPersonally I have noticed I had way more fun in game just turning off text and voice chat. If anyone is having problem with toxicity they should do the same. \nI normally don't care about toxicity but sometimes I get tilted from annoying comments which in turn makes my performance poor. So turning off chat and focusing on my own game is much better",
            "interesting, because for me nothing is censored in chat ever. i have seen multiple slurs fully typed out, no filter avoiding. i can even test in game",
            "It's a comparison an it's not a good one in the slightest, you may not see it that way but I'm willing to bet a good half will.",
            " Cope\n\nIt’s a blizzard problem and an online gaming problem",
            "I never played it, but it sounds cool! What does Warframe do that prevents toxicity that can be applied to Overwatch?",
            "What cope? This word doesn’t make sense in this context. Laws exist and they also apply to the web. They just need to be enforced. If blizzard isn’t doing it by itself it needs more pressure from our governments. In the eu this was made pretty clear at least. They’ll get fined or the service gets banned.",
            "Probably nothing, Warframe isn't a competitive FPS, it's a  3rd person looter shooter."
        ]
    },
    "I feel like the new map really displays the beauty of Overwatch": {
        "title": "I feel like the new map really displays the beauty of Overwatch",
        "score": 152,
        "url": "https://i.redd.it/t0mn00vbq08d1.png",
        "content": "",
        "num_comments": 4,
        "comments": [
            "I'm not sure how I feel about this emperor's new groove.",
            "Can't wait to watch the kings new boogie",
            "How the hell did I not see this",
            "!!!"
        ]
    },
    "NOOO MERCY YOU CAN'T DO THAT": {
        "title": "NOOO MERCY YOU CAN'T DO THAT",
        "score": 87,
        "url": "https://i.redd.it/pb9iwo1av08d1.png",
        "content": "",
        "num_comments": 16,
        "comments": [
            "Mercy blackface? (Bottom left)",
            "They holding shift idk",
            "Do you think she can say it now?",
            "\"*White* HEROES NEVER DIE!\"",
            "I KNEW IT MERCY IS RACIST",
            "Huh",
            "Back to her old concept art, I see? (Seriously though, how did this happen??)",
            "Mercy looks different today",
            "Hero lives matter!",
            "In the Viking skin no less 😭",
            "Nono that's an error",
            "Fr\n(look at bottom left, that's the main thing in this)",
            "She always could",
            "I can too",
            "Check the hero portrait",
            "OMG\nMERCY"
        ]
    }
}