{
    "Weekend RAGE Thread - June 22, 2024": {
        "title": "Weekend RAGE Thread - June 22, 2024",
        "score": 6,
        "url": "https://www.reddit.com/r/Overwatch/comments/1dlqluy/weekend_rage_thread_june_22_2024/",
        "content": "HERE YOU CAN GET RID OF ALL YOUR ANGER AND HATE.\n\nCAPS ON AND LET IT ALL OUT. \n\nGETTING NOTHING BUT DUPLICATES WHEN ALL YOU WANT IS THAT SWEET NEW TORBJÖRN SKIN? GETTING HEADSHOT BY ACROSS THE MAP BY HANZO? TOO MUCH JUSTICE THAT RAINS FROM ABOVE? THIS IS THE RIGHT THREAD!\n\nPLEASE STILL BE CIVIL, AT LEAST A LITTLE!",
        "num_comments": 16,
        "comments": [
            "PLEASE SHOOT THE MERCY WHILE SHE'S RESURRECTING! WHY IS IT ONLY ME!? SHE'S IN OUR ZONE BY HERSELF!",
            "I just got off three back to back matches against teams who knew what they were doing, around my skill level. With teams WHO DIDN'T EVEN GET ON THE DAMN OBJECTIVE ONCE. AND WHO WERE PLAYING DEATHMATCH INSTEAD OF OVERWATCH. WHO WERE PLAYING DEATHMATCH VERY POORLY. BECAUSE EVERY TIME I TRIED TO DO ANYTHING OTHER THAN KILL OFF STRAGGLERS AS SOMBRA, I COULDN'T RELY ON THEM TO EVEN STAY ALIVE.\n\nI've seen it said here so many times that \"If you were good enough, you wouldn't have lost\" or \"sounds like you belong in your rank\" ... NAH, MATE. TEAM GAME. SOLO PLAYER.",
            "SHOOT THEIR FUCKING TANK SHOOT THEIR FUCKING TANK THEYRE NOT IMMORTAL GOD I HATE MY DPS PLAYERS IM GRABBING ALL THEIR TEAM'S ATTENTION AND THEY HAVENT PACKED UP A HALF HP ORISA FUCKKKKKKKK STUPID ASS DPS PLAYERS",
            "Lifeweaver changes I'm not a HEALING PYLON",
            "The qp matchmaker has gone to sleep and it's ruining my life :(",
            "WHY IS IT 2 TYPES OF CREDITS I LITERALLY NEED 10 MORE LEGACY CREDS TO 3000 FUCK YOU BLIZZARD",
            "Welcome to r/Overwatch!  Please use the following resources via the links below to find relevant information about the game and the subreddit.\n\n[Overwatch Patch Notes](https://overwatch.blizzard.com/en-us/news/patch-notes/) | [Overwatch Bug Report Forums](https://us.forums.blizzard.com/en/overwatch/c/bug-report/9)\n\n[r/Overwatch Rules](https://www.reddit.com/r/overwatch/wiki/rules) | [r/Overwatch FAQs](https://www.reddit.com/r/overwatch/wiki/faq) | [r/Overwatch Common Bugs and Posts](https://www.reddit.com/r/Overwatch/wiki/commonbugsandposts)\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Overwatch) if you have any questions or concerns.*",
            "WHY ON EARTH , WHEN I SETUP A TEAMFIGHT AS DOOM, EVERY SINGLE TIME ATLEAST 2 OF MY SQUISHY DIE IMMEDIATLY BEFORE I CAN EVEN GET TO AN BETTER ANGLE AT ALL............",
            "For those of you complaining that Lifeguard Kiriko is wearing shoes, fear not! Calamity Empress Ashe has you covered!\n\nThat's why I am skipping this skin, that really bugs me.",
            "ow keeps disconnecting me from game. repeatedly. causing me suspension cooldowns and endorsement lvl. removes me from game to loading screen and then to main menu. all under 5 seconds. WHYYYYYY",
            "3 leavers on my team in my last 7 comp games. \n\nSo basically the worst time to play is when you’re excited about a new season and balance changes. Cool, what a wonderful game this is. ",
            "WHY DOES EVERY LOW ELO QP GAME HAVE A PHARAH ON THE OTHER TEAM IM SO BORED I DONT EVEN CARE THAT IM LOSING TO HER I JUST WANT HER GONE SO I CAN HAVE FUN AGAIN\n\nthank you for your time",
            "holy shit i am so sick of just watching my teammates throw while i tank\n\nhealbots you are the worst culprits",
            "it is absolutely insane how terrible the DPS and tank players have been tonight.",
            "WHY TELL ME TO SWAP TO MERCY ONLY TO FLAME ME FOR BEING MERCY AT THE END WTF BRO BE A BETTER TANK",
            "A mercy request from a tank is a sign you’ll see red on the progress bar in 10-15 minutes. "
        ]
    },
    "Overwatch Retail Patch Notes - Jun 20, 2024": {
        "title": "Overwatch Retail Patch Notes - Jun 20, 2024",
        "score": 633,
        "url": "https://overwatch.blizzard.com/en-us/news/patch-notes/",
        "content": "",
        "num_comments": 647,
        "comments": [
            "The kiriko change really needs a full list of what it doesnt and does clenase now",
            ">Flashbang\n\n>Magnetic Grenade ability is now Flashbang\n\nI genuinely laughed out loud",
            "For Push Maps\n\n>Reduced the match time from 10 minutes to 8 minutes in Quick Play.\n\nYAY!",
            "Nobody talking about the map changes to Colosseo? Looks *way* better with more cover and less punishing chokes.",
            ">sym hp and beam ramp up speed buffs\n\nSymmetra finally putting away the clown nose?",
            "kiriko mains are not gonna like this",
            "we all just wanted a mag nade rework...\n\nblizzard rained nerfs upon the poor fool.",
            "Wasn't Lifeweaver supposed to get buffs?",
            "NOOOO SYM IS GONNA GET NERFED IMMEDIATELY",
            "Junk queen buff <3",
            "sojourn rails now pierce enemies.  nice.",
            "Are those the reaper changes they mentioned? That can’t be it",
            "AGAIN they promise to make Lifeweaver more smooth to play, but instead give quality of life buffs to half of the cast instead.",
            "Hog nerf, and buffs to Dva and Queen (and I guess orisa)\n\nNo nerf to Mauga feels kinda bad",
            "I like the design changes on Collosseo, and my girl Symmetra getting buffed is nice too.",
            "This is more of a Rein buff than a Kiri nerf. Well deserved as a Kiri main tbh. I cant even be mad at that, I was just not expecting any suzu nerfs this patch considering how mych they baby her.",
            "Why can't Orisa just stay ass",
            "Holy shit hog got gutted, doom mains feasting rn",
            "Lifeweaver mains aren't even asking for any big changes just speed up his weapon swap time atleast. Just so depressing to try to play mercy or lw currently.",
            "SUZU NERF\n\ni used to pray for times like this",
            "Trying to stay quiet as a Ball main these days and just collect my easy wins",
            "Okay but surely Reaper gets more than that right?",
            "They actually nerfed their golden child, Kiri?? Oh wow.",
            "Was the nerf to Illari's self heal from pylon actually needed?\nNot like she was an s-tier hero. But anyway, I'll take the extra 10 to allies, I guess.",
            "I guess this means they're happy with the DPS passive at 20%?",
            "They buffed Illari Pylon? This can’t be real life.",
            "ANOTHER REIN BUFF LETS GO",
            "No buffs for life weaver are annoying but he’s a hero who feels extremely hard to balance \n\nHe’s a dedicated heal bot with one of the most powerful and bullshit/unfair abilities in the game \n\nHe takes little to no skill to get 80% of his ceiling\n\nHe feels horrible to play and yet horrible to play against \n\nSometimes you work hard play well and earn a kill which is taken away from you by his immunity pull \n\nSometimes your team flame you for pulling them whether it was the right thing to do or not \n\nHis single target healing can feel oppressive to get past considering it auto aims and has great range and can somewhat function around corners and obstacles \n\nYet his healing can also feel frustrating to use because of the quadruple delays it has \n\nTravel time \nCharge time\nReload\nHaving to swap between healing and damage with a delayed animation and only having access too 1 at a time \n\nHis damage is extremely bad inconsistent and inconsequential most of the time \n\nHis petal can be a great escape tool for him but can be frustrating for both his team mates if it’s used wrong himself if his team mates use it wrong\n\nHis ult is for the most part fine and well designed I can’t complain about it too much it’s a good contrast to zen ult where it’s less powerful/reliable, can be destroyed and is immobile with the upside of being able to perform other actions whilst using it unlike zen",
            "I can shove Cassidy's gun up a Hero's nose and fan the hammer will do barely any damage. And it does even less damage now? Lol.",
            "...That's it?",
            "Cassidy is even further nerfed. The DEV team hates him so much its incredible. Rework his ult. PPL want smth deadly that you need aim for, not a fucking zoning ult. \n\nFlashbang way to short range, needs longer duration and less CD.",
            "big fan of mercy's temporary rez tbh",
            "Mauga Chads: we live to another day.",
            "no lifeweaver or mercy buffs we hate it here",
            "Wow a lot of weird changes here:\n\n- RIP Cassidy everything just got worse for no reason\n\n- Sym changes are good but really they just need to refocus her kit. Her gaining ammo and health on shields and sonar turrets are not needed.\n\n- Tank changes are cool but people will always hate tank\n\n- Kiriko swift step change is good, suzu change is going to make tank even less fun for most people lol\n\n- Iliari changes are cool\n\n- Not buffing Mercy is just kind of rude tbh\n\nEdit: Also no LW changes is crazy. Like even from a purely winrate perspective he's sitting in the mid to low 40s on publicly available information lmao",
            "Souljourn change is a buff....STOP GIVING COMPENSATION BUFFS",
            "[deleted]",
            "Its a good patch when suzu gets nerfed",
            "KIRI NERF!",
            "LOL combat roll nerf for Cassidy with literally no mention of it or why is hilarious....also nerfed fan the hammer with no mention of why.\n\nuhh do we get a roll back on a kill then? \n\n\"no.\"\n\nWhy are you nerfing him like 4 times with a rework? Why is the deadeye change so half a nerf...did you at least change his bigger than zarya hitbox??\n\n\"no.\"\n\nthe dude could use an actual rework, fan the hammer can be way cooler than just a machine gun mag dump. its lame...\n\nWe got flashbang back, without the stun...uhhhhhh yea thats one huge \"rework\" blizz.\n\noverwatch 2 everyone...wasted potential",
            "no hanzo changes rip",
            "Im not the only one who thinks cass flash bang is useless and makes him trash now ive played 7 games and just cant make it work at all",
            ">Dva\n\nHUGE buffs to her, despite what it seems. Dva's primary focus is isolated squishies, booster at 25dmg is a massive W. Tighter spread helps kill a ton especially on larger squishies.\n\n>JUNKER QUEEN\n\nFigured they'd make pull better against tanks. I'm liking this trend of making \"exceptions\" for tanks, rather than overall flat changes. Ana's sleep dart is a good example.\n\n>ROADHOG\n\nHes still going to be a pubstomper, but this is great. Hog got away with tons of terrible positioning for free.\n\n>CASSIDY\n\nWow lol. Can't really tell what this'll be outside of playing it myself. Ik the focus is flashbang, but high noon sounds funny\n\n>SOJOURN\n\nGoddamn right. They FINALLY acknowledged her railgun is stupidly annoying. Pierce is pretty crazy though, and hope some skill with primary will be shown. Before its literally just farming equipment.\n\nEdit: On second thought shes still prob going to be cracked. The compensation she got sounds pretty damn good\n\n>KIRIKO\n\nRein mains should be popping a champaign rn. Cleanse is meant to do exactly what it says - CLEANSE status effects. Discord, anti, sleep, hinder, etc... They came in with this ability and decided \"you know, cleanse really doesn't do enough, maybe we should make it heal, give invulnerability, and file your taxes for you.\" If you get your ankles broken by shatter, a single button shouldn't negate it.\n\n10/10 patch, big W",
            "Still don’t think Sojourn needed the buff to the primary fire to compensate. A hero that can play 76 and Ashe at the same time with even more mobility should never be able to oppress the other team as much as she does.",
            "What are they fucking smoking to come up with these soujourn buffs",
            "LMAO what a terrible patch",
            "Did they make any changes to the time of day on maps? (dawn/afternoon/sunrise/night, etc.)",
            ">All past incomplete Weekly Challenges can be completed at any time in a given season.When the Weekly Reset occurs on Tuesdays, incomplete Weekly   \nChallenges gain an additional copy of that challenge. When a Weekly   \nChallenge is completed, if that challenge has copies remaining, the   \nChallenge will refresh and can be completed again.\n\nCan someone ELI5? I have a migraine and can't parse this.",
            "Reaper buffs let’s goooo",
            "So the main reason to cleanse Shatter now is simply to keep your team alive for a couple seconds while they're down. Glad Rein got a slight buff to his ult in that regard.",
            "Wasn't there supposed to be like a huge rework for reaper?",
            "Does anyone know how to functionally use Syms turrents in the community craft mode? I reallty dont see how they are useful now. they are just a strait beam that dont lock on, and you cant really place them in ways that are actually helpful. Plus they still get destroyed super easily so its still easier to clear them.",
            "Solider 76.",
            "Man I am really not feeling this battle pass at all! Ashe's skin is cool, and I'm sure some people will love all the new skins, but they were pretty mediocre to me.",
            "> Weekly Challenge Catch Up\n> \n> - All past incomplete Weekly Challenges can be completed at any time in a given season.  \n> - When the Weekly Reset occurs on Tuesdays, incomplete Weekly Challenges gain an additional copy of that challenge. When a Weekly Challenge is completed, if that challenge has copies remaining, the Challenge will refresh and can be completed again.\n> \n> Weekly Milestones\n> \n> - Weekly Milestones are challenges progressed by completing other Weekly Challenges.  \n> - Each week, a new Weekly Milestone is unlocked. All past Weekly Milestones can be completed at any time in a given season.  \n> - Weekly Milestones progress one at a time. All past Weekly Milestones must be completed to progress a Weekly Milestone.\n\nAs someone who doesn't play consistently throughout a season, I like these changes.\n\nI find the lack of Seasonal Challenges to be odd.  There's only one right now.  Maybe it's a bug?",
            "solider: 76",
            "Maybe it's just me because I never played OW1, but I hope flashbang gets a range buff eventually. It feels like you need to be in the opponent's face",
            "I'm genuinely surprised that Flashbang is back.",
            "Double pylon for Illari is so amazing!",
            "Does that Illari nerf mean what I think it does? Her pylon only heals herself for half? So 20 per projectile? That is a massive nerf to an already off meta hero.",
            "Wow they really hard nerfed Kiri. Well...all the Kiri's who play reactionary and not active. So most of us. Lol.",
            "So rein players don't have to track suzu cooldown anymore, while it's still a requirement for basically every other hero. But hey, they need it since all rein players are in bronze. And it's sure to boost the sales of the mythic weapon skin! \n\nIt's a step in the right direction for sure, but in practice it's making an exception case for earthshatter only. Because nobody suzus rocks or clashes to remove the stun, they do it for the invuln against the follow up damage.",
            "I like how every patch has just been them reversing the dumbass changes and additions and reverting them back too OW1 shit lol. \n\nNot saying the OW1 stuff is good, just seems like some of the OW2 changes were so bad (hinder and armor changes) that they just said “fuck it” and reverted them while acting like it’s a whole new thing.",
            "No changes to Doom? Joke.",
            "HOG NERF YIPEE",
            "Reebea mains gonna be eating good.",
            "Orisa was balanced or was off meta finally, not every match was I seeing here, but then they buff her for no reason. Rein has been off meta for so long. It's so hard to play him. When will they ever make rein meta or atleast balanced. He has been F, D or C tier for far too long. He is countered by so many heroes. Jesus.",
            "Illari remains trash, turret's cd is too much punitive.",
            "whats my man Zen got to do to get a buff?",
            "lol trash tier mercy no changes, gonna be throw pick again for the season xD",
            "Kiri nerf🙏",
            "SYMM GOT HER 25HP BACK\n\nPraying this doesn't get reverted within a week",
            "Sym 🥰🥰",
            "Welcome to r/Overwatch!  Please use the following resources via the links below to find relevant information about the game and the subreddit.\n\n[Overwatch Patch Notes](https://overwatch.blizzard.com/en-us/news/patch-notes/) | [Overwatch Bug Report Forums](https://us.forums.blizzard.com/en/overwatch/c/bug-report/9)\n\n[r/Overwatch Rules](https://www.reddit.com/r/overwatch/wiki/rules) | [r/Overwatch FAQs](https://www.reddit.com/r/overwatch/wiki/faq) | [r/Overwatch Common Bugs and Posts](https://www.reddit.com/r/Overwatch/wiki/commonbugsandposts)\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Overwatch) if you have any questions or concerns.*",
            "That Suzu nerf is actually a Rein buff in disguise.",
            "The Suzu nerf and collision knockdown reduction for Rein are so nice to see.",
            "Does this mean I can oneshot tracer again as Mei?",
            "Those colloseo changes are huge",
            "So no notes about what the changes are for each hero in the community made mode? Just an arcade map where you have to try out each hero and figure out what changed. I'm sure its fun, just really really need a list of the changes",
            "Big fan of these changes! Will be excited to see how they play out for sure",
            "They finally bring back better flash grenade",
            "end of season comp rewards not found",
            "So JQ's knife gets an extended buff against tanks but Ball's fireball boops don't get the same treatment?",
            "So does cass’s flashbang stop Reins charge still?",
            "Suzu change is inconsistent and unintuitive, even if well-intentioned. Not a big fan, though it'll be nice to actually land Earthshatters for once!!!!",
            "Is online server down still?",
            "Did they nerf or buff Sojurn? I can't tell, looks like huge buffs",
            "How difficult is it to add LW secondary fire to his other hand? Would it be too awkward? Too similar to Moira?",
            "I play a lot of Kiri, Tracer and Sombra and I want all of those changes to be real. omg. arcade reworks btw",
            "Revert boop please I'm begging you please please please please",
            "Once again r/Lifeweavermains are in shambles",
            "nothing for hanzo??",
            "Illari buff w",
            "dis patch is fantastic! =DDD",
            "Ramattra is a joke now",
            "Kiriko changes are not clear. Having an ability that works a certain way against certain heroes’ hard stuns and different for others is messy. Define what the purpose of the ability is and clarify it for everyone so Kiriko players don’t have to relearn how their character works every few patches.",
            "What was Cassidy magnetic damage in S10?",
            "The fucking abomination gets even worse, lol it's remarkable really, Overwatch has the most inept devs in the industry (considering the mainstream)",
            "COLLOSEO SAVED⁉️",
            "Did i miss something?  I thought Legacy Competitive Points would be added into the current ones.  I'm stuck at 2900 Legacy :\\",
            "Some notes about the extreme lag (300+ ping), only at the start and the end of the match on PS5? Started after the season 11th update yesterday...",
            "Just what we needed, lack luster \"reworks\" and a buff to the dps who has been literally dominating the game since her release",
            "They literally just went full circle and flashbang is back\n\nOverwatch 2 ladies and gens. In development for years",
            "Dude NERF sombra. It’s been 2 seasons now nobody wants to play against her. I’m so sick of people being rewarded for playing an invisible character",
            "hope the cas changes are a joke, flashbang is useless if it only hinders for ~1.5 seconds and has no range",
            "Genji my beloved still dead in a ditch",
            "SYM BUFF LETS GOOOOOOOOOOOOOOO!!!",
            "This is one of the worst patches in the OW2 span period, totally unnecessary Illari and Sojourn buffs.",
            "Damn cleanse is kind of bad now. No buffs to compensate either. ",
            "This patch is so trash. I just started to learn to play Cass as well and I thought his kit was fine as it was. There was no need to change anything and yet they nerf him twice and give him a useless flashbang. Absolutely gutted him for no reason.",
            "Solid changes, i'm expecting to see even more Mauga now if the hog changes are as impactful as they seem",
            "Earthshatter Chads we winning\n\nSalty smoothbrain kiri mains downvoting now lmao",
            "I thought LW was supposed to get a thorn volley buff?",
            "We're finally back sym bros.\n\nWe're gonna get nerfed mid season like always lol",
            "All of these are good changes honestly. Few more heroes could use a change still, but let's hope it comes in next patch.",
            "Blizzard has a random habit of giving Dva 2 tiny buffs that don't do very little even tho she needs 0 buffs at all.",
            "If Flashbang is back, but now hinders (and slows) instead of stuns...\n\n...should Brigitte's Shield Bash also hinder?",
            "Actual good patch",
            "Great patch all around! Most excited for the push+coleseo changes and new map",
            "As a kiri main this was much needed😭 It never felt right just to be able to undo an entire shatter with a cooldown ability. I'm pretty sure it still cleanses if you suzu right before he shatters. but you won't be able to cleanse the shatter once it actually happens. This is what was needed. An ability that powerful on a 14 second cooldown needs to come with skill and good timing, rather than just cleansing every ult in the game with no need for fast reaction time",
            "When are they going to make Brig not useless?",
            "The 25hp was exactly what I was hoping would happen. That'll make all the difference imo",
            "No sombra nerfs… great. She’s broken in quick play and lower ranks.",
            "- Sojourn Buff   \n- Pharah unchanged\n\nClowing hardcore again I see.",
            "Why did they nerf Illari out of all heroes ? Bruh",
            "Hard knockdowns (off the top of my head, but I think this is all of them) are the Rein shatter, Mauga's goomba stomp, the punch/charge/bash interaction (which got reduced in duration this patch anyway), Sigma rock. They state Ana's sleep is unaffected, so that doesn't count. \n\nMost of these are such short duration that they aren't really worth the cleanse or would be expiring by the time most Kiri players would cleanse them anyway. The biggest change is Rein shatter not being totally ruined by suzu anymore. If you want to suzu a shatter, you have to do it before it hits now, which is much harder and requires significantly better timing.",
            "KarQ is probably going to do a video demonstrating everything soon",
            "I’m assuming it might mean the sigma rock knockdown also can’t be cleansed since it works similar to reinheart’s ult?",
            "It says it doesn't work on all knockdowns except for Ana sleep",
            ">No longer cleanses most hard knockdown stuns\n   \n>Proceeds to list two of the most common hard knockdown stuns. One is cleansed by Suzu, one isn't \n  \nBitch, you want to clarify that a little bit better?",
            "hard knockdowns is all she cant cleanse now no? not that hard.",
            "Yeah, I feel it's inconsistent now. :X",
            "Yeah me too. \"Magnetic Grenade ability is now Flashbang.\" it is just written so matter of fact that it sounds like the balance team is just tired and defeated.",
            "Somehow, Flashbang returned.",
            "It only took 20 months, but we did it.",
            "The biggest buff here is that they got rid of those stupid mag grenade voice lines.\n\nDunno about anyone else, but to me his mag grenade lines always sounded like they were trying way too hard to drive home the idea that he was a literal olde-timey cowboy rather than just an aloof southern gunslinger.\n\n\"That should be in your bonnet!\"\n\n[Edit: apparently it's \"That's a bee in your bonnet\"?]\n\n\"Can't buck that off!\"\n\nLike come on guys, these lines are a bit much.\n\nHopefully they give him back his old flashbang voicelines. \n\n\"Woah there!\" \"Now hold on!\"",
            "And they nerfed his break points.\n\n3 shots and grenade was 290 (or 1 headshot, grenade, 1 body shot)\n\nNow it's 245. God forbid you manage to hit someone with 4 things and have that be enough to kill them I guess.\n\nAnd FTH got nerfed too? 300 damage total down to 270. So now if you take the risk to get close to symmetra, use all your ammo, and control the spread enough to land every shot, that's too powerful if it kills?",
            "The Devs rly need to hate Cass. They keep nerfing him.\n\nI see in which direction they want to go but the changes are just to weak.\n\nGrenade needs longer range, less CD and longer Duration.\n\nUlt need total rework instead of nerfs or buffs.",
            "Can't play right now, can anyone confirm if it still disables mobility abilities?",
            "Yeah I'm a huge fan of these colloseo changes. That map was so ass. Giving more space around that forward spawn check point is so nice. Not to mention no longer face planting into those glass walls or trying to heal through them",
            "Massive changes.  I love the new bit at the turns and the alternate routes.  Also, adds some color to the map.",
            "Seems like the other big thing is the change around the hairpin turn. Looks like you can forget about booping people off that edge. _And_ there’s a mega health pack there now.",
            "I played twelve comp games last night hoping I'd get to see new Colosseo. Nope, not yet. \nExcited for it though!",
            "I haven't played it yet, but I like that the awkward area that used to be behind the glass has a bit more purpose now.  I always felt kinda lost if I ended up back there :P",
            "She's going to put it right back on in a week when they emergency nerf her again because her pick rate doubled*.\n\n*From 2 people to 4 people.",
            "If the past is any indication, keep them shoes in the trunk in case they revert it next week.",
            "Symmetra is gonna keep the clown nose somewhere close to her because she will need it in a week or so.",
            "happy pride fellow symmetra enjoyers",
            "I have a feeling she's gonna be a menace. Increased health and faster buzz beam charge? She's gonna sit on the point and melt people.",
            "Am I crazy for thinking this is an extremely minor nerf to Kiri?",
            "I main Kiri and this is reasonable. Yes, it's funny making enemy reins miserable (especially when you always get the unpunished ones), but it's definitely overkill, and it's not like you can't still prevent it, you just can't undo it.",
            "Nah I love the nerfs. They don't take away her abilities, but just make them less braindead to use. \n\nYou can still do aggressive flanks, just have to be more mindful of your cooldowns. Still might be able to block shatter, but you need the hard read on when the Rein will use it and judge the timing right.\n\nShe has the potential to be the support with the most skill expression. Can be a high risk, high reward character if tuned properly.",
            "You know what, it's fine. Rein mains deserve this joy, and Kiri is already so strong, this isn't going to destroy her lmao",
            "I play Kiri a lot and even I thought that cleansing an entire team of a shatter was way too strong.",
            "I think this is fine. Suzu is already so strong. It'll just make it all the juicier when you react to/predict the shatter before the knockdown.",
            "this is no big deal.\n\ni can live with both nerfs. suzu is still probably one of the top three cooldowns in the game. swiftstep change is minor. i rarely need it every seven seconds. i probably wont even notice",
            "Honestly, it’s not that bad. Reinhardt is the only enemy hero that you gotta watch out for with this change. Any other hard stuns are coming from charging heroes colliding, which affects both and sort of cancels out any true advantage.",
            "Actually, if you head over to the r/kirikomains sub, they seem mostly ok with it. It’s definitely a nerf, but they don’t think it’s a huge nerf, at least not enough to break the hero.",
            "Kiri has been meta since forever, I think these changes are ok since it really only affects rein's shatter. There are other of these hard knockdown stuns (I think someone said sigma rock, mauga stomp etc) but they are shorter so you would suzu for the invul and less to remove the stun in the first place.",
            "The suzu nerf is going to be barely noticeable imo.  The swift step nerf is gunna fuck with my muscle memory for awhile, and I will def die more because of the extra second, but I don't think it's that bad either.\n\nI will say that it's funny to me how everyone is focused on the suzu nerf when the swift step nerf is a much bigger deal.  I'm in situations probably around once per game where I'm where I'm holding shift with ~50 hp, just barely surviving when it comes off cd in time.  If all of those situations turn into deaths now, it's gunna be a rough time.  Will have to play less aggressively, which also sucks because playing aggressive on her is what makes her so fun.  Guess we'll see how it goes.",
            "I think kiriko mains are kind of chill people, maybe because they get too many skins,  maybe because they know their hero is ridic op, maybe weebs are truly the happiest people, who knows",
            "They needed a nerf anyways, this is minor.",
            "The nerfs were very minor and the ult change seems quite interesting",
            "I think they just said they are thinking about how to improve the sluggishness when changing from attack to heal, no idea when this will be done tho",
            "Hopefully the midseason patch",
            "Please blizz free us from the dumpster 😭",
            "They have to rework that man he’s always either dogshit or he’s good and everyone hates him because he just outheals all damage and refuses to die",
            "\"He got a life guard skin coming out what else tf you wanted? \"- blizzard, probably",
            "It’s a great buff too because I only just mastered the pull+swing 1,2 on her kit.",
            "I’m getting scared, she keeps getting buffs and I’m not sure why…\n\nLike, I enjoy playing the fuck out of her(probably my fave tank, sorry Sigma) and I honestly don’t think she ever felt weak.",
            "Lol I'm imagining JQ stealing Reins voice line \"Cooome heeere\" when she saw the buff to her knife",
            "Sounds nice but I’m not sure how often it’ll come up compared to more single target damage which is always useful. As for the primary fire rate increase? Idk I would’ve preferred tighter spread or faster projectile speed instead. Have to see how it feels.",
            "*\"ooh baby a triple!\"*",
            "Oh God, she was oppressive enough already.",
            "Mer1t reading this: 👀",
            "It _always_ should have done this. I mean, that’s the whole railgun fantasy, isn’t it? A instant piercing shot.",
            "She could already do that when she ulted? Plus, they nerfed the damage significantly.",
            "Sorry but what does that even mean?",
            "OH BABY A TRIPLE",
            "Sojourn can now get a Quigley",
            "minor buff now, rework later (i think it will be very minor, like making shadowstep slightly more reactive and tighter spead/range).",
            "They mentioned doing a short term thing because the shadow step rework they want to do requires technical work that they think will take a while to complete.",
            "Was waiting for a comment like this. They said they were \"brainstorming\". But they did shit it seems.",
            "For Reaper it's less of a rework and more a series of adjustments",
            "They need to remove the voice line when teleporting not decrease the time",
            "As a sym main it'll happen give it time this patch is great for her so I have hope for lifeweaver too.",
            "Simply reducing the swap time on his healing/weapon seems sooo easy and would make a big difference. Idk why this takes multiple seasons to put together lol",
            "Hopefully the changes are substantial and therefore come in the mid-season patch?",
            "I'm not a fan of Dva buffs, but I guess I'm in the minority. I didn't think she was bad. \nI'd love to know where she was struggling for them to make that decision.",
            "DVa AND Queen buffs?  I am loving this already because those are probably favorite tanks right now.",
            "A lot of the buffs for other characters play into the counters for Mauga. He’s been inadvertantly  debuffed slightly as a result.",
            "Considering how much I see Winston compared to Mauga...",
            "Am I the only one who thinks Mauga is not that oppressive in ranked? Esp with the tanks that got buffed this patch typically are good into him",
            "Mauga is in a pretty good place rn to be honest. Just bait/waste overdrive and/or have discord/nade and he’s toast. Dva and Sigma are pretty good matchups against him to be honest.",
            "I'm glad they got rid of the glass, that was just ridiculous to have two parallel hallways with zero interaction between the two.",
            "Same here, I’m surprised to see fellow Kiri mains freaking out about these changes. She’s still going to be very good",
            "Yeah I was sad at first but then I saw sleep dart was unaffected and realized that there are only like 3-4 abilities in the whole game affected by this.",
            "You're the first Kiri main I've ever actually seen with the self awareness to know blizzard baby's her. I'm actually kind of shocked.",
            "hope they place roadhog mauga and orisa in the trash bin and keep em there 🙏🙏",
            "Until we get turned into swiss cheese in the Mauga ult",
            "WE EVOLVE",
            "That’s an exaggeration, his broken ass one shot combo isn’t touched and that’s what was horrible. He can do 300-400 in one hook pull, which is what needed to be nerfed, not his health",
            "Mauga still untouched",
            "\"Only through conflict do we evolve\"",
            "Lifeweaver is miserable to play and has been since season 9. DPS passive shits on him harder than any other support because his heals have both a charge time and a travel time. Spending the ~3 seconds needed to charge a full heal is never worth it since the heal will just be 20% less when it finally hits your target. Add to that how clunky his weapon swap feels at any given second, or how inconsistent the auto reload is while mid fight.\n\nMercy is fine imo, shes still a pain to deal with for an opposing team, and she still fits the role of \"team enabler\" really well. Maybe faster heal per second for the beam? The blue beam does not need a buff. Pocketed dps are unfun to play against no matter the role, and even more so since the S9 changes.",
            "Rock and shatter are the only two things in the game I can think of that will be affected. Recovery time for Stuns cancelling eachother out is faster now so Suzu will essentially do the same thing for that interaction, and Mauga stomp is uncommon/inconsistent.\n\nThe 1 sec swift step nerf is more substantial but still not really much",
            "His boop needs to affect tanks more if they’re making an exception for JQ. And his guns need a buff",
            "She gets nerfed every other patch",
            "Hardly",
            "Almost like she's been getting nerfs since launch 😭 but this sub loves their revisionist history",
            "I thought I’d never see the day😭",
            "i think they’re trying to de-incentivize her camping off angles alone",
            "Yes because her playstyle for a “support” is extremely selfish and she would be insanely broken if she had the rest of these changes without it.",
            "Half self-heals from pylon is disappointing but we’ll see I guess \n\nQueueing for Midseason patch where Illari will be nerfed because “outburst is too powerful”..\n\nAt least we are finally reaching a balanced Illari. Playing her before they destroy her again.",
            "Is it a nerf? They buffed it for allies but reduced it for her. So is the reduction after the buff? And if it is does that mean it’s the same healing for her as it was yesterday?",
            "Think I remember reading/hearing a dev say they were sticking with 20%",
            "I wouldn't mind the DPS passive being 20% **if** it was implemented correctly. There should either be a damage threshold of 50-100 damage to activate for x amount of time or have its effect and duration scale over damage dealt. A Tracer or Reaper spraying pebbles at the enemy team from range should not be able to give 20% reduced healing for 2 seconds.",
            "It was pretty weak before. I like the changes",
            "Yet she can only heal 16hps when tagged by the dps passive now meaning she’s worse in duels. They’re pushing her closer to being a healbot every patch.",
            "the kiri nerf? I do not understand the devs. I main Rein. Rein has been off meta for so long and Orisa was finally balanced this season, but they don't care about rein and buff orisa when no one asked for it. I play Orisa, winston, sig, rein, zarya. Rein is by far the hardest even while knowing how to play/rotate/when to put shield down, use covers, not being a shield bot. No one asked for a orisa buff.",
            "> No buffs for life weaver are annoying but he’s a hero who feels extremely hard to balance\n\nHe still feels really bad to play as the charge up heal is just annoying however you try to balance it. Every other supports main (LMB) feels much more cohesive. His platform is too niche to really consider as a utility and whilst his life grip is handy, it's nowhere near as handy as say a discord orb or a ressurection. His ult is also pretty good, but it's still not powerful enough to warrant using him soley for, Transcendance does similar for example. \n\nIt just means that if you don't like his LMB charge heal then you'll just choose a different support.",
            "Funny as fuck",
            "What is this referencing?",
            "Now I think maybe making it a chargeable ability would be good. Making it so that you can charge rez for longer to increase the duration of rez. Short duration makes it more complicated and making the duration adjustable will make it better.",
            "Thay hate us cause they ain't us.\n\nNever get so much flak as when I play Mauga lol",
            "Their buffs are in the community created mode. That means we'll have to wait 6 months to get half of those, at best.",
            "Silver/gold is already 80% pick rate on mercy it feels like. Anything to prevent it from going higher either playing with or against is perfectly fine with me",
            "Weavey boy needs a rework",
            "At least the Elden Ring dlc is coming out.   I just want to go back to OW1 so I can play with rein zarya and get out of this orisa>mauga>roadhog loop",
            "Good, fuck mercy",
            "Suzu change should make tanks feel better, no? Since the nerf only really applies to mostly tank abilities",
            "Sym gaining her ammo back on shields has been part of her kit since 3.0 back in 2018. Removing that without a significant buff elsewhere would be silly.\n\nBut the sonar turrets, and shield hp leech are ridiculous changes nobody asked for. Get rid of those, revert 'em.",
            "> RIP Cassidy everything just got worse for no reason\n\nbecause he can't yeet a grenade from half the map, bounce 20ft in front of you, then immediately attach to you?  RIP Cassidy for real??",
            "Or that they are willing to experiment and when things eventually don’t work the way they intended are also willing to reverse those changes. Like I get Blizzard has done a lot of dumb shit but god damn trying new things when balancing is not a bad thing.",
            "I'm glad I'm not the only one dissapointed. They just nerfed his anti-flank tool so for compensation he gets... more nerfs for everything else...? Why would I even pick Cassidy now over Soldier/Sojourn's consistant damage",
            "Its actually insane that blizzard advertised the flashbang change as a buff while nerfing the rest of his kit and not even bringing  back the stun. They can't even buff deadeye with out also nerfing it at the same time in a different way.",
            "The deadeye change is so strange to me. What benefit is there for it.\n\nOverall to me it seems like he got two nerfs and one meaningless change. I think the nade change is a good thing though. Mag nade was unfun to use and play against",
            "Personally I'm fine with the flashbang change. Before it was way too inconsistent but now it's truly a skill issue if you can't land it, but there was no reason to nerf the roll lol it's wild that you can't live a dva bomb now",
            "They literally butchered him I couldn't believe my eyes. It's so over for Hog and Cass",
            "same here he was doing fine all they needed to do was make him move more faster with ult but instead they took away the nade for a useless flash that hardly works with the tempo now and now he feels clunky again",
            "hanzo doesn’t need any changes wym?",
            "it feels awful, I can't imagine they don't change something. At best the flashbang change is neutral but its really worst against the majority of the cast (less damage and shorter hinder duration, the most noticeable against is reaper imo). The only case ive found where it felt marginally better is against tracer since its harder to rewind / blink dodge it but again its marginal. The absolute worst ive felt with it is any map with elevation change, old nade was useful to help slow down and deal extra damage to a target on a ledge above you but the pitiful range makes it unusable unless you're in their face. Combined with the plethora of nerfs the character feels gutted.",
            "I left overwatch as a cassidy some months ago because his ult and grenade are just trash and they cant balance him since years.\n\nI randomly come back today play my 1st match and see he got further nerfed.\n\nThe OW team is rly incompetent to balance.\n\nRework the fucking ult ppl with aim play this character... give him smth deadly that you need aim for, nobody wants a fucking zoning ult on him.\n\nGrenade way to short range, basically this is only worthfull in very few fight.\n\nNow this hero plays with one ability down.",
            "Is it the exact same as OW1? With the same range? That would be kinda stupid unless you can hit multiple targets with it",
            "Kiriko Accountant when?",
            "i dont think sojourn is as big of a nerf,secondary pierces, her primary does more damage and she charges ult faster now",
            "If JQ’s knife can pull tanks more then Ball’s boop should also be booping Tank’s more",
            "I just played a game on Lijiang Tower where its daytime",
            "All upside, no downside. \n\nIf you were at like 90% of a weekly challenge as the week ends, you still have that 90% carried over AND you don't lose out on a challenge from next week's pool as it just gains a charge that lets you complete it an extra time once you finish off the carried over one.",
            "In what world is this a 'hard' nerf? One second CD increase on teleport and suzu no longer can cleanse hard stuns. So... Shatter. ~~And Brig's ult bash I guess.~~",
            "Reaper got buffed so .. it’s meh while he got nothing",
            "Ehh you can prob still suzu the shatter before it hits. Maybe",
            "It's almost like, in hindsight, they should've just kept OW1 going. :/",
            "Imo doom is in an okay spot. What would you have wanted?",
            ">Praying this doesn't get reverted within a week\n\nYes she will T_T",
            "I think she would have 5HP? Was the buff 75 to 85? That would be a 170 headshot",
            "sojourn change is definitely not a buff.",
            "why is this a bad thing? they tried out a new thing and it didn’t work. at least they listened to the community!\n\nit seems like everyone wants immediate changes by the minute for things that bother them when in reality there is a list of 100s of other things the dev team has each sprint to address.\n\nthis game being in development for a long time has nothing to do with the fact that they prioritized other things like new maps, new heroes, and changes to lesser touched heroes.\n\n“this thing sucks for me fix it today otherwise broken game literally unplayable small indie studio billion dollar company cash grab skibidi fall off”",
            "There is no way you believe that",
            "Cass hinder change back to flashback feels like a big nerf tbh",
            "Play cass or just with your team in general.",
            "Genji mains are always a treat to read. Their character went from amazing to pretty good and they still haven't recovered.",
            "Cass changes are horrible. They go in the right direction but they just keep nerfing him.",
            "Pharah is extremely strong right now",
            "i still think the changes are an overall buff than nerf. i'm trying her now and she feels pretty good.",
            "Almost every change to Illari is a buff though? Sure she gets healed for 10 less per tick by pylon, but the exchange is incredible.\n\n-25 extra pylon health\n-Pylon heals teammates for 40 per tick\n-Burst jump/push does more damage\n\nIf anything this will help her pylon to AFK farm her ults even faster than before. Leaning into the DPS side of her kit is so much better for balance than just boosting her own survivability.",
            "33% buff to her pylon heal rate is huge. that's 2 less projectiles for 250 health. and she was too good as a frontline, self-sustaining DPS. now she'll have to hang back a bit more but also won't need to use the beam as much. this is a sidegrade for those playing her and a buff for anyone that has her on their teams",
            "but if you cleanse them while they’re shattered they’re still invulnerable right?",
            "Yeah seems like their objective was to indirectly buff Rein who has the perception of being a poor/frustrating tank to play.",
            "Mauga’s goomba stomp. I’m going to start using that. Hahaha",
            "I'm glad you said the part about it not mattering because I was getting worried I was missing some meta pro gamer move of using cleanse on my goomba stomped teammate xD. Fr her flash jump was a bigger nerf to her than the knock down cleanse (it's a panacea bottle why would it cure knockdown? That like throwing fist full of pain pills at a boxer that just got knocked out hoping one catches his mouth like a fucking senzu bean)",
            "They literally specify that its the stuns that knock you down on your ass like mauga stomp, if you fall on the ground, thats a hard knockdown\n\nAna is the exception",
            "Oh so you know every single stun effect that is known as a Hard Knockdown you daft prick",
            "like 'here, damn' 😭",
            "\"That was a lot of words up there huh? It's just flashback now folks, move along\"",
            "I mean it still only causes hinder affect rather than CC",
            "That's how we win. Not by throwing Magnetic Grenades, but by throwing Flashbangs.",
            "Life ughh, finds a way.",
            "Overwatch 3 is coming with 6v6, Orisa is getting her barrier back, and it’s called Overwatch 360 now.",
            "I though the line was “that’ll put a bee in your bonnet”",
            "I like his line when he nades junkrat tho smh",
            "There are no voice lines now at all. Only Lifeguard Cassidy now says swimming pool quotes not to run, which they were deleted with magnetic grenade. So it looks bugged.",
            ">That[s a bee] in your bonnet!\"\n\n>Can't buck that off!\"\n\n\nAt least in the Midwest, these are things cowboys and farmers say. Mm",
            "I don't necessarily hate the mag nade voice lines but the old flashbang lines were just cooler. Let the cowboy say his one-liners, he doesn't need to bring out the country bumpkin slang.",
            "Eh, I'd trade that breakpoint for an ability that I can actually land, felt like a coinflip mag nade would hit someone right next to you or it would just sail past.\n\nYou'll still out dps sym if you land even your regular bodyshots (and she's not already lvl3 charge), and that will be easier if you can consistently hinder her.",
            "He kinda got dumpstered for a character that really wasn’t super powerful. Nerfing his DR and somehow making Deadeye even more of a liability is certainly a choice.",
            "Dang, and here I was thinking I could sneak in there.",
            "this made me laugh",
            ">*From 2 people to 4 people.\n\nREAL.",
            "But to be honest, this isnt the kind of buff I was hoping for. Faster charge rate is awesome, yes, but I hoped it would come with a slight damage nerf for levels 2 and 3 (more consistent but lower damage). She’s going to be a nightmare I imagine. Also, turrets are still cosmetic",
            "The dozen of us will rise again",
            "buffing orbs is simply much less problematic. knowing their balance theyll just nerf this and go radio silence again, before admitting her orbs are simply terrible. hhhhhhhhhh why did they go this route this just makes things slower and more painful\n\nthey better keep that 275 hp tho",
            "There's a couple of weeks left. \n\nThey gonna nerf her back once it hits July 💀",
            "No corporations at Pride*\n\n*except for the fine folks at the Vishkar Corporation",
            "She still has glaring weaknesses that even it out so I don’t think it’ll be bad at all. Remember she doesn’t have any fast mobility or sufficient health steal so as long as you focus her down she’ll die",
            "I mean not really?\n\nThe last time she was 'good' with the 25 extra hp was a few seasons back before they nerfed the turrets and gutted her survivability, and even then you were better off picking hitscan. She's also still out ranged and out maneuvered by a large amount of the cast. \n\nSure these buffs help, but she's not going to be melting anyone if they have any form of game sense.",
            "Yeah she will.  I am awful at Sym, and when I get her in MH I mostly just poke and charge them rush in and melt a few people until I can die and roll a better hero.\n\n\nIf I can kick ass and be shit with her, she will be a menace with anyone who knows what they are doing.",
            "Nah she still has a huge huge hitbox and lots of weaknesses and counters",
            "It’s a minor nerf overall but a huge nerf to her strength against a select few heros (mainly rein)",
            "Doesn’t impact me. With my aim, my suzu always flies over my target anyways",
            "nope, you’re not crazy at all. but I think even a minor nerf to a hero like her would make them go crazy 😭",
            "I like that rein shatter is preventable, and feel all cc ultimates should be preventable but not undo-able \n\nAlthough maybe moving reins shatter off his back foot would be nice.",
            "If this is your idea of minor I would hate to see what you consider a serious nerf. Removing his gun entirely?",
            "Literally just make the animation instant lol",
            "It just just work like Baptiste's gun. Both ammos being tracked together, both reload together, and both can be shot without swapping anything.",
            "check out LW's arcade mode changes",
            "Hopefully. I just wished we had balance patches more frequently, for a live service game, having 1 patch in the beginning of the season and another in the middle, feels too little. If something is unhealthy to the game, it stays like they for a while, which might create frustration.\n\nI love playing LW and it kinda sucks having to wait almost 2 months for the possibility of him becoming viable again. He's not in an horrible state, but when I play him I feel like I could be more useful with many other supports, it just feels like he's not at other support's level",
            "He does 55hps. His healing isn’t good",
            "I really don't think he needs a rework, he's fine as is, he just needs minor adjustments to the reload time and overall flow of the abilities, and he'll be exactly where he needs to be",
            "yeah... they keep changing the numbers without fixing the core problem which means he's always gonna be mediocre or will be overtuned. He desperately need a small rework.",
            "Honestly, that's the Mercy effect, just like Mercy his healing is subpar but just like Mercy, he's a gradual sustain healer so if someone is low then he can't do anything else but healbot\n\n*mostly bc just like Mercy, people tend to overexaggerate how much players 'never die' when LW is healbotting them. The scary thing about the Mercy leash is the blue beam, not the yellow one: if there's a yellow beam shoved up Pharah's jetpack then you can absolutely out-damage Mercy's heals, the problem is the blue beam because what you may have trouble doing is out-damaging Pharah's boosted damage\n\nThe problem is that healbotted heroes are perfectly killable, but they still require so much extra effort to take down; it isn't exactly impossible to eliminate a yellow leash Orisa, it just isn't fun\n\nIt's way harder, however, to eliminate an Orisa being healbotted by Ana or Bap",
            "Her kit is one of the most satisfying in the game. The knife pulls are great",
            "The thing with Sojourn's primary fire rate increase is it means she'll charge railgun faster which will now have less damage but be usable more often and pierce.",
            "Sure 30 less damage on rail is nice. But I forsee this being a buff when fighting hog and mauga. Build rail off tank fast with quicker primary. And then pierce through the tank and get a bullshit hit on the people behind",
            "Was looking for this",
            "Damage nerf is big though. She's net worse this patch.",
            "She got a damage nerf to rail alongside it, she can't even one-shot Tracer anymore.",
            "you can hit multiple enemies in a line without having to pop ult",
            "Honestly think it would be fine if he could move while teleporting, maybe just slow him a bit.",
            "Forgot the \"Brain\" part of \"Storming\"",
            "Idk how people are obsessed with the swap time. I'm more annoyed by the charge time of the heal. It takes forever.",
            "They're waiting for the lifeguardweaver skin to drop mid season alongside it",
            "Yeah i swear every season Dva is just getting micro buffed lmao",
            "Yeah, Winston is flying under the radar. He probably needs to be tuned down a bit.",
            "It's *partially* a Mauga problem, but when people don't know how to play against him it feels especially terrible and he just stomps.",
            "Dva is not a great matchup against him, if she loses DM she melts. Sigma can deal with him pretty well though.",
            "The game is better when Mauga isn't one of the best tanks in the game.  They should have given him a small nerf as well.",
            "Him and hog are just sleeper to play against. Was hoping for a small nerf to his survivability. But with the other tank buffs I'm sure it'll be fine",
            "I don’t think anyone is freaking out, tho I do get annoyed by how everyone always says they’re touchy lol. I rarely if ever see them complain. If anything they complain about he she rarely gets real changes and only weird tweaks.",
            "As a Kiri main I love the changes. It pushes her skill floor higher. She still has great value if you can execute. I'm assuming hard knockdowns can still be blocked by the intangibility if you time suzu properly.\n\nIt forces a fighting game style mind game and timing mix-up situation which is so cool. Cleansing them normally takes so little skill.\n\nFeels like they want to make her more of a proactive support and reduce her ability to just backline and react to stuff. There's too many players, even at the Plat/Diamond level who get away with backlining Kiri and healbotting.",
            "Wdym baby her? She’s been consistently nerfed since they introduced her. (Which is fair since she was laughably op). \n\nI can’t remember any substantive buffs (that weren’t to tweak previous nerfs or changes). I mean I’m more of an Ana main anyway so idk",
            "Fr wish the devs would see the game would be better that way 🙏",
            "Nah, Hog's been a pain in the ass to kill for a while now. The health nerfs are justified.",
            "Nah he should be able to one shot but not be able to get away with it with bad positioning. This way its fair to play against him, because you can poke him out and force him to play his corners",
            "yeah let’s just make hog shit again",
            "Plus, it still has the immortality effect right? I would assume that you just can't cleanse it but you can preemptively use it to prevent the knockdown in the first place.",
            "Meh, I'm doing really well with him right now. He's easily a top 3 tank if you know what you're doing.",
            "Exactly, this is the obvious answer",
            "Her pylon health made sticking with the team a bad idea because you'd have to put your pylon somewhere that it would be in LOS of randos, which most of the time means it's pretty easy to find and break. Hopefully the pylon health buff will help enough.",
            "Yeah, agree with the change or not, it was to shift her power not take it up or down overall",
            "Tracer in particular is egregious because of how common she is, but that would totally be a fair change. \n\n\nThe DPS passive feels like it should help execute people but it just feels like a mini anti",
            "wym? u play illari on certain maps and that pylon isnt going anywhere",
            "I was confused too, they're talking about the [community crafted mode](https://news.blizzard.com/en-us/overwatch/24104274/getting-creative-with-the-community-crafted-mode)",
            "mercy is so shit i don’t know why people insist on picking her",
            "Honestly she's due for a more in depth rework to widen her skill floor/ceiling spread. Likely that she has a very high winrate at low ranks since she's piss easy to pick up and get value out of vs any other support. I personally feel that she's not super fun to play as or play against compared to others, and all of that to me sounds like an overhaul would be best",
            "The thing is that its a niche gimmicky ability that works against like 6-7 heroes from the entire roster. Thats not serious",
            "oops deleted my post...anyway we all wanted the mag changes, the rest? no. And its even more insulting and baffling as Blizzard didnt even mention it, not even a little. Down the the smallest detail for everyone else they'll write it up!\n\nbut for cassidy? nah, just nerf him. Give no reasons why :P",
            "I'm a Cass main and I think I've rolled to survive bomb like 2 times ever, usually you just roll to cover.\n\nStill kind of a weird nerf that probably just removes some skill expression.",
            "Bro is easily the worst DPS in the game and it’s not really close",
            "its not like overwatch 1 in a way its too short and doesnt even have much of any effects",
            "It's in the community crafted mod. She files your taxes, but only 1040-EZ.",
            "Awesome thank you! My brain is fried and I just did not get it. Lol.",
            "Well I guess it depends on how many Reins start popping up but previously it was a get out of shatter free card. Thats kind of a big deal shatter is one of the most game swinging ults imo. You'll have to actually be a decent Kiri player with a good reaction time to stop it now.",
            "the suzu change is pretty big man. \n\ncleansing a shatter, ana sleep, and maybe mei blizz too are all pretty big",
            "When all the best balance changes they’ve made are just reversing stupid ass decisions they made for 2…yeah…pretty much.",
            "He dominates every high level game. Too much chain stun. I dunno. Something with those.",
            "Doom is broken op",
            "She loses 30 dmg on her beam which is big but considering how insanely easy it is to charge even outside of her ult it doesn't matter too much, especially since they buffed her dmg by 2 on her primary fire. She shoots fast af so the 2 adds up super quick. And the beam now pierces all the time.",
            "I don’t know what he’s even talking about. The stun was the flash bang. Changing it to hinder is a massive change.",
            "I think the ult will be interesting, because he can possibly catch up to people trying to run from his ult. \n\nI think they do need to fix him, because he's still top tier with sojourn, but at the same time inconsistent or awkward in ways.",
            "That's exactly what I mean. There is no possible universe where a hero that ignores 2/3rds of the roster by eixsting should be good, no matter hard meta like now. Microsoft has made a ton of big layoffs as of late, yet the wastes of oxygen known as Keller and Dawson remain, white talented people get freed up for competitors. Shareholders should have both Specner and Keller/Dawson heads at this point.",
            "Yes for the normal invul duration but they will still be on the ground during and after that.",
            "Yes, but the duration of the invuln is lower than the time they're shattered. You basically have to land the invuln part right before they're shattered now to prevent them from ever falling to the ground to fully counter it.",
            "Bruh he was agreeing with you, he was directing it at the devs not you. Reading comprehension brother",
            "Teehehe aw man they're not replying to you.... They are doing the quirky reddit thing where they're not replying, they're just taking the topic you talked about and making their own comment.",
            "What do you mean? Isn't hinder a CC?????",
            "Magnetic grenade was bad, but still better than old flash, 5v5 old flash would be actual cancer.\n\nHope this change is good for everyone though",
            "They hinder now? They hinder now.",
            "They call it 360 because the double barrier makes you want to do a 360 and walk away",
            "it’s “that’s a bee in your bonnet”",
            "maybe that's it, either way it sucks lol",
            "Maybe he wanted to pee in your bonnet.",
            "what was that one?",
            "It's 50% slow up from 30%, and now they can't fucking crouch! 😂\n\nFinally *might* land some more shots on the skinny legends",
            "There is a good chance the charge rate will be reverted(because people seem to already be up in arms about it) but I’m guessing the HP will stick around.",
            "I dunno that little bit of extra health will give her a little bit longer to put down her tele and escape. Though I don't really know. Still rather new.",
            "I'm mainly thinking about the 25% increase in photon projector charge speed. A fully charged photon projector is one of the more powerful weapons in the game, and good Sym players will now be acquiring that 25% faster. I'm excited to try it out.",
            "She has one of the thinnest hit boxes in the game to compensate",
            "So... like any other hero, then.",
            "Yeah that's fair, my dumb ass always got hit by the rein shatter anyways on Kiri so looks like my gameplay remains unchanged",
            "Hard countering certain characters is a big part of why she's been so strong imo. Very few bad matchups and lots of matchups where she is strong. \n\nI'm a fan of removing hard counters personally. It's also why I'd like LW not to be able to negate Zarya's grav with either cd ability (and arguably any of three). Lifeweaver isn't in a good spot, but I would want his buffs to come with the removal of that ridiculous level of counterplay against one specific hero.",
            "Honestly it might still just be a minor nerf, as you still have invincibility while knocked. Like a 3 second shatter gets turned to 2 seconds, unless its a 4-5 man shatter without a lucio they’ll survive. Especially if rein gets booped or stunned by anything else",
            "Thats because you are not close enough, same as Ana, you must be up whoever you are healing ass, or you are olaying both of these wrong 😏",
            "This is not the actual problem. The problem is that if you do damage, when you switch back to heal you have your charge it for quite a while + there’s also some travel time involved",
            "The thing is that it was initially (and still is) programmed as if its Mercy's pistol. You're switching weapons and not just playing a cute meaningless animation. They have to basically go in and change some core pieces of code that were probably built into early drafts of his kit. \n\nIt's not remotely impossible, but it's not \"just click a button and boom! done.\" And when you have a 100 part to-do list every patch, some annoying stuff like this tends to get pushed back.",
            "All he needs to do is turn his hand over how hard can it be",
            "Still better than ow1 at times.\n\nI do wish they would have bug and quality of life patches every 1/4 season, with Stat changes on each new season and mid-season, still keeps those dates important while allowing maintenence to be frequent.\n\nWould also let them put their future plans in a more accessible and frequently updated location",
            "Getting those 2+ carnage swings is a different level of satisfaction",
            "Damage nerf but primary fire is faster and her ult charges rails much faster",
            "Yep. I think she only does 150 to the head now at full charge, same as an Ashe headshot",
            "How to get her achievements now?\n\nAren't they now pretty much impossible?",
            "Ohhh thank you that makes sense",
            "I partially agree. I've been memetricking reaper this season and his teleport is an extremely vaulable and underrated part of his kit, but It fs needs a lil love/ quality of life.\n\nAnother issue has to do with either Reaper's cooldown dependency, cooldown cycling, or his range. It feels like he has these long pauses of limited value because of his limited range and long slow cooldowns in comparison to other heroes. On one hand, this should be the case, because of how deadly and consistent he is up close; on the other hand, he just feels \"movement-crept\" by all the reworked and new heroes and sometimes struggles to close the gap in the faster pace of OW2. \n\nI think the health and armor changes really highlighted this issue because he no longer gets the same value from tank busting (overall good change imo). However, he needs compensation for that loss.",
            "I mean I feel like she’s been the stealth tank as of late. There’s always been other tanks that were either so much worse (rein, ball) or so broken (pre nerf Mauga, pre nerf orisa) that D.Va just flew under the radar. I can’t think of a season where she’s been oppressively broken, or laughably weak",
            "Shhhh, don't draw attention to us!  We're enjoying it.  Signed, [D.Va](http://D.Va) players.",
            "winston is fine, a lot of people just never switch to counter him",
            "Winston has some pretty strict hard counters, more so than any other tank. Outplay is still possible, but much more razor thin than some other bad tank match-ups.",
            "I don’t think he’s that strong at the minute though to be honest. I’m pretty neutral about him overall.",
            "Her kit has been ridiculously overloaded to the point that she does what Ana and Zen do together but also better and can teleport through walls and climb walls. Even when her auto aim heals were low which might've been considered a trade off they buffed it. I almost never see a game without her in it. Her last \"nerf\" was adding more heal with less invulnerable time which in terms of actually playing was a net buff. Even just this last week I've seen a hog go from 100-full after Suzu bailed him out cause you can't interact with invulnerable targets but you can still heal them for some reason. She literally has no weaknesses and makes the game so dull to play. She's just poorly designed and to make her fair she needs more obvious weaknesses cause she's not hard to play and provides so much value. Every pro and top player I've seen hate her and don't even like playing her but every game it's like mandatory. I'm so over 2 years of kiriko at this point so yeah they baby her.",
            "Who do you put above him besides W.va?",
            "Because easy hero + fun movement + getting carried.\n\nIts so bad trying to play tank or support with mercy. Most mercy players don't really give a shit about what the team needs, and it's not like they know how to play any other heroes.",
            "In low elo I'd argue mercy still has solid value. Even though she's played as a healbot sometimes that has more value than utility in silver/gold. Plus we can't aim well enough to kill her during rez's anyways so the 6v5 fights are annoying",
            "I can't say you're wrong here, flatly more ammo would be stronger overall. \n\n\nThough it is a fun interaction imo and I found myself liking when they had it vs when they removed it. \n\nThe shield vamp isn't that good though, but mostly inoffensive now her heath is back.",
            "It's def cause he was too good at dueling tanks close range. It's why they nerfed fan the hammer and roll. Tank queue is a major issue so they are trying to remove anything that annoys them/is to strong against him.\n\nHe was def on the stronger end last season, but the amount of nerfs seems unnecessary nade change and maybe one nerf would be fine",
            "idk i consistently top frag as Hanzo. i sincerely think it’s a skill issue",
            "I don't think this change effects mei blizzard. It's specifically stuns that hard knockdown like rein ult or when charges collide.\n\nIt's basically a rein buff in disguise.",
            "Pretty sure Ana sleep counts as soft stun considering it (technically) breaks on damage. Mei ult, okay. So her suzu is less effective against... Three ults.\n\nEdit: \n>  Developer Comments: \"Hard knockdown stuns\" refer to most all of the existing knockdowns where the player is stunned and laying on the ground (such as Reinhardt's Earthshatter), with the exception of Ana's Sleep Dart effect, which is removed upon taking damage or Protection Suzu's cleanse.\n\nYup, I was right. And also seems like Mei's ult and Brig's bash don't even count as hard stuns either. So... One hero.",
            "Ana's sleep is explicitly listed as still being cleansed. \nCause Kiriko has to stay a hard Ana counter for some reason. I swear the only matchup in this game that feels worse is ball vs Sombra.",
            "There’s no world in which this means that it doesn’t cleanse mei ult. It’s not a stun. \n\nIt might not cleanse the stun, but they still get a small window of invuln during the stun.",
            "Of those, only shatter is affected. It says \"Hard Knockdown Stuns,\" which are things that knock the character onto the ground. The patch notes specifically exclude Ana. The other abilities affected by the change are Mauga stomp and Sigma rock.",
            "The change doesn't affect Sleep or Blizzard. This is more of a Rein buff than a Kiri nerf.",
            "No, it’s only if you get knocked down. \n\n\n\n\nSo Rein Shatter, Sigma Rock, Mauga Stomp, or when Brig and Rein clash and get knocked down",
            "The only one that isn’t cleansable in your list now is shatter.",
            "Doom players are so delusional. They act like he’s the worst character in the game.",
            "Pretty sure it was an attack speed buff, not a dmg buff",
            "Oh okay. I see tons of people claim pharah is bad so I wasn’t sure what side you were on haha",
            "He’s hardstuck silver in reading comprehension",
            "Hard CC I mean",
            "It's just mag nade but predictable!",
            "It’s an older meme, but it checks out.",
            "I will never get tired of this joke",
            "But a 360 would put you back in the same direction, so back into the game….. oh wait we are Overwatch players it’s an addiction, I get it now",
            "When he nades junk he says \"I heard you like bombs\"",
            "Oh yeah for sure, but now at least she’s on par with the other dps and not borderline useless anymore",
            "Its not that powerful. Soldier does slightly less bodyshot dmg, but he is a hitscan with a much bigger effective range.",
            "As a sym main me too. Now I can actually use beam",
            "Ngl idk where you got that from cause her head hitbox is HUGE also the way she stands makes it easier to hit shots😭",
            "You under estimate how shit I am at Sym.",
            "What do you think about all the things that Ana counters with sleep dart and anti-heal? I've often seen comments similar to yours and I don't think I've ever seen anyone mention her in their comments of removing those hard counters.\n\nJust curious.",
            "It's a problem, but I feel like changing it too much alters his identity.  The whole point of his kit being the way it is is that he can't weave like so many other supports can.",
            "That's exactly what they did for the community game mode though so it can't be that hard. He feels so much better to play just because of that one change.",
            "It's too bad they're a small indie company who can't afford resources like that",
            "Her primary fire is still flat out worse than Soldier currently. Also the rail base damage got nerfed from 30 to only 1 so she has to charge longer just to get similar damage as a partial charge before. Even at full charge, it does less damage than Solider helix rockets unless you land a full charge headshot. \n\nThe rail damage also means she can’t one shot Tracer anymore and has a harder time challenging Widow now.You basically have to be constantly getting full charge and landing headshots now otherwise better off picking Soldier 76.",
            "Lol I'm not hating! Even if she shuts down my favorite hero (Ana) pretty well. I'd rather Dva be good than, say, Hog or Mauga because her kit is definitely skill intensive and I think she has a really sweet balance between a Tank tank and a DPS tank, if you will.",
            "as a tank and Winston main, he is by far the number one fastest for enemy team to swap counter besides maybe mauga",
            "He's not. The horse is king. \n\n\nDva eats mauga and a good Zarya also deletes Mauga. \n\n\nI think mauga is pretty solid. Compared to him at release. He was a true god then.",
            "Yeah hes annoying but thats irrelevant to his strength. Hes just annoying to go against regardless lol",
            "Ah so you don’t like playing against her and that’s why she’s bad, I half joke. I mean you have some valid points and then just start grinding an axe because you personally don’t like Kiri. Also her pick rate is not much different than the other on main healers I thought. Hog going full health is his ability, Suzu just gives it time to proc uncontested. Is that good? Idk, I don’t like it, but again, Ana. Oh yeah speaking of, if we’re complaining based on rate ._. Oops \n\nI don’t think they baby her more than the other picky mains (eg mercy). I think she’s like every other hero blizz doesn’t know what to do with. Her kit is set, and she’d need major reworks to placate desires like yours I think. Just tweaking her current kit will never “fix” what I think people find wrong with her. And blizz is super great and quick about reworks, as we know!\n\nEdit: it’s like trying to fix widows one-shots. If you get rid of them without doing anything else, she’s entirely utterly useless. There’d be almost no reason to pick over ash other than the scope. I guess what I’m saying is I’d rather they fix her than keep doing -what I find to be- pointless bandaid updates. Like in all honesty, other than a minor rein buff I don’t see this nerf affecting Suzu in any meaningful way. Maybe that’s your point? In which case, kinda sure",
            "Its not really an above thing. Its more there are just top 3 tanks that are the best depending on the situation. Mauga, Ball, Sigma I think.",
            "it gets on my nerves because moira is right there, literally just a better mercy",
            "yeah she’s good in low elo currently mid diamond and almost every game where we have a mercy and the other team has bap + moira/kiri/basically any support other than LW and mercy lol they win, it’s quite annoying if you wanna heal bot in mid-high ranks pick moira",
            "at what elo? because my boy hanzo got cucked to the ground he's situational now and i used to be a hanzo otp lol. I might just not be good enough anymore",
            "He's a decent pepperer, but cass and sojourn fill his niche in most comps outside of poke.",
            "sig rock and any counterpin too",
            "I’m not a fan of a regular ability countering ultimates so easily anyway. And it is very easy to avoid shatter and Suzu your team. Compare that to sleeping a genji blade, for example.",
            "even tho it’s a nerf it’s really good for balance I think\n\nKiriko is such a everything character and excels in everything too much, usual jack of all trades are like S76 where they can do everything but not as effectively as specialists like Sojourn Ashe or Cass\n\nofc I’m hardstuck plat support and tank tho",
            "I think there was a time when he was maybe the worst tank, but we are definitely not in that time anymore haha",
            "Oh, ok!",
            "Rein mains like myself are gonna have to relearn how to shield flick the flash overhead to protect our team and our movement",
            "Its a meme",
            "Old school Xbox joke ",
            "ah, well that one still works with the flashbang so hopefully they keep it",
            "Against tanks Sym may become more valuable",
            "Bro what, it’s so narrow",
            "Sleep dart counters anything that any other CC counters. LW is basically the only character that can hard counter grav in the way he does. Mei can sometimes work, but it's a lot less effective.",
            "Nothing stops them to put limitations on that. Like, right now it takes 2 sec of shooting before your ammo is recharged. They could tie something around it. This should remove the clunkiness while disallowing constant back and forth switching",
            "It is an improvement, sure. But honestly, I don’t feel that it helps much in this case cause the actual animation time is not that big of a problem",
            "I mean, I would hazard a guess that’s what they wanted which means most good Sojs don’t really find the change too wildly different. Most of my sojourn lover T500 friends seems to like the rework. Gives her main more oomph while still providing more than enough burst (and faster too) \n\nIt’s a reshuffling of power and she’s still a more versatile pick. And I’d hazard most good Sojs can still run solider when the need requires. \n\nProjectile-Hitscan Alt vs Hitscan-Projectile Alt.",
            "I call it a \"Win\" when I see the Mauga/Reaper/Bastion triple switch after the first point. Then I usually offer a bet with my healers that I can make Zarya work.",
            "widow is oppressive in the right hands and maps and boring but she has very obvious strengths and weaknesses at the very least (still problematic in 5v5 though). kiriko is like lifeweaver in that it takes away player choice in the game and games are about the illusion of choice. kiriko also works in literally every team comp. kiriko and lifeweaver have choices they can make that limit the choices other players can make in terms of counterplay. before positioning used to matter more, someone making the mistake of stepping out of position could be punished for it but with a kiriko on the team she could instantly tp through a wall to save someone with a suzu so now you're on a hero that had to make a choice to take a risky play to get someone who was out of position but she sees that and it's a 2v1 now. you took a risk and kiri didn't take one at all and her whole kit is like 3 get out of jail free cards with short cd's. or you dive a kiriko out of position but she just tp's to safety and even with highly mobile heroes she's hard to chase down cause her tp is always to a teammate so she's never alone. suzu is easy to use and provides so much value that it's only used to deny and it's on a short cooldown it's arguably the strongest ability in the game next to lamp. it immediately counters almost everything so you essentially need to create two openings just to be able to actually push. in the hands of someone playing kiri they probably think it's fine because they have choice and options but on the other side what is the actual counterplay to her kit? how do I as a player outplay someone playing her? i think those are the questions I want players to ask most. \n\nfor instance, lets look at Ana who is the best support ever created. she's fun to play, high skill expression, multidimensional choice. Ana you could position aggressively to make offensive plays with antinade and sleep. you put yourself at risk but could make a play to push and win. you could play defensively and toss abilities when needed or when you see someone out of position. you could hold them in case there are flankers. and on the opposite side I could choose to try and duel ana with her abilities and take a risk myself or I could wait till she uses them offensively to create an opening. there are options for her and for me playing against her but also room for error on both sides. there are also ways people have gotten super creative with her kit like throwing nades straight up as they fall 6 seconds later in perfect spots over things. that is an amazingly well designed ability because those creative things are skill expression by players. those options don't exist with kiriko. her heals auto aim so there's no room for error. suzu is 99% defensive denial and it's just tossed at the ground. her kunai are essentially just spam. and her tp is powerful but also limited. her kit is just bad in comparison to someone like ana. the only way to make her kit work is to keep the value at these abilities high because there is little to no skill expression in her kit in comparison to someone like ana. if a person dies to ana they usually feel like they deserved it, I know I do so it doesn't feel unfair even if I saw her every game. if someone dies to kiriko it's just frustrating because she never had the same risks you did and that is why it's not that I just don't like her, it's that she's not a healthy addition to the game.",
            "i’m not master like you, only Diamond so I guess ymmv",
            "I have zero issues with the changes, they are totally fair. Just find it wild to call it a 'hard' nerf, lmao",
            "It doesn't disable the barrier at least, and the damage is quite low so I can't see it doing much for Cass there apart from slowing your critical hp retreating\n\nI like to see the shield flick return tho that's fun",
            "Kinda not really though. The only way to shut down someone for that long would be with something like a Grav, a Shatter or even the knockback from Whole Hog.\n\nIf you punch, hook or javelin let's say a Genji using ult, it doesn't waste his entire ult like if you slept him.",
            "I agree, but that's not the usual feedback people have about him.  Basically since day one people have been begging to remove the weapon switch mechanic and just have left click heal and right click attack, but like... you can literally play any other support if you want to quickly change between healing and damage.",
            "I don’t know why people are downvoting you, because in lower elo, I WILL top frag as Hanzo, but then again low elo players have bad positioning and awareness\n\nAlthough full disclosure I was tempted to downvote you because of your pfp had me wiping my phone like a loon 😂\n\nEdit: take an upvote to even it out,\nAlso in matches where there are equal mechanics, he does get outperformed by a lot of other heroes now"
        ]
    },
    "Best posing coincidence in arcade mode": {
        "title": "Best posing coincidence in arcade mode",
        "score": 1585,
        "url": "https://i.redd.it/s3u8rccz508d1.jpeg",
        "content": "especially with me in the middle with potg lol",
        "num_comments": 33,
        "comments": [
            "Daaamn this is FIRE. 🔥🔥🔥",
            "When's the album drop",
            "[deleted]",
            "BRO COOKED AND EVERYBODY WAS HUNGRY 🗣️🗣️🗣️🔥🔥",
            "*Fire emoji*",
            "You can probably get some Michelin stars from this",
            "When ur the main character",
            "Y'all putting Gordon Ramsay to shame cuz y'all cooking a 5 star meal over here.",
            "That’s sick",
            "Nobody felt like eating but bro cooked anyways 🗣📣🔥🔥",
            "Boutta call this band NecroMercy cause shits dying and coming back to life\n\nBut yeah this shit should not have been this fire, tf",
            "this pic goes crazy hard",
            "Imagine they were all sentai skins",
            "Welcome to r/Overwatch!  Please use the following resources via the links below to find relevant information about the game and the subreddit.\n\n[Overwatch Patch Notes](https://overwatch.blizzard.com/en-us/news/patch-notes/) | [Overwatch Bug Report Forums](https://us.forums.blizzard.com/en/overwatch/c/bug-report/9)\n\n[r/Overwatch Rules](https://www.reddit.com/r/overwatch/wiki/rules) | [r/Overwatch FAQs](https://www.reddit.com/r/overwatch/wiki/faq) | [r/Overwatch Common Bugs and Posts](https://www.reddit.com/r/Overwatch/wiki/commonbugsandposts)\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Overwatch) if you have any questions or concerns.*",
            "Oh! I played with that Steven person often in Arcade",
            "Wait who's the hero on the left supposed to be?",
            "Rigged and paid actors.",
            "Does the Mercy pose adjust depend on which side she gets placed in the victory screen??",
            "https://youtu.be/L53gjP-TtGE",
            "November 13th",
            "Exactly",
            "^[Sokka-Haiku](https://www.reddit.com/r/SokkaHaikuBot/comments/15kyv9r/what_is_a_sokka_haiku/) ^by ^rightsideshooter:\n\n*You should edit this*\n\n*And make it a wallpaper*\n\n*Or something it's so good*\n\n---\n^Remember ^that ^one ^time ^Sokka ^accidentally ^used ^an ^extra ^syllable ^in ^that ^Haiku ^Battle ^in ^Ba ^Sing ^Se? ^That ^was ^a ^Sokka ^Haiku ^and ^you ^just ^made ^one.",
            "Lifeguard skin ruins it for me.",
            "All three Reapers and 2 mercy's in between lol. That's the Masquerade skin of Reaper that apparently does not show the hat in that victory pose.",
            "I forgot to look for the gummy bear album on November 13th",
            "Good bot",
            "Good bot",
            "Don't listen to the haters bot, your a good bot. Here, have a cookie. But only a byte",
            "[deleted]",
            "Bad bot",
            "[deleted]",
            "Ah that explains why I didn't recognise that Reaper\n\nHaven't seen the skin before\n\nTho tbf, they're also posing in the same way",
            "He he’s a great bot",
            "Lol it's more of the context that it looks halloween because of the mask Reaper is wearing (or Genji? I can't tell who it is,  sorry) and Witch Mercy yet a random swimming theme put inside in between grave yard stones.",
            "Good human",
            "Yay"
        ]
    },
    "Can we all agree Mythic Weapons cost too much?": {
        "title": "Can we all agree Mythic Weapons cost too much?",
        "score": 291,
        "url": "https://www.reddit.com/r/Overwatch/comments/1dll3la/can_we_all_agree_mythic_weapons_cost_too_much/",
        "content": "I know they aren’t even out yet, but Reinhardt’s hammer will cost 50 prims just to unlock, and then has additional tiers, so it’ll probably be 80 Prisms anyway.\n\nEither Blizzard decreases the unlocking price to 30, or increase the Prisms in the BP to 100, because having two Mythics where you can only even unlock one, without getting anywhere near maxing out, seems excessively greedy even by their standards.\n\nIt’s just one weapon that probably isn’t even customisable, you just have to unlock extra tiers for a ‘flourish’. Not a weapon-inspect, the thing from the Season 1 trailer BTW, just a ‘flourish’.\n\nWith it being just a hammer, Reinhardt’s shield and charge are probably the same as normal, since Firestrikes and Earthshatter come from the hammer.",
        "num_comments": 112,
        "comments": [
            "Honestly I think the changes to Mythic skins are just to ensure people buy the Battle Pass even when they're shit. The content in this BP is really weak imo, but I'll get it for the prisms.",
            "EVERYTHING costs too much in this game tbh",
            "Stop giving them money to begin with",
            "Total all is 60 prism but yeah it's cost too much for a weapon only",
            "I got one word for you brother.\n\nMoney\n\nAnd since the gaming community doesn't see cosmetic microtransactions as a bad thing, this monetisation method will only ever get worse. Y'all need to stop giving them money at the VERY least if you expect change",
            "it's 10 bucks to get the premium BP.  Just do your weeklies and your dailies when you can and you should get all of the stuff you need in a season.  It's not likely that you'll like all of the Mythics that they release, so you'll have a chance to stock up points towards things you want.  And if you play enough and finish the BP, you are getting the next BP at a discount because you earn the coins you can spend on the BP while playing the game and progressing through the BP.  Plus, the Progession Weekly Challege nets you coins as well (though that one will get harder and harder to earn the more you play the game.",
            "Blizzard gave more mythics, without taking anything back = players mad.\n\nIt's as clear as day that the new mythic weapons are for people who aren't reluctant to buy mythic prisms + good alternative to people who don't main a character with season mythic skin. Really doubt they're going to lower the price",
            "it took 1 season for them to ruin this. we should've known the mythic shop was just another attempt to take money.",
            "Apex legends have mythic weapons that cost $300. People still spend the money for them.\n\nOW2 is pretty “fair” in that you at least get the option to choose what you want to unlock.",
            "Yeah I think it’s a bit absurd. \n\nWhen the mythic shop came out and we all saw how expensive mythic skins would cost it wasn’t too terrible because it kind of just reinforced that the BP is a pretty good deal. \n\nBut now you can’t get every mythic cosmetic just by keeping up with the BP. Even if you’ve bought every BP to date, if you want all the mythic items you’re going to have to actually spend that exorbitant amount that previously didn’t apply to you.",
            "I don't think there's even a single fairly priced item in the game.",
            "Whatever makes blizzard the most money I don't care what you people pay for pixels the game is free. Make them $10k if that's profitable and keeps the game going. ",
            "Cosmetics don't affect gameplay so I really don't mind how much they cost. They can sell it at $200 for all they want, I have no problems with it.\n\nIt's just another way for Blizzard to generate revenue and support the game. Cheaper skins already exist (Battle Pass, Shop skins) but there's nothing in the super-expensive range yet.\n\nSo I disagree with you.",
            "Welcome to r/Overwatch!  Please use the following resources via the links below to find relevant information about the game and the subreddit.\n\n[Overwatch Patch Notes](https://overwatch.blizzard.com/en-us/news/patch-notes/) | [Overwatch Bug Report Forums](https://us.forums.blizzard.com/en/overwatch/c/bug-report/9)\n\n[r/Overwatch Rules](https://www.reddit.com/r/overwatch/wiki/rules) | [r/Overwatch FAQs](https://www.reddit.com/r/overwatch/wiki/faq) | [r/Overwatch Common Bugs and Posts](https://www.reddit.com/r/Overwatch/wiki/commonbugsandposts)\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Overwatch) if you have any questions or concerns.*",
            "Honestly the prisms are just meh in my opinion, just another currency and really wished we got more prisms in the Battle Pass in some form. Even having more be apart of the bonus tiers wouldn't be a bad thing. \n\nDoesn't surprise me that the Reinhardt's hammer is going to cost a good amount of prisms. Really the prisms just here it seems to give us an out if we have another mythic like Orisa, which I hope we don't.",
            "You can BUY prisms now so I guess this is how they gonna make money now… very worthy considering they keep banning accounts all the time so you can buy multiple times the skins.",
            "Mythic Skins in general are pretty overly priced. They want to ensure you play and level the BP cuz I’m sorry but who is willing to fork over 30+ bucks for one base tier skin",
            "I think 40 would be enough. Skin 80 and weapon 40. So you can decide. But make the basic skin 40 too. 50 to enter the skin is just a bad joke and you will never get all the skins w/out buying additional prisms",
            "they take way too long to get as well:(",
            "Everything about this game and modern gaming in general is too greedy. Making this game f2p to justify adding a lot of shitty micro transactions is what ultimately ruined this game as well as 5v5. The people who try to defend it by saying \"the game is free so they can add as many micro transactions as they want\" or \"don't like it then don't buy it\" are the reason why micro transactions keep getting worse and worse each year and why modern gaming will never be as good as it was before the mid 2010s.",
            "I'm not a big fan of the Ashe Skin but I really like the base skin for only 50 prisms. I took it for granted that the Rein Mythic would cost 30 Prisms, yet it doesn't. \n\nWhy would a weapon cost exactly the same as a full skin? This is soo shitty, but I will likely buy it anyways and just miss out on the ashe skin. Of course the Mythic shop didn't came out because of generosity, they want people to pay even more for their already awful monetization system. \n\nAnd with Games like League of Legends which sold 200$ and now even 500$ Skins, we will likely see more of these cash grabs in the future. \n\nI truly hope for a wonder, but it's unlikely they change it.",
            "i love the idea of more types of mythic cosmetics in the mythic shop and hope they will keep developing it. of course, the prices should get adjusted.",
            "It is a shit battle pass, but pink ball is amazing",
            "lmao, i judge everyone with mythic skins.\n\nThey're too interested in how they look, and have no moral backbone.",
            "If you think that's bad, check Valorant and League of Legend skin costs.",
            "Classic Activision. Holding their studios at gunpoint to make an extra buck or two.",
            "Think the cost is fine tbh",
            "Everyone is so whiny on here. Pricing is whatever. Its a free game, let them price the random crap at whatever they want. If you really want it to be lower, don't buy it.\n\nMaking a game free is expensive they should be able to make money somehow off the people that are willing to pay big money for cool stuff.",
            "Just buy Helldivers 2 (yes, the entire game) for the same price the hammer costs based on prism shop values. Developers keep being greedy asses because the player-base gobbles anything they put out for sale.",
            "You can literally get mythic skins without spending a single cent now.. idk what more they could do. The least they'd want to do is make it slow for f2p and faster for people spending money.. and thats why the price. Not very hard to understand.",
            "They're *supposed* to be over-priced. **You're meant to get the battlepass**. You aren't meant to be buying the damn prisms!! How do you still not get this? They're meant to be the biggest drawcard of the battlepass, which is what keeps the game alive with constant new content (and FREE). \n\nThey aren't *meant* to be priced at a level anyone would reasonably buy. *No shit* they're expensive. That is literally the point: buy the battlepass, for the low low cost of *checks notes* **ten dollars*****,*** or free via coins if you're a regular.\n\nWould you prefer if the prisms simply weren't available to buy *at all*? If so - what difference would that make to anything? You still wouldn't be buying them. \n\nHow exactly are you so mad about it?",
            "Cost too much for who? You? Get your money up then.",
            "Need to see the animations and stuff before I say it's too much.",
            "No because they're optional\n\n\nThey can't cost too much if you don't have to buy them. Complaining about it is punished by death.",
            "I don’t know why anyone would pay $80 for a skin. It’s literally just better to pay $10 and get the prisms instead of paying $80. Even if you don’t get enough, waiting until the skins come back in later seasons is still way better than paying $80",
            "I’ll do it for the Prisms and Mauga skin TBH, but I’m not buying it until I see exactly what the Reinhardt hammer looks like in-game. How bad the customisation is, try it out in the Practice Range, etc.\n\nI’ll probably still buy it for the Mauga skin and Reinhardt VL though.",
            "They only do that because people keep buying them even when they're shit. Don't buy this season if you ever want this shit to to.",
            "Unfortunately I won’t.   This pass is absolute dogshit.  I won’t reward this greedy ass corporation for laziness.",
            "I'm still salty over weapon charms costing $10 alone 😭",
            "I'm happy with $5 battlepass. If you can't afford event hat much, you should get a job.",
            "I've only given them $5 and I felt gross for it. ",
            "There are $20 skins. It used to be a $20 game.",
            "Not giving money doesn't mean we'll get better monetization, it just means the game will get shut down forever.\n\nSince I love the game and don't want it to die, I will continue to make purchases that I can afford.",
            "Nah, I like the skins, and battlepass is well worth a cheap $10, even if it's not chock full of my favorite skins. I'll get the battle pass every single season, as there's no reason for me not to, as someone who enjoys in-game skins",
            "60 Prisms? Where’d you find that?\n\nBut yeah, I’d expect it’d to be something like 30 unlock, 10 to upgrade, 10 to upgrade again or something. But 50 just to get?!",
            "You can't get 2 mythical in a BP",
            "Was there ever any doubt?",
            "Nothing ruined yet though\n\nTechnically, having the option to choose is an improvement over last season, e.g.\n\nBy getting the BP, you obtain a Mythic for sure, as you did before. Now you can choose between Mythics across seasons and a weapon skin so far. \n\nSo where is the 'ruining' part? In your sense of entitlement?",
            "How did they ruin it? They are not forcing you to get anything",
            "I did know this and posted it on Reddit as soon as the currency was added.",
            "Less bad does not equal not bad. Don't give them a free pass just because the other guy is worse.",
            "That Christmas Bastion skin everyone complains about was a nice price",
            "How? A mythic skin costs more than a whole game my guy, in what way is it fine? Because it's optional? Absolutely asinine",
            "Them charging for stuff is fine. As you say it's a free game and they need to make money.\n\n\nThe issue is that it's not free out of the goodness of their hearts. No, it's free because these extremely overpriced cosmetic items generate more money than a full priced game.\n\n\nThey should be charging to make money, but they're charging specifically to maximize the money as much as possible, even beyond reason.",
            "Because you can't get both without spending a very large amount of money to buy prisms. In a single season there will be a mythic skin and a mythic weapon and you can only get one, if you want both you have to spend a ton. Battlepass only gives enough for one.\n\nYou also sound far angrier than anyone here.",
            "The issue isn’t that, the issue is that both the weapon and skin cost 80 prisms for a total of 160. In case you can’t count we only get 80 from the battlepass, so we can’t get both unless we pay an absurd amount",
            "You sound like a miserable person",
            "It's whale bait.\n\nPeople with more money than you or I view money differently. Simply put, \"my time is more valuable than my money\" so they spend rather than wait. \n\nSadly, there is no systematic way to stop poor people from becoming tempted into wasted their money on this kinda luxury too, and corporations don't give a shit about exploiting them.",
            "Omg exactly the same : prisms and Mauga skin. They know what they're doing lmao",
            "Thing is, mythics are one of the few things I’d actually spend money on - and getting the battle pass is the cheapest way of accumulating the currency",
            "$5? Where do I get that at 😭",
            "OR they change monetization for the better if they see not enough people buying stuff. This kind of line of thought is what brought us here in the first place.",
            "Terrible way to look at it and the reason things are so bad.\n\n\nBad behavior is being encouraged abd so it will continue and get worse.\n\n\nYou don't encourage bad behavior, you quell it.",
            "lol you defend blizzard like they paid you",
            "50 for single weapon and 10 for effect and all",
            "I don't get how it's ruined either, I don't play 8/11 characters with a Mythic skin an i'd much rather save prisms or buy a great looking weapon for a Tank I do play instead of having a mythic skin I'll never use. It'll be better for people long term when they can choose not to buy a mythic skin for a hero they don't use and save those prisms for something else.",
            "Because before you were 100% able to get all Mythic skins before by just getting the battle pass. Now you have to dig into the wallet.",
            "In the past seasons, mythic skins cost $10. The only way to get them was BP. When they introduced the mythic shop it was the heavy chuckling in meet the medic gif, cuz now 80 prisms is like 100 bucks so mythic skins shot way up in price. \n\nI don't think it's entitlement to *want* to support the game. I'd happily pay $5, $10 for a legendary skin, maybe $25 max for a mythic skin/weapon. Setting the precedent that you only get one mythic's worth of currency a season (and if you want everything they introduce, cuz remember it's FOMO and gone for a long time once the season is over) makes it easier and easier for them to price gouge and charge even more ridiculous prices.",
            "Stop being stupid\n\n\nNobody is entitled that's complaining about the endless process gouging. Because that's what it is, it's price gouging.\n\n\nYou're actually stupid to be mad at people that are mad at the problem.",
            "Previously if you didn't play the seasonal mythic character, well too bad. Now at least you've got 2 options and you can choose which one you like more. This is a good thing. \n\nMadness that there are people who'd prefer only having one choice and are complaining about this change. Yeah no thanks.",
            "I actually think that the weapons would be \"good\" only for people who have every Mythic either possible or that they personally wanted and runs into a \"bad\" new Mythic that they don't care for. If the weapon is more to their liking, then you can use the Prisms towards that instead. Rather than simply banking Prisms or buying something you'd rather not have, then opting for the weapons instead would just give more options than only past Mythics. Again, for people not in this position, it's definitely not better. But for some...I see it being just something that they could be OK with.",
            "You aren't *supposed* to get both, jesus christ lol.\n\nThey're giving options and you can choose what you want. Some people never play certain roles or heroes. \n\nMore options are good, meanwhile some people just want *everything*, and immediately too. Yeah that's not how it works.",
            "Don't careeeeeeeeeeeeee",
            "But you have an unlimited amount of time to collect prisms. Just by the seasons you like, you'll get them all eventually. \n\nIt makes them more satisfying to get anyways, and are you really a fan of every single mythic? I know I'm not, there are only a few I like.",
            "Each pass gives you at least 500 coins when completed, means the you only need 5 dollars to buy the next one",
            "That sound like what happen with OW1.",
            "What game has that ever worked in?",
            "That's too good to be true. They'd rather scrap the project than making more consumer-friendly decisions.\n\nCompany makes a good game but barely breaks even? Close the studio.\n\nPlayers like the game but it doesn't generate enough revenue? Not profitable, cease development and service.",
            "Of course if you quell it, something else with better monetization will pop up but it will NOT be Overwatch.\n\nAlso you're speaking as if OW2's monetization is bad. It's way better than OW1 where the only option to spend is on Loot Boxes (other than the base game).",
            "Which part of my comment did I defend Blizzard?",
            "You’re joking, right?\n\nJUST THE HAMMER costs like £30 and I don’t get to send people to Hell unless I cough up another £10?",
            "The problem is people are still obsessed with getting everything the microtransaction system is meant for you to pick which things you like not get everything available, as someone who buy the BP every season having options is great incase a skin sucks or I don't like it. Them making more options is always good.",
            "If you aren't supposed to then they shouldn't even offer the option to get both\n\n\nIf they are gonna offer the option, then it should be reasonably priced.\n\n\nWe got neither, it's essentially not an option to get both if you have even an ounce of self respect. Meanwhile, they get undeserved cash flow from the fools that do bite the bait. \n\n\nIt's grimy and a pathetic state this industry is finding itself in.",
            "It’s more having a stockpile of prisms for when they release stuff you want, for example this BP - the two mythics are both good, but you would have to either spend real money or grind multiple passes to pay for it. \n\nYes it’s a bullshit system, and it’s been designed this way on purpose. That being said OW is the main game I play and I want it to be profitable, so I don’t mind spending $15 every 2 months.",
            "I don't know when I'll want them, and there's some past skins I want to (at least one, the Kiriko mythic)",
            "Oh yeah, I forgot that! Unfortunately, I'm not frugal enough to avoid spending those coins on whatever exclusive events drop each season 😭",
            "Then keep doing nothing and give them money, that will surely help more right? Don't come complaining when games will be so filled with micro transactions they become unplayable though",
            "Then let it die. What is happening here is players showing how much they're happy to give them loads of money. Remember when OW1 had just loot boxes and took a shit storm from many players ? Today it's even worse and it seems players are ok with this.",
            "Then let it fucking die. If you want companies to be more consumer friendly it sure won't help keeping the money coming to their pockets. If you as a customer don't like how they operate but still keep giving them money they will keep doing that. If you don't give them money maybe something changes.",
            "The part where you gave them money anyway despite not liking them. That is funding their defense.",
            "*Another way to spend your Mythic prisms, you can unlock the base skin at 50 Mythic Prisms, and then unlock additional levels at 10 Mythic Prisms including a Weapon Flourish emote, elimination visual effects, and reactive effects.*\n \n\n  This is their words",
            "Welcome to 2024 free to play games",
            "No.  The microtransaction system is meant to extract money from you. For 10 seasons they have trained consumers that they get everything Mythic from just the battle pass. Now they pivoted to get more money. ",
            "More options is good. Locking those options behind incredible pay walls is bad.\n\n\nThe microtransaction system is not designed to make you pick and choose. It's designed to make you spend as much as possible. It's cancer, and you are too for even thinking about defending it.",
            "You should consider Microsoft rewards. You get 600 coins from the pass, meaning you only need 400 more for the pass, which comes out at 3600 points. When you get to lvl 2 in Microsoft rewards you can get 200 points a day",
            "I started complaining about micro transactions in 2015. It's been a losing battle. Most kids are happy to pay 20$ for skins. It's normal to them. Every game with micros has whales. They only need a few 1000 people willing to pay for everything in the game every second there's something they don't have and the game can stay with it's current model.",
            "It's better now because it's free-to-win and no more loot boxes.",
            "I'm fine with Overwatch 2 is currently operated, hence why I'm spending on it. I love the game and would like to see it stay for at least a couple more years.",
            "I take their words to mean there are multiple levels like the skins. That's why they use levels instead of level. It's gonna be 80 prisms.",
            "So  80 prisms. This says there’s 3 extra levels for 10 prisms each.",
            "Its a fkin skin you dont need it to play the fkin game.",
            "Redditor finds out the reason companies make products",
            "How long to reach lvl 2?",
            "I don't really think they're cost total 80 prisms and I hope they don't",
            "Ohhh..that totally suck too much for a weapon...",
            "Oh I agree with you 100% just saying the monetization is how it is now",
            "Why are people so stupid around here? They aren't just making a product to get money here. That's where it should end, but it doesn't.\n\n\nThe problem is they're trying to make as little product as possible for as much money as possible, and they try to widen the gap as often as possible.\n\n\nYou're an idiot if you think there isn't a problem.",
            "Im old enough to remember horse armor being controversial.  ",
            "I did it last year so I don't remember for sure, but I think it was only a few days if you do all the \"missions\" each day. It takes like 5-10 mins max per day. It's basically just use Bing Search in a PC browser *and* on your phone X amount of times, take a couple of short quizzes and learn about some piece of history for the day (which is basically just open the web page and then close it again), that kind of stuff.",
            "You need a set amount of points the month before, I don’t remember how many but it should  tell you",
            "I just started doing it i got level 2 2 days in its easy af.",
            "It's obvious that it's going to. That's the point - to give you a choice of which mythic skin to get \"for free\" from the BP. That's why the wording in all the marketing is to get the Ashe skin OR Reinhardt."
        ]
    },
    "Funniest way someone said they carried you have ever witnessed ?": {
        "title": "Funniest way someone said they carried you have ever witnessed ?",
        "score": 564,
        "url": "https://www.reddit.com/gallery/1dlgj7d",
        "content": "",
        "num_comments": 55,
        "comments": [
            "Thank for the Winton",
            "I had someone say that they're going to be built like Reinhard after the match.",
            "Not quite a carry quote. Our Kiriko fat-fingered the only ult she’d used the entire flash-point game in spawn and apologized. Our Moira, who had 14k healing & 30 elims said “it’s okay. That fat-fingered ult was the most useful you’ve been all game.”",
            "I got did dirty. I played comp and we got stomped, I felt I was pulling more than my weight and passive aggressively typed \"1 vs 5\" when an enemy player was like \"Nah definitely not you\"",
            "Someone on my game said \"yall gotta step it up I feel like a chinese kid working in a factory\"💀",
            "Am I in math class? Why do I keep carrying the four?",
            "Not even Noah carried this many animals",
            "Winton",
            "\"I just kept 4 kids with metal forks in a best buy alive\"  -A lifesaver in a game with a very confident reinhaardt",
            "I must’ve gotten my CDL during this game the way I’m carrying these short bus attendants",
            "Someone probably reported that.",
            " “Even Noah would struggle to carry these animals” 💀",
            "I had a trio on my team and one guy was severely under preforming. At the end of the game I asked if they were teaching their buddy how to play or what",
            "Never disrespect mei 's amazing volumes",
            "Even Noah couldn't carry these animals. Still gets me even after years.",
            "PJ banning you for that",
            "Welcome to r/Overwatch!  Please use the following resources via the links below to find relevant information about the game and the subreddit.\n\n[Overwatch Patch Notes](https://overwatch.blizzard.com/en-us/news/patch-notes/) | [Overwatch Bug Report Forums](https://us.forums.blizzard.com/en/overwatch/c/bug-report/9)\n\n[r/Overwatch Rules](https://www.reddit.com/r/overwatch/wiki/rules) | [r/Overwatch FAQs](https://www.reddit.com/r/overwatch/wiki/faq) | [r/Overwatch Common Bugs and Posts](https://www.reddit.com/r/Overwatch/wiki/commonbugsandposts)\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Overwatch) if you have any questions or concerns.*",
            "Gammon said call me the sack because I’m the ball carry",
            "“Oops that was a fat finger”\n“Eat less”",
            "With all these monkeys in the lobby you’d think one of you would have evolved by now.",
            "I'm gonna need a bigger backpack.",
            "Excuse me, are you Mr. Big? Because I Carried your Bradshaw",
            "That's like the least creative and oldest insult ever.",
            "still bannable, I bought too much stuff to even think of saying something like this. already been banned twice.",
            "Damn. I’d have to leave after that one",
            "That reminds me of an ult I've fat fingered last year. We were on the night market in Lijiang Tower. We just captured the point after a longish team fight and I (D.VA) pressed Q on accident. Idk anymore who said it, but someone wrote \"D.Va are you autistic?\". I answered yes, because I am and they apologized.\n\nIf I remember correctly we still won the game.",
            "reminds me of the time a support typed “4v6” cuz our tank was throwing quite badly",
            "This is funny?",
            "Of course and they eill get banned, I guarantee it.",
            "It's the children that report literally everything that make this game chat so bad. If I'm not typing good game I'm probably getting reported. And even then I'm probably getting reported lmfao. Reporting banter is so childish even if you don't like it.",
            "I would have tbh",
            "You built like Mei?",
            "Same lol, saw a Mercy get accused of playing so bad someone said they were 'basically pocketing the enemy DPS'",
            "if u dont find it funny just ignore it",
            "To people who think dark humor is funny, yes.",
            "Not everyone has the same humor as you.",
            "tHiS iS fUNny?🥴",
            "I laughed so yes its funny",
            "literally yes",
            "I don’t even know why you’re getting down voted when ow literally runs off an auto report system.",
            "meis fine",
            "The joke is literally just \"you're fat\". Not only is it over used, it's just not funny.",
            "Guys that kid can’t respond until his next 30 second break from the factory floor. This was deeply personal to him",
            "\\*To people who have a sense of humour.",
            "The joke is that they're literally carrying the mei player",
            "yea that wasnt the joke bro",
            "Had nothing to do with Mei’s character model, but that they were carrying the Mei player so hard and it’s a burden.",
            "bro's definitely built like mei",
            "and here comes the superiority complex",
            "What the fuck, I was agreeing with him.",
            "u/prestigious_goose645 explained that it is funny to people with a dark sense of humour. you ‘correcting’ it to *people with a sense of humour* states that you believe people without a dark sense of humour not to have a sense of it at all. another attempted “us against them” :/",
            "Damn bro, you got me, I really was trying to further the divide between those that do and don’t enjoy dark humour.\n\nCongratulations, you’ve saved society.",
            "lol it’s ok to be wrong, it’s not really a big deal. Downvotes seem a lot more powerful but really most people are probably just lightly disagreeing with you",
            "you asked ¯\\_(ツ)_/¯",
            "bro just say you were wrong or say nothing and move on why are you doubling down 😭"
        ]
    }
}