{
    "Pandabuy Announcement": {
        "title": "Pandabuy Announcement",
        "score": 910,
        "url": "https://www.reddit.com/r/Pandabuy/comments/1c3mt97/pandabuy_announcement/",
        "content": "Dear valued users,\n\nWe sincerely appreciate your continued attention and support to Pandabuy. Recently, our company has encountered legal issues related to our services, as our senior management is actively cooperating with the police investigation. Currently, we are fully collaborating with the relevant authorities to ensure that all our business activities comply with legal regulations.\n\nWe understand that this situation may have caused inconvenience and concern for you. Please rest assured that we are actively addressing these issues and commit to keeping you informed of any developments. In the meantime, our team and the authorities are taking every necessary measure to protect your rights and ensure data security.\n\nWe kindly ask for your patience and understanding as we strive to restore normal operations as quickly as possible. During this challenging period, we pledge to prioritize serving you to the best of our abilities.\n\nOnce again, we thank you for your understanding and support and we apologize for any inconvenience this may have caused.\n\nPandabuy's online customer service, community management, and other departments will begin handling your inquiries today. If your questions have not been answered yet, please be patient with our customer service and mods. Due to the high volume of inquiries, we will do our best to respond to you as soon as possible.\n\nTo help users understand the situation more quickly, we have collected some of the most frequently asked questions below:\n\n**Regarding Orders and Packages**  \nQ: Can I still place orders on the platform?  \nA: Currently, Pandabuy accounts cannot conduct transactions such as recharging, paying orders, or handling packages. The police investigation is still not over, our warehouse is still not back to normal, and due to the freezing of some of our funds, We are currently unable to provide services such as top-ups and withdrawals at this time. We are negotiating with the third-party payment company to restore the function as soon as possible for everyone to use, once restored, we will make an announcement in the community and the platform. Please be patient for a while, Pandabuy will still provide you with the best service.\n\nQ: What should I do if the seller does not ship the goods?  \nA: You can contact purchasing consultation; the shipping time depends on the seller.\n\nQ: What should I do if purchasing does not reply? What is the response time?  \nA: Purchasing has begun replying to customer inquiries in sequence. Due to the large volume of inquiries, please be patient.\n\nQ: Is my stored order/package/account/order/parcel on the way safe? / What if parcels in the warehouse cannot be shipped? Should I cancel the parcel? Do I need to submit the parcel?  \nA: Please understand that we are actively addressing the current issues. Please remain patient, and we will resume normal operations as soon as possible. Please wait for official announcements regarding the restoration time, at which point warehouse colleagues will proceed with signing, inspection, packaging, and shipping tasks in sequence. If you have related order or parcel needs, you can contact online customer service again. If your parcel is in transit, it will not be affected.\n\n**Regarding Refunds**  \nThe platform is still cooperating with the investigation and the warehouse is still organising goods. Regarding your item/parcel, we are still waiting for the results of the investigation and the results of the sorting before we can confirm the final status and resolution. So we are temporarily holding your refund request. We fully understand the anxiety of everyone waiting, please give us time. We will do our best to resume normal operations as soon as possible. Thank you again for your understanding and support.\n\n**Regarding Logistics**  \nQ: Any situation requiring consultation with the logistics department, such as abnormal logistics trajectories, insurance, redelivery, compensation, and after-sales inquiries.  \nA: For inquiries regarding your parcel status, please contact the logistics provider for verification. Please wait for official announcements regarding the restoration time, and we will assist you with your inquiries at that time.\n\nThis April has been particularly challenging for Pandabuy. However, we will persevere and overcome this difficulty. We earnestly ask everyone to have more patience and understanding towards Pandabuy, and we also appreciate everyone's attention to Pandabuy. We are actively cooperating with investigations, and we will correct any problems identified. Even if there are no problems, we will conduct internal reforms and reflections to continue providing everyone with a satisfactory shopping platform.\n\nSinserely,  \nPandabuy Team",
        "num_comments": 773,
        "comments": [
            "You guys have to stop promoting on huge platforms to save your company. Tik Tok caused this.",
            "The ppl raiding finna be wearing my drip bruh nah",
            "need that 50% shipping coupon \"RAID\"",
            "[removed]",
            "https://preview.redd.it/seueh8153euc1.jpeg?width=1290&format=pjpg&auto=webp&s=dc911addea8f34a6226f7c36a8e2a6deaa8b63ef\n\nTrue - all my ordered stuff is getting cancelled as I write this…",
            "Nike can fucking piss off",
            "So, anything that has been seized will be refunded?",
            "can you just simply address if stuff has been seized or not",
            "Press F to pay respect to all our stuff still at panda warehouse.",
            "Dude I have $500+ on my warehouse rn, I need a straight answer if it is SAFE or not. 😪",
            "Guys you need to get rid of the affiliate scheme. It’s what caused all this heat",
            "You guys don't understand anything and just talk for the sake of it. Let's see, in China, they conduct inspections on industries and other small businesses (government-related issues) every year searching for imitations. This \"attack\" is known as \"315\" (March 15th, inspections starting around this date). It's very likely that Pandabuy is already prepared for this, and most of the imitation products are stored in more hidden places so that when inspection comes, they can't find anything. What I'm telling you is a theory since the Chinese experience this every year. Pandabuy has gained a lot of international fame and therefore undergoes this inspection. (I'm the CEO of an import company from Asia and involved in international buying and selling, and this issue is the same every year, I know very well what I'm talking about).\n\nWhat to do in these cases with a package that's in the warehouse? Wait, they may not find anything in this inspection, and in a few weeks, they may allow you to send your merchandise.\n\nAny other doubts we can help you:\n\nWeChat ID: galleryvam\nWhatsApp (English) : +1 786 929 3537\nWhatsApp (Spanish) : +34 624 45 25 77\nWhatsApp (Chinese) : +86 155 284 39701\nWebsite: galleryvam.com\nYupoo: galleryvam.x.yupoo.com",
            "https://preview.redd.it/4ybyu4q7wzuc1.png?width=426&format=pjpg&auto=webp&s=87f4c89824244f5f2418d5908fbb5d2f1eb44abc",
            "Stop promoting PandaBuy on huge platforms man let it be known for a small percentage of people only Man u lot ruined it all",
            "The one time I purchased normal loafer socks, normal white pants from some random ass cheap taobao shop and some plain normal office and linen shirts and shorts from another taobao shop this happens",
            "[deleted]",
            "what should I do if I got a few items which are stuck in the storing phase like the QC came everything came except those items are stuck in storing",
            "Man everyone in the comments asking the same question. Just wait and see, you won't all get a reply for the same question",
            " TAKE AWAY AFFILIATION PROGRAMS AND REWARDS THIS IS ALL FAULT OF YOU GUYS PAYING KIDS TO PROMOTE YOU ON TIK TOK.\nI KNEW THIS WAS COMING SOONER OR LATER BECAUSE ITS TOO MUCH MY FYP IS FULL OF PANDABUY TIK TOK THIS IS GETTING OUT OF HAND",
            "damn the communist even got pandabuy",
            "We, as a community, hold the power to stop these “tiktok kids”. We need to come to an agreement when we see someone promote pandabuy/reps on tiktok we mass report them and get them banned. Enough is enough.",
            "Wait so if I have things in a warehouse, should I submit the parcel or not??? I’m confused on what’s the best move here.",
            "Feels like order 66 but the panda buy version",
            "Honestly i jus want everything to be back to normal. These mf tiktok bums fr fucked it up🤦🏻‍♂️🤦🏻‍♂️ like i jus want my shoes n clothes and these 6yo tiktok npcs are over hyping it and caused all this🤦🏻‍♂️",
            "Dude this better get fixed fast I was just waiting to get paid to ship all my stuff and now that I get paid this happens... 😭",
            "Man fuck all these new ppl that got in the game and opened their mouths",
            "How da hell you get shut down by your own people",
            "Al my products are automatically cancelled, will I be able to order again sometime?",
            "(Please keep in mind I could be wrong and if I’m missing something or are spreading false stuff let me know) In my opinion It’s simple, they 1000000% anticipated this. Getting sued by 16 different powerhouses can be catastrophic for the business, so they definitely know how to get out of this mess. Furthermore they make it easy for b2c global trade, making the Chinese government a whole lotta money. Also the companies suing are all American/european so the government will stand by the home business, because they know that all the companies will not leave china to produce elsewhere no matter what, raiding one warehouse is just a stunt to show the world that ‘action is being taken’.",
            "LAST NEWS ABOUT PANDABUY!\n\n\"差不多了,现在各部门正在陆续恢复运行\"\n\nIt's almost done. Now various departments are gradually resuming operations\n\n\"分为两个区域大仓库的,如果是在三栋镇仓的 估计后续工作人员会退回或者申请仅退款,如 果是在惠城区的另外一个仓库是正常发货正常 运行的,没有影响的\"\n\nIt is divided into two regional large warehouses. If it is in the third town warehouse, it is estimated that the subsequent staff will return it or apply for a refund only. If it is in the other warehouse in Huicheng District, it will ship normally and run normally, and there will be no impact.\n\n\nHopefully they stored all our branded products on a hidden warehouse so we can keep cooperating together.\n\nAny other doubts we can help you:\n\nWeChat ID: galleryvam WhatsApp (English): +1 786 929 3537 \nWhatsApp (Spanish): +34 624 45 25 77 \nWhatsApp (Chinese): +86 155 284 39701 \nWebsite: galleryvam.com Yupoo: galleryvam.x.yupoo.com",
            "Man we need to go after those tiktok kids.",
            "Message from a seller: Currently all agents have stopped processing orders. Please wait patiently for a week.",
            "Everybody chill out lol things will be fine",
            "no way the chinese actually care about copyright claims from the americans",
            "What about the items that have a few days left till they expire? Wanted to send the haul on 12th but canceled and waited for responses.",
            "If I have placed an order before this challenge, will it still be fulfilled? (goods shipped to my warehouse)",
            "If we've got stuff in our warehouse, are these items alright, or will they let us know soon enough?",
            "Why tf did they promote themselves on insta and TikTok, they fucking show rep clothes and were proud bout it. Why th would they repost rep haul on their insta",
            "Thanks to those TK and YouTube morons, they've gone and wrecked such a good shopping platform. It doesn't get much worse than this",
            "If my items have been shipped and are in transit am I good ?",
            "Tiktok is real shit...these idiot kids have no clue about the consequences..please stop promoting your services keep it low key..so people who actually use ur services don't get affected",
            "Is there any estimate for how long this will take?? 😔",
            "What’s the estimated timeframe we are looking at for different stages on an order getting back to ‘normal’ service? Within the week? Weeks? Months?",
            "I have 12 items not including Nike products in the warehouse that i need to urgently ship or they will expire due to the date; how can i do???? u/mods",
            "Not a single update after they “returned to work” and not a post allowed thru in almost 24 hrs. Cooked…",
            "Give my fucking money back if I dont get my fucking haul.",
            "what happens to items that are expiring soon? will panda extend storage to prevent them from being distroyed until after investigation",
            "If my order was shipped on the 12th April and returned to sender because it didn’t pass customs on the 14th April will I still be able to get my order shipped after this sorts itself? Or at the very least a refund?",
            "If my stuff running out of time will i get more days in the warehouse? Thanks",
            "https://preview.redd.it/i5bg41x61fuc1.jpeg?width=1440&format=pjpg&auto=webp&s=639228c2b1e9c0c809ffebe9e1d1f39e5486f295",
            "Will the insurance still cover parcel if we have shipped the parcel but it hasn’t updated on the tracking? In the event of not receiving it of course",
            "If we have orders about to expire in the warehouse should people recharge or it sounds like you cannot even do this because they are not allowing transactions of any kind. Is that correct in my understanding of the situation?",
            "as so often, greed brought ruin. damn tik tok kids advertised too much.",
            "this is worst than the world war 2 tbh",
            "Pandabuy back on the 18th official announcement via discord",
            "i blame tik tok",
            "is it possible to order again?",
            "any update?",
            "No news for 10 days.\n\nRIP Panda. Need to find new agent.",
            "When do we get our money",
            "https://preview.redd.it/tzirws4v7fuc1.jpeg?width=1284&format=pjpg&auto=webp&s=a48f77aeff16bf31de022bf42464e4221423d1ff\n\nMy stuff is being bounced back from customs (no shoes or swoosh items but still bounced back)",
            "i hope pichu is ok 🙏🏾",
            "my parcel says it has been shipped and war submitted on the 10th of April. It only says electronic cargo information received. what does this mean? that the package will be alright or that I have to wait and it hasn't been shipped?",
            "Type shi",
            "Never back down never give up❗️❗️💪💪💪",
            "So can you ship the stuff in your warehouse or not??  They have cancelled items I was waiting on, Sl,CH etc, but then other items are now saying seller sent and purchased,",
            "What should i do for cnfair items that are running out of time? I wanted to ship everything out soon i have 23 items in warehouse all with like 10-15 days left, ig hopefully this is resolved by then lmaoo",
            "My parcel says \"Carrier Collected\" and it's been a day or two I'm using pd line b",
            "what will happen to my items it says seller sent but it’s been like a week",
            "I have a “ seller sent “ status under one of my packages since March 30th. Should I request a refund?",
            "What about the stuff in the warehouse? Most of my stuff will run out of storage period in under 12 days.",
            "https://preview.redd.it/1wcm910d4juc1.jpeg?width=1080&format=pjpg&auto=webp&s=9b40278fa718d31e653d925f2d1a47fbc794b97d",
            "long live pandabuy",
            "How long will it take to recover",
            "If it’s sitting in warehouse, should I attempt to ship my stuff, or it won’t allow?",
            "I have this e mail today from pb\n\nhttps://preview.redd.it/xyxysfbrgnuc1.jpeg?width=1179&format=pjpg&auto=webp&s=935d62a358bfddeb6a4857b28c00c92a562d08fd",
            "What if your order says collected",
            "can i order now",
            "Ih have 300$ items in warehouse. What do I do?",
            "Some news please about Pandabuy...?\n\nhttps://preview.redd.it/ci63tctyktvc1.png?width=1984&format=png&auto=webp&s=506a8747ca787d4da811431be53c912d445205e2",
            "someone tell me if pandabuy’s telegram links will be reactivated",
            "has there been any update as of now 4/21/2024?",
            "is it safe to ship my haul?",
            "Any update?",
            "Hi guys, what is the current situation 1 week later?",
            "When is pandabuy working again does anyone know smthg?",
            "What happens if the items expire? Do they give extra time or refund or what? Pls help my cnfair haul about to go down the drain😭😭",
            "They really do be moderating this sub like the CCP themselves lmao",
            "Ok",
            "Comeback stronger 💪🏻",
            "When will it be back ?",
            "We love Pandabuy 🥺",
            "Now that pb is cooked, what is the next best site for reps?",
            "Update ?",
            "Why was my account deleted? It says my account doesn’t exist when I try to log in? I still had money in my account balance that was I wanted to withdraw?!",
            "tiktok gay\n\nhttps://preview.redd.it/5zzoubsexm2d1.jpeg?width=254&format=pjpg&auto=webp&s=8d698987973240323648ec4e0d1563df34d65b18",
            "I won a PB giveaway for some shoes, they were purchased for me by PB on the 9th and they still haven’t arrived to warehouse. Should I wait it out?\n\nhttps://preview.redd.it/y5yfe4kl1guc1.png?width=959&format=png&auto=webp&s=168688b9495bef2029976ca93aab7305e8e72f8b",
            "Awesome. Now my shit is stuck in the warehouse literally hours after my refund window expires. \n\n\nGreed. It's what you get.",
            "What should I do if my package says handling rn?",
            "Common guys and gals, let just get a gofundme set up so Pandabuy can hurry up and pay the bribes that they need to and we can all get back to business 👌",
            "My parcel is in handling, should I cancel or wait?",
            "Will pandabuy be back???",
            "My parcel is on \" Collecting \" status am i good ?",
            "LAST NEWS ABOUT PANDABUY!\n\nhttps://preview.redd.it/qslibgj70muc1.jpeg?width=857&format=pjpg&auto=webp&s=2685fe3071d518c1cf9aec5651a50ccbd25497f3\n\nI have another message (I can't post two images I don't know why)\n\n\"分为两个区域大仓库的,如果是在三栋镇仓的 估计后续工作人员会退回或者申请仅退款,如 果是在惠城区的另外一个仓库是正常发货正常 运行的,没有影响的\"\n\nIt is divided into two regional large warehouses. If it is in the third town warehouse, it is estimated that the subsequent staff will return it or apply for a refund only. If it is in the other warehouse in Huicheng District, it will ship normally and run normally, and there will be no impact.\n\nHopefully they stored all our branded products on a hidden warehouse so we can keep cooperating together.\n\nAny other doubts we can help you:\n\nWeChat ID: galleryvam WhatsApp (English): +1 786 929 3537 WhatsApp (Spanish): +34 624 45 25 77 WhatsApp (Chinese): +86 155 284 39701 Website: galleryvam.com Yupoo: galleryvam.x.yupoo.com",
            "You have made money on this until now. You have pushed people to sponsor you on various social media and you have attracted attention. Now you have to take responsibility for it, instead you prefer to cooperate so you don't have problems. I am sure that after this no one will buy on your website anymore and you have deserved it",
            "[removed]",
            "What should I do if I ordered a pair of prescription glasses. The Seller already sent me pics and the glasses are done, but he has no way yo send to pandabuy with all the shit going on right now. Should I cancel my pandabuy order and pay him directly?",
            "https://preview.redd.it/ubmnv9cvoeuc1.jpeg?width=1179&format=pjpg&auto=webp&s=6f815937e764066fb9f514b8d156bddaafd4d4f6",
            "Glad I got SB",
            "Can’t even make orders anymore",
            "Does anyone know if anything like this has happened in the past",
            "I noticed that a lot of products and links are unavailable now.Does this have something to do with the raid?Will it go back to normal?",
            "can we still withdraw?",
            "Hopefully the business continues.",
            "Is there any possibility that we as a pandabuy customers will have issues with the China. For example, would we have trouble getting a visa.",
            "My items gonna expire in a few days, what do I need to do",
            "My orders cancelled.. went to refund but for some reason I’m £10 short..",
            "I’ve got items in the warehouse that’s due to expire, can I extend storage? (Non-Nike items)",
            "Ordered 1 patagonia half zip fleece. Was on purchasing status for 3 days, now they canceled it to. Im pretty sure they canceled every order one of you folks did in the last couple of days....",
            "If my item is on seller sent is there a chance it still might come in or should I just try to refund",
            "https://preview.redd.it/14ctu0p1zfuc1.jpeg?width=1290&format=pjpg&auto=webp&s=73da92f042845711ff6da8538e05af8deb84a766\n\nDamn, 1:1 essential pants cancelled….",
            "What can I use instead of pandabuy at this time then? Or It doesn't matter cuz the sellers r the same and they're under investigation?",
            "Why would you open the sub for QC and W2C while being investigated? Smh",
            "i shipped out it says handling im gonna jus wait",
            "Well my package had began shipping on the plane a few days ago but haven’t had an update since so I hope my package makes it home to me",
            "so i can get things to the warehouse normally but i cant ship them to my house?",
            "What if the status is stuck on storing been like that for 4 days btw",
            "I tried doing a withdrawal but it was declined - as per bank it is issue on your side. So they do seem to be unfortunately affected.",
            "Some of my orders storage expires soon and I can’t extend storage rn rippp",
            "So will our stored items be safe? If not would we been refunded for the stuff we have stored? That’s all I want to know.",
            "What happened to r/FashionReps tho, anybody got any infos ?",
            "Soo when they will come back?",
            "Ur Guys would transfer all Money on ur acc on your main bank accout?",
            "None of this affects hauls that have already been sent out right? Like mine is already with dhl in Germany",
            "I literally have an order placed, it's in the \"pack pending\" stage. What do I do????",
            "What will happen to the products we have from CNFair ?",
            "So pandabuy is done for even in future to purchase ?",
            "I odered something via Pandabuy a couple of days ago. It's still under risk control. What will happen to this order?",
            "will I get my money back if I ordered?????",
            "My package says is shipped but I didn’t get anything from the tracking code",
            "How do I withdraw money sitting in PandaBuy account from refunded orders please",
            "I have 17 items stored - should I cancel and refund? I was preparing to shipped them out.",
            "Does any of y’all know when this shit going back to normal",
            "Have orders that were out for distribution to the warehouse before the raid been delivered?",
            "China is a communist country I believe in cases like this why does the Chinese government actually give a f that we buy reps , all our stuff comes from you anyway so the reps just another thing to look at this a culture a revolution that has been started we are against shity corporations marking up a a sweat shop made shirt by 10x the price just to try to “ flex “ some people aren’t out here flexing they like the fashion people making 6 figures are buying these reps if that don’t tell you something people are getting smarter and more conscious about their money and finance, so I hope the Chinese government or whoever is responsible just looks the other way , plus the the US is  a debt slave to China now they wanna stop reps ?",
            "Spent 900 now you’re saying my shit is possibly gone … nice 🙃",
            "What If I Have Item In Warehouse That Expires In 7 Days?????",
            "I have “Risk control audit failed” , they refunded the balance, and then they transferred everything to them \"Manual reduction.\" I don’t have that money on the balance  What should I do?",
            "Mf telling the whole neighborhood smh🤦🏽‍♂️",
            "Dude I jus got good ricks in my parcel FUUUUUUUCCCCCC",
            "Ok I brought like 10 things and all shipped but 3/4 have arrived and it’s been a good few days and I good or will this mean they won’t turn up now.. normally coke in first week/early 2nd",
            "If the widen seller directly cancel my order do I get refunded?",
            "Stop advertising on TikTok, that will kill your company.",
            "pray for your parcel button >>",
            "made my largest order about 2 weeks ago, first the breach now this :(",
            "so yall use Temu now? and will pandabuy ever come back?",
            "Look i need to only ship my items (about 82 parcels) in ur warehouse to another chinese address ( all my items are not branded) so why dont u just let me ship!!",
            "What will you guys do with the balance that you have on your account? Will you keep it there or withdraw it back to your account?",
            "ok so can we use other agents instead?",
            "What happens to the Fashionrep community?",
            "is cnfans a good one",
            "Guys we need more alternatives for FashionReps and Budgetrepsneakers they all went private. I mean what will happen to them and any good alternatives",
            "So please, what will happen with my money in Pandabuy how am I going to get it or I need to wait for you guys to come back?",
            "I withdrew my balance in alipay, it is stuck please help mods ",
            "I’ve submitted and paid for shipping for my items on the 10th of april. But my parcel still is on ‘Collected’ since that day. Is my parcel going to be shipped or am I also screwed?",
            "[deleted]",
            "If i have nikes in the warehouse will they still be shipped out",
            "What‘s happening with the goods in my warehouse?",
            "what do i do when it says seller sent?",
            "I sent out my haul before this happened and now it seems to be stuck. Someone know, if I will ever receive my package and if not, how I‘ll get my money back?\n\nhttps://preview.redd.it/i24b9uwv7nvc1.jpeg?width=1125&format=pjpg&auto=webp&s=51429fa53144347d12eaa2a0f249de3db61e9ef9",
            "I don’t know what to do I purchased shipping but it’s on ‘handling’ I’d refund it but it said that if I discard the packaging for my shoes the seller can’t process refund im sure handling means they haven’t done it yet so I should be fine! have people got there refunds want to make sure I get it???",
            "any updates when i can place a order?",
            "Hello \nI’ts impossible to resheal my warehouse item \nNeed to sent my item thx",
            "https://preview.redd.it/ssn10injktvc1.png?width=1978&format=png&auto=webp&s=81f6ad393c1b9293ff45a6a8a9f5c4069b5c8515",
            "https://preview.redd.it/2y85ddgnktvc1.png?width=1986&format=png&auto=webp&s=30cfd466d925986a5a103d69826c09cd79e471f0",
            "[removed]",
            "WEN ?",
            "For my CNFair items, some will exceed the storage time. What will happen to them?",
            "Any fresh news ?",
            "anyone do a successful charge back yet? I've tried a dollar yesterday still waiting to see if it worked. Please let me know!",
            "Does anyone know Pandabuy email?",
            "Idk if I’m just dumb, but is there any update available?",
            "I just had money in my wallet. I applied for whitdrawal (pixpay/Brazil), the money is gone (1.700 Y)... in my account it says : \"manual deduction\" but the money never entered my paypal since the 18th. I think they really started robbing us",
            "[removed]",
            "My package been in “Handling” status for weeks 😩",
            "My Discord Account got limited cause of ur Discord Server.      -\\_-",
            "I need my refund please",
            "So how do i buy some stuff? Im tryna buy a small haul am i better off using a different app?",
            "https://www.theguardian.com/world/2024/apr/26/pandabuy-police-raid-20-football-stadiums-worth-of-alleged-fake-goods-warehouses\n\n\nnow it has the attention of the MSM ...it is all over now!",
            "Ofc the warehouses get raided the DAY I put in a massive $600 order. Only got $300 in refunds. Any update on timeframe for pandabuy to be back to business? Or are we Shite out of luck",
            "Do you guys know any similar dealer like Pandabuy?",
            "https://preview.redd.it/luyj79qpstxc1.jpeg?width=1284&format=pjpg&auto=webp&s=5ba6410866e3948f7f358ffa7fc843b9b8415431\n\nWhat does collected mean ? It’s been like weeks what does collected mean. On my parcel am I cooked?",
            "My package has been stuck in \"Scanned\", \"Waiting to be picked up\"  status Since April 9th. Any one know what I should do?\n\nShipping line: PD-EMS (USA)",
            "So much for my shoes from a perfectly legit Chinese brand that aren't fake copies of anything. \n\nAt least I only had bought one pair.",
            "whats the whole point of reps if we cant get them wtf 🤦🏾‍♂️",
            "Are we still unable to make new orders?",
            "they need jayoma",
            "what should I do? delete the account?",
            "they will not come back guys\n\nhttps://preview.redd.it/dmjd2kgnpb2d1.jpeg?width=640&format=pjpg&auto=webp&s=2ad2fbc981bba9d09d76b3d853ab4d6f2ad42974",
            " 8GB.",
            "8h7sj4u 5",
            "So can we still buy things off Pandabuy?",
            "Forget what I said  lol Pandabuy is done for the moment",
            "Can I order now?",
            "so we have to take our loss and move on to the next agent ?????",
            "damn bruh it’s over",
            "F you",
            "This 100%. TikTok has been their rise AND downfall.",
            "real shit",
            "honestly bro, same thing that happened with soap2day, everyone just wants to blab",
            "Yh bruh everyone knows what pandabuy is in my skl coz of tiktok 😭😭",
            "tiktok or attention seeking kids in general?🤷🏽‍♂️ there is a reason why old kung fu masters  teached their shit to only a few chosen ones",
            "You talking like a clueless politician. TikTok is a platform for video sharing. Pandabuy incentivised its customers to post reviews for rewards and brought this upon themselves.",
            "Reddit too then?",
            "For real tho.",
            "Black cats and full nike tech",
            "Give me my Yeezy slides back officer 👮‍♀️",
            "I’ll be happy if everything turns back to normal and they won’t ghost us. I don’t get why people feel this entitled all the time lmfao, they can just be like fuck you finess is done and people still tryna negotiate with air 🤣😂",
            "No cap",
            "Real shit! They better come with the BIG inconvenience coupons",
            "Thanks Pandabuy for asking the tiktok kids to post and giving them money for doing it. Tiktok kids aren't to blame. Take away the affiliate programs and rewards.",
            "whatever helps you cope lol. pandabuy willingly paid users on tiktok to review their products. its incentivized to make more money and gain more traction",
            "yup mine too, but one got sent lmao that seller DGAF",
            "https://preview.redd.it/q9b8tc0geeuc1.png?width=1080&format=pjpg&auto=webp&s=96fc83caf922382c22221179f9d49bac9ca1a80b",
            "What did yoy order",
            "Do you mind sharing what brands the items included? Many of us are curious to know which brands are being targeted",
            "Mine got canceled 1 AM yesterday 4/14. I placed my order the day before the raids. The system automatically rejected my order which was a huge haul worth about 650 Euro…. No refund as of yet.",
            "fr just lemme get my fake shit i'm poor 😭",
            "If they cut their insane prices for their subpar quality products people wouldn’t have to buy reps, but Nahh those greedy ass billion dollar companies just have to squeeze every penny out of their customers",
            "pretty sure",
            "Read the post “There is no need to worry about the security of your assets” \n\nSounds like they’re taking responsibility for all items.",
            "i dont think anyone would use pandabuy again if the items in the warehouses got seized and we dont get a refund",
            "Try 2.5k lmao",
            "Why would you have so much in warehouse why not ship it",
            "Bro I got 80+ items in warehouse. Some got more.",
            "I feel yall $875",
            "I think all will Go good be Patient",
            "Noticed that packages had been going to different locations the last few weeks. Maybe even a month. That theory makes some sense.",
            "LAST NEWS ABOUT PANDABUY!\n\n\"差不多了,现在各部门正在陆续恢复运行\"\n\nIt's almost done. Now various departments are gradually resuming operations\n\n\"分为两个区域大仓库的,如果是在三栋镇仓的 估计后续工作人员会退回或者申请仅退款,如 果是在惠城区的另外一个仓库是正常发货正常 运行的,没有影响的\"\n\nIt is divided into two regional large warehouses. If it is in the third town warehouse, it is estimated that the subsequent staff will return it or apply for a refund only. If it is in the other warehouse in Huicheng District, it will ship normally and run normally, and there will be no impact.\n\n\nHopefully they stored all our branded products on a hidden warehouse so we can keep cooperating together.\n\nAny other doubts we can help you:\n\nWeChat ID: galleryvam WhatsApp (English): +1 786 929 3537 \nWhatsApp (Spanish): +34 624 45 25 77 \nWhatsApp (Chinese): +86 155 284 39701 \nWebsite: galleryvam.com Yupoo: galleryvam.x.yupoo.com",
            "wait...what? \nthis guy is hiding in a parcel? 🫠",
            "The fault isn't of the influencers, pandabuy decided himself to do a content discount and application yall shouldn't focus on the influencers but on pandabuy that decided to do so (knowing it will let that become popular).",
            "Yes these idiots lack common sense... report their content to get banned at all costs",
            "Just wait when they're back to normal",
            "I’m in the same boat, just gonna have to wait it out. Nothing can be done yet",
            "Same with me. One of my items had QC pics taken before the raid and it’s stuck in “storing” and the other got delivered to the warehouse and it’s stuck on “seller sent” still.",
            "same thing w me",
            "i also have an item stuck in \"storing\". qc pics are already present. \n\ni just wait and see.",
            "Fr bro this is just tragic, I was looking to get some real ts j1s and they were selling for like 1500 without box and hella used, so i thought lets try pandabuy and I have been thinking about buying from them like since last year but was really hesistant and now I am hearing about all the raid and shi. My brothers bday comin up thought I would get him some LM10 and cr7 nwm now ig",
            "lets just wait. im in the same situation",
            "No you cant add balance right now to your account so its not even possible to place an order",
            "Fr",
            "Honetly you are right. I would say I am new to panadbuy and shi but I didn't opened my mouth like these rats did, I knew pandabuy like a year ago or two but I was really hesistant to buy anything cuz I thought it was a scam. But the real bitches are the ones on tik tok trying to get their clout up by showing hella expensive shit for low price, and pandabuy paying these tik tok kids for advertisment ,smh, just when I was about to get em",
            "as i can tell from my panda account, only orders that were still in \"pending\" or \"purchasing\" were cancelled. as i had nothing with status \"purchased\" or \"seller sent\", i dont know what happened in these cases. status \"storing\" is just freezed and status \"stored\" remaind stored.",
            "its not their fault. ofc theyre going to promote pandabuy when they get paid for it.",
            "They could threaten to move their sweatshops to another country",
            "This is what I need to know but I’m sure Pandabuy will be ok",
            "Same here bro, my goods storage expiration ends literally today as I could now gather the money for to ship it out but it won’t let me make any type of transaction to extend the time period. Am I cooked?",
            "very good question. i guess pandabuy will give \"extra time\" for these cases.",
            "I’d cancel the order if it hasn’t already shipped to the warehouse. And order it again if everything goes back to normal",
            "The post says anything in transit to the warehouse is unaffected but the collection, signing, and storing of items won’t be processed until operations resume back to normal.\n\nAnything in the purchasing or initial order processing phase has been cancelled and refunded.",
            "Wonder as well 🤔 I think that probably most big brand items will be seized and hopefully we’ll get the money back",
            "yeah ur chilling",
            "The real question,hope they answer",
            "What was ur parcel status, was it shipped yet?",
            "Thats a great question",
            "I tried to recharge since I have some items expiring in 12 days and it didn’t let me.",
            "Can u link it",
            "Brooo dont. That ting is on fire. You will burn your Money. RIP pandabuy. RIP my haul in Warehouse.",
            "Go to my profile and read.",
            "How are you able to speak to them on the app",
            "Have got the exact same bro",
            "Same from the 8th",
            "Same, been stuck at collected since the 10th",
            "I’d say you should wait. I’ve some packages in the same situation and one of them was collected by the warehouse on April 12th. Still waiting for it to appear as stored",
            "a month stiff my parcel said packed and was almost out the door  too bad i waited a month to ship out",
            "Just be patient!  You can message the agent and ask, but I would guess if you wait a few more days you'll have your answer.",
            "Mine stuck on handling for 3 days 😭",
            "It’s stuck. Mines on collected as well. We just have to wait it out :/",
            "nope\n\ndo not try to order or ship out until we hear an official announcement from them.",
            "yea",
            "Same Here. I think you Just can wait. Or did anybody try to withdraw the Money? But I think PB is dead. RIP.",
            "Nope",
            "Go to my profile and read.",
            "Go to my profile and read.",
            "Same bro, does your’s also say that you can redeclare or cancel?",
            "Mines the same. I'm going to wait it out.",
            "Mine was canceled by panda and my money was refund, but I have a lot of money on 13 kilos and almost 15 days left in the warehouse",
            "No, nothings being collected rn",
            "It is a good idea to ask the seller. He may also ship items. Or you can look at another agent, not affiliated with Pandabuy.",
            "Hello, this has nothing to do with your question but where did you buy your prescription glasses? They are very expensive in my country, can you help me?",
            "My understanding it’s a yearly thing where police raids happens at warehouses nd this time they jus got caught lacking give it a few days to a week bd look out good updates things should go back to normal",
            "sellers are hiding rn",
            "Yes",
            "Bro💀 why tf would u buyin frm pandabuy make u hv issues with gettin a chinese visa💀😭😭🤣🤣",
            "Either you pay shipping or extend the time",
            "it’s just because they can’t purchase anything as of now, you can buy it soon dw",
            "Theyre all under investigation,better to just wait it out",
            "No, things will not go to any warehouse since people in pandabuy are not working at the moment, plus the sellers won't even send it out at the moment knowing what's happening wait some days or a week before doing anything at all.",
            "they went private with other reps channel as well they will come back when the situation with panda cools down",
            "Wait.",
            "anything within china is useless right now and that includes tracking",
            "Withdraw from the wallet. I did mine yesterday and it went through fine ",
            "Yea and reps help the chinese economy and lowers the usa economy they can’t stop something that are helping their economy",
            "I already got refunded for a product that hasnt reached the warehouse yet",
            "Already back in the account. No reason to take chances.",
            "damn bro rip",
            "it takes time bruv",
            "popo seized them",
            "Go to my profile and read.",
            "Go to my profile and read.",
            "[deleted]",
            "Im thinking to try a small haul, did you try?",
            "Sugergoo",
            "I just tried and yes, unable to even add things to cart. I suggest if you have stores in favorites, save the links",
            "how long will it take for it to come back? i wanna buy cactus jack j4s",
            "How am i going to Buy stuff???",
            "Torrents bro",
            "bro check out: [upmovies.net](http://upmovies.net)",
            "They PAY people to do reviews on the platform. It’s restarted",
            "[deleted]",
            "Because 85% of the people on here are kids who haven't been told \"No\" in their entire life.  I'm gonna be an old man here and say that most of these kids are so soft due to gentle parenting lol\"  \n\nI'm with you.  Assuming things turn back to normal in some capacity I'll be happy.  I was fortunate and only have 1 pair of shoes in storage and had 1 order in process for a grand total of $50 USD.  I know others weren't in the same boat as me.  \n\nOnly time will tell but everyone needs to be patient as shit.",
            "For comments click here (Just for the purpose ofsharing and communication, if you like mycomments and you happen to want to buy shoesI hope you can come to me)\n\nThank you for watching\n\nW2C:: My mall is here:+86 1360754451\n\nE: with code StockX Pro \"You can use this codeon every other pair of shoes to get $15 off.\"\n\nOrdering:Ordered via WhatsApp or the storeie\n\nQC photos - within 48 hours\n\nDelivery - within 24 hours after\n\nQC confirmation Delivery arrives -7-15 days",
            "we'll be lucky to get a 20cny off shipping coupon 😅",
            "Nah I actually prefer everything comes back to normal and that’s it. We continue doing what we’ve been doing for years.",
            "Sweatshirts I ordered are delivered but just sitting never got stored",
            "Why are you censoring what you ordered",
            "I got all my shit in the warehouse, 1 hoodie still didn't arrive to the warehouse, i assume it's for the raid, or maybe it arrived but i can't know that.  \nThis was my first order, litterally april 4, i don't know what to do or what i should do, i'll just wait.  \nI don't have any of these messages tho",
            "rose toy",
            "No brands they cancelling left and right my eye masks were cancelled",
            "They're not actually targeting specific brands, they're targeting all counterfeits, but it was 16 brands that initiated the raid.",
            "fr dude",
            "Agreed. All Nike has done is guarantee I won't wear their shoes anymore. The prices have gotten stupid, if they proved competitively this would have never happened.",
            "Prices arent that much of the problem, its more of the reselling problem. Make the pairs less limited and itll become an actually good purchase because who the fuck would pay 500$ for terrible quality chinese penis leather self-combusting sneakers",
            "Wonder how it will go for cnfair items. Luckil6 I shipped everything out already",
            "will the police agree to that?",
            "personally paid with paypal if anything gets seized imma just get everything back in blood w chargebacks 😭😭",
            "Yeah I’m up there with like $1000 in QC warehouse 😭",
            "Damn i thought my 900 was heavy lmao",
            "same here bro, words cannot even describe how sick i feel right now.",
            "Damn I was stressin abt my $250",
            "Bro what 😭💀 what all do you have in there",
            "bro, this probably has minimum 50 kg weight. you ship this in 1 parcel????",
            "Have around 390 items in mine 😭",
            "Same bro!",
            "https://preview.redd.it/bo6bfliqb5wc1.jpeg?width=1079&format=pjpg&auto=webp&s=7c3b237730c26f716297312ea2bf25f96afe7883\n\nNah...",
            "I have 3 stuck in “Seller Sent”. 2 of them were delivered but it looks like the third was refused or they closed up by the time they tried to deliver it because now tracking says it has to be picked up.",
            "It's on \"risk control\" and it's reallt wqeird as its not been canceled",
            "I hope they won’t seize my fake Rolex ):",
            "It said security checking I had just paid for it before this",
            "Wdym recharge? Through the bank or PayPal",
            "I had an online service chat open on the 9th that went without response to until now, I also chatted the agent who bought the item and got a response there.\n\nI’m also getting 1-2 email responses a day.\n\nSeems support is slow but it’s coming back!",
            "Yeah",
            "same here",
            "damn thats even worse",
            "any luck?",
            "damn, this really sucks.",
            "You can refund the money in your wallet. For me it took 2 days and then I had it",
            "The thing is, the agent already purchased the items on pandabuy.  All that's left to do is the seller has to send the items, but now he has no way to.",
            "i want some frames if  you got links",
            "ahahaha idk just asking",
            "They dont even ship out right, how can you extend the time",
            "When's soon tho",
            "ah okay I see thank you. How long do you think I should wait before purchasing something?",
            "Thanks bud for had 1800cny it let me withdraw it in several small amounts but not one lump sum but it worked so thanks again",
            "You requested the refund or was it automatic?",
            "[removed]",
            "U da goat",
            "yeah but change the name and start from scratch lol Live leak is now kaotic",
            "Husky reps but pandabuy is in shambles rn",
            "9 shoes in total. Out of 20 orders so far this one was the biggest. Talking about timing lol.",
            "I have 35 items in my warehouse and  10 ordens cancel  2 refunds in process  u..u",
            "It’s to late TikTok ruined it",
            "He bought a dildo",
            "Just wait. If it's says stored, then it's in the warehouse. Online systems now working so you could apply for a refund and wait. I've had all my under process items refunded and it it's all be credited back into my account so they will make good it will just take time. They have over 1million users all trying to get in touch at the same time so it won't be quick.",
            "I’m in the same boat. I got like 7 items in the warehouse stored. I just hope they’ll ship it soon",
            "what brands",
            "I got greedy and wanted to add two things to my order and then I got hit with the no",
            "neophilia and bad spending habits",
            "Nah I wouldn’t even try one parcel for my whole warehouse lol. It’s always 40+ items",
            "What is bro shipping? Hopefully we’re not cooked 😭 might be back tomorrow",
            "There seem to be lawsuits from 16 different companies, we only know one of them for sure, it’s Nike. Hoping that your Rolex will be safe",
            "Have u got any news? Mine also didnt arrive yet hopefully not seized",
            "I tried to pay the $1.50 to “recharge” the time in warehouse since I’m down do 12 days until it’s destroyed,I attempted to pay with my $27 that I have in my pandabuy wallet but it didn’t let me pay the $1.50 so I was unable to “recharge” the time that my items have left.",
            "Oh okay thank you",
            "Wasn’t a yes or no question 🤞",
            "No luck yet. I’ve decided to just charge back now for the parcel on my PayPal. Fed up of the lack of updates 👍🏻",
            "And then? Can I refund it back into my Banking Account? I think No, right?",
            "you click on your warehouse click the item is about to expire and pay the extend storage",
            "A month they are under arrest",
            "Wait a few days until pandabuy is back on,As rn u cant even purchase anything,Im sure pandabuy got it under control,nothing bads gonna happen,all you can do is wait aight?😂",
            "For me it was automatic all orders will get refunded if they didn't reach warehouse",
            "I messaged pandabuy before the raid, because the seller didnt ship the product for 8 days. But i asked them to message the seller. Instead they refunded me this morning",
            "And me I haven’t made a purchase in two years came back and bam 💥 lol, pandabuy should be back soon maybe 🤞",
            "Terrible timing for me too just bought a boat load for my dads birthday the day before the raid",
            "41mm???",
            "what if its gonna take more than 3 months ?\n\nmy products only got 3 days left in the ware house whats gonna happen after that?\n\ni cant get a refund or top up my wallet.",
            "For sure stussy and Nike.",
            "I dont think that has been specified anywhere, as far as I know.",
            "Ok. I usually collect around 8kg and then ship. This time I had a little more in the warehouse so I had to let some stuff unshipped when I made a parcel just days before the raid. This parcel made it to the flight but is not arrived yet. I never go above 8-9 kg when shipping .",
            "Anyone got a list of the 16?",
            "What💀 im agreeing with your question because im also confused how he can talk to them💀",
            "I think it depends on how you paid at the time. I was able to transfer it to my bank account",
            "I found it thanks bro, is it dumb to top up my balance cus many people say dont top up etc",
            "oh what how yk this tho",
            "I think they will be back and operational within month.",
            "Don’t worry it was all refunded to your account, so whenever we can place orders again you can place the order again!",
            "Yes so 1.6 inch dildo",
            "Yea that’s a good amount to ship. Mine is usually around 8-9kg too. Biggest I’ve shipped is 11kg at once but I’ve never had any issues until this raid. Been using panda for about a year now.",
            "Ive seen Dior, Nike and Burberry been taken out of peoples warehouse so far. My adidas was taken out of my warehouse . I would also say Fear of god also because it is one of the most things i see in everyones hauls. Thats all i could think of",
            "Mine is the international parcel contact option, I also emailed the care email that’s in their contact page online and got responses 2 days in a row (several replies a day)",
            "I have 40 usd in my wallet, do you think its time to withdraw it?",
            "I doubt you have a choice rn if the items are about to expire you have no choice but doing it (it isn't dumb since panda can't do nothing about it)"
        ]
    },
    "expired items": {
        "title": "expired items",
        "score": 28,
        "url": "https://www.reddit.com/r/Pandabuy/comments/1djx94b/expired_items/",
        "content": "Some of my stuff just expired last night and i was wondering if were getting extended time or something. I read that they extended the time until july 30th but it still says \"expired item\" in the warehouse",
        "num_comments": 67,
        "comments": [
            "*Dear Im_Humaaaaaaan, your post is temporarily removed to ensure it's not spam. Mod team will approve it soon if it complies with our community rules.*\n\n*If you are seeing this post on the main feed, then it was already approved.*\n\nWe sincerely appreciate your continued attention and support to Pandabuy. Recently, our company has encountered legal issues related to our services, as our senior management is actively cooperating with the police investigation. We are fully collaborating with the relevant authorities to ensure that all our business activities comply with legal regulations. We understand that this situation may have caused inconvenience and concern for you. Please rest assured that we are actively addressing these issues and commit to keeping you informed of any developments. In the meantime, our team and the authorities are taking every necessary measure to protect your rights and ensure data security. We kindly ask for your patience and understanding as we strive to restore normal operations as quickly as possible. During this challenging period, we pledge to prioritize serving you to the best of our abilities. Once again, we thank you for your understanding and support and we apologize for any inconvenience this may have caused.\n\nWe have a **[discord server](https://discord.gg/pandabuyworldwide)** with channels regarding **order, package, declaration**, etc. where you may get some help. You can also contact **[online support](https://www.pandabuy.com/about/contactus)** if there's an emergency.\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Pandabuy) if you have any questions or concerns.*",
            "There probably is no item left to extend time for, authorities be wearing our stuff",
            "Lol..... PB ain't coming back. They can give you an extension till this planet blows up, you lost your money.",
            "Honey bun, sweetie pie, mushroom tip, no worries all items are currently under extended storage time. Please be patient till investigation is over",
            "Luckily I’ve been able to get most of my money back, If I were you guys just chargeback don’t even wait anymore",
            "https://preview.redd.it/888qxi8izr7d1.jpeg?width=828&format=pjpg&auto=webp&s=ba07389c7bc3ceb4a0da4a9535372afd78f56232\n\nTheir response to my question about this",
            "Police already burn the warehouse bro",
            "Just asking, but what agent is everyone using since Pandabuy is down?",
            "We have extended the storage period for all of you until the end of the investigation so don't worry they won't expired.",
            "forget about the stuff you have there and move on.",
            "SOMEONE EXPLAIN TO ME HOW TO REFUND THE EXPIRED ITEMS IN NY CART?",
            "Too late bro, the feds are already wearing your reps",
            "PandaBuy is gone lol you going to keep giving you an “extension” until you are dead 🤣. Just take the L and move on",
            "How can I request a refund. Whenever I try to withdraw my money in my account it says it’s suspended.",
            "Bro.. PandaBuy is gone. Time to realise :|",
            "So I have 1.2k worth of stuff in wearhouse and they are not letting me ship, MY STORAGE is running out will I lose all my items if I do I'm dead basically",
            "I got funds can I not get them back? Got around £300 in cyn just sat there and warehouse is loaded 😭",
            "Yo I low-key need Pandabuy up before I go back to school I need more reps",
            "Just wait u will get ur money back if they cant work. How they can hold money if they on control by police😂😭",
            "Is Pandabuy cooked?",
            "i requested refunds and i got it pretty fast, i can imagine a lot of banks know about this",
            "Top Comment",
            "is it possible to chargeback if you didnt use paypal?",
            "Paypal says it’s been more than like 60 days i think what do i do?",
            "Use middle man they better to work in",
            "Go do your own research",
            "fr im tryna find a new agent",
            "Is better to use middle man’s honeslty",
            "Dm me for agents",
            "KameyMall",
            "just stop it’s over fgs",
            "In other words, ur shit is cooked",
            "I think we need to report the Pandabuy employees to get them taken off of Redditt tbh",
            "why do you keep lying to us?",
            "news about?",
            "No you haven, it still is the same",
            "No , search by yourself lil homie",
            "Dm me for screen recording of the wearhouse 😭🙏",
            "Same😭",
            "Dm me for agents",
            "Easy.",
            "??? tiktok iq right here",
            "Deep fried",
            "Hey bro… did u request the refund through your bank or through Pandabuy and they refunded all your items back to your card???",
            "how do u do it",
            "I request a refund and it’s been 10 days and Ive still not received a response.",
            "I lost my chargebacks.",
            "I’m not sure what payment method did you use?",
            "cnfans",
            "How do you do that",
            "https://preview.redd.it/ab68j38m8r7d1.jpeg?width=1284&format=pjpg&auto=webp&s=b01a7682a1bf1f865ad1383735b60809b062c317\n\nOnly have 9 days for this stuff ? Or will be until you comeback?",
            "I did the payment with paypal, i used their form and i got money back instantly",
            "ya same the ui is very similar to pb",
            "How do i change agent",
            "Pm me",
            "Bro link",
            "hey bro, Pandabuy replied to my refund with an actual tracking code of my product but its the one that goes from the seller to the warehouse. What should i do to win the case???",
            "tell them that pandabuy ceased operations and your stuff was 100% never sent out because they are in the hands of the authorities. that is what i said and i received my money from the chargeback. that said, i had to open 9 cases, a couple were instantly refunded, and ive had a couple refund today matter of fact, but they denied 2 of my cases so im going to have to fight them saying what i typed above. so the results of your chargebacks can vary",
            "Depends witch payment method you used",
            "stay safe. wait",
            "this is on paypal"
        ]
    },
    "Problems": {
        "title": "Problems",
        "score": 0,
        "url": "https://i.redd.it/usalujarde7d1.jpeg",
        "content": "I cannot join the discord. the verify button does not work for me. \n\nWhenever i go to pay for something i get this error. anyone know how to fix this. \n\n",
        "num_comments": 16,
        "comments": [
            "*Dear maskfjenahan, your post is temporarily removed to ensure it's not spam. Mod team will approve it soon if it complies with our community rules.*\n\n*If you are seeing this post on the main feed, then it was already approved.*\n\nWe sincerely appreciate your continued attention and support to Pandabuy. Recently, our company has encountered legal issues related to our services, as our senior management is actively cooperating with the police investigation. We are fully collaborating with the relevant authorities to ensure that all our business activities comply with legal regulations. We understand that this situation may have caused inconvenience and concern for you. Please rest assured that we are actively addressing these issues and commit to keeping you informed of any developments. In the meantime, our team and the authorities are taking every necessary measure to protect your rights and ensure data security. We kindly ask for your patience and understanding as we strive to restore normal operations as quickly as possible. During this challenging period, we pledge to prioritize serving you to the best of our abilities. Once again, we thank you for your understanding and support and we apologize for any inconvenience this may have caused.\n\nWe have a **[discord server](https://discord.gg/pandabuyworldwide)** with channels regarding **order, package, declaration**, etc. where you may get some help. You can also contact **[online support](https://www.pandabuy.com/about/contactus)** if there's an emergency.\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Pandabuy) if you have any questions or concerns.*",
            "How stupid are you",
            "Hey dear now you can join the discord again. And Pandabuy can't be ordered for this time being due to the investigation! Once we back to normal we'll notify on discord!",
            "[deleted]",
            "😂😂😂",
            "this really helps. thank you. dick head",
            "Give us our Order",
            "Hate you",
            "is it possible to ship items from warehouse",
            "is there any chance my order will still arrive after 2 months",
            "Overpriced",
            "They got raided and they can’t do anything right now so why are u buying shit?",
            "😂😂😂🫵🫵🫵",
            "no",
            "[deleted]",
            "[deleted]",
            "I’d rather wait"
        ]
    },
    "Warehouse time extension?": {
        "title": "Warehouse time extension?",
        "score": 0,
        "url": "https://www.reddit.com/r/Pandabuy/comments/1dinddg/warehouse_time_extension/",
        "content": "I have some Items in my warehouse and they are running out of time. Will pandabuy keep these items in my warehouse even if time runs out? Or give a time extension?",
        "num_comments": 36,
        "comments": [
            "*Dear brxklyn__, your post is temporarily removed to ensure it's not spam. Mod team will approve it soon if it complies with our community rules.*\n\n*If you are seeing this post on the main feed, then it was already approved.*\n\nWe sincerely appreciate your continued attention and support to Pandabuy. Recently, our company has encountered legal issues related to our services, as our senior management is actively cooperating with the police investigation. We are fully collaborating with the relevant authorities to ensure that all our business activities comply with legal regulations. We understand that this situation may have caused inconvenience and concern for you. Please rest assured that we are actively addressing these issues and commit to keeping you informed of any developments. In the meantime, our team and the authorities are taking every necessary measure to protect your rights and ensure data security. We kindly ask for your patience and understanding as we strive to restore normal operations as quickly as possible. During this challenging period, we pledge to prioritize serving you to the best of our abilities. Once again, we thank you for your understanding and support and we apologize for any inconvenience this may have caused.\n\nWe have a **[discord server](https://discord.gg/pandabuyworldwide)** with channels regarding **order, package, declaration**, etc. where you may get some help. You can also contact **[online support](https://www.pandabuy.com/about/contactus)** if there's an emergency.\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Pandabuy) if you have any questions or concerns.*",
            "Good morning, hope you had a nice hibernation.",
            "bruh pandabuy isn’t coming back, forget about the items and chargeback ur money bro",
            "someone tell him",
            "Go ahead and get your refund, champ.",
            "That was exactly what they want. To escape from refund. Items will be destroyed once it expires on the storage",
            "Would PayPal find it suspicious that I’m charging back orders from a while ago?",
            "I paid debit card can I get a refund or am I fuked",
            "It’s dead PandaBuy",
            "[removed]",
            "Is there any alternative? Please write a dm",
            "Forget about your stuff the police probably took it and your not seeing that ever again",
            "Yes your items won't expired. We had extended the storage time for all of you. Just ignore the prompt.",
            "ive requested chargeback, and i havent got a single penny for my chargebacks used Revolut",
            "Do you know how to do a chargeback please?",
            "can i chargeback if i paid via bank",
            "I am aware panda buy have been raided but on the off chance any of our items are recovered i just wanted to know if they will still be in ‘our warehouses’",
            "did you use it through paypal cuz paypal can refund too",
            "Read my other comment under this post",
            "Should we ignore the police presence at the warehouse too?",
            "idk what revolut is but all my chargebacks worked thru paypal lol",
            "i used revolut and got it back, 4 seperate payments",
            "Why would they be recovered? they’re counterfeit items, police will destroy them",
            "No I bought 2 hauls and used debit",
            "i wish i used paypal, sucks to be me",
            "hi, can you walk me through on how you chargeback via paypal?",
            "i mean i used 3 separate payments and none got chargebacked yet, still waiting, they havent refused either so hopes up",
            "For items that are not counterfeit like blank t shirts, trackpants etc.",
            "nah all mine were rejected by paypal apart from one that instantly got accepted, i think they will refund wallet balance but not items in warehouse although i could be mistaken",
            "message me i’ll show u how to do it",
            "Most likely gone for good, Pandabuy won’t be back from this, CEO been imprisoned etc etc.",
            "don’t be a spastic and use logic to comprehend the situation.",
            "yeah maybe, all of my refunds were wallet balance",
            "Logically thinking if they are being raided for selling counterfeit items why would non counterfeit items be seized. I am aware pandabuy is most likely gone for good but just wanted to ask a justified question about items I’ve paid for to see if it’s worth trying to stick it out or just chargeback",
            "The company will go bankrupt. They won't be active anymore. It's over. If you're aware Pandabuy is most likely over (it is), you should know what to do.",
            "You are acting very ignorant in your thinking. You think the government is going to go through things item by item to determine what is counterfeit and what is not? PandaBuy is know for selling counterfeit items. Period. Everything is being destroyed"
        ]
    },
    "Qc's pandabuy": {
        "title": "Qc's pandabuy",
        "score": 3,
        "url": "https://www.reddit.com/r/Pandabuy/comments/1dhhaod/qcs_pandabuy/",
        "content": "is anyone able to check the archive of pandabuy qc's? ",
        "num_comments": 28,
        "comments": [
            "*Dear Solo-Mario, your post is temporarily removed to ensure it's not spam. Mod team will approve it soon if it complies with our community rules.*\n\n*If you are seeing this post on the main feed, then it was already approved.*\n\nWe sincerely appreciate your continued attention and support to Pandabuy. Recently, our company has encountered legal issues related to our services, as our senior management is actively cooperating with the police investigation. We are fully collaborating with the relevant authorities to ensure that all our business activities comply with legal regulations. We understand that this situation may have caused inconvenience and concern for you. Please rest assured that we are actively addressing these issues and commit to keeping you informed of any developments. In the meantime, our team and the authorities are taking every necessary measure to protect your rights and ensure data security. We kindly ask for your patience and understanding as we strive to restore normal operations as quickly as possible. During this challenging period, we pledge to prioritize serving you to the best of our abilities. Once again, we thank you for your understanding and support and we apologize for any inconvenience this may have caused.\n\nWe have a **[discord server](https://discord.gg/pandabuyworldwide)** with channels regarding **order, package, declaration**, etc. where you may get some help. You can also contact **[online support](https://www.pandabuy.com/about/contactus)** if there's an emergency.\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Pandabuy) if you have any questions or concerns.*",
            "I have my pandabuy links saved in the app and i can check Them and take them to another agent",
            "U need to use an pc",
            "It works on computer. Just click esc when the note is coming up and you should be able to view the qcs",
            "Is pandabuy up running again??",
            "Site called reparachive",
            "https://qc.pandabuy.com/ \n\nPut pandabuy link here",
            "What agent would you guys recommend?",
            "The platform is undergoing adjustments, and still need some time to resume operation. It's up to the investigation so once it's over we will notify everyone. Thanks for your understanding and support during this tough time.\n\nMay I know why you want to check QC?",
            "Why is Pandabuy down  ? When will they be back up again ?",
            "The seller is +852 5263 3137",
            "but you can check qc's? for me it always gives an error on items that did have a qc",
            "unfortunately no",
            "It doesn't work. I tried multiple links",
            "cnfans, slow but it does the job",
            "to see how the item looks",
            "Because the People User other Agents pff. You think the people weit years for You To come back ?",
            "How much longer??",
            "Anybody gunna tell him?",
            "they took away the option to check QC for any product, annoying as hell. Now we gotta order hauls and gp ourselves with other agents",
            "I can not",
            "Is it safe?",
            "Yeah tell me tell me lol",
            "what agent do yall use?",
            "yes",
            "They got raided bro. Ppl lost orders, money, the whole 9. Pandabuy is clipped.",
            "So what they do is illegal?? Why would they get raided lol",
            "I had a bad feeling something like that happened….i tired using sugaroo but got back a message saying ‘items can’t be purchased’ (this of course AFTER I paid , but hopefully I’ll get refunded ) one factory told me to use basetao…any  further thoughts or info ?….thanks for replying"
        ]
    }
}