{
    "Friday Megathread - Things My Kid Said - June 21, 2024": {
        "title": "Friday Megathread - Things My Kid Said - June 21, 2024",
        "score": 2,
        "url": "https://www.reddit.com/r/Parenting/comments/1dkqdpc/friday_megathread_things_my_kid_said_june_21_2024/",
        "content": "Share the things your kid said that made you laugh/cry/go on a mad rampage!\n\nIf you'd like to talk daily about things your kids say, visit /r/thingsmykidsaid\n\n^(Wondering who your mods are?) [^(Click here to meet the mod team!)](https://www.reddit.com/r/parenting/w/Meet_the_Mods)",
        "num_comments": 2,
        "comments": [
            "r/parenting is protesting changes being made by Reddit to the API. Reddit has made it clear [they will](https://old.reddit.com/r/ModCoord/comments/14ahqjo/mods_will_be_removed_one_way_or_another_spez/) [replace moderators](https://www.reddit.com/r/ModSupport/comments/14a5lz5/mod_code_of_conduct_rule_4_2_and_subs_taken/jo9wdol/) if they remain private. Reddit has abandoned the users, the moderators, and countless people who support an ecosystem built on Reddit itself. \n\nPlease read [Call to action - renewed protests starting on July 1st](https://old.reddit.com/r/ModCoord/comments/14kn2fo/call_to_action_renewed_protests_starting_on_july/) and new posts at [r/ModCord](https://reddit.com/r/ModCoord/) or [r/Save3rdPartyApps](https://old.reddit.com/r/Save3rdPartyApps/) for up-to-date information.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Parenting) if you have any questions or concerns.*",
            "Yesterday, my 10-year-old told me very seriously, \"When I grow up, I'm going to be a dinosaur doctor and fix all the T-Rex boo-boos.\" This had me laughing all day!"
        ]
    },
    "Wednesday Megathread - Ask Parents Anything - June 19, 2024": {
        "title": "Wednesday Megathread - Ask Parents Anything - June 19, 2024",
        "score": 1,
        "url": "https://www.reddit.com/r/Parenting/comments/1dj5f82/wednesday_megathread_ask_parents_anything_june_19/",
        "content": "This weekly thread is a good landing place for those who have questions about parenting, but aren't yet parents/legal guardians and can't create new posts in the sub.\n\nAll questions and responses must adhere to our community rules.\n\nFor daily questions, see /r/Askparents\n\n^(Wondering who your mods are?) [^(Click here to meet the mod team!)](https://www.reddit.com/r/parenting/w/Meet_the_Mods)",
        "num_comments": 4,
        "comments": [
            "r/parenting is protesting changes being made by Reddit to the API. Reddit has made it clear [they will](https://old.reddit.com/r/ModCoord/comments/14ahqjo/mods_will_be_removed_one_way_or_another_spez/) [replace moderators](https://www.reddit.com/r/ModSupport/comments/14a5lz5/mod_code_of_conduct_rule_4_2_and_subs_taken/jo9wdol/) if they remain private. Reddit has abandoned the users, the moderators, and countless people who support an ecosystem built on Reddit itself. \n\nPlease read [Call to action - renewed protests starting on July 1st](https://old.reddit.com/r/ModCoord/comments/14kn2fo/call_to_action_renewed_protests_starting_on_july/) and new posts at [r/ModCord](https://reddit.com/r/ModCoord/) or [r/Save3rdPartyApps](https://old.reddit.com/r/Save3rdPartyApps/) for up-to-date information.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Parenting) if you have any questions or concerns.*",
            "How important is it for you to have access to live video feeds of your child’s daycare?",
            "I don’t think I can make a new post so trying my question here. My 6 year old has a common dialogue after school:\n\n1. What’s dinner tonight? We typically reply with something that he refuses to eat because he’s a very picky eater. \n2. Then he says “I’m hungry now” (it may be an hour before dinner so I don’t want to offer something that will fill him up). I reply with an offer of an apple or some other fruit. He says they’re yucky. \n3. I remind him that we set the menu but he can choose what to eat. He sulks on the couch. \n\nThis is typically combined with a dialogue where he’s bored and any activity suggestion I offer is rejected. \n\nWhat can I do to break this cycle of the “no’s”? I feel like I’m talking to a wall and my son stubbornly shows zero interest in working together.",
            "I have a family member whose 11yo kid hits him. He's been doing it since toddlerhood. The dad won't say no or discipline him. He just holds his hands out to ward off attacks. The punches are hard, like he's trying to hurt his dad, but the dad acts like he thinks the kid is playing. \n\nThis is a big kid. In a couple of years, he will start sprouting, and looking at his size right now, I would not be surprised if he ends up bigger and stronger than Dad. This is a disaster in the making. No one will talk to the dad as he's very sensitive about parenting, but there will be elder abuse coming in a few years (dad is an older parent). I am not close at all to this family member; we actually clash. So, do we just watch this all play out?"
        ]
    },
    "Please help us settle this…": {
        "title": "Please help us settle this…",
        "score": 276,
        "url": "https://www.reddit.com/r/Parenting/comments/1dljy90/please_help_us_settle_this/",
        "content": "Having a disagreement with my partner, would love your input. \n\nLet’s say you are home alone with a 3 week old newborn who is sleeping in a bassinet. You want to run to the corner store that is half a block away to get milk. Is it okay to leave the baby alone at home in the bassinet while you run to get the milk? \n\nThank you!! \n\nEdit: THANK YOU!! Settled. My partner is an idiot. \n\nHe would not actually leave the baby alone like this, it was purely hypothetical. In the wake of his stupidity, he is now claiming that he was arguing that “it would be okay” meaning probably nothing bad would happen. Sigh. It’s possible he’s trolling me a bit as well. I hope. ",
        "num_comments": 605,
        "comments": [
            "r/parenting is protesting changes being made by Reddit to the API. Reddit has made it clear [they will](https://old.reddit.com/r/ModCoord/comments/14ahqjo/mods_will_be_removed_one_way_or_another_spez/) [replace moderators](https://www.reddit.com/r/ModSupport/comments/14a5lz5/mod_code_of_conduct_rule_4_2_and_subs_taken/jo9wdol/) if they remain private. Reddit has abandoned the users, the moderators, and countless people who support an ecosystem built on Reddit itself. \n\nPlease read [Call to action - renewed protests starting on July 1st](https://old.reddit.com/r/ModCoord/comments/14kn2fo/call_to_action_renewed_protests_starting_on_july/) and new posts at [r/ModCord](https://reddit.com/r/ModCoord/) or [r/Save3rdPartyApps](https://old.reddit.com/r/Save3rdPartyApps/) for up-to-date information.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Parenting) if you have any questions or concerns.*",
            "Absolutely not.",
            "It’s not a hamster.",
            "Will anything realistically happen? Nope. Do I want to roll the dice even with the near 0 odds? Nope.",
            "Now, did you settle the argument?    The answer is no, of course,  who thinks this is ok?  Please share the whole story and the results.",
            "Of course not!!  What if there’s a fire, or you get hit by a car, or a medical emergency happens, etc??",
            "Listen, I tend to be pretty relaxed and chill compared to a lot of folks on this sub, and uh... *no*.\n\nWas there a burning, dying need for you to have milk right then, at that exact moment? A reason why it couldn't have waited until the baby was awake, and you could take them with you? Why you couldn't wait for your partner to be home, so they could stay with the baby?\n\nLike... yeah, okay, I'll be honest, the odds of something happening are slim. The chances of you getting into a car accident (or getting hit by a car), or someone breaking in while you're gone are unlikely. But for something that's not needed, that's not necessary, that can easily wait a few hours.... why would you run that risk? Especially given that newborns are *notorious* for waking up often, not sleeping soundly, etc. Like... even if you were only gone for fifteen minutes, imagine your baby waking up five minutes after you leave, and crying for ten minutes until you get back.\n\nAnd then ask yourself if the few hours -at most -to wait was worth it.",
            "Heard once that if you’re having a disagreement regarding safety of the child - you go with the safer option. Within reason. This is within reason. Don’t leave the baby alone.",
            "I'm concerned that this is even a question. Absolutely not.",
            "Absolutely not. Never, ever ever. You have no idea what could happen. Babies need supervision at all times.",
            "[deleted]",
            "#No.",
            "No.",
            "On no condition is that even the slightest bit okay, and could in fact get you into legal trouble if the baby wakes up starts crying, and the neighbors realize no one else is home.",
            "Fuck no.",
            "Unequivocal no",
            "This is considered “neglect” by CPS and your family would be considered for having the child removed. Um, be careful leaving your baby with someone with that kind of judgment. For instance, what if baby vomits and can’t roll over yet and chokes? A million things can happen. 🤦‍♀️",
            "No, never.",
            "No way in hell",
            "Never. In situations like these you pay a ridiculous amount to get it delivered",
            "I’m not sure there needs to be any more answers to this, but just in case… no!",
            "No.",
            "What the fuck, no",
            "No it is not ok. Take the baby to the shop. Its never ok to leave an infant alone in the house. ",
            "No. How is this even a question?!",
            "There is nothing at a corner store which cannot arrive via Uber eats and is so important that it's worth leaving a baby alone like that. Get a delivery if you need to, but do not ever leave a baby alone in a house while you're (or another responsible adult) not there.",
            "NO. NOT EVEN ONCE. Noooooooo",
            "That's illegal.",
            "Nope",
            "Nope. Not ok. Would result in a big issue.",
            "How is that ever ok?",
            "Absolutely not.\n\nWait until the baby wakes up, or bring the baby.",
            "Not OK. I take my toddler out of the car to pay for fuel even when I can see my vehicle.",
            "This is why you own a baby carrier ",
            "No. No. And in case you didn’t hear the first two times, NO.",
            "You can be in your yard. Otherwise baby is with you. Period.",
            "No ????",
            "NO.",
            "Absolutely not. Never. No way.",
            "No way!!!",
            "No, not okay",
            "Never. Obviously. Also wtf?",
            "I wouldn't even leave my 2 y/o toddler alone for that long. \n\nAin't no way",
            "This is why strollers were invented.",
            "Baby monitor range only. ",
            "No. If it was across the street and I had the baby monitor, MAYBE. But the problem is that no one else knows the baby is alone. If you get into an accident or hurt or the house catches on fire. No one else knows. ",
            "Just no. Even if nothing is likely to happen, anything can happen. Not worth the risk.",
            "ABSOLUTELY NOT.  \n\nPicture explaining to the police that your baby died in an electrical fire, because you didn't want to bring them to the store. \n\nYour natural HUMAN instinct should be to protect your child's life, not risk it over the inconvenience of taking a newborn to the store.  Be very careful of people who want to gamble with their child's life, because the parent has decided not to be inconvenienced.  Babies are not pets.",
            "Yeah I think it's fine...for you to ask this question anonymously in Reddit to get the unanimous feedback that it is absofuckinglutely not ok and is neglect and is illegal for a reason.",
            "Short answer: no. \n\nLong answer: nnnnnnnnnnnnnooooooooooooooooooo. \n\nThere’s always a chance of bad shit happening. Your house could catch fire, you could be hit by a car, etc. Is it a minuscule chance that something like that happens? Yes. Is even a one in ten million chance worth the risk? See the short and long answers above.",
            "Absolutely fucking not.  Ever.  Nope.  I'd divorce my wife and take our child if she did.",
            "Not even a discussion. No way.",
            "Put the baby in a moby wrap/carrier and bring it with you. \n\nOr in the stroller.  It might wake up and then go back to sleep \n \nBabies love sleeping in moby wraps and strollers",
            "Who gives a fuck if you want milk? It ain’t a milk emergency.",
            "Nope!",
            "Wtf no",
            "What in tarnation? No. Hell no. Anything could happen.",
            "I take my baby everywhere. He's almost 11 weeks, and if I need to leave, I wake his ass up, and we go. He'll catch up on his sleeps later.",
            "Um 40m father of 3 and the answer to this is FUCK NO ! 3 weeks old is that even a question ?",
            "Absolutely not. I’m a free range, laid back, rule-breaking mama, and even I would never do that.",
            "Hell no.\n\nGreat rule of thumb for future arguments on similar topics:  \nWhichever parent is arguing for greater safety of the child, that parent always wins the argument. Saves a lot of fuss and arguing.",
            "Never. The baby always needs to have an adult in the home, whether that is a parent or babysitter, for any instance longer than 5 minutes or so. Especially that young.",
            "Nope . Shouldn’t be leaving the baby in a empty house",
            "No. Never.\n\nYes, there is a slim chance that something bad will happen. Fire, lock yourself out, baby is in distress and out of range, etc. But there is this helpless creature that is 1000% dependent on the humans that brought them into this world. Is the milk that important? \n\nAlso, it’s illegal and considered neglect. CPS standard of care is pretty low- it’s the basic lowest level of keeping a baby/child alive. So if a persons standards are lower than CPS’s… might want to re-evaluate some things.",
            "Nope. The person who thinks this is okay is a good candidate for parenting classes. Child services offers them for free. You should call them and ask if they think it's okay to leave an infant unsupervised, if it ever comes up again.",
            "Ummm no. This is how you get your kids taken away from you.",
            "Um, which side is op on?",
            "No. It’s illegal and stupid. ",
            "I haven’t read the comments, but I’ve never been more confident in my life in assuming something: you’ve gotten your answer. Just here to add another tick to the ABSOFUCKINGLUTELY NOT column.",
            "If you have to ask this question maybe yall aren’t ready to be parents 😭",
            "Christ on a bike, no that's not OK! It's one thing to lay baby in the bassinet and take the baby monitor outside into the yard with you so you can get a quick breath of fresh air. But to actually LEAVE the baby?! There's zero circumstances where that would ever be acceptable. If you need milk that badly, either take baby with you or have some delivered.",
            "Hard no. Wait until they wake up and then go to the store. If it’s urgent, just wake them up and take them. It’s too risky. If anything happened you would never forgive yourself.",
            "Under no circumstances is that ok",
            "Short answer : No it’s never ok. \n\nLong answer : this ( USA ) chart is pretty accurate \n\nhttps://www.pinterest.com.au/pin/154037249734595294/",
            "Nope, not ok. Put that newborn in a baby sling and go to the store if you need it that bad.",
            "No, it's crazy you even would have to ask.",
            "Nope, Instacart it. Call a neighbor, a friend- a family member, see if they can do they favor.",
            "Wtf. I would not trust anyone who thinks that is okay with my child. That is textbook not okay.",
            "NO! And technically - it’s not legal (in US) and can cause CPS or local police to investigate parents and consider removing said “unattended child” on the basis of neglect.\n\nSource: Former property manager and one of my tenants would walk “just down to the store” and leave a friends cell phone on FT so she could “watch” baby while she went to the store. \n\nOne of our units caught fire and I called 911 and had to door knock as it was late at night, she saw the fire truck turn down our short street and called me. I had to grab keys to her unit and Fire Dept went in and got baby - and guess who they were required to call? She was gone 10-15mins when this happened. Her unit wasn’t at risk, but you never know how fast something can spread. And it’s just not legal to leave them home alone.",
            "Absolutely not! Never leave baby alone unattended.",
            "Absolutely mother fucking not, and if I ever discovered that my partner left a newborn alone in a house I would end the relationship. There is no way I could ever feel safe trusting their judgement again.",
            "No not okay. I think it’s illegal in some states to leave a child home alone under a certain age anyway",
            "You’re f******  kidding right?",
            "No! My father left me to “run” to the store when I was a baby. He got pulled over and arrested on an outstanding warrant. 🙄. My mother was at work, didn’t drive and had to wait for ride to get to me. My grandfather made it to me first and took me home with him safe and sounds. So definitely not a chance. Anything can happen.",
            "100% NO, not sure why it's even a question 🤦‍♀️",
            "My friend left her sleeping baby to run down to the laundry room in the basement of our building.  She ended up trapped in the elevator for a few hours. Baby fine, mother a basket case. Don’t leave your baby unattended, ever.",
            "I would not do so in town, because people would call the police if they noticed. But reality - people who live in the country leave their babies sleeping in the house while they walk out to feed the goats or clean a horse stall or move the irrigation system… as far and as much time as a trip to the corner store. I think it seems different because it is on the same property. But something *could* happen to parent or baby. \n\nSomething *could* happen to parent or baby inside a house as well. A baby could choke in its room while you are taking a poop or a shower or just watching a show downstairs.",
            "No!!!!!!! That’s a call to CPS right there is what that is, at least, if the neighbors ever found out.",
            "Men think this way. I’m 99% sure the man is who thinks it’s ok. I had to have a few hard conversations with my husband about the kids safety.",
            "Fuck no. WTF",
            "Never",
            "What… year are you writing this from?",
            "Absolutely not and this should not even be a subject of debate. In fact, it's illegal.",
            "Nope",
            "In my state the legal age to leave a child alone is 10.",
            "How many minutes to the store? Driving or walking? I’ll argue that walking to the mailbox or doing yard chores, if it’s the same distance, might be ok.",
            "No",
            "wtf. No. Never ever leave an infant alone, not a toddler, or young child. \n\nThis should never ever be a question",
            "Send the baby to the store instead.",
            "When my baby was that young, I didn't even feel it was right to go down the hallway in my apartment building and do laundry. The answer is absofuckinglutely not.",
            "No",
            "No",
            "Hell no!! I would never",
            "For the love of god… no.",
            "NO.",
            "Hell no.",
            "NO WAY!",
            "No. Never.",
            "Absolutely not.",
            "wtf",
            "Absolutely freaking not. Never. No matter what. NO. Holy Jesus god almighty, NO!!!",
            "I can’t believe someone thinks this is ok?",
            "No no no",
            "It is absolutely not okay to leave a baby of any age alone. It boggles my mind how anyone can think it’s okay. The year my son was born, he turned 3 weeks old the week of the 4th of July and I couldn’t even leave him in his bedroom, with the monitor while I was in the backyard of our townhouse while we did a couple sparklers. I must’ve checked on him half a dozen times within an hour. \n\nI know that’s not necessarily normal. My anxiety was high as a new mom for a couple of weeks. But still I will never be able to wrap my head around people who can leave their babies at home and think they are safe just because they are sleeping.",
            "Well hell no",
            "No it is not okay. Why would someone think this is okay??? It's a baby, take them with you or wait to go out.",
            "NO. Unacceptable.",
            "No. Never. No. What if something happens to you?? Why chance it? I left my boys home once to go grab a pizza and it was pure panic, very dumb. I completely get the temptation but too risky",
            "No!! What if the house caught fire or something? It takes a second for things to go wrong.  I get scared going to the letterbox with my baby sleeping in crib",
            "Nope. Under no circumstances do you leave that baby there alone. The house could catch fire, you could get into an accident, you could get shot at the store.. there’s entirely too many things that can go wrong here. You do not leave a small child by themselves like this. If this actually a question either of you is asking, you’re clearly not ready to be parents.",
            "Nope. No. Absolutely not. ",
            "In what universe would that be okay? This is a human baby not a pet. If you or your partner genuinely believes that is appropriate you need to get into parenting classes immediately because I wouldn’t trust that person’s judgement alone with the baby",
            "Absolutely not ok! I mean who would actually even think that this would be ok??",
            "Nothing to settle here. Absofuckinglutely not.",
            "Absolutely not!!",
            "This is absolutely a hard no and anything else is neglect.",
            "Nope, this is not okay. Never leave a baby alone in a house.",
            "I didn’t even walk eight houses down the street to my brother in laws house for milk when my newborn was asleep.",
            "Absolutely not!!",
            "ABSOLUTELY Not!!!!!!!",
            "No.",
            "Hellllllllll to the fucking no",
            "Never. Something goes wrong the best you can hope for is solitary confinement",
            "This is how you loose your custody. Whats the question?",
            "Absolutely not. No. Never.",
            "Nope ",
            "Hell no!",
            "Nope. \n\nDid you ever watch the movie Manchester By The Sea?",
            "No under no circumstances. A baby can get into a lot of trouble really quickly. Also the emotional damage on a baby that has to cry for a long period of time. In my opinion it lasts its lifetime.\n\nWhy not just go to the store with the baby I always enjoyed getting out with mine. The baby likes the adventure too.",
            "Nope",
            "No. It’s not just about what could happen at home while the baby is asleep, but what could happen to YOU out and about in the world and no one knows you have a venerable newborn at home. Just order in the milk via post mates or something if it is an emergency.",
            "NOOOOOO!",
            "No",
            "I’m a pretty free going parent and I absolutely would never do this.",
            "Not ok.  Maybe out to the front yard.. or if the store is literally next door and your baby monitor works for. There.",
            "I had to have this debate with my husband to the point where I told him it was non negotiable, no matter the distance, to leave our baby alone in the house if we will be leaving the property. \n\nOur older son needs to be dropped off/picked up at his bus stop for school every day and sometimes this schedule interferes with our 7 month olds sleep schedule. But I will either wake baby up, or just not show up for pick up and make him walk (about 7 minutes walk) home. I’d never leave the baby alone even for the 4 minutes it’d take to the bus stop and back. Not going to happen.",
            "i would say no. but I left my kid at home once for ten mins....while i sea ched for her shoe we dropped. she waas watching tv.",
            "I won’t even walk to my mailbox bc my monitor won’t go that far lol",
            "Absolutely not 😳",
            "No, never leave the child alone.",
            "that’s gonna be a no from me dog",
            "Gosh I just barely started leaving my 10 year old home alone to run to the corner store and I still get anxious. And he has a cell phone and is very responsible 😆",
            "I would not do this with a 5 year old",
            "Would something happen?\nProbably not…\nIs it okay?\nFUCK NO",
            "No. Even at 3 YEARS old I haven’t left my kids home alone even to just take the bins out.",
            "I remember reading a story about a parent leaving the kids at home alone to buy something nearby very quickly. When the parent got back, the house was engulfed in flames, killing the kids.",
            "If you think it is ok, you may need psychiatrical help. I say this not as a joke, and without sarcasm. There are mental conditions that cause low empathy or a changed perception of risky situations, and they may lead to situations in which you endanger other people (not only newborns) without a second thought nor a feeling of guilt.\n\nIf it's your partner who thinks it's ok, then your partner needs help just as above.",
            "Ok, see, I'm in conflict here BECAUSE you said half a block, which is in typical baby monitor range. Yet people are SCREAMING at you that it's neglect, yet it's ok to take a baby monitor to your yard and outside. You're literally going like, 2 doors down from your own front door. While I agree it's never okay to leave a baby alone, I'm also confused about why sitting outside for 30+ minutes while the baby is napping is ok, as long as you're still in the yard... But taking a literal 3 minute walk (1 minute to walk there, 1 minute to grab the milk and pay, 1 minute to walk back) is suddenly so absolutely life threatening for the baby because the house just decided in that 3 minutes it wanted to spontaneously combust.",
            "No. I would hope that CPS would remove a child from the custody of parents that do something so incredibly dangerous. ",
            "hell no door dash from the corner store. its a lil more expensive but id very much rather pay more and have peace of mind!!!",
            "I think by the silence of the OP we can discern what their stance was on this.",
            "No. Pay for delivery.",
            "Technically no, but at the end of the day, taking a dump, a shower, or sleeping will keep you away longer, then it is a risk based decision that might have to be made.\n\n\nDid your husband leave to get milk for the baby, or to make pancakes for the adults. I would say the reason also has a lot to do with with appropriateness.",
            "Everyone's saying no, and honestly, I don't think my wife and I ever did it, but half a block away -- you're talking 10 minutes max.  I don't think I could fault you for doing it.",
            "The chances of anything happening to that newborn whether you’re spending 10 mins grabbing milk or sitting in the master bath are nearly identical. 😂",
            "Oh my goddd.",
            "In an hour there isn’t much that is likely to happen to the baby if you leave it by itself, but there’s enough to make it a terrible idea.",
            "We leave our trash can up at the road because it is just easier: our driveway is a very steep hill, and it is approximately 528 feet (1/10th of a mile) from out garage door to the concrete pad where our driveway connects with the road. Our entire property line is surrounded by trees. The only way into our property is the single car width driveway. We have a monitor that is connected via our home network/Wifi, so I can view it with my phone whenever I want. \n\nStill wouldn't leave baby in the house alone to run the trash up to the road. \n\nThe issue is not just about the potential danger of baby being at home alone. What if the adult is injured on the way to or from? Who the hell is going to know that baby is alone?",
            "Half a block? I can get there and back faster than I can poop. Can I poop while the baby is sleeping?",
            "I'm jealous you have a corner store that is half a block away. Most Americans have to drive 5 miles to the nearest anything. Fuck I hate this country.",
            "Never would I ever condone this…",
            "Never. That’s a hotline call",
            "Also illegal if you’re in the USUAL",
            "Raise your level of concern for your baby now before you fuck up and regret it later.",
            "No",
            "I do gotta ask is your baby daddy on the spectrum? 🤯🤙🏻",
            "Ummm... no. Wtf?",
            "Absolutely NOT",
            "Hell no!",
            "No, never.",
            "Even 3 week old babies can turn over onto their tummies too! But they can’t lift their heads up and could suffocate in the time it would take to go to the store down the street. Absolutely not and I hope they, or you did not do it and/or never do it again!",
            "Heck no!",
            "no",
            "Not a chance.",
            "No never not even a little.\n\nYou wait to get the milk. No reason the milk was that important and if it was then you should have planned better.",
            "Nope.",
            "Absolutely not.",
            "Under no circumstances should you leave a baby unattended.",
            "Absolutely not! It’s the “what if’s” is why you shouldn’t take the chance.",
            "No way! Anything could happen.",
            "As someone who thinks kids are a lot more independent and self-sufficient than modern parenting methods give them credit for: no. No no no no no no no. Do not leave your extremely small and helpless near-newborn baby home alone.",
            "No lol. I understand the temptation, but you can’t do it.",
            "Nope. Never. Next question.",
            "HELL NO! what if you got into an accident? Flat tire, car issues? \nWhat would even make you consider that? WTH out of beer?",
            "I personally could never do that and don't find it okay at all.",
            "No! You can't leave a any child, even less newborn, alone in a house.",
            "Nope",
            "Wtf no",
            "Not okay.",
            "NEVER EVER",
            "No. It’s completely against the law in Canada.",
            "No",
            "Hell the fuck no are you kidding?! You take the baby with you",
            "No you may not leave an infant alone like that.",
            "No",
            "Omg what a question! What if you were in an accident or the house caught on fire? Or someone breaks in? Babies have been kidnapped right from the home. Not worth it.",
            "Absolutely not wtf",
            "3 weeks old?! Nope.",
            "No no no no no. Jfc no",
            "No",
            "No one ever needs milk THIS bad",
            "Nope.",
            "Nope. Never.",
            "No. Effing. Way.",
            "Uh…. No. I don’t know why this is even a question.",
            "Personally. No. Not at all. I'll say people have done tons and survived, but for me, the fear is too extreme. Anything can happen.",
            "No.",
            "Why couldn't the person in question wait the 45 min or so for the baby to wake up and go with?",
            "No, never leave your baby, toddler, or kid for even 15 minutes.",
            "Absolutely not",
            "Absolutely not! You will go to jail if caught and or if something we're to happen while away",
            "Absolutely NEVER",
            "Absolutely not.",
            "Absolutely not. And I would question the judgement of anyone who says otherwise. I wouldn’t trust them alone with the baby",
            "NO!  You take the newborn with you or get delivery!  It takes less than 1 minute for a child do suffocate.",
            "I wouldn't even leave my 3 week old in the house to check the mail.",
            "100% no.",
            "Absolutely not.",
            "No.",
            "No.",
            "nope, no way.  getting milk is not an emergency, so there's no point taking a risk like this.",
            "If the judgement of this sub isn’t enough to know that the unequivocal answer is no… imagine the condemnation of the entire country if something happened and it hit the news that you ‘popped to the shop’…",
            "Absolutely not.",
            "No way! 3 weeks?!?! They can’t communicate.",
            "Its not ok.",
            "Da fuq\n\nNo.",
            "Why even ask this question? In many areas, it is illegal. You can get your child taken away. I think parenting classes are in order for you both.",
            "Wow, is this even a question? Absolutely not, what if the baby is puking joking on their puke? What if there's house fire? This would be child endangerment.",
            "Hells no.",
            "Never leave a baby in a home alone because you never know what will happen. Maybe a friend or door dash can drop the milk? Or go when baby wakes up? Assuming the baby is asleep, the milk isn't for the baby.",
            "No of course not. House fires occur",
            "No",
            "Absolutely not.",
            "Ummm....why are you asking? Like, OBVIOUSLY the answer is of course not. No, no no no.\n\n I just wanna know who was confused about that, and how this debate even came up.",
            "The farthest id go from the house would be to check the mail, not worth risking anything happening.",
            "wtf? No. It’s ok to stand outside the door of the house to get some fresh air while the baby sleeps but never ever leave that kid alone in a house while you’re away,",
            "Absolutely not!",
            "Noooo",
            "Is the child less than 8 years old*? Then they should never be left home alone.\n\n\n*That's an incredibly responsible 8 yo, my cutoff for normal kids is 10. 8 is just the hard limit regardless of maturity.",
            "You need to pose this scenario to your partner. On the off chance something an emergency happens to either your partner or the baby while they’re half a block away, the first thing that medics or authorities will want to know is why didn’t they bring the baby with them. And does your partner think that they’ll accept being told ‘the store is only half a block away’?",
            "Delivery apps?? Just order the milk.",
            "No",
            "Hell no.",
            "For milk? Really? \n\nIt is very likely nothing will happen, but I would not run the risk just for milk. \n\nEspecially in a world of grocery deliveries, where if milk was truly so important you could pay for someone to bring it to you.",
            "No. God no. Never, ever ever. Oh god this is an argument I wouldn’t wanna be involved in. Mostly cause I’d be thinking “who did I have a baby with”",
            "FUCK NO… fuck no.  Not at all.  Nope nope nope.  There’s no scenario where milk is that important.  Fuck no.",
            "Absolutely no and never.",
            "No, no, no.",
            "This should not even be a disagreement..",
            "No way. Risk is a combination of probability and severity. The probability of something happening is low, but the severity is astronomical. I see that scenario as a massive risk that is unnecessary.  I’d never take the chance either my kids.",
            "Hell fucking no. Never. Not even once. This is child neglect. It doesn't matter if the baby is a cute little potato at this age - that's completely unacceptable.",
            "Hell no. And this would be considered something along the lines of child endangerment, neglect, etc if the one of you who thinks this is just fine were to do this and get caught.",
            "Nope",
            "Absolutely not wtf how is this a discussion?",
            "Absolutely not, never in a million years!",
            "Definitely not at 3 weeks old.",
            "We had someone our family knows who did this. Except they went to go get drugs and the baby was 8 months old. They were gone 5 minutes. The baby died by suffocation while they were gone. They rightfully went to jail for child endangerment and negligent homicide.\n\nIt’s just not worth it. Nothing is worth it. The odds something happens are slim, but always possible. I hate leaving my 3-year-old inside unsupervised for more than a minute while I run out to the truck or run the trash out or something.",
            "What the fuck. Absolutely not.",
            "I had one million arguments like this with my partner when our kids were little. He was very “but what are the odds”— purely intellectual. None of his friends discuss this kind of thing, he doesn’t read parenting books or articles. \n\nIt has made me feel slightly crazy over the years to argue for car seats and bike helmets and not letting the toddlers play on the roof. So when the kids were little, he deferred almost 100% to my sense of safety. And now that they are older, I’m letting him do more safe-risky things with them on the condition that we must give a basic understanding of how to assess the risk and how to recover. I do see that it’s good for them NOW. Not back then — when it could’ve given them a false sense of safety in a dangerous situation.",
            "Nope. Feed the baby, change the baby, and then throw on a baby carrier.  Both baby and parent deserve some fresh air ❤️.  You just don't want to take the chance, and then the one time u leave the baby home and BAM! Something happens, and then you will live with that guilt forever. That's just how I think about it for me. :)",
            "Personally, I would never feel comfortable doing that. The stress I would feel when I'm gone would be too overpowering. Nothing would likely happen, but you never know and it would not be worth it. Better safe than sorry.",
            "No. Hell no.",
            "Absolutely not. 3 week olds wake up like every what? 2 hours give or take. Whatever you need can wait 2 hours and then take the baby with you. And if you that desperately need the item at that moment put the baby in the car seat and go.",
            "No, it’s not ok. It actually could even be considered child neglect. Would anything happen? Most likely not. BUT on the off chance that something did, no one would be there to help. It’s just not worth the risk. Get the milk later, door dash, or take baby with you!",
            "Fk no. wtf? a baby should never be left alone in any circumstance. the worst case you can leave a baby alone in the bassinet is to go to the bathroom. but leaving the house completely? are you mad?",
            "No, Instacart it",
            "Wth! If they think this is ok they should not bw a parent omggg",
            "Absolutely not worth it.\nBut I would expect the answer will vary in different cultures...",
            "No",
            "No. Never. A lot can happen in just minutes…fires, accidents, whatever. You can’t take that risk.",
            "There was a really good study about something similar. \n\nPretty interesting stuff. \n\nPeople said a child left alone for 20 minutes while their mom was out having an affair were in more danger than children left alone for 20 minutes because their mom was hit by a car. \n\nhttps://www.scientificamerican.com/article/when-can-you-leave-a-child-unattended/",
            "Never",
            "hell no wtf",
            "*^(NO.)*\n\nThe disturbing fact is that you even asking.",
            "Not the same AT ALL- but A lady in the town next to me went after her dog that got out in the country and was struck by an impaired driver and passed instantly. Her husband wasn’t home….. Cops/first responders found her 2 year old crying intently in her crib. Freak accident but it could happen to anyone “popping out real quick” and then the child is alone with no one coming to help",
            "Never",
            "Hell no. Not even slightly worth the risk",
            "No. Never",
            "Nope.",
            "Before I had a baby I thought, what would the big deal be if I left him in the car and ran in to pick up XYZ, mail from the post office, pizza, coffee, etc. \n\nThen I had a baby, and realized it’s not about him being in there, it’s what could happen to me rendering him stuck. \n\nI ran in groceries tonight in my rural driveway, left the windows down and door open and half way through my pee I started to panic what if a critter is wandering or what if my car randomly bursts into flames.",
            "NO ten thousand times...",
            "No",
            "No, and I’d be livid if my husband did this.",
            "Nope, it's not ok. Just make sure you don't need to run to the store.",
            "Obviously no, and since at least one of these patents is reckless enough to argue this point, let me ask, just in case: you aren’t giving your three week old cow’s milk, are you? \n\nIf so, do not do that. \n\nEver. \n\nThey need breast milk or baby formula only. \n\nNo water, no cow’s milk. \n\nI hope I don’t need to say that, but, just in case.",
            "Nope nope nope. Though I can see the justification, you only get one chance with babies, mess up and it's over and regret till your death",
            "Wait to go to the store when someone is able to watch the baby, have someone pull a favor and get you the milk, or have it delivered by a food delivery service. The what ifs just aren’t worth the risk.",
            "Hell to the no",
            "Nope anything can happen. Apparently most accidents happen within 5 miles of the home. Imagine if he got hit and had to get taken to the hospital, your baby would be home alone. An appliance can catch on fire, someone could break in, Etc. Not worth it.",
            "It's not ideal but I don't really have a problem with it",
            "This question  comes up six times a day",
            "Definitely not.",
            "No",
            "I said \"no\" the moment I read \"newborn who is sleeping\"... Nope nope nope nope nope.",
            "Absolutely not! You never ever leave a baby alone! It’s one thing to run to the bathroom while the baby is in the bassinet or crib but never by themselves in the home all together.\nShame on you for thinking that!",
            "It is absolutely not OK to leave a baby anywhere unattended.",
            "Uh no.",
            "Ah. No. Never leave them alone even for a moment. Milk can wait",
            "Hell no",
            "Never leave a baby alone. Dangerous. You’ll never know what’s going to happen.",
            "No!!",
            "No, it's not okay.  I know it's frustrating to not be able to get something quick and simple done, but it's not safe and it's not responsible.\n\nWhat if you got hit by a car? No one would know your baby was home alone? What if someone robbed the store and shot you? What if you tripped and hurt your ankle and couldn't walk? What if your house decided to go up in flames? What if you lost your keys on the walk? Yes, these things are very unlikely to happen....but they could. Is it worth it? Just wait until baby is awake and bring them in the stroller.",
            "Not ok.",
            "no  just no,,you either wait until baby is awake or  if you need milk there and then put baby in the car or (if you have one wait until your partner comes home.\n\n  \nsure nothing may happen but it could not a ris Id be willing to take for the sake of a few dollars",
            "I can't believe someone even asked this question.  WTF",
            "What the hell? No.",
            "No",
            " Never.  Never. Never.",
            "No",
            "No! Why can’t you just take the baby in a carrier or stroller? Or just don’t go at all? Wait for the other partner to return or have them get what you need.",
            " No.",
            "This question comes up a lot on Reddit. Leads me to believe many parents/caregivers do this but will not speak up and admit to it.",
            "You have one job. Just one. And that's keeping a baby alive. You can't possibly do that from a block away.",
            "Well first of all it’s illegal so that should settle the argument. \n\nSecondly, you shouldn’t because you can ask someone to bring you the milk or order it via Instacart or Amazon fresh. \n\nThird, if any single thing happens to you, the baby has nothing taking care of it. It is completely helpless.",
            "When my daughter was a month old, I walked to the convenience store, which was literally less than 200 steps from my apartment. I woke my husband up, let him know I was leaving, and locked the door behind me. Not thinking, left my phone. I was wearing flip-flops. It was raining. I'd walked this path hundreds of times.  I got distracted by some cars starting a race. Slipped in a puddle. Fell flat on my face, and my knee bent entirely the wrong way. I army crawled back to my apartment and went to the hospital and I was in a cast and then a walking boot for months, but I had nightmares for years of my daughter being alone and that happening. Absolutely not, no way in hell. Never ever okay.",
            "HELL NO!!!",
            "No. Either have the milk delivered or wait til the baby is awake and wear them to the store. At that age it’s so easy to just strap them into some sort of carrier and get stuff done.",
            "The baby could suffocate in the bassinet.",
            "I've read a lot of the comments and i agree that there is no valid reason to leave a baby at any amount of time unsupervised. It is not only because what if something happens to you and the baby is left alone. There is also what we call sudden infant death syndrome or SIDS. A baby less than one year old especially less than a month old could suddenly stop breathing for no apparent cause. It happens to perfectly healthy neonates. It could happen anytime. Even when the parents are only in the next room. That is why it is never advisable to leave a newborn out of your sight even for a few minutes. You always check breathing, color and temperature. Even if the baby is asleep. \n\nI think the question you should ask yourself is if you can live for a few hours without milk. If you can't, can you risk living forever without your baby? Which is your priority. It's not an argument of what might happen or how unlikely it could happen. It's if you can live with the consequences if it does.",
            "I don’t even like taking my trash out when my kid is asleep. My kid is school age and it still freaks me out literally anything can happen",
            "Nope",
            "No, for all of the obvious reasons.\n\nBut here's another less obvious one. At 3 weeks old they have no internal clock. They wake up every couple hours anyway. Wait till they wake up, give them a bottle or boob, then take them along. Until they're 4 months old or whenever it is that they start having fairly set daytime and nighttime patterns, just take them wherever you go, whenever it is. \n\nI took amazing midnight walks with my infant and had great late dinners at restaurants with the baby in a foldable bassinet right at the table. Amazing. Now he's almost 3 years old and I have to be home by 5:45 or the whole evening routine is shot 😫 But at 3 weeks? Just take them to the corner store at 2am if you want. They give no f's.",
            "Absolutely tf not",
            "I would just have the milk delivered.",
            "Never, not once. My son was not yet a month old and rolled on his back by accident -he kicked his leg, it pulled him to his back- and he threw up. He began to choke on his vomit and had no motor control to turn his head. I was laying on my bed trying to decide what needed to be done first while he was sleeping then It sounded like a small gurgle and I shot up and looked. Sure enough, he was squirming blueish and trying to fight for air. I turned him over and he was fine after a few scary breaths, but I think of that a lot. What if I went pee. What if I got a cup of coffee. Two or three minutes is all it takes. No baby should be left unattended that cannot even control their head or movement. None. Not in a car. Not in a bassinet, not in a car seat or even the floor. Not alone.",
            "Nope it is not ok anything can happen at any moment",
            "What if you have a baby monitor with the video linked to your phone?",
            "You would never be able to live with yourself if something happened (not just to baby but to you while you are out- even forgetting keys or something can become a nightmare)",
            "It's not even that hard to wait until baby wakes up and put it in a stroller??? Zero effort",
            "Whoever thought this was okay, and if they did it, should not be left alone with the child.",
            "Fun story, this was the exact moment that my mom left my dad. My bro was 2.5 asleep in his bed and I was like 8 months asleep in my crib. Dad said let’s go party down at the bar on the lake!  Mom said we’ve got kids here. Dad:they’re sleeping.",
            "I was an infant in 1993,my uncle was babysitting and left me in my crib while he went to the corner store. My mom passed him on her way home. She was livid. So by 90's baby caring standard that was frowned upon lmao",
            "With a baby or toddler, I can’t imagine going further away than a baby monitor can reach if there’s no one else there to leave them with.",
            "Nah. There's gotta be a teenager or neighbor who will run you some milk for a couple bucks tip.",
            "Not okay.  No.",
            "No.",
            "What the fck! Of course not. Do not let him supervise baby alone. God knows what other stupid sht he does and thinks is ok.",
            "Nope. Not at all. Take it with you. Or forget the milk. Never leave it alone!",
            "Why would someone sane do This?",
            "NOOOOOOOOOOOOOOOO.",
            "With so many grocery delivery services there is no need to even consider this as a hypothetical",
            "No",
            "What? No.",
            "No",
            "No?",
            "Just put the baby into the stroller and go get the milk. Problem solved. Now, an 18 month old during their afternoon nap? That’s another issue and is still a resounding NO. Ffs what does he think a babysitter/nanny/daycare/mothers helper is for?? Funsies??",
            "In this modern day of DoorDash and all sorts of delivery services, no!",
            "Let the cops find out for any reason, and you're facing a very serious charge in certain US states, as well as the danger aspect for the newborn (which was well spoken for already)",
            "No it is not safe or wise.",
            "Is your 3 week old able to call emergency services if there's a fire or an intruder? Is your 3 week old able to communicate clearly and confidently to firefighters to allow them to find the baby? If your answer to either of those questions is no, your husband is an idiot",
            "No no no no. 100% no",
            "My jaw is on the floor! I have 5 kids and never considered this. Not even my idiot ex would think this was ok lol",
            "Ask him another question, is it ok to leave a baby in the car while you pay for fuel? \nNope! Apart from the obvious, lots of stories of stolen cars turning into kidnapping. But you might want to find out what your husband would do.",
            "Of course no",
            "Big hell no from this dad. You just never know. I don't think babies need to have a camera pointing at them 24/7, but I would not leave the house if they were sleeping. I don't even do this with my 5 year old.",
            "Nope",
            "Never what the fuck",
            "I totally agree with you.\n\nBut, in his defence, if it’s his first child, it is possible that his fatherly protective paranoid instincts have not kicked in. I have seen this type of attitude change.",
            "Not ok period.",
            "A friend used to leave her toddler sleeping to pick up her older child from school. I was a bit alarmed, but she was from the Seychelles so maybe there were different cultural standards. As I understand it, here in Australia there are no hard and fast rules about child supervision.",
            "Nope...a baby should NEVER be left alone.",
            "Does the baby monitor reach? If the baby monitor works that distance I'd say it's OK. No clue about the distance here. Is het a 2 min trip? Or a 15 min trip?\nI sometimes threw out the trash when my baby was asleep. Was a 2 min trip within reach or monitor. I've never went to the store.",
            "This raises a question to me. At what age do you think It would be ok to leave the kid home alone for an hour for example? My daughter is 3 and cant imagine she being alone. But at 7? 9?",
            "NO",
            "My corner shop is closer to my baby’s cot than my laundry room was to my first baby’s cot but somehow I still couldn’t do this",
            "No never! Never leave a baby alone that young! That’s a great way to be charged with neglect. Order Instacart if you need something that badly or bring the child with you.",
            "If you have cam monitor and if baby doesn’t roll , work is just like 5mins. I think thats fine. Since its just nearby dad or mom can carry the baby with them instead of leaving them at home.",
            "Three WEEKS old? I am giving your partner some serious side eye, that is surprisingly irresponsible and lazy.",
            "Absolutely no. You have 2 options: go with the baby in the stroller/babywearing, but I didn't do this before she was 3 mo or wait for your partner/mother/other helper to get home to go outside, what ever the reason is.",
            "Why risk it..",
            "Any shit could happen inbetween that 5 minutes that you don't know, especially with one so young you don't know what they can or can't get upto yet, for instance my son when born , whilst still in the hospital after the birth was able to start rolling over already which was a surprise to both me and his mum. If anything can happen with kids and it only takes 5 seconds for shit to go tits up, imagine what could happen within 5 minutes, not trying ti scare, it's just reality, say for instance something DID happen, he wouldn't be able to live with himself for the rest of his life",
            "Nooooo",
            "No. Leaving the baby alone is never OK.",
            "NO",
            "I know someone who lost their baby because they left her sleeping in her crib to go to the corner to make a phone call and her ex-husband called Department of Child, Youth and Family services.",
            "The answer is just No.\n\nI mean in theory the likelihood of something severe happening in the 5-10min is low.\n( But not 0 )\n\nBaby can also wake up anytime and be left crying for 10 min.\n\nIt's just neglectful.",
            "In world of door dash, insta cart, Kroger delivery, etc etc why in earth would one ever risk harm to their infant & leave them?!\n\nMy kids are teens and man oh man if we had grocery delivery and pick up when they were little,  life would have been so much easier. \nOverall, there is no excuse to leave an infant unattended!!",
            "No, hell no. I’m glad this was hypothetical because I would go absolutely apeshit if I trusted my baby with someone and they left him alone.",
            "Happy it was resolved,  never leave a child alone till at least the age of 11 or 12.",
            "Why in the hell is this even a question, is every dad out there an effing moron?",
            "Nope. You can take the baby in a carrier, or have the food delivered or if you have sweet neighbours , can ask them to pick it up. I am sure you can think of hundred alternatives to leaving the baby alone.",
            "My baby monitor reaches pretty far, I’ll go to the range of the monitor, which includes my neighbors on either side of me (our houses are pretty small and close together). Down the block though? Nope.",
            "Never",
            "No, it's not ok!",
            "Hell no",
            "There should be an I.Q. test before leaving the hospital if you think this OK.",
            "The farthest I run is the 30 second walk to the bus stop to pick up my daughters off the bus. My rule is as long as the monitor stays connected.",
            "Nope,  I deliveroo my groceries",
            "JFC no!",
            "Absolutely not. I’d never leave my baby unattended while walking away from the property.\n\nStory time.\n\nWay before I ever got pregnant in our first apartment, one day my husband and our three roommates were hanging out. I was about 21 at the time. I left the room to go pee and suddenly saw my bedroom across the hall was filled with smoke. My dog was on the other side of the room terrified, I had to hold my breath and dive through to drag him out (so much smoke that it didn’t matter how tightly I closed my eyes or held my breath, I still ended up with smoke inhalation.)\n\nWe ran downstairs, woke up our other roommates, my husband called the fire department.\n\nTurns out the dumb fucks next door working on the attached apartment were doing some electrical work (unlicensed) and caused an electrical fire. Instead of, idk, putting it out or knocking on our door, *they sealed the dry wall thinking it would smother the flames and left it.*\n\nLuckily the majority of the damage was next door. The fire fighters and police really laid into the contractors, called their foreman and the landlord. They were all pissed and they got a fine.\n\nWe were all okay. My BIL roommate grabbed the cat and we ran out.\n\nOne second, we were all having a good time. The next our apartment was filled with smoke that you couldn’t even see through. Lots of stairs. Electrical fires are no joke and where this was 100% the fault of under the table unlicensed contractors electrical fires can happen anywhere at anytime. You never know who had their hands on your electrical before you bought your house, and even if you do, appliances become faulty, floods happen, etc etc.\n\nThis is the reason why neither my husband nor I will NEVER leave LO unattended. I don’t care if it’s just around the corner. I don’t care. Shit happens fast. It took 0 time for our apartment to be filled. Scary stuff.",
            "Nope just nope, not even IF the shop was right next door",
            "Oh my, just the thought of it gives me anxiety. Absolutely no way! \n\nI was once on our front verandah with my 2 year old and 65 year-old mum, and my newborn was inside on a playmat on the floor. A gust of wind blew the front door shut and LOCKED it, and we had no key. I went into complete panic mode, running around to neighbours to try and get a ladder and climb in over the back wall. Meanwhile my mum climbed up on a big wheelie bin and jumped the wall at the back. It's a 2 metre drop onto concrete so it's a miracle she didn't break a hip or something. The baby was fine, everyone was fine, but since then I've been so paranoid about it! Spare key hidden in the garden, never go out without a key in my pocket, etc etc. (It's so weird it happened in the first place, as I never lock the door when we go out. Still not sure if my mum did it or it was my baby brain...)",
            "No and I'll add this re: your update, he's post rationalizing now that he knows he's wrong.",
            "No. Think about it like this - if there were a fire or intruder could the baby adequately handle the situation? If not, then an adult presence is needed.",
            "100% NO!",
            "Not ok. Anyone who wants to hypothetical this is an ass who is either planning on doing it or who already did it.",
            "Happened in my city. A woman left several of her kids, i think she went to a bar down the street maybe? Wherever she webbed, she was nearby. House fire broke out and her kids died. My general rule is, if said person cannot rescue themselves from a fire, they should not be home alone. Ever. The end.",
            "If this is a heterosexual relationship, I can guess which party is which.",
            "Is this a joke?!",
            "Nope",
            "It might be okay in a practical sense but if you’re in the US it’s almost certainly illegal and if something did happen, even just that lead to authorities knowing baby was alone, not even something bad, CPS would get involved. I can’t even do this with my 5 year old to get his brother from daycare. In my state the law is 8 to be left alone and 12 to babysit another child (related or not).",
            "What sub gets tagged when posts like this come up? because there’s always a barrage of accounts defending parents leaving their babies home alone in the comments that don’t otherwise participate in parenting subs.",
            "It’s called Uber eats",
            "Think this was more common like 35+ years ago. \n\nMy partner always used to talk about how it would be ok to go to the pub and take the monitor as long as he had a mobile monitor. It was against my expressed wishes, but we split when my daughter was 2.5 and I sometimes wonder if he’s done/does do this. There are about 5 pubs within a couple mins walk of his house, one being right next door. I would absolutely destroy him if I ever found out.",
            "The last town I lived in, a mother did this. She went for cigarettes when her baby was asleep and  got hit by a truck. She woke up in the hospital 3 days later and the baby had been found and taken by CPS.",
            "Although, tiny ones do squeak a lot and suckle.",
            "well technically they didn’t specify if it was a human newborn",
            "Yes and you are also forgetting not just the baby unsupervised- you could have an accident at the shop , or forget your keys, or get held up, or someone collapses in front of you… all of these things could happen",
            "The odds are low, very low…..but never zero.",
            "When our kid was about 2-3 days old she started choking on spit or something one night. She turned purple. I picked her up and gave a heavy pat on her back. She started breathing again and I put her back in bed. I didn't really sleep for about 2 weeks. I started getting a bit delirious and finally let my wife and her mom take care of things so I could sleep for a couple days. I've never been so protective in my entire life.",
            "This is the best answer.",
            "I agree with this. What I find interesting is that I would guess that statistically something is more likely to happen to the baby, for example, going on a short car ride with you than in this situation. And yet we bring kids in cars all the time and think leaving them alone for five minutes is a borderline crime. I guess because in theory you can't control a car accident the way you can control not leaving them alone. But it's not clear to me the judgement in these comments is rational.",
            "This is your basic risk assessment applied to real life territory: Likelihood - Rare to Never, Severity- Catastrophic...",
            "Yes please tell us",
            "OP we want full story!!!",
            "Or even the baby is just crying and needs you? You absolutely cannot just leave a 3 week old crying its guts out alone unless you want to damage its brain and nervous system. They NEED you for comfort and regulation.",
            "Or just put the baby in a stroller and walk there, if you can't drive. In fact, in that situation, if the store is so close the stroller is probably easier. Weather permitting. Even if baby wakes up, the motion of the stroller usually puts them right back to sleep. Plus you get exercise.",
            "It's normal to talk about everything in a couple, even taboo topics. Now, this question is easy. The answer is no, end of the debate.",
            "To be fair leaving a 3 yo alone is a lot more dangerous than a 3 week old \n\n(I do not think it’s ok to do what OP asked, but if given the option of 3 yo vs 3 week old .. you know 😂)",
            "That's a bad comparison because a 3 year old is way more riskier to be left unsupervised in any condition really. They actively try to get into dangerous situations.\n\nA 3 week old when awaken will stay in their crib safe and sound, not being able to cause any harm to themselves.",
            "I work for child services and can confirm this would prompt an investigation 100%. How on earth is this not common sense?",
            "This should be higher up.",
            "Or, what if something happens to your partner while they are out at the store and your baby is then left alone for an indefinite amount of time? It’s neglect. Don’t leave that baby.",
            "Yep. I woke up in the middle of the night to my baby crying but it sounded weird. She had thrown up all over herself and it was in her nose and all over her face. She was like gasping for breath. And she wasn’t able to roll over yet. I was terrified I was crying.",
            "The same thing could happen while you’re doing chores around the house or having a shower. \n\nNot advocating for leaving babies home alone, but rather pointing out reality. You won’t know your baby is choking. It’s silent.",
            "I will piggy back off this and also say no!",
            "You would be surprised. I see this come up a lot in this group time to time. Like one lady’s husband left their sleeping newborn to pickup their toddler or something from daycare which was a 40 min round trip and was mad he got criticized for it. She only found out cause she came home early and the baby was awake and crying all alone. Like wtf.",
            "There are some awful AWFUL parents out there. Neglecting the child for an hour is child’s play (😭) for some of these assholes that decide to breed.",
            "Literally is illegal. Yep. And neglect and a CPS investigation level neglect too. Divorce if my spouse did this to add to it.",
            "Carrier, baby wrap/wear baby, stroller… no excuses for leaving a newborn home alone EVER!",
            "Babywearing is legit the answer. Arrive at store, strap them on, and they’ll be asleep in no time. And extremely safe",
            "Good point - if it’s so close it’s baby monitor range then maybe more ok",
            "This made me super curious. I didn't know the range of a baby monitor or the actual distance of a block (apparently both vary a lot) but a quick Google is making it seem like half a block is within range of most monitors. Doesn't change my answer but interesting anyway. Hmm.",
            "I agree, divorce worthy for me as well. Hard no.",
            "Sincere question/no shark: My MIL thinks it's unsafe for my 15 month old to be on a boat in a coast guard approved life vest with 4 adults and 2 other children, those two children having more or less grown up on said boat. Does that mean she wins just because she thinks it's unsafe?",
            "I assume the “no” side, her husband thought it was fine",
            "👏🏻 👏🏻 oof…",
            "What is being on FaceTime going to do if something happens?????",
            "Yeah as a country dweller most of my life this was my thought. In my family there’s 11 acres, 2 houses, and a barn and I know babies got left in cribs sleeping while adults tended to the property/animals. They always had their monitors with them but it would’ve been unrealistic to expect the farm to stop operating based on a kids nap schedule. I don’t think I’d go to the store and leave kiddo but some of these reactions/comments are a bit harsh when a simple no would’ve sufficed.",
            "It is absolutely not ok to leave the baby at home alone in any circumstance. Being away from the baby whilst in the same house is absolutely NOT the same as leaving to go the store. What if you get into an accident or fall ill whilst out of the house? No-one is going to know they need to go back to your house and look for a baby. \n\nIf you have to go to the store, you take the baby with you even if it makes waking them up or you wait until they’ve woken up. \n\nI seriously question your parenting skills if you even consider thinking this is appropriate in any situation.",
            "Kids are monitored by sight and sound. If you’re in the bathroom, you can still listen for crying or signs they need you.",
            "I'm with you. Half a block is five minutes max. It takes me longer than that to take out the garbage, and you know folks here would crucify a guy who doesn't do chores while taking care of a baby.\n\nTaking 15 minutes to get groceries or something? Nah, that crosses a line. That's the time frame most folks are talking about.",
            "That escalated quickly.",
            "Shells.",
            "Thank goodness the baby was found!",
            "Yep exactly my fear as well and my kid is 5. She would know to use the house phone to call her dad in case of an emergency but I’m still not leaving her home alone. An appliance or something could catch on fire as well anything could happen.",
            "Imagine if she decided to take the baby with her to get the cigarettes.",
            "Good thing she didn’t bring the baby! Possibly saved the baby’s life.",
            "Definitely believe you should take baby with you but imagine she did take LO with her and they were injured or worse. Her not taking them might’ve possibly saved their life.",
            "Honestly, it wouldn't be better if she wore a baby on her.",
            "😂😂",
            "Ok that made me lol",
            "Classic Reddit: \"what if my newborn was a baby hamster? I'm infertile and thus statement is so ableist.\"",
            "Yup",
            "Exactly. And it's never worth it.",
            "This happened to my 4 week old too. She had severe reflux and threw up whilst lying on her back (as per government guidelines) and the puke got in her nose. It’s lucky that I’d woken up to go to the bathroom and saw her flailing her arms as she struggled to breathe and couldn’t even cry. Thankfully my husband is trained in first aid. We nearly lost her that night. And she was in a Moses basket right next to my bed. What if I’d popped out to the shops?",
            "You're NV 5tha very simple fact. It *IS* a crime to leave a baby home alone.\n\nSo even ignore every other argument about safety or logic if you want. It's legitimately a crime, illegal to do. Lol. \n\n(Ps the baby's safety probably matters too. <I'm being silly, of course the baby safety matters> But even though a collision and injury are statistically more likely to happen in a car, multiple adults will intervene on the child's behalf in those situations. Allowing the babies to survive, compared to a less statistical accident occurring when leaving the baby home alone. No adults would be able to intervene. )",
            "You assume this is the baby that is injured. What if it is the dad in this example ? Making him not able to return home and letting the baby alone for more than 5 minutes?",
            "Yeah at least a 3 week old is contained to the crib! A 3yo could fairly easily burn the house down, run out the front door and get lost, or seriously injure or even kill themselves in even that short amount of time.\n\nBut don't leave babies home alone, either!! If the house burns down there's nobody to save them!",
            "Yes it should! My first thought on the question. \nIn my parenting experiences, babies always wake up when you least want them too. Like even when you need to just walk out on your back porch, baby knows! Lol \nAnd this is why we have baby monitors.",
            "But you wouldn't be able to perform CPR or call emergency services from the store, would you?",
            "A responsible parent would be within earshot of their baby or have a baby alarm, so they can act fast. You can’t do that from another location",
            "I will piggy back off of you and say, “What the fuck? No!”",
            "Omg what???",
            "WHAT!!!",
            "I am still vicariously traumatized from that one. The more details she gave,  the wilder the story got.",
            "And not app/wifi monitors with infinite distance. Closed radio monitors only.",
            "MIL’s opinion is irrelevant because she’s not the parent. My ex-MIL would do this all the time and I found ways around it. Example: “I need a bottle here or I’ll never watch the baby” (she habitually would take my stuff and I’d send more than enough bottles of breastmilk when she would watch my son when he was a baby so I don’t know what she was going on about). For safety’s sake, I had one can of formula at home for “just in case” but I was exclusively breastfeeding. She thought formula was essentially poison but she couldn’t argue that I did indeed meet her demand by sending her enough formula for a bottle “in case of emergency”. (In a disposable storage container, not a bottle I’d never see again) Never heard a thing about it after that.",
            "& if there’s a fire you stop pooping",
            "My monitor can reach half a block.",
            "The HORROR. We’re not going to the bar. My mailbox is half a block away; I can take the garbage out and check the mail and we’ll be alright.",
            "Yes, thankfully her emergency contact was her own parents and they alerted police about the baby. A tragic mess though, the whole thing.",
            "Imagine risking your baby's health and safety for _cigarettes_",
            "it’s kinda weird, but if she had brought the baby she probably would have saved herself. it would have taken her longer to get out the door & walk to the shop/ strap baby in the car. that’d mean the truck would be driving past before she even was on the street.",
            "Either way is a risk. Leaving the baby is a risk incase it rolls over, something catches fire, someone breaks in etc. While driving a car _at all_ is a risk.",
            "If the dad is injured enough that he can't get back home and can't tell anyone the baby is there, isn't it better that the baby isn't with him so whatever injured him also doesn't injure the baby?",
            "Mine, I swear would manage to burn the whole house down in her sleep while I just sat staring at her. But with little ones I’d be terrified of SIDS. I put my son in his bassinet at 3 months and fell asleep for five minutes and when I woke up he wasn’t breathing. We had to spend the week in the hospital he had choked on his spit up from eating an hour ago. I am so paranoid I could barely leave a room until he was older and  she was born.",
            "She might also have been more careful if the baby had been there. She was probably rushing to try and get back quickly to the baby, ironically.",
            "Naw, she would have been hot by the even bigger truck that was 5 minutes further down the road.",
            "100% agree life is just so unpredictable!",
            "Oh my goodness, I'm so sorry!!! So glad your little one turned out okay in the end, though that sounds utterly traumatizing. SIDS is terrifying"
        ]
    },
    "Horrible start to vacation": {
        "title": "Horrible start to vacation",
        "score": 39,
        "url": "https://www.reddit.com/r/Parenting/comments/1dlsr8v/horrible_start_to_vacation/",
        "content": "We are on our way to the beach, 14 hour drive. Drove 8 hours the first day and stopped at a hotel last night. \n\nWhat. A. Horrific. Experience. \n\nNeither child (4 & 2) slept more than maybe two hours. Normally our kids are great sleepers at home and they’re pretty flexible, easy kids. So I guess I just didn’t think sleeping in the hotel would be awful. \n\nWe got a room with two queen beds, figured we’d have one child in one bed with a parent, and the other bed with the other child. \n\nI got the 2 year old and he just giggled and laughed for hours, refused to sleep. Then spent the night rolling and rolling all over me trying to sleep. He has a big head that he hit me with numerous times. Everyone was up at about 4:30am crying for God knows what reason. Not sure how things went with the 4 year old who slept with my husband, but I don’t think it went great. \n\nNow my husband and I are going to spend the next several hours as we drive the second leg of our journey fighting and being pissy with each other because we’re beyond exhausted. \n\nSometimes I really fucking hate all of this. ",
        "num_comments": 46,
        "comments": [
            "r/parenting is protesting changes being made by Reddit to the API. Reddit has made it clear [they will](https://old.reddit.com/r/ModCoord/comments/14ahqjo/mods_will_be_removed_one_way_or_another_spez/) [replace moderators](https://www.reddit.com/r/ModSupport/comments/14a5lz5/mod_code_of_conduct_rule_4_2_and_subs_taken/jo9wdol/) if they remain private. Reddit has abandoned the users, the moderators, and countless people who support an ecosystem built on Reddit itself. \n\nPlease read [Call to action - renewed protests starting on July 1st](https://old.reddit.com/r/ModCoord/comments/14kn2fo/call_to_action_renewed_protests_starting_on_july/) and new posts at [r/ModCord](https://reddit.com/r/ModCoord/) or [r/Save3rdPartyApps](https://old.reddit.com/r/Save3rdPartyApps/) for up-to-date information.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Parenting) if you have any questions or concerns.*",
            "How many more hours of driving?\n\nYou drove too long where they didn’t spend any energy or slept too much. Consider driving during times they need to sleep so that they need to readjust less.  If this isn’t an option, the. Consider getting some things for them to play with while you sleep so that they burn energy that way and then sleep in the car.\n\nLastly, if it’s bed time but they have too much energy to fall asleep just compromise and do things to burn their energy.\n\nGood luck!!",
            "This is a tried and true rite of passage for vacationing with kids. I'm really sorry it is happening to you. I have little advice, but the one piece of advice I've got is don't fight with your husband. Pull him aside, have a good vent about the fact that this is some bullshit, and make it you two against the tyranny of these unreasonable children. You'll feel better if you're both in the same boat against unreasonable circumstances instead of against each other. It'll feel better than being pissy to one another.",
            "The beach you are going to must be amazing if you are driving that far to get to it!!! Good luck with the rest of the trip- you’ll have to stop at some scoped out locations (playgrounds, zoos etc. to get them tired out!)",
            "Is it normal for them to sleep in a hotel room? If this is a one off experience then the new environment is likely an issue. \n\nDid you stop for them to play during the 8 hours? I highly recommend integrating play stops during drives so they can feel somewhat of a normal day. \n\nTomorrow is a new day, wake up get their energy out, give them snacks and hit the road. Then stop again to felt them run around again! Good luck",
            "I don't see how 14 hour drive can be a positive experience no matter your age, but especially if you're a child.",
            "This is dramatic but on road trips, my husband and I often light-heartedly remind each other that WE are not the enemy, THEY are the enemy, and WE are a team. Best of luck.",
            "Next time try to drive the whole distance. Having crap sleep when you only have 4 more hours to go isn’t worth it. If you need to stop on the way, tire them out with the hotel pool. They have to get their energy out. My kids always slept badly the first night of a vacation but it improved after a day or two. Traveling with kids isn’t pretty but the important part is arriving to the destination. It may not be pretty getting there but you just need to arrive. The beach will be nice. Enjoy!",
            "We had an awful start to our beach vacation as well. You are not alone! ",
            "They didn’t expend physical energy during the day. We only have one kid though so we could take shifts sleeping but we have to take multiple breaks through the day to get my son to run around for 45 mins per break. Break is at 3 hours. And the hours drive becomes a 12 hour one.",
            "When we had small children, we would often drive through the night.  One parent would drive while the other slept. The kids got a pretty good nights sleep. When we arrived, we were still tired, but at least the kids weren’t sleep deprived.",
            "You don’t vacation with small children, you just parent in a different location. That being said, just focus on the new experience and fun they are having as stressful as it may be.",
            "I personally think it’s too long of a drive, they probably slept too much in the car and weren’t tired. I would suggest you fly next time.",
            "I'm really sorry this happened to you. My daughter learned to climb out of her pack n play at 22mo in a hotel room, so we brought her into bed with us, and she did the same thing as yours! I was her jungle gym until about 4am. Oh yeah, this was the night before my grandmother's funeral. It was awful.  \nI went out the next day and bought her a KidCo PeaPod tent. It's collapsible, so it travels really easily, and we zip her into it.  \nHoping you can salvage the beginning of your vacation and make the rest of it as lovely as possible. Hang in there!!",
            "There are various strategies. We have nobody to watch our kids while adults do solo vacation. So it’s all 5 of us together. Some parents leave at 8pm and drive through the night. That worked well one time for us. We also did two hotel rooms one night as one kid was being good but the other one wouldn’t sleep. So I toughed it out with the difficult kid. So my wife and other kid could sleep. Next time we are driving 14 hours all in same day. You lose a lot of time/energy unpacking for hotel. Flying is another option for folks. Also choose a closer vacation spot is another.",
            "Went on vacation to the Lake of the Ozarks last week. Long drive, 12.5 hours minimum. We took our 2 and 4 year olds. Same deal, great sleepers, super sweet and well behaved kids. \n\nFirst leg down, we got a hotel outside of St. Louis. No problems on the drive, but the hotel wasn’t great. Just kinda dirty and not well kept. \n\nAs I’m bringing stuff in from the truck, the 2 year old throws up on the floor in the hotel room. Linoleum floors, thankfully, though the smell didn’t fully come out. \n\nOvernight the 2 year old slept with mom, that largely went okay other than some giggling early on. (We have never allowed the children to sleep in our bed, outside of sickness or early morning rising)\n\nThe 4 year old slept with me, and she damn-near does cartwheels in her sleep. I got kicked in the balls, head butted in the nose (bloodied), and she kept trying to climb up on my pillow. \n\nBad night sleep, but whatever. Eat the shitty hotel breakfast and hit the road!\n\nAs we near the house rental, the terrain gets very hilly. I mean, like, roller coaster hilly. Big windy up and down roads. Our kids didn’t have motion sickness, until now. \n\nAfter they each threw up a couple of times, we found a pharmacy and got the kids some Dramamine. That helped a little at first, but both kids kept crying, and gagging, and dry-heaving. Just a rough time. Cleaned up on the road as best we could, but as we finally arrived to the house, we were absolutely DONE with that. \n\nVacation was nice, great family time. \n\nThe ride home, we give the kids the Dramamine before we hit the road. Our 2 year old made it just fine, but the 4 year old had a bad time. We decided to drive straight through on the ride home. The first third of the trip took forever. The remaining two thirds weren’t bad, but the trip home took soooo long, lol. \n\nA 12.5 hour car ride took us over 16 hours. Left at 5am in the Ozarks to arrive home at 10:30pm. \n\n\nWe did it. We don’t want to do it again anytime soon.",
            "My hubs and I took our 1 and 5 year old on a 14 hour car trip in March; every 3 hours (if they weren’t asleep) we’d stop, type in “children’s park near me” into google and BAM! We visited some really awesome neighborhood parks along the way. I packed snackle boxes for them and pulled them out at the park. We picnicked and they just loved it! Our favorite was one in Brentwood, TN! Absolutely stunning and had NO MULCH so our little one could crawl. \nIf you ask our 5 year old about vacation, she doesn’t mention the beach in Destin (which is where we went) but rather the cool parks and picnics along the way. We embraced that it was part of the vacation. The hotel we stopped at for the halfway point had a pool so we let them swim and play in the water. We just realized that traveling alone and wanting to get there when it was just us was feasible; now with two littles, we had to make it part of the vacation and it became a whole different mindset. Good luck!",
            "If it’s over a 5 hour drive we fly.",
            "Make the best of it! That’s all you can do. They are kids and are excited too! You’ll all sleep better tonight I’m sure",
            "Wow, I could have typed this 14 years ago!  I can promise that you will get through it, and when you look at the beach photos years later, you won’t think about the terrible drive.  But I agree regarding Air BnB vs hotel.  Message me if you need a recommendation!",
            "We visit my dad 1-2 times a year (Ohio to Florida, 13 hour drive minimum). We have done this since my oldest was one and my youngest was an infant. Now we have 3 kids- ages 5 years, 4 years, and 6 months. Despite what many of these comments say, you aren’t crazy for making this drive. It is hard, but that doesn’t mean you can’t vacation with kids. Our first trip was horrible, but the kids have gotten way better with practice (and so have we). We’ve learned how to make the drive easier with breaks and way too many snacks. And we’ve learned to exhaust the kids and have zero expectations for a typical bedtime. We’ve already made the trip once since the baby was born and are planning another trip in about a month!",
            "Fighting and being upset about it is a choice. I don’t understand why you have chosen to be pissy about it? You’ve never got a bad nights sleep before? You’re going to punish your husband for it now by starting fights for no reason? This all sounds like a personal problem. \n\nDon’t ruin the vacation for everyone else just because you had a bad nights sleep.",
            "On long drives with little kids, we used to stop at almost every rest stop and make the kids run around for 5-10 mins.",
            "We always get a hotel that will have a pool open and we always try to arrive around dinner time. Dinner and the pool always wear kids out.",
            "New environment - it’s normal! They’ll adjust the more you travel.",
            "We took our kids to Florida at 6 and 4. The ride down was great. The ride back our son woke up puking after maybe 3 hours of sleep. We just packed up and checked out. Bought a bucket and cloths from Walmart and hit the road. He finally got it all out by the time we hit our state border.",
            "Thank you for the acknowledgment. \n\nYou are an absolute gem. \n\nAnd most importantly you are not alone in this. My oldest eis now 5 and I just experienced 2 vacations that gave me joy. \n\n1 where I decided to to throw everything overboard and just do absolutely nothing. They didn’t have to do jack just be themselves. And well the other one I bribed them with Disney. \n\nSo try to stop a few times more often to do a walk. Or pick a flower. \n\nStay away from phones that show you picture perfect lies. And make sure you keep acknowledging you are tired. And feed your energy and find those markers. Yes your kids will scream but those in between moments when they are cute acknowledge those",
            "14 hour drive with a 2 & 4 year old??? Why didn’t you fly?",
            "Oh yeah no under 10yrs old is just a trip, not a vacation.",
            "I wish you would have asked for advice before this happened because people definitely would have warned you that sleep might be elusive to the kids. They just sat in a car all day and then were put in new, fun environment, and you guys expected them to sleep. Some kids do that but most kids are going to be excitable and giddy. Any time we've done a long drive like that (where we get a hotel halfway), we always make sure the hotel has a pool and make sure the kids get some exercise before settling into the room. You also want to make stops during the drive and get them moving. A good stretch, jog in place, potty breaks, some jumping jacks etc \n\nFor today, take a deep breath, get some caffeine for the adults, get to the beach, and enjoy the time with your family.",
            "I would've turned around and drove back today. You need to start smaller and work your way up.\n\nAlso, I'm in my 30s. I sleep absolutely *terribly* in hotel beds. It either requires being super physically exhausted (25k+ steps a day st Disney) or sleep aids. So they may not really get better at sleeping on hotels",
            "This is the start a memorable vacation! The most memorable aren’t the ones where everything goes off w/o a hitch, it’s always the ones that make you try a little harder. With that said, run a lil whiskey along the gums and your husband will be fine! \n\nI know it’s trying rn but you’ll forget all about it when the kids are running around laughing on the beach. Have fun.",
            "It comes with its own set of cons but I suggest driving through the night if either you or your husband are okay doing that. We drive from Indy to St. George Island, FL every year and it’s about the same length a drive as you’re describing. We give the kids some melatonin (the only time we ever give it to them), jump in the car and leave around 11p. I’m a night owl but try to get a few hours sleep before we go and I usually get us to about 4-5a. My wife, who’s an early bird takes over and gets us to breakfast around 8a then we’ve got a 4-5 hour drive with the kids awake. Sometimes we’ll stop for lunch, or just power through and get to the beach and grab some sandwiches there, crack some beers and wait on the Airbnb to open up.",
            "this is why I never get hotels with kids… air bnb or BUST. We did a hotel ONCE and that was enough… never again 🥲🥲🥲\n\nyou’ll get through this!! Good luck!!",
            "I'm sorry, that is so hard!! Hotel sleep can be hard, but a few things that help us are to leave early so you can stop early and let them play a lot at a pool or park before bedtime. Also, have a really loud sound machine with you to drown out the weird noises of hotels. Beyond that, even though the 2 is kind of young, talk in the car today about how your body feels different sometimes at a different place and how it may take longer to fall asleep so you all can try a strategy...like laying still and taking deep breaths in and out, to calm your bodies down. Sometimes just laying out the expectations that it's normal not to feel normal helps. ",
            "Take a quick shower, drink some coffee, give your husband a huge kiss, promise his some sexy time tonight when the kids are all worn out from the beach and shake it off. My wife tends to gets moody on the weekends and trips for some reason and I have to remind her we didn’t work all week just to get to the good part and not enjoy it. Enjoy your vacation!!!",
            "[removed]",
            "> Consider driving during times they need to sleep so that they need to readjust less. \n\nThis is what we always did. We do a week at the beach every year and it's about a 9 hour drive but can be longer with summer time traffic and having to make pit stops. In order to make it easier on us we scheduled the drive there to be a night time road trip. I'd spent the day outside swimming with the kids and doing little adventures to tire them out and my wife would get some sleep so she could be awake to drive. We'd put the kids in pajamas, load them up, and they'd eventually fall asleep during the drive and would normally wake up around the time we got to our destination.",
            "OP and husband become a team. Make the kids your enemies. Together you shall defeat their reign of terror. I love it.",
            "Seconded. \n\nWe went on our first overseas holiday with our kids and my brother- and sister-in-law and their kids last year and their schedules which are (for us) perfectly dialled-in went all to hell. \n\nI unfortunately let it really ruin the first few days of my holiday and it took Reddit dads to make me realise I was being a miserable wanker and that I just needed to make the best of it.",
            "My parents rent a beach house and invite the whole family.  They drive 9 hours and I think they’re nuts.  I find my 4.5 hour drive to be far too long, lol",
            "My husband and I remind each other of that almost every day hahah",
            "It's not a vacation if it's a 14 hour drive.",
            "Flying and renting a car with four people would be $1,200 plus and home door to hotel door require seven hours each way. Gas would be $300.\n\nHubs and I have done 14 hour drives with toddler children, grandchildren, and expect to do it with great grandchildren in the next few years. Can be difficult, but it's very rewarding. We learned to do it in one day.",
            "Obvious troll is obvious.",
            "Not a troll. It’s retarded to drive that long with kids.\n\nAlso, look at OPs post history. She bitches about everything."
        ]
    },
    "My mom did something she shouldn’t have and now I’m concerned about my son": {
        "title": "My mom did something she shouldn’t have and now I’m concerned about my son",
        "score": 632,
        "url": "https://www.reddit.com/r/Parenting/comments/1dla50r/my_mom_did_something_she_shouldnt_have_and_now_im/",
        "content": "My mom opened my son’s bank statement. He leaves them laying around and never looks at them because he does online banking. She knew what she was doing was wrong and regretted it immediately. She told me only because of her concern over his account. He had well over 20 grand at one time. He drives an old car that was a gift and lives in my house rent free as he does things to help out and only works part time due to his autism. The problem is that he only has about $2000 left. He’s buying p$rn online. I pacified her that his account wasn’t hacked but I am concerned about this. My question is how do I tell him to stop buying p$rn and get it free on various sites and stop wasting money without angering him or getting her into trouble. He’s an adult. If he wants to watch pr$n that’s his right. I just don’t want him to bankrupt himself doing it.",
        "num_comments": 158,
        "comments": [
            "r/parenting is protesting changes being made by Reddit to the API. Reddit has made it clear [they will](https://old.reddit.com/r/ModCoord/comments/14ahqjo/mods_will_be_removed_one_way_or_another_spez/) [replace moderators](https://www.reddit.com/r/ModSupport/comments/14a5lz5/mod_code_of_conduct_rule_4_2_and_subs_taken/jo9wdol/) if they remain private. Reddit has abandoned the users, the moderators, and countless people who support an ecosystem built on Reddit itself. \n\nPlease read [Call to action - renewed protests starting on July 1st](https://old.reddit.com/r/ModCoord/comments/14kn2fo/call_to_action_renewed_protests_starting_on_july/) and new posts at [r/ModCord](https://reddit.com/r/ModCoord/) or [r/Save3rdPartyApps](https://old.reddit.com/r/Save3rdPartyApps/) for up-to-date information.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Parenting) if you have any questions or concerns.*",
            "He spent 18 grand in porn??  This is more significant and if he can pay for porn he can assist with bills otherwise he’ll never become independent. Are you planning to support him his entire life? Whether he’s on the spectrum or not, he seems as though he can have some semblance of independence and it won’t happen by allowing him to work solely for porn.",
            "Do you know what exactly he’s paying for? If it’s things like cam girls / Only Fans he’s probably not going to want to switch just to free porn. These girls make them feel like they’re the only one they’re talking to and make them feel special. They know how to milk them for thousands of dollars. But when the money runs dry then the sexual content ends.",
            "If he’s spent 18 GRAND on porn, this is bigger than just telling him to find free porn. This is addiction level. He need real help from a trained professional.",
            "> He had well over 20 grand at one time. He drives an old car that was a gift and lives in my house rent free\n\nHonestly? Tell him that if he has thousands of dollars to throw to onlyfans, he's moving out.",
            "His problem runs deeper than not knowing free porn exists. You may need to consider how to approach the subject of therapy.",
            "Wow there is some bad advice here. Autistic people do not respond to and process things the way neurotypical people do. These comments telling you to let him do what he wants because heay an adult are incredibly misinformed and dangerous.\n\n\nMy autistic brother also had a costly porn and gaming addiction (and also still lives with our parents, coasting on their good will). Autistic men are particularly vulnerable to it. However much self control a regular man has, they have even less, through no fault of their own. Your son NEEDS therapy, and not just psychotherapy but also occupational therapy. You should probably install some sophisticated content-blocking and keystroke technology on his devices (and let him know about it). He literally can't stop this on his own. Privacy be damned at this point, this could ruin his life. The girls he's paying don't give a damn about him and they will bleed him dry. \n\n\nThis is what my parents had to resort to, and things have improved. My brother actually has had several girlfriends in the past year (after over a decade of just porn), and has joined some clubs. ",
            "18 grand on porn is like Grant Amato levels of crazy. He needs help with his addiction, not a tutorial on how to find free porn.",
            "Her opening the mail ISNT the problem.   It’s bad but not the problem at the moment. \n\nHim spending 90% of his savings on porn is the problem. \n\n1.  Take him to the bank and set up a separate account for his money.  Basically make sure his access to online porn spending is restricted.  Like a small money amount can go into a small “porn” account but the  majority should go into a non touchable account.  \n\n2. If he’s living at home stop or restrict this internet access, cut off his phone.  \n\n3.  Also charge him rent and set that money to one side.   \n\n\nIt’s time for a money reality check.",
            "If he's spending more then like $100 a month on it (which itself is insane), there are definitely some other issues at play. I do agree with others that it may be more personalized such as a '\"girlfriend\" like situation but he needs to know that he's being taken and this isn't real. Is he getting ready to die soon? (Cold/harsh perhaps but a legitimate question.)",
            "It's wild that he's clearly in the throes of a *raging* porn addiction and you're not worried, but ok.\n\nYou let your son give all his money to only fans so he can live rent free and jerk it.",
            "Well shit dude. Show him the internet and how to find free porn",
            "I think the better thing to do here is sit down and talk with him about his future plans. He’s an adult, and unless he is drastically disabled due to his autism, he needs to take steps in order to plan for his future. Are you going to help out financially? For how long? What’s the limit? Can he always live with you? What happens when you pass away? These are things he needs to plan for, financially and otherwise. Hopefully through this conversation he can open up to you, or you can offer to go over his finances with him. Conversely, you can make it a requirement to continue live with you rent-free. \n\nAlso, young guys need to know that porn is fake and those people are acting and life doesn’t work that way. Especially if he’s seeing cam girls/guys, they are doing a job and aren’t into him. Make sure his views on women especially are appropriate.",
            "Can he live independently?",
            "If he’s already buying it, he has fallen for the addiction. I read somewhere that people who buy them, they are are not just addicted to porn, but addicted to the idea of collecting them. \n\nSimply asking him won’t help and having a conversation about it may make him feel awkward and he may not even talk about it. If he has spent 20 grands on porn, he’s already neck deep in hot water. You may want to get him the professional help here.\n\nAlso you may want to watch this video interview of an Internet personality who was on the same boat as your son and he talks about  how he overcame it. \n\nhttps://m.youtube.com/watch?v=Y0zePr-5ilE",
            "Honestly? He needs to understand that the reason he lives with you is because you want to help him build a bright future of financial security. He is squandering this opportunity AND crippling his social life and marital prospects by paying these women to flirt with him.\n\n\nHe needs to cut this out. My husband's friend is a Cam Girl addict. It's depressing because he is buying \"affection\", not just sexual content. It is dehumanizing for all parties involved. He is 25 and lost his virginity to a thai hooker and my husband told him they can't be friends anymore for how he exploited that woman\n\n\nAs a recovering porn addict I have lost jobs over the time I have devoted to porn because I couldn't handle stress and wanted a distraction. \n\n\nMake it clear that you are not giving him a place to live to enable him. He can afford his own place easily. This might be the reality check he needs. ",
            "You could play dumb and just share this Wired article with a \"wow! This is wild\" comment? https://link.wired.com/public/35413286\n\nHe might be too deep in the delusion for it to hit immediately, or it could massively backfire and send his world crashing down, though. \n\nAnother option would be to start charging some prorated rent based on how much he does work for pay to get him used to adulting expenses (as opposed to these ADULT expenses). Right now, he's obviously had money to burn and he's been burning it. You can put the money to the side and save it up for a down payment when he needs a newer car, to buy furniture if/when he moves out, or spend it on real costs of him living at home like groceries.",
            "I see a lot of comments approaching this while ignoring this is an individual with a disability.   \n  \nHere’s my limited advice, coming from someone who used to work in the social work field with individuals who have disabilities. \n  \nI recommend trying to talk with him. Many of my clients understood more than they were given credit for so it could be worth a try. But you’re the only one who knows him and what he is capable of understanding. \n    \nI would mention how his mail was accidentally opened and you’re worried for his financial heath because of what you saw. That buying porn isn’t necessarily unhealthy, but the extreme way he’s purchasing/consuming it is. And that if he’s not capable of **at least** cutting back his spending on it then he needs to contribute more to the home and start paying rent. Maybe even have a rental agreement printed out ready to have him sign if he won’t, just to show you’re serious.   \n  \nAssuming the worst thing happens, he doesn’t stop, it continues, it escalates, I would consider talking with a lawyer about arranging some sort of protective arrangement or conservatorship.  \n  \nIf he’s spending so intensely that he’s unable to care for himself, provide for his basic needs like food, sanitation and shelter and won’t work to change it, then he may be in need of a temporary conservatorship. \n\n\n  \nYou mentioned that you were worried about angering him. Does he lash out physically?  \nI would have the conversation with multiple people present to help with safety, like dad or grandma. I know this can be an embarrassing discussion but you should put your safety first if it’s a concern.",
            "He might have an honest to God porn addiction and not realize it. You need to be tactful, and also admit that it was wrong of your mother to do what she did, but you do need to be honest. Do NOT demonize him, be judgmental, or threaten to make him homeless-an addiction involves complex brain chemistry changes that are almost impossible to overcome with sheer force of will alone. It will be doubly so for him, because his autism means his brain chemistry is already changed. Make it clear that you will not enable his addiction, but you will absolutely support him finding good help and getting through it. ",
            "If he’s wasted 18,000 dollars buying p$rn online then you need to do something about it.",
            "What's the end goal here? Your son is living at home and working part-time due to autism, so is the goal for him to save up money to live independently or is he going to live with you indefinitely? It sounds like you might need family therapy to have these discussions if you haven't already. \n\nOpening his bank statements behind his back makes it seem like there's resentment or concern over the living arrangements that's not being faced head-on. IMO either end goal it's appropriate to ask him to share his bank statements as a condition of living with you. If he's saving to leave home, he needs to show you that he's making progress. If he's living with you indefinitely, he can contribute to household costs if he has enough money to buy porn.\n\nYour family needs to decide (probably with a professional), if you need to police him as a disabled adult by controlling his finances and online access or if he's functional enough to be treated as an independent adult, in which case your control only extends to conditions for his temporary living situation and giving him advice, one adult to another.",
            "It’s going to be a hard lesson for him to learn. Let him learn it and don’t enable him when he runs out. \n\nI wouldn’t bring it up because you guys found out by snooping. I would maybe give him a book on financial literacy for his birthday.",
            "That kind of money on OF, he's not buying porn, he's spending it chatting. This kind of parasocial relationship is honestly going to be harder to deal with than a porn addiction. I get that autism makes it hard, but he needs a hobby that involves being around other people, in person. Ideally something that has a higher than average neurodivergent population. He have any interest in D&D or model trains?",
            "I once worked with a woman whose son had a pornography addiction. He also was diagnosed with autism. His addiction escalated and he became involved in child sexual abuse material. Law enforcement got involved and he went to prison. He is still in prison as I type this. I’m not sure exactly how long he has been there but I would guess somewhere around 8 years. I highly recommend you encourage him to seek support for his addiction to minimize the possibility of it escalating. If he refuses you need to cease enabling him. I also encourage you to research the harmful effects of pornography.",
            "He needs medical help but he has to agree to it (going by his own free will)",
            "Start charging rent, you can put it in a savings for him he can have back once you have him in therapy to deal with his addiction",
            "The solution isn't \"he needs to watch free porn\"\n\nThe solution imo is your son needs professional help because porn is addictive af and the only people paying $18k on porn are porn addicts. Good luck",
            "He might be giving it to people on only fans. This happens a lot.",
            "The way this question is asked shows that the priorities aren’t straight. Why focus on the mom opening the bank statements? Just get to the point. Your son is an addict, how to find help.",
            "Yeah it's probably time to start charging him rent and saving that for him when he's ready to move out on his own, as well as making him pay for his own utilities, and then whatever is left over, well, if he wants to pay for OF, that's his prerogative.",
            "He’s living at your house rent free, driving a car he didn’t buy.. so that he can afford to buy as much porn as he wants.. seems like a simple solution to me.",
            "Your son has a porn addiction and needs serious therapy immediately.",
            "I mean… it’s possible he’s spent the money on other shit? 20k can go quick for impulsive people",
            "Get him a csat!! HE HAS A PORN ADDICTION",
            "Where'd he get $20 grand?",
            "I think from now on he has to pay rent and contribute realistically to household expenses. Let him feel the reality of life and how most people can't afford to spend money like that.\n\nAlso, chores. Is he doing any? Laundry? Cleaning? Cooking? Groceries? He might have autism but that doesn't mean he's helpless, and clearly he has too much time on his hands. He needs to be way busier.\n\n Don't enable him and allow him to become a neckbeard, he's a grown man.",
            "There isn't anything inherently wrong paying for porn. Ethical porn costs money, but not 18k. \n\nThe issue is, like others have said, porn addiction and financial literacy.\n\nBoth of these involve you taking over and ensuring they have the tools and support necessary for their future.",
            "I’ve been trying to craft some sarcastic funny Reddit worthy comment, but decided to just be honest/blunt. Your kid has spent 18k on porn? This needs an intervention. Don’t feel bad about catching or invading privacy. This may be an addiction he needs people to get involved to help him out of it.  Autism might make understanding the consequences of it harder, I don’t know. \nBut let’s put it this way, it was meth or coke (health affects aside) even gambling and your son spent 18k what would you do differently, maybe approach it like that?\nMy opinion, and that’s all I have,  as a dad (of young kids that is) he needs a parent to help see the right/wrong or good/bad in this situation.",
            "I’m sure there are more experienced and qualified people on autism and sex issues than I am. In any case here is the view of someone on the spectrum who is also high libido.\n\n1. People on the spectrum don’t usually take orders well. Things need to make sense first.\n\n2. Sex is a very strong human need but it can be hard to achieve if social interaction is hard.\n\n3. Social isolation and lack of new sources of input might narrow interests too much.\n\n4. Sex/masturbation can be a form of physical activity. It would be relevant to verify if he has another.\n\n5. Is sex/p*rn a fixation or his current special interest or does he have another?\n\n6. Natural consequence are great lessons.\n\nAdvice: address the account balance in terms of figures, and avoid mentioning the object of spending.\nFocus on a long term journey to do things together that involve physical activity and new experiences. \nIt doesn’t have to be every day, not even every week, but getting new input in our minds can distract us quite a bit.\nFinally, find whatever realist reason, and ask him to start contributing to the household finances. Make it a calm and firm demand, dissociated from the conversation about the bank statement. Preferably, take this conversation prior to discussing the bank statements (if you really want to have it).",
            "18k spent on prn….wowza!!! He has an addiction, that is not healthy at all.",
            "lol. this has to be pure fiction and really crazy that i still can't find a root reply calling out the OP after 20+ posts.",
            "Maybe you can get him to understand by having him make some kind of trust account for himself or some kind of retirement savings account that he can’t easily get to. I get that he’s an adult but nobody needs $20,000 in a checking account. Since he has no obligations he should be stashing that cash for now.",
            "This would go beyond the financial concern for me, although spending 18 thousand dollars on porn is deeply concerning!!!\n\n\nHe's presumably paying for parasocial relationships on OnlyFans. He's deeply invested if he's spent this much money on it. What will he do if/when he finds out the women he's been paying don't have genuine affection or attraction to him? What if he found out they had a boyfriend? What if he found out where they lived? ",
            "He has a very serious problem and you need to lay it down. If he can spend that money then he can live alone and pay his own way.",
            "He should be saving that money not wasting it on porn  but it’s his money & he can do whatever he wants with it he’s grown good luck stay blessed 🙏🏾",
            "He’s definitely in addiction territory. There are free resources at twelve-step groups like Sex & Love Addicts Anonymous (SLAA) but addressing the underlying causes probably requires therapy. \n\nYou’re also subsidizing his lifestyle. You might consider how some of your actions might be enabling this (e.g., allowing him to live at home, rent free).",
            "I’d take him to a therapist",
            "It sounds like he already bankrupted himself. With autism, maybe you should discuss taking more control of finances to relieve a burden he might face in the future. He could have invested that $, but he shot it all down the toilet instead.",
            "Not being snarky , but did you set up a special needs trust? Is it too late to do that to meter out his money so he doesn’t blow it?",
            "He isn’t paying for porn, he is giving girls on only fans and cam girls money to pretend to like him, there is no amount of porn that cost that much without trying to impress some girl. Try to innocently catch him doing it and then have a conversation about it, if you don’t think you can try to plan a vacation with him and if he says he can’t afford it ask him why since your not sure what he spends his money on",
            "It sounds as if he is paying for Only Fans...\nSit with him and show him Redtube, Porhub, Bangbros... Do not only inform him that there are free opptions, help him to access these, and talk with him about safety.",
            "Just be an adult. This is some serious shit and needs a serious talk. Fuck the kids saying kick him out. Have the talk and be a parent.",
            "Obviously, you need to deal with your son, but I’d like to know what made your mother think she had any right to open your son’s mail. She only regrets it because of what she saw and the awkward position she put you in. My son is on the spectrum, too. He is not good about filing his mail. My mother would never think to invade his privacy in that way. She would not be welcome in my home if she did. Your son has a right to know what she did whether she likes it or not.",
            "Sometimes you can't mess about with 'how should I approach ot don't want to hurt his feelings'. This is one of those times. It's addictive behaviour, it's financial consequences, he might be being exploited online. You get in there and do an intervention. Have a plan. Ask him to block some sites, change his card, set a limit.",
            "Let him buy the porn, it pays other peoples bills 🤭",
            "[deleted]",
            "Why are you still letting him live at home? You’re the reason he’s like this. Smh.",
            "I don't know how you spend that much money on porn. I think your son got scammed on the Internet.",
            "You are subsidizing his life. You are paying his room and board. Since he doesn’t have to pay for those things, he’s saving that money to spend. In a way, he’s spending your money on porn.\n\nSo, OP, *you* spent $18,000 on porn. How do *you* feel about that?",
            "It's spelled porn. If you aren't comfortable writing the word porn, you should consider the unfortunate possibility that his mom would be a better choice to have this conversation.",
            "Porn addiction is real - no contest. But porn is also *terrible* quality- why bother? And also most of it is free. \n\nHeard from a friend. 😬",
            "Have you always excused poor behavior because of his autism? He blew through $18k that’s a huge problem when he doesn’t contribute to his life financially. You aren’t teaching him anything about finances. Why, because he’s autistic? Who cares that he looks at porn but that’s a crazy amount to spend when he can find it for free. I’m sure you could use $18k since you’re supporting him. Try just try to teach him about responsibilities",
            "Some piece of shit only fans girl is draining his bank account all while telling him she loves him",
            "Well from the other perspective... \n\nI think consuming 'free' porn is pretty unethical.\n\nThe actors in these films deserve to be at least paid for the risky job they do.",
            "Erryone gotta get paid. Even the p worker  .. but daaamn thays alot of money",
            "You don’t necessarily have to address the porn but you could tell him he’s going to start paying bills himself and leave him to manage where his porn habit fits into that.",
            "Tell him porn is actually free and readily available.",
            "He’s gotta learn his lesson the hard way….pun intended",
            "As a mom worried constantly about my child’s health, financial health etc I feel you. But this is non of your business unless you’re paying for it. I’m so sorry. I myself would probably not being able to let this slip.. I’d say something like grandma snooped and that’s awful and invasive but now I can’t unknow… “so ..have you considered free porn? “😂😂🤯🙏",
            "How do you know he spent it on porn? How long of a time are you taking about? People can spend thousands of dollars in a year on car costs even for an old car: gas, insurance and maintenance/repair. Then cell phone, eating out, buying sneakers. If he's working part time, figure out a budget with him. If he does have a budget which you monitor with his paycheck, then sorry for being out of line. But life is expensive. And even not paying rent, he might have a lot of expenses if he's not budgeting.",
            "Yeah, this is wild!  So many issues with this post…..",
            "Instead of living rent free, charge him rent and utilities and food and put it in an account to give back to him someday.",
            "Porn addiction is real and should be a concern. There's a lot going on here. ",
            "OP said he’s autistic. Which doesn’t mean eternal support but does mean “ordinary procedures might not apply”.",
            "That’s more than my salary for a year 🫠",
            "He's young, he might have fallen in love with some OnlyFans starlet. I've heard men go bankrupt paying online porn stars for extra attention. It's sad.",
            "It’s likely this, OP I would suggest sharing this article with your son from Wired Mag called [I Went Undercover as a Secret OnlyFans Chatter. It Wasn’t Pretty](https://www.wired.com/story/i-went-undercover-secret-onlyfans-chatter-wasnt-pretty/)\n\nEssentially, people believe they are chatting with OnlyFans girls when in reality they are chatting with some dude from India who has sales goals to extract a certain dollar amount from their target. It’s honestly really sad.\n\nEdit: off topic, but for those of you who enjoyed the article I originally found it on r/longreads It’s a great sub where people share long-form journalism articles. The community is small but active.",
            "Maybe OP should explain this to him because he seems to be unaware. And start charging rent and teaching him how to effectively budget because spending thousands on porn is insane for any period of time.",
            "There tapping him like a maple tree.",
            "Truth",
            "Right!?",
            "Autism is weird and this won't solve anything. He will continue to spend his only money on it until he has literally nothing, especially if confronted with the stress of finding a place to live and sudden bills. If he were neurotypical, I would agree, he could grow the F up. But in this case, he will most likely just double down because it's his only comfort.\n\n\nEdit to clarify: by comfort I mean coping mechanism/special interest, as others have put it. When stressed, those with autism tend to rely even more on these things. ",
            "Never straight cold, but working gradually and together with no judgement would be great. A lot of talking, finding out why, what it helps with, what it replaces, his emotions, thoughts, etc.\n\nCould be avoidance, coping, etc. Dopamine is strong.",
            "I agree. Spending that much on porn suggests a compulsion/addiction or at best an unhealthy habit. \n\nHe needs help to *do something else*, not get more of it for free.\n\nBesides which, if he's managing to pay for it, he already knows where to get it for free. Likely he wants more/harder stuff. Again problematic.",
            "She doesn't care",
            "I wish there was more (any?) support for parents of adult children with autism. You can't deal with them the same way you would with NT kids, and they have a whole set of different issues that someone without experience with autism cannot fathom. Having zero self-control is a biggie.",
            "Right! I don't think this parent even knows their kid's budget. Just saying he doesn't have a car payment or rent, and does have a part time job, is just way too little info to infer what he spends his money on. Life is expensive.",
            "Out of Curiousity, why did you ask that last question ?",
            "I personally think it's time for therapy. He is autistic, so he should be in therapy anyways, working towards his independence and to be able to get a full time job. Adding the irresponsible spending and a porn addiction, he should definitely see a therapist, adult or not.",
            "And what happens when the money runs out? This is bigger than money, IMO",
            "This is the comment. This is not normal. This is an addiction and a great pathway to a lifetime of problems. Needs professional help and needs it yesterday",
            "Yeah that’s seriously insane",
            "Yep",
            "That's not how it works. Men who pay a lot for porn are usually paying to have a somewhat personable experience (the illusion of it, at least) with a particular only fans model or cam girl. If it was just a couple of subscriptions, it wouldn't cost much more than Netflix. It's the involvement with one or several girls, buying them gifts, buying their time to talk to them, special private pictures, etc. These girls are very good at making a man feel special. Add the fact that he is autistic which is a social disorder, that makes people often have black and white thinking and be more gullible than others, it can be a huge problem to convince him he doesn't actually have a personal relationship with these girls. Hell, it's hard to convince even grown neurotypical men, lol Never mind the fact that a lot of times, especially if it's a bigger creator, these girls are not even actually talking to these guys, they pay a team to do all the interactions.\n\nThat or he has a very specific taste. Furries are well known to spend thousands of dollars on furry porn. Maybe he is into a certain character or God knows what.",
            "It is dehumanizing to all involved….  Porn is such a blight on society, and that’s not even saying anything about him living rent free and spending 18 thousand dollars on it",
            "\"might\"",
            "I agree with the sentiment, but not the conclusion. Only because my father ended up half a million dollars in debt and a lot of it was paying for p0rn. So some people never do learn the lesson.",
            "This isn't a financial literacy issue, it's a self control issue.",
            "He has a job and no expenses.",
            "Or into a sock…",
            "The emphasis should absolutely not be solely on financial literacy.. porn addiction is real and very serious. She should absolutely care about it and get him help bc that’s insane. Its no different than if he spent 18,000 on gambling. It’s an addiction and leads you down a dangerous path. Yeah obv financially but also mentally. He’s prob spending hours a day jacking off",
            "But she is paying for it. She is letting him live with her on the contingency that he is building a good life for himself. That plan is failing because he clearly has an addiction. Porn addiction is crippling. It sapps your dopamine and self worth. It turns women into sex objects. I am saying this as a WOMAN who watched porn for 2+ hours DAILY. The pursuit of a numb mind can destroy your life. \n\n\nI am not saying he needs to hit \"rock bottom\" but that he needs a reality check. ",
            "What?!?! He loves in her home and isn't supporting himself. Good grief!",
            "Cam girls/parasocial porn is generally not free.",
            "This is the answer. He needs both accountability AND help. ",
            "In this economy? In a parenting subreddit?! Are you in the US? Full time? Shit.\n\nBreathing costs more than 18k.",
            "Imagine if you invested in porn. To the moon baby!",
            "There was a contestant on Drag Race (a man) who was hired to chat as a woman for Only Fans. These women make so much money that they have employees.",
            "That was a great (but depressing) read - thanks for posting!",
            "what a read! thanks for sharing",
            "omg that article fucking broke me. Its so sad.",
            "I mean it depends on how high his needs are. If his spending is that compulsive then OP needs to get power of attorney/conservatorship so she can control his finances, or care for him financially for the rest of her life.",
            "That’s a pretty big leap? How do you know it’s his only comfort?",
            "Whether he has autism or not, saying this to someone who spent thousands of dollars on porn won't solve anything.  But it still needs to be said . . .",
            "Can't spend money on it if he's made to move out and pay his own rent, bills, groceries etc. Right now all of his money is disposable income from the sounds of it - he lives with mom rent free, she never mentioned him contributing to any household expenses, she gave him a car, and I wouldn't be surprised if she's also paying for his cell phone too.",
            "Sounds just like addiction regardless of autism. Addiction will absolutely do that",
            "Consuming porn isn't an activity that should be treated judgment-free. Loads of porn is full of non-consenual acts being performed on women, feature underage girls, contain rape, etc. Women and girls are exploited in its creation, and we should be stigmatizing the casual consumption of online porn.\n\nThe way you are describing it would be applicable of OP's son were like 13 years old and struggling with exposure to online porn. We're talking about her adult son who's living at home rent free spending thousands of dollars on the stuff.",
            "where did you get that from?",
            "She’s asking how to approach him without him getting angry or her mom getting in trouble for invading his privacy. Where in that did you get that she doesn’t care?",
            "Reaching much?",
            "Seriously. There seems to be a decent amount of info online, but I don't think I've ever seen an actual physical resource, and even the online info can be so contradictory and confusing. You almost have to get a doctoral degree in neurological disorders to have a clue. It's so sad how many parents out there are just flying blind in the dark. \n\n\nI think it doesn't help that those who have autistic children who are now adults were raising those children in a time when autism as a whole was so poorly understood, and still being denied as a legitimate disorder by a lot of professionals. Parents who have autistic young kids now have access to better information and resources so they'll be better prepared as those kids age, but my parents' generation is still so uneducated. Even my parents are. I was the one who had to encourage them to take a more hands-on approach with my brother's addictions, and explain to them why it was necessary. Before that, their thinking was just that because he was autistic, there was nothing to be done and he had to be left alone. ",
            "I don't know about specifically for parents of adult autistic people, but one of the major problems with autism resources in general is that there's such a range of understanding and misinformation and approaches and even the recognition of autistic people as potentially competent individuals that it's hard to know what organization to trust and which resources to work with.",
            "Oh 100% it's just... she typed all this out and doesn't see any of that, so I'm not sure what to say.",
            "This is almost guaranteed to be paying for parasocial relationships.\n\nThe less satisfying his real-world relationships are, the more tempting it's going to be to take the \"easy way\" and pay for \"friends\" and fake affection.\n\nHe doesn't need free porn, he needs activities he enjoys where he can have fulfilling interactions with other people.\n\nLook up HealthGamerGG on YouTube - he has a lot of good content going into the psychological mechanisms at play, potential downsides, and ideas for more healthy alternatives.",
            "I wonder if it could be related with his autism not helping in the love department. Idk, 20yo not able to date because of the worlds view of autistic people could be causing low self esteem. No GFs, internet is easy to find people like that, money to spare? \n\nHe could just be lonely.",
            "You never want to say for certain that something is an addiction with only a Reddit post. OP might be leaving details out for whatever reason.",
            "Half a mil!",
            "My father has ruined his and by proxy my mother’s life because he can’t control himself. I’m sorry you’ve had to deal with this too.",
            "yeah he needs to pay rent or move the fuck out.",
            "U can at least save a sock. But his money literally went down the drain lol",
            "That applies to everyone regardless of autism.",
            "No, I don’t live in the US, my brain just can’t comprehend how much money was spent on porn because it’s more than a year’s salary for me.\n\nI’m not a parent yet, I’m here to familiarize myself for when I decide it’s time to become one 🤓 and I live in a developing country in the Middle East, so my under 18 K salary lets me have all my basics and a bit extra that I get to save.\n\nI can’t imagine what I’d be able to do if I had more. This is an insane amount of money.",
            "🤓🤓🤓 keep talking.",
            "I originally found it on r/longreads It’s a great sub where people share long-form journalism articles. The community is small but active.",
            "I originally found it on r/longreads It’s a great sub where people share long-form journalism articles. The community is small but active.",
            "It’s so sad! I don’t blame the folks trying to make a living doing the job, because clearly they are also being exploited but it’s not pretty however you paint it. :(",
            "Because he spent 18 grand on it. My autistic teen would do the same with beyblades and not bat an eye about it. They like other things too, of course. But my sons big one is beyblades. This person's son's is porn apparently. \"Only comfort\" is a bad way to describe it but I get what they mean.",
            "Because that's one of the main symptoms of autism, very limited interests. If he spend nearly $20k on something, you can bet that's his \"special interest.\"",
            "I've answered this twice now just read the replies lol",
            "The part where she doesn't bat an eye at her freeloading son who wastes all his money on porn like an addict?",
            "Which part screams caring mom, the part where she allows a freeloader, the part where she doesn't care that he's not financially responsible, or the part where she doesn't think the amount of porn he watches is concerning?",
            "any amount of money spent on porn that's available for free by the millions is an addiction i fear.",
            "> I can’t imagine what I’d be able to do if I had more. This is an insane amount of money\n\nInvest it in porn!",
            "You’d be living in the slums at $18k USD in America. Best bet would be to live out of a motel, eat the cheapest fast food you can find, and don’t even think about getting insurance of any kind or driving a car. You could maybe make it a couple years with no other income.",
            "Wait till you hear about the prefab city built in Myanmar housing dorms for unwanted Chinese girls due to the one child policy doing this en mass",
            "Thanks for backing me up.\n\n\nSpeaking from personal experience in myself and my brother, we tend to gravitate toward things that have a set structure, because it's comforting in comparison to all the headache-inducing subtleties of real life. Or fantasy/sci-fi, because those worlds leave room for us to be ourselves without question. Porn is fantasy. ",
            "My sons is video games. He’s like an addict since he could talk",
            "> I am concerned about this \n\nMaybe work on your reading skills",
            "Not necessarily. On occasion, it's just like any other nonessential purchase-you do it because you want to, but you have enough restraint and understanding of things to not go overkill. It's like when someone gets some wine at a fancy dinner for celebrating an important wedding anniversary. It's just a nice treat, nothing more. However, the amounts that the son is spending definitely makes me lean more towards addiction. \n\n\nIf it is addiction, judgemental behavior will only make it worse. Don't enable, yes, but provide support on their recovery journey. And involve professionals, because they can look at the facts and guide both the son and OP in helping the former recover. ",
            "It’s insane that minimum wage is below that for a full timer honestly.",
            "\"Live our of a hotel\" why? Genuinely want to understand. Thanks",
            "Man, in these days all you’ll get is ramen and a cardboard box for 18k. It’s so sad.",
            "In the UK the national minimum wage which a lot of people earn works out to be  £20,893 a year. Crazy ey",
            "My sympathies. I've seen firsthand how damaging that can be. Godspeed. ",
            "Yes bc no one ever gives lip service. She's concerned about the money spent. Not the fact he's a loser and a raging porn addict. She point blank said porn is fine. Reading skills.",
            "can't believe you ended that first paragraph full circle.",
            "I said \"lean towards\" in my final sentence. That is not the same as a definitive yes."
        ]
    }
}