{
    "Weekly Questions Megathread - June 21 to June 27, 2024. Have a question from your game? Are you coming from Pathfinder 1E or D&D? Need to know where to start playing Pathfinder 2e? Ask your questions here, we're happy to help!": {
        "title": "Weekly Questions Megathread - June 21 to June 27, 2024. Have a question from your game? Are you coming from Pathfinder 1E or D&D? Need to know where to start playing Pathfinder 2e? Ask your questions here, we're happy to help!",
        "score": 10,
        "url": "https://www.reddit.com/r/Pathfinder2e/comments/1dkxucp/weekly_questions_megathread_june_21_to_june_27/",
        "content": "# Please ask your questions here!\n\n[**New to Pathfinder?** ***START HERE!***](https://paizo.com/pathfinder/getstarted)\n\nOfficial Links:\n\n* [**Paizo**](https://paizo.com/) \\- Main store to buy Pathfinder books and PDFs (clear your cache if you have performance issues)\n* [**Archives of Nethys**](https://2e.aonprd.com/) \\- Official system reference document. All rules are available for **FREE**\n   * [Player Guide](https://2e.aonprd.com/PlayersGuide.aspx)\n   * [GM Screen](https://2e.aonprd.com/GMScreen.aspx)\n* [**Pathfinder Nexus**](https://app.demiplane.com/nexus/pathfinder2e) \\-  Official digital toolset / **FREE** Game Compendium \n   * [Game Compendium](https://app.demiplane.com/nexus/pathfinder2e#game-compendium)\n   * [Pathfinder Primer](https://app.demiplane.com/nexus/pathfinder2e/sources/pathfinder-primer) \\- Digital Reader\n* [**Our Subreddit Wiki**](https://www.reddit.com/r/Pathfinder2e/wiki/index/) \\- A list of all the resources we know about\n\nUseful Links:\n\n* [**PF2 Tools**](http://pf2.tools/) \\- Community made resources\n* [**Pathfinder Infinite**](https://www.pathfinderinfinite.com/) \\- 3rd Party Publications for Pathfinder 2e\n* [**Pathbuilder**](https://pathbuilder2e.com/) \\- Web and Android based character creator\n* [**Wanderer's Guide**](https://wanderersguide.app/) \\- Web based character creator with 3rd party integration \n* [**Startplaying**](https://startplaying.games/search?gameSystems=pathfinder-2e) \\- Find open games of Pathfinder (payment may be required)\n* [WHAT'S THE DIFFERENCE between 5e and Pathfinder 2e?](https://www.reddit.com/r/Pathfinder2e/wiki/resources/how-is-pf2e-different-from-5e/)\n\n [Megathread archive](https://www.reddit.com/r/Pathfinder2e/search/?q=flair%3A%22megathread%22&sort=new&restrict_sr=on&t=all)",
        "num_comments": 57,
        "comments": [
            "Creating my first character today, a half-orc mage. Is it correct to really have 18 INT on lvl 1 or did I get it wrong? (Since 18 is the maximum amount of points).",
            "no spoilers please.\n\nMy party's going to be doing Abomination Vaults. we got mostly single damage stuff. A Thaumaturge for debuffing and single damage. A witch for healing and some rare group damage. An Armor Inventor for our tank.\n\nour last member's debating between a Rogue or a Wizard (or waiting fro Player Core 2 and maybe Investigator or Barbarian w/Barbarian the likelier).\n\nBut they want to know, if they went for heavy damage Rogue would it be 'fine' or is this AP really kind of needing AOE/group damage spells like from Psychics or Fireballs or storm Druids or such?\n\nAnd they also would like to know, considering the (brief) party description, which options might be the better choices?",
            "The answer is most likely no, but… does the frightened condition reduce DCs to Recall Knowledge on the frightened creature?",
            "Do the resitances from [Backfire Mantle](https://2e.aonprd.com/Equipment.aspx?ID=1040) and [Charhide Goblin](https://2e.aonprd.com/Heritages.aspx?ID=250&Redirected=1) stack? Since Backfire Mantle doesn't directly provide resistance to a damage type",
            "I'm pretty new to PF2e and I want to make a character who basically the Mystic Knight class from Dragon's Dogma. Imagine someone in armour with a tower shield in one hand and a magic staff in the other, a frontline arcane caster. What class would suit that best, if any?",
            "CAn hazards and traps function on multiple initiatives? Wondering if it's best to run a conveyor belt as \"Moves 5 spaces on its turn\" or to split up its initiative evenly and have each separate square movement happen on a different initiative count.",
            "Do I need to use another harm/heal slot to use second part of restorative strike?",
            "Can natural weapons like antlers be capped with metal tips, like silver or other materiel?",
            "Hey, I'm going to be playing in a Kingmaker game soon and I want to play a Thaumaturge with a hand crossbow and tome implement but right now I'm at a loss about what archetype I could take since we have free archetype rule turned on, any good suggestions?",
            "I got a question regarding \"poisoned\" arrows. One of my players is a ranger and we are running though the Abomination Vaults. They've fought the mitflits and the morlocks and while exploring I told them they found some corners piled with excrement because they're nasty creatures. \n\nHe then says he wants to dip the arrows in the poop to make a poisoned arrows. Logically, I have no issue with this. Mechanically, I'm not a fan and I said no. \n\nMy table argued for a bit that I should just HB something but i don't want to do that either. One of the major reasons I moved from 5e is because I hated having to juggle homebrews and precedents. \n\nI said, the book has stuff you can make, but I'm not going to let you make poisoned arrows for free or without a mechanical explanation. \n\nAnyone have any idea how to play around \"natural poisons\"",
            "I've been running the Kingmaker 2e campaign for quite some time and the party knows they are about to fight the >!giant owlbear that just rampaged through their capital.!< One of my players is playing a sorcerer swashbuckler mix that is focused on the Bon Mot ability which requires the creature understand what they are saying. He had asked me if I thought the spell translate would work on an owlbear and my immediate thought was no way, but I looked at the spell and I don't really see a reason why it would not, however it feels weird that it would work and even he agrees that it does not seem right, but I couldn't find anything on the web discussing this so I thought I would ask here.",
            "1) If a summoned creature can cast, say, an 8-hour buff on you, it won't go away when the summon ends, right?\n\n2) The Fey Dragonet is listed in [Summon Fey](https://2e.aonprd.com/Spells.aspx?ID=1700) despite being Uncommon, is that an oversight or am I missing something about its rarity.",
            "Why are spontaneous casters required to use up another known spell in their limited repetoire to up cast/heighten a spell?",
            "Is there a list of spells that work by default with Spellstrike post remaster? Like any official or unofficial master list.",
            "Can or should a pyrokineticist aura affect stealth?  The description says it \"can't damage anything or affect the environment around you\" but it's a 10-foot emanation with \"colorful wicks of flame\" listed as an example appearance.  I get that the auras are supposed to be mostly cosmetic, but it's straining disbelief to imagine our pyro sneaking easily through pitch-black caverns.\n\nIf there is a rule about this I'd love to know.  If not, would it be reasonable to have the aura to cast dim light (like a candle maybe?)",
            "How well does the game work when it's creature statblock vs creature statblock?\n\nI and my group want to take on the Tarrasque, but nobody wants to make a 20th-level character just for a one-shot battle. So, I got the idea of everyone choosing a CR20 creature from any of the Bestiaries (balor, pit fiends, and a bunch of ancient dragons, off the top of my head) and each player plays that as their character. \n\nI know some changes have to be made, like changing the winning condition to just bringing the Tarrasque to zero hp, but I was wondering how well could this idea work?",
            "Yep, +4 in remaster, 18(+4) with pre-remaster rules. These are mechanically equivalent.",
            "Points? What points? PF2 uses ability boosts. 18 is indeed the highest attribute score you can have at character creation.\n\nIf you want more detailed help, share more of your build.",
            ">(Since 18 is the maximum amount of points).\n\nTo be clear, what do you mean by this? 18 (+4 in the remaster) is the max at level 1, but not later on. With ability boosts (attribute boosts in the remaster), you can get up to 22 (+6), or 24 (+7) with an apex item.",
            "Yup! Anyone can be anything!\n\nThere's even rules saying that you can toss out an Ancestry's default ability boost array and just take 2 boosts wherever you want like a human, so if you want an unusually swole halfling you can get an 18 strength tower-shield mini-champion at level 1, a.k.a. \"mobile waist-high cover\".",
            "Avoiding spoilers beyond the most vague. The veiled text is more like \"You will encounter dangerous diseases and silver weapons will be rewarded\" rather than \"You will fight werekittens\".\n\n>!Multi-target damage is of limited use in AV. Damage against solo PL+2 and even PL+3 monsters is more important.!<",
            "So far, the Remaster updates have been pretty tame - if your 4th party member is interested in Sherlock or Barbo, you can use the premaster versions with 100% compatibility, no problem.\n\nRogue is the most powerful class in the game IMO. A-tier DPS with built-in debuffs and incredible skill cheese. Useful in almost every scenario.\n\nInvestigators somehow have even more skill emphasis than rogue, and are great for players that want to turn the out-of-combat segments into a puzzle game to maximize the uptime of their abilities. They swing once per round for big damage, but if they're doing their job, *they know when they'll crit* and that means they can activate limited resources like magic arrows to chunky-salsa a bad guy. I fucking love investigators.\n\nBarbie is an undeniable big goddamn problem. Everyone expects them to do good damage. The surprise is that they can also do incredible debuff shenanigans, and with the right build they can move and jump like a damn anime character. They'll want a solid healer in the party to assist them, though.",
            "No the DC is set by the DM based on the creature  \nFrightened does not come into play here",
            "> You also gain resistance to splash damage from your own alchemical items and those of your allies.\n\nThis is resistance. It won't stack with resistance from Charhide or any other source.",
            "Magus! Explicitly built for it, in fact!",
            "They're not designed to, but I don't see any reason why you couldn't do so. Give it set initiatives at 20, 15, 10, 5, and 1 (plus modifier) and call it good.",
            "The 'heal another person an equal amount' part? Nope, that's free!",
            "Not RAW. Not being able to use special materials is a disadvantage of natural weapons (monks receive Metal Strikes to mitigate that disadvantage).",
            "That will entirely depend on what kind of character you want. If you want to focus on the offensive the [Archer](https://2e.aonprd.com/Archetypes.aspx?ID=47) archetype could give you some cool options later on. But if you want to get some healing abilities then you have options like the [Blessed One](https://2e.aonprd.com/Archetypes.aspx?ID=51) and [Medic](https://2e.aonprd.com/Archetypes.aspx?ID=69). [Marshal](https://2e.aonprd.com/Archetypes.aspx?ID=66) archetype can give you some great supportive options as well with its great stances.",
            "There are dozens of possible archetypes that could complement a Thaumaturge. What sort of direction are you looking at? Knowledge? Healing magic? Spooky magic? Time magic? explodey elemental magic? *utility* elemental magic? Ranged combat? Healing? Social skills? Stealth? There are good crunchy mechanical archetypes that can make you better at the things you already do, or there are shenanigan archetypes that add completely new facets to your kit.",
            "Getting shot by a fesces-dipped arrow isn't going to be meaningfully different than being shot by a normal arrow until hours-to-days later and as such won't really matter within a given encounter. Venoms and poisons are special because they act \\*very\\* quickly, on the scale of seconds rather than the scale of days. I'd give the player the thumbs up after explaining this and pull out some appropriate afflictions they could be inflicting (most of which have a day or more onset time).",
            "That'd be filth fever disease, at best. If I were in your boots, I would also have said \"no\", but dynamically interacting with the environment to find and create new advantages is generally good, engaging behavior that should be encouraged!\n\nI personally really like the idea of creatively identifying useful pieces of the environment or fallen monsters and working to harvest them for extra loot - I like that idea so much, that I've completely replaced the treasure budget allotted to Earn Income with \"Harvest\" checks. When PCs identify an interesting monster/scenery they'd like to scrape for additional treasure, I give them a choice of two skill checks and say it'll take 10 minutes to harvest. They roll against a (level-appropriate DC)[https://2e.aonprd.com/Rules.aspx?ID=2629&Redirected=1] and gain crafting reagents roughly equal in value to an equal-level consumable item (or an item 1 level higher if they crit). During Daily Preparations, they can used harvested reagents to instantly craft items with a flavorful connection to the harvested reagents (so a Scroll of Stinking Cloud would be a good fit, but not a healing potion). I have a couple Crafting skill feats that add on to this system, making you better at harvesting, better at crafting specific families of items, or better at using those items you've crafted.\n\nThis offloads the burden of homebrew and treasure distribution from the GM to the player, and ensures that whatever they end up with is both balanced and will make them happy. Win-win for everyone. The PCs will generally end up with more net wealth... but that's OK. You can easily play PF2 at double or even *triple* recommended wealth by level, and it will remain a challenging tactical experience.",
            "> The target can understand the meaning of a single language it is hearing or reading when you Cast the Spell. This doesn't let it understand codes, language couched in metaphor, and the like (subject to GM discretion). If the target can hear multiple languages and knows that, it can choose which language to understand; otherwise, choose one of the languages randomly. (Heightened 3rd) The target can also speak the language.\n\nThe owlbear is never \"speaking owlbear\" at your sorcerer, so the spell wouldn't be able to grab onto anything to translate. It only works on Language-to-language interaction.\n\nIf your Sorcerer could activate a scroll of *Speak with Animals*, though... that'd be fair game.",
            "There's some discussion online about the pre-remaster version of the spell. [Here's an example.](https://www.reddit.com/r/Pathfinder2e/comments/16md1pu/using_comprehend_languages_offensively/)\n\nAs u/darthmarth28 pointed out, the owlbear would not be speaking a language so the sorcerer can't cast the spell on himself. The spell however has no mention of needing a willing target so it seems like it would work if it was cast on the owlbear. There is no mechanical reason why this wouldn't work, however this is an edge case that was likely not thought of by the developers. It would be reasonable if you were to rule that an owlbear is not intelligent enough to be affected by Bon Mot even if it can understand the language since the spell does not give it any extra intelligence and insults would likely make no sense to it.\n\nPersonally I'd allow it to work. It's a pretty funny and creative use of the spell and isn't particularly powerful. Especially since they need to both spend the actions in combat to cast the spell and succeed on their Bon Mot check.",
            "The list in aon is just a reference table of creatures. The book does not actually list those out. It seems like aon is including uncommon creatures for some reason, but thats just a quirk of the aon table I guess.",
            "You can avoid this with signature spells, which let you cast at any level. That's significant because a huge part of that balancing is built around you being extremely flexible with your core spell repertoire. For example, a Divine Spontaneous caster with Heal as their first level signature spell never needs to pick it up again, and can literally select any of their available remaining spellslots to cast it at max efficiency. \n\n  \nBut the idea is to balance out the spontaneous flexibility of, well, a spontaneous caster. Spontaneous casters can get a lot more efficiency out of their pool of spells, letting you maximize your usage by having more options on casting.",
            "Since there is no rule about it creating light or otherwise giving away your position, it doesn't unless the GM rules that it does. It would be very unfortunate for aerokineticists if their aura ruined stealth because their skill junction is for stealth and their aura needs to be active to get the benefit.\n\nI normally recommend that GMs treat an active aura like a wielded weapon, visible to anyone who's looking at you but not something that would stop you from hiding. Other rulings are reasonable though because it just isn't directly stated. If you want a way to imagine your pyrokineticist sneaking with their aura active it might make sense to have them tone down the flames as they sneak. Maybe they leave only floating motes of ash in the air around them or draw the flames into themself leaving a dull glow just barely visible.",
            "4 CR 20 creatures are going to have a much better shot at beating a Terrasque than 4 lvl 20 PCs. Especially since they know they’re gonna fight one and pick critters that can do it.\n\nThink of it. A single CR20 critter is not a fair fight for a lvl 20 character on their own. The PC is gonna lose that fight 9/10 unless they in turn get to know what they’re fighting ahead of time and gear up for it.\n\nIt’s also really easy to make lvl 20 characters with pathbuilder? Takes like half an hour if you don’t make a multi-archetype spellcaster.\n\nThat said! 4 CR 20 critters fighting the Tarrasque would likely be a much, much more fun beer & pretzels one shot than 4 lvl 20 pcs. So despite my mumbling above, I think it’s a great idea and you should give it a shot! Just make sure all players pick different critters. Maybe make a list in a google doc with hyperlinks to the archive of Nethys entry for them?",
            "Point buy exists as an alternate option.",
            "Haha thanks a bunch! :)",
            "Hey thanks for this detailed write up and summary! Now my damage player is still doing analysis paralysis but at least they took Wizard and Psychic off the list. ;)",
            " > can't identify a guy  \n > accidentally scare him with my demon mask, he freaks out  \n > \"oh hey Jeremy, I didn't recognize you when you weren't cowering!\"",
            "Yup. \n[Resistance](https://2e.aonprd.com/Rules.aspx?ID=346)\n> If you have more than one type of resistance that would apply to the same instance of damage, use only the highest applicable resistance value.\n\nWhile area and splash damage are not listed in the [Damage Types sidebar](https://2e.aonprd.com/Rules.aspx?ID=340), probably because they're a 'secondary' property (I don't know of anything that's *just* splash damage), they certainly act that way, notably seen in the usual [Swarm template weaknesses](https://2e.aonprd.com/Traits.aspx?ID=239).\n\nSimilarly, weaknesses don't stack either:\n> If more than one weakness would apply to the same instance of damage, use only the highest applicable weakness value.\n\nso, an [Amoeba Swarm](https://2e.aonprd.com/Monsters.aspx?ID=750) only applies one of \n\n> fire 3, splash damage 3\n\nto fire splash damage.",
            "Thank you very much. Could you point me towards some feats/options that would suit a tanky magus?",
            "Thank you!",
            "Does archer archetype work with the hand crossbow?",
            "I've told them they can buy poison but they don't want to spend money",
            "I was thinking maybe that creature had been \"permitted\" by some obscure ruling or article I didn't know about, but I guess not",
            "Thanks, that all makes sense.  I especially like the suppression effect idea while sneaking.  Maybe they just get a little smokey or cause atmospheric heat ripples while they're trying to suppress the aura.",
            "True. Never used it - or even looked at it - so I completely forgot about it. Thanks for the correction.",
            "You need to take Sparkling Targe hybrid study (subclass) and if you are using Free Archetype (ask your GM if your group is using it) you can also take Sentinel Archetype that will grant you proficiency in heavy armour and need tanky feats. \n\nBut be aware that magus has only 4 spell slots available starting from level 3 (only 2-3 slots before that), that are best used for utility and one, maybe two big damage spells. If you need more magic and less armor, you can forgo Sentinel and go for spellcasting archetypes like Wizard or Sorcerer.",
            "*cackles madly*\n\nMagus is just ONE path to build a tanky gish. If you're playing with Free Archetype, the horizons are nearly endless. A metal druid or a warpriest are other excellent vanilla-rules paths to this concept.\n\nI'd recommend mixing in a bit of Champion multiclass for the heavy armor aesthetic and the kickass low-level feats it gives access to. If you're new to Pathfinder and the world of Golarion, the deities of the setting are my favorite part of its world-building. They each have so much kickass personality and lore, to the point where they can dramatically change the feel of even a non-divine character.",
            "The dedication doesn't but the rest of the feats do since they only call for a ranged attack",
            "Drow Shootist archetype is built around the hand crossbow weapon, and contains some vital feats to help mitigate the reload difficulties. You'll have to ask your GM if you can take a flavor-agnostic version of it, because its Uncommon.",
            "Thank you very much, I'll give those a read through.",
            "It might be more efficient to spend a General Feat on armor proficiency instead of locking in Sentinel for three feats. At least at first. As long as Sentinel is taken by 11th level. And at that point you can retain armor proficiency into something else.",
            "Make sense. I just don't like this general feat when Fleet exists."
        ]
    },
    "Dr Nathan Barling from PalaeoGames – AMA": {
        "title": "Dr Nathan Barling from PalaeoGames – AMA",
        "score": 17,
        "url": "https://www.reddit.com/r/Pathfinder2e/comments/1dlu4dr/dr_nathan_barling_from_palaeogames_ama/",
        "content": "Hey everyone,\n\nI’m Dr Nathan Barling, palaeontologist with the University of Exeter (UK) and director of PalaeoGames Ltd. We’ve teamed up with seasoned Pathfinder 2E experts Linda Zayas-Palmer & Mark Seifter to bring our D&D 5e book “[Dr Dhrolin’s Dictionary of Dinosaurs](https://www.kickstarter.com/projects/palaeogames/pathfinder-second-ed-dr-dhrolins-dictionary-of-dinosaurs)” to Pathfinder Second Edition.\n\nThis is primarily a scientific outreach project and, as part of that, we’re doing a Reddit AMA. So, if you have any questions about who we are, what we’re doing, what’s in the book, our palaeontological research, or just any other questions – I’ll be here all weekend to answer them!\n\nThanks again for popping along!\n\nDr Barling\n\nhttps://preview.redd.it/upp8g5ev448d1.jpg?width=1754&format=pjpg&auto=webp&s=17c9e501ed6b85145f2261b6da831ceb72dff321",
        "num_comments": 16,
        "comments": [
            "I'm curious about doing something like this but with a different theme. What was the process with getting this started and how long did it take to get the first book published? Have you thought about doing your own system?",
            "Hi\n\nHow does taming work? Can I just do small dinosaurs or can it work for any kind?\n\nThanks!",
            "Obvious question: what is your favourite dinosaur (or indeed any animal from the eras you study)? Both IRL and what you have implemented mechanically.",
            "Is this supposed to cover the dinos of a particular age of the Mesozoic, or did your team decide to pick ones that hold weight within pop culture?",
            "What were the inspirations beyond the real-life animal for the playable ancestries? I remember reading on the discord that there was an idea of making the ankilier large but due to 5e limitations it was dropped, will they have a large heritage in Pathfinder 2e? Will the rules for howdahs appear in the Pathfinder 2e version? Finally, I want to say that I was very pleasantly surprised by the eight chapter of this book, I though of this book as purely a GM book before getting it but it has plenty of cool player options.",
            "Hi Dr. Barling! Two questions and a comment for you.\n\n\nFirst, how has your research journey influenced your RPG content? I understand most of your published work is on insects and fossil preservation. How does that shine through in a book about unfossilized dinosaurs?\n\n\nSecond, how do you approach making dinosaur stat blocks feel distinct from one another? Many a time I've wanted to incorporate an obscure species through homebrew, but can't figure out how it would be mechanically distinct from monster manual dinosaurs.\n\n\nLastly, I wanted to say the magic rules for Spinosaurus in the 5e version had me rolling on the bed laughing. You and your team do excellent work.",
            "Do you have any plans for further releases? Either new systems with the same content or entirely new books? I feel like you could make a really good system agnostic setting built around the races you created already. Thinking about how cold blooded creatures would need to design their cities, and what farming looks like with prehistoric creatures would give you a pretty unique world!",
            "From conception of the idea to the finished product, it took us 2 years. However, we were only able to achieve that goal because we had a hard deadline - my wife was pregnant and my daughter was on the way! It was exceptionally intensive work during this time, but the best advice I can give is to just get your ideas down on paper first, then really take your time researching how to launch, run, and fulfil a Kickstarter before announcing the project. I spent the better part of 9 months preparing and creating PalaeoGames Ltd. as a company, then a further 3 months of promoting the brand before launching the actual Kickstarter. So, there’s a lot to sort before you publicly ‘start’.\n\nIf you have people in your life that can provide guidance about any aspect of the project, that'll also be a major help. Designing rules, writing lore, illustrating characters are only a small part of a project like this – there’s a lot of business, social media management, and marketing to learn too.\n\nAlthough I could probably give designing a system a good go, I think that the risk vs amount of work is too great compared to working with already established systems.\n\nI hope that answers your questions.",
            "Thanks for the question! For 5E, the taming works by first subduing and containing the creature, then once per day a player/party can attempt a contested Animal Handling vs Survival check against that creature, so long as they have the required food. Once they succeed a number of times equal to the creatures CR or PB (whichever is higher), the creature is considered tamed. Failed checks subtract from this number. So, it can end up being quite a long process, but with a big payoff at the end.\n\nThis system won't really work in Pathfinder 2E for a number of reasons and Linda, Mark, and I have discussed a bit about the best approach to take. It's still a work in progress, but I believe that the current plan is to provide some balanced stat blocks for animal companions that are themed around certain dinosaur lineages, but aren't specific animals from the book. These will then be available for players to take in situations/builds that would allow them to have a companion, while preserving combat balance. That’s the plan on paper at least for now!",
            "Juravenator is my favourite dinosaur, mostly because of how beautiful its fossil is. I made sure that was in the book because I love it! In terms of mechanics, I really like our Bahariyan Polycotylid (there’s an interesting story behind the name) as it forces players to think outside of the box. It’s a marine reptile (Plesiosaur) rather than a dinosaur and has the ability to muddy water, rendering it opaque. Fighting something in water is one thing. Fighting it while you’re essentially blinded is another.",
            "We selected animals based on several criteria. The first and foremost for the majority of the book was picking animals that were already illustrated and that we could licence. The second was to match the holistic environments we wanted to portray, fleshing them out with new artwork. The third was to include a variety of the highly popular animals, as well as animals that most people don’t know about. We wanted people who were familiar with palaeontology to be able to open the book and still be surprised by our selections, but also those who were really keen to see their favourites (Spino, rex, Velociraptor etc.) not be disappointed.",
            "Firstly, thank you for the compliments! For the ancestries, we wanted to really steer clear of the cliché trope of Aztec-themed dinosaurfolk, so started by looking at cultures and ideas that were far away from that style. We settled on drawing inspiration from our local history (in SW England), as well as from other media. For example, the Manyhorn are partly (at least in the Guild & colour approach) inspired by the Guilds of Ravnica from MTG.\n\nIf I remember correctly, Linda did note the larger size of Ankliyer for PF2E – but I’ll double check later. That is something that I would like us to include in the PF2E version.\n\nThe plan for the howdahs is to include vehicle statistics for a howdah on a specific dinosaur type, along with their construction time. This should allow us to largely port those rules across.",
            "Haha, I’m glad to hear that you like Spino’s magical rules. We had a lot of fun hiding little jokes like that throughout the book, and thank you!\n\nMy research as a taphonomist is essentially that of a geochemist combined with a biochemist and sedimentologist. All palaeontology needs some degree of taphonomic interpretation, so that aspect of palaeontology is widely applicable. I do focus on insects, yes, (partly because they’re great for large-scale analyses and because they’re ecologically far more important than vertebrates) but my overall interest is in taphonomy itself. I suppose that doesn’t particularly carry through to the stat blocks themselves, but was incorporated into the other educational material in the book, like the intro sections and the holistic environments.\n\nFor making the dinosaur stat blocks feel distinct – we went back to the primary literature to find technical descriptions of these animals’ anatomy and draw inspiration from that. We then interpreted that within the context of TTRPGs. For example, an animal that’s skeleton was described as “robust” might gain resistance to bludgeoning damage. When we had several animals with similar descriptions (like the various sauropods all having columnar limbs) we tried to bring those themes into the stat blocks in several ways that varied in strength/impact. That allowed us to keep each animal feeling similar, but be mechanically different and distribute these abilities to animals that differed in power level too.",
            "We do indeed. Book 2 is already under way and will be expanding on the theme of the first book, but bring in animals from all of Earth’s past. We’ll squeeze in as much as we possibly can.\n\nWe have been knocking around the idea of a wider setting book, but I think that currently our work functions really well as a ‘splash book’, allowing GMs to pick and choose elements that they want to include in their existing worlds. Maybe we’ll one day combine everything into an established setting, but we want to grow our content pool a bit more first.",
            "Amazing, thank you ❤️",
            "Thanks very much\n\nLooking forward to the book"
        ]
    },
    "Announcing the development of a level 4-8 Dawnsbury Days expansion": {
        "title": "Announcing the development of a level 4-8 Dawnsbury Days expansion",
        "score": 201,
        "url": "https://www.reddit.com/r/Pathfinder2e/comments/1dlp3y7/announcing_the_development_of_a_level_48/",
        "content": "I started the development of an expansion for [Dawnsbury Days](https://store.steampowered.com/app/2693730/Dawnsbury_Days/), a PF2E video game, which expands the game by four more character levels, going up to character level 8.\n\nDawnsbury Days is a turn-based tactics RPG with a focus on tabletop fidelity and interesting combat encounters. Currently, it goes up to character level 4, but with this expansion, I hope that other classes will finally match or exceed the capability of Fighters, and allow for even more varied tactics. Already results from an early playtest are encouraging.\n\nHere's the current planned list of character features:\n\n* Extension of the class chassis of each of the 13 classes up to level 8; and giving modders the tools to expand modded classes similarly;\n* 60+ new class feats; 8 new ancestry feats; 60+ new spells to allow for customization at higher levels;\n* Rune subsystem for fundamental and weapon property runes;\n* User interface improvements to handle the increased complexity of both player characters and enemies;\n* A couple of free encounters at higher levels to allow players to test these new abilities.\n\nAlongside this, I am also working on a DLC expansion which would add additional encounter content for players to experience. This would almost certainly be in the form of an additional campaign, but it's in an earlier design stage and I'm not yet ready to announce information about this expansion.\n\nWith regards pricing, it's almost certain that such a DLC expansion would be paid, but that the new character content will be added to the base game as a free patch. That way, modders will not need to create separate packages for players with the DLC and without, and can assume that everyone has access to everything.\n\nFinally, today I have a preview of some of the new character content from the development build:\n\n[The sorcerer selects high-level spells](https://preview.redd.it/kqk7siklc28d1.png?width=2560&format=png&auto=webp&s=4b24c1b84c4eee73e9e5b5715975c0262e606753)\n\n[The kineticist chooses ability boosts. Characters, to me, feel more powerful, thanks to both greater numbers and more abilities, even against stronger enemies](https://preview.redd.it/arim0pwyc28d1.png?width=2560&format=png&auto=webp&s=0539cf89a8a5cc49daa1e39581b7d6cc79f3ef93)\n\n[A high-level battlefield. Note the multiple active zone effects, Circle of Protection buff, but also the fact that many heroes are drained and one is controlled via Dominate — some high-level battles can get more complex.](https://preview.redd.it/9120mx4od28d1.png?width=2560&format=png&auto=webp&s=f95cf99fbba0755c93d4fd5c6d036ce47283c4ef)\n\nThis remains a hobby project to be done in free time; and so I cannot estimate a release date yet.\n\nHowever, I can answer questions here and you can follow the development of the expansion [on Discord](https://discord.gg/MnPp8z2epk), [on Patreon](https://patreon.com/dawnsbury) or [on Steam](https://store.steampowered.com/app/2693730/Dawnsbury_Days/)!  \n\n\nEDIT: The title incorrectly says level 4-8 expansion. It should say \"level 5-8 expansion\". Character level 4 is already present in the game.",
        "num_comments": 16,
        "comments": [
            "This is exciting news! I'm guessing the success of DD has been enough to support you? Keep us posted!",
            "This is really cool.",
            "Very exciting, your game is fantastic. Putting my hand up that I'll buy a DLC regardless of the price.\n\nGetting a chance to push the tactical angle of PF2e is great, especially since I'm GM in most of my games and other players don't have that level of mechanical interest.",
            "HELL YEAH",
            "Oh man, I am HYPED! I got way more millage out of this game than I originally thought. Played through the campaign thrice (including the highest difficulty) and completed all side adventures, simply because as a forever GM I could finally enjoy \"the other side\" for once. :D\n\nAnd lately I'm itching for a caster only run!\n\nThank you for all the work you put in. Can't wait.",
            "Fantastic news! I'll be buying the DLC as soon as it's out.  \n\nTake your time with it, I hope it remains enjoyable for you :)",
            "nice, i enjoied the base game. \nAre you going to add the remaster rules in this time?",
            "Cool beans!",
            "That's awesome! I'll gladly pay a couple of bucks for a level 8 expansion.",
            "Very excited!! :D",
            "That's fantastic. I really like what you've done with this game and I'm excited to see more.\\\\",
            "Thank you!\n\nI am working on the expansion because it's been fun watching let's play playthroughs and play the mods, and because it's still fun to work on Dawnsbury Days and to play it and to develop it, so I still give it a lot of my free time. Personally, it also gave me something to be proud of as a completed bit of work, which is of great value to me, too.\n\nFinancially, no, it cannot cover my living expenses, but that's quite fine. It did earn enough to pay for all assets, art and acting, so I think it counts as a success.",
            "Thank you!\n\nDawnsbury Days makes some of the same streamlining that the remaster is making: it doesn't use spell components, it unifies spellcasting proficiency, it allows for a one-action swap. You can also choose to bring in additional remaster changes with community mods such as [Cleric Warmastered](https://steamcommunity.com/sharedfiles/filedetails/?id=3224448246), if you'd like to disconnect the divine font from Charisma, for example.\n\nWith regards to updating spells, feats and monsters to their new names and rules text, that option is unfortunately not legally open to me.",
            "Oh, that’s good to hear. \n\nI’m happy to pay, by the way. I don’t like giving my money to, say, Ubisoft, but with indie developers who sweat blood and tears for a project of passion? Anytime!",
            "Would you just need permission from Paizo?",
            "IANAL , but I think it's because the game is already under OGL. To use Remastered wording and terminology, it would have to be ORC, and you can't be under two licenses at once."
        ]
    },
    "Oh my God, XP actually works. My First Pf2e Session as GM Post-mortem": {
        "title": "Oh my God, XP actually works. My First Pf2e Session as GM Post-mortem",
        "score": 133,
        "url": "https://www.reddit.com/r/Pathfinder2e/comments/1dloioq/oh_my_god_xp_actually_works_my_first_pf2e_session/",
        "content": "So I finally managed to get my group scheduled and run my first pathfinder session. I'm hoping to get down all my thoughts and hopefully share good ideas with all of you. (for context I've run Call of Cthulhu, 5e and Fate Core as well)\n\nI admit that I'm probably being WAY too ambitious in using new (to me) mechanics in this campaign.  I'm doing hexploration, calendar time keeping, and perhaps my most dreaded mechanic, Experience Points instead of story leveling. \n\nI've never used 5e's XP system, because no one has. ever. In my view it seemed tedious to learn all the values characters level at, and write down ridiculous 5-digit numbers for every monster you throw at the party. Far better to let your party get excited when you decide to give them a level up. (and the less said about CR the better...)\n\nAt first I thought that Pf's XP budgets were a bit too small (80-100 for a moderate fight). it would take about 10 fights to level up at that rate. But then I looked at my notes and saw that my players had been doing a lot of other stuff in the role play scenes: chatted up the innkeeper, read a book looking for directions to the next location, searched the battleground after winning the fight to see if there were secrets or loot. All of that is the kind of play I want to reward: and now with this XP system, I can! \n\nUnlike D&D, which only awards XP from Combat (yes I checked), PF has XP amounts to award when the players \"accomplish\" something.  So as I was looking over my notes, I had a bunch of little things my players did worthy of an XP reward. It took the session from only 100 XP for the combat to 210 XP. That lines up almost perfectly with book's recommendation to have a level up every 4-5 sessions.  While doing this math, I discovered a joy in knowing that the player's actions are having a tangible effect on their progress, rather than me throwing a level up at them because it will be boring if they stayed this level any longer.\n\nSo what is your experience with using XP? If you have any tips or pitfalls I'd love to know more. \n\n",
        "num_comments": 45,
        "comments": [
            "I like the transparency of it. You know that 100 XP takes you 10 percent of the way to a level. It's easy to understand.\n\nI'd like to claim that my system for XP in my afterschool middle-school class inspired Paizo for PF2: [https://guildberkeley.wordpress.com/2013/09/16/important-new-rules-for-the-guild/](https://guildberkeley.wordpress.com/2013/09/16/important-new-rules-for-the-guild/)\n\n(They earned XP by participating, which let them level up their characters. They needed 100 XP to level up.)\n\nPaizo probably had no idea I did this, by the way lol",
            "I do like how much more clearly the idea of non-combat/danger XP rewards are spelled out in PF2. Most editions of D&D in the past have had some vague \"give some XP when they do a thing.\" kinda deal- and it was such a hassle to figure out an appropriate amount of XP for something.\n\nNow, you can easily just say \"this would be an appropriate challenge for a party of x level\" (which is a lot easier to do because of how clear cut the numbers are) and award xp based on x and the actual party level- plus the guidance on how much xp to give for accomplishing something aside from an encounter (combat or otherwise).\n\nAnd the flat xp system means it's a lot easier to say \"give them 50xp for accomplishing something that propels the story forward.\" vs. \"give them 5% of a level for accomplishing something that propels the story forward\" and then having to calculate what 5% of a level even IS at their current level.",
            "I like PF2e's handling of it, but it's actually not that different from D&D 5e's. In D&D 5e you absolutely _may_ award XP for stuff out of combat. See the Dungeon Master's Guide, \"Noncombat Challenges,\" p. 261.",
            "XP works great, it tells me how difficult an encounter will be, tells me the net value of loot and encounter should drop, and helps me plan out story arcs (typically 1 arc = 1 level for me).  \n  \nFriendly reminder that in encounters traps have a level/XP value as well, it can be fun to throw a few traps in the mix to spice things up!",
            "I also plan on using xp when we start our first pf2e campaign. \nThe beginner box have some good suggestions of when to give some small amount of non-combat xp. \n\n\nLike they might have successfully scaled down a wall, or sneaked past a monster. \nJust remember they cant double dip on xp, so if they avoid a fight in some way, they cant go back and kill it to earn xp again. \n\n\nJust non sure how much xp to give for different things yet",
            "Love seeing XP actually matter! It's so satisfying to track progress tangibly.",
            "Yup, I felt the same way. I [posted](https://new.reddit.com/r/Pathfinder2e/comments/17mk5hp/friendship_is_magic_a_postmortem_of_our_first/) [before](https://new.reddit.com/r/Pathfinder2e/comments/1alyxbq/first_10_sessions_in_pf2e_a_report_the_encounter/) about my experience switching from 5e, and I really liked the pace at which XP was awarded. For about 15 sessions I tried experimenting with giving it a bit more structure, and making XP acquisition player-facing, and was *very* pleasantly surprised with how it worked.\n\nThe premise for that chunk of sessions was the exploration of a port district of an abandoned city. I used a map from Borough Bound ([Yllmourne](https://new.reddit.com/r/dndmaps/comments/1b8spoc/yllmourne_the_pirate_town_all_5_maps_combined/), to be exact), divided it into neighborhoods, like a point-crawl, and populated it with threats and treasure appropriate for levels 3-6 (party started this adventure at 3, and leveled up to 4 about 10 sessions in). I decided to assign XP rewards to relevant activities, and make them known to the players beforehand, to see whether it would shape their behavior:\n\n* \\+10 XP was awarded for visiting a new neighborhood.\n* \\+10 XP was awarded for every survivor found and escorted to safety.\n* \\+10 XP was awarded for every McGuffin shard they found (5 in total - the villain faction was also racing them for it).\n* A few other +10 XP rewards were scattered around: finding crucial NPCs, uncovering information related to the main mystery, etc.\n* Combat encounters awarded regular XP.\n* A handful of quests were offered, usually rewarding +30 XP and a Hero Point. The party ended up finishing 3 of those.\n* Completion of the main objective awarded +80 XP and a Hero Point.\n\nThis resulted in 90-180 XP (avg. \\~120) per session, depending on how well the group did. About a quarter of the XP came from non-combat sources. Our sessions were 3h, and we averaged about 1 combat per session.\n\nSo, it was exactly the pace of progression we like (a level-up every 8-10 sessions), but it didn't feel like an XP conveyor belt; instead, it felt earned and self-directed.\n\nI often hear how PF2e isn't a good fit for sandbox campaigns; given the steep scaling, this might very well be the case for long-term progression, but for a mini-sandbox adventure that only spanned 2 character levels, it worked really well! The characters started out level 3, and were threatened by practically everything in it; after the first level-up, they felt a lot more comfortable pushing deeper into the district and away from their safehouse, and by the end they were almost level 5 and had acquired much of the level-appropriate equipment to feel like they've mastered the district.\n\nYou know what else it achieved? ***Making the game feel like Bloodborne.*** Our entire campaign premise was supposed to be \"urban eldritch horror\", yet in its 40 prior sessions in D&D 5e, I never managed to nail down that feeling.",
            "Just FYI, D&D also rewards story or accomplishment XP. It's largely up to DMs to administer it, although published adventures give amounts for certain accomplishments. It's also long been a rule of thumb that if players solve an encounter without combat that was designed to be a combat encounter, they gain the same XP as if they'd won the combat. I don't know that it's ever been a hard rule to give out-of-combat XP in D&D, it's always been encouraged and even roleplay XP has long been a thing. \n\nI rarely use XP anymore in any system, preferring milestone levelling (for simplicities sake and because it doesn't feel good for players when their characters are lower level than others), but I've used XP plenty in the past in any number of systems. I actually loved handing out non-combat XP. In general, I'd reward players with XP for good roleplay, or anything else that I thought made the game more fun for everyone. \n\nI also awarded extra XP to players playing suboptimal character builds for flavor purposes. It brings more flavor and variety to the game when players do that, which I think should be rewarded, and it also helps them not fall behind more optimized players since they level up faster.\n\nParticularly now, with games having new mechanics for DMs to reward players (inspiration in 5e, hero points in pf2e, as well as other options), and classes/builds being more balanced than in previous systems, as well as the fact that I largely play with the same group of people who all want to be there, so I don't have to incentivize showing up with XP, I don't see enough benefit to overcome the simplicity of milestone leveling anymore. That said, every situation is unique, and XP is a tool that DMs can use (or not use) to make the game better.\n\nA little more context: In previous editions, it was common to have players lose a level (or XP) when they died, so their new character was weaker. Lower level characters leveled up faster, so it wasn't a huge worry that they would fall too far behind, and it did make the game feel a bit more gritty. In my experience, players wouldn't do quite as much stupid shit, and tried a lot harder not to die under such a system. The popularity of roleplaying games has exploded in recent years, and as it's become a more casual way to have fun with friends, it doesn't feel like that kind of punishing mechanic vibes with the current player base.",
            "The XP Budgeting is what made it so difficult to want to learn 5e's system. I've heard of tales where One CR5 =\\= another CR5. One can TPK, the other is barely a sweat.\n\nPolitical stories can become an XP Gold Mine in a single, tense, session.\n\nDon't forget the Loot! The Loot table is a guide to make sure your players feel sufficiently powerful for their level/enjoy roleplaying to the fullest. Tons of items are \"social magic items\" that will boost your skills by +1.",
            "The encounter balance system is one of the main reasons why I completely switched my long running 5e game onto pf2. Not planning on looking back",
            "Did you say you gave your players xp for checking for loot after a fight?",
            "I appreciate how you made your numbers smaller and more elegant.   \nAlso your channel has been super useful in learning the system.",
            "There's no useful guidance on how much xp you can give out, though, so it's not actually that useful.\n\nThey tell you to base it off of CR, but if you want an interesting fight in 5e, you have to make the CR some multiple of Deadly, so does that mean you should always give Deadly amounts of XP since every non-combat challenge is going to be equivalent in difficulty to a Deadly combat or greater?  That doesn't make any sense, but it's the only guidance the rules give",
            ">Use the rules for building combat encounters in chapter 3 to gauge the difficulty of the challenge. Then award the characters XP as if it had been a combat encounter of the same difficulty, but only if the encounter involved a meaningful risk of failure.\n\nI hate CR, so this ain't gonna happen at my table lol.",
            "I did see that, Didn't use any traps this session because the current level ones didn't fit the theme.",
            "p57 of the GM core has a chart of how much XP to give in different circumstances:\n\nMinor accomplishment 10, moderate 30+hero point, major 80+hero point\n\nchart also has XP for hazards/Traps and Monsters by level. \n\nAlso, I recommend you should reward getting what you want out of the players, rather than find ways to \"deny XP farming\". I tend to focus on story and mystery in my plots, so I'm using the accomplishment XP awards when they find out stuff about worldbuilding or trying to research the situation they are in.",
            "Had this same convo with someone else: Non combat XP not in the 5e rule books as you describe it.",
            ">I've heard of tales where One CR5 =\\= another CR5. One can TPK, the other is barely a sweat.\n\nI mean PF2e isn't immune to that either, I know pre-remaster all dragon-like monsters you really had to add a +1 to their level when you were building the encounter because Paizo overtuned them (dunno if that's fixed now I haven't checked) and also a few other problem monsters here and there.",
            "ran a 5e campaign from level 1 to 11. Fights were always too easy or too long if I used an online CR calculator.",
            "> The XP Budgeting is what made it so difficult to want to learn 5e's system. \n\n  \nI usually stump for 5e, but, tbh, this is fairly accurate (at least as far as exp is concerned). To the point where I'm really not sure how exp is calculated, since it differs from prior systems and doesn't seem to have a scheme outside of a flat, incremental growth with a weird ass angle.\n\n  \nThat being said\n\n  \n> I've heard of tales where One CR5 == another CR5. One can TPK, the other is barely a sweat.\n\nBecause several creatures with this 'problem' are written with certain APs in mind. Some are written to be NPCs the party is not supposed to fight.\n\n  \nIs there a delineation between the two? Realistically, yes (printed in different books, monsters have descriptions that many glance over...mostly because they're sometimes a nothingburger), in reality (most info is collected all at once, context is lost when people ignore  or miss certain parts of the statblocks, etc), nope.\n\nEdit: formatting",
            "Pathfinder seems like the system built FOR Game master usability.",
            "Just give XPs by ear making sure to give about 1/4 of level each 1/4 of story beat.\n\nPeople love numbers going up, and your game is unaffected by bad rules.",
            "Who said anything about CR? If you want to do it RAW, just do this:\n- Decide whether the accomplishment was easy, medium, hard, or deadly. (I would rename the last column to \"very hard\" for noncombat situations.)\n- For each character, look up the amount of XP to award in the \"XP Threshold by Character Level\" table.\n- Add up all the XP and divide by the size of your party. That's how much to award each player.\n\nYou will see that noncombat goals achieved at the end of D&D Adventurer's League scenarios, for example, award XP that's broadly in line with that table – mostly easy or medium accomplishments, it seems from a cursory glance.\n\nYou can do it even simpler than that: just pick one character's level and just look up the XP to award each player based on that.\n\nIn any case, your original assertion – that noncombat XP isn't supported – was incorrect.",
            "Once you're comfortable it's very easy to change the levels of something since there are tables of expected values/ranges for traps/creatures.",
            "Also remember that everything in PF2e is on a “level-scale” — things up to 4 levels behind and 2-3 levels ahead are still viable, if not as/more dangerous",
            "Does GM Core = Gamemastery Guide ? Or \"GM Core\" is the title of the remastered version?\n\nI'm looking for the XP rules and the details on the main book and the Gamemastery guide are lacking content on the subject",
            "Dude, I don't know where you're getting your information, but it's on page 261 of the 5e DMG, starting with \"You decide whether to award experience to characters for overcoming challenges outside combat.\"",
            "I can guarantee you I've never used an NPC stat block to build a fight. Also the monster books and CR calculators I used didn't seem to know anything about this \"stealth NPC\" issue you speak of. why do you keep going to bat for a faulty system in a game you don't even play anymore?",
            "To be fair, you did write it more clearly than the DMG. \n\nWay more appealing than \"do this math problem based off text in a different chapter\".",
            "Because CR as a boogieman, when the reality is they've not read the text about it.\n\n  \n...to be fair, the text is a bit jank. But its a lot more consistent then people meme about.\n\n  \nThe point is: people don't read shit, then blame the system for their own lack of understanding. See also: the thread about Pathfinder solving casters (by using a system that was in 1e, 3.5e, etc).",
            "GM Core is the remastered version of the gamemastery chapters of the CRB and old gamemastery guide.",
            "Again, that page was cited to me already...\n\nyou're not even citing a game system, just a suggestion that a DM could add one. Your personal solutions to the missing system are not in my copy of the DMG. And I'm not going to use the CR dependent system the book gives bc CR never gave me balanced combat when I did use it.",
            "It begins again.\n\n> why do you keep going to bat for a faulty system in a game you don't even play anymore?\n\nBecause you don't need to lie about a system to upsell it.\n\n> I can guarantee you I've never used an NPC stat block to build a fight. Also the monster books and CR calculators I used didn't seem to know anything about this \"stealth NPC\" issue you speak of.\n\nBecause if you're building your fights with CR calculators only, you're not getting specific npcs or creatures built for specific fights. Since, as said, those are part of those adventures. A lot of them, like KBF, use the basic math in the dmg and shit.\n\n  \nA popular example of this is youtubers pointing out a CR 0 creature (from ToA I think) and comparing it to a Commoner.\n\n  \nOne is the bog standard creature for things, another is an npc meant to fight with the party.\n\n  \nAs a 2e equiv, it would be like mixing and matching your usual hazards and 2e with the hilariously lethal arrow cart in SoT.",
            "> The point is: people don't read shit, then blame the system for their own lack of understanding.\n\nSome of them even go so far as to write things like \"(yes I checked)\" when clearly they didn't, or at least not with much care.",
            "Thanks",
            ">Unlike D&D, which only awards XP from Combat (yes I checked)\n\nThis is the statement you wrote. I posted the section in the DMG where out-of-combat XP is awarded. There are numerous official published adventures that list out-of-combat XP for accomplishing certain goals. It's very clear that D&D absolutely does not ONLY award XP from combat. They even have rough guidelines for it. \n\nMy personal \"solutions\" were not meant to be considered solutions. You asked about peoples experience with XP, and asked for tips and pitfalls, so I was listing some things that I've done in previous games and systems. There's no right way to award XP. Instead, ask yourself what you're accomplishing when you award XP. If it's just to make sure the characters progress through the levels at the appropriate times, then you might as well not even use XP and just tell your players when to level up. I was just pointing out ways I've used XP to incentivize behavior that made the game more fun for everyone, talk about the effects potential XP penalties had on the game, etc. XP is by no means the only way to incentivize good play, so don't feel obligated to use it that way. You asked for tips and pitfalls, so I tried to give you some examples of to get you thinking about what might be accomplished by certain things, or what might not work for you. Like I said, awarding XP is a tool you can use to certain effects. It's up to you to decide what's right for your game and players. \n\nIt seems like you want a very well-defined ruleset for awarding out-of-combat XP, which 5e does not have. Having well-defined rules for everything has advantages and disadvantages. 5e came after 3.5 and PF1, which were very rules heavy systems, and the relatively rules-lite 5e exploded the popularity of tabletop roleplaying, and its flexibility was one of the big reasons. The 5e design philosophy was to be less cumbersome and rules-heavy, and leave it up to the DM to run the game how works best for them and their group. There's nothing wrong with wanting a well-defined ruleset, and I've noticed that most people that gravitate to PF2e prefer that. That doesn't mean there's anything wrong with the other way, they're just different philosophies that appeal to different people.",
            "I agree, I've had this discussion with people too. It's usually after I start talking about different ttrpg systems and the positives they have, I usually hear 'but you can homebrew that in dnd' xD",
            "1. I'm not lying, this has been my experience with using CR.\n\n2. I didn't use monsters from adventures, I used ones from monster manual or monsters of the multiverse.\n\n3. So your argument is, CR is opaque and varies in different books and modules, but bc readers expect monsters of same CR to be statistically equivalent (Bc the encounter building treats them that way) the readers are being unfair and lying instead of the CR system being flawed...?\n\nMind you, I never made this alleged \"mistake\" anyway. And I still had CR steer me into too easy and boring fights.",
            "Yep. It happens a lot here, and it gets my goat (i.e., I become the 'person defending 5e', a system I am actively not running anymore) because you don't need to mislead folk to get them to like Pf2e. You don't get people to like your hobby by shitting on theirs, you know?",
            "I sometimes feel because my first GMing was with Call of Cthulhu it gives me a different outlook on learning new systems. Ppl who learn D&D first can modify the one RPG system they know. Ppl who learn any other system first are \"forced\" to learn D&D, and realize it's not as difficult to learn a new system as one would think.",
            "1. And I'm not calling you a liar? Infact, I'm wondering why you're assuming I called you a liar to begin with, when my whole point is people don't read the material and then complain.\n\n2. And you're kinda illustrating my point...\n\n3. ...that people pull from multiple sources expecting every monster to be the same. Which isn't fair to anybody\n\nA lot of folk miss that CR, quite literally, is an equation meant to scale monsters to party level. And that the default party level is total character levels of the party / # of players. And that all monsters are built for a party of 4 (with some, but minimal magux items). Stretched over the course of 6-8 encounters per adventuring day.\n\nBecause most miss that, they see cr as more if a rule than what it is: a guideline. You're supposed to adjust it according to your party's overall strength.\n\nIs it esoteric and cumbersome? Yeah, tbh. Pf1e had similar rules but were more elegant in that everything was adjusted for creature type, rather than party strength (and both were better than wealth by level, which was also a guideline in pf1e and was optional, but was the rule in 3.5e and especially in 4e).\n\nPoint is: it works. Only creature that really fucks with it in the dmg is the beholder tbh (thing is built far above the cr it's listed at)",
            "TTRPG community read the rules challenge.\n\nThe 2e community has the benefit of having a much clearer ruleset than most, but still manage to fail the challenge with frustrating regularity.",
            "Yeah exactly. I noticed a lot of ppl shoe horn everything they want into DND and there's rpgs that are either better suited for that or other RPGs that already do what they wanted.",
            "CR is borked, and it's not the reader's fault for noticing. Stop pretending like defending CR will justify your sunk time with it.",
            "That is a problem but that is not what this is. They are just blatantly wrong. There is a recommendation to do what they said the DMG does not do. I don't even like 5e but that is because I knew all the rules like the back of my hand. I dislike it so much baldurs gate 3 is hard for me to play cause I hate the system."
        ]
    },
    "How to handle a defeatist player (possible kingmaker spoilers)": {
        "title": "How to handle a defeatist player (possible kingmaker spoilers)",
        "score": 48,
        "url": "https://www.reddit.com/r/Pathfinder2e/comments/1dloq8q/how_to_handle_a_defeatist_player_possible/",
        "content": "I'm running Kingmaker AP,  and the players just infiltrated the Fort with the Stag lord. \n\nOne of my players is playing a witch, and sent her familiar in to scout. At this point they had already seen how dangerous the stag lord was (he dealt a ton of damage to a player who tried to sneak a look in his room earlier by throwing an empty wine bottle at them) but still took the risk, only to roll a 1 on the familiars stealth check and end up with the familiar dying through a critical hit by the stag lords sword. \n\nMy players responded to this by freaking out in character and attacking the bandits, and we called it session there since it was late. \n\nThe problem is that this player is now complaining a bunch about how their familiar died, how they won't be useful since they took familiar master (free archetype) and they'll just be siting there waiting to cast a spell since they can't change them right away. I had warned them before, both through words and actions, that the stag lord was very dangerous, and the reason the fight had broken out anyway was because they chose to attack a bandit after the familiar died. \n\nCurrently they are making a backup character, insisting that their character is going to die because they don't have their familiar and complaining how they don't have an idea for the backup \n\nI'm hoping I could get some advice with how to deal with this player \n\n\nTLDR: player got their familiar killed by bad decisions, before starting a fight that the party had taken steps to avoid  and then got mad and is being disruptive about it. ",
        "num_comments": 27,
        "comments": [
            "Does he know a Witch gets a new familiar during daily preparations?",
            "Most of a Witch’s power still comes from just casting spells, the familiar is only a boost, regardless of them taking the Familiar Master Archetype. \n\nAs always the advice on how to deal with a player is to talk to them like an adult, tell them the issue you have with their behaviour and if they can’t respond maturely, they need to leave your table.",
            "I feel like the party should have regrouped, left, and tried again the next day. And I'm guessing you probably feel the same?\n\nIt's generally a good idea to let the party flee if that's what they want to do. If I were playing, that's what I would want to do.\n\nAnyway, any chance they started the fight because they were rattled after losing the familiar and just not thinking right?\n\nI guess what I'm thinking is that I would encourage them to flee (and let them) and hope that they wait till at least daily prep before trying again.\n\nAs for the player's attitude and maturity or whatever, I dunno. I guess it depends on how well you know them but maybe you can talk to them? Tell them that sometimes rolls go bad and there are consequences. It's okay to feel bad about losing a character but they can always make a new one, resurrection is a thing, etc. Maybe find out how they feel about character death and so on.\n\nThe game is pretty flexible and not everyone wants to play a game where they can easily lose. Maybe the party would enjoy the game more if the difficulty was lowered. You can definitely slap the weak trait on the monsters to make it easier on them if that's what they would prefer.",
            "Your familiar is going to die at some point in the campaign as a witch. That's just the way the cookie crumbles. That's why they respawn so fast.\n\nAnd your familiar dying doesn't matter much. Most of your power as a witch comes from your spells and hexes; your familiar is a nice added bonus but it's not necessary. \"Sitting there and casting spells\" is what you do 99% of the time anyway.\n\nJust tell them that.\n\nThey can always run away instead of fighting the Stag Lord.",
            "Sounds like they're more attached to their familiar than their character's agency.",
            "......the player had a roll go against them and then threw a tantrum.\n\nThe way you handle this is by not playing with children?\n\nTell him that if he cannot take the dice going against him with maturity and grace that perhaps he should go play a game that is more his speed.",
            "I mean my opinion is that players shouldn't go into a TTRPG session expecting to have a sandbox world where none of their actions have consequences.\nThey didn't listen when you told them the stag lord is dangerous. Well they fucked around and found out. Which happens in DnD. ",
            "Maybe a little bit of devil's advocate here, but has the player felt useful/powerful during the rest of the campaign?\n\nIf they haven't or gave signs they felt unsatisfied with their own performance at full strength then any extra handicap will feel uncalled for.\n\nHow much/how little has the player been doing in past fight and which portion of that was the familiar ability? The player might have already been in a negative state of mind for a while and this could have been a last drop rather than the entire situation.\n\nIn any way, you're asking the wrong persons here. The only thing to be found on reddit is validation, and you've already gotten plenty. Had your player came and asked about their side, they would have ALSO gotten a ton of validation. However you won't find any solution or understanding talking to us Internet strangers. Talk to your player honestly like an adult. If that's not an option, what are you doing playing with manchildren?\n\nThe only potential other person's to ask if you REALLY don't want to talk it out are the other members of your table who are more likely to know things you don't about the current situation.",
            "If you want your familiar to be safe, din't send your familiar alone to dangerous places, that's it.\n\nThe lack a familiar will be bad for the Witch, yes, but they are still a full caster, the familiar effect after casting hexes is the only loss (a relevant one, but not a \"I can't do anything\" one).",
            "Note that familiars are not \"battle buddies\" and have no attacks. They can give some minor assistance to their master, depending on what familiar powers they've chosen.\n\nAlso, witches are prepared spellcasters, so they can't change their spells before their next daily preparations anyway, at which time their familiar also mystically returns to them.\n\nLosing their familiar doesn't really change anything significant for a witch. A few powers they can't use until the next day. Sure, it's annoying, but not game-changing.\n\nHow to talk to this player? Just be reassuring, supportive and patiently explain that it's only a temporary setback.",
            ">TLDR: player got their familiar killed by bad decisions, before starting a fight that the party had taken steps to avoid and then got mad and is being disruptive about it. \n\nTell them to stop being such a baby or find a different table.\n\nA witches familiar respawns after a day and you dont lose anything from your familiar dying. All your spells are still prepared and as a witch you cant swap your spells mid day anyway?",
            "This post is labeled with the Advice flair, which means extra special attention is called to Rule #2. If this is a newcomer to the game, remember to be welcoming and kind. If this is someone with more experience but looking for advice on how to run their game, do your best to offer advice on what they are seeking.\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Pathfinder2e) if you have any questions or concerns.*",
            "If he’s just a random person off the internet try showing them this post. If that doesn’t work try posting in r/lfg. You’ll find a replacement in short order.",
            "From what it sounds like to me, its a bit more than the player just not wanting to deal with the consequences of their actions. Now I'm not sure of course, I can't read your player's minds, but to me it sounds like they didn't expect their cute animal buddy could just die like that, and it suddenly happening broke their (maybe more lighthearted) fantasy for their character, which is why they don't want to play that character anymore and therefore made them act irrationally to get them killed on purpose. \n\nThat is still not good way to deal with it of course, because that screws over the rest of the party, but maybe have a discussion about whether removing the ability for familiars to die (they may be captured or incapacitated, but never killed) might fix the problem. Considering they are complaining about not knowing a back-up character I think they were rather attached to their witch concept and their familiar dying just did not fit in with that, so you might even consider retconning the familiar to be captured instead of killed if it means they can keep their original character concept.",
            "I mean, that's a big OOOF right there. I get a witch that is that heavily tied to a familiar freaking out when losing the familiar is probably the appropriate in character response, but starting a major boss fight when down basically your main class and archetype mechanics sure was a *choice* to make.   \n  \nThere probably isn't going to be a great way to handle this. Either that character is effectively ineffective in a major boss fight (which win or lose is not going to be great for that player), or they magically sidestep a rule that is one of the balancing factors of their class which they doubled down on with their archetype. Both options have some feel bads from the players, just not the same ones, and the second option might teach the witch player the exact wrong lesson. This might be something where taking the issue to the entire table to brainstorm might be the correct choice, even if the answer they come to is \"maybe roll back that last part\".",
            "I would ask them if they're expecting you to retcon their own decision to send the familiar in, maybe if they say it out loud they'll realise how ridiculous that sounds.",
            "When my group did this fight, we TPK'ed the first time, just sorta walking into the place and expecting to take them on, GM let us have a redo with some plot reason >!Gatetower or something!< and the second time we slowly infiltrated and took stuff out one at a time.",
            "Why does the player think they won’t be able to change spells.  They’ll get a new familiar during daily prep which is when they would be able to get new spells. \n\nI suspect there is some rules confusion making this seem worse to the player than it is.",
            "Yep",
            "I disagree that losing their familiar isn't a significant change for the witch - depending on the patron, the familiar gains an ability, ranging from very powerful to kinda niche. But a resentment Witch who has prepared spells with the intention to extend their penalties with their familiar will be significantly affected by losing it.\n\nHence why all the more powerful familiar abilities require the familiar to be up close and in danger, while the less direct abilities tend to come with defensive options.",
            "A Witch's familiar is specifically designed to not have to worry about dying though. They come back the next day regardless of what happens to them.",
            "You're confused about how witches work.\n\nThe only thing a witch loses when their familiar dies is their Familiar of Restored Spirit (or whatever equivalent) power. It really doesn't affect them much at all. They can still cast spells and use hexes just fine.\n\nThem losing their familiar won't matter significantly.",
            "I did tell them this, it's more that they won't be able to change spells before the fight they started i guess",
            "Significantly affected, yes. But presumably the spells they’ve prepared are *good spells* already. The player is acting as if casting spells isn’t worthwhile without their familiar, and that is almost certainly untrue. It’s only true if they went out of their way to choose spells that are bad, hoping the familiar would make them kind of okay.",
            "I’m not aware of a mechanic to change spells mid-day. What am I missing?",
            "Debuffs are kinda moot against an high level solo boss without resentment to extend, they already get a significant chance to have no effect from a crit success on the save (usually about 15-25% on the medium save). Chances are any debuff spell prepared for a solo boss relies on the familiar to have a significant effect, while another type of witch would have probably skipped debuff altogether for more reliable buffs and \"no save\" effect like heroism and been less dependent on the familiar special ability.\n\nFor any normal character there is really like, 2 or 3 debuff that are still worth using on a boss and no guarantee those were the one prepared",
            "So I guess other casters just can’t debuff bosses? Yes, the familiar is a big buff, but every action you can rob or penalty you can impose on a boss is significant. Witches are not the only casters who can deal with bosses. The death of the familiar is significant, but the player is acting as if they can no longer do anything, and that’s just silly."
        ]
    }
}