{
    "Bi-Weekly Thread for general gaming discussion. Backlog, advice, recommendations, rants and more! New? Start here!": {
        "title": "Bi-Weekly Thread for general gaming discussion. Backlog, advice, recommendations, rants and more! New? Start here!",
        "score": 23,
        "url": "https://www.reddit.com/r/patientgamers/comments/1dl4qj5/biweekly_thread_for_general_gaming_discussion/",
        "content": "Welcome to the Bi-Weekly Thread!\n\nHere you can share anything that might not warrant a post of its own or might otherwise be against posting rules. Tell us what you're playing this week. Feel free to ask for recommendations, talk about your backlog, commiserate about your lost passion for games. Vent about bad games, gush about good games. You can even mention newer games if you like!\n\nThe no advertising rule is still in effect here. \n\nA reminder to please be kind to others. It's okay to disagree with people or have even have a bad hot take. It's not okay to be mean about it.",
        "num_comments": 83,
        "comments": [
            "Still in my latest New Vegas run. Not sure if I should make a post.",
            "After finishing **Half Life**, **Half Life 2** and **Half Life 2: Episode 1**, I'm playing **Half Life 2: Episode 2** now. Half Life 2 looks like a tech showcase, while Episode 1 and specially Episode 2 look like a proper game. Everything is the same, but better and more fleshed out. In Half Life 2 it feels like Valve spent too much time and resources trying to innovate and weren't able to put a game together. Episode 2 is almost embarrassing, because it shows how disjointed and bad Half Life 2 actually is. So yeah, I like episode 2. I wish it was even weirder. The telekinetic alien in the barn? I wanted more of that. I also grew fond of Alyx in Episode 2. Is she the proto AI companion? I can see Ellie and Elizabeth in her.\n\n\nI also started playing **Slay the Spire** again. I liked the game the first time, but got burned out on how difficult it is. Now I think it finally clicked for me and I'm addicted to it. I'm still bad though. lol \"Finished\" the game with the first three characters, but still haven't beat the heart.",
            "I wrapped up the story in **Alien: Isolation** and the last few achievements as well. Still a solid game after nearly 10 years. It's amazing that Creative Assembly was able to make such an incredible AAA survival horror game after making primarily strategy games for most of their history.\n\nI continued playing through **Walking Dead: Saints and Sinners** as well and I finished the story after leaving the game dormant for 2 years. I'm now enjoying the Aftershock DLC and grabbing achievements as well which are surprisingly fun as they force me to grab certain materials or find certain weapons to complete them.\n\nI also started playing **Marvel's Guardians of the Galaxy** yesterday and I'm shocked at how good this has been so far. I'm only two hours in but they're really nailing the tone, atmosphere and humor of the movies. Which is great because those films are probably my favorite from the MCU. I'm also glad because this game didn't go the route of Marvel's Avenger with the whole live service shit show it followed.",
            "I completed **Tunic** and **Sifu** this month. Both very satisfying games in very different ways. \n\n**Tunic** is the first game in a long time that made me actually break out the pen and paper, and I really appreciate it for that. The final puzzle is one of my favorite puzzles I have ever completed in a game. \n\nI also really like the boss fights. I know it’s combat is a bit divisive, especially given how much harder than the rest of the game they are, but I really enjoyed them, especially the final boss. \n\n**Sifu** on the other hand is just pure flow state combat. The closest a game has come to feeling like John Wick.\n\nThen, like half of everyone else, I started **Shadow of the Erdtree** last night. It’s bigger and harder than I expected, but that’s a plus for me.",
            "I'm trying to play Mass Effect and there are moments when I can see what's great about it, but as wide as the game world is, it's so shallow...! yes you can go to so many planets, but each has the same underground base, all pickups are just weapons, all the collectables feel are just a journal entry. I hope I can get to ME2, but that will probably mean I just run through the story stuff and skip the skippable stuff.",
            "I beat SMT IV earlier this month, I started on 02/25/2024 then ended on 06/06/2024. I enjoyed my run a lot overall. In the beginning it felt slow but glad I stuck with it. I am playing the game again, >!I believe this isn’t a spoiler but there is multiple endings so I did the Law route and now want to do Chaos through New Game Plus.!<\n\n>!I’ve finally made it out of Naraku again earlier today!<",
            "Playing Mega Man 3. Only Needle Man remains to be defeated. Pretty good game. The weaknesses are less broken, so the boss battles are still challenging while using them, which fixes what I think is the main problem of 1 and 2.",
            "I’m finishing up Prey for the first time, and it’s great!\n\nNow I’m looking for a palate cleanser — a really good monster tamer game. Anything I can play or emulate on a SteamDeck would be great. I have previously enjoyed Dragon Warrior Monsters but never played any of the sequels; similarly, I’ve played SMT and Persona games and found that they were a bit harder than I was looking for.",
            "Started a Wrath of the righteous playthrough (for the sixth time in four years I think) and finally reached act 3 for the first time! The game is fun albeit a bit clunky, I'll probably spend the next few weeks on this before finishing Banishers Ghost of New Eden.",
            "I've been watching a lot of Jacob Geller and am now on the hunt for artsy fartsy \"eat your vegetables\" games that treat video games as an art form first and a form of entertainment second. :THE LONGING: is without a doubt my favorite example of this. Do y'all have any recommendations?",
            "Playing through Divinity Original Sin 2 still.  Kinda took a break from it and started Metro Exodus.  It's bad ass so far.  It's probably because I suck, but every firefight seems super intense and I like the scarcity of ammo.  I also like how in the first open world area, you can kinda choose who to save, who to kill, and the world seems to react to your choices.  I wasn't expecting that at all.  Without spoilers, I've been pretty \"good\" so far.",
            "Tried out 2 games that I'll definitely be coming back to -\n\n**Cyberpunk 2077 (PS5)** First time I tried it last year I couldn't get into it much but this time I've really enjoyed it. It's really engrossing and immersive just driving around, doing small jobs etc. Got to the start of act II. \n\nOn one of the previous bi-weekly threads I was recommended **Remnant II** (which I played on PC through game pass) after beating Remnant: From the Ashes\n\nSo far (3-4 hours in) it is definitely better than Remnant I. The biggest improvement is the UI, the minimap now tells you which areas you haven't explored and which dungeons continue your main objective and which ones are just side dungeons which is very helpful in a game with a procedurally generated map. The weapon variety is better, the loot seems more unique. Playing on normal the bosses also seem to tougher but more interesting and unique. I've beaten Kaeula's Shadow, Mother Mind, and the Corrupter. I was quite low on health, maybe one more shot would kill me, which made the fights more satisfying.\n\nMy only dislike with the game is that there are these spiky ball enemies in the forest that were the bane of my existence. They were fast compared to other enemies, there were lots of them and they liked to spawn behind me as well.",
            "I've been rotating between three games: New Vegas, Into the Breach, and BSG Deadlock.\n\nI've only ever completed vanilla New Vegas so this time I'm hitting all the dlcs with a vanilla+ mod list, basically a slightly altered viva New Vegas plus mods that approximate Project Nevada without breaking the game. Having fun but consistently getting my ass kicked lol.\n\nLove the variety of play styles for Into the Breach . Every mech group plays radically different. Not really much to say about it otherwise, it's just something I pick up when I'm indecisive or want a more passive experience from the turn based play.\n\nBSG Deadlock is an interesting concept that kinda fails to deliver imo. I wish there was more mission variety requiring different fleet compositions. Also maybe a wider diversity in ship roles. ALSO having a true 3d space would make things so much more interesting. Pitch, roll, yaw. You could really make full use of weapon and armor placements. As it stands the maps orient all ships to have an up and down so you can really only control yaw plus the xyz plane. Ah well",
            "Enjoying Deus Ex: Mankind Divided so far.\n\nI upset >!Tars by stealing his credits & drinking his beer!<, so I reloaded my save. Considering a second playthrough :) As petty revenge, I decided to leave his stove on. Then his bodyguard sat on it. What a power move. That man must have augmented glutes and fireproof pants. \n\nI am both impressed and mildly disappointed. Oh well! It’s so nice to play an immersive sim, or any other game where I can mess around. Even if it doesn't result in pants on fire.",
            "Replayed **Gone Home**, since I have a computer again for the first time in a couple years, and I've been itching to replay it. It's a little clunkier to play than I remember, since stuff won't open fully if you stand too close, but \"too close\" still feels unusually far away. Otherwise, the setting is still fantastic, the story is still nice, and it's still one of the best games I've played at giving a sense of putting pieces together to solve a mystery.\n\nMost of my time, though, was spent continuing **Far Cry 6**. I've done a few missions for the Monteros and completed the Yaran story where you drive a tank modified to blast metal music into a town to blow up billboards. Unfortunately, I had too much fun with it and attracted too many enemies, who blew it up, so I mostly had to resort to molotovs and dynamite to destroy the billboards. On the less enjoyable side, I finally got my first base and found out that the game forces third-person in the base. It's not worth quitting over, but it's so bizarre and annoying. On a much more positive note, the game's been offering some fun, unscripted stuff. The highlight this week was small firefight turning into a massive battle in a burning forest, complete with a tank, a helicopter, and many rocket-wielding special forces. It ended when I just made a mad dash through the forest's charred remains, jumped off a cliff, parachuted down near a guerilla path, killed a couple random special forces, and then slipped into the path to get away.",
            "Finally bit the bullet and bought Granblue Fantasy Relink. It's fun but the combat isn't quite as deep as I was hoping. Seems like all the characters I've tried so far have an optimum rotation/combo of a couple buttons that you do when you aren't dodging. I'm only a few hours in and hoping the depth improves as I unlock skills and more characters. It's still fun though.",
            "Just started Marvel's Midnight Suns. Got it for free from Epic a few days ago.\n\nI've been eyeing this game for a while because of how good the reviews are, and so far, I like the combat.\n\nBut, there's one thing I dislike is how much TALKING there are and how annoying they are too.\n\nMaybe it's me because I just finished Divinity Original Sin 2 not so long ago, which also had a lot of talking, and I'm subconsciously tired hearing character talk. Or maybe it's just Marvel in general???\n\nAnyway, I'll probably try it again for a few more hours.",
            "I am playing Cyberpunk 2077. Liking the story and the atmosphere a lot. Very immersive. I’m a little disappointed in the open world; I just came off a playthrough of Fallout 76, which is not the best game in the world, but still has hundreds of locations you can discover and explore. In Cyberpunk you can’t go in to 99 percent of buildings. Still a great game, just doesn’t scratch the same itch.\n\nI am also badly addicted to a deck building mobile game called “Pirates: Outlaws.” No Slay the Spire, but still crack. I’ve probably done hundreds of runs and don’t plan to slow down.",
            "I finished **Spirit of the North, Calico** and **Geneforge 5.** I don't have much to say about the first two. I got both for free, and don't think they were something I would have paid more then a few bucks for. Spirit of the North was probably the better of the two, although the cooking game in Calico was fun.\n\nI'm glad I finished the Geneforge series, but I felt like the last game didn't have enough interesting choices compared to the others. However, it was more about tying up the story of the world as opposed to a personal story for the player character. I felt like the ending I got was satisfying. I'll be checking out some other Spiderweb titles.\n\nI started **Control** and **Stray Gods**, but I'm too early in for an opinion on either one. Up next after that is probably **Riven** and **Horizon: Zero Dawn**.",
            "What animal/being is depiced in this subreddit's icon? It is cute but brings up feelings of sadness in me which is very confusing.",
            "Is don’t starve together worth it now that it’s on sale for a couple who enjoyed playing stardew valley and it takes two?",
            "My wife is playing **Danganronpa 2: Goodbye Despair**, about 2 years or so after I played it for the first time. It is a unique experience to see another person get spun around by the game's main misdirection (I really recommend playing these games for yourself, but for those who won't -- you assume the whole game that >!some ominous mysterious force aligned with the first game's insane villain cult must be behind your predicament, and spend the game paranoid about the 'traitor' among the group who you know to be working for this shadow organization!<, but actually >!this ominous shadow organization is the good guys, and so that whole 'traitor' business leads to the amazing reveal that your \"friend\" who was \"on your side\" was actually your FRIEND and ON YOUR SIDE!!<). At the time when I first played the game I went through the exact same process of falling into the mental trap it sets for you, and in retrospect the truth is *so obvious*, they spoon feed it to you again and again, but you refuse to see it because it doesn't 'fit'. You never stop to think why it doesn't 'fit' and how easy it would be to account for that.",
            "I decided to continue my Etrian Odyssey, this time with **Etrian Odyssey 3 HD**. Let me tell you, this series is teaching me a thing or two about option paralysis, every single time I start a new one of these. I was looking forward to EO3 a LOT, because it has some of the most interesting classes in the series and I love the seabound setting. I live in the middle of Austria, so harbor towns like Armoroad have an inherent vacation feel to them for me, especially in videogames. Most of this is still true after starting the game. I enjoy Armoroad way more actively than Etria, Lagaard or Tharsis. The people here are great too. I especially like Missy, the barmaid. She actually bamboozled me once or twice already because she has a tendency to jumble up words to make up new ones apparently. I kid you not, I broke out a dictionary when it happened the first time, thinking I just learned a very obscure new word. Nah, she's just that weird. But that's exactly my style, so she's cool.\n\n--------------\n\nNow, when it comes to the classes, oh boy. I haven't been this stumped since EO2 HD. The only thing I know is that I want to focus on the Sovereign's passive healing because I've never done that in an RPG before and I want to see how far that can take me. Other than that, I would have loved to use a Wildling and an Arbalist and a Ninja. Wildling is a super unique concept in that they summon beasts who act as temporary party members and deal out status effects. Coming from EO4, they feel like proto Arcanists almost, since beasts kinda act like arcanist circles, with a more physical twist. They are awesome, but they also don't mesh *at all* with the rest of the classes it feels like. For one, they straight up do not work together with the best Ninja skill, because the Ninja's cloning ability and the beast both occupy empty party slots, which you usually only have one of. Second, they don't really benefit from the Sovereign's buffs because the beasts deal all of their damage. You *can* buff the beasts, but unless they become super powerful later, that feels off. Their beast summons also cost a TON of TP to the point that at the start, you can only call the most basic beasts *once*, so at first I thought I needed a Zodiac (this game's caster) to reduce their TP cost to 0 on summoning turns. Turns out at least that issue resolved itself, because Wildlings have incredibly high TP growth. By now, I can call beasts pretty freely and dismiss them to get my TP back. It's a bit clunky, but that part works. He's still the odd one out though.\n\nThen there's Arbalist. They look awesome and they apparently have the highest STR in the game. They are basically glass cannons. The issue: They work best at the *front* since their strongest skill - Front Mortar - gets boosted to high heavens there. This does not work well with the rest of the team at all. For one, I *need* an empty slot in the front so the beast (Elephant) can deal full damage. I also need my Hoplite (the tank) to protect the Princess, but leaving an Arbalist at the front basically requires I switch the Hoplite to bodyguarding the Arbalist.  There's also the issue that the Princess buffs only target lines, not the entire party, so even if I put the Arbalist at the front, he's now the only damage dealer there, making my Attack Order less efficient.\n\nYou see where my problem lies? Every single class I want to use steps on the toes of another one. I'm not rational enough to just kick out one of them, but my game feel currently also isn't great. Sure, I clear enemies fine, because the passive healing component actually works and that feels good, but my damage setup at the moment feels so off. I'd need to spend a few hours to revise the whole thing I think.\n\n------------------------\n\nThat's also why I haven't made a party breakdown yet like I enjoy doing in my Etrian Odyssey posts here. I just don't know if I like my current team.\n\nI have other thoughts on EO3, but I'll save them for another time since my rant on party building needed priority. I'm not joking when I say thinking about the composition is making my head spin.",
            "I think I'm burned out on the souls formula, or maybe just the From Software formula. Returning to Elden Ring to see if I want to buy the DLC and I still really don't like the change from linear levels to open world. I also don't really find it that challenging anymore. %90 of the bosses I can takedown my first try despite not playing the game in over a year. \n\nI'm in this funny mental space where I'm extremely appreciative of From Softwares continued success and growth from a relatively unknown studio into an industry pillar, but at the same time, I wish for an alternate reality where Dark Souls didn't get popular. Even the new Armored Core game felt much more like a Dark Souls game than anything like the old AC games.\n\nIt's very homogeneous. I feel like From Software is no longer taking risks and instead refining a REALLY solid formula and releasing games that are mostly all the same. The differences between Demon Souls and Elden Ring are very minimal if you focus solely on the combat mechanics. \n\nI know the studio can be better than the rest if they tried. AC For Answer is still one of the greatest games I've ever played in my entire life and that came out of nowhere only to never be seen again. I want From Software to make more projects like For Answer, not Elden Ring.",
            "All the talk about the **Elden Ring** DLC reminded me that there was probably a lot of stuff I missed in that game.\n\nTurns out most of what I missed was boss fights and I had forgotten how not fun they mostly are.\n\nI love the atmosphere, the dungeons and their wonderful level design, but the bosses not so much.\n\nThe whole screen is just visual noise to me as they flail about. But lots of people seem to love From's bosses, so what do I know.\n\nI know I turned it off pretty quickly and I think that's it for me with that particular game.",
            "Playing on the Nintendo switch and I cannot overstate how much I enjoy gyro controls and motion aiming in games. I find it literally game changing.  I always found console FPS either too hard to aim or too much aim assist. With motion controls it is so much more interactive and down right fun.\n\nI really don't understand why PS and Xbox don't use them, especially when there controllers actually support it.",
            "I fired up Star Wars Jedi Power Battles again after many years of not playing it and I forgot how fun/janky it was. I know I wear rose colored glasses with this old game but slowly learning new moves and basic powers was fun. \n\nWith beat-em-up brawlers still doing well these days I’m surprised another game like Jedi Power Battles doesn’t pop up again with an original story. The 2D/3D landscape movement has been pretty much perfected these days with games like Mario 3D world and there’s way more Star Wars lore and heroes out than existed in the early 2000’s. A “sequel” could be fun to play with all the main drawbacks fixed after many years of gaming experience. You’d think this would be a slam dunk for anyone but EA.",
            "There used to be an essential games list. I know it's kind of outdated (although I guess nothing's technically outdated on this subreddit) but I wanted to check it out!\n\nIs it archived anywhere?",
            "Currently finished Blast Brigade VS the evil legion of Dr. Cread, which I got from my prime subscription. I did 100% of it and that was a very pleasant surprise.\n\n\nI felt the game to be an extremely polished metroidvania. Graphics are cartoon like and very well done, with a likewise cartoon humour/story that got some chuckles from me. \nGameplay wise it is really solid, although I felt the enemies to be kinda spongy (the aiming didn't contribute to how slow I felt I was dealing with them).\n\n\nIn the end, I'm surprised this one wasn't mentioned as a good game when released. I think it released on 2022? In any case, I was very impressed with the game and enjoyed it a lot. \n\n\nNow I'm deciding which game from my backlog to tackle: Soul hackers 1, Bravely second or grab Trials of Mana now that it is on sale. ",
            "I've finished Sonic Colors DS, which completes the Rush trilogy. Honestly this game is by far the best of the DS sonic games. It's totally different from the Wii/Console version of Colors, and definitely worth checking out.\n\nGameplay wise it is the same as the previous two entries, with some nice refinements. No more spamming buttons for \"boost gauge\" and the lock on is more consistent. The games divided into 6 zones, with each one having a unique gimmick to try out in two levels, a boss and three optional missions (usually replaying a stage with an extra goal). This is a fun loop, if you find one zones gimmick annoying, you know it won't be around long, and if you enjoy that gimmick there's some extra content to mess around with it. The only gimmick I didn't enjoy was \"Drill\", which controlled quite badly. Most the stages were designed well and I thought the difficulty curve was fair.\n\nColors DS is very short, it took me about 3 hours. I won't fault the game, because it removed lots of the unfair bottomless pits and repeating stages from the previous games. I do miss having Blaze be playable, and compared to Rush Adventure, the bosses are a step down (though still better than the original).",
            "It's funny that gaming, for so long, was compared to and sought to be like thw medium of movies.\n\n\nIn practice, I think the medium of games is the most like music.\n\n\n* Both games and music are based on \"rhythm.\" Games repeat their gameplay loops. A song will repeat a certain action (drum beat, chords, melodies, choruses). In both mediums, depth comes from iterating on those repeated actions in interesting ways.\n\n\n* Movies/books/poems require plot and/or written language to be competently made. However, in music and games, story/words are completely optional.\n\n\nNot sure if there's anything else to this, but this comparison has helped me break out of the box of seeing games as \"interactive books/movies.\" I've begun to see them more as vibes-based experiences that can encompass a ton of different things.",
            "Still playing a 2nd playthrough of **Elden Ring** and a first of **God of War Ragnarok**.  Sort of. I have 30 hours in Elden Ring and 4 hours in Ragnarok.  The start of GoWR doesn't make sense to me. It starts off with a 90 minute cinematic(ish) start to build stakes in a bitter quest for survival and then an hour later sends you into this relatively boring area with a quippy head and some lame dwarves. I'll give it one more try but I have a feeling that Ill be looking for something else to play.",
            "I first restarted **Battle** **Brothers** with a bunch of mods. (Having not played it for a while)\n\nI found out that you can do a \"super-soldier\" by doing the Anatomist origin and feeding upgrade potions to a single bro.\n\nBut i also installed some \"cheat-y\" mods, one of them giving me the ability to modify how many perk points and attribute points bro's get on level up.\n\nMy plan was to run the super-soldier solo, to see how far I can get, without hiring any new ones.\n\nBut then I got an event, and rescued some scoundrel, or was it barbarian or some such.\n\nNow I've got two bros. Well, the 2nd one gets the same \"super improvements\" from the extra attribute perks and stuff.\n\nSo I got to feeling that I may have over-done it, and I may come to realize that I made the game too easy.\n\nAnyways, ended up stopping for now :(\n\n\n\nInstead, just saw that a new patch came out for **Grim Dawn**.\n\nI hadn't played it in a few years, so felt like I might be ready for another Grim Dawn sprint.\n\nI went ahead and \"archived\" my old characters, as well as the Item Assistant backups.\n\nAnd then went ahead and actually installed Grim Dawn on my Steam Deck.\n\nWill see how it goes. Was going to play a dual pistol Purifier (which was probably my very first character back in the day), but then saw that the new patch made a bunch of changes to pets, so pivoted back to my very usual summoner builds (favorite build type in arpgs).\n\nNow I just started leveling a Conjurer.",
            "\n\nHey fellow patient gamers,\n\nLately, I've been completely hooked on Hearthstone Battlegrounds (an autobattler) that I can't seem to get enough of. It's my go-to game right now, and I'm having a blast with it. However, I can't shake this nagging guilt about not diving into my backlog or playing the latest hyped titles.\n\nDoes anyone else experience this kind of guilt? How do you balance playing what you love with tackling your backlog or trying out the newest games everyone is talking about? I'd love to hear your thoughts and any advice you might have!",
            "Stage 2 for the Grand Prix in **Shadowverse** should start tomorrow. I'll have one more free run today to see if I can get another craft to 4-1 before needing to try hard again. Beyond that, there's an event where playing a private game with someone daily gets you a pack and an entry to a raffle. 8 1st place winners get 1 million rupees, 40 2nd place winners get 1000 packs, and 40 3rd place winners get globes to animate cards.\n\nI saw two Cramorants today in **Pokemon Sleep**, but I opted to not feed them anything since neither were hungry. As a F2P player, you only get so many biscuits per month, and Cramorant as non-evolving Pokemon needs a lot of biscuits to recruit. Being hungry triples the amount of friendship points that biscuits give so you'll need less overall. I opted to just feed some of the other Pokemon that did show up hungry instead.\n\nYesterday evening was my second day of doing 10K steps while farming gifts in **Pokemon GO**. Unlike the day before, I actually managed to get all my friends gifts and 20 extra gifts in storage, but I believe that's because a lot of my friends hadn't accepted the gift I already sent them yet. That's understandable, though, with the daily limit of only accepting 20 gifts a day. It just means I might need to add more friends soon.\n\nIn my gacha games, there's a lot more going on this week. **Honkai: Star Rail** just released its 2.3 patch and the guild war has started in **Granblue Fantasy**. **Azur Lane** began its re-run of an Iron Blood event while **Fate/Grand Order** just made one its main interludes free. I've spent most of today working through HSR's new conventional memoir on my computer while I had GBF on my phone grinding the guild bosses.",
            "re: Slay the Spire it took me dozens of runs to beat the heart the first time, you'll get there! There's so much rng that even if you have a plan for your deck things can go sideways quickly, but that's part of the fun imo. That said, it's an easy game to burn out on after trying all of the characters. I hope in the sequel they expand the roster a bit more in future updates.",
            "I really wanted to like Guardians of the Galaxy, but I can't stand the combat. Everything else about it is great, but the combat feels like a chore. Fights go on too long and it feels...mushy is the word that comes to mind.",
            "By the end of GotG I actually preferred the game's versions of the characters to the movie's, they were that great",
            "Tunic is really damn old school, I goddamn loved it!",
            "Honestly skipping most of the skippable stuff in ME1 is probably the best way to go. Some of the side quests have decent narrative elements, but most of the time it's just a matter of going to a planet, driving around for a bit, and then clearing out one of two or three cookie-cutter locations to get a few lines of dialogue.\n\nThe main story of ME1 is great, probably the best of the trilogy, but those planet-based side quests for the most part aren't really worth doing IMO.\n\nThe sequels get rid of that planet exploration stuff for the most part and are better for it.",
            "I think ME 1 went for scope of the universe and with how many planets you can explore as back when it came out it was something special. Nowdays yeah, you can explore them and find some extra resources or those \"collect x alien relicts\" quests but you might as well only go on planets when you get a dedicated quest for it from Admiral or chatting with characters to save time. \n\nOh and you might be glad to hear ME2 doesn't have such exploration anymore! :D",
            "What platform are you playing on?  I've been contemplating picking up the legacy collections on Steam but my experience playing old ported NES games without an emulator have been spotty at best.",
            "The music in this game is amazing. So catchy.",
            "Haven’t played it but Cassette Beasts is supposed to be a great creature collector with a unique spin.",
            "Outer wilds is artsy but Its also fun.i like night in the woods. I haven't played Kentucky route zero yet but it sounds like what you're looking for.",
            "This War of Mine is among the most artful games out there, not sure about artsy tho. it's on the reading list for polish high schools, as I've just learned!",
            "Haven’t played it but I think Braid is supposed to be like this. There’s also Kentucky Route Zero, which is definitely more art than game.",
            "Daniel Mullen games: Pony Island, The Hex, and Inscryption. Those would be my top current recommendations for this category. Best played blind. Also enjoy the Annapurna catalog. They greenlight some interesting ideas.",
            "A tip if you want to make life easier on yourself, learn how to use throwing knives and use the pump up ball bearing gun, they wreck normal mobs and by end of game your swimming in ammo",
            "This game is so underrated. It had a really troubled launch and got stuck with a shitty reputation, but after playing way too many action RPGs of all flavors, I rank it very highly.  The serial killer subquest alone is insane, the game was worth it just for that. \n\nLike let's be honest, the main criticism of this game is that the plot doesn't quite stick the landing in the third act, but then what immersive sim does? Dishonored? Cyberpunk? Do we want to go there?",
            "The best introduction to Gone Home that I have heard is \"it's a survival horror game and to fully appreciate it you need to go in blind\".",
            "> On the less enjoyable side, I finally got my first base and found out that the game forces third-person in the base.\n\nWhen this first happened I thought it was a bug lol.",
            "That's pretty much the general consensus on Midnight Suns that I've seen (and agree with): The combat is great, but most of the stuff you're doing outside of combat is pretty bland, and you end up having to spend *way* more time you should on the non-combat sections.",
            "I like Cyberpunk a lot as well, but the open world never did much for me. I find that a lot of the city feels kind of same-y and something about the way it's designed makes it hard for me to get a grasp on the layout. Like in a lot of open world games I'll kind of know my way around after a while, but that never happened for me with Cyberpunk (I'm halfway through a second playthrough now).\n\nIn general it does look really nice, and it does have some cool locations, but it just never quite gelled in a way that made it feel like a real place to me. I'm about to start the DLC though so I'm curious how the new location is going to be.",
            "Something about Control I wish I'd been told in advance: despite the human interest backstory of Jesse looking for her brother, this isn't a drama piece with hugging, learning and poignant dialogue. It's a game about getting a field promotion in your first day on the job, dealing with cool and unusual stuff, and getting a really difficult situation under control.",
            "[It's a slowpoke from Pokemon.](https://i.imgur.com/ZyteXUY.png) (Slowbro on the right)",
            "I enjoy Don't Starve Together, but it really depends on the type of games you two are into. I wouldn't compare it with Stardew and It Takes Two. These two games are more relaxing, less punishing. Don't Starve Together has a lot of mechanics to figure out, so lot of patience or the wiki are recommended. Fortunately it has a bunch of settings before you start, so my friend and I usually add more food to the land or reduce/deactivate certain threats. (You might want to try Endless mode instead of the normal Survival mode, so you can just resurrect yourselves at a portal which makes it easier to learn the rest of the game imo because you don't have to depend on another player to revive you and it's less frustrating, especially in the beginning. But that's just a personal tip.)\n\nIn general I would say it's worth it to give it a try as long as you're both aware that the game doesn't really hold your hand and you have to figure things out on your own.",
            ">  I also don't really find it that challenging anymore. %90 of the bosses I can takedown my first try despite not playing the game in over a year.\n\nI just had the exact opposite experience. \n\nIt's not even a year since I played it and I got straight up pulverized when I dipped my toes back in.",
            "> I also don't really find it that challenging anymore. %90 of the bosses I can takedown my first try despite not playing the game in over a year.\n\nThat's not necessarily a bad thing. I consider it rewarding to have become so good at that gameplay formula that I can beat several bosses on my first attempt.\n\nThat said, I do think this is one of the places where the relatively rigid and simplistic design of Souls combat becomes a weakness. I noticed it especially when fighting Artorias for the first time recently. Even though I died to him several times, I never thought \"Oh man, this is so hard!\" since the strategy to win was so straightforward. I knew all I needed was to see enough of his moveset that I wouldn't fall victim to an unfamiliar attack, and the only reason this was difficult was because of how quickly he could kill me. Same for Manus, though I liked him fight a bit better.\n\nIn terms of mechanical execution, these games have a relatively low skill ceiling (at least if we're talking PvE—barely engage with the PvP so I wouldn't know about that). Just watch a speedrun or SL1 run; the skill on display hardly ever seems out of this world, unlike with a Mario 64 speedrun for instance. Mostly you see them running past every enemy and whacking the bosses to death with the strongest beatsticks they can wield to the point where some die in as little as three or four hits or spend the whole fight staggered, because at the end of the day, there's only so much you can do with this combat system.",
            "Have you played Sekiro or AC6? both are pretty different from the Souls formula. They have the DNA of it of course but the gameplay loop is entirely different.",
            "Man, I need to start trying out the gyro controls on my SteamDeck as I find FPS games too clunky with the stick/pad controls.  Seen clips of people using the gyro effectively though.  Assumed it's a bit of a learning curve.",
            "This one?\n\nhttps://docs.google.com/spreadsheets/d/1LBqlkPirxPWDnXLJznXAcTE-_IaFYCrhTsW4vhfvF7I/edit",
            "Time is truly a flat circle. You've broken out of the box right back to the 1980s and early 1990s, basically to gaming before MGS1. Never mind Arkanoid, Pong, Pac-Man and all those; take for example Rise of the Triad, a milestone FPS title but no one who played it can name the main character, quote a line of dialogue from it, or recall a lore justification for why the final villain is a centipede of cloned identical heads. It was truly a different time (and I can't blame someone for being nostalgic for it...)",
            "GOW continues to get better all the way through. I can't imagine having skipped it, for what it's worth.",
            "I thought Ragnarok started quite slow but after a few hours it really started to get much better. I'm about 15 hours in now and definitely hooked!",
            "[deleted]",
            "Tell me about it! I almost defeated it with a Body Slam deck, but it flooded me with status cards and I lost. I think if I had a Fire Breathing I would have defeated it.",
            "I'm emulating it through Retroarch using the Mesen emulator. I'm having a good experience, but I never played on a real NES, so I can't compare the experience I would have playing on real hardware.",
            "Played and enjoyed it, but ultimately ended up not finishing it because there didn’t seem like enough to do. Thanks for the suggestion, though!",
            "It doesn't help that the first time it happens is right after a cutscene, so it *really* feels like the game bugged out. The gameplay also doesn't change compared to similar areas. It just becomes clunkier, so it *really* feels unintentional.\n\nHonestly, I kind of wish we knew why this happened. Did some out-of-touch exec require the game to spend a minimum amount of time in third-person? Were they trying to add a third-person mode, realized it wasn't working, but decided to use it somewhere to please the team that worked on the feature?",
            "That's good to know. But now that you mentioned it, I just remember that there are random collectibles and fake currency to decorate stuff. Didn't really expect those lol.",
            "Ohhh that's where it's from. It didn't feel so foreign.",
            "Same! It's making me wonder if jumping back in mid-way through the game was a bad idea, but I also don't want to have to go through a ton of content again just to get to the dlc. Dilemma!",
            "I've played every single soulsborne game by From so I sorta enter a flow state once I get back into any of them. Its just a process of pattern recognition and timing at the end of the day.",
            "Yessir. I think AC6 is just like the souls games to be honest, with the biggest change being the emphasis on aerial maneuvers instead of being grounded. Anything but the bosses are a cakewalk, and the bosses are often not much other than dodging on timed attacks.\n\nThe only boss in AC6 I had real trouble with was the very last one you unlock on the third ending of NG++. The missle guy was also a little tough but you can't even play against the challenging version of him anymore because he got nerfed to shit a week after launch.",
            "Definitely worth checking out, like I said if it \"clicks\" with you it can be a game changer.\n\nIt has made shooters one of my favourite genres now.\n\nThere is a learning curve and you can use them differently. I personally use it for fine adjustment. Whereas you could technically do all the aiming with gyro if you cranked up the sensitivity.",
            "Steam input is amazing. You can add gyro controls to any game that uses a mouse or joystick, which is to say all of them. Having gyro even when the devs didn’t add it is very nice.\n\nThere is a learning curve. If you can, I’d recommend docking the deck to learn, so the screen is stable. A cover shooter can be nice for learning since you’re not moving much. I’d recommend Spec Ops the Line, as that one’s *really* stationary, but alas they took it off the stores.",
            "Yes! Thanks so much!",
            "Heck yeah.\n\nThat example is good because it proves how powerful the interactive element of gaming is when it comes to suspension of disbelief. We have a tendency to accept head centipedes as players because we our interaction with them is remarkably tangible. \n\nAnd yeah, I think we'll always have cinematic experiences but gameplay-driven design will always be timeless. I'm used to see it as a nostalgia thing as well, but idk I find it funny that I was not around for many of the retro games I love. It was just a different time for game design.",
            "Thats interesting. Its actually somewhat rare for games to get better and better all the way through",
            "That would be extremely hard to miss.  I'll make sure to stop posting here, though",
            "btw u just made me stare at the reddit icon for like 30 seconds. there is a certain unnerving quality to [that smile.](https://i.imgur.com/LBJHVos.png)",
            "Yeah, the jumping back in the middle might be part of the problem.",
            "there really is"
        ]
    },
    "Fallout 2. This game jumps the shark or Deathclaw, and somehow still rocks. The best Fallout game by being the weirdest, funniest, and creatively questionable. ": {
        "title": "Fallout 2. This game jumps the shark or Deathclaw, and somehow still rocks. The best Fallout game by being the weirdest, funniest, and creatively questionable. ",
        "score": 232,
        "url": "https://www.reddit.com/r/patientgamers/comments/1dl5evx/fallout_2_this_game_jumps_the_shark_or_deathclaw/",
        "content": "Last time I posted here, [I played fallout 1 for the first time and declared it the best fallout game](https://www.reddit.com/r/patientgamers/comments/1cr72d1/fallout_1_i_died_to_rats_at_the_start_i_couldnt/?utm_source=share&utm_medium=web3x&utm_name=web3xcss&utm_term=1&utm_content=share_button). Many commentators recommended playing Fallout 2 and using the restoration patch because it fixed the bugs and completed some content.\n\nSo I did and everyone was right. Fallout 2 is the best game and the most questionable in terms of lore and tone, especially working backwards from the modern games.  So these are more my rambling thoughts and experiences playing fallout 2, so you're not getting a cohesive essay with complexity and nuance.  More of a emotional reaction to the strangest parts of the game.\n\nEverything plays exactly like the first one. Same game play, isometric view, and leveling system. The developer gods were kind giving me a \"push\" mechanic when an NPC was blocking a doorway. I reloaded so many times in the first game because I was trapped  by an npc standing in the doorway. There's a lot of consequences and time constraints for some side missions, but the main game seemingly didn't have a constraint this time except a few spiritual dreams reminding me of my mission.\n\nAs for my character, I named him Propane Bobbie, the charismatic gunslinger going from town to town helping the citizens and becoming part of local folklore.\n\nOk, I start out as tribal member who must overcome a holy trial as I am \"The Chosen One\". This chosen one got his ass handed to him 3 minutes in and died, because I missed 100% of my unarmed throws at the last trial. Bobbie was not the chosen one, until I found there's a dialogue option that you can convince the guy you're fighting that \"violence is bad and pointless.\" My methods of persuasion will hopefully be handy this game. Now I'm off to find the Garden of Eden kit to save my tribe. Hell yeah let's see what happened since the last game.\n\nApparently there are ghosts in this game. Yeah I ran into a town and apparently there's a ghost you can meet and get a mission to return an object and bury them in a cemetery. Why? I dunno, I guess it seemed like a cool night time side mission. So of course I ended up ransacking the cemetery thinking there would be guns or that sweet power armor. -1000 karma off the first hour and this will not be the last time you're running into ghosts, there's some weird spiritual stuff on what I assumed was heavily scifi. \n\nI recruited some companions, a tribesman slave who speaks with a Jamaican accent, a tough barkeeper, Marcus the mutant sheriff, and my husband. Yes, I ended up getting married in this game. Very nice to know that sleeping with a dude for shits and giggles ended up with me in a shotgun wedding when the father came in the middle of \"fun time\". So now I'm married, I'm very surprised how progressive this game is with letting you sleep with male and female NPCs. Then my husband got killed in a random encounter with slavers. Our marriage couldn't survive the apocalypse sadly. So I ended up killing the head slaver in one of the first towns for revenge. Had to tell the father in law the passing of his son. Saddest moment for me.\n\nRoleplaying as Bob also comes with shortcomings. I visit the town where Marcus the mutant sheriff is chilling and I meet a scientist who is testing a smart serum on a Radscorpion. I lost a chess match (intelligence skill) and a lock picking (lockpick skill) challenge against a god damn radioactive lobster, he doesn't have hands to pick a lock. HOW??? the only thing I beat the radscorpion in is an eye exam (Perspective skill) . This game feels closer in tone to Fallout New Vegas: Old World Blue DLC at times.\n\nThis game is very big, bigger than the first game and matching expansive modern games. What Fallout 2 has over all other games though is a car. My sweet ride running of fusion cells and carrying the whole crew from place to place faster than ever. Then my car got stolen and had to investigate in a sketchy casino town.\n\nAll these random moments and stories that feel out of place in the modern games makes me wonder if the developers were throwing every idea at the wall because they had to make Fallout 2 in a year (insane!). You know what really surprised me though, Death claws can talk. I followed them to vault 13 and they freaking talk. I want the next game to have them talk, how come nobody in the Fallout subs memed on this?\n\nSo the main plot has you fighting the Enclave. They kinda sucked in the modern games where they came off as a nuisance to me. Here they are pretty metal, you don't mess with them as they massacre families in random encounters as they try to reestablish the U.S. Government.\n\nThen I get to the good old epilogue narrated by Ron Perlman as he narrates each side story about what happened to them. I saved my village, I reunited them with vault 13, I destroyed the enclave, saw NCR expand, and overall was immensely satisfied with my roleplay as Bob. So no complaints from me, except killing kids who pickpocketed my stuff gives me negative karma.\n\nHighly recommend the game as it holds up extremely well with it's addicting gameplay, consequential choices, and surprising don't care attitude about tone. No need to remake this game as it's still a fun game that runs well on modern PCs. ",
        "num_comments": 57,
        "comments": [
            "You missed some of the best companions! You can also get a child prodigy drug manufacturer, a robot dog, a ghoul, a talking deathclaw, a supermutant, and a robobrain with Skynet in it.",
            "I can tell you why there are ghosts, which also puzzled me when I first played the game more than a decade ago.\n\nThe \"ghosts\" you find are invisible CHILDREN characters, which got removed/censored in the EU version of the game, because some people didn't like that you could kill children in this game.\n\nThis breaks a few optional side quests and makes many settlements look weird with seemingly random speech bubbles spread throughout the map.\n\nThis is especially bad in the Den, where there's some places where children are supposed to stand and try to pickpocket you as you pass by. Which they can still do while \"not existing\".",
            "It's not just the best Fallout game by a country mile, it's one of the best video games of all time. The new Fallout games don't even come close, New Vegas included.",
            "No Fallout game comes without it's own set of flaws, while Fallout 2 has plenty it has become my favourite in the franchise.",
            "Fallout 1 is my personal favorite game in the series for its story and atmosphere, but I have to agree with many grognards that the sequel is arguably peak Fallout. It just has an insane amount of variety, and the craziness of it all keeps it entertaining. It’s Fallout on crystal meth and the craziness is part of its charm. \n\nUnlike many folks out there, I actually don’t have a problem with the humor most of the time, and think the controversy is overblown (as tends to happen on the Internet). But I have to say I never really liked the ghost quest in Fallout 2, and for me it stands out like a sore thumb. Doesn’t ruin the game or anything, but it’s the only part where I really think should’ve been left on the cutting room floor, or as an Easter egg special encounter. \n\nBut yeah, Fallout 2 is a masterpiece, and every serious fan needs to play it.",
            "One of my favorite ***games*** ever, let alone just Fallout. I can't play any of the Bethesda ones because of it. They feel like hollow husks compared to it.",
            "The talking deathclaws have a back story you can find through exploration (they're not regular deathclaws), and probably depending on your character stat/abilities. The original games were really great in that you simply COULDN'T experience the entirety of the game in one play through, and probably not even five play throughs. Many aspects and areas and choices are only available if you have a high enough skill, or base stat (or low enough), or karma (or low enough), or the right perk, or a combination of any of the above when you run into a given situation.  These situations and decisions can also chain into other aspects that chain into others and so on.  The game is VAST and does branching REALLY well, and really spoiled me when I tried Bethesda games later on and found them to be quite lackluster by comparison.",
            "I would love to see a remaster in style of Diablo 2 of it.",
            "With the exception of the Temple of Trials, I loved Fallout 2.\n\nI think my biggest issue in retrospect was how some of the small things were blown up for the sequels. The vaults as experiments originated there, but 3rd game picked up on that plot point and ran hard with it.",
            "> I want the next game to have them talk, how come nobody in the Fallout subs memed on this?\n\nBecause people who played the first two games and are active in modern fallout communities are, sadly, vastly in the minority.",
            "It’s currently on my backlog of games that I started but I haven’t finished. I remember where I am at but this damn 9-5 job is killing me! You’re post is making me want to go play again",
            "Kids these days will never know how it was to play a game that doesn't help you follow the proverbial thread until you reach the spool. Fallout 2 would be considered ridiculously hard by today's standards. \n\nI still remember when I reached the second floor in a brothel with a prostitute in New Reno (if I remember correctly) and mistakenly saved the game, forgetting that the bodyguards will try to kill me and I had no proper gun and armor. I couldn't get out and had to play it again.",
            "Best Fallout ever made.",
            "I often have to tell modern retro gamers they really should play Fallout first before Fallout 2, because they've heard (correctly) that the sequel is much bigger and more fun and that's the one you'll keep permanently installed. It's sort of like a tutorial level before the main game, except the tutorial is actually a full-fledged game that is very good in its own right, just not as sprawling and messily enjoyable as another one built in an almost identical engine. But you really need to establish the worldbuilding and the tone and the basics of the gameplay before the second game assumes all of those things as premises and takes them to every possible conclusion, no matter how inconsistently and chaotically.",
            "The rich NPC interactions in FO2, and the other games in the series, which we also see in games like Baldurs Gate 3 and Red Dead Redemption 2 are what make these games so popular and timeless.\n\nUnfortunately, a huge amount of effort is required to make such a game and with enough quality to pull it off.\n\nBusinesses much prefer gambling with live service games to see if they can \"go viral\".  Far less effort is involved to get one of those running compared to a game with plot/narrative/content etc.",
            "I thought the one that \"jumped the shark\" was the last great entry *before* a decline.  As such, that it jumps the shark AND rocks should not be a surprise.  It's the one after that drops off.",
            "My last run was low intelligence. Ironically, I had to be a lot smarter to beat it like that.",
            "Fun fact: Fallout 2 was the first video game with gay marriage.\n\nBut yeah, FO2 is the most maximalist of all the Fallout games but also the best one. I think I played through it like 3 or 4 times as a teen back in early aughts.",
            "Well, you listed a lot of the reasons why I loathe Fallout 2. It's Random Shit: The Game.",
            "Man I wanted to love Fallout 2 but just didn't. I found it a slog with surprising highlights rather than \"the best RPG of all time.\" \n\nI appreciate a lot of what it did and set up, and what it did for the genre. But between the extremely questionable 90s humor, the frankly boring and annoying gameplay, and its overall jankiness; it just doesn't hold up in my eyes. \n\nIf someone were to ask \"are the classic Fallouts worth playing?\" I'd point them towards FO1, which DOES hold up, never 2.",
            "I still prefer Fallout 1 because it's more cohesive regarding its mood and story. Almost everything, from mechanics to graphics to quest design, is in service of that \"crawling back from the brink\" bittersweet mood.\n\nFallout 2 is HUGE and WHACKY but as far as telling a deep post apocalyptic story, this ain't it.",
            "Fundamentally it’s got a very colorful world\n\n-  original subquest. Plenty of random shit like boxing matches, hunting slaves, keeping Brahmins ,shooting porn movies,. It keeps tickling your “funny bone” so to speak. \n\n- The cities/settlement  is impressive personally  : updated local karma system  and it makes for great worldbuilding with types of cities - the farming cities , the vice cities (the den, new reno) , all those mining cities (redding, broken hills), the advanced cities (vault city , NCR)  the ethnic cities (the ghoul settlement, broken hills with supermutants)   - and the way their links are hinted  : the mining cities trading for jet, the competition between new Reno and NCR for regional supremacy . With the car , it really makes you feel you’re exploring a world. That is fucking awesome.\n\n- And obviously you have the choice and consequence…. (A lot more on this)\n\nI really liked it….\n\nBUT I gradually cooled down on Fallout 2 though.\n\nNot so much because of the pop culture approach. I can block this out of my mind. But I feel that the gaming design is kind of a deadend. \n\n- Ultimately It’s all about those scripted scenarios. It’s not a game, it’s a book.  And not necessarily a great one because the main story is weak compared to Fallout 1. It’s clearly something of an excuse to visit the world and experiencing the C and C. And boy are there things to say about the choice and consequences system.\n\n-  the famous choice and consequence is a mistake I believe . Way too central and specific and in one key aspect badly implemented (storytelling)  As for the creative solution it brings : At the moment I  loved having several ways of solving a quest sure. The way to get the access info for Vault is a wonderful Matroivska doll. So many layers of branching solutions.  But It’s too static. Ultimatey you’re  only using the solutions that have been devised by a writing team. At that one place. At that one time.  Always “play” out the same. It doesn’t translate the spirit of  gaming which is UNCERTAINTY .  Play a sport like Tennis , cards, a FPS , it’s all about the tension of whether you’re going to win and the details of it. Sport fans can talk of great games like thrilling stories whether it’s NBA final , an UCL ,.   Specifically  I prefer the immersive sim approach of emergent gameplay/dynamic system which is a better translation for computer of the creativity of RPG. \n\n- Another problem of the C&C in FO2 is storytelling   - the slides/vignette ending system is nonsense for me - there are so many choices and consequences that it gets lost in detail. It doesn’t make for a great narrative. Most great stories have narrative clarity. Citizen Kane is about a rich man dying regretting his simpler but happier  childhood. Godfather is about corruption of character.  Dune is about the danger of Messiah.  The approach of Fallout 2 is non functioning: no real direction as you build your bright  new city over the hill but  can let corruption fester in the den and Reno, let Vault city enslave the ghouls , but help create an alliance between Vault 15 and New Reno.  Nuance is one thing and I love nuance but I don’t even remember half the stuff like the results in San Francisco it gets lost in the maze of haphazard choice and consequences.  Sometimes it’s even contradictory as the slide system can have at the same time one slide that says that Vault City develops and another that says that it stagnates and falls under the power of the NCR. \nAnd it’s not simply a problem of scale. It’s down to having too many choices about everything until it kills the clarity of the narrative. Even a sprawling  epic like Lord of the Rings had a certain direction: Besides the defeat of the Enemy, you had a great variety of players with the Ents (fading into oblivion) , the Elves (leaving for another land), the Dwarves (that hides as their population is falling down) the Wizard Council (breaking up as its function is fulfilled),  . But it all went in the same direction : it is about the end of an age and how saving the world doesn’t mean bringing back the magic of the old days. There is a reason why lotr world building is still a reference to this day. Now THAT is storytelling.  And generally speaking one essential thing to keep in mind is that writing stories is fucking HARD. Some writers write only a few books in their lifetime. Some only write one. Because making one meaningful story takes a lot of soul digging , a lot of life experience, a lot of research. By making all those stories branching out you’re practically ensuring average/mediocre writing. From what I understand Disco Elysium mostly always ends the same way : it’s the journey that changes.\n\n- I could also mention how some players fundamentally dont  want the pressure of making a “bad” choice. Consequence it’s for the real world . A lot of people want escapism when they play. This kind of design makes some people play with a walkthrough opened to avoid fucking up and feel bad.\n\nTake the C and C out and you’re left with a colorful world but a bad inconsistent main story,  a turn by turn gameplay which is serviceable but hardly repeatable (and whose fastidious nature is something some people can’t stand, especially younger player) . It’s not a good story like Fallout 1 and it’s not much of a game either.\n\nOverall Fallout 2 is entirely built around a formula that is kind of a non starter. I like the idea of C and C but it cannot be the core of the gameplay by itself.\n\n\nIn a way, It’s great at what it does. Lot of effort put into it. But what is does is really old-fashioned  compared to what computer can do and ultimately is  a creative deadend. ",
            "We've known this since 1998.",
            "> a child prodigy \n\n\nThat's the most generous description of Myron I've ever heard. Even the wiki describes him as \"a teenage pharmacologist, slaver, and sexual predator\". \n\n\nF2 is a big game with a lot of jank, but the companions are absolutely a fantastic part of it. I honestly think it's impressive how much attention the gave a character who is so easy to dislike. \n\n\n\nFun fact: Myron has the same voice actor as fucking *Boone*.",
            "Theres also the whole quests in the den with the ghost and her necklace.",
            "There are the invisible children, but like OP said, there is a quest to bury some remains/item of a ghost that's meant to be a ghost.",
            "The newer Fallout games have never even entertained coming close to a game like Fallout 2. They're an accepted compromise on what Fallout as a modern 3D action game would be. I feel like there's an unspoken understanding on that. The newer Fallout games are fun, but the writing, depth and coolness are sacrificed for mass appeal. \n\nA game like Fallout 2 wouldn't make that much money to be worth it, nowadays. It has more in common with Disco Elysium than Fallout 4.",
            "I mean i like both 3 and NV but they lack that goofiness, absurdity and heavy mature content  which makes them feel like a big chunk of their identity was taken away.",
            "I think the wackiness of Fallout 2 is rather overstated. Fallout had the special encounters with stuff like the TARDIS, talking cows (\"MOO! MOO, I SAY!\"), and finding a crashed flying saucer with Elvis's portrait inside. You get a dog companion because you remind him of Mad Max. The dimwitted super mutants at the Necropolis. It's true that it's not supposed to be camp comedy, but it's not like the games lack comic relief entirely. Fallout 2 is just much bigger, which means it literally has more room for more tones and ideas, some of which don't entirely work, which is why when some of the creators came back for New Vegas they omitted stuff they thought went too far, like the talking deathclaws.",
            "I always get downvoted on the other gaming subreddits for saying this but 1, 2, and New Vegas, are the only Fallout games that really understood what the universe was all about.\n\n3, 4, and 76, are Bethesda's attempts at creating [Apocalypse Road](https://fallout-archive.fandom.com/wiki/Apocalypse_Road) with the Fallout name stapled on while they butcher every part of the lore and worldbuilding.",
            "You mean \"matryoshka\" doll?",
            "\"a character who is so easy to dislike\"\n\nThat was actually intentional.  Something people forget about FO1 and FO2 is that you can kill kids.  But they never really tempted you with a reason to do so.  So they designed Myron as the most despicable minor in gaming.  Seriously, I can't think of an equivalent unlikable \"child\" character in gaming until Cuno comes around in Disco Elysium two decades later.\n\nhttps://forums.obsidian.net/blogs/entry/119-general-design-questions-part-1/\n\nPer MCA: \n\n\"The first characters I designed was Myron for Fallout 2. I was given the \"child genius,\" but I did what I could to make sure he wasn't the Wesley Crusher archetype, which I thought was pretty played out in most media forms. In the end, however, Myron had his problems - he talked too much, could get really annoying in parts (especially if you were female) and was useless in combat. I do think he succeeded in being a highly-reactive character to events in the game and things your player did, and it was pretty awesome for high Intelligence and high Science guys to argue with him about his own creations. I really like it when he gets frustrated when you keep asking him insightful chemistry and pharmaceutical questions about Jet. \"",
            ">That's the most generous description of Myron I've ever heard. Even the wiki describes him as \"a teenage pharmacologist, slaver, and sexual predator\". \n\nLol yeah that sounds a lot more accurate.",
            ">same voice actor as fucking *Boone*.\n\nExcuse me?! Of everything I've read in this thread, that is the most shocking.",
            "The absurdity factor in 1 and 2 were I think because the devs made it play more as a TTRPG than a video game like every other title in the series. You have to learn a system where your first character will probably be nonviable if you put the points in wrong, there's a reason to the calendar system, you can straight up fail in multiple ways without dying in combat. It's why morrowind was often more fun than other times the company put out, and why after FO3 I didn't bother with FNV for years because it felt like Oblivion but worse. I never bothered with FO4 at all because it's like Skyrim but worse? Full voice acting my dream as a child but a mistake the way it's implemented in these games. Mass effect 2 did it best.",
            "I was shocked the tv show was as good as it was. It's like everything on the East Coast just struggles in a way that works on the West Coast.\n\nWasteland 3 seems to mostly follow the West Coast.",
            "I sincerely doubt you're getting downvoted for having the most common fallout fan opinion there is.",
            "say what you want about the Bethesda fallouts but at least they are good enough to not have their existence completely ignored like the two games that came out between fallout 2 and 3",
            "To offer an opposing perspective, I always get downvoted for my opinion too, which is that Fallout 2 was an unworthy sequel that didn't understand what Fallout 1 was about and completely reinvented the tone in an undesirable way. A game filled with way too many pop culture references and edgy-for-the-sake-of-edgy content instead of being truly mature. Fallout 3, while not perfect, felt like a much better Fallout 1 successor.",
            "I generally agree. To me, 1, 2, and NV are RPGs. One explores the world through dialogue and choices. It changes the plot, it has interesting consequences, and even some humorous side effects!\n\nI'm not sure what genre 4 falls into, but it's definitely a different game, as there's very little meaningful player choice based on the dialogue, NPC interactions, and plot direction. It's still a beautiful world with well written back stories... but you can't even interact with a lot of that back story as the dialogue interactions are bad or sometimes, you can't even talk to some factions, as they just attack.\n\nIf people like FO4 for different reasons, that's fine. It's not an RPG in the same way 1, 2, and NV are.",
            "Even New Vegas doesn't come close to the guttural authenticity and sure footedness of the originals. Those games were made out of passion to make a unique artistic statement. Even NV is kind of an attempt to ape what came before without truly capturing it's essence. It's about the best compromise I could imagine between the old games and the action adventure vibe of the modern games, but it's still not the same.",
            "Yes.\n\n Had a doubt about the spelling. Especially with the video format. Thanks for the tip.",
            "Fuck Cuno",
            "Boone is a sav. \n\nI get constant kill-cams on creatures that I didn't even know existed because of him.\n\nHim and Charon are the best 2 companions ever.",
            "Yeah first time you play 2 then get your ass kicked by scorpion while missing half of kicks/shots, good times. But after few hours it really draws you in because of writing and quests. New Vegas is just like 3 but with desert setting and new weapons/gear and interesting story while i gave up on 4 because it seems kind of limited compared to older titles except for more fluid combat.",
            "The show is the best Fallout since 2. \n\nThe newer games are their own thing, a compromise to the tropes of modern gaming, but with enough soul to carry them through.\n\nI still think it's hard to maintain enthusiasm for a whole playthrough before getting bored of the sum of its parts, though, when it comes to the new era games.",
            "Then go to one of the mainstream subs and say what I just did lol",
            "Besthesda fans are SUPER defensive about their poorly written map marker chasers.",
            "The amount of Bethesda dicksuckers who exist not only there but also here is astronomical",
            "Awww, I kinda like Tactics 😞",
            "I've started to mentally map out where all the Legion killsquad spawn points are because Boone just starts popping their heads open while I'm just walking around the wasteland.",
            "My doubt stems from seeing it countless times with my own eyes already. Care to link to one of these curiosities?",
            "There are dozens of us! Dozens!",
            "I don't know what to tell you, I don't bookmark my comments when I get downvoted to hell for saying that Bethesda crapped all over the lore and turned the universe upside down. If anything I delete my comment because I'm so far in the negatives and I'm tired of people messaging me saying \"cope and seethe NV fan boy\" \n\nI don't know what you think I would possibly have to gain from lying about that experience to strangers on the internet.\n\nEdit: Okay I did a quick Google search. Here's plenty of other people talking about \"New Vegas fan boys being toxic\" and whatnot\n\nhttps://www.reddit.com/r/Fallout/comments/1c2pagn/as_a_new_vegas_fan_new_vegas_fans_are_severely/\n\nhttps://www.reddit.com/r/FalloutMemes/comments/1c5uu0g/new_vegas_fanboys_try_not_to_blow_a_gasket/\n\nhttps://www.reddit.com/r/FalloutMemes/comments/1c73ov8/nv_fanboys_in_shambles/",
            "You of course see it in r/fallout, but the dude is right. Most Bethesda fallout fans do not care for 1 and 2. Of course everyone likes NV, and when you try to tell them they should try 1 and 2, they always say it looks boring. Also bear in mind that the majority of fallout fans aren't in the fallout subreddit, and many don't even use reddit.",
            "You can view your own comment history on Reddit, no need to bookmark anything! Changing goal posts doesn't change anything either, I know NV fanboys can be toxic but that was not what we were talking about. It's also not a reasonable thing to ask for someone to start perusing random threads to find evidence that supports your claim regardless.",
            "Dude, chill. It's not a court of law."
        ]
    },
    "Longtime Mega Man fan, and I'm struggling to see the appeal of Battle Network 1": {
        "title": "Longtime Mega Man fan, and I'm struggling to see the appeal of Battle Network 1",
        "score": 16,
        "url": "https://www.reddit.com/r/patientgamers/comments/1dlbzly/longtime_mega_man_fan_and_im_struggling_to_see/",
        "content": "Just as the title says, i've been a MM fan for a long time, mainly playing the old games on other people's consoles until they started releasing collections. I absolutely love the classic and X series, and I'd kill for Legends 3, but I never had the money for 6 different BN games in the GBA era. I'm finally playing the first game (I'm at the power plant; 380HP; 7 Buster upgrades), and some of the game design choices are really putting me off. Like I am amazed children put up with this.\n\nTo start, the difficulty is all over the place, or maybe just random. The wrong random encounter at any time will give you a game over and force you to reload a save (no retrying battles why???) I generally save at the start of each new \"room\" in a dungeon, but I am learning that is not enough. \n\nWeirdly enough, major bosses are easy b/c I always save before facing them, and their consistent attack patterns make it easy to anticipate and plan for them with a little trial and error. It's just the random encounters that get me.\n\nThe progression system is also very annoying. Upgrades for your basic attack and HP total are few and far between (and very often, flat out hidden). I can't really find a way to upgrade armor, so attacks that deal 100 damage are always going to deal 100 damage. A lot of attacks seem to do 100 damage. (reminder: my current hp is just 380)\n\nYour primary growth comes through finding new chips, which each represent unique attacks. These are basically like trading cards you assemble into a deck, and every battle starts with you drawing a new \"hand\" of attacks you can use. You can then play multiple attacks if you have either 2 or 3 of a kind, or a straight, or via other mysterious and arcane conditions. (There's also an elemental system at play that doesnt' seem to mean anything?) This is fine and could be the grounds for a unique and fun battle system (I actually remember really loving KH:CoM, but maybe I wouldn't today?) except the cumbersome menus to manage your \"deck\" and the pace at which you acquire new chips make it probably my least favorite thing to do in the game. \n\nAnd there is no experience or leveling system to speak of. Grinding doesn't work, it only tempts fate to give you a battle that will send you back to your last save. The only rewards are chips, and money you can use to buy more chips. There are some shopkeepers that sold hp and buster upgrades, but I cleaned them out early, and afaik, they haven't restocked. They live out in a dungeon, so I'm reluctant to go out and check (even though its in a low level area).\n\nLook, I know people have nostalgia for these games, and I can see the glimmer of good ideas here. I know 2 is supposed to be a giant step up (and also the peak? doesn't bode well for 3-6...) I'm trying really hard to not use the cheats on the collection that turn the game into a cakewalk (I enjoy a sense of achievement from gaming), but I wonder if it's worth the frustration. If any fans have advice, I'd love to hear it, but if the best anyone can offer is \"you need to build a better deck\", then maybe the games aren't for me",
        "num_comments": 20,
        "comments": [
            "Battle Network 1 to Battle Network 2 is almost the same kind of transition as classic MegaMan 1 to MegaMan 2.\n\nRemember the original MegaMan? They had weird design choices and ideas that were relics of expectations of how the genre *should* be based on other games in the genre. Like how enemies in MM1 dropped Score Pellets that incremented an old-fashioned high score counter that the game tracked. It felt very arcady and like classic platformers did at the time, like Super Mario Bros with a gun.\n\nWell in Megaman 2, they cut out stuff like that, axed the parts that didn't work well, kept and polished the bits that seemed good, and tried to build something new mechanically on top of that as a foundation. A lot of people will say that Classic MegaMan really came into its own and really understood what made it work with its second entry.\n\nBattle Network 2 follows basically the same development trend. Areas are more unique and visually appealing, network layouts are (a bit) less confusing by trying to differentiate pathways with different color palettes when they overlap, enemy design is a bit tighter including a wider variety and better animations, telegraphs, and learnably predictable behaviors. Plus they added new mechanics that lean into the RPG-genre more of growing stronger and gaining (hidden) experience. They cut out some of the questionable decisions and polished up the good bits to shine brighter and help it embrace its unique qualities more.\n\nIn my opinion and experience, very few people say that the series peaks at BN2. I think most in the community would say it peaked at BN3 and then had a heart-monitor-esque path of ups and downs the rest of the way through to 6. I personally enjoyed every entry very much with the poor English localization of the original versions of BN4 for the GBA being the biggest detractor for me (hopefully the collection release fixes the translation errors), but I think BN3 is the last game that the collective fan base seems to majority-agree was a good game in the franchise, with the split happening at 4 onwards.\n\n3 added more mechanical systems that felt very \"correct\" in terms of world-flavour and genre-leaning game design that a lot of people appreciated before 4+ added systems that were a bit more divisive in terms of reception. \n\nAll in all, much like Classic MegaMan, I only introduce new players to the 1st game in the series as a little teaser to showcase where it's roots come from. For an actual playthrough of capturing the real \"experience\" of the franchise, I introduce new people to Battle Network 2 as their first game, just like I usually have them play MegaMan 2 as their first game. They're both just better made sequels.",
            "Battle Network 1 is not a good game, and even the fans of the battle network series admit this. 2 is a huge step over 1 and 3 is a huge step up over 2. 4 is kinda mediocre, 5 is divisive, and 6 is also good. My recommendation is to always skip 1, and just start with 2.",
            "Most people consider 3 or 6 to be the best. I'd agree. I've played through all of them except 5 (for reasons).\n\nYou started with the hardest one to get into, which is good! Viruses are more unbalanced  in 1 than any other, and it also has the blandest chip library.\n\nElements do have a meaning. Mainly, elemental chips deal double damage to enemies weak to it. That includes you if you change your type.\n\nThe other games retain the chip progression, but add a lot of quality of life systems for combat like the Navicust. Unless you're of the same type, attacks will always do the same damage to you. Health is pretty much your only defense besides chips. BN1 has low max health,  but it replenishes after every fight. Later games are the opposite. You tend to have access to more health,  but it doesn't replenish without items/chips.\n\nThe layout improves significantly, too. MMBN1 has probably the worst net layout. I got lost all the time. This still happens in the rest, just less. Shops don't restock as there's a limited amount of chips. There's a point where you have them all, and they're specific to each vendor. \n\nEncounters will work the same throughout. Just how it is. It's supposed to encourage memorizing enemy patterns and prioritizing certain enemies. There's always gonna be a chip that works for a certain situation. That's why you got multiple folders. The grind is in getting the chips you want to make encounters easier, and having different folders for different situations. No retrying is because these were GBA games, and that's how it was back then.\n\nIf you feel up to it, I'd say give 2 or 3 a try. The difficulty curve is a lot better,  and they're less maze like with better balanced viruses and better chips and game systems.\n\nThe story will be pretty much the same in every game, so it doesn't matter much.",
            "While I never played Battle Network 1, from what I've seen and heard it's somewhat primitive compared to the rest of the series. Battle Network 4 is the other black sheep of the franchise (have played it, can confirm it sucks) while 3 is considered the best overall. So it's unsurprising if Battle Network 1 doesn't really click with you.\n\nChildren can surprisingly put up with a lot, especially when it's your only new game.",
            "My understanding is that there’s little held nostalgia for 1. I have nostalgia for 3, but like 6 the most.",
            "I like the first game and tried to play 2 but just couldn't get into it. The major thing I like about the series is the Navi remix designs of the classic robot masters.",
            "I am also a longtime Mega Man fan that tried out the whole Battle Network Legacy Collection during February-March. I didn't love any of them (I thought 6 was okay), and Battle Network 2 might be one of my least favourite games of all time. Backtrack Network is a more appropriate title for the series. The anime is cool as shit though. Outside of the phenomenal battle system that excels in boss fights but is dampened by the frequent random encounters, the series doesn't do anything for me. I would've loved a spin-off focusing on the Liberation Missions in MMBN5.",
            "**TL;DR** - BN1 is frustrating and janky. If you like the theory but not the execution, speed through it to get to BN2. Big jump in quality.\n\nYou're criticisms are valid and shared by most, myself included. BN1 is a prototype for the rest of the series: you can see a good foundation in there, but what's built on top is questionable, frustrating, and sometimes downright bad. I played through it on an emulator a while back and only got through because of save states.\n\nBN2 fixes *almost* everything: better story, MUCH better difficulty curve, the internet is navigable (and interconnected), there's more variety in potential strategies with more chips and abilities, more extra activities to help you buff yourself and your deck, etc. \n\nI've seen BN3 considered the 'peak' of the series, and I think I agree. It sands the rough edges from 2 and fleshes out everything it did well even more.\n\nEither do what you need to do to get through 1 or just skip right to 2. You won't miss any story beats other than \"good guys won in the end.\"\n\nI hope this helps and you have fun with the rest of the series!",
            "These are common opinions even among fans. You won’t miss a ton if you jump into 2 (I think I started with 3 or 4 since Gamestop on the 00’s had varied inventory, before going back and playing the earlier games) and you’ll have a better time. The story and mechanics are certainly better in the other ones. I still liked the later entries, but some of them have their rough points.\n\nAlso don’t be afraid to use guides. 3 onward had official ones, but I used GameFAQs to get through the confusing parts as a kid and, as with many games from that era, sometimes things are nonintuitive. I love the series overall, and even like Starforce.",
            "I played the first 2 when they came out, they were alright. But even as child i realized the grind and conditions for more and better chips was ridiculous. Then i lost respect for the series at 3 (maybe already at 2 for certain end game stuff) when they started splitting the game, pokemon style. So now exclusive content and more work to one hundred percent.\n\nI'll always have nostalgia, but the one time I tried going back i slapped on some cheats to make it better, (infitite money, toggling random encounters), but still couldn't do it for long.",
            "Using maps to navigate is basically a requirement, especially in BN1. Interordi's maps are great.\n\nSave after every fight. Use the collection's Buster MAX mode for repeats of random encounters and grinding boss rematches, and you should be able to enjoy it some more.",
            "Haven't played it yet but I always see fans suggesting that newcomers should start with 2.",
            "BN 1 & 2 remind me of Pokémon Red, Blue and Yellow. They just have that old school jank to them where the difficulty is all over place and the design choices are questionable at best. \n\nIf you don’t like it, don’t play it! But I’d definitely play 3-6 and maybe give 2 a shot.",
            "Yep this is the answer.\n\n3 and 6 are amazing games. 3 is quite challenging. 6 has challenge, but is good for all skill levels.",
            "I got the first one when it came out...didn't like it and never tried the others...been on the fence about the collection though and this is at least the second time I'm reading that the first one wasn't good compared to the others",
            "It's nice to have my opinions validated, although tbh I would have rather learned about some gameplay feature I missed that would have make the whole thing seem reasonable. If not, how did this review so well back in the day? How did it get a sequel (let alone 5)?\n\nThe power plant was my breaking point and I started looking at maps. And now to be surprised after an incredibly easy Elecman fight with a tougher than average proto-man fight, I'm fed up and turning on the OP buster cheat and gonna start using my OP Bass chip. (Edit: I say all this, and then I went and powered through to beat the Power Plant section w/o using the cheat buster; definitely using maps and Bass going forward though)\n\nI'll do my very best to start fresh with 2 when I'm done and not let this experience sour me on the whole series.\n\nThanks for yours (and everybody else's) response(s)!",
            "Absolutely. Seeing not just their redesigns, but also how their playstyle has been adapted to the new battle system is probably the biggest reason why I'm gonna continue BN1 through to the end and not just abandon it for 2 right now. I'm definitely feeling foolish for not leaning into the cheat options sooner though. It just doesn't feel worth it anymore to the play the game as it was originally intended",
            "I don't blame anyone for bouncing after the first one. I started with the third and worked my way backwards. While going from 3 to 2 was still enjoyable, just a little rough, 1 felt like a completely different (worse) game with some shared mechanics. 6 is still the best the series has to offer I think, and might be the easiest to get into, but playing 6 first might also make it harder to play the earlier ones.",
            "The power plant is absolute baloney. I found it bearable with liberal use of save states.\n\nI don't see another comment that mentions armor. Yes, there is armor you can buy. It reduces damage dealt from most attacks but makes you vulnerable to one element. There are no tiers, just different weaknesses you can choose from.",
            "No problem! Hope you can enjoy the others more. I played through 3, 4 and 6 before 1 & 2. Also had some of them as a kid, so nostalgia helped a lot in getting through 1. \n\n3 is my personal favorite,  it has a great (albeit hard af) engame and secrets,  if you're into that."
        ]
    },
    "To me Plants vs Zombies 1 has the best difficulty curve ever put in a game": {
        "title": "To me Plants vs Zombies 1 has the best difficulty curve ever put in a game",
        "score": 414,
        "url": "https://www.reddit.com/r/patientgamers/comments/1dkkt0h/to_me_plants_vs_zombies_1_has_the_best_difficulty/",
        "content": "This review will be a bit short, as I don't have as much to say about the game. Long story short is, I played it back in the day, and now, more than a decade later I've finished it again. \n\nI'll be honest and say that I'm not much of a connoisseur of tower defense games. I played a whole bunch in the internet flash games golden age, but after a few minutes I dropped them as I thought they were boring. More often than not the idea of putting your towers AROUND a path instead of walls IN that path felt stupid to me. I think that's why PvZ was so appealing to me, because settings your defences along 5 lanes felt more organic than just around a few roads. \n\nBut I'm digressing, but I wanted to say is that I LOVE how PvZ is a game that is not really hard, but still manages to introduce their mechanics slowly, getting the player acquainted with its systems. This is specially true when the new zombie type is vulnerable to the new plant unlocked I'll present some examples here:\n\n* 1st: one lane, peashooter and normal zombies. Impossible to lose\n* 2nd: three lanes, and now you should plant sunflowers for additional income\n* 3rd level: now you can destroy enemy squads with a cherrybomb but the zombies are tougher.\n* 5th level: first minigame, which serves to introduce you to different game modes (which happen in all level that end in \"5\"), introduce the only real character, Crazy Dave, and also gives you the ability to dig plants to start again\n* 6th level: now you got pole vaulters, so you should plant something quick so they jump it and move slower. Incidentally the new plant, the mine potato, takes time to activate, so if you plant this in the way it should work with the next zombie\n* 10th level: an easier level with no sun to pick with 7 out 8 plants you've seen already as a wrap-up. This will continue in all levels multiple of 10\n* 11th level:  Night. Bad news: you can only generate sun with plants. Good news: the new plants, mushrooms are cheaper than the previous ones, even with a free one, the puff-shroom. Also, you can get money that remains between levels and you'll be able to use to unlock a new plant slot!\n* 13th level: New enemy: a zombie with a screen-door-shield. New plant: a fume-shroom which can bypass this diffence\n* 15th level: now you access to an almanac that serves a plant-opedia with all the plants and zombies unlocked. \n* 16th level: New enemy: a footballer zombie, one of the best ones in all of the game. New plant: a hypno-shroom that can turn him against other zombies\n* ...\n\nI've realise I could spend an entire hour writing cases, but this shouldn't be as short as I intended. Nevertheless to say, this also happens between \"worlds\" when you unlock the swimming pool and swimming zombies, the night-swimming pool with its fog, and the roof with the catapult mechanic, not to speak of the minigames and side-games.\n\nAs a final question: is there any other tower defense similar to PvZ you recomment? Which other games would you say have a similar difficulty curve? On the top of my head I can come up with FFX, but I have trouble thinking of more. Interestingly, it's easier for me to think of games that do the opposite, that being hard then become easier.",
        "num_comments": 85,
        "comments": [
            "As damn-near perfect a game as there ever was...",
            "It's a shame there has never been a true sequel.",
            "It also had one of the best theme songs for a game ever made:\n\n>I'm just a sunflower but see  \nMe power an entire infantry  \nYou like the taste of brains  \nWe don't like zombies  \nThere's a zombie on the lawn!  \nThere's a zombie on the lawn!  \nThere's a zombie on the lawn!  \nWe don't want zombies on the lawn!  \n  \n1  \n2  \n3  \nPLANT!",
            "I remember playing the demo, which was time based and then buying the game. That first night, my gf, now wife, walks into the office and says, you know it's past midnight right? Id been playing it over 5 hours straight without realizing it. It's a perfect game imo.",
            "I don’t remember the whole game super clear (played it as a kid), but 4th act (with night and fog) was much harder than anything else in the game. roof was too easy after this nightmare",
            "I used to live near PopCap before they were bought by EA and I knew the guy who created the game's art style, Richard Werner. I was a tester for PvZ2 and gave management all the feedback I could that the game sucks but if you've played it you'd know they didn't address my feedback. \n\nI don't like tower defense games but PvZ1 is so easy for me to pick up and play. I go through and beat it again every year or two. If there's any other games out there like it, please let me know!",
            "I will always hate EA for what they did with PvZ2 once they bought it.",
            "I still remember this game being uniquely fun in a very new sense of the word for a game, it just felt.. clean?",
            "I found the progression of difficulty to be rather slow, and most levels were easily beatable with the same strategy / build order. All the different conditions (night, fog, roof, ...) just change the type of shooting plant you need to plant, but the overall strategy is the same or very similar in almost every level.\n\nIt does introduce new challenges throughout the entire game, but each is too tiny of an increment to be meaningful, and more difficult zombie types aren't numerous enough to force you to change strategies between levels. And many situations that come close to being tricky are trivialized by using one of the bomb plants.\n\nI remember only a handful of instances where I felt challenged and/or had to do something out of the ordinary.",
            "That dolphin cry still wakes me up whenever I hear it.",
            "I adore the game. In fact, at one point I had made a mod that changes some of the plants' statistics to make the game a bit more challenging and balance out some of the plants a bit more.\n\nSome of the changes were:\n\n\\* sunflower now costs 100 sun.\n\n\\* pea shooter now costs 150 sun.\n\n\\* snow pea costs 125 sun, but its firing rate is extremely slow.\n\n\\* cactus costs only 75 sun, so it's no longer outright bad, but its firing rate is extremely slow.\n\nAnd so on.\n\nIt gave this fun but laid back game a lot of new strategic depth!",
            "It's in your camp of \"towers around a road\" in some ways, but the only tower defence I enjoyed more is Defense Grid.  Quirky, fun and most levels give you lots of room to strategise and try different layouts and tower mixes.  Highly recommend.",
            "one of the best games ever made, original, fun, replayable, one time purchase, low requirements age wise for entry (my 5year old is having a blast with it...)\n\ni played part 2 on mobile (and recently on android emulators) and had good fun, yes its riddled with microtransactions but honestly at the time nothing really got that itch.. and you can play the game just fine without spending anything\n\n\n\nand 3 just came out very recently",
            "The multiplayer mode that was exclusive to DS and Console versions is so peak its not funny",
            "lol try ps1 Driver intro",
            "One other game that has excellent progression: The Witness. The puzzles are designed to be self explanatory if you play the sequence from the start, it slowly cranks up the difficulty, kind of a masterwork in puzzle design.",
            "It's one of the games I've revisited the most. It is such a good game. Happy to see it mentioned here.",
            "any chance i could be pointed in the right direction for an original apk? i'd love for my son to experience it as it should be and not riddled with ads.",
            "PvZ is one of the very few perfect games. Gamers, non-gamers, seemed like almost anyone who touched it walked away a fan. Such a tragedy that it not only had its sequel ruined but that EA seems determined to block it from ever being released again. My tinfoil hat theory is that EA can't release it for modern systems because it would kill all their other tower-defense properties by comparison.",
            "Still a 10 out of 10 game even though EA seems to pretend it doesn't exist. I am still cross about what they did to PopCap.\n\nFor years Plants Versus Zombies 1 was my go-to recommendation whenever some one asked for a game for their non gamer friend / partner/ parent etc. It is one of those unique games that appeals to everyone from newbies to hard core.",
            "I love that game too!",
            "> As a final question: is there any other tower defense similar to PvZ you recomment? Which other games would you say have a similar difficulty curve?\n\nKingdom Rush's difficulty curve is pretty good. If you abuse teslas it becomes too easy the moment you get them, though.",
            "Bloons TD is brilliant as well.",
            "It's a super fun game but I found it laughably easy, there isn't really much strategy involved, even replaying and choosing your own plants it's pretty trivial. One or two extended game modes are a little tricky but that's the extent of it",
            "what happened to Popcap? ZvP wasn't my cup of tea, but Zuma was perfect for what it was",
            "Some games have been playtested to death, which have made them balanced perfectly for player engagement. Bejeweled is another good example. Designers of the game playtested the game tons, finding exactly the score requirements needed for each level so that a level would end and the player would win as soon as they even started to get slightly bored.",
            "I just loaded this up again after years not touching it, and it won't go full screen. Anyone have this experience?",
            "the game itself is the tutorial for the other challenges\n\nthe best damn game ever, a close second is /r/TheWitness",
            "I've never agreed with something in gaming so much in my life",
            "What a game!",
            " Best difficulty curve out of every game every? Bro it's \"curve\" is a flat line. If anything it's a slope down as it only gets easier once you have access to more plants.",
            "It's unbelievable how much of an unplayable train wreck the sequel was.",
            "The golden era of mobile gaming back when the ipod touches first rolled out. Games were made for pure enjoyment and sold for like $1-5 with no microtransactions. PvZ, fruit ninja, so many others. ",
            "Seriously. The really awful part is that PvZ 2 has a *ton* of content, but it's mobile-only and absolutely riddled with microtransactions. Basically unplayable.\n\nThere are hacked APKs you can download for it, but... fuck, I wish it had gotten a proper sequel.",
            "Laura Shigihara is a treasure.",
            "[The whole OST is amazing, especially Graze the Roof](https://www.youtube.com/watch?v=u9xSFk1ZDgw)",
            "I had no idea this existed, i certainly didn't expect such a chill song as well, and that football player is killing me.",
            "You are absolutely correct, the fog made those levels way harder than even the final stages.",
            "Then you probably played badly as the whole game is just a slow increase in difficulty and complexity. Honestly the only point where I think it *hard* is the second to last level. Specially if you don't have 9 slots",
            "im sad about pretty much every other popcap IP too. I would love to buy the bookworm adventures series but that's looking like it's never going to happen",
            "maybe you're thinking of cohesive?",
            "Yeah I agree with this. I’ve always found the game to be on the easier side, and I’m not a regular tower defence player. But I enjoyed finding a pattern that could handle pretty much scenario, even if it meant just putting down the same plants 80% of the time.",
            "It's great for non gamers",
            "This is pretty spot on.  Great game and fun, but a lot of levels are sufficiently the same that I just spend the time working on having a perfect layout or producing way too much sun, or seeing how long I can delay on spending so I can jump directly to gatlings",
            "I'm guessing not everyone has an intuitive sense of the game.  I agree, where and what you place in the lanes doesn't vary, regardless of setting.  Production on the last row. Barriers towards the front.  Offense in the middle.\n\nThe only variations on the overall strategy are usually defeated with whichever plant is introduced after seeing the new variation.  The only zombie that poses the biggest issue to me is the digger zombie.  However, that is more about which plants to use to get rid of them quickly.",
            "I actually had more fun playing PvZ 2 at lauch because difficulty ramped up a lot quicker in that game. Levels were challenging enough that it felt satisfying when I beat them, but not enough to be frustrating.\n\nThough the later maps that got added in updates got too hard and I couldn't beat them without following videos on Youtube. So I dropped the game.",
            "Only question is how quick you see the basic setup. People coming to it without that already in their bags, probably going to have more fun figuring it out.",
            "I tried a mod similar, i think it was called \"Replanted\".  \nSadly it is bugged and the bungee zombies are both literally unkillable and take a full minute to pull away, meaning that anywhere they station themselves becomes a zombie spawn point. Which is bad if said spot is the back row.",
            "I'll look it out, thanks",
            "Oh yeah, I've heard about it. Overall puzzle games have great progression, probably because of how controlled how few elements there are. Portal 1 and 2 also excel in that",
            "I have some very old pirated copy still installed on my phone which works. I can upload it on my gdrive if you want.\n\nedit: here ya go\n\nhttps://drive.google.com/drive/folders/156TNhcVMauqS2WNBnL3owJxrkmEguaX1?usp=drive_link",
            "> not riddled with ads.\n\nI paid for the no ads version on Android, that no longer works so I turned the WIFI off while playing and that does the same, no ads.",
            "I tried Kingdom Rush and it entees in the \"put towers at the side of a road\" category, sorry",
            "EA happened",
            "Yeap, that's the case with Valve games, for example, as Mark Brown said in his video last year",
            "The sequel was solid, but their efforts to add microtransactions and make it multiplayer-ish with pay-to-win really screwed it over.",
            "I thought the sequel was alright actually. Yeah not nearly as great as the original but still fun. It offered a lot of variety in how to complete levels and challenges. They also overhauled the game like a year or two after release.",
            "Infinity Blade, zombieville USA, Fieldrunners, Battleheart, doodle jump, Jetpack Joyride, Angry Birds, sheesh lots of great titles",
            "PvZ was a PC game ported to phone, it wasnt a phone first game.",
            "Don't forget Galaxy on Fire 2, an actual proper game in an established PC genre fitted for mobile and not just a small flash game concept.\n\nAlso EA (of all companies) made good ports like Red Alert iOS and Sim City for phones.",
            "You can currently buy Slice and Dice and just play with no microtransactions. One of the best mobile games ever made, and it starts with a free trial. If you like it you just pay to unlock the rest of the game and keep your progress.",
            "And even if you DO get a hacked APK, you still have to dance around the design meant for microtransactions.",
            "I can't imagine how you could even patch it. It's entirely designed around pay-to-win. Pay enough and you win. Don't pay and eventually it will be impossible to win. You'd have to playtest exactly how much premium currency you should have available to spend on each level to make it appropriately challenging.",
            "Every song in this game is so damn good. She killed it.",
            "She made a sad but wonderful little RPGMaker game called Rakuen that I highly recommend, about the victims of the Fukushima nuclear disaster.\n\nIt will especially appeal to you if you're familiar with To The Moon or Spiritfarer.\n\nI discovered her after she sang the brief line of lyrics at the end of Deltarune chapter 1.",
            "It's somehow chill and hype at the same time",
            "It plays along with the video when you beat the game",
            "yeah no way I played good at that time",
            "In those cases I resort to \"the other option\"... It's only fair",
            "the main campaign is very easy and casual from start to end, and doesn't really ask you to develop strategies much deeper than the ones taught to you in the first 3 levels. just like portal, nearly the entirety of the main campaign is just well-designed tutorials. \"here's a new mechanic, here's a new challenge for you to solve, now you know how to use this plant and how to counter this zombie.\" \"here's a fun minigame to mix things up that's nearly impossible to lose.\" but once you get to the end, you've finally learned the basics of everything the game has to offer. then it can truly set you loose and put all you've learned to the test.\n\nthe real meat of the game is everything after the main story. now that the game knows you know everything; it can throw you in tougher challenges, send a greater variety of zombie types that test your ability to make a well-rounded deck instead of just picking the one plant that counters the one new zombie, and it can take all those side modes and really ramp them up so they become interesting twists that prompt completely new strategies. niche plants that go previously overlooked in the main campaign like instas, garlic, and nighttime plants are given more time to shine in modes that demand their unique capabilities.  the game has a wide variety of things to offer that challenges the basic strategy of sunflowers/peashooters/walnuts.\n\nits still not *that* hard of course. its a pretty simple casual game. but there is a lot of strategic depth and optimizations to be made once you're pushed to seek them out. i'd imagine this is the reason PVZ2 still maintains a dedicated fanbase after all these years; even though everyone knows its a disgraceful, money-grubbing, overly-grindy, shitty mobile game. since its so endlessly grindy and full of \"content\", there is a lot of time and room to have players develop interesting and varied strategies to keep things fresh for thousands of hours. ~~or maybe because its a shitty mobile game designed to psychologically manipulate you into forming unhealthy habits and playing it every day even though you don't really like it. that too.~~",
            "Can't go wrong - it's pretty cheap these days and you get a ton of playtime out of it, including multiple modes on every level and gold-silver-bronze achievements, plus extra DLC levels... one of the few games I've enjoyed enough to get every single gold achievement on.\n\n(Sadly the sequel kind of sucked in my view, which was a bit weird).",
            "It is an excellent recommendation. The only two tower defense games I've enjoyed after pvz are defense grid and kingdom rush.\n\nHave fun!",
            "i really appreciate you pal. thank you!",
            "Maybe I played it too early. It felt impossible to beat when I played it shortly after it came out.",
            "Just throwing this out there, but some insane madman just ported Infinity Blade 1 to PC. I just played it last week. It was amazing. Pure nostalgia but surprisingly the gameplay somewhat held up too.",
            "Did you just skip Peggle?",
            "Heck, Cut the Rope started an entire series of games I gladly paid for back then.",
            "It is beatable, actually. Well, before they added new harder levels anyway, that's when I played. Before that upgrade system. Some levels are very hard, but still doable.\n\nThe worst part is that it has some good ideas about it, lots of fun enemies and plants; fun gimmicks, but it is ultimately ruined by mtx live service bullshit.",
            "“everything’s alright” is such a good song",
            "Rakuen wasn't an amazing game, IMHO, and the music isn't her best, but the overall message is very good and the ending is maybe the biggest tearjerker of my entire life.",
            "The deltarune credits were so good, happy to hear she did two series defining video game songs with lyrics",
            "not on the mobile version anymore unfortunately. Made me straight up depressed when i finished it after almost a decade and it went straight to the credits. fuck EA",
            "I played it too, it was amazing, and even got to uncover new things in the game I never saw before thanks to save editing. I hope they port the second one someday.",
            "I mostly played Peggle when on flight paths in WoW",
            "Maybe there was an intermediate point. I played it shortly after release, and I got hard walled by levels that seemed impossible without using the premium items."
        ]
    },
    "Castle on the Coast is a delightful platformer": {
        "title": "Castle on the Coast is a delightful platformer",
        "score": 13,
        "url": "https://www.reddit.com/r/patientgamers/comments/1dl44c8/castle_on_the_coast_is_a_delightful_platformer/",
        "content": "Do you like platformers? Collect-a-thons? Parkour? Giraffes?\n \nIf you answered yes to any of these then I have the game for you!\n \nCastle on the Coast is simple 3D platformer designed for kids or those new to the genre but the gameplay is such a joy that anyone who likes platformers and collect-a-thon games will have fun.\n \nYou’re playing as George, the mascot of Valley Children’s Healthcare. He’s a goofy giraffe who is also a parkour artist.\n \nThe gameplay is tight and the controls are perfect. Think Mario 64, you have a triple jump, can wall jump, spin, dive, wallclimb, and can even unlock a jetpack at one point. Without much difficulty you can make George do whatever you want.\n \nThere are a few aspects of this game that really made it unique and a joy to play:\n \n* You can turn off invisible walls\n \nYes that’s right, the devs had the foresight to allow the player to turn off those pesky invisible walls if they so choose.\n \nI like this design choice for a number of reasons. If you see an area, you should be able to go there, jankiness be damned. Sure the textures, models and skybox might pop in and out until you get to a stable area, but it give you a level of freedom seldom seen in most games. There are even a few achievements based around breaking the game! In fact, you can just skip the entire game and go right to the final boss if you choose.\n \n* Controls are fluid\n \nNothing tanks a game harder than poor controls. Here the controls are fluid and setup to maximize the fun. George is responsive and you can parkour him anywhere with minimal effort.\n \n* Aggressive checkpoints\n \nIts not easy to die in this game but it does happen. But no fear, checkpoints are everywhere so if you do you wont be going too far back, you’ll be able to pick up where you left off.\n \nMy only complain with the game is navigating the castle can be sometimes be tricky. You use warp zones to get from one place to the next and they are not labeled, you just have to figure it out on your own. I spent a lot of time getting lost in the netherworld just trying to get from one place to the next.\n \nThe closest game I have placed recently that I can compare it to is Tinykin, except Castle on the Coast is way more janky but in a good way.\n \nOverall if you enjoy platformers, collect-a-thons and 3D movement based games then you should check out Castle on the Coast. It’s a much better game then you might think at first glance.",
        "num_comments": 5,
        "comments": [
            "Game is on sale in steam right now too...$2.99(us)  \nFigured I will give it a go. I usually don't like platformers, I just find them frustrating, but why not its only 3 bucks.",
            "Game looks fun and the art style isn't too shabby. However, whatever this writing style is, whether it be AI generated or just sloppy work, makes me want to gouge my own eyeballs out. I feel like a soccer mom is trying to explain to me how RADICAL orange juice is for the body with it's AWESOME NATURAL POWERS.\n\nYou can just throw up buzzwords and expect people to care. Your key points that kept you interested the most are NOT what I would approach people with to sell the game as interesting. Oh a platformer has good controls? Well holy hell man, I wouldn't have expected that.",
            "It was a neat and kinda janky little collectathon for the $0.60 I spent on it in the bundle. The story, what there was, had more heart than I'd expected.",
            "Or you can pick it up for $1, or for $2.99 with **4** other games in [Fanatical's Build Your Own Nexus Bundle](https://www.fanatical.com/en/pick-and-mix/build-your-own-nexus-bundle).  (It's how I got it myself, there are higher tiers with more games and lower per-game price, but I only found 5 games total that interested me.)",
            "Luckily you don’t really have to interact with the NPCs, but it’s a game designed for kids so I wouldn’t hold that against it. \n\nThe controls are better than most platformers. \n\nI made this post because many gamers would take one look at and say “no thanks” but it’s absolutely worth a play. \n\nMyself included, I wouldn’t have thought twice about playing this until a buddy suggested it. And I had a blast with the game"
        ]
    }
}