{
    "Persona 5's Subreddit FAQ": {
        "title": "Persona 5's Subreddit FAQ",
        "score": 66,
        "url": "https://www.reddit.com/r/Persona5/comments/1cjlilu/persona_5s_subreddit_faq/",
        "content": "**1. There's a lot of Persona 5 games! Which ones do I get?**\n---\n\n  It is recommended to start with Persona 5 Royal. Please note Royal specifically, not \"Persona 5.\" While a different game, it is missing content compared to Royal. \n\n  If you want to read more about the different games, please read below:\n\n  1. Persona 5 (P5) is the vanilla game, often called P5 Vanilla or base game. It goes from April to December in-game.\n\n  1. Persona 5 Royal (P5R) is the updated game, released after Persona 5. It has the base game + Royal contents, which is sprinkled within the base game and then has another semester in the January month.\n\n  Note that you can't use saves from P5 for P5R.\n\n  There are requirements to getting to the bulk of the Royal content, ie Third Semester/January.\n\n  1. Persona 5 Strikers (P5S), or Persona 5 Scramble: The Phantom Strikers, is a sequel to P5/P5R, but it doesn't mention P5R characters. It is a musou game similar to Dynasty Warriors.\n\n  If you want more P5 after beating the game, you can buy this next if the other Persona games don't interest you.\n\n  1. Persona 5 Tactica (P5T) is an SRPG compared to the previous games. It's set somewhere during February but before P5 Strikers.\n\n  You can play this game before or after P5S. This does not narratively affect P5S.\n\n  1. Persona 5 Dancing (P5D), or Persona 5: Dancing in Starlight, is a rhythm game where you watch characters dance.\n\n  It's not narratively connected to anything, but it is best played after P5/P5R.\n\n  1. Persona Q 2 (PQ2) is a dungeon crawling game in the vein of the Etheryian series that includes the Persona 3 (both the original [Remake a good one to play] and Portable) and Persona 4 casts.\n\n  Best played after the P3, P4, and the base game, but it is set around November, so you can play it after the 7th Palace.\n\n  It is only playable on the 3DS.\n\n  1. Persona 5 X (P5X) is a mobile gacha-game based on an alternate world. Its main cast is another set of Persona users in the P5 timeline, and the OG cast does make cameos. It first came from China is slowly releasing in Taiwan and Korea. \n\n  No official English version yet.\n\n**2. How do I access P5R's new content: Third Semester?**\n---\n\n  You only need to get Councillor to Rank 9 by 11/17. On 11/18, you'll get Rank 10 automatically as a cut-scene.\n\n  You may have heard Justice and Faith are required, but that's based on old news when P5R was just released. They give cutscenes, fleshing their characters.\n\n  For the True Ending, you do not need Justice nor Faith, but they give extra scenes.\n\n  For more information on Councillor, Faith, and Justice requirements for extra content, check this [spoiler comment](https://old.reddit.com/r/Persona5/comments/177o7sp/compiling_some_subreddit_guides_and_tips/k4w5m15/).\n\n  For more tips: \n\n  1. If you want to access both the Vanilla ending and Third Semester without replaying the game:\n      1. Create a back-up save file on 11/17 afternoon while Councillor is Rank 8. DO NOT LOSE THIS FILE.\n      2. DO NOT DO Councillor Rank 9 on 11/17. Instead, do something else on the main save file.\n      3. Proceed with the game into the Vanilla Ending.\n      4. Return to the save file from Step 1, and do Councillor Rank 9 on 11/17.\n      5. Proceed to Rank 10 on 11/18 and towards the Third Semester.\n\n  1. It's X-month! Will I make it to the Third Semester? \n      1. Unless it's very late into November, October and November has a lot of availability. Theoretically, there are 9 days in November before 11/17, but I highly suggest not to do this.\n\n**3. I need help on 5th Palace/Okumura's Boss!**\n---\n\n  Use the command !OkumuraGuide. You can also check the Guides on the sidebar for the same guide.\n\n  [Here is an example of how it works](https://old.reddit.com/r/Persona5/comments/1cjlilu/persona_5s_subreddit_faq/l2grg4i/)\n\n**4. I need help on the Royal/Third Semester Boss!**\n---\n\n  Check this [spoiler comment](https://old.reddit.com/r/Persona5/comments/16wbkkt/how_long_does_this_boss_take_to_beat/k2wxcxa/).\n\n**5. Guides**\n---\n\n  I typically use [GameFaqs for guides](https://gamefaqs.gamespot.com/ps4/260936-persona-5-royal/faqs/78212).\n\n  Thank you, u/ZOLTANstudios, for [google doc](https://docs.google.com/spreadsheets/d/1TLWmcW6PYv0T4Mcfwy18Xxh859q_GQtkkRa6KOV9Rog/edit?usp=sharing) that contains a list of Personas for tracking, traits, itemizations, etc.\n\n  Thank you, u/lazy_bread442, for [an optimized P5R NG+ Builds guide](https://old.reddit.com/r/Persona5/comments/hi1be8/p5r_new_game_plus_optimized_builds_with_steps/).\n\n  Thank you, u/bryanktr, for [a guide testing P5R's Battle Mechanics](https://old.reddit.com/r/Persona5/comments/gksz73/testing_p5rs_battle_mechanics_part_1_damage_boosts/).\n\n**6. Fusion Calculators**\n---\n\n  There are 2 main Royal calculators:\n      1. [aqiu384](https://aqiu384.github.io/megaten-fusion-tool/p5r/personas)\n      2. [Chinhodo](https://chinhodado.github.io/persona5_calculator/indexRoyal.html#/list)\n\n  I prefer using aqiu384's calculator since it also gives the level ranges for Treasure Demon fusions, which Chinhodo is missing.\n  aqiu384's calculator also has itemizations, skills, and they recently added a way to calculate how to get a specific Persona.\n\n**7. Need help with Maxing Confidants without a day-to-day guide?**\n---\n\n  Try reading this [guide](https://old.reddit.com/r/Persona5/comments/l3hicr/algorithm_to_maxing_all_confidants_in_a_single/?share_id=ZZi7GGl0EGSedByKPzOfW).",
        "num_comments": 33,
        "comments": [
            "*Tactica*’s actually set in February since it’s snowing & Ryuji mentions Maruki.",
            "Dont forget P5X since most people don’t know what it is and still have questions otherwise that’s a good post 😄",
            ">For the True Ending, you do not need Justice nor Faith, but they give extra scenes.\n\nIs it me or is there a confusion here between the third semester and the true ending?\n\n* Maruki (and only Maruki) unlocks the third semester. Without this, you proceed to the original vanilla ending;\n* Within the third semester, there are *multiple* endings—1/9 deal, 2/2 deal, spiderweb, just fucking dying, true ending (without Akechi), true ending (with Akechi)\n\nI quite often see people who are clearly asking how to get the \"most complete\" or \"best\" ending told that they don't need Akechi, which is untrue—you will get a cut-down version of the ending without him. You can get *into the third semester* without Akechi, but that's not the same as getting the true ending.\n\nIn short, should that line say \"for the third semester\"?",
            "!OkumuraGuide",
            "Thank you ",
            "Thanks for including my third semester boss guide! I edited it a bit for spelling and updated a couple small things for clarity.",
            "This is a great post",
            "You could add persona q2, it's a crossover but it's mostly the thieves",
            "Weird way you ordered the other games, putting Q2 first is odd considering it's probably the last thing you'd play directly after 5, I'd say Strikers being a direct sequel makes more sense there. The order is kinda arbitrary but still it impacts how it's read.",
            "WE DID IT CHAT",
            "> Please not Royal specifically, not \"Persona 5.\" \n\nis that not meant to be note?",
            "im probably to early in the game but how is the story later on because even though i like everything else i feel like the story is getting kinda repetitive(the two chapter felt really similar)",
            "I have bought *checks notes* all of them except x. Is there any news on it coming to the us? I installed the Korean one on my phone but i want an internationalized one",
            "Perfect.",
            "I normally don't go searching online for boss guides. Seeing the 5th Palace in the FAQ is kinda comforting ig.",
            "Cool, ty",
            "Ty, I'll add that in",
            "The true ending is >!you going into the station, the rest of the gang distracts while Maruki is your driver!<. That ending is something you get even if >!Akechi or Sumire!< are rank 10. Those two only adds more cutscenes, but they don't change the ending.",
            "For help or guide on Okumura, please check this post as well: [Guide 1](https://old.reddit.com/user/-MANGA-/comments/qoex27/copypaste_for_stuff/hjml6vy/) or [Guide 2](https://old.reddit.com/r/Persona5/comments/1837qde/revised_okumura_boss_strategy/). \n\nHaving issues on the last part of the boss?: https://old.reddit.com/r/Persona5/comments/177o7sp/compiling_some_subreddit_guides_and_tips/k872zaf/\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Persona5) if you have any questions or concerns.*",
            "Np, and thank you for your contribution!",
            "Thank you for reminding me. Do you have a description for PQ2? I'm not sure how to explain its brand of dungeon crawling.",
            "It is weird, yes. I need to work on reordering them.\n \nE: Reordered now. P5 > P5R > P5S > P5T > P5D > PQ2 > P5X",
            "oh tru ty",
            "If you mean in terms of story structure of:\n\n1. Find enemy\n\n1. Find Palace\n\n1. Explore Palace\n\n1. Take Treasure\n\n1. Free Time\n\nThen this is how it goes for each arc.",
            "No news yet",
            ">!The postcredit where Akechi appears at the station is part of the true ending!<. It's *certainly* something people asking \"how do I get the true ending\" should be told about.",
            "An spin-off for the 3ds that reunites the phantom thieves, the investigation team and SEES (+ p3p female protagonist) in a movie themed labyrinth with the ethrian odyssey gameplay",
            "No I meant more the story, it feels a bit too similar or maybe I'm just wrong",
            "Those cutscenes don't change the ending. They're extras.",
            "Ah the etherian games. Ty",
            "So if you came here and asked \"how do I get the true ending\" and people just made like there wasn't a missable postcredit scene, you wouldn't be pissed off?",
            "Again, it's not part of the true ending. Whether you get the extra or not doesn't affect it. We mention ranking up gives extra cutscenes.\n\nRank 10s of other non-team Confidants also give extra cutscenes in the >!Yaldy!< fight and when >!they all band together to free you!<. However, it doesn't change the fact >!you do get out of prision!<.",
            "That seems an absolutely remarkable position to me, that because it's a postcredit scene it's not part of the game ending. It's literally the final frames of the game. *No* other confidant gives extra scenes *within the game ending*. Yoshizawa doesn't, for instance.\n\nThere's literally someone on the sub as we speak asking \"how do I get the secret ending\" (that is, the one where >!Akechi appears at the station!<) and being told flat-out \"you only need Maruki for the true ending\".\n\nI know better than to think I'm going to change your mind, but that's misinformation. It's not answering the question the user asked. It is simply not true.\n\nedit: like, if you're really wedded to this \"the postcredit scene during the game ending that you only get if you get the true ending is not part of the true ending\" thing, then surely you could say \"there is a postcredit scene after the true ending that is longer if you max Akechi's confidant\" or something? But don't just mislead people, c'mon."
        ]
    },
    "kichijoji in real life ": {
        "title": "kichijoji in real life ",
        "score": 432,
        "url": "https://www.reddit.com/gallery/1dlmalq",
        "content": "",
        "num_comments": 35,
        "comments": [
            "Oh damn they put the place from persona in real life?",
            "Where's penguin sniper? I need to get my technical damage up.",
            "That is the city I live in. I've performed at the jazz club that you go to in game.",
            "Will I encounter Kawakami Sensei when I come here at night?\n\nhttps://preview.redd.it/bkc9d6npq18d1.jpeg?width=4000&format=pjpg&auto=webp&s=cec3f6261597cd61768ad080768fca51eaa694bc",
            "Huh, they have Shakey's Pizza in Japan",
            "Inokashira Park In the game, you can invite girls to come here for a date Actually, Japanese people also like to invite their partners to come here for a date As a single man, it is time to go home now ( ´\\_ゝ\\`)\n\nhttps://preview.redd.it/q32xiczsd28d1.jpeg?width=4000&format=pjpg&auto=webp&s=6053f1317b3297767dfeee49daba51d48d0c9e62",
            "was someone following you?",
            "I wish more games did stuff like that \nI wonder how accurate the strikers locations are",
            "Wait, you're telling me Tokyo is real‽‽‽",
            "I love this place so much and hope to visit someday, the first picture reminded me of Makoto spying on Joker hiding her face behind a book lol. Thank you for sharing:)",
            "persona 5, in REAL LIFE?? 🤯",
            "Yo this is just like Persona 5!!\n\nJokes aside, I’m planning a trip to Japan for August 2025. We want to see pretty much every one of the major places in Persona 5 while we’re there.",
            "Yeah. Persona 5 location is base on real life. Some places not though like cafe Leblanc.",
            "I heat that they did the same with Yongen-Jaya and Shibuya as well",
            "Here it is\n\nhttps://preview.redd.it/qwewbnpjw18d1.png?width=1080&format=pjpg&auto=webp&s=b4f5189ec0fa3b58b688d4a2eb3e05f563483bd8",
            "Really? I am also a resident of Musashino City. But I searched for a long time and couldn't find where the jazz club was.",
            "How did it feel when you did?",
            "I loved your performance in \"no more what ifs\"     \nKeep up the good work!",
            "John Shakey's actually invented Earthquakes first, then travelled to Japan and opened his pizza stores as an apology for his first invention",
            "I thought Shakey's was a Filipino chain",
            "I used to go there to binge eat",
            "I went there on a date with my Japanese girlfriend 6 weeks ago, its nice. There is a temple there, a zoo and also studio ghibli museum. If you ride a boat then the couple is meant to break up, my gf didn't want to ride a boat as I found out she is scared of birds in the lake.",
            "it looks cute. oh man don’t feel sad,you can still go with the homies and have fun !!",
            "Makoto Senpai...😳",
            "Strikers is pretty accurate for the main city attractions. The Yakuza games do this all the time too",
            "Can't testify for most of the locations, but sendai was spot on. I lived around Miyagi prefecture (Sendai is the capital)  for a couple years, and went to Sendai frequently. Felt like I was right back in the city",
            "For real!?",
            "They took it one step further and made an ENTIRE ISLAND based on Persona called “Japan”. It’s basically one giant MegaTen theme park with beef bowls and trains and everything.",
            "[Its like two blocks north of the station. ](https://www.sometime.co.jp/sometime/index.html)",
            "[Cool, its smaller than in game.](https://www.youtube.com/watch?app=desktop&v=dmAXuLfdypw) Its like a lot of other intimate jazz clubs where you are kinda surrounded by people and not up on a stage.",
            "Yes, half a year ago I invited my female classmates to play boating here, but was rejected. Finally I invited my homies to play here",
            "Yeah but they spelled the name wrong and named it Sangen-Jaya :/ \n\nFake persona fans smh",
            "Appreciate it!",
            "Do you have more videos of that jazz club?",
            "Are you sure they aren’t REAL persona fans? Everyone knows they haven’t played the games"
        ]
    },
    "My fem!ryuji cosplay for supernova!": {
        "title": "My fem!ryuji cosplay for supernova!",
        "score": 87,
        "url": "https://www.reddit.com/gallery/1dlqckp",
        "content": "",
        "num_comments": 4,
        "comments": [
            "That purse is a great choice for FemRyuji!",
            "Spectacular",
            "https://preview.redd.it/um2a3vl1p38d1.jpeg?width=748&format=pjpg&auto=webp&s=180bdd5fc18cfc713f4ddb1baa15bf0aaca91720",
            "What's bonkin'?"
        ]
    },
    "The trifecta is complete": {
        "title": "The trifecta is complete",
        "score": 403,
        "url": "https://i.redd.it/vi2x4ylud08d1.jpeg",
        "content": "I'm aint a collector in anyway, to broke for that, but finally having all 3 games is something im really happy about",
        "num_comments": 24,
        "comments": [
            "You still miss this\n\nhttps://preview.redd.it/1sqxj41eo08d1.jpeg?width=1219&format=pjpg&auto=webp&s=261c88e35de839a9cc76310cdc43c6d87ed72789",
            "Lucky I still only own the first game",
            "Aww yea",
            "https://preview.redd.it/hcnque3fu18d1.jpeg?width=3024&format=pjpg&auto=webp&s=2b6528ab75ef1358abeea6cbaf44e900ec7b08f7\n\nSame. I just want the dancing games on Switch.",
            "the downside of being a pc player is that i dont get physical copies ☹",
            "What's the difference between persona 5 royal for ps5 and the ps4 one?",
            "P5S is the best sequel.",
            "Is Tactica worth it?",
            "W collection",
            "Now we are the Persona 3- I mean 5",
            "Missing Dancing in Starlight and PQ2",
            "Guys I'm broke af, i'm not buying Q2 or Moonlight or japanese imports😂, i got good deals on these games, and finally playing Persona 5 Royal after it being in my backlog for 4 years has led me to rediscover my passion for gaming again, i got the 3 for good prices like 100$ for all 3",
            "![gif](giphy|zLsGYDq7ZpOkU|downsized)",
            "😂 my wallet to me to look away, i dont plan on getting into vr but if i do it'll be the first game i get",
            "You could buy blank cases and print out the covers, if you want the visual/physical representation",
            "I wonder if you can get posters for them.",
            "Frame rate",
            "not much, just (slightly) \"better\" graphics, faster loading and \"clearer\" colors in the game itself. \n\nlargely due to the machine it's being played on being heavier at processing, not due to the game itself being any better, btw",
            "Exactly what I want to hear. Going to play it soon.",
            "Careful, i'm slowly getting convinced to pick starlight and the og P5",
            "Vr not required. It's just an option. Still a decent rhythm game for a fan of persona 5",
            "Yup VR is optional",
            "Ssshhhhh dont tell me that",
            "Let's add P4D and P3D to the mix."
        ]
    },
    "I’m curious about Romance": {
        "title": "I’m curious about Romance",
        "score": 450,
        "url": "https://i.redd.it/ma4uducsbz7d1.jpeg",
        "content": "First of all, I’m still new to Persona. I’ve finished P3R, and I’m so impressed with this series, so I continue with P5R for my second game in this series. Then my fyp started to introduce the persona content and I just saw someone hating on Kawakami because she groomed Joker, and this should work with the rest of the romance adult confidant. Isn’t the romance optional in-game? or do they just hate them because of their headcanon? While romancing minor confidants, those haters will be like, Eww, they’re minors. How dare you, pedo? Like when it’s adult confidants, they blame characters because MC is groomed, and then with minor confidants, they blame the player who’s controlling MC to romance them. I don’t get what they want and how I’m supposed to act or they can’t just enjoy the game?. What’s wrong with that, I’m confused.",
        "num_comments": 55,
        "comments": [
            "people will always inject their personal bias and subjective feelings into media but no one actually cares about who you choose to romance in games\n\nand you shouldn't care if anyone does care about your choice of romance in games",
            "Just play however you want, it's a single-player experience. Do what you think would be fun. People get too up their own ass about the optional romance scenes. If you want to see it for whatever reason, just do the route. If you don't want to see it or don't agree with it, don't choose the romance. And definitely don't let someone else's opinion stop you from having the type of game experience you want for yourself.",
            "Just ignore them, they're just clowns who have nothing better to do than to pester people about what they choose to do in a video game.",
            "The best part about single-player games is that no one can see how you play",
            "Ignore what others say man. Just enjoy ur play through",
            "those people just need something to be angry at to feel any sense of purpose , most of them are either trolls , projecting or just stupid. You can't resonate with them on that subject because they are unable to tell fiction and reality appart. TLDR just ignore them",
            "https://preview.redd.it/fqv1gluioz7d1.jpeg?width=1224&format=pjpg&auto=webp&s=ab07e13efd8ef055113c76952016f66ce8dcb7d5",
            "Don't worry about anyone else's opinions, someone will get offended over whoever you decide to romance.  Just go with whoever you want and be happy.\n\nJust don't romance multiple girls at once, it will bite you in the rear.",
            "Date whoever you want, ship whoever you want. People are free to dislike and disagree with certain options for whatever reasons but you’re also free to ignore them, and I’d advise you do. As far as these games are concerned every option is equally as valid, and ultimately the plausibility of and outcomes for these romances are up to you to determine.",
            "A lot of people are super biased about the romancing. I would say play however you feel like playing. For example, if you date Futaba in-game (which some players hate), that’s fine too! Its a bit of a roleplaying game for the most part and Joker is like 16 or 17.\n\nYou could also choose all of them and see what’s what, but you better prepare for the consequences in the future.",
            "Reject the opinions of internet strangers, Embrace romancing your hot homeroom teacher",
            "While the canon is that of a highschooler, they do provide options for all audiences playing persona. \n\nGatekeepers are stupid and you should ignore them. If you think Kawakami is hot, fuckin go for it. If you think Futaba is hot, also go for it.\n\nPlus if you were to show me all of the characters in persona and say they were based in universities, I would probably believe you. A lot of anime in general tends to have that strange trope.",
            "Some people like being upset. This is true even outside of PS5. You can't make sense of nonsense because that's by design, and lets them stay upset.",
            "I believe it's the developers inclusion that they have a problem with, which is perfectly valid. I also find the decision kinda icky.\n\nJust because I'm not forced to engage with the content doesn't mean you can't still have problems with said content.",
            "People take this shit way too seriously and romance discussions often feel more heated than political discussions. Either way, you get a lot of name calling and bad faith arguments from both. Personally, if someone is romancing Kawakami, I'm going to assume they're doing so because they're romancing as themselves...unless their arguments are unironically defending pedophilia, which some do.\n\nLikewise, if someone romances one of the thieves, I'm going to assume they're doing it because they think that character works best as Ren...unless they're horny posting in a way that makes it clear it's for their own personal pleasure. And some people do that too. The pedophilia from both sides is creepy, but it doesn't make up all the shippers on either end.\n\nPersonally I'm in the camp that likes to pair characters together. I really don't get the appeal in \"romancing as yourself\" especially since the romances aren't written to accommodate that mindset. But I don't begrudge anyone who does want to play the game that way either.",
            "Hey man, welcome to the club. Anime characters aren't real, but some people will be mad for the sake of being mad and apply real world rules on anime character.\n\nThis is as stupid as seeing a criminal in a movie stealing a car, they start crying and bitching cause stealing is bad, like bruh... no shit.\n\nYou don't have to like all the characters, but stories are for the sake of telling stories.",
            "How you approach the subject of a romantic partner depends on how you see the game. Some people envision themselves in that situation, and under the assumption that they're 20+, they would prefer to pursue relationships with people their age and feel icky about doing so with high-school aged people. Others morph their perspective to fit the role of the high school student and will thus flip the script; they'll want Akiren to date a fellow high schooler and not want an adult-teen romance on their conscience. Others still simply won't care either way and won't prescribe real world morality to a fantasy game. Others yet still will abstain from romance altogether for any number of reasons. The game was built with all different approaches, hence why all these options exist, and none of them are the one and only correct way of viewing the game. What you're seeing in action are the various sides of the community refusing to acknowledge the others as valid, so it's a fools errand figuring out who's right when none of them are. Just play the game however feels right to you.",
            "thats a good take on it, my advise is to not give much of a fuck to any of that, there is a lot of people in the internet on the lookout to be offended by something.",
            "Truthfully, just ignore them. Play the game, romance who you want. Heck if your a completionist romance everyone. Those people cant be happy and simply can't enjoy the game.",
            "**I'm not sure what the question being asked is?**\nAnyway.\n\n* Yes kawakami (Your teacher) is a Romance. \n\n* Yes its 100% Optional as are all the Romances. \n\nAnyone who would say that Ren (Joker) is a groomed character is clearly someone who should have their opinion card taken away. That or they have never played Persona 5. \n\nKawakami for me is second best girl right after Futaba.\nIts a video game at the end of the day, so its not that big of a deal. \nRegardless Op Have fun with P5 its really good.\n\nLastly!\nIt should go without saying but... If you are a Minor In real life, plz dont date adults. If you are an adult in real life, plz dont date a Minor.",
            "This is one of my favorite games of all time; and I think it’s weird that you can romance adults as a child. Just let me be an adult in one of these games already.",
            "Kawakami is MVP. She'll come over and give you a massage on your hardest days, so you can go out and spend time with someone else.",
            "Kawamommy For Life And Secondly it's your game bro so do what you want and unlike kamoshida it's up to you as the player to do it so if you don't like that sort of stuff just steer clear of them my guy it's your game not theirs.",
            "If you like the any romance confidant and want to ship with them, just go. People have different opinions and preferences, so of they don’t like certain confidant doesn’t mean you have to follow them.",
            "Just romance qho ever you want, every romanceable option can be questioned either by you being a pedo, the romanceable one being a pedo etc, but all in all, ots just a game and joker isnt getting groomed and you are not a pedo for interacting with minors inside of the game",
            "It's optional \n\nPeople are just upset it's an option at all",
            "Enjoy the game however the hell you want, really. It's more of a debate within the canon of how things work where you take the character at face value, but your own experience is your own experience.",
            "That’s just kinda the thing. Lots of people view lots of things differently, so yeah. I personally don’t like the adult confidants because even if they are optional, there still at heart the same people, so yeah… and also most of the subject matter in them is weird. And also I always found those whole arguments against people who romance the minors weird cause like, your playing the role of a 16-17 year old, it makes sense that you would date someone in your age range.",
            "It's optional. If you played P3R, then you know Ken right? In the portable version, Femc can romance Ken. I just skip all the guy social links lmao. There's also an option to reject them. It'll break the link though. But that's only in Persona 3 i think.\n\n>!Shinji is my romance for FeMC!<\n\nJust enjoy the game. I romance all of them on my second playthrough of P5R. Lmao cause why not.",
            "Yeah those people are stupid. My personal head cannon is that joker can date anyone around his age, because the adults would amount to pedophilia. But that’s my personal head cannon and unlike the people who complain, I don’t care about who other people choose to romance. It’s just a very good game, not real life",
            "What is love?",
            "I think its weird that the devs included it but if you want to romance the teacher that is 100% your business",
            "Joker is underage, so dating younger characters isn't that of a big deal to me.\n\nI have always been attracted to older women when I was young. If there weren't any laws regarding that, then I would've dated older women back then.\n\nAll that I'm saying is that I don't mind what others think of the game; I'd like to enjoy it through my own lenses",
            "If you really want to get groomed by the teacher, do it. No one can stop you",
            "It is groom or to be groomed",
            "It’s just a game, people are chronically online. Don’t worry too much about it",
            "I personally could not romance some characters because it would feel weird; one of them feels too much like a sister, some of them are creepy adults. But that's just me. I got no problem with anyone's choices, and no one should. It says nothing about you as a person, it's just about which characters you like.",
            "I think it’s fine to not like the inclusion of it. Though I think it’s mainly for people who don’t wanna romance high schoolers. But I think people often underlook Kawakamis character because of it",
            "One group says you shouldn’t romance the teens because they’re underage. Another group says you shouldn’t romance the adults because Joker’s underage. \n\nBased people know they’re just cgi models on a screen",
            "I heard the game instantly sends a signal to your nearest law enforcement agency and puts you on the infamous list depending on your choice.",
            "The only real choice is to romance everybody and let the haters square that circle.",
            "Look at them, wandering around like a clown.",
            "That means there a tons of players romancing Futaba and the fandom doesn't even notice and honestly I think it's better that way.",
            "I named my Joker \"F***ing Kawakami\" just so the classes knew who I was going to romance.",
            "It's so weird that the first arc of the game is \"This teacher is despicable because he wants to date students!\" and then later there's the option to date Kawakami. It feels inconstant.",
            "3 dots connect to a rectangle",
            "Until I read the subtitles, I thought Junpei was saying \"clowning around like a clown\" and I was all, how else would a clown act?",
            "You just made my day.",
            "Yeah. It’s a good storyline imo but she’s not my favorite LI",
            "For me, my personal issue is that Futaba should be with anyone BUT Joker. I could see her with Yusuke, Ann, Ryuji, Kasumi, et cetera, but... Joker just feels like they're better as friends tbh.",
            "Yoshizawa going “You’re… F***ing Kawakami, yes?”",
            "Just saying kamoshida raped and sexually harassed the female students i don't think its comparable",
            "The teacher is despicable for way more beyond dating the students but yeah",
            "Unfortunately I suspect for many particularly male players, combined with the maid outfit its a fantasy element.",
            "\"Indeed I am\"."
        ]
    }
}