{
    "My ex husband screwed himself out of a grand life": {
        "title": "My ex husband screwed himself out of a grand life",
        "score": 1475,
        "url": "https://www.reddit.com/r/pettyrevenge/comments/1dlnoi4/my_ex_husband_screwed_himself_out_of_a_grand_life/",
        "content": "I don't browse Reddit often, but I do listen to r/slash at work, and some of my favorites are from here. I have a story that isn't too terribly crazy, but definitely fits here. \n\nMy ex husband was a PROBLEM. I didn't mind the myriad of health conditions he had, but the fact that he refused to take care of himself was the real issue. Especially when his problems caused me to lose the very little sleep I was going to get. \n\nI worked for a terrible corporate security firm that really doesn't care about its employees. I was the single field supervisor in my region, and on top of my regular 40 hour work week, I also was called on emergency to fill open positions. This was during the height of covid as well, which eventually put me at a regular 80-100 hours per 7 day work week. The money was incredible, but I was miserably exhausted. \n\nAt the time, my husband was working part time and receiving SSI, and spending all of his income on himself. Video games and fast food, against his doctor's orders, while I paid both of our shares of the bills, car payment, insurance, phones, etc. This went on for about 3 years, getting progressively worse as time went on. \n\nDespite the amount of money I covered for him, I still managed to bump my credit by paying off my car and saved enough to buy a house. Nothing too fancy, but it's a 2 story with an unfinished basement, plenty of space, decent sized yard, creek, and really cool neighbors who constantly invite us over to drink and play pool. \n\nWhile moving, I was still working 80+ hours and couldn't spare time to help much, but I paid for the moving truck and dinner for anyone willing to help us pack up and move. I asked my then-husband to make sure everything gets packed. \n\nHe packed ALL of his own belongings, then the household furniture, then ignored whatever didn't fit, was late returning the moving truck, and I had to call about the fee (which they were very kind enough to waive considering my circumstances). \n\nThe result was that the majority of my stuff, my roommate's stuff, and my brother's stuff didn't fit in the moving truck. My brother was making trips every day after work to pick up a car load and bring it home. I asked my ex husband to please do the same, and he agreed. \n\nTHREE WEEKS LATER I finally got a day off. I worked a 12 hour shift and planned to go pack up a few boxes and take them home while I was out. I walked into the house and saw that my ex had literally done nothing. Three weeks he said he had been moving our stuff and he hadn't touched a thing. \n\nI had a meltdown. My legs gave out from shock and I sobbed on the stairs. \n\nMy roommate and best friend happened to also come in right after me, and found me on the stairs. He held me while I cried and assured me he would take a few days off to get everything packed up and moved. He told me to go home and sleep, but I told him I'm already here so I might as well take a few boxes, since my worthless husband lied to me about doing so. He helped me pack up some things and I drove home. I didn't even bother to unload it, I went inside and collapsed on my bed and cried myself to sleep. \n\nHours and hours later, I finally woke up, a groggy mess, and made my way out to my car to start unloading. Best friend was there unloading his own car with a tired smile. He had been going all day and the sun was setting. Meanwhile, my husband was slacking off in the basement doing who knows what, breaking his promise. \n\nWe managed to get everything moved, but I had to extend the lease by one week and pay a prorated rental cost, all due to my husband's neglect. I was quickly racking up anger at him, and finally when we were moved, I sat him down and told him how angry I was about the lies and his laziness and what he caused. He started accusing me of all kinds of things in return, like how I wouldn't passionately hug him because of his medical issues. \n\nI lost it. \n\nI screamed at him that I don't passionately hug anyone, I don't even passionately hug myself, because  I'm working the equivalent of 2 jobs with overtime to support his lazy butt and pay for his lifestyle because he wastes all of his money on fast food that he shouldn't even be eating and video games, and because he doesn't lift a single finger to do anything around the house like unpacking, cooking, cleaning, nothing to make my life easier. In fact, he is actively making my life harder. I'm still cleaning up after him when he leaves dishes everywhere and stains in my carpet. So no, I don't want to passionately hug him if he's not going to do anything to earn it. \n\nHe went radio silent on me for two weeks. It got progressively worse. He wouldn't text me or speak to me, wouldn't answer my calls, and eventually wouldn't even look at me. Meanwhile, he's still living off my money. So finally one day I message him to ask him why he's treating me this way, and he ignores me. I ask several other questions, nothing. Finally, I tell him that if he hates me so much, he should just divorce me. \n\nHe tells me the next day he wants a divorce. \n\nI ask him why. \n\nYou're not going to believe his answer...\n\n\"You don't do enough for me.\"\n\nOH BOY DID HE MESS UP. \n\nI tell you, this ding dong is the absolute most obtuse, smooth-brained, intellectually deficient, situationally unaware, half-witted, opossum-brained clod to say that. \n\nI unleashed it. \n\nI told him that I do EVERYTHING for him, I pay for EVERYTHING so he can live the cushy life, I give him a roof over his head, food in his belly, money in his bank account (because at this point I was also giving him extra money whenever he asked), and taking days off specifically to spend time with him, that I was doing absolutely EVERYTHING for HIM, and this is the repayment I get. I got extremely quiet and bucked into his chest, pointing my finger at his face, and told him that since he wanted the divorce, he had to file, and if he even suggested at forcing me to sell my house that I paid for, I would destroy him. I would hire an expensive lawyer, force him into the longest court battle of his life, and take him for every single penny he would ever earn for the rest of his life along with court costs. Then I kicked him out. \n\nHe moved out. He told me he was moving in with his family a few cities over and asked me to file. I filed in my county because it was closest. \n\nHe RAGED at me when he found out. He wanted me to file online and pay an extra $270 out of MY pocket (since he expected me to pay for the entire thing), and I told him no. \n\nA few days later I got a strange text from him that didn't sound like him. I argued with him, then a confession was made: it was his GIRLFRIEND. He had lied to me AGAIN and moved to New York from Georgia. She went psycho on me and screamed at me via text about how aboosive I am. Long story short, we argued and I told her I wouldn't be speaking to her again, I am filing in my county because I already started the process, and I'm not changing my mind because he lied to me. If he hadn't lied, I might have been willing to file online, but I'm definitely not now. \n\nMonths go by and finally the date comes. She drove him to Georgia, and they were 15 minutes late. I knew this because I was 15 minutes early, and the clerk asked if I could contact him, so I went outside to do so. I saw her roll up. I told him she's not allowed inside due to covid restrictions, but honestly I wouldn't have let her inside because I hate her. He nodded and up we went. We spoke to the clerk and started our paperwork. I have some legal knowledge (definitely a ton more than him) due to curiosity and things that have happened to me in the past, so I knew which questions to ask. \n\nI know how lazy this brat of a human is. He HATES doing ANYTHING he doesn't have to do. So I reminded him in front of the clerk that he still had property at my home, and I want it out of my house. The clerk told him that anything he leaves on my property after a certain date will legally belong to me, and there will be no way of getting it back without my express consent. He asked if he could work something out with me, and I told him no, you'll have to adhere to these legal guidelines, and anything left afterward will be forfeit. \n\nNow, while we were together, his blessed mother (may her soul rest in peace despite her son turning out to be worthless) passed. I LOVED that woman. She was a saint. And I wanted something of hers to remember her. He had inherited her dining rug. While not worth a lot monetarily, it is still a lovely black and red antique. And I knew he couldn't afford to ship it, nor could he afford to rent a moving truck, nor could he fit it in his girlfriend's tiny crap car. So while he was crying and loading up his mother's belongings, all of which he had left behind when he left initially, I told him I'm keeping the rug. I said this flatly and without feeling. He tried to argue, so I pointed out the obvious, and he conceded. He knew I was right. \n\nThat rug is one of my favorite belongings. I've begun renovating our unfinished basement and it currently resides in a lovely guest room that houses my bookshelves, armoire, king size bed, and 55 gallon fish tank that is not yet home to anything. \n\nAnd for even more good news, I married my best friend and we've been together for nearly 4 blissful years. On our 5th anniversary, he has agreed to a ceremony, since we were married in a simple ceremony with only two witnesses. \n\nAnd for more petty revenge, I still have my ex's childhood art binder (which he cherishes) and I will continue to hold it until he pays me back the $400 he owes me for the brand new tires I put on his car a mere few weeks before he decided he wanted the divorce. It's been over 4 years, man. I'm never giving it back at this rate. And I do send him annual reminders. ",
        "num_comments": 85,
        "comments": [
            "The DEFINITION of petty revenge! \"This is small enough you can't fight me on it but big enough it will sting you forever.\" Bravo! I hope you are in a much better place right now, living your life for you, and keeping your toes warm on a rug best served cold.",
            "At some point, this becomes a comedy, it's so absurd how lazy this guy is...",
            "And the rug really ties the room together.",
            "Love is blind",
            "Me supporting a worthless bum would have lasted  all of one month IF THAT.  But sure as hell  not 3 years. I can only imagine how much more money you would have had  in your  pockets if you had gotten rid of that useless prick sooner. But all's well that ends well. I hope your new husband is more of a partner than a burden.",
            "Lol at not being \"passionately hugged.\" \n\nIt always amazes me that men like him (I'm lucky enough to be married to one of the good guys) dont realise how this type of behaviour makes them appear weak, childlike and therefore completely undesirable sexually. Cleaning up after a selfish slob does not inspire much passionate hugging.",
            "You're awesome for how you handled all of this but I want to give the advice to just throw out the art book and be done with it. Stop letting him live in your head year after year. Or at least tell him it's the last chance, give him the opportunity one last time and then throw it out like you threatened. Follow through.",
            "Glorious pettiness! He sounds exhausting.",
            "Somethings doesn't add up, you divorced your ex during covid, but then you married your boyfriend at 5 year anniversary?\nEither dates are mixed up, you had an affair or story is fake.",
            "What in the world is slash? I love a good gatekeep.",
            "I don’t know you but I’m so happy for you and how things turned out. It sounds like you were beyond burned out which makes your petty revenge even more satisfying. I wish you a wonderful ceremony and continued happiness.",
            "> I'm never giving it back at this rate. \n\nevery year send him an image of a burned page or two.",
            "The true petty revenge will be on the girlfriend who now has to carry his sorry butt once he moved in with her.",
            "When OP said “my best friend held me” you knew what the ending would be",
            "I would be interested to see their wedding pictures and then see their pictures on the day he moved out. And then your new wedding pictures. Two completely different people I'm sure.",
            "Why does this whole story seem fake? You wrote it out like a professional writer.",
            "It’s so sad that it was him the one to ask for the divorce, I’m sure that if he had not done it she would have continued being taken advantage of",
            "NICE!!!",
            "If this is real, I am BEYOND happy for OP that she married the best friend/roommate. He seems like a real one.",
            "He had to have been hot or big d",
            "It's a nice story, but extremly fake",
            "I don't get it, you lived together with your husband, brother, roommate and your best friend, who you married after?",
            "Some ppl just can’t do it lol",
            "I can’t imagine what more he thought you could or should do for him? What a worthless person.",
            "Glad you moved on from this complete loser. Hope his new girlfriend is happy with him.",
            "Wow, when I read this I genuinely wonder how much of an ass some people can be without probably even noticing themselves. Jeez!",
            "I want to see the rug...",
            "He has a smooooooth brain 🤣",
            "I can’t believe he found someone else to take care of him. I am glad he is gone from your life.",
            "I would put an end to the cost of reminding your ex that you still have the book.  Because I'm that petty.",
            "I really want to know how he and the new gf are doing tbh, has she finally realized he’s useless dead weight? How did he even meet her?",
            "I smell bullshit. Everything you did was right, you always act like a saint while everything he did was wrong and is portrayed like the devil of lazyness. \n\nI want to hear his story, tbh the more i think about it the higher i rate the chance that he is the actual victim and you are just very skilled in manipulation",
            "> And for more petty revenge, I still have my ex's childhood art binder (which he cherishes) and I will continue to hold it until he pays me back the $400 he owes me\n\n\nLegally it's yours, right? Since he didn't pick it up before the deadline. I would set it on fire, record it and send it to him. You're not getting that money back anyway. ",
            "I take it that you were smart enough not to put his name on the deed when you bought the house.",
            "Fake story",
            "Why were you even with this guy? Sounds like your “best friend” was watching and waiting in the wings the whole time.",
            "Jesus is Lord. Well done. Well done girl we are all really really impressed!",
            "Still some more research to do on your facts, dear. But paragraphing  is good.\n8/10 for reddit-style prose.\nNot sure if I kept reading because you caught my attention or whether I wanted to know how much more bs you would be spouting.",
            "He is not the smooth brain in this story.\n\nGood luck to you, though.",
            "Weird, sounds like you just signed up to pay him spousal support.",
            "lol paying off you car does not RAISE your credit score. \n\nYa almost had me!",
            "The better revenge would’ve been to divorce him early on instead of ignoring all the red flags.",
            "and you’re so upset that you’re posting this here… seems like you haven’t let go",
            "Great job! But, if I were him, I would have taken the rug and thrown it in a dumpster so that you couldn't have it. This guy really was slow, wasn't he?",
            "[deleted]",
            "and you married him",
            "Spot on\n\nAs an add on, OP should charge him compound interests on the $400",
            "I would assert this is so absurd that it must be made up, except I have met a couple of losers like this.  So i know it’s in the realm of possibility.",
            "Smooth brained clod made me lol 😂",
            "And yet, he got at least TWO women to put up with it.",
            "Thank you Walter!",
            "Right?! Women will reject perfectly good men and end up with bozos like this and complain about it when it all goes to shit. I mean look, OP, it's not your fault, but nobody forced you to marry this worthless piece of shit. You chose him. Sure people change but, if someone is analytical enough they can identify red flags like this pretty easily.",
            "Same!",
            "I thought that was code for sex. No?",
            "I thought women dont need strong men, im confused now",
            "I think they mean when their 5 year happens? They say the relationship is at nearly four years in the same sentence, which would add up",
            "It’s fake.",
            "The story is fake",
            "\nI tried so hard to follow the story. All I got out of it was that she lived with her (now ex) husband and her boyfriend (now husband) and a roommate at the same time. That's the only way the timeline fits in my mind. Maybe the roommate is her current husband??? \n\nAnd the whole revenge is getting a rug out of the divorce???",
            "The whole story sounds extremly fake. On the other hand, OP made a post related to it 2 years ago",
            "Rslash is a reddit YouTube channel ",
            "Or she lied",
            "The roommate and best friend are one person",
            "My question was how he found a girlfriend 1,000 miles away to move in with so quickly?",
            "This whole story smells dirty af",
            "Right, she messed up putting what state she filed in because she would have lost half the house. \nThere is also no such thing as “filing online” for divorce to make it easier on the dude AND most court houses across the country dragged divorced waaaaaaaaay out during Covid, just looked up and Georgia was one of the ones to half court cases. \nI know my friend had to wait til well after the pandemic for the divorce she started pre covid!\nGeorgia also allows alimony for spouses with disability.",
            "Paying off any debt raises your credit score , that's literally one of the best ways to build a credit score",
            "Depends how you do it actually.",
            "If it’s on a credit card, doesn’t it?",
            "rude",
            "Have some salt for that open wound!",
            "I came here to say the same thing.  25% per annum sounds good.",
            "Nah.  Ceremonially burning one art piece per year and sending him the video would be much more satisfying.  It is her property after all.",
            "I have encountered a few of these. I wonder how this happens to a person.",
            "Okay, now I’m intrigued by this quote.",
            "I'm sorry, you've imagined a whole scenario where OP rejected several \"perfectly good\" men (love using descriptors for men that also apply to unbroken but outdated home appliances, very respectful), imagined they ignored red flags, and then imagined they're a hypocrite for it. Oh, and then generalised that imaginary story to \"women\" the concept.\n\nIs it not possible that any one of your thousand assumptions might be wrong here? If you want to say OP made a mistake dating this clown, my guess is they'd probably agree with you! Why drag all this other stuff into it?",
            "It sounds like you’re personally offended about women rejecting “perfectly good men,” can you explain more about what kind of men these are and where to find them?",
            "True, it sounds like that's what they meant, it seems that I mixed it up.",
            "If op filled out the paperwork,  then it's likely that the ex agreed to give her the house.",
            "Also, if she kept financing her husband's lifestyle, which is what she claimed, she'd definitely have to pay him alimony, so there's no real good incentive to file for him. Also, why on earth file for him, he's the one that wanted out.",
            "I read these to remind myself how I could become like this. I think comfort and lack of self awareness are how it happens. These stories are like haunted mirrors for me.",
            "The Big Lebowski",
            "She said he's agreed to bigger ceremony on their 5th anniversary which means they haven't got to it yet .",
            "Could be the ex's name was not on the deed."
        ]
    },
    "Keep pestering me to tie into my fence? Say goodbye to the fence!": {
        "title": "Keep pestering me to tie into my fence? Say goodbye to the fence!",
        "score": 1728,
        "url": "https://www.reddit.com/r/pettyrevenge/comments/1dllccj/keep_pestering_me_to_tie_into_my_fence_say/",
        "content": "A previous home I owned had previously been rented, and that tenant had thrown up a quick little chain link fence for his dog. Had the corners right at the corner of the house, just a quick fix that got the job done. I don't have a dog, so fence, no fence, didn't matter to me.\n\nThe DAY I moved in my very young neighbor came over and asked since she ran a daycare from her house (that was a whole other nightmare) she'd really like to put up a fence, and to save money could they just tie into mine and save the cost of fencing an entire side of the fence. \n\nNow, I may be younger, but I'm not dumb. I knew that if they did that they would be fencing in part of my property, and after a certain number of years with their maintenance of it they would then own that property between our houses. Now, we're not talking alot here, the houses were maybe 15 feet across, but if they did that they would own everything up to the edge of my house. Even my air conditioner unit would be on their \"property\". So, I told her this, and said no, she cannot now or ever tie into the fence. \n\nMentioned that interaction with my realtor, and she about threw a fit- seems this person tried asking her the same thing and she told her the same thing.\n\nNow if this was just a one time trying her luck thing it wouldn't be a big deal, but she kept asking off and on for a few years, and I kept saying no. Even the husband came over to ask, maybe to intimidate a single woman? Still said no.\n\nI even did the research, and got the actual property line map that showed exactly where our property lines were.\n\nOne day I saw a whole bunch of chain link fencing in their back yard....but not nearly enough to fence all the sides they needed to do. They were going to try and tie in anyway, despite me repeatedly telling them no.\n\nSo, that night I took down, rolled up the fence, and dug up every single fence post.\n\nNow the neighbor had to come out and watch the kids she was supposed to be watching, because my fence wasn't there anymore so the kids had more avenues to escape. Plus, it took them a bit longer to order more of the chain link fence and posts they suddenly needed.....\n\nWhen I sold the house I gave the new owner, a single man, a care package which included the official property line map and a note to watch those neighbors like a hawk. My realtor (yep, same one, I loved her so much I used her again) knew the ENTIRE story and gave him the run down as well. ",
        "num_comments": 46,
        "comments": [
            "I was like why would you mind till I understood the situation. Good job",
            "My little black heart loves this story.",
            "I'm overly impressed with you digging up every post!  Nicely done  :)",
            "Good for you. Adverse Possession ain't nothing to fuck with.",
            "Dug up every post? My 55 yo lady bones ache at the thought.  I couldn't have done it",
            "Quality heads up for the next\nperson. Love this",
            "I would fence in up to my property line and screw these games for good.",
            "They were hoping that someone would be stupid enough to end up accidentally 'giving' them free land.",
            "Wow I'm glad my neighbours aren't dicks.  I put up a dog fence using only a small part of my yard and the corner of the house as well but judging from where my neighbours and I mow our lawns everyone is keeping the boundaries where they should.",
            "Gave me happy goosebumps",
            "What kind of stupid law is it, thaw would give them the right to your property, if the fence was there? That doesn't make any sense.",
            "Brilliant!",
            "“Now, I may be younger, but I’m not dumb.”\n\nAnd then goes to explain how this whole thing happened because they were too dumb to know and understand adverse possession and that permission nullifies any adverse taking.",
            "I don’t understand the scenario.  Is there some sort of ‘no man’s land’ in between the two properties?   Why isn’t there just a single fence line which delineates the boundary between the two properties?  Why does the neighbour want to erect second fence when the OP already has one? Etc, etc…",
            "Neighbour dodged a bullet, you sound like a piece of work",
            "My neighbor on the other side of me loved it too when I saw her the next weekend. She cackled when I said \"well they can't keep bugging me to tie in a fence if there's no fence can they?\" I got free, fresh from the vine tomatoes from her garden at my back door after that",
            "It required a soak in the tub that night afterwards and not being able to move much for a few days🤣🤣",
            "Could one draft an agreement between the two owners that precludes adverse possession?\n\nEdit: This is common and works.",
            "Guuurrrrllll 10 years later I don't know if I could either, lol! It was an extremely small yard, perfect size for a single person. I only had to dig out 5 posts on their side. Did the other side over the weekend (which my other neighbor loved, she hated the fence as well). Still wasn't anything to sneeze at, that's for sure.",
            "Then you have to deal with property line fence laws, which are a pain in the ass.  In some areas you can't put a fence on the property line without all of your adjoining neighbors' agreement and you all have to decide on the type of fence to put in.  If one doesn't agree, you can't install the fence.",
            "It’s called “adverse possession.” It’s a bit nutty, but to really simplify it, it is a doctrine that says that if someone has continuously occupied a space and made improvements to it then it becomes theirs after a certain period of time. US courts have repeatedly upheld this doctrine.",
            "Some houses don’t have fences for a number of reasons(no need, friendly neighbors, live next to family then sold/lost the house, etc). The neighbors in question wanted to corral the children they were paid to take care of so they didn’t have to watch them if they went outside (reasons for this can be anything from laziness to not wanting to worry about one or more slipping off unnoticed, kids can be a bit sneaky). The neighbor didn’t want to erect a separate fence they wanted to save money and use the existing fence as a part of their own, but this would have moved the property line since the original fence was only made to keep a dog from getting out(so didn’t go on the property line, it was a renter who put it up so they chose the cheapest option for themselves)",
            "Found the neighbour",
            "Obviously you didn’t pay attention when you read the post. Read it again.",
            "This is the best thing I’ve read in a while! I’m so proud of you!! Great job!!",
            "Just in case this ever happens again, a car jack and short length of chain is a great way to get fence posts out of the ground. I use a self tapping screw on the other side of the post to loosely attach the chain to the post, then use the jack to get it to lift out with minimal effort. Takes 5-10 minutes per post once you get into a groove.",
            "Anger can move mountains, or in this case fence posts. Well done.",
            "That’s commitment",
            "Well deserved!",
            "Well I certainly hope you are better now. More power to ya! .😂",
            "Yes, you can and my sister and BIL did with their neighbor after the survey discovered a large chunk of his newly expanded driveway, privacy fence and half the bay of his new two-car garage was on their property (he didn't get a survey before he started building).  It's called a \"permissive use\" easement and the terms of my sister's and BIL's is that the easement can be cancelled at any time for any reason, and it is non-transferrable.  Basically, if the neighbor sells his house the new owners have to negotiate a new easement with my sister and BIL, if they fail, everything has to be removed from their property and the land restored to its original condition.  Neighbor took the agreement to his lawyer to see if he could fight it and was told by his lawyer he'd be a dumbass if he didn't sign it.  He signed it and goes out of his way to avoid conflict with my sister and BIL.\n\nOne of the key components of adverse possession is that it is done without permission, if you document that you've given permission, they can't do anything.",
            "You could lease the space to them",
            "But you can short-circuit it with a \"permissive use easement\" like my sister and BIL did with their neighbor.  Dumbass expanded his driveway and garage and installed a privacy fence without getting a survey.  My sister and BIL's survey showed half the bay of the new garage, a large chunk of the expanded driveway and a chunk of the privacy fence is on their property. The legally binding agreement can be cancelled at any time, for any reason and any encroaching structures must be removed and the land restored at *the neighbor's* expense, the easement is also non-transferrable to a new owner.  Neighbor tried to fight it but was told by his lawyer to not be a dumbass and sign it.  If/when he sells his house, he has to disclose the issue to the potential buyer and the new owner has to negotiate a new easement.\n\nSince the neighbor has permission, he can't claim adverse possession now (this all happened 20 years ago, and the time limit for adverse possession is 20 years).  A key component of adverse possession is that you are using the land without permission.  If there is documented permission, then you are SOL for that type of claim.\n\nSo, yeah US law can be stupid, but they do have hidden fixes.\n\ntagging u/StoneAgeSkillz",
            "US laws are nuts.",
            "Haha fuck no, just hate whiny arseholes that cry on reddit when they could just tell neighbour to fuck off",
            "Oh I read it, I hate whiny neighbours, so?",
            "I can do all things through spite, which gives me strength.",
            "Adverse possession (e.g., finders keepers) dates back centuries, well, millennia by now. The US inherited it from English common law.\n\nWhen laws are poorly written, it becomes a problem, and leads to loss of property (inclusive of items).\n\nIn principal, if no owner comes forward, the property is now owned by whoever is living on the land. This prevents abandoned land from staying abandoned permanently, though these days the govt is usually empowered to seize abandoned land.\n\nThis extends to \"use\" of land, and when combined with poorly written renters rights laws, squatters can basically take over someone's house. Or if not written properly easements become a transfer of ownership.\n\nAnd carefully written laws also allow governments to seize private property using eminent domain.",
            "English law, dude. We inherited it.",
            "\"Now if this was just a one time trying her luck thing it wouldn't be a big deal, but she kept asking off and on for a few years, and I kept saying no.\"\n\nAnd\n\n\"One day I saw a whole bunch of chain link fencing in their back yard... but not nearly enough to fence all the sides they needed to do. They were going to try to tie in anyway, despite me repeatedly telling them no.\"\n\nSo she REPEATEDLY told them to fuck off, but they still were going to do it.\n\nYou illiterate, whiny arsehole crying on reddit.",
            "They did tell the neighbor to fuck off.  And then the neighbors decided to try it anyway.  \n\nReading and reading comprehension must not be your strong suit.",
            "Buddy, this is a sub on *gasp* PETTY revenge. Not a good place to lurk if you “hate whiny arseholes that cry on Reddit”. Move along now.",
            "That's honestly how I managed to graduate Highschool. My Senior year was fueled by Vemon Energy Drinks and Spite",
            "Nice biblical vibe there. Heh."
        ]
    },
    "Selfish husband never knew": {
        "title": "Selfish husband never knew",
        "score": 4824,
        "url": "https://www.reddit.com/r/pettyrevenge/comments/1dlefcj/selfish_husband_never_knew/",
        "content": "My now ex husband was very selfish- always putting his wants before mine. He was also a hypochondriac. After we started dating, we decided to move in together and he insisted I rehome my cat because he said he was allergic. I don’t think he was allergic, but I think he believed he was so I stupidly rehomed my cat. Fortunately, I found a very good home for her, so I’m OK with that, but it was incredibly selfish for him to, ask me to do that  \n\nAfter we were married he suddenly decided he was allergic to our goose down pillows and comforter. I loved them! I tried to argue with him telling him that we had been using these for over a year, so how could he suddenly be allergic and he just got very angry and told me I didn’t care about him.  \n\nSo I went to bed Bath and beyond and bought hypoallergenic, pillows, and comforter. I made sure he knew I had done this, and I put the pillows on the bed and the comforter in the duvet cover.  The next day when he wasn’t around, I replaced them with the real thing I had hidden in the closet and took the cheap stuff back to the store since I had left the tags on.  We were together for several more years and he never knew.  ",
        "num_comments": 161,
        "comments": [
            "Fuck him.  I would've rehomed him and kept my cat.",
            "this might just be me, but I get the feeling that his \"hypochondria\" targeted only your stuff. your cat. your pillows. glad he's an ex.",
            "He should have been your ex 3 seconds after asking you to rehome your cat",
            "Interestingly, if he ever helped change the sheets this revenge wouldn't have worked",
            "I was dating a man once, we were in our early 40s. I had a golden retreiver who I had for about 8 years. This asshole demanded I get rid of my dog because he was not a dog person. He had this ratty, vicious cat that was just nasty. It dripped, oozed, snotted, coughed up wads of fur all the time and farted constantly. I did not demand he get rid of his cat. Yall know what I did? I DUMPED HIM. Fuck him, what kind if human monster demands I throw away a loving, selfless pet that was my constant companion and my great comfirt for almost a decade?  My dog was far, FAR better that that guy was. Piece of shit....",
            "Never should have married the bum.  He let you know who he was with the cat.  I was allergic to dogs dating a woman with a dog.  Would never have asked her to do anything with her dog - not that she would have - to accommodate me.\n\nHappily enough, allergies can change, and I'm no longer allergic.  I brought two dogs and my wife brought one dog into our marriage and neither one of us can fathom the concept of telling the other to get rid of an animal.  Never gonna happen....   as an answer to both 'would you ever ask someone to get rid of a pet for you?' or 'would you ever get rid of a pet for someone?'",
            "My(16f) dad(41m) claims to have an allergy to animal fur. I got a kitten a few years ago (think shortly before COVID), and he frequently abused my poor baby. Kicked him down the stairs, refused to feed him while I was at school, and even locked him in the bathroom. My mother made me bring my poor baby boy to an animal shelter, since he was \"causing stress for my poor dad\".\n\nI went back to readopt him a few months later, only to find out he had been euthanized. I was heartbroken.\n\nNarcissists will never change. Good on you for dumping that man!",
            "It’s about control.  Really gross.\n\nI mean, if you are sneaking back a down comforter and returning the other…that’s not healthy.  I’m sad you had to live with him for 7 more years.  \n\nHopefully you are happier now (how could you not be!)",
            "I had a friend like this. She insisted she was allergic to various things, but would apparently overcome those allergies when she really wanted something. She was allergic to gluten, but ate bread and drank beer. She was allergic to dairy, but would eat ice cream. One day, I told her about a relative with a gluten allergy who had a pretty severe reaction after mistakenly eating gluten. \n\nMy friend was furious with me, because I was apparently insinuating that her allergies weren’t real. (😈 Maybe I was). But her reaction was over the top. I think people lie about things like that partially to satisfy a need to be special.",
            "You argued with him about the blankets and pillow but not about the cat???",
            "While he was wrong about being allergic to the pillows and comforter, people do get allergies just out of left field. \n\nFor sure he was just a jerk tho.",
            "I will never get over someone asking anyone to rehome a pet. I personally wouldn’t do it. He would have to go before any of my loves. Anyone that asks anyway definitely aren’t good ppl in my eyes",
            "Allergic reactions can be developed, but he was WAAAAY in the wrong. You improved your life by getting rid of him.",
            "Guys, *EX-husband*, stop giving OP obvious advice that she already learned",
            "Excellent work. *Chef's kiss*",
            "I'm so glad he's an ex now! \n\nCaveat, though, people actually can \"suddenly develop\" allergies. Growing up, I wasn't allergic to anything. At some point in my freshman year of college, I literally overnight became allergic to my belt (2009-2010 time frame scene kid so it was the leather belt with metal studs lining it😅). From that point on, I've had an allergic reaction to nickel sitting on my skin. \n\nAfter that, it all went downhill with allergies. Thankfully, no food or meds allergies(yet)!",
            "You had my support at cat.",
            "He probably had a mild peanut allergy, but still pounded Snickers bars all day long, because they're good.",
            "I always wonder how people can simply discard red flags like this.",
            "Sounds like my ex wife. Before she transitioned I couldn't do my nails anywhere in the house because she would complain that the smell have her headaches. After? Frequent manicures and pedicures both at home and in shops. Oh and she wasn't ok with non monogamy when we first started seeing each other and I wanted it but when she wanted it years later it was a unilateral decision without any chance of an adjustment period.",
            "Not saying dude wasn’t an asshole but it can develop allergies later in life. \n\nI wasn’t allergic to dairy until my 30s.",
            "My housemate did not believe his Axe body spray caused me to have an asthma attack. He had been using it in the garage instead of the bathroom as I asked him to. One morning,he used it in his bedroom. I coughed soo much he was afraid he was going yo have to take me to the hospital.",
            "Your ex used his \"health problems\" to control you. But you didn't let that happen, very good!",
            "Hey OP, I'm seeing a lot of warriors here talking things like I WOULD NEVER, or YOU SHOULD'VE and other simular stuff, which can be a little ignorant and I want you to remember that you DID get out and survived this man. You're fkn awesome. And the bedding switch was epic 😂 I hope he finds out someday",
            "You should tell him just for kicks and give us his response. I would be shocked if it wasn't extreme -- either him blocking you or something sinister.",
            "Wait did u see ur cat ever again???",
            "As a man I would finish with any woman who did not accept my cat.",
            "possibly a stupid question... but why be with someone like that in the first place?",
            "I hope you told him about this after the divorce",
            "For those of us who really are allergic to both of those things and have been doubted myself, I look at this differently. And I'd had exs pull this kind of stuff and was misrebel, of course, and then they admitted to it. \n\nSo what I would say is this, I would have been up front about the cat and that not working, and if the person I dated did own a cat then we just wouldn't work and they'd know that.\n\nMy only advice is to know whether someone is allergic or not before going too far, and if they are allergic to stuff you aren't willing to part with, don't date them then.",
            "honestly, what was so great about him?  I like to think I would have just said no.",
            "Oh geez, my dad was like this. He made my mom get rid of all her houseplants because of his allergies. Then decided it must have been the dust from the fan inside the computer. *facepalm* We opened the case up and blew it out.",
            "Good and easy. The best kind.",
            "My father in law demanded fresh squeezed OJ. My mother in law would keep the fresh squeezed bottle and fill it with concentrate. While drinking the concentrate, he would even comment how much better it was than concentrate.",
            "Sounds like BPD, tbh.",
            ">  always putting his wants before mine.\n\nGood person to marry then.\n\n> He was also a hypochondriac\n\nAnother great reason to marry him.\n\n> We were together for several more years and he never knew. \n\nPretty sure you lost on this.",
            "Controling bastard. Glad he's an Ex. I'm sad you rehomed your cat. But hindsight is always 20/20.",
            "You chose to not only continue the relationship, but marry him.\n\n/shrug",
            "It sure is fun pulling a fast one on those types but IMHO passive-agressive stuff is not the way to go, especially with a life partner.  Learn to be upfront and make your boundaries known early in the relationship.  Communicate!\n\nAnd remember, when someone is telling you who they are, believe them.  It'll save you years of bullshit.",
            "You got rid of your cat? \n\nOh OP. You need far more revenge.",
            "Can’t believe people are rehoming their pet for some person. Disgusting.",
            "He sounds like a treat! Love can make you blind to the mental abuse that a partner can put on you. Glad you got your revenge, he deserved it.",
            "I known at least a dozen people in my life that said they are \"allergic\" to cats.  All of them were selfish self-centered assholes, some of which all-of-a-sudden lost their alergy when they started dating someone that owned cats.  They are all dishonest so you shouldn't have ever married the fraud.",
            "Sounds like a power move. Showing you who's boss.",
            "That’s funny! Lmao.",
            "Awesome!",
            "   \n4 w",
            "Have you ever told him? \nThat you knew he was a selfish drama queen liar?",
            "Generally not a good idea to try to disprove an allergy by sneaking an allergen exposure. He might be an AH and you were proven right this time, but there are plenty of cases where this caused severe illness.\n\n[https://www.washingtonpost.com/advice/2018/03/05/carolyn-hax-girlfriend-family-allergic-poisoned/](https://www.washingtonpost.com/advice/2018/03/05/carolyn-hax-girlfriend-family-allergic-poisoned/)",
            "Male domination strikes again.",
            "What in the fuck is hypochondriac? Bro was just inventing illnesses lmao",
            "You seem like an absolute gem lol",
            "You gave up your cat, blame yourself for that and you deserve what came after. If he held a blade to your throat and forced you to do it I apologize but if you made that decision you deserve even more hell for that",
            "U married him you absolute idiot. What does that say about you",
            "Yeah, he had a mental health issue that wasn't being treated. So, you pranked someone who needed therapy. Proud of yourself? \n\nIf he really did have allergies, it's on him to get treated, not on you to adjust your life around him. You're right about him being selfish.",
            "and he keeps fucking you on those pillows ? who won?",
            "Nice little bit of revenge, but it should never have happened. His ass should have been tossed the moment he suggested rehoming your cat.",
            "He suffers from hypercretinism",
            "In retrospect I wish I had!",
            "Rehomed him? I’d have unhomed him. Let him rehome his selfish ass!",
            "I moved across country to get away from an ex.  Took the 2 cats.",
            "Nuetered him and not the cat, see if that fixes his allergies.",
            "> Fuck him\n\nObviously. OP *did* get married to him.",
            "Really? You wouldn't have married him???",
            "Reddit is psychotic.\n\nHad a cat allergy my whole life, my partner had to rehome hers. Now we have two cats 10 years later because my allergies have eased off. \n\nI also can't use down pillows or comforters. Or mink blankets. These things are magnets for dust mites, and if you have severe allergies, they have to go.\n\nI doubt OP's partner \"decided\" he was allergic to anything. I'm guessing it just never came up before because when you live with this shit you generally don't view it as uncommon. It doesn't need saying until it does. Then he realised, oh hey, I can't actually be around that shit long term, and now OP is calling him a hypochondriac because she doesn't want to swap goose down for polyester.\n\nSuggesting a breakup because of pillows and a blanket is fucking insane. And the cat is already rehomed, to a good home, so that ship has sailed.",
            "[deleted]",
            "Spot on!",
            "Do people really not care that others are deathly allergic to these things? For example, if I tried to live with one, it would be years off my life and respiratory infections and misery all the time. When dating, I was always up front with all this, though, and I eventually did find the right one, she didn't own anu cute fuzzy things. But a lot of people weren't willing to make that concession. I also thought them were a little foolish. It's like, \"Do you want a great partner or a pet?\" and many just said the pet. Oh, well.",
            "He rarely helped but when he did he never noticed.",
            "I don’t understand how he didn’t notice by the feel of the pillows and the warmth of the comforter. 🤷🏻‍♀️\n\nEvery feather pillow I have ever slept on, including high end luxury brands, are very obviously feather pillows.  Just as high-end down-alternative ones are obviously *not* feather pillows.\n\nDown comforters are at least four times hotter than down-alternative comforters.",
            "Sounds like his cat was neglected too.",
            "Yeah, deal breaker. It would be like demanding someone got rid of their kids, as far as I'm concerned",
            "THIS is the way",
            "Yeah... I am allergic to cats (mild.. to their salava.. and it really seems to only effect my face)... My wife six months ago really wanted a cat, so we got one... now I just do things like use a lint roller on my pillow before bed and wash my hands and face everything I handle the cat... and I love \"Furball\" she is so damn cute and my wife is very happy.",
            "I'm mildly allergic to dogs and cats. As far as allergies go I'm only allergic to one specific coat type and can only sleep with dogs who have hypoallergenic/low shed coats. I've never had a reaction other than some stuffiness to the dogs and cats I have lived with.",
            "Plan your escape now from this selfish stick of humanoid and his enabling wife. Work your butt off to have a better life.The best revenge is doing better.",
            "OMG my stomach just sank when I read that. I'm so so sorry. Heartbroken for you.",
            "I'm sorry that happened to you. Please dont try to get more pets while you're in that environment. Im sure you tried the best you could, but the minute your dad started being abusive towards the animal, a new home should have been a priority. I only say this because you tried to get him back at one point, and that was a poor idea if your father was still at home, even if you vould hide a new animal, that isn't a healthy situation for a pet.\n\nPlease don't put another animal in that position.\n\nBest of luck, hope you're able to gain the means to get out of that environment.",
            "She couldn’t hide the cat in a dog suit. \n\nIt sounds like he was a controlling dickbag who fixated on things until they were “solved” and would have gotten rid of the cat one way or another.",
            "Either a terrible human or a bot post... who tf cares more about a pillow over an animal?",
            "I was victim to the sudden allergies in my late teens! It's infuriating. Up to that point, I had no allergies but common spring hay fever, and not very severe. Almost overnight I developed mild to moderate allergies to about 40 different foods, among those we tested for, and who knows what else.\n\nHad to carefully watch diet to avoid certain things completely, and to not eat some things too many days in a row, or I would have a slow building \"allergy attack\" of closing esophagus over like 12-36 hours.\n\nTwo decades later, I've either shifted back to not being allergic to most of them, or the severity has dropped significantly. But it's true it can happen. The human body is totally bizarre.",
            "Thank you! I got so sick of reading the endless “why didn’t you kick him out instead of the cat? You shouldn’t have married him!”\n\nNo shit Sherlock! It’s called covert abuse and OP left the dude.",
            "Actually, you need to have some exposure before you will get symptoms. Some people get it years away, others fast.",
            "Success is the best revenge. After he cheated on me and I divorced him I started my own business and I’m now making 10 times what he is. I’ve also lost 35 pounds so ha ha.",
            "I think the key here is the pattern of behavior. He is a known hypochondriac who had zero symptoms and whose allergies purely targeted OP’s things.",
            "At least he’s an ex now! And hopefully she’ll never make the same mistake again.",
            "Female need for validation strikes again.",
            "She gave up her pet for him. She was a gem. Too bad it was pearls before swine.",
            "You have no idea what you’re talking about. Zero. GFU",
            "He *kept. She wised up over time apparently.",
            "Love that! 😂",
            "You should \"Why does he do that ?\" By Lundy Bancroft.\n\nThere is covert abuse.",
            "Did a similar thing to my hypochondriac ex. He claimed to be allergic to Tide laundry detergent so I bought a different brand, dumped it out and put Tide in the box. He never once had an ‘allergic reaction’",
            "Now now, it is good to be kind and generous even to those who have wronged us. It costs nothing to rehome him to that spare refrigerator box. Kill him with kindness he does not deserve.",
            "Yes, take him for a drive far enough into the countryside the git will never find his way back.",
            "Same! I joined the Navy and my mum took my cats in.",
            "I took the dog.  And I allowed her in the house.",
            "Cats are the bestest",
            "I got neutered! Best thing ever. Now, I just throw my semen around with reckless abandon.",
            "Preeeeeetty sure no one “suggest[ed] a breakup because of pillows and a blanket,” considering that this is a past-tense story of a breakup that already happened, but feel free to keep ranting about Reddit’s psychosis or whatever.",
            "Eh?",
            "This guy sounds like a jerk and was trying to manipulate you in some way, but for the record allergies can occur spontaneously, meaning you can have something your whole life and then one day you're suddenly allergic to it at 40 years old. It happened to me. \n\nIt sounds like this guy was no good but I just wanted to let you know in case you run into another friend or partner who has this issue. I've never had an allergy to dairy and then suddenly at 39 my whole body was eczema (never had eczema) & I had somehow developed a dairy sensitivity at random!\n\nBodies are weird.",
            "It was good of you to be up front with it. \n\n\nIt also makes sense they would choose a long term relationship (with their pet) over a new one (with you).",
            "A great partner to me is someone who likes and isn’t allergic to cats 🤷‍♀️who accepts my childfree status and that I have tattoos. To me and obviously the other people you tried to date, pets are important & part of their deal breakers. You are just irritated that your choices are limited and you weren’t chosen over potential pets (or current ones). Because any good pet owner definitely ain’t gunna pick some dude who might not even work out over a loyal sweet cat/dog/etc lmao \n\nEdit: fixed typo, added clarification ",
            "People with severe pet allergies, and people who have pre-existing pets should never try to live together. I don't think you understand that pets are not just \"cute fuzzy things,\" they're full-scale family members.\n\nIt's a deal-breaking incompatibility, and anyone who doesn't understand that and accept it gracefully is *not*, in fact, a \"great partner.\"",
            "It’s about responsibility. You don’t just abandon a creature you agreed to take care of because you want to have a partner. It’s selfish and cruel.",
            "Yes, you really don't need to be deathly allergic like anaphylactic shock for allergies to be a severe problem. The constant inflammation is what makes it so bad and what people underestimate, called the silent killer. Doesn't kill in an instant, but it takes years of your life and takes away a lot of life quality with bad sleep,  fatigue, reduced performance, obstructed airways, reduced ability for sports and all that consequences that has. \n\nIt all depends on whether OP is right in their assessment that the husband was a hypochondriac or not. We can't tell.",
            "You mean - he rarely did his fair share of the housework - not \"helped\". It's not your job exclusively.",
            "I think perhaps because he was never really allergic, he just wanted an excuse to make her give something up for him so he could feel powerful. Once he saw her comply, his ego was satisfied and he never thought about it again. ",
            "Yeah it’s weird for this comment to go after the cat like that. Anti-cat people are so strange.",
            "Thank you. I'm currently doing everything I can, including working two jobs and earning straight As and Bs in school. My hope is to move out and bring at least one of my little siblings with me. He'd probably let me, he treats us the same way he treated my cat. I WILL do better, and I will build a perfect life without him. Thank you again for the advice.",
            "\nI don’t think she cared less. She just knew how his brain worked and that she could hide the pillows in a way she couldn’t hide the cat.\n\nShe didn’t throw the cat in the garbage, she found a stable home for it. Better that than the cat “running away” one day when she’s not home.",
            "I wore that specific belt at that point for 4 years. I had plenty of time to have a reaction to it. The same for all my cheap metal jewelry /lh\n\nThe point still is, that the reaction part of the allergy, (what we all perceive as 'the allergy') can pop up over night for people.",
            "The cat wrote their own book \"He's just not that into me.\"  FUCK that STBX",
            "I’d never heard that term. It sent me down a bit of an eye opening rabbit hole. Many thanks.",
            "This is such a good book and should be a compulsory read for all social service and police.",
            "Or a spare refrigerator.",
            "Cats will love you no matter what.  Another human:  Not so much...",
            "a dog lover would disagree....",
            "got a laugh out of me",
            "I am not sure how that got on. It looks like a you tube video I was listening to was converted to text and I sent it out. I have deleted it",
            "Leaky Gut Syndrome.  As you eat wheat, it degrades the lining of your small intestine and you start absorbing new molecules.  Leading to new allergies, new autoimmune diseases.  It in the Wheat Belly books.",
            "Well, wait a minute, I didn't ask anyone to just give up their pet to date me. That would be nuts. The way I put this is that I wouldn't be able to live with a pet. So, if everything else were to work, and we would be taking that next step, that's when things would have to be different for them. That usually still didn't work. \n\nI love animals and all that, but it didn't seem like people had their priorities in life right, at least to me.",
            "Yeah it’s funny to me that people are like I’m upfront about my pet allergies, as if someone wouldn’t be upfront about there pets. Like who wouldn’t discuss their pets on the first date? It’s kinda a very important compatibility thing.",
            "For real, I have 3 cats that have helped me get through some of the hardest times of my life. They aren't going anywhere for anyone. I'll pick them every time.",
            "I like those things 🙂",
            "Maybe they were correct, and maybe they weren't. I know many times I've told people about these things, and because they didn't have allergies, they just didn't take it seriously, so perhaps my perception is biased in that regard. \n\nIt was a bad situation none th less. If he was allergic,  he shouldn't have surprised her with this for sure.",
            "Cat haters would absolutely murder us if we talked about dogs the way they talk about cats every day. It's weird.\n\nIf the cat had that many unaddressed health problems I feel really bad for it.",
            "I BEG your pardon...!",
            "Make sure the money you are saving is somewhere they can’t touch it. Like at a bank they don’t do business with and NEVER let them know how much you have. That means no buying expensive stuff like PlayStations. You’ve got to keep your money top secret. \n\nMany  of us—including me—here on Reddit have lived through this kind of home life. We are here for you when you need to talk. Hang in there and fight for a better future for yourself. Don’t give up or give in.",
            "Oh I didnt think about that, this dude sounds like a cat ran away kind of guy.",
            "😂🤣",
            "Perhaps one of those lovely heavy old ones with an airtight seal and a latch on the outside.\n\nYou know. For security.",
            "People are allowed to be wrong",
            "I did not ask for medical advice.\n\nThis is also not correct in my case. I am disabled and have a diagnosis.\n\nDon't give out random health advice to strangers on the internet. You're not qualified.",
            "The animal was a family member before you came along\n\nJust don't date someone with a pet that you're allergic to, it's very simple.",
            "I think you're still not getting it.\n\nIf you cannot live with a pet, then a potential partner who has a pet *will not* be moving on to the living-in stage or marriage stage with you, even if \"everything else\" were to work.  There's no \"next step.\" If you can't live with their pet, then you can't live with them. This should have been made clear in the first few dates.",
            "I don't understand anti-cat or anti-dog people. I've always had both. They are very different, but very sympathetic creatures. How could you not love them?",
            "Selfish husbands need the most security!",
            "Actually, a chest freezer with a key lock; add one or two  hasps & your own padlocks. And, it won't look out of place in the garage. 😉",
            "[deleted]",
            "thank goodness! We're not AIs....",
            "\"I'd never ask someone to give up their pet just to DATE me - but if we got serious about living together or getting married, of course they'd have to give up their pet!\"\n\nThat's what he's saying, and still thinks it's a reasonable position. Nah, I'd like to know that you'd expect me to give up my pet if we got serious on the first date, so I don't waste my time on a second.",
            "That is what ended up happening so fair enough, and first or second date, I'd just let people make their choice.",
            "I think even if you don't personally care for one, it's weird to be cruel. I'm not a dog person mostly because I'm very particular to smell and I don't like the way dogs smell, but I want them to be happy & well taken care of, & would never want to harm one. I wouldn't joke that I'd like to kill them all or kick them, I think that's absolutely bat shit behavior. It's crazy that people say that stuff about cats like it's nothing. I worry about people who would so easily harm a living thing just cuz it isn't their favorite.",
            "Somehow I doubt this man has the fortitude of an adventuring archaeologist, but there is only one way to find out.",
            "Like a cockroach 😂🤣",
            "I read that and was like \"don't date them at all\" like how do they not understand that its unreasonable just to consider dating them when the future means them giving up their pet WHO WAS THERE BEFORE YOU, dating someone means you have the intention of being more and building a future, it's not like FWB or like one night stands so I don't get what they're struggling to understand 🤦‍♀️",
            "Right? I'm not interested in building toward a future with someone who's going to nag me to rehome my cat and then never have one again. That's just not a future I want. I'd rather we both realize this incompatibility up front. No blame, no shame, but this person can certainly find someone else who doesn't have pets.",
            "I already have. However, I do think we have a difference in how we view these types of things. \n\nThere wouldn't be any sort of nagging about any of it, I just laid it out as I can't live with a pet I'm allergic to, and people made their choice up front. \n\nI do own pets but not fuzzy ones. And for me, I just feel differently about them. I do love them and would always want to make sure they are okay, but I would also prioritize the right romantic relationship with a human over one. And it's apparent to me that most people would not...\n\nI'm not going to hate on you over it, but it also just isn't a view I hold. \n\nI guess use the downvote button as a disagree button."
        ]
    },
    "Fired but could work for one more month, they have free tampons in all bathrooms.": {
        "title": "Fired but could work for one more month, they have free tampons in all bathrooms.",
        "score": 1518,
        "url": "https://www.reddit.com/r/pettyrevenge/comments/1dlicio/fired_but_could_work_for_one_more_month_they_have/",
        "content": "So my job decided to fire me but asked me to work for a full month before I left. I actually did appreciate the heads up and continued to work and get paid. I did not agree with their reasons, too many absences, I had doctors notes for all absences and informed them at my interview that my son has health conditions that would regularly require my presence. They were understanding at first but then decided to let me go. Well, all the bathrooms have free tampons and pads so every day for the past month I have grabbed about three to five products from multiple bathrooms. Now I have saved myself about $50 in feminine products. Super petty and may not even be considered revenge but a penny saved right?",
        "num_comments": 69,
        "comments": [
            "Good petty revenge but moving forward you should consider applying for FMLA as soon as you are able once you get a new job. It has some requirements to qualify so check those out.",
            "I thought this was gonna be about you using the tampons to block their pipes or something... well no harm in taking what's already free I guess!",
            "Confession: I quit a toxic warehouse type job to move across the country. Guess who didn’t buy any packing tape themselves when it came time to pack up the house…",
            "Good job! I probably would have started using my big big purse and attempted to clean out one bathroom daily of its feminine products. They’re expensive.",
            "The evil twats will never notice",
            "*panty revenge",
            "Hell yea!\n\nI worked at a company that had this perk, and I took home a lot of tampons during my time there. It's been over 2 years and I haven't needed to buy tampons.",
            "... but did you make it a truly douche move?    ;-)\n\n(OP did not mention if douches were part of the freebies)",
            "You should ask for an ada accommodation since it’s a dependent.",
            "Next job you get, get everything in writing.",
            "In fairness, you should probably return the used ones.  Hide them in desk drawers in your boss’s and HR’s offices.",
            "Been there done similar a lot.",
            "Honestly this kind of thing is one reason why fired people are often given the minimum of notice permitted by the law, because they may be vengeful and no longer care about their reputation.",
            "Be a shame if you flushed some of these too ...by accident",
            "Even if you have reasons for absences it can still be disruptive to their business. Who knows if they interpreted that to be the same amount of time away as you did. They gave you a month to find another role. I don't hate the petty revenge but not sure if the situation is revenge worthy.",
            "Nope. Wrong. About 5,000 pennies saved.",
            "The next time redditors are outraged about someone rocking up to work and getting blindsided by getting fired with zero notice im going to point them to this posts and the replies.",
            "Where I work, people volunteer to supply a bathroom, this is not company-paid. So while I don't know how it works at your company, here you would be stealing from good-hearted people.",
            "Little bit of a shame this more just highlights why we can't have nice things in life. The likelyhood of them removing this perk for your colleagues who done nothing wrong woulda kinda blow. It's just a bit of a shame. I think good revenge would only risk hurting those that deserve it",
            "Oh look, petty theft - that will show them.  Is integrity something you demonstrate only when people are looking?",
            "I I like it, but it’s more like petty theft than petty revenge!",
            "Is this not illegal where you live? In Canada, an employer would be flayed for that. There has to be something you can do to destroy their lives and everything they stand for.",
            "Be careful. This is actually theft.",
            "I wonder what they offer in the men’s room.",
            "I don't have enough hours put in at this job to qualify. They lied to me and said they would understand until I did but a couple months ago my son had an appointment that we had to travel for and my boss wanted me to come in at noon the next day. She figured that the doctor was only four hours away and I could easily make it back in time. I told her I wouldn't be able to because it wasn't just me but my autistic son who has a routine and cannot be rushed anywhere but she argued. When I didn't show up at noon, she told me the next day that was considered a no call, no show and grounds for immediate termination. I asked her if she wanted me to leave and she declined because I am the only one that does my job so they wanted to do it this way so they had time to hire a replacement. This gives me time to figure something out.",
            "In most cases, you need to be at a full-time job for 12 months before you qualify for FMLA. Additionally, if your company is small, they don't legally have to provide FMLA.",
            "That's how you get a perk like that removed for everyone.\n\nI understand you want to get revenge, but that is just making life harder on all your former co-workers. Not your bosses",
            "😂 The only douches at work are the bosses, I'll pass on that. 😂",
            "That would just exposure the janitor to a biohazard.",
            "You made me spit my water out 😂",
            "Don’t do that to the plumber.",
            "Company paid. I checked, there are cases in the Janitors closet. I do know what you mean. That's why I picked this for my petty happiness. No one gets hurt and I relieve myself of a minor bill.",
            "Good hearted people don't fire you for a misunderstanding on scheduling for your autistic child's appointments to stuff....\n\nIdk what kinda logic you run on tbh....fucking weird.",
            "Theft is when you don't have permission to take them.",
            "I am sure they offer toilet paper, which is what men need when they go to the bathroom. And hand soap.",
            "Products to handle whatever fluids or solids come out of the genitals/anus area, just like the women's room",
            "Are you currently in need of a tampon?",
            "I clearly wasted this sarcasm.",
            "Sadly that's not uncommon. They say they are understanding until it actually comes to being understanding. ",
            "Sounds to me like you should take all that documentation to a lawyer and check to see if your boss has already admitted that he could accommodate your son’s needs but doesn’t want to.",
            "Well she’s an idiot that’s shot herself in the foot. Best of luck finding something new.",
            "Don’t forget, when you are doing a handover with your replacement to leave some critical bits of information out so they are fucked without you until they can work it out. I’m sorry this has happened to you. Your boss is a hard bitch. She should be more understanding.",
            "I also have an autistic child - she’s an adult right now but when she was a little, the dental office I was a hygienist in decided to cut my hours in half because the DDS knew she’d need more of my time and he wouldn’t lose as much money if I only called in one day vs two in a row.  \n\nSometimes I hate this country",
            "You need to have worked there one year and companies w < 50 EE’s are exempt, IIRC.  Too lazy to google confirmation.",
            "Janitor is cool. Don't want to scar him",
            "I’m calling shenanigans on your user name. Trump caring about a janitor? Pshaw.",
            "The plumber would get a hefty paycheck though.",
            "*P*lus if you had extra you could donate them to a women's shelter.",
            "\"No one gets hurt.\"\n\nBecause the products magically appear, right.\n\nNot even disingenuous.  You're just a common thief.",
            "I think you misunderstood my message ... \"good hearted people\" was referring to **employees** who **volunteer** to **purchase** period products to stock the restrooms.",
            "Hygiene products are there to be used, not taken home.  Just as you don’t take home the toilet paper, the paper towels, or the cleaning supplies.  Taking them home is theft.  Glad I could solve that moral dilemma for you.",
            "We have several private bathrooms that are all either gender.",
            "My boss is like this. Talks a big game about being flexible. And she totes is until it requires HER being flexible. As long as whatever you're doing doesn't actually impact her, she's cool with it. The second it causes her to have to wait on something or do it herself? She \"never agreed to this, and you need to be more flexible\"",
            "Why men great until they gotta be great?",
            "WTF? Why is she an idiot? FMLA is only typically valid after you've been at a company for a year full-time. Additionally, small companies under a certain amount of employees don't have to adhere to FMLA laws.",
            "Thanks. Typo on my post. It should have said 12 months. And yes, it's <50 employees. (I tend to work for very small nonprofit organizations in the USA, and I also have very rare health issues, so I am, unfortunately, very familiar with this!)",
            "A company that makes you a slave also makes this a gray area",
            "I think they meant the employer was the idiot. An agreed upon situation at time of hiring and with documented proof that those times away were indeed meant for her son. If its in writing there could very well be a case for wrongful termination. But it also largely depends on where they live and the laws there.",
            "Theft is not a gray area. And a slave...really?",
            "Gotcha. I think I was misinterpreting that.",
            "Sorry yes I did mean the employer. 😊",
            "I apologize for completely misreading your first comment!:Sorry about that! Thanks for clarifying!"
        ]
    },
    "I've never told anyone this story. He told me I couldn't use women's body wash. I've been using it for 20 years now.": {
        "title": "I've never told anyone this story. He told me I couldn't use women's body wash. I've been using it for 20 years now.",
        "score": 2702,
        "url": "https://www.reddit.com/r/pettyrevenge/comments/1dlbu2a/ive_never_told_anyone_this_story_he_told_me_i/",
        "content": "This probably stretches the limits of \"petty\" and \"revenge\" but I'm going to post it any way. I've never told a single person this story because it's so stupidly petty...\n\nAround 20 years ago when I was in college, my girlfriend (girlfriend then, she's now my wife) and I had plans to go to a nice dinner in our parents' hometown. I had another commitment during the day that was going to leave me sweaty and dirty (I don't remember what it was, but I remember REALLY needing a shower before going to dinner). So the plan was that I would finish up during the day, meet her at her parents' house where I would quickly shower, and then we'd leave for dinner.\n\nAfter I got done, I went to their house. My gf and her parents were asking me about how things went. All I remember is feeling so insanely dirty that I didn't want to stand there talking to them because I was sure that they could smell me from several feet away. I continued to inch my way up the stairs where I knew I would be showering. \n\nWhen I felt like I could safely leave the conversation without being rude, I asked my gf, \"you have soap/shampoo/etc up there that I can use to shower?\" \n\nShe said, \"yup.\"\n\nThis is when her dad (my now FIL) literally jumped up out of his seat saying, \"no, no no, let me find you some men's soap, you don't want to use her soap!\"\n\nI quickly tried to stop him as I REALLY didn't care. I just wanted to shower. He insisted. So I stood there halfway up the stairs for a few minutes, desperately wanting to go up and shower while he rooted around in his bathroom trying to find some manly soap.\n\nHe eventually found something, handed it over, and I went upstairs. Being annoyed at 1) his overall insistence that I couldn't possibly use soap that wasn't intended for men and 2) having to wait longer to take the shower, I decided I was going to be petty and use my girlfriend's soap any way (TAKE THAT!)\n\nBut the actual petty revenge continues to this day. Her parents still live in that same house and we still live in a different city. So every time we go back to visit, we stay at their house. We still use that same bathroom when we go back. And that bathroom is always stocked with both \"manly\" and \"girly\" body washes. \n\nGuess who uses the girly body wash every time I'm there? Even though I prefer the scents of the manly stuff. Even though not a single soul knows about how I was wronged or the revenge that I've been exacting for 20 years now...",
        "num_comments": 153,
        "comments": [
            "If it was me in that situation I would've found the girliest strongest smelling soap so I'd radiate an overpowering beautiful scent😉 but that's just me.",
            "If your in-laws ever stay at your place make sure their only option is girly body wash. Even the hand soap, find a really fruity scent from bath and body works.",
            "Goddamn why didn't you switch his soap with women's soap? I mean, there's still time so go ahead and do it. Then come tell us in 20 years.",
            "(Secretly) fight the patriarchy!!! 😝",
            "Sometimes it's the little things 🤣",
            "Men who make a big deal out of using male specific products are not comfortable with their masculinity",
            "So in 20 years, they haven't had to replace the MANLY-man body wash/shampoo in that bathroom. LOL Must drive him nuts. \n\nGood jorb.",
            "I'm a dude and I use women's lavender body wash. Why? Because I like the way it smells.",
            "I found out my eldest son uses my shower gel because “sometimes I want to smell pretty. Men’s stuff is one bottle for your hair, body and exhaust pipe”!",
            "I like this one lol\n\nI’m curious what they would think if they knew? lol",
            "My ex used to use secret antiperspirant. He would quote the commercial “Strong enough for a man, but made for a woman.” I will say he did not have body odor!",
            "This is so silly and I love it, keep fighting that good fight and staying fresh!",
            "My dad has used Secret \"powder fresh\" deodorant for my entire life.  Here is his reasoning:  It is socially acceptable for men to smell a little bit like sweat.  It is social suicide for a woman to smell like sweat at all.  Therefore, women's deodorant has to be stronger than men's.  So that's what he uses.",
            "Have they noticed they never have to replace the manly soap?",
            "I usually shower the night before, but this one hot day I had gotten sweaty and took a shower right before going to meet a couple of friends.\n\nMy guy friend hugged me, stopped, sniffed me, and then looked confused. As we hung out he kept trying to smell me until he gave up being subtle, grabbed my arm and just started sniffing away. We figured out that it was my body wash he was into and I told him where I got it.\n\nNow we both use the same raspberry & peppermint bodywash. I also have the body mist and hand lotion. He has the hand lotion, body lotion, and I think a deodorant as well.",
            "I'm AFAB and use \"men's\" deodorant and body wash.  I prefer the fragrance,  plus you usually get more product for the money.  I haven't had any side effects .  I did get told I smelled nice, and then got a stunned look when I said, \"Thanks,  it's Axe\".    😆",
            "Nothing like smelling like fresh fruits and flowers after a hard sweaty manly day. 😊 \n\nFor years, me and my sisters would share this nice fruity flowery body wash that we left in the communal shower. It tends to run out after like 3 weeks but since there’s 3 of us, we figure that one of the others may have been a little liberal with it after a long day. We never said anything until the day we run out and none of us are able to replace it till around a month since none of us have the time to go get it. After 2 weeks, the magical body wash showed up in the shower and we were so confused. None of us bought it, my mother wouldn’t buy it, so who? Our mom just rolled her eyes and told us, ‘it’s your dad. He’s been using your body wash for a while now and didn’t want to say anything. He likes it more.’ We didn’t say anything to him and pretended that he still wasn’t using it.",
            "My dad lived with us for a short time after his wife died. He was absolutely gutted that his grandsons painted their nails etc. I made a point every morning to yell across the house \"\" WHICH ONE OF YOU HAS MY BLACK EYELINER \"\".  I did this for months with various other \" girl\" products. He still talks behind my back about my kids that he never bothered to spend time with while they were younger.",
            "I’d have poured out his manly soap and dumped the girly one into his. Have fun!",
            "I only use women's deodorant, simply because Berry's smell better than whatever manly word they put on the men's deodorant. No shame.",
            "My fiancé always uses my soap and gets complimented on how good he smells 😂",
            "You my friend, are a mad man. I am surprised you are not in jail.",
            "Good for you👏🏼👏🏼👏🏼 Stood your ground in a non-confrontational way. Team player. Way to keep peace over basically a non-issue.\n\nI was today year’s old when I knew soap scents are gender related🤷🏼‍♀️ We have one soap, one soft soap, and one set of shampoo and conditioner in all bathrooms and when we travel. No one cares. Get ‘er done period",
            "🤣🤣🤣 “the revenge I’ve been exacting for 20 years” \n\n\nThank you for making me laugh so hard",
            "Soaping up while singing \"I feel pretty, oh so pretty\"",
            "That is hilarious- you played the long game & are still winning",
            "Yeah fuck that noise, I absolutely detest any and all made for men body wash. They all have that axe body spray esque smell to them and are terrible. Except those that are based on good colognes, they can be nice.\n\nWhen I shower I want to smell flowers, fruits and/or lavender",
            "My boyfriend legit just let his soaps run out and didn’t buy anymore and just started using my stuff. He says he deserves to smell like a lush garden just like me. He’s right",
            "Man I always use those soaps. Currently switching between strawberry shortcake and berry waffle cone.",
            "I used laundry detergent to wash for a few days.  My wife is still horrified by the story.  I'm like, \"when we met I didn't even keep toilet paper\" (I used a nearby convenience store...got tired of paying for assholes to steal rollers of tp at my house).",
            "I love this! Our girly stuff often has more skincare ingredients too!",
            "I always buy whichever soap is on discount, which often happens to be women's shampoos or conditioners. I don't care, they both often use the same shit just different fragrances.",
            "What it smells like in the bottle is different then what it smells like on your body; that’s why he probably can’t tell you used a “girly” fragrance. I used to sell fragrances and several women’s fragrances smell pretty good on men. Not many of the women I helped tried on men’s fragrances so I have no working knowledge on how it smell on them.",
            "It’s a fun inside joke with yourself. I love this story!",
            "Please tell me your wife knows and finds it hilarious.",
            "He's gonna notice that the same bottle has sat in that bathroom for the past 20 years full. One day he'll notice and I hope you're prepared for that long sit down conversation.",
            "My 6ft burly bearded 29m fiance loves florals and lavender, while I 26f love the mango axe scent. And I'm a firm believer that everyone would like to smell like a cupcake if possible. Who doesn't wanna smell delicious?! Delicious isn't gendered, it's just tasty. Enjoy whatever your nose likes.",
            "Ha ha ha you sure showed him.",
            "Truly, epic petty!",
            "It's very adorable ha ha",
            "You are a badass in the history of Dwight Schrute. Sir, I salute your devious ways.",
            "Way to keep a grudge!",
            "if you and your girlfriend ever get married, you should tell this story at your wedding. it'll probably get some good chuckles.",
            "You little rebel!  I like you.",
            "🤣😂🤣😂🤣🤣 it is so silly 😜 got me cracking 🤣 😂 👌",
            "This is sooo petty and barely even classifies as revenge but god damn I love it...",
            "Why the fuck should it have mattered in the first place? Hell, i love the \"manly\" stuff but will rock the shit out of a \"girly\" smell if it's what gets me clean. I currently have manly body wash/soap( i personally prefer the bar soap to liquids), and my wifes conditioner for my shower routine",
            "I’d agree it’s a stupid thing to be worried about, but in a way it shows he was trying to be welcoming by getting you the “manly soap” lol",
            "This is fucking hardcore",
            "How refreshing! A real plausible petty revenge!",
            "I’m not allowed to use my girlfriend’s soaps and shampoos, but that’s because they are bloody expensive compared to mine. \n\nAlso any revenge against her father , petty or otherwise, that may or may not be needed will be covered under the “I’m shagging his daughter” clause",
            "I think your father in law just likes you and wanted to do you a favor. He wanted to go out of his way and provide something extra for you, and continues to do so until this day.\n\nIt's sometimes hard to find something specific that you can do as a favor to someone, so he jumped at this perceived opportunity. \n\nRegardless of which soap you are using, you could tell him how much you appreciate his soap, and he would be very happy, because he is doing it for you.\n\nUnless you want to be petty....oh wait...",
            "It seems a little bit mean spirited tbh, I think he genuinely thought that you wouldn’t want to use her soap and was trying to be a good host. ",
            "Childish and petty. The man meant well.",
            "Dove moisturizing soap is great.",
            "😂😂😂",
            "My husband is very manly but he uses my soap because he loves the smell.  And it doesn’t bother me at all 😊",
            "My husband likes my soap better. I have very sensitive skin, so I get unscented soaps.",
            "Thats when you buy a little bottle of the sweetest smelling, “girly” perfume and whenever you go over there spritz some of that on when you get out lol",
            "What's wrong with women's body wash? I sneakily used my wife's until she switched to something overly floral. My skin never felt so smooth and clean...",
            "Yeah you really showed him.",
            "It’s the little things that bring us joy. Live your best life my guy. 👍🏻",
            "Dude you can't wash your butthole with a girly wash it will make you gay!!! Your fil knows!!!",
            "Is it just me or was anyone else a bit concerned about how long it took him to find \"manly\" soap? Like... Don't you use soap every time you shower? Shouldn't you know exactly where it is?",
            "You smell good sweety. \n\n“That would be me Sir”",
            "Sounds like more of a traditional thing now lol",
            "You dont need \"manly soap\", the confident masculinity must be intoxicating. Lucky wifey",
            "I like the women's stuff it smells good and makes the skin feel nice. But wtf is with the price? Mens is so cheap compared to women's and it's not really better",
            "Ummmm I see the petty but not the revenge.",
            "tbh it sounds like the dad was trying to make you feel comfortable in his house. and u even said u prefer manly scents. played urself. ",
            "Why would they have to dig up manly soap? surely the guy insisting you use manly soap uses manly soap himself? This makes no sense to me",
            "…pettyrevenge? This dude has his father in law rent free in his head. Pretty sure this loser lost the battle lmao",
            "Your father in law being a real man in nature expected you to not want to smell frilly and girly and went up and out of his way making the effort to try and better a situation for you and make you feel welcomed and comfortable and you see it as a slight? Bro grow a pair of",
            "Sounds more like he just wanted to help you to not smell like flowers",
            "So your revenge is using the soap that you don’t want to use? Wow, you’re brutal",
            "[deleted]",
            "I think he was just trying to help...",
            "Wow you really showed someone who was trying to comfort you.",
            "Hopefully it's as simple as fragile masculinity and not something more devious or perverse such as some incest fetish and that's the bottle with his jizz in it.",
            "In a way, that's what I did. I only had two options in the moment, but I def used the strongest-smelling girly one that was available :)",
            "Take it further, use a really strong floral perfume with it. Find some glitter body lotion too and sparkle!",
            "I wouldn't, not because of the smell, I like the smell, but have you seen the cost of their products?",
            "Lavender.",
            "I don't know why some men are so desperately insecure about this sort of thing. My wife and I always use the same shampoo/shower gel. Various fruity ones, several bottles of Lush shower gel etc. I actually like how they smell and I couldn't care less that they don't have a \"manly scent\".\n\nI've also used my wife's deodorant a couple of times when travelling as well. For example on one occasion I forgot to pack one, so just used hers (with her permission of course). The floral scent lasted all of 15 minutes and was way preferable to having sweaty armpits later in the day. \n\nDon't get me wrong, I use normal aftershave/cologne after a shave and usually use guys deodorant at home, It's just that I really don't care whether the stuff I'm using has a \"manly scent\" or not, and neither does my wife.",
            "Haha, I can't believe that I've never thought of this after all these years!",
            "Nah, get a bottle of “manly” soap, use it then refill it with “girly” soap.  ",
            "This reminds me of a party at a friend's house. One of the guests was wondering why he smelled like floral perfume, and it turned into this hilarious mini-mystery. Everyone, including the hosts, was searching their belongings, smelling themselves, and trying to track the origin.\n\nI ended up \"solving\" the mystery after visiting their guest bathroom (used by their kids). It was their scented hand soap. :-)",
            "Ha! Beautiful summary :)",
            "It’s true. I feel like this post really sums up the entire spirit of this sub.",
            "To add: no amount of feminine-targeted product will make a hetero bloke change his orientation! Wash him in flowery stuff, put Chanel No 5 behind his ears, pop him into a frilly frock and a pair of kitten heels, he will still want to crack onto the women at the party.",
            "I prefer using womens soap its smells better tbh",
            "Lavender is one of my favorites as well! You're a man of fine taste",
            "The all-in-one aspect of most men's wash is really annoying!",
            "I'd be shocked if anyone but me remembers this at all. It was such a non-event. \n\nIt's why I've never shared it with anyone. I think they would (rightfully) wonder why this mattered in the moment or why it would persist for all these years.",
            "In my marketing classes, we were taught that Right Guard odorless and Secret odorless were the same products with different labels.  It’s all just a matter of marketing, and lots of products are sold with contrived differences.  The other example that they used was Marlboro vs. Virginia Slims; they’re both just cigarettes at the end of the day.",
            "THIS is the real question! I've often wondered this myself. We don't visit all that often, so a bottle of body wash could realistically last years if nobody else was using them, and I don't think anyone else is. \n\nThey still occasionally get switched out though (both manly and girly varieties). \n\nSo to answer your question, probably not??? IDK though. And I'm definitely not outing my pettiness by asking lol",
            "I am female and use men's products as well.  I have a problem with ingrown hairs on my legs and there is a brand of bar soap with sand mixed in with it that is a pretty effective exfoliater.  Womens exfoliaters often use plastic microbeads that I am not comfortable using because of the environment.   Use what you like, jmo.",
            "Haha! Why can't we all just use what our noses like??",
            "Funny. I use men’s deodorant because I hate smelling like food, flowers or baby powder. \n\nMy husband wears a tom ford perfume that’s actually “for women.” I don’t think he knows, but I also don’t think he would really care. It smells nice on him either way!",
            "Haha my husband and I always laugh at how ridiculous his deodorant is. You mean you DON’T know what swagger, captain, krakengard, and nightpanther smell like?? We’re those weirdos standing in the aisle smelling every variety before buying 🤣",
            "Not gonna lie, I kinda chuckle to myself every time I shower over there :)",
            "Eau Savauge smells great on women.",
            "I’ve worn men’s fragrance for decades. I prefer it over women’s most of the time.",
            "We just hit our 18th year wedding anniversary a couple weeks ago. This story did not get told at the wedding lol",
            "* To be clear, it's the only conditioner in the house, and i currently have the longer hair....and more often than not we share the manly soap/body wash",
            "Hard agree on all. At least it's a victimless crime?",
            "Yea, the revenge is 100% in my head. But it's somehow still just as sweet",
            "The post said ‘a few minutes’ he utilized dig to add more drama",
            "A manly man should never use soap that has *touched another man!*",
            "Looking for a new bar maybe? My parents always used bar soap and put a fresh bar out for guests.",
            "I mean, yea - that's a decent TLDR. \n\nI did set up the story by saying that this borders on not qualifying for \"petty\" or for \"revenge.\"",
            "Buy some snow fairy from lush and take it with you.",
            "Your FIL already finds you attractive OP, he’s on a knife’s edge, and here you are pushing him to a full breakdown with your girly floral aroma.",
            "and it hasn’t turned you gay yet. Imagine that",
            "Get yourself some of that not-good-for-actual-soap-but-insanely-potent smelling bath and body works stuff. The scent stays around.",
            "I've definitely received some looks in the past because I let my daughter paint my nails with glittery nail polish. This would perfectly accentuate that!",
            "Once when I was a student my parents were visiting. My father, after taking a shower, proudly informed me that I can now toss out the nearly-empty bottle of shower gel or shampoo I had had in the bathroom - the one I really really liked and had saved the last drops of because it was so expensive to buy... \n\nI never said anything, just started to hide the fancy stuff when they came for visit.",
            "Excuse me Satan, I just wanted go say I am a huge fan. Love your work!",
            "Something with lots of glitter, so it'll stay with him for a while . . .",
            "Couldn't he just smell his hands? Not the sharpest pencil in the box.",
            "And have a fair chance at me.\n\nI love Chanel no. 5, lol.",
            "There was a period when I preferred \"male-y\" soap. It could have been something my then-long-distance-boyfriend used... anyway, I had a bottle. And now I tend to keep one soap-n-shampoo type things for swimming pool visits (I don't want to carry two bottles) and the choices are \"men's\" and \"children's\" - and I really don't want to carry a bubbleum smell around.",
            "And I’m a woman who hates how it smells. I like the manly scents. Doing my part 😊",
            "My husband LOVES lavender scented soap, body spray and shower gel. I indulge him because I like it myself.",
            "I love the all in one stuff! I use it all the time. I'm a woman 😂",
            "Good story for his wake though.",
            "I have so many of these little things. I have told my partner several times: “hey do you remember X situation from 6 years ago? No? I didn’t expect you to. Well *anyway* (tells story as to why it’s still on my mind).”\n\nThey usually roll their eyes or just say “bulb, what the fuck?” (Endearingly) while I am extremely proud of myself or laughing my ass off or whatever haha",
            "MIL knows- or thinks you don’t shower- she hasn’t replaced the upstairs manly soap in years",
            "Yes! All about perceptions. I'm glad that Old Spice has started making Lavender-scented products to combat some of the misperceptions about gendered products that are out there",
            "Solvol is AWESOME isn't it. I stole 20+ bars from a shitty workplace over 10 years ago and I have yet to use them all up, it lasts forever and it's very effective.",
            "I so much agree with you about smelling like food. Some flowers are nice but forest and pine smells are gorgeous ... and for some reason \"only for men\". Weird.",
            "Happy Anniversary ❤️❤️",
            "shoot sorry i missed the part where you said she's your wife now.",
            "Tell it at your 25th/silver anniversary party",
            "Sure. But it is strange to meet genuine hospitality with such hostility.",
            "The \"revenge\" may be questionable but the \"petty\" is definitely strong! Well done!",
            "I loved snow fairy from Lush! So sweet and bright pink. Unfortunately the kast time I bought it, it smelled different than before. Otherwise I think I would smell like snow fairy all the time.",
            "I'm reminded of that post from a while back where the OP's neighbor was absolutely *apoplectic* because he received a pink or rainbow envelope in the mail (I think the OP sent it to him on purpose as revenge or to rile him up? Can't remember all the details). The guy was terrified that it would somehow turn him gay or that his neighbors would think he was gay simply because he received mail that was pink. Great demonstration of his security in his masculinity!",
            "YAS. Let. Them. Look! \n\nMy stepdad once got mad at my mom for having a pedicure date with me and my young son. He was AGHAST that she \"condoned that kinda shit\". Umm hello, my son has 2 moms remember? If he's gonna be gay I don't think the pedicures are gonna be what does it? Idiot.\n\nWhen we were there I made sure to get a selfie of all of us there because behind us in the selfie you can see a B tier famous local athlete getting a pedicure with his wife and son. This huge manly dude barely fit in the chair he was like at least 6'6\". He let his very boyish SON pick out all of their polish. Mom got red sparkles and dad got blue sparkles and son got both because together they make Spiderman! My son copied them and couldn't wait to show his asshole grandpa his \"Spiderman nails\" when we got back. My stepdad is a bigot, but he's smart enough to keep it behind closed doors because he knows I will cut his ass off SO FAST, so he begrudgingly complimented my son's beautiful sparkly nails lol.",
            "It takes a real man to be that good of a dad!",
            "*It was just, like, soooo weird, I mean, like every time I lifted something to smell it that weird scent was there...!*",
            "It sounds like the kids used the soap and then wiped the scent on their Dad?",
            "Ha! If I gave them a real chance, I probably would too. I can't help but feel like they're trying to cheat me or that they think I'm not sophisticated enough to buy separate bottles of different types of wash. ..",
            "I often wonder this! The bottles get switched out occasionally, but I'm not sure what prompts it lol",
            "Hostility?! I was slightly annoyed and I've done something for years that's more dumb than anything else because I find it funny at this point. \n\nThere has never been any hostility aimed toward my in laws for this at all. As I said in another comment, this was a complete non-event that I don't think any of the other three people involved would even remember.",
            "Lololol - pretty easy to figure out what that guys secret internet searches consist of!  He’s going to give himself a heart attack worrying if anyone figures out what everyone already knows 😂😂😂😂",
            "Aww this is so sweet. I bet he rocked those Spiderman nails!",
            "The active ingredient is caustic soda for the moat part, it cleans and sanitisers well. The rest of the ingredients are hugely variable but really all in one is just simpler.\n\nYoutube how to make soap and you will find very few people making it and heaps of sheeple recycling or changing solid soaps into liqid soaps and claim they're \"maing soap\".\nThen you learn how to formulte soap and its really just fat and ash, always has been.",
            "Ok. I misunderstood.",
            "By day 3 they were chipped and disgusting but for the first 2 days they were awesome! \n\nI think what annoyed me the most is that my son is VERY stereotypically boyish and always has been. I'm super queer and was a gender non-conforming kid so I've always been hyperaware that my kid be given every opportunity to express himself and his interests no matter what. Well guess what, homie is basic. Typical age and gender appropriate toys? Loves em. He has grown his hair out longer now than both of his moms but only because it's the trend for boys his age at school. Will wear pink shirts, flowery shirts, sparkly shirts etc, but only because he doesn't give a flying ass about what he's wearing. Looking cute or stylish? He has no fucks for that.\n\nSo my step-dad calling into question a little boy's masculinity over painted nails isn't just rude and inaccurate, it's also entirely inconsistent when the kid is stereotypically boyish. Good for him that I don't have a feminine son though because he still would have been wrong and I would have been annoyed, but also I'd be mad as hell."
        ]
    }
}