{
    "Official Gear Purchasing and Troubleshooting Question Thread! Ask /r/photography anything you want to know! June 21, 2024": {
        "title": "Official Gear Purchasing and Troubleshooting Question Thread! Ask /r/photography anything you want to know! June 21, 2024",
        "score": 1,
        "url": "https://www.reddit.com/r/photography/comments/1dl0crw/official_gear_purchasing_and_troubleshooting/",
        "content": "#This is the place to ask any questions you may have about photography. No question is too small, nor too stupid.\n\n___\n \n**Info for Newbies and FAQ!**\n \n**First and foremost, check out our extensive [FAQ](https://www.reddit.com/r/photography/wiki/introduction).** Chances are, you'll find your answer there, or at least a starting point in order to ask more informed questions.\n \n* Want to start learning? Check out [The Reddit Photography Class](http://www.r-photoclass.com/).\n \n* [Here's an informative video](http://vimeo.com/41174743) explaining the Exposure Triangle.\n \n___\n \n**Need buying advice?**\n \nMany people come here for recommendations on what equipment to buy. Our FAQ has several extensive sections to help you determine what best fits your needs and your budget. Please see the following sections of the FAQ to get started:\n\n* [What type of camera should I look for?](https://www.reddit.com/r/photography/wiki/buying#wiki_what_type_of_camera_should_i_look_for.3F)\n* [What's a \"point and shoot\" camera? What's a DSLR? What's a \"mirrorless\" camera? What's the difference?](https://www.reddit.com/r/photography/wiki/buying#wiki_what.27s_a_.22point_and_shoot.22_camera.3F_what.27s_a_dslr.3F_what.27s_a_.22mirrorless.22_camera.3F_what.27s_the_difference.3F)\n* [Do I need a good camera to take good photos?](https://www.reddit.com/r/photography/wiki/buying#wiki_do_i_need_a_good_camera_to_take_good_photos.3F)\n* [Is Canon or Nikon better? (or any other brands)](https://www.reddit.com/r/photography/wiki/buying#wiki_is_canon_or_nikon_better.3F_.28or_any_other_brands.29)\n* [What can I afford?](https://www.reddit.com/r/photography/wiki/buying#wiki_what_can_i_afford.3F)\n\nIf after reviewing this information you have any specific questions, please feel free to post a comment below. (Remember, when asking for purchase advice please be *specific* about how much you can spend. See [here](https://www.reddit.com/r/photography/wiki/buying#wiki_how_do_i_specify_my_price_range_.2F_budget_when_asking_for_recommendations.3F) for guidelines.)\n\n___\n\nSchedule of community threads:\n\n| Monday      | Tuesday | Wednesday   | Thursday | Friday | Saturday | Sunday |\n| ----------- | ----------- | ----------- | ----------- | ----------- | ----------- | ----------- |\n| 52 Weeks Share      |  Anything Goes       | Album Share & Feedback | Edit My Raw | Follow Friday | Salty Saturday  | Self-Promotion Sunday\n\n___\n \n**Finally a friendly reminder to share your work with our community in r/photographs!**",
        "num_comments": 73,
        "comments": [
            "I think I need a software recommendation...\n\nI have to do some insurance work coming up where I need to store pictures alongside descriptions, web links, and other text fields (original location, type of damage, purchase dates, estimated value, manufacturer, etc.).\n\nWhat would y'all use for something like this? I think it's more of a catalogue solution but I'm a bit outside my wheelhouse for this.",
            "Are there any pocketable cameras worth buying for a budget of ~$200 or am I better off going mobile and getting something like a google pixel 7a? Right now i have an iphone 11 and the photo quality is UNBELIEVABLY shitty. Everything comes out smudged and grainy. I just want something I can easily keep with me for the day-to-day that is better than the absolute garbage that is my iphone camera.",
            "Is this sensor damage?\n\nI am looking into purchasing a used Fuji X100F. The seller has pointed out that there are vertical artifacts in the photos taken with the camera. Does this look like sensor damage or something else?\n\nhttps://preview.redd.it/m4nfjup8fw7d1.jpeg?width=1125&format=pjpg&auto=webp&s=093bd79cc567c347e41e7e349992f76616d0094e",
            "To make a long story short, I have a photo of me and my family that was taken nearly 8 years ago that I've screenshot from a video we took since I no longer have the original picture. The photo is incredibly blurry and I've been looking at ways to try and make it less blurry but I'm not very tech savvy when it comes to editing photos or videos. I downloaded a couple of apps that were recommended to me from Google and nothing really fixed it. The closest I got to having a decent photo was an AI enhanced photo from an app but I had a huge problem with the fact that it was very clearly AI. I would love to give this photo to my family as a reminder of a great memory so I am asking for any advice people could give me on helping to unblur the photo, or how to make it look really less AI generated. I appreciate any advice and support I can get thank you so much for your time.",
            "What is the difference between the Godox AD400 and the Godox AD400 Wistro?  I have a feeling it is something small.. but I am missing it.",
            "If I get a canon r100, should i get the kit R18-55, or is using a already owned ef 18-55 with an adapter just as good.",
            "# Fuji ? What can I chose ?\n\n[Gear](https://www.reddit.com/r/photography/?f=flair_name%3A%22Gear%22)\n\nI'm planning to return to photography after more than a decade of using only my cellphone. I'm particularly frustrated with my travel photos and want to invest in a mirrorless camera. My last camera was an old Nikon D5200. I intend to use the new camera primarily for travel photography, focusing on landscapes and street scenes. I don't have any interest in filming. To start, I'm looking for one or two versatile lenses.\n\nWhy Fuji? I've heard good things about the brand, especially the quality of their images. Most importantly, I appreciate that I can use the JPEG files directly with Fuji's film simulations, as I'd prefer to avoid spending hours editing RAW files. However, choosing a camera from the second-hand market is challenging. I don't have a specific budget, but I'm aiming for a \"good deal\"—let's say around $1500 for the camera and one travel lens.\n\nHere's what I've found so far:\n\n* The XT3 is the least expensive, available for around $500-600 in my area. I'm concerned about it becoming outdated, though.\n* The XS10 and XT4 are available for around $700.\n* The XS20, which seems great with its new film simulations, is around $1000.\n\nI'm unsure if I need weather sealing or in-body stabilization since I won't be recording videos. With these prices being quite close, it's difficult to decide which deal is the best. Should I consider another brand or perhaps a good bridge camera instead?\n\nSorry, this post has been removFuji ? What can I chose ?\n\n[Gear](https://www.reddit.com/r/photography/?f=flair_name%3A%22Gear%22)\n\nI'm planning to return to photography after more than a decade of using only my cellphone. I'm particularly frustrated with my travel photos and want to invest in a mirrorless camera. My last camera was an old Nikon D5200. I intend to use the new camera primarily for travel photography, focusing on landscapes and street scenes. I don't have any interest in filming. To start, I'm looking for one or two versatile lenses.\n\nWhy Fuji? I've heard good things about the brand, especially the quality of their images. Most importantly, I appreciate that I can use the JPEG files directly with Fuji's film simulations, as I'd prefer to avoid spending hours editing RAW files. However, choosing a camera from the second-hand market is challenging. I don't have a specific budget, but I'm aiming for a \"good deal\"—let's say around $1500 for the camera and one travel lens.\n\nHere's what I've found so far:\n\n* The XT3 is the least expensive, available for around $500-600 in my area. I'm concerned about it becoming outdated, though.\n* The XS10 and XT4 are available for around $700.\n* The XS20, which seems great with its new film simulations, is around $1000.\n\nI'm unsure if I need weather sealing or in-body stabilization since I won't be recording videos. With these prices being quite close, it's difficult to decide which deal is the best. Should I consider another brand or perhaps a good bridge camera instead?",
            "Just a general opinion ask. I’ve been using a Nikon D80 for a bit now. I’ll be looking to upgrade sometime in the next year. Naturally I looked at Nikon but I realized the mount type is different on the mirrorless camera so it would be a whole setup overhaul in theory (body and two lenses). With that, for just nature and bird photography, what brands and cameras have you enjoyed? Assuming Mirrorless is the proper change now.  I’d looked to find it used so any expertise on when to shop would also be great!",
            "Hi there, my cousin has a Canon rebel EOS t-100 and a EF S 55-250 zoom. I just got into photography and I told him I'd help him learn to shoot with this camera. I know that the body is great for a beginner to learn on and get started and I don't want to just tell him to go out and upgrade right away.\n\n He also has the Google pixel 8 takes Amazing photos too. Do you think his Cannon would be worth taking on a trip to Japan in September? Or would you suggest if he's really into it, to upgrade within his budget prior to the trip and take a totally new-to-him camera.",
            "Hey I bought canon eos r10 half year ago but lenses are so expensive is it worth to swap for sony right now? I can't find affordable lenses for me. There are more cheap lenses for sony camera. My canon is new but im thinking of buying used full frame sony. What do u think?",
            "Question: how often do you change the autofocus microadjustments settings in camera?\n\nI just got into shooting on a sigma art  50mm f1.4 lens for the first time.  I find it hard to nail focus. My first impression was that I thought the autofocus was faulty too far back  when I tries it on objects - so I adjusted it plus 5 forward. Then I shot a few portraits with friends and the focus was on the tip of the nose but not perfectly on eyes. It got good when I adjusted it to plus 1. \n\nSo my question is if this is normal for f1.4 and changing this setting on every shooting is normal? Am I doing something else wrong? Pls help.",
            "Which monitor should I get for my girlfriend? \n\nI am currently looking at these monitors, ASUS Pro Art PA279CRV, Pro Art PA279CV, or Dell U2723QE\n\nI am looking to get a monitor for my girlfriend for her birthday. She does mainly does portraits, weddings, and some fine art photography and uses Adobe Lightroom to edit. She primarily posts picture online, so I made sure each monitor had 100% SRGB. Occasionally, she does have to print photos but that is only for school which she is about to complete so I don’t know if I should get something that is 99% Adobe RGB.\n\nShe will be connecting it to a Macbook Pro\n\nI am stuck between these two monitors and do not know which one to fully go with. They are both 4k IPS panels but I do know the Dell has deeper blacks. Right now I am leaning towards the ASUS because it has the Adobe RGB",
            "I'm currently paying around $50 a month for a custom Lightroom/Photoshop plan that gives me enough cloud space (3TB) for a catalog of over 100,000 photos and growing.\n\nI'm finding this cost a bit steep as I mostly do photography for fun (though I have the occasional sale or gig).\n\nWhat I love about Lightroom is the ability to access all my photos on demand on both my mobile and laptop/desktop. However, I'd prefer a one-time purchase program (like Capture One) that I can connect to a cloud service.\n\nSo I guess I'm looking for two recommendations:\n\n1. A program that is comparable to Lightroom but is not subscription-based. It should integrate reasonably well with cloud services.\n\n2. A cloud service to store a large amount of RAW, JPEG (and ideally movies) for a more reasonable fee like $10 or $20 a month.\n\nI would prefer a service that doesn't strip information from the files either in terms of downsampling or getting rid of EXIF information.",
            "I am trying to find a good backpack for taking out with family. I currently have a Peak Design 3L sling and a LowePro GearUp Creator Box II (Large) backpack insert. Over last few years I have tried to find a good backpack that offers a small camera compartment for my Fuji X-T3 + 16-80mm + 70-300mm. \n\nThe LowePro insert is actually a great size for the camera/lenses, but a bit of a pain to take in/out of the backpack I toss it in since I usually have bunch of kids clothes and snacks in there too. The photography focused backpacks that seem to be properly sized for my camera/lenses have a very small general compartment and usually just 1 slot for water bottles (LowePro Truckee LX 150). The ones that are larger and have 2 water bottle pockets seem to be way oversized in the camera compartment (LowePro Truckee BP 250). \n\nDoes anyone have any recommendations for a crossbody or backpack that has 2 water bottle slots for the kids, good general storage space, and the camera section sized for a small mirrorless camera like the X-T3?",
            "Hopefully they mean it when they say no stupid questions. \n\nLast year I bought the basic Canon EOS R50 Mirrorless kit that came with just the 18-45mm lens. I want to use it for skate photography but cannot seem to get the best photos as adjusting settings is daunting.   \nIf its just down to \"take more pictures and practice\" thats fine, but if I should be using a different camera I'd like to know now before I go overboard on lens and accessories. Is there a more friendly camera setup that is better and/or easier for the type of freeze frame photography I want to do?",
            "I am looking at upgrading cameras from a Pentax kx to a canon R5 or R8. My concern is my Pentax has a big boy lens that I’m not willing to part with. \n\nAre there adapters that will go from Pentax Kx to canons?",
            "Hey everyone! I own a Canon R5 and R7. I'm wanting to get my first speedlight for the R5, mainly. But it'd be nice if i could use it with the 7 on occasion. One issue I seem to be seeing a lot, is that apparently 3rd party flashes don't work in both HSS and TTL modes simultaneously. I'm wondering if this is as big a hindrance as people make it out to be? My other option of course is to go first party canon, but i'm not seeing many options from them for off camera flashes. Ideally, i'd like one I can use off camera, with a trigger on my hotshoe, that I could eventually add a strobe to as well in the system. Something I can really grow with. Godox seems to check all those boxes nicely, and yet the HSS/TTL simultaneously issue is definitely there from what i've read. So, should I just be happy with an on-camera flash from Canon? Or should I go with Godox and get access to a much larger system?     \n\n\n\nRoo",
            "NEED HELP!\nI always wanted to learn photography and recently I've been looking to buy a camera to learn the basics of photography. There are so many cameras and I'm not sure which one to get. I found 4 cameras and would like the experts advice as to which one would be best for a complete beginner.\n1- Nikon d3500\n2- Nikon d5100\n3- Canon EOS 600d\n4- Canon EOS 70d\nI have these options for now. Which one should I buy? Is there any other camera that I can get to learn photography which is also not expensive?",
            "So to put this simply I have absolutely no idea about cameras. I need it to take nice Instagram videos & pictures. Ideally being able to zoom x2-x3 without falling below 1080px x 1920px for videos and not falling below 1080px x 1080px for pictures. Budget let's say maximum 500 Dollars? Is that possible or should I put more budget? Please suggest any cameras you think would be good for what I am looking for.",
            "Talk to me about DNG files. I'm aware of what they are, but the phrase \"lossless compression\" always makes me suspicious. It's a very well-liked and popular format though, so maybe my skepticism is unwarranted here. Can you recover overexposed highs/underexposed lows as effectively with a DNG as you can with a RAW image? Do they handle tweaking and manipulation as effectively without artifacting and loss of quality?",
            "Hi! Looking for recommendations for a fast ultra wide prime for either canon EF or RF. Sub £500, mainly  to be used for music videos.\n\nI looked at the RF 16mm f2.8 but I'm not convinced enough that I'm making the right choice. (Seems a bit too good to be true for the price)\n\nPs doesn't have to be new will consider discontinued or vintage.",
            "Hey, very new to photography so apologies if this is a stupid question.\n\nI have the godox dp iiiv 600 strobe light and sometimes when I turn it on it produces a crazy amount of light so I hit the dump button, it discharges a load of light then I can shoot.\n\nHowever a few times lately I hit the dump button, it discharges but it still produces loads of light, I get it back to normal by a random combination of turning the camera, flash and trigger on and off until it sorts itself out.\n\nI always get it back on track but I have no idea how, I'm just hitting buttons until it works.\n\nCan anyone shed any light on what I'm doing wrong? Or is it an issue with the strobe?\n\nCheers",
            "What is the best printer for printing on 18 x 24-in photo paper? This is a cut sheet, not a roll. So I'm looking for a printer that is sheet fed. Thanks.",
            "My birthday is coming up and I have always wanted a camera, so I looked on the internet and found 2 cameras that are often mentioned as THE entry level cameras. The first would be the Canon eos 2000d and the 2nd would be the Nikon d3300. As we do not have a big budget, I will have to buy my camera second hand. I looked at sample pictures and was blown away by the d3300, but it often only costs 200-250 euros used. So my questions are: 1: is the d3300 a good choice or is the 2000d better? 2. is it ok to buy it used and what should I look for when buying a used camera? 3: If I were to buy a camera, what lens should I use if I want to photograph people and nature? Sorry if my questions are stupid, but I am really new to this :D",
            "Former pro portrait and event shooter here, looking to get a mirrorless to get back into hobby photography. I shot both Canon and Nikon so am (was) familiar with both interfaces as of 10 years ago but I know a lot has changed. Narrowed it down to the Canon R6 mkii or the Nikon Z6 mk iii. Will be mostly shooting a wide range of hobby stuff, family, vacations, birds, babies, as well as the occasional portrait/event shoot for friends. Will almost never need video capabilities. I know reviews for the new Z6 are scant but which would you choose? Planning to use a variety of manual and DSLR lenses I have but willing to buy some new glass if I need to. Thanks!",
            "If you want objectively good image quality, then something like Pixel 7a is a better option than any dedicated camera at your budget. I mention \"objectively good image quality\", because old digicams are all the rage now specifically because of their early digital poor quality.",
            "What Am I looking for?",
            "I believe there's only the AD400 Pro Wistro. Godox's site doesn't list anything else in the AD400 line.",
            "The 18-55mm will work fully with the adapter. But the R100 is usually sold bundled with the kit lens, at good prices. I doubt you'd save a lot by getting the camera body only and the adapter.",
            "You sure you want that camera?\n\nMight be worth saving for the R50.",
            "X-S10 or X-T4 depending on body styling you like is probably best value.\n\nHowever, all cameras have JPEGs you can use.  All cameras will have options to change the appearance of JPEGs with maybe Sony the one that does not allow in camera raw development.\n\nStill, Fuji by all accounts I have heard are fine cameras with a good lens selection.  Just that as I will link below, the in camera JPEG options of other cameras exist.  Of course, I always shoot raw so who knows if film simulations are all that.  \n\n\nhttps://imgur.com/a/w7z6H40\n\nhttps://imgur.com/a/gD1KIQV\n\nEdit, sorry for the Imgur links, they appear to have went absolutely mental with a consent form.",
            "If your lenses were quite good, remember an adapter exists for F to Z mount.\n\nIn saying that Nikon does not really do APS-C cameras right now.  You have the Z50 or the ZFc really.",
            "Is that the only lens?\n\nFor basic wildlife or distance landscapes, it will work but not a very versatile lens.",
            "What sort of lenses?\n\nSigma are releasing some in July and perhaps you can look at an adapter and the existing EF lenses on the used market?",
            "If microadjustment is actually required and you do it right then once should be enough for that lens. Microsdjustments are typically done on a per lens basis. \n\nMicroadjustments are required more often on lenses with a larger maximum aperture since your depth of field is more shallow and therefore must be more precise.",
            "If the monitor is going to be used primarily for photo editing then most people would aim for as much AdobeRGB coverage as possible. I would probably go with the PA279CRV simply for the much higher coverage but there's more to monitors than just that. I'd highly recommend checking out Rtings.com for their quite thorough monitor reviews.\n\nMacs are also very picky with monitors and many people complain about blurry text. I use Windows and don't know the details but it's definitely something you should look into because it can ruin the entire experience.",
            "I'm not sure if this is the right type of service for you, but Amazon Prime will host all your photos for free if you have a Prime account.",
            "What issues do you have?",
            "Yes, but functionality would need to be double checked.\n\nSo autofocus, aperture control etc might not work.  Does the lens have an aperture ring?",
            ">One issue I seem to be seeing a lot, is that apparently 3rd party flashes don't work in both HSS and TTL modes simultaneously.\n\nCan you link to any examples? Because I haven't heard that at all.\n\nUsually HSS is a feature that requires TTL to work. It's part of the TTL featureset.\n\n>I'm wondering if this is as big a hindrance as people make it out to be?\n\nDepends. Personally I don't really use HSS or TTL.",
            "The canon 200d  has a  sort of \"beginner mode\" that eases you into the learning curve, That mode has terminology like \"blur background\" with graphical  instead of the usual dry numerical settings.\nMight be helpful if you're an absolute beginner. \nI would get a prime lens like the 50mm f1.8 stm and a cheap kit zoom to get started. (You will probably find that you prefer the prime after time, sell your kit zoom and buy a prime at a different focal length.",
            "Of those Canon cameras, definitely the 70D, it's a higher end model with top LCD screen (and slightly newer sensor).\n\nhttps://cameradecision.com/compare/Canon-EOS-600D-vs-Canon-EOS-70D\n\nFor the Nikons I'd go with D5200 for the flippy screen although the D3500 has a slightly newer sensor.\n\nhttps://cameradecision.com/compare/Nikon-D3500-vs-Nikon-D5200\n\nOverall I'd pick the 70D but the D5200 is also a fine choice.\n\nI assume this stuff is all listed at roughly the same price? What lens(es) are listed with them, that could greatly change the value proposition.",
            "If you have a relatively recent, decent smartphone, it can do those things just fine. Are you not satisfied with it?",
            "Are you willing to buy used? Buying in the USA?",
            "Any camera from the last 10 years will reach those resolutions for video and 10x that for photos. In a real camera the zoom is optical, so you don't lose pixels by zooming. \"Digital zoom\" is what we'd just call cropping. \n\nLook for a secondhand DSLR like a 70d, and a standard zoom lens. Throw in an external microphone and some cards and you should be able to squeeze under $500. If you want to buy new, something like a Canon R50 is a good place to start, but it's pricier. There will be a learning curve compared to using a phone.",
            ">the phrase \"lossless compression\" always makes me suspicious\n\nWhy? It's not being used dishonestly. Compression can be lossy or lossless, and lossless compression used for DNGs is truly lossless.\n\nMany native raw formats use lossless compression too.\n\n>Can you recover overexposed highs/underexposed lows as effectively with a DNG as you can with a RAW image?\n\nYes. Because the data giving you the latitude to do that is still there.\n\n>Do they handle tweaking and manipulation as effectively without artifacting and loss of quality?\n\nYes. Because the data giving you the latitude to do that is still there.\n\nIf the compression caused artifacts or reduced quality, it would be called lossy compression, not lossless.",
            "If you're considering vintage, does that mean you'd be OK with the Samyang manual focus ultrawide primes?\n\nre: the RF 16/2.8 there are lots of reviews out there to tell you the pros/cons",
            "I mean, the 2000D is not a great camera.   Even the 10 year old D3300 will be comparable to it.  I would look at Canon xxxD or Nikon D5x00 cameras if possible as they are slightly higher end.\n\nIt is often easier to buy through a reseller than a private sale but generally you want to make sure everything works.  A few cosmetic issues don't matter on a camera body.   A bit of dust in a lens also does not matter.\n\nThe best lens to start off with, especially on a budget is the standard zoom that would come with a camera which will be around 18-55mm on the cameras you have selected.",
            "Sorry. it is especially prevalent in the darker areas of the image. It looks like vertical artifacts running all the way up and down the photo.",
            "appreciate the feedback. I also have a 55-250 and a 50, both ef. so getting the adapter seems to make sense. just wondering if there is a big difference between the r18-55 and ef18-55 with adapter.",
            "I didn’t even think about the adapter so thank you for that! I was checking out the Z50. I like the ZFc but it seems the main difference is design and ergo which I could see being more important out in a Forrest after a while. Appreciate the input!",
            "Yeah, I have a full frame Sony - so not super familiar with options. But id probably grab him a wide angle zoom or prime and the nifty 50 Canon 1.8",
            "Mostly I need something like 24-70 F2.8 but the cheapest is for canon ef for over 1k € but for sony samyang 24-79 f2.8 is around 800€ or maybe u know any similar but also cheap",
            "But different manufacturers absolutely have their design philosophys that prioritize back-focus or front-focus, right? \n\nI'm pretty sure I like pulling focus point a little forward on objects and a little back on people\n\nOn my canon 5dmk4 the microadjustments plus 5 and plus 1 are both pretty small. I'm really talking about details here",
            "The last instance was that the shots were very grainy, but I learned this was due to too high of an ISO, but switching to auto caused it to be way too dark. And since these were very much \"in the moment\" shots getting skaters to do tricks again wasn't an option so I had to adjust on the fly (it was also dusk so light constantly changing was annoying).   \nAnother seems to be just an experience issue since the R50 has a ton of options that I perhaps won't use for a while, if ever. Manual mode is my default for aperture and speed. But there is also aperture priority, shutter priority, programs, auto AI subject detection, and more.   \nThe last camera that a really used was a Pentax K1000, which was comparatively simple and I was pleased with all my shots from it.  \nThe more I think about it its perhaps down to me just understanding the photo triangle of iso/speed/f-stop better, and adjusting for conditions. But if there is a digital camera that is more streamlined without all the extras it may not feel so overwhelming.   \nIs there a digital equivalent to the K1000?",
            "Yes indeed, check this out: [Godox issues with the R5 are only if TTL and HSS are used at the same time, right?: Canon EOS R Talk Forum: Digital Photography Review (dpreview.com)](https://www.dpreview.com/forums/thread/4601160)\n\n  \nAgain - i'm brand new to flashes so I may not grasp all of this fully. Seems like a great flash, just want to make sure it's not fundamentally flawed.",
            "I meant like zoom in while still the image being HD and not blurry. My phone is a Galaxy A53 5G so not sure if this qualifies as new. Would prefer something better for cameras",
            "Yes. I was thinking that might be an option. Re the samyang. But wasn't sure where to start with specific models. Then focusing might be something to consider. Maybe have to look at follow focus for my gimbal. (A lot of camera movement in the work in question)\n\nYes. A lot of people saying the RF 16/2.8 is a bit poor for autofocus speed and corner image quality. (Probably not a major issue for me) I just want a lot of detail and a wee bit shallow DOF.",
            "thank you sir",
            "would you recommend an sony a6000 if i would have the chance to get one with lense for 330?",
            "Yeah, I thought that was just the fence or parts of leaves.  It is quite difficult to see and could almost be JPEG artifacts or PDAF points showing through.\n\nIf you have doubts, I would not purchase it but perhaps if you had a high res raw file you could check it better.",
            "The adapter doesn't change the optical qualities of the lens, and both are fairly similar kit lenses.",
            "If you can grab some cheap lenses second hand then that would work.\n\nIt is a basic camera but use what he has is best.",
            "I'm making photos of People on events in bad ligh that's why I'm thinking about full frame bit used",
            "I would not use manual mode except in circumstances where you don't want the exposure changing.  Auto ISO mode would probably work best there with a limited range of ISO.\n\nIf you are doing some more low light situations a wider aperture lens would work better.\n\nBut yeah practice makes perfect and all that.  Most cameras will be the same unless you like dials in which case Nikon and Fujifilm make models with those aplenty.",
            "Agreed, I wouldn't use manual mode for your use case, that's why you're getting issues when the light changes. Shooting action, esp outdoors, in manual can be really tough because several targets are moving at once.\n\nYou want an ISO and aperture that lets you get your highest shutter speed and least noise possible. These are action shots so they'll need to be fast, but if they're outdoors in the daytime you will have a lot of latitude. \n\nYou can either use shutter priority mode and set it to something like 1/500 give or take to see if you're getting the exposure and motion isolation you need, and adjust the ISO if they're too dark, or the shutter if you're still getting motion blur. Or you can shoot in Aperture priority mode at something pretty wide open like 4.5 and see if you're getting an acceptable shutter speed to catch the action. You'll also get nice shallow-ish depth of field which helps with subject separation. (you probably know this but the \"priority\" in those modes really just means that that setting stays fixed and the other settings change based on what is needed for proper exposure.)\n\nI'd turn on subject detection so the camera is metering off of the skater and not the sky or whatever, so you can frame up the shots the way you want and not have to worry about moving your metering spot. Not familiar with that model so YMMV.\n\nYour camera and lens should definitely get you some great results, it's just a matter of making sure your settings are working for you. Good luck!",
            "Ah, interesting. So it's more about using TTL to set the power output, and not just using the TTL system (which is the system that also manages the HSS). I much prefer manual control over TTL by choice, for off-camera flash. I can wrap my head around it better that way, and it isn't automatically changing on me or doing anything unpredictable because it's only doing what I manually tell it to. So in the extremely rare instance I would ever want to use HSS, I'd be using it with manual control and I would not encounter those problems.",
            "thank you.",
            "Well, of course the 24-70mm won't be the same lens on the Sony as the R10 being full frame versus APS-C.  So if you need that focal lengths on full frame it would be 35-105mm.\n\nIt depends on what you need.  If you think the R10 long term won't have the lenses you need then of course you can change but remember that some advantages come with disadvantages like the low light advantage coming at a depth of field expense.   \n\nIf you have multiple people and you need a deeper depth of field, you will lose the low light advantage.",
            "Okay well in that case it sounds like id be fine with Godox! That's good news cause I will likely add a proper strobe at some point.",
            "I mean i need variable focal length I need lens to make photo when im close and when im far on the event",
            "Well, it is important you get the right lens, what if 70mm is too short?\n\nI assume you do not have the 18-150mm but only the 18-45mm and find it not long enough.",
            "18-150 would be perfect but it's extremely dark"
        ]
    },
    "Photo Class 2024 Update": {
        "title": "Photo Class 2024 Update",
        "score": 39,
        "url": "https://www.reddit.com/r/photography/comments/1d8nwg4/photo_class_2024_update/",
        "content": "The Photo Class 2024 (r/photoclass) has just entered our semester break. This means it’s a perfect opportunity for anyone who didn’t join us from the beginning to get caught up. There will be no new lessons until September, so you’ll have the next three months to go through the course at your own pace and be ready for new lessons after the break. \n\nYou can find the whole course in order and trackable on [The Focal Point Hub](https://www.thefocalpointhub.com/class-2024). The individual lessons are also on the sub (r/photoclass), but the site does a good job of keeping it organized for you and marking off what you've completed. The discord server is also a good way to connect with other participants, and see how others approached previous lessons. Don’t be shy to join in there, as well. [Here’s an invite link](https://discord.gg/focal-point-with-c-london-785447750447267860).\n\n[Check here for full information on how the class works](https://www.thefocalpointhub.com/photo-class). Hope to see some of you join in the class! If you have any additional questions, feel free to drop them here in the comments and myself or /u/makinbacon42 (the other teacher of the course) will be happy to answer.",
        "num_comments": 9,
        "comments": [
            "As a new photographer, I just wanted to say thank you for this post and for creating such a great course! I definitely intend to get caught up before things begin again in September. I suppose I should just work through a couple of the lessons per week? Any other guidance you'd give to someone who is trying to move through the materials during the summer break?",
            "Thank you!! Catching up starting today. Appreciate the work that's gone into this this year, even though I haven't been able to participate. Really excited for the rest of the year :)",
            "I got asked if I could send a link to a gallery.\n\nLong story short, I went to a concert, snuck my camera in because only press could have cameras and took some shots. Posted them on Instagram and tagged the band but turns out the band like them and are asking if I can send them a link to the gallery. I don’t even know what that means, does it mean send them my Lightroom  link or something?",
            "[deleted]",
            "Hi! I'm just getting into photography. My grandpa (an actual photographer) just gifted me his old camera, a canon eos M50 and the lens is the one that came with the camera (pretty sure). it's really big and i need to make my camera portable for casual shooting. Can you guys give me some suggestions for a compact decent lens that is really cheap, like less than 100€ and i’m pushing it (cause as i said i just got my first camera and i don't care that much about quality, plus i actually enjoy a vintage look) that is compatible with my camera? Sorry if i said anything wrong, i don't really know a lot about photography yet.",
            "good question! My advice would be to read through the lessons, and note the assignments. Don't feel like you have to do them all if you don't have the time. There's 12ish weeks until we start up again, and 22 lessons. They're written to be one a week, but that obviously is not feasible. That said, some of the lessons are less time-intensive than others. Focus on what you think will benefit you the most.",
            "You probably meant to ask this in the questions thread (https://redd.it/1da6yrp). But, to answer your question...\n\nIt means they want to see all the photos in an online gallery. There are plenty of free options available. From our FAQ: https://www.reddit.com/r/photography/wiki/sharing#wiki_what_are_some_options_for_an_online_portfolio_or_client_delivery.3F",
            "Seems like you’re looking for the questions thread. This is about the photo class.",
            "Thanks again! I look forward to learning, sharing, and participating in the discussions. I feel so fortunate to have stumbled across this post!",
            "Thank you for all the info!"
        ]
    },
    "Ever want to quit photography?": {
        "title": "Ever want to quit photography?",
        "score": 17,
        "url": "https://www.reddit.com/r/photography/comments/1dltgwx/ever_want_to_quit_photography/",
        "content": "I can’t stand trying to be a “photographer-influencer” anymore. Got almost 4k followers on instagram and barely any paid shoots coming in anymore. Hate posting reels and posting on a “schedule”. I was really hoping to make decent money off of this - but the economy sucks now and people don’t seem to have extra for photos. \n\nI love photography, and people like my work, but I get imposter syndrome big time, and just get tired of the pressure to keep it all running and perform. The switching my exttrovert side ersonality “on” when I’m an introvert is so draining .\n\n Plus my area is so saturated. Someone posted looking for a photographer for tomorrow for a Wedding.. And 75 photographers responded in 1hr. Mind you, the person that posted had already called me and was rude to me on the phone and hung up on me. They had my number for over a week (I was recommended by family friend), and they chose the day before to call me -  So, BAD clients that normally would have no photographers want to work for them, are getting hundreds of people lining up because it’s business. Like, why do I even bother\n\n. I used to at least enjoy taking self portraits when things got slow but I haven’t felt particularly drawn to self portraits lately. Oh, models will message me and want to do collabs and shoots together but then slowly stop responding over time. People show up late for shoots all the time. My people skills aren’t bad either, I’m excitable to work with, positive, typically easygoing and fair. Oh and when people message me and ask my prices and I say “200$ for full session” which is typical for my area, maybe a bit. Lower, I get ghosted. \n\nThinking of just raising my prices to 500$ for an hour and if I get no bookings then at least I don’t have to deal with people lol. \n",
        "num_comments": 57,
        "comments": [
            "\n\n\nIf you don't mind my saying, this seems like a unfocused and general problem with everything.  Which to me suggests fatigue and burnout.  Not specifically about photography, but about perceived obligations.  Because you can do photography without any of these concerns.\n\nI get there sometimes.  I'm in video production as a job, so photography for me is mostly for my enjoyment.  I can usually step away when I need to.  But occupational exposure can be fatiguing. \n\n\nMaybe it's time to take a long break and do other things, rediscover what made you want to pick up a camera in the first place.",
            "I just shoot for myself and rarely put things online, as they seem to get stolen anyway. Don't chase validation from others to enjoy photography. The number of known artists online is actually very, very small, compared to the number of shooters out there.",
            ">Ever want to quit photography?\n\nBut there are a lot of aspects to that.\n\n>I can’t stand trying to be a “photographer-influencer” anymore.\n\nSo maybe quit just that part of it.\n\n>I love photography, and people like my work\n\nSo maybe don't quit that part of it.\n\n>I was really hoping to make decent money off of this - but the economy sucks now and people don’t seem to have extra for photos.\n\nIt's difficult to make much money from photography even in a good economy.\n\n>Like, why do I even bother\n\nSeems to me like you've identified the parts you like and the parts you dislike, so you could find a path forward that includes the good stuff and excludes the bad stuff.",
            "I've never wanted to quit photography, I've quit seeking validation.",
            "It's the same with anything like this now. The social media aspect is absolutely tiring. \n\nI tried to run a wildlife video YouTube channel for a good while, nothing super skilled but not bad either. Out for days in the pissing rain sometimes, multiple days spent recording footage and editing only for the YouTube algorithm to give you 200 views and call it a day. Meanwhile, the most vacuous narcisstic bollocks imaginable gets frontpage.\n\nSocial media has destroyed things tbh. 90% of your time needs to be devoted to it and because of that most interactions are disingenuous and fake.\n\nI've since gone back to photography, which is way less stressful than video - but I'm not worrying about any kind outreach or anything. I might just store photos of general life for decades and try and pay for my retirement with photobooks in a few decades.",
            "I'm pretty sure a lot of commercial photographers are feeling the same pressure. The market has changed a lot in the last decade. That's why I never recommend anyone here to pursue a full-time career in photography without years worth of portfolio and a pretty decent client base as a start, or spend time and money studying it in school because it's just not worth it (useless degree). I tell them to treat it like a hobby or side hustle and build up from there. I've seen so many people fail miserably in the last few years, going all-in only to realize it's not as easy or great as they thought.\n\nThat's also why I chose not to pursue photography full-time. I keep it as a secondary income I don't need to rely on. I'm glad I went for a stable primary career in another field instead of diving all-in on photography. Less stress and some nice extra money coming in. Definitely recommended for those under constant stress in this field.\n\nMy DJ/musician friends are in the same boat. You need to be more of an influencer than a good musician/DJ/producer. You can be the best technically, but the ones with a bigger online presence (regardless of skill) are the ones getting booked big-time. So it's not just the art market suffering from this.",
            "Shoot for yourself not for others. Live for yourself not for others.",
            "I’d say stop / take a break / do something else for a while. It’s always worth a shot to see if something will take. However, if it’s been a while and it hasn’t taken off, it’s time to shelve it and move onto something new/different.",
            "I love photography and can’t imagine what I’d do if I didn’t have it in my life. It’s my sanity and release. \n\nBut, primarily, photography is a hobby for me. I do some paid stuff and even though it is almost always the same type of images  i take as a hobby, I’m under pressure to deliver and I enjoy it a lot less - it’s much more enjoyable to work under your own steam, at your own pace. \n\nI think you can apply what you are feeling to any line of creative work. \n\nPhotography is also very disposable these days - millions of images coming at you from all different platforms. How much is an individual image worth? How much is somebody willing to pay? That’s the problem. There is definitely money to be made with photography, but paid shoots from other so called influencers seems like a dead end for the most part.\n\nAnd there is no way on earth I’d want to be a photographer influencer. God no. I get the impression within that domain, as you have discovered that people want stuff for free in exchange for “exposure”.  I’m afraid exposure don’t pay my bills.",
            "I often have moments where I wonder why I even bother taking photos. Feelings like, everything has already been captured. Or, one day I'll be dead and all these photos won't matter at all - so, why waste time taking pictures and editing them, just live purely in the moment and enjoy the gift that life is.",
            "Everyday!",
            "I shut down my business. I have 3 more events and I'm done. I'll take on certain jobs but on my terms now and if I feel like it.  \n  \nMy main reason is because doing this as a business for 10+ years, I have lost the passion for photography. I don't care how much I was making I just didn't enjoy doing any job. Plus, I never want to take photos for personal since I just had no interest. \n\nI love doing model photoshoots and landscapes.  Shutting down my business is like a huge weight off my shoulders. Now I can focus on doing it for the passion like I had when I first got into it 25 years ago.",
            "Everyday I open C1",
            "Worrying about how many followers you have on a app as stupid as Instagram should not be the end goal or motivation for you to do/enjoy photography.",
            "You gotta find your enjoyment for photography first, financial gain second. It also takes time separating the wheat from the chaff. I follow a guy that started years ago and in the last couple of years has had a lot of stuff come his way, but that’s because he was consistent and accepted the fact that not everything comes right away",
            "So you dont like running social media and trying to run  a business, keep photography as a hobby like 99% of people. Dont be sad, you tried to make somethin out of it unlike a lot of people",
            "“I was really hoping to make decent money off this…”\n\n^^^ with anything in life if this is your driver you will never be happy. If you have lost the passion for photography you need to get back to shooting for yourself and treating it like a personal treasure hunt. Another thing I always compare photography to is another passion of mine- basketball. Kindergarten-high school I played - not because anyone paid me to do it (it actually cost me money) but I did it because I love the sport. Daily practice of photography should be fun and enjoyable, and if it is not then you’re probably “into it” for all the wrong reasons.",
            "I shoot for me and only for me. \n\nI share my photos on Instagram and participate in a few Facebook groups - but that’s because I think my photos are top shit and not because I need other people to tell me so.\n\nI shoot when I want and edit when I want and post when I want.\n\nI earn money from my day job.",
            "I do photography because I enjoy it. Any side jobs I get on the side are just a byproduct. If I get bored with it, or if it comes to feel like a job…..I’ll stop and take a break.\n\nThe only time I felt like I didn’t want to do it anymore was about 10 years ago. I was still shooting on a Canon 70D. The OG Sony A7 was the only affordable way for me to leap into a FF body at the time. I made the switch and haven’t looked back.",
            "#Make Art For The Process Not For The Product!",
            "there are up and downs, this lis like a football player career..also in some point it ends and you need to enjoy the photography by ur self without ton of money coming in haha. Work in your photography as art and look for other types of income. It will pay off..  \n\n\nAt the moment I think about photography as my 20% of the income. 7 years ago it was my 80% - 100%",
            "It's never been my job  and I've never wanted it to be my job.   It's what I enjoy",
            "Some cell phones take just as good as expensive fancy cameras but you do have to have a good eye in photography",
            "Nope.\nNobody but me sees my photos.\n\nJust finished a macro shooting in the woods. I have some interesting shots and can't wait to edit and print them. And to look at them by myself.",
            "I do photography only as a hobby. Because i havd creative job and need another creative outlet where no one hassles me to meet deadlines. I think you need to do the same. Find something else to let out your creativity. Painting, cooking, writing, drawing.  You don’t have to post it online or make money from it.",
            "I can only speak for myself, but when something I do for fun turns into \"work\" it stifles my interest. Doing what I really want to do is self-motivating. Neither a boss nor even my own superego needs to compel me to do it. It flows from internal desire.",
            "I personally moved from photography to videography.\n\nI find sorting thru thousand of photos more tedious than sorting thru videos\n\nAnd especially with ai generated images, I just find photography kinda pointless now.\n\nAi video is coming, but is still probably a decade away.",
            "I tried other routes first, I went to shops asking to sell my prints, made business cards - nothing worked and I got turned away, but when I started posting on Instagram I got tons of booked sessions and even joined a community of photographers to discuss lenses, cameras, the business. It was fun. But now, it’s just defeating.",
            "Sounds like the “good stuff” is taking photos and the “bad stuff” is running a business. \n\nThat only leaves a few practical options:\n\n1. Dive headfirst into the bad stuff, get good at it, and make enough money to eventually hire it out.\n\nOR\n\n2. Disregard the bad stuff, only focus on the good stuff, and get a job that helps you to afford it.",
            "That’s exactly how I find it, since I stopped posting as regularly my “reach” has gone down and no one sees my posts anymore, which hurts my bookings. People say “why care about social media” but it’s literally my dream going to hell in a hand basket and money out of my pockets … of course I get frustrated and care about it. “Just don’t post on social media” is such unhelpful advice. It’s 2024. Not to mention the hours of work I’ve put into it already. I bet your wildlife videos are cool for what it’s worth",
            "That’s the problem!!! In order to make it in anything t these days - you need to be an influencer to gain a following and make yourself known (unless your already an established photographer) it’s exhausting because Instagram requires that you spent approximately 99% of your time on there to grow or your numbers tank and reach goes to crap. Which normally wouldn’t bother me but I was trying to make a name for myself in the photography world. Seems the big guys charging real money are all 20k+ followers . It’s disheartening.",
            "Sigh. I do. I enjoyed posting my work on Instagram. I’m allowed to enjoy that. I don’t like how I had to change the type of things I posted to get likes and followers - I’m not doing that anymore - but to be fair, I wanted to make this my career and the only way I was getting any paid bookings was through Instagram. I’m finally realizing maybe this was a pipe dream.",
            "I feel like I have a whole corner of shelved things 😂😂 maybe it can go next to my watercolour paints 😂",
            "I think that’s how I’ve been feeling too. When I DO end up doing paid shoots, the enjoyment isn’t there as much. Especially if client is nitpicky / rude, which I tend to get my fair share of with family and portrait photography. People are insecure, and the person to blame can be the photographer.",
            "Yeah, I’ve had this thought too. I think if I quit taking photos I’d quit social media and just live my life.",
            "Yay I’m not alone!!! lol the people saying “I only shoot for myself”. That’s kinda hard when you’re a portrait photographer and part of your job is making people like your photos.",
            "I’m basically at this stage too! You put into words how I’m feeling (though I haven’t been doing it nearly as long). I just got finished with a “minis” day - but to be honest, the crazy amount of time and energy that went into it plus the payout wasn’t totally worth it to me. It’s SO MUCH WORK and taking so much care to each photo - and then to have certain greedy customers nitpicking and asking for free extra\nPhotos etc. like as if I didn’t already go above and beyond for them - I start to lose the enjoyment out of it. Dealing with people I think is part of the reason I feel how I do also, not just th e social media side of it.",
            "That’s not what I’m trying to say. I wanted to be a successful portrait photographer and yes it’s 2024 there is a social media marketing aspect of you want to succeed with anything these days. But maybe it’s not for me. As someone else replied, they are also shutting down their 10+ year photography business for the same reason - just not getting out of it what they used to. I have enough followers on instagram, I’m not worried about that anymore. I’m just frustrated by the lack of actual business it’s bringing me (when I used to get a ton of portrait / engagement / family inquiries weekly)",
            "Yeah, I guess you gotta walk before you can run. I guess she sheer mass of photographers in my area is just crazy and it just seems to be going up while my inquiries are going down so it feels I’m going backwards. Also bugs me how most don’t care about the actual photography and just want to save a quick buck. Like, go to Wal mart and get your photos done then, because a real photographer is going to take care, time, attention and detail to your shoot - that’s why we price ourselves the way we do. The amount I get ghosted once I say my prices is nuts.",
            "I think. It’s okay to want to make money off of your passion. People do it every day. I agree it shouldn’t be the driving factor.",
            "And by photographer influencer, I just mean by that, someone who posts consistently, shares parts of their life alongside of their work to make their brand personable, and posts reels and hashtags and stuff. I don’t think it’s necessarily bad to want to be an influencer or have a large social media presence. I just think I’m tired of it and maybe it’s not for this introvert.",
            "If you are intent on making this as a business, then you may want to look at some kind of marketing and branding company that could help differienciat you from others. Obviously, this will cost money, so you will have to do some math to decide if that would be worth the cost. I would reach out to other photographers as well and see if they can provide guidance. I know most are highly competitive, but they can also be supportive if you find the right people. As with any business there is a risk of loss, money spent for no gain. So weigh that carefully.",
            "It's bad for everyone. Writers have it even worse by all accounts, you're unlikely to even get a publisher unless you can self promote. \n\nI am wondering about blogging again tbh, with the way AI is going to hammer social media and visual media i wonder if telling telling genuine and authentic stories is going to be in demand in the future. Not sure anyone has the patience for reading anymore mind you.",
            "Well, if it’s work it’s work. I prefer to keep photography as a hobby.",
            "Do you happen to be ADHD? It’s sometimes a common theme for us. 😂\n\nBut seriously, no shame. Though, if this happens often, try to buy things used so you can sell them used at less of a loss. (Like buy a used camera rather than new, used lenses, used woodworking equipment, etc)\n\nFunny you say that about watercolor - we’ve been photographers here for 18+ years and are now starting to go into art. We’ll see if it goes anywhere. 😅",
            "If I can offer a different take, portrait photography is one of the most oversaturated markets and some of the most talented photographers I know don't book for shit, despite trying.  As a portrait photographer, you're competing not with just other portrait photographers, but agencies using freelancers, companies with in house photographers.  The scaling up into a full-time career is incredibly hard.\n\nIf you really want to do this for the long run, you need to branch out.  Specialize down the line, when you can afford to.\n\nWhile I have and sometimes do still do portrait shoots, and it's where I started my photography journey, finding a niche or more robust market is significantly more effective.\n\nESPECIALLY on social media, 10 years ago Instagram was oversaturated by incredible work that I couldn't possibly hope to break into that market as a full-time career.  I'd be competing with award winning photographers no matter what city I live in.\n\nKeep your passion for portraits, keep pushing it, but look elsewhere for work.  Video is great, but it takes a lot of work (beyond buy a gimbal and a drone) to be good at. \n\nConstruction clients are abundant, generally have a lot of budget, have regular work, and sure, they can be a little bit difficult with scheduling but are in my experience pretty ideal clients.  It also opens up some really cool photo opportunities you'd never otherwise get, and some neat creative challenges.\n\n  That is a large focus of my business now, small/medium and local construction.  The word-of-mouth opportunity is massive here.  Every company has to work with a dozen other, and if you do well by one, they'll put your name forward.\n\nAlso, don't buy all the kit you think you'll need straight away.  Get what you need to start, a good lens or two, I personally think a good fixed-aperture zoom lens is the perfect starting lens.  24-70 2.8 gives you all the critical focal lengths at a good aperture.\n\nBeyond that, rent stuff and *only* when you need it.  Drop $50 on a lens rental for the weekend, and have that rental cost as part of your rate.\n\nI started my career making videos and taking photos of my friends, especially the ones with niche interests.  A lot of us trained parkour, so sports photography came in.  Then I had friends who rode motorbikes.  Then I had a partner in the animal world, and met some people she knew, came out to events, filmed or took photos at my own expense, got their attention, networked in.  As soon as people saw what I could make for them without being paid, they wanted some work done.  Then I got a job working with a former military dog handler, then all of a sudden I've had half a dozen ex-military clients all with their own business.\n\n90% of this job is networking, and that is not to say social media.  Small and local businesses show incredible loyalty if you also take care of them.  I see so many people talk in this sub about charging $1k a day baseline, not showing up for less than $2k blah blah... Really that is bullshit.  Not every photographer is a $2000 a day photographer.  I've been doing photography and videography for a career for 10+ years and I've never charged over $1000 for a day of photography alone.  Video? Yeah, I have significantly more equipment, physical toll on my body and risk factor to account for.\n\nI know everyone harps on about your personal brand being important to your business, but honestly, it's not the seller and if it's burning you out, just don't do it.  The last 5 years running my own business, I've not bothered.  I made a comfortable living with plenty to spend on my hobbies and social life until my weekly cost of living double in the last 2 years.  Equipment costs considered, I made a bit below the mean income, but I also work 3-4 days a week by choice, and not always full days, and have a great work/life balance.  That balance is 100% of the reason I still do this as a career.\n\nPortrait photography is by far the most fun and can be incredibly rewarding, but it's just not as viable as it's made out to be.\n\nIf you're keen on weddings, family photos can be done relatively fast (and should be with kids, max 30 minutes under 10) and can make you some really good money.  You don't have to do studio stuff, candid is always great.\n\nAnd if you just want some comfort, in my 10 years I've felt how you feel MANY many times.  It gets better.  Keep your chin up, I hope things work out for you",
            "Best of luck figuring out your path adapting to an endlessly changing algorithm.",
            "Yeah I’ve already spent thousands on this. Which, it’s really just turning out to be an expensive hobby. I’m booked for a couple weddings yes. Some would say I’m successful for when I started this up. But my bank account currently says otherwise. I do not have the money to dump more money into this currently. My last 2,000 laptop that I needed to edit photos I’m still paying off.",
            "I’d read, I feel a lot of bloggers will also use AI to get ahead though 😞",
            "I’m not sure if I am - I have a LOT of the traits of ADHD and it runs in my family, but there are also a lot of traits I don’t have . My sister is 100% adhd. Me I’m not sure. Maybe. Art is fun! I find it hard to stay motivated",
            "So a photography business is something like 80-90% running a business and 10-20% doing photography is something I was once told. If you still have another job, it might be okay to stop spending any additional money on photography for awhile, keep the gigs you have and then ramp down for a bit until you get yourself financially in the black. I only know a few pros locally that have managed this full time, but they were always 3-6 months away from bankruptcy. The others are semi pro, and have a full time day job and a spouse with another job. When you have time, find some books or courses on just running a small business. I once read the average life of a wedding photographer is two years.",
            "Why did you need such an expensive laptop?",
            "Yeah, but that's mostly for SEO clickbait nonsense. Ironically AI search results will kill off most of those rubbish listicle type content. \n\nI genuinely believe that eventually, the over saturation of automated content will drive people back to longform stuff that requires a human touch. I hope anyway, because there's only so long I can stomach videos of dancing in their bedrooms with captions telling me their age, lol.",
            "Because I didn’t want to get a cheap one and have to upgrade in a couple years, I wanted one that can run Photoshop as well as if I ever want to dabble in video, and my old laptop was so slow I wanted to make damn well sure my new one was going to be able to have the specs to get my jobs done without me having to wait minutes and crash whenever I used Photoshop..",
            "Is there a reason you had to have a laptop and not a desktop? Desktops will always be cheaper for a given processing power level than a laptop, and you probably could have gotten a similarly specced desktop for half the price of your laptop and had extra cash to get an ASUS Proart calibrated monitor to boot."
        ]
    },
    "How to Say No to Free Photo Services from Family and Friends?": {
        "title": "How to Say No to Free Photo Services from Family and Friends?",
        "score": 67,
        "url": "https://www.reddit.com/r/photography/comments/1dldg8n/how_to_say_no_to_free_photo_services_from_family/",
        "content": "I could really use some advice. I'm a people pleaser by nature, and it's hard for me to say no, especially to family and friends. Recently, I've had a lot of them asking me to do photography for them for free. While I love taking photos, it’s starting to feel overwhelming and undervalued.\n\nHow can I politely but firmly turn down their requests without feeling guilty or making things awkward? I'm looking for a way to say no in a clear and monotone manner. Any tips or advice would be greatly appreciated!\n\nThanks!",
        "num_comments": 104,
        "comments": [
            "Ah for family. See they are use to me being a tad more blunt than the rest of the world. Most likely the reply starts with a genuine laugh then slowly rolls into “fuck no”. If the issue is pushed then I ask for a trade for something they wouldn’t want to do for free. Oh free pics, yea I could use some plumbing work Frank. Free pics, hell yea as long as you got me on a set of tires from the shop? No….weird. \n\nHonestly, and whatever with downvotes because the nuances are hard to explain online, this is actually how I handle anyone asking for free anything I’ve worked hard to learn. I decide if the work is free, not the person asking. Ever. \n\nMy sister recently got married, called me and asked if 1. I’d be interested in doing her engagement photos (fucking of course I would she’s my sister) and then immediately asked 2. How much? I would never charge my sister, but she was prepared to pay, and to pay my full rate. They did something different and we never did a shoot. But my sister knew this was a service you offer to pay for hoping the big brother comes out and it happens for free lol. She was willing to pay me. I’ve been paid for any family got I was requested to shoot. Family reunions. Weddings, well receptions, I don’t do weddings. \n\nMy grandfather and uncle owned a hobby shop, uncle gave discounts of like 10-20% sometimes. Papa, no fucking discounts ever lol. He’d even charge my mom, his daughter, full price lol. Shit made me laugh every time. Hoping my uncle would ring me up lol. Point is, family pays too, or at least offers too, you decide the discount.",
            "I guess it depends on what they’re asking. And it’s a bit of a shit answer but sometimes it’s:\n\n“Sure, I think it’ll take X amount of time, for you I can do it for £X” (the second money is asked, either you get something out of it, or more likely, they figure what they want isn’t that important)\n\n“Sorry, I can’t do that”\n\n“This is more of a work thing, I don’t really do that unless it’s work”\n\n“No” (it’s a complete sentence)\n\n\nI’ve had friends ask me if I might shoot weddings, which is a more pragmatic response.\n\n“I don’t shoot weddings, and I really don’t want to mess yours up. You’ll be much happier on your big day with someone who’s good”",
            "“Nah, I’ll pass. Taking photos for other people kills my love for photography. I’d rather just take photos for myself. I don’t want to do it as a job” Probably something along those lines",
            "Learned this advice from one of my mentors when I asked him for something similar (as a paid commission)…\n\nHe basically said something like this (paraphrased):\n\n“Sorry mate, I don’t provide X service for friends or family, free or paid.  Not worth ruining the relationship if something goes wrong”\n\nGood luck!",
            "You’ve got to let them know how much work it is for you to get the results they see, and that you wouldn’t ask them to, say, work a shift at their job for free. It’s your job and just because you enjoy it that doesn’t mean it’s not hard work. You can always offer them a  family discount too.",
            "“I’ll do it at cost.” And charge for the things that don’t go away even if I’m not paying myself.\n\nGear & computer amortization/depreciation\n\n(Plus)\n\nGas & other travel expenses\n\n(Plus)\n\nExpendables\n\n(Plus)\n\nCloud/image delivery service usage (monthly $ x % used)\n\n(Equals)\n\nFriends and family rate\n\nIf you don’t do this, not only are you giving them your time but also quite a bit of your money.",
            "Someone mentioned this response years ago and still valid.\n\n  \n“Sorry my paid work is piling up and taking over my whole schedule, and paid work will always need to take priority over free work, I am sure you understand “",
            "\"I don't really feel like that's my wheelhouse, but if you really need the photos I can suggest you hire [insert professional photographer here]\"",
            "I am grateful that I don’t have friends and family members that want to take advantage of my photography skills \n\nIn the beginning when I wanted to build a portfolio I reached out and asked my close friend and family if they’d let me photograph them and gave them free photos in exchange for them within a model release \n\nOnce I started charging and doing it as a business I never get asked if I can take photos \n\nStart a business and start charging people. Then your friends and family will likely respect your business and not ask for free work \n\nGood luck",
            "What's the context? Is it a family gathering and they just want a group photo? Are they asking you to come to their house on your day off and take portraits?",
            "Every time family asks me to bring my camera with me to family gatherings/birthday parties etc. I tell them \"no sorry, this is my day off\". \n\nMakes them realise that this is actual work for me. But still, some of them ask every single time...",
            "Tell them you'll trade for yard work.",
            "\"No.\"",
            "“I don’t want you to think I’m saying ‘no’ to be a jerk, I just don’t take those kinds of photos.” After the third wedding they kinda got it, I take documentary/news photos, I like people being characters, I’m not good at making people pretty or posing them. It’s just a fact. I’ll take a photo of the bride trying to pee with 8 bridesmaids helping her, not sunny golden bridal pictures.",
            "No. Thanks but no.",
            "charge them? at least get something in return ie favors, dinner, steaks, good wine/liquor, etc… never do shit for free.\n\nif they dont feel bad at all just out right refuse until they want to compensate you.",
            "Just tell them its like being a sex worker... you know what sex workers don't want to do on their day off?",
            "I’m busy",
            "I've always politely declined and said I'd prefer to be a guest and enjoy time woth friends and fa.ily and not be working.  \n   \nThat being said, in addition to a normal registry item my gift at any wedding to a family member has always been my memory card at the end of the evening.",
            "you will feel guilty because thats how you feel\n\njust understand your feelings and just turn them down politely\n\nwhite lies are acceptable too. 'i have a date' (with my tv)",
            "Propose barter. \"I charge such and such for a job like this. How aw about I discount X% and barter with you for the balance. What free professional service might you offer me?\" No doubt you might wanna put some sugar on the proposal and there's the gist.",
            "I become very self deprecating. You need to hire someone who will do a better job, this is important, I could never live with myself if i did a bad job just because you were cheap.\n\nAlso, oh, it's not that important that you need to hire someone? These kids always have their cell phone out, they take so many photos, theyd love to help.",
            "Maybe propose a trade. I'll take photos if you do my taxes. I'll take photos if you can build me a new coffee table for free. I'll take photos but I would like 10 jars of homemade salsa. \n\nSee how that goes down.",
            "I don't work for friends or family, don't shit where you eat",
            "If you're a professional, it's easy - \"I can't afford to work for free. I'm sorry.\"\n\nIf you're just the only person they know that kinda likes to take pictures...I'd need more information.  What do you shoot?  What are you being asked to do?  Does it jive with what you typically shoot?  If not, it becomes easy again - \"That's not really what I like to shoot and knowing I wouldn't be giving you my best work isn't something I'd feel comfortable doing.\"  \n\nIf it is what you typically do, well \"photo services\" screams weddings, portraits, senior photos...that kind of thing.  If they're asking for that stuff, then that's professional work, and then we're back to not being able to afford to work for free.\n\nMe personally?  I do portraits of my sister's family for free even though it's outside of my typical thing because my parents like it and it's something - importantly - that I offered.  (It also gives me an excuse to rent an RF 85 f/1.2 for a weekend which is just a banger of a lens). Nobody else gets that deal.  \n\nAlso, the \"no is a complete sentence\" people are people who don't have many friends, their family doesn't like them, and it's mostly their fault.  That's bad advice.",
            "\"No.\" \n\nIt's a complete sentence.",
            "The only time I had a friend ask me to do their wedding I agreed to do it as long as they bought the prints from my website.  They seemed cool with that.",
            "I have been dealing with essentially the same problem and posted recently looking for advice.\nHopefully some of the responses I received can help you.\nGood luck!\n\nhttps://www.reddit.com/r/photography/s/8tyVPyclz4",
            "Turn up at their work asking for free products/services.",
            "I typically tell people my equipment is out for service. Yeah I’m able to attend your party but my equipment is not available and out for repair.",
            "Just say you don’t do events. Or ask them if they’d ever work for free. Sometimes people need that little bit of grit.",
            "i would say \"why would you pay a stranger full price but expect it for free from me? if you cared about me you would be paying full price or more to support my career\" \n\nluckily i've never had to deal with this or have had any friends ask for a discount or free.",
            "I always found it pretty easy to say no when I was starting out about 15 years ago, but when I started making money on the side with it (full time now) I would just say I was too busy with paid gigs. If they wanted me to shoot, they'd have to pay. More often than not, they would flake. But every now and then, I'd get a new gig out of it.",
            "When I do small shoots for my friends they usually get me beers and or dinner.",
            "Sorry but I really can’t. Not charging you for my work would be disservice to photographers who do it for a living.",
            "Are you a guest or photog. Pick one",
            "Like it goes with every other thing where family and friends take advantage of your kindness: no matter what you say, it will lead to them feeling negative towards you unless your answer is “yes, I’ll do it!”\n\nFWIW, I got rid of most of mine years ago (I’ve made much better friends since then, and my wife’s family is literally hundreds of times nicer than the one that came bundled with my lifeform, e.g., they appreciate when I offer or when I bring my stuff to important events, they’ll never ask).",
            "I don't have the energy to work for free.",
            "Ask for favors back quickly. House cleaning, painting, 12 packs of beer etc.",
            "Simply tell them that the equipment required costs real world dollars and you cannot do it for free.",
            "I tell them I make a living off of this and show them my prices. Most of my friends understand that this is how I make a living and are willing to pay the price. If they are close family I will sometimes offer 10% above cost. Since I sell mostly prints and digital files don't come without a print most are willing to pay this. I usually wave the booking fee. But when figuring out cost I also factor in time for editing and adjusting. I always give an invoice as well with the original price and the discounted price so they know exactly how much it would have been otherwise. This way they can set the right expectation of how much it would actually cost if someone asked how much I cost. This happens few and far between though.",
            "Other commenters had great suggestions. I know my family members would be insisting on it, so I’d say something along the lines of: “taking and editing photos takes a good chunk of my time, and I’m not in a well off enough financial place to take that time off from paid work.”\n\nUnless you’re very visibly rich, that should work haha. At least it would have a greater chance of working for me, since everyone in my family understands financial struggles. ",
            "Just tell them you're booked solid. No time for pro bono.",
            "\"No, sorry, I'm not able to do that. My gear isn't setup the right way, I don't have the right skills for it, and it's something you'll be completely disappointed in.\"",
            "Agree, but only using their phone. That way they have the pics instantly, you don’t have to haul around your equipment, do any processing or have any further obligation than that one exchange. \n\nOr, they can hire someone.",
            "“Sorry guys, but no.”",
            "I approach it this way: whenever some asks, i say \"no, but let's meet up for lunch/party/gettogether, and I'll take my camera, and do a couple candid shots, if we all feel like it\". This only works if you like spending time with them though. :)",
            "\"I don't do free photoshoots (anymore).  This is my rate if you are interested.\"  You will quickly find out who is your friend.  One thing I've learned is to be flexible.  Set a firm rate, but maybe there is a way to negotiate something that makes you both happy.  Sometimes, I will do discounted (heavily) shoots for friends and projects I am passionate about, or easy projects but those are exceptions.\n\nNot all payment is money and gold.",
            "Have the details of someone you trust to do a good job ready to hand. Say you're not interested, but I recommend this person. That way you're being helpful still, and maybe they'll learn your value and what they were asking for.",
            "late to it, but i always just say “i only photograph nature, i dont really know how to photograph people sorry”",
            "If you have no desires to do it professionally then do it for them, but deliberately do a bad job of it.\n\nWord will get around and they'll stop asking.",
            "I think that if you offer a price list to a few of them, the word gets around and they all stop asking. Even if it’s, “Did you know that jerk tried to CHARGE ME to drive 2hrs and take photos all day for free?!”\n\nOther than that, as others have said, just tell them that you enjoy photography as a hobby. That if you start doing it for others, it becomes work. Work isn’t fun and kills the joy of it. Which is why people get PAID for work. Hint hint.",
            "it's like wanna come out to my cottage for the weekend? .... bring your tools",
            "Explain that every shoot is like 6 hours of work, plus 10 hours of editing. It's almost two full days of intense work. \n\nIf they don't understand that and keep whining, they are just selfish pricks. Don't succumb to selfish pricks.",
            "No, I’m busy / no, I’m doing something else at that time",
            ">No.\n\nThat usually does the job.\n\nJokes aside, if you want an argument about why you shouldn't do it for free simply say, \"you don't work for free, why should I?\" The issue you're going to run into is creative work isn't often seen as \"real work\" and people think it's just a hobby you do that sometimes makes you money.\n\nIn the end I just tell people \"I don't work with friends or family, it's messy,\" and leave it at that.",
            "Just say you're too busy for any project work in your spare time at the moment.",
            "I would give a “family and friends” rate. It’s not necessarily a bad thing to continue to take photos for them, but you and your time and efforts have value and that needs to be realized.\n\nPhotography equipment is expensive and every time you pull it out you’re risking damage to it, plus other expenses like fuel and editing software. It’s not free for you, really it’s at your expense when they ask you to do work for free. \n\nIf they agree to the family and friends rate, then your time is valued, and if they don’t then you don’t get overwhelmed.",
            "I just say no",
            "Just tell 'em you'll text them your rates. And then text them your rates. Sound simple? Yeppers. Because it is.\n\nAnd remember to get paid upfront. (Because working on spec (speculation) is just soooo wrong!) And make them sign contracts about what they're getting and for how much. And use this symbol: ©.\n\nBe firm. And always smile when you tell them, \"Thank you.\"",
            "I learned early on that shooting kids killed my creativity !! It takes more patience than sports or journalism\n\nI will do a family wedding for sure - family Christmas Pic sure  - their kids baseball game - ONLY with my phone Never with a camera\n\nThose are my rules and my family understands",
            "Don’t let anyone take up your time for free. You’re the one who shoots and edits. It’s no IG filter.  Tell them your price and decline anything less. Keep you focus on your art and editing skills. You deserve to be paid for shooting a whole event.",
            "Find something they do, or go for lunch and everytime tell them it's on them for free haha",
            "there is an old adage...never work with family or friends. Having done that a few times, I've learnt it is a good idea to listen to. Now when I'm asked I just explain how it's gone wrong in the past and I don't want to go through that again and possibly damage a relationship.",
            "A few ideas.\n1. Limit the time you spend on family/friends to 1-2 every week, or every other week and make them respect that schedule. If your \"booked\" they have to wait \n\n2. Make them earn their sessions by promoting. Bring me a paid gig, get your session for free/discounted. I have told people you get this price, but anyone that asks you pays THAT price. \n\n3. Make them.take the pics that you want to take. Whatever gaps in your portfolio, make them the guinea pig models. They get free pics out of it.\n\n4. Lunch/dinner, transportation/gas is ALWAYS on them. They won't pay for pics, make them pay for something.",
            "Either just say you don't do work for friends and family for free because it would understandably open the floodgates and you don't want to make anyone feel bad. Leave it at that if you want, but you could also just have a friends and family discount, but that's assuming you'd want them as clients.",
            "Take the photos, and then don't find the time to develop em?",
            "Just say fuck no",
            "Just say \"Thank you, but I can't do it\"",
            "I do it for free (as i'm not a professional) but on my terms. I bust out my RB67 (usually with HP5 or Delta 400), tripod, light meter, cable releases and everything, and start taking notes on the setup. 5 frames, 2 missed focuses and 40 minutes later they usually get really impatient  to the point they look pissed in the photos - which they  see one month later for the first time. Usually they don't ask for it again and I have to find another victim for my hobby.",
            "While I do love taking pictures, a photography session is  physically taxing, uses expensive equipment, and requires a high degree of skill. As my family/friend, you can obviously see the artistic value of my skills. However, when you ask me to offer you free service, I feel that you do not respect me or my photography business. We could discuss what you are looking for, and see if we can't find an agreeable price-point for us both.",
            "Ok so politely form an oh shape with your mouth and then say the word “ no.” Your feelings of guilt will dissipate with practice. The more guilt, the more people will try to take advantage of you.",
            "Here's what i've done \n\nThem ; Could you take some pictures for us during family event? \n\nMe ; Sure, i tend to take ( pick your amount ), but since you're a friend/family i'll give you a discount!\n\nThem ; Oh, ok, i was hoping you'd do it for free since we're friends/family ( both have asked me )\n\nMe ; I get that, but if i'm gonna spend a few hours out of my day to take pictures, scroll through lots of photos, edit them and so on i want compensation for it, if you're not interested in paying then im sure guests can just send you ones they've taken with their phone?\n\nThem ; Thats a bit rude though...\n\nMe ; Not at all, it might not seem like much work to you, but there's a good reason you asked me, cause i've bought proper cameras, i capture moments for you that you might miss out on, i'd say thats worth the price, wouldn't you agree?\n\nI'll admit that its a bit assholish of me perhaps, but im personally tired of the \" for free \" requests i've gotten earlier, i don't take much for family gatherings or a birthday party, i put in alot of work into my pictures and i take pride into what i do, if you ( friend or family ) can generate the same pictures i can from your iPhone or samsung then there isn't a reason to ask me now is it.",
            "You can't say no.\n\nJust keep taking pics free, and make them look crap.",
            "Ask if they pay their bills by working for free.",
            "Offer them a 5% friends and family discount and walk away",
            "Ask them to do their job for you, for free.",
            "Tell them you've become interested in figure studies and want to hone your skills if they're interested in posing nude..",
            "Ass, grass, or gas is my standard reply.\n\n/s",
            "\"No, sorry. I only do paid work. You can hire me if you'd like, but I no longer work for free. Nor do I do discounted rates anymore.\"\n\nThen if they still try to pressure you, tell them you wouldn't expect them to do free work for you, you would pay them.",
            "‘No’ is a complete sentence.",
            "> If the issue is pushed then I ask for a trade for something they wouldn’t want to do for free. Oh free pics, yea I could use some plumbing work Frank. Free pics, hell yea as long as you got me on a set of tires from the shop?\n\nBe careful with this, though. It's very possible for you to get a \"yes.\" You may even get the short end of the stick if you don't have a ballpark on the cost of a handyman for the chore you want done.",
            "My tack when people I know ask me to shoot their wedding, presumably for free, is to say something like, “I’d rather join in the celebration of your special day than to spend it working.”",
            "Received an email from my niece telling me how much she and her fiancé would love me and my wife to share their wedding day. Oh, and we know what a wonderful photographer you are so it would be great if you could photograph the wedding day. \n\nTold her that I wasn’t good enough to do a wedding and they should book a professional. Pointed out the potential pitfalls of expecting an amateur to do a professional job on their special day. \n\nHeard nothing back and never received a wedding invitation. Then exactly the same scenario happened with another niece. \n\nGuess I’m not the favourite uncle after all.",
            "Agree with this. Or that you don’t like posed/ semi-posed photography.",
            "“That’s ok, we aren’t going to pay, so it’s not a job!”",
            "I mainly do wildlife and landscape photography so I tell people that taking photo of people and event is not really in my skill set and I would not do a good job and enjoy it.  I also let them know just how much work the post-processing is for photography.",
            "This is probably good advice.\n\nThe guitarist in my band played the wedding of his friend’s daughter with his old band many years ago. A delayed arrival due to a broken down van and some equipment issues onstage led to a disastrous gig, and the friend hasn’t spoken to him since.",
            "I don't have luck with those conversations  - customers understand this But family seems to think it's just pulling the trigger\n\nIf they aren't creative then the conversation will make you seem \"sensitive\"\n\nI'm a blue collar guy - that's my experience \n\nI tell family I will do weddings for them - the rest is subject to my whims - Whims Only 😁\n\nGood luck out there traveler",
            "Yard work.  Clean my house.  Do they paint?",
            "this is pretty helpful actually!",
            "could def work",
            "HAHAHAHAH i love your hobby!",
            "i think this is the perfect mix of being polite as well as setting boundaries thanks tho!",
            "why do i picture that one bugs bunny scene with that oh shaped, but yeah youre so right on the guilt thing.",
            "Ths is literally me! in my own head only tho, LOL i need the guts to turn them down upfront no more BS",
            "This is actually genius !",
            "*Dear Moocho,*\n\n*We would like to remind you that submitting your quarterly reports is a key responsibility of your role. While you often say “ass, grass, or gas” when asked to complete tasks, please remember that you are provided a salary for your work. We expect these reports as part of your job requirement, not as a favor.*\n\n**Thank you for your attention to this matter.**",
            "The risk here is that it leaves the door entirely open for later requests for spontaneous event-type photography that would entirely respect OP's stated wishes, at which point he'd have to say no for a different reason and leave them feeling justifiably annoyed or mislead. Genuinely better for everyone just to suck it up and give a real truthful no.",
            "I say this all the time, but for genuine reasons! I truthfully hate posed photography haha. ",
            "And let them know that every hour of shooting equals about 10 hours of processing.",
            "Ehh, if OP says “I enjoy it for myself and not as a job” that should (I would hope) shut down any future requests to shoot any photography at an event",
            "Same.",
            "Yeah for sure; I was responding to another person's entirely different advice."
        ]
    },
    "Any good photography blogs still around?": {
        "title": "Any good photography blogs still around?",
        "score": 3,
        "url": "https://www.reddit.com/r/photography/comments/1dlut4s/any_good_photography_blogs_still_around/",
        "content": "I already enjoy the folliwing:\n\n1. Visual Science Lab by Kirk- https://visualsciencelab.blogspot.com.\n    The above created a new blog- https://groundzeroart.blogspot.com\n\n2. A Life in Photography by Dave Jenkins- https://alifeinphotography.blogspot.com\n\n3. Down the Road by Jim Grey- https://blog.jimgrey.net\n\nThe blog format still feels relevant for sharing photos and thoughts behind them and other discussions. Or maybe Im crazy. But I enjoy reading about the thoughts of those I linked above and looking for more.",
        "num_comments": 2,
        "comments": [
            "Joe McNally's  \n[https://joemcnally.com/blog/](https://joemcnally.com/blog/)",
            "Thanks, that looks like a solid one as well."
        ]
    }
}