{
    "Devblog - Seismic Sensor": {
        "title": "Devblog - Seismic Sensor",
        "score": 65,
        "url": "https://rust.facepunch.com/news/seismicshift",
        "content": "",
        "num_comments": 74,
        "comments": [
            "If you're setting your phone to wake you up in the middle of the night because your video game base is being attacked it's time to take a step back.",
            "Can you please add a Handbrake to Cars, be great to not have Newman's push a huge armored car into a twig doorframe and destroy the car by closing the door. Maybe have a time delay or mini game to then turn off the handbrake",
            "Overall, the vast majority of these changes are great and very useful. Obviously the fishing community is upset but I don't partake in that much, so I can't comment. \n\nAppreciate all of your hard work devs!",
            "Blocking explosives, powder and ores from TCs will improve quality of life immensely.",
            "So no nexus system?",
            "Pretty sweet update. Though it does seem there is some nerf creep with the fishing village changes. Add this to the safe zone recycler nerf last force wipe, and people who genuinely suck at PVP despite their best efforts are the ones who are going to be punished the most. I know quite a few people who play on PVP servers but rarely PVP, and instead run a shop or provide some other type of service (farming, art, hotel, etc). If you make the grind too difficult for them, they're probably going to switch to PVE or stop playing all together, removing some of the diversity that makes PVP servers interesting.",
            "Fish traps got a huge buff, are we forgetting that?",
            "holy qol! this is awesome!",
            "What an update!",
            "ruined fishing imo",
            "I'm still curious as to whether the devs realized they've basically killed fishing.",
            "> To break this loop, this month raw fish meat is now only worth 0.5 bait (and can be used in stacks of 3) \n\nThe person making these changes I don't even think knows how fishing works. 0.5 and 1.5 bait catches the exact same things... \n\nAnd if scrap was the problem, why didn't they just nerf scrap for fish?\n\nGreat patch overall though very happy with the planter changes!",
            "No item store this week? Edit, it was late",
            "yeah you are supposed to stay logged in with your speakers turned on to wake you up instantly",
            "I once took an early lunch from work to drive home and help defend our base from a raid. I took like a 2-3 year break after that...",
            "Did this in Covid and mannnnnn it takes a toll on you lol… stay up til 5 playing rust… base alarm goes off at 7am 😭\n\nThis update is honestly great to prevent that need. You can trigger a garage door to open or something with a turret. You can use the flashing lights and alarms while simultaneously opening the doors to your compound inviting a counter.\n\nJust better than the heartbeat for this kind of thing and not an “already too late” situation like when you have electrical spring when a wall goes down.",
            "I have done this exact same thing and it was not long before i realized i need to turn my rust addiction down a notch.",
            "I'll never understand why anyone plays like this EXCEPT for youtubers whose job it is. You lose your base every Thursday/monthly anyway why would you wanna ruin your sleep over losing it faster?",
            "Time to quit rust and start hobbyhorsing",
            "Yeah, Rust is new classic WoW, honestly.\n\nPeople need to chill the fuck down with caring about their in-game loot to a point they need an alert to wake them up.",
            "Didn't Rust+ already send messages with a smart switch on the TC?",
            "I thought they fixed that a few months ago?",
            "im usually very good at sarcasm but I can't figure this one out. Are you joking and if not, how?",
            "> nexus system\n\nNot on the change log so no, no nexus system. Come back next month when it likely still isn't here",
            "No body wants that",
            ">Add this to the safe zone recycler nerf last force wipe, and people who genuinely suck at PVP despite their best efforts are the ones who are going to be punished the most.\n\nNot even just as a skill thing, but a numbers thing as well. Solo's, duos and otherwise small groups got the shaft yet again.",
            "PVE servers can be fun too, I play on one that has plugins that turn it into an rpg. You fight NPC's and they're pretty much everywhere around monuments.",
            ">  I know quite a few people who play on PVP servers but rarely PVP, and instead run a shop or provide some other type of service (farming, art, hotel, etc). If you make the grind too difficult for them, they're probably going to switch to PVE or stop playing all together, removing some of the diversity that makes PVP servers interesting.\n\nWe must remove all traces of fun from PVP and divide Rust entirely into the fun players and the PVP players. - Facepunch, I guess",
            "Not really. 50% chance to catch nothing and waste the bait + worse bait options, and no longer catching double fish.",
            "Well no, It was just released so i have not forgotten that.",
            "Just save your bear meat for bait, then you'll be straight to fishing sharks and salmon",
            "They might as well buff grubs and berries.",
            "Sure as some min max strat. Im still rp fishing just fine.",
            "Who gives a fuck",
            "the person making these changes made the entire fishing, gardening and industrial systems and much more. but im sure you know better",
            "I did this once. Won the raid defense",
            "![gif](giphy|WTbkptOpR2QVYtHkDy|downsized)\n\nC4 goes off in my ear",
            "This guy gets it.\n\nOP is dumb\n\n/s",
            "The trick is to work from home, then you can defend raids while you’re in a meeting.",
            "How far from home do you work? I feel like I would speed home right as they finish the raid",
            "i once took a taxi cab just to get home 25 mins earlier in order to prepare stuff quicker for an online/offline-raid.... i paid a good amount of money because the desire of doing something in Rust was so big.... after that wipe I decided not to do that ever again. No wipe is worth that.",
            "At least you were self aware.",
            "My \"hey, I need to take a break from this shit\" point was when I've realized that it's the only hobby I have been actively pursuing and finding time for, for the past year. That was 9 years ago.\n\nI did play Rust after that, but very moderately, compared to that time. 0-4 hours a week at most.",
            "It's not about the loot, it's about the successful defense or offense, the gratification it brings. The loot matters little, hence who so many despawn when they get bored.",
            "And me my homies do",
            "People just need to accept this the game is never going to be balanced for group size if you don't play on server with group limits. Larger groups will always have advantages and there is nothing that can be done to make the game easier for solos that doesn't also make it easier for groups.",
            "Or I'll just set up 3 horses being fed by the same meat and earn 6 times the scrap for 1/50th the effort and the same risk.",
            "I think they did, in that you can now stack them to reach a higher bait value.",
            "I mean, it was never really a minmax strat. It was just something cool you could do if you wanted to do something fun. Scrap farming barrels in the ocean with a tea is more scrap and just as safe. Fert farming is similar. \n\nNow, it's just kinda useless, even in a niche kinda way.",
            "All you need to do is look at the wiki... 0-2.5 is junk and 0-5 is small fish. That's how it works.",
            "20 min or so. That was back before you had to feed your TC too keep it up, so bases were crazy big and online raids could last hours sometimes. The shit was wild.",
            "You're projecting your own experience on others.\n\n1. Not \"so many\" people are despawning.\n\n2. They're doing it out of spite to troll the raiders, not out of boredoom.\n\n3. The fact that they're despawning proves how much loot means to them, because despawning 8+ boxes of loot takes a lot of time. If loot doesn't mean anything to you, you'd just quit the game and not waste time on despawning.",
            "Genuine question, why?",
            "If you want to fight over the fertiliser trader, sure.",
            "Scrap farming in the ocean and fertilize farming is objectively less safe though. For fishing you were able to just plop down in the safe zone at the fishing village and get scrap risk free. \n\nThose other ones you're at least out in the open and taking on some kind of risk. The fishing changes just require you to have a little more bait, it's not that big of a deal.",
            "You still get loot and food from the fish no?\n\nI used fishing to complete all tech trees in a few no bp servers I play on. It was too easy to get stacks of scrap in a safezone or your base. It was like metal detecting in the safe zone which was patched as well.",
            "Ah that sounds like fun, but like you said maybe not the healthiest lol",
            "So despawning at all = trolling raiders, got it",
            "What do you mean?\n\nIt'll be dope!\n\nWere gonna build on the sweaty island and try and grub mofos who come across.\n\nWere gonna scuba jump off of it directly to oil, so we don't have to wait for a respawn, etc etc...\n\nThis opens up so many high level plays",
            "Fishing for scrap off the safe zone isn't even what got nerfed here. You can still do it risk free and the results aren't that different. What got nerfed here is people's ability to do it in bases designed to fish, instead of setting up fert farms or ocean farming.",
            "It was strictly worse then making a cloth farm or a fert farm. It was more effort for less reward and essentially the exact same risk. \n\nYes, you still get loot from it, but now instead of making 1.4k scrap an hour from cloth or fert farming, you have the option to make like 500 scrap an hour from fishing.",
            "If you despawn before logging off, yes it is.\n\nIf you're putting any time in anything regarding loot (like I said, despawning takes time and extra effort), this means you care about other people not getting the loot. This means you care about loot.\n\nE.g., when I'm done with the server, I just remove doors or leave them open for anyone to come in and take whatever, including the base itself. Because I know how cool it is to find that kind of stuff as a fresh spawn.\n\nIf I knew some toxic shit clan was going to raid me, I'd definitely despawn and leave 12h worth of upkeep in TC.\n\nBoth cases show that I understand the value of loot and I do care about it, to some degree.",
            "> Fishing for scrap off the safe zone isn't even what got nerfed here.\n\nIf this wasn't nerfed then player fishing bases didn't get nerfed.",
            "You say it is not minmaxing but talk about the scrap rate per hour not being efficient enough for you.",
            "So if I despawn all my loot, and by proxy my entire base, which will never be raided because it will decay, I am trolling?",
            "Yes, because there's a difference between minmaxing your time, enjoying your time, and wasting your time. Fishing is the latter, Missile Silo is the former.",
            "Why do you despawn?",
            "Because I had enough pvp or rp and I got bored, next server or next game. Doesn't matter if it's vanilla, 2x, 10x, PVE or PVP. I have the right to withdraw from any life as I so choose, that much is inalienable. I'm not required to exist in this world, much less in rust.",
            "Okay, but why do you put your time (which you could've spent any way you wanted) into despawning loot?"
        ]
    },
    "Bug Reporting Megathread - Seismic Shift": {
        "title": "Bug Reporting Megathread - Seismic Shift",
        "score": 17,
        "url": "https://www.reddit.com/r/playrust/comments/1d9oe8b/bug_reporting_megathread_seismic_shift/",
        "content": "Please help the developers by reporting any bugs, using the following points:\n\nYou can report bugs in-game by pressing F7.\n\n**[BUG]** Something game-breaking that shouldn't happen.\n\n**[QoL]** Quality of Life change that doesn't necessarily break the game, but would be nice to fix.\n\nPlease try to include helpful evidence related to the bug, such as screenshots, videos, or GIFs.",
        "num_comments": 120,
        "comments": [
            "https://preview.redd.it/nktvki7ff85d1.png?width=815&format=png&auto=webp&s=f5abf0f7554fa4ece06837b9798fa6e6b99dbdfc\n\nThe build on the Mac is completely f### up. The debug/build files got published to steam instead of the actual game.\n\n*Ps. It's about time to also release the ARM native version. EAC is about to release their native version and Unity has support for it for many years.*",
            "[BUG/QOL] (Oversight?)\nSince both Backpack and Oxygen tank occupy the backpack slot, one would expect similar behaviour. Yet the Oxygen tank kicks off whatever one is wearing in the outer upper clothing slot (e.g. poncho, jacket) while the backpack peacefully coexists with all clothing.\n\nEither Oxygen tank should be in jacket slot or it should ignore clothing.",
            "\\[BUG\\] / \\[QOL\\] I'm not sure if this is intended because it isn't mentioned anywhere but deep water is insanely murky / cloudy right now. I literally cannot see sharks anymore. I dive for my scrap and since the patch I am not even able to fight the sharks anymore because the visibility is like 5 meters down there. Before the patch this was not an issue, I've been diving for years.",
            "\\*\\*\\[BUG\\]\\*\\* I saw someone else already mention not being able to launch the game on MacOS, but I am having the same issue. Fresh install of game, trying to launch it from steam opens [rust.app](http://rust.app) with the blue bear icon, then you get an error saying it can't find the game's binary. \n\n[RustClient.app](http://RustClient.app) is incomplete. If you open it RustClient>Contents there is no folder MacOS where it is looking for the game.\n\nThere are also two folders outside of [RustClient.app](http://RustClient.app) in common>Rust with names \"Rust\\_BurstDebugInformation\\_DoNotShip\" and \"RustClient\\_BackUpThisFolder\\_ButDontShipItWithYourGame\". I don't know if the wrong version of the game is available on Steam for MacOS right now, but either way it is not currently playable.\n\nhttps://preview.redd.it/mpwlsi19b85d1.png?width=1552&format=png&auto=webp&s=330823efcbb8a221f29e8743c9e01d092455f42b",
            "[BUG] \n\nThe text/font of number of gathered resources (stone/wood) appears to be inconsistent in size. \n\nFirst thing this wipe it was smaller than the size of the text for the resource name but it later was the correct size. \n\nI then again noticed it was smaller. \n\nVery minor but I did notice it",
            "Thanks a bunch for all the lovely QoL features in the past updates. This devblog was amazing.\n\n**[QoL]** Since forever now, weapon reload animations finish faster than the actual reload event happens. Improving this would make gunplay feel a lot more modern and snappy.",
            "[BUG][ Spotlights are not outputting light to the environment.](https://imgur.com/BBFewAo)",
            "I get an error when trying to launch Rust on Mac:\n\nLaunch Error:   \nCould not locate the game binary: '/Users/\\*MYNAMEHERE\\*/Library/Application Support/Steam/steamapps/common/Rust/RustClient.app/Contents/MacOS/Rust'\n\nHave tried restarting and verifying files. Base is going to decay :(",
            "**[BUG]** [The vendor at Fishing Village is not showing a menu, so you can't buy fishing gear](https://clips.twitch.tv/LongMushyMonkeyYee-0IAOCX8S0tbjYfsp).",
            "\\[BUG\\[ I really hope this was not intentional but underwater visibility with the diving mask took a big hit. I don't know how you would ever be able to kill sharks, you can barely see anything when you look through the window in moonpool and players have to be really close to see them.",
            "With all the love that has finally gone into electronics, please fix the bug with the parallel connection of batteries. \n\nIf I connect a lamp that requires two units of energy to one battery, it draws the two units. If I connect two batteries in parallel to one source connector, the load is not divided between the two batteries into one unit each (using the lamp as an example), but both batteries now see two units of load. \n\nThis contradicts the electrical concept of a parallel circuit and prevents the complexity of circuits from being scaled as desired, because in the end you are always forced to build separate circuits, as the game is not familiar with the basics of electrical engineering. This is extremely annoying and would really be more important than another sensor. \n\nTHANK YOU",
            "Hey this was a fantastic update and I love facepunch you guys truly are such a gem of a dev team so thanks for all you do.\n\nYesterday, I was playing with my mates and we noticed people across the server frequently crashing. Me and my friend specifically but even in combat fighting other trios, mid fight one of them and my friend crashed at exactly the same time. No errors or anything for me or my friend just freezes for a second or two and rust closes.\n\nI've got 64gb ram, my friend has a much lesser PC but yeah just thought I would let you know in case its something to look into. I'm hoping today will be different.\n\nWorth noting I did input that reduced memory command in console, but my friend did not.",
            "\\[BUG\\] Car parts cannot be right clicked or hover looted into car modules if they are stacked",
            "**[BUG]** [My horse alarm gets set off every time I mount it.](https://youtu.be/Ord_50QGbnE)\n\nRF Pagers seem to activate while stored in a saddlebag when a horse is mounted. It works on any frequency, but does not trigger when kept in your own inventory.\n\nI found this out the scary way :(",
            "\\[**BUG**\\] Can't deploy window frame if there is industrial pipe going through the hole for window.\n\nhttps://preview.redd.it/gfciob3xsk5d1.png?width=2821&format=png&auto=webp&s=6f8a09509a6eab81e641620b8c1e42447324d1d6",
            "\\[BUG\\] new patch this morning prevents Rust from opening on my Mac. Opens a weird \"protected\\_game\" app and says it can't find the binary. MacOS Sonoma 14.1 (23B2073) M3 Macbook Pro.",
            "**\\[BUG\\]** Skins seemingly randomly unload after some time. Default ones are being used unless I restart the client. I have this problem since at least last update. I tried verifying files, but it didn't help. Deployables and wearables/tools/weapons included.\n\nCan this be related to starting parameters (my friend uses the same or lower and he doesn't has this issue)?\n\n`-cpu_priority high -gc.buffer 8192 -force-d3d11-no-singlethreaded`\n\nMy Rig:\n\n`Operating system: Microsoft Windows 10 Pro N (10.0, Build 19045)`  \n`Processor: AMD Ryzen 7 7800X3D 8-Core Processor 8/16`  \n`Motherboard: ASUSTeK COMPUTER INC. ROG STRIX B650E-I GAMING WIFI`  \n`RAM: 32 GB DDR5 (2 x 16 GB Model: KF556C36-16)`  \n`Hard disk: Samsung SSD 990 PRO 2TB`  \n`Graphics card1: NVIDIA GeForce GTX 1060 6GB (6 GB)`  \n`Graphics card2: AMD Radeon(TM) Graphics (512 MB)`  \n`Monitor: GBT AORUS FV43U (3840x2160 / 31,5 Inch)`\n\nhttps://preview.redd.it/q3mvisy7sz5d1.png?width=3840&format=png&auto=webp&s=8af70497d3dba65068d968e60068a7187e687734",
            "\\[BUG\\] The game became unplayable, played for 3 years straight now after queueing up for a server, the ram usage goes straight to 100%. Obviously the game then crush and the pc freeze. Never had any of this problem.",
            "**\\[BUG\\]** Can't place deployables on the edges of sheet metal walls. Works fine when changed to shipping container. Can place deployables further towards the middle.\n\n[https://gyazo.com/dfb4c825a9325b223fb8cea0a7a5c752](https://gyazo.com/dfb4c825a9325b223fb8cea0a7a5c752)",
            "\\[**BUG**\\] You can see sleeping players (and I think sometimes their names) through the floor with container skin.\n\nhttps://preview.redd.it/nnourcq6el5d1.png?width=1927&format=png&auto=webp&s=06fdc644e8c4dc0e6e1bd5c05acacd44d0547d25",
            "**\\[BUG\\]** Prior to wipe when having a fuse box open you were able to take a right click a stack of fuses and it would insert 1 fuse from the stack.   \n  \nNow you must separate the single fuse from the stack in your inventory to insert into that single fuse box.",
            "**[BUG]** Neon Sign images stop rendering past ~20 meters.",
            "\\[BUG\\] `Add ability to rejoin server for 5 minutes after disconnecting`: I'm currently sitting in a queue after getting disconnected from a server and **immediately** rejoining, so I suspect that this isn't working as intended.\n\n\\[BUG\\] Jumped on top of one of those recyclable cars at Junkyard and got completely stuck inside its roof and then flyhack kicked. Flyhack detection has been problematic for years, but I'm mentioning this specific issue since I've seen some recent commits regarding attempted flyhack improvements. Also, combined with the first issue, it's why I'm stuck in the queue right now.",
            "The faster \"last used code\" added this update only applies to entering codes on code locks that are already locked - NOT on the initial programming entry. That one is still slow.",
            "\\[BUG\\] Queue rejoin doesn't work...",
            "[BUG] When the survival fish trap catches a salmon it is dropped on the ground instead of being stored in the trap",
            "BUG the convey system from storage to tcs displays the wrong upkeep time",
            "hqm is not dropping in labs crates???",
            "Lots of crashes this update no clue why can't read the crash log so rip",
            "env.culling keeps turning on after game restart",
            "\\[BUG\\] When I tabbed out my game crashes or will just randomly crash when I play I can only play for about 10 to 30 minutes until I crash",
            "**[BUG]** You can glitch through elevators with even a slight amount of lag.\n\n**[QoL]** Allowing elevators to be code locked would make them way more useful.",
            "**[BUG]** Building your base on low lying ground directly over a metro tunnel will kill you shortly after logging off.\n\n[Evidence](https://www.youtube.com/watch?v=4RAdFuRZ18o)\n\nIn the video I have just thrown down a starter on my local test server, I run the f1 sleep command and then the puzzlereset command and the tunnel resetting below the base results death.\n\nSeed: 2106779849   Size: 4250   Pos: -1397.99,1.42,-1615.83",
            "**[bug]** Dismounting horse inside building causes player to float between horse and wall instead of moving to an empty space just behind the horse. Also horse movement inside a building is very glitchy, it jumps forward and backward erratically.\n\nWould love player head inside wall to result in just gray screen texture (like Minecraft) so the horse itself needs no modification but rather player viewport",
            "Bug since last update joining server alot of packets ignored randomly some times you log in perfect other times it's unplayable 20 normal jumps all the way up to 1100 and get temp banned from easy anti cheat played for years no problem checked with isp nothing has changed checked router setting and replaced router nothing changed. It's a rust only issue checked drivers network card Ethernet cable ECT",
            "[BUG] some cloud textures are inverted. They seem to curve inward, instead of outward.\n\n[Bug] audio loop convergence. Sometimes, environmental sounds, and often furnaces, will have a strange convergence, where it sounds like a jet passing by.",
            "\\[BUG\\] If a player has a skinned item that is on steam workshop but not accepted in the game, they will get an NRE on this function, viewable in the server console and in red on the player's screen. \n\nRepairBenchPanel.SetSkinData (Item item)",
            "I Cannot use my workbench to craft anything. the page doesn't come up.. only thing that does is my items unlock tree",
            "**\\[BUG?\\]** HV rocket impact sounds different this wipe, and in a bad way, like static noise mixed into it. Regular and incend rockets are fine.",
            "Bug - Invisible/silent animals / happening to multiple people in my group.\n\nBug - Occlusion Culling re-enables itself / sometimes happening without even rebooting the game.",
            "\\[**BUG**\\] Animals and NPC are spawning near the player (even within meters from him). Can be very deadly. My friend yesterday had an opportunity to find out how fast pack of wolves can kill a nearly fully geared player. x)",
            "\\[QoL\\] When using a Car Lift, it deletes the very first engine part you try to insert into an Engine Block Module, or Cockpit With Engine module, when right-clicking the car part from your inventory. \n\nThis only happens with the Car Lift interface; there is no problem using the regular open interface on a given engine",
            "(QOL) I LOVE DRONES, I think it would be a fun and welcome feature to give the drone the ability to use items such as nvgs for night scouting, or even the ability to strap explosives to it and be able to remote trigger (maybe debuff by making it a possibility to not go off) I would love to be able to drop grenades from drones or even interact with shops nearby with my drones(use durability un repairable for each successful purchase or item usage) let the drone drop mollys or c4 or even flashbangs! Lots of possible options. (QOL PART HERE) with the DB if i shoot once let my relaod be faster and only animate the reloading of one shell <3 thanks for all you guys do!",
            "\\[**BUG**\\] I've 4K monitor, but due to older GPU (GTX 1060) I play on lower resolution (usually 1920x1080 or 2560x1440). I noticed that when I alt+tab to check something else, then go back to the game its resolution is increased. I can tell that by better quality of graphics and lower FPS; but when I check resolution in settings it's still the same one. In order to set 1920x1080 resolution I've to pick different one and then select 1920x1080 again. It's pain in the ass to have to do it every single time and I reported it many times already. Any chances for fix?\n\nhttps://preview.redd.it/7comz07h706d1.png?width=3840&format=png&auto=webp&s=f6f37a801076a3cb1fbb91c02827b321d9858db4",
            "\\[**BUG**\\] When I tried to send bug report via F7 report menu, I didn't think it had finished, so I waited a moment and was disconnected along with red wall of debug text covering my screen. Might be that function to send report doesn't like to wait too long (I have unstable connection).\n\nhttps://preview.redd.it/inetdszhn06d1.png?width=3840&format=png&auto=webp&s=ef5e611a6e0b39cd77757beebe04de1f1dad1429",
            "**\\[Bug\\]** Small oil rig and large oil rig frequencies do not broadcast when the locked crate is triggered.",
            "**[BUG]**\n the second port monument (with large building leading to train tunnels) recycler sometimes completely mute. Also crashed my game once when turning it on.",
            "[QOL] change horse meat to have a unique icon as it shares chickens and can’t be stacked",
            "This wipe -- possibly in relation to occlusion culling OFF - I am getting a LOT of invisible animal issues. Getting attacked by animals, only indicated by damage indicators. No audio, no visual, until I kill the animal by hip firing the direction of the damage received.",
            "Not a bug but I've been asking for months now. Please reduce the maximum amount of power Tesla Coils need. 35 is WAY too much. Even SAM Sites only use 25.",
            "Can I report my setup as a bug?",
            "Just bought the Medic Small Box Skin the payment went through i can even see it in my purchase history on Steam but i didn't get the item in my Steam inventory or In-game. This happened moments ago will come back and update if anything changes\n\nedit: apparently steam was having issues reaching the item server or something but now its in my inventory. Odd",
            "**[BUG]** You've been able to NoClip through walls for at-least the last 2 updates. You just place a sealed 1x1 with a triangle foundation beside it with a barrel and a triangle hatch leading down on-top of the barrel. The hatch will push you through the wall when you open it causing zero damage.\n\nThe video evidence is from a build server but I have god-mode and NoClip turned off  to show it does zero damage and that you can NoClip through walls. \n\n\n\nEvidence: https://youtu.be/avpJjpEsex0",
            "Same issue here. Any solution?",
            "i can't even see a mac client in my files. there must be something more substantial that is wrong with it because a simple failure to upload the proper client could be solved in an hour.\n\nmy guess is that we're down for the weekend (at least.)\n\neverybody should put in a ticket.",
            "i can't even see a mac client in my files. there must be something more substantial that is wrong with it because a simple failure to upload the proper client could be solved in an hour.\n\nmy guess is that we're down for the weekend (at least.)\n\neverybody should put in a ticket.",
            "seems like incomplete reimplementation",
            "https://preview.redd.it/oco2zuxbb85d1.png?width=1542&format=png&auto=webp&s=24e3a47827618253ce32afc1eba3e6e1b2bd37de",
            "Also seeing this!",
            "Yes! It's so irritating",
            "We'll put this on our list, this month to review and resolve",
            "I'd love to see second cooldown introduced. First cooldown from beginning of animation to mag insertion, second cooldown from mag insertion to gun ready. So from bullets going in to gun being ready being gun specific, where you can't actually do any shooting until stuff's closed up.",
            "Yep getting this one too. \nSome work, some don't. On the pve server i am one, one particular floodlight doesn't work half the time. The others all work oddly.",
            "this",
            "Thank you for the report, we have confirmed and have a fix, which will be published in the coming hours.",
            "I've been dealing with this for the last month as well. Half of the time it doesn't crash outright but just freezes indefinitely, but it's still means I need to restart the game or risk a crash almost hourly. When the game does actually close in a crash, the log usually has something to do with Nvidia related calls, and I have had a better time since disabling Shadowplay and MSI Afterburner/Rivatuner SS, but still way too many crashes.",
            "[Fixed today](https://commits.facepunch.com/r/rust_reboot/main/LootFix) and [merged](https://commits.facepunch.com/483470) to [release](https://commits.facepunch.com/483499), though I don't know if that means it'll be in an update or just part of next month's patch",
            "That is so cool. I hope it will be made a feature.",
            "I have the same issue. The game doesn't launch after reinstalling, verifying game files, and re-downloading the EAC folder. Opens a \"start\\_protected\\_game\" app and the RustClient app in the steamapps folder is listed as damaged or broken.\n\nMacOs Sonoma 14.2.1 (23C71), MacBook Pro M1 Pro\n\n&#x200B;\n\nThe game was working completely fine before the update. This only happened after the most recent update went live. Anecdotally, my other friend on Mac faced the same issue so it might be a mac platform-wide bug.",
            "https://preview.redd.it/fq0itd1dq65d1.png?width=1598&format=png&auto=webp&s=7cf2fefa900d13b681880985ff93c249c0016e4c",
            "Same issue and the [RustClient.app/Contents](http://RustClient.app/Contents) does not contain the MacOS subdirectory or one under it.  I was on yesterday playing fine.",
            "Same here - M1 Max Sonoma 14.5 (23F79)\n\nTypical story of getting a very rare morning to myself to game - and it's borked 🙄",
            "Having the same issue here on MacOS Monteray 12.1 M1 Max",
            "u/Alistair_Mc is there any chance for fix or at very least workaround\\* until you guys figure what's going on? I've bought skins for at least few hundred PLN, but I can't fully enjoy them. :(\n\n\\*Console command to force reload skins to avoid the need to restart the client, possibly with a cooldown, so people can't use it to somehow keep unloading skins for extended period of time",
            "i think this was only able to be seen when u upgraded the floor while they slept ? i had the same happen with a furnace when i upgraded",
            "This is the current intended behaviour to reduce the possibility of spam replacement of doors (during raids). While the debris system works well to prevent this, it doesn't cover all cases.",
            "Thats been fixed apparently.",
            "This is as intended if I understand you correctly.\n\nFrom the dev blog: \"The tech tree also now opens immediately when accessing the workbench, saving you a click.\"\n\nSo, in order to craft right next to the workbench, don't \"use\" it, just press \"q\" to enter the crafting menu or \"tab\" to enter the inventory and then go from there.\n\nI'm still getting used to it as well.",
            "thats because they changed the sound, did you read the patch notes?",
            "It's up to 35. The higher the power, the higher will be DPS.",
            "This is not a Facepunch issue, it is (or was potentially) a Steam issue.",
            "This is because your build server has disabled Anti-Hack features. You will not be able to reproduce this on a vanilla server, nor is it at all new.",
            "Update: Not sure if this is a temp fix, but launching Staging Branch loaded up regular old Rust. Launched right from Steam, no tricks.",
            "Where do we put in a ticket?",
            "Also the syringe animation is very confusing. It's the combination of seeing the syringe go in and hearing the sound of injection only to have it undone if you quick swap",
            "Would be also nice to be able to hold shot button before reload finishes, so when it actually finish, weapon will shot (and keep shooting for automatic weapons or just single shot for the rest).",
            "I think you should introduce second cooldown. 1. from beginning of animation to injection sound (or reload) , 2. from injection sound to animation finish. So you can't quick swap during 2 at all as you're working still on the item, but already are buffed.",
            "I saw commits relating to it and now a merge to release today, but an admin said the map would need to be wiped to fix the vendor, is that true? Is there any workaround for them?",
            "&#x200B;\n\nhttps://preview.redd.it/0joszf5uf75d1.png?width=1598&format=png&auto=webp&s=86c4dddeccfebe8907b1b91c15fd9d98f94c3c6b",
            "Note weird rust app with blue bear icon\n\nhttps://preview.redd.it/b3hgu5r0g75d1.png?width=476&format=png&auto=webp&s=9ed74954db5bad665d77f0b9b58b58e306571e28",
            "&#x200B;\n\nhttps://preview.redd.it/iupixjq2g75d1.png?width=516&format=png&auto=webp&s=17a4fab81ce6929830c2c02bbd04b0f8620aa917",
            "Same, was playing fine as of yesterday night around 11pm Pacific time. It started happening immediately after a patch update this morning  u/Alistair_Mc",
            "literally my same story. Day off at work and wife and kids were out for the day. I was so looking forward to it lol.",
            "I notice that whenever it happens I can see the number of skin tasks counting up indefinitely when using `perf 6`, so I wonder if it just happens to be some individual problem skins that when requested break loading new ones for the rest of that session. That might explain why it seems so random",
            "Thanks for the confirmation! And great work as always, both you and the rest of the team. <3",
            "Perhaps code lock should blink for 1-2 seconds before accepting new PIN. Additionally message about this requirement can be shown in the local chat: \"Code lock initializing in 2s\".\n\nThis way you can have more explicit behavior for this mechanism that's possibly easier to understand at first glance along with a bit more consistent behavior for \"use the last code\" feature.\n\nOnce code lock actually accepts new PIN, message can be shown: \"Code lock can be locked\".",
            "Thank you very much... The Rustoria Servers informed me before I read your reply here. They have some Awesome customer service and quick response time. Tyvm",
            "Searching this month's devblog I don't find any \"sound\" or \"audio\", can you point me to where? To emphasize, it happened just this month and just to HV rockets (as far as my activity covers).",
            "i started with steam but it redirected me to a facepunch ticket screen (technical game errors are their responsibility.)\n\nthey ask for your steam id (in your steam profile) and then they need you to sign in with an email confirmation to send the ticket.\n\nthey'll return that it is a known problem that they are working on. but the more tickets the more attention will be paid.",
            "quick swap animations are messed up. I think they should introduce second cooldown. 1. from beginning of animation to injection sound, 2. from injection sound to animation finish. So you can't quick swap during 2 at all as you're working still, but already are buffed.",
            "I'm on a mac and seeing the exact same thing, can't open Rust today",
            "Yes I'm also seeing this weird \"DoNotShip\" folders \n\nhttps://preview.redd.it/4cmugq7ah75d1.png?width=986&format=png&auto=webp&s=f9b731027fd96c0229c54ba3c9cef354209a69a3",
            "MATE - this. Such an \"old man\" problem to have but those rare opportunities when the responsibilities aren't knocking, you make your plans, and life goes errrrrrrr.... NOPE 😅",
            "I think I don't have such an issue with `perf 6` .\n\nAt one moment some skins just go back to default one and in the case of somethings in my inventory there is just circle next to the item (the one that informs you about skin being loaded).\n\nhttps://preview.redd.it/1h8y5xcyrz5d1.png?width=3840&format=png&auto=webp&s=d5175a6b3b8807f7038e8f32af1aa9ee1d9b3c58",
            "Nevermind. After this bug occured, I let the game run and didn't restarted it for about 2-3h. After that time counter went from about 400 skins to almost 900, so it indeed might seems like some sort of memory leak or improperly functioning mechanism to load skins.\n\nhttps://preview.redd.it/nj6pbk2cn06d1.png?width=3840&format=png&auto=webp&s=e188721ba468a4a03a0a9197f252aa112c1a157a",
            "Interesting, it doesn't seem to be in the dev blog. I searched the last two of them for \"hv\" or \"rocket\" and came up with nothing. \n\nBut regardless, they did change the sound of HV rockets. Apparently it's so people can't trick others into thinking they're being raided by lobbing hv rockets instead of normal ones. I can't say for certain that the sound you're hearing is not a glitched version of the new sound. Maybe watch a stream or two during a raid and see if it sounds the same for them.",
            "Well sometimes you would want to interrupt the animation if you need to pull something else out quickly. The issue is it’s misleading if it’s finished",
            "Your screenshot shows exactly what I'm talking about, you have 406 skins pending download, that number is supposed to be zero if everything is working correctly, and only spike up to 10-20 when you move in range of a new base/player",
            "In reality you should not be able to interrupt as it would naturally lead to things like unusable guns. Timing of portrayal in animation is more important, as cancelling inserted magazine is silly. But if you want people to consistently shoot when ready, we need to make it impossible to try to do so when animation is still playing.",
            "I thought it means already loaded skins, not the ones to be loaded.\n\nBut yea, I noticed later that something is wrong with loading skins after it reached more than 800 skins.",
            "Maybe for military SIMS but this game and community seems to prioritize smooth and snappy gun play. No one is asking for this"
        ]
    },
    "Day 7. Double the helix, double the fun": {
        "title": "Day 7. Double the helix, double the fun",
        "score": 42,
        "url": "https://v.redd.it/ouceoxlrx28d1",
        "content": "",
        "num_comments": 6,
        "comments": [
            "My brain is not braining.",
            "And here I thought the previous one was a banger ❤️",
            "How are you doing this? Do you have video?",
            "egg timer",
            "Brother, make a flower of life pattern pls.",
            "I do. Head on to r/rustrician for a how to video."
        ]
    },
    "Warning About Rust Gambling Site (Rustclash)": {
        "title": "Warning About Rust Gambling Site (Rustclash)",
        "score": 79,
        "url": "https://www.reddit.com/r/playrust/comments/1dln4xr/warning_about_rust_gambling_site_rustclash/",
        "content": "I see this site advertised EVERYWHERE and have even played there myself quite a bit over the years (as of today I am level 175\\~).\n\nToday, I was banned for \"reward abuse\" which an admin (Apollo) explained was due to my having not played plinko (or other games/risks/etc) long enough before withdrawing rewards. He specified that I \"do not have to play with it until I lose\" but that I can't just collect it, clear the wager requirement, and withdraw. I apologized and said, having been informed of that, that I would refrain from doing that again and asked about what wager amount/type of wager/etc. I need to comply with the rules. \n\nFast forward like 6 hours later and I am banned all over again. In the 6\\~ hours leading up to this 2nd ban I had not played/deposited/withdrew whatsoever. I work from home and don't play during \"working hours\" (though I do claim rains and bonus codes if I see them pop up on my 2nd monitor).   \n  \nThis time, a new moderator (Obscurity) decided to reply after making me wait over an hour and said that \"Apollo clearly stated that what I was doing was wrong\" and that the ban was legitimate and permanent before inviting me to make a new account to start over as a level 1.\n\nI don't know about the rest of the community here but this is insanely unscrupulous and shady behavior in my book. Not expecting to get unbanned (being insulated from such a place is probably for the best anyway) but I hope that some people at least see this and have a chance to avoid being taken advantage of/admin abused.\n\n  \nScreenshots of the original chat with Apollo: [https://imgur.com/a/RyAgdcg](https://imgur.com/a/RyAgdcg)\n\nI don't have the link for the transcript with the moderator because I haven't received an email of it yet and I closed out of the page because I was pretty sure he was intentionally being snarky with me to get a rise out of me at that point. I will add it if I wind up receiving that transcript though.",
        "num_comments": 69,
        "comments": [
            "I can't believe predatory gambling website has questionable ethics \n\nShocking really",
            "I'm shocked, SHOCKED!, to find that gambling is going on in here.\n\nThese sites are all shady af online casinos.  What kind of integrity were you expecting?  Please don't ever use any of these sites ever again.",
            "Not surprised they banned you, farming rewards, never depositing, how are they going to make money from you.\n\nBan yourself from all of them, its not worth it in the long run.",
            "They shouldnt punish you for behavior their system allows. That is their problem.",
            "Any site that asks you to deposit to extract winning is scamming",
            "OP, as some commenters correctly pointed out it is illegal to withhold account balance from the respectful owner. \nAfter you get a perma ban or account closure by an online casino, they are supposed to send the remainder of your account balance to the credit card which you used for depositing.\nIf they keep denying you your money, file a complaint to the issueer of their gambling license if they have a legit one; Otherwise contact the Cyber Police or Electronic Crime department of your country.",
            "You got scammed bro. ",
            "What games were you playing to warrant the first interaction?  The warning makes sense if you're playing games where you're able to control the wins a bit like mines or dice. Real casinos do the same thing with card counters. It's not illegal to count cards, but a casino will happily ban you if you are.\n\nThe 2nd interaction is straight bullshit. If you didn't play anything, and you've received one warning, there's no reason for them to perm your account. They just wanted your rake back bonus reset (if that's how levels work on clash).\n\nEdit: read the picture and you're in the negatives. Yeah they're just fucking your rake back. Pretty low.",
            "Don't gamble",
            "You played in an illegal casino and got hit with illegal practices. Shocking!",
            "Lame, I get the ban because that's how casinos work. \n\nBut they still have to cash you out lol it's part of the business.\n\nThe house always wins doesn't mean they can force you to lose when you get the better of them.",
            "And I thought my addiction was bad! (Buying skins)",
            "Well said, both of you lol. I learned my lesson, just wanted to put out a PSA since these predators spam their advertisements to teenage kids on YT vids.",
            "XD",
            "Sorry that you've been scumbagged out of your account. How much value did you lose? I hope you won't go back, or to a competitor now though as they are all as scammy, and scummy as each other.",
            "This is why regulations are needed for this stuff.  Meeting the playthrough and then being banned for trying to withdraw is counterintuitive.  They .are a bet on these bonuses that you won't meet the playthrough before losing it all.  You won that bet.  They should pay",
            "Also Reddit and Twitter have really sneaky advertisements. I wouldn’t click on any of them.",
            "I suggest you contact the national gaming control board and file a complaint against them. Also, contact the fbi and make them aware of their practices and file a complaint with them as well. Anyone else who has had similar experiences should also report them. Let's shut down these pieces of shit.\n\n![gif](giphy|81xwEHX23zhvy)",
            "Stay away from dmarket as well, they're a scam working out of ukraine. Lost over $1200",
            "You’re participating in a Rust gambling site. You deserve everything you reap from that behavior",
            "Sorry for your loss, but this is a rust subreddit not a gambling skins reddit. I suggest you post elsewhere because most people here don’t engage with them for the reasons you mention.",
            "Copy paste spam? How it this even related to Rust. Mods???",
            "Some thoughts :\n\n* You are misrepresenting why you were banned. They told you to stop Rain abusing and you admit you sat at your PC while doing work from home, collecting rains again for the next several hours, and not actually gambling.  (for anyone who's an outsider, every 30 minutes you can collect about $0.20 via the rain function of the site. This man had collected up more than $8.00 in free money. That's 40 hours of sitting on this site collecting money and not playing.)\n* This sure does reek of a \"I wasn't cheating & got banned\" type of post.\n* This has almost 0 to do with Rust, the game.\n* Did you actually lose anything of value? Can you not make a new account?\n\nI play on Rustclash too. I'm level 56. I login for daily cases and promo codes just like you. If I get a big hit I'll withdraw otherwise I play till 0 balance. I haven't deposited in quite some time. I am not banned.\n\nRustclash has to have free play in order to operate legally. You are walking into a casino that is required to give you a few pennies at the door, waiting at said door to collect until you have a few dollars, then leaving without actually risking anything. Plinko is a guaranteed payout, 50/50 upgrader on a 10 cent item a large number of times would leave your balance relatively the same, and both of these would let you get over the threshold minimum of you being required to gamble before you withdraw.\n\nYou're trying to weasel your way to a few bucks on a technicality and got caught and banned, now you ran to Reddit to cry wolf. Go away.\n\nPS I wish it were Clo. If you know you know.\n\nPSS I am not affiliated with Rustclash in anyway outside being a patron.",
            "That's why rustyloot is better",
            "Gambling would imply it was actually a \"game of chance\" and not just a scam from the start.",
            "but wally1k told me to deposit my savings in that site WTF.\n\nWally1k would never try to scam me right? /s",
            "Oh that first part is not true actually. I was depositing. In relatively large sums even. I can't show the screenshots since they banned me but, if I'm not majorly mistaken, since Feb/Mar I put in about $3000. On top of that I am -$5,000\\~ overall there. \n\nReally confused why they decided to pull the rug today but like you said, it definitely is not worth it in the long run. This was the last holdout of all these \"sites\" that I still had a connection to. Bit of a relief to be free of it even if they are continuing to do what they do to people.",
            "1000000% this. If they don't like the rewards system all they need to do is change it, limit it, remove it, etc....much fairer/more transparent than just basically shadow banning anyone using it and exposing the facade :(",
            "I learned this the hard way lol.",
            "Lol... Gambling license? There is next to no regulation for skins as they aren't considered currency.  On top of that these are mostly Russian based sites, reporting them is going to get you nothing, even in places like the EU that tend to have good consumer protections.  \n\nYou're best bet, if you want to get good skins is learn what does well in the official shop, gamble on what you buy doing well, sell at the peak and buy that expensive skin with your profit.  Pro-tip, you're still going to loose money",
            "I was just playing plinko and upgrader. I would do low risk plinko and then upgrader with 50%\\~ win chance. \n\nAnd yes, they 1000% just wanted to reset my rewards. They even had the audacity to invite me to come make a new account and start at level 1. \n\nScummy doesn't even begin to describe it lol",
            "He admitted he works from home, and after he got unbanned he kept collecting rains despite them telling him to stop or he will get banned again. The little bro has brainrot.",
            "Touché",
            "Yeah they confiscated all the balance I had too. Super not cool.",
            "Just gonna say I never trust a single one of these sites. I've seen rug pulls going on where sites for CS run for years and then suddenly loot everything from all the users for millions of dollars before closing.",
            "Educating people not to do as OP would be wise and they target rust players, so I don't see a problem with the post.. other than OP actually engaging the gambling site.",
            "Shit take",
            "Sure. Not affiliated at all.\n\nLook, I'm inclined to believe a random person that an scummy online skin gambling site is scamming people. I'd be surprised if they weren't. I'm also inclined to believe that anyone going to as much effort as you have in this post to defend them is in some way compensated or invested in the site. \n\nYou're the one who should go away, you shill.",
            "Frankly, sounds like a bit of a toxic hot take from what I can see...even still thanks for the input though; all opinions are welcome.\n\nI also think you may have missed the part where I am level 175 and -$5,000\\~ there. I am not trying to weasel any pennies lol. My upgrader spins ranged from $5 item to $250 items 99.9% of the time. I think you erred in presuming a number of things including that I was doing 10 cent upgrader spins or exclusively playing low risk plinko.  \n  \nFor reference here are my stats on another site: [https://imgur.com/a/umz8TKb](https://imgur.com/a/umz8TKb)\n\nI am not a small time player on these sites. I am/have been on them all. This was never about profit, just entertainment. I work from home and collect the daily rewards as advertised during the day and when I have time off I sometimes enjoy depositing and having those daily rewards as a boost to my deposit. I don't see anything unreasonable or greedy about doing that.  \n  \nEither way, you are entitled to your opinion regardless of how well informed or not it may be.",
            "gambling is ALWAYS a scam, if it were not a scam, gambling providers would not be filthy rich. rust needs to ban gambling like counterstrike did back in the day. it wont get rid of gambling entirely, but it will get rid of the worst examples.",
            "The ods are per definition against you. Idk why anyone would gamble.",
            "Content creators puttin in gambling ads do not give a fuck about their mostly young audience. Decent and mindful content creators do chose their ads wisely (Wiljum, Bloo, Oil etc). Every single one putting in gambling ads for their young audience will never receive a sub or even a view from me again.",
            "Well sounds like it's a wake up call, imagine what you could do with that 5k",
            "Please, honestly, my dude. Seek some help before it gets worse because it will. You are not \"free\", you need to get real professional help.\n\nDo not ruin your life. Unsubscribe and stop watching any gambling streamers if you do.",
            "I think it sounds like you have enough of a gambling issue to have done any necessary mental gymnastics to get to that mindset. don't be in the \"there's a sucker born every minute\" crowd.\n\nget yourself some help. Nothing good will ever come of it, and the next big thing is always just around the corner. goooood luck.",
            "You get less Rain on a new account. I think their message could not have been more clear.",
            "Absolute losers, glad you're calling them out.",
            "I just went through the guys comments got the past year plus.  I don’t think he’s affiliated with them and never posts about them.  He’s is continually edgy though and calls out people.  I’m inclined to think he’s just someone who speaks up if he thinks someone is acting like a bozo.\n\nI’m not a gambler.  Don’t know or really care about OPs ban.  I do think it’s a scam if they didn’t pay out.  It’s fine for him to post here seeing they are advertising to us.",
            "I have an infinite amount of respect for you. \n\nGiving you the benefit of the doubt on this one bossman. Sorry to hear you were falsely banned.",
            "Gambling is a stupid tax. But 100% agree... RUST and YOUTUBE/other media sites need to ban these type of ads and content.",
            "Shots refuses to endorse or be sponsored by gambling sites as well.",
            "My Aeron chair just turned 16 years old lol...that would definitely buy me a new one!",
            "Some might raise an eyebrow to you reviewing my post history but truth is, sometimes I do the same. If I'm disagreeing with someone I'd like to know if I'm actually speaking to another human or it's a crazy person or something. I've never been called edgy before, but you may be right. I always assumed I'm just an asshole and I've made my peace with that.",
            "i wouldnt call people stupid, like a lot of people falling for it are kinda poor financially and hope to come to fortunes they couldnt reach by any other means than hoping to be lucky. also those gambling mechanics are made to be as addictive as possible",
            "Time for rusty pot",
            "Poor and un-educated go together like peanut butter and jelly.\n\nWhile I agree, it's a bit harsh... it's still a tax on the stupid.",
            "lol about that.... [https://imgur.com/a/umz8TKb](https://imgur.com/a/umz8TKb)\n\nI self-banned from there already actually. Was not comfortable with how they were treating players and it didn't feel like a healthy place to be for me.",
            "My brother you have a serious gambling problem.",
            "My brother in rust, what have you done",
            "What the fuck",
            "Dude this is unironically a gambling addiction holy shit\n\nhttps://preview.redd.it/4f9glnw8238d1.jpeg?width=2224&format=pjpg&auto=webp&s=9a06eb58a05f5f6f20383b0fbb49542c60848bef",
            "$2.3 Million... how about we stop with the gambling and ya know,  buy houses for the homeless or something? Jesus. \n\nYou could buy a game studio and make your own game for less!",
            "Addict.. What can I say.",
            "Addict.. What can I say."
        ]
    },
    "It's almost that time again 🌎 (and for new drops)": {
        "title": "It's almost that time again 🌎 (and for new drops)",
        "score": 217,
        "url": "https://v.redd.it/1wmfpy2aqy7d1",
        "content": "",
        "num_comments": 57,
        "comments": [
            "Knew the earth was flat.",
            "WHY IS EUROPE SO EMPTY THAT'S JUST INSULTING\n\nOXUMS DOME AND SATELITE DISH??? 😭😭😭",
            "I'm walling off the whole map.  See you all on the battlefield.",
            "I hope Spoonkid gets in. :(",
            "Where can I get these maps?",
            "How does one join the media team for this event asking for a friend....",
            "Wait, more drops are coming already?",
            "Would love to see the drops I know fancy is great at picking them",
            "any links to anything official?",
            "Can’t wait to see the atrocities and war crimes committed in this upcoming world civilization event!",
            "Thank you for all the hard work you always do fancy we love you! Can't wait!!",
            "Fp needs to I’m tired of reading mfs cry about skins and streamers on here",
            "Looks awesome.👏 Fancy your videos got me into rust I Love/Hate you for that. Can’t wait for more videos.",
            "Europeans \"I'm in Kenya atm, I'm walking towards Spain\"  \nAmericans \"What the fuck is a kilometer?!\"",
            "6 drops only!? Oh they are all trash! No one is live can fp stop giving shit streamers drops already! This event has been horrible!! \n\nOh sorry just getting it all out in advance for everyone!",
            "What does this mean I am a new rust player",
            "Eta on drops?",
            "Asking again how would someone get into this?",
            "For someone that only has 200 hours and doesn't give a fuck about twitch, what is going on and can we play these maps?",
            "6 drops total? I see your rock in the workshop, can you give any other details on who else will have a drop and what it could be? Hopefully it isn't a ton of niche hoodies lol",
            "Michigan: \"Am I a joke to you?\"",
            "when?",
            "Europe should be 100% monuments. \n\nThat’s right, a map where there is no place for bases, except the shores and water. Just perma- roaming. 🤣",
            "Fancy, I’m going to attack heli the entire server.",
            "When is the event starting?",
            "Hahaha Australia not looking like Australia",
            "Don’t make a flattened version of Antarctica! That’s lame",
            "Yay! Another event I will watch for one second before it gets send to the background to farm drops. Thx",
            "When?!?",
            "how to find server and drops?",
            "So long the AWAITED",
            "LOL it's such a tight area and with so many countries, we couldn't add monuments because of block zones",
            "it’ll also rain every day but only for Europe… by chance of course",
            "At the very least gotta wall off Germany and call it the Berlin Wall.",
            "Yes.. that would be a great perspective to see.",
            "Lone.design",
            "Go to the fancy orb discord. He has a whole other discord linked there that you can go to specifically to be involved in videos",
            "Are you asking to be a video editor for these trailers? \n\nSeems a bit janky\n\nDoesn't look like anything official",
            "They often do streamer events where there are a bunch of continental teams fighting. Watching certain streamers will get you some skins in game if you link your accounts together. It’s always a fun watch with nice rewards with it.",
            "Lmaoo trust me man, I made sure to cook with these drops. I'm not giving out boring looking skins",
            "So last year there was a world war rust event hosted by FancyOrb the OP of this post.\n\nYou can see the video [on YouTube here.](https://youtu.be/uN9D9m1wRgM?si=wjHCT_tfk5DddkWC)\n\nMaybe some servers will host the map for regular players I'm not sure.",
            "Fancy orb is a YT and steamer(?) He does lots of big events. This is the 2nd(?) World map event. Plenty of videos on the other one. Giant clans vs giant clans to imitate a \"world war\" type event. \n\nYou can play these maps on modded servers. I know the PVE I played on had this, or a very similar map (ours had cool caves. We built an absolute badass beast on a south east island cave, we also had no stability so it was perfect)\n\nNot sure if just anyone can join, and it honestly looked like not a lot of fun to actually be in, but I enjoyed watching a few clips.",
            "Mercator projection map, it looks like. I wonder if an interpretation of the Goode's Interrupted Projection could scale better",
            "Yes!",
            "from what i can tell most of the players would rather be in Germany 0.0",
            "No I'm talking about the media team from the last event that ran around in game lmao can't remember who it was",
            "Every drop is a good drop in my eyes can't wait to get them and I hope everything goes well thanks again your the goat!!",
            "The twitch skins have easily been the best if the past is anything to go on.",
            "When are the drops active?",
            "Oh wow that looks really cool I’m definitely going to check out this video. Thanks",
            "Cool! Thanks for the info. :) \nI enjoy the rust youtubes so will check this out. Much appreciated.",
            "it was konfusion"
        ]
    }
}