{
    "Read the rules before posting or commenting!": {
        "title": "Read the rules before posting or commenting!",
        "score": 105,
        "url": "https://www.reddit.com/r/Plumbing/comments/16doa2v/read_the_rules_before_posting_or_commenting/",
        "content": "Due to a large influx of people not reading the rules and how small of a Mod team we are this is here to serve as the only reminder of the rules. Just to be clear asking or commenting about prices is a permanent ban, the internet is not the place to judge if prices are \"fair\".\n\nRules are available on the sidebar.",
        "num_comments": 0,
        "comments": []
    },
    "FROZEN PIPES MEGATHREAD": {
        "title": "FROZEN PIPES MEGATHREAD",
        "score": 121,
        "url": "https://www.reddit.com/r/Plumbing/comments/zssj2d/frozen_pipes_megathread/",
        "content": "Please post any questions you have regarding frozen lines here. All other new posts will be removed from the main feed and directed here.",
        "num_comments": 506,
        "comments": [
            "Hi, I've got no hot water in my upstairs bathroom. Nothing comes out when you turn the hot water knob. Cold water works though. Nothing at all comes out of the shower, which is one of those one knob setups.\n\nHot and cold water both work fine on the other two levels of the house.\n\nIt is 2-3 degrees Fahrenheit outside ATM",
            "[removed]",
            "We had a bad cold front come in last night and I forgot to disconnect my outside hoses. I got them both disconnected but one of the spigots has ice inside it. Is there anything I can do?",
            "[deleted]",
            "Woke up to discover no hot water coming from faucets. That is, no water flow at all when faucets are opened to hot. Cold water seems to come out normally. Any ideas why this would be or how to fix it? We have a tankless water heater, FWIW.",
            "It got down to -8 two nights ago. Left faucets dripping.  Woke up to only the toilet intake line frozen. \n\nI have tried everything to unthaw over last 24 hrs but no luck (hot rag, space heater\"/, hot pad). The line not accessible by crawl space as I think it's split off another line that goes to the sink or washing machine near by. \n\nPipes are PEX\n\nI need to leave to a out of town trip in 5 hours for 5 days\n\nIt will be 20 degrees with low of 8 for next day or two\n\nThere is no shut off value anywhere in the crawl space. \n\nDo I need to worry about the pex (blue and red) bursting ? \nShould I just shut off my water at the meter with a meter key and drain my pipes?",
            "Holy fucking shit guys. I’ve never seen anything like this and I have been doing this for 17 years.\n\nI have spoken to so many people who are crying with the sound of a waterfall in the background. \nPeople are calling fucking 911 to deal with this. Absolutely nuts no way in hell I can keep up with the calls.\n\nWe’re $250 for the first hour which is really expensive for my area and it isn’t phasing people.",
            "u/Gooseferatu\n\n“Getting super conflicting information and keep going back and forth myself on what to do. I have an older pier & beam house with a gas water heater. All the pipes are under the house and we had them burst during the freeze in 2021 but we really didn't drip as much as we should have. We now have foam insulation tubes on the pipes, but I still worry. Should we turn off at the main or just try to drip this go around? If turned off, what do I do with the GWH? I talked to two different local plumbers who both said drip, but I don't know if that was just for their own self interest.”\n\n\nu/ba12348:\n>Just turning off the main will prevent flooding, but it won't prevent freezing and pipe bursting.\nDripping is your best bet at this point. In theory he only way to guarantee water doesn't freeze in the pipes is to not have water in the pipes, in practice it's almost impossible to be sure you got it all.\n\nu/imperfectably\n>\tClose your crawlspace vents. Open your under sink cabinets. Let your faucets drip. Every few hours let your cold and hot water faucets ru blast until you feel warm water.\n\n\nhttps://imgur.com/a/SKM6pO9",
            "First time my pipes ever froze while sitting at sub zero temps for 47 hrs and with all faucets dripping, rolling black outs that happened like every 30 mins ended screwing up my heater some how and I was sitting at freezing. Lucky my pipes unthawed today without any damages and seems the heater kind of wants to blow warm air. Hope you all have the same fortune and merry christmas.",
            "Long ago at my old landlords appt, there was a bathroom that stopped working one winter. We found that putting a mini space heater in there “fixed” it. There was mold below there in the basement on the drywall. Oh how I’m thankful to learn things and well that this wasn’t my appt at the time. We did tell the landlord about it of course. He didn’t have any concerns lol",
            "Frozen Pipes not Thawing\n\nHello.  Woke up this morning to no water it’s currently -5 feels like -30F with windchill so I’m assuming my pipes have frozen.  Live in a single story house with a crawl space where I put two heaters and turned the main water valve off.  I’m just wondering how long it normally takes I have had the heaters going for about 3 hours and still nothing has changed I felt the copper pipes and thought I found where the freeze was but nothing has moved.  When should I expect some movement?",
            "Q: How can I diagnose a frozen/burst line?\n\nLast night I took a shower in the main bathroom with zero issues. This morning I noticed that no cold water is available at that same shower. All other lines in the house are operational i.e. no issues with hot or cold at sinks, other showers or tubs.",
            "Have been trying to be proactive to avoid pipes freezing but unfortunately I think our hot water to kitchen sink has (no water comes out when set to hot) in spite of keeping on a (cold water) drip all night. Cold water comes through fine. I tried to run dishwasher and while it heats up I also don't think hot water is going to it either.\n\nHot water and cold water works everywhere else in the house including clothes washer. I've tried turning hot water to all the faucets/showerheads and placed a space heater directly pointed at the kitchen sink cabinet to warm things up, but getting nothing. Basement, utility room and crawl space are all at good ambient temp. I suspect a part of the water line on the perimeter of the house froze (as it faces an open field where we've been getting really cold wind). We have copper.\n\nSo the issue is I travel tomorrow and I'm at a loss what to do. It's supposed to dramatically warm up here over the coming days and I fear coming back to a mess. Should I turn off the water main before traveling? I haven't done that before, would i just turn the valve off and drain all the water from the faucets?",
            "Yesterday we woke up to none of our faucets working, save for one sink in the basement with a small drip (a drop every 9 seconds or so). Called a local plumber, they gave me some tips and told me to wait it out. We kept the house hot, wrapped an electric blanket around the mains and opened the taps a little. Husband turned off the mains while we slept overnight, turned them back on this morning, heard a clunk as an ice chunk flowed through and, alleluia!, water is flowing! Hot and cold both are working as normal in all sinks and tubs, toilets are flushing (thank goodness, we were melting snow to fill the tanks!) and we can't see any evidence of obvious leaks in the walls, basement or outdoors. We've had a single tap going for about an hour now just to keep water moving.\n\nI guess my question is ... are we good? I'm dying for a shower and have a dishwasher full of dirty dishes I'd love to get done. I tried to call the plumbing office for advice but they're closed until Monday (understandable). I think I will call them Monday and see if I can have someone come out, though I don't know what they'd be looking for.",
            "Can some northern plumber ELI5?\n\nHow do pipes not freeze in Alaska? Do they drip them all winter? Do they have a recirculator or something? Is there some kind of permanent solution I can implement? I’ve never burst a pipe yet, but gosh darn, my water bill 😭",
            "Perhaps a little meta, but is there a better alternative to those !@$ \"frost-free\" siphons? Just had the *third* one burst on me in so many years, and now I'm slowly drying out all the lumber in my basement that got soaked.\n\nI suspect that some gardener or another left a hose attached during that freeze a couple weeks ago, but my girlfriend swears that's not the case.",
            "Frozen drains.\n\nI bought a duplex last summer and we just went through our first snow storm. Both kitchen sinks are on exterior walls and they were both effected. Over night I left a thermometer in each cupboard; one reached 32°F the other 22°F so it seems like a safe bet that the wall is not insulated. Neither of them drain and the 22°f side didn’t have cold water for about 15 minutes. both sinks were left dripping over night but neither were by the morning.\n\nIt’s a slab house, the cold water comes through the slab foundation but at some point the hot water was redirected through the attic (neither run through the exterior wall).  The other bathrooms and appliances are all getting water no problem.\n\nOne tenant used a hairdryer to thaw the drain and now they are “fine” but the other side is still not draining even with the help of a hairdryer and the connections are starting to drip after the p-trap before the wall.\n\nMy take away is that I need to insulate the walls in the cabinets to prevent the drain from freezing in the future but I’m not sure what caused the cold water line to stop, assuming it froze but I’m not sure where since it’s a slab house.\n\nMy temporary solution is space heaters in the kitchen with the cabinets left open.\n\nHow would you handle this? I’m prepared to re-insulate the walls, wondering if there is anything I may have missed.\n\nThank you for reading all this whether you can help me or not, your time is appreciated.",
            "[deleted]",
            "Need some advice. I live in the south. House is raised. Pipes are uninsulated. I'm leaving town for 4 days. I plan to insulate the line that comes from the street into the house. Shut off the main supply, leave all faucets open, and put some RV antifreeze down the toilet. Is this the right move? Or am I better off leaving the faucets running for 4 days?\nI am also concerned about my water heater. It's a gas tank that's outside. Will it be fine or do I need to drain it?",
            "General frozen pipe question: \n\nParticularly during record-breaking temps like these, is turning off the basement/in house main valve a bad idea without shutting off water at the curb, too? Does that \"stagnant\" water in the buried pipe between the house and the curb--assuming it is up to code and buried at the appropriate frost depth--risk freezing up in temps near record lows below 0 if it is not circulating into the house?\n\nI occasionally worry about frozen pipes since I have electric heat, live alone, and work in emergency response. I've always just turned off my basement main and ran my fixtures dry and so on, just to play it safe in the event i lose power and/or get stranded at work. All this time, should I have been worried about my line from the street to my house when record low temps hit?",
            "Just letting everyone know all the posts I’ve seen saying not to worry about leaving the hot water running was not accurate, now our hot water won’t run and I guess we have to wait a couple days until the temps go back up",
            "Slab single story in central TX. Woke up and none of the fixtures have water (sinks, shower). I left some faucets dripping but i think my absent-minded husband turned them all off last night before going to sleep. Went outside to turn off the water into the house and the valve is frozen open. No leaks. Frozen spot of the pipe going into the house is most likely in that spot where the valve is.\n\nWait it out? Call a plumber to unfreeze the pipe? Hit that outside spot with a hairdryer?\n\nEdit: the lovely sun shone upon the frozen section enough to unblock it!",
            "Wont have heat on in my house until Tuesday. Meanwhile its -20 outside. \n\n&#x200B;\n\nIs there anything I can do once I get the heat turned on to mitigate any potential damage?",
            "Tankless Water Heater frozen\n\nGas, electric and cold water are fine but there’s almost no water flow when we turn on hot.  It’s an outdoor unit (I don’t know the brand) and it’s about 10 degrees outside now and will be below freezing until Saturday.\n\nIs there something I should be doing now?  There’s no evidence of broken pipes.    I covered the exposed pipes with a blankets.   Thanks in advance!",
            "[deleted]",
            "Ran the cold water faucets last night but not during the day, and it was about 9 degrees all day. Now only hot faucets run. Is there any point to running the hot now, or am I just depleting my hot water heater with no chance of thawing any frozen cold lines?",
            "Hey y’all 👋🏻\nCincinnati here. 🥶\nOur pipes are frozen. Every pipe EXCEPT the one that runs to the bath tub faucet are now working. Today is Day 4 of the tub faucet not running but sprinkle. We’ve safely got a space heater in there trying to warm it up. Hasn’t done a dang thing yet. I’m a mama of 3 boys with a blue collar husband & let me just tell y’all, it doesn’t smell nice up in here right now. I’m over havin’ to take h*e baths & would super appreciate any advice that y’all have to offer to unfreeze this pipe! \n*We rent this home, landlord is aware in depth of this issue & assume she is just trying to find a plumber, but haven’t heard much back*\nTIA!!!",
            "Not a plumber. Live in the northeast, it dropped down to negatives two nights ago and it's just now getting above freezing.\n\nMaster bedroom and bath are upstairs. I have two outdoor hose spigots and I only remembered to turn off the line for one of them. The other is in the corner of my basement near where I expect the lines run up to the master bathroom. I'm not sure if the hose line freezing contributed to the issues but I expect it probably played a role.\n\nAll faucets in the house were running both hot and cold water fine except the master shower and the cold water line for one of our double vanities. Kind of weird, but okay. It's all flexible lines and a new build, so I wasn't too worried about bursting but valves are a possibility. The lines either run up the outer wall by the garage or through the ceiling of the garage. They aren't exposed, but the garage isn't heated so that could also probably a contributing factor.\n\nAnyway, the single cold water line was totally frozen and the shower was trickling. I turned the shower on but kept it to cold to keep water running through the line. I also turned every faucet and shower on in the house to just a light trickle to keep as much movement in the water lines as I could. Then I cranked up my heat to 80. After about 2.5 hours the shower was showing clear pipe and full function. The cold line to the sink was fully blocked so it didn't come on right away but that line and the shower line must be very close or connected because it started flowing a couple minutes after the shower was good.\n\nSo if you don't have to worry about broken pipes and water damage, keeping the water running and turning your heat up can definitely help to clear some pipes some of the time, even if you can't access or find the specific frozen part.\n\nGood luck out there, and don't forget to take precautions!",
            "Frozen pipe?\nHey fellas I had a question. I let my faucet drop at night and when I woke up this morning the cold side of my kitchen sink doesn't work but my hot side does. Any advice?",
            "Hey all! I have a plug of ice somewhere in my drain line I believe. My house is pretty old but the plumbing is fairly new. The issue I’m having is that water keeps backing up into my upstairs bathtub and toilet and then it begins leaking into my garage. I’m not talking a heavy flow but like enough to be alarming. I am posting a pic of the pipe, I had a plumber come out and they basically agreed it’s probably an ice plug. I have a space heater going now on that pipe and once it’s fully done draining I plan on wrapping it with pipe insulation and leaving the space heater. Is there anything else I can do? I cannot turn on the water currently because if I do it will overflow again as I think it’s not well insulated where it’s supposed to be draining into the ground. Lemme know your thoughts/ any suggestions you have to fix this in the future!",
            "Hello!!\n\nI live in an apartment, and we woke up to no water this morning after sub 0 temps last night. All 5 sinks won’t even drip and neither of the toilets can flush. We’ve had our sink cabinets open for around 9-10 hours now and we turned our heater up to 82 degrees. The pipes are all warm, so I don’t think this is the issue. The unit below us is vacant, so I’m afraid that the cold air from below us is contributing to our frozen pipes. Our apartment is rectangle shaped and 2/4 walls perimeter walls. Does anyone have have any ideas as to how to unfreeze our pipes or who to call? I called maintenance around 10am and they just told us to turn up our temperature. Should I call them back? Should I call a plumber? First time renter here, so this is foreign territory to me lol. Thanks!",
            "bathroom addition over an unheated, and inaccessible, crawl space in an old home that we recently purchased.  Had -26F (-32C) overnight.  Had sink and tub taps running, but didn't have the toilet running at all (didn't think of a good approach to that until after the fact ... and also realized after the fact that I could/should have just drained the water from that bathroom entirely ... will know better next time).\n\nToilet supply is frozen, with no access to the line once it leaves basement on way to addition.  Figured out a way to run hot water through the cold water line to the addition and it flows well to sink/tub, and have been hoping it will help thaw the frozen toilet supply line.  Have also been directing hairdryer at the stub of waterline where it enters the wall.  And, have a spaceheater up fairly high in the space.  No luck after hours of this.  The stub is PVC and the waterlines are PEX.  I don't believe any of the lines have ruptured.\n\nGoing to drain the lines for the night and try again tomorrow.  **Anything I can do beyond what I am trying?**  Really don't want to tear into wall if I don't need to and the reality is that it's not likely to help me much since I think frozen bit more likely to be under oak flooring and I REALLY don't want to tear into it if I don't need to.  Warmer temps coming (maybe as high as 43F (6C)), but suspect that will not help a lot.\n\n**Any ideas greatly appreciated!**",
            "I just buried 30ft of PVC pipe in my yard to connect to the PVC pipe that is sticking out of my house for my sump pump into my ditch. The 30ft of PVC is 2inch. After digging, I had someone tell me it should be 4inch to prevent blockage from freezing in the winter. However, my sump pump never goes off in the winter since my house is on a hill, it only goes off in the spring time, usually March. Should I redo it? Should I throw antifreeze in it here and there? \n\nHonestly I don’t want to redo it at all. So is 2inch okay? (Wisconsin area)",
            "Hello guys,\n\nI have an outside water outlet near my pool heater. It's a straight copper pipe going \\~1.5ft up from the earth and a faucet installed at the end.\n\nThis winter it burst, even though I did stop the outside water for winter and opened all the faucets to remove pressure and excess water.\n\nI will replace the pipe and the faucet. But how do I prevent it from bursting again next winter?",
            "Hi there, long story short, not a plumber just a diyer helping out my church. They have a copper water supply pipe that goes from inside the building, to outside to a water chiller unit for the HVAC system. \n\nDespite the pipe being insulated it still froze and broke. \n\nNow I replaced the break in the pipe and at the closest part you the part that goes into the building I installed a 3 way connecting to a ball valve to drain out the pipe.\n\nNow to further describe there's about 6 inches of pipe coming out from the building, then the ball valve, then about another 6 inches above going to a 90 degree elbow. It goes over 5 feet, then another 90 degree elbow and up about 4 or 5 feet and one final elbow going into the machine. So with about 10ft of pipe that would be empty, should I be concerned about the part of the pipe that goes into the building freezing and causing a break?\n\nMy thought was the ice would take the path of least resistance and just fill in the empty space which while ice expands I don't think it could expand from 6 inches outside through 10ft of pipe.\n\nDo I make sense though or am I crazy? Will this work?\n\nNote I forgot to mention it's copper pipe and I used shark bite fittings because I don't know how to solder and I thought it would be better for me than to do a bad solder job.",
            "I've received some conflicting input and I'm trying to resolve it:\n\nIn this case we're talking about an interior kitchen sink on an exterior wall. My understanding is that in freezing weather, one should leave their faucets slightly open to allow water flow as flowing water is less likely to freeze, and the water flow brings up warmer water into the potential freeze zone.\n\n**The issue here is when the pipe has already frozen.** All my life I've thought you just left the faucet slightly ajar. *I've recently been told that doing so is actually more harmful due to some explanation of air pressure. If a faucet is closed on an already frozen pipe, it should actually be kept closed to prevent bursting.*\n\nIs this advice valid, and does anyone know where it comes from? My cursory internet search seems to indicate most everyone agrees on treatment of pipes that aren't yet frozen, but the answer is less clear on pipes that have already frozen. I believe shutting off main water supply is valid in this case, but not sure about the faucet itself.",
            "Earlier this year, I had pipes burst which i assume were frozen because it was cold outside. My question is how did they burst because I had the cabinet doors opened under the sink, and I let the water drip from the faucet like you're supposed to do when its frezing cold. What did I do wrong or have to do? Because the pipes still bursted",
            "Woke up this morning to a single faucet getting no real pressure. With taps fully open it will give a small steady stream of hot or cold water (both work) but won't reach normal water pressure. I can't see the pipes in the wall but I see no damage or leaks in the basement and all other faucets are working fine. Wondering if it's just ice buildup somewhere outside or in the wall that can't thaw due to the low Temps? Water flow is consistent and clear but hasn't improved.",
            "Live in AL where we will have single digits for a few days at night. I work nights. Is it best to turn off the water from the main line or leave it at a trickle? I will be away from home for about 14 hours. Thanks for your help. Be warm!",
            "I’m on a concrete slab in PA… how can I keep my pipes from bursting under there? I plan to crank the heat in my house to 75 and keep cold water running.. is there anything else I can do?",
            "Hi.  Also part of the frozen pipe squad\n\nWent to work at 7 AM and still had water then.  My roommate/sister who is a night nurse had water at 9 AM.  The water was still dripping at 3 different sinks throughout the house with all cabinets open.  The inside temp was set at 68F.  The outside temp has been 3-7F all day with crazy cold winds\n\nI came home and there’s no water.  Checked with the city and it’s not a main city pipe issue.  Neighbors aren’t home when I went to ask them. What do I do now?\n\nDo I turn off the main water valve?  Do I keep the sinks “on”?  Can I use the toilet?  Should I bother with calling a plumber?\n\nThanks",
            "How do I bleed this backflow valve https://share.icloud.com/photos/078K_N2hqMx3nykFj6Q1DVwgg",
            "I was told to leave the temperature of my apartment at 60 but accidentally set it to 57. I know it probably doesn’t make a difference but I really don’t want my pipes to get damaged, will they be ok?",
            "Currently at work and girlfriend says the pipes stopped dripping specifically the kitchen one we live in a 1brd apartment there's. A lightbulb below the sink to keep the area warm and I've had her put the blow dryer on the pipes under the sink this is kinda a special case I'm in Texas and temps dropped to about 10degress last night however by day time today it says temps will be back in 25 to 30 degree range when I left it was dripping at around 10 pm so only a couple of hours since then I really don't want to bring my landlord and have them have to replace a pipe and be in my shit for the next week what else can I do ? I have a boiler room where the pipes lead to and there's no snow or anything outside I've told her to turn the water off will waiting do any good ? The apartment is horribly insulated it got down to 61 even though heat has been set to 75 the heat just escapes like i said it should warm up by today would it be fine to just wait or will I have to bite the bullet and let my landlord in to inspect how fucked am I ? Any help would be nice I know nothing about plumbing so explain like I'm a dummy please thank you !",
            "[deleted]",
            "We are housesitting and dripped faucets but soon after opening them the water in all of them dried up. Checked the main outside and no water is coming into the house at all, reading 0.00. Would that indicate that the problem is on the street or could it still be an issue with the pipes here?",
            "We’re in central Indiana, currently -8 degrees, and we had all of our sinks dripping. My husband checked the water when he got up this morning and everything worked fine—except the hot water in one sink. The bath  right next to it has piping hot water, as do all the other sinks in the house, and the sink with the issue still has cold water, but when the faucet is turned to hot, the water stops. We have a water recirculator on that sink, so I’m wondering if that is what actually froze? Any idea what might be going on, or suggestions to try? We cranked up the furnace a bit already.",
            "I moved from Texas from a brick house built in 2019 and when it was below 30 they asked to keep the cabinet door open to circulate air. Moved to Midwest in a brick house built in 2000 and no one ever tells you to do the same. Trying to understand the why behind this",
            "Frozen pipes.\nSo we had a freeze out last night and someone turned off the water we had dripping. I have no clue what I’m doing and have been unsuccessful in finding any pipes, let alone a frozen one to thaw. We also run on well water and I have no clue how to shut it off to prevent a burst. Please any help would be greatly appreciated.",
            "Learned yesterday that my hot water pipes run through the attic and one section is uninsulated 🤦‍♂️ So they're frozen throughout the house now.\n\nIt's PEX so I know I have a better chance of getting through this without issue (no guarantees, obviously). But should I shut off the valve from my hot water tank or leave it on? Cold water is still working fine, so I feel it would be overkill to shut off the main house line (I'm keeping it on a steady drip).\n\nAlso, is it futile to sit up there with a space heater? It's about 5° currently, high today is 20°, seems like I may be wasting my time (and destroying my back) trying to fit into the small section of the attic.",
            "Left the cold water faucets dripping through the night, woke up this morning to the hot line being frozen. Unfortunately, the water heater is in the garage and the lines run into the attic of the garage…along an exterior brick wall. Been at it for 2 hours with a gas heater in the garage and a small space heater up in the attic. Don’t know what else to do about this 🙃",
            "I live in Texas and there are a lot of fire sprinklers in outdoor balconies. Last year, one of the balcony fire sprinklers broke and flooded my house.\r  \n\r  \nI got additional insulation on the attic and I am keeping the house warmer, so at the interior there should be no problems, but I cannot control anything going on outside.\r  \n\r  \nIs there a way to protect the outdoor fire sprinklers from freezing?\r  \n\r  \nThank you.",
            "Owned the house 10 years, but just removed a bunch of bushed around our front and discovered our toilet line in the master bath is just...[here.](https://i.redd.it/nh6chmmfzn7a1.jpg) Temps are single digits and the toilet is the only thing that's frozen (don't see any bursts).\n\nThere are two other faucets on that same wall that don't appear exposed at all. \n\nHow do I insulate this pipe in the future?",
            "Just wanted someone to review my checklist for shutting off my water while were out for the holiday. We have no above ground pipes outside, and no pipes that that share an outside wall.\n\nChecklist:\n\nTurn off water main\nTurn off hot water heater (electric)\nDrain all water left in pipes using both hot and cold in the bathtub/faucets.\n\nAfter that should I leave my levers open in the house and keep the faucets open for a drip or should I close everything off? Thanks for your time!",
            "Central ky. Have pex a lines had faucets dripping but all except one have stopped. Plumbing runs through uninsulated crawlspace. Should I go ahead and shut off at the main ?",
            "Using a shallow well pump with underground cistern.  I’ve used the water minimally and the pressure gauge isn’t moving.  Normally it will activate the pump if the toilet flushes.  I’m assuming that there might be a frozen point on the intake side of the pump from the cistern.  Does this sound like a reasonable cause?",
            "I have water upstairs but no water downstairs. Any idea how that’s possible, or any solutions to fix it?",
            "Dripped all of my faucets last night. All of them work still and I took a nice hot shower. My kitchen sink was dripping when I came into the kitchen and tried to turn on the water but nothing came out. I had the cabinets open all night too. Just wondering what this could be since everything else is fine.",
            "Hey so last night I dripped all my faucets  but only the kitchen sink faucet froze up. I have a safety put a space heater near it. Main water line is still on. I was wondering if I should leave the kitchen facet turned n on or leave it off so the pressure doesn't build up.",
            "We have no water from any of the faucets in the house. To help isolate where a frozen pipe might be, I have a question…if the pipe is frozen before it gets into the house, should we be able to use the water in the hot water tank before all the faucets go dry? Trying to discern whether we’re frozen before the hot water heater or after.",
            "Our shared well pump froze sometime between 430 and 530 Ct this morning. Upon getting the pump working and water returned to the seven houses, we all experienced water heater issues. On my side it seemed like water was cycling through the heater and immediately blowing out the pressure side. I shut the water off immediately. Is my water heater toast? What do I need to do next?",
            "We live in an old house in Iowa that the old owners cut corners in.  During the bathroom renovation they ran pex pipes for the bathtub into the attic.  The pipes are not insulated at all.  They freeze often in the winter and are frozen right now.  They are type B pex (I think) with plastic connections.  Dripping the faucet does not stop the freezing when it is this cold in windy since they are basically in the open air.  \n\nWhat should we do about this and should we expect problems from this?  Renovations were done in 2016 and there have no been problems yet with many freeze and thaw cycles.  And yes I know the last owners were dinguses..",
            "Woke up this morning to the only bathroom sink in the house exposed to an outside wall frozen. Only the hot water  is frozen. I left it dripping but I guess that wasn't enough. Our whole house is sick with a stomach bug so I wasn't thinking. Anyway what's weird is I have two sinks at the vanity and I have turned on the hot side of both the faucets. Nothing comes out but when I turn on the cold of on faucet water comes out both faucets. What does that mean? I opened up the cabinets and have a space heater on and I'm also using a hairdryer to try and thaw out the frozen pipe. I'm on a slab and my pipes are pvc. Anything else I should do?",
            "Pier & beam with kitchen sink facing garage, which might as well be an exterior wall because it's totally uninsulated and 22° F. This morning, the kitchen sink water runs fine but it won't drain. P-trap ok. When I pour hot water directly into the drain pipe going into the wall it backs up. I also poured hot water into the vent on the roof and it came out from the pipe under the sink, suggesting the obstruction is downstream of where the sink drain meets the vent. The crawlspace is 55° F so I wouldn't expect a frozen pipe down there. Other sinks and toilets drain fine. Which seems more likely: a frozen drain pipe in the wall shared with the garage, or a mechanical obstruction unrelated to the freezing temperatures? The sink has a disposal and we hardly put anything down it, including vegetable matter and grease, but it's an older house so who knows.",
            "I’m in central alabama and a cold front came through last night. It’s currently 16 degrees outside and my water pipes are frozen. No water is coming out when I turn on the faucets anywhere in my house. Our hot water heater is in my kitchen. I can’t afford a plumber at this moment. What do I do to keep the pipes from bursting? Should I cut off the breaker to my hot water heater? I bought a space heater this morning.",
            "I live in a 3 story house (walkout basement for bottom floor) I'm having an issue where there is zero hot water to the kitchen sink or the guest bathroom on the main level. The master bath that is also on the main level and the washing machine on the main level both still have hot water. I live in Texas and we did get a hard freeze last night, about 10 degrees. Is this just a frozen pipe somewhere or something more serious? Any advice/guidance would be appreciated.",
            "I have a bathroom remodel that's in the middle of being renovated. I fired ther last guy and waiting on new one to start in January. Walls & tile, and plumbing are all done, but fixtures are not installed yet. So I have no way of turning on the water to drip so those pipes don't freeze. I live in Coastal Georgia with uninsulated pipes in my crawl space. It will get down to 19 degrees tonight, and lows in the 20s all weekend. It rarely drops below freezing here.   \n\n\nIf the pipes do freeze, I'm not worried about losing use of them until they thaw. The project won't be finished anytime soon. I'm more worried about them bursting. How big of a concern is that? Anything I can do to prevent it?",
            "I let the sinks drip overnight but forgot to do my upstairs bathtub.  The hot water works on the bathtub but nothing will come out of the cold water.  Every other faucet in the house works.  What should I do to fix this?",
            "Frozen cold line in one bathroom, the hot water comes out of the sink when I open the cold line. Anyone know if there is a way to mess with the faucets and force hot water into the cold line?",
            "[deleted]",
            "Can a Moen positemp valve get stuck in the off position? I know they can get stuck in cold and have the common “no hot” situation. But my positemp shower wont get hot or cold so I’m wondering if that internal bearing is frozen? \n\nWater throughout house works, hot and cold. \n\nI’m in Texas so it’s in 20s but not crazy",
            "Water options when leaving for holidays\n\nI’m hoping this community can help me out as they’ve done before. We are preparing to head out for the holidays but temps will be in the single digits to teens at night when we are gone. Our front hose bib drips (which we need to fix) but we’ve had them covered during the fall/winter. My question is - is it better when leaving the house for more than just a couple days to turn the water completely off and drain all the pipes for cold weather? Or better to let water drip from spigots? We are on well/septic.",
            "Has anyone found any remedy?\n\nNo hot water since morning or some time in the night. Cold water is flowing normally. Tankless Rheem water heater. \n\nThe lowest temperature outdoors was 10F. And it is 25F now and no change. I thought Rheem heaters have tolerance for lower temperatures but apparently not.",
            "There's a frozen pipe somewhere in our house, but we can't tell where, as the pipes are largely inaccessible aside from a few uninsulated areas.\n\nEverything close to the side of the house where the water heater is located is still working. I also noticed a t-junction in our fusebox room (where the water comes in from the outside) where on one end of the junction (The outermost, oddly) it's not cold. The other parts of the t-junction are \\*really\\* cold.\n\nMy primary concern right now is how much of a risk we have for a burst if it's not a complete freeze of all the pipes, but some are most definitely frozen.\n\nPlease do \\*NOT\\* reply if you've got a 'same situation here' reply unless you actually managed to fix it. I need to know what to do, because if we get a burst/flood in the basement, we're kinda fucked.",
            "All water to house off. Cannot detect source of frozen pipe. All pipes to house underground. Called city water and checked outside meter. No leaks thus far. Need help to diagnose the problem and prevent this from happening in future. Thank you",
            "Trying to keep our hose bibs from freezing, does the drip method work if there’s a vacuum breaker installed? Already tried once, removed the extra valve and trying again. Thanks!\n\nhttps://imgur.com/a/671mUfB",
            "So I had water running over night before temps dropped. My kids bathroom has cold and hot water coming out of sink, only cold faucet works in bathtub hot water faucet nothing comes out. Is one pipe frozen?",
            "So I had water running over night before temps dropped. My kids bathroom has cold and hot water coming out of sink, only cold faucet works in bathtub hot water faucet nothing comes out. Is one pipe frozen?",
            "Frozen Tankless Water heater with cold water inlet copper pipe expanded - Austin, TX (Dec 22)\n\nNo luck getting in touch with any plumbers, since the start of the freeze yesterday (Subzero type temps) I've dripped all my faucets on cold and tried to trip all the hot water faucets...  \nMy main concern is the hot water. I've struggled to get anything to come out any faucet. Gas is working, and the water connection assembly to the Navien NP-240s is insulated to a certain extent.  \nThis morning, I found out that the Water inlet Pipe froze, and decoupled from an elbow joint (copper piping around the home) close to the water heater I subsequently melted the frozen icicle using a hair dryer and any other frozen condensed dew around. Trying to run all the hot water faucets, but no luck. There's no movement on the Hot Water heater showing any GPM/flow. All the water valves that connect the inlets have full movement and turn 90degrees proving that the area of the inlets/outlets aren't frozen.  \nAt this point I just want to minimize potential damage when things thaw and ensure that I dont have any pipe bursts across the house.  \nAny insights/recommendations?",
            "Our kitchen faucet is against an outside wall. We opened the cabinet last night and have let the faucet drip all day but seems it still froze. First the cold side wouldn’t come on, now neither side comes on. We did everything the landlords recommended to prevent freezing but this still happened? What do we do?",
            "Our tankless water heater is outside. But I don’t see the remote control. Where is it typically installed? It’s not in the garage either",
            "Central Indiana here.\n\nWe left all of our faucets dripping the past day but forgot one, and go figure that’s the one having problems.\n\n2nd floor shower has a frozen PEX pipe which is sealed behind the wall…no access to see where the freeze is. Just a weak drip coming from the shower head at the moment. Sinks in the same bathroom are fine. No signs of a burst pipe.\n\nI called a plumber to come thaw it, but they’re backed up for who knows how long.\n\nShould I be worried about it bursting? And should I keep it dripping full blast (which is just a trickle right now)?",
            "Woke up this morning to cold water but no hot water. At first there was nothing coming from the hot water side. I turned the faucets on and now they have a very small trickle. I live in a single wife trailer that’s about 2.5 to 3 feet off the ground with underpinning all the way around. I can’t get under there to look it over due to an injury and won’t be able to get someone to check it until tomorrow or maybe even Sunday. With having a small amount coming out of the faucets from the hot side does that mean if I leave them on there is a chance they will thaw? Also does this mean they are frozen and not burst?",
            "I shut off the water last night and wrapped the spickets. Woke up this morning to spickets being frozen. What do I do next?",
            "Frozen Pipes, Sort Of.\n\nSo we live in Northern Tennessee (Springfield to be specific) and we endured a blizzard last night and ranging temp outside is like 0-5°. We wokeup with just our main level hot water not working and our master tub not working at all, although the washing machine and all of our upstairs hot water work fine. We see where it looks like the hot water pipe under the sink popped apart and we have that thawed and placed back together but still no hot water on the main level (aside from the washing machine). What even do we do?",
            "Sub-freezing temps in my area came in yesterday.  Today no water flowing into tankless water heater.  I suspect a freeze somewhere in the heater inlet pipe. Any tips or thoughts appreciated. For future freeze reference, would having one faucet drip with hot water prevent this? Thanks in advance.",
            "It's been roughly 16 degrees Fahrenheit for 10 hours. It is Never this cold where we live. We did not disconnect our garden hose from the outside spigot, and it froze.\n\nI turned off the water to the outdoor spigot. Put a heating pack on the garden hose so I could get it off.\nHose is now disconnected. The spigot is fully open, there's no water draining out. Is the water frozen in the pipes?\n\nThe spigot is directly on the other side of a heated room. If that matters.\n\nHow screwed am I? Are the pipes going to leak in spring?",
            "Frozen pipe or other issue?\n\nMy first floor shower which is on an exterior wall (1921 home) has very little water pressure regardless of the temp it’s at however the sink in the same bathroom has full pressure on the cold tap and the warm tap is barely trickling. Moreover when I turn the cold tap on the sink all the way on the shower gains full pressure again but stops when I turn off the sink. Any thoughts what’s happening?",
            "If my hot water was frozen and just now unfrozen - should I run the hot or the cold or both to keep it from unfreezing.",
            "The shower drain in our master bath is frozen, water just comes back up. All other pipes are working fine. I tried pouring boiling water down, with salt, baking soda and vinegar. Nothing is working. I’ve had a space heater in the room all day. What to do now?",
            "Hello! I’m in the Midwest dealing with these freezing cold weathers. My upstairs shower, which shares a wall with an attic space and was working fine yesterday, is not working today. The walls of the shower feel very cold as does the plate behind the globe shaped faucet. I was able to unscrew the plate and squeeze my hand thru the gap to feel the pipes and they are pretty cold. All other faucets are working fine. The temperature has been between -10 and 0 for 24 hours or so. \n\nDoes this sound frozen? Should we turn off the water to the house overnight should the pipe burst? Should we turn the faucet on over night in case it does burst to give the water an exit?It’s supposed to warm up tomorrow. \n\nThanks!",
            "I have a short bit (MAIN) coming out of the ground before entering the house. In that short bit is also a PRV.\n\nHere's a pic: https://i.imgur.com/yj51T8F.png\n\nHow would you insulate it? I had been meaning to build a little house around it with a lift-up roof\n\nHow cold does it need to be do F things up?\n\nColdest it gets here in Nor-Cal is 20F (rare) It's been colder, but very rarely",
            "Located in Chicago and first time homeowner. Left all the upstairs faucets dripping, but downstairs basement is new remodeled with new bathroom and existing utility sink line. This morning only th e basement is no-flow. Upstairs is perfect. Downstairs is nothing… we’ve used space heaters pointing below the sinks for hours today and no progress. The pipes we can feel through access points in the exterior wall do not feel frosted at all. Could it be something other than frozen pipes?",
            "the shower/toilet in our upstairs bathroom are very low pressure. They are both facing an exterior wall. No sign of leaks or anything. I started putting a space heater in between them (oscillating) and the pressure has gone up a bit in the 45 mine since. Have left shower running constantly and it is running hot water.\n\nAnything else I should do?",
            "Had a freeze the past couple days and the hot water in the kitchen stopped working. It still works fine everywhere else in the house.",
            "Suddenly this afternoon my kitchen sink started backing up. All other toilets and sinks in the house empty. And water keeps reappearing in the kitchen sink. Could there be a frozen pipe somewhere causing this?\n\nAlso, I have a garbage disposal attached to my dishwasher under my sink but both sides of the sink are backing up",
            "I’m out of town and a friend told me one of my outdoor faucets is dripping, has it frozen and what should I do or ask him to do about it? I put one of the foam covers on it before I left and have left my house heat set at 72F if that helps at all.",
            "Tried to take a shower this afternoon (today was the first day this year temps have hit 3 degrees (-15 windchill) and the water wouldnt drain. This is a master br shower, toilet and sink in this restroom work however the shower is not draining properly. Other two bathrooms and kitchen is draining properly it’s just the master br shower that is not draining. As a point of reference id used this shower everyday this week and it did not show any clogging issues kn the least (taking 15 minute showers sometimes to try to steam out my congestion from a cold i had) I thought maybe some water had frozen in this particular pipe due to the sudden temp drop but wanted to check with this thread to see if i should use other DIY options before just calling the plumber",
            "Last night we turned off the main water valve to the house and opened all faucets to drain as much water as we could from the pipes. we live in the south so the pipes aren’t insulated much and it was below 20°F for more than 9 hours last night. \n\nThis morning, when the temperature was around 29°F we decided to turn on the water again to cook and shower while keeping the heater running so they won’t freeze in the meantime it goes above freezing again. \n\nHowever, when we re-opened the main water valve, nothing happened. Normally, we can hear the rush of water re-entering the pipes but this time it was silent, as if we never opened the valve in the first place. \n\nDoes anyone have any ideas as to why? We think it may be because a pipe leading from the street into the main valve froze up but I’m also worried something happened with some pipes in the house",
            "Hey y'all, \n\nFirst off, thank you for any help.\n\nAs most of the country is experiencing a cold snap at the moment, so is San Antonio. Luckily for us it is a 40 hour or so cold snap so it isn't as horrible as in other areas. I've prepares by wrapping up my pipes with some towels and making sure most of my sinks have a slow drip. However, just now, my kitchen sink is having trouble running cold water. I am getting excellent heated water pressure but absolutely nothing is coming out on the cold end. \n\nThe cold snap is going to be over tomorrow at 12 pm so I am just desperate to make it to that time without worrying that something horrible is going to happen. \n\nSo, is a frozen pipe realistic given all of this or is it likely a smaller issue?",
            "Woke up this morning and none of the faucets would turn on. Cold front came in and It was around 12 degrees last night. Shut off the water main in the garage and waited about an hour, turned it back on and was able to get water to flow from all faucets and showers, but cold water only. It got up to 25 today, but still no hot water. I have a tankless water heater mounted inside an exterior wall with a metal covering. I power cycled it, and all of the lines are insulated, but I can’t tell if any of those pipes are frozen or if there is any damage to the tankless. House is new, only 1 year old. My suspicion is that it is an issue at the tankless being that it is the most exposed to the cold weather, but not sure.\n\nLooking for a few pieces of advice. Should I go ahead and shut the water off before going to bed tonight or let all of the faucets continue to drip? Any thoughts on where the problem might be based on my described situation? Thanks in advance for any help / advice. I’m at a loss at this point.",
            "We had the cold dripping all the time. Hot froze. Realized a stream works better than a drip. We now have one sink streaming hot and one streaming cold just in case. We had success with jacking up the heat in the house to 75, opening all the cabinets under the sinks, running the bathroom heater vent, blowing hot air under the sinks by using electric heaters and blow dryers on the pipes, and then installing electric heat tape on the most likely culprit which we got at a local hardware store. Within ten minutes of the heaters and heat tape both going we had all our hot water restored after trying over 24 hours. The culprit was inside the wall between the bathroom and kitchen as it used to be an exterior wall. The cold was never frozen but the hot was. Hope this helps someone!!!",
            "Ok, so I woke up this morning and the cold water was working but hot water was not. I opened the hot water faucets in my house in hopes of a miracle.\nTonight I noticed that the cold water to my shower was off so turned it on so the pipes to it wouldn't have a chance to freeze. When I turned the cold water on my bathroom and kitchen faucet both started having water come from the hot side. I let it run but it never got hot. Any ideas what could be causing this? I'm not able to get under the house to check out the pipes and won't be able to get anyone until tomorrow or maybe even Sunday.",
            "I've got a tankless water heater in my basement, with a condensate pump line that heads out through my wall to the outside. The portion of the line that's outside is--you guessed it--frozen. And the pump sounds like it's trying to work overtime on account of the clogged line. \n\nQuestions: can I just turn off the pump? What happens to the heater if so? Should I try to declog the line, e.g. by pouring hot water over it or something? \n\nTo be safe for the evening, I'm thinking I'll turn off the heater and the pump, but wanted input. Thanks.",
            "Not sure if this is frozen pipe related but it has started the day after my part of the US was hit with the negative temp weather.\n\nI found out today that when my kitchen sink is set to hot no water flows. If is flipped to cold the water flows fine and is VERY COLD (I assume because of the winter blast were getting right now).\r  \n\r  \nThe hot water works in the bathroom sink and in the shower. I know won't be able to have anyone come over till the holiday weekend is over but is there anything I can do to try and fix the issue? I'd like to actually wash my dishes after doing Christmas cooking as the dishwasher I have is currently very ineffective at cleaning anything.",
            "I’m in Nc where we have unseasoned cold temps. I went to turn the water off to the house and then tried to drain the outside spigot but it was already frozen outside. Water inside the house is fine. The hose is disconnected from the spigot outside.\n\nShould I drop my faucets indoors or turn off all water?",
            "Frozen toilet supply line and hot water line to sink.\n\nPrevious owner installed an “addition” off our kitchen to make a 1/2 bathroom. No insulation, uneven floor and everything from waterlines to electric exposed below in our entrance room to the unfinished basement. Bathroom is fuxking freezing year round. I used the heat tape shit and never had an issue but realized I did it on the cold water line only. Also, on the line for the toilet but the problem is I got a ton of stuff shoved in voids below the bathroom so I don’t think the thermostat is dropping below freezing to turn on and keep the toilet water from freezing. \n\nI’m trying to go to sleep after the worst day ever. I don’t care if i can’t use that bathroom for a few days. I have a space heater running in there to warm the room a bit but can’t leave it on all night. I’m just trying to figure out what i can do to go to bed and not wake up to tons of damage. All the lines are pex so I feel that’s atleast good less of a hassle to fix it they break. Should I just leave the sinks hot water handle cracked and calm it a night? Or do I really have to pull an all nighter turning a heater on and off and using a blow dryer?",
            "Sounds like I need to load up the van with propress and pex and haul ass over to the midwest. 🤑🤑🤑",
            "Pipes are frozen in attic I think.\n\nThe house is on a slab, however the back bathroom has had some kind of re-piping at some point, not sure when/why it was done. The piping for the shower and bathtub goes up through the attic while the rest of the house is I guess in the slab. All of the water to the house works except that back shower and tub.\n\nThe tub has cold water all the way, zero hot. The shower has zero water at all. In the attic everything is covered with fluffy insulation, everything. There is no access to the pipes from above, no wall access, nothing.\n\nI believe they froze last night? But didn’t know until tonight when I went to take a shower. I have since opened all the faucets (though not sure if the main faucets should stay open, since there isn’t an issue there?), I turned up the thermostat for the house to warm the house more, placed a space heater in the bathroom. None of this has worked at all. The cold water will trickle in shower but has been open and running for 8hrs now with no increase and the hot water to shower and tub have been fully open. It’s currently 10f and won’t be above freezing for days.\n\n1: how do I get the pipes warmed up enough to flow with zero access?\n2: how likely is it that these pipes burst?\n3: shouldn’t the cold water at least be running a little better by this point?\n4: Do I need to leave the other working faucets open?",
            "So, of course, it’s past midnight on a Saturday, and Christmas Eve, and my husband is afraid our kitchen pipes are frozen because they are not draining. We don’t recall pouring anything down the drain that might cause a clog, and Draino hasn’t helped, but we have no other common signs of frozen pipes, either. No sounds indicating ice expanding and contracting, all of our faucets are working fine. What are the odds that that is the case? Is there anything we can do tonight?",
            "When trickling, should I point the thing toward hot water or cold water?\nAlso, no water coming out of faucet when pointed toward hot, but only for 2 sinks in same bathroom (bathtub hot side only comes extremely low pressure). All other faucets seem to work fine so far.\nSuggestions? First time homeowner.",
            "Keep getting told by trailer park my pipes are frozen but I ran a salamander heater underneath and can confirm it’s not. Is it possible it’s frozen further down the line?",
            "OK to put electric heat strips on tankless water heater pipes inside the enclosure to help thaw process or is that a bad idea? It's a Rinnai. Large one level house in the South on a slab. 2 Tankless water heaters. One feeds everything to master bedroom (one end of the house and the sink, shower etc is fine) the other feeds other end of the house (twin bedrooms with Jack and Jill bathroom, hall 1/2 bathroom, kitchen, laundry). Kitchen no flow at all, a trickle at Jack and Jill sinks and hall 1/2 bath sink.",
            "Hey everyone, my wife woke up this morning to a loud bang and is now convinced the pipe feeding the backyard faucet is burst. The water going to the backyard was turned off a few days ago, but a hose was still attached and the faucet was turned off.  When I turn the water on and open the faucet, no noise and nothing comes out. \n\nDo pipes make a loud noise when they burst? Is it possible that the water is just frozen and that’s why the water isn’t running out of the backyard faucet? \n\n🙏 and merry Xmas to all",
            "Upstairs bathroom taps don’t work, downstairs do. I turned the heat up in the house, put a space heater in upstairs bathroom, opened taps…anything else?",
            "I live in a city in the NE and temperatures got cold (6 degrees). I’m home for two weeks for the holidays and turned my apt heat off. I live in a building, though older, I’m on the second floor and the two residence next to me are permanent residents so their heat will likely be on / running water. What is the likelihood of my pipes bursting? I put an emergency maintenance request in for someone to check on it/ turn my heat on and am waiting for them to get back to me.\n\nIt is my first time living alone … safe to say I’ll never make this mistake again :,)",
            "GM plumbers of Reddit. I bought a new house with what I believe is a tankless water heater. Yesterday morning I woke up to no hot water running anywhere in the house. I checked a few things and couldn't get it going again. I think it's frozen. I called the plumbing company and they said there is nothing they can do for me just now and the pipes are likely frozen. House is hot but attic and garage are definitely areas prone to freezing. I think that may be where the issue is. \n\nIt's my new house recently bought so I'm still getting used to all the noises but I think I'm hearing pipes burst. Likely my imagination is running away from me. I have a family Xmas party today. I'm worried if I leave the house I won't have a chance to turn off water and could come back to flooding. What would y'all do in this situation? I live in Texas and weather is to get above freezing today.",
            "Help I'm an idiot (and a new home owner)\n\nI don't think I've ever been this confused in my life ...\n\nThe hot water line to the kitchen sink appears to be frozen, but I can’t figure out how/why, and I’m not sure how to confirm it and fix it.\n\nThe cold line is fine, and both hot and cold in all other rooms are fine. I went under the house to look for signs of ice or leaks and didn’t see any. It’s warmer down in the crawlspace than it is outside, the floors are insulated. \n\nI am stumped to say the least",
            "We have a single control shower faucet (the farther you turn it, the hotter the water). This is the second day of sub-zero weather. We have running hot and cold water everywhere in the house except the shower in one bedroom. It only provides hot water at a low flow rate, which leads me to assume the cold water pipe in that one area may be frozen.   \nHow much at risk am I for having a frozen pipe break/leak?",
            "Framer here, I have a double wide mobile home I'm fixing up and the pipes have frozen and busted on one half of the trailer.\n I have located the busts and fixed the broken pipes with the tees and couplings needed, and reinsulated the whole space.\n\nHowever, I turn the water back on and I still only have water to one half of he trailer. Which i did before, just didn't have water to the kitchen and still don't.\n\nNo signs of busts under the kitchen. \n\nNote- my shutoff valve is pretty rusted, the handle could just twist off to a small amount of force when turning, so I've been using wrenches to turn the bolt on and off on the valve so I didn't break the handle, buttttt the whole shut off valve and nut is spun out. I don't hear water running so I just thought the bathroom water was being received from the hot water heater(because it still operated when the water was turned off) I have since turned the water heater off, drained it etc..\n\nAnother note - my ground water intake pipe is a blue pex underground that comes up and connected to a big iron elbow thing that has the shut off valve on it. I thought the blue might be frozen so I pointed a space heater at it for a couple hours and still no water to the kitchen.there was a 4 inch diameter ice block around the shut-off valve, in the iron.\n\nI am very confused as to what I should do now and I am trying to fix this as fast as I can. Thank you plumbers of reddit in advance\n\nMy plan today is to search around for more ice cicles coming out of pipes near the kitchen",
            "Guys I think my pipes are frozen but my water heater isn't working either does this usually happen?",
            "Woke up to discover that I had a hot water pipe bust. Took care of that, turned off water to the water heater and turned the heater off. Left the gas on so I can use the stove, etc. nothing I can do but wait until stores open Monday for supplies. \nBut one thing is puzzling me. In the master bathroom, I have double sinks. When I turn one on, the other turns on too. Any ideas what this may be? Thanks in advance.",
            "We have a single toilet pipe that froze. Should I shut off the toilet supply line while waiting for it to that’s or keep the supply line open?",
            "Frozen Pipes\n\nHi all, I hope someone will have some wise words for me that can help. \n\nThere is no water running in the sink (master bathroom), but everything else/everywhere else works properly. We tried to figure out what caused it and we came to a conclusion it was the frozen pipes. However, the pipes go down and we can’t reach them to thaw them with a hair dryer. I think the root of the problem comes from the very beginning (in the basement) where I found my insulation is bad (there is yellow foam - fiberglass - and a pipe comes out of there and I feel the cold air blowing through there because the area around the pipe doesn’t seem to be covered well by it & the pipe is very cold when touched) - this is just a guess. \nDo you recommend me using the hairdryer there and should we let all water drip a bit everywhere?\nWe turned the heat to 80f…\nAlso, we can’t locate the main water valve in the basement and I am just hoping there won’t be any leakage… (we’ve been living here for a year now). \nAny help is welcome.",
            "[https://imgur.com/a/yGCczXW](https://imgur.com/a/yGCczXW)\n\nRan machine yesterday and forgot to keep oil heater on overnight. Temp in the attached but non climate controlled garage about 35 currently. But worth the cold spell it’s been 0- -3 at night here in KY (currently 6degrees out now).\n\nHave the oil heater and now a space heater running blowing behind the washer.I believe it is the braided lines frozen as they are “stiff.\n\n”Water is off on the valves, but my question is, what is the best play here next?\n\nContinue to let these thaw?\n\nUnhook the supply lines?Run to Lowe’s and get shorter ones ( I know these are much longer than needed)?\n\nAny input is greatly appreciated.\n\nFYI these are pex lines behind the wall. I had them installed this year.",
            "We have a tankless water heater and that’s located outside. This morning, I tried to start the shower and nothing came out. We live in the south and the heating unit is located outside. Last night the weather was about 25*F. Were we suppose to run the hot water? The cold water works fine with the sinks but it’s weak in the shower.",
            "If PVC has a small drip when frozen will it burst or leak when thawed? Edit: Elbow joint",
            "Temperature dropped under 40°F in an under the stairs enclosure in my house (I have a temp sensor). I'm away from home for the weekend and live in Downstate NY. Not a conditioned space but surrounded by conditioned rooms on 3 sides and the heat is at 55°F. Risk of pipe freeze and bust? The main water shut off and pressure valve are in this enclosure. Also one pipe that goes to outside winterized hose spigot.",
            "Frozen Spigot with Cover\n\nNew homeowner here! \n\nI winterized my hose bibs then put insulated covers on them. Now the front bib still appears to have a small leak after closing the shutoff valve in the utility closet. It’s 8 degrees here and the cover ended up filling up with water which spilled out (it looked like an ice waterfall). It wasn’t a ton of ice but enough to concern me. I was able to defrost the cover and remove it. I turned the spigot to on but nothing is coming out so I am assuming that the pipes are frozen. Not sure if there is any way to defrost them as they are inside the garage walls. Any advice on what to do now? How would I know how deep the pipes have frozen?",
            "Our Noritz NR98SV tankless water heater lost power last night for 7 hours in 15 degree weather (installed in the attic). With no flow this morning, I started by flipping the breaker and power cycling it. When that didn’t work I went upstairs and found a small icicle hanging from the unit. Best I can tell, the drip was coming from the black/white plastic component in the picture [(https://imgur.com/wD4KCmG](https://imgur.com/wD4KCmG)).\r  \n\r  \nAt this point there is no active dripping, temp is in the 20s, I can feel heat radiating from the unit, but no flow or error codes. Power has been back for 2+ hours.\r  \n\r  \nWhat am I likely looking at here? Damaged component inside? Just for kicks I slightly opened each drain valve to make sure water was liquid on both hot/cold legs outside the unit and it is.",
            "I have a huge concern and to be honest there’s nothing I can really do. I purchased a home December 1 is Augusta, GA and I’ve been worried due to this winter storm. I’m concerned of any pipes freezing while the house is vacant. The realtor did set the heater on to 60F so I’m hoping this is enough to prevent the pipes freezing in doors. My realtor is out of town so he cannot check the home until he returns next week. I’m from California so I’m honestly not familiar with pipes freezing. Am I screwed? The home was built in 2018 if that matters.",
            "Hey everybody,\r  \n\r  \nHopefully someone can help me out with this situation because I am plumbing illiterate. We live in the South so don’t routinely deal with this kind of stuff.\r  \n\r  \nLast night we had a freeze and we ran our hot and cold water lines at a drip to hopefully prevent frozen pipes. Didn’t really pan out like we hoped.\r  \n\r  \nWoke up this am, and cold water would run normal, but no hot water. We have a Navien tankless water heater that is installed in an upstairs attic which does have some insulation. On looking through it, did not appear like any of the lines were frozen on the inside but the condensation line draining from the heater was frozen like 6ft in length up to the drain pvc pipe which also has some frozen water in it.\r  \n\r  \nHave been using a space heater among other things to warm up the attic, and later this morning the hot water has resumed working like “normal” (ie I don’t know if it’s truly normal right now although it appears that way). As the hot water began working again I felt like I could hear ice moving through some of the others but I am not totally sure about that.\r  \n\r  \nPlumbers cannot get out until next week because of the holiday. So my question is this: can we use the hot water and be ok doing so with the frozen condensation line (which does appear to be thawing)? What can we do different tonight to prevent condensation line/other lines from freezing since we ran hot/cold water lines last night? Thanks for any suggestions and help everyone. Hope everyone has a merry Christmas!!",
            "Lmfao. So many people on here with problems and no responses from any plumbers because they’re all out working on homes. Perfect!",
            "We live in the middle of the deep freeze.  Happily, we had a trip planned to a warmer climate so we missed it.  We turned off water and drained pipes before we went.  However, we are coming back tonight when it is still well below freezing.  Do we just turn the water back on or is there anything special we should do to avoid frozen pipes?",
            "New house for me this winter and also in Houston so wasn’t expecting much. Looks like the one faucet I didn’t cover may have frozen. I have an exterior faucet right where my kitchen sink is inside. This morning everything is fine except cold line to the kitchen sink. Anything I should do? Or should I just let it thaw?",
            "Live in mobile home. Water supply comes out of the ground about a foot outside trailer. Everything is PEX. We have it wrapped outside and heat trace. Water must have still froze outside because no more water coming out of faucet. I’ve turned off the water supply for now and kept open faucets. \n\nShould I turn off the electric water heater as well? I’m going to put a warm blanket and other things to see if I can heat up the outside lines. I def think it’s outside and I see no damage as of now. \n\nWhat steps should I take here besides waiting until it warms up?",
            "Our hot water is frozen and not working. \nWe left all cold water trickling - the plumbing websites I read didn’t mention to leave the hot running also. \nThere is a trickle when only the hot water is on, but the water coming out is cold. \nThis has been since 8am this morning at least. \nWe placed a space heater in our crawl space. \nI know there are worse problems, but we are definitely bummed.",
            "Woke up this morning and when I turn on faucets, plenty of cold water flowing. Turn to hot, nothing, all stop. Checked hot water heater, no leak, turned up setting to a bit higher, checked the pressure release valve and nice hot water came out of it. Looked in the attic, not a lot of pipe coming from HWH that is visible, not visible frost or dripping. \n\nI don't know, do I just wait a day for temp to warm up again? Middle Georgia, got down to the teens, high is 33 today. I'm a Floridian so I'm idk what next and google is useless it seems.",
            "Hello.\n\nI have a house that has PEX-A (Uponor) from the main hookup through about 3/4 of the crawlspace, then CPVC up in the heated spaces and the end of two lines (~10 feet of CPVC) in the crawlspace.  Does anyone here have the experience to say whether the PEX in the system should protect the CPVC line ends in the crawlspace from bursting, or will it not reduce the risk of rupture?  This is a house that I don't normally live at, so I'm trying to prioritize getting someone out to check the pipes.",
            "I have a frozen kitchen sink plumbing. House is slab on grade, texas, pex with some copper fittings. Rest of house is okay, just the one sink. It’s on an exterior wall.\n\nNow I ended up cutting into it to investigate. To my surprise, instead of pipes going through the back of the sink cabinet, through the drywall, then down the interior wall, they go straight OUT into the sheathing. Presumably they go down from there, between the sheathing and brick veneer. We have a bathroom with plumbing on an exterior wall and it’s not like this, it goes down in the interior wall and did not freeze.\n\nSo for the plumbers - WTF? How could this be allowed, of course it’s going to freeze as it’s outside the fucking sheathing. I’m trying to thaw it but what is my long term remedy here, how bad would it be to bring the pipes into the interior wall? Assuming I have to rip up some brick and some of the slab?\n\nPic of inside of cabinet and pipes going into sheathing.\n\nhttps://imgur.com/a/KIAjAtK/",
            "My kitchen sink does not have the cold water running, only hot water. I set my upstairs taps to drip, they seem to have both cold and hot water running fine. \n\nI tried to find where my cold water pipe is frozen, but it seems that this house has it run under the floorboards, or in the wall, or something. Once leaving under the kitchen sink, the water pipes are inaccessible because they run through a blocked-off, small empty space between the dishwasher and the wall. Then the next I can find them is when they come out of the tiles in the laundry room, only to disappear back into the tiles again. \n\nI have no idea where the cold water pipe could be frozen. I touched everywhere I could reach and nothing feels like ice. My pipes appear to be mostly some sort of white plastic material.\n\nMy house is a townhome. My power is working so the house is heated. But I rent, so I'm very worried. What can I do to avoid stressing the pipe or causing a burst?",
            "Cold water is working in kitchen and bathrooms but can’t get anything to come from the tub. When I try and turn to hot water in kitchen sink nothing comes out. Doesn’t seem like the line is frozen on the water heater and have hit the reset switch. Been almost 2 hours since reset and still can’t get anything to come out hot side. What to do?",
            "It just got really cold outside in the past 24 hours, so I'm assuming this is related to that. In the past we've lost total water usage during cold seasons, so I turned on a little bit of cold water on each side of the house. I didn't turn on hot, because I've been told that consistently running hot water could empty my tank, causing damage in the winter seasons. (after reading around on the internet, I'm guessing that's untrue, but I don't know because water tanks aren't transparent).\n\nAnyway, now only the hot water won't run. Sometimes I get a quick dribble, and then it stops. Cold runs fine, so at least it isn't the main. \n\nWhat do",
            "I have a pex system. \n\nI forgot to shut off water to one of my outdoor bibs. \n\nWhen I went to go let the water run, it’s too frozen to turn. \n\nAm I better off leaving water turned on to this branch, or should I shut it off?\n\nMy thinking is if I leave it open, then as ice freezes, the remaining water has somewhere to go. \n\nThoughts?",
            "i live in an apartment. during cold weather should i leave all the faucets dripping or just one?",
            "House is on a slab, we dripped faucets but we lost power for 4hrs last night and everything froze. No water coming out anywhere :( any tips?",
            "Sorry for posting this twice. I didn't see this thread, and then was told I should post it here.\n\nI was hoping for advice. As I type, it is Christmas Eve. I woke up this morning to find that the hot water line that leads to my kitchen sink has frozen. The cold line is fine, just the hot water line. I'm in the Atlanta area, if that makes a difference. It got down to 7 or 8 degrees last night, -5 with wind chill. I've been seeing the posts about the Mpemba effect. Good to know.\n\nThe pipe runs down near the corner of the house. There are kitchen cabinets (and walls) there, so the pipe is impossible to access without removing cabinets, a granite countertop, etc. There is little chance of getting a plumber out here until Monday (I need to go through my HOA. They just sent out an email to the community to stop contacting them about frozen pipes unless there is an active leak).\n\nI know that standard advice is to shut off and drain the water to the house, then to try to thaw the pipe. I currently have cabinet doors open and some space heaters pointed in the general area, hoping that it will raise ambient temperature in the wall cavity enough to thaw the pipe. I have not shut off the water, because I need to live here for the time being.\n\nI am trying to figure out what to do next. I've come up with a few options.\n\n1. Shut off and drain the water. If I shut off and drain the water, I can't host Christmas here, which was the plan. I will also need to sleep someplace else.\n2. Keep trying to thaw the pipe, hoping that because it is pex it won't have burst.\n3. Stop trying to thaw the pipe. It is unlikely to thaw on its own until after Christmas (it is getting up to 34 on Christmas, but probably less with wind chill). Host Christmas, etc. All other faucets, showers, etc., work fine, so that will all work fine. Shut off water after. Figure out what to do with the dishes later.\n\nIf anyone has advice, I'd really appreciate it. Thanks.",
            "The one section of pipe we couldn't insulate after our purchase this year due to placement burst. I live in a mobile home and right now pipes are bursting everywhere in the BC Vancouver general area, the roads are ice and I got a partially flooded kitchen. I had to resort to popping a hole in the wall at the floor from  the inside to outside as a drain in order to stop/minimize further damage. Everything is frozen around my trailer and getting to the area by vehicle from plumbers is atm is basically impossible. I don't know how to turn off the main line, it's an older manufactured home, I can post pictures of what I believe is the main line under the trailer but I can't stay in a puddle of ice water for more than 10 mins looking around and maybe I pray someone could help me, I am willing to pay someone here if they are able to help me in succesfully shutting off the shutoff, so I can repair the line.",
            "My pipes froze outside my mobile home last night. I just got cold water running again, but hot isn’t going. Not sure how that’s possible. Gonna try heating up the lines again maybe there’s a blockage somewhere still? I have an electric water heater. Is it possible it got drained? Is there a way to see if it’s empty? Idk what to do here at this point. At least I don’t see any bursts or breaks anywhere, it’s Pex",
            "This is a suspected frozen pipe. My fridge’s water dispenser was working yesterday morning, and stopped dispensing water some time during the mid day yesterday. It’s been around -3 F here. \n\nI did just now remove the hose at the faucet for the fridge, and when I opened the valve I was really hoping to get sprayed with water. No water came out. The line for my fridge’s water dispenser runs through an exterior brick wall, house built in 1968. \n\nThe water heater/hvac closet is an exterior access room on the back of the house and I did look in there yesterday just to see if I could see any issues from the very limited view of pipes and the like back there. No room full of water, so that’s about all I gathered from it. \n\nAm I missing something here? Should I be on the phone with plumbers to get them out before it get warmer and I have a flooded kitchen?",
            "We have an outside hose bibb that comes out of the wall about 8 inches. It’s given us trouble every freeze, but since we live in TX that’s only been 3 times since we moved in. The Bibb has cracked twice. Before this freeze we insulated it with several layers of fiberglass insulation, duct tape, rags, and one of those styrofoam house things. \n\nJust now we were sitting in the living room and heard water rushing suddenly. My husband ran to check the bibb and saw water spraying out of it. We turned the water off to the entire house immediately and took all the insulation off the bibb so we could look at it. The bibb doesn’t doesn’t seem to be cracked and the pipe itself seems fine. Or at least we can’t see anything. We turned the water back on to see where the leak was and it is no longer leaking. \n\nWhat could have caused that? What should we do now? Any advice would be super appreciated.",
            "Does it help to keep your internal house temp at a certain number if your have frozen hot water pipes?",
            "We recently bought our home in October. The garage was converted into our bedroom with a bathroom, sink and tub. The bathroom and hall to the room are elevated with subfloor. We have a slab foundation so no crawl space. The sink in the bathroom isn’t working because there is a leak due to the cold weather even though we left faucets dripping. It is PEX. leaking into the hall and bedroom which has carpet. We can’t shut off water to the house because of the risk of the other pipes freezing. Also not sure where the manifold is to maybe shut that off??? Plumbers won’t come out today or tomorrow as it is Christmas Eve abs Christmas. Not sure what to do here.",
            "Yesterday, I turned off the valve for my outside spigot, and no water came out when I tried to drain, and then I put a cover over it. I came outside today to see that water had dripped out and had been frozen underneath it. I looked at the valve again and water flowed freely when I tried to drain again. Did my valve break? If so, is it okay to leave as is if I keep the cover over it? All of the piping seems to be inside in the basement except for the spigot.",
            "Had cold water but no hot water flowing this afternoon - ran hot taps until it came through with a lot of sediment from the bathtub. had low pressure in both sink faucets until I followed someone's advice here to take the aerators off and clean them out. Back to normal pressure and hopefully okay. I'm in N FL with all exposed/uninsulated 1940s pipes . What a time to be alive, y'all",
            "My pipes froze in my entire house. I have space heaters in front of the kitchen and bathroom sink and a propane heater in the basement. I am still not even seeing a trickle after about 2.5 hours of this. Does that mean a pipe burst somewhere that I’m not seeing?",
            "I have no idea what's going on. \n\nTemps been below zero all weekend and this morning my showers hot water stopped working. My sinks are still getting hot water although it's taking longer than usual. But showers will start off cold get warm and somewhat hot for a couple of mins and then go ice cold shortly after. I have an electric tank less water heater (two year old house) and I've upped the temp on it to 135 Fahrenheit and still no luck. What gives??",
            "Bathroom sink pipes froze yest but thawed and work today...however, I'm having issues with hot and cold supplies now.\n\nThe hot faucet doesn't turn off fully (there's a tiny drip even when i turn it all the way off) and my cold faucet has water hammer when i go to turn it off. Any ideas on how to fix? Thanks in advance and best of luck to all!!",
            "Augusta Georgia here\n\nNo faucets in the upstairs or downstairs working at all, toilets won’t flush, showers won’t work. I assume it’s the main line/sewer line that’s frozen (was 11 degrees this morning). Is there anything we can do if it’s the main line?",
            "My water drain line seem to have frozen at the base. I'm in a new trailer home and with this cold front alot of people have been having issues with water lines freezing. I have both hot and cold water coming into my 3 sinks but nothing is draining.\nStory. I was taking a hot ass shower when the drain started to not drain as fast as normal, thought it was just a little hair clog, so I finished up and had to use the toilet and low and behold it dosnt go down upon flushing like it's plugged but there was nothing to plug it. I tried plunging both but they just caused the other to oscillate with the plunges. \nDoes anyone have tips for trying to get it to thaw that dosnt evolve getting a blast heater under the trailer? And don't say hot water, hot water cause it and freezes faster and there's already gallons of water in my drain lines",
            "Currently out of town, and had someone check on my house today. Everything is running fine, but then two hours later, my neighbor had her spigot burst. She checked on mine after hers burst and found this. I had another neighbor cut water off to my house then drain my faucets until we’re back late next week. He didn’t find any water in the crawl space when he turned the water off. Will I likely be okay, or should I have a plumber ready? \n[https://postimg.cc/87P69PfR](https://postimg.cc/87P69PfR)",
            "Any help for getting my water working? It’s Christmas and my water has been frozen for 5 days.\n\nI live in a rural area across the street from a lake. There’s a pump in the basement that sends a pipe under the concrete, under the road, and draws from the lake. It got to -32 celcius for 2 days and I think it’s frozen. My pump gets about 10PSI and just hums, no water in the house. Any ideas? No plumbers are coming out here on Christmas and my landlords are out of the country on vacation.",
            "Who is right and who is wrong\n\nHousemate/owner of home left yesterday/today for work, came back tonight. Day before leaving wrapped outside pipes(front/back gardenhose pipe) and opened cabinet doors under sinks in kitchen/bathroom.\n\nThey leave for work, I stay at home in case we lose electricity/water pressure. Freeze comes, we never lose power, we never lose water pressure. At some point the next day they call me end of the world 'someone in the neighborhood/down the street lost water pressure run and cut the water main off by the street.' Meanwhile we have water pressure. We have electricity. 'Sure okay whatever' after all that, I finally inform them, for the third time, we still have both water and electricity. They respond good.\n\nCome back tonight. 'When did you turn water back on?' 'Never turned it off, we had electricity/power constantly. Central Heat on 24/7 in the house.'\n\nIncoming conniption fit 'omg I can't believe you I TOLD you to cut the water off' 'I told you we had power and water pressure the whole time why would I cut it off' etc etc blah blah back and forth.\n\nShe's convinced we won't know for days/weeks if the pipes in the attic are broke or not(see: the pipes that still have water pressure and have had for days and are inside the roof of a house being heated by central heat, with faucets open and dripping 24/7), and also claims the outside pipes(front/back yard) were in danger despite being wrapped.\n\nWho is right, and who is wrong, with reasoning.\n\nMy argument, 'If you c ared that much you would have turned off the water entirely before you left.' 'We never lost power/heat/water pressure'\n\nHer argument, 'None of that matters, you should have unwrapped the wrapped pipes, turned the water off and drained them.'\n\nMaybe this question is petty but fuck me if I can't wrap my head around their side at all. Attic pipes should be fine with house heated at 70 24/7, other pipes should have been fine because they were 1) wrapped, and 2) any remaining water would have(in theory) been drained out of those pipes regardless from toilet flushing as the toilet pipes are lower than the outside pipes(?) which lowest pipes drain water out of closed higher pipes from what I understand.",
            "I have a zone on my beckett oil boiler that's frozen.  \n\nShould I leave the thermostat up so the circulator pump runs?  Or shut it off?\n\nI'm thinking of draining the boiler, and inserting a valve on the feed so i can keep it off until it thaws or to make sure I'm around when pressure is put through it.  Good idea?  I've never drained the boiler before.",
            "We're in Ohio where it's been 10 below for a couple of days now. Our dishwasher has not worked properly since the freeze and it seems to just not be getting water (tried to run it, found dirty dishes and an unbroken detergent pod). However, the sink right next to it is working fine, no drop in pressure or anything, so it might just be the inlet valve not opening to let the water in. The pipes in the basement right below it look fine, no obvious bursts or dripping, and they branch off from the sink supply lines about two feet before they come up. \n\nOdds of anything terrible happening if we leave the house for a few days of Christmas things? My gut is that if the pipes were going to burst, they would have by now, plus it's starting to warm up. Any advice?",
            "Woke up this morning with a backyard full of slushy water. I’d insulated all of our outdoor spigots with towels/duct tape/trash bags before temps got low. I’m now trying to figure out if I have a burst pipe underground or if it’s possibly one of my neighbors. I have no loss of water pressure inside the house and the water is coming in perfectly normal,  k discoloration or smells or anything. Any advice on how to figure out if this could be a burst underground pipe?",
            "Hopefully this isn't super bad but my brothers condo in Atlanta is having an issue. All the cold water in the house is working. All the hot water is working everywhere except in one sink in an upstairs bathroom. No visible leaks (yet). He has a little access panel outside that bathroom but it isn't easy to see in but what he can see doesn't seem to be cracked/broken. He is running a hair dryer on it just in case it is frozen. Is there any chance this isn't a busted pipe? I know this isn't much to go on so any help is appreciated! Merry Christmas!",
            "One of the heating zones in my beckett oil burner is frozen.  I've turned off the the infeed to the heat zones right before the Taco Fast Fill Reducing Valve.   I did this so there isn't a flood if the pipe cracks since there will be no external pressure feeding the heat zones.\n\nI'm keeping a close eye on the pressure gauge expecting it to fall when it thaws.\n\nCan a pro tell me,  what are the odds this pipe is going to crack and can/should i do anything else other than just stare at the gauge?\n\nWhat would you do?",
            "As far as prevention, does heat tape really work? Do I leave it on all year? And how do I find a diagram of all the plumbing in my house / know where to put them?\n\n(I know my mainline is in my garage (not insulated/heated) and I have some lined in my attic, but I don’t know where else to look)",
            "Houstonian here! We’ve been going on a 3-day hard freeze (was worse on Thursday-Friday) but this morning when I woke up I noticed my two toilets both upstairs and downstairs are not flushing despite all other faucets working and temps are now in the 40s with the sun out. The problem is that the tanks are not refilling. The only other problem is that the pressure in faucets have been low which has been reported around my area. I checked for any leaks outside but did not find anything to my ability. Right now I have a space heater going in the bathroom downstairs. Any other idea on what to do?",
            "Anyone with experience thawing a main water line from a well to the house? I think I know the problem area, dug up the pipe and have been using a heat gun on it for hours. No water since losing power for 30 hours. Temps dipped below freezing. Water lines inside are fine. Power came back on and the well pump won’t pull any water in. I don’t even know who to call for something like this.",
            "Help please: not sure if my pipe is frozen or not. Kept all Faucets dripping in my home which worked great, but forgot to do so in the bathroom tub.  Bathroom sink has warm And cold water running and so does the kitchen. Bath tub has cold water running but no cold water. Checked to see if any pipe was frozen and can’t locate one. The pipe to the hot water that goes to the bath tub is warm as hell. So I’m not sure if the one pipe is frozen or something just be wrong with that faucet not related to it freezing. Also have space heaters on on bathroom and where my pipes are and temp in my house is about 72 degrees.",
            "Sprinkler system Backflow valve cracked. No water coming out cuz I have the valve off. But I need to replace valve. Do I shut the water main off by the street?",
            "All of the plumbing in my townhouse is fine, except for one side of the kitchen. It's the only wall that's not interior, and has plumbing. How do I get my one pipe thawed? I've turned the heat on, with a spacs heater pointing towards the cabinet, and nothing. Is it worth calling a plumber?",
            "Not sure if this belongs here. I don’t believe I have frozen pipes but this just started happening during the cold snap. I have a tankless water heater in my attic. Water started collecting in the drip pan and I can’t find where it’s coming from. Hot and cold works fine with no evidence of frozen pipes. Tank was installed less than a year ago. Is this something I should be concerned about?",
            "SOMEONE PLEASE HELP \nI live in a camper. It's been about -4° F for three days. The drain pipe froze and burst but is still frozen. This pipe drains everything from sewage to sink water. It's still frozen, so there hasn't been any flooding yet. Temps are going back up starting in the morning, so it is gonna unfreeze in the next eight hours (maximum). What do I do to prevent a flood? My man has all tools, stuff for soldering (I read online that's a common fix, but that would melt it, right?), he can do it if he has the guidance. Someone please, please give us some guidance. Thanks in advance, happy crimmus",
            "I just woke up at 2AM to mine being frozen even after keeping the faucets and bath dripping. Now I only have flow from flushing the toilet and the sink and bath in the main bathroom but nowhere else has any water. I am completely lost on what to do, I have no idea where our pipes are located other than in the crawl space which is very hard to get to. When shining a light and listening I think I can hear water draining through the pipes somewhat and do not believe I hear any dripping.",
            "I don’t know if it’s frozen pipes. It’s been very cold the last three days; it was 6 degrees Friday night but nothing froze. Water was flowing from all taps normally yesterday morning but after I got back a couple hours ago after being out of town all day, none of the cold water sides worked at all and all the hot water sides were coming out cold. There is no flow when I flush the toilet. I don’t know when it started. I live in an apartment. What could be wrong?",
            "So our house is getting renovated and some new pipes to our kitchen sink / dishwasher seem to have frozen. \n\nThe only thing hooked up to the pipe is the dishwasher at the moment and when we tried to run it an “intake error” flashed up. The new pipes run through the garage ceiling so we think they may have frozen. \n\nThere is no faucet connected for me to turn on so I’m not really sure what to do. Any advice?",
            "My shower hot water gets hot for a few seconds, then it gets cold, then it gets a little warm. Are my pipes frozen?",
            "So yesterday morning around 6 am, woke up to frozen pipes. Pipes all thawed by 3 pm. I have both hot and cold water from the bathtub and bathroom sink, but only cold water from the kitchen sink. No hot water at all and dish washer won't run because of no hot water.\n\nMaintenance isn't answering regular line or emergency line. Just wondering if this is something that needs to be waited out until it gets above freezing (currently 29 degrees here) or if I need to call a plumber or keep trying maintenance for my apartment.",
            "So down here in GA during the Christmas freeze. Had all my taps running and all are still except the 1 outdoor one I forgot to cover until the second night of the freeze and it's the only one that won't come on. Now that it's warming up should I cut the tap slightly on to relieve pressure as it thaws to hopefully about a burst pipe or should I keep it closed?",
            "How long does it take pipes to unfreeze on their own? Since around 3am on 12/24 I have only had hot water. There is no cold water coming out of either sink, shower, or filling toilet tank. I'm not sure if there is cold water coming into the hot water heater so I've been limiting water use as much as possible. \nThis is my first winter in PA. I used to live farther north where plumbing was insulated and winterized. Landlord told me insulation wasn't necessary on the pipes because they are PEX. He claims they won't burst, and will unfreeze on their own after 72 hours. He says he can't do anything. However, I don't know if I should trust him, he's lied to me many times before. So I'm just wondering if all this is true? I feel like he could have done more to winterize the pipes and prevent this, and 72 hours sounds like a really long time.",
            "I don't have access to the frozen cold water line into my bathroom. What is the best way to thaw a frozen pipe that I don't have direct access to? I just cranked up my house thermostat to 80 and also put a space heater in the bathroom. It's been frozen for almost two days.",
            "Hi Plumbing Reddit! First time posting in this section. Yes, I have a question about frozen pipes. \n\n\\- Location, Maine. Yes, Maine, where the power is out. \n\n\\- Issue: Situation: Single Level residential Ranch Style home with finished basement. The well was turned off and the house left vacant. Water remained in the pipes, but well was off. The house lost power, and this is unfortunate, as the temperatue is normally controlled via \"Nest\", but since the house lost power, The Nest became inactive and shut off, with the house unable tbe remotely monitored for temperature control. \n\n\\- As of this morning, the house temperature is 32 degrees upstaris, and temperature unkonwn in the basement (neighbors checked an analog thermometer left in the window of upstairs bedroom). \n\nQuesiton: If the house's pipes are frozen, are you simply able to turn the heat on? Or is there a special process you must go about when turning on yoru heat, to start reheating your house?\n\n&#x200B;\n\nThank you in advance!!",
            "I live in a 100 year old house therefore my washer and dryer and hot water heater is outside in a closest like room but does not have insulation. I haven’t done laundry in probably 4-5 days but do I have to worry about my washer and water heater freezing??",
            "My main shutoff to the house,my side of the water meter, the handle just spins, it never closes.\n\nIt looks like the city side of the meter has a quarter turn valve, with loops (for locking out, I assume). Still a holiday, city offices are closed, any way I can close the city side valve myself? \n\nImage:\nhttps://postimg.cc/ThzJ5ZTH\n\nI had the cold line to the water heater break, but just after a valve I can shut off. It's holding at the moment while Im waiting for the cement to dry on the replacement fittings, but it's below freezing again tonight, and I'd really like the house shut off if possible.",
            "Advice for the evening.  Help, I had a burst pipe in my garage.  My water main is shut off and it is going to be very cold tonight.  What about the other pipes in my house??  ANY Advice, besides cranking the heat?  I am worried about other pipes bursting tonight!  I know you guys are busy so I am not sure this will be answered; thought I would try....",
            "[deleted]",
            "Help, I had a pipe burst and the water main must remain OFF until I can get a plumber.  My worry is the pipes in the rest of the house freezing up because the water is off.  It will get to around 26 tonight.  I have the heat cranked and the cabinet doors open.  Is there anything else I can do??  Should I run out and by RV safe antifreeze??",
            "Help, I had a pipe burst and the water main must remain off until I can get a plumber.  I am worried about the other pipes in the house freezing tonight.  I've got the heat cranked up and the cabinet doors open.  Is there anything else I can do?  Is it necessary to put RV nontoxic antifreeze in the toilets??  Any advice would be greatly appreciated!!",
            "On a well system in a historic house, water line to main house froze Friday. Kept all faucets/cabinets open, turned off water supply and well pump, basement fairly warm. All pipes inside the house insulated and checked before the freeze. Got the water line unfrozen with a hairdryer today and had running water in all faucets.\n\nLeft the house for a few hours, came back to the dishwasher dumping water out of the front (we did not turn it on before leaving the house). We have dried as much as possible, have a dehumidifier going in the pantry where most of the water drained into the carpet. Some water in the basement, the threshold from the kitchen to pantry may have a small gap allowing water to leak through.\n\nShould I turn off breaker to the dishwasher and pull it out by to see if there's water standing underneath? Turned off water supply to the dishwasher. Still a lot of standing water in dishwasher but we've been sopping it up with towels. Everyone's booked of course.",
            "Help, I had a pipe burst and the water main must remain off until I can get a plumber.  I am worried about the other pipes in the house freezing tonight.  I've got the heat cranked up and the cabinet doors open.  Is there anything else I can do?  Is it necessary to put RV nontoxic antifreeze in the toilets??  Any advice would be greatly appreciated!!",
            "been without water since friday went to my main pipe under my place monday and  unthawed it with a hair dryer every few inches 15minuets each time yet 4hrs later still no water sometimes when i turn the sink on it would trickle nothing else could it be the citys pipe thats out and not mine",
            "Hey all. I’m not sure if this is a frozen/burst pipe problem or not. I removed hoses from both outdoor spigots several weeks ago before the freeze, but I have never been able to find individual shutoff valves for them inside so I haven’t done that. Attached is a video/picture of the dripping/leak in my house right near the shutoff for the entire house. It also is right below one of the external spigots (in our basement). Note that this is the only thing leaking and no pipes around it feel wet either. Would love to hear any thoughts on if I need a plumber for this or if it’s a simple fix? Thanks in advance! [plumbing issue](https://imgur.com/a/C12odxT)",
            "I have a weird situation:\n\nI live in Arkansas and last week a few of my faucets stopped running due to frozen pipes. I believe these were all faucets which have pipes running along the outside brick.\n\nNow the issue…I had some water leak from a second floor bathroom which dripped down through my first floor heating vent as well as through a chandelier. There is also some water staining in a linear pattern along the same pathway (the vent and chandelier are lined up with a rafter presumably).\n\nShutting off the upstairs water stopped the dripping. But as soon as everything thawed, the water runs fine with no dripping.\n\nThis has happened once before during a freeze and a plumber knocked out some drywall but could not see the pipes due to the presence of a plywood subfloor. Since it wasn’t leaking we left it alone.\n\nWhat could be the source of a leak that is only present when a pipe is frozen? Could it be a joint that expands when there is ice in it? Or a tiny tear in the pipe that only is apparent when there is ice?\n\nBefore we go knocking out a subfloor I figured I would ask the experts:)\n\nPS I don’t know what this piping is made of since I cannot see it.\n\nThank you all,\nG",
            "Before the freeze, and before leaving to visit relatives, I had shut off the water and drained the cold water lines by opening the cold water faucets.  However, I neglected to open the hot water faucets.  Should I still be worried?  Or is there enough relief in the plumbing system from having drained the cold water lines?",
            "How durable is PEX for freeze and thaw?",
            "pipes burst in basement ceiling.  1 inch of water. Will shop vac the water out today as much as possible. water has now been shut off at street level. \n\nShould I turn on the heat or will this cause mold? temps outside are 30-50ish. night/day",
            "Had a Haller Enterprise plumber come in to fix a “burst pipe” and said that a copper union was what was blown out by the cold. He’s removing the union altogether to keep it from happening again, changing the piping to PEX and replacing some valves that broke. \n\n$900. With a 1 yr guarantee.\n\nDoes that seem reasonable? We’re first time homeowners. \n\nSecondly, I feel like this might just be a bandaid? He might fix that bit, but maybe further down the line there’s another union that could possibly break too? This was from an added powder room, so I’m not sure how different that is to the main home lines. And if we should be prepared to PEX the whole house?",
            "My kitchen sink pipe burst this morning. I was able to locate the water main for shut off but now I'm confronted with another problem, what to do about the pipe? Money is extremely tight, is it possible to shut off water just to the kitchen sink in the interim? If not, do I have any options besides paying for an expensive plumbing bill?\n\nPlease help :(",
            "I have one pipe in my entire house that runs along an exterior wall.  It froze during the cold.  The pipe is inside the wall.  I was able to get it unfrozen by closing the door to the room it runs along and running a space heater in there. \n\n&#x200B;\n\nThe question: Is there any kind of improvement that can be done to prevent from happening again?",
            "Turned the heat off in my sisters apartment bc i lack common sense\n\nI spent the night at my sisters nyc apartment in gramercy and she wasnt there, i turned the heat off this morning, friday, without realizing the pipes could burst. It has not been super cold, ranging 40s-50s throughout the day and it will stay like that this weekend. she will be back sunday, new years day. Please tell me it’s gonna be ok and her pipes are not gonna burst😆",
            "Ok so we are in Dallas, TX.  Went out of town for holidays, but turned off water at main valve and drained pipes before leaving because we knew it would get below freezing. Pipes are in the attic, which was just fully (and excessively) insulated this summer, including all external walls, floors, and pipe wraps. Somehow we get back, turn water back on (temps are back in the 60s here now) and we had water spraying from two completely different spots - and find one pipe burst down the side, not even at a joint.  Other one broke at the joint.  Note - no water anywhere until we turned the main valve back on.\n\nMy question is - how or did we fuck up?  How could this happen with no water in the pipes?  Did it freeze and break then, or did something happen when we turned water back on?  How can we avoid this again?  We thought we did everything right....",
            "Hey all, I live in Ohio and we had a winter storm last Friday where it got down to -7 with even colder wind chills. Unfortunately I forgot to drip the water in my trailer, it's been a whole week and I've pretty much done everything I can think of to unthaw the lines. My water will only come out of one faucet at a time at a steady drizzle and will build up pressure when I turn it off for a bit but after it comes blasting out for about 30seconds it returns to that small drizzle. It is now 60 degrees out and I can't really find any lines under the trailer that are that cold tbh. Pls and thanks for any help I'm desperate",
            "Had a broken sharkbite connector for 3/4\" PEX to looks like PVC buried in front yard.  Any suggestions for a fix?  Https://I.imgur.com/w03Glbn.jpg",
            "20 year old homeowner here, im quite inexperienced in homeownership. I literally have NO water running anywhere in my manufactured home. Its been a few weeks and at first i was able to use the toilets and flush it down with buckets of water but then all the sewage just came back up through the toilet, so now i have to run to my nearest store to use the bathroom and i have no money or ideas to help myself. I have a well and septic tank in my manufactured home, any ideas on what my problem may be? I was worried about frozen pipes but i cant even access my pipes to warm them.",
            "What material can you have your pipes made out of to help prevent freezing? Or is PVC the only option. We are building on a mountain top. Trying to be proactive.",
            "I was not able to shut off water to the 1/2 bathroom extension pipes in time before coldwave hit last week and my hot water pipe froze. I tried dripping faucet when I got home, but the hot water pipe was frozen. The hot water pipes to rest the house were ok and hot water was flowing correctly there. Once I shutoff water to the pipes, I left both faucets open to drip any water out and flushed the toilet tank/pipes too. When the temp rose a few days later, I opened the water valves and both faucets are running now. \n\nHow can I check if the freezing did any damage to the faucet or toilet pipes? The extension is on stilts, but the underspace is surrounded by wooden lattice fence, so I cant check the pipes from underneath.",
            "I don’t have frozen pipes but it’s relatively cold in California right now.\n\nI live in an apartment (not luxury at all)\n\n\nBasically:\n\nWhen it’s hot - the shower waters hot and struggles to get cold\n\nWhen it’s cold - I don’t get warm shower water.\n\nIronically the faucets can still hit hot/cold anytime but not the shower….\n\nProperty manager says nothing they can do but I don’t trust them.\n\nAny ideas?",
            "I saw a video explaining pipe failures as a result of ice the other day. The video explained the actual ice isn’t what causes the pipe to fail but the resulting pressure that builds up is the reason. This essentially turns your pipe into a hydraulic line and it fails. That’s the reason you open a valve so the pressure can escape.   \n   \nThis made me wonder why they don’t install pressure relief valves throughout residential lines? At every boiler system I’ve seen they have them everywhere. Would installing a few in the house be a good idea for those in colder climates?",
            "Sprinkler irrigation pipes are exposed due to city sidewalk replacement. To make it worse, they broke and repaired the pipe but there's a slow leak (like 1 drop 15+ minutes) in the PVC at one end. If I do any repair attempt myself, then the city won't repair. They won't touch it until Monday (tomorrow).\n\nTemps are suppose to linger around 31 tonight. \n\nI'm thinking if I wrap a towel around the exposed pipe and then drape other towels over the pipe to cut down on airflow, this might get me through the night. \n\nThe shutoff valve box for the irrigation is extremely rusty and I have a desperate plumber coming out to fix that tomorrow so I'm reluctant to shutoff the water to the irrigation myself. \n\nDo you think my plan with the towels will get me through the night?",
            "Any info about this part? https://imgur.com/a/ILYNWTZ\n\nWe can't find it in any stores. Been hunting online.",
            "Any tips for thawing half of a garage slab? Only one (of two) of the pipes going to the floor gets hot.",
            "Please, no judgement on my situation. I am really struggling financially unfortunately ran out of oil in my home. Its just me, & I don’t qualify for any assistance programs in my area. I cannot afford to refill until at least the second week of February. My hot water tank is separate thankfully, however I am concerned about my pipes freezing and causing even more damage that I simply can’t afford to fix. Is there anything at all that I can do to help lessen the chances of my pipes freezing? Recently it has been around 35-45F, but within the next few days the temperature is expected to drop into the 20s. Thank you all in advance for any help you can offer me.",
            "So our first winter in our new house, and were finding the pipes frozen regularly in the utility room (a converted garage).\n\nThe previous owners told us to put a small heater in the room, which doesn't really help, although when the overnight temperature is going to go below zero I put the washing machine on with a delay start so it comes on at 2 in the morning. Sometimes I forget and we end up with no water, toilet or washing until it thaws.\n\nWhilst it's an inconvenience when this happens, my main worry is the pipes bursting.\n\nThe pipes are in the (external) wall so I can't access them to lag, and would be difficult to deal with if they do burst.\n\nHow can I lag pipes inside a wall, and should I be worried? Am I on borrowed time?\n\nTo make matters even worse, the stopcock is mounted behind the boiler, so I can access it.",
            "I've got a frozen pipe (I think) causing ignition lock out, I live in a flat so I can't access my whole condensation pipe as it goes through the floor and then I'm assuming to my sink? I tried to drain it from there but not much came out.  \nAny advice on what else I could do before getting a professional in?",
            "Question!\nWe’ve had a clogged toilet for a few days. Usually there’s a slow flow that will let all the water down in a few hours, so it just takes a few flushes and then we can hear the clog free itself. \nIt didn’t do that so I tried to plunge it yesterday. Good 30 mins later, no change. Now any water that’s in the bowl isn’t moving at all, complete clog. \n\nWe’re in CO, it’s 6° right now. \nWhat are the chances this is due to a frozen pipe?\nHow do I fix this?",
            "Any one still active on this thread? Both kitchen sinks (one in the basement) don’t have hot water. Cold water works though. Both are along a wall from the outside. From what I’ve read there’s probably a frozen section for both of those. Everything else works fine (showers, sinks, toilets, etc.) seems to be just the sinks against the wall to the outside. There’s also a dishwasher but I haven’t tested that. \n\nDoes the heater under the sink work? Any other tips?\n\nI don’t think it got cold enough to burst a pipe but any signs that I should look out for just incase? Weather app said it got down to around 6 degrees last night.",
            "Kitchen sink lines froze overnight, currently thawing them with the main line off. A question for the future: should I let the hot and cold drip slowly overnight? Everything I see just says let the cold drip, but if the hot line is stagnant, couldn’t it freeze as well? Is there a reason to not have both drip overnight on cold nights?",
            "No hot water in kitchen sink only on cold days\n\nHi there. Hoping someone can help me solve this one. My kitchen sink hot water line doesn’t seem to have any water flow on colder days. All of the other taps in the house work as normal. All of the plumbing for it is inside so it should never reach the freezing point. Any ideas? Is it just a blockage that coincidentally unclogged itself on warmer days?\n\nAny ideas?",
            "In canada and today has been the coldest day of the year so far (-25 Celsius plus some major wind issues) ...all our first floor taps run fine, but our second and third floor has no cold water. We've got the taps open but even with only the cold on...the water coming out is warm? This is so weird. \n\n\nWe have a heater going near the mains but definitely wouldn't be enough to make the water that warm 3 floors up",
            "Bathroom sink and shower, no water.  Toilet in the same bathroom works and the bathroom one floor up is fine.\n\nI could have a frozen pipe is my only guess, but the toilet in that bathroom fills up, and the faucet in the bathroom one floor up works fine.  It is - 25C outside but the heat is set to go no lower than 15C overnight.  That bathroom was colder than that this morning because it's got no vent but I don't think it was below freezing.\n\nI'm at a loss, and I'm too broke for a major plumbing problem and I am really hoping someone is going to tell me I can just wait and it should sort itself out, but I'm sure that's not it.\n\nDo I need to turn off water to the house to prevent more damage?\n\nI've been to the basement and there are no drips coming down the line that goes up to the bathroom, nor frost on it.  The hot line is room temperature to the touch.  I'm not getting hot or cold to those two faucets.  I have normal hot  and cold everywhere else.\n\nHelp?",
            "Woke up this morning to kitchen sink not working. At all. \nAll other sinks in the house are working. Temperatures dropped to about -25 quite rapidly last night. Do I hire a plumber? Is this a frozen pipe issue? What do you suggest I do? Any help is appreciated!",
            "[photo](https://www.redgifs.com/watch/stainedalarmingparrot)Hello. I have a problem with frost-proof faucet. Today I noticed the leak on the outside of the wall and I'm afraid of the pipes inside the walls. I must admit I didn't disconnect the hose before winter, didn't really know it can cause problems. Unfortunately I have no seperste valve for that faucet. Can I somehow check if the leak caused some further problems?",
            "Both hot and cold in 2nd floor bathroom froze last night (-12 F here). The pipes are COPPER. They run through an exterior wall. Used a space heater to thaw this morning and water is running again. They do not appear to be leaking. Question: do I need to replace these pipes if they are not leaking now? How does freezing affect the reliability of copper pipes? Is there a danger they have been weakened and will burst in the future?",
            "I have a baseboard radiator frozen in my bump out that is under insulated, besides shutting off that part of the circuit, what do I do when it starts thawing besides water cleanup",
            "I have basement area copper water pipes in a very old home that are next to the exterior framing. How can I possibly keep these pipes from freezing?",
            "In case it is helpful to anyone else, this final approach took care of things: I took off the supply valve and directed a hairdryer stream through a straw down the supply pipe, and had the drain downhill from there open and let that run for about a half an hour, and all was good ... whew!",
            "Help, upstairs bathroom frozen but dripping very slowly.  Everything is pex, I have no idea where the freeze is.  \n\nI had an idea.  What if I drained the water from the entire system from the basement.  Then refilled it with hot water (tankless hotwater heater).  Considering that there is at least a drip, I think the water would reach the frozen location and an air pocket wouldn't prevent flow?  Bad idea?",
            "Honestly not sure if this is related to the cold weather or not.  We had the quick dip in temperature between Friday and Saturday.  Saturday we realized our toilet wasn’t getting any water, however our sink about a foot away was.  We put a heater in the room and turned the water to the house off.  I turned the water back on today and the toilet filled up once, but would not refill.  Any ideas?",
            "During very cold spell a month ago hot water started coming out of my faucet set to cold..for about four minutes and then cold would start coming out. Plumbers came and added a small cold water tank, didn’t work. Came back and replaced the hot water  tank. Didn’t work. They don’t think it had anything to do with the cold weather. What now?",
            "1) thank you for keeping this sub open to laypeople and not locking it to professionals in the trade, some of the other trade subs do that and as a lurker its a bummer that i cant comment\n\n2) i work in insurance and just wanted to drop in to say **THANK YOU PLUMBERS (ESPECIALLY IN THE NEW ENGLAND AREA)** for helping people get back into their homes and have running water again. this has been a really bad year for freezing, we've seen a comparable amount of claims to some of the worst hurricanes down south, every time we hear a customer say one of you helped them get their water back on and would come back later for a permanent fix its a huge relief for everyone involved, you are legends. thank you. thank you.",
            "S.O.S. \n\nFor the first time in over a decade, our Pex water pipes froze during a -degree cold snap in Maine. The next day, everything thawed/our water came back, but the kitchen sink just wouldn't drain.\n\nAfter snaking the drain pipe with a 15 ft auger from the kitchen sink alllll the way to the main sewage pipe (🤢💀⚰️🪦) and finding nothing, our kitchen sink is STILL backing up and we are at a loss. \n\nAll other drains (washer/downstairs and bathroom/upstairs) have been functioning fine since the pipes unthawed.\n\nThoughts/suggestions desperately needed - thanks!",
            "So my power has been out for 48 hours and its 20 degrees outside.  I live in Michigan so the house is well insulated.  Do I need to drain the water lines or can I just run each faucet at trickle to avoid frozen pipes?  Thanks!",
            "my kitchen sink hot water and cold water wont work but I have water upstairs and down stairs bathroom I am sure its frozen",
            "I have what I believe to be freeze damage in two locations in a crawlspace. In the one where I already have visual access, it appears a long piece of 1/2\" copper was pushed out of a 90 degree elbow, breaking the solder.\n\nI have been pointed toward cutting back a few inches from the failed elbow joint on both pipe segments, cleaning and deburring 1\" at the ends, and installing a flexible line section with sharkbite couplings at both ends. This suits me as I do not have a torch or lead-free solder on hand, but the local hardware store has half an aisle of sharkbite parts. Is this a viable long-term fix, or should I consider it to be short-term only?\n\nGetting an actual plumber out here seems to be a 2-week availability, would like to fix before then if possible.",
            "So the pipe leaving from my house to the outside (sprinkler system) seems to have frozen and formed a small crack. This seems to be because the shutoff inside isn’t preventing 100% of the flow of water the outside. This surprised me because it’s a substantial ball valve, one of those 90 degree lever action ones. All that said, it’s gotta be the case unless there is something else I’m missing. Just confirming what I believe to be true. \n\nTo give reasoning. The system was winterized normally and the low point is open. I just turned the ball valve off that is above the crack. So the only water in the cracked pipe could be coming from the house. Then I blew in the crack to remove the water that had reached it (it’s on a vertical pipe). Once the water was gone I walked away and came back 10 minutes later and it’s dripping. So the only water in that part of the system could be coming from inside the house (duh duh duhhhhh).",
            "To prevent frozen pipes, insulate them, seal air leaks, keep a stable temperature, allow faucets to drip, open cabinet doors, and disconnect outdoor hoses. If pipes freeze, keep the faucet open, apply heat, and consider calling a plumber if needed.",
            "Is there a device you can put on the outside pipes to keep the inside pipes from freezing?\n\nThis is my delima. I have a rental home on a slab in South Louisiana. It's an older house and some of the pipes are in the attic. It is recommended here to keep the inside faucets dripping and to wrap the outside faucets to keep the pipes from bursting. Temps are forecasted to be in the low 20s for two nights next week. The tenants are set to move out a few days after the freezing temperatures and I don't trust them to leave the inside tap on for those two nights. \n\nI've heard of something you can attach to the outside that regulates the waterflow according to the temperature...or something like that. My understanding of this may be all wrong. Is there something I could do to protect the pipes that wouldn't involve any action on the tenants part?",
            "One of my bathrooms have no cold water at all. I turn on the cold water tap, there's gurgling for a while and only two or three drops of water come out then nothing at all. There's only hot water. Outside temps is around -40 to -45 Celsius. I'm suspecting a water pipe froze somewhere. Is that the case? The other bathrooms and kitchen sink work totally fine",
            "Our pipes froze lastnight and my roommate kept trying to get the water on .  Well turns out my sink drain was clogged and it flooded my entire bathroom and surrounding carpet when the water came back on .  Tons of water. .  Crazy night. .",
            "Question is: what causes it to happen? I grew up in a house in a cold state when we had freezing/ below freezing much more frequently than today and this issue was never, ever mentioned. \n\nI really don't think my parents just didn't say anything all those years - I think it just was not an issue and I was wondering why - the last two houses I've been in have had poor insulation. Is that the reason?",
            "I live in a Century old house. My pipes are mostly accessible except for those on the 2nd floor but they’re in a raceway along with the main drain pipe. Warm air can get up there that way. Trickle water can help keep the water up to ground water temperature. As long as there’s power the village well pump can keep pressure but if power goes out, i have 5-10 minutes to shut off water and drain pipes! If I have to leave for over night in winter I always shut off water and drain pipes.",
            "Just straight up do I drip hot or cold water? I’m in Dallas so we’re getting down into the low 10s the next couple days with little to no sun on the forecast for the next 2-3 days, wind chills in the negative. Obviously we need to be able to wash dishes and take showers over the next 3 days so please send advice!",
            "How do I insulate above ceiling tile and behind drywall?  My basement was refinished 10 years ago (I bought 3 years ago), and they freeze every time it drops below 15.  I always drip faucets, open cabinets, seal outside/inside best I can, but I can’t access the pipe that’s freezing.\n\nCurrently, I have a blow dryer and heaters going on that side of house.  Looking for a diy longer term fix.  \n\nGood luck all!",
            "Our twenty year-old furnace has quit and will need to be replaced, but we won’t be able to have the new furnace installed until Tuesday morning (48 hours from now).\n\nWe are currently experiencing subzero temps - it’s -3F right now, and temps will remain subzero until Tuesday morning.\n\nWhat is the best strategy for keeping pipes in our 1500 sq ft two story home from freezing? We are running all faucets and have space heaters. Ambient room temp is in the low 40s. \n\nI’ll add that it’s a 100+ year old house with original single pane windows and so-so insulation. It’s a bit drafty on a good day.\n\nGiven the time to wait until repair, is it best to turn off water main, drain pipes and toilets, etc? Or will the water running/space heater method suffice?\n\nThanks in advance for any advice.",
            "Whole house has no water (48 hours, very low temps, Montana). We’re assuming it’s freezing before it enters the house. Had a space heater on the main shut off for 12 hours and it did not help. At this point, we’re just planning on waiting for the temperature to go back up. Wondering if we should shut off the water, or leave it on? TIA!",
            "I have no water at all in the house right now so I thought the main line from the city to my house might have frozen (it's been around 19F/-7C for a couple of days) but now I'm having doubts. Here's all the stuff I've tried:\n\n* Called the city and they haven't cut my water and there are no outages in my area. Crew came to check the meter, they loosened nuts on both sides and said water came out so it's not obstructed.\n* Tried heating up main shutoff valve and 4 inches of metal pipe where it comes into our basement. Shutoff valve seems to open/close without issue. \n* The house has been at a steady 68F/20C including the basement (it's finished) so I doubt any of the interior pipes could have frozen.\n* The main line that goes out to the street is about 2.5 ft underground where it enters the house.\n* None of our neighbors have had this issue or any frozen pipes.\n* Meter is not running, so probably no burst pipe throwing water into the dirt.\n\nThe plumbers we've called are just saying it's frozen pipes, but does it make sense that only the 20 ft of main line between the house and the meter could have frozen being 2.5 ft underground and it not being *that* cold out and no other neighbors' did? Could it be something else?  \nThanks for any insights!",
            "My townhouse’s heat isn’t working and it’s currently set at 72°F and is currently 55°F, one of my neighbor’s pipes burst because they weren’t home so I’m not sure what is was set at. I’m worried that mine will also burst, what are the odds of that happening?",
            "Hello! We are in Missouri in a new build. Just hit negative today and all of our faucets work except for the master shower. We have no pressure coming in the shower could it be a frozen line? Should we just keep the water running? (Right now it’s just dripping)",
            "Hiya - I have running water from all my faucets and showers. For some reason though my 2 showers are not draining. Could this be frozen drain pipes only? Sinks are draining and toilets are flushing fine. Currently at -1° and not going to be above freezing for a few days. \n\nI’ve tried plunging, draino, snaking (there is no squish), pouring hot water down, and no luck. \n\nI have just never had an experience where ONLY the drain pipes are frozen. Both showers are on second level. One is above the garage, one is above the kitchen.",
            "My washing machine is giving me a water supply error. All of my water is running fine throughout the rest of my house. I suspect the culprit may be this thin vinyl tubing, even though I don't know what it actually does. [(Tubing pic)](https://imgur.com/a/6jsgVhw)\n\nThe reason I suspect it is that the condensation line from our furnace pump is the same type of tubing, and that froze. (I cut it and am draining it into a bucket until I can patch that tubing.)\n\nWhat is that tubing? Is there a way to thaw it out? I tried to follow it outside, but everything just goes through a large PVC pipe that connects to the sewer line as far as I can tell.\n\nOr is my hypothesis wrong? Is there some other way to get water running to the washing machine? FWIW, the error code on the LG washing machine is \"IE\" which the app says means: Water cannot be supplied; Water supply takes too long, and one of the possible solutions says, \"Check if the water pipe, tap, water supply hose or water supply filter is frozen. If it is frozen, use a cloth soaked in lukewarm water (50-60 C, 122-140 F) to melt it.\"",
            "Can I wrap water pipe heat cable around my pipes at the manifold to reduce likelihood of freezing pipes?",
            "Have a Rheem performance plus tankless water heater. Woke up today with nothing out of the hot taps, normal from the cold. No error codes. Left the water on for a trickle with the hot tap open. Eventually a steady tiny stream comes out of the hot tap, even if the cold is closed. Interestingly if the kitchen faucet is off, the bathroom gets nothing. If I turn the water off for more than a couple of minutes, the hot water side goes dry again.\n\nI cleaned the tiny water filter, and also took the cover off to look at the burner, there is no blue light on. When I try testing it, it seems like it tries to light, but doesn’t happen. I also noticed after this, if the faucet was on, and I tried to turn the control panel back on, it wouldn’t come on until I closed the water intake pipe (I’m assuming that’s what it is looking at it?) \n\nAlso, if the water heater is turned off, there is fully pressurized water out of the hot tap (just obviously not hot water). If I’m going to run it at a trickle to try freeze protection, do I run the cold tap or hot tap or both? Do I turn the heater off and the gas supply? Or do I just keep running the taps as is- hot fully open and cold tiny open and hope it unclogs? The heater is located in the unfinished part of the basement next to the furnace- so chilly but not freezing. It’s supposed to have the freeze protection on it, I could see the plastic thing around the inside though it didn’t seem to be warm or doing anything.",
            "My pipes got frozen overnight. I have one bathroom working and only the hot water works. The house is at 85 degrees internally at the moment. All other faucets and water doesn’t work or turn on. I’m afraid they will burst. They were all frozen but the water in my bathroom started working earlier today but only the hot water. Cold water nothing comes out. Any tips?",
            "1.14.24 - upstairs hot water pipe is frozen.  This happened last year to the cold water pipe, we had a windy -10, 3 day cold front that ended up busting the joint on the cold water pipe.  Fast forward to right now, was upstairs replacing a gross broken toilet seat in my kids room, turbo the hot water on and nothing.  The cold water that I fixed/insulated last year is working fine.  Here's the thing that's confusing me, it's an interior wall!!!!  It's a cape cod style house, was built in the late 90s so its not even that old.  We've only lived here for 3 winters, so I'm pretty disappointed that a 2nd floor pipe is freezing.  Makes no sense to me at all.  Any advice??",
            "We have a cold snap here in Alberta Canada. And my furnace broke. The furnace is in the garage which is not heated. \n\nI am sitting in the house with space heaters everywhere and checking for water leaks while I have to wait for two days for the HVAC guy to come fix the furnace. \n\nMy question is, if I can close the main water valve, open all the pipes and drain, turn off the space heaters and go live in my friend's place until the furnace guy shows up?",
            "[deleted]",
            "Bathroom pipes, cold and hot, frozen at sink and tub. Got the cold and hot working to sink, hot working to tub, but no cold at tub. Bath knob is single kind that you pull up to turn on , and twist to left to go hot. For some reason it won’t turn off all the way when down. Any idea why? Maybe it’s a pressure thing since the cold isn’t working to that handle valve?",
            "1 hot water pipe froze overnight. Rest of the house is fine. This happened last year and it burst and caused a lot of damage. Should I shut off the main? Turn it half way down? Does less pressure help at all?",
            "Hi, looking for advice. Very cold for 2 days so far, had MOST faucets on a drip, but did not drip the faucet on my kitchen island in the center of my house because it was very warm and open floor plan. NONE of the other faucets were frozen, but cold line on this kitchen faucet is frozen. Trying to heat area under sink with space heater. Anything else I can/should try? Not sure where this pipe is coming from or how it froze...",
            "Looking for ideas on how to troubleshoot - very low pressure to kitchen faucet both hot and cold after 2+ days of low temps. No issues with bathroom on other side of the house. Would this be right at the faucet since it's both hot and cold and not affecting the rest of the house?",
            "Here's my assumed situation  \n[https://imgur.com/a/acFI5ZJ](https://imgur.com/a/acFI5ZJ)\n\nWe knew about an incoming cold snap and left our cold water drip running in our bathtub. Woke up this morning to cold water, great, and no hot... not so great.\n\nThere's a PEX line that runs from the basement to the second floor in a behind-the-wall cavity. There is a huge amount of cold air coming in, so obviously something must be frozen.\n\nI have very minimal access to blow warm air into the cavity. Although there is an opening in the basement, it's behind a spiderweb of pipes and wires. I've got a 6x6 access panel in a bedroom wall, but it's about 8 feet away from where the cavity is, so blowing heated air in there is probably not super effective.\n\nCurrently running a space heater in the basement w/ fan pointing up as best as possible, and a fan running in the bedroom right into the access panel, and a space heater in the room to warm things up.\n\nAnything else I should do?\n\nIs there something like a ambient heat tape reel that I could fish into the cavity to give the pipe a fighting chance against old man winter?",
            "the drain in my bathtub froze over the below zero weekend. this happened one year previously and i was told to  wait until the weather warmed up until anyone could come get under the house and take a look IF it didn't just thaw itself out by then anyway.\n\nis waiting the only thing i can do? i tried hot water and salt in the drain.",
            "I’m in Chicagoland where it’s been -10F to 0F for the past couple of days. Basement laundry room with exterior wall with hookups and drain. A bit of water on the floor and I traced it back to the hot water hookup. [You can see the drop forming at the connector in this photo](https://i.imgur.com/AaV9QKK.jpeg). The hot water line isn’t presently frozen and it flows hot when I run the washing machine. \n\nI’m assuming the rubber washer inside the hookup is compromised, perhaps from the cold, but I haven’t taken it out to inspect. Do you think this is accurate? Is there any harm in shutting off the water using the valve shown in the photo until I can get to the store tomorrow?\n\nThanks in advance.\n\nEdit: I shut off the water supply last night and apparently had no issues. I went to the hardware store for new hookup hoses today and got them installed without any problems. So I guess this leak was a coincidence and unrelated to the cold weather. More related to my lack of preventative maintenance.",
            "First time homeowner + first winter\n\nWe have a new construction and in the process of winterizing our outside spigots we noticed one was not connected to the water main and asked the plumber to come back out to hook it up, so we can shut it off in the event of an emergency. They did it last week and now we’re in the middle of a snow storm and went outside and see icicles coming from below the faucet which had a styrofoam cover on it. \n\nAfter investigating, we now know water is dripping and leaking out of the faucet (despite being off) and luckily has not frozen yet (like due to the styrofoam cover). We put the cover back on and another insulator where the water was coming out for added protection but I’m still scared it is going to freeze. \n\nThis is allegedly one of those fost free spigots and leads into our crawl space which is heavily foam insulated and I have a temp reader down there that is still reading 60 degrees.\n\nThe line does not have its own shut off and we have two more days of below freezing weather ahead of us. What should we do? I’ve called the plumber who did the work last week and no answer",
            "My main shutoff at the meter doesn't have any arrows or lock rings.  The valve kept turning past 360 degrees.   Left the valve perpindicular to the pipe and that seemed to work.  \n\n\n\n\nDoes that seem right?  Houston area house built in the 80s.  Wanted to shutoff the water and drain the pipes for the freeze overnight ",
            "WEIRD SCENARIO... Upstairs bathroom with no cold water except the toilet seems to be working fine. Hot water is fine. I have both sink's cold faucet wide open with zero flow. If I turn on one faucet's HOT on, both sinks flow hot water even though the one is only open to cold. Shower gets nothing UNLESS you turn a sink's hot water on then you get hot water from the shower. I know I'm frozen up somewhere but why/how the weird flow??",
            "Every faucet in my house is working fine. But no water is coming out of the two sinks in my bathroom (both of which are on an interior wall). It’s strange because the shower and bath in that same bathroom (both of which are along the exterior wall) are working fine. No idea what’s going on or how I should address it. I have all the faucets in the house dripping and haven’t had any issues yet. Any thoughts?",
            "Do i need to let my water drip? If so, what constitutes a 'drip'? literally a drip every couple seconds? its about 15°F to 20°F (15°F-20°F is the average low but it might go down as low as 10°F)\n\n&#x200B;\n\nHere's my scenario:\n\nThe house is 100 years old, but over the years have gone through some 'upgrades'. Most of the house has a heated basement, but there is one bathroom above crawlspace. the room does not have HVAC and gets very cold. the floor is *very* cold.  The plumbing comes through the crawlspace from the basement, the water lines in the basement are PEX, i'm not sure if for some reason they transition to not-pex in the crawlspace but not likely. we have two sinks, a toilet, and a tub/shower in this bathroom. \n\nAre my water lines at risk of damage? whats the range for potential damage?\n\n&#x200B;\n\nThanks!",
            "I have a tankless hot water heater in my attic, which I expect will hit 26 degrees or so tonight. Should I leave a hot water trickle going in one of the bathrooms to keep water moving through it? Or shut it off?",
            "I live in Kansas. Realized last night my garden hose was attached as I had weak water flow. Unattached the hose when I realized and the water is returning to normal. Am I still in danger?",
            "My shower/bath drain trap seems to be frozen after three nights of 0-degree temps. I've tried everything from adding hot water w/ salt to baking soda+vinegar+boiling salt water. I shop-vac the water out after each attempt and try again, but nothing seems to change. I've got two space heaters keeping the bathroom at about 86 degrees. Can I do anything else other than wait and hope?",
            "Cold water lines frozen to the north side of the 1969 house, slab plumbing in texas. 10-20 degrees for 24 hours.  \n  \nIs this a good idea? (from the Mr. Rooter website)\n\n**For Pipes Located Underground:**\n\nBelieve it or not, thawing underground frozen pipes doesn’t have to involve digging. Instead, you just need a water jet to blast the ice out of the way from underground. Turn off the main water supply and then follow these steps:\n\n1. Place a submersible water pump in a five-gallon bucket of water.\n2. Attach 1/4-inch plastic ice maker tubing to the pump with the appropriate fitting.\n3. Attach a four-foot piece of flexible PEX tubing to the pipe in question.\n4. Feed the ice maker tubing into the PEX tubing until it reaches the blockage.\n5. Plug the pump into a GFCI outlet to pump a steady stream of water directly at the blockage. As the water hits the ice, it simply trickles back down the pipe and into the five-gallon bucket.\n6. Once the blockage is clear, pull the tubing back out, turn the main water supply back on, and you’re back in business!",
            "If I bend PEX pipes a little and hear some cracking, I'm assuming that sound is ice inside cracking? Or do PEX pipes always make that noise?",
            "For those still dealing with frozen pipes… today was day 3 of mine being frozen, even though I did drop the faucets. I’ve had space heaters going on my bathroom pipes (they are slightly exposed under one sink) and a space heater in front of my water heater in the garage, cranked my heat up to 75-78 for as long as I could stand it and left the faucets all the way open/turned on on hot (my cold pipe wasn’t frozen) and today I heard the water start running. Fingers crossed, I haven’t seen any busted pipes yet. My bathroom pipes run through the attic and it’s been -9 - 0 degrees for a few days. Just keep the heat up if you can and the faucets open! Good luck to all who are still dealing with frozen pipes!",
            "Hi everyone, looking for help to understand what happened. All faucets in the house work after the recent Texas freeze, except for the kitchen island faucet. This faucet js about 8 feet from the wall and piping comes up through the foundation what I recall during the build process. Any idea why this specific one is frozen while all others (even against outside walls) were fine?",
            "Multi unit condo building- below freezing temps\n\nI’m on the 3rd floor, out of 4, and the temps this week will be highs in the 20s/30s and lows in the teens/20s with tonight and Sunday a low of 9.   \n\nI have neighbors on either side, above and belo, and then an indoor hallway, except and then the one side where my balcony is.   \n\nI have a utility closet where the water heater and ac are which is out on the balcony area.   It has a baseboard electric heater (I think that’s what it’s called?) in it that I currently have at med/high.   \n\nWould I still need to keep cabinets open and drip water tonight/this week?  The heat inside is currently set to 74.",
            "Texas. Above ground shutoff for sprinklers is leaking below the first shutoff valve (so street side). The only way to shut the leak off available to me is at the street. The leak itself is a small spray...not too bad, but not drips. Should I shutoff at the street or leave it running all night. Supposed to get down to 20 tonight. Any help appreciated",
            "Currently at the end of day 3 of having cold water only run in my kitchen sink and bathroom sink, plus bathroom toilet works.  Hot does not work.  Nor does any water drip in my basement bathroom, shower, laundry room, utility sink.  I’ve had the heat cranked to 70 (my house doesn’t seem to get above 70 internally) and space heater on the lead main in my basement.  \nNothing is moving.  \nI am beginning to suspect that the outside main is frozen (Chicago here, just bought this house in October, nothing was stated in the disclosure agreement about pipes freezing at all).  It’s been -8°F at night (real feel -31°F) and will warm up to the balmy temperature of 17°F-tomorrow.  \nI reside in a single family home, brick, raised ranch.  Pipes are all galvanised, except the new bathroom plumbing in basement which is all copper.  I believe the laundry room is also copper, but those lines are buried behind the drywall.  \nI have left all lines open, including in the showers.  I am wondering as it is ‘warming’ up tomorrow if I should turn my main off?  I have been told yes and I have been told no, the reasons behind both.  Like I just don’t want to potentially come home to a major disaster, but also don’t want to potentially cause a disaster by doing one or the other.  \nAll I can say is pray to the house lords for me and have them say some nice things to my galvanised pipes that they hold out this time until I can properly replace them and insulate them.\n\nAlso, we had a deep freeze in December of 2022 — so the original owners either hid the fact, which will be very difficult to prove, or it’s just my lovely luck.  Lol. (added this last little sentence)",
            "Sump pump issue\n\nSorry first time home owner so not too familiar with this issue. I live in Michigan and it's snowing and 3 degrees at the moment so cold. My sump pump motor has been running for a bit now but not draining. Not sure If the water is frozen. I poured hot water down the pipe from out side but no change. I did it a few times. I unplugged the sump pump so it doesn't burn out. Is that the wrong thing to do? Any solution? Weather isn't getting warmer any time soon. \n\nAlso anyway to confirm it's frozen and not an issue with the sump pump?",
            "In my downstairs bathroom, I have cold, but not hot water.  But, upstairs I do have hot water from at least one bathroom.\n\nAny advice on what I can do to keep them from bursting?  Can I safely use the hot water upstairs?",
            "Homeowner from Dallas, TX here. I left my water trickling on all my faucets during this winter freeze and woke up one morning to no running water. At this point I’m starting to wonder if it’s something other than a frozen pipe. I have been getting the occasional drip but nothing more. I find it quite odd that my water would completely freeze up over night with it running and none of my water lines being on exterior walls, excluding the two outside spickets. \n\nIs there something that I could check to know for sure if it’s a frozen pipe, or do I just have to continue with the waiting game?",
            "I have full use of all my water on one side of the house but don't have cold water on the other. The only 2 things this is impacting are the kitchen sink and refrigerator water.\n\nI think all of the pipes in the house are Pex so I'm not super concerned about anything bursting and I haven't noticed any water damage, but I am convinced that the cold water line has frozen somewhere near those 2 fixtures. \n\nI've bumped the house heat up to 70 and am aiming a space heater under the sink near where the cold water inlet meets the outside wall.\n\nIs there anything else I can do to speed this process along or is there anything I'm doing wrong? I live in MD and it shouldn't go down below 19 tonight.",
            "We are in KS and like most of the country experienced subzero temps this last week. Three nights ago my husband and I heard what sounded like a bang either inside the wall or against the house. The best way to compare the sound was something hitting the house (bird, fallen chunk of snow?) but we were concerned it was a burst pipe. Though where we heard it, I don't see why any pipes would be in that direction of the house--how to describe ?--it was the wall nearest to the outside of the house, away from the bathroom. \n\nFast forward to today and we can't find any evidence. Only a few air pockets in the kitchen faucet intermittently (the bang was heard upstairs though) and finally, today, the vent in the bathroom WAS leaking, but stopped (theorizing condensation?). Any advice? How do we know what we can't see? Water pressure is ok too. THANKS!",
            "The faucet in my kitchen is supplied by uninsulated copper pipes outside. I plan to get them insulated as soon as possible, but cannot at the moment. Right now, the pipes are frozen and they froze overnight even though I kept it running a bit.\n\n**My question is: If I know the water in the copper pipes will refreeze soon after I thaw them, is it safer to leave it frozen or to thaw it?**\n\nI am unsure if the chances of it bursting are higher from them staying frozen longer, or if they keep going through the freeze/thaw cycle.",
            "Can I re-pipe my house so the lines are interior instead of exterior?",
            "Hey guys, I managed to dodge a bullet with frozen pipes in the house this year, but totally forgot I had a toilet in the shop… went in there today to find the water in the bowl and tank frozen solid. The weather is warming up so it’s going to thaw on its own here slowly, but I also have a space heater available in there. Should I turn the heater on and thaw this thing as fast as possible, or is it better to let it thaw slowly? What are the odds it’ll all still work after it thaws without leaking, or am I looking at big problems down the line?",
            "Last year, I bought a 30 foot pipe heating cable off of amazon and connected it to my pipes, it seemed to work great at the time, but this  year, I plug it in, it lights up but doesn't heat.\n\nI never put it away, just kept it attached and unplugged.  Is it bad that I didn't put it away over the summer.  I've bought shorter cables for other areas and they seem unreliable year to year.",
            "I don’t understand why all my water is fine but both me and my neighbor can’t water into our washing machines. She told me for awhile her kitchen faucet wasn’t working on cold water",
            "Our shower froze just two nights ago. I dripped it but clearly not well enough, as I woke up to find it had stopped on its own.  When I turned it on to test it only hot water came out and at a trickle, and nothing has changed since. Both the sink in the same bathroom and the one in the kitchen are fine- both hot water and cold have normal pressure. Washer and dishwasher seem fine as well. The shower is on an outside wall, and we’ve been trickling water since I  caught the problem. Is it likely still just frozen or could something else have happened after it froze? Also, should I continue to drip the faucet at this point? I should add that I’ve been under the house and there are no burst pipes or leaks at this point.",
            "Looking to insolate a PEX water line.  Can I put fiberglass insolation around it?  For example use a product like this?  [https://www.homedepot.com/p/Frost-King-3-in-x-1-2-in-x-25-ft-Fiberglass-Pipe-Wrap-Kit-SP41X/100032413](https://www.homedepot.com/p/Frost-King-3-in-x-1-2-in-x-25-ft-Fiberglass-Pipe-Wrap-Kit-SP41X/100032413)  3 in. x 1/2 in. x 25 ft. Fiberglass Pipe Wrap Kit\n\nIt says compatible with cooper in the details but in the Q&A someone asks this same question.  Sounds like I can use it with PXE but I thought I would ask others.",
            "I have a hot water slab leak which is found behind my bathroom vanity. We heard the noise for a week but never saw any water. Just today we saw water starting to come up under the vanity. I found the leak, my question is is it ok to run the hot water just long enough to take a shower? Does it just go under the slab? I was going to fill concrete hole with caulk to keep it from coming up. Just need hot water for day or two until plumber can arrive.",
            "Hot water will definitely freeze faster than cold.",
            "Hi all. I am in north Texas and, like many others, I had a hose bib burst which saturated the inside of my guest bedroom. I was able to replace the hose bib with a new one and am now trying to minimize the water damage. \n\nI removed the baseboards and cut out the drywall at the baseboard height and began running fans and a dehumidifier. \n\nWhat else can I be doing to minimize the damage? I used my water meter to ensure that the moisture isn't above the baseboard and have the room well circulated with air.",
            "Pipes were frozen since yesterday but they finally thawed today around 2pm but even though cold runs full blast, hot will come out fast then slow down. Water will still get warm but has significantly less pressure. I’ve tried running the hot water for about an hour to see if maybe there was still ice in there but the flow never changed. Any ideas?",
            "I had both my hot and cold water leading into my kitchen freeze with no drippage. The line runs through my garage, so I put a heater in there and opened the taps. Eventually, water started flowing again but now a few days later it's at about 50% pressure.\n\nI see no signs of leakage in the garage and hear no sounds of an active leak along the line anywhere I can tell. The faucet now drips water even when turned completely off on both the hot and cold. Both the hot and cold water are operating at about 50% pressure when fully opened. Meanwhile, none of my other faucets are encountering any difficulties, and they did not freeze.\n\nAside from a leak somewhere that I haven't found yet, is there another likely explanation for why the pressure is so low in this one fixture? Thank you!",
            "Anyone got any suggestions on a frozen pipe in a concrete slab? I used a space heater on where I believed the freeze was last year and I got water moving again, but I can't seem to nail it down this time. Would a thermal imaging device help?",
            "So we had some nice days well above freezing here and used the outdoor garden hose to top up the hot tub. \n\nStupidly, I didn't drain the hose, and it froze.\n\nI've taken the following steps:\n\n\\-Used hot water to thaw the connection and removed the hose.   \n\\-Put the hose in the hot tub to melt the frozen water.  \n\\-Inspected the spigot, which was not frozen, turned it on and water immediately flowed.  \n\\-Drained the hose, reattached to spigot\n\nQuestions:  \nAm I in the clear for any potential frozen pipes?   \nAnything else I should do?",
            "Would this work to prevent our pipes from freezing?   We live off grid with a wood stove for heat. We are looking at a number of different energy efficient ways (live on solar) to heat the crawl space under the house (the house is on pilings).   Would running copper pipe as in floor heating from the heat of the wood stove give enough radiant heat to keep a crawl space (2-3’ high) warm enough to keep our pipes from freezing?",
            "it’s been a warm week for me, so I turned my heating off yesterday. However, I forgot to turn it back on and now I’m gone on a work trip until Thursday afternoon. It’s not going to be colder than 36° according to my weather app where I live but I’m worried my pipes might freeze. Am I just being paranoid or should I ask maintenance to go turn it back on for me",
            "Same. We’ve had a space heater going on the pipes that feed the water heater as well as one on the pipes that lead out of the water softener to the water heater. Somewhere between the two it’s frozen and we can’t get to that pipe. We have every cabinet open, every faucet on, just getting a dribble in one. I’m not sure what else to do but wait.",
            "I have same issue. Sink and shower are upstairs on outside wall. No way to access those pipes to try heat them with a hairdryer etc. I think it’s just a hope and pray, wait and see kind of situation.",
            "I have the EXACT same scenario. I believe the water pipes run past our hood vent outlet and that is letting too much cold air in against the pipes. I’ve been running a space heater in the upstairs bathroom for hours now (may sleep on here, it’s 88 now) with no luck. Tried hair dryer as well with nothing happens. Looks like Klee simply have to wait for it to warm up.",
            "This is actually bad for you, but in the grand scheme of Plumbing it is proof of the Mpemba effect. Hot water freezes faster than cold.",
            "It's probably frozen.",
            "Any luck yet? Same happening here. Also happened last year and eventually resolved itself. Taking similar approach to yours.",
            "That may be a cartridge issue. Not necessarily frozen pipes. What is the faucet brand?",
            "Same issue. I’ve got my space heater as close to the affected shower wall as I can and I’m just praying for no burst pipes",
            ">Hi, I've got no hot water in my upstairs bathroom. Nothing comes out when you turn the hot water knob. Cold water works though. Nothing at all comes out of the shower, which is one of those one knob setups.  \n>  \n>Hot and cold water both work fine on the other two levels of the house.  \n>  \n>It is 2-3 degrees Fahrenheit outside ATM\n\n\r  \nIt sounds like there may be an issue specific to the hot water supply in your upstairs bathroom. Given that the cold water is working fine and the problem is isolated to the upstairs bathroom, it could indicate a blockage or a malfunction in the hot water line leading to that bathroom. The cold weather outside might also be a factor if there are exposed pipes susceptible to freezing. Check if there are any visible signs of leaks or blockages in the pipes leading to the upstairs bathroom, and consider calling a [plumber](https://willsplumbingadelaide.com.au/) to assess and address the issue promptly, especially if freezing pipes are a concern in the current weather conditions.",
            "[removed]",
            "Close the inside isolation valve then open the outside hose bib and heat it with a hair dryer till the ice melts",
            "[deleted]",
            "At bear? Also naw just wait for the plumber. Leave everything as is.",
            "Dealing with the same here. Plumber I called said to keep hot faucet on until it thaws. Just seems odd that cold works but hot doesn’t. I have a tank heater.",
            "Same here. I think it’s because we use more cold water than hot, so hot pipes have longer to sit and freeze if you don’t drip them",
            "in the same boat here. have cold water running to all the bathroom faucets and my toilets flush. no water to kitchen or showers. no hot water at all. tankless heater in the garage.",
            "Same thing happened to me. Discovered that it wasn’t frozen hot water pipes, but one was busted. May wanna check that. I’m on pier and beam.",
            "Have you confirmed that the water heater is working? If not (if cold) you can shut off the supply to the water heater and open the drain at the bottom.",
            "Many hot water pipes burst in subzero weather while cold ones remain intact. Yet for more than half a century, physicists have been arguing about whether something like this really occurs.\n\nThe modern term for hot water freezing faster than cold water is the Mpemba effect, named after Erasto Mpemba, a Tanzanian teenager who, along with the physicist Denis Osborne, conducted the first systematic, scientific studies of it in the 1960s.",
            "Just dealt with this in my new mobile home. I had the cold water dripping. I woke up in the middle of the night to find no hot water despite all the plumbing except the main water line being within insulated space under home. I have no idea how the hot water intake froze and nothing else.   \n\n\nUnfortunately, next morning, my entire septic pipe froze from one end of the home to the other.",
            "In my experience, pex lines preform better in the winter than hardlined plumbing. The plastic will slightly expand and contract with the expansion and contraction of the water. Definitely leave your home relatively heated and open up beneath the cabinets and drip your sinks with these temps-otherwise your toilet you cant do much about other than leave that bathroom door open to your home’s heat and maybee wedge something small in the flapper(rubber flushing plug) to induce a sort of drip. Good luck!",
            "Some here. Toilet on an outside wall froze up. Tank wouldn't refill. I flowed more heat into the space and it thawed around 430pm last night.",
            "Pex will expand, but it’s the fittings you have to worry about typically",
            "Make the money while you can. It's amazing that some people don't even know where to shut off the water to their homes!",
            "[removed]",
            "Did your water ever turn back on? I’m in the same boat and would love to know the timeline we’re looking at.",
            "I'm having a very similar issue, just with my kitchen sink instead. It's frustrating because all my hot water is normal, which apparently is the opposite of what normally happens!",
            "It's probably frozen somewhere in a wall",
            "If you are leaving turn off the water main, drain everything by turning on your lowest taps.",
            "If you have the same pressure in your lines that you did before the freeze than you’re good. Just drip your lines if the temps are going to get that low again to avoid it happening again until the temps warm up.",
            "Properly insulted and constructed houses. \n\nWater service lines are buried well below the frost line, domestic plumbing is not run externally or in exterior walls or attics. Central heat.",
            "Here in Canada we have -40 F. at times over the winter. Pipes do freeze on occasion but for the most part we don't have any issues. No waterlines are allowed in outside walls. Or if it can't be avoided we insulate & vapour barrier the outside wall then build a false wall on the inside to run the waterlines. Outside our water mains & services are buried 8 ft deep minimum.",
            "I live in Alaska and I haven't had an issue with my bibb, but one alternative is to throw a shut-off valve on the line in the basement.",
            "It's been several hours with a space heater, the cabinet is 70° but the sinks still wont drain.\n\nMy specific concerns:\n\n1. Could my drain line be damaged? Only a few drops came out by the p-traps but they are usually quite solid and dry. \n\n2. Why did the cold water stop? It's in the slab, does this mean it was frozen or partially frozen under the slab?",
            "I’m having a similar issue. We ran a hair dryer and space heater and no luck either. Water flows back out of the dishwasher stand pipe.",
            "I’m having the exact same problem except I’m slab on grade and my hot water heater is in the attic. I can understand not getting water because of frozen pipes but cannot understand how when I turn the hot and get nothing but when I turn on cold I start to get flow. Not hot though. Im confused.",
            "Don’t have a solution. But I just wanted to know what you did.",
            "Following this comment. I’m in same boat although my water heater is inside. I’m confused about what to do with water heater. If water main is shut off, do I need to turn off water heater? Can I set it to vacation mode? Do I need to drain it? Do I need to shut off water to it? \n\nSo many questions about the dang water heater. \n\nMany of us amateurs blowing up the plumbing subreddit this week with our incompetence lol",
            "If the line is buried it’s fine. Code calls for laterals to be below the frost line. Here in Florida there isn’t any frost line and 10-12” never freezes (the folks in the panhandle may get different mileage).",
            "Same issue here. Hot water works in kitchen sink on main floor. Cold water works everywhere but the shower, where I am only getting a trickle.\n\nJust following the advice of other posts, open cabinets under sinks, let the water drip anywhere it can and pray.",
            "I’m having the same issue but at lower temps. No cold water to my bathroom sink or toilet but the shower is fine. Now the tub has stopped draining. Landlord hasn’t done anything about it yet but I’m gonna try some boiling water down the tub. I don’t really have any ideas for the cold water because I think the problem lies beyond my apt. All my lines I have access to are warm. Also when I run the mixed temp water setting on the sink the toilet will fill with hot water.",
            "If any water at all comes out of a faucet, leave it on. The moving water will eventually melt ice in the future",
            "Followed you here! Same problem except I have cold and hot running everywhere except for no cold in kitchen sink and washing machine.",
            "Same issue here…bummed you did not receive any advice. 😬",
            "Please someone respond 😔",
            "Have you checked the aerator? If not, check it :)",
            "I’m in Alabama too and my pipes are frozen this morning. I have no idea what to do.",
            "I'm in the South as well. I took these three photos of what might be my main water valve: https://imgur.com/a/kYzbYry\n\nDoes anyone know where it is definitively? The knob in the round hole seemed the likeliest, but we tried turning it and it was not moving. Maybe it's rusted? It hasn't frozen yet because it's still warm now, but I'm trying to prepare for freezing temperatures tonight.\n\nThe larger oval hole has the water meter, but I wasn't sure if anything was buried under the mud around it.\n\nThanks for any advice in advance!!",
            "Slab piping should stay warm enough to not have to worry. The ground heat is pretty constant. As long as none of the water lines come up the outside walls you should be good.",
            "[deleted]",
            "Are you trying to drain before, after, or the valve itself?",
            "A different that small, I'm sure they will be okay. 57 is better than sub 31.",
            "I'm in pretty much the exact same situation as you.  Tried the hot water in tank, have nearby faucet dripping.  We even left heating pads on the floor over night (I think our frozen pipe is in the floor between the joists) and still nothing.  \n\nHoping to piggy back off your post as I have the same questions.",
            "Same problem here, everything else in the house is working fine including the hot water heater. Only one toilet and a nearby sink is frozen, but the second sink in that bathroom is working fine. I currently have a space heater running in there and have tried hot water in the tank, but it seems like I just have to wait it out and hope the sun comes out.",
            "Sammeee thing :(. Really not trying to pay Christmas Eve prices!",
            "[deleted]",
            "If the main is frozen, water cannot enter your home. Sooooo that could be it.",
            "Doesn't seem to be many responses in this thread, so I'll at least share what worked for me.\n\nIn short, bought a 125W heat lamp from Lowes, clamped it in the attic right above the exposed pipes. Let it go for about an hour and then, voila, hot water was running once again!\n\nOne thing to note is I did this around 3-4pm, so it was at peak temperature for the day. A lot easier to get the water above 32° when you're going from 20° instead of 5°. \n\nPlease note that I'm not a plumber nor do have any technical training in this area, so this was mostly dumb luck. But maybe it could help someone else? Regardless, do what you can to stay safe and stay warm.",
            "Hey this exactly my problem, tons of water flow on cold, nothing on hot. Don't have a space heater to put in attic and I'm sure Home Depot is out by now. Guess I gotta wait til it warms up a bit",
            "24 hours and still no cold water from tub. I’ve had a space heater in the room. Temps won’t get above 32 for another 48 hours.",
            "I’m not a plumber but I know you should not use a heat gun as it heats too fast and the resulting steam could burst the pipe. Stick to a hair dryer or heating pad.",
            "Same situation here, same tankless heater, same temps, assuming similar location at this point. Mine is “inside” an exterior wall, and only accessible from that exterior wall. I have all of my pipes dripping and main water still on, hoping everything thaws without damage tomorrow when it’s sunny and 35. The tankless was supposed to be able to detect low temps and heat itself to keep from freezing but so much for that.",
            "Current outside temp -1 Fahrenheit— only coming up to around 8 tomorrow?",
            "Bump",
            "You'll be fine, heating the pipes isn't going to do anything to hurt the water heater. As long as there is power going to the TWH, you'll be okay- those Rinnai units have ceramic heaters inside the unit to help counteract freezing, and indoor units are rated to -20.",
            "It's tough to say but given that you have neighbors with a heat running, I imagine you're going to be able to keep the system above freezing temperatures even if yours is off",
            "Shut off the water main in your house and leave a faucet or two open to relieve any pressure in the system. If the system is frozen, there's nothing you can do beyond throw a space heater or two in the area and wait for the pipes to thaw before inspecting for damage",
            "Pex lines I haven’t seen burst but the pvc in the system definitely can. Pex can also push out the fittings if it freezes on the fitting",
            "Southern plumbing is like that I guess. Bonus- you have copper so you can probably use an induction thawing machine if you can find someone with one, but this is pretty likely to be a burst at some point",
            "Say a prayer and review your renters insurance policy. \n\nCrank central heating as high as you can take it. Open the cabinets. Leave frozen faucets open. Stay around. \n\nIf you’re leaving the house for Xmas do the same as above but close the faucets or set them to barely open. Turn off the water main if you have access",
            "Same boat as you.",
            "Well, I've been pointing space heaters at the wall and my sink cabinet all day and still haven't thawed out the hot water line to my kitchen sink. Maybe that was too much to hope for; it was a high of 23 degrees today, with wind chill that took it down about another 10 degrees.\n\nTo avoid major damage while I sleep, I cut the intake to the hot water heater and drained some of the hot water from the lines. I've got the kitchen faucet set to drip both cold and hot (though only cold is dripping at the moment) and cracked open the hot water faucets in the other sinks in the house. I thought about shutting off the hot water heater, but it's only overnight, so I figure it will be fine.\n\nIt's supposed to get up to 35 degrees tomorrow, so maybe it'll thaw and there won't be a leak. That would be a Christmas miracle, for sure. Here's hoping that all those others of you with frozen pipes get your miracles, too.",
            "Merry Christmas! I thought I'd give a quick update, because I like it when other people give updates. The hot water pipe still has not thawed, though I have been running those space heaters for nearly 24 hours now. Based on where the lines run and where I can get to with my space heaters, I'm guessing that puts the freeze near an elbow, which increases my odds of a burst pipe when it thaws. Who knows, maybe I'll get lucky? I had the sink handle in between hot and cold and a slow drip when it froze, so maybe that relieved enough pressure.\n\nTemperature says a high of 34 today, so maybe it'll thaw. 38 tomorrow, if not. I turned the hot water back on for now, but I guess I'll be in the habit of turning it off whenever I leave the house or sleep until the pipe thaws.",
            ">GMabbo\n\nUpdate: the hot water line appears to be working again! Pressure seems good and I don't hear anything behind the wall. Looks good so far! Thanks, Christmas!\n\nI did have one thought. I have been periodically checking for leaks using an inspection camera on either side of the cabinet that stands in front of where I think the freeze was. However, if there is a leak, it's probably going to be directly behind the cabinet. Any thoughts on whether or not I should drill a small hole in the base of the cabinet so that I send my inspection camera through? Then I could check the floor and the bottom of the drywall below the potential leak. I think the head of the camera is only about a quarter of an inch, so it wouldn't have to be a big hole.\n\nI don't really know much about burst pipes, but is it possible that they create a slow leak and not a flood?",
            "Got lucky and blew a seal???  I don't know but it'll take need a eye and some mending for sure.",
            "Alpharetta Georgia here.\nI believe my main line is frozen too. No water at all. Plumber told me there’s not much they can do and I’ll just need to wait it out until the weather warms up.",
            "I'm not a plumber, but I'll say the obvious that you or your brother has probably already figured out. It sounds like there may be two problems. If hot water is running generally and cold is not, there is probably a freeze in the line after it feeds into the line that goes the hot water heater and before it starts branching out to various parts of the house. This is probably somewhere near the water cutoff. Just follow the line from the cutoff until it starts splitting into a bunch of other lines, figure out which goes to the water heater, then go from there. In my house, this is all fairly easy to see, but I can't say in your brother's. If this happens to be somewhere near where the hot line runs up to the upstairs sink, there's your likely target. Otherwise, there's probably a second freeze somewhere. Again, I'm not a plumber, but there are just so many unanswered questions here, so I thought that I would respond to at least one. Best of luck.",
            "Update to my situation. As soon as the sun hit the side of my house where the pipes are located, I set my house thermostat to 80 and ran a space heater in my bathroom and closed the door. Within 2 hours, the water began to flow.",
            "Well, turns out I was just being too cautious on the quarter turn shutoff valve. Put a little more finger leverage behind it and it closed easily enough.",
            "PEX is one of the best pipes you can have although they are not freeze proof. It does better because it can expand and contract to a degree. The problem with freezing in pipes is it exerts around 20,000 PSI and that’s what causes breaks in water pipes during a freeze.",
            "We don't talk pricing here. If the pipe froze, you still have the issue that you had before he showed up. If you did nothing to address why the pipe froze, it's going to freeze again",
            "Open the wall and insulate the pipe or open the wall and run some heat trace along the pipe",
            "Just because you turned the water off and \"drained\" the lines doesnt mean you got all the water out. You'd be better off leaving a sink dripping. Most likely you had a spot that could t be gravity drained in the lines that froze",
            "PEX is the stuff you want. PVC can get rigid and crack.",
            "Go to your local plumbing supply",
            "You have a crossover it sounds like. Is it the whole house or isolated to a single area like a bathroom",
            "any advice please",
            "Does the water supply run through an exterior wall, if so it’s probably frozen",
            "Is the water supply running up through an exterior wall? I have the same thing happening but just with my cold water. It’s frozen because a 3 foot section runs in the exterior wall. It’s thankfully pex. I turned off the main water supply and drained the house of all water. I turned up the heat and will check tomorrow if it thawed. I’m also in Colorado. Let me know how it goes!",
            "I am wondering the same. I think it's ice, since my thawed lines don't make the same noise.",
            "Similar situation here: Chicagoland, new homeowner, copper pipes, hot water is only semi-functional (full bathroom works, half bath and kitchen sink are no bueno). I spoke with a plumber who gave me a lot of what I think is good information:\n\n* his prediction is that tomorrow/Friday is D-day for him working busted pipes—he said stuff usually starts thawing around here once the temperature is consistently above 10F\n* space heaters are fine, but hair dryers and heat guns are not—he recommended gentle, gradual heating of pipes we're trying to thaw (so putting the house at a warmer temperature, opening cabinets & the crawlspace for circulation, that kind of thing)\n* leave the drains open for now to allow water and gas a route to escape\n* if we spot a leak, turn off the water at the main valve—he recommended turning it off on the house-side (AFTER the meter) rather than the street-side (but either will do the trick!)\n* shut off the water main if we're both leaving the house (or if we just don't want to deal with monitoring & the stress)\n* for monitoring: obviously keep an eye on the open taps in case things resolve happily, otherwise keep an ear open for water running and this one is my current favorite stress tick—check the water meter compulsively! Ours is right next to our crawlspace entry so I spent today working in a chair close to both and just looking over every once in awhile\n* so yeah, if things go south and we do discover there's a busted pipe, then TURN OFF THE WATER AT THE MAIN VALVE AND CALL A PLUMBER\n* extra stuff: I was worried about how that works since gas heater=bad vibes, but he said if we turn off the main water valve we don't need to do anything with the water heater since it works by displacement and not direct water pressure from the pipes\n* however, if we do turn off the water, we should also turn off the ice maker in our fridge!\n* we live in a 1-story, so we don't have to deal with draining water if we shut things down (it'll most likely flood our crawlspace, still vvvv bad obviously, but better than other scenarios), but if you live in a multi-story that's a consideration\n* to end on a happy note: he said the vast majority of pipes will thaw just fine, but if it does blow, just visualize your steps: main valve, fridge, call!\n* and a note from my mom who had a pipe burst 20 years ago: it will sound like your kids broke something a room over\n\nSo those are the notes I took from the call. Hopefully those are helpful to you too. Godspeed!!",
            "If your not going to be home during the winter, winterize it. If you are going to be at the vacation house in the winter then fix the problems. Cut open the walls, insulate your pipes.\n\nOr go ahead and wait and flood your house when a pipe finally gets through. Nothing like a 3rd floor flood, except a 4th floor.",
            "I'm in the same situation. Cold water is frozen and the pipes are located upstairs on an outside wall. It's been 2 days. I just put a space heater on high in the bathroom and also cranked up my house thermostat to 80.",
            "When it gets really cold keep the heat up do not let it drop at night. I usually will crank up the heat a day before the cold comes to get a head start. Only when it gets really cold.",
            "Hope and a prayer are worthless in this situation. Depending on where you live this is inevitable and worth cutting the wall open to repair before it bursts and your not there and you flood 3 floors! Don't ever be cheap when it comes to doing it right.\n\nThough I do like how icicles look in the living/dining room...",
            "[removed]",
            "Space heater and hair dryer under the cabinets and at the exposed pipes in the crawlspace behind the shower. Finally got it thawed today.",
            "Our spigot was frozen. Poured hot water over it and it loosened up but no water coming out.  Going to drip the bathtub (closest pipe). \nMy question is did you leave your spigot open to relieve the pressure?  I have it about halfway open now.\n\nNote: we are on a slab and the corner of the house where the spigot is located gets zero sun.  \nThank you for any tips you have!!! \n\nHang in there everyone!!!!",
            "Are outdoor spigots usually connected to indoor faucets? \n\nMy kitchen sink is on an external wall and it’s the only faucet not working. The spigot on the other side of the wall took about 5 minutes to go from nothing to full blast. I was hoping that would fix the inside sink issue, but hasn’t yet. (It’s been hours with the sink faucet on w/o running water). I’m not sure if I need to try an upstairs faucet or another downstairs faucet either.",
            "Hot water freezes before cold. Dealing with that now in my 2nd story bathroom",
            "Strange, indeed!",
            "The water line to the hot side of the fixture is frozen",
            "Lol no. Hot water just freezes faster.",
            "I called the plumber and he said there's nothing to be done except wait for it to thaw. Someone else said they had success applying a hair dryer to the base of the water heater. I might try that, or a space heater.",
            "Same here but when we turn the cold water on in our guest bathroom, water comes on in the kitchen, when it’s on hot.  But if the water in the bathroom is off, no water.  I can’t wrap my head around it",
            "Thank you. I'm happy to say it started working when the temperature warmed up a bit. Last night we left the faucets dripping and had no issues this morning, thankfully.",
            "Fascinating. And strange that I've never heard of the Mpemba effect but have heard the term twice now in the past two days (the other time being someone who posted a video of them throwing boiling water and it evaporating immedatiely). Thanks for the response.",
            "Perfect 👍🏿",
            "That sucks, this time my sewage drain line froze causing backup, luckily that worked its self out after a the temps made it into the 30s",
            "I’m having the same issue, only my kitchen sink doesn’t have water flowing. Everywhere else in the house is fine. The main pipes are in the ceiling of the garage and I don’t know what to do. I bought a big space heater to heat up the garage and I got a small one underneath the sink going for a day now and nothing",
            "[deleted]",
            "Yes, everything is the same as pre freeze. It won’t be quite as cold since the wind chill is decreased, but I may drip them tonight out of anxiety lol. Our temps will be in the 20-30s after today.\n\nThanks for the feedback!",
            "hey u/SomeGingerFag \\- regarding your point about water pressure...  \nmy bathroom sink pipes froze (in chicago), they thawed and started working today, but now my hot line doesn't turn off fully (there's a tiny drip even when i turn it all the way off) and my cold line has water hammer when i go to turn it off  \nany ideas on how to fix? thanks in advance!",
            "Is this something a handy plumber could reasonably assess/fix? Or would it be essentially re-plumbing the whole house?",
            "the Mpemba effect, named after Erasto Mpemba.",
            "I think if your water heater is inside, and you heat the house to like 50 while you're gone you should be fine.",
            "That was it. I started thinking it may be the faucet just because nothing else made sense. Once you said it I went and took a serious look. Went to town on the underside of the aerator with a wrench and a pile of what looks like calcium deposits fell out. Water flow doubled immediately. I'll replace it here in the next week with a new one.  Thank you!",
            "I'm in the same boat. I opened all the cabinets and cranked the heat up to 78. Opened the faucets a little bit. \n\nCalled a plumber and they said there's nothing they can do and that's what they would do. Wife hears the pipes creaking atm. That was 2 hours ago when I started. I have pex piping. Maybe it's thawing. Hopefully something good is going to happen. Please something good happen.\n\nEdit: as if 1:20pm, water is now trickling in my house",
            "You need a water valve key.  Looks like this. Maybe?!? \nhttps://www.lowes.com/pd/Orbit-Water-Shut-Off-Curb-Key/3131069",
            "Thank you 🙏 I’m working storm work all weekend so it’ll be my better half at home. Trying to not have headaches while I’m working 😂!",
            "We have a slab too.  Pipes fine this morning but the shady side of the house sipot is frozen.",
            "Should I still leave the sinks in a partially “on” position??  I heard mixed opinions about it and I’m curious if any residual water will flow out once melted\n\nAlso, tomorrow is estimated to be ~30-32F high.  Think things will thaw by tomorrow??",
            "The left side is the incoming, right is outgoing. Id like to drain after (right) the valve so the water in the sprinkler system is let out.",
            "[deleted]",
            "It’s outside. Have hair dryer on feed line now inside enclosure.",
            "Thank you. I'll do this I just found the water heater. It's on the north side of the building. Likely getting blasted by the cold winds. Do you think it's possible the water heater has frozen?",
            "I'm in the house basically all day today so that's good. I checked the washer (which I think is along the same water intake line as the sink, if I'm right about how the pipes run) and it's running cold water fine. I also haven't found any obvious water leaks.\n\nMy spouse thinks it's an issue with the faucet, and is going to take a look at it once home. All I can do after that is call maintenance on Monday once the office opens...",
            "Word. Thanks for the commiseration. \n\nWe just went out to buy a space heater for the closet the water tank is in, hoping that maybe heats the piping. We've had this issue but only with the total water supply, not just hot.",
            "But if it blew a seal, then wouldn’t it still be leaking now when we turn the water on? Cause it doesn’t seem to be leaking at all now. It’s such a weird issue.",
            "Thanks for the reply!",
            "[deleted]",
            "[removed]",
            "It’s bypassing through a fixture ~~upstream~~ downstream of the ice plug, sending cold water into the hot system towards the kitchen",
            "You might have a bit of dirt in the cartridge of the faucet that's leaking. Pull the cartridge and see what it looks like.",
            "No idea; it would totally depend on the construction of your home and would likely be an extensive repipe. Blows me away how houses in the southern states are constructed, especially in areas where it’s less than rare to have cold or freezing temps.",
            "I’m not sure how that explains my phenomena. Explain",
            "Thank you!! Thankfully our pipes did not freeze.",
            "Hoping that helps!",
            "I think it's funny how widely accepted that is about hot water freezing faster thought it's almost always not true.",
            "Yeah my brother does plumbing in California whereas we both started doing it in the NE. He says southern/ west coast plumbing is easy mode. Tankless heaters installed outside under roof awnings, like wtf. Shouldn’t be allowed but it is",
            "Thank goodness!  I know a lot of families are having it rough right now!",
            "Yes, we are very fortunate! Hope you and your family are doing okay as well!",
            "We are!  Heading to Florida tomorrow for some warm weather!"
        ]
    },
    "WTF is that?!": {
        "title": "WTF is that?!",
        "score": 202,
        "url": "https://i.redd.it/zm19n8su9y7d1.jpeg",
        "content": "",
        "num_comments": 109,
        "comments": [
            "Mold.",
            "What does it taste like?",
            "Holy shiet, put that thing in trash and don’t touch it.",
            "Your toilet has probably been running, and your bathroom is probably hot/ humid perfect storm for mold",
            "Brother UGHHH",
            "You’re not supposed to crap in the upper tank, use to lower tank.",
            "IT'S ALIVE!",
            "I would give up at this point and throw the toilet away.",
            "This is great content for r/BathroomShrooms.",
            "You have discovered a new mushroom lol",
            "Baby tribbles! Kill it with fire!",
            "Surprised that nobody ever opened the lid to see. Seems like that would take years to grow",
            "Looks like a stuffed animal of some sort.",
            "Nasty is what it is. Time for a trip to Home Depot for new toilet parts. Don’t forget gloves and a mask before you touch it and tie it up in a bag after you remove it. Get a complete replacement kit and change everything. They’re only about $20 and it’s really easy to do.",
            "Ass fungus. I performed a remote thermal optical zoom microbial A.I. enhanced scan with a septomologist lens attached and all indicators suggest, but cannot definitively confirm that this is clinical 'ass fungus'. The clinical term is fromunda cheese.",
            "That’s new. Da fuq",
            "Oh, that’s Kohler’s Premium Mold line of bath products.  You must be from old money.",
            "I have never seen that before",
            "I think someone pulled an upper decker and the turd sat for some time",
            "Not one drop of chlorine",
            "Fun Gus",
            "Mold",
            "That's, interesting.... never seen that before.",
            "In a newer kohler too",
            "What does it taste like?",
            "Hydroponic magic mushrooms",
            "Brother ewwwhhhh",
            "That is a new toilet swap.🤣",
            "Isn’t that how anthrax starts, just kidding, but definitely wear a mask when you clean that out. also make sure you’re not covering your toilet with plants or other objects that may interfere with the ventilation.\nnormally, there’s a small half moon hole on the back side of the toilet for that\ninstall or use your vent fan in your restroom. to prevent mold from growing.",
            "There’s fungus among us.",
            "Free Penicillin",
            "Mushrooms.",
            "IT LIVES!",
            "It's not your house anymore.",
            "Roquefort. Usually aged in bidets. But that is the more expensive Caves du Toilette process.",
            "Mold",
            "I think this belongs in r/mycology",
            "Mold?",
            "The start of the zombie apocalypse.",
            "Doorbell Transformer! ….. oh wait, no.",
            "Someone is saving hair??????",
            "Serious question! What is this type of valve called? I desperately need spare seals",
            "Wow. Bathroom needs some ventilation",
            "The son of Ol' Drippy.",
            "Mold or mushrooms .",
            "Does it purr when you pet it ?",
            "[Huitlacoche](https://images.app.goo.gl/2cc86hrkokSE5pwa6)",
            "Toilet rebuilds are easy but I’d probably just replace the whole toilet at this point just so I don’t have to touch that.",
            "Lick it",
            "Can I pet it?",
            "It's a penicillin factory - enjoy",
            "NEED A LOT OF FIRE. NOW!!!!",
            "You have discovered a new life form",
            "This is why so many plumbers didn't get COVID, we play in stuff that eats COVID 😂😂😂😂",
            "Fungus among us?",
            "Mmmmm, forbidden cotton candy.",
            "A really bad case of mold",
            "Pipe insulation!",
            "Hahaha, fluffy anal beads?",
            "Forbidden cotten candy",
            "It’s the forbidden cotton candy.",
            "How does it smell like? Please describe",
            "Looks like somthing I would burn with map gas before touching it!",
            "Bit of a science experiment going there.",
            "This should be in r/Fungi",
            "I've seen a fossilized snail in a toilet tank but NEVER anything like this. And I've seen inside hundreds of tanks",
            "👍🏼",
            "Do you have a hot water line feeding your toilet instead of cold? Could be that.",
            "Extra protein and a snack on the throne",
            "I've never seen that before.",
            "Looks like smoke billowing from a full valve",
            "Try asking on r/bathroomshrooms",
            "Lick it go on!",
            "Mold!!!!",
            "That’s one dirty straw boys",
            "put bleach in tank",
            "That is inside that a toilet TANK \nLooks like it’s been working pretty good shut the top\nBack up\nBetter yet why don’t you clean it",
            "Bottom of the tank is real clean tho 🙂",
            "Or, hear me out, Dinner...",
            "Shitmold",
            "The forbidden fuzz..",
            "Tribbles",
            "Amoxicillin.",
            "It taste a bit like the speeches given at a VIP event at mara-lago.",
            "Cured syphilis",
            "Went in a bucket, and that bucket is now in the trash!😂",
            "Indoor air quality is no good. Kitty litter box in the bathroom or pets with long hair?",
            "I imagine it’s always humid in that water tank.",
            "The old Upper Decker!",
            "I thought that’s where I was at first",
            "I had to check and yes this a real subreddit.",
            "Who opens their tank when they are enjoying their morning shit? Too many other factors involved. We missed 17 suggested tiktok vids, 5 I.G., 42 Y.T. shorts, 25 of them about the Tyson/Paul fight, and the rest, russian bots trying to convince us tRump is special.",
            "Or something that came out of a car!🤣",
            "Zoom in on the Pic. Bottom left of the tank label has a few part names and numbers.",
            "Tabasco or Old Bay?",
            "Finally a cure for OPs raging gonorrhea",
            "They give this on the island.",
            "🤭",
            "Then put that whole trash in the trash.",
            "Now, soak it all in gasoline or high % liquor and light a fucking match. Whatever that is. It's unacceptable behavior and won't be tolerated.",
            "Dude, I have a toilet, used frequently, doesn’t have the little box or shower that’s used and looks like this. The ones in the bathrooms that have insane amount of humidity and little box perfectly clean.  Don’t get it.",
            "Bathrooms tend to be more humid in general",
            "Or CAT!",
            "Nah. She deserve that Melinda heat.",
            "The drip drip drip of gonorrhea",
            "FYI in communities where they provide you a matching trash and recycle bin, they are a recyclable plastic, so you could put the trash can in the recycling bin once it's emptied after garbage pickup.",
            "Hmm good choice. I haven't had Melinda's in a while.",
            "Ayeeee😎"
        ]
    },
    "Reconnect my spigot": {
        "title": "Reconnect my spigot",
        "score": 4,
        "url": "https://v.redd.it/g0y33mghy38d1",
        "content": "I have zero plumbing experience. What’s the best way to reconnect my outdoor spigot?",
        "num_comments": 11,
        "comments": [
            "You will need to buy tools. If tools and parts cost is the same as hiring a pro… hire a pro. Unless you wish to learn. So if you decide to learn…Pex (Pex b) is the way. Buy pex b crimper from Amazon. Then run to Lowe’s or Home Depot and buy a T pex b. Buy flexible tubes. You will also need an adapter from solid pipe to pex. You may need to buy a pipe wrench too to remove the cut pipe connected to that red pipe  valve.. install the adapter to pex (solid to pex adapter). shut your water near your meter… by twisting it clockwise (form T shape to shut water).  Then cut the white pex where the red pipe crosses (path) - then insert the T connector then connect a new pex and connect it to the newly installed pipe adapter (red pipe).",
            "Lol \"shit they've got it all fucked up\"",
            "Call whoever fucked it up in the first place to have them reconnect the line.",
            "Lol",
            "I really fuck with the way you said “SPIGOT”",
            "Although I have a weird infatuation with brass and ancient spigots… for this guy it sounds like it’d be best to just replace it altogether. He’d have to get pipe wrenches and try to loosen the nipple out of the old valve that probably doesn’t hold anyway. If he can manage that and get a pex male adapter in it he can do what you said and he’d be good. That pipe needs to be strapped up for sure though.",
            "Take a picture of the valve (red pipe)… show Lowe’s or Home Depot what you’re trying to accomplish and they will point you to what to buy. Watch a few YouTube vids on how to crimp pex b and how to crimp a few connectors like the T connectors. Practice one or two crimping connectors to the flexible tube (pex b)before tackling the real job. Note: be aware that there is also pex a… pex b is more reasonable in cost and easy to learn. Again stick with pex b.",
            "I’d have to call the previous home owner and ask for them to sort it out 😅",
            "Sounds like a slur somehow",
            "Thank you soooo much! Reddit is a beautiful place. This was done before I moved in. I have all of the tools. Transitioned from car mechanic to the countertop industry. Won’t need to buy anything other than the plumbing parts! I’m a Home Depot fella, it’s closer, so that’s gonna be my only deviation from your suggestions.",
            "Then time to call a plumber."
        ]
    },
    "Plumber chipped my toilets tank": {
        "title": "Plumber chipped my toilets tank",
        "score": 220,
        "url": "https://www.reddit.com/gallery/1dl47su",
        "content": "I called a plumber out to deal with a deep clog with a new property of mine late last night. Once he got here he got the job done and fixed the clog and I had to leave right after. This morning I see he actually chipped the tank on this brand new toilet. I paid $480 for the service. The chip is stable (from all ways I could tell) and is at the the top.\n\nAny advice on what I should do? Should I call the service back and let them know and ask for a partial refund? I don't really have time to get an entire new toilet. Any professional way I could fill this?",
        "num_comments": 50,
        "comments": [
            "That's a replace from the plumber!",
            "Mistakes were made a reputable company would own it.  I've cracked a tank before and owned it and replaced it same day.",
            "Plumber is going to replace it!",
            "The way it could work is that the plumber gets paid for services provided and he supplies & installs a new exact replacement toilet, look$ like a one piece model.",
            "Plumber Pays.",
            "That plumber owes you a new toilet.",
            "That’s a him problem call him and get it resolved",
            "Lol I wouldn’t ask for a partial refund. I’d get that shit replaced. If you got that fixed yourself you’re probably looking at a $200-$300 visit from another plumber plus the actual cost of a new toilet.",
            "Plumber owes you a toilet.",
            "Gotta replace. No way around it.",
            "He needs to replace it.",
            "While they should repair it, stuff does happen that isn’t the fault of the plumber, could have been cracked and he was the unlucky person that made it worse.",
            "Are you sure he broke it?",
            "Here in Europa you can not replace only the tank lid. You have to replace the whole ceramic tank.\nWhent they make the tank they make both pieces as a unit.\nIf we had one piece toilets here you would have to replace the whole toilet.\nAnd to be honest it's hard to brake the tank like that. You need to be very clumsy to break it and very unprofessional to hide it.\nGood luck!",
            "call and politely request them to replace the damaged part of the toilet. but honestly, any reputable company wouldve have made you aware of the damage right away, its super obvious and noticeable. im wondering if you're trying to scam a free toilet tank tbh. it wouldnt be the first time a plumber has chipped a toilet tank and it also wouldnt be the first time a scumbag customer tries scamming a plumbing company. again, why wouldnt they make you aware right away?",
            "Well the first thing you should do is contact the plumber / Plumbing company and ask them what they going to do about this. You have to at least make them aware this happened.",
            "The only fix is a new tank, if it’s a new toilet they might be able to source the tank itself",
            "But like how, why? If the toilet is clogged you don’t even need to touch the toilet tank, let me know if i am wrong. Or maybe he was removing a toilet to solve the trouble, but once again, was he placing it upside down to do something or how? I mean it’s the front side of the tank 🤔",
            "Okay",
            "That looks Ike a one piece toilet as well so should need to replace whole toilet for that",
            "We all carry insurance. I have never broken someone toilet and would know it if I did. Definately call him, tell him the make and model of the toilet and ask him to replace it for you. Heck give me his # and I will do it for you.",
            "Toilet tank lol",
            "They owe you a new toilet. \n\nPretty cut and dry.",
            "It can be fixed.  Not sure about where you are but an outfit called New Creations(it’s a franchise) does fixes and touch up work.  I had a big chip similar to this on a farmhouse porcelain sink and the guy came a filled, painted and buffed it and it’s been years now and I cannot see the repair. It’s completely invisible and it was right on the front edge of the sink.    I’m sure there is a similar company or service in your area that could help.  Then the plumber can foot the bill",
            "The fact the guy didn't say anything says it all for the probable outcome here.\n\"It wasn't me, you saw before i left and paid me\"",
            "Ramen noodles a little super glue....\nBoom! Good as new",
            "Plumber should have no issue tracking down that toilet tank, or toilet itself for replacement.  \n\nIn the meantime, at least it's not a lateral crack, so you should be able to use it until they replace it for you.",
            "Noodles and superglue, right as rain.",
            "There goes most of his profit",
            "Shoot him in “self defense”, its the American way",
            "[https://www.homedepot.com/p/Super-Glue-5-oz-White-Porcelain-Repair-Glue-Epoxy-19061-6/205517039](https://www.homedepot.com/p/Super-Glue-5-oz-White-Porcelain-Repair-Glue-Epoxy-19061-6/205517039)",
            "White paint try and get a discount ",
            "But is it leaking? Ppl make mistakes, and it should be taken care of. \n\nSide note, if it was me, I would've flipped the tank around if at all possible.",
            "Plumber I hired to install a vintage pedestal sink broke it trying to remove the old faucet.  He was up front about it, said to deduct the cost from his bill — I got it from architectural salvage.",
            "This looks like a one piece toilet though. Ouch. They should still cover it, but it sucks a lot more than a cheap and simple tank swap.",
            "It would be very easy for the plumber to claim that it was like that when they showed up. \n\n  \nCase in point: I had a guy clearing moss off my roof and cleaning gutters. My office overlooks the deck where they were working. I'm kind of half-watching and working online, as I notice one of the guys setting up a ladder to climb up on the roof. (about 7'). I think...that's not properly braced...and sure enough, it slips. He resets it, climbs up on the roof...and as he's going back down to the ladder, bumps it, and he and the ladder fall down to the deck. He gets up, looks around, and picks up the ladder....and sees the whole in the screen that the ladder made on the way down. \n\nI come downstairs and out to the deck - the guy seems find, but there are two screen windows damaged (frame and screens). The owner is saying the screen was already like that. \n\nI say...would you like to see the video of the ladder falling and hitting the screen? If I hadn't been watching, he would have tried to pin it on me.",
            "This is one reason you should stick around when someone does work in your house.",
            "Us Americans really do live in your head rent free huh.",
            "I found this pretty funny tbh",
            "Flipped.. it around? So like. Hide the chip so it's facing towards the wall? \n\nFirst off that wouldn't work..  Given that the supply would be on the wrong side..but also more importantly thats some hack level shit to try to hide your mistake.",
            "Lmao rip 😭",
            "Know what else would cover it? An oversized doily! \n\n^^^^(KIDDING ^^^of ^^^course)",
            "Im american!",
            "🔫 bang bang teach em a lesson!",
            "Eh, I lived in a lot of shitty apartments where they don't repair anything.\n\nYou do what you have to do to make your home better when you are broke.\n\nBut hey I'm glad you fancy pants get to have things repaired or replaced without getting an eviction notice or threats from your landlord.\n\nMust be nice",
            "“It hurt itself in its confusion!”",
            "You're getting downvoted because from the way you worded it.. it sounds like your the plumber in this situation and not the homeowner/renter. Don't think someone renting is paying 400 out of their pocket to have a drain snaked.",
            "You sure did! Thats all good tho!",
            "Oh ok yeah I see it now"
        ]
    }
}