{
    "The Official Polandball 2024 Calendar - June": {
        "title": "The Official Polandball 2024 Calendar - June",
        "score": 311,
        "url": "https://i.redd.it/sa6hor3zw64d1.png",
        "content": "",
        "num_comments": 27,
        "comments": [
            "The new year has come once again, as 2023 has faded into the sunset and 2024 has risen to replace it with the morning's light. As is tradition, /r/Polandball has put together our greetings to the new year in the form of our annual Calendar for 2024.\n\nHowever, if you've kept track with previous calendars, you might be wondering \"wait, where are the other 11 months of the year?\" Well, to spice things up for the new year, we're opting to release the calendar month by month to keep the interest rolling along throughout the year! Be sure to tune in at the start of each month to catch what we've been working on!\n\nOver the course of the several-long-month gestation of this year's calendar, 30 artists have put their pens to paper and made some great art for this project, but of course, you'll have to wait to see some of their art.\n\n---\n\n[**You can learn more about what every panel represents here!**](https://imgur.com/gallery/EX42Oz6)\n\nOf course, the Calendar is made to be enjoyed all year:\n\n* The **sidebars of both /r/polandball and /r/PolandballCommunity** will be updated daily to display the day's panel.\n* **[Moderator /u/AndyRedditor has once again produced a widget for the Calendar that you can download and install!](https://drive.google.com/file/d/1-tIfW9hqi-UMaT86B3VSIPfZHNqcYkeF/view?usp=sharing)** Download the file from the link, unpack it, and follow the instructions in the README file. Note this is Windows only (sorry Mac or mobile users).\n\n---\n\nA big thanks to all the participants in this project:\n\n* /u/AndyRedditor\n* /u/Aquoteunquoteperson\n* /u/bananasAreViolet\n* /u/BioEditr\n* /u/Bkfootball\n* /u/ChiChiStar\n* /u/Diictodom\n* /u/Fine-Significance832\n* /u/jackson_games_cb\n* /u/Kimiimar0\n* /u/kolbiitr\n* /u/lemondog1132\n* /u/Lord_Asker\n* /u/Marzipanbread\n* /u/mel_bell123\n* /u/Mr___Somebody\n* /u/NagikaKomatsu\n* /u/_Newan_\n* /u/OfficialMoffe\n* /u/Ok-Army-9509\n* /u/Please-let-me\n* /u/PopeInnocentXIV\n* /u/propanolicanni\n* /u/r42623\n* /u/RZ_923\n* /u/RayDeeUx\n* /u/stopinfidel\n* /u/TheAverageSpaniard\n* /u/TheUnknownAaron\n* /u/TokioHot\n* /u/Watmaln\n* /u/woryok\n* /u/xBlueberr_y\n* /u/Yahgoh-sleep-8945\n* /u/Youmg44\n\nAnd last but not least, to our organizers:\n\n* /u/AndyRedditor\n* /u/Paraguay_Stronk\n* /u/AaronC14",
            "hello. polen in the fridge",
            "Hell yeah good job everyone!",
            "These are beautiful!",
            "I'm real happy with how my panels came out. Onward to July!",
            "I'm news to this, what do all the days mean?",
            "Anyone got a link to the Luxembourg one?",
            "What's June 8th?(That's my birthday btw)",
            "Love that Union independance day was represented in Junes calendar",
            "i think that this calendar was way more Eurocentric than the others. It always nice to have more of you know the rest of the world.",
            "Is Sweden holding ikea's meatballs in the june 22?",
            "How the hell i wanna join the calendar project do we have to sign up?",
            "13th, 27th and 30th are especially wholesome 🤗",
            "Psst...\n\nOn june 2 one of yours wrote \"festa della republica\".\nThe \"b\" isn't just one. Just to say, not to hate or anything, obv.",
            "Ye, lil polen chilled snack along with other stuff that I put in there",
            "All of them are tied to holidays and/or historical events.",
            "Damn those Europeans and their simplistic, tricolor flags!",
            "It's \"Festa della Repubblica\" There are 2 \"b\" not 2 \"p\" ",
            "he is vigilantly guarding the fridge",
            "What's June 29?",
            "I'm an idiot, my bad",
            "Read the Polandballbot post in the comments. You'll find a link to an Imgur album with all the panels that have explanations for what everything is."
        ]
    },
    "Burj of Babel": {
        "title": "Burj of Babel",
        "score": 620,
        "url": "https://i.redd.it/vqxn5odnv28d1.png",
        "content": "",
        "num_comments": 18,
        "comments": [
            "References Arab Gulf States' tendencies to import cheap foreign labour to build whatever giant skycrapers they feel like and the [The Tower of Babel.](https://en.wikipedia.org/wiki/Tower_of_Babel)",
            "I would like a translation of the countries lol.",
            "Lol, Nepal just straight up talks dinosaur! 😂",
            "90 percent immigrants, 10 percent Emiratis…\n\n\nHmmm…",
            "Where is your star?\nIs it far? Is it far? Is it far?",
            "Fucking nepal lol",
            "\"cheap foreign labour\"\n\nthat's a euphemism for slavery",
            "Well the cycle goes something like this \n\n- Manager/CEO is one of the nationalities in your comic \n- they bring in all the labour from the countries and oversee the projects through their connections \n- the gulf states partners exist only to meet the nationality requirement for the companies",
            "I find it strange how the Islamic tenets of charity and hospitality jive with their demeaning and inhumane treatment of nationalities they deem to be poorer",
            "The Indian one is saying \"Pardon me?\"\nThe Pakistani one is saying \"What did you say?\"\nThe Bangladeshi one is saying the same as well.\nNepal : *rawrs*\nIdk about the rest",
            "No idea, just asking, do they kidnap them and forbid them to quit their job?",
            "Rich people are assholes. More at 11.\n\n\nThis shit exists **everywhere**. All your canned tomatoes? Slave labour from Italy. Clothes? Bangladesh, India, Vietnam, or Pakistan.\n\nFarming? Slave labour.\n\nIt's not just an Islamic thing like you're suggesting. It's a rich person thing.",
            "I just relied on ChatGPT and Google Translate for these so it's reassuring that at least some of them are right lol.\n\nBangladesh - কি বললেন - \"What did you say?\"\n\nIndia - क्षमा करें - \"Pardon me?\"\n\nPakistan - کیا کہا - \"What did you say?\"\n\nSri Lanka - මොකක්ද - \"What?\"\n\nSomalia - 𐒑𐒖𐒄𐒖𐒖𐒆 𐒂𐒘𐒇𐒘 - \"What did you say?\"\n\nNepal - \"Rawr\"",
            "The Indian one can also be interpreted as \"Have Mercy!\", which given the situation makes sense.",
            "They get them to sign very restrictive fixed contracts, make them live in slave-like conditions and often take away their passport until their contract is over. \n\nIt's essentially indentured servitude.",
            "Nepal - \"What in the rawr did you just rawr?\"",
            "For accurate translations I can recommend [DeepL](https://www.deepl.com) btw, far better than what Google or ChatGPT translates."
        ]
    },
    "Joyriding": {
        "title": "Joyriding",
        "score": 284,
        "url": "https://i.redd.it/27sd2bl2z38d1.png",
        "content": "",
        "num_comments": 25,
        "comments": [
            "I had trouble formulating a punchline for when Kim and Putin were driving the other day but I couldn't find any. So I had to resort to a very, very, stupid pun in the end. \n\n***CARS-IN-MY-GENETICS = Carcinogenic*** (aka stuff that causes cancer)",
            "I love how Russia was just sucked into the car. The car straight up drank em",
            "Seems like Canada and Japan have something in common if you get my drift fellas 😏😏😏\n\n(Why am I like this)",
            "10/10 terrible pun, would laugh at again.",
            "I like how this implies Canada was masturbaiting to hentai in public",
            "America has Pica.",
            "USA is like a amoeba. He consumes everything, that get close to him",
            "we have kirby and the forgotten land at home",
            "The Strongest Lada Driver vs The Weakest Ford Driver.\n\nWhy is Canada viewing CP instead of helping his fat brother? Is he stupid?",
            "Carcinogenic actually.",
            "More like he went into the car like Jell-O.",
            "And than he just became smaller in the car lol",
            "They’re both degenerates.",
            "Thanks for catching the typo.",
            "I thought it’s the fact both their flags have only red and white.",
            "I was gonna say \"well, looking at your flag...\"\n\n\nBut then I looked at *my* flag...\n\n\n😶",
            "It's actually a pretty massive club\n\nhttps://www.reddit.com/r/vexillology/s/fiaPGxXWNY",
            "Danes are degenerates though /s",
            "Red and white gang",
            "Luckily my flag… never mind",
            "Malta and Peru don’t count"
        ]
    },
    "Interpretation": {
        "title": "Interpretation",
        "score": 1141,
        "url": "https://i.redd.it/xzi36kzhvx7d1.png",
        "content": "",
        "num_comments": 59,
        "comments": [
            "Hello all!\n\nThis comic has been made as part of our May Contest: *Make a comic about evolution!* If you've got a good idea for a comic in this vein, or are just curious about the theme, head on over to [the contest thread](https://redd.it/1cjc7rq) for details and get started on an entry!\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/polandball) if you have any questions or concerns.*",
            "Hi yall, submitted this 2 minutes before the deadline so thats something (i was very busy today)\n\nOh hey it's also my first comic after like half a year so that's cool\n\nTried experimenting with this type of art style with the pure blacks and stuff. My goal was making this look like an actual comic book, and I think it turned out pretty well. I tried searching for a comic-like font (at first comic sans but ofc i'd get bonked by the mods). I found some that were nice, but in the end I just hand-lettered the entire thing :v ^(\\*by tracing text)\n\nalso [the conquest of constantinople](https://en.wikipedia.org/wiki/Fall_of_Constantinople) is the thing in the comic (remind me tmr to do a detailed description)\n\nAnyway.. if the engrish is cringey let me know, and I hope this fits / and allowed for the contest!",
            "What's the story behind Venice's tentacles ? Is it because it had a lot of spread out islands ?",
            "It‘s a piece of art!",
            "The art is so beautiful :D",
            "The art style is simply gorgeous.",
            "Quite possibly some of the best polen ball artwork I have ever laid my eyeballs upon",
            "your art style is fantastic :)",
            "I love the way you articulated my country venice’s tentacles, beautiful",
            "Ne mutlu Türküm diyene, let's go 1453!",
            "The comic-y art is so adorable… especially in panel 5 with the Byzantine Empire 🥺🥺",
            "I dont understand anything lol",
            "I have a similar reaction to (modern) cannons 🥺🤩.",
            "This is excellent, bravo OP",
            "Amazingly drawn",
            "Cool art i love it",
            "Ashen Byzantine ball in the last panel is best ball.",
            "This is beautiful.",
            "Your art is spectacular. Great job on this one!",
            "Man 1453 was worst year of my life",
            "no one expects the ~~spanish~~ ottoman ~~inquisition~~ invasion",
            "This is phenomenal, well done.",
            "Can someone translate the comic? I have a really hard time understanding the broken English.",
            "I hallucinated hearing Ceddin Deden at that last panel.",
            "Holy crap, this is phenomenal 🤯",
            "hey guys peter griffin here to explain the joke\n\n**Panel 1-2**: In his dream, Byzantine sees a really tall Hagia Sophia, a Fortress (with his flag), and a really big cannon. Hagia Sophia is the icon of Constantinople. So a wall between -it- and a cannon could suggest a siege on the city is about to happen (in hindsight i prob should've made the cannon facing the fortress)\n\n- All of Venice's phrasing are a bit vague and actually have a double perspective -\n\n**Panel 3**: Venice's explanation on the Hagia Sophia is that it means \"Byzantine will soon have a large amount of religious people\". This could mean a big increase in piety in Christianity, but as it turns out it's actually a bunch of Muslims coming and conquering the land. Either way, the wording fits  \n   I'll also point out how in the background of the Hagia Sophia, you could see a minaret. ^((foreshadowing!!!))\n\n**Panel 4:** Constantinople did become greater. Just... not under Byzantine rule^(\\[citation needed. didn't do research on this\\])\n\n**Panel 5**: Venice says Byzantine will have a cannon outside the city walls to fight the enemy. He did very soon, and the cannon belonged to the Ottomans and enemy was him instead (could've phrased it better tbh)\n\n**Panel 6-7**: All of the things Venice said comforted Byzantine into thinking there wouldn't be a siege. Everything he said was true, but I guess he was not too keen on the details, as that actually ended up happening\n\nFun fact about this comic, I recorded myself drawing this in mspaint. So I might make some kind of 'making of' vid on this later",
            "This has got to be the winner.",
            "It turned out really well! Youre a talented Polandball artist, and quality over quantity is the way to go. 😄",
            "It's because of the [Venetian Flag](https://en.m.wikipedia.org/wiki/Flag_of_the_Republic_of_Venice), which has those weird strips at the end",
            "I think that’s how their flag was",
            "Also the way the flag itself is, pardon me for not using the correct terminology but the flag of the republic of venice has 6 strips coming out of it, instead of just being a rectangle otherwise",
            "Every comic's a piece of art!",
            "as with other types of comics, what matters is in the joke ;)",
            "Thank you! But for me that award would go to [Katalpa](https://www.reddit.com/r/polandball/comments/9v8wm2/balloon_fight/), [Blackbeardstp](https://www.reddit.com/r/polandball/comments/hhx5t7/space_1899/), and [Diictodom](https://www.reddit.com/r/Polandballart/comments/kpcdv1/abbasid_empire_in_a_blackout/) :v",
            "aye thanks",
            "Believe it or not, I actually had quite a hard time to draw them since it's my first time doing so in a comic. So it's cool it turned out well!",
            "glad u liked it!",
            "Some info about Venezia's explanation\n\n1. Hagia Sofia will have many religious people in it:\n\nHagia Sofia got turned into a mosque\n\n2. Constantinople will become great:\n\nIt did become great, just not with Eastern Rome.\n\n3. Big cannons to combat the enemy:\n\nOsman used cannons made by Orbán (not Viktor) to penetrate the city's walls",
            "thank you!",
            "Thanks!",
            "-Venice! I had a dream last night. Can you please tell me what it means?\n\n-Ok\n\n-I saw Hagia Sofia standing tall, then a fortress with with my flag, next a big cannon. Could you explain? \n\n-Good. Hagia Sofia will soon have a large amount of religious people. [Translator's note: it was a very large church in Constantinople]\n\n-Second, Constantinople will become great. \n\n-Third is very simple. You will have big cannons outside the walls to fight the enemy. \n\n-Phew, I almost thought I was going to be invaded. Thank you, Venice. \n\n-You are welcome. Now I must go. \n\nAlso, check this out:\n\nhttps://www.reddit.com/r/polandball/comments/1dl60ne/interpretation/l9ml03j/",
            "You could say Constantinople became great again.",
            "Making of, great idea!",
            "inshaallah my bro",
            "Thank you very much. And \"quality over quantity\" is certainly a way of saying that lol",
            "Yeah you are right.I was looking for a deeper meaning lol",
            "They came out fantastic you should be proud of this art",
            "What is it with orbans helping enemies of europe",
            "I think I should've made it more clear on that explanation on the Hagia Sophia:\n\nI meant it more like \"you seeing hagia sophia standing tall means that you will have a large influx of religious people in your *land*\", not just the church/mosque. But either way the joke of the wording still works lol\n\nNice job translating the engrish though!",
            "Ah yeah, should've used that instead (doubles as trump reference)",
            "This Orban guy was the 15th century equivalent of a mad scientist, he asked for too much budget (and compensation) from the then-emperor Constantine XI for a cannon that could only be fired a hundred times and killed its operators (including Orban, ironically).   \n  \nMehmed II, exentric in his own right, of course opened the treasury for him.",
            "You give me money I work for you. It's that simple.",
            "You are right, I was a bit too literal. Oh well, you know what they say about translations: they are like women. They can be faithful, or they can be pretty.\n\nThank you very much for the compliment (great comic, btw, we need more Byzantium on Polandball)",
            "It’s fine. Btw your art is awesome"
        ]
    },
    "Philippines Takes a Piss": {
        "title": "Philippines Takes a Piss",
        "score": 1913,
        "url": "https://i.redd.it/9lvyrsh1yw7d1.png",
        "content": "",
        "num_comments": 50,
        "comments": [
            "How big is the men’s toilet\n\njesus christ it must span the solar system with that amount of urinals",
            "Im now seeing a bare handed vs sword fight in the middle of the ocean. I'm just gonna grab the eyepatches just in case.",
            "You forgot that urinal was under Chinese protection during the Tang dynasty period, and therefore, it's rightfully Chinese Clay. We all are just jealous of the Heavenly Empire with their 100 Mandate of Heaven. There is no unrest in any of the Chinese provinces.\n\n\nNow, where is my government sponsored wife, Xi?",
            "In unrelated news, China decided to fuck over the Philippines again when the [Chinese Coast Guard intercepted and seized two Filipino ships literally sailing outside of the Philippine’s maritime boundary.](https://apnews.com/article/south-china-sea-philippines-second-thomas-shoal-75c2ecc0804d1160e691f6e066c88f10)",
            "China would be claiming Philippines pee.",
            "3000 Water cannon equipped Heavy Crusiers of the Chinese navy",
            "That's why I always go into the sitting toilets with lock, door and walls.",
            "You forgot the hole the Chinese boat received when it rammed the Philippine fishing boat.",
            "Thank you for this comic my day is now slightly worse",
            "China has gone too far this time, violating the bathroom bro code? Nuh-uh-uh.",
            "I was expecting China to walk away, Phillipines never to be seen again",
            "I thought Philippines was gonna get raped for a second there.",
            "Only big enough for the tiny clays. Which is why China entered the washroom in the first place.",
            "Another result of overpopulation",
            "About as big as the South China Sea…….. the clue is in the name……..",
            "China have lots of people.\n\nhttp://www.enping.gov.cn/gzjg/enping_dahuai/zjgk/201902/W020190203543320432857.jpg",
            "It's infinite because it's the urinal rooms",
            "This is about the same size as the bathroom in the movie theater I usually go to. Seen it full too.",
            "Don't tell the Somalis, South China Sea is exclusive for to plunder its booty.",
            "I read somewhere that if we take China's logic to it's end point then India can claim the whole of China",
            "That's a bad argument, similar to those made by Danny Danon, Israel's ambassador in his \"This is the deed to our land\" speech. \n\n[let us discuss our first pillar of proof the Bible. the Jewish people's right to the Land of Israel is mentioned over a dozen times in the Torah the Hebrew Bible; which includes the Torah the Old Testament the prophets and the writings in the book of Genesis the very first book of the Old Testament God says to Abraham.](https://youtu.be/vqgchSV2cn8?si=6y__-HuZfGgkV4jz&t=193)",
            "China, when all their neighbours hate them: *confused Pikachu*",
            "The ship on the first image looks like its is about to sink any moment, the Chinese might not want to sail close to that.",
            "There was also another recent incident where Chinese sailors attacked Filipino coast guard (I think) ships with knives and an axe, taking 7 Filipino guns in the confusion and stabbing inflatable life rafts such that they were rendered useless. One Filipino guy also lost a finger in the brawl. Go and look it up on CNA, I’m too lazy to put a link.\n\n  \nEdit: fuck it, here’s a link: [https://www.channelnewsasia.com/asia/chinese-sailors-wield-knives-axe-disputed-sea-clash-philippines-4423361](https://www.channelnewsasia.com/asia/chinese-sailors-wield-knives-axe-disputed-sea-clash-philippines-4423361)",
            ">Chinese Coast Guard intercepted and seized two ~~Filipino ships~~  two Philippine rubber boats literally sailing outside of the Philippine’s maritime boundary.",
            "1000 year old maps of China containing Filipenis pee will surely solidify China’s maritime sovereignty.",
            "I already made a comic for that like 6 yrs ago. Lol",
            "I understood that reference and I am not proud",
            "I'm stupid, what's the reference?",
            "Toughest Chinese material",
            "Over better yet, trying to compete with lesser clays by going abroad.",
            "\nAu contraire, you see, in India history there was Mughal\n\nGenghis Khan is Mongolian, which makes him Chinese\n\nThe Mongol conqueror Timur claims himself is descended from Genghis Khan, that also he is Chinese \n\nLater, Timur’s descendants Babur found Mughal Empire, so that is a Chinese Empire dynasty, we could called it “West Yuan”\n\nMughal almost conquer the India at its peak\n\nSo, we can safely assume that India belong to the mighty celestial Chinese empire\n\n/s",
            "We can kinda claim entity of bay of bengal as the chola empire controlled it \n\nAlso kushan empire controlled parts of central Asia if i am current",
            "“Western propaganda! US interference!”",
            "Xixixi gib sea",
            "It’s grounded. The ship is basically a glorified outpost",
            "\"3000 Xs of Y\" is a r/noncredibledefense meme, original phrase is \"3000 black fighter jets of Allah\" or similar",
            "Finest chinesium alloy",
            "Fuck the CCP, *but:*\n\nhttps://www.reuters.com/investigates/special-report/usa-covid-propaganda/",
            "Change your flair to xixixi gib island, plox \n\nWe're, uh, recruiting, yes",
            "Thanks.",
            "I thought it has been circulating since 9/11, although the number 3000 could be specific to NCD.",
            "“Chinesium, son. It crumples like paper in response to physical trauma.”",
            "But fuck USA too, just a lot less.",
            "The Pentagon and the administration that let this happen, sure, but the article clarifies that the succeeding administration put a stop to the whole affair as soon as they became aware of it. I'd imagine that most of the individuals primarily responsible for this are still in place in the military, however, which more than anything shows that we desperately need to re-establish civilian control over the military. Let 'em loose when a war starts; until then, keep them on a tight leash 'lest shit like this happen.\n\nYes, I acknowledge that I just said exactly what you said with a lot more words. I prefer clarifying at length to brevity, however.\n\nI'm more bringing this up to point out that this particular bit of often mocked propaganda *has been proven, to some extent, to be correct.*"
        ]
    }
}