{
    "Reminder: Register to Vote!": {
        "title": "Reminder: Register to Vote!",
        "score": 276,
        "url": "https://www.reddit.com/r/PoliticalHumor/comments/19avcx6/reminder_register_to_vote/",
        "content": "Voting is the only way YOU can enact meaningful change in this country. Many states are going to be holding primary elections in the coming months for the Republican Presidential primaries. Even if you aren't a registered Republican who can vote in their primaries, you may have other offices or measures on the ballot that **you should vote on.** \n\nIn some states, ballot measures are attached to the same primary ballot that is used determine who your party's nominee will be for a myriad of offices. \n\nWhether you just turned 18 and want to register or aren't sure if you're still registered from last time, take this opportunity to check your voter registration now. \n\n# REGISTER HERE: https://vote.gov\n\nCurious when your state is voting for the primaries? Check here: https://www.usvotefoundation.org/primary-election-dates",
        "num_comments": 7,
        "comments": [
            "I heard people who vote get lots of pussy.",
            "A crash will occur if the wannabe dictator gets in office.  If you look in history anytime a country gets a dictatorship the market corrects to the benefit of the dictator and friends as a money grab happens.  Think you are safe.  Anyone speaking up gets planted in a mass grave.  All I have to say this election coming up maybe the most important event in your lifetime. So think long and hard.",
            "In Wisconsin, register to vote, check your registration, request absentee ballots, find you ward, district and polling place at www.myvote.wi.gov.",
            "Please get out and let your voice be heard! :)",
            "Voting cured my brain fog"
        ]
    },
    "Maybe they were worried Trump would mispronounce the countries name ": {
        "title": "Maybe they were worried Trump would mispronounce the countries name ",
        "score": 19029,
        "url": "https://i.redd.it/yi4uevc2h08d1.jpeg",
        "content": "",
        "num_comments": 474,
        "comments": [
            "Well hold on, that's not fair.\n\nTrump told the widow of one of the soldiers that her dead husband knew what he signed up for.",
            "Hell, I remember that as the moment that they shut up about Benghazi. Almost as if they just wanted to blame someone for it, and were suddenly worried that Trump might receive the same volume and intensity for that, as they inflicted on Hillary. Almost as if Benghazi was just another prop for them, that outlived it's usefulness...",
            "His supporters are mad that they're not allowed to mispronounce it",
            "The same folks wouldn't STFU about Benghazi as well",
            "If there isn't some way to blame the Democrats, it didn't happen.",
            "It was Trump's Benghazi moment, and Democrats failed to make noise about it.\n\nJust as they never opened an investigation into the highly illegal Soleimani assassination, one of Trump's attempts to provoke Iran into war.",
            "Isn't this the episode that had been planned before Trump came in to office, and he approved it, and when it went south he said \"It wasn't my fault, it was the military's?\"\n\nYou're the commander in chief, the buck stops with you. That's what you volunteered for.",
            "Was this the raid that Obama had called off because it was deemed too dangerous, but Trump thought it was fine and went for it, or was that another event?",
            "I like how everyone just accepts US soldiers in a foreign country as normal. Could you imagine Nigerian soldiers in Texas and then them being outraged that they were killed?",
            "Why would he do shit about it? Trump considers those that give their lives in support of their country to be suckers and losers! [https://www.theatlantic.com/politics/archive/2020/09/trump-americans-who-died-at-war-are-losers-and-suckers/615997/](https://www.theatlantic.com/politics/archive/2020/09/trump-americans-who-died-at-war-are-losers-and-suckers/615997/)",
            "Republicans still trying to subpoena Mr. Ben Ghazi to be able to arrest Hillary",
            "But... but... Benghazi her emails!",
            "country's    \n\nsorry  :  )",
            "Pepperidge farms remembers",
            "They were too busy not giving a shit about Russian bounties maybe?",
            "I remember Russian mercenaries attacking an American airbase in Syria, and Trump never even acknowledged it.",
            "We learned that Russia was paying bounties on US soldiers in Afghanistan and did nothing",
            "There's this guy you should meet, I think his name is Ben Ghazi?",
            "But what about Benghazi though?",
            "He still considers them \"suckers\".",
            "4 years of insane non stop Benghazi “investigations” and then crickets once Hillary lost 2016",
            "I wonder if he remembers when IDF killed 7 World Central Kitchen workers (one US citizen), and Biden did nothing about it. Actually, he did do something. He gave Israel more weapons. ",
            "*country’s",
            "how could obama let this happen!??",
            "Wait...is Jeff the Pepperidge Farms guy?",
            "do you remember that?",
            "That reminds me when the USS Liberty was sunk by Israel on purpose, killing 34 US navymen and most of congress either didn't comment or praised Israel for their military prowess.",
            "we’re all 4 servicemen black? \nI thought that was a factor of his playing down, aka ignoring \n, the incident",
            "I’d like to see a good list of every shitty, corrupt, illegal thing he’s ever done with some sources. I can’t keep track and understand that’s part of the tactic. I can only remember like 50-100 lol",
            "First time seeing Jeff this year, election year is officially in full swing.",
            "I'm so old I remember being progressive meant you wanted the US to get the fuck out of other people's countries, not to retaliate if being there had consequences.\n\n\n\"he didn't do shit about it\"\n\nGood. That's a good thing. Doesn't matter if it was Trump. Better than murderous retaliation against a civilian population. Or supporting that.\n\nIt sickens me how so much of the rhetoric used against Trump comes straight out of the nationalist, militarist, imperialist playbook that used to be owned by the right.\n\nAnd then dare to complain critics say there's little difference between the two sides. The only difference is that one of the two sides is unhinged and bigoted besides being fascist.",
            "No sense worrying about the things you know you can't avoid.",
            "Any FUCKING questions?",
            "He did mispronounce that iirc.",
            "So, when I was very young, the first time I saw the name of this country I thought… no.  Couldn’t be.  They’d never name a country that.  But… there it is.  That’s what it says on the map.  And how else would you say it?  It’s… I mean, that’s gotta be its name… right?  \n\nNope, not right.  But my parents were simultaneously horrified and cracking up at the question.",
            "Earlier today, I was just thinking of the long list of Trump scandals. This was included in that list.  After years of hearing nothing but Bengazi, why did this one get completely ignored.",
            "[removed]",
            "Dude I cried when I saw the documentary. It's just heartless to not care about real people. I hope that man gets put away.",
            "Wasn’t one of them a Navy SEAL?",
            "Yeah, probably because the orange dummy hasn't taken a geography class in his life. Any fucking questions?",
            "Who is jeff tiedrich?",
            "He only pays attention to soldiers and their families when he insults them.",
            "He harassed that poor woman!  But he was right that hero knew what he was doing, which is why the commander in chief magically got healed from his bone spurs it was all the Christian Nationalists praying for him in the oval.",
            "and i'm so young that i had zero idea",
            "Well, to him soldiers are nothing but \"suckers and losers\" [https://www.militarytimes.com/news/pentagon-congress/2020/09/03/report-trump-disparaged-us-war-dead-as-losers-suckers/](https://www.militarytimes.com/news/pentagon-congress/2020/09/03/report-trump-disparaged-us-war-dead-as-losers-suckers/) ....",
            "To be fair, I think the French came in the next day and cleaned house.  Not much left to do after that.",
            "We need to invade Nigeria. More war!",
            "I remember when the Saudis murdered and dismembered an American citizen and the Trump admin actively covered for them.",
            "The Saudis dismembered Khashoggi and Republicans barely managed to wring their hands about it.",
            "He would never mispronounce names of countries. He just says them the right way. Nepal is supposed to be called Nipple, and Buthan is of course said exactly like Button! He is just smarter than everyone else who don't realise this simple fact. \n\n5D chess you guys, you keep forgetting he knows words, he has the best words.",
            "1/8/2020 Iran retaliated for killing General Solemani by hitting Al Asad airbase with 16 scud missiles, causing Purple Heart injuries to over 80 American servicemen.  Again, Trump did nothing. No response at all.  Is he a wimp or does he just not care about our military?",
            "Benghazi Benghazi Benghazi.   Fox said it 62 times a day for years.",
            "Didn't he leak classified docs of the names of under cover agents? Didn't all those agents die?",
            "If I remember correctly the French went after the terrorist cell and recovered the equipment.",
            "Maybe because cult?",
            "Trump probably thought to himself, they were too weak that’s why they died. Just like how he bashed POW’s",
            "remember when  china rolled over hong kong?? what year was that again?? god i hope that was after trump left office or i have some more bad news",
            "My wife got put into Facebook jail due to talking about this.  Facebook insisted she was using a racial slur.",
            "dude who the fuck is this guy im tired of seeing him. also fuck using  service members to further your ideals its fucking low.",
            "It would be hilarious to watch trump try to fight in a war on the battle field. I bet he wouldn't even get that far and would just be a janitor",
            "Trumpghazi",
            "And he blamed it on Obama",
            "I vaguely remember South Park making a joke about that.",
            "I remember this guy.\n\nAlways liked his tweets but his stupid face always annoyed me.",
            "Help with pronunciation: \n\nI've heard it pronounced NIE-jer, KNEE-jer, and nie-SHUR\n\nWho here knows the right way to say it?",
            "Trump had his own [Beanghazi](https://assets.bwbx.io/images/users/iqjWHBFdfxIU/i6GIQasNmDm4/v0/-1x-1.jpg).",
            "Or maybe they don't even care.",
            "Colin Jost captured it pretty good.",
            "Maybe that's better, I'll take doing nothing over starting another war.",
            "I guess they were losers and suckers in his eyes.",
            "More US soldiers died in combat under trump than Biden, but republicans and the media only cared about the ones who died as we left Afghanistan, ensuring no more soldiers would die in a pointless occupation. Pretending the draft dodger that insulted POWs is better for the troops than literally anyone else almost is unbelievable. The mental gymnastics you have to do to support trump and claim to be a patriot is astounding. I’m pretty empathetic but I seriously can’t imagine being that fucking dumb",
            "But what about Ben Ghazi!",
            "He’s so old he can remember 2017?",
            "How many countries?",
            "I love these scathing comments from a human wet blanket. Jeff Tiedrich, owning Trump by being absolutely ignored by him and shouting into a void since 2016.",
            "You're as funny as John Oliver you cuck",
            "He probably would've called it \"African-America\"",
            "This guy is a fucking loser",
            "I remember Joe Biden snoozing during the Marines funeral & Trump staying up until 3am to greet the caskets on a tarmac….",
            "I remember that. Literally no one talked about it because the Las Vegas shooting was like the day before.\n\nEdit: Looked it up. It was two days after the Las Vegas shooting, and the same day that a Russian jet shot up lifeboats full of refugee’s killing some 60 civilians.\n\nAlso, presidents don’t really have anything to do with what the military does, but these troops were deployed in January of 2017.",
            "I really want Trump to die so I never have to see another post from this absolute hate mill of a human being. ",
            "But….her emails…..",
            "Not sure about the country name but US is more concerned today about not misgendering people and making mistakes with pronouns.",
            "Or, the republicans could spend YEARS holding hearings about Ben Gazi and blame Hilary Clinton for 4 deaths because Mitch McConnell cut security funding to the state department.\n\nWhat a pathetic bunch of scumbags.",
            "I remember when Hillary Clinton turned Libya into a slave market, and all Congress did was make whiny noises about how one of our outright evil regime enthusiasts got killed in the chaotic transition.  Heck, there are still fools out there insisting her foreign policy credentials are excellent, as if there was no other way to practice American foreign policy but to be a bloodthirsty yet utterly incoherent Henry Kissinger wannabee.",
            "Forgot about that",
            "Did he blame it on a YouTube video?",
            "It happened in VEEP. \n\nhttps://youtu.be/_koPVVhB7j8?t=29",
            "Hey, they were losers getting killed like that. Don’t like losers",
            "The Defecating Don has no empathy butt for himself .",
            "Well, Bone-Spur-in-Chief would've called them suckers and losers.",
            "Well they would still be alive if they had stayed in america right?",
            "But *Benghaaaaazi* !?!!!",
            "The repups were still too busy yelling Benghazi to notice.",
            "Republicans did say something about it.  What they screeched was \"BENGHAZI!\" (To deflect blame)\n\nRepublicans don't give a shit about service members unless they can make political points off of their situation.  Even then, they drop veterans like a hot rock once they serve their purpose.",
            "Like the current one saying he recently met the long dead former president of France?",
            "*country's",
            "To be fair, they were losers and suckers.",
            "Or did anything about the murders committed by immigrants who entered under his administration either…",
            "And if he wins, it’s just as much fault the democrats couldn’t find a worthy opposition to that absolute shit show.",
            "I don't follow politics at all. It only leads to arguments. I've never voted , I'm not affiliated with any party. I do go online though so I get fed information whether I want it or not. Doesn't ANYONE find it funny that no matter where you go on the Internet you barely see anything negative about Biden but for the last 4 and 8 years it has ONLY been negative things about Trump. I mean Biden is senile, most likely a pedo, and pretty useless as a president. But you never hear anything about it. Any negative Biden stories are quickly squashed but the negative Trump press never stops no matter the platform. Shouldn't you get asking yourself why? There's obviously some sort of outside influence and corruption of information going on.",
            "And North Korea killed an American and China unleashed a bio weapon on the world (or so they think) and he did nothing.",
            "This guy has made his whole life about donald trump.",
            "Yes, that's true. But, why does it mean that we can't hold Biden responsible for his actions? He hasn't done much about the American hostages in Gaza. I'm not a Trump supporter, by the way.",
            "What the hell were they doing there?",
            "I remember when biden crapped his pants and left soldiers to die in iraq.",
            "what do you want? trump to invade another country? why are democrats the military worshiping warhawk party now?",
            "Jeff Tierdrich is an FBI operative hired and paid to influence social media. Any time I see his name I just assume its some boomer democrat beurocrat paying money to influence the internet.",
            "Im so old, I remember when 13 US troops were killed in Afghanistan during the botched withdrawal and Biden killed a car full of civilians in retaliation about it. \n\nDon’t use the troops as a pandering tool for your political beliefs.",
            "Well that’s trump being trump",
            ">didn’t do shit about it\n\nGood? Is it supposed to be some kind of fault that he didn’t carpet bomb their capital in retaliation?\n\nDemocrats can be pretty fucking weird sometimes.",
            "Do you guys remember when Donald Trump quietly took a trip to Afghanistan to spend Thanksgiving with the troops?\n\n[President Trump even served food to the troops!](https://www.usatoday.com/videos/news/politics/2019/11/29/trump-secretly-went-mar-lago-afghanistan-thanksgiving/4330120002/)",
            "Probably the first time many people heard of our troops actually being in Africa. I remember watching the video at the time. Sad they died like that. I think they were attached to Obamas drone strike campaign. What a shame.",
            "[deleted]",
            "[https://southpark.cc.com/video-clips/7vo5l9/south-park-put-our-foot-down](https://southpark.cc.com/video-clips/7vo5l9/south-park-put-our-foot-down)  (NSFW)",
            "They've been there since 2013. If it wasn't dangerous, they wouldn't have to be there.\n\n\nWhat should a president do about it?",
            "I love me some Trump!",
            "Let’s be perfectly honest here, Biden/Hillary wouldn’t have done a fucking thing either. \n\nWhat exactly do you think should have been the proper response, Jeff? \n\nI normally enjoy this guys quips, but he shoulda kept his mouth shut on this one",
            "suck my big DICK",
            "[deleted]",
            "Remember when Biden let Russian troops share a base with American personnel in the same country...",
            "I suggest everyone posting here go and read the Wikipedia page about the event, just for balance",
            "I wonder if he’s old enough to remember all the Americans biden left in Afghanistan, or the Americans he left with hamas, or that innocent afghani family that he incinerated with a missile? 🤔 no probably not, not our hallowed, benevolent *jeff tiedrich!!*\n\nedit: ope. sorry everyone i said something that didn’t echo as nicely off the walls… my fault!! 😉",
            "Same happened with greek soldiers in Libya in 2023 and no one batted an eye",
            "Well wtf were they doing there anyway?",
            "Someone should start talking about Jocelyn Nungaray, it sure as hell won't be Biden. Trump has my vote for this reason alone!",
            "im not even political but what the fucking reason about all this \"4 soliders died somewhere in africa NOOOOOOOOO\" then literally thousands die everyday \n\nive seen this like 4 times whats all about it",
            "American aid worker murdered by zionist terrorsts, what have Biden done other than sending them more billions for killing american citizen ?\n\nhttps://www.bbc.com/news/world-middle-east-68711282",
            "Shut the fuck up",
            "Trump is a pile of hot steaming dogshit.  Biden needed to be helped off the stage by Obama and probably doesn't know what year it is. \n\nStop falling for \"Dems are better than the GOP\".  They're both fucking terrible",
            "The tweet is wrong, Press Secretary Sanders talked about the ambush within a day or two.\n\nTrump made a lot of procedural mistakes in his first term, including waiting 2 weeks to talk about the ambush and then really botching the response.\n\nI hope he's learned from those mistakes, it'll make for a better second term.",
            "Remember when country just straught up let a terrorist organization take 2 trillion of US miloarty equipment overnight in favor of leaving 2k US troops in place in a casualty free time period against the advice of his advisors and dems didn't say a word?\n\nYeah, I do",
            "Trump 24ever! Go on and hate me",
            "Holy shit, I forgot about that. The last decade has been such a shit show.",
            "Then proceeded to vilify the congresswoman who actually showed up to comfort the family.",
            "He said that and then she chased him out of the room cussing him out. He never came back to Dover after that. He was to scared one of the family members might get him. Such a piece of shit and a coward. He was trying to make a photo shoot out of her loss. Republicans are garbage.",
            "And he also didn't bother to learn their names before calling \n\nhttps://abcnews.go.com/Politics/trump-fallen-soldiers-calling-guy-congresswoman/story?id=50568045",
            "He also forgot her name during the call, called her a liar on Twitter than sat back while his followers threatened her life. Oh, and his chief of staff held a press conference where he invoked the story of his son, a Marine who died serving in Iraq to try to deflect criticism from Trump. He then pivoted to tell a story about the congressional rep who was a friend of the family and involved in the whole mess that was clearly intended to make her look bad. The story was later proven to be false be a video tape of the whole thing.\n\n\nSeriously one of the most fucked up and indefensible things Ive ever seen. Yet it got hardly any media coverage.",
            "The thing is, everyone knows what they signed up for.  You just... don't fucking say that to the families after they are killed.  The optics are just fucking bad, dude, and doesn't demonstrate any leadership competency.",
            "Oh yeah, with all the other shit he’s pulled I nearly forgot the different times he shit on the various Gold Star families. You know because he holds the US military in such high regard…🤦🏻",
            "Such an a hole. His whole thing is bury bad news, no matter the consequence. That’s a big part of why COVID response was handled so poorly.",
            "AND that wasn't the first family of a slain soldier he talked shit to either.",
            "It’s giving Tony Abbott saying “sometimes shit happens, doesn’t it?”",
            "Sigh* yeah",
            "What a patriotic American President! His American colors truly show during these times of need. 🤮🤮🤮",
            "[Lest we forget](https://www.mcsweeneys.net/columns/reasons-why-donald-trump-is-unfit-to-be-president)",
            "Also remember when Obama pronounced the p in corpsman and the conservatives went on about it forever.  Like Obama was so ignorant about military affairs and so disrespectful...Yet Trump is worthy of absolute adoration.",
            "That poor widow’s husband’s name was La David and Trump got it wrong, and was very rude about it.",
            "And this isn’t the most horrible thing he’s done so far, right?",
            "Oh! They must have had bounties on them. That makes sense.\n\n\nTrump likes when our troops have bounties put on them like what he happily allowed Russia to do in Afghanistan the whole time he was in office.",
            "Also, Trump couldn't remember the dead serviceman's name when talking with his wife.",
            "And Mike Kelly went to bat for Trump",
            "Was he wrong though",
            "Your fake news",
            "Literally not wrong though. If you think otherwise, you're a bit delusional.\n\nYou are hired to shoot at people who shoot back.",
            "She would agree.",
            "> I remember that as the moment that they shut up about Benghazi.\n\nThat moment came a few weeks after Hillary conceded the 2016 election results.\n\nThe \"we will never rest until justice is done for the victims of Benghazi!!!\" Congressional investigation quietly closed up shop and released a summary of their \"findings\" that was buried as deeply as a late Friday news dump.\n\nThey never spoke about their undying dedication to their cause again.\n\nOddly enough, the dropping of the never-ending Benghazi investigation coincided with Trump's abandonment of his following through on \"Lock Her Up!\"  Despite having control of an entire branch of government including the entire federal law enforcement apparatus, he never tried to pin so much as a parking ticket on \"Crooked Hillary.\"\n\n\nWeird, huh?",
            "Good point, I was about to ask what the hell he *was* supposed to do about it, bomb them? But then you pointed out the hypocrisy of it being the exact same number of soldiers as Benghazi.",
            "[Truth Trump on Hillary @ 3:06](https://youtu.be/BB38DvTV5kc?si=TA_0Z033gyKCfvuz)",
            "i think it's about unconscious bias. \n\npeople may not realize they *have* this bias, but they may simply not trust that a woman can make life or death decisions on behalf of others.",
            "They want to mispronounce that country so bad, they're willing to install a dictatorship.",
            "Literally I remember in the late 00s watching a documentary on the History Channel and dudes were bawling because they couldn’t say n***** anymore.\n\nThat’s what we’re dealing with folks",
            "That’s because republicans weaponize their news, unlike Dems. So you have a “fear inducing, rile them up, whether it’s truth or fiction” side of news station, and then news stations that just report news. Left leaning news also seems to always paint a picture of how Trump is making democrats nervous with polls etc while the left also says the same thing. If these fucks are gonna play dirty the Democratic Party needs to figure their fucking shit out. So sick of playing nice while the otherside continuously makes bad faith arguments and gets away with it",
            "Bengazi? I'd rather talk about how Obama accidentally killed three US citizens with drones!",
            "Another chapter of the MAGA playbook: If Democrats did something good, take credit.",
            "If you need any proof that Fox News is a propaganda outlet, the fact that the incident WASN’T plastered all over the network 24/7 should be more than enough. If something like that happened while a Democrat was president, the Fox host-bots would barely stop talking about it long enough to breathe.",
            "\"well this issue happened in 2017, what has Biden done to help improve the situation?\"\n-Fox News",
            "[removed]",
            "Bold of you to assume that they don’t regularly invent ways to blame Democrats whole cloth.",
            "There was pretty horrific video from that event too. Honestly, I’ve been on the internet a while, but that was one of the most haunting.",
            "Democrats are a party of stationary weaklings. The weakness the Dems show in the face of legit tyranny is unforgivable. I would love to see Merrick Garland brought up on charges. Tf you doin? Lock these criminals up and save our country please.",
            "That was definitely his Benghazi moment, but SF operators getting ambushed in an active war zone is nowhere near as bad losing an ambassador and CIA assets. Not Hillary’s fault, but the state department fucked that one up pretty bad.",
            "Wait a minute, I've been told Trump deserves an award because he didn't start any wars. Are you saying he kept engaging in covert wars, unauthorized wars, and even *failed* at starting more wars, but not for lack of trying? (/s)",
            "Why would either side want to investigate blasting soleimani? There’s nothing to investigate - he was blown into pieces and the world is a better place for it. Dems and GOP should be able to agree on that",
            "iirc it had been planned but shelved because it was considered too risky and dangerous. \n\n\nTrump came in and demanded they go through with it because he wanted to show off how powerful he was, and because it was the opposite of what Obama decided. \n\n\nThe mission went ahead despite objections and, as predicted, turned to shit. At which point trump said it was everyone else's fault. Then insulted the widow of one the fallen soldiers. And we all collectively forgot about it and moved on to his next outrage. ",
            "You're thinking of the strike on Yemen that Trump authorized basically his first week in office. The Tongo Tongo ambush happened later in the year.\n\n[Eight-year-old American girl 'killed in Yemen raid approved by Trump'](https://www.theguardian.com/world/2017/feb/01/yemen-strike-eight-year-old-american-girl-killed-al-awlaki)\n\n>President Donald Trump personally approved a US commando raid in Yemen that left one elite serviceman dead and may have killed an eight-year-old American girl, the US military has told the Guardian.\n\n>The operation was launched to gather intelligence on suspected operations by al-Qaida in the Arabian peninsula (AQAP), according to Thomas. Planning for the raid “started months before”, under Barack Obama’s administration, but was “not previously approved”, he said.\n\n>Thomas said he did not know why the prior administration did not authorize the operation, but said the Obama administration had effectively exercised a “pocket veto” over it.\n\n>A former official said the operation had been reviewed several times, but the underlying intelligence was not judged strong enough to justify the risks, and the case was left to the incoming Trump administration to make its own judgment.\n\n>An eight-year-old girl, Nawar al-Awlaki, was killed in the raid, according to her family. Nawar, also known as Nora, is the daughter of the al-Qaida propagandist and American citizen Anwar al-Awlaki, who was killed in a September 2011 US drone strike in Yemen. Awlaki’s 16-year-old son Abdulrahman was killed in a second drone strike soon afterwards.\n\n>On the campaign trail, Trump endorsed killing relatives of terrorist suspects, which is a war crime. “The other thing with the terrorists is you have to take out their families, when you get these terrorists, you have to take out their families,” he told Fox News in December 2015.\n\nhttps://en.wikipedia.org/wiki/Raid_on_Yakla\n\nhttps://en.wikipedia.org/wiki/Tongo_Tongo_ambush",
            "No this was 4 Green Berets that got killed on a mission due to poor intel.",
            "I think it's the one where he told the wife of one of the dead soldiers that \"he knew what he signed up for.\"",
            "That was the one in Yemen that got one a SEAL killed. Trump wanted that to be his bin Ladin \"We got him\" moment. One of the first things he did when he took office in January.",
            "It's like living in Skyrim and seeing Thalmor patrolling randomly.",
            "[removed]",
            "Turns out everyone hates ISIS. Hopefully, when the genocidal Nat-C's take over large swathes of the US, the global community will also have our back.",
            "US imperialism good. Russia/China imperialism bad.",
            ">Their country\n\nIs Haliburton and Exxon Mobile their country? If you sign up for what is in practice mercenary work and get pwned you are a loser Imagine going to someone else's country, occupying it and getting pwned by people without tap water because you had to compensate for something.",
            "A story in the Atlantic said Trump called service members \"losers\" and \"suckers\"\n\nThe story used an anonymous source or sources, there was no recording.\n\n[https://www.newsweek.com/donald-trumps-new-video-fact-checked-1911998](https://www.newsweek.com/donald-trumps-new-video-fact-checked-1911998)  \n  \nA statement released by the White House in September 2020 included a list of quotes from 19 officials \"Refuting Anonymous Sources in False 'The Atlantic' Story.\" Some of the quotes are specific, such as from former deputy assistant to the President Jordan Karem, who said it was \"100 percent false,\" adding he was   \nalongside Trump the day of the visit.\n\nOthers were less specific, told by people who were not there, or gave secondhand statements. The substance of some of the comments focuses on conversations about whether Trump would have been able to attend because of bad weather, while others did not contain a flat denial.\n\nJohn Bolton who said in his statement: \"I didn't hear either of those comments or anything even resembling them\" also said in an interview: \"I'm not saying he didn't say them later in the day or another time, but I was there for that discussion\" as reported by The New York Times.\n\nOther former Trump staffers have supported The Atlantic's article, most notably John F. Kelly, Trump's 2018  White House chief of staff.\n\nIn a statement to CNN in 2023, Kelly referenced several remarks that Trump reportedly made during his time in office, including the reference to \"suckers.\"\n\n\"A person that thinks those who defend their country in uniform, or are shot down or seriously wounded in combat, or spend years being tortured as POWs are all 'suckers' because 'there is nothing in it for them,'\" Kelly said. \"A person that did not want to be seen in the presence of military amputees because 'it doesn't look good for me.'\" \n\nIn a statement to CNN, Trump's spokespeople responded: \"John Kelly has totally clowned himself with these debunked stories he's made up because he didn't serve his president well while working as chief of staff.\"",
            "Hi u/Beatnik_Soiree. Here's the real truth behind the latest email controversy: [https://i.imgur.com/Ztrqpya.jpg](https://www.youtube.com/watch?v=xfr64zoBTAQ) ~\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/PoliticalHumor) if you have any questions or concerns.*",
            "Bugged me too.",
            "Well wait and until you hear where the Wagner Group were between 2014 and 2017? Isn't it kind of funny that Russian military contractors trained the men who ambushed and killed American troops?\n\nNo wonder Benedict Donald didn't want to touch that. Daddy Putin would have spanked him if he tried.",
            "Seems like most people are to busy to give a shit. Even today. 🙄",
            "[https://en.wikipedia.org/wiki/Battle\\_of\\_Khasham](https://en.wikipedia.org/wiki/Battle_of_Khasham)\n\nand related\n\n[https://apnews.com/article/fee4d978f1ca42aaa891a59c5307a261](https://apnews.com/article/fee4d978f1ca42aaa891a59c5307a261)  \n\n\nWASHINGTON (AP) — President Donald Trump on Wednesday warned Russia to “get ready” for a missile attack on its ally Syria, suggesting imminent retaliation for last weekend’s suspected chemical weapons attack. Defense Secretary Jim Mattis took a more measured tone, saying the U.S. and its military coalition partners were still studying intelligence on the attack.\n\n[https://www.nbcnews.com/news/world/trump-announces-strikes-syria-following-suspected-chemical-weapons-attack-assad-n865966](https://www.nbcnews.com/news/world/trump-announces-strikes-syria-following-suspected-chemical-weapons-attack-assad-n865966)\n\nTrump announces strikes on Syria following suspected chemical weapons attack by Assad forces  \n\"Clearly, the Assad regime did not get the message last year,\"  Defense Secretary Mattis said. \"This time, our allies and we have struck harder.\"",
            "That was literal fake Russian propaganda that Russia paid US media to air. https://en.wikipedia.org/wiki/Russian_bounty_program#:~:text=The%20Russian%20bounty%20program%20was,during%20the%20war%20in%20Afghanistan.\n\nAccording to Reddit rules, you should be banned from this reddit but reddit rules only apply to people who do not pay them.",
            "Beat me to it.",
            "Just look up his executive orders on whitehouse.gov and start reading.",
            "[https://www.mcsweeneys.net/columns/reasons-why-donald-trump-is-unfit-to-be-president](https://www.mcsweeneys.net/columns/reasons-why-donald-trump-is-unfit-to-be-president)",
            "Jeff Teidrich is a great argument against the first amendment",
            ">Better than murderous retaliation against a civilian population. Or supporting that. \n\n\nLike that's the only possible action that could be taken.",
            "When both parties are full of geriatric war criminal ghouls, people have to bend over backwards extra far in order to justify the side they support",
            "Faith in humanity = restored",
            "It's pronounced \"nee-zhair\", which would be standard French pronunciation for those letters. Some people say \"nigh-jer\" but that's just weird.",
            "Hello! Thanks for your comment. Unfortunately it has been removed because you don't meet our karma threshold.\n\n You are not being removed for political orientation.  If we were, why the fuck would we tell you your comment was being removed instead of just shadow removing it?  We never have, and never will, remove things down politicial or ideological lines. Unless your ideology is nihilism, then fuck you. \n \n Let me be clear: The reason that this rule exists is to avoid unscrupulous internet denizens from trying to sell dong pills to our users.  /r/PoliticalHumor mods reserve the RIGHT to hoard all of the dong pills to ourselves, and we refuse to share them with the community.  If you want Serbo-Slokovian dong pills mailed directly to your door, become a moderator. If we shared the dong pills with the greater community, everyone would have massive dongs, and like Syndrome warned us about decades ago: \"if everyone has massive dongs, nobody does.\"\"\n \n If you wish to rectify your low karma issue, go and make things up in /r/AskReddit like everyone else does. \n\n Thanks for understanding! Have a nice day and be well. <3\n \n You can check your karma breakdown on this page:\n \n http://old.reddit.com/user/me/overview\n \n (Keep in mind that sometimes just post karma or comment karma being negative will result in this message)\n \n ~\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/PoliticalHumor) if you have any questions or concerns.*",
            "He’s not great with the mental health and the pro-social behavior. Trump seems to believe anyone desperate or dumb enough to enlist should anticipate their own sacrifice. I’ve never seen him sell caring, and certainly no recognition of how dependent his golden toilet life is on the strength and intelligence of our military.",
            "his tweets were always shit\n\nthe only thing worse than what they're referencing is them nonstop posting about it, like the fucking twat he is",
            "2nd grader can own orang shitstain. Jeff is trolling MAGA, very successfully, as I can tell, lol.",
            "[Who's a cuckold?](https://i.imgur.com/dTnV0jD.png) ~\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/PoliticalHumor) if you have any questions or concerns.*",
            "Hi u/Xolitoburrito. Here's the real truth behind the latest email controversy: [https://i.imgur.com/Ztrqpya.jpg](https://www.youtube.com/watch?v=xfr64zoBTAQ) ~\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/PoliticalHumor) if you have any questions or concerns.*",
            "Only response from conservative you can get is blatant whataboutism.",
            "How did Hillary Clinton do that?",
            "It's not a bioweapon just like the common cold is not a bioweapon.",
            "[removed]",
            "And trump made it easy for him. Trump made him right.",
            "Protecting american interests. Nigeria has a lot of american companies there and it's not the safest country in the world. Most likely they were protecting trump friend's interests",
            "Do you?  You have evidence for this then?",
            "> what do you want? trump to invade another country?\n\nI was thinking he could invade Mars.  And stay there.",
            "Which one if his posts are not a pure facts.?\n\nFind one or GTFO",
            "[removed]",
            "What did biden shoot the car with?",
            "Well if they had stayed in their own country they'd still be alive oh well anyways nexttt",
            "It's what the accused Hillary of. I guess we were wrong for assuming they were consistent.",
            "Was that before or after Diaper Donnie disrespected & talked shit about American Prisoners of War?",
            "> I think they were attached to Obamas drone strike campaign.\n\nFucking lol\n\nThis.  This is how far gone they are.  Look at them.",
            "Because we already saw that he wasn't?",
            "Can you give me an Elegy to Optimus Prime from the 1986 movie?",
            "[removed]",
            "What should Hillary have done at Benghazi?",
            "Sounds like a you problem because the majority of us are doing fine. You need to pull yourself up by the bootstraps and ditch that entry level job. Lowest unemployment rate in 60 years so time find something that pays better",
            "I know. We're all struggling. The entire world was hit hard with the covid craziness, but thankfully our recovery has fared much better than most of the world. Doesn't do us much good, but it could have been worse had it not been handled the way it was and the way other countries have been trying to deal with it.",
            "US economy is demonstrably stronger under Biden (across a number of metrics), so that sounds like a you problem lol \n\nMaybe time to brush off the ol’ bootstraps?",
            "Then sell your barley and make some money",
            "Bot",
            "You got bootstraps, homie.",
            "When Trump was president, I hadn't stubbed my toe so hard I broke it; under Biden, my toe is current swollen and buddy-taped, iced, and elevated.\n\nThis doesn't make it Biden's fault.\n\nHowever, if you want some actual data (which we both know you don't):\n\n[Trump was terrible for the economy](https://www.propublica.org/article/national-debt-trump).\n\nUnder Trump, [income inequality was higher than it had been in over half a century](https://www.washingtonpost.com/business/2019/09/26/income-inequality-america-highest-its-been-since-census-started-tracking-it-data-show/).\n\nBut also:\n\n-\t[How a Trump Tax Break to Help Poor Communities Became a Windfall for the Rich](https://www.nytimes.com/2019/08/31/business/tax-opportunity-zones.html)\n\n-\t[6 Ways the Trump Administration Is Rigging an Already Unfair Tax Code](https://www.americanprogress.org/issues/economy/news/2020/10/28/492473/6-ways-trump-administration-rigging-already-unfair-tax-code/)\n\n-\t[How Trump fueled economic inequality in America](https://thehill.com/opinion/finance/535239-how-trump-fueled-economic-inequality-in-america)\n\n-\t[12 Ways the Trump Administration Has Deepened Inequality](https://time.com/5859209/donald-trump-administration-inequality/)\n\n-\t[Global inequality and the Trump administration](https://www.cambridge.org/core/journals/review-of-international-studies/article/global-inequality-and-the-trump-administration/DC3768AC522B7ADF4C30E1F774017452)\n\n\nAnd also:\n\n-\tHe’s responsible for the 2017 tax cuts that [were temporary for the middle class but permanent for corporations](https://www.theatlantic.com/politics/archive/2017/11/republicans-slap-an-expiration-date-on-middle-class-tax-cuts/545996/), that [absolutely failed to pay for themselves](https://www.brookings.edu/policy2020/votervital/did-the-2017-tax-cut-the-tax-cuts-and-jobs-act-pay-for-itself/), did not at all [live up to the GOP’s promises](https://www.npr.org/2019/12/20/789540931/2-years-later-trump-tax-cuts-have-failed-to-deliver-on-gops-promises), ended up [costing American homeowners around $1*Trillion* in value while boosting corporate gains](https://www.propublica.org/article/trumps-trillion-dollar-hit-to-homeowners), and could [cost the government $5.5*Trillion* through the end of the decade](https://www.crfb.org/blogs/tax-cut-and-spending-bill-could-cost-55-trillion-through-2029).\n\n\nSome studies even suggest that [Trump’s catastrophic trade policies](https://www.forbes.com/sites/stuartanderson/2020/06/01/trumps-trade-war-cost-us-company-stock-prices-17-trillion/?sh=64e249435279) are [responsible for *losing* thousands of American manufacturing jobs](https://www.epi.org/press/trumps-trade-policies-have-cost-thousands-of-u-s-manufacturing-jobs-action-is-urgently-needed-to-rebuild-the-manufacturing-sector-after-the-coronavirus-pandemic/).",
            "No, tell us about it",
            "You mean the Afghanistan trump retreated from to be executed on the first weeks of Biden?",
            "You Greek?",
            "Let’s not get crazy",
            "Ask Trump. He sent them there. ",
            "Because Trump called the widow, and said. \"You know what he signed up for.\" And a bunch of other insensitive shit.\n\nLook up the Tongo Tongo Ambush.",
            "Lol, strong response, snowflake.",
            "[removed]",
            "I am so sick of this nonsense \"both sides are bad\". Is Biden the best ever, no. Do I agree with every action he has taken while in office, hell no. Is he in anyway comparable to Trump as a president or presidential candidate, absolutely not. \n\nObjectively the Dems are better than the GOP. That is keeping in mind that the Dems are not just Biden, and the GOP is not just Trump. Republicans are bad for this country, hands down. Yes Dems have their problems, but they are not actively working towards breaking the country and its foundations or institutions.",
            "Don't forget however that Trump was responsible for the Afghanistan deal.",
            "Yes I remember trump negotiating that agreement did you mean something else?",
            "Wow, I'm really much impressed about your profile personalities. I'll like to be your friend if you don't mind sending me a friend request so we can talk more, I sent you a friend request but it never got through, can you try and add me so we can be friends if you don't mind, hope to hear from you soon tap my profile to send me a friend request.",
            "> The pace of repression outstrips our ability to understand it. And that is the real trick of the ~~Imperial~~ MAGA thought machine. It’s easier to hide behind 40 atrocities than a single incident",
            "There’s like a bajillion fucking awful things that he’s done that I’ve forgotten because there’s way too much",
            "God... shit show would be nice for once. This.. this is something else.",
            "Do you also remember when Trump tweeted that satellite image from his daily intelligence briefing and revealed previously unknown capabilities the US had?",
            "[Lest we forget this fucking monster](https://www.mcsweeneys.net/columns/reasons-why-donald-trump-is-unfit-to-be-president)",
            "As the great Dice man once said... he's a load that should've been swallowed",
            "Jfc same. Like how much awful shit has he said and done that him talking about this fell off the radar….",
            "Remember when Trump signed an executive order to build a marble statue garden in DC of \"American Heroes\" thst included confederates and Hollywood actors, some of whom weren't even American citizens and never lived in America.\n\n\nThe party of fiscal responsibility.",
            "I think we are on decade 2 now.",
            "The Next Ten Years: \"Hold my beer...\"",
            "Yeah lets re elect that guy. Totally deserving.",
            "Wasn't shit like this on a weekly basis the norm? \n\nDid everyone forget the constant shit we had to hear about trump?",
            "I'm just in awe that no one remembers the bounties he happily allowed to be placed by Russia on all our service men and women serving in Afghanistan.\n\n\nWow, like no one.",
            "How dare she SJW in person! /s",
            "And that has hurt him, how?  They have no moral standing.  They know no shame.",
            ">The thing is, everyone knows what they signed up for. You just... don't fucking say that to the families after they are killed. The optics are just fucking bad, dude, and doesn't demonstrate any leadership competency.\n\nThis isn't a man who understands things like basic human decency.\n\nTo wit, this was just released:\n\n“‘Nature has a way of coming back. Well, it does until it does not. Who knows with nuclear warfare what will happen But I tell you what. If nuclear war happens, we won’t be second in line pressing the button.\"\n\nTrump to the Governor of Puerto Rico as they surveyed the damage from Hurricane Maria in a helicopter in 2017.\n\nAs related in the former governor's memoirs.\n\nThere they are looking at the aftermath of a cataclysmic natural disaster that destroyed homes and killed many, and Trump feels the need to talk about how ready he'd be to nuke the world.\n\nAlso [this](https://hips.hearstapps.com/hmg-prod/images/hbz-trump-town-hall-shutterstock1-1519312364.jpg)\n\nIt's a cheat sheet Trump had to have to remind him to approximate human compassion when he met with the Parkland shooting survivors.\n\nIt would be hard to intentionally design a human so completely bereft of compassion for others as DJT.",
            "Empathy. He has none and is incapable of understanding what it is.",
            "He also churns out scandals like daily, so there's not even time to focus on one. If any other president said that, we'd all know and never let it go.",
            "> doesn't demonstrate any ~~leadership~~ competency.\n\nFTFY",
            "I think he even forgot the man’s name while on the phone with his mother.",
            "That's what you say when you watched too much TV and think of yourself as this hard boiled  war vet.",
            "You can, but typically it would be wrapped up in their brave fight for justice and freedom. And it would likely be a speech served to their fellow soldiers as a way to boost morale and get them back in the fight, not to the families that don't give a shit what their dead son was fighting for.",
            "Trump is nothing but leadership! Are you deaf & blind while watching CNN ?",
            "To say it to her face? Fuck yes and it's worrying you don't know that instinctively.",
            "Read the widows interpretation with an ounce of dignity and then get back to me. \nhttps://abcnews.go.com/US/fallen-soldiers-widow-angry-trumps-call-couldnt-remember/story?id=50655063",
            "Google's right over there.",
            "Doesn't have to be true for the MAGA sheeple.",
            "Willing to be he tried but was told there was nothing.\n\nMuch like his famous “election fraud commission”",
            "Obviously Trump wont stoop to the depths of Sleepy Joe. He would never weaponize the DOJ /s",
            "WTF are you doing man??  Running around here with your logic running amuck up in here.",
            "Like all of Biden's infrastructure $$ being bragged about back home by the Cons",
            "Fox News abandoned all pretenses when they sponsored Tea Party rallies in 2010.",
            "Hello! Thanks for your comment. Unfortunately it has been removed because you don't meet our karma threshold.\n\n You are not being removed for political orientation.  If we were, why the fuck would we tell you your comment was being removed instead of just shadow removing it?  We never have, and never will, remove things down politicial or ideological lines. Unless your ideology is nihilism, then fuck you. \n \n Let me be clear: The reason that this rule exists is to avoid unscrupulous internet denizens from trying to sell dong pills to our users.  /r/PoliticalHumor mods reserve the RIGHT to hoard all of the dong pills to ourselves, and we refuse to share them with the community.  If you want Serbo-Slokovian dong pills mailed directly to your door, become a moderator. If we shared the dong pills with the greater community, everyone would have massive dongs, and like Syndrome warned us about decades ago: \"if everyone has massive dongs, nobody does.\"\"\n \n If you wish to rectify your low karma issue, go and make things up in /r/AskReddit like everyone else does. \n\n Thanks for understanding! Have a nice day and be well. <3\n \n You can check your karma breakdown on this page:\n \n http://old.reddit.com/user/me/overview\n \n (Keep in mind that sometimes just post karma or comment karma being negative will result in this message)\n \n ~\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/PoliticalHumor) if you have any questions or concerns.*",
            "To this day the helmet cam video is top image on wikipedia, and you can watch at least 2 men killed in action.  Both of which are incredibly graphic.  \n\nTongo Tongo Ambush for the morbidly curious  \n\nExtremely NSFL and I say that as someone who frequents the combatfootage subreddit. Insane to me that it hasn't been taken down yet",
            "Yeah, that was heartbreaking.  The further you read into it, the worse it gets.   2 of the guys were just support, not even Green Berets.",
            "What charges would you bring Garland up on? What are you accusing him of? Not prosecuting Trump quickly enough? \n\nBreaking things is quick and easy, building and maintaining them is long and hard. Trump is trying to break US institutions and democracy. We do not need a second tyrant to fight the first. We need to all put in consistent, boring, compromise intensive *work*. The opposite of tyranny. It is not *weak*, Democracy and civil engagement is the strongest, most fruitful and most resilient philosophy of government ever seen. Tyrannical governments fall quickly and violently. \n\nIf we all get out and vote, and engage civically on a consistent basis on, and off, election cycles, Trump is easily stoppable. ",
            "A point for the overall rebuke of Democrats. It saddens me to feel I, as a Democrat, my party cannot be more militant when it comes to various issues.\n\n Republicans, stand as one force, no matter how repugnant they or their constituents might feel about the issue.\n\nHowever, they did try to impeach Trump. And McConnell said Trump was not guilty before any testimony was given.",
            "You misunderstand the political landscape if you truly believe this.\n\nShit is infinitely more complicated than, \"duh just do this ONE simple trick\" lol. \n\nAnyone that thinks it is that simple probably doesn't know enough to comment on it.",
            "Hello! Thanks for your comment. Unfortunately it has been removed because you don't meet our karma threshold.\n\n You are not being removed for political orientation.  If we were, why the fuck would we tell you your comment was being removed instead of just shadow removing it?  We never have, and never will, remove things down politicial or ideological lines. Unless your ideology is nihilism, then fuck you. \n \n Let me be clear: The reason that this rule exists is to avoid unscrupulous internet denizens from trying to sell dong pills to our users.  /r/PoliticalHumor mods reserve the RIGHT to hoard all of the dong pills to ourselves, and we refuse to share them with the community.  If you want Serbo-Slokovian dong pills mailed directly to your door, become a moderator. If we shared the dong pills with the greater community, everyone would have massive dongs, and like Syndrome warned us about decades ago: \"if everyone has massive dongs, nobody does.\"\"\n \n If you wish to rectify your low karma issue, go and make things up in /r/AskReddit like everyone else does. \n\n Thanks for understanding! Have a nice day and be well. <3\n \n You can check your karma breakdown on this page:\n \n http://old.reddit.com/user/me/overview\n \n (Keep in mind that sometimes just post karma or comment karma being negative will result in this message)\n \n ~\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/PoliticalHumor) if you have any questions or concerns.*",
            "You have to understand that democratic imperialism is superior to autocratic and theocratic imperialism.",
            "teehee  it's a curse  but pays well as a proofreader.",
            "Benedict Donald! Lmao!",
            "I was referring to the Battle of Khasham. Never publicly said anything of  Russians direct involvement.",
            "That's not what your link says. Your link says that the US intelligence agencies didn't agree on the strength of the evidence, but that a 2021 review determined there was suggestive but insufficient evidence for the Russian bounty program, but strong evidence that Russian intelligence encouraged Afghan criminals to attack US soldiers. Your link makes no suggestion that the bounty program was a fake Russian psyops.",
            "Why even include a source if it doesn't support what you're saying? Is it just for the optics of \"having a source\" and hoping people won't actually check it because it's Reddit?\n\nLike ffs dude the article even states where the information is from\n\n>Afghan detainees, financial records captured during a raid, and \"information and evidence of connections to criminal agents in Afghanistan and elements of the Russian government\"\n\nIt being given a low to moderate confidence rating in its truthfulness is not at all backing up the \"fake Russian propaganda that Russia paid the US media to air\", it just means that it's not confirmed as true despite having *some* evidence to back it up.\n\nThe low-confidence evidence threshold for U.S. intelligence agencies is still far more than your threshold for believing crackpot theories it seems like.",
            "Reeeeeeeeeeeeeeee drumpf small hands Biden presidency is the best in history you raciat",
            "You misspelled \"for\"",
            "Oh, I know -- but seven year old me did not.",
            "the common cold was not produced in a lab. I'm not saying it was a bioweapon, but you can't compare the two",
            "Hello! Thanks for your comment. Unfortunately it has been removed because you don't meet our karma threshold.\n\n You are not being removed for political orientation.  If we were, why the fuck would we tell you your comment was being removed instead of just shadow removing it?  We never have, and never will, remove things down politicial or ideological lines. Unless your ideology is nihilism, then fuck you. \n \n Let me be clear: The reason that this rule exists is to avoid unscrupulous internet denizens from trying to sell dong pills to our users.  /r/PoliticalHumor mods reserve the RIGHT to hoard all of the dong pills to ourselves, and we refuse to share them with the community.  If you want Serbo-Slokovian dong pills mailed directly to your door, become a moderator. If we shared the dong pills with the greater community, everyone would have massive dongs, and like Syndrome warned us about decades ago: \"if everyone has massive dongs, nobody does.\"\"\n \n If you wish to rectify your low karma issue, go and make things up in /r/AskReddit like everyone else does. \n\n Thanks for understanding! Have a nice day and be well. <3\n \n You can check your karma breakdown on this page:\n \n http://old.reddit.com/user/me/overview\n \n (Keep in mind that sometimes just post karma or comment karma being negative will result in this message)\n \n ~\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/PoliticalHumor) if you have any questions or concerns.*",
            "if only he was a real billionaire, then he could have his own space program...",
            "Well considering theres like hundreds of posts by \"this guy\" over the past 8 years or so, that shouldn't be that hard to find.\n\nThere's another FBI account with a blonde woman (I can't remember the name on the acc, but I recognize the pfp) that does the same thing. Posts some shady political gaslight and somehow that post is instantly on the front page in a matter of hours, every time. Its really obvious if you've been on reddit for a while.",
            "Hello! Thanks for your comment. Unfortunately it has been removed because you don't meet our karma threshold.\n\n You are not being removed for political orientation.  If we were, why the fuck would we tell you your comment was being removed instead of just shadow removing it?  We never have, and never will, remove things down politicial or ideological lines. Unless your ideology is nihilism, then fuck you. \n \n Let me be clear: The reason that this rule exists is to avoid unscrupulous internet denizens from trying to sell dong pills to our users.  /r/PoliticalHumor mods reserve the RIGHT to hoard all of the dong pills to ourselves, and we refuse to share them with the community.  If you want Serbo-Slokovian dong pills mailed directly to your door, become a moderator. If we shared the dong pills with the greater community, everyone would have massive dongs, and like Syndrome warned us about decades ago: \"if everyone has massive dongs, nobody does.\"\"\n \n If you wish to rectify your low karma issue, go and make things up in /r/AskReddit like everyone else does. \n\n Thanks for understanding! Have a nice day and be well. <3\n \n You can check your karma breakdown on this page:\n \n http://old.reddit.com/user/me/overview\n \n (Keep in mind that sometimes just post karma or comment karma being negative will result in this message)\n \n ~\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/PoliticalHumor) if you have any questions or concerns.*",
            "Both",
            "I'm not sure, I haven't seen that video, link?",
            "Hello! Thanks for your comment. Unfortunately it has been removed because you don't meet our karma threshold.\n\n You are not being removed for political orientation.  If we were, why the fuck would we tell you your comment was being removed instead of just shadow removing it?  We never have, and never will, remove things down politicial or ideological lines. Unless your ideology is nihilism, then fuck you. \n \n Let me be clear: The reason that this rule exists is to avoid unscrupulous internet denizens from trying to sell dong pills to our users.  /r/PoliticalHumor mods reserve the RIGHT to hoard all of the dong pills to ourselves, and we refuse to share them with the community.  If you want Serbo-Slokovian dong pills mailed directly to your door, become a moderator. If we shared the dong pills with the greater community, everyone would have massive dongs, and like Syndrome warned us about decades ago: \"if everyone has massive dongs, nobody does.\"\"\n \n If you wish to rectify your low karma issue, go and make things up in /r/AskReddit like everyone else does. \n\n Thanks for understanding! Have a nice day and be well. <3\n \n You can check your karma breakdown on this page:\n \n http://old.reddit.com/user/me/overview\n \n (Keep in mind that sometimes just post karma or comment karma being negative will result in this message)\n \n ~\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/PoliticalHumor) if you have any questions or concerns.*",
            "Please give me the number of your plug because I want some of the shit you’re smoking",
            "No not a me problem, just open your eyes and look at the prices man. God gave you a brain to have common sense for a reason. These fools just sending money to other countries and charging us the people",
            "Please give me the number of your plug because I want some of the shit you’re smoking",
            "Why’s that? Because all of the taxes he is charging us?",
            "Where were you living the past 8 years? Clearly there’s a difference and these past 4 years weren’t it chief",
            "All you need to do is look at store prices when trump was here, compared to the last 4 years. As respectfully as I can say it, wtf has Biden done for usa? Not shit",
            "Please give me the number of your plug because I want some of the shit you’re smoking",
            "im not sure, is that the same Afghanistan where biden just decided to abandon all of our expensive military equipment, even though the taliban offered him enough time to evacuate it, effectively taking american taxpayer money and gifting it to terrorists? 🤔 how many Afghanistan’s are there?! is there really more than one?!",
            "We are 8 billion and growing … how bout you post that a couple more times idiot.",
            "Hello! Thanks for your comment. Unfortunately it has been removed because you don't meet our karma threshold.\n\n You are not being removed for political orientation.  If we were, why the fuck would we tell you your comment was being removed instead of just shadow removing it?  We never have, and never will, remove things down politicial or ideological lines. Unless your ideology is nihilism, then fuck you. \n \n Let me be clear: The reason that this rule exists is to avoid unscrupulous internet denizens from trying to sell dong pills to our users.  /r/PoliticalHumor mods reserve the RIGHT to hoard all of the dong pills to ourselves, and we refuse to share them with the community.  If you want Serbo-Slokovian dong pills mailed directly to your door, become a moderator. If we shared the dong pills with the greater community, everyone would have massive dongs, and like Syndrome warned us about decades ago: \"if everyone has massive dongs, nobody does.\"\"\n \n If you wish to rectify your low karma issue, go and make things up in /r/AskReddit like everyone else does. \n\n Thanks for understanding! Have a nice day and be well. <3\n \n You can check your karma breakdown on this page:\n \n http://old.reddit.com/user/me/overview\n \n (Keep in mind that sometimes just post karma or comment karma being negative will result in this message)\n \n ~\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/PoliticalHumor) if you have any questions or concerns.*",
            "Way to deep throat the Dems.  👍",
            "Not by the time biden was in office",
            "No, I didn't.\n\nHere's the catch:\n\nThere's making a poor decision\n\nVs executing said poor decision that clearly is having catastrophic outcomes and refusing to pivot.\n\nIt was clear immediately this was a huge mistake. Biden didn't care.",
            "> hold my beer\n\n\\- Clarence Thomas, Samuel Alito, Brett Kavanaugh, Neil Gorsuch, Amy Coney Barrett, John Roberts",
            "MAGA is directed from Moscow so no surprise.\n\nMurdered KGB Propagandist defector Yuri Bezmenov in a 1984 interview on ideological subversion -\n\n\"Ideological subversion is the process which is legitimate overt and open, you can see it with your own eyes. All you can do, all Americans needs to do is to unplug their bananas from their ears, open up their eyes and they can see. There is no mystery. It has nothing to do with espionage. I know that espionage and intelligence gathering looks more romantic, it sells more to the audience through the advertising, probably. That's why your Hollywood producers are so crazy about James Bond type of thrillers. But in reality, the main emphasis of the KGB is not in the area of intelligence at all. According to my opinion and the opinion of many defectors of my caliber, only about fifteen percent of time, money and manpower is spent on espionage as such. The other eighty-five percent is a slow process which we call either ideological subversion or active measures, or psychological warfare. What it basically means is, to change the perception of reality, of every American, to such an extent that despite an abundance of information no one is able to come to sensible conclusions in the interest of defending themselves, their family, their community and their country\"",
            ">But the one great shocking occasion, when tens or hundreds or thousands will join with you, never comes. That’s the difficulty. If the last and worst act of the whole regime had come immediately after the first and smallest, thousands, yes, millions would have been sufficiently shocked—if, let us say, the gassing of the Jews in ’43 had come immediately after the ‘German Firm’ stickers on the windows of non-Jewish shops in ’33. But of course this isn’t the way it happens. In between come all the hundreds of little steps, some of them imperceptible, each of them preparing you not to be shocked by the next. Step C is not so much worse than Step B, and, if you did not make a stand at Step B, why should you at Step C? And so on to Step D.\n\n>And one day, too late, your principles, if you were ever sensible of them, all rush in upon you. The burden of self-deception has grown too heavy, and some minor incident, in my case my little boy, hardly more than a baby, saying ‘Jewish swine,’ collapses it all at once, and you see that everything, everything, has changed and changed completely under your nose. The world you live in—your nation, your people—is not the world you were born in at all. The forms are all there, all untouched, all reassuring, the houses, the shops, the jobs, the mealtimes, the visits, the concerts, the cinema, the holidays. But the spirit, which you never noticed because you made the lifelong mistake of identifying it with the forms, is changed. Now you live in a world of hate and fear, and the people who hate and fear do not even know it themselves; when everyone is transformed, no one is transformed. Now you live in a system which rules without responsibility even to God. The system itself could not have intended this in the beginning, but in order to sustain itself it was compelled to go all the way.\n\n— Milton Sanford Mayer, *They Thought They Were Free: The Germans 1933-45*\n\nI think about this quote often. I would so strongly encourage people to read the whole book, it's a sobering and extremely prescient insight into the human psyche, and a terrible warning of what's still to come. Trump will be gone sooner rather than later, either by defeat or death, but the millions of psychotic MAGA morons who are completely disconnected from objective reality will still be here.",
            "RIP Nemik.\n\nMAGA: \"Flooding the zone with shit since 2015.\"\n\nIt really is the basis of the \"own the libs\" playbook - keep up the pace of outrages and you outrun their ability to respond to any single one.",
            "Historically, this is trait of autocrats and fascists. They flood the zone with so much shit that no one can parse the events and simple ignore the negative news. Then the autocrat replaces reality with fantasy and the intended audience doesn't know the difference.\n\nCall a coup a \"protest\" and seditionists \"political prisoners\" while telling everyone the coup never really happened. Welcome to 1984 or 2024 or 1938.",
            "Isn't there like a website that documents all the stupid shit Trump has done since he took office?",
            "You'd need to let a list, and it would have to be super tldr in order to fit everything. And at that point it looks like a gish gallop but like.. No.. Trump is just consistently awful day after day. His list of atrocities is roughly his daily journal.",
            "Pure insanity. The fact this is even a possibility blows my mind.",
            "Yet so many other loads thinking that fucked up load is load-Jesus. Where was Linda Lovelace when we needed her?",
            "Still better than Biden",
            "No standards. \n\nThe lack of basic decency, is the point. \n\nTrump gives them permission to do and they want.  That's the tease of him.  Just give him enough power, and he will let his followers rape and kill and do whatever they please.  That's the fundamental pact here - the loss of decency and morality, replaced by loyalty and belonging to a new side.",
            "So fucking scary how seriously important it is to vote against this POS.",
            "> It would be hard to intentionally design a human so completely bereft of compassion for others as DJT.\n\nAnd maybe, finally, THAT'S why the MAGA crowd love him so unconditionally - he hates and resents the way they do!",
            "Jesus fucking Christ we are doomed as a species if we cannot rid ourselves of this foul degenerate beast of a man come November",
            "That's horrible. Have you considered the fact that your hero Biden needs a cheat sheet with pictures to show him how to wipe?",
            "How much time on average per day do you spend thinking about or talking about Donald Trump?",
            "Be worried",
            "Don't have any, sorry",
            "Hi u/IncandescentAxolotl. https://i.imgur.com/L983L8y.gifv\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/PoliticalHumor) if you have any questions or concerns.*",
            "Trump taking credit for capped insulin prices. I bet you that had ppl started to complain then he would have pulled a 180 and dissociated with it thoroughly and immediately.",
            "Wow, I'm really much impressed about your profile personalities. I'll like to be your friend if you don't mind sending me a friend request so we can talk more, I sent you a friend request but it never got through, can you try and add me so we can be friends if you don't mind, hope to hear from you soon tap my profile to send me a friend request.",
            "Mutant conservatives is expected. Militant socialist gets you called a communist and your career is nuked from orbit.\n\n\nRemmeber when the GOP made the FBI investigate the Clinton's for supposedly wanting to hire their cousin as a white house intern despite the FBI admitting weeks into the years long investigation? \n\n\nIt cost the DNC the midterms due to perceived corruption. Despite the lack of evidence.",
            "Yeah. They need to get tf after it",
            "The Republicans have the huge advantage of a vast propaganda network to amplify their talking points. The left has nothing on the scale of Fox News, OANN, InfoWars and their slimy ilk.",
            "It’s a figure of speech not the senate floor.",
            "your imperialism killed a million iraqis.",
            "If you want to have a pointless pissing contest, I'm down.\n\n\nShow me one single human being who thinks Biden is the best president in history, ill happily wait.  \n\n\nMeanwhile I'll have so many links to people who think the stumbling, bumbling, sex addicted, felon with a shitty diaper is literally sent from God to lead us into a heavenly new kingdom. 😂",
            "[cracker bargle](http://i.imgur.com/1zfkFBz.jpg) ~\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/PoliticalHumor) if you have any questions or concerns.*",
            "I used to pore over atlases and maps as a kid. I always wished they came with a pronunciation guide.",
            "Neither was SARS-Cov-2 but unlikely that I'd be able to convince you otherwise. I wonder if you are afraid of any of the ancient viruses and giant bacteria that will be released when the permafrost melts. Maybe you will blame it on China, too. Maybe they had a time machine thaybwent back to create them and then timed it so that it would be released around this decade and they knew that the country of the US would be formed and that post 2004 a group of antivaxxwrs would rise up and by 2020 it would take over the majority of one of the two major political parties and hijack the narrative and become cynical and skeptical of all science. Because apparently that would be somehow more conceivable than it being transmitted to humans via uncooked meat after wild and/or exotic animals have interacted in nature and potentially fed themselves with food sources tainted with bat guano.",
            "I hear a sea lion is the distance, but I'll oblige: [link](https://mediaproxy.snopes.com/width/1200/height/900/https://media.snopes.com/2024/01/ivanka_miniskirt.jpg)",
            "There’s your problem right there.. you’re poor because you are using drugs.. quit blaming Biden on YOU problems and get the help you need",
            "My eyes are open because I’m more successful now than ever! Times were extremely tough for people under the 2020 election loser but a bunch of maga sex offenders said it could be worst so pull yourself up bu the bootstraps..\n\nYou should take magas advice and do the same. Don’t sot around crying and go out and make more money. Plenty of jobs out there and we currently have the highest wages ever seen in history in this country! Also new records on Wall Street every month! Might retire early! God bless America",
            "I know there's lots of talk on social media about a bad economy, but [the numbers don’t in any way suggest that it's true](https://www.theguardian.com/business/2024/jan/21/republicans-healthy-us-economy), and while I recognize that [people don’t actually *feel* good about the national economy overall](https://www.economist.com/united-states/2024/01/14/why-are-americans-so-gloomy-about-their-great-economy) (despite all available data), [they actually *do* seem both relatively happy and generally optimistic about *their* personal finances](https://www.axios.com/2024/01/17/americans-are-actually-pretty-happy-with-their-finances), and [wages in many sectors (not \"only the rich\") are growing more quickly than inflation](https://www.americanprogress.org/article/workers-paychecks-are-growing-more-quickly-than-prices/).\n\n\nI don't think any credible person would suggest it's smooth sailing everywhere for everyone, but [there really has been decades-low unemployment](https://www.nerdwallet.com/article/finance/jobs-report-unemployment-rate) right now, [2022 saw decades-high job growth](https://www.epi.org/blog/historic-job-growth-in-2022-reflects-strong-but-uneven-economic-recovery-state-and-local-lawmakers-should-prioritize-rebuilding-the-public-sector-in-2023/), and 2023 was [the third consecutive year with more than 2.6 Million added jobs, which hasn't happened since the 90s](https://www.usatoday.com/story/graphics/2024/01/05/2023-jobs-report-unemployment-rate/72112266007/).\n\n\nSo, let's try this: How, exactly, do you believe the president controls grocery prices?",
            "It's called \"supporting data\": You should click on those blue words, as they are links to websites that will explain how disastrous Trump was for the economy (despite your *feelings*).\n\nAlso: Exactly how many times are you going to use the exact same line in response to people pointing out the shallowness of your argument?",
            "I'm sure it's not the same, because Biden had everything decided by trump, who stuck it to him. All the retreat's mess it's on trump. Which is no surprise, given the shitshow his govern was, all the debt he left for Biden to deal with, all the inflation, gas prices, you name it.\n\nThe only thing trump excelled on was selling the country to the enemy, turning his back on his allies, being a pedophile and a crook in general. On that he was second to none.",
            "Squee",
            "Brett \"Hold my beer,\"\n\n\"Okay how many of them?\"\n\n\"Yes\"\n\nKavanaugh",
            "Traitors one and all…",
            "I need a link to this thing",
            "\"Why do I have to go to that stupid graveyard? Its full of losers and suckers.\"\n\n-Trump on D Day",
            "Literal antichrist",
            "LOL he will let his followers rape and kill. Where’s the humor in this one?",
            "Including them, but they either prefer that or lack the strength of character to recognize when they're being treated like shit.",
            "Using an imaginary burn against Biden to counter something Trump provably said in order to avoid having to actually respond to it is a pretty hilarious strategy from Trump supporters.",
            "Source?",
            "Lots, because he's trying to fuck up our country and planet and had a lot of dumb supporters. Any other dumb questions?",
            "He's a particularly bad yet popular candidate for the 2024 election when we're months away from said election. I don't know if the whole TDS bit is gonna land properly. \n\nMaybe once Trump is gone from the public eye or dead, you'd have a point if people are just constantly railing against Trump and what he said or did-- but considering he's still very much relevant to American politics I don't see your point.",
            "Don't worry, everyone here figured that out already.",
            "It's weird that there are a subset of voters who even fall for the double standard. I'm assuming it's independents-- unsure how an independent who felt that hiring a cousin as an intern was worthy of voting Republican because of \"corruption\" could ever vote Republican again after Trump bringing practically his entire family into official positions.",
            "We have the late, great Ronnie Reagan, to thank for that. \n\n\n\n\n\nThat said, President Obama had a chance to reinstate the Fairness Doctrine and whiffed at that.",
            "Well to be specific, if you remember, Democrats didn't get control of the House until 2019. \n\nThen they didn't get control of the Senate until 2020. \n\nWhen I say, \"you misunderstand the political landscape\", I mean to say, you don't understand politics if you think Democrats were going to rehash or relitigate shit that happened in 2017 when there's a pandemic, and a president being impeached for Ukraine, etc. \n\nYou don't understand politics if you think the general public would give a flying fuck about something that happened in 2017. They'd be ***pissed*** that Democrats were not focused on the now, 100%.",
            "No. I'm not American. My imperialism killed tens of thousands of danes and polacks, among others.",
            "Imperialism kills. American imperialism can be protested and democratically ended without secret police or overt military action causing death and mayhem amongst anyone who calls out state crimes. \n\nIranian imperialism killed many of those Iraqis you are putting at Americas feet, paying and supplying Shiite militias in their attempt to seize control. \n\nRussian Imperialism is killing hundreds of thousands of Ukrainians and hundreds of thousands of africans. It killed hundreds of thousands of Syrians. It does those things not through accident and reckless manslaughter, as America does, but as deliberate policy.\n\nChinese Imperialism is engaged in genocide right now and is killing untold millions in Africa as they sponsor all manner of proxies to maintain control of mineral rights.\n\nCall out Imperialism wherever it occurs. Dont try to deflect to America just because thats the one powerful nation where you can speak openly of it without getting shot.",
            "There is actually more and more evidence that covid-19 came from a lab.",
            "you're so condescending that I doubt you'd convince anyone of anything, even if you were right",
            "Is that a video of Donald Trump where he \"disrespected & talked shit about American Prisoners of War?\"",
            "Lol pay more taxes then😂 it’s your preferred choice.",
            "Also I didn’t say people can no longer be successful, wtf is you smoking 🤦‍♂️I said prices are up because these clowns tax us more,send it to other countries. Please do your research, Biden can’t even walk properly, wears adult diapers and can’t even form a sentence correctly and you are saying he is better for the USA, please give me your plugs number, what is you smoking on?",
            "Please give me the number of your plug because I want some of the shit you’re smoking",
            "BuFu to the max!  Bret Kavanaugh’s definition of the term was oddly different than I recall. He grew up in my generation and he is a lying sack of shit. BuFu was known as butt fucking aka anal sex. He gets up there and says it was anal chugging of beer, because you know ol yeasty likes beer. Idiota🙃😏🤡",
            "Donkey dong Doug",
            "Donkey Dong Doug!",
            "Donkey Dong Doug, veteran of the Devils Triangle",
            "The real King",
            "There is [McSWEENEY’S Lest We Forget the Horrors page](https://www.mcsweeneys.net/columns/reasons-why-donald-trump-is-unfit-to-be-president)",
            "In-fucking-sanity",
            "There’s no audio clip of him saying that. Just some four witnesses claiming he said that. And the media went ape shit. Lol and then I see Biden with his mask on “The words of a president matter”. What a clown.",
            "I doubt that very much!",
            "K. I was talking about merrick doing more….right now. But you keep on lecturing my man.",
            "Don't try to deflect blame. If this was a russian/chinese/rafida supporting comment i would have criticized them too but they barely exists in popular sub-reddits due to most sub mods deleting them at the first sign of them appearing. \n\n\n\n Whataboutism doesn't suddenly remove your crimes. Plus one more thing that, criminal Bush admitted that iraq war was unjust in a public meeting while talking about russian war yet americans try to defend their countries even if their leaders admit their crimes on camera.",
            "Agreed. But I don’t think American imperialism can be voted for. American imperialism has been for longest time conducted by the CIA, an undemocratic institution with unelected members. The American public did not vote for invading Iraq or Vietnam or overthrowing countless countries around the globe.\n\nSo no imperialism is basically the same everywhere.",
            "then provide it",
            "And yet has not been proven true.",
            "Okay. \"I will vote for Trump against my self best interest because an internet stranger was rude even if his statements were factual.\" House washed away by rising sea levels hurts less than the truth. Got it.",
            "[removed]",
            "We’re currently under the 2020 election losers 2018 tax breaks for the rich plan.. sounds like your beef is with maga not Biden",
            "We’re currently under the 2020 election losers 2018 tax breaks for the rich tax plan… sounds like your beef is actually with maga",
            "There’s your problem right there.. you’re poor because you are using drugs.. quit blaming Biden on YOU problems and get the help you need",
            "You left that identical comment elsewhere in the thread. Arent you supposed to spread your copy paste troll farm comments out a little more than that?",
            "He didnt even. He tried to say that \"boofing\" meant fart. And that \"the devil triangle\" he did with several of his frat bros was \"a drinking game\".",
            "Politicians lie. Case in point:  \nhttps://www.cbsnews.com/news/allen-apologizes-for-macaca-comment/",
            "Kava bufu Alito polito Clarence crowhill",
            "Bortles!",
            "I'm sure you don't, you have already shown you don't know how to read the room.",
            "What specifically should he be doing?",
            "When you have companies like Lockheed Martin that bring the US gov. billions of dollars every year, selling war machines, it's not surprising we don't get a say when it comes to war",
            "https://www.nytimes.com/interactive/2024/06/03/opinion/covid-lab-leak.html\n\nhttps://www.vanityfair.com/news/story/ralph-baric-wuhan-lab-leak\n\nAt the very least, you can't dismiss the idea that covid-19 was leaked from a lab as a baseless conspiracy theory.",
            "We’re talking about evidence that the U.S. and Chinese government created and maintained a lab to secretly continue bio-weapons research that had been outlawed in the U.S., and due to lax standards at said lab, microbes escaped that started a pandemic that killed millions and grounded the world economy to a halt. The evidence is out there, but something like this will never be considered “proven” just like MKULTRA all the other clandestine shit the CIA and world governments as a whole engage in will never be “proven” since that would require the guilty to admit to their crimes.",
            "I'm not reading your comments. feel free to save yourself some time",
            "lol, you're such a bizarre demographic of people. \n\nYou seem to genuinely believe that if you're smug enough and can express enough false bravado that you can convince people that your lies are reality. Making up goofy names also seems to be a key part of the strategy\n\nMake a claim about a thing that didn't happen and someone asks you for evidence of it happening? \n\nThat's a goddamn \"sealion\" right there\n\nHave hours of embarrassing clips of your party's chosen political candidate showing signs of dementia? Maybe a diary of his daughter talking about how he forced her to take inappropriate showers with him? \n\nBullshit, those unedited clips are actually \"cheapfakes\"",
            "You seriously think a grandpa with dementia, adult diapers, has to and barely can read sentences from a teleprompter, falls down stairs and bikes, can’t even walk properly, forgets things he talks about mid sentence, you think that is better for USA?💀okay bro",
            "I feel like Biden paid you cause anit no way…",
            "Gullible idiots sign up for the military - Also Donald trump.",
            "You can't read rooms idiot, unless there's posters on the walls or something. You're so stupid.",
            "Well I’m glad more people are realizing this, “democratic imperialism” is a laughable notion and America isn’t some force for good that many see it as, basically the entire world already knows this accept for the American populous.",
            "Yet you keep replying. You do you. Feel free to block me, because I am blocking you.",
            ">You seem to genuinely believe that if you're smug enough and can express enough false bravado that you can convince people that your lies are reality.\n\nBravado! \n\nGenuinely. Thanks for the complement. \n\nBut I don't lie.\n\nE: again congrats about not just slinking off. Normally you dudes realize your position is bullshit and drop it. But your brand new 29 day old reddit account leads me to believe that either you're naive as fuck or this isn't your first propaganda rodeo",
            "Adult diapers produce a bulge easily recognizable. Biden is slim and shows no diaper bulge unlike donnie the diddler who was the most obese human to serve as president had a very recognizable diaper bulge",
            "He paid us in good policy and stable leadership! Dude has kept his whole cabinet together while just 5 years ago people were leaving the 2020 election losers cabinet pretty much every day over failed policies",
            "There it is.  When you grow up and your balls drop, you will understand that phrases meaning.",
            ">Bravado!\n\n>Genuinely. Thanks for the complement.\n\n>But I don't lie.\n\nWhat is that supposed to mean? That's not a coherent or complete thought, and while I don't understand what you were trying to say, I'm guessing by context clues that you don't know what \"false bravado\" means\n\nI understand the edit lol, and the fact that you felt you needed to make multiple edits just so you could communicate that my comment upset you is very strange. \n\nWhy do you guys talk that way? Do you actually think if you're verbose enough and use enough teenage-redditor insults that your nonsensical comments will be a substitute for an actual point? Or in this case the video of \"Donnie disrespected & talked shit about American Prisoners of War\"",
            "[removed]",
            "Is that why many people are leaving democratic states ? Lol clown",
            "Actually I already understand what \"there it is\" means, fool",
            "K.",
            "Yeah, better to have a president that lets a pandemic get out of hand so badly cities couldn't handle the amount of dead people. You're right, much better choice. A guy that shat himself during his day in court. Someone convicted on 34 charges. That is clearly the better choice there champ...",
            "Because democratic states are highly sought after real estate so people with money gravitate causing prices to rise. Republican states are sh*tholes and not desirable to live hence why they are cheaper"
        ]
    },
    "The old adage, “Those who ignore history are doomed to repeat it,” is pertinent here.": {
        "title": "The old adage, “Those who ignore history are doomed to repeat it,” is pertinent here.",
        "score": 203,
        "url": "https://i.redd.it/kylp6fjuy38d1.png",
        "content": "",
        "num_comments": 12,
        "comments": [
            "Want this as stickers.",
            "The term I've been using when people say they want to just ignore all the bad news is:\n\n**\"Silence only helps the oppressor\"**",
            "They didn't ignore it, they jumped head first into nazism.",
            "And that's why Putin is trying to Denazify Ukraine!",
            "This. We cannot ignore the genocide. We cannot vote for genocide.",
            "Some of them did.  The people who opposed it didn’t take it as seriously as they should have.",
            "Right? I hate when people talk about \"history\" like any of these inbred hillbillies can read let alone understand the implications. Instead they just follow the loudest semi charismatic authoritarian they can find. \n\nIt's like when people say \"history won't be kind to....\" or \"I'm on the right side of history\" like anyone is actually going to look back, see the situation and make an informed decision as opposed to do the thing they wanted to do originally.",
            "How's the night shift in Moscow?",
            "We need to send the Nazis packing back to their communal basements here in the states. It’s gonna be troublesome because not only do the American Nazis have a hard on for Trump but HE won’t stop touching that hard on. And we’re all “gross, you’re jerking off Nazis!” But he won’t stop.",
            "You dropped this: /s",
            "Agree.  The Israelis should never again vote for Bibi.  As to Americans, AIPAC has tainted most candidates.",
            "What does that mean that Biden is tainted by AIPAC, or that Biden continues to fund Bibi's genocide?"
        ]
    },
    "Fox News has some \"fair and balanced\" questions it thinks CNN should use in the Presidential debate": {
        "title": "Fox News has some \"fair and balanced\" questions it thinks CNN should use in the Presidential debate",
        "score": 1048,
        "url": "https://i.redd.it/ldwmv1i1718d1.jpeg",
        "content": "",
        "num_comments": 32,
        "comments": [
            "\"That's a great question and I have an answer for it and I'll bet sleepy Joe over there doesn't want you to hear it. Sleepy Joe, folks! He and the liberal media and the deep state want to declare war on the indoors. They say air conditioning is killing the fish. You know the fish, folks, those wonderful fish. I was just talking to a fisherman in Wisconsin the other day, beautiful man, tremendous fisherman he said 'Sir!' He had tears in his eyes you see and he said 'Sir! They're trying to shut me down. They're trying to shut me down because they say if I keep fishing, there won't be any fish left.' Can you believe that folks? Unbelievable. Never forget that the deep state wants to take away your freedom. They want to take your fish, and those beautiful birds they kill with their windmills - you know the ones, they make that horrible sound - and they want to take your air conditioning and your showers - you know how they just drip drip drip they don't want you to be able to wash that soap off your bodies because it might hurt the fish.\"",
            "Biden: *gives an actual answer*\n\nTrump: uhhhh ermmmm uh hamberde covfefe?",
            "![gif](giphy|79KqclLnd9wDC)",
            "Have I told you about the greatest question I ever asked? What do you do if your boat is sinking around sharks? Do you die to electrocution or th sharks? No one has ever asked this.",
            "That's about right. But it doesn't matter what trump really says as all answers are right.",
            "Trumps answer would still take more time and not make any sense at all.",
            "[“Nobody knows more than Donald Trump”— Donald Trump](https://www.youtube.com/watch?v=sR3f95BGIiA)",
            "Sir, looking at these pictures can you identify the whale, shark, and boat with electricity?",
            "They should get some British journalists to ask the questions.  They really really really don't put up with bullshit.",
            "For President Biden: \"Sir, what is your position on a hypothetical war with Iran and the wider implications for the Middle East, with a particular focus on the impact this war would have on the Mazanderani People, you have 7 seconds to respond\"\n\n\nFor President Trump: \" Sir, What is 3+6? You have 15 minutes to answer\"",
            "More like: “Sir, many people say you don’t know if you are indoors or out, but you are indoors now, right?”\n\nTrump then argues that he has every right to be outdoors whenever he wants.",
            "The quantitative easing happened mostly in Trumps term, particularly when the market tanked at the beginning of Covid.\n\nIt was to the tune of six trillion dollars. It was one of the biggest causes of inflation.",
            "Well... you know, the thing about indoors is the doors they're in... I had a guy, I knew a guy once who asked me, and it's probably... he asked me, the guy and it's probably because of my association with  HARVARD COLLEGE... this guy he said why do you Donald Trump have the greatest doors in the world. TERIFFIC. EXCELLENT EXCELLENT doors and I said because I'm in, because they're in... the doors....",
            "I really want to hear trump trying to say exacerbating off a tele prompter.",
            "You just know that MAGA thinks the opposite, i.e., that they will ask Trump thr first question and throw Biden the softball.",
            "Wow, I  just read every damn word in his voice.",
            "\"Also, I have the best doors. The greatest some say. Agubudha, the band the Doors actually voted for me in 2008, did you know that? They are beautiful doors...\"",
            "50-50 this is a real quote!",
            "Hi u/iammandalore. https://i.imgur.com/L983L8y.gifv\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/PoliticalHumor) if you have any questions or concerns.*",
            "Bing bong bingity",
            "Or something insulting or racist and they all cheer.",
            "I thought Trumps answer would be.\n\nDiaper,,,, poopied. Good boy, get cheeseburger. Go sleepy now.",
            "Threve. A combination of three and five. I'm astonished.",
            "Hell yeah, if they could have Will Ferrell as Trebek moderating that would be amazing. Or the principal from Billy Madison.",
            "And here's the data that supports your statement:\n\nhttps://fred.stlouisfed.org/series/WALCL\n\nQuantitative tightening has occurred during Biden's term, unwinding roughly 40% of the FED balance sheet increase that happened during covid.",
            "An alternative viewpoint. \n\nhttps://www.taxresearch.org.uk/Blog/",
            "Um, thanks?",
            "[Things that go ‘bing’ with Donald Trump](https://www.youtube.com/watch?v=pgwr9r36zIU)",
            "\"I respect a man who can speak the honest truth without being scared of the woke crowd!\" Them probably",
            "it's funny cuz it's uh...bigger than a normal hat",
            "Wow, I'm really much impressed about your profile personalities. I'll like to be your friend if you don't mind sending me a friend request so we can talk more, I sent you a friend request but it never got through, can you try and add me so we can be friends if you don't mind, hope to hear from you soon tap my profile to send me a friend request."
        ]
    },
    "I was not expecting this": {
        "title": "I was not expecting this",
        "score": 978,
        "url": "https://i.redd.it/6c7tqguyx08d1.jpeg",
        "content": "",
        "num_comments": 20,
        "comments": [
            "Yeah… clay tablets aren’t gonna last long…",
            "More mass shootings than days so far this year. Glad to see politicians taking action on important issues.",
            "Unfortunately it wont' be helpful because they'll be posters. Maybe kevlar posters...LOL",
            "This truly sums up the Republican \"Christian's\" understanding of the Bible and how to practice it! Worship the God of the Bible, or Trump? You can't do both.",
            "Spot fucking on.",
            "That’s a strong point to consider.",
            "I hate this. It's true and it's brilliant. And I hate that I live in the timeline in which it was made.",
            "Exodus 32:19 - *And it came to pass, as soon as he came nigh unto the camp, that he saw the calf, and the dancing: and Moses' anger waxed hot, and he cast the tables out of his hands, and brake them beneath the mount.*",
            "This is just a sad state in this country.",
            "Both God and GOP work in mysterious ways",
            "Especially 5.56 at ten yards.",
            "Yeah, tides are finally turning back to being tough on crime again in many cities.",
            "You might be on to something.... If they were kevlar posters, at least they'd have a function in a classroom.",
            "[b o t - l i k e   t y p i n g   d e t e c t e d]",
            "Like Space Invader shields",
            "Bump stocks repealed too. Cause bump stocks checks notes do not use the lord’s name in vain.",
            "FBI stats are your friend. Really. Look them up.",
            "Maybe hold it up to the face of a school shooter and be like \"thou shall not kill\" and instantly the shooter will lay down their weapons and repent and be saved. \n\n\n/s",
            "lol … *ChatGPT has entered the chat*",
            "it sounds like you have some stats in mind. Care to share?"
        ]
    }
}