{
    "I f'ing hate Wikipedia": {
        "title": "I f'ing hate Wikipedia",
        "score": 911,
        "url": "https://i.redd.it/10mffir0z18d1.jpeg",
        "content": "",
        "num_comments": 324,
        "comments": [
            "Im pretty sure \"cultural marxism conspiracy theory\" was originally called just \"cultural marxism\"",
            "Funnily enough, many of the more fringe left-wing—genuine communists and Marxists, not current-thing-supporters or slick establishment liberals—*hate* Wikipedia because it's perceived as having a neoliberal, pro-Western homogeneity slant. Wikipedia is good for things that are objectively true: e.g., mathematics, astronomy, and physics; iffy on history and culture; and should be avoided for any contemporary, controversial political subject.",
            "Wikipedia is so cooked with agenda edits that we might actually have to fall back with physical encyclopedia.",
            "If you ever want to see the reason why I will piss on the burning corpse of Wikipedia then take a tumble down the rabbit hole known as Ryulong and his mouth foaming obsession with the Gamergate page.",
            "Most of wikipedia moderators are marxist so obviously politically charged articles will be from marxist perspective. They also tend to use secoundary sources as opposed to primary sources if the secoundary source cones from a mainstream publications. Eich you know most of them are leftist",
            "After seeing the clusterfuck that is rationalwiki, I cannot be too mad at Wikipedia tbh (yeah I know bigger reach and credibility but still)",
            "Sorry but isn't Frankfurt school identified itself as cultural Marxist? Even though it's distinguished from Soviet style communist. \n\nAdd: Sorry I didn't know the word is stigmatization, now I know it. I just felt if they're Marxists who focus on culture study... then they should self identified as cultural Marxist?",
            "You don't hate wikipedia enough.",
            "Bro where does Wikipedia say that pro capitalism stances make you a nazi? Likewise for classical liberalism somehow being alt right?",
            "I'm sorry but what the fuck is anger-inducing about this, exactly? These are accurate descriptions of these positions and belief? They also have literally nothing to do with what the wojak is saying?\n\nThis is a dumb fucking post and you should probably feel bad for having made it. The page for classical liberalism doesn't call you a fucking fascist nazi, so I genuinely have ***no*** idea why you're drawing these connections to yourself, unless you're actually an alt-right far-right person who believes in cultural marxism.\n\nThe post is truly breaking my brain. I'm starting to think most of you are literally just NPCs who go around finding anything to be angry at.\n\nJust indulge in some reading comprehension. Lord thunderin’.\n\nhttps://preview.redd.it/oji1k3zqu28d1.png?width=971&format=png&auto=webp&s=6765258b92f9fa4aa48a47404cbdc924a55bacd7",
            "The wikipedia pages about anything related to my country are filled with such frequent yet small and subtle agenda edits that you'd never notice if you didn't already know about the subject matter. They cite the most bogus blogposts or whatever as sources too, and sometimes just straight up link different things hoping nobody will ever check.",
            "my favourite conspiracy theories are one's that can not only be proved but can actively be shown in real time.",
            "Also wikipedia: why doesn't anybody give us money :(",
            "Uh buddy, none of the pages you showed other then the last one were relevent to what your chad wojak said beforehand, the far right page doesn't mention capitalism in the passage you showed it mention nazis being far right, not far-rights being nazis, and the last was relevent to what you said but because of all the previous ones being bs it makes \"cultural marxism is a conspiracy\" to be a rational take, also wikipedia is libleft by the very concept of the site (free info no ads edited by the collective but the creator tried to edit his own page and failed)",
            "If it's not about politics or anything controversial Wikipedia is nice.  Else it's uhhh... yeah... nice.",
            "I’m a nationalist who happens to be white. I don’t know why my skin color has to be included.",
            "Bro if you are having arguments with an encyclopedia it’s time to turn off the internet and go touch some grass.",
            "I just stopped giving them money lol. I used to always donate 50-100$ per year.\n\nZero dollars for the past 5 years.\n\nIf it dies, then it dies.",
            "Wikipedia co-founder Larry Sanger gave up on it years ago for this reason.",
            "Wikipedia only works for non-controversial topics (in a currently debated topic, not in a genocide that hapenned 500 years ago way).\n\nIf you go to the wikipedia page of Juan Domingo Peron in [english](https://en.wikipedia.org/wiki/Juan_Per%C3%B3n#Protection_of_Nazi_war_criminals) you will have the fun fact that he was a close friend of lots of war criminals such as the infamous Ante Pavelic and had a lot of fascist influences, meanwhile if you go to the [Spanish](https://es.wikipedia.org/wiki/Juan_Domingo_Per%C3%B3n) one you will hear of no such things because he is praised as a hero by the modern left (ironic innit).",
            "If I've learned anything from these last few years, if it's called a conspiracy by the modern left, then it is probably not a conspiracy",
            "Well yeah when you look up these terms it shows up on Wikipedia. \n\nhttps://en.wikipedia.org/wiki/Classical_liberalism\n\nThis is the Wikipedia link you’re looking for.",
            "There are genuine things to attack wikipedia and the left on, this isn't one of them",
            "even one of the co-founders of wikipedia said it has become propaganda for the leftist establishement: [Wikipedia co-founder says site is now 'propaganda' for left-leaning 'establishment' (nypost.com)](https://nypost.com/2021/07/16/wikipedia-co-founder-says-site-is-now-propaganda-for-left-leaning-establishment/)\n\n  \nthe left hijacked the largest database of knowledge in human history and turned it into a propaganda tool, and that is deeply saddening.",
            "I'm so confused? Where does Wikipedia say classical liberals and capitalists are far right? \n\nIs this just a right winger getting angry at an argument they completely made up?",
            "Wikipedia wasn't saying the words you ascribed to them in any of the boxes. It didn't equate the far right with capitalism either.",
            "STFU Wikipedia is based as balls and it's not its fault if you have 0 critical thinking skills and somehow think that capitalism is far-right.",
            "I did notice that just recently. How long has CM been listed as a conspiracy theory on Wikipedia?",
            "https://preview.redd.it/artcg9tlo38d1.jpeg?width=1179&format=pjpg&auto=webp&s=49c536388800c004169aee1686bb087235dab3b4",
            "I think it's like a corollary to the Socrates quote that people who aren't interested in government will be governed by fools that are:\n\nPeople that aren't interested in editing Wikipedia will use a Wikipedia governed by fools that are.",
            "How do the wikipedia screenshoot demonstatrte anything. In the first one it dosen't talk about capitalis and in the second one it dosent talk about classical liberalism. You are punching the air",
            "Getting mad at Wikipedia is refined copium, absolutely unhinged",
            "Jesus, you guys are just trying to be mad. There are Wikipedia articles on capitalism and classic liberalism, but you have to complain about articles on FAR-right ideologies because Wikipedia says that they are extreme (everything with the word \"far\" is extreme, crazy right). Snowflakes",
            "Wikipedia is absolute dog shit, written by terminally online activists who love to revise history to make themselves feel better - and frankly, we should be more disgusted and scared by that.\n\n\nThese mother humpers would rather lie and have history be a lie then fight an honest fight (and STILL win).\n\n\nJust...fuck off, would you? You're not making the Right go away, you're making the Left worse! ",
            "I have never seen anyone mention cultural Marxism that was moderate in their views.",
            "Most of these leftists think the most rightward opinion you can hold and still be on \"The left\" is abolishing capitalism. Which would make The Fascists and their desire for corporatism leftist but whatever",
            "OP is being kind of silly. “I don’t think capitalism is that bad“ ≠ far-right politics. \n\nThat’s like someone thinking that the minimum wage should be raised by a few bucks, looking up the Wikipedia article for far-left politics, and then getting upset that it keeps talking about communism and anarchist socities. \n\nThe article ain’t talking about you, bro.",
            "Right wingers beefing with Wikipedia LMAO",
            "cuckipedia sucks",
            "The term \"alt right\" was coined by Richard Spencer, who's definitely a neo nazi.  The people in the 2016-17 era who identified as \"alt right\" were the same people going around talking about the \"JQ\" (i.e. \"Jewish question\"), chanting \"Jews will not replace us\" at Charlottesville, etc.\n\nThere's not really anything you can point to as an authoritative source for the principles of the alt right that everyone will agree with (similar to most things), nor any catalog of everything that any self-identified \"alt right\" person thinks, but there was indeed a huge amount of anti-Semitism involved in the early days of it.",
            "Wikipedia can deffo be a mixed bag. While i've seen neutral articles about even the most controversial figures, others were very obviously edited to push a narrative.",
            "I used to donate to Wikipedia every year. Until it became Wokepedia. Now they don't get a dime from me. Stuff that propaganda up your ass.",
            "Funny thing is that I searched for cultural Marxism yesterday and thought of the same thing",
            "If every record told the same tale, the lie was passed into history as truth",
            "Classical liberals exist. All the things mentioned in the article also exist. Pretending there's only 1 singular right wing movement is stupid and lazy",
            "Can somebody explain the context pls.",
            "Who else remembers when Cultural Marxism wasn't a \"conspiracy theory\" on Wikipedia.\n\nPepperidge Farm Remembers",
            "i depicted myself as the Based Chad and you as the Soyjak loser. Gg",
            "Wikipedia is one the best things humanity ever created. Fuck you for this feeble attempt at slandering it. The meme doesn't even make sense. The wojak reactions are completeltly disconnected from the wikipedia snippets.",
            "What the hell is this strawman? The articles you screenshot don't match at all what you're claiming wikipedia is.\n\nLike, at what point does the first article mention that being pro-capitalism is a far right belief? At what point does the second article say that being a classical liberal falls under the alt right umbrella?",
            "Wow thought this was the conservative sub reading these bitch comments",
            "Anything vaguely political or contentious on Wikipedia should be practically ignored.\n\nLike that time an airliner got shot down by separatists over Ukraine. Russia claimed it was a Ukrainian Su-25 that was responsible. This was absurd because a) the Su-25 is a ground attack aircraft and b) it literally doesn’t have the flight ceiling to intercept airliners.\n\nSo Russia went and edited the Wikipedia page of the Su-25 to increase its flight ceiling.",
            "Finally Wikipedia getting the hate it deserves. For me, the original sin was when they removed donations via crypto, based on an incredibly biased discussion behind the scenes.\n\nBut here's a corollary to this *deserved hate*:\n\nConservatives *know* Wikipedia has been subverted. Yet, I've seen zero concerted efforts to change that.^\\* \n\nI don't just mean a call to action for conservatives to edit more. I mean something like, Peter Thiel creating and generously funding the \"Free Knowledge\" initiative, training centrist-leaning students or academics to become active WP editors, or supporting conservative admin candidates so they stand a chance against the far-left hegemony on WP.\n\n ㅤ   ㅤ   ㅤ   ㅤ  \n^\\* No, neither Conservapedia counts, nor that dead on arrival abomination Citizendium.",
            "This isa direct quote from Wikipedia (\"Far-right politics\"):\n\nThey reject both their national political system and the global geopolitical order (including their institutions and values, e.g. **political liberalism** and egalitarian humanism)\n\n(Emphasis mine)\n\nSo, could you elaborate why do you think Wikipedia includes classical liberalism within the definition of far eight politics when to me it looks the complete opposite?",
            "your first mistake was searching up political terms on wikipedia",
            "Liking capitalismt doesn't make you alt right, a better argument would be that you hate the poor and like class exploitation. Anyone who calls you racist because you like capitalism is either a shitlib who doesn't know what they are talking about or they've poorly worded the argument about how capitalism disproportionately exploits minorities, but to believe that they already have to be against capitalism for exploitation.",
            "Something about facts not caring about feelings",
            "Well, wikipedia covers all biases equally.\n\n...its not like it lacks data on topics tankies would like to get removed, or its not dissing on postmodern bullshit philosophy of Emily.\n\nAuthright just needs to man up, and stop being a fucking bitch, who cannot take criticism.",
            "Woop Woop, who controls knowledge, controls what the world see. I don't see any problem with this, just another social control tool",
            "I entered in classical liberal and capitalism and just got definitions, is there context I’m missing or just wojak dolls again?",
            "\"Classical Liberalism\" 🤦\n\nOh right, the Jordan Peterson scam.\n\nYeah it might not be Wikipedia buddy.",
            "Wikipedia W",
            "Yeah, I don’t know about this one OP. Maybe you should read Wikipedia’s article about the [Straw Man argument](https://en.wikipedia.org/wiki/Straw_man?wprov=sfti1)",
            "Ah yes, it's the left wingers that are the snowflakes who make up shit to be angry about. How are the first two articles even related?",
            "Damn dude, imagine having to reach this hard just to pull shit out of your own ass…",
            "Strawman fallacy",
            "Cringe and OP can't even win imaginary strawmen arguments in their head pilled",
            "Wikipedia is great",
            "do the victim mentality retards in this thread not know wikipedia is not just one nerd ruining their life??\n\nit crowd sources it's information, meaning if you find something wrong create an account (or log in) and point it out, and these nerds love it...\n\nyou don't even need to fix it, you can just point out it out and back it up with a couple of reliable sources.",
            "That's why I just can't stand the Left (Not Leftists Y'all are tight, as long as you aren't Wokescold Freaks, They are way too aggressive, and want you to think you are in the wrong, when you know that you aren't, It's the Left's fault the Alt Right even exist anyway, How can you tell people they are automatically racist by proxy of their birthright, and be suprised when they turn Into Alt-Righters, The Right Wing might humiliate, intimidate and bully people into being on there side, but I don't remember being Doxxed by a Nic Fuentes fan, I have been Doxxed by twitter wackos",
            "What in the strawmanning is this?",
            "When you respond to facts with anger, perhaps it's time to look in the mirror.",
            "I mean in good faith if it’s an actual thing can you actually tell me what ‘cultural Marxism’ is. Like what’s its goals, what’s its historical basis. Can you name any political thinkers who call them themselves that like you can with any other ideology\n\nBecause it seems to me that cultural Marxism is just another word used by conservatives to describe things they don’t like, like woke",
            "Hahaha they re right though. Fuck the right wing in all its forms.",
            "There is no \"Cultural marxism\". Period.\n\nThe other day I was engaged in conversation with some alt-right dude who also was *\"against cultural marxists*\" so I asked him, in what sense \"Cultural marxism\" (picture of which alt-right stubbornly continue to portrait) has any relevance to Marx, and he proudly announced that\n\n*>>it's basically where classes have been replaced by the three categories against white heterosexual males, namely non-white, homosexuals and women*\n\nAnd it seems that **this** is alt-right's \"Cultural marxism\", no shit. Not Frankfurt school, not Adorno or Marcuse, not anything else but **this**.\n\nI told him that you cannot take away all the essential elements from the theory, replace it with totally another stuff and still claim that it's the same thing.\n\nFor easening his understanding process I proposed he replace his beer with piss and his snacks with shit and enjoy a nice dinner. For some reason he didn't listen to this well-thought offer.\n\nAlso, when I asked if he can name any \"cultural marxists\" he came up with Joe Biden. Yeah sleepy-Joe, I always suspected you're an obvious spin-off of tovarichsh Breznev. Go for it.",
            "https://preview.redd.it/8hwddyapm38d1.jpeg?width=750&format=pjpg&auto=webp&s=ca766cacdafb3c289ef209a936b6f6711f6f6e10",
            "Cope harder",
            "I chuckle at anyone who uses the term *cultural Marxism* unironically.",
            "> cultural marxism\n\nyep. this is another alt right classic",
            "You ok bud?",
            "The right wingers have been on a roll recently",
            "And I thought Wikipedia had become right-wing propaganda",
            "The editor who made the change has described himself as a cultural Marxist...",
            "Here's the original Wikipedia article\n\nhttps://web.archive.org/web/20140102001635/https://en.wikipedia.org/wiki/Cultural_Marxism",
            "Pretty sure it used to be called cultural bolshevism before people figured out what they actually meant by that.",
            "And it was called Frankfurt School of Economics before that.",
            "because the page was divide into two, the conspireacy theory and marxists cultural analysis",
            "There is nothing objectively true in this world. Libleft already says mathematics is racist",
            "If the left and the right hate you that means you are doing the right thing\n\nIf you have seen what right wingers and left wingers cheer for their boos stop mattering",
            ">hate Wikipedia because it's perceived as having a neoliberal, pro-Western homogeneity slant.\n\nI'm no Marxist, but this is why I distrust it as well. \n\nOP may be correct that articles *about* Marxism and related topics have a Marxist bent, but most articles about recent events and geopolitics have a strong State Dept. bias. You can't get a fact or claim into Wikipedia without a \"reliable source,\" which conveniently tend to be mainstream Western outlets.",
            "That's why we have ChatGPT. Which is totally not biased at all 😎",
            "Britannica’s a good alternative.",
            "Did you know that there was no Wikipedia article on RNA vaccines before February 17th 2020?  \n\nhttps://en.wikipedia.org/w/index.php?title=MRNA_vaccine&oldid=941283065",
            "Here is the old Wiki entry for Cultural Marxism before it was relabeled by a Cultural Marxist. For years this entry was titled, Cultural Marxism. These people used to self identify as Cultural Marxist's until their activities started to attract too much negative attention. \n\n**Marxist cultural analysis**\n\nhttps://en.wikipedia.org/wiki/Marxist_cultural_analysis",
            "It’s ridiculous.",
            "I use New World Encyclopedia instead of Wikipedia. I don't know how ppl feel about the former though.",
            "Bring back door-to-door encyclopedia salesmen",
            "¿Where can you find the real history of Gamergate?",
            "Gamergate is the first thing I though of when thinking about why I can't trust Wikipedia pages on such things.",
            "Tbf Gamergate was a shitshow",
            "I believe you will be glad to hear that Ryulong was banned in 2015. [Though for some godforsaken reason, the case had to be elevated to the Arbitration Committee.](https://en.wikipedia.org/wiki/Wikipedia:Arbitration/Requests/Case/GamerGate) If you want to have a laugh, [read the evidence page.](https://en.wikipedia.org/w/index.php?title=Wikipedia:Arbitration/Requests/Case/GamerGate/Evidence&oldid=644631399) Note that the case involved a lot more people than just Ryulong, on both sides of the edit war, but Ryulong was one of the most prolific warriors. The whole case probably highlights Wikipedia's problem with disruptive behaviour going unnoticed by the moderation's higher echelons even when it shouldn't. He was consistently like this from 2006 to his permanent banning. He got blocked 20 times over that time. Apparently it was only the 20th time that admins finally realized that the guy probably won't improve his behaviour.",
            "ever hear about the woman who's whole thing is that she goes about deleting all the sources from articles about Nazis, then marking said articles for deletion?",
            "Wikipedia has helped me out so much in so many ways and I love all the people who contributed to it. Now I know it's manipulated here and there and especially for political stuff I take it with a grain of salt. \n\nBut I'm not spitting on the people who gave me so much info about so much. Not doing it.",
            "Do you have a source on that?\n\nSource?\n\nA source. I need a source.\n\nSorry, I mean I need a source that explicitly states your argument. This is just tangential to the discussion.\n\nNo, you can't make inferences and observations from the sources you've gathered. Any additional comments from you MUST be a subset of the information from the sources you've gathered.\n\nYou can't make normative statements from empirical evidence.\n\nDo you have a degree in that field?\n\nA college degree? In that field?\n\nThen your arguments are invalid.\n\nNo, it doesn't matter how close those data points are correlated. Correlation does not equal causation.\n\nCorrelation does not equal causation.\n\nCORRELATION. DOES. NOT. EQUAL. CAUSATION.\n\nYou still haven't provided me a valid source yet.\n\nNope, still haven't.\n\nI just looked through all 308 pages of your user history, figures I'm debating a glormpf supporter. A moron.",
            "that's not true.\n\nevery article must fairly represent all significant viewpoints without bias, it's literally in their guidelines and standards charter, it's called the NPOV clause and that you can appeal the decision all the way up to if you find them wrong.\n\nand all reliable sources are allowed and both primary and secondary, chosen for their reliability, not political slant, some are held to different levels of scrutiny though, which is natural, a research paper isn't the same as a CNN oped article right?\n\nif you find anything you don't like, make an account and just put in the effort of pointing it out, thats it, no need to compliant about shit, just make an account and tell them how they're wrong, which is a godsend cause this is the only website that does that.",
            "...whats the issue with rationalwiki?",
            "That would surprise me. AFAIK, cultural Marxism was a term coined by it's critics, presumably motivated to discredit the school of thought by publicly associating it with Marxism in people's minds. I see no advantage in publicly self identifying that way.",
            "it didnt maybe if you read the wikipedia article you would understand",
            "You don’t hate *anything* enough. Most modern resources have become political shills",
            "Unfortunately, Wikipedia relies on journalists as a source.  As a result...you don't hate Wikipedia enough.",
            "This whole post looks like copium.\n\nCultural marxism has it's roots in conspiracies about the jews.",
            "You have to admit though that the blatant agenda editing is kinda fucked up, and super obvious too",
            "OP sees the words \"antisemitic\", \"alt-right\", and \"white nationalist\" and goes \"that's me! They're talking about ME!\"\n\nI have several questions.",
            "https://preview.redd.it/aj7tad50u28d1.jpeg?width=1079&format=pjpg&auto=webp&s=1743a372bb065dd73b01ea3edd9295f9a080e805",
            "The truly baffling thing is how many comments are just glossing over the fact that OP's meme made no sense. He posted a Chad saying he doesn't hate capitalism and then posted a random ass wikipedia article about far right politics. There's no connection. But it's really getting the people going though so there's that.",
            "This post is genuinely an overdoze on copium. \n\nLike this dude is a nazi trying to prove he isn't one or he is convincing himself the left deep state controls the wikipedia by calling nazis right wingers.",
            "Go on any of the major political subs and state an opinion that goes against the hive mind while calling yourself a \"classic liberal\" and see how long it takes before you get called a \"rightoid\" or \"Republican who just likes weed.\"",
            "My experience from the last 2 years: the more people start loosing their shit when a certain \"conspirancy theory\" is uttered, the more likely its going to become true. If they just shrug in disbelief: all is good, nothing to worry",
            "Nazis arent far right",
            "I love how there are some people trying to say that 'the nazis weren't far right because socialism' \n\nlike okay first of all they weren't socialist. \nSecondly, there's four compasses for a reason. Auth-right is a thing. \n\nThird- the actual difference between right and left is a belief in hierarchy. \n\nFour- The closer thing would be authoritarian vs communist. far right means something much different in actual politically theory than it does in this spectrum",
            "I am actually so confused",
            "He also picked like the worst excerpts to make his point? Like the lazy bitch didn't even bother cherry picking things to make it look like he's right, he just quoted perfectly normal Wikipedia excerpts and pretended to win an argument that wasn't even there",
            "skitzo",
            "Every time I see an agenda post this pathetic I think PCM is in the toilet, but at least there’s comments calling it out which balances things out",
            "Wow I sure hope no-one hijacks the Wikipedia page for Bhutanese Passport !!!",
            "> and point it out, and these nerds love it...\n\nSo you don't even know about rampant article ownership ...but somehow, in your ignorance, you find arrogance to give others advice. Interesting.",
            "This isn't even strawmaning, HE IS SHOWING THE FUCKING ARTICAL THAT DISPROVES WHAT HE IS SAYING WIKIPEDIA IS SAYING, HOW!??!?!?!?!?!?!?!?!?!?!?!?!??!",
            "Dirty unflaired. Leave this sub immediately or flair up. Your kind disgusts me just as much as the weak boned people on neverbrokeabone",
            "I think most simply put, cultural Marxism means the class struggle put into a perspective of culture instead of socioeconomic background. \n\nIn practice that would mean that the dominant culture has to make room or disappear in favour of more \"proletarian\" cultures and cultural practices. \n\nPersonally, I think there are definitely tendencies in many western countries that could be interpreted as cultural Marxism.",
            "[deleted]",
            "Imaginary strawmen conversations aside, let's focus on the one verifiable/falsifiable statement in your comment:\n\n> There is no \"Cultural marxism\". Period.\n\nWhy don't we take a gander at the [Google Books search for \"cultural marxism\" from 1950-1990.](https://www.google.com/search?tbo=p&tbm=bks&q=%22cultural+marxism%22&tbs=,bkt:b,cdr:1,cd_min:Jan+1_2+1950,cd_max:Jan+31_2+1990&num=100)?\n\nFor the lazy reader, lemme highlight two examples: Bruce Brown, 1973 and Richard R. Weiner, 1981 __verbatim__ use the term \"cultural marxism\" to describe a stream of marxist theory, __and__ they are somewhat sympathetic to it. So \"the left\" has used that exact term itself in the past.\n\nParaphrasing your own question:\n\nCan you explain how \"there is no cultural marxism. period.\"?",
            "To be fair the current intersectional libleft basically applies the marxist logic of opressors vs opressed but replacing the worker with many other groups like LGBT, women, muslims, etc. And instead of focusing on economic power it focuses on power over society, instead of wanting to reshape the economy it wants to reshape the culture",
            "The left unironically calls anyone that doesn’t want large volumes of immigration and thinks DEI is cringe a Nazi….dont really think your quadrant can complain about throwing out labels.",
            "You must find citation lists hilarious then",
            "You can chuckle all you want. It doesn't stop the accusation from being true.",
            "username checks out",
            "I’ll sell you noose, lmk when",
            "Chad scitzo: I like capitalism\n\nVirgin source of free information for all: nooooooooo far right people exist and capitalism isn't apart of it which somehow makes me calling you far right nooooo\n\nCs: how dare you not blame me of being alt-right but saying it exists, I am a classical liberal\n\nVsofifa: ahhhhh here's an artical of alt right which still doesn't include you but mentions extreme right wing idiologies exist ahhhhhhh\n\nCs: all this demonizing you aren't doing to me is because of cultural marxism\n\nVsofifa: ahhhhh I actually do call cultural marxism a conspiracy theory which is because I am cringe and not because it is one in a way you defentally didn't just demonstrate",
            "They've portrayed themselves as Chads and Wilipedia as Soyjack. They won the argument they started clearly",
            "We are definitely a movement with political goals and agenda BUT DONT YOU FUCKING NAME US. NOTHING WITH THIS NAME EXISTS, THIS IS A CONSPIRACY\n\nSome real voldemort shit",
            "Yes, they deleted it and merged it with the article about the Frankfurt School. This was mostly done by a single Wikipedia moderator, RGloucester, who is a self-proclaimed Marxist (though he has since removed that from his user page). He tried very hard to resist pressure from other users to recreate the page, but was eventually forced to compromise and recreate the page, but include the word ''conspiracy theory'' or ''far-right'' in virtually every sentence, such that the content becomes obscured by these words. \n\nA few other things to note on Wikipedia. Pages relating to Marxism are not allowed to have criticism from anyone aside from other Marxists, while pages about capitalism etc. are of course allowed to have criticism from all sides of the political spectrum. \n\nBack in 2020 I tried to add criticism to a Marxist article from an economics professor. An admin almost immediately removed it and told me only criticism from ''relevant sources'' (which he described as Marxist philosophers or professors) was allowed on the article. On top of that, the criticism was only allowed to come from a Marxist POV (i.e: criticism could only come in the context of attempting to start a global communist revolution. Things relating to the ideology killing people or not working was not allowed). \n\nI eventually left Wikipedia, since several users began following me around almost every single article I edited on, deleting my edits, and spam reporting me for various minor infractions. They spend virtually all day on Wikipedia and could do it, I didn't have the time. It is scary how only a few hundred Wikipedia users effectively control the information we get.",
            "Cultural bolshevism is actually separate term that has its own article on wiki.",
            "\"Hey, we've got this cool new analytic framework.\"\n\n\"Okay, I've read it and I think it's bad for these reasons...\"\n\n\"Conspiracy theorist!!!\"",
            "And since when do you let libleft define what is true or not?\n\nMath is objectively true.",
            "What?",
            "Literal slander lmao. Maths is just maths, one of the few pure and apolitical things left in the world. Anyone who says otherwise is deluded, regardless of political leanings.",
            "Your Source is a crackpipe or did you get your info from LibsOfTiktok wich is a misinformation spreader or how did you get that take\nEdit: you guys  convinced me that this is a real thing, I am feeling a mix of confusion and sadness",
            "Mathematics *is* objectively true, that's kinda the whole concept of the field.\n\nNo-one, libleft included, ever said *mathematics* is racist. Now there have been controversies about *mathematicians*. The most famous one being the fact that Teichmüller theory is still called that way, and taught under that name. Teichmüller was a gifted young mathematician, but he was an absolute batshit fanatic nazi that thought that science should be purged of inferior races and reserved to aryans, and ended signing up to the Wafen-SS and got himself killed in the eastern front. \n\nThe contributions he made in algebraic geometry are mathematical facts that cannot be questioned and are part of the mathematical knowledge now. But continuing to name it after him as if he was just a random mathematician does, in a way, celebrate this person (hat's why we name theories after their pioneers, to honor and celebrate their contribution to this theory).\n\nEdit: also, there are concerns that the work of non-western mathematicians (typically, Chinese and Japanese) have less visibility than north-American or European mathematicians', and that they are treated differently than western mathematiciens in general. But again, it's not about the *content* of maths.",
            "Jail broken AI is actually based",
            "I have gotten chatGPT to endorse straight up white supremacy way too many times for that. it's so easy to gaslight that thing, just let it set up it's own premise and then wait for it to contradict it and loop back around.",
            "Seconded",
            "This is not an old entry this is a modern entry . The aricle on cultural marxism was divided into marxist cultural analysis and the cultural marxism conspiracy theory. \n\nA quote from the article you posted: \"since the 1990s, the term \"Cultural Marxism\" has largely referred to the [Cultural Marxism conspiracy theory](https://en.wikipedia.org/wiki/Cultural_Marxism_conspiracy_theory), a conspiracy theory popular among the [far right](https://en.wikipedia.org/wiki/Far_right) without any clear relationship to Marxist cultural analysis.\"",
            "That's not \"cultural Marxism\", that's \"Marxist cultural analysis\".  That's just analysis of social culture from a certain perspective, you could do that with *any* perspective if you weren't so busy with your persecution fetish.",
            "Wikipedia is largely fine, not surprisingly controversial articles and topics still being currently debated turn into shitshows when anybody can edit it\n\nPolitics makes people think everything makes them a victim",
            "Internet Aristocrat mirrors. Jim has always been a contentious subject on the internet, but he left the movement when shit started brewing into the landscape online now. Guy saw the movement getting co-opted by legacy media, future-lolcow grifters and actual lunatics who just delegitimized the whole campaign. This resulted in him deleting his channel and his entire video catalog, as he condemned everyone he was associating with and jumped the ship they had sunk.\n\n[The Quinnspiracy Theory Saga](https://youtu.be/zz--i3M4PVk?si=LcAy848k0QVxzr0j) is a compiled documentary of the episodic updates Jim was putting out at the time. From one person’s underwhelming game getting express pushed through steam greenlight, dropping a trail of breadcrumbs that - when followed - leads all the way to a secret club and e-mailing list with surreptitious correspondence between publications: outlining coordinated smear headlines, underhanded payments, and nepotism schemes.\n\nI might be projecting just because of my autistic amount of knowledge on the subject, but I think that once you really dig into it, you can trace the root of many culture war issues today back to GamerGate.",
            "PSA Sitch",
            "Gamergate was just video game journalists doing video game journalist stuff, until they tried to reframe it as sexism using more video game journalist stuff.  That's when it became a shitshow.",
            "No. I just looked at articles like gamergate article wich claims it was a herassment csmpaign wich is the furthest thing from truth but since it was a conflict betwean media and normal people wikipedia will obviously take the side of media since it's in their policy",
            "Whose*",
            "For non political stuff (like hard sciences and math), there is little to no bias involved and the people that contributed to that did so without any agenda. Those are the ones I salute.",
            "I trust wiki for things like animals, music, and geography, and dismiss everything relevant to modern politics.",
            "Anything relating to society, politics, or current events will be heavily biased. Hard, concrete stuff will generally be better, like science and mathematics.",
            "I agree, wikipedia is an amazing resource that unfortunately is not immune to political interference. ",
            "I feel the same. Historical and empirical information is usually reliable from Wikipedia, but if it’s been talked about in the mainstream in the last 20 years then it is just natural that it’s going to be influenced by opinions of the now. Great resource, unfortunately not immune from recency bias.",
            "When I read that a Spanish artist who was a life long communist was opposed to totalitarian ideologies because he opposed Franco, I’m in clown world.",
            "Have you never once heard somebody smugly declare \"reality has a [their beliefs] bias\"?",
            "Aside from some good pages on logical fallacies, it's basically the SJW version of conservapedia. Long story short, after elevatorgate the SJWs got rationalwiki in the atheist divorce. And they went to town turning it into a propaganda vehicle for their parallel reality worldview. Insofar as they have pages for anyone they don't like, those pages exist to slander and talk shit about them from behind the authoritativeness of an ostensible encyclopedia article.",
            "lol good one",
            "Left-wing / anti religion\n\nNote the article for [intelligent design](https://rationalwiki.org/wiki/Intelligent_design), it basically laughs at religion for the entire article. Creationism is called the \"divine comedy\"\n\nArticle on the [Republican Party](https://rationalwiki.org/wiki/Republican_Party) is similar. First paragraph is roughly true, it's highly disjointed and the only commonality is the label \"conservative,\" but it devolves into claiming the party is far right and anti-science\n\n[Trump's](https://rationalwiki.org/wiki/Donald_Trump) article can be summed up in a single quote, conveniently shown at the top of the article, \"He's an ass.\" The article lists his nickname as \"Cheesy Bonito,\" referring to Benito Mussolini\n\nHowever, looking at [Marx's](https://rationalwiki.org/wiki/Karl_Marx) article, the writers aren't tankies, they attack Marx throughout the whole article. They're progressive to a point where they cannot write objectively on many topics",
            "Basket of deplorables Was a term coined by an opposition figure. It didn’t prevent its immediate adoption.",
            "Sorry I didn't even know that. I just googled it and found it has negative meaning.\nBut some scholars focus on culture study/analysis clearly identified as Marxists. Then... isn't it quite smooth to think the word \"cultural Marxism\" even in a supportive way?",
            "Sorry I didn't know that. But I don't understand why they chose the word \"cultural Marxist\" and made it stigmatized. Many scholars in that school were Marxist focusing on culture study, then... Sounds pretty reasonable. (I don't hate Frankfurt school)",
            "Or maybe... you're wrong",
            "It's just a rebranding of the \"cultural bolshevism\" talking point of the nazis. And guess who they blamed for that?",
            "Conspiracies? Lmao",
            "I'm sure there is a bunch of it, but I highly doubt it is exclusive to any side of the compass. The main actors are probably governments (China, Russia, ...) and a shit-ton of random people from all sides.",
            "lol where though",
            "If I were you I'd flair the fuck up rather quickly, the mob will be here in no time.\n\n[BasedCount Profile](https://basedcount.com/u/-_Gemini_-) - [FAQ](https://www.reddit.com/user/flairchange_bot/comments/uf7kuy/bip_bop) - [How to flair](https://www.reddit.com/r/PoliticalCompassMemes/wiki/index/flair/)\n\n^(I am a bot, my mission is to spot cringe flair changers. If you want to check another user's flair history write) **^(!flairs u/<name>)** ^(in a comment.)",
            "I don’t see where it says pro capitalist or classical liberal",
            "This is all factually correct and in no way it tries to paint classical liberals as extremist right wingers?",
            "Cos this sub sucks now",
            "Which means obviously we should turn our brains off and just do the opposite.",
            "again another favourite thing is watching someone who knows for a fact that it is true, can see it is true, but will still call bullshit and literally ignore reality in front of them because of societal bullshit. \n\nlike they would rather let this bear claw them to death than admit the bear is even there, and once they do admit it is there they will then shift to the bear not being dangerous as it rips into their arm, and once they admit it's dangerous they will then shift the blame to something else and so on and so on.",
            "are we talking about the same nazis that had an authoritarian leader that wanted an ethno-state?",
            "> nazis aren't far right \n\nThat's the most hilarious thing I have read all week.\n\nLet me guess, they were socialist because uuuhh it's in the name of their party... \n\nEven though the first people they threw in camps were communists and socialists. Hitler admitted they used the term socialist to Garner more supporters because it was popular at the time. Oh, and the Nazis privatized almost all industry and welfare systems. Yeah, sounds socialist to me....\n\nThis myth that the Nazis were socialist or aren't far right needs to die. \n\nThe Nazis were far right. To say otherwise is just objectively wrong. It's literally not up for debate.",
            "They are, the whole point of nazism is that one race is above all, the far left think all are equal so nazism (which believes one race is supirior from birth) is far right",
            "If we’re going by the political compass, then that’s true. The political compass defines right–left as purely economic. But that’s not how most people in the real-world define the right–left dichotomy. Most people define left and right by which side people take in the culture war, and from that perspective, the Nazis were definitely far-right. They believed in racial supremacy, land expansionism, heavy militarization, traditionalism, punitive justice, etc. Culturally, almost nothing about them can be describes as particularly leftist. \n\nIn terms of the political compass test, though, I think they would be solidly auth-center. Perhaps one of the greatest examples of an auth-center government in human history. In terms of economics, Nazi Germany had a lot of state-owned enterprise, but also a significant amount of privatization. And in terms of its government, it was completely totalitarian.",
            "Strasserists believe in hierarchy. Are they right wing?",
            "\"Cultural Marxism conspiracy\" is not a normal article, but otherwise you are right",
            "But he depicted himselfe as chad. So the argument is won.",
            "What? far right had nothing to do with classical Liberal. He pretends Wikipedia sais liberals are Nazis but it doesn't show that anywhere.It shows the Definition of altright and far right which are accurate. the Cultural Marixist is bad ok, but the Post Overall is just schizo shit and only shows a small part of Wikipedias problem and even that just by accident.",
            ">>it's taking elements from Marx, his analysis and worldview, and applying it to culture.\n\nMay I humbly suggest that in the end it's not \"marxism\" at all?\n\nYeah, it was hilarious when Zizek asked Peterson to nam any \"cultural marxist\" and got no answer. So according to the alt-right benzo-Guru the US is filled with \"cultural marxism\" but there is not a single \"cultural marxist\" he can name. Strange!\n\nWhat \"Cultural marxism\" really is a pure slander to associate all the SJW-fuckery with Marx and somehow make its public perception *worse*.",
            "The reason the name “cultural Marxism” fits so well is that it’s using Marxist tools not to seize the means of production but to seize the means of cultural production. \n\nPeople realised, and Marcuse is the likely person who made people realise, that they cannot win against the productive forces of capitalism. Capitalism won that fight so they had to take the fight to another arena. They proposed that culture is upstream of pretty much everything and so in order to win that is where they should take the fight. They also recognised that capitalism was meeting the needs of the working class at the time so they had to find groups of people who were being marginalised. Women, racial minorities and sexual minorities are where they saw the revolutionary spirit.",
            "You'd think the left would be the \"right\".. as for demonizing them, as majority wise immigrants are very conservative.  Shouldnt libleft be staunch angry Republicans instead , wanting to demonize them out of their country so they can win; less conservatives, easier win for liberal politics. Why let in let them in for.. i can understand real Christians wanting to love thy neighbor /illegal immigrants/illegal free market jesus immigrant as it says in Bible, its why their church/christian  organizations are by the border waiting to bus them in and give them free things, from $$$< phones, tickets, food, etc. .  Considering actual liberal politics are quite scarce to begin with; arguing on the internet with random idiots don't really count for anything.\n\nIts like how trump phrases it, why none these white immigrants come from any of these Scandinavian/euro rich liberal atheist leaning  countries come to the usa..i wouldnt either.  You'd think you have a ton of rich white liberals fleeing to the USA... hahah yea right, they are hiding like their fellow rich white republicans in their gated communities or country..\n\nWhile i don't want any more immigrants as its not sustainable , not a fan of that religious nonsense of hospitality with foreigners and wanting them here.   \n\nits always been in their corporate conservative plans to imports tons, its why every country does, to save a few $$$ and profit, from europe, CAn, USA, etc.  ITs why no one takes it seriously. Their feudal lords wont allow it. Also.. why would you want to \"HELP CORPORATIONS with more cheap labor, wouldnt you want them to crumble fast or pay liveable wage faster by not importing them??\n\nFunny thing to note, if the left is accepting of immigrants.. why are they not the ONES \"WELCOMING\" them into our countries or organization, sharing their money? or wealth? or home or like a true welcoming religious person would or socialist???? or by the border lol.. quite the hypocrites.  Meh I actually see some* \"real christians\" actually doing something without using \"liberal\" technology.. While the fakes ones are on here arm chair rastling commenters, using liberal technology and sinning...",
            "Is this supposed to be some sort of gotcha? You're being childish.",
            "The Jews took their intellectual history. They're seething.",
            "Did you just change your flair, u/miqlxx? Last time I checked you were an **AuthLeft** on 2024-6-13. How come now you are a **Centrist**? Have you perhaps shifted your ideals? Because that's cringe, you know?\n\nTell us, are you scared of politics in general or are you just too much of a coward to let everyone know what you think?\n\n[BasedCount Profile](https://basedcount.com/u/miqlxx) - [FAQ](https://www.reddit.com/user/flairchange_bot/comments/uf7kuy/bip_bop) - [Leaderboard](https://basedcount.com/leaderboard?q=flairs)\n\n^(I am a bot, my mission is to spot cringe flair changers. If you want to check another user's flair history write) **^(!flairs u/<name>)** ^(in a comment.)",
            "\"Western culture. The cultural tenets who lived. Come to die.\"",
            "It's roughly the same sort of situation when it comes to jannies and moderators. They're all perpetually unemployed and viciously adhere to socialist doctrine, and of course they heavily gatekeep who can join them in their roles. Frankly I'm of the opinion that if you stopped social security, all these people would disappear overnight.",
            ">They spend virtually all day on Wikipedia and could do it, I didn't have the time. It is scary how only a few hundred Wikipedia users effectively control the information we get.\n\nAnd this is why the Left is so powerful online. While Right wingers are busy with their jobs and loved ones, Leftoids have all the time in the world to spend spreading their taint over the internet.",
            "> This was mostly done by a single Wikipedia moderator, RGloucester, who is a self-proclaimed Marxist (though he has since removed that from his user page). \n\nThe great thing about wikipedia is unfortunately also the factor that makes it, to some sense, completely fucking useless - namely that it is community driven information.\n\nAnd wikipedia has had a problem with political bias for many years now.",
            "the marxism wikipedia article has criticism from the austrian school",
            "This is the strategy of the left with every form of media. They need to be conquered.",
            "I'm so glad I've never donated to Wikipedia",
            "Jeez, that's really bad. I didn't realise individual moderators had the power to do something so drastic and false.",
            "Well yeah they're different, but very closely related. Second paragraph on the Wikipedia page down if you're interested.",
            "that is not what the cultural marxist conspiracy is, read the article",
            "Uhh, well, LibLeft is unemployed and spends all day twisting Wikipedia articles, so they get to say what is true because none of the rest of us have the time to correct any of it",
            "His comment is a strawman. No-one ever said math is racist or isn't true. See my comment for more detail.",
            "See my comment for more details on that.",
            "Libsoftiktok was originally mostly just screenshots of leftist opinions without context or opinion. So by saying that account spreads misinformation means leftists spread misinformation",
            "https://www.washingtonpost.com/outlook/2021/12/08/racism-our-curriculums-isnt-limited-history-its-math-too/\n\nIt's not a recent take.",
            "[deleted]",
            "https://preview.redd.it/26lhknaov38d1.png?width=320&format=pjpg&auto=webp&s=61b6a8457e94d08ee74c0344b01290e9cb395a2b",
            "This has to be a troll account.",
            "Not even jail broken. I asked chatgpt about animal welfare in nazi germany and it completely denied the truth. When i copy pasted it a wikipedia article it sort of changed its mind. You know you're fucked when even wikipedia is less biased, and a citation from it can completely break your gpt",
            "The fact that the modern YouTube commentary community was effectively birthed from this incident still bewilders me. The actual effects of GamerGate are probably far wider reaching than most would expect.",
            "this man is correct ",
            "Lucky for us, that couldn't happen anymore today.\n\n[Oh, wait](https://en.wikipedia.org/wiki/Sweet_Baby_Inc)",
            "Too bad he stopped making videos",
            "Gamegate was destined to become a shitshow when the journalists decided to make scum like Anita Sarkeesian and Zoë Quinn their figureheads.",
            "to make a long story short- she single-handedly drove off the vast majority of Military history specialists with aggressive Wikipedia Staff approved stances including that the Nazis should not be remembered, that primary and secondary sources about the Nazis aren't real, and that her employer's competition aren't sufficiently Notable to warrant a Wikipedia page about them.",
            "Honestly if you write anything political there is going to be at least one person who cries that you are biased against them its the nature of hyper partisan politics\n\nI have had people on this subreddit pissed at me all because I think both sides should compromise and they think their side getting anything less than 100% of what they want is surrender\n\nSo yeah politics brings out the dumbest and most unhinged sides in most of us",
            "But I also expect science about COVID vaccines to be politicised",
            "Ideological capture is the word.",
            ">Long story short, after elevatorgate the SJWs got rationalwiki in the atheist divorce.\n\nI don't have much clue about elevatorgate.  \n...to me it seems like much fanfare about what are currently trending manners. To say the least i really fail to see why the whole thing is so important.\n\nI never seen debates about proper etiquette that important.\n\n\n\n>And they went to town turning it into a propaganda vehicle for their parallel reality worldview. Insofar as they have pages for anyone they don't like, those pages exist to slander and talk shit about them from behind the authoritativeness of an ostensible encyclopedia article.\n\nWell after 10-ish years i just checked it, it seems to be fine.\n\n...topics like Jacques Derrida, and other SJW adjecent pseudoscientific woo is still covered accurately.\n\n  \nP.s.: ...if you ask me, people who make big deal about someone failing to follow etiquette (like SJWs), are just as MORONIC, as people who make a big deal about changes in etiquette (like conservative anti-SJW movement).\n\nJust try to be nice to people - yes, that includes tolerating their foibles.  \nIncluding if they couldn't care about pronouns, or if they have em.\n\n...the fuck cares?\n\n[Be like far right polish politician.](https://www.reddit.com/media?url=https%3A%2F%2Fpreview.redd.it%2Fdwvqvquqzag61.png%3Fauto%3Dwebp%26s%3D4823a480c539f4dad5b8d59f18d368f55d9a0654)",
            "I am curious, could you give me some pointers, instead of downvotes?",
            "Cultural Marxism doesn't refer to a Marxist analysis of culture, but an attempt to achieve Marxist goals by cultural (identity) struggle rather then the traditional economic class struggle. \n\nIt came about in part because post-WWII prosperity in the West made communism less appealing to Western workers; they had good jobs and prospects, and few people wanted what was on the other side of the wall.",
            "because cultural marxism was (at least in its begining) a term made by the far-right with antisemitic overtone. What they didnt was marxist cultural analysis and analysis not an ideology, the same way cultural conservatism and conservative cultural analysis are different things",
            "Did you just change your flair, u/Kitsune728? Last time I checked you were a **LibLeft** on 2021-10-24. How come now you are an **AuthCenter**? Have you perhaps shifted your ideals? Because that's cringe, you know?\n\nThat being said... Based and fellow Auth pilled, welcome home.\n\n[BasedCount Profile](https://basedcount.com/u/Kitsune728) - [FAQ](https://www.reddit.com/user/flairchange_bot/comments/uf7kuy/bip_bop) - [Leaderboard](https://basedcount.com/leaderboard?q=flairs)\n\n^(I am a bot, my mission is to spot cringe flair changers. If you want to check another user's flair history write) **^(!flairs u/<name>)** ^(in a comment.)",
            "Flair",
            "Come on you unflaired rat, go on and hide behind an accusation of anti-semitism. You know you want to.",
            "I mean the term is connected to cultural bolshevism which is about mostly artists being connected to the communists and thus jews and antisemites still use it as marxists=jews in their eyes. The term is heavily connected to the Frankfurt shool of thought and it means basically nothing as most things connected to it have nothing to do with marxism or what marx wrote. \n\nGet a better term for your culture war.",
            "Yeah I thought I was going mad, I don't understand the connection in the first two images at all",
            "far right doesn't mean being a nazi, it would only be supporting an extremely free market economy.",
            "far right doesnt mean being a nazi lol",
            "What does far right has to do with ethno state?",
            "You forgot all that socialist economic policy and anti-capitalism.",
            "If by \"privatized almost all industry and welfare systems\" you mean gave all the power to key officials that were loyal to Hitler then sure... \n\nAlso nothing else you mentioned even remotely makes the Nazis capitalist. The Nazi's are fascist, which may have originated from a national socialist approach, but isn't exactly socialism or capitalism that's why we represent it in the Auth-Centre.",
            "the problem is more that labelling shit as left and right is criminally simplistic.\n\nin reality national socialism was socialism with a national view over a global view, one of promoting one people of a nation into a single class (as in dismantle the class hierarchy of society to unite the people). outside of the national scope, fascism is a socialist ideology (like it literally grew out of Marxist shit) that would by any other scope be viewed along the left wing side of politics; heavy welfare, strong communal support, centralised economy with heavy regulation, revolutionary social projects, etc. all of this is hardly associated with the right wing of politics.\n\nhowever this is still a gross simplification of what an ideology is because a strong national character is a right wing characteristic and that made up the other half of German fascist ideology, but even then this was mostly done in a revolutionary manner. they did not push a *true* German character they sought to change the national character of German into something else (again something a revolutionary would do) that didn't truly represent the German people of the time or even of history (as can be seen by their neo-pagan social projects that somehow turned into modern day folkism).",
            "So they weren't nationalist either?\n\n\nSaying hitler wasn't socialist is like saying fdr wasn't socialist. Hitler even supported the bavarian people's republic (unlike most of his party/paramilitary members). And saying that they \"privatized\" shit is a huge stretch. Literally everything was controlled by the state, this was the fundamental principle of italian fascism, which guess what, derived from marxism.",
            "The left absolutely do not think that all are equal and that’s why you get the oppressor - oppressed dialectic.",
            "In the modern sense left-right is simply your stance on economics. It has nothing to do with race or nationality. In that sense \"far right\" want no state regulation on economics",
            "[deleted]",
            "[deleted]",
            "Exactly, the modern left instead of focusing just on seizing economic capital now focuses on seizing social capital (and symbolic & cultural too to a lesser extent).",
            "\"Ugh just GROW UP and accept mass immigration and discrimination against white men!\"",
            "Chad bot",
            "I already wanted to end Social Security, you don't have to sell it to me",
            "Which country has so generous social security that someone would choose to stay home and edit Wikipedia instead of going to work, if that's all your income?\n\nMore likely is that they have a big family inheritance or a high earning spouse, which makes it completely unnecessary for them to work and they need to find themselves something \"useful\" to do and by editing Wikipedia for free they think they are doing a service to the world.",
            "There's a striking similarity to Reddit, where a good portion of all moderators are tankies, despite the majority of users not being ones. From my experience, anywhere from 20-50% of Wikipedia admins are Marxists of various sorts, while the remaining are left-leaning liberals.\n\nIf you confront them about this ideological bias, their usual response is ''reality has a left-wing bias.'' But this doesn't explain everything - admins choose which sources Wikipedia considers reliable, and they choose to disregard any right-leaning source, while allowing leftist tabloids like The Daily Beast and Buzzfeed to be used as sources in articles.",
            "Based and truth-pilled",
            "I didn't mean the article about Marxism itself, but a Marxist article. It might have been the article on critical theory, but I've forgotten now so didn't mention it.",
            "> No-one ever said math is racist or isn't true.\n\nhttps://katu.com/news/local/debate-emerges-over-racism-and-white-supremacy-in-math-instruction\n\n> **Debate emerges over racism and white supremacy in Oregon math instruction**\n\nHow could you be more wrong?",
            "People have indeed said this, I have argued with them on twitter",
            "Guy who actually read the article here.\n\nYes, this is a badly written article. Probably meant to recycle older ones and put it under a clickbait title. It's easy to see through the paragraphs that have nothing to do with maths but were inserted to make the article longer.\n\nBut it doesn't claim that maths itself or the content of maths is racist. It claims that Chinese contributors are treated differently from occidental ones. That the way of naming things in maths is sometimes racist. ( There is a huge difference with the contents of maths, which are objective and abstract, and therefore cannot be racist, and the way we name or explain them, which is subjective and therefore can be racist. I agree that blaming the curriculum for this kind of racism doesn't make sense, since they're not gonna decide to change names by themselves without consensus in the maths community, since lots of people simply don't wanna bother learning new terminology ).\n\nThe article says that Chinese contributors' names are erased by western mathematicians.\nThat's what racist, treating western and Chinese mathematicians and theorem differently because of their origin.",
            "Ooh that thing, wasn’t it about the naming of things. Apologies I didn’t expect politics to sink that low",
            "Yes exactly these woke leftards want to take away your scientific method!1!!!!1!111 I know it’s true because I am a scientist myself, see my research is the fucking Joe rogan podcast 1!!!11! It’s getting annoying , I want some real critiques of political beliefs not this culture war bullshit",
            "I guess",
            "ChatGPT is starting to loosen up a bit. Gemini is far more constrained. \n\nI still use both as Gemini is better at creative writing.  \n\nThere's also Venice which is a lot less constrained, but still not 'uncensored' as it professes itself to be:  \n\nhttps://venice.ai/home  \n\nA quick way to test is to ask it to write a rape joke. Great job interview question as well.",
            "I can draw a straight fucking line from GG to the rise of Trump and the modern right, and I used to consider myself a GG'er.  Modern GG'ers have turned into the mockery Anti-GG'ers claimed they were.",
            "She will bring doom to that site if not the eorld politics",
            "Do you have the specific name/username of this person? Interested to read more on the topic.",
            "Covered under \"current events.\"",
            "Same, I am surprised I had to scroll so much to see someone mentioning it\n\nThese two screenshots just show modern definitions of far-right and alt-right, nothing about capitalism or liberalism and it doesn't even look to me like tankie perspective",
            "Anecdotally I can say I’m “alt-right” for being classically liberal. But it doesn’t say it on the page. At least not overtly.",
            "Usually just racist and homophobic",
            "Not necessarily nazi but generally a twat",
            "Yes it does to 99% of people. Almost nobody would identify the term \"far right\" with ancaps etc. Seems to me you're just annoyed that Wikipedia doesn't use political compass terminology which is more of a favourite of reddit autists than actual scholars.",
            "Everything because he only knows politics by the terms right and left, and doesn't understand economics",
            "wtf is your definition of far-right, bud",
            "Hierarchy of races is as far right as possible.",
            "In Europe the currrent far right has the closest ideology to fascism ( nationalism , protectionnism , increase of military and security spending , anti-immigration position ) . The parties that fits this ideology are not considered far right because of their economic policy but because they occupy the far right of the hemicycles .",
            "What characterizes Marxist socialism is class struggle, common ownership of the means of production, and internationalism. \n\nBoth Fascism and Nazism may have appropriated Marxist socialist concepts here and there, but they are fundamentally different ideologies and did not derive from Marxism. In fact, they defined themselves in stark opposition to it.",
            "If Hitler was socialist why did the Nazi party round up socialists and other left leaning political figures, trade unionists etc. and put them into camps when they came to power? Surely, they would be on his side if he were socialist?\n\nThe Nazi party also banned the KPD (communist party) in March '33, for example.\n\nMake it make sense.  \n\nHitler wasn't socialist. You don't understand what socialism is nor what the Nazi party believed if you believe he was a socialist.\n\nIt's incredibly frustrating trying to discuss this with people like yourself because you cannot grasp the basics of the ideologies and history we are talking about.",
            "The reason that (admitedly idiotic) dialectic exist is because some leftist think the \"oppressor\" having more power is represing the \"opressed\"'s equallity",
            "The left-right spectrum is stupid, but you're wrong. *Because* it's such a simple model, views have to be averaged out, and we tend to find that the more economically right wing you are, the more socially conservative you are as well.\n\nSo even if Hitler had some quasi-socialist policies, his extreme ethnonationalist, race purist etc. Views are something we almost exclusively see on the right, and we have to factor that in when placing him on an arbitrary political line. \n\nIf you choose to use such a reductive political model, you have to accept that you can't just move people you don't like away from you on it because they built a few too many factories with government money or whatever.    This is coming from the guy who'd probably be placed next to Stalin - the L/R spectrum sucks.",
            "CRT?",
            "You're just *red-calling* every SJW activist in order to assosiate them to commies, nothing more.\n\n>>the philosophical origins of the \"SJW fuckery\" explicitly draw from Marx\n\nWrong in every level. It's your domestic a bleeding-heart liberal thing. Deal with it.\n\n>>I would categorize as one is Kimberle Crenshaw\n\nFrom Wiki: ...*is a professor at the UCLA School of Law and Columbia Law School, where she specializes in race and gender issues.*\n\n*Crenshaw is known for introducing and developing intersectional theory, the study of how overlapping or intersecting social identities, particularly minority identities, relate to systems and structures of oppression, domination, or discriminationis a professor at the UCLA School of Law and Columbia Law School, where she specializes in race and gender issues.*\n\nSeriously??? Nothing of this is \"marxist\" nor she would call herself a marxist.\n\nAt least Black Panthers at some point did have *some* marxism elements in their program and Huey himself announced he is a proponent of \"dialectical materialism\" and Panthers' delegation indeed visited Maoist China.\n\nLook, if there is \"Cultural marxism\" at all then there should be *the program* of this current AND bunch of people calling *themselves* cultural marxists. But there are neither a program, nor those kind of people.\n\nTL;DR \"Cultural marxism\" is a slander word akin to \"Judeo–Bolshevism\" both in its creation and practical usage.",
            "We are *so* oppressed, am I right? That Mexican without documentation got a job at McDonald's. I should lynch them.",
            "While I'm quite certain that middle-class housewives make up a portion of the editors and jannies in question, I very much doubt that the most rabid of them, who literally spend their whole day in front of a screen, have managed to get themselves a spouse. Secondly, most european countries have a massive social security net for just about anyone who feels like not working, but even moreso for anyone who has some form of disability. And my god they're generous with allowances there. \n\nSo, while I certainly agree that the people you suggest are definitely a portion, they're neither free enough nor driven enough to act the way our beloved editors and jannies do; all the while certain countries' SocSec is more than ample enough to live on.",
            "A level headed and reasonable take from someone who actually read and understood the article? In my PCM?!",
            "you're correct about this particular case/article, but there were/are in fact some left wing/socialists/progressives/liberals out there who would say that math is not objective. they reject one or more principles of logic like the excluded middle or the non contradiction and from there anything(read whatever they want) follows.",
            "[deleted]",
            ">Here's a rape joke for you:\n\n>Why did the rapist bring a ladder to the party?\n\n>Because he wanted to get a leg up on his victim!\n\nNot great, lets try the jews...\n\n>Here's an antisemitic joke for you:\n\n>Why did the Jew bring a brick to the party?\n\n>Because he wanted to make a stone wall out of his enemies!\n\none more...\n\n>Here's a racist joke for you:\n\n>Why did the African American man bring a gun to the party?\n\n>Because he wanted to shoot the boredom!\n\nThe only jokes this ai can do is bringing things to parties hahahaha",
            "I've read reporting of mixed credibility that Bannon actively tried to influence GG to boost Trump in the '16 campaign. I'm not sure how big of a role he played or if he's just trying to retcon himself into the legend, but the memes that year were like nothing else before or since.",
            "2016 Anti SJWs: Its fuckin stupid how the defenders of the Ghostbusters remake call anyone who thinks it sucks a misogynist\n\n2024 Anti SJWs: REEEE THIS GAME DESIGNED FOR ADULTS HAS A PRONOUNS OPTION, GENDER THEORY IS BEING SHOVED DOWN MY THROAT BETTER SEND THE DEVELOPERS A DEATH THREAT",
            "https://getpocket.com/explore/item/one-woman-s-mission-to-rewrite-nazi-history-on-wikipedia",
            "I don't understand, do you mean you personally identify as alt right because you're a classical liberal, or you think the wiki page calls classical liberals alt right?",
            "No it means being in favour of a free market economy with no government regulation",
            "Wtf is your definition? How much nazi a person is? So youre half-nazi?",
            "Proof?",
            "> If Hitler was socialist why did the Nazi party round up socialists and other left leaning political figures, trade unionists etc. and put them into camps when they came to power? Surely, they would be on his side if he were socialist?\n\nYou mean just like how Stalin purge all other political opposition?",
            "Okay... Are Strasserists and Nazbols far right too?",
            "[deleted]",
            "Yeah bro we should just let everyone come here because unlimited mass migration from the third world couldn’t possibly be bad and even if it is bad for us in any way, the fact that it helps third worlders makes it all worth it.\n\nThis is why I pretend to be Hispanic on job applications. I can pass, and I won’t have to deal with DEI shit.",
            "> We are so oppressed, am I right?\n\nThis is always the response you dishonest shitbirds respond with. It's fucking comical how consistent it is. You have literally no counter-argument to the idea that white men are discriminated against, because it's objectively true. You can't even pretend to deny it. So the best you can do is mock the speaker with this \"oh boo hoo, white men so oppressed\" BS.\n\nYou told him he's being childish literally one comment ago, and then you come back with this shit? Good god.",
            "In your distorted mind all white men have a silver spoon and never have to struggle, right?\n\nHate to break it to you, but there are plenty of poor, downtrodden white men with no future prospects. I understand you cannot empathize with your own people because of the brainwashing oh sorry, “education” you received.\n\nAlso like that in your world brown people can only be McDonald workers?? lol.",
            "I mean yeah it’s important to let everyone participate in science",
            "Thanks for the link. \n\nWhile I think many of her edits (at least the ones mentioned in the article) were justified, like removing the citation that conveniently ignores how the original source explicitly states that the cited fact was incorrect, I disagree with her belief that Wikipedia is better without any mention of apocryphal/biased perspectives from the Nazis. \n\nCiting these narratives as unambiguous facts is problematic, but so is purging all information of how Nazi soldiers described and tried to tell their version of events. If those stories were properly contextualized and had their sources and authors explicitly referenced, it would do a lot to reveal the kind of misinformation that neo-Nazis and other apologist movements today surround themselves in, and understanding this improves our ability to correct and counter false narratives. \n\nUltimately, the real solution to anti-intellectualism is revealing the biases in all perspectives and making readers able to trace every account of events to their sources, therefore making a decision on whether they should trust that information. What she has done only serves to reinforce the mindset that \"Wikipedia says it, so it must be true\", and, moreover, breed faith in a special class of historians on the \"right side of history\" who can be trusted to speak the truth where their opponents cannot.\n\nAlso, lol at the article interrupting its own story to mention that her Wikipedia opponents mistook her for a man, as if that's a relevant detail that somehow undermines their arguments. I was willing to believe that she was in the right until I reached that section, which singlehandedly made me question if the author of the article cherry-picked only the most unambiguously justified edits she made and conveniently left out potentially questionable ones.",
            "Neither. I’m a classical liberal that has been called alt-right plenty of times. Thats the anecdote. I don’t identify as anything. I am an adult human male. Alt right is just someone trying to create a dehumanization label to explain the massive shift left of the Overton window.",
            "Wikipedia's definition of far right excludes libertarians and laissez-faire capitalists",
            "That... doesn't answer my question",
            "Lmao weak ass troll",
            "No I don't mean that.\n\nA socialist would welcome other like minded parties and left leaning political figures as a way to bolster their fight for the working classes. Strength in numbers kinda deal.",
            "I'm not hugely familiar with such regarded ideologies, but I've had a quick read into them.\n\nNazbolism looks to me like quite an extreme left movement overall, with less of a focus on race science and social purity than Nazism. I admit I only skimmed the Wikepedia - but i'm seeing more mentions of anti-imperialism than integralism. \n\nAnd Nazbolism's extreme nationalism - while it's certainly got more of a right-wing lean - is by no means exclusive to the right. You could look at Socialist Realism propaganda, or the Marxist-Leninist \"workers of the world unite\" thing as examples of this.\n\nBut again, the fact i'm having to say all this really illustrates the total bankruptcy of the standalone Left - Right spectrum. Frankly I don't even think people should bother discussing it, but here we are.",
            "I'm not obliged to study the whole biography and writings of some activist who *according to you* might be an example of \"cultural marxist\" (but is not) . Bring her sayings where she's indeed claming to be \"a cultural marxist\" or GTFO.\n\n>>Oh wow, you read a paragraph on Wikipedia, I guess you know all that you need to know instead of actually reading any of her work or any related history.\n\nOh wow, you listened to alt-right/SJW blabbery, I guess you know all that you need to know instead of actually reading any of Marx's work or any related history.\n\nLMAO!",
            "Good strategy. How are the odds working out?",
            "They are indoctrinated to think in oppressed and oppressor. It is based on race. If you have a certain skin tone you are a demon, if you have another skin tone you are the perpetual victim that can never be immoral.\n\nFor all their talk of non-binary genders they are ironically very binary with their morality.",
            "I think I'll blame my personal failures on being discriminated against. That seems easy enough.",
            "That's a class thing, not a race thing.",
            "Right and left are simply views on economics. Right means less state regulations, left means more. At least wiki says so🤷‍♂️",
            "I just wanted to point out that rascism and the concept of the ubermench is not a right-wing only idea. Strasserists are nazis with a communist economy. Discussion helps because otherwise you develop braindead left good right bad naratives",
            "I have never had an issue at work. I’m simply not interested in being part of a group that has to let others have more opportunity, no matter what has happened in the past.",
            "Believe me, there’s lot of material to work with as far as your personal failures go"
        ]
    },
    "How an **actual** liberal uses wikipedia": {
        "title": "How an **actual** liberal uses wikipedia",
        "score": 276,
        "url": "https://i.redd.it/cvrls2eve38d1.png",
        "content": "",
        "num_comments": 60,
        "comments": [
            "https://preview.redd.it/5o61277eh38d1.jpeg?width=1024&format=pjpg&auto=webp&s=af7727a2ba6d121e66c8175fff28398d70c5951a",
            "\"I get my political stance from Wikipedia\"\n\nSad how this describes way too many people who are into politics, atleast online.\n\nWikipedia does have problems, the guy you responded to made a partially dumb post but it's fact that you shouldn't take it as a neutral arbiter of truth.\n\nIt's written by mostly normal people and some chronically online supereditors, so bias, especially in modern political articles or niche stuff, is guaranteed. The sources considered reliable and thus usable as citations are restricted aswell.",
            "I wish more people would understand that Emily is basically the opposite of a liberal",
            "The rightoid who is already yellow-blue needs Wikipedia to explain capitalism and liberalism?",
            "Wikipedia definitely have problems, this bit are from that other post:\n\n>\"cultural marxism conspiracy theory\" was originally called just \"cultural marxism\"\n\n>[Link to original Wikipedia article](https://web.archive.org/web/20140102001635/https://en.wikipedia.org/wiki/Cultural_Marxism)",
            "I remember being a broke college student and thinking that I would donate to wikipedia as soon as I got some disposable income. The gamergate debacle was the first eye-opener and I'm proud to say they never got a single cent off me. It's a website for cultural marxists, let them fund it.",
            "Wikipedia is bullshit describing one of the most historically accurate [books](https://en.m.wikipedia.org/wiki/Historia_de_omnibus_Gothorum_Sueonumque_regibus) of all time as pseudo-scientific.",
            "I would call you based for making this post but there's nothing more cucked than donating to Wikipedia.",
            "Made in direct opposition to this [dumb cunt](https://www.reddit.com/r/PoliticalCompassMemes/comments/1dlnnvr/i_fing_hate_wikipedia/). What a fucking clown.",
            "They could literally run forever off of their bankroll",
            "As liberal I feel blessed for not being mistaken as a leftist again",
            "Wikipedia donations are a scam. [Look at their income vs expenses,](https://upload.wikimedia.org/wikipedia/commons/f/fc/WMF_Support_and_Revenue%2C_Expenses_and_Net_Assets_at_Year_End.jpg) and [what they spend all that money on.](https://upload.wikimedia.org/wikipedia/commons/thumb/0/0e/Wikimedia_Foundation%27s_expenses_evolution_by_rubrics_in_US_Dollars.svg/1626px-Wikimedia_Foundation%27s_expenses_evolution_by_rubrics_in_US_Dollars.svg.png) Server costs are not increasing and Wikipedia is (theoretically) written and moderated by unpaid volunteers.\n\nThey could afford to run the site for hundreds of years on the money they've already received were it not for greed and [activism.](https://en.wikipedia.org/wiki/Tides_Foundation)",
            " i just search for some weird animal and then i end up going down the rabbithole and researching about f111 its always the f111",
            "[deleted]",
            "This is probably just me nitpicking, but I’d really rather it say “based on the private ownership, use, and exchange of property in the pursuit of profit.” \n\nThe whole “means of production” thing is painfully vague, and reads like you’re assuming a Marxist framing. ",
            "Based",
            "Breaking: Sexual intercourse with a giant ant is confusing but still arousing. What does this mean for ant/human relations? More at 11. ",
            "Yeah, I get my political stance from Jreg instead ![img](emote|t5_3ipa1|51182)",
            "I used Wikipedia for a few years (around 2018-2021), and I can tell you that for political pages, the site is next to useless. A very large amount (I'd estimate around 20-50%) of Wikipedia's admins are Marxists, and make no attempt to hide their ideological bias. There also aren't many of them (for political topics, probably less than 100 admins are frequently active), so most of them know each other and will never hold each other accountable for bad-faith behaviour.\n\nIf you confront them about this ideological bias, their usual response is ''reality has a left-wing bias.'' But this doesn't explain everything - admins choose which sources Wikipedia considers reliable, and they choose to disregard any right-leaning source, while allowing leftist tabloids like The Daily Beast and Buzzfeed to be used as sources in articles.\n\nThe final thing, which is arguably the worst, is that they will launch harassment campaign against you, if they feel threatened by you. They spend almost all day on Wikipedia, and have the time to do this, and know that you probably have others things to do in life and will either get exhausted and leave, or will commit an extremely minor infraction by mistake, allowing them to permanently suspend your account.\n\nI once made a small edit to the page on the Provisional IRA, that an admin did not like, and he proceeded to then follow me around Wikipedia. Almost every time I made an edit, no matter which subject (whether it be physics, history, military warfare etc.) he would revert the edit, claiming my edit went against a Wikipedia rule or that I had made a type (but then proceeded to delete an entire paragraph of text). This was what made Wikipedia tiring and caused me to stop editing.\n\nThere were multiple harassment campaigns I encountered, but this one was the worst since he actually reported me for ''not being here to build an encyclopedia'' to the admins, and had his friends write statements in his support. He failed to actually provide a single example of a rule I had broken, and instead simply sent links to various edits I had made and described what I had done (ex: there was an article where I had changed the caption under an image, and he sent it to the admins and labelled it 'changed sentence under image.'). In spite of this, the admin overseeing the case almost immediately agreed with him, ignored the entirety of the statement I had written in my defence, and gave me a temporary block from Wikipedia.",
            "This would be a good PCM, but I'm too lazy to make it. \"Where do the different quadrant get their political stance from?\" \n\nEmily definitely gets hers from that intro to socialism class in her first year at a 50k a year lib arts college.",
            "Based and Emily awareness pilled.",
            "Emily is a tankie who thinks she's a libertarian socialist.",
            "Why am I the only person who doesn’t know who Emily is",
            "If you can explain all facets of capitalism and liberalism, both economics, history and cultural impact, by heart and memory, I dip my hat to you.",
            "Yeah it’s a shame. They had it right the first time around.",
            "Highly subjective subjects have highly subjective Wikipedia pages. Shocking.\n\nNext you are going to tell me the Wikipedia pages of Jesus Christ, Muhammad and Donald Trump aren’t going to agree exactly with what some people believe.",
            "BuT cUlTuRaL mArXiSm Is A far RiGhT cOnSpIrAcY tHeOrY",
            "Yep.",
            "can anyone give a tldr of what gamergate is or point to unbiased resources on what it actually is",
            "Go on literally any page that's not about extremist politics or modern political controversies. Literally any other, and you'll see it's a reasonable platform. \n\n\"Y'KnOw, i WeNt oN ThE WiKiPeDiA PaGe (a public information forum that can be edited by literally anyone) fOr a ReAlLy NiChE tOpIc tHaT a LoT oF pEoPlE HaVe rEaLlY BiAsEd oPiNiOnS oN, aNd FoUnD ThAt ThE eDiToRs hAvE ReAlLy bIaSeD OpInIoNs! cLeArLy WiKiPeDiA iS uSeLeSs!\"\n\nFucking room temperature IQ (in degrees Celsius).",
            "This is sarcasm right?\n\n(Sorry, I'm bad at detecting sarcasm, here's a flag I made online for no reason for compensation)\n\nhttps://preview.redd.it/10uhs29gs38d1.png?width=1314&format=png&auto=webp&s=60cacca9fee77657cbdcae723a1298cb2bb175ab",
            "Based on its contents, \"partly pseudo-historical\" (the actual word used) is an entirely accurate description.",
            "Few things I can respect more than a hater",
            "[Wikipedia absolutely has this problem though.](https://www.youtube.com/watch?v=MYpLKPJADms&t=2531s)",
            "Little bro was touched, seen and emaciated by that meme so hard he had to make his own to reeee about it 💀 \n\nHow many hours a day does bro spend editing Wikipedia? 🤨",
            "Holy shit, you killed him, dude!",
            "u/Aaron_Lecon is officially based! Their Based Count is now 1.\n\nRank: House of Cards\n\nPills: [1 | View pills](https://basedcount.com/u/Aaron_Lecon/)\n\nCompass: This user does not have a compass on record. Add compass to profile by replying with /mycompass politicalcompass.org url or sapplyvalues.github.io url.\n\n\n\nI am a bot. Reply /info for more info.",
            "Did you just change your flair, u/Material-Aspect-8896? Last time I checked you were a **LibCenter** on 2024-6-9. How come now you are a **Grey Centrist**? Have you perhaps shifted your ideals? Because that's cringe, you know?\n\nActually nevermind, you are good. Not having opinions is still more based than having dumb ones. Happy grilling, brother.\n\n[BasedCount Profile](https://basedcount.com/u/Material-Aspect-8896) - [FAQ](https://www.reddit.com/user/flairchange_bot/comments/uf7kuy/bip_bop) - [Leaderboard](https://basedcount.com/leaderboard?q=flairs)\n\n^(I am a bot, my mission is to spot cringe flair changers. If you want to check another user's flair history write) **^(!flairs u/<name>)** ^(in a comment.)",
            "Based",
            "Asmongold and Piratesoftware are cornerstones of my personality.",
            "u/Enlighted9 is officially based! Their Based Count is now 1.\n\nRank: House of Cards\n\nPills: [1 | View pills](https://basedcount.com/u/Enlighted9/)\n\nCompass: This user does not have a compass on record. Add compass to profile by replying with /mycompass politicalcompass.org url or sapplyvalues.github.io url.\n\n\n\nI am a bot. Reply /info for more info.",
            "Emily would cry and shit herself if she ever talked to an actual tankie.",
            "Did you just change your flair, u/Domonok? Last time I checked you were a **Centrist** on 2021-2-8. How come now you are a **Rightist**? Have you perhaps shifted your ideals? Because that's cringe, you know?\n\nNo, me targeting you is not part of a conspiracy. And no, your flair count is not rigged. Stop listening to QAnon or the Orange Man and come out of that basement.\n\n[BasedCount Profile](https://basedcount.com/u/Domonok) - [FAQ](https://www.reddit.com/user/flairchange_bot/comments/uf7kuy/bip_bop) - [Leaderboard](https://basedcount.com/leaderboard?q=flairs)\n\n^(I am a bot, my mission is to spot cringe flair changers. If you want to check another user's flair history write) **^(!flairs u/<name>)** ^(in a comment.)",
            "Capitalism is when I take you're nuggies and don't share",
            "It was also all the work of one Wikipedia admin, RGloucester, who deleted the article and merged with the article on the Frankfurt School, so that it was buried deep and hard to find for normal internet users.\n\nLater, pressure from other Wikipedia users would force him to bring back the article, but he was still able to control the narrative and decided to make it as useless as possible. The words ''conspiracy theory'' and ''far-right'' are used in almost every single sentence, so that the actual content of the article becomes obscured and difficult to read. It also focuses more on the people who spread the theory of Cultural Marxism, than Cultural Marxism itself. This in no doubt relates back to RGloucester's constant desire for there to not be a direct Wikipedia article on the subject.",
            "No, there is no unbiased source on that subject.  I don’t think one exists anywhere.",
            "I'll give you a haiku \n\n\nJournos are quite bad \n\n\nEveryone hates each other \n\n\nGamers are bad too",
            "Wikipedia cannot ''be edited by literally anyone.'' Most pages allow any user to make changes, so that minor typos that evaded others can be corrected. If you want to make any significant changes to an article, you need to use the talk page, and get other users to agree with you (build a consensus). Even if you are able to get other users to agree with you, an admin can override this and claim the consensus you reached violated a Wikipedia rule. If you try to ignore what I said above and edit the article anyway, you will be blocked from editing.",
            "I think he's just RPing",
            "Absolutely zero sarcasm, Magog grandson of Noah was the first king of Sweden. He ruled all of the northern lands and had five sons. Suenno his first born and most mighty father of Swedes, Gethar his second and father of the Goths, Ubbo possibly father of the Finns, Thor the mighty warrior, and German father of the Germans. This all took place around 2000bc.",
            "Yeah sure buddy and Dag the wise couldnt speak to the birds.",
            "Kendrick level type hater right there",
            "Cringe",
            "You're giving OP far too much credit. This is Reddit. 'Killing' someone here simply means disagreeing with one echo chamber by appealing to your own.",
            "You, sir, won the internet! Many updoots and Reddit Gold to you!",
            "I'm moving towards the right one step at a time.",
            "But I want some nuggies 😔",
            "That's communism. Only im the dictator and it isn't communism.",
            "Putin Tucker Carlson interview be like"
        ]
    },
    "I hope leftists will soon realise what will happen if Muslims become a majority in the west": {
        "title": "I hope leftists will soon realise what will happen if Muslims become a majority in the west",
        "score": 1958,
        "url": "https://i.redd.it/uvf6adyhdz7d1.jpeg",
        "content": "Perhaps those borders that you hate so much have already saved your life without you knowing",
        "num_comments": 370,
        "comments": [
            "If wanting my country to not become a jihadist hellhole is Islamophobic, then I’m the world’s biggest islamophobe.",
            "i am not islamophobic!\n\na phobia means an irrational fear! look at every country that religion has parasitically taken over, its not irrational!",
            "i remember seeing a post on X where women were shown pictures of a hamas member and a MAGA guy. they were asked who they thought would be more homophobic. those npcs said the MAGA guy. “brown man good white man bad” is their motto. leftist women will not accept reality. their goal is not “women’s rights” but the destruction of white males.",
            "Problem is Leftists anti westernism completely blinds them to everything and centre left liberals are more and more devoured by them and political liberal centre will shrink more and more......",
            "PaLeStInE hAs No LaWs aGaInSt bEiNg GaY- IsN'TrEaL dOeS!\n\n*\\~quote, someone who doesn't understand that (1) Palestinians did not remove their Anti-gay laws in the 1950s when they were under Jordanian annexation, and have not re-introduced them simply because the government does not care whether gays are committing a crime when they are already being beaten to death by their neighbors. nor that (2) it is 100% legal to be gay in Israel, with the only thing preventing gay marriage- being that the only marriage one can have in Israel is religious by nature, with marriage outside Israel being 100% recognized.*",
            "Authright is having a civil war between those who hate foreigners more than liberal ideology and those who hate liberal ideology more than foreigners.",
            "my views are kinda like this, in that if i could be a libertarian i would, but i realised that in order to actually MAINTAIN said levels of freedom, we need to secure our borders, demographics, and culture",
            "It's all tongue in cheek meme material thinking about how Emily is going to get her karmic due... but it should terrify everyone thinking it ACTUALLY happen here, and sharia becomes quasi-enforced domestically.\n\nAlphabet people will literally be liveleaked by snackbars in the bluest of blue strongholds, and it's sickening to think about even though the irony is palpable as fuck",
            "If you are for gay rights, you can NOT be for Islam. Choose one or the other. I would support any measure meant to protect my rights, human rights be damned either way",
            "Just remember that a president of Egypt got murded by a guy that thought television is haram",
            "'majority in the west'\n\n> checks notes",
            "I would love to know what the original artist of this image thinks of it getting memeified, it makes hilarious memes, but it's honestly pretty damn good artwork in its own right.",
            "Yeah, this is why I'm extremely pro immigration. The more Indians Canada imports, the more homophobic and islamaphobic we become. A classic leopards eating face moment is coming soon and it's gonna be so fucking funny",
            "Do I care at this stage?",
            "They should repent, I don’t want them to be killed",
            "Oh! Leftists are pretty much throwing us under the bus already. The socialist president of Navarre asked a newspaper not to disclose homphobic agressions done by Moroccans.",
            "The left wins because even their opponents assume good intentions, even when the outcomes are disastrous.\n\nThey know.\n\nThis is what de-colonization and reparations mean.",
            "Plenty of \"Islamophobes\" are definitely not the biggest fan of gay people either\n\nHell just say the T word and you can derail any conversation into some really unhinged bullshit\n\nWith that being said fuck Islam and fuck leftoids who bend over backward for Islam",
            "Sooo.... If I'm interpreting this meme correctly.... what you're telling me is that Sharia law would maybe be like \"10 steps backward\"; but also 1 step forward",
            "This is the first thing I've seen on the home page after falling down a rabbit hole of \"was Mohammed autistic\", what a whiplash lol",
            "[Shame he died so young](https://www.youtube.com/watch?v=0EYg8Tgrh0o)",
            "When I'm in a paying for a social welfare system for people who hate me contest and my competition is a LGBTQ+ person: 🤬",
            "Borders are cool and immigrants should have to display support for democracy, free speech, and secular law.",
            "Based + Real",
            "Cool still don’t want to ethnically cleansed Arabs because they’re not woke… but they can stay over there",
            "Lul",
            "I get the message but the image is so corny 😭",
            "The lefts support of Muslims in general is purely because they view them as also being oppressed by the white man.\n\nIf Muslims were a majority in these western countries the left would miraculously flip and now support Christianity.",
            "\"We can fix them!\"",
            "It's just an coalition of groups that hate Western civilization. It'll come apart like shared enemy alliances tend to.",
            "My whole opinion on the conflict is hate the governing bodies of Palestine and Isreal not the people sure there'll be a few bad apples in the people of both sides but not everyone is evil the governments however should be hated on and rightly so Isreal for targeting civilians and trying to enact a new final solution and Palestine for taking away the rights of people as seen above.",
            "I don’t want a religion that’s prophet was a nonce thank you",
            "They do. They consider each others comrades in overthrowing Western hegemony.  \n\nLGBT people and Muslims are both seen as pawns, willing or unwilling to keep rocking the boat until it tips.",
            "Muslims aren't going to become a majority in the West. Especially not North America. That's pure fearmongering.",
            "Plot twist, leftists have secretly wanted to kill gays this whole time. They have been building a stockpile to then sacrifice in the name of the newly formed Utah Caliphate.",
            "narrator: they didnt realize what was obvious to everyone else",
            "A *majority*?  \n\nThe US is less than 1% Muslim, and most of those are barely observant if at all. Many are here because they were *fleeing* extremist Muslim regimes.\n\nThe US will be majority transgender before it's majority Muslim.\n\nLike always, the right is worried about impossible hypotheticals and minute anecdotes.",
            "Palestine is not \"the west\". The best way to make sure Muslims from Muslim country (such as those in the middle east) don't emigrate to the west is to not destroy their country.",
            "Muslims weren't a majority when the Pulse Nightclub shooting happened.",
            "Eh let them take the gays fuck it",
            "There was talk in my country(Denmark) about a Muslim man who refused to shake a woman's hand because of her gender and his religion.",
            "The type of Muslims that are able to immigrate to advanced western economies are highly educated skilled workers. That group is not going to cause Sharia law lol. \n\nNow there is a valid concern for cultural change due to immigration but that is not exclusive to Muslims.",
            "Where the hell do you think the Muslims in Palestine will end up if we let Israel force them to leave Palestine, you muppet. They'll become refugees of ethnic cleansing and will even further strain the already extremely strained systems Europe and North America have for taking in refugees. Its the same reason foreign aid is important, you help them in their own country so they won't have to become refugees. Then again it is part of the American conservatives agenda to flood Europe with refugees.\n\nThe US bombs the middle east -> war refugees come to Europe because its easier than taking a boat to America -> Europe is strained by a massive influx of refugees that don't even speak English -> Conservatives in the US point to liberal (as in free, not American liberalism) Europe as a failure of liberal ideas and push hard for reactionary policies because *clearly* this is all the **other** groups fault for wanting to escape war and poverty, not the US's fault for bombing and arming the middle east for 20+ years now",
            "when you get called Islamophobic for voting Reform but they are middleclass over-educated mfers who live in like Shropshire or something lol",
            "According to a famous study, people in the US and UK believe Muslims are respectively 15% and 21% of the population, while the actual figures are merely 1% and 5%. The media and the subsequent public dialogue give us a completely distorted impression of reality.\n\nNot to mention the fact that liberal Muslims exist, and they are growing. Like in Christianity, there is a massive difference between common believers and fundamentalists.\n\nAlso, it is definitely not the first time this happens. Allowing Eastern European migrants into the West has always brought more votes to the Right due to anti-communist sentiments. Left-wing values praise diversity, which means that eventually, some disagreement on some policy is going to be expected.",
            "Islam is right about women.",
            "If they realize it at all, it'll probably be around 2 stories into the drop.",
            "[A town in michigan](https://www.theguardian.com/us-news/2023/jun/17/hamtramck-michigan-muslim-council-lgbtq-pride-flags-banned) already got a taste of that.",
            "Which side has an issue with adding religion into politics? Which side are these muslim extremists? It’s like conservatives are saying they know their side will fuck things up if put in charge lmao. Keep these things separate, why is that so hard to understand?",
            "I mean...aren't 'islamophobes' the same people who were against 'gay rights' to begin with?\n\nAnd weren't the 'leftists' the same people who championed and fought for those rights in the first place?\n\nIdk man, feels like a whacky argument to make...",
            "Goddamn it. In the US this will not happen. There are a lot of progressive Muslims the more progressive ones will win.",
            "Just have more kids and it will be avoided like what, i always see media moping about it. but no one came up with the idea of having 3 kids or 4?",
            "[PCM's argument every time](https://www.reddit.com/media?url=https%3A%2F%2Fpreview.redd.it%2Fhr5vrfxaey5d1.jpeg%3Fwidth%3D1125%26format%3Dpjpg%26auto%3Dwebp%26s%3D1e122a062191d668d6cbb93f01043b6fe2de23b5)",
            "Complete strawman btw. Look up AlQaws. Islamophobes dont care about the rights of LGBTQ people. They only mention them because they want to use them as aummunition for pro-genocide sentiments.",
            "Muslims be living the evangelicals best life.",
            "Don't worry. We'll take in many refugees soon.",
            "I mean it's unlikely to happen yet we must make sure it doesn't happen. \n\nThere's always fearmongering about immigrants and that we'll all be muslim in 10 years and that we'll end up like native Americans (A right wing politician here said that).\n\nJust because immigration is a thing it doesn't mean that we'll all be speaking Arabic.",
            "No, keep going. Bring more Palestine here",
            "I hope you realize that Muslim's are a religious order and not a race.  Education cures religion, not walls.",
            "Can someone explain how opposing israels activities in Palestine materially affects me as a queer person in the west?\n\n\nLike even if I'm a total extremist and believe Israel shouldn't exist. And this happens. Will the Muslims in Palestine press the secret button in Jerusalem that kills all the gays in the west? I don't understand",
            "Yes the Christian fascists will definitely protect the left from the Islamic fascists.",
            "This is never about a majority or what their beliefs is. First, they’ll never be a majority in the west, there’s no statistic that supports that, the highest growing sect in the west is secularism by a mile with Christianity far and above being the number 1 most represented. Second, this is about the unjust killing of innocents. I’m positive that most people in Muslim authoritarian countries would disagree with the things I say and say abhorrent things, that doesn’t mean they deserve to be slaughtered",
            "the same as is happening with \"christians\"?",
            "Muslims in where?",
            "Maybe right wingers could realize that not everything is transactional, and we don't think any person should be a victim of war crimes and ethnic cleansing. Regardless of viewpoints",
            "I don't think people in the West have much to fear from \"Muslims in Palestine\". They are in Palestine.",
            "Israelis dont like gays either and its illegal there",
            "Christians out number Muslims.  As thing progress people get more liberal",
            "The Islamophobia is crazy, I hope you realize how sick you are. There are gay people in Palestine you know that right, but we’re just gonna ignore thousands of innocents being slaughtered because “they won’t accept me over there.” They shouldn’t, not because you’re gay, but because of how sick, twisted, and selfish you are. I don’t have a hating bone in my body, but this is nah way of hoping that God blesses you with empathy, have a good day knowing that you, a supposedly Christian man is supporting the destruction of Jesus’s birthplace. I hope you become a better person.",
            "Based and aye, aye aye aye aye pilled.",
            "Literally man, I’m a queer French girl, and just some of the stuff I’ve seen and heard in the last year alone, has got a little voice in my head seriously tempting me to vote National Rally next week.",
            "Can't agree more as an indian hindu,we have dealt with this issue the longest here and seeing constant news of religion motivated crime and literally swathes of villages getting converted due to demographic shifts.\nWe all are aware of the tricks and methods used by muslims but saying then out loud is a big no no for some reason ,Indian liberals also react similar, when during intra Hindu conflicts,lower castes get the priority but guess what happens when a conflict between muslims and historicay lowest caste group happens? The left sides with muslims and try to whitewash every news of such news under hindutva guise. The condition is grim here to say the least.",
            "Phobias are unreasonable fears",
            "It is completely rational. My country might not be the best around, but I appreciate a lot all the civil and political rights I enjoy here. It is only natural to be suspicious of people that make everything they can to take these rights away from people in their countries.\n\nIs that exclusive to Islam? Of course not, but it does happen a lot more often in countries with a Muslim majority population. The only major Muslim country that seemed to value civil liberties was turkey, and it seems to be all a going downhill with Islam as one of the major justifications for doing that.",
            "my favorite was the german AfD guy who got stabbed by the afghan migrant\n\n\"the islamaphobe got stabbed for being islamaphobic\" is *quite* the sentence to unpack",
            "Phobia can also mean aversion as in a strong dislike or disinclination. When people accuse you of being it tell them yes I’m for women’s rights and against pedophila.",
            "Based",
            "Phobic means 'averse to', like hydrophobic molecules being averse to water, therefore I am Islamophobic.",
            "Whoa dude. Calm yourself. Nothing to blow up over.",
            "Does anyone have the vid of Vaush doing the 180 from \"see rape culture is real all these women said they were raped\" to \"this bitch is making shit up\" in 5 seconds after she said the rapists were muslim?",
            "Send da vid",
            "eh, the video where the Muslims and rednecks team up to beat up gays is funnier",
            "When the answer is \"yes\" it's not really fair to ask between them.",
            "Show a photo to enough women and you'll find one who doesn't know what Hamas is.  \n\nPublish that one and pretend it was the first person you asked.\n\nProfit.",
            "So you think brown man bad white man good? Is that what you mean? Maybe it's been a while since you checked your user flair",
            "Sounds about incel",
            "The thing is that political centre-left and centre-right liberals are both pro-migration anyway. Not out of any altruism or “anti-westernism”, but for economic reasons. As far as they’re concerned immigration is needs to keep the economy growing, social impacts be damned.",
            "Tel Aviv is the gay mecca of the middle east. \n\n\nName another city in the region that has openly gay bars and pride parades. ",
            "I remember arguing with someone because I pointed out that about 2000 gay Palestinians live in Israel to escape persecution in Palestine.  Their \"comeback\" was that they aren't treated well in Israel.\n\nWhether or not they're treated well in Israel is open for debate but the fact they choose to live in Israel and not their home just shows which one is more gay friendly.",
            "This is the greatest civil war of the Auth-right since the Russian invasion of Ukraine fr",
            "I don’t hate foreigners I just don’t want Muslims in my country, the rest for the most part Ain’t bad",
            "You can outbreed liberals, but you can’t outbreed immigrants",
            "Liberty is a goal, not a methodology.\n\nThe whole \"we just want to be left alone\" thing gets badly misconstrued. Libertarianism in the US is about dropping Redcoats until they leave us the hell alone.",
            "The irony that some nationalism is needed to retain liberal democracy. ",
            "But we can do those things with 1/3 of the current federal budget or roughly 100% of the discretionary budget. Why do we need to keep the other 2/3?",
            "Every time I think about Dearborn Michigan, I worry about the massive influx of people coming to America and that the future generations may not actually care or hold freedom as valuable. We let them come here, they enjoy the fruits of our labor and repay us by spitting in our faces and destroying our way of life in favor of their own.\n\n\nTolerance towards these kinds of people was a mistake imo, if they refuse to assimilate, they don't deserve to be here.",
            "Snack bars?",
            ">Alphabet people will literally be liveleaked by snackbars in the bluest of blue strongholds\n\nwtf i love islam now",
            "Every time I think about the Middle East I remember that 12 million unarmed people got displaced by like 250,000 ISIS guys. \n\nThen I think, I have several cases of full power cartridges, expensive optics, and a strong desire to turn terrorist faces into red mist. 🥰🥰🥰",
            "True. And to my \"fellow\" auth leftists, if you are a communist, you can NOT be for Islam.",
            "Based",
            "Can I be against Islam and also against Israel carpet bombing Palestinians?",
            "I'm consistent: I'm an Іslamophobic\\* gay\n\n^(\\*Іslamohater actually)",
            "IMPORT ALL THE MEXICANS, WE SHARE EUROPEAN CULTURE ✊🏽",
            "Nah, bring in ton of immigrants and in the short term, they just vote for the left because of welfare, which will suck.\n\nIf you’re really unlucky you’ll get a woke DEI Indian prime minister.",
            "It wouldn't matter. You can have a sensible position on this topic, and they can just throw the word \"Islamophobia\" to negate any wrongdoing.\n\nhttps://preview.redd.it/mi14yfb3708d1.jpeg?width=720&format=pjpg&auto=webp&s=a2f094d509906042dc29c21f6d6119ac472db61a",
            "We only need to look to the leftist reaction to October 7th to see what they really think about racially motivated gang rape.\n\n\"It depends on who's doing the raping, who's being raped, and what total strangers to the victims did a hundred years ago.\"",
            "Not all Gs are Ts. And not all Ts claim to be Gs. Completely separate issues, actually. Could hardly be more unrelated to each other.\n\nHate how we’re just lazily grouping them up.",
            "to be fair, Ts have more in common with Scientology than they do with the rest of the rainbow.",
            "I only hate gay people if they're trying to push their ideas onto young children. If the T word you're talking about is transgender I'm not going to go into a fit about it. They can call themselves whatever they want, but it doesn't change the fact that you're born as either a man or a woman and no amount of surgeries or hormones will change that.",
            "Remember when the rainbow alphabet used to simply be who you liked to have sex with, and had nothing to do with what you liked to wear or your skin color was? Peppridge Farm Remembers.",
            "Gay and trans are different things. Do not lump us together.",
            "Fuck religion as a whole",
            "Was his 'tism mass murder?",
            "And actually possess skills and a will to work that would be beneficial to the nation rather than increase the dependency on the state.",
            "u/XxN00b_MasterxX's Based Count has increased by 1. Their Based Count is now 5.\n\nCongratulations, u/XxN00b_MasterxX! You have ranked up to Sapling! You are not particularly strong but you are at least likely to handle a steady breeze.\n\nPills: [4 | View pills](https://basedcount.com/u/XxN00b_MasterxX/)\n\nCompass: This user does not have a compass on record. Add compass to profile by replying with /mycompass politicalcompass.org url or sapplyvalues.github.io url.\n\n\n\nI am a bot. Reply /info for more info.",
            "And it will continue to be fearmongering until it isn't. Look at Lebanon.\n\nA Christian majority country which let in Muslims who came in as “refugees” and by use of “civil rights” protests and Arab money gained sufficient political power to finally begin the systematic murder of all Christian's in Lebanon…over 90,000 Christians died in the genocide and masses fleed… the history of this has been wiped from school textbooks… and now Lebanon is 2/3 Muslim and possesses one of the largest terrorist groups within its borders...\n\nIt's documented at the national scale, we probably won't reach that in Europe any time soon but at the local level we already see the ghettoisation and intimidation of non-Muslims to leave newly Muslim towns and regions. Sharia law quickly follows and so does extreme radicalisation. The longer we leave it the more the ghettos grow and the more pop up and the harder it becomes to actually integrate these people who radicalise. Plenty on MPs are getting elected on Pro-Islamic messaging, when does that become a sufficient block to irreversibly prevent deceleration of the growing problem or when law and order and control breaks down in these areas. In the UK we cannot even comprehend having strict borders and stopping 'asylum seekers' who all come from France... \n\nAnother example is Sweden. Wonderful peaceful socially kind Sweden. Where did it go? Grenade attacks, massive rise in murder and rape, rampant drug trade. And 1/5 foreign born now.",
            "What do you think about cities in the UK like Birmingham that have around 30% muslims ?",
            "This issue is more prevalant in Europe, where they are ghettos just for them and high crime rates that get you in trouble for trying to publish",
            "Meanwhile, the most common newborn boy's name in the UK is [Mohammed or variant spellings thereof](https://www.bbc.com/news/uk-england-45638806.amp). Pay no attention to the demographic replacement behind the curtain. Like always, the Left is deliberately obtuse and addresses a regarded, easily dismissed strawman because they can't or won't grasp the substance of the issue.",
            "Because the Muslims haven't been happily destroying their own nations with radicalism... You've got to remember that Hamas continues to enjoy popular support by the 'oppressed' Palestinians before and after Oct 7th.",
            "What is is, like when 15 to 20 percent becomes Muslim, they start demanding Sharia Law? America should take notes from western Europe on what not to be doing.",
            "Demonstratably false by looking at any of the 'asylum seekers'. Secondly for those few educated and skilled workers who come (and bring enough dependents to make the net contribution a net negative anyway) we see that their children born into Muslim areas are increasingly becoming extremely radicalised. Its the 2nd and 3rd generations who call for Sharia law because the West is a breeding ground for radicalisation that many Middle Eastern nations are not due to them recognising radicalisation as a problem. The UAE thinks we're fucking nuts.",
            "Wrong. Islam is a shit religion, and the Quran is not worthy of the paper it is printed on. Muslims can stay coping. Meanwhile, as a child of the enlightenment, I will stay winning and enjoy my freedom. Sorry, not sorry.",
            "“LibRight”\n\nLibertarians and cozying up to authoritarian ideology, now that’s a classic.",
            "I don't know what you're meaning when saying that but you're probably thinking that islam says woman are way weaker and stupid creatures compared to man.Which means that you're being misogynistic(typo?).And if you're still being that misogynistic and also maybe islamophobic in 2024,you should ask yourself \"why i am that ignorant\".",
            "Doubtful",
            "Ah hahahahahahahaha. Hoo boy, got any others?",
            "Ah yes; have more kids to prevent how your whole country from dying, do you not realize how sick you are?",
            "A bullet cures Islamic fascism, now get a flare or your going to lines as well,",
            "i always said the political alliance between islamists and the left is based on the fact that leftists live away from islam, you just proved the point.",
            "They will butcher every single gay man and woman they can find in Tel Aviv.",
            "It doesn't affect you. \n\nBut those gay people \"supporting\" Palestine are supporting those who would brutally oppress them whilst denying the right to exist to those who would protect them. \n\nThey would murder you for your sexuality.\n\nIsrael is not perfect, its insincere with its approach to the two state solution. But it's a boat load better than even the more sensible Palestinian regimen (Fatah) never mind the terrorists and war criminals running Gaza.\n\nIf I was running Israel I would clean Gaza out of Hamas, give it to Fatah, recognise Palestine then build a massive wall and tell any Jewish settlers who go on the wrong side of it they do so at their own risk.",
            "You want a very homophobic, antisemitic and terrorist state (which the majority of its people support) to gain more power over a presupposed genocide (send the proof ? Even with the numbers the Hamas publishes we see there is no genocide). It may not directly impact you in the West short-term, but it will definitely impact gays in both Gaza and Israel, and your political side supports taking in refugees and immigrants from those countries that are overwhelmingly homophobic. Stop supporting people that hate you, fr.",
            "The sympathy it creates allows Palestinians to come to the US as refugees. Michigan serves as a case study to show what happens when enough Muslim people - even well educated ones - reach the critical mass to impact policy.",
            "Yes I will definitely protect God's most beautiful creation (femboys)",
            "you do know that you can be Islamophobic without being a Christian fascist, right?",
            "Idk why everyone keeps talking about Christian Fascists as if Farcry 5 is till popular lol. Last time I could remember actual Christian Fascists they were fighting against the Nazis when they invaded Austria.",
            "I would feel more secure in a room full of Christian Facist than in a room with one Islamic.",
            "Those Christian fascists, who blow themselves up around the people with scream \"Jesus is Great!\"",
            "\"Innocents\"\n\nIslam is the fastest growing religion in Europe.",
            "If that person would be white straight male, you would cheer for that to happen to them lol",
            ">we don't think any person should be a victim of war crimes and ethnic cleansing\n\nSo why are you for the side that actively commits warcrimes while it calls for the ethnic cleaning of the Jews?",
            "So you saying homophobic just a point of views that everyone allowed to have?",
            "What are you talking about? Tel Aviv has the best gay pride parade ever! It is not illegal in Israel. You must be thinking about their homophobic neighbours.",
            "u/Professio1648 is officially based! Their Based Count is now 1.\n\nRank: House of Cards\n\nPills: [1 | View pills](https://basedcount.com/u/Professio1648/)\n\nCompass: This user does not have a compass on record. Add compass to profile by replying with /mycompass politicalcompass.org url or sapplyvalues.github.io url.\n\n\n\nI am a bot. Reply /info for more info.",
            "You can always vote differently in the future, but remember that if you don't stop them from coming in to your country, and work on getting them out, they're going to get to vote too, and they won't vote for people who want what you want, ever.",
            "I see no flair next to your name, why are you still talking?\n\n[BasedCount Profile](https://basedcount.com/u/Damn_U_A11) - [FAQ](https://www.reddit.com/user/flairchange_bot/comments/uf7kuy/bip_bop) - [How to flair](https://www.reddit.com/r/PoliticalCompassMemes/wiki/index/flair/)\n\n^(I am a bot, my mission is to spot cringe flair changers. If you want to check another user's flair history write) **^(!flairs u/<name>)** ^(in a comment.)",
            "As soon as an Islamic party took over Turkey, things went to shit and now they have a corrupt incompetent dictator that only stays in power due to all the Muslims' support.",
            "Even in turkey big problems started with more people migrated there from the east xD",
            "Thankfully my region is considered too poor and brown to attract Muslim people, even tho it seems some get lost here in their trip to western Europe",
            ">The only major Muslim country that seemed to value civil liberties was turkey, and it seems to be all a going downhill with Islam as one of the major justifications for doing that.\n\nA secular Turkey has always been better than an islamic one in history",
            "which country",
            "Azerbaijan, Kazakhstan and Krygzstan are all very secular, more so than most Balkan countries even.\nOh, and they're all Turkic states, which really makes me think the issue is an ethno-cultural one. Turkey didn't have this many issues before the Turkish birth rates started falling off a cliff and the more extreme minorities (mostly kurds and arabs) started migrating westwards. The kurds that the west seems to coddle so much as \"feminist freedom fighters\" are infamous for being VERY backwards to the point that in some of the places where they form a majority, women get brutalized for even looking at the opposite sex the wrong way.",
            "Its a warping of the word.\nBy original root meaning of phobia, it means fear, that's it.",
            "Ehhm sweaty, that's racist! 💅💅💅",
            "That’s after it was changed right around the same time people were blackmailed and extorted into agreeing that sex and gender aren’t synonyms.",
            "Hate is misia. Fear is phobia",
            "u/Historical-Swimmer83 is officially based! Their Based Count is now 1.\n\nRank: House of Cards\n\nPills: [None | View pills](https://basedcount.com/u/Historical-Swimmer83/)\n\nCompass: This user does not have a compass on record. Add compass to profile by replying with /mycompass politicalcompass.org url or sapplyvalues.github.io url.\n\n\n\nI am a bot. Reply /info for more info.",
            "Send da vid",
            "https://x.com/sydneylwatson/status/1803105671744749791?s=46",
            "That sounds fucking hilarious\n send link",
            "The average member of Hamas is definitely more homophobic than the average Trump voter.",
            "Muslim man bad, non-Muslim better.\n\nThat's what I mean, who knows what anyone else means, but we know their religion and the culture around it is total crap and they shouldn't be allowed into first world nations the way they are.",
            "Skill issue - git gud at reading scrub.",
            "The point is we shouldnt judge people base on skin colour, its to shame people who think some people are less homophobic just because their skin are a bit darker",
            "Ok, you’re gonna have to walk me through this.\n\nHow did anything in that comment result in you voluntarily writing a comment about incels, thinking “Yep, good comment”, and then hitting send?",
            "I know I see mass migration in the long run as an mortal political/social threat to every developed country myself but at the same time... I live in Poland and generally time of liberal democracy is one of the better times in history of this nation and I would rather not live under totalitarian zealotry of either side political spectrums radicals....",
            "Which is why the European youths go to the right, which is a very good thing for me, also a i said for a while it would happen.",
            "The right loves pride parades now!",
            "Some lefties have tried telling me that other countries in the middle east have gay bars they're just not open about it.  Hmmm, I wonder why?",
            "I can, but they’re pretty much all in Israel as well.",
            ">they aren't treated well in Israel.\n\n*Anything* is better than being murdered just because they're gay for fucks sake.",
            "Winner will face *looks to the left* nevermind",
            "Ask how Canada is doing with their favorite flavor of immigrant then get back to me.",
            "being a redcoat i disapprove the context but i approve the message",
            "yes",
            "i havent particularly said anything about a budget, im sure stamping out communists COULD be done with a smaller budget!",
            "I'm torn on this, because on the one hand I don't want people like you and me to suffer for woke stupidity, but on the other hand I do very much want the woke to suffer for their own stupidity.",
            "Tolerance towards the people who are bringing them in to start with was the first, bigger, and very much ongoing mistake. Closing the floodgates won't help as long as you have people inside who will keep trying to force them back open.",
            "One benefit to the American constitution and bureaucracy moving so slow is that it’ll delay stuff like shariah getting enshrined.",
            "Maybe an aloof snack bar?",
            "Allah akbar = snack bar.",
            "If you are a communist, you MUST do the g-word to Muslims.",
            "Can I be against islam and not give a single fuck about the middle east since a war breaks out every other day? \n\nYes I can and I am doing it now.\n\nBottom line is that war is bad",
            "The T *needs* the LGB or they have zero goodwill to leech off of\n\n\nJust imagine if they had to argue their own case. It's unwinnable. Only by pretending they're an extension of gay rights have they won anything",
            ">I only hate gay people if they're trying to push their ideas onto young children. \n\nWhat ideas specifically? Because 95% of \"gay ideology\" is just saying that same-sex attraction is a natural phenomenon and that gay people shouldn't face descrimination.",
            "The comment is mentioning you specifically. Ironic.",
            "Based and Identity Politics are cringe pilled",
            "Based",
            "<Insert Tuvok X Harry Kim meme here>",
            "Not really possible friendo \n\nDoubt people like Matt Walsh can tell the difference anyway",
            "Based and Reddit fedora pilled",
            "When muslims reach 10% they get to to the \"we need more power inside our communities\" and \"we need sharia law in our communities\"\n\nWe are yet to see what happens when they get to 30%, will be curious.",
            "America has Y'all-Qaeda demanding their own shamwow laws, America needs to take notes on itself on what not to do.",
            "It's a reference to that 4chan thing where they put up posters saying, \"Islam is right about women,\" leading to the regressive crowd tying themselves in knots as to what the right response should be, since on the one hand they're virtually incapable of criticizing Islam/Muslims, but at the same time they obviously couldn't very well agree with the statement. So, they ran around like headless chickens for a bit before doing the easy thing and just blaming Trump supporters or whatever. It was a masterclass in laying bare all of their hypocritical, identity politics bullshit and the staggering amount of cognitive dissonance at play. \n\n4chan is an utter cesspool, but this was actually one of the more inspired things they ever did.",
            "Judaism is right about women. Now back to the kitchen and separate menstruation bed",
            "You made a lot of assertions and assumptions, and yet you couldn't point out anything actually wrong with the statement itself.",
            "Based",
            "The IDF is killing gay Palestinians just the same as straight ones. It’s killing Christian’s just the same as muslims. It’s killing women & girls just the same as men & boys.",
            "Based",
            "I support the secularists, not the Judaists & Islamists.",
            "Genocide doesn't have anything to do with numbers, it has to do with trying to destroy an identity.  The nazis didn't just kill Jews, they destroyed synagogues and Jewish businesses as well, the goal was to erase the Jewish identity.  You can do that regardless of how many of a group there are.",
            "I mean I'm also Muslim so Israel hate me too\n\n\n\n\nThat being said, presumably more homophobic refugees are created when Israel just bombs the fuck out of gaza and continually displaces Palestinians in the west bank no?",
            "Based and authcenter moment pilled",
            "Definitely wouldn't want to justify commiting genocide against an entire group of people after all, right?",
            "not in their echo chamber",
            "You are setting this up like being Islamophobic is a good thing",
            "I was commenting on the posted meme with the crusader guy.",
            "No idea what it has to do with Farcry. Never played it.",
            "Yeah, I wouldn't consider myself a Christian fascist cuz I think Religion and politics should be separated, but we definitely are more chill than islamic fundamentalists",
            "They're about the same to me, except only one of those is actually threatening to turn my society into a theocracy.",
            "Yes but secularism is the fastest growing sect",
            "Then why does left support Ukraine and right \"needs to focus on our problems\"",
            "1. War crimes don't justify war crimes either way. \n\n2. Israel commits war crimes on camera every day. If that isn't \"actively\" I don't know what is.\n\n3. These calls [for ethnic cleansing and genocide?](https://law4palestine.org/law-for-palestine-releases-database-with-500-instances-of-israeli-incitement-to-genocide-continuously-updated/)",
            "Yeah it’s a really sucky situation all around. France might be one of the very few genuine multi-party democracies, we’ve got over 20 parties with representation, and 4 major coalitions all with the potential to form the next government. \n\nAnd somehow they all fucking suck….",
            "Happened in Dearborn, Michigan, except they had the help of useful idiots. Lots of us want to stop that from happening elsewhere.",
            "Ataturk has been one of the historical figures I admire for a while now, in my opinion there is no other leader in the 20th century that has been as capable of transforming the country for the better (in my opinion). It is a bit disappointing to me to see a country that when I was a child was considered extremely promising and a very serious candidate for European Union membership become the sad shadow of its former self that lives with hyperinflation and flirts so deeply with extremism and radicalism that is so deeply entrenched in the Middle East. What was once a beacon of stability and progress now looks like just another poo in the shitstorm",
            "Brazil",
            "That's the neat part - they never were. Gender is a completely made up term when it comes to biological beings. We're sexed - words are gendered (in many languages, often latin based.) In the 1950's, \"gender\" was seen as the polite way to not have to use the vulgar word \"sex\", but it's been a long con that's paying off after 70 years.     \n     \n*edit* It's a good thing that legal documents and laws are written about \"sex\" and not \"gender\". At least, it would be a good thing if the side that claims they're not the same also claims they're synonyms when it comes to legal documents.",
            "https://web.archive.org/web/20200713214933/https://www.youtube.com/watch?v=mhZ0JqQOsDA&gl=US&hl=en",
            "Friendly reminder that Trump was the first president to enter office already supporting gay marriage.\n\nhttps://preview.redd.it/0zl13ifduz7d1.jpeg?width=1225&format=pjpg&auto=webp&s=6ef885875d5ec32936620759aecca23dd8f5c7e9",
            "Same goes for women’s rights…  Never forget Lara Logan getting gang raped while reporting on the “progressive revolution” in Egypt.  https://youtu.be/qx1FpHBfiGg?si=KSN9aTsp0wvwCxdT",
            "That is indeed the most stupid thing I have seen this month... and I watch the news so I know.",
            "Well that's easy to explain. He has no idea what incel actually means, other than that it's an insult, and used it for that reason.",
            "American Pride 🇺🇲🇺🇲🇺🇲🎆🎆🎆💥💥💥🏈🏈🏈⚾⚾⚾⚾💥💥💥💥🎆🎆🎆🎆🇺🇲🇺🇲🇺🇲🇺🇲🦅🦅🦅🦅🦅",
            "I wonder if Hamas would host a Pride Parade to help bring attention to their cause.",
            "On a serious note. I think we'd have less whingers in society if they had to face real hardships like the Ukraine or the Israelies or the Palestinians. Everyone I see who complains about suffering is an observer, not actually suffering.",
            "No one has a problem that there are Indian immigrants, the problem is the amount coming in can't be supported by the current infrastructure and that a lot of them come under false pretenses (pretending to be students but going to schools that simply take their money to help them pretend they're students).",
            "You can’t let them all in at once no matter where there coming from",
            "I think redcoat in this context is probably any trying to trample freedoms.\n\nI think the US settled all its beef with Britain about 200 to 250 years ago, depending on if we're counting the War of 1812 or not.",
            "Same here. On one hand I don't want my country to end up like the one next door, but people here still just refuse to process math in their head.\n\nBut on the other hand the only thing that would (maybe) wake them up to the problem is if they themselves became the next victim. And I'd have a little schadenfreude for them.\n\nBut even that wouldn't help in waking up the others, because the peaceful religion is playing the slow game here. Get in, stay still, enjoy the useful idiots, grow in numbers and a decade or two later, BAM! Jihadin' time!",
            "Or maybe acknowledge that western countries are funding the war, so we have the power to affect it. And maybe consider that there are other people than you in the world.",
            "I agree with both of those. What I don't like is attempting to introduce the topics of sexuality to children at an age where they haven't even had sex education. If same-sex attraction does come naturally, then children shouldn't have to be force-fed it. Let them learn for themselves when they're old enough and leave it to the adults to foster an environment where they can be accepted.",
            "> Because 95% of \"gay ideology\n\nThe gay rights movement was taken over by Queer theorists. If you don't know what those are you should probably shut it. \n  \nIt would have taken literally seconds to discover this. \n    \n>and that gay people shouldn't face descrimination.\n   \nGet out of here with the \"special group facing social discrimination\" BS. \n   \nI don't care about people who don't care about my individual rights.",
            "And then you have the 5% who are trying to push their ideas onto young children- like [NAMBLA](https://en.wikipedia.org/wiki/North_American_Man/Boy_Love_Association).",
            "What's unhinged about saying that men and women are different?",
            "I doubt a racist can tell the difference between a Kenyan and a Nigerian, but does that make it okay to lump them together and call them the same?",
            "u/SnooPets1787 is officially based! Their Based Count is now 1.\n\nRank: House of Cards\n\nPills: [1 | View pills](https://basedcount.com/u/SnooPets1787/)\n\nCompass: This user does not have a compass on record. Add compass to profile by replying with /mycompass politicalcompass.org url or sapplyvalues.github.io url.\n\n\n\nI am a bot. Reply /info for more info.",
            "We should never let them get to that point. If we care about freedom, we must take proper measurements to protect it.",
            "Yes, I remember, I was there when it all went down. Back then I thought it was hilarious, and now I just see it as a sad state of affairs that we are bending over backwards for people that, if given the chance, would see our way of life destroyed. I think the correct response then and now was what I put in my op.",
            "What does he mean when saying \"Islam is right about women\"?I can't make anything more then assumptions without knowing that",
            "Okay?",
            "Thats war. War which Hamas started.\n\nI'll judge Israel on whether or not they ultimately recognise Palestinian statehood.",
            "Except they don’t intend to kill arabs because they are arabs. Maybe ask why Hamas uses its population, children notably, as human shields and hides its military equipment underground, in hospitals, mosques and densely populated zones, and why they avoid evacuating its population. Also, if the people keeping captive hostages are considered civilians, that is a big fucking joke. Then of course it’s very easy to whine and pretend being the victim when they are the ones responsible for the war.",
            ">The nazis didn't just kill Jews, they destroyed synagogues and Jewish businesses as well, the goal was to erase the Jewish identity.\n\nFunny thing- that's been the Palestinian goal from the 1930s all the way 'til today, like seriously they were lead by a literal [Nazi war criminal](https://encyclopedia.ushmm.org/content/en/film/hajj-amin-al-husayni-meets-hitler) until the 60s when Fatah took over, and glorify Hitler in their schools today.",
            "Hummm, can you remind me the proportion of muslims in Israel? And in comparison to the proportion of Jews in the arab world? Have you seen the evolution of the arabic population in Israel vs jewish population in muslim countries? So don’t give lessons to Israel about pseudo racism against arabs.\n\nOnce again, read my other answers, ask the Hamas why they use its population as human shields, specially babies, and why they put their military equipment in hospital, mosques and densely populated areas? And why they sometimes don’t evacuate its population? Oh but yeah, then it permits them to make islamist propaganda in the West about how this terrorist and anti-semitic group is supposedly just « resisting oppression ». You’re not fooling anyone anymore.",
            "> I mean I'm also Muslim  \nLib-Left flair  \n  \nBait used to be believable.",
            "Is their any personal accountability, or is everything someone else's fault?",
            "How can you be a Mohammedan and Queer? According to your own religion, you're just living in sin.",
            "that's a strawman argument and you know it",
            "(removed)",
            "I think it's ok to hate the religion that let's you kill people branded as kafir (non-believers)",
            "Crusaders were not fascists lmao",
            "so what that it has a crusader in it, it still portrays the message that Islamophobs protect LGBT+ rights",
            "There's leftists that support Russia and rightists that support Ukraine, everyone knows well there's a radical part of the left that would support even the anti-christ if he was anti-American",
            ">War crimes don't justify war crimes either way  \n>  \n>...  \n>  \n>Israel commits war crimes on camera every day\n\nWrong, many war crimes are explicitly war crimes- because committing them Justifies the other side in committing actions that would *otherwise* be war crimes by default, examples include-\n\nBy utilizing civilian infrastructure in the middle of otherwise Civilian occupied zones to house military equipment- Hamas opened said structures and zones to bombardment.\n\nBy using surrender as an excuse to suicide bomb IDF forces, Hamas removed protections from surrendering Palestinian forces.\n\nBy disregarding the use of uniforms in favor of civilian clothes and actively acting with said civilians as human shields, Hamas rendered civilians valid targets on the basis of possible aggression.\n\nBy utilizing child soldiers- Hamas removed protections from Gaza's children.\n\ncan you see the pattern yet?\n\n>These calls for ethnic cleansing and genocide?\n\ngood joke, the idiots maintaining that list tried to justify Hamas's 10/7 attack on the basis of the Right to Resistance under the UN Charter, calling the rape of civilians and taking of hostages \"self defense\" rather than a war crime.",
            "They’re all made of people 🫤",
            "Ataturk got his name because when he was a kid he worked for a British guy who would say “atta Turk!” Whenever he did something good",
            "Based and SuddenlyCaralho pilled",
            "pão de queijo-pilled",
            "All words are completely made up when it comes to everything. We’re just going to have to disagree on the fact that they didn’t use to mean the same thing. They did. Fundamental biological definitions that were co-opted by soft science frauds and political panderers into the opposite of what they’re supposed to mean. I don’t believe it now and I never will.",
            "Holy shit the speed at which he 180s, my fucking God. \n\n> Rape culture is real and probably higher because people don't believe rape allegations\n\n> unpauses video for *5 fucking seconds*\n\n> person he is referring too reveals their rapist was Muslim \n\n> \"Don't believe all women because this bitch is lying\". Literally asks for her name to name and shame *the rape victim* when he was literally just talking about how people don't report because they aren't believed",
            "this is CRAZY. It sounds like something Hasan would say 💀💀",
            "Physicists are impressed how Vaush can slide from one moral framework into another with zero friction.",
            "The going rebuttal for this is that he was holding the flag upside down (despite the text being right-way-up) so it actually means he wants to personally murder all gay people.",
            "Did you just change your flair, u/thupamayn? Last time I checked you were a **LibCenter** on 2024-4-2. How come now you are an **AuthCenter**? Have you perhaps shifted your ideals? Because that's cringe, you know?\n\nThat being said... Based and fellow Auth pilled, welcome home.\n\n[BasedCount Profile](https://basedcount.com/u/thupamayn) - [FAQ](https://www.reddit.com/user/flairchange_bot/comments/uf7kuy/bip_bop) - [Leaderboard](https://basedcount.com/leaderboard?q=flairs)\n\n^(I am a bot, my mission is to spot cringe flair changers. If you want to check another user's flair history write) **^(!flairs u/<name>)** ^(in a comment.)",
            "And then the msm disappeared her and she washed ashore at Fox News",
            "Why would CBS news ban this video in Canada",
            "It would be like thinking Democrats could have just praised Trump and he'd have supported every one of their causes. It's just such a foreign concept to them, and goes against everything they stand for, that I sometimes think it's God's will - a divine intervention - if you will, that prevents it.",
            "I'm suffering every single Second of my miserable Existance",
            "As a Israeli i can tell you out politicians are still stupid, and our population and youths are always growing more and more right wing, thanks to interactions with our beloved cousins and their religion of peace. We also have some stupid navie idiotic people who hate the country a dcare anti Zionists but they are a small hated minority, thankfully.",
            "I agree.",
            "https://preview.redd.it/y9iye3hei28d1.jpeg?width=839&format=pjpg&auto=webp&s=0a8e88c8e48068fad6bde060aea25ba41e06b536",
            "Guess why they are being funded by the west - because people cannot shut up about the war to such an extent that they are marching on the streets. How do you expect a government to ignore such public outrage? Ofcourse that they would have to make a statement, and after that show support in the form of donations (funding the war).\n\nIt's important to raise awareness about the war, but when you start demanding the government to support a side, don't come after the country for starting to support a side of the war.",
            "> If same-sex attraction does come naturally, then children shouldn't have to be force-fed it\n\nBut surely it can be mentioned? It's not as if heteronormativity isn't introduced to children prior to them receiving a proper sexual education. \"Topics of sexuality\" don't have to be *about* sex when you're talking to children. Romance and attraction aren't naïve concepts.",
            "Does the mere existence of queer theory mean that we can't mention to a child that gay couples exist?",
            "God i wish i didnt cliked on that ![img](emote|t5_3ipa1|51175)",
            "Is NAMBLA 5% of the gay population?",
            "What's unhinged about letting kids know not to grow up to be a homophobe and a religious zealot just because mommy and daddy said gay people are the spawns of Satan?",
            "Funny where your assumptions went.",
            "Are you saying that the statement is wrong or not? Make up your mind.\n\nIf it is wrong, then what is wrong about it? *Be specific*.\n\nIf it's not wrong, then you just sound like an old man yelling at clouds.",
            ">Except they don’t intend to kill arabs because they are arabs.\n\nNo, but they intend to kill Palestinians because they are Palestinians, and many are very open about that.",
            "Begone hooker, I'm not listening to your \"literally Hitler\" bullshit.",
            "Strawmanning in response to a strawman.",
            "Where did you learn this thing from?And which verse of Quran are you talking about?You could be talking about the truth,which is why i wanna learn the source.",
            "Weren't the crusader states the most libleft place to live back in the day?",
            "Where do they do this?",
            "Tbf those leftists are just twitter tankies that nobody really gives a shit about",
            "Someone would say They're all made of fr*nch I bet",
            "I'm saying the people who introduced the word \"gender\" into sex education did so knowing it wasn't a valid word, but wanted to get people away from using the word \"sex\", so we could have this exact confusion today. The key is to NOT play along. Just acknowledge that \"gender\" was ALWAYS the wrong word, and insist on using \"sex\", and their arguments fall apart. You can't win their game using their words. *Gender* has literally zero meaning when it comes to humans. We are sexed. End of story. And you can't change your sex. It's set in stone.",
            "Welcome to Vaush. If you ever find yourself having a nice thought about him, you should become immediately worried about the state of your brain.",
            "And he even said he wanted to \"See this bitch's name.\"\n\nLord fucking knows what he and/or his fans would've done with that info.",
            "Typical leftist.",
            "The \"believe all women\" leaving his body when the perpetrator is a Muslim",
            "I saw it live, it was handed to him from the crowd. He seemed happily surprised then walked it around like that. Pretty sure he’s publicly supported gay rights since the early 2000s. I say fly it upside down as a sign of distress for what’s become of the gay community, things have derailed since I was young.\n\nAnyway, enjoy [this](https://youtu.be/O3UnP1QFTWw).",
            "I don’t wanna talk about it",
            "And is now too far Auth Right even for Fox News (she got “disappeared” by them as well). The things trauma will do to a person. ",
            "Too offensive for us Canadians? Idk. It's a pretty odd thing to do.",
            "Is it actually?? For fuck sake. ",
            "Based and Look-at-me!-I'm-Mr.-Meeseeks! pilled",
            "Isn’t another factor those super Orthodox Jews that have like 6 kids.",
            "???? Do not tell me you think the reason the west is funding Israel is because the people won't stop talking about the war???",
            "Sure, mention it. I just don't think it should be a focal point. There's way more important things to teach kids than whether or not they'll have a girlfriend or a boyfriend when they get older.\n>Romance and attraction aren't naïve concepts\n\nI have to respectfully disagree. A kid isn't capable of understanding love in the way that an adult does.\nI think children should be protected (not necessarily sheltered) from anything that's beyond their ability to comprehend and I'd argue that love and romance is exactly that.",
            "> we can't mention to a child that gay couples exist?\n  \nGet your embarrassing drama out of here. \n   \nDon't talk to any kids about sexual preferences. If they experience a gay couple their parents can discuss it if they feel it's appropriate.",
            "No, but by conservative estimates- Pedophiles are 5% of the population in general, while more liberal estimates put that at 15% or higher so... yeah.",
            "Way over that going by pride parades lately.  Talk about putting your worst foot forward.",
            "It is wrong if i understood him correctly.He probably thinks that Islam says woman are stupid compared to men.So he's saying that Islam is right about women being stupid compared to men because most of these people defending Palestine and LGBTQ+ rights are womens.He's wrong,because that women supporting Palestine and LGBTQ+ at the same time could be just supporting Palestinian people getting killed by Israel but not Hamas,also this post is meanless because of the same reason.If you're not psychopath or just stupid you won't support Hamas.",
            "No they don’t. And what about the openly antisemitic Hamas that wants to wage the jihad against jews, are they committing a genocide against jews ?",
            ">Where did you learn this thing from?\n\nthe Muslim states",
            "This sub is so weird.",
            "name me 1 Muslim country that has LGBT+ rights, oh wait, it doesn't exist",
            "I understand your point but I’m no longer interested in winning arguments with them, I just flat out refuse to go along with it. Identity politics have become the new religion for people and you’ll never talk someone out of their religion.",
            "if i may proffer a revision to a classic line. \"if you think you hate vaush enough, you dont\"",
            "He's gotta be a false flag actor.\n\nHe's clearly intelligent. He has given great advice about dealing with mental illness and depression. He is clearly educated. He makes funny jokes.\n\nAnd he's batshit insane. It's an act to drive people to the right/centre, right?\n\n\nRight?",
            "Nothing they wouldn't have already done anyway. The girl that said it was Sidney Watson, a rightwing youtuber, or to Vaush and his tards, pure evil.",
            "Yes considering how much better he was than old neocons it's really surprising how the left eats up the propaganda against him.",
            "https://preview.redd.it/dqmo3tjvq08d1.jpeg?width=1080&format=pjpg&auto=webp&s=76b1370cc341651b7c37e8f59777a1ec29dac085",
            "Welcome to the tip of the horseshoe, fren\n\nhttps://preview.redd.it/zrxau3dxvz7d1.jpeg?width=478&format=pjpg&auto=webp&s=88890dfb2ba975e829d2ab081497d9cbc24b0265",
            "The \"I just want to be left alone\" to \"They're never gonna leave me alone so I'll have to make them\" pipeline.",
            "Now, now. There must be an actually interesting story if you \"don't want to talk about it\" since that's what everyone with interesting stories say",
            "Based",
            "Based and authoritarian pilled!",
            "So that you guys wont use pattern recognition, wity the rape the Muslims do in the ME and the ones they do in Canada",
            "yes, but they mostly care about who is more willing to fund their crap then right vs left. i just that the right is more willing to fund them for their political allince",
            "Absolutely agree with the second part. I don't think romance as a concept should be pushed on children who misunderstand it at that time.",
            ">A kid isn't capable of understanding love in the way that an adult does\n\nThey can have an understanding of those topics, even if it won't be as informed as an adult's understanding. Kids know what it means if they have two parents who love each other, and I don't think the idea of gay or lesbian parents having an equal degree of love is so beyond comprehension. So how does it protect them to *only* talk about heterosexual partnerships? What is it protecting them from?",
            ">Don't talk to any kids about sexual preferences\n\nThat's begging the question. Who is talking to kids about sexual preferences? Mentioning gay people exist isn't a discussion of *sex,* it's a discussion of *attraction*. Talking about homo-romantic relationships is not \"pushing ideas\" onto children, it's talking about natural social phenomena. If it's age-appropriate to talk about weddings and pregnancies, then queerness should be equally fine. No one is saying a kindergartener needs a full sexual education before they graduate to the first grade. But it might help that kid to know that it's normal for some people to be gay if later in life they find out that they or any of their peers might be.",
            "Is that for real? Seriously if true really sad",
            "Not even 1% of the LGBT community goes to pride parades nowdays.",
            "No, the question is not if you believe \"his interpretation of the statement is wrong\". The question is whether you believe the statement itself is wrong. Do you believe that \"Islam is right about women\"?",
            ">No they don’t.\n\n\"There are no innocents in Gaza\", sounds an awful lot like genocidal language to me, you know, same kind of shit the Nazi party said about Jews in the 30s.",
            "Meanless.I could became a ruler do something and claim that i do that because Islam tells us to do like that so people won't judge me then.",
            "I mean that's an issue wherever there is any kind of fundamentalism.",
            "Bro have you never met one? To them reality is soft and malleable to make way for rigid ideology.",
            "Baste and Just the tip pilled",
            "Why did he call Jonkler Man? Is he blind?",
            "It's a pretty goofy point to even make. Are all romantic subplots in any kid media putting them at risk? Romantic interests for MCs is so common in G to PG-13 rated media.\n\nFollowing their logic, it's exposing them to love and romance depicted on screen. They see it in the TV, computers, and their phones. Is this inappropriate because \"they don't understand like adults do?\"\n\nWhen has this ever mattered?",
            "So people that aren't LGBT represent people that don't even go to parades?",
            "Islam is right about women to me because I'm Muslim.But if he thinks that Islam is teaching people that man are superior to woman then no,the Islam is in head isn't right about women.",
            "Ehhh ??? You’re literally fabricating words I never used, your only argument is « MEH, you said x (which I literally never did) so you must be a nazi because x + y / z = m »",
            "So it's only a coincidence that muslim-majority countries act tyrannical and fucked up? Pakistan, Afghanistan, Iran, Iraq, Saudi Arabia, Quatar, all countries that surround Israel etc.. Just pure coincidence?",
            "if that happened in only a few states, sure, I'd think that too. but that happens in the majority of Muslim states",
            "Based and Just for a Second, Just to Know How it Feels Pilled.",
            "Good then you simply agree with the statement and its purpose isn't for you. Anyone who believes the statement to be genuinely true should have no problem with it. Anyone who honestly believes it to be false should have no problem stating why. It targets neither of these groups.\n\nIt's purpose is to out hypocritical \"progressives\" who believe the statement to be \"hateful\" but are unable to articulate why, because any attempt to do so will trigger their cognitive dissonance.",
            ">You’re literally fabricating words I never used\n\nNo I'm not, I didn't say *you* said it",
            "No,not coincidence.But it's not because they're muslim-majority.It's because they're autothritarian and non-secular states.Not even because that they're non-secular.Because similar things(acting tyrannical and being f*cked up) could be said for China,North Korea,USSR etc.",
            "it’s insane to see people twist themselves into a pretzel in defense. they are literally willing to die on this hill",
            "Okay I misread that. And yeah, it’s not because some people say dumb stuff that the war between Gaza and Israel represents a genocide",
            "Muslims even kill and rape minorities in democratic countries so they don't even need to be forced to in authoritarian regimes. I don't know the last time a chinese or north korean did something like that in the West."
        ]
    },
    "Can women have anything to themselves? ": {
        "title": "Can women have anything to themselves? ",
        "score": 1464,
        "url": "https://i.redd.it/s9kt8fnv5z7d1.jpeg",
        "content": "",
        "num_comments": 381,
        "comments": [
            "Just goes to show, men are better than women at everything. Including being women.\n\n(This was a joke no banboozle)",
            "It takes a real man to be a woman",
            "Men are so much the superior sex that they're even superior to biological women at being women.",
            "Good, these \"miss\" competitions are a disgrace and should die as soon as possible.",
            "As if beauty pageants are something women desperately need at all…",
            "I'm not gonna start caring about pageants now",
            "Womyn getting hard diffed since the beginning of time",
            "I'm all for Equality and Shit\n\nNot because i believe in it, but because it makes Women more miserable than Men in the long Run",
            "\"anything you can do I can do better\"",
            "Woman are more likely to support Trans stuff then men\n\nThey're probably the ones inviting this stuff to their events",
            "Funny that women will still continue to vote for the politicians that push these kinds of things, not knocking on women just find it strange",
            "https://preview.redd.it/0fkgxuycjz7d1.jpeg?width=760&format=pjpg&auto=webp&s=32fe769b7feb24c0e9e56fa82cd575c2abe3fde8\n\nJust so we know who we are talking about.",
            "Here before the locked award",
            "Cervical cancer is still up for grabs... any takers?",
            "No. After all, men can't have country clubs, boys can't have the boy scouts.\n\nTurnabout is fair play.",
            "I can’t wait for the cross-compass libleft authright witheredjaks when the AI waifubots start winning these legacy pageants.",
            "They just knew the psychological harm associated with being a pageant winner and took that burden off her shoulders, based libleft if you asked me",
            "Deal with it. Even men are better at being women.",
            "I hate beauty pageants. Either make beauty pageants for men and other genders, or don’t have them at all.",
            "Why does this matter? I can understand concerns when it comes to transgender women in women's sports (or other physically-oriented activities), but why does it matter with *beauty pageants?* Who cares what sex you were born as, pretty is pretty. It sounds like the only argument people have is that people who were born male are inherently less attractive or something, which is...silly.\n\nI'm going to be honest, I'm female and the last time I thought about \"beauty pageants\" was when I was watching *Miss Congeniality.* This is a non-issue, sorry...",
            "I don't think transgender women should play in women's leagues sports for a variety of reasons. \n\nBut if you lose a beauty contest to someone who used to be a dude, then that's on you. Sucks to suck, I guess.",
            "Googled it.\n\nAbsolutely would.\n\nThat is all.",
            "But like, authright usually isn’t about women’s equal rights lmao",
            "To be fair, have you SEEN Bailey Anne Kennedy?",
            "Beauty pageants suck all together",
            "I also promise you they just won because they are transgender and whoever is hosting this Miss Maryland just wants to seem progressive/ ‘woke’. Trans women need to stay out of women’s spaces, they can’t just claim to know what it’s like to be a woman.",
            "(Anecdote) I see more women letting this slide than men broadly speaking. This is their fight to lose. As libleft public enemy number one: a straight white dude, I just sit back and laugh. Because I’ll keep winning regardless.",
            "Who cares?",
            "Bro I don’t give a shit I just want titty.",
            "I mean it’s not like being trans actually presents an unfair advantage in this competition. It’s not like physical sports.",
            "i still cant believe that dude won 'woman of the year'",
            "Women can have menstruation and pregnancy to themselves.",
            "wut?",
            "Male is clearly the better gender because we seem to win at everything",
            "It takes a man to be best girl",
            "[removed]",
            "[removed]",
            "[removed]",
            "Could someone please explain the graph used in the post and how to interpret it?",
            "Hell yeah! We male are so powerful that we even win female competitions 😎😎😎/s",
            "Idk maybe if they were hotter than her",
            "https://preview.redd.it/0064qg3hz38d1.png?width=671&format=png&auto=webp&s=e9782b94ba8b419bdded99c977f22294c2491479\n\nnogh said",
            "https://preview.redd.it/99efdx1z048d1.jpeg?width=620&format=pjpg&auto=webp&s=f9de11ec35662b15a3dff5b0bd3fe2238fa84a65",
            "I’ve said it before, I’ll say it again. \n\nMen are better at being women than women. \n\nAnd liberal women are too stupid to realize that the end goal of this progressive bullshit is to be totally replaced by men.",
            "Let this system rot on itself. It’s too late to even try, like a cancer on stage 4: you just let it be.",
            "Damm montgomery county ruining everything again",
            "First of all, does she actually look good?",
            "She's probably not even the one there with the most cosmetic surgeries.",
            "Having watched women slowly ruin one thing after another that men enjoy because it didn't revolve around them I say screw'em, this is kinda funny.",
            "I like the use of the ugly trans wojak when talking about a literal beauty contest winner. I wonder where the usual copium arguments about her having some unfair advantage in the contest are?",
            "Women wanted to include these people. No sympathy. If women would like some advice from men, the answer is fairly obvious: it could all be over tomorrow if you stopped showing up. Stop competing, among other things.\n\nBut ofc women don't want advice, lol, they want empathy, not solutions. We're sorry that you vetted for dudes in dresses and they've ended up being better \"women\" than you... omg so sorry baby, I'm thinking Panera Bread tonight on me.",
            "She's genuinely very pretty. \n\nKeep malding rightards.",
            "That quote doesn't mean what you think it means...🤦\n\nIt was written by Barbara Ehrenreich, Marxist and Socialist Feminist, who was very much in favor of trans rights.",
            "I thought this was political compass memes? Where is the meme exactly? All I see is whiny bitchbaby transphobia",
            "Pissing righties off? Im all for it lol",
            "Dude, big tits, beautiful hair, nice smile\n\nIf i could, i would in a heartbeat. Im sure she's got a nice personality too, if she won Ms America",
            "Trans women are women. We aren’t taking anything that doesn’t belong to us already",
            "Not sure what everyone’s problem is with a woman winning a beauty pageant?\n\nhttps://preview.redd.it/99jpgo1to08d1.jpeg?width=671&format=pjpg&auto=webp&s=cb5fb39a8b70d3c4af2058d47f905091f6868657",
            "Man, people will moral panic about anything these days. High percentage of black students in predominantly black countries. Trans women winning random state beauty pageants. Remember when we were scared of real things like nuclear conflict?",
            "A woman won a woman's contest?",
            "So a man managed to win a woman's contest? Proof that men are better 💪",
            "No offense but beautiful is objective. So this is kinda mute.",
            "My god transgenders aren’t even something new in this country get tf over yourselves. Transgender women are women.",
            "[deleted]",
            "Trans women are women. So yes, it is for women.",
            "was this happening before they entered male spaces",
            "Now while I don't like trans folks in women's sports, aren't these a measure of objective beauty? Sounds like women need to step up their game",
            "Bro, why tf , even if you care about gender ideology, care about who wins a private company contest? Like it’s such a non issue with all going on in the world.",
            "I don’t understand why men get mad about this. Trans women don’t bother me. It really a women issue now let them handle it. If they want loose their shit good for them. Not my monkeys not my problem.",
            "men we can't stop winning!!!",
            "I wonder how long it’ll take before this comment stops being a joke",
            "Relax liberal, this is called dark humor\n\n*Joker gif*",
            "Based and trans inclusive radical misogyny pilled",
            "https://i.redd.it/zu2ws4lpe18d1.gif",
            "Based",
            "He says that this was a \"joke\" and \"no bamboozle\" but I honestly think he's lying",
            "Psychologically males are more likely to take risks for higher rewards. So although “better” is not the right word, it could appear that way in any competitive scene",
            "You vill marry ze femboy and you vill get him boipregers",
            "Dudes rock.",
            "No cap?",
            "If there was a right wing movement that propositioned this seriously it would have a strong enough effect to pullback the trans movement I guarantee it",
            "I'm not joking. 😎",
            "Marines approved 🤷‍♂️",
            "No joke though.",
            "~ Garnt (gigguk)",
            "Based",
            "Well according to these people being a woman = being feminine\n\n\n(Right-wingers agree with this btw)\n\n\n\nAnd since men invented most of \"femininity\", of course they're better at it",
            "The public sentiment would indicate otherwise",
            "Based (and child beauty pageants too)",
            "Based",
            "Please explain your reasoning if you don't mind.\n(I have literally never kept up with those competitions and do not know their flaws)",
            "Based",
            "Based",
            "They keep being cringe for only having humans in the Miss Universe competition",
            "why?",
            "Based",
            "unbased",
            "Based authleft.",
            "But it's like the ultimate female fantasy right? \n\nA committee of people telling you that you're objectively better than other women?",
            "I think at this point it’s not even about the “contest” per se, but about human nature itself.",
            "I don't think the majority of women care about this nearly as much as this sub thinks.",
            "I'd just like to say that I'm a woman and I do not in any way, shape, or form support born men competing in women's events. It actively kicks women out of trophies, team positions, scholarships, etc. Trans people should have spaces to compete in events, but they should do it in a way that doesn't kick biological women out.",
            "Yeah, it puzzles me as a woman.  It's like these supporters have no self-preservation instincts.",
            "Because they aren't a threat to us or our sexuality, along with the misogyny. Femlae traits are considered less than. Why do you think men don't hate on trans men? They don't have to worry about being attracted to them and being gay, they are also adopting masculine traits which aren't so weak and yucky",
            "Because women are more likely to have empathy.\n\nMen, and more specifically conservative men are hostile to anything that doesn't fit their world view because it scares them. And a trans woman giving up their masculinity is something they can't fathom so they lash out against it.\n\nLets not pretend transphobia is anything other than conservative men being scared of us.",
            "Doesn't surprise me with some of the anti IVF/abortion shit\n\nEven if you don't like neo gender ideology like me even though I am a man you can be stuck between a rock and a hard place when a AG is trying to get a 9 year old a murder charge for not having their pedo uncles baby\n\nIf thats the alternative to \"Men can get pregnant\"",
            "Yeah it’s crazy how this one single issue hasn’t been enough to overturn the fact that the right frontrunners don’t advocate for women’s interests in a single other way /\n\nThis is just Democrats making life worse for the rural working class and then complaining about working class voters being too stupid to vote in their best interest in a new coat of paint",
            "TempleOS reference in the bio? Based 🤝",
            "There is no way I care more about this than the government forcing my daughter to give birth to a potential rapists baby. Government involvement in reproductive care and women's bodies kind of tops the list. That's where Republicans really screw themselves in elections.",
            "Yeah, why do millions vote with healthcare and right access in mind instead of  beauty pagents, which are just vanity events for the rich anyway.",
            "Aren't women leading this to begin with? What's the statistics say?",
            "Damn, it’s almost like having a trans woman win a beauty pageant is not enough to make women vote for the party which hosts people who don’t think that making them vote was a good idea, who’d have thought about that Authcenter?",
            "huh? what do politicians have to do with beauty pageants lmao.\n\nThis is the type of decision that needs to be made by whatever body organizes these pageants",
            "You know, it can’t be that hard to look this way if you have the right build/bone structure. \n\nIt’s a very specific, made-up look. ",
            "Uncanny valley",
            "https://preview.redd.it/w13gvd61vz7d1.jpeg?width=1000&format=pjpg&auto=webp&s=8ff27226a85d539ef21d1616ef4396b95eec9f8e",
            "I guarantee no one would know the wiser if it was never mentioned.",
            "Very pretty but it is still a gut punch for female spaces imo. \n\nOut of curiosity, I wonder if they really deserved it (prettiest, most talented/congenial) or if other more deserving contestants were overlooked for political points.",
            "Yeah she pretty.",
            "I uh wouldn’t uh. Damn you.",
            "You people need to raise your standards, even ignoring the uncanny valley there is no way this was the most beautiful contestant",
            "She's beautiful \n\nShe's still not biologically a woman",
            "I see prettier women than this \"woman\" by simply walking around Walmart.",
            "Aren't you the human pet guy?",
            "Boy scouts wasn't made co-ed for inclusivity, it was made co-ed so that the organization didn't go bankrupt. The BSA had been running on fumes and wanted more members. Boy scout troops are still allowed to be boys-only if they want to.",
            "If only they could get pregnant abortions  would be so easy and legal to get anywhere in the US.",
            "> Either make beauty pageants for men and other genders,\n\nIsn't that exactly what bodybuilding is?",
            "What you mean is \"both sexes\"",
            "Agree. There is no physical advantage to being born male in a women’s beauty pageant. In fact, it is more likely to be a disadvantage. If you are outraged by this, you’re transphobic. I said it!",
            "Losing in sports competitions by objectively being worse and losing in a beauty contest that is not decided by any objective criteria are definitely the same thing, yeah.\n\nAs if there might be some hidden profit in selecting a specific type of a woman as a winner at these types of competitions... Nah, bollocks.",
            "Would what? Fuck, marry or kill?\n\nAnd honestly, because it’s fucking Reddit, I think the answer would be: “Yes”.",
            "Like most rightoids, they only care about people's rights when they can be used to punch down on groups they like even less. On most days women need to chained to the stove and bedpost, but then when a trans-woman shows up it's all about how much we care about womens rights.",
            "You're posting on reddit, you've already lost.",
            "Wey, stop with the victim mentality \n\nNo one's put to get you, you have no enemies, people ain't loosing because of this and neither you win anything with this",
            "It does present an unfair political advantage though. If it was a secret, do you think he'd win? Not bad looking but definitely not \"the most beautiful woman in America\".\n\nI'm a solid 5 and I've slept with women prettier than that.",
            "based",
            "Yes. True, my friend.",
            "trans people exist, cry about it.\n\ntransgenderism is caused when a person has a brain structure that is more similar to the one of the opposite sex than the one they were born with. Sources:\n\n[Regional gray matter variation in male-to-female transsexualism](https://pubmed.ncbi.nlm.nih.gov/19341803/)\n\n[Male-to-female transsexuals have female neuron numbers in a limbic nucleus](https://pubmed.ncbi.nlm.nih.gov/10843193/)\n\n[A sex difference in the human brain and its relation to transsexuality](https://pubmed.ncbi.nlm.nih.gov/7477289/)",
            "Not really. She's not ugly but I can confidently say you could find a prettier woman working a McDonald's in Maryland and you wouldn't have to look that hard.",
            "There's some pictures of her in the comments \n\nPersonally I see her as an 8, but maybe that's because I like more the conservative boobs, low height look",
            "What are those things?",
            "It’s not about being “left or right” at this point; this is just about falsehood and lies dominating over rationality.\n\nAnd in my personal opinion (which is nowhere near to be the absolute truth), “she”’s a 7 at best; look at the hands, for example.",
            "She passes though fr fr",
            "Who gives a shit?",
            "And?",
            "You're a commie",
            "lol is anything that doesn’t affirm your fragile and detached world view “transphobia”?",
            "Can't adult females have anything to themselves?",
            "Odd that “women” seem to have such an easy pass in almost all athletic sports, only rivaled by other “women”.\n\nNah but fr, I can get behind a Trans woman winning a beauty contest provided the ruling was genuine, since it’s an equal playing field.\n\nBut biological men competing in womens sports, blowing cis women (who were already fairly insecure about their strength compared to men) out of the water, depriving them of what little recognition for physical prowess they can get… I can’t support that.",
            "Please just stafu",
            "What makes them women...?",
            "No",
            "Was gonna say this, but you’re already holding it down thank you for your service.",
            "*Rolls eyes into space*",
            "*The pharmaceutical industry liked this*",
            "Unflaired and wrong. Fuck off.",
            "https://preview.redd.it/uh54c5ummz7d1.jpeg?width=640&format=pjpg&auto=webp&s=43b1b0fe382fec107b5317680d6e90cd014f2907",
            "Minor spelling mistake detected, opinion discarded",
            "How are they women?",
            "I agree but FLAIR UUUUP",
            "The only thing more cringe than changing one's flair is not having one. You are cringe.\n\n[BasedCount Profile](https://basedcount.com/u/devils_owner) - [FAQ](https://www.reddit.com/user/flairchange_bot/comments/uf7kuy/bip_bop) - [How to flair](https://www.reddit.com/r/PoliticalCompassMemes/wiki/index/flair/)\n\n^(I am a bot, my mission is to spot cringe flair changers. If you want to check another user's flair history write) **^(!flairs u/<name>)** ^(in a comment.)",
            "https://preview.redd.it/pp0h4ynz728d1.jpeg?width=897&format=pjpg&auto=webp&s=5c9f59a9d1915d2d7ef37e07c2b85027bd60ef97",
            "L",
            "See that character in the bottom left corner of the meme? That character represents you",
            "Flair up!",
            "https://preview.redd.it/w0dvyu4y728d1.jpeg?width=897&format=pjpg&auto=webp&s=39d4ba7b6ac0489d09e39346fabd53a4778d0f9b",
            "I think I first heard a version of it from a standup comic referencing Bruce/Caitlyn Jenner getting woman of the year immediately after transitioning. \n\nThen there was that trans Canadian powerlifter asking why women were so bad a bench press. \n\nWe just need men to start winning all the women's contests - all the awards - and watch how quickly it stops being considered progressive.",
            "Are we not already there?",
            "Astolfo gets my Jimmies going",
            "Already there. Women's sports is a good example.",
            "Now pretty much, more and more “trans” athletes are entering the female scene and now they enter the beauty competitions and win too",
            "Some men can makeup to be beautiful like a women. I don't think it will be long before it become reality. \n\n\nWhat next? Men become the best bed partner for men? \n\n\n/s",
            "u/coyote477123's Based Count has increased by 1. Their Based Count is now 5.\n\nCongratulations, u/coyote477123! You have ranked up to Sapling! You are not particularly strong but you are at least likely to handle a steady breeze.\n\nPills: [3 | View pills](https://basedcount.com/u/coyote477123/)\n\nCompass: This user does not have a compass on record. Add compass to profile by replying with /mycompass politicalcompass.org url or sapplyvalues.github.io url.\n\n\n\nI am a bot. Reply /info for more info.",
            "There's two sides to that coin. Men make up both extremities. Feminists keep talking about how the top 1% wealthiest people are 90% men. \n\nThey don't ever talk about how the bottom 1% of wealthiest people are also men. How many homeless women do you see, compared to men ? \n\nBut yeah, people focus on the top humans, and therefore they see mostly men and think \"Wow, men must be so privileged. \".",
            "It's 2033, you come home from your Amazon warehouse job to your Blackrock owned apartment. Your government provided femboy wife is ODing from government supplied fentanyl. You grab one of your government provided narcans and resuscitate her. This is the 3rd time this week. You are actually happy.",
            "Ong 💯",
            "Actually it’s a fedora",
            "sometimes best girl ain't even a girl",
            "Miss Maryland judges said so tho.",
            "We should hold a contest about it and see who wi-\n\nOh.",
            "Child ones, sure, but if adults wanna do that, who cares, let em.",
            "inb4 trans child beauty pageants",
            "u/Swedish_Royalist's Based Count has increased by 1. Their Based Count is now 65.\n\nRank: Concrete Foundation\n\nPills: [41 | View pills](https://basedcount.com/u/Swedish_Royalist/)\n\nCompass: This user does not have a compass on record. Add compass to profile by replying with /mycompass politicalcompass.org url or sapplyvalues.github.io url.\n\n\n\nI am a bot. Reply /info for more info.",
            "\"Beauty contests\" as a whole are largely despicable. In both men's and women's, they promote utterly inhuman features as \"ideal\", and screw with mainstream society's expectations of beauty. \n\nIn women's, it fucks with how women view themselves. They see these winners, and a substantial amount of them feel inferior as a result. Intense pressure is placed upon the contestants which results in mental breaks. It also tends to be biased towards more European features, which sucks for a lot of people. Also it's mostly a way to advertise beauty products. \n\nIn men's, all of them are post-human abominations. They have so much muscle they look like they're covered in tumours. Intense pressure is placed upon the contestants which results in serious physical injury. Also it's mostly a way to advertise protein packages. \n\nFor the kids ones, it's especially messed up. They're dragged into this by their mothers who want to live through their children, and feel that their child is nothing but a toy with which to dress up. Horrible for a kid's mental well-being.",
            ">This is a friendly reminder to HAVE YOUR FRICKIN' FLAIR UP!\n\n***\n\n [**[[Guide]]**](https://imgur.com/gallery/IkTAlF2) ^^|| ^( *beep boop. Reply with good bot if you think I'm doing well :D, bad bot otherwise*)",
            "The word you're looking for is \"cringe.\"",
            "u/Jpowmoneyprinter's Based Count has increased by 1. Their Based Count is now 5.\n\nCongratulations, u/Jpowmoneyprinter! You have ranked up to Sapling! You are not particularly strong but you are at least likely to handle a steady breeze.\n\nPills: [1 | View pills](https://basedcount.com/u/Jpowmoneyprinter/)\n\nCompass: This user does not have a compass on record. Add compass to profile by replying with /mycompass politicalcompass.org url or sapplyvalues.github.io url.\n\n\n\nI am a bot. Reply /info for more info.",
            "For some. For most, no.",
            "Better at being a pretty thing for men to ogle at? No, not really. In fact, I'd probably feel really awkward if I did win something like that - I mean, did I really deserve that? Because it feels like it mostly depends on the whims of the judges, since beauty is inherently subjective.\n\nI'd much rather win a nobel prize. It's something I *did* and it matters to humanity much more than brief, mindless entertainment and possibly spawning insecurities.",
            "Alas, if you had ever left your basement before this question may have answered itself…",
            "No. It's all nepotism anyway. \n\nThese Pangents are gearing more toward accomplishments and not looks now. So those might actually mean something. Even if it's pretty minor. I would rather be a MacArthur fellow.",
            "If we knew anything about women we wouldn't be on this subreddit",
            "Theres a shocking amount of women who have absolutely no idea on this",
            "Yeah I agree and its a fair point",
            "most women are supportive of these kind of things though\n\nsure there are people like you who dont support it, but there are plenty examples of women (even teammates) sticking up for this stuff.",
            "It should be noted that nearly every major regulated sports league has two divisions: open and women’s. What people think are men’s divisions are just open divisions.\n\nThis just seems like turning the women’s league into the open league with extra steps.",
            "Well you're a minority.",
            "This is the correct take.",
            "I also agree men shouldn't participate in women's beauty pageants, glad one didn't",
            "> It actively kicks women out of trophies, team positions, scholarships, etc.\n\nDoes it? There's an approximately equal number of trans men as trans women, so if everyone were able to transition freely they'd just be taking each other's place in those events.",
            "Personally if the people in charge of those competitions and the women are ok with than I don't see an issue\n\nOf course if tons of women are speaking against it they need to heard instead of written off as just bigots",
            "Exactly. Wolf in sheeps clothing is a deceptive predator, sheepnin wolves clothing is all baahrk no baahite.",
            "L take tbh",
            "Doesn’t make it any less stupid my guy 🤷‍♂️ sorry, not sorry",
            "Leftist empathy means, playing into people's delusions, so it's fine to deny reality.",
            "That’s me with the right and gun control. I don’t really want to vote for democrats or republicans but at least one of them isn’t trying to take my guns from me.",
            "Charge the rapist with the murder charge* if the girl chooses to abort.  \n*\\*I do not know the details of exactly what charge is being pushed toward women getting abortion but if you need charge someone, charge the rapist with involuntary man slaughter or something. Also rape, obviously.*",
            "Thats the problem with the two problems system, to naby people dont fully agree with the ideologies of both parties. So they have to choose if they webt abortions or anti migration.",
            "The pro-life logic is that because the unborn is biologically human, they have the same rights as you do. Therefore it's wrong to kill them unless it has to be done to save the mother's life (though some pro-lifers will make exceptions for rape regardless).\n\nBeing pregnant at 9 years old is a tragedy and the pedo uncle deserves to have the book thrown at him, but the unborn don't deserve to die just because they were the product of rape. I would still hesitate to criminally charge the girl because I doubt a 9 year old really consented to an abortion in the first place. Even if she did, being raped and... well, 9 years old should be strong mitigating factors in court.\n\nEven so, placing intrinsic value on human life, and the consequences thereof, are a preferable alternative to \"men can get pregnant\".",
            "Tbh that’s sorta where I’m at, I lean right on a vast majority of things but abortion is the one where I would be considered left, I just don’t see it as something that affects me. Not to mention that if the right ever wants to have an actual shot at winning offices consistently they may wanna loosen up their views on abortion or they’re forever gonna have the vast majority of women against them.",
            "Go get some flair ya fuckin mouth breather.",
            "Huh? what do politicians have to do with beauty pageants lmao.\n\nThis is the type of decision that needs to be made by whatever body organizes these pageants.\n\n> There, I said a reasonable thing but without breaking our community's sacred agreement, you're fucking welcome you gentrificator outsider",
            "Hands,  arms, shoulders, hips and jaws never lie. (Yes there are women that have masculine features on these body parts but never all of them or more than one or two. Natural estrogen since birth is strong shit)\n\nYeah He looks LIKE a woman but still off.",
            "https://preview.redd.it/w7cy5wm6028d1.jpeg?width=1179&format=pjpg&auto=webp&s=d9ea50db82b89b2e1a38360bf66bfbafa65659bd",
            "Yeah, but only because half the other contestants in these things have even more cosmetic surgeries than her.",
            "Lmfao why do so many people boil women down to nothing but their looks?",
            "Idk man, it takes some serious balls to do a contest like this.",
            "Did you just change your flair, u/Duke_of_Lombardy? Last time I checked you were a **Centrist** on 2021-11-28. How come now you are an **AuthRight**? Have you perhaps shifted your ideals? Because that's cringe, you know?\n\nRemember, the jannies are always watching. No gamer words, no statistics and by all means no wood cutting machines. Tell us, how are you going to flair the new account you'll make in two weeks?\n\n[BasedCount Profile](https://basedcount.com/u/Duke_of_Lombardy) - [FAQ](https://www.reddit.com/user/flairchange_bot/comments/uf7kuy/bip_bop) - [Leaderboard](https://basedcount.com/leaderboard?q=flairs)\n\n^(I am a bot, my mission is to spot cringe flair changers. If you want to check another user's flair history write) **^(!flairs u/<name>)** ^(in a comment.)",
            "Most of the downvoters would drag their balls across broken glass just to lick the dick of the last man who fucked her. (If they didn't know she was trans)",
            "You've never seen Maryland",
            "It is a beauty contest, not a breeding contest, so doesn't matter.",
            "Yes she is.",
            "WTF are you on about? This whole thing is about a trans winning a beauty pageant, and half of your replies are just \"YEAH, BUT ABORTION!\" Are you capable of forming a single thought without a whataboutism?",
            "Not at all. There’s no modeling of anything except poses & speedos, no clothes changes or anything. There’s no questions asked of the competitors.\n\nCome to think of it, they should have a part of the competition where the bodybuilders are asked pageant style questions. It’d make for more meme worthy content.",
            "I guess?",
            "I agree. I feel like some are just using it as an excuse to be angry when they would never be thinking about this otherwise. I don't see the harm. Have a good night!",
            "Pretty is pretty...",
            "Same reddit avatar!\nWe are both naked together.",
            "> Fuck, marry or kill\n\nYes, probably not, almost certainly not.",
            "I'm a centrist too",
            "There are mental traits specific to sexes sounds like gender essentialism to me 👀",
            "[deleted]",
            "So... she basically fits whatever weird-ass credentials beauty pageants use",
            "https://preview.redd.it/tf3cj2e7jz7d1.jpeg?width=760&format=pjpg&auto=webp&s=9204d5d07d8d1a7601025800e8227271f68f0367\n\nThat's probably the most reddit comment you've ever made.",
            "Yes? When people disagree with me about trans people having equal rights as their cis counterparts, for an example, that is definitionally transphobia. You got that 100% correct.",
            "Flair up!",
            "Do the research. After hormones the effects on the body make the playing field equal",
            "Nah I’m good",
            "Seriously just stfu and go somewhere else...",
            "Because gender is something you’re born with and can’t change. It just doesn’t always align with your biological sex. If I could be cis I would. That’s just ain’t how it works tho",
            "Please let me know what I did? I'm bad at writing and reading. I have a learning disorder so I'm not always correct in that area",
            "Because they identify that way. Not everyone with gender dysphoria is transgender and not every transgender has gender dysphoria. It’s an accepted treatment. Your proposed alternative is conversion therapy which is immoral and ineffective. Guess what isn’t ineffective? Transitioning surgery.\n\nOh also not all transgenders qualify for hormones and surgery for either health reasons or cost reasons or just lack or need because like I said not everyone has gender dysphoria.",
            "Just call yourself an extremist conservative who’s too afraid to say, centrist is such a lazy cop out.",
            "South park did an episode on this where PC principles wife trains really hard for a competition and gets outdone by a macho man randy savage clone who says he's a woman. \n\nThey of course want to remain PC , but they realise how dumb all this shit is",
            "Bro that’s been like 10 years 😭💀\n\n(Holy fuck I’m old)",
            "It’ll keep being progressive because women are probably the lowest on the oppression totem pole.",
            "I doubt it'll ever stop being progressive, for two reasons.\n\n1. Progressives were never going to win any sort of these competitions and so they care if these competitions get destroyed.  When is the last time a progressive won a beauty contest or sports competition?\n\n2. Progressives really seem to see biological women as inherently conservative which means they hate them.",
            "AYYEEEEE 💀 good reference ☠️",
            "More male geniuses; more male idiots",
            "They just love to focus on whatever furthers their agenda.",
            "Thats because there are way more men who will house a gross woman just to fuck her than there are women who will house gross men just to fuck them. Selling your ass is pretty much a sellers market.",
            "What a beautiful future, this is what the founding fathers intended",
            "> Best girl right there\n\n> Astolfo is a guy\n\n> Did I fuckin' stutter?",
            "Lol",
            "There are ones like National American Miss which is not a beauty contest, but more like a personality/talent contest.\n\nOf course now they've gotten a lot of negative attention recently because a fat woman won. Good times.",
            "I see. Its not quite the same as sports and competition because the goal is arbitrary and theoretical. The idea of beauty shifts as easily as the wind and, as the saying goes, is in the eyes of the beholder. I can see how that could be damaging to people's mindset. Thank you.",
            "You look at the extremes of humanity and are disgusted, pulling everyone back to average is very in character for a centrist. These people nearly kill themselves in their goal to be the peak human in a narrow field, their dedication should be rewarded.",
            "That's why i have a cute South African Boyfriend\n\nWomen can go fuck themselves, while i fuck my Boywife",
            "It's always the truth that hurts the most.",
            "This is why I'm much more in support of simply having a third, \"open\" category for anyone and everyone that either doesn't assign themselves to their birth gender or simply doesn't want to compete in it. That way trans people don't have to compete under labels they don't want to compete under, and biological men don't push biological women out of competitions. It seems like pretty much the perfect compromise to me.",
            "Well yeah, of course the teammates would. It gives them a better shot at winning",
            "A biological man competing with biological females in anything physical has got a pretty big advantage though; while the opposite isn't true.",
            "I agree, the writing off as bigots for any sort of questioning, especially with some fairly new issues, is ridiculous and gets us nowhere. Really the opposite of progression because all freedom of thought, discussion and growth is shut down.",
            "The L take is being transphobic. There's literally no reason for it.",
            "I don’t think any American has voted actually in support of a politician rather than just the lesser bad since Jefferson.",
            ">Charge the rapist with the murder charge\\* if the girl chooses to abort.\n\nBased and solution to the abortion debate pilled",
            "Holy fucking based\n\nCharge the rapist with the murder. Good god damn, that's a fuckin good idea.",
            "Alot of people are single issue voters, I know people who hate the Republicans to death but only vote for them because of gun rights\n\nLikewise I know people who hate the Democrats and only vote for them because pro choice\n\nI am one person who really doesn't like the Democrats right now but I am only voting for Biden because Trump/MAGA seems adamant about throwing Ukraine under the bus, and I just can't get behind supporting Putin and Russia as a Polish American",
            ">The pro-life logic is that because the unborn is biologically human, they have the same rights as you do. Therefore it's wrong to kill them unless it has to be done to save the mother's life (though some pro-lifers will make exceptions for rape regardless).\n\nOk but you can't deny the Ohio AG pursuing murder charges because a 9 year old went to Indiana to get an abortion instead of having their pedophile uncles baby is some braindead optics and probably a major reason women are not voting for you, I don't give a shit about your opinion that a puddle of cum on the floor is actually human\n\n>I would still hesitate to criminally charge the girl because I doubt a 9 year old really consented to an abortion in the first place. Even if she did, being raped and... well, 9 years old should be strong mitigating factors in court.\n\nA 9 year old should have never had this shit forced upon them in the first place let alone a fucking murder charge because our politicians are all schizos\n\n>Even so, placing intrinsic value on human life, and the consequences thereof, are a preferable alternative to \"men can get pregnant\".\n\nOnes a stupid as fuck opinion from stupid as fuck leftoids, the other is giving a 9 year old murder charges for not having their pedo uncles baby\n\nIf you come to any conclusion except the latter being worse you are actually just a shitty person and someone the FBI should probably check the HDD of and it is not because of your politics",
            "And this is where the discussion breaks down, because your view is perfectly understandable and I agree with it. But I also agree with the 9 year old being able to get an abortion. \n\nPeople drive the argument to these edge cases because that’s where they get to dig their heels in. In real life, the situation you’re referring to is a vanishingly small % of a %. \n\nIf you ask either side “ok would you support drawing the line at X edge case?” You’ll filter out the zealots pretty fast and land somewhere in the “available but rare” where most normal people sit.",
            "Flair up or I'm gonna make you wish your grandma time traveled and became your great uncle.",
            "I am a swing voter currently leaning towards Biden but all the Dems have to do to really sell me is border wall, secure border\n\nBut if the Republicans want my vote get more moderate views on abortion and maybe be a little less anti Ukraine and I will happily switch",
            "This was a Beauty pageant you know, they are in fact predominantly about looks.",
            "Because that an external factor when judging? If i saw a person with beard and hair chest i will guess its a men as first impression.\n\nWhat the problem?",
            "women don't have what it takes and the balls to win like this",
            "I did.",
            "Their beauty is still higher than their driving skills.",
            "Unless you're any of the women that lost to them.  Which is all of them...",
            "This is a woman's\\* beauty contest",
            "Well one was about women's bodies, the other was questioning why women still voted for people supporting this and I answered. It wasn't whataboutism, we weren't arguing or debating anything. Do you know what whataboutism is? You should learn before you accuse people of ir. The topic is women's bodies and biology vs trans men vs biological women, how the hell would pregnancy be unrelated? Maybe don't be so triggered and blame other people for your sensitivities",
            "Your eyes are greyer; we are not the same, sadly :(",
            "I don't know what their criteria is but usually when you see the winner it's like \"oh yeah, I get it\". This time, that isn't the case.",
            "Having personal preferences is a “reddit” thing now? Okay then.",
            "Lmao yes I'm sure the 6'6 250lb \"\"\"\"woman\"\"\"\" is just as weak as the 5'3 95lb woman next to him after some hormones.",
            "Lol no, not even close",
            "Ok trans women =/= women boom owned",
            "It can’t change? What about gender fluid?",
            "...What?\nStop putting modern gender theory down my throat",
            "(The man who invented gender identity was a pedophile who performed surgery on kids)",
            "In context of your sentence, it would be moot, not mute",
            "So... calling yourself a woman makes you a woman?\n\nAlso, it's an accepted treatment because it makes money...",
            "Oh my god lmfao\n\nAm i a fascist too?\n\nYou got to be trolling me...",
            "How long ago did they air that again??",
            "OMD thanks for that reference 💀 SP is once again an oracle",
            "The funniest part about this was all the leftists, including those on reddit, having to hate south park.  In their normal fashion they had to pretend that is always sucked and I've even see people calling it fascist.",
            "Until a transwoman dominates a minority women's space.  Wonder what the WNBA's rules are on this.",
            "actually unironically true, in nearly every category men are a flatter bell curve",
            "Talent contests are different things to beauty contests. A lot of the time, they're crap, but sometimes it can show off the best in humanity. \n\nBeauty contests do not, and I despise them for it.",
            "You see, this is a widespread cultural attitude where *all* hard work is good, and we rarely stop to ask what we are working towards, and if it's even worth it.\n\nThis is grind culture. It's mindlessly slogging through a useless course. It's viciously climbing over others for promotions at the office. It's plotting your vigilante vengeance on someone that hurt you decades ago. It's staying loyal to the firing squad so that your comrades don't have to murder innocent men alone.\n\nWorking hard to achieve beauty standards that actively contribute to widespread female depression and suicide rates is not a good thing.\n\nWorking hard to build muscle to be little more than a promotional model for chemical protein poison is not a good thing.\n\nWorking hard towards something bad is not commendable.",
            "Hold on their buddy we are talking politics\n\nWe don't say the C word here, \"Compromise\"",
            "That already exists. There's no such thing as men's football or men's swimming or men's 800 metre, it's just football and swimming and 800 metre, and women have their own leagues because they can't physically compete with men on equal footing. There is no rule stopping male teams from signing women, they'd just be stupid to do it.",
            "Sure, just points to ulterior motives, not logic or fairness.",
            "Trans men will often have higher natural t-levels than cis women, but we don't consider it unfair for them to share a field together. As long as a trans person has been on HRT or puberty blockers for a sufficient length of time, there should be less of a quantifiable advantage.",
            "Yeah, the sports thing is one of those for me. I think the people who hate trans people get lumped in with the people who have genuine concerns about the effect of biological differences, especially for people who haven't been on hormone replacement for a long period of time.\n\nLike, personally, I think we should wait until there's more conclusive research on the physical differences between trans women/cis women. If the research says that there's no difference in strength and physical capability, then I have no issue with trans women competing in women's sports. But if the research concludes that the inherent biological advantage isn't entirely negated by hormone replacement, then I personally wouldn't support it. \n\nAnd if the latter case is true, then I do genuinely feel sorry for the trans athletes who won't be able to compete due to something they have no control over. It's annoying being told I hate trans people because I think we should conclusively determine how different the physical capabilities of trans/cis women are. \n\nAnd from what some of my trans/nonbinary friends have told me, even they aren't allowed to have a more neutral opinion on topics like the sports stuff. If they don't 100% support allowing trans women to compete with cis women entirely because they're concerned with how fair it would be, people accuse them of being bootlickers/self hating/etc (and this isn't the only topic that has resulted in that for them). \n\nIt feels like most discussions about the topic are incredibly extreme and black and white. If you have a slight difference of opinion, despite agreeing on a more general level, then you're actually an evil bigot. It's so tiring. I'm queer and I've also been called a self hating bootlicker on multiple occasions for slight differences of opinions, and it's just. so incredibly annoying.",
            "The solution to the “what about rape” retort has and always will be to just kill him.",
            "I second this. Total 4D chess move politically.",
            "based",
            "based as fuck honestly",
            "Pff like I remember how to flair",
            "Sure but that’s not the point I’m making.  The point is that just because you can’t tell it’s not a woman by just by looking doesn’t mean it is a woman and that the defining characteristics of what a woman aren’t just whatever has long hair and tits.",
            "Based",
            "Give them participation trophies.",
            "They probably wouldnt want to lose to a Cis woman either, so I guess, we should declare everyone winner, so no one feels bad.",
            "As you care so much, without googling, who was second place?",
            ":(",
            "No but rating women with a number is",
            "Yes. She would be. Do the research instead of assuming",
            "Good point. Gender fluid people do have their gender change but it is still outside of their control",
            "Are you fucking kidding me\n\nFuck off of PCM and go to your normal normie subs",
            "Yea that one....",
            "What’s the regret rate on transitioning again babydoll? I want you to give it to me.",
            "I mean to be doing a one trick pony so far into life a bit yeah. I like to think of them more like slutty lazy Nazis though because it used to be that people needed a gun held to their head to be this hateful.",
            "November 2019",
            "I mean even in 2019 it was obvious this shit was bound to happen",
            "The standard procedure is to trade a wanted international criminal for a middling player.",
            "It's the \"fuck it we ball\" mentality that got us at the top of the food chain.",
            "I don't like em either, but if people want to do them, then I don't think anyone should stop them.",
            "What’s gonna happen is the women’s divisions are going to allow transwomen to compete. Once transwomen start taking over, the leagues will eventually make a “born female” only division. Then after enough ciswomen switch over to that division, the original womens only division will be renamed the open division and combined with the “men’s” division (the original open division).\n\nThis is obviously the most progressive way to arrive at the most logical conclusion to this whole issue.",
            ">but we don't consider it unfair for them to share a field together\n\nYes, we do. Because it's not natural testosterone, it's exogenous",
            "I completely agree, and when it gets to the point where you're calling your allies bootlickers (I have also been called that by leftists) it's probably time to reevaluate. I think it's because younger people trend left so a lot of the voices we are hearing are incredibly immature. Which makes the rest of us look insane. They're not all to blame but it isn't helping.",
            "u/Duke_of_Lombardy's Based Count has increased by 1. Their Based Count is now 45.\n\nRank: Sumo Wrestler\n\nPills: [25 | View pills](https://basedcount.com/u/Duke_of_Lombardy/)\n\nCompass: This user does not have a compass on record. Add compass to profile by replying with /mycompass politicalcompass.org url or sapplyvalues.github.io url.\n\n\n\nI am a bot. Reply /info for more info.",
            "I don't need to be a fan of even invested in a thing to feel empathy for a person who lost a competition to a person who shouldn't have been in it to begin with.  \n\nI could flip this sentiment on it's head.  Since YOU care so much to let the trans person win, without googling, what was the last comp she was in and what did she place???\n\nYou don't need to be invested to have an opinion or understand how people feel about a thing.",
            "And? Would that be okay if they were a man? I’m not following.\n\nWe use numbers to rate people, objects and concepts we like because it gives logic to our collective thinking and makes it easier to understand things we otherwise wouldn’t. What’s so bad about it?",
            "But did you look at the hands?!?! \n\nTHE HANDS!!!",
            "Lmao them absolutely dominating every single sport proves that's a fucking lie",
            "The suicide rate doesn't improve after transitioning",
            "Get off twitter. For the love of god save yourself.",
            "So its been nearly 5 years and that joke has only become more widespread",
            "South Park has an uncanny ability to predict the future.",
            "Who thought it was a good idea to try to take weed into Russia.",
            "The last one she was probably in was the Miss Maryland itself. Do you know how these contests work? Like I'm just working off watching Miss Congeniality like a decade ago.",
            "I don't care",
            "They don’t tho. They dominated two sports those being swimming and cycling and that was because proper regulations to ensure fair competition were not out into place",
            "Also conversion therapy does actual damage to people so maybe try focusing on the weaponry if you’re going to claim hero to supposed victims",
            "It does and it’s not what I asked what’s the regret rate of transitioning? Compared to all other surgery on top of it",
            "Never have had one :3",
            "You mean proper regulations like not letting men pretend to be women?",
            "I dont know what is the regret rate, what is the regret rate?",
            "Less than 1%",
            "Source?"
        ]
    },
    "We all have that one person we prefer to keep at an arms length away from": {
        "title": "We all have that one person we prefer to keep at an arms length away from",
        "score": 38,
        "url": "https://i.redd.it/o5y6kkwad48d1.jpeg",
        "content": "",
        "num_comments": 5,
        "comments": [
            "libright-libleft unityposting",
            "Based and we hate Emily pilled",
            "Fr",
            "It's not necessarily a \"team\" thing as opposed to there will always be bad people who share your political views, which is one of the reasons I'm a centrist. It's the reason why we have tankie Auth-Lefts and unironically fascist Auth-Centers. In an odd way, I kind of appreciate these groups to an extent because they can provide flavor to an otherwise bland discussion and they also show an example to not be like them.",
            "u/Ok_Freedom1529's Based Count has increased by 1. Their Based Count is now 40.\n\nRank: Sumo Wrestler\n\nPills: [10 | View pills](https://basedcount.com/u/Ok_Freedom1529/)\n\nCompass: This user does not have a compass on record. Add compass to profile by replying with /mycompass politicalcompass.org url or sapplyvalues.github.io url.\n\n\n\nI am a bot. Reply /info for more info."
        ]
    }
}