{
    "Nabór na moderatorów /r/Polska": {
        "title": "Nabór na moderatorów /r/Polska",
        "score": 27,
        "url": "https://www.reddit.com/r/Polska/comments/14pbk8n/nabór_na_moderatorów_rpolska/",
        "content": "Cześć,\n\nr/Polska rośnie. Niedawno przekroczyliśmy próg 500k użytkowników. Wraz ze zwiększoną liczbą aktywnych członków /r/Polska potrzebuje także zwiększonej liczby aktywnych moderatorów.\n\n# Czym się zajmują moderatorzy?\n\nW 90% jest to egzekwowanie regulaminu poprzez zatwierdzanie lub usuwanie treści zgłaszanych przez użytkowników. Gdy już to wszystko jest nadrobione, można zajmować się ulepszaniem naszej społeczności - inicjatywami typu wymiany kulturowe, AMA lub owocowe czwartki.\n\n# Kto powinień zostać moderatorem?\n\nModeratorem powinna zostać osoba, która:\n\n* umie pracować w zespole i uszanować decyzję tego zespołu, nawet jeśli jest ona odmienna od jego/jej własnej,\n\n* spędza dużo czasu na /r/Polska i będzie aktywnie go moderowała,\n\n* zna regulamin /r/Polska ([link](https://www.reddit.com/r/Polska/wiki/rules/)).\n\nJeśli nigdy nie moderowałeś/aś lecz jesteś pewny/a swojej aktywności - śmiało zgłaszaj się. Obecni moderatorzy bez problemu nauczą Cię z czym to się je.\n\n# Jeżeli chcesz aplikować, proszę wypełnij i wyślij na naszą [pocztę moderatorską](https://www.reddit.com/message/compose?to=%2Fr%2FPolska&subject=&message=):\n\n* Ile czasu w tygodniu możesz poświęcić na moderowanie /r/Polska:\n* Czy masz doświadczenie w moderowaniu? Jeśli tak, to na jakich subredditach?\n* Ciekawe pomysły jakie masz na ulepszenie /r/Polska, które mógłbyś/mogłabyś wprowadzić w życie:\n* Pozostałe rzeczy o jakich chcesz wspomnieć:",
        "num_comments": 68,
        "comments": [
            "praca za darmo 💀",
            "[removed]",
            "Jestem bardzo fajna osoba z prawidlowym kompasem. Mysle, ze podolam temu zadaniu. Ten subreddit stanie sie fajniejszy, jezeli ja zostane moderatorem.\n\nhttps://preview.redd.it/qsj4wr7uzp3c1.jpeg?width=456&format=pjpg&auto=webp&s=80264bc27391ba724c5475cf2b491b1bd9196d35",
            "ok ile można zarobić za swój czas?",
            "Chętnych normalnie zatrzęsienie.",
            "[removed]",
            "Za darmo??",
            "Potrzebuje sprzęty mmmm\nDobra jakość na dobrą ilość",
            "Czemu ktoś miały to sobie robić i to za darmo!\n\na nie ok. są owocowe czwartki",
            "Praca w młodym dynamicznym zespole",
            "Protesty już się skończyły, to można poszukać nowych modów, byle takich żeby otwierali suba na żądanie kierownictwa Reddita na korzyść nowych akcjonariuszy.",
            "wokolis wyleciał?",
            "Kiedy wyniki?",
            "Trzeba przechodzić test na lewaka?",
            "[removed]",
            "Metka cebulowa czy łososiowa?",
            "[removed]",
            "sprzedam opla",
            "Czy oferta to dalej \"grożą śmiercią, ale generalnie warto\"?",
            "Nie wiem czy moje zgłoszenie z modmaila zaginęło, czy jest odrzucone, ale jako że nie dostałem żadnej odpowiedzi, to na wszelki wypadek zgłaszam się też tutaj. Chętnie pomogę \"doraźnie\" przy usuwaniu postów łamiących zasady, usuwaniu spamu itp, najobiektywniej jak się da. Prawie codziennie jestem z godzinkę czy dwie na Reddicie.",
            "Umowa zlecenie czy o dzieło?",
            "Gdzie owocowe czwartki frajery?",
            "Jestem stary, mam w dupie bycie modem, ale mogę pomóc.",
            "\\\\ \\[ removed \\\\ \\]",
            "i want to make peace between denmark and poland",
            " Moderator z reddita zarabia cokolwiek za tą pracę, czy to darmowa posada ku chwale reddita i wpływów z reklam dla reddita?",
            "Mam pytanie do modów i do kandydatów: po co?",
            "za darmo 💀💀💀",
            "A co sie stalo z naborem sprzed 2 miesiec? Ktos doszedl?",
            "A jest Multisport? A nie przecież reddit",
            "Twój post/komentarz został usunięty z następujących powodów:\n\n**Zasady /r/Polska**\n\n**[§ 7. Ataki osobiste na innych użytkowników](https://www.reddit.com/r/Polska/wiki/rules/#wiki_.A7_7._ataki_osobiste_na_innych_u.17Cytkownik.F3w)**\n\nNa subreddicie zabronione są: agresja słowna, inwektywy, chamstwo i prowadzenie nagonki wymierzone w innych użytkowników subreddita oraz pojedynczych użytkowników reddita.\n\n\n\nJeśli uważasz, że został on niesłusznie usunięty i ta sytuacja nie jest opisana na [Wiki](https://reddit.com/r/Polska/wiki/rules#wiki), [skontakuj się z moderatorami](https://reddit.com/message/compose/?to=/r/polska), a w treści dodaj link do usuniętej rzeczy.",
            "Twój post/komentarz został usunięty z następujących powodów:\n\n**Zasady /r/Polska**\n\n**[§ 7. Ataki osobiste na innych użytkowników](https://www.reddit.com/r/Polska/wiki/rules/#wiki_.A7_7._ataki_osobiste_na_innych_u.17Cytkownik.F3w)**\n\nNa subreddicie zabronione są: agresja słowna, inwektywy, chamstwo i prowadzenie nagonki wymierzone w innych użytkowników subreddita oraz pojedynczych użytkowników reddita.\n\n\n\nJeśli uważasz, że został on niesłusznie usunięty i ta sytuacja nie jest opisana na [Wiki](https://reddit.com/r/Polska/wiki/rules#wiki), [skontakuj się z moderatorami](https://reddit.com/message/compose/?to=/r/polska), a w treści dodaj link do usuniętej rzeczy.",
            "Ni chuja nie młodym, w gronie aktywnych moderatorów średnia wieku co pewnie grubo ponad 30 lat. Z dynamiką w tym wieku też już krucho ;)",
            "będziesz miał co dodać w cv jak skończysz podstawówkę więc nie narzekaj xD",
            "[removed]",
            "Twój post/komentarz został usunięty z następujących powodów:\n\n**Zasady /r/Polska**\n\n**[§ 8. Ograniczenie promocji](https://www.reddit.com/r/Polska/wiki/rules/#wiki_.A7_8._ograniczenie_promocji)**\n\n* Pozwalamy na promocję ze strony stałych i aktywnych członków naszej społeczności, która nie przekracza 10% aktywności na r/Polska.\n* Za promocję uznajemy także zamieszczanie ankiet do prac badawczych.\n* Zrzutki, petycje, kickstartery i oferty mające na celu pozyskanie korzyści finansowych są zabronione.\n\n\n\nJeśli uważasz, że został on niesłusznie usunięty i ta sytuacja nie jest opisana na [Wiki](https://reddit.com/r/Polska/wiki/rules#wiki), [skontakuj się z moderatorami](https://reddit.com/message/compose/?to=/r/polska), a w treści dodaj link do usuniętej rzeczy.",
            "Twój post/komentarz został usunięty z następujących powodów:\n\n**Zasady /r/Polska**\n\n**[§ 8. Ograniczenie promocji](https://www.reddit.com/r/Polska/wiki/rules/#wiki_.A7_8._ograniczenie_promocji)**\n\n* Pozwalamy na promocję ze strony stałych i aktywnych członków naszej społeczności, która nie przekracza 10% aktywności na r/Polska.\n* Za promocję uznajemy także zamieszczanie ankiet do prac badawczych.\n* Zrzutki, petycje, kickstartery i oferty mające na celu pozyskanie korzyści finansowych są zabronione.\n\n\n\nJeśli uważasz, że został on niesłusznie usunięty i ta sytuacja nie jest opisana na [Wiki](https://reddit.com/r/Polska/wiki/rules#wiki), [skontakuj się z moderatorami](https://reddit.com/message/compose/?to=/r/polska), a w treści dodaj link do usuniętej rzeczy.",
            "Grożenie śmiercią i wyzwiska to nieodłączna część pracy moderatora w internecie. Jak pod koniec lat 90tych byłem modem w jakiejś grupie dyskusyjnej to mi grozili śmiercią, jak 15 lat temu byłem modem na forum związanym z hobby na \"PHPbb by Przemo\" to mi grozili śmiercią, jak teraz jestem modem tutaj, to mi grożą śmiercią. Tak samo z wyzywaniem od faszystów i tak dalej. Tak było u zarania internetu i tak jest dalej. \n\nA czy warto? Jak się ma trochę wolnego czasu, na poklikanie tu czy tam i się lubi daną społeczność, to czemu nie. Benefitów z tego nie ma praktycznie żadnych. Działać dla społeczności można na wiele sposobów, można wrzucać dużo kontentu, można dużo komentować, a można być modem i sprzątać. Jeśli ktoś nie ma żadnego sentymentu do samej społeczności, to nie warto. I znowu, tak było zawsze. Kiedyś, jak panowały fora, to jak się zżyłeś z danym forum to było warto, jak wchodziłeś tylko żeby przeczytać co tam nowego w danej branży, to nie było warto. \n\nKwestie stare jak internet.",
            "Na akord",
            "U nas każdego dnia są świeże owocki!\n\n>!Pod warunkiem, że sam je sobie kupisz!<",
            "i am from the danish r/place discord",
            "pieniazde to nie, ale mozesz wyżywac się na innych ile chcesz, banować osoby ktore maja inne opinie niż ty itp",
            "Panie władza, możesz prześladować... ehm, usuwać komentarze koń'fidentów",
            "Idealna posada dla ludzi z kompleksem boga. Na subach popkulturowych obrywa się banem, jak zwrócisz uwagę, że usuwają negatywne treści dot. niektórych celebrytów albo filmów etc. xd",
            "A są w ogóle jakieś subreddity, gdzie moderatorzy dostają kasę? (pomijam jakieś ewentualne łapówki)",
            "https://www.youtube.com/embed/qdC_Cu9X4wc?start=6&end=8",
            "[https://www.youtube.com/watch?v=Us3\\_8FxoAls](https://www.youtube.com/watch?v=Us3_8FxoAls)",
            "miedzy bogiem a prawda, gratis to uczciwa cena",
            "/u/LitwinL",
            "Nie przesadzaj, mam 33 lata i jak siedzę w nieruchomo to nic nie boli ;)",
            "TL:DR nie warto :P Żeby nie było, to szanuje w opór moderacje, bo jest lepsza niż na n innych forach.",
            "ulubiony owoc moderatora? \n\n>!BANan!<",
            "To nie tutaj.",
            "uuu, już mam kurwiki w oczach, ale bym usuwał....",
            "Od reddita, jako pracownik, nie. \n\nAle może być jakiś subreddit, gdzie modami są pracownicy firmy, z która dany subreddit jest związany - coś w rodzaju subreddit aktora, gdzie modem jest jego agent.",
            "/u/Bielin_Clash hai",
            "👍",
            "wtf? jaka jest tego tajemnica?",
            "nie pamiętasz za co banowałeś w wątku o covid?",
            "![gif](giphy|icUEIrjnUuFCWDxFpU)",
            "Hmm... Pomidor?",
            "[siedzenie nieruchomo](https://youtu.be/hiQ3PrMt6z8)",
            "Zapewne za namawianie do zrobienia sobie krzywdy. Wątków o covid było wiele, musisz mi przypomnieć.",
            "Jak banował/a za foliarskie wysrywy o szczepionkach i plandemii to słusznie. Do niemoderowanych rozmów o spiskach są dedykowane fora polecam https://forum.davidicke.com/ jest tam nawet zakładka dedykowana COVID & NWO"
        ]
    },
    "We do a little trolling": {
        "title": "We do a little trolling",
        "score": 474,
        "url": "https://i.redd.it/qt29u6bh9y7d1.png",
        "content": "",
        "num_comments": 49,
        "comments": [
            "A potem słoik pękł i wszyscy na baczność odśpiewali YMCA",
            "&#x200B;\n\nhttps://preview.redd.it/5qxwo8k5c38d1.jpeg?width=400&format=pjpg&auto=webp&s=18558148e89f74bb76e34f8d7d7e1223423abb68",
            "Kierowca autobusu aż wstał by klaskać",
            "/r/ThisReallyHappened",
            "Potwierdzam, byłem tą farbą.",
            "Z cyklu „nigdy się nie wydarzyło ale fajnie się klika”",
            "Filia Zakładu Pogrzebowego Bytom. Od kopania dołków do szpachlowania ścian. Typowa kariera w Bytomiu 🤷🏼‍♂️",
            "potwierdzam bylam pedzlem",
            "I potem cała lewica przyszła do Zakładu Remontowego Bytom i każdy wręczył 1000zł i czekoladki a Zakład Remontowy Bytom stał się najbogatszą firmą na świecie i było super",
            "ratowanie świata? ten tryb w fortnite?",
            "\"Zakład Remontowy Bytom\" a ludzie w komentarzach w szoku że fejkowa historia XD No kurwa skądże, serio?",
            "https://preview.redd.it/0oh3i9fey38d1.jpeg?width=462&format=pjpg&auto=webp&s=1af58b35bafab1a028d2edd2c72180beea6f95e8\n\nUkryta papieżowa",
            "o, przegapiłem ten moment jak w Bytomiu zakład pogrzebowy ustąpił miejsca remontowemu",
            "To już drugi zakład z Bytomia z rigczem",
            "jakby widze ze ludzie chyba tu czegos nie lapia. \nto na 99% jest parody acocunt tak jak Zaklad Pogrzebowy A.S. Bytom.\nposmiejcie sie czasem, warto",
            "I potem kazdy zaczal klaskac",
            "Ciekawostka, tęcza to też symbol chrześcijański, Bóg dał ją ludzią jako znak przysięgi że już nikty nie powtórzy Potopu.",
            "Potwierdzam! Ja byłem tym gościem",
            "A potem przyleciał smok",
            "I to się kurwa nazywa intersekcjonalna świadomość klasowa 🤩\n\n(prawdziwość lub jej brak nie ma wpływu na to że przypowieść zacna)",
            "Jak to jest prawda to ja jestem królem. Swoją drogą klient nie mógłby się domagać reklamacji? No chyba że robione na czarno to ma wała i lewacką ścianę he he.",
            "ale chujostwo",
            "Poland for the win!",
            "Poland for the win!",
            "21RT 37QT 420♥️",
            "Genialne! Brawo!",
            "Trolling done right with a touch of humor!",
            "z wózka inwalidzkiego",
            "A był nim Albert Einstein",
            "Byłem tą ścianą, ładnie mnie pokryłeś",
            "Mogę być tą barwą obok ciebie?",
            "Potwierdzam, byłem pająkiem za lampą",
            "Potwierdzam, jestem \"21 37 420\" na dole posta",
            "Potwierdzam, mieszkałam w Bytomiu 10 lat, tak się tam dzieje.",
            "Niektórzy robią na dwa etaty. Tu i tu.",
            "https://preview.redd.it/nlswn6m7p38d1.jpeg?width=574&format=pjpg&auto=webp&s=e94b12faacd03bca7229b7de72f187ca6582a874",
            "r/2137",
            "Czemu to jest minusowane, przecież jest na dole posta XD",
            "brachu to się nie wydarzyło",
            "Tak, na pewno poświęcili kilka dniówek (bo malowanie pokoju, szczególnie w takim układzie, to nie jest roboa na godzinę), żeby zrobić dowcip, który zaraz dosłownie zostanie zamalowany, o kosztach farby nie wspomnę. XD",
            "O białej lasce",
            "Ze wzwodem",
            "No homo, bro.",
            "Juz sie domyslilem. A I tak sie usmialem",
            "I z okularami dla ślepych",
            "No homo.",
            "No (jasne, że) homo"
        ]
    },
    "Klienci są niemili dla sprzedawców w sklepach": {
        "title": "Klienci są niemili dla sprzedawców w sklepach",
        "score": 361,
        "url": "https://www.reddit.com/r/Polska/comments/1dlr453/klienci_są_niemili_dla_sprzedawców_w_sklepach/",
        "content": "Tldr; klienci niemili dla pracowników w sklepie\n\nOd paru miesięcy pracuję w sklepie z płazem w nazwie. Wczoraj miałam chyba swoją najgorszą zmianę. Było zakończenie roku szkolnego, jakiś mecz i po prostu piątek wieczór - długa kolejka od nieustannie od 17.00 do 23.00 (przy dwóch otwartych kasach). Tyle, ile ja się bluzgów nasłuchałam w moją stronę, to chyba nie zliczę XDDDD Że jestem zjebana, że za wolno się ruszam, że jestem spierdoloną kurwą z kasy, że czemu odchodzę od kasy (pewnie szlam po jakąś paczkę na zaplecze), żebym szybciej robiła jakieś jedzenie albo mam wypierdalać. 99% obelg to mężczyźni w wieku 18-45.\n\nNadal mam wrażenie, że ludzie nie wiedzą, że praca w sklepie to nie tylko stanie na kasie - towar nie pojawia się magicznie na półkach, cały czas jest coś do posprzątania, wypiekanie bułek, ogarnianie dostaw, wpisywanie wszystkiego do systemu - w ciągu zmiany trwającej ponad 8h można być najzwyczajniej zmęczonym, nie uśmiechnąć się do klienta, niechcący się pomylić w przeliczaniu reszty.\n\nCzemu niektórzy klienci nie traktują pracowników sklepu jak ludzi, tylko jak ściery do podłogi? Oprócz jakiegoś społecznego przekonania, że sprzedawca w sklepie to upadek człowieka i \"hehe panie z frog shop to tylko siedzą przed sklepem i palą fajki\".\n\nPS. Nie mam zamiaru zmieniać pracy, bo dorabiam sobie jako studentka i mam całkiem spoko współpracowników.",
        "num_comments": 137,
        "comments": [
            "Ludzie nie są niemili dla sprzedawców w sklepach. Ludzie są niemili dla ludzi. \nJest grupa buców, dla których życie to gra na jednego gracza a cała reszta ludzi to NPC. Śmiecą, niszczą, robią dramy. Ot, świat. \nTy - jako sprzedawca - wchodzisz w interakcję, więc statystycznie częściej nadziewasz się na takich ludzi. To wszystko.\n\nNie bierz tego osobiście. Hoduj pancerzyk na takich ludzi - przyda Ci się on na przestrzeni życia, bo potencjalnie dzięki niemu nie zabraknie Ci języka w ustach gdy spotkasz w realnej sytuacji kogoś niemiłego.",
            "Trafilas na sflustrowanych zjebow. Domyslam sie jakie to trudne i nieprzyjemne to znosic ale pomysl, ze to ludzie ktorych jedynym sukcesem w zyciu to postawienie sie wyzej niz sprzedawca w zabce. Wyjda z niej i wroca do swiata ktory nimi wyciera podlogi. A Ty skonczysz studia i z umiejetnoscia ciezkiej pracy zajdziesz daleko w zyciu.",
            "To niewiarygodne do czego ludzie myślą że mają prawo, bo wydają 15 złotych w sklepie",
            "Pracowałem w kilku sklepach, bardziej specjalistycznych i dzięki temu mogłem ominąć takich jełopów. Tak jak piszą wyżej, Żabki przyciągają takich ludzi, którzy myślą, że skoro oni w Żabce nie pracują - to są lepsi. Jedynie moi znajomi, którzy pracowali w Żabkach spotkali się z takim grubiaństwem.",
            "Mówi się,że klient ma zawsze rację. Statystyki jednak pokazują, że klient zazwyczaj gówno wie i jeszcze sapie 😀",
            "Bo ludzie lubią dawać upust swoim frustracjom, kompleksom i życiowym porażkom, na kimś kogo uważają za gorszego od siebie. \n\nW końcu jak sama nazwa \"sektor usługowy\" wskazuje, jesteś tam by im służyć, a sługi jaśnie państwo musi trzymać krótko, by się nie rozbestwiły /s",
            "Szanuję wszystkie Panie i wszystkich Panów pracujących w Żabce, bo wiem, że to pierwszy sklep gdzie ludzie na szybko idą kupić albo dokupić alkohol. Po alkoholu ludziom puszczają filtry i pokazują swoje twarze.",
            "Problem jest taki że nie ma pozwolenia na ostrzał chorego bydła. 😕",
            "Też pracowałem w handlu w branży RTV i zauważyłem że niektórzy nawet nic nie chcą kupić, a przychodzą żeby się wyżyć i pokazać jakąś wyższość a potem wyjść z pustymi rękami. Mam teorię że dostają opierdol w pracy ale nie mogą się postawić bo wylecą, więc przychodzą się wyżyć na sprzedawcy bo wiedzą że ten się nie postawi, bo straci pracę. Więc zasadniczo są nietykalni i to wykorzystują",
            "Od lat była wałkowana zasada \"klient nasz pan\" która niestety trwa do teraz i klienci wiedzą że mogą sobie pozwolić na takie coś (o ile nie ma ochrony) bo co zrobisz? Jak spróbujesz zwracać się do nich jak oni do ciebie to po prostu każą zawołać kierownika albo złoża skargę na ciebie a jak wiadomo, firmy prędzej staną po stronie klienta niż pracownika.\nJako pracownik sklepu jesteś praktycznie cały czas na straconej pozycji ponieważ jedynie co możesz robić to się uśmiechać, próbować to ignorować i wykonywać swoją pracę.",
            "Czasem czytam takie wpisy i wydaje mi się że żyje w jakimś alternatywnym świecie. U mnie wizyta w płazie to dzień dobry, karta proszę, nie mam aplikacji, dziękuję miłego dnia :). \n\nŻe dorośli ludzie się frustrują na stanie w kolejce, przecież ta frustracja nigdy nic nie zmienia.",
            "Nic dziwnego, spora część klientów żabki to patola.",
            "Kto pracowal w sklepie, ten sie w cyrku nie śmieje",
            "Rozumiem w stu procentach. Moja dziewczyna pracuje w małym sklepie spożywczym i ludzie to naprawdę są niedorozwinięci. Pomijając już bycie niemiłym czy wkurzającym, to niektórzy np noszą butelki w gaciach xD, niektórzy rzucają 100, 200, 500 I oczekują, że im rozmienisz od razu (bankomat jest dosłownie 50m obok). Nigdy nie zrozumiem skąd tacy ludzie się biorą.",
            "Mój protip. Pracuje na stacji benzynowej jako kierownik i sie nauczylem jednej rzeczy. Jezeli ktos Cie obraza, bierzesz koszyk z towarem ów osoby i grzecznie prosisz o opuszczenie sklepu i NIC nie sprzedajesz. Jak dalej fikaja - policja. Niech takie gnoje po prostu spierdalaja i tyle. Szkoda Twojego zdrowia i nie ma sensu sie stresowac i psuc humoru przez takich smieci. Nie obslugiwac i niech sobie ida dalej gdzie indziej kupowac towar.",
            ">Nadal mam wrażenie, że ludzie nie wiedzą, że praca w sklepie to nie tylko stanie na kasie\n\nTu nie chodzi o to, że oni nie wiedzą, tylko że najzwyczajniej mają to w dupie. \n\nNiejeden klient przy kasjerach, kelnerach i innych rodzajów obsługi klienta, czuje się jak szlachta i takiego traktowania będzie wymagał. Ich zdaniem sklep i cała jego obsługa jest dla nich. Jest ich przywilejem.\n\nNie pomaga też opinia, że pracownicy sklepu są prawie na dnie łańcucha pokarmowego, i robi się gorzej, bo dzięki pomocy komputerów praca kasjera jest coraz łatwiejsza do wykonywania i szybsza w nauce. \n\nŻarty o tym, że praca w obsłudze klienta sprawia, że traci się wiarę w ludzi, nie są przesadzone.",
            "Rozumiem i to jak bardzo XD Pracuję w supporcie klienckim jednej firmy. To jak ludzie ciskają w nas najgorszymi obelgami i drą japy przez telefon, są opryskliwi i złośliwi przechodzi jakiekolwiek pojęcie. Nie widzą nas, więc prawdopodobnie mają przekonanie, że z powodzeniem możemy być ich workami do bicia i wyżywania się, kiedy mamy bardzo mało czasu założonego przez firmę na odpowiedź i jak mówimy, że czegoś nie możemy zrobić, to nie możemy, bo zabraniają tego procedury. Można nas jebać i opluwać. XD Widziałam w tym grajdole cały przekrój społeczny i rzadko kto jest życzliwy. \n\nTaka prośba do ogółu społeczeństwa - kiedy do nas (jako grupy zawodowej w różnych firmach) piszecie maile, wiadomości na czacie/dzwonicie, na ogół sami jesteśmy psychicznie wykończeni słuchaniem różnych obrzydliwych rzeczy na nasz temat. Najczęściej nie załatwiamy tylko waszej sprawy, musimy robić wiele rzeczy na raz. Nie chcemy wam zrobić na złość ani niczego wcisnąć. Stresujemy się, bardzo chcemy, żeby klient był zadowolony i nie jechał po nas jeszcze bardziej. Jeśli czegoś nie możemy zrobić, to nie możemy i od tego nie ma ustępstw. Za nieprzestrzeganie procedur czekają nas konsekwencje. Zarabiamy najniższą krajową, a za pogorszenie wyników w związku z takimi naruszeniami możemy tę pracę stracić. Większość z nas to młode osoby, które dopiero startują w dorosłość. Z tego zajęcia nie pokryjemy sobie również terapii, która na serio może wiele zmienić przy takiej formie pracy i stresie. Nie mamy wobec was złych zamiarów, ani interesu w tym, żeby wam odmawiać, co wam należne. Ale nie jesteśmy bogami, tylko małymi trybikami i na wiele rzeczy zupełnie nie mamy wpływu. Bądźmy dla siebie życzliwi, niezależnie od tego, czy jako klienci rozmawiamy z takim ekspedientem w dyskoncie czy helpdeskiem.",
            "Wiele osób też nie pracowało w dziale usługowym, gdzie muszą obsługiwać klienta i wtedy na nich jest kurwione, więc nie zdają sobie sprawy jakimi zjebami są zachowując się w taki sposób.",
            "Ależ w czym problem, ruszaj się szybciej i nie chodź na zaplecze.\n\nI, towar nie tylko magicznie pojawia się na półkach, ale np. u mnie w domu też magicznie robi się pranie i brud znika z podłogi.\n\nJeżeli ktoś wziął ten komentarz na poważnie, to zawiadamiam, że on nie jest na poważnie",
            "Ludzie sa zjebani",
            "Szczerze podziwiam sprzedawców bo wiem że nie mam w sobie tyle spokoju i skończyłoby się to jak\n\n![gif](giphy|vxvNnIYFcYqEE)",
            "Za takie coś powinna być odmowa obsługi i nakaz wyjścia ze sklepu. Ale jak wiadomo panuje zasada \"klient nasz pan\".",
            "Stałem kiedyś w kolejce w sklepie z insektem w nazwie, w popularnej, turystycznej miejscowości nad morzem. Przede mną ok. 40 letni typ z konkubiną (może żona), zanim dotarł do kasy już poleciało kilka komentarzy, ale jak kasjerka (miała plakietkę \"Uczę się\") kasowała jego towary, to się odpalił na całego. Miarka się przebrała i dostał ode mnie zjeby. Szybko się zamknął, spakował towar, zapłacił i uciekł ze sklepu.\nNienawidzę takich cwaniaczków i zawsze reaguję, bo kasjerki same nie bardzo mogą.",
            "Margines społeczny jako klientela i całkowity brak wsparcia korporacji z płazem w logo czy właściciela sklepu.\nPowinnaś mieć prawo, i wsparcie, żeby taką osobę wy*ebac że sklepu. No ale w Polsce jak w lesie.\nW UK na każdym kroku widzę plakaty 'zero tolerancji dla agresji wobec naszych pracowników', na zapleczu postery o mobbingu, depresji, zaburzeniach lękowych, itp.\n\nI na sprawa, że niektórzy ludzie, często podświadomie, tak sobie własną samoocenę poprawiają. Tak zwana hierarchia dziobania.",
            "Ja nigdy nie byłem nie miły dla osoby wykonywujaca jakakolwiek prace, bo niby czemu (no ok, byly wyjatki ale i tak zadnych wyziwsk nie bylo).\nBa, w wiekszosci miejsc w ktorych regularnie robilem zakupy po jakims czasie sobie nawet gadalem z nimi normalnie, a nawet z jedna dziewczyna wymienilem się kontaktami. Bycie miłym nic bie kosztuje a moze sprawic że poprawimy komuś dzień.",
            "Ja pracuję w obsłudze klienta i nie wyznaję zasady klient nasz pan. Jak się coś nie podoba to wypraszam ze sklepu i po prostu nie obsługuję takiego idioty. Jak mnie wyzywa to ja nie pozostaję dłużny. Obroty mi nie spadły, a głowa spokojniejsza. Ci zadymiarze i tak zazwyczaj wracają i kupują grzecznie to co mieli kupić. Polecam takie podejście.",
            "Ja bardzo krotko pracowalam na kasie, ale to nie bylo mile, zawsze trafi sie jakis zjeb, dlatego tez mam szacunek do wszystkich ludzi pracujacych z klientem. Zawsze staram sie mowic dziekuje i zyczyc milego dnia - i naprawde mam nadzieje ze taka kasjerka bedzie miala dobry dzien. Spoleczenstwo polega na wszystkich zawodach tylko my ludzie jakos w glowach zesraliamy sie ze nasza praca jest najwazniejsza bo... No i co moze i wazna ale ktos musi towar na polki wsadzic, ktos smieci wywiesc a ktos inny poplywac w sciekach. Kazdy zawod to trybik w naszym zyciu i mimo iz my z jakis uslug nie korzystamy to no, moze nasz mechanik juz tak. A pozatym wyzywanie sie na ludziach bo sa pod reka to czysty neandertalizm. Ja jestem mila ale tez mam niewyparzona gebe wiec kiedys takiego debila spytalam czy podnieca go wyzywanie sie na boguducha winnej kobiecie ktora byla dla niego tylko uprzejma. Czy sie jara krzyczebiem na kobiety bo wdomu zona go laciem ciula. Troche sie zagotowal i poszedl. Czasem jak nikt nie reaguje to takie fircyki gadaja bo naprawde ich rajcuje widownia bezkarnosc i ponizanie innych.",
            "To chyba jakaś dziwna okolica, albo żabka przyciąga takich patoli. Całe życie robie zakupy w marketach, a młody specjalnie nie jestem, nigdy nie zdarzyła mi się sytuacja, ze jakiś klient obraził kasjera.",
            "Miałaś combo z powodu meczu. Ale w zwykłym dniu też nie jest za lekko. Po prostu ludzie myślą że niewidzialny duszek Kacperek sam Ci zrobi dokładkę na polkach, samo się wszystko przygotuje a Ty tylko \"stoisz i nic nie robisz\" - no bo ile to jest nabić na kasie browary i fajki....",
            "Ta no niektórzy ludzie są zjebani, co zrobisz?",
            "przynajmniej taraz juz wiesz jak sie zachowac przed nastepnym meczem. 3 dni wczesniej mowisz wlascicielowi ze w wieczor meczu musi ci pomoc. jezeli nie - skladasz wypowiedzenie",
            "Pierdol ich.Niech sobie stoją smutne chuje.Ja zawsze takiego opierdalam jak stoją ze mną w kolejce.",
            "zawsze jestem miły dla wszystkich pracowników którzy mają do czynienia z klientem, nawet dla telemarketerow bo wiem że po prostu wykonują swoją pracę",
            "Prawie 10lat pracowałem w mcdonalds i co się nasłuchałem to głowa mała, wiem, że to trudne, ale to tylko praca - po powrocie do domu dupnonć se lolka i zapomnieć o wszystkim ;\\]",
            "Zapewne związane z meczem czy coś, po prostu niefortunnie natrafiłaś ba debili bez wychowania chcących sie wyżyć. Mam nadzieję że nie jest tak codziennie przynajmniej",
            "Takie zwracanie się do ludzi jest w Polsce legalne?",
            "Takie \"wampiry energetyczne\" tylko szukają problemów i też sami je tworzą. Stres i irytacja drugiej osoby tylko je nakręca. Prosta zasada:  masz problem, to szukaj pomocy i rozwiązania - nie ma co psuć komuś całego dnia. Takie zachowania wynosi się z domu i tutaj ewidentnie widać, że sporo ludzi potrzebuje pomocy psychologa / psychiatry.  Nic nie usprawiedliwia obrażania drugiej osoby. Warto w takiej sytuacji dosłownie zaprzestać obsługi i zająć się kolejnym klientem - nie wchodzić w żaden kontakt i gierki słowne.",
            "ktos im dal taki przyklad wiec sami sa tak traktowani przez innych. Ludzie co do czegos w zyciu doszli maja szacunek do ludzi pracy.",
            "Od rozpoczęcia pracy w maku mam ochotę nigdy więcej korzystać z jakiegokolwiek przybytku gdzie muszę być obsługiwany bo wiem jak jest to irytujące",
            "Też pracuje w takim sklepie, właśnie z niego pisze. Zdarza się taki zjebek. Np ostatnio chlopowi zabrakło złotówki czy 2 do piwa i mówię ze mu nie dołożę i że jak będzie miał pełna sumę to mu dam. Przychodzi 2 dni później i mówi do reszty pracowników ze pewnie syn policjanta, ja odpowiadam ze tak. Podobno mam nie żyć i mieć przejebane... i co? It's over? No nie, po prostu mam w takich wyjrbane i ide sobie właśnie rozłożyć absolwenta poziomkę 100ml na półeczkę :]",
            "Technik farmacji here, w aptece lepiej nie mam, nie martw się.",
            "Ludzie to są ch**e, klienci!",
            "Ludzie to buce w większości",
            "Współczuję",
            "Prawda jest, że niektóre panie w żabkach są tam chyba za kare i nic im się nie chce poza wyjściem na szluga i ploteczkami z koleżanką z kasy. Ale jak na kogoś kurwie z tak blachego powodu to zawsze za jego plecami, żeby nie słyszał. Jestem kulturalny.",
            "Ludzie to kurwy",
            "To jest fenomen, który ryje mi beret; nie znasz takich osób w ogóle, dopóki nie zaczniesz pracować. Wtedy zdajesz sobie sprawę, ile jest śmieci wokół nas.",
            "Dlaczego ochrona ich od razu nie wyrzuciła?",
            "Pamiętam jak z póltora roku temu robilem na kasie w Aldi, kurde bele klienci najmilsi nie byli więc swojego aię nasluchalem, ale kierownik sklepu był chill i nawet zachęcał byśmy się odgryzali, doświadczenie z Ligi Legend przyszlo nie raz w pomoc xD",
            "*ludzie są niemili dla pracowników sektora usług",
            "No ja 30go kończę pracę w remontowo budowlanym i mam podobne spostrzeżenia. Przy czym klienci mają również tendencję wręcz notorycznie przychodzić na zakupy, dosłownie 5min przed zamknięciem. I jeszcze się burzą, że fasony im światło albo zamykamy poszczególne działy. Nigdy więcej pracy z ludźmi.",
            "Najgorsze co dla takiej osoby mozesz zrobic to sie usmiechac i byc przesadnie mila jak sie na ciebie wydzieraja i specjalnie sie nie spieszyc, po prostu robic dalej w swoim tempie. Jak nie dasz im reakcji ktorej chca to chuj ich strzela, a poza rzucaniem obelgami nic ci nie moga zrobic.",
            "Nie dziwi mnie, że zjeby istnieją. Smuci to. Prymitywna potrzeba wyżycia się? Bycia od kogoś \"lepszym\"? Oni nawet nie potrafią pojąć, że nie są \"lepsi\".\n\nDwa razy jako klient spotkałem takiego zjeba i wiem, że taka praca nigdy nie była dla mnie. Oby więc dorabianie w sklepie było Ci jak najkrócej potrzebne",
            "Ja zapierdalam w sklepie z kwiatuszkiem i też różnie bywa. Trzeba wyhodować twardą skórę. Wychodzę z założenia że to ja mam kontrolę nad sytuacją, jak się nie podoba jak obsługuje to zapraszam na zmianę jak mnie nie będzie, albo do innego sklepu. Chuj im w dupę i tyle",
            "Nie rób z tego problemu społecznego. To indywidualne chamstwo",
            "Niby z jednej strony was rozumiem ale czasami kasjerzy to zachowują się jakby nie chcieli i nie mogli.",
            "Naprawdę wystarczy być po prostu miłym, grzecznym i pokornym, nie wdawać się w kłótnie z klientem, tylko grzecznie go przepraszać i jak najspokojniej tłumaczyć mu sytuację i przyjmować całą winę na siebię; bonusowe punkty za skarżenie się klientowi na wymyślonego szefa-tyrana, przez którego mimo najlepszych chęci nie możesz klientowi pomóc i który dowali ci karę finansową za najmniejszy błąd, i za spoufalanie się z młodymi, pijanymi klientami, udając ich ziomeczka, albo za udawanie lekko zawstydzonego i przestraszonego przy tych trzeźwych i nieco bardziej cywilizowanych.\n\n\nPracowałem w żabce, karfurze ekspres, monopolowym i innych tego typu miejscach, i jako jedyny pracownik nigdy nie miałem problemów z awanturującymi się klientami; zwłaszcza pokora i grzeczność rozłoży na lopatki nawet największego pieniacza, i przez to wiele razy upiekło się dla mnie, nawet gdy to ja popełniłem ewidentny błąd, celowy czy tam niecelowy.",
            "Mordeczko ale to dość prosta logika:\n\njeśli pracujesz  obsługując kogoś, to komuś służysz\n\njeśli komuś służysz to jesteś służbą\n\njeśli jesteś służbą to takim w sumie niewolnikiem\n\nniewolnicy to gunwno i podludzie hatfu",
            "A może się po prostu nie nadajesz i oni mieli rację.",
            "No a sprzedawcy są zawsze uprzejmi? Zwykle korzystam z kasy samoobsługowej, ale w tych rzadkich przypadkach, gdy tego nie robię, sprzedawca zwraca wzrok na komórkę jeszcze przed zakończeniem mojej transakcji. I oczywiście żadnego \"Dziękuję\", \"Miłego dnia\" czy \"Zapraszam ponownie\" xD",
            "Pamietam jak z 15 lat temu jednemu takiemu zwróciłem uwagę, żeby nie brał chleba z koszyka brudna łapa i nie odkładał z powrotem. Boshe, darł ryja przez całe Tesco za mną, że za komuny to ludzie gołymi rękami podawali towar i żyli. xD",
            "Ludzie są niemili dla sprzedawców bo wiedzą że sprzedawca nie odpryskuje. A jak odpryskuje, to z wielką radością będą chcieli \"porozmawiać z kierownikiem\".\n\nNie wiem skąd to się bierze, ale podejrzewam.",
            "Trzeba po prostu brać poprawkę na to, że nie wszystko, co jest klientem i wygląda jak człowiek, to rzeczywiście człowiek. A podludziami naprawdę nie warto się przejmować.",
            "Egocentryzm - bardzo fajne słowo - określa osobę, która nie jest egoistyczna świadomie, że dba o swój własny interes czy uważa się za lepszą, a dosłownie podświadomie i świadomie stawia siebie zawsze w centrum i uważa, że świat taki jest w 100%.",
            "Wszyscy ludzie poza mną to NPC. Takie podejście podowduje że nie jesteś empatyczny zjebem, który ma ideały nie do spełnienia.",
            "W sumie z tymi zjebami to też combo bo były mecze. Taki jeden z drugim myśli że jak będzie musiał poczekać na obsługę to padnie 10 goli (no koledzy nie będą czekać aż obejrzę powtórkę, spoilery mnie zjedzą). Nigdy nie pracowałem w frog shopie ale widziałem nie raz jak ludzie czują się panami w sklepie. Dla odmiany zawsze życzę miłego dnia/ wieczoru - ja wiem że to może być infantylne i nic nie znaczące ale jednak widzę że czasami na twarzy pojawia się uśmiech. Nienawidzę dużego napięcia w pracy i staram się rozluźniać atmosferę kiedy tylko mogę (nawet jeśli to nie moja praca). Ot zwykła sympatia do nieznajomego.",
            "sflustrowanych?",
            "Problemem jest że takie osoby nie myślą.",
            "Ogółem alkohol i papierosy przyciągają patolę. W Biedronce też miałem problemy z menelami i awanturnikami, którzy przychodzili po alko albo fajki. W Dealz, który nie sprzedaje żadnych z tych rzeczy, było już spokojniej z klientami. Dopiero pandemia sprawiła, że ludzie musieli pokazać, że nie dadzą się dociskać przez reżim szczepionkowców i nie będą współpracować poprzez noszenie maseczek i branie jednego koszyka na osobę, żeby pomóc nam liczyć ilość klientów na sklepie, bo to narusza ich wolność.",
            "Klient ma zawsze rację... w kwestiach gustu. Ludzie zupełnie zmienili sens tego powiedzenia.",
            "Moja ulubiona sytuacja powtarzająca się kilka(naście) razy na zmianie: klient się kłóci o zniżkę, ja mu tłumaczę, że zniżka wchodzi z aplikacją i na inną pojemność napoju (nawet jest napisane na cenówce), więc ktoś już chyba się kłóci tylko dla zasady XD",
            "> Mówi się,że klient ma zawsze rację\n\nJako były pracownik sklepu z pięcioletnim stażem na kasie stwierdzam, że to wymyślił jakiś klient. W ogóle jestem zdania, że klientom bardzo dobrze by zrobiło, gdyby każdy z nich postał tak z miesiąc przy kasie, od razu by im się optyka zmieniła.",
            "\"Klient ma zawsze rację\" to może działa w ameryczce, ludzie zapominają gdzie są xd",
            "Nie tyle gorszego bo ten typ człowieka większość uważa za gorszą od siebie. Frustrację jak \"damscy bokserzy\" wyładowują na słabszych od siebie. Przynajmniej w ich mniemaniu. Obrażanie sprzedawcy rzadko kończy się problemem więc można ich traktować jak worki treningowe. Wystarczy stanąć w obronie sprzedawcy i nagle panowie świata i jego królowe tracą rezon i grzecznie uciekają.",
            "Współczuję tak, ale szanuję? Szanuję na podstawie tego kim ktoś jest. Czy szanował byś złego człowieka za to że doświadczył w sklepie wyzwisk? Ja bym mu współczuł po prostu i nie używał zwrotu \"szanuję\". Jak Pan Pani godna szacunku to szanuję i współczuję takiego traktowania. Jak niegodna szacunku to po prostu współczuję. W moich żabkach niestety pracuje dużo osób które nie sprawiają wrażenia godnych zaufania lub szacunku. Co nie znaczy że nie mogę im współczuć albo traktować **kulturalnie**. Tak wiem, czepiam się słów ale słowa mają znaczenie. ",
            "Wczoraj o 22.30 byłam w Żabie, w kolejce przede mną był typ z dzieckiem, gdzieś 7-8 lat. Dzieciak liczył 1, 2, 3, 4, 5, 6, 7, 8. Cóż takiego dziecko, które dawno powinno być w łóżku liczyło? Ano piwka pana taty-patusa",
            "Koledze ktoś kiedyś zapłacił bodaj dwustuzłotówką za jedną bułkę, czy coś takiego. Akurat niedługo wcześniej inny klient przyniósł do sklepu worek miedziaków z prośbą o zamianę na gruby banknot - no to kolega odliczył te parędziesiąt groszy i wydał typowi resztę kilogramem miedzi. :D",
            "Jako kierownik - tak. \n\nJako pracownik niżej - zależy to już od kierownika, który równie dobrze może mieć całkiem odwrotne zdanie, jeśli dla niego liczy się zysk.",
            "Niemniej prawdopodobnie jest różnica między Tobą i klientem stacji benzynowej (zazwyczaj raczej trzeźwym), a studentką z tego wątku i takim stereotypowym panem kurskim w przerwie meczu. Domyślam się, że dochodzi tak element stresu i po prostu strachu w takich sytuacjach",
            "*owej osoby :)",
            "A z ciekawości kiedy zabierasz im koszyk? W sensie musi typ zacząć litanię o twojej rodzinie/tobie opowiadać czy wystarczy, że rzuci \"rusz się kurwa\"? Serio jestem Ciekaw bo jak miałem wątpliwą przyjemność pracy z zwykłymi ludźmi w handlu elektroniką to dopóki ktoś nie był agresywny na tyle, żeby wezwać ochronę to prawo stało po jego stronie i nie można odmówić sprzedaży.",
            "I cyk grzywna za nieuzasadnione wzywanie policji + art. 135 kkw za odmawianie sprzedaży bez uzasadnionej przyczyny - nie, bycie chamem to nie powód.",
            "Prędzej żabka przyciąga takie osoby, bo na codzień przychodzą głównie obcokrajowcy (żabka przy trzech hotelach, akademiku głównie z obcokrajowcami i nowym blokiem dewloperskim) i jest raczej okej, ale obok jest park że strefą gastronomiczną, jakaś strefa kibica, a jak się robi ciepło, to przychodzą osoby akurat przejeżdżające niedaleko na rolkach, rowerach, itp XD",
            "XD Co jak co, ale w to nigdy nie uwierzę. Kasjerzy są wszędzie obrażani i źle traktowani przez klientów. Zwłaszcza kasjerki. Znam z doświadczenia i obserwacji. Może sam niekulturalnie odzywasz się do sprzedawców i myślisz, że to normalne 🤣",
            "Możliwe że ciebie się akurat boją czy coś :P, plus w markecie jest sporo pracowników, na kasie raczej ciągle ktoś jest, a w małej żabce ten kontakt jest bardziej bezpośredni, a chwilowa nieobecność kasjera zauważalna",
            "Jest w tym też wina pracodawcy, który stawia pracownikowi nierealne wymagania. Powinien zapewnić większą obsadę. No ale wiadomo jak jest.",
            "Nie, skąd. Jedyne, co taki sprzedawca musi zrobić to pójść do sądu i założyć delikwentów sprawę cywilną. Uprzednio delikwenta zidentyfikować, w sądzie wnieść opłatę, udokumentować zdarzenie, odczekać swoje. \n\nPomnożyć przez ilość incydentów w sklepie, wszystko załatwić w wolnym czasie. Realne jak cholera, nie?",
            "Nie sądzę, żebym doszedł do jakichś wielkich rzeczy w życiu. Tyle, że od paru lat lepiej zarabiam. Jednak nawet wcześniej nie traktowałem obsługi sklepów, restauracji, sprzątaczki etc. jak pisze OP. Przeciwnie, dzień dobry, poproszę, do widzenia, jakiś żarcik. \n\nTo się raczej wynosi z domu. I to nie przez wtłaczanie do głowy a przez obserwację jak traktują innych i jak (nie) pozwalają się traktować dorośli, których dziecko szanuje.",
            "zmiana trwa 8,5h + ok. pół godziny, żeby ogarnąć sklep (zarówno rano, jak i po zamknięciu), to dosłownie jest praca fizyczna plus pracownicy są tylko ludźmi i mogą się źle czuć👍🏻",
            "Nawet jeśli OPka ruszałaby się jak ślimak to nie daje im żadnego prawa do takiego zachowania.",
            "zapraszam na zmianę 8h w sklepie w piątek po południu, razem z wysprzątaniem całego sprzętu i oblepionej podłogi",
            "Ale co ma twój argument do rzeczy? Nie powiedzenie \"dzień dobry\" nie jest równoznaczne z \"wypierdalaj z tej żabki, jak nie potrafisz pracować\". Osobiście nie spotkałem się żeby pracownicy żabek siedzieli w telefonie jak mnie obsługują. Wiadomo, czasami są oschli lub niemili, ale jak ktoś ci nie powie \"dziękuję\" to nie jest to jakiś atak xD. Ciekawie mnie czy ty mówisz to dziękuję, miłego dnia, itp, czy tylko oczekujesz, że kasjer najpierw musi tobie powiedzieć",
            "Ja mialem takie szczescie, ze jak dorabialem sobie w sklepie to moj kierownik zawsze stawal po stronie pracownika i kazal takim osobom (oczywiscie w mniej bezposredni sposob) wypierdalac i wiecej nie robic u nas zakupow... no ale to byl sklep prywatny, a nie sieciowka.\n\nNigdy nie bylbym w stanie pracowac w miejscu gdzie panuje przekonanie, ze klient to nasz pan (pomijajac fakt, ze to slawne powiedzonko dotyczy tylko gustu).",
            "W jaki sposób życzenie miłego dnia/wieczoru osobie na kasie może być postrzegane jako infantylne? Szczere pytanie bo dosłownie nigdy w myśl by mi nie przyszło tak tego nazwać.",
            "Nałożyło się dodatkowo, że wczoraj Polska przegrała mecz ostatniej szansy i odpadła z Euro.",
            "> Taki jeden z drugim myśli że jak będzie musiał poczekać na obsługę to padnie 10 gol\n\nCo nie? I to jest oczywiście wina kasjera, że nie przygotowali się na imprezę tylko awaryjnie muszą kupować. Mocna denerwują mnie osoby, które nie potrafią dostrzec problemu w sobie.",
            "Sfrustrowanych lustracją.",
            "*'The customer is always right, in matters of taste” is a quote by Harry Gordon Selfridge, an American business magnate who lived in 1909. That is actually the full quote of “The customer is always right” and it gives a completely other meaning.*",
            "Ale trzeba przyznać, że jest to mocno irytujące w żabach, że wielkimi literami jest napisana cena promocyjna ale żeby zobaczyć  warunki tejże promocji albo normalną cenę to już trzeba lupę wyciągać.",
            "Pamiętam, jak przez miesiąc robiłem w sklepie i na kasie miałem spinę z dwoma klientami. Głównie chodziło o to,że nie pozwoliłem sobie na traktowanie jak gorszego i odpowiadałem ironicznie na ich teksty,co ich wkurwiało. Jeden chciał złożyć skargę,ale łaskawie tego nie zrobił jak moja przełożona powiedziała,że jestem tylko do końca miesiąca (zostało kilka dni). Wyniosłem z tego dwie rzeczy: nigdy więcej nie będę obsługiwał ludzi i będę szanował kasjerów za gówno, z którym muszą się użerać na codzień.",
            "Na mnie jeden typ chciał kiedyś składać skargę do kierownika, bo kaucja za piwo na paragonie była o 15 gr wyższa, niż na cenówce.",
            "Ja to powiedzenie usłyszałem w jakieś kreskówce. Tak samo jak \"klijent nasz pan\".",
            "Pracowałeś kiedyś obsługując ludzi? A druga sprawa jest taka, kim Ty jesteś by mówić mi czy komuś kogo mam szanować lub komu współczuć?",
            "Ciekawe czy mówi do niego patusiu.",
            "Czy ojciec nie może wyjść z dzieckiem na zakupy? Nazywasz go patusem tylko dla tego, że kupuje alko?  \nA dlaczego nie śpi? No nie wiem, może jakaś impreza w domu i pozwolili dzieciakowi trochę dłużej nie spać.\n\nMoim zdaniem jedynym patolem w tym sklepie byłeś ty.",
            "Ludzie kupują rzeczy na zapas. A czemu tak w ogóle ty nie spałaś o tak późnej godzinie?",
            "22:30 to nie jest jakoś super późno. plus zakładasz że te piwa ziom chce zrobić w jeden wieczór, ale spokojnie może być tak, że mu starczą na 2 tygodnie.   \nI nie mówie że to nie był patus, ale zakłdanie że ktoś jest patusem bo ma piwo w koszyku, jest tak samo z dupy jak zakładanie ze pani na kasie się obija bo jest kolejka w sklepie.",
            "Sto procent racji, dużo zależy od szefa/kierownika. Jak pracownikom dałem do zrozumienia, że jeżeli są obrażani bądź poniżani mają odmówić sprzedaży zakazać wstępu do sklepu/stacji na przyszłość. A tak naprawdę to ja mam osobiście w dupie zysk na poziomie paru złotych za hot doga bądź puszkę red bulla. Wolę aby pracownik mógł godnie i w normalnych warunkach pracować. No ale ja to ja i zapewne są inni szefowie januszowie, którzy mają z kolei swoich pracowników w dupie.",
            "Wiesz co to zależy. Przypadek sprzed dwóch tygodni. Facet podjechał grubym mercedesem, zatankował do pełna i chciał do tego kupić parę red bulli. Rozmawiał bardzo głośno przez telefon (przez głośnik) przez co ani ja, ani kasjerka obok mnie nie mogliśmy zrozumieć co chcą inny klienci. Poprosiłem kulturalnie czy by Pan mógł troszkę ciszej rozmawiać bądź wyjść na zewnątrz. Wyskoczył do mnie z ryjem, że kim ja jestem aby mu mówić co może robić a czego nie może, że kim on nie jest. Nikt mu nie będzie mówił gdaie może rozmawiać i będzie robił co chce. Na moje prośby (oficjalna polityka firmy to deeskalacja potencjalnych konfliktów) zaczął wyzywać, standardowo - chuju niemyty, pedale, pies cię jebał etc.\n\nWziąłem od niego te parę redbulli i pieniądze, skasowałem za paliwo i powiedziałem wprost żeby spierdalał i że nigdy już u nas nic nie dostanie. Wydrukowałem zdjęcie tego małego chujka i powiesiłem przy kasach. Jak znowu przyjdzie wyłączymy gnojowi dystrybutory i tyle. A ta odmowa sprzedaży to kak głęboko w nosie. Co zrobi taki palant? Postraszy prawnikiem, to wszystko czego takie niedowartościowane jednostki potrafią. A fura za 300k to tylko przedłużenie małego kutasa i ego :)",
            "Zachowanie usługobiorcy jest uzasadnieniem w tej sytuacji, można odmówić sprzedaży jeśli ktoś cię obraża.",
            "Przytaczasz artykuły, o których nic nie wiesz. Klienta można wyprosić ze sklepu z wielu powodów, głównym z nim będąc podejrzenie o nietrzeźwości ów delikwenta. A można to zrobić, ponieważ prawo jasno i wyraźnie twierdzi, że powód odmówienia musi być uzasadniony - nie prawnie, najzwyczajniej musi być *jakiś* powód. Agresywne i antyspołeczne zachowanie które doprowadza do poddenerwowania personelu oraz klientów *jest* powodem do wyproszenia ze sklepu bądź z restauracji. Nawet jeżeli nie jest obecnie pijany, to możesz odmówić obsługi takiego zawadiaki, a sprzedawcy nic się nie stanie, ponieważ artykuł z kodeksu wykroczeń, który przytaczasz, został napisany w *latach 70.*, a służy on zwalczaniu sprzedaży artykułów \"pod ladą\", co było niesamowicie popularne w tamtych czasach, i wciąż dalej jest w np. dyskontach, gdzie pracownicy odkładają sobie towar na magazynie, odmawiając tym samym sprzedaży go klientom.",
            "No nie do końca, jest paragraf za zniesławienie. Do tego masz prawo odmówić sprzedaży osobie, która nie przestrzega ogólnie rozumianych zasad w sklepie/urzędzie/aptece etc.\n\nPytanie tylko czy komuś się chce bawić",
            "Również na palcach jednej ręki mogę policzyć sytuację gdy ktoś w mojej obecności obraził w jakikolwiek kasjera a jakbym szukał pamięcią to może z raz w ostatnich pięciu latach. \n\nA oskarżanie kogoś że sam jest chamem bo w swoim otoczeniu nie dostrzega chamstwa to jakiś durny fikołek logiczny.",
            "> Może sam niekulturalnie odzywasz się do sprzedawców i myślisz, że to normalne\n\n\nZupełnie nieproszona i niepotrzebna asumpcja.",
            "Wiem to tylko tu chodzi o nastawienie do klienta, które budzi niemiłą atmosferę, jak byłem w markecie i zapytałem się panią gdzie znajduje się konkretną przyprawa, to powiedziała, żebym sobie sam ja szukał bo ona nie ma czasu na takie rzeczy.",
            ">Ciekawie mnie czy ty mówisz to dziękuję, miłego dnia, itp, czy tylko oczekujesz, że kasjer najpierw musi tobie powiedzieć\n\nTak, zawsze. I co teraz? xD",
            "Żyjemy w Polsce. Samo uśmiechanie jest postrzegane jako choroba psychiczna, a co dopiero traktowanie drugiego człowieka jak... człowieka. Osoby pracujące w sprzedaży na tych najniższych szczeblach traktowane są gorzej niż śmieci (takie trochę nowe \"ucz się bo skończysz jak ten pan na śmieciarce\"). Nie mogą okazywać emocji innych niż merdanie ogonem bo nasz klient nasz pan (no ewentualnie zmęczenie ale to bez przesady bo przecież oni tylko na kasie siedzą i nie robią nic innego). To jest wyniszczające psychicznie. \n\n>W jaki sposób życzenie miłego dnia/wieczoru osobie na kasie może być postrzegane jako infantylne?\n\nO ironio dużo osób uważa, że \"i co myślisz że mu się lepiej zrobi?\" połączone z \"to jest jego zasrany obowiązek przecież tu pracuje\". Kolejne combo to stereotypy płciowe - faceci są jeszcze gorzej jechani imo. Nie raz słyszałem jak jakiś pracownik \" próbował kogoś oszukać\", \"jest zjebem i kurwą\", \" stosował przemoc\". No i ze względu na to \"tylko dziecko potrafi tym szmatom współczuć\". Bardzo bym chciał żeby to były wymyślone na poczekaniu historie. To jest jak forum internetowe wypełnione anonimowymi trollami tylko irl (pracownik będzie mieć często plakietkę z imieniem, klient pokazuje tylko twarz).",
            "Dokladnie",
            "Ale to są już pomysły tych głowojebów z centrali a obrywa się kasjerom. - ja się też na to nieraz naciąłem, ale teraz już to sobie wbiłem do pamięci. U nich jest ten myk \"wielosztuki\" żeby szybciej i więcej wcisnąć klientom.",
            "frustracja nie powinna byc wyładowywana na pracownikach, tylko na osobach, które tym zarządzają\n\nczęsto ludzie myślą, że kasjerzy czy obsługa klienta mają wpływ na takie rzeczy XD",
            "To! Każdy chyba powinien mieć epizod w obsłudze klienta. Zmienia się optyka po tym. Minęło 20 lat a dalej szanuje osoby które mnie obsługują.",
            "> klijent\n\n\"Klajdżent\"?",
            "Piszesz na publicznym forum to dostałeś publiczną odpowiedź. Ja Ci nie zabraniam nikogo szanować, gdzie to sobie uwidziałeś? Możesz szanwiać kogo chcesz. Ja mówię jak to wygląda u mnie. Słowa mają znaczenie. Nie szanował bym np złodzieja za to że gdy pracował w Żabce to go ktoś wyzywał. Współczułbym. To taka metafora pokazująca jaka jest dla mnie różnica między szanowaniem a współczuciem. ",
            "Wow, ale masz zajebisty wgląd w sytuację.",
            "Pomijasz fakt, że ja tego typa widziałam i pozwolę sobie pozostać przy ocenie patus.",
            "Jeśli ktoś kupuje zapas piwa na 2 tygodnie to nie robi tego o 22:30, a do tego w żabce.",
            "Teraz? Nic. Cieszę się, że jesteś uprzejmy.",
            "Też zawsze życzę miłego dnia, zwłaszcza jak ktoś mnie uprzejmie obsłuży. Nawet jeśli ktoś to uważa za infantylne lub niepotrzebne to nie zamierzam przestać.",
            "Wiadomo, pracownik sklepu nie tworzy tych etykiet.\nSwoją drogą ciekaw jestem czy to franczyzobiorca jest odpowiedzialny za te etykiety, czy raczej żaba narzuca je wszystkim odgórnie.\nSądząc po tym, jak w każdym sklepie jest praktycznie to samo, myślę że jest to im narzucane z góry. \nJak dla mnie jest to celowe wprowadzanie klienta w błąd i gdybym był imperatorem to bym tego zabronił",
            "Według gBoard tak ¯\\_(ツ)_/¯",
            "[removed]",
            "Większość osób jest niewolnikami swojej przeszłości i ciężko im to zmienić. Oczywistym jest, że jeżeli ktoś nie będzie mnie szanował to ciężko bym jego szanował. Niemniej, przewodzi mi jedna myśl - stając przy \"złym\" człowieku możesz albo okazać mu brak szacunku i pogłębić go w słuszności swoich wyobrażeń o świecie lub okazać szacunek i może, ale to może, pokazać, że warto być lepszym człowiekiem.",
            "No i bardzo dobrze, powodzenia",
            "Jest to narzucane z góry, kumpluje się z franczyzobiorcami kilku żabek i im też to się nie podoba.",
            "Bo powiedziałem, że współczuję pracownikom żabki i traktuje ich kulturalnie, ale niekoniecznie od razu z automatu szanuję z powodu tych sytuacji?\n\n\nNie wiem kto tu jest zjebem."
        ]
    },
    "Wiem, wiem reklamy, oglądalność itp, ale trochę to smutne...": {
        "title": "Wiem, wiem reklamy, oglądalność itp, ale trochę to smutne...",
        "score": 172,
        "url": "https://www.reddit.com/gallery/1dlrsqu",
        "content": "",
        "num_comments": 75,
        "comments": [
            "Znaczy się, to nie wina piłkarzy, że cały świat pakuje kasę w piłkę nożną i dzięki temu FIFA/UEFA (zależnie od turnieju) może wypłacać im horrendalne sumy za \"nic nie robienie\".",
            "Mnie najbardziej zaskakuje to że Fernando Alonso ma czas jeszcze grać w piłkę nożną. Facet naprawdę jest niezniszczalny.",
            "Niesamowite jest to ile polska wydaje na rozwój piłki nożnej, a dalej jesteśmy tak chujowi.",
            "Kiedy ostatni raz oglądałeś mecz siatkówki mężczyzn? ",
            "Nie do końca rozumiem, czy byś chciał aby Polski Związek Piłki Nożnej nie dostał tej kasy wcale lub aby zrobili prezent siatkarzom?\n\nZarobki w sporcie zależą tylko i wyłącznie od zainteresowania ze strony widzów, sponsorów i inwestorów. To nie jest akcja charytatywna.\n\nGdyby Polska przegrała w kwalifikacjach, to te 9 mln by trafiły do Walii. I oni by chyba sobie na narzekali.",
            "Czyli 2.5 miliona do podziału na jakeś, nie wiem, 40 osób? (bo nie tylko do składu, który wziął udział w samym Euro, ale tych, którzy grali też w eliminacjach). Czyli raptem 62,5 tysiąca euro. To są grosze. Większość tych piłkarzy gra w klubach z topowych europejskich lig, podobne wynagrodzenie dostają za tydzień treningów.",
            "Ja tam wolę jako kibic siatkówki to mniejsze grono odbiorców - mniej toksyczności, hejtu, afer. Wiadomo siatkarze pewnie mają na to inne spojrzenie, ale nie rozumiem w czym mi ma to przeszkadzać jako kibic. Poziom siatkówki w Polsce jest wysoki więc najwidoczniej pieniędzy jest wystarczająco, w przeciwieństwie do piłki nożnej gdzie ewidentnie nam nie idzie i potrzebne jest np. lepsze szkolenie",
            "Czyli nic nie trzeba robić a kasa się zgadza.",
            "![gif](giphy|94EQmVHkveNck|downsized)\n\nNapewno jest im przykro że znów g... pokazali",
            "Nie wiem jak inni ale mnie WKURWIA jak całe media gadają o piłce nożnej (wiadomości, reklamy, radio, jakieś kurde dzień dobry tvn czy coś) Wszystko dla ludzi opiera się na piłce nożnej jakby nie było innych informacji do gadania.  Rozumiem że euro jest dużym wydarzeniem ale nie każdego to interesuje. ja chcę wiedzieć co się ważnego na świecie dzieje  a nie że za 12,11,10,9,8..... godzin będzie euro i że \"teraz będzie lepiej jest drużyna przygotowana\". Ja chcę normalnie żyć, nikt nie potrzebuje mi przypominania za ile euro I jak to bardzo są teraz przygotowani.",
            "ahh",
            "Już chyba zapomnieliście, że nasi koszykarze musieli sobie sami bilety na mistrzostwa opłacić xD",
            "mam nadzieję że w przyszłości piłka nożna w Polsce będzie jednym z mniej popularnych sportów\n\nwydaje mi się że młodsze pokolenia już się coraz mniej nią interesują",
            "To mnie szczerze mówiąc wkurwia\n\nBo taki lekarz co dosłownie ratuje życie może sobie pomarzyć o takich sumach\n\nNo kurwa to musi być żart",
            "Powinniśmy dopłacać za występy a nie dostawać kase dla tych klaunów.",
            "Znaczy za sukces w postaci dostania się na Mistrzostwa (cudem i na ostatnią chwilę) nie powinni mieć nagrody? ",
            "Zamienić \"tys\" na \"mln\" i będzie git ;)",
            "Siatkówka przy piłce nożnej jest po prostu nudna",
            "Polakom akurat bez cudzysłowu wypłacają",
            "To się nazywa „produktywność społeczna”, inwestujemy w rozwojowe pomysły i wybitne przedsięwzięcia, co pozwoli nam pokonywać przeciwności oraz zwiększać poziom życia \n\nEdit: /s",
            "No bo w sumie poza indywidualnymi przypadkami jak np. Chorwacja to my w porównaniu do tych krajów co są naprawdę dobrzy w piłkę wydajemy grosze.",
            "dosłownie",
            "Zupełnie serio, nie chcę żeby to zostało odebrane jako jakiś atak, ale naprawdę ludzie nie oglądają siatkówki?\n\n\nOd kiedy pamiętam to wszędzie wokół mnie było zawsze obłożenie przed telewizorami, kiedy tylko Polacy grali. Nawet przy siatkówce kobiet, ale tutaj faktycznie mniejsze grona.\n\n\nPytam, bo mam poważnie wrażenie jakbym żyła w innej rzeczywistości ",
            "O ile mam czas i możliwości to oglądam większość spotkań naszych w lidze narodów, mistrzostwach europy, świata, igrzyskach. Czasami obejrzę też klubową ligę mistrzów a nawet jakieś ciekawsze spotkanie w naszej lidze.  A przy dużych imprezach to obejrzę spotkania dobrych drużyn i nawet nie muszą Polacy grać. Po prostu lubię siatkówkę.",
            "I to nawet nie tylko pilkarze, ladnie zmanipulowane grafiki, na 1 screenie ile kasy otrzyma pzpn (czyli caly zwiazek nie tylko pilkarze) a na drugim ile zarobili siatkarze, czyli w domysle zawodnicy + moze trener.",
            "Zgadzam się. Bardzo wkurwia mnie kiedy jedyna dyskusja wokół siatkówki, piłki ręcznej czy tenisa polega na tym że ktoś z reprezentacji w piłce nożnej nie potrafi podać piłki.\n\nJak jesteś zainteresowany siatkówką wybierz sobie klub, kup koszulkę, karnecik, kanał sportowy z siatkówką i bierz udział w sporcie który cię interesuje. Np Wilfredo Leon gra teraz dla takiej Bogdanki Lublin która raczej nie wyprzedaje regularnie wszystkich miejsc na hali. To jest dosłownie takie proste.",
            "Jeden miesiąc na dwa lata przez 5 minut dziennie trzeba wysłuchać informacji o piłkarzach zamiast ciągle słuchać nakręcania karuzeli hejtu i doomeryzmu.\n\nPrzesyłam wam szczerze modlitwy i słowa otuchy, żebyście mogli przetrwać ten trudny okres [*]",
            "Dosłownie każdego dnia masz wiadomości na temat informacji z całego świata, które nie wszystkich interesują tak samo jak Ciebie nie interesuje piłka nożna. \n\nNiech ci których to interesuje się nacieszą i będzie spokój na cztery lata.\n\n>Ja chcę normalnie żyć\n\nA teraz nie możesz?",
            "Co 2 lata duży turniej który trwa miesiąc a ludzie robią z tego dramat że przez ten czas gdy miliardy osób na świecie interesują się właśnie tym wydarzeniem - media dają ludziom to co chcą. \n\nPoczekaj chwilę zaraz igrzyska olimpijskie. Będziesz “musiał” czytać o wynikach w pchnięciu kulą czy rzucie oszczepem.",
            "Mi się akurat bardzo podoba takie sezonowe nakręcanie jednego tematu. Co roku święta bożego narodzenia i wakacje, co 2 lata piłka nożna, co 4 lata wybory itd itp. Szanuję opinię jak ktoś woli żeby było cały czas to samo, ale osobiście traktuję to jako fajną odskocznię od zwyczajności",
            "I te pilne wiadomości na temat tego, co je reprezentacja Polski! O patrzcie teraz, wsiadają do autobusu!! O a teraz do samolotu!! Nasi bohaterowie! o znowu przegrali ALE PATRZCIE JAK JEDZIE AUTOBUS",
            "Młodsze pokolenia mniej interesują się sportem, a nie piłką. Mniej popularnym dyscyplinom spadnie zainteresowanie proporcjonalnie, jak nie bardziej - więc będzie jeszcze gorzej.",
            "Nadal EA FC jest chyba najbardziej popularna gra komputerowa w Polsce",
            "Nie wiem czy są jakieś badania potwierdzające moje zauważenia więc dowód być może anegdotalny, ale z tego co zauważyłem to młodsze pokolenia wogóle interesują się mniej ogólnie sportem.\n\nNatomiast jeśli już znajdziesz grono takich \"sportowców\", to piłka nożna zazwyczaj dalej jest na pierwszym miejscu.",
            "Nie liczylbym na to. Każdy orlik do 20 - szkółki piłkarskie. W weekend dopchac się na boisko - niemożliwe. Jeżdżę z dziećmi o 20:30 po godzinie zamknięcia orlika żeby mogli pograć na boisku z liniami.",
            "70~ tysięcy euro na łeb to lekarz spokojnie pyka max w rok.",
            "Entertainment zawsze był bardziej opłacany od służby i ratowania życia. Przyzwyczaj się, taki już jest ten świat. Lekarze, Policjanci, Nauczyciele, Żołnierze nie mają sponsorów i show w TV. ",
            "Bo ratowenie życia niw generuje takich zysków jak haratnie w gałę",
            "Nikt mu nie zabronił grać w gałę za dzieciaka zamiast uczyć się biologii.",
            "Lekarze też nie zarabiają źle, nie rób z nich ofiar. Poza tym tam też zdarzają się buce i zwyczajni idioci, zawód jak każdy inny",
            "Zawodowy brydż wzbudza większe emocje niż gra naszej reprezentacji w piłkę nożną...",
            "No nie wiem, taki Szczęsny to przyjął buta w mordę żeby bronić karnego zamiast oddać bramkę.",
            "Proszę wyjaśnij jak twój poziom życia został zwiększony przez 11 miernot nie potrafiących biegać.",
            "Ale zobacz jaki mamy potencjał:\n\n-40 mln ludzi\n\n-Piłka sportem narodowym, w które kazde dziecko gra\n\n-Pełno boisk, nawet w małych miasteczkach czy wsiach",
            "Był taki okres gdzie rzeczywiście był całkiem spory hype na siatkówkę i wszyscy moi znajomi się nią ekscytowali, ale mam wrażenie, że od dłuższego czasu jakby ucichło w tej kwestii.\n\nJa tam ogólnie sportu nie oglądam, chyba że towarzysko. Tzn. sam bym nie odpalił ale jak mnie znajomi zapraszają na posiadówkę przy oglądaniu to nie odmówię. No i w mojej grupie znajomych 90% czasu to jest piłka nożna, chyba że uda nam się gdzieś wysoko zajść to wtedy czasem jakiś inny sport.",
            "Nie wiem jak inni, ale w mojej bańce nikt nie ogląda siatki. Może jakiś wujek obejrzy do browara.",
            "Naprawdę nie oglądam siatkówki, bo nienawidzę tego sportu. Tak po prostu i tyle.",
            "Dobra, nawet jeżeli Polacy oglądają - to do puli piłki nożnej dorzuca się też reszta świata",
            "Tak w pokoleniu 40+ to jeszcze sporo ludzi ogląda, ale to też w wiekszości tylko duże zawody. O rozgrywkach klubowych nawet nie wspominam, bo to już zupełna nisza. Z młodszych to nie wiem czy znam jedną osobę która by siatkówkę śledziła. \n\nZa to piłkę nożną ogląda pewnie z połową znajomych niezależnie od wieku, jeśli chodzi o duże turnieje. Do tego jeszcze sporo osób śledzi rozgrywki klubowe, czasem z kilku krajów na raz + Liga Mistrzów. \n\nTo są zupełnie inne poziomy oglądalności.",
            "Osobiście nie oglądam. Raz czy dwa się zdarzyło jak był jakiś finał, ale tak jak w siatkę uwielbiam grać, to oglądać już nie bardzo. W piłkę lubię zarówno grać jak i oglądać. Nie wiem dlaczego, po prostu tak mam",
            "Żyjesz w innej rzeczywistości bo rozumiem że nazywasz ćwierćfinał i wyżej na MŚ z udziałem polaków \"gdy tylko polacy grali\". \n\nLudzie oglądają piłkę kopaną nawet podczas meczów kwalifikacyjnych z san marino, o meczach towarzyskich nie wspominając.",
            "Nie no, 25% z 10 milionów dla samych piłkarzy, więc to już wykorzystałem w obliczeniach.",
            "Jeszcze zatęsknisz za rzutem kulą jak puszczą w telewizji pływanie synchroniczne mężczyzn.",
            "Co nie znaczy że muszę się z tym zgadzac i traktować jakby to było \"normalne\"",
            "Bez sztabu medycznego na wysokim poziomie to by ci piłkarze za długo nie pograli",
            "A potem o nie, lekarzy i pielęgniarek brakuje",
            "Nie słyszałem żeby ktokolwiek interesował się meczem brydża",
            "Gdyby tylko piłka nożna to był bramkarz vs bramkarz",
            "Muszę chyba dodać /s widzę",
            "Nie ma najważniejszego, czyli dobrze funkcjonującej ligi zawodowej. Bo to głównie drużyny z takich lig są odpowiedzialne za trenowanie piłkarzy do poziomu takiego przykładowo Euro.\n\nAle to jest temat na całe książki, który ciągnie się od lat 80-ych.",
            "Ja nie pamiętam kiedy ostatnio oglądałem mecz, a regularnie chodzę grać na orlik ze znajomymi",
            "Nie mam pojęcia o co się do mnie rzucasz, po prostu byłam zaskoczona, że siatkówka nie jest powszechnie oglądana, bo zawsze stwarzała takie wrażenie w moim otoczeniu. Starałam się jak najgrzeczniej zaznaczyć, że pytanie wynika tylko i wyłącznie z konsternacji, no ale i tak się ktoś spruł",
            "Nie no oczywiście, ja też jestem zdania że wiele dyscyplin i zawodów nie jest docenianych, a kasa wkładana w piłkę jest o kilka rzędów wielkości za duża.",
            "Ok, dobra, to się nie zgodziłeś. I jakie masz teraz rozwiązanie? Płacić lekarzom tyle co piłkarzom? Nie da się. Zabronić ludziom zarabiać więcej niż X miesięcznie? To też idiotyczny pomysł.\n\nPiłkarze zarabiają tak dużo z tego samego powodu dla którego gwiazdy kina czy popularni muzycy zarabiają krocie. Bo ludzie chcą ich oglądać/słuchać i są w stanie za to zapłacić (albo wprost, albo w przypadku sportu w telewizji swoim czasem kiedy oglądają reklamy itd.)\n\nTe pieniądze które ludzie wydają na rozrywkę nie znikną - jeśli nie będziesz wypłacał ich samym piłkarzom to po prostu jeszcze bardziej wypchasz kieszenie klubów, związków piłkarskich, inwestorów itd. Nie wiem jak dla ciebie, ale ja tam wolę już żeby piłkarze przytulili część tych zysków.",
            "Ale czego ty oczekujesz? Że Polska zmusi UEFA do przekazania hajsu na NFZ zamiast na PZPN? xd",
            "I tak byśmy przejebali bo ten Austryjacki to też nie był jakiś leszcz. xD",
            "Zdecydowanie, jak zazwyczaj jestem w stanie wyczuć to tutaj byłem równie od tego daleki jak Lewandowski od lądowego rekordu prędkości.",
            "\"rzucasz się\", \"spruł\"\n\nA to ok.",
            "Nie chodzi mi o to że mają płacić więcej niż piłkarzom ale takie pierdolenie że trzeba było brać inny zawód jest frajerskie",
            "😂",
            "Pierdolenie że inny zawód zarabia więcej jest jeszcze bardziej frajerskie imo",
            "Jak wyjdziesz z piwnicy mamy na prawdziwy świat to zrozumiesz że lekarze i pielęgniarki nie są doceniani zarobkami w tym kraju.",
            "Pielęgniarki? Tak. Położne? Zdecydowanie. Ratownicy medyczni? Absolutnie. Weterynarze? Zwykle też. Ale lekarze? Polecam samemu wyjść z piwnicy",
            "Miesięczne wynagrodzenie całkowite (mediana*) na tym stanowisku wynosi 8 840 PLN brutto. Co drugi lekarz otrzymuje pensję od 6 750 PLN do 12 570 PLN. 25% najgorzej wynagradzanych lekarzy zarabia poniżej 6 750 PLN brutto. Na zarobki powyżej 12 570 PLN brutto może liczyć grupa 25% najlepiej opłacanych lekarzy\n\nNo rzeczywiście w chuj kasy jak za lata studniow i ciągle doszkalanie się",
            "Z badania w którym brało udział 158 osób\n\nI tak polecam popatrzeć na weterynarza, który ma bardzo podobne wymagania, a w tym samym badaniu mediana wynosi 6200\n\nOstatnie dane GUSu są sprzed 2 lat, więc ciężko mi się realnie odnieść, ale wg SalaryExplorer na 10 najlepiej płatnych zawodów 5 to stanowiska kierownicze oraz chirurg, ortodonta, sędzia, prawnik, pilot\n\nA jako lekarz też możesz zajmować stanowisko kierownicze"
        ]
    },
    "Barcelona zlikwiduje WSZYSTKIE apartamenty turystyczne w 2028 roku": {
        "title": "Barcelona zlikwiduje WSZYSTKIE apartamenty turystyczne w 2028 roku",
        "score": 259,
        "url": "https://www.theolivepress.es/spain-news/2024/06/21/breaking-barcelona-will-remove-all-tourist-apartments-in-2028-in-huge-win-for-anti-tourism-activists/",
        "content": "",
        "num_comments": 77,
        "comments": [
            "Jeszcze tylko się zająć kradzieżami i legancko tego.",
            "Airbnb to rak. Wszystkie miasta powinny tego zakazać. Albo wprowadzić zakaz wynajmu mieszkań na okres krótszy niż 3 miesiące (i ścigać oraz karać naruszających go). \n\nTo jest obchodzenie planów zagospodarowania i przeznaczenia budynków i tworzenie profesjonalnie funkcjonujących mini quasi-hoteli tam gdzie ich nie powinno być. \n\nNie powinno się pozwalać na to, że w budynku mieszkalnym funkcjonuje quasi-hotel gdzie pojawiają się co chwilę nowi, obcy ludzie, do tego często hałasujący po nocach.",
            "To może by przekształcić niektóre hotele w taki sposób, żeby były jeszcze tańsze niż Airbnb? Sam sprzątasz, sam sobie żarcie ogarniasz, żadnych pokojówek, pokoje na kod i nie musi być konsjerża. Wnętrze proste, bo turysta chce się tylko przespać i idzie zwiedzać. I pyk, wszyscy zadowoleni.",
            "Bardzo dobrze. Byłem w Barcelonie dwa razy. Raz w wynajmowanym mieszkaniu (w aparthotelu, więc pewnie przetrwa tę czystkę), drugi raz w normalnym hotelu. Hotel mimo niższego standardu był o niebo lepszym rozwiązaniem.\n\nAirBnB miało rację sensu, gdy to była oddolna inicjatywa, wynajmowanie kanapy gościowi, którego nie byłoby stać na hotel, a przyjechał np. na koncert lub rozmowę o pracę. Obecnie większość ofert to mieszkania w cenie taniego hotelu.\n\nJa rozumiem, właściciel ma prawo do dysponowania swoim mieszkaniem, ale mieszkanie ma swoje przeznaczenie. Tak samo jak nie umieszcza się w nim huty szkła (tak wiem potężna hiperbola), czy burdelu, tak nie robi się z niego hotelu.",
            "Do tego czasu pewnie się zmienią władze i nie wejdzie w życie. \n\nPlus trochę śmieszna ilość 10K. \n\nPamiętam jak jeszcze mieszkałem w Berlinie tamtejsze władze też chciały zmniejszyć wpływ AirBnB. Wyszło na to że na prawie 4M mieszkańców, tylko około 3K mieszkań było wynajmowanych na AirBnB. Do tego największym landlordem były same władze miasta, poprzez własne spółki mieszkaniowe. \nOstatecznie po prostu za mało i za wolno się buduje, a ludzie za szybko napływają do miasta.",
            "Barcelona próbuje wypchnąć z miasta mniej zamożnego turystę. To się dzieje już w wielu miejscach na świecie - zarobić tyle samo (choć zarabiają mniej liczni), ale przy dużo mniejszym obłożeniu. Pomysł oczywiście nienajgorszy, bo zmniejsza się uciążliwość dla mieszkańców. Ciekawi jednak tak duże wsparcie z Polski, bo to przecież właśnie nasz turysta zostanie zastąpiony mniej wrażliwymi na ceny Amerykanami, Chińczykami czy mieszkańcami bliskiego wschodu. Ale może każdy tutaj już był i nie chce żeby inni też pojechali.\n\nJeśli to z powodu ogólnej niechęci do airbnb, to dodam, że nie wpłynie to w żaden sposób na sytuację w Polsce. Przy obecnym stanie prawnym nie ma takich możliwości prawnych (zakazu wynajmu krótkoterminowego). Nie ma też woli politycznej, ani widoków na zmiany w legislacji (lobby hotelarskie jest bardzo słabe - rozproszony rynek, a deweloperskie, bardzo mocne).",
            "Szczerze popieram, właśnie wróciłam z Londynu i miałam wrażenie, że tam nie ma lokalsów... są ludzie którzy mieszkają w klitkach, albo inwestorzy z AirBnB... duże miasta przestały być do życia, są tylko jedną wielką atrakcją turystyczną... Od mieszkania na wycieczkach powinny być hotele, które mają standardy. Właśnie wynajęłam airbnb w Londynie (przypadkowo, myślałam, że to hotel, coś ala pensjonat) iii no ogólnie było czysto, ale w łóżku były cudze włosy... było to niesmaczne. Posprzątaliśmy to sami... W hotelu nigdy nie miałam takiej akcji.",
            "Bardzo dobrze. ",
            "I bardzo kurna dobrze",
            "Jak zwykle zesrańsko landlordów. U nas konfederacja powiedziałaby że to cios wymierzony w przedsiębiorców z branży mini-hotelarskiej xD",
            "Bazacelona",
            "Ciekawe jakie maja przepisy dotyczace squattowania bo okaze sie ze zamienia turystow na bezdomnych. Idealnie by bylo jakby wlasciciele wrzucili te chaty na rynek co by obnizylo ceny nieruchomości ale znajac zycie wlasnie ten spadek cen zniecheci landlordow do sprzedaży.",
            "I bardzo fajnie, jak nocować to w hotelu lub hostelu. Coraz częściej na wakacjach da się zauważyć, że w bardziej popularnych dzielnicach po prostu nie ma mieszkańców, nie ma lokalnych sklepów - same sieciówki, sama pizza i burgery, wszystko 100% droższe niż powinno być, a lokalnego języka też praktycznie 0. Skoro tak to podróżowanie traci coraz bardziej swój urok, bo pizzę czy burgera to ja równie dobrze mogę zjeść przy 35 stopniach w Polsce nad morzem. \n\nWypad poza sezonem w takie lokalizacje też coraz częściej odpada... bo są dosłownie zamknięte. Skoro wszystkie mieszkania są tylko pod wynajem turystyczny to jesienią, zimą stoją puste. Okoliczne sklepy również nie mają kogo obsługiwać, więc też się zamykają. Dzielnice są wymarłe jak w pandemii.\n\nJak dla mnie cała radość z wycieczek to możliwość wtopienia się w lokalne życie, zjedzenie czegoś co jedzą miejscowi, poruszanie się np. komunikacją miejską czy jakimiś pociągami nie tylko z masą ludzi z plecakami i telefonami w łapie tylko wśród lokalsów jadących do pracy czy do szkoły i przede wszystkim inny język.\n\nDruga sprawa - piszecie, że ceny noclegów skoczą... pewnie tak, ale nie spodziewałbym się drastycznych podwyżek. Ci bogatsi i tak nocują w 4, 5 gwiazdkowych renomowanych hotelach, a kimś trzeba dalej zapychać hostele i hotele 2, 3 gwiazdkowe. Budżet tych osób jest ograniczony, wiec drastycznych podwyżek nie wytrzymają. Minimalnie ograniczyłby się ruch turystyczny co może za to lekko obniżyć ceny lotów, które ostatnio niestety zaczynają się zrównywać pomiędzy \"tanimi\" liniami lotniczymi, a normalnymi i to w górę.",
            "Super pomysł, a ktoś pamięta jakie była cena doby hotelowej w takiej Hiszpanii zanim powstało Airbnb? Bo ja tak, jeździłem wtedy na CouchSurfing, bo mnie nie było stać.\n\nKażdy kij ma dwa końce, życzę im jak najlepiej ale za kilka lat będą prosić o powrót Airbnb.",
            "Airbnb tylko jako pokój, albo cały dom (nie mieszkanie) i super.",
            "I bardzo kurwa dobrze!\nMam mieszkanie w Hiszpanii i uważam, że wynajem krótkoterminowy to rak, który zeżera ten kraj.",
            "Lobby hotelowe lubi to.",
            "O czyli da się. A Polaczki i tak zaraz powiedzą że się nie da",
            "bardzo dobrze airbnb i inne podobne to skurwysyny",
            "Nienawidzę AirBnB, ale nic z tego nie wyjdzie, wladzy (jak wszyscy z lewicy) zachowują się jakby to była jakaś \"evil amerykańska korporacja\" to robi, gdy tak naprawdę to zwykły obywatel wynajmuje swoją nieruchomość, żeby zarobić na turystach.",
            "Nie zlikwidują.",
            "Socializm…",
            "Zawsze niepokoi mnie to z jaką łatwością komunisci decydują o tym w jaki sposób ktoś ma zarządzać swoim mieniem. Powodzenia z prowadzeniem biznesu w kraju gdzie ustawa zabierają komuś źródło dochodu. Hiszpania gospodarczo i tak już ledwo zipie ale nie zniechęca to socjalistów by jeszcze mocniej dokręcać śrubę",
            "To była fajna platforma gdzie można było sobie wynająć pokój gdy trzeba było albo dorobić sobie żeby nie stało puste. Tylko, że tak jak z uberami zlecialy się pseudo korporacje hetelarskie/taksówkarskie i wszystko zepsuły. Na uberach całe floty mają i pracowników i tak samo jest z Airbnb. Wykupują masowo mieszkania, czasem budują specjalnie pod wynajem budynki i zatruwaja życie sąsiadom, nieraz ich wypedzajac wręcz. Do tego jest to nieuczciwa konkirencja dla hoteli, penajonatow itp, które muszą spełniać wymagania, które olewają takie pseudo hotele.",
            "Potwierdzam, w moim bloku jest dużo mieszkań na najem krótkoterminowy i weekendy to zawsze jakieś odpierdalanie za ścianą :)",
            "Centrum pragi calkowicie martwe przez to. W srodek zimy nie zobaczysz nikogo idacego do pracy rano",
            "To niech hotele dostosują się do rynku, nie mam zamiaru płacić stawek hotelowych jak moge mieć taniej i lepiej.",
            "moim zdaniem airbnb powinno skupiać się na wynajmie pokoi w mieszkaniach, nie całych mieszkań - takie było założenie przy tworzeniu tej aplikacji nie wiem czemu od tego odeszli. Jest jeszcze coachsurfing ale do tego trzeba mieć abonament bez względu na to czy ogłaszasz pokój/kanapę i siebie czy szukasz u kogoś.",
            "[deleted]",
            "oo wszystko zakazac, airbnb uber ohohooho xD \nA j chetnie zostane w airbnb z uwagi na nizsze ceny to jest kwestia regulacji, w barcelonie sa landlordzi co maja po kilka tysiecy mieszkan tylko i wylacznie na airbnb",
            "Już są takie \"smart\" hotele, gdzie meldujesz się online (czyli brak recepcji). Zresztą na takich zasadach działa część aparthoteli.",
            "Z moich doświadczeń Airbnb już nie jest tańsze niż hotel w wielu miastach.",
            "Są rozwiązania tańsze i jednocześnie takie gdzie nie musisz sam sprzątać. Hotel kapsułowy. Przyjeżdżasz zostawiasz bagaże w szafce idziesz do kapsuły spać i rano np na lot dalej. Nocowałem tak kiedyś w centrum Warszawy za 99pln. ",
            "Ale czy to ma być cel, aby noclegi były jak najtańsze? Potrzeba turystów z kasą.",
            "Ogólnie racja, choć robią trzęsienie ziemi próbując rozwiązać problem który sami stworzyli. W Hiszpanii każda gmina sama decyduje czy i ile licencji wydać więc najpierw wydawali jak szaleni a teraz tym wszystkim ludziom mówią, że jednak im się odwidziało.",
            "Co dal Ci hotel czego nie dało AirBNB? Czemu był- mimo gorszego standardu - \"o niebo lepszym rozwiazaniem\"?",
            "Mniej zamożni turyści to młodzi backpackersi, którzy korzystają z hosteli. Nie chodzi tu o eliminowanie jakiejś grupy turystów, a o dostęp do mieszkań dla Hiszpanów.",
            "Widzisz oni juz zapowiedzieli iz jak lokal mieszkaniowy bedzie stal pusty to wlascicel bedzie musial placic specjalny dodatkowy podatek.",
            "Wiesz, że na wyspach takich jak Ibiza, Majorka, Minorka to ogrom lokalsów mieszka dosłownie w piwnicach lub po kilka osób w pokoju, bo nie mają gdzie się podziać? AirBnB wymiotło mieszkańców tych wysp daleko na obrzeża, bo nikt nie chce tam juz wynajmować mieszkania na stałe za np. 600 euro miesięcznie skoro więcej zarobi przez tydzień wynajmując na kilka dni losowym ludziom płacącym 100 euro, ale za dobę.  \nWedług mnie te mieszkania ekspresowo się zapełnią rezydentami tych miast.",
            "Jednym z założeń tych zmian jest obniżenie liczby turystów. Więc myślę że o tym drugim końcu yez pomyśleli.",
            "Turystów jest już za dużo, to, że akurat ciebie nie było na coś stać to żaden argument. Nie chcemy \"bieda-turystów\" na weekend.",
            "A jaka niby jest teraz cena doby hotelowej? Hiszpania (nie licząc może wysp kanaryjskich) jest ogólnie dość droga dla Polaka - zawsze była.",
            "> zwykły obywatel wynajmuje swoją nieruchomość, żeby zarobić na turystach\n\nhttps://pl.wikipedia.org/wiki/Tragedia_wsp%C3%B3lnego_pastwiska",
            "Niderlandy wprowadziły praktycznie całkowity zakaz (bodajże tylko 1 miesiąc w roku można udostępniać mieszkanie pod airbnb) i zdaje się,  że to działa.",
            "xd oni już to zrobili, sobie obczaj skale airbnb w Barcelonie, właściciele mogą wynająć pokój w domu w którym mieszkają, plus zameldować osoby które u niego przebywają; osoby które obchodzą przepisy narażają się na solidne kary  \n[https://www.catalannews.com/society-science/item/barcelona-fines-property-owner420000-for-illegal-holiday-rentals](https://www.catalannews.com/society-science/item/barcelona-fines-property-owner420000-for-illegal-holiday-rentals)",
            "Nie wierzę, ze w centrum Pragi nie ma żadnych firm.",
            "Dlaczego nie mogę postawić sobie w mom prywatnym mieszkaniu kilka obrabiarek CNC i frezarek? Dlaczego niby lobby frezarkowe ma mieć taki monopol? Bo komuś frezarka hałasuje za ścianą xD\n\nW takim natężeniu Airbnb to rak.\nW UK funkcjonują miejsca, gdzie w ogóle nie można wynajmować nieruchomości. Czy krótko, czy długoterminowo.",
            "Pogadamy jak sobie kupisz mieszkanie i 3/4 bloku bedzie wynajmowane codziennie innym najebanym studentom",
            "Ale Airbnb opłaca się tylko w większych grupach i z purvhlakami gdy chcesz gotować.\n\n\nJuż od jakiegoś czasu sieciowe hotele są często tańsze, nie ma opłat za sprzątanie a w takim ibisie to i śniadanie gratis.",
            "U mnie wychodziło taniej, tam gdzie szukałam. Dlatego ostatnie lata wybieram tą opcję, bo jest najtaniej.",
            "Hotele kapsulkowe nie sa dla wszytskich. Jest zbyt klaustrofobicznie, wspolna łazienka, brak zamków. Jednak tani(ale drozszy) mini apartament, ale solo to co innego.",
            "Oczywiście, że to ma być cel. Co jak sam chcesz gdzieś coś odwiedzić? (A tanie hotele chyba już istnieją)",
            "I dają znac że za te 4 lata im nie przedłuża licencji.\nA prawnie nie muszą tak wcześnie ostrzegac że nie będą przedłużali",
            "W Barcelonie od dawna walczą z problemem nadmiernej liczby turystów, więc najpierw wymyślili te licencje, żeby się biedni właściciele nie spłakali za bardzo (10k to bardzo mało jak na Barcelonę), a teraz postanowili zakończyć tę imprezę, która i tak trwała już zbyt długo",
            "Spokój innych mieszkańców, którzy nie muszą się na co dzień użerać z turystami w swoim bloku.",
            "Śniadanie, obiad i kolację. ",
            "To jest cały reddit. \nFacet napisał że lepszym rozwiązaniem dla niego jest hotel niż airbnb. Poprosiłem o doprecyzowanie czemuż to, bo sam nie widzę przewagi hotelu ponad to, że można być swinką i zostawiać po sobie syf.\nOdpowiedzieli wszyscy prócz faceta, milion minusów. \nFantastyczne doświadczenie i produktywna dyskusja!",
            "Doceniam siłę marzeń, ale z prawami ekonomii nie wygrasz. W mieście jest niecałe 40 tys. pokoi hotelowych. Jeśli zlikwidujesz pozostałe kilkadziesiąt tysięcy miejsc noclegowych (obecnie na jednej licencji można mieć kilka pokoi do wynajęcia), to ceny pójdą mocno w górę. Ceny hosteli również, może tylko zmienią nazwę na Butikowe  Apartamenty w Centrum Miasta. \n\nA czy mniej zamożni turyści to młodzi backpackersi czy może polskie rodziny na dorobku z dziećmi, to już kwestia w jakiej rzeczywistości żyjemy (amerykańskich seriali z Netflixa, czy takiej bardziej przyziemnej).",
            "I słusznie, sam mieszkałem w takim nowym bloku gdzie 80% lokali to Airbnb - tam nie dało się mieszkać.",
            "No to \"bezdomni\" go zapłacą, w czym problem?",
            "I bardzo dobrze, też myślę ze airbnb to rak.",
            "Nie wiem czy jat te mieszkania będą wynajmowane studentom na dłużej to będzie lepiej.",
            "no a co ja pisze? xD regulacja a nie zakazywanie, poza tym wlasnie przez to nie myslisz obiektywnie",
            "What.\nDużo jeżdżę. Po świecie i po Polsce. Nigdy nie nocuję w hotelu, bo nie dość że droższy lub nietańszy, to jeszcze dostaję za tę kasę bezduszną, malutką przestrzeń. Nie spotkałem jeszcze miejsca gdzie AirBNB nie byłby - dla konsumenta - lepszą opcją (nie bywam poza Europą though).\n\nJedyne co przychodzi mi na myśl jako dobra opcja, to że jeśli jesteś syfiarzem to w hotelu Ci posprzątają. Ja nie jestem i cenię sobie możliwość ugotowania czegoś wieczorem / rano.",
            "Tanie noclegi to tania masowa turystyka, która wnosi więcej kosztów niż korzyści.",
            "Facet napisał że raz nocował w Airbnb a raz w hotelu i hotel był dla niegoo lepszym rozwiązaniem. Spytałem go co bardziej podobało mu się w hotelu. \nSerio uwazasz, że dla niego lepszy był hotel ponieważ \"inni mieszkańcy nie muszą użerać się z turystami\"? :o",
            "Przeciez to nie jest standard w hotelach.",
            "No właśnie to jest regulacja. Jak chcesz gdzieś nocować to idziesz do prawdziwego hotelu (czy taniego czy nie to już twoja wola), a mieszkania zostawia się na normalny wynajem albo na sprzedaż.\n\nCzy ci się to podoba czy nie, komfort mieszkańców powinien być stawiany nad komfortem turystów.",
            "No to geniuszu powiedz nam jakbyś to wyregulował, żeby nie było tych wyżej wymienionych problemów? Skoro to takie proste.",
            "I nigdy nie trafiłeś na dodatkowy regulamin o którym nie było mowy na stronie?\nAlbo próbę zaciągnięcia cie na rzekome uszkodzenie czy rzekome pozostaiwnie po sobie syfu(aka nie odkurzanie i nie ściągnięcie poscieli) za sprzatniecie czego właściciel żąda 500zł?\nJeśli tak to zazdroszczę",
            "No wlasnie tez nie wiem o czym on mowi. Co prawda ja w 90% korzystam z bookingu a nie airbnb, ale tak samo - mieszkania sa tansze.",
            "Jeśli nie ma AirBnB i innych firm tego typu, to nie ma takich kosztów. Miasto może kontrolować na ile hotelów pozwala. Ale nie chcę, żeby robiono z turystyki biznes tylko dla zamożnych.",
            "Śniadanie (nie zawsze, ale takich bez śniadań \"w cenie\" unikam), ręczniki w łazience, sprzątanie pokoju, mydła/żel pod prysznic są standardem w hotelach od 3 gwiazdek wzwyż, w AirBnB najczęściej dostajemy gołe mieszkanie bez niczego (zdarza się, że i może być bez pościeli).",
            "swietnie - zobacz co sie stalo w nowym jorku - zakazali airbnb i ceny hoteli sa aktualnie zabojcze, z ta roznica ze tam jest jakiekolwiek inny przemysl nizeli w Barcelonie. Turystyka spadnie, wynajm bedzie tak czy siak w szarej strefie i nastapi regresja miasta.\nTrzeba wybudowac wiecej mieszkan na ktore ludzi stac a nie zakazywac do tego wspolfinabsowane przez panstwo",
            "100+ podróży i nigdy nie miałem najmniejszych nieprzyjemności. Ani. Razu. W żadnym z europejskich krajów. \nZa to w ostatnim hotelu,  kilka dni temu, próbowali wkręcić mnie w karę za palenie, bo im się alarm uruchomil (nie palę). Przepytywali mnie kiedy pracowałem itd. Po prostu zajebistość.\n\nRóżnica jest taka, że AirBNB bookuję ja, a hotel bookowala osoba od HR.\n\nEdit: być może mamy inną półkę cenową albo inny gust, stąd też i różne doświadczenia.",
            "Ale problem jest taki, że turystów jest zwyczajnie ZA DUŻO. To akurat uroki współczesnego świata, bo gdzie kiedyś podróżowanie po świecie było rozrywką dla najbogatszych to teraz klasa średnia z nawet względnie bogatych krajów (i tak, zaliczam do tego też Polskę) może latać po całym świecie. Liczba turystów w Barcelonie od lat 90-tych do teraz wzrosła ok. 3-krotnie, z małą \"przerwą\" na COVID, a już wtedy było to popularne miasto turystyczne.\n\nTo, że liczba turystów spadnie to nie jest dla ludzi mieszkających w tych miastach coś negatywnego tylko pozytywnego. Barcelona nie jest pierwszym ani ostatnim miejscem które będzie chciał ograniczenia liczby turystów bo przez to ciężej jest żyć ludziom którzy tam mieszkają na co dzień. Oni nie chcą całkowitej likwidacji turystyki bo wielu się z tego utrzymuje, no ale musi być jakiś limit.\n\nSzara strefa w takich wypadkach to będzie mały %, większość ludzi po prostu zaakceptuje spadek zysków i wynajmie te mieszkania długoterminowo. Myślisz, że ktoś kto ma kilkaset mieszkań na airnbnb będzie bawił się (i ryzykował) w wynajmowanie tego nielegalnie?\n\nI tak, oczywiście że trzeba wybudować więcej mieszkań na które ludzi stać. Ale więcej mieszkań dla lokalsów to nie jedyny powód ograniczenia wynajmu krótkoterminowego. No i jedna z tych rzeczy jest sporo łatwiejsza niż druga.",
            "Urealnie cen podróży, zwłaszcza samolotami i samochodami powinno iść w parze z regulacjami lokalnymi"
        ]
    }
}