{
    "What's up everyone! Jason & Andrew from Billboard here. From one set of popheads to another, here it goes – ASK US ANYTHING ⬇️": {
        "title": "What's up everyone! Jason & Andrew from Billboard here. From one set of popheads to another, here it goes – ASK US ANYTHING ⬇️",
        "score": 35,
        "url": "https://www.reddit.com/r/popheads/comments/1djmox7/whats_up_everyone_jason_andrew_from_billboard/",
        "content": "https://preview.redd.it/zgqfh7akwj7d1.jpg?width=3811&format=pjpg&auto=webp&s=2098cc86d3cb6805636075fec194dc9958dad689\n\nWe're Jason Lipshutz, Executive Director, Music and Andrew Unterberger, Deputy Editor at Billboard.\n\nHow'd we do on our mid-year album + song rankings? We'll be chatting through those lists (linked below), the race for song of the summer & MORE on Friday, June 21. Talk soon! \n\n* Best Albums of 2024 So Far (Billboard Staff List): [https://www.billboard.com/lists/best-albums-2024-so-far/?utm\\_source=pinterest&utm\\_medium=social](https://www.billboard.com/lists/best-albums-2024-so-far/?utm_source=pinterest&utm_medium=social)  \n* Best Songs of 2024 So Far (Billboard Staff List): [https://www.billboard.com/lists/best-songs-2024-so-far/?utm\\_source=reddit&utm\\_medium=social](https://www.billboard.com/lists/best-songs-2024-so-far/?utm_source=reddit&utm_medium=social)\n*  Songs of the Summer details: [https://www.billboard.com/music/chart-beat/songs-of-the-summer-chart-returns-2024-1235699839/?utm\\_source=reddit&utm\\_medium=social](https://www.billboard.com/music/chart-beat/songs-of-the-summer-chart-returns-2024-1235699839/?utm_source=reddit&utm_medium=social)  \n\n>That's a wrap! Thanks for chatting with us, popheads. Talk soon!",
        "num_comments": 66,
        "comments": [
            "This AMA will start on June 21st, feel free to ask your questions in this thread and we will re-pin in a couple days once it begins :)",
            "I've always wondered, how do yall make sure there aren't repeat answers on a \"staff picks\" list? Like what is the process for making lists like this? Do you have a list of potential artists and then the staff picks who they want to write about?",
            "Thank you for joining us Billboard, as a longtime chartwatcher this is the most I've ever looked forward to an AMA!\n\nMy question is: do you think that TikTok (or a similar platform) where licensed music is utilized in user-generated content could ever be added to the Hot 100 formula? I've seen arguments both ways, where on one hand it's a source of revenue for artists/labels and therefore makes sense from an \"industry chart\" perspective, but on the other hand it isn't really direct music consumption.",
            "Do Billboard staff have their own predictions and/or wishes on which new artists will blow up in popularity?",
            "To a lot of people in this part of the internet, ever since the turn of the decade, the song of the summer according to Billboard has felt less accurate and more manufactured by fan streaming/buying. I see many people online arguing that 2020’s SOTS should have been “WAP,” 2021’s should have been “good 4 u,” and 2022’s should have been “Running Up That Hill.” Or more recently, much of the Song of the Summer chatter online has been surrounding “Espresso.” The Song of the Summer chart attempts to quantify the race but it has its shortcomings when measuring cultural ubiquity. Do you agree with Billboard’s Songs of the past few Summers? If not, what can be done to help the SOTS chart mediate streaming and sales data with a song’s summery je ne sais quoi?",
            "How do you make the song of the summer feel like an organic concept and not just like we need a song guess it's this one short of an obvious one like Call Me Maybe?",
            "Thanks for joining Billboard! \n\nThis is a very open-ended question that can go a lot of ways, but what do you all consider a \"successfull\" album  these days now that we are in a streaming era (compared to 15-20 years ago when more artists went gold/platinum in a single week)?",
            "What specific metric are you attempting to quantify in the Billboard charts? \n\nPopularity is the obvious answer, but there are multiple interpretations of that. There's breadth of appeal, how many unique listeners are tuning into a particular song, which is probably the most common interpretation. But there's also how popular that song is with an individual - some will stream a song 50 times, buy it, etc. Many in this thread have pointed out that some use the latter interpretation to their advantage, ending up with a no. 1 hit even if that song hasn't resonated with a wide audience. \n\nThen there's also recurrent rules, which don't necessarily reflect which songs were most popular in a week, but allow for charts to feel less stale. \n\nChart discussions on popheads often conclude in users claiming xyz artist doesn't \"deserve\" to be top of the charts - their song/album was not actually the most popular that week. But it's hard to say what song \"deserves\" to top the charts unless you know what criteria the charts are trying to evaluate. So I think some clarification on that would be cool.",
            "I have a question regarding the current policy on album variants counting towards sales. Recently, some artists have released numerous variants of the same album, which seems to drive up sales in a way that might not reflect genuine demand. For example, Taylor Swift's release of 38 variants for one album seems to leverage fanbase size more than actual organic sales.\n\nWould Billboard consider a policy where only one album variant counts towards the charts unless another variant offers at least 30% more material than the first? I believe such a policy could maintain the integrity of the charts and promote a more sustainable practice within the music industry.",
            "It seems that different forms of \"payola\" are still happening now - what are your thoughts on this and whether billboard cares or is doing anything about it?\n\n\nWhat are your thoughts on \"continue playing\" features on streaming platforms that will only play certain popular songs no matter what playlist or album you started with?",
            "How many times do you have to listen to a song or album before you can confidently place it on a list? And how big of a factor does a song growing or shrinking on you have? I've had plenty of songs that I start off loving and would initially place very high, but if you ask me about the same song in a month I might not care for it. But that initial obsession must be worth something right?",
            "hi guys!! I’ve listened to you both on Billboard podcasts so it’s exciting to see you here on popheads!\n\nnow that we’re somehow almost halfway through the 2020s, what do you think the defining sounds/genres of the decade will be when we look back in the future? in hindsight it’s easy to now look back at the hits of the ‘10s as part of distinguishable eras, such as EDM and upbeat pop in the early decade, tropical pop in the middle, and moodier at the end, but I still couldn’t tell you what the “2020s sound” is if there even is one yet.",
            "Increasingly it seems that there isn't really one singular song of the summer that almost everyone loves, rather a number of different songs that appeal to different fans. Like I can tell you that most Popheads regulars would NOT have considered Morgan Wallen's \"Last Night\" as their song of the summer for 2023 😂 Does the chart need to be reformulated, maybe different genres, or having an unranked list? Is the concept of the song of summer dead? Or is this just how things are now?",
            "Hi guys!\n\nIs there any artist you like on the bubbling under right now that you are hoping will break out soon? \n\nFor popheads users, it’s been great seeing Chappell Roan and Tinashe find success in 2024, so I would love to know who to keep an eye out for!",
            "has there been a particularly stressful week for chart-making / reporting that you remember?",
            "Why does Billboard still include Radio in the Hot 100? Most national charts don't include radio but Billboard is an exception.",
            "How did the idea of the Hot 100 Challenge app come about? I love it so much!",
            "What's preventing Billboard from creating more country charts? There are many countries which lack any official charts, and it would be cool to see them happening one day. Or even regional charts (like Latin America Hot 100). It would be cool.",
            "Do you see the ever increasing fan investment in the charts as a net positive or negative?",
            "What was the first album that blew your mind? Like that you loved to pieces. And what was the last?",
            "How do you manage to track every sale of an album?",
            "How different are the listenership habits of someone who actively seeks out and reads about pop music from the sort of people who passively listen to the radio bc its on and change to a different station when they dont like it? How do you figure out what sort of things work crossing over from the former group to the latter? \n\nAlso, does the way people interact with spotify/apple music playlists, be them algorithmic or editorial, mirror the way people traditionally interacted with FM radio (including the influence of payola and plugola) or is there a different enough pattern to be noticable?",
            "How do you, music journalists who must occasionally criticize popular artists, deal with stan swarms",
            "Ok three questions:\n\n1. Fav Britney Album\n2. How are you feeling about Nasty by Tinashe as “song of the summer” \n3. A lot is made about the Sixers picking Simmons/fultz over brown/tatum. I think everything makes more sense in hindsight how do you feel about\n\nI luh ya papis",
            "Hi! I've wanted to ask this for a long time now. How many pop airplay number-ones would Madonna, Whitney Houston, Janet Jackson, and Mariah Carey have had if the Billboard Pop Airplay chart had started in 1990 or earlier instead of October 1992?",
            "Has Billboard considered bringing back the old Christmas Songs chart so that holiday songs don’t take up a bunch of spots on the year-end lists?",
            "What’s the first thing you guys look at when you discover a new artist?",
            "I'm really curious about the discussion around SZA's SOS because Billboard was one of the few places that didn't include it in it's 2022 or 2023 list, likely because of its December 2022 release date. What was the decision behind that?  \n  \nAlso, in terms of rankings: I'm surprised to see album isn't ranked so far and just alphabetized, while songs are. What makes you decide that? Is it Google/SEO or just easier for when you do updates EOY?",
            "How do I apply to be a writer at Billboard? What would it take?",
            "What happened this weeks billboard 200 chart?",
            "Do you feel like radio is indicative of a songs popularity. I remember last year Mitski’s song was a streaming behemoth yet only peaked at 26 cause radio refused to play her? \n\nIt feels like in the tik tok era, radio seems to get in the way of “the democratized” music",
            "We have a nominations process and then a voting period. Then our editors go through the voting results and make sure the list properly reflects the whole staff and all the music we most regularly cover, and that it’s not too heavy on any one sound or artist – and we might move some things around accordingly. Then, finally, blurbs are assigned to staffers based on the albums and songs that they voted for. -- ANDREW",
            "We don’t want to speak for our Charts department here – they’re always considering matters like this and weighing a ton of different factors in their decisions about if or when to adjust our formulas and I can’t even grasp all of them myself. Personally, I’ve gone back and forth on this and I think I’m currently leaning towards not wanting it to impact the Hot 100 too directly – at the end of the day, it’s still just short clips of a song that are used primarily for soundtracking purposes, and too different to direct music consumption. In principle, it would be a little like integrating airplay impressions for songs that were being used for synchs in TV or YouTube commercials into Hot 100 calculations.  \n\nTikTok is such an important part of the music industry (and music culture in general) today that I totally get the instinct to integrate it directly into the Hot 100. But the songs that really impact in the purest musical way on TikTok usually end up becoming streaming crossover hits and end up impacting our charts anyway – like Djo’s “End of Beginning” or Dasha’s “Austin” this year – and ultimately I think it’s for the best that we keep it that way, for now at least. But these discussions are always evolving and I may very well feel differently about it (again) a year from now. -- ANDREW",
            "Definitely -- our editorial team is constantly trying to make educated guesses with personal biases, examining empirical evidence that an artist is going to eventually blow up while taking into account our own observations about studio innovation or live-show power. I give a ton of credit to our colleagues who spearhead franchises like [Chartbreaker](https://www.billboard.com/music/rb-hip-hop/tommy-richman-million-dollar-baby-tiktok-chartbreaker-june-2024-interview-1235700136/?utm_source=reddit&utm_medium=social), which spotlights new artists across genres making significant chart debuts, and [R&B/Hip-Hop Rookie of the Month](https://www.billboard.com/music/rb-hip-hop/bossman-dlow-interview-june-hip-hop-rookie-of-month-1235712097/?utm_source=reddit&utm_medium=social), which helps tell the story of an artist who’s likely about to graduate to stardom. Those opportunities are often based on our own informed predictions on which new artists are up next. -- JASON ",
            "I sorta answered this in a previous question, but I don’t think our SotS chart can or even should really purport to be the be-all, end-all of the Song of the Summer discussion. There’s a million anecdotal or personal-preference-based ways to determine the SotS and none of them are “wrong” necessarily. Our job is not to proclaim the One True Song of the Summer, but rather to provide an as-objective-as-possible answer to what, by our metrics, was simply the biggest song of the summer season – and I think our SotS chart does that. “Cultural ubiquity” is both impossible to objective measure and wildly dependent on one’s own cultural experience, so it’s best to leave that up to the fans to decide for themselves, I think. And that’s fine! -- ANDREW",
            "I think Song of the Summer just means different things to different people and that’s OK. We have our charts-determined Song of the Summer simply based on what the most popular song in the country us over the summer months by our consumption measurements, and I think that’s a good sort of objective ruling on the matter -- but that’s hardly the only way to judge Song of the Summer. For some people it’ll be a song that feels most like summer, for some it’ll be a song that first debuted squarely in the peak summer weeks, for some it’ll be purely based on personal (or regional) experience.  \n\nI know a lot of people who believe Cash Cobain and Bay Swag’s “Fisherrr” -- a song that has yet to even hit the Hot 100 – is the true leading contender for Song of the Summer, because it’s massive in New York and feels super-new and kinda has summer vibes to it. And even though that song would be a huge longshot on our Billboard SotS chart, it doesn’t mean they’re wrong to feel that way. That’s what makes the Song of the Summer discussion fun to me – there's any number of plausible different answers depending on your experience, and they can all be correct in their own way. There’s no way our SotS chart can possibly account for all of them, and it doesn’t have to. -- ANDREW ",
            "As you seem to sorta suggest already in your question, it’s impossible to come up with one objective standard for a successful album in 2024 – but that’s always been true, really. It depends on the artist, their own goals, the size and range of their audience, the performance of their prior albums, and a whole lot more, and there’s no one-size-fits-all answer that will satisfy everyone.  \n\nFor instance, Charli XCX’s Brat debuted with 82,000 units this week, and I think that’s a tremendous first-week total for her, given how forward-pushing her pop music is, her insistence on doing things on her own terms, and the fact that she hasn’t really had a major radio or streaming crossover hit in about a decade. Tems’ Born in the Wild debuted with about a fifth of that, but I think that’s still a pretty good performance for her, too – given her relatively lack of history on the chart, the challenges Afrobeats (or Afrobeats-adjacent) artists face in finding a reliable foothold on U.S. streaming, and the fact that there was also no huge stateside streaming or radio hit to lead into the album.  \n\nNow, if Drake had a new album debut with either of those totals, that would inevitably (and fairly) be viewed as a huge disappointment – just because he has a history of well outperforming those numbers, he regularly produces radio and streaming hits, and commercial performance is clearly a major priority for his career. But even then his expectations could be adjusted depending on its release: Honestly, Nevermind obviously underperformed compared to his albums prior to that, but it was also a major sonic left-turn that was bound to confuse and/or alienate a good deal of his audience, and clearly wasn’t meant to be an immediate commercial blockbuster. So I wouldn’t necessarily have called that a “flop” either. It all depends on context, really. -- ANDREW",
            "Again, we can’t speak for our Charts team on this – and in my opinion, there’s no real way to answer this question in one metric, anyway. We’re not only measuring the most widely heard songs in the country, we’re not only measuring the most passionately and repeatedly consumed songs in the country, we’re not only measuring the songs people hear the most passively or actively or the songs that songs that the most people are willing to spend money on to own. We’re trying to measure all of these things at once, and combine all of that data into one chart that most accurately reflects what the most popular songs in a given week are.  \n\nBut throughout Billboard history, I believe we’ve done a good job of staying in tune with the industry and with fans and adjusting our rules and formulas over the decades when our charts start to get too out of line with what the average music fan’s common-sense feeling of what the biggest songs in the country are.\n\nThat doesn’t mean everyone will always agree with our findings, and certainly there will be some moments of dissonance – particularly in this culturally diffuse era, where a song that feels like the biggest in the world in one pocket of the country (or one corner of the internet) can seem totally invisible in another. But at the end of the year (or midway through this year), when an average music fan looks at our list of Hot 100 No. 1s, I think most of them will still feel like that list does at least a decent job of capturing the songs that defined pop music and pop culture that year.\n\nThere will of course be exceptions – songs that felt like No. 1s but weren’t, songs that were No. 1s but didn’t seem so impactful – but as long as we’re more lining up with anecdotal experience than not, I feel like we’re doing OK. -- ANDREW",
            "even without the variants taylor swift will still be number one. her sales and streams actually matches her demand so using her is poor example when there’s more better examples like many kpop groups who show up on the billboard 200 out of nowhere and their streams don’t match the sales ",
            "This answer is different for everybody, because everybody goes about listing songs or albums from a different perspective, but when I’m voting for a staff list like our midyear lists, I’m trying to find a balance between immediate personal listening and sustained impact, both from my point of view and with greater cultural influence in mind. So I could have listened to Tommy Richman’s “Million Dollar Baby” 30 times in the first week of its release after falling in love with it instantly, but I voted for Future, Metro Boomin and Kendrick Lamar’s “Like That” above it on my midyear songs ballot, because it was in heavy rotation for a longer period of time, and also had an undeniably greater cultural footprint. Did I have regret over not ranking “Espresso” my No. 1, though? Of course! These things are tricky, and I might feel differently by the end of 2024, so I try to do my best to triangulate taste, importance and long-term feelings. -- JASON ",
            "Boring answer, but it depends on the list and depends on the song/album. It can be as few as a listen or two where I can feel comfortable with a ranking, or I can still feel unsure after 5-6 listens. I wish I could listen to every album I like from a given year double-digit times before even getting started on my own personal lists, but with the amount and range of music we have to listen to for our jobs, it’s just not realistic. So we do the best we can to be as informed both about what’s out there and about our own feelings on it, and then we live to list another day. -- ANDREW",
            "Great question! The immediate genres that come to mind are the re-emergence of country music as a mainstream juggernaut, the slowly growing influence of Afrobeats and amapiano, and new commercial high points for Latin music and Asian pop in North America after upward momentum for both throughout the 2010s; it’s easy to forget that, before 2020, a K-pop song had yet to top the Hot 100, and a primarily Spanish-language album had yet to top the Billboard 200! Divorcing this question from specific sounds, though, the main music trend of the decade so far is having popular songs become unstuck from time, thanks in large part to TikTok; hits can now have been released a year ago or 40 years ago, and with the right viral trend (or Netflix synch, I guess), they can rival the biggest new singles. So when we look back at this decade in popular music, maybe we won’t think about a specific sound, but about something like a dance routine to Lady Gaga’s “Bloody Mary.” -- JASON ",
            "Because pop music is much more fragmented than it was pre-streaming and smashes will never quite be as ubiquitous as they once were, the song of the summer is always going to exist in the eye of the beholder. I mean, “Last Night” was the longest-running No. 1 hit of 2023, spent all of May and June atop the chart, was enormous on streaming and crossed over from country radio to pop -- it wouldn’t have made any sense chart-wise if another song had crowned Billboard’s Song of the Summer tally last year! But look, as someone whose summer was defined more by “Padam Padam” and “Rush” than by “Last Night,” I also get it. To answer your last two questions, I do think this is just how things are now, but to me, the dissonance actually ensures that the Song of the Summer concept isn’t dead: we now simply have more debate between what defined the Hot 100 in the summertime, and what defined our own playlists. I miss the summer-dominating behemoths, but more pop music conversation is never a bad thing! -- JASON ",
            "It took me a minute but I am now all in on Remi Wolf having a mainstream moment in the near future -- everything I’ve heard from 'Big Ideas' has been pretty spectacular. I am a huge Griff fan and hoping it happens for her in North America. A few more names that come to mind: Dylan, Maude Latour, Samia, Rachel Chinouriri, Renforshort. Also I am fully prepared for the Addison Rae pop takeover, and hope you are, too. -- JASON ",
            "Jason and I don’t put our charts together, but I’d say the charts weeks that end up being the most intensive for us in terms of reporting are just the ones where someone kinda comes out of nowhere to really end up dominating the charts discussion, and we have to both figure out exactly what is going on with it and how best to cover it. Olivia Rodrigo when “Drivers License” first broke the dam is the biggest/most obvious example I can think of. Even Miley Cyrus’ “Flowers” -- we had more of an idea that was coming and was gonna be big, but the sheer massiveness of its early numbers had us scrambling a little to figure out what to do with it coverage-wise.  \n\nIt’s stressful, but it’s also extremely exciting for us. We love when stuff is really popping on the charts, especially when it’s stuff that we never saw coming – that's just fun for us as chart nerds ourselves, and as pop fans who love following a good story. -- ANDREW",
            "I actually think radio -- particularly pop radio and country radio, but for the sake of this discussion, let’s just talk about pop -- has become an underrated bellwether for which songs and artists are actually enormous! Even if the population of music fans still consuming pop music primarily through their FM dial is smaller than a generation ago, it’s still a sizable population, along with dedicated satellite and Internet radio listeners -- and pop artists desperately want to reach those listeners. Radio helped albums like Dua Lipa’s Future Nostalgia and Justin Bieber’s Justice spin off smash hits that persisted on the Hot 100 for months; most recently, top 40 programmers bought in to Sabrina Carpenter singles like “Nonsense” and “Feather,” which helped set up “Espresso” and “Please Please Please” for even greater success out the gate. Radio cannot define pop music like it once could, but it’s still a crucial tool for delivering major wins to artists and their respective projects. -- JASON ",
            "I love the daily trivia question!",
            "For us at Billboard? Definitely a positive. That's not to say it can’t make our jobs more challenging sometimes, but for any number of reasons, we’d always rather have people care too much about our chart results than not enough. \n\nFor the artists? A little more complicated, but also probably mostly a positive. Artists want to be able to celebrate their chart victories with their fans, and I think it becomes more validating for everyone – insert your Lady Gaga memes here – when it feels to everyone like they accomplished something together. I imagine some artists can get a little tired of fans who discuss a project’s success strictly in those terms without factoring in what it means to the artist or the fanbase in artistic terms, but I also think they get it. Like sports fans, pop fans are very competitive, and the charts are the closest thing we get to sports stats that we can throw in our rivals’ and haters’ faces – and most pop fans can still understand that unlike sports, where one team invariably wins and another loses, there’s countless different measurements of success in music and art, not all of which can be captured by the Billboard charts.  \n\nFor pop music in general? Also a mixed bag, but I think mostly good. Competitiveness in pop music make everyone work that much harder – and because there’s no real guaranteed path to pop success in 2024, I don’t think it encourages artists to try harder to fit a certain sonic or thematic mold, but rather just to put out the most striking, attention-grabbing and generally memorable music they can. I think that competitiveness can get a little over the top sometimes and make everyone sorta lose focus of what’s really important, but that’s true of just about every artistic field at any time in history.  \n\nUltimately, I think the charts -- and people caring about them as much as they do -- just brings more attention to pop music, and helps people that aren’t plugged in to pop’s daily happenings have an idea of what’s going on. That’s a good thing for pretty much everyone. -- ANDREW",
            "Oh man, this is such a tough one... I’ll always have a special spot in my heart for Beck’s *Midnite Vultures*, which I absolutely adored as a 12-year-old even though I had no idea what “Sexx Laws” he was talking about. OutKast’s *Stankonia* came along a year later, and that ruptured something in me, too. The last two albums that blew my mind were Gouge Away’s *Deep Sage* and This Is Lorelei’s *Box for Buddy, Box for Star* -- in both of them, I hear things that I’ve never heard anywhere else before. -- JASON",
            "The first album I ever really loved was my older brother’s cassette copy of The Offspring’s *Smash* in the mid-’90s. About five years later, my mind was blown in the HOLY SHIT HOW ARE THEY DOING THIS sense by Radiohead’s *Kid A*, and shortly after that by going back to The Beatles’ *Sgt. Pepper’s Lonely Hearts Club Band,* which I sorta knew from my parents but felt like a whole new universe to me when I listened to it on headphones for the first time.  \n\nA little harder for an album to blow my mind in my late 30s, but last year, DJ Sabrina the Teenage DJ’s four-hour dance odyssey *Destiny* did manage the trick – just an absolutely transportive and totally immersive listening experience that is probably twice as lengthy as any other new album I listened to in 2023 but never once feels *long*. -- ANDREW",
            "I think there’s a spectrum of music-listening from folks who prefer to be mostly passive consumers to folks who prefer to be very actively in charge of their music listening, and streaming does a pretty good job of catering to all of them – maybe a little better than radio, which is probably one of the reasons why streaming is the more dominant form of music consumption at the moment.  \n\nBut I think there are still similarities, particularly in the way Spotify’s Autoplay and Smart Shuffle functions can still sort of focus as a makeshift Spotify Radio station within your personalized listening experience. I see a lot of people complaining recently about artists being force-fed to them through these services -- and it’s hard for me to get up in arms about it, because as someone who prefers to actively control my own listening experience, I turned those functions off long ago. But people elsewhere on that spectrum might really rely on those Spotify recommendations either for their own music discovery, or just for enjoying music without having to think about selecting it themselves – and those people probably were (or would have been) devout radio listeners 20 or 30 years ago. -- ANDREW",
            "We ignore it as best we can, we try not to further encourage or feed it in any way, and we just wait for everyone to move on to the next thing. -- ANDREW",
            "1. Blackout \n\n2. Love it, excellent song and Tinashe has long been deserving of a commercial hit and cultural resurgence. I hope it keeps climbing. \n\n3. Despondent times for us Sixers fans, what with the dreadful Celtics winning it all and a crucial offseason that just might not work out. Chappell Roan and I have three words for our guy Daryl Morey: Good luck, babe. -- JASON ",
            "1. Femme Fatale (“I Wanna Go,” “How I Roll” + “Trip to Your Heart” forever”) \n\n2. Great song, love the remix EP, wouldn’t quite be my song of the summer because other pop songs feel bigger to me both in size and sound – but that’s one of the things I like about “Nasty,” that it feels a little culty and weird and inside. My hope is that “Nasty” tops out just short of total ubiquity -- but that as Jason alludes to, it leads to a wide-scale reappreciation of Tinashe and her entire catalog, and allows her to scale up in her career a little.   \n\n3. Simmons vs. Brown was never even a discussion in 2016, and you would’ve needed to be able to see at least four years into the future to know that it even should have been. Simmons vs. Ingram was a much realer debate at the time, and I went back and forth on that multiple times both pre-draft and post-draft. Ultimately, I don’t think drafting Simmons was really one of the Sixers’ bigger mistakes – he was a huge part of the team’s tunaround and had a number of really great seasons there. Then some weird shit happened, because it always does with the Sixers.  \n\nFultz vs. Tatum... I don’t think there was much chance of Philly taking Tatum, either, but maybe there was a world where they could’ve avoided that trade in general. It goes back to that one workout Fultz had with the Sixers before the team traded for the No. 1 pick, which supposedly went pretty badly but which the team ultimately ignored. Maybe they could’ve worked out Markelle, seen enough of the player he would become shortly to get spooked and gone, “uhhh we’re gonna hold onto the No. 3 pick after all.” But not only is that not terribly realistic – plenty of great prospects have bad workouts, you usually can’t conclude too much from them – but then Boston probably would’ve taken Tatum No. 1 regardless, L.A. takes Ball No. 2, and Philly probably gets stuck with Fultz (or Josh Jackson) anyway. So all Philly would’ve saved there was the extra draft picks they sent with No. 3 to move up to No. 1. Sigh.   -- ANDREW",
            "We’re not on the Charts team, so we don’t have the answers to that one unfortunately! -- ANDREW ",
            "If I'm looking into them for *Billboard* purposes, sorta scouting them for future chart impact? I think the best indicator of future/sustainable success is when an artist has multiple songs moving at once. The clearest sign that Chappell Roan was breaking out in a massive way wasn’t when “Good Luck, Babe!” had its splashy Hot 100 debut, it was when *The Rise and Fall of a Midwest Princess* belatedly bowed at No. 127 on the Billboard 200. Because that wasn’t due to any one song, but basically the entire album rising at once (with “Red Wine Supernova” and “Hot to Go!” leading the way). When an artist receives that kind of wide catalog interest, it usually means they’re going to be unstoppable in pretty short order.\n\nIf I’m looking into them just for my own purpose? I guess mostly I’m looking for a kind of undefinable “Who is THIS?” quality when I first listen to them. I listen to so many new artists/albums/songs in a given week (often while busy with other stuff) that I can’t always give my full attention to all of them – but if they’re able to command my attention no matter what I’m doing, either because their songs are that catchy, that striking or (best of all) just that unexpected, then they often end up being pretty exciting to me, and I’ll usually investigate further. -- ANDREW",
            "With SZA, it was simply that the album was released in early December just after we had already published our albums list in 2022 – and topped the Billboard 200 immediately -- and we have a pretty hard policy of not counting albums/songs for a particular year’s staff list unless they either were released or peaked on the charts within that calendar year. Was certainly tough to not be able to rank *SOS* for either year, and it is absolutely widely beloved on staff, but that’s just the way it happened to break for that album that year. (The same thing happened with Harry Styles’ *Fine Line* a few years earlier.)  \n\nAlbums we feel it’s better to give a little more time to before really committing to any rankings for a given year. Songs I think we feel like we can get a little bit of a better handle on by the midyear point in that respect. And personally, I like that we leave a little bit more mystery for the end of year with our staff’s albums list by having it unranked at midyear – both for our readers and for ourselves. -- ANDREW",
            "I'm not a billboard writer but Gotham Writers Workshop has coaching and resources that could probably point you in the right direction",
            "Love this take, thank you for your response! I totally agree with this. A lot of people were saying Dua was a flop in the US but she actually debuted higher than she did with future nostalgia (I think)!",
            "Thanks for the answer!",
            "Some will remember it forever Andrew.",
            "Awesome response. Thank you."
        ]
    },
    "20th Century Piano Men: Greatest Hits (Billy/Elton/Stevie)": {
        "title": "20th Century Piano Men: Greatest Hits (Billy/Elton/Stevie)",
        "score": 32,
        "url": "https://www.reddit.com/r/popheads/comments/1co3kcr/20th_century_piano_men_greatest_hits/",
        "content": "#Intro\n\nNo one knows when the piano was invented. We have pianos surviving as early as 1726 and records of them existing by 1700, leaving their creation sometime in the late 17th century. However, it’s hard to imagine modern music without it. It’s a very versatile instrument, showing up in music from early ragtime and jazz to modern electronic and hip-hop. In the 20th century, it was a mainstay instrument in what we consider “pop music.” During that time, three men became ubiquitous with the instrument: Billy Joel, Elton John, and Stevie Wonder. I am /u/ImADudeDuh and over the course of the next month, we will be determining which hit of these legends' is the best!\n\n---\n\n##Billy Joel\n\nBilly Joel is so entwined with the piano that he is known as “The Piano Man.” With his father as a pianist and starting piano lessons at 4 years old, the piano and Billy have been together for most of his life. After not graduating high school, he made the choice to pursue a music career, eventually signing to Columbia records. His first hit single for the label was “Piano Man,” a song that perfectly defines his legacy for the next 50 years. Billy became known for his lyrical storytelling, his piano playing, and for being the quintessential New Yorker. Joel has sold out Madison Square Garden 100 times, with the 100th being the subject of a recent TV special. \n\nRecords Sold: over 150 million  \n\\#1 Hits: 3  \nHot 100 Hits: 43  \nPlatinum Albums: 20  \nGrammy Nominations: 23  \nGrammy Wins: 5  \nSpecialties: heartfelt ballads, Motown-esque throwbacks, and love songs cheesier than a dish at an Italian restaurant.  \n\n###Songs: \n\n1. Piano Man  \n2. New York State of Mind  \n3. Just the Way You Are  \n4. Vienna  \n5. Movin' Out (Anthony's Song)  \n6. Only the Good Die Young  \n7. She's Always a Woman  \n8. Scenes from an Italian Restaurant  \n9. My Life  \n10. You May Be Right  \n11. It's Still Rock and Roll to Me  \n12. Tell Her About It  \n13. Uptown Girl  \n14. The Longest Time  \n15. We Didn't Start the Fire  \n16. The River of Dreams  \n\n\n---\n\n##Elton John\n\nElton John is probably the most “relevant” artist of the three today, with him currently sitting at over 50 million monthly listeners on Spotify. From albums of duets in 1993 and 2021, and soundtracking classic films like The Lion King and Gnomeo & Juliet, Elton has lent his talents to others, which may have helped keep up his musical prestige throughout the years. He’s a very versatile performer, dabbling in genres from glam rock to blues to country. In 2023, he received all the awards necessary to earn an EGOT. Elton is most known for his extravagant style of showmanship, but don’t let the feathers fool you, he can sing some heartbreaking songs. \n\nRecords Sold: over 300 million  \n\\#1 Hits: 9  \nHot 100 Hits: 73  \nPlatinum Albums: 31  \nGrammy Nominations: 35  \nGrammy Wins: 5  \nSpecialties: doing the most on piano, doing the least on piano, and totally 100% heterosexual love songs  \n\n###Songs:  \n\n1. Your Song  \n2. Tiny Dancer  \n3. Rocket Man  \n4. Crocodile Rock  \n5. Daniel  \n6. Saturday Night's Alright  \n7. Goodbye Yellow Brick Road  \n8. Candle in the Wind  \n9. Bennie And the Jets  \n10. The Bitch is Back  \n11. Don't Go Breaking My Heart (with Kiki Dee)  \n12. Sorry Seems to Be The Hardest Word  \n13. I Guess That's Why They Call It The Blues  \n14. Nikita  \n15. I'm Still Standing  \n16. Don't Let The Sun Go Down On Me (with George Michael)  \n\n---\n\n##Stevie Wonder\n\nStevie Wonder started his career by breaking a world record. His first charting single, ‘Fingertips Pt. 2,’ got him the record for the Youngest Solo Artist to Hit #1 at 13 years old, a record that still holds today. Throughout the latter half of the 60s. Stevie cemented himself as a Motown legend. However, in the mid-1970s, Stevie started his golden era. His album run from Talking Book to Songs in the Key of Life is one of the most legendary 4 album runs in music history, a time where Stevie became the only person to win Album of the Year for 3 consecutive releases. He was known as one of the best Soul and Funk artists ever. Even after that historic period, Stevie still managed several hits and even #1s throughout the 80s, and is still one of the most beloved artists of all time. \n\nRecords Sold: over 125 million  \n\\#1 Hits: 10  \nHot 100 Hits: 63  \nPlatinum Albums: 5  \nGrammy Nominations: 74  \nGrammy Wins: 25  \nSpecialties: Funk, Soul, whatever you call his stuff in the 80s  \n\n###Songs: \n\n1. Fingertips Pt.2  \n2. Uptight (Everything’s Alright)  \n3. For Once in My Life  \n4. My Cherie Amour  \n5. Signed, Sealed, Delivered (I’m Yours)  \n6. You Are the Sunshine of My Life  \n7. Superstition  \n8. I Wish  \n9. Sir Duke  \n10. As  \n11. Isn't She Lovely  \n12. Higher Ground  \n13. Do I Do  \n14. I Just Called to Say I Love You  \n15. Part-Time Lover  \n16. Master-Blaster (Jammin')  \n\n---\n\n###Rate Rules\n\n^credit ^to ^whoever ^made ^this ^originally, ^these ^have ^been ^used ^for ^so ^many ^rates\n\n- Listen to every song listed and give it a score between one (1) and ten (10). Decimal points are allowed, but only to one place (ex. 7.1 is acceptable, but not 7.15). Hosts do not care what score you give the songs as long as it is between those two numbers.\n- You **have to rate every single song in the rate.** If you skip any and do not give me a score when I ask you for one, your ballot will not be counted. This is because the program used to determine the results will break if scores are not successfully put in and I will have a mental breakdown if the program doesn't work because it will be a pain in the ass to do this manually.\n- You may give **one song a zero (0)** and **one song an eleven (11)**. These should be reserved for your favorite track and least favorite track. **If you do use either your zero (0) or your eleven (11), it is strongly encouraged to leave a comment on the track.** It can be as short or as long as you want, but please leave one; it will help the sub understand if you should be canceled or not when the rate is being revealed.\n- Please use the prepared link to submit your scores! That is the only form of ballot we will accept. We spent a lot of time and effort on it, so please use it.\n  - Note: if you're trying to access on a mobile device or on the new reddit layout, it may not work; I have made it so the link will take you to old.reddit.com, so you should use a computer to send in your scores (if possible)!\n- If you desire to change any of the scores after you have already submitted them, simply message me and I will be glad to help!\n- If we believe your scores include any form of sabotage (which would be weird for a Billy Joel/Elton John/Stevie Wonder rate), we reserve the right to reject your ballot. Sabotage is defined as extremely low overall average(s) that shows a clear bias towards or against one artist within the rate. If you truly hate the songs given low scores, we strongly encourage you to write comments on them. This indicates to us that you are not trying to rig the results, meaning everything will go smoothly. :)\n- Your scores should not be considered confidential! Don't be scared to share them. Go nuts. Campaign for whatever song you gave an eleven to. Or not. This whole thing really is not that deep.\n\n&nbsp;\n\n###Commenting Guideline\n\nIt is also highly encouraged that you add song comments to your ballot! Do this by adding a space after the score and then typing to your heart's desire, like this:\n\n> Your Song: 10 I can tell everybody this is a bop!\n\nYou can also leave comments for artists! In order to do so, just add a colon after the artist you’d like to comment on and leave a comment like this:\n\n> Artist: Billy Joel: Wow, he’s so good, I wish New York was real.\n\nAny format other than this is NOT good and you will deeply hurt me if you do not follow the example given here. This includes:\n\n> Superstition: 1: this is scarily bad!\n\n> We Didn’t Start The Fire: This song is FIRE 🔥🔥🔥PUT IT OUT 🔥🔥🔥1\n\n> Don’t Go Breaking My Heart: I’m giving this a 9 cause I’m a Kiki Dee stan for life.\n\n> Mi Cherie Amour: 10, Even the French jumpscare can’t bring this song down!\n\n---\n\n#[YouTube Playlist](https://www.youtube.com/playlist?list=PL85bVGDu5pYeUzPl-OxXrKvERJhABYb9d)\n\n#[Spotify Playlist](https://open.spotify.com/playlist/0pNnUAcyCAkAyIK6w1FB5m?si=d28f10841dac411d)\n\n#[Apple Music Playlist](https://music.apple.com/gb/playlist/20th-century-piano-men/pl.u-GgA55lgCoMXxy2v) made by /u/impla77!\n\n#[Submit Scores](https://old.reddit.com/message/compose?to=ImADudeDuh&subject=20th%20Century%20Piano%20Men%3A%20Greatest%20Hits&message=Username%3A%20%0A%0AArtist%3A%20Billy%20Joel%0A%0APiano%20Man%3A%0A%0ANew%20York%20State%20of%20Mind%3A%20%0A%0AJust%20the%20Way%20You%20Are%3A%0A%0AVienna%3A%0A%0AMovin'%20Out%20%28Anthony's%20Song%29%3A%0A%0AOnly%20the%20Good%20Die%20Young%3A%0A%0AShe's%20Always%20a%20Woman%3A%0A%0AScenes%20from%20an%20Italian%20Restaurant%3A%0A%0AMy%20Life%3A%0A%0AYou%20May%20Be%20Right%3A%0A%0AIt's%20Still%20Rock%20and%20Roll%20to%20Me%3A%20%0A%0ATell%20Her%20About%20It%3A%20%0A%0AUptown%20Girl%3A%20%0A%0AThe%20Longest%20Time%3A%20%0A%0AWe%20Didn't%20Start%20the%20Fire%3A%20%0A%0AThe%20River%20of%20Dreams%3A%20%0A%0AArtist%3A%20Elton%20John%0A%0AYour%20Song%3A%0A%0ATiny%20Dancer%3A%0A%0ARocket%20Man%3A%0A%0ACrocodile%20Rock%3A%0A%0ADaniel%3A%0A%0ASaturday%20Night's%20Alright%3A%0A%0AGoodbye%20Yellow%20Brick%20Road%3A%0A%0ACandle%20in%20the%20Wind%3A%0A%0ABennie%20And%20the%20Jets%3A%0A%0AThe%20Bitch%20is%20Back%3A%0A%0ADon't%20Go%20Breaking%20My%20Heart%20%28with%20Kiki%20Dee%29%3A%0A%0ASorry%20Seems%20to%20Be%20The%20Hardest%20Word%3A%0A%0AI%20Guess%20That's%20Why%20They%20Call%20It%20The%20Blues%3A%0A%0ANikita%3A%0A%0AI'm%20Still%20Standing%3A%0A%0ADon't%20Let%20The%20Sun%20Go%20Down%20On%20Me%20%28Live%20with%20George%20Michael%29%3A%0A%0AArtist%3A%20Stevie%20Wonder%0A%0AFingertips%20Pt.2%3A%0A%0AUptight%20%28Everything's%20Alright%29%3A%0A%0AFor%20Once%20in%20My%20Life%3A%0A%0AMy%20Cherie%20Amour%3A%0A%0ASigned%2C%20Sealed%2C%20Delivered%20%28I'm%20Yours%29%3A%0A%0AYou%20Are%20the%20Sunshine%20of%20My%20Life%3A%0A%0ASuperstition%3A%0A%0AI%20Wish%3A%0A%0ASir%20Duke%3A%0A%0AAs%3A%0A%0AIsn't%20She%20Lovely%3A%0A%0AHigher%20Ground%3A%0A%0ADo%20I%20Do%3A%0A%0AI%20Just%20Called%20to%20Say%20I%20Love%20You%3A%0A%0APart-Time%20Lover%3A%0A%0AMaster-Blaster%20%28Jammin'%29%3A%0A%0AEND)\n\n#[Backup Pastebin](https://pastebin.com/yUfZ9tfN)",
        "num_comments": 15,
        "comments": [
            "It's been so long but it's finally here! I know ballads and old and men are not Popheads' favourite things when it comes to rates but there's so many standout tracks that I'm ready to give 10s out like candy",
            "Three of the most iconic artists of all time in one rate, this is gonna be an absolute BLOODBATH and you can bet I'll be throwing out 10s like candy. But also any winner other than Superstition is objectively wrong!",
            "Rooting for Billy to win with any song that isn't Piano Man",
            "Legendary event of the year OMG",
            "Goodbye Ye11ow Brick Road",
            "Give S11r Duke the flowers it deserves!",
            "I will try to be as objective as humanly possible but this is going to be tough ",
            "Wanna get a be11y full of beer 😉 🍺",
            "This will be so fun, and I am ready to be sentimental over Your Song and give it a possible 11 (or Stevie! But none for Billy Joel)",
            "personally, my 20th century piano men are ives/porter/berlin, amongst the fine gentlemen like Art tatum and mr. monk and keith jarrett who played their ditties on the piano! \n\nsadly no standards this rate (unless im a dummy) or any of those chaps but I love these three men and when they get on the piano (or in the case of stevie, TONTO) they sure do rip!\n\nan exciting rate, wonderful curation. been super jazzed to see this one come together. look forward to my ballot :)",
            "Dear lord this is going to be the real VOTE 2024 🥵🥵",
            "New York State of Mind made it!! Might have to be my 11 though there are sooooo many options. Also getting my dad to do this rate so uptown girl haters rejoice (he will be giving it a 0)",
            "surely when we do mid-20th century standards songbook piano men, the crowd will hoot and holller for Cole Porter! That man is a gay icon!",
            "b-but guido rights :,)",
            "I will also try not to write a full paragraph for each Billy song"
        ]
    },
    "Best New Track (Pitchfork) - Charli XCX / Lorde: “The girl, so confusing version with lorde”": {
        "title": "Best New Track (Pitchfork) - Charli XCX / Lorde: “The girl, so confusing version with lorde”",
        "score": 1914,
        "url": "https://pitchfork.com/reviews/tracks/charli-xcx-the-girl-so-confusing-version-with-lorde/?utm_source=instagram&utm_medium=social&utm_content=instagram-bio-link&client_service_id=31190&client_service_name=pitchfork&service_user_id=1.78e+16&supported_service_name=instagram_publishing&utm_brand=p4k&utm_social_type=owned",
        "content": "",
        "num_comments": 145,
        "comments": [
            "**Please do not comment on just the scores without any further explanation. Comments that refer only to whether the score too high or low, or are along similar lines will be removed**\n\nPlease report any comments that are low effort discussion. Thanks!\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/popheads) if you have any questions or concerns.*",
            "they haven't named anything best new track since charli's own von dutch back in march it is serious for them",
            "Post-release album singles rarely get a Pitchfork review, remixes even less so. They knew they had to give this track Best New Music immediately. Great recognition for a remix that truly elevates and improves upon the original song.",
            "This is one of the greatest collabs I’ve ever seen for a remix. Everything about it is genius. The original song, its context within the vulnerability of brat, its context within Charli’s broader career, then the fact the subject of the song actually makes the remix and responds with counterpoints to everything in the original? Incredible. \n\nMost remixes are lazy as hell, and the featured artist usually only gets like 1 lyric and some ad libs, but Charli gave Lorde an entire *half* of the song to express her own feelings, and respond in kind to Charli’s.\n\nThis remix is so incredibly multi-layered and I don’t think we’ll see something like it again for a very long time.",
            "I could’ve cried listening on the way to work this morning \n\n“\"Girl, you walk like a bitch\"\n\nWhen I was ten, someone said that \n\nAnd it's just self-defence\n\nUntil you’re building a weapon\n\nShe believed my projection\n\nAnd now I totally get it\n\nForgot that inside the icon\n\nThere's still a young girl from Essex”\n\nMade me think of the lack of communication that has allowed for relationships in my life to suffer (platonic or not) and it just sucks how much it can impair your perception of who people in your life actually are",
            "So why isn’t this on New Music Friday on Spotify 🤨",
            "This song made me incredibly emotional not gonna lie. Literal crying in the club right now music",
            "This is the best remix Charli has released for brat!! 💯☝️",
            "So deserved my god. This is the new telephone and the closest we’re ever getting to a part 2.",
            "Yeah.. yeah.. i know that’s right\n\n*insert olivia wilde nod gif*",
            "Honestly thinking of switching the original track to the remix in my Brat album playlist. Or stuck it right after the original lmao.",
            "This song is what fully convinced me charli deserves best pop vocal album for her work.  This album rollout is a complete culmination of her career, she’s mad inspiring",
            "Between this and \"I think about it all the time\" this bitch* charli won't stop making me cry in the club \n\n*said with love of course",
            "These remixes better be a condensed album sold as a body of work. They’re all so good and don’t deserve to be lost due to being a single.",
            "The nicki companion with lordes verse??? 😭",
            "Hashing out beef on a remix is such a smart idea.",
            "It’s what they deserve. Lorde’s verse is easily some of her best songwriting and their voices mesh so well together.",
            "That moment when you, a Queen, come across another Queen, and discuss how best to maximize your joint slay",
            "I don’t understand why Pitchfork even does best new track anymore if they’re only gonna give it out once every couple on months. The last one they gave out was Von Dutch on March 1st lmao",
            "Hope it gets a nom at the Grammys so we can get a live performance like it’s too good of an opportunity to pass up to have two girlies from the same gen have this moment together",
            "Honestly crazy how much Charli has been on a roll lately. Happy to see her work finally get proper recognition from both fans and critics alike",
            "It was breathtaking honestly\n\nI honestly didn't realize how much I missed lorde.",
            "Now Halsey just needs to forgive Pitchfork and we'll be full circle",
            "We’ve been waiting for Charli to get this sort of recognition for years. It feels so surreal, I can’t imagine how she’s feeling",
            "I’m fully expecting this remix to be in their top 5 year end songs for 2024 if not number one",
            "Hope her label makes this the next single and we get a music video too!",
            "Queens shit",
            "good read except for the solar power slander 🤭",
            "The remix album is probably gonna have best new music too at this point.",
            "I am obsessed with this! Constructive alternative to diss tracks with so much feminine power, genius. Plus it absolutely slaps",
            "If this album doesn’t get at least best pop album at the Grammys it’s going to cement the fact that they are a complete scam.",
            "QUEEN SHIT",
            "I really don’t like pitchfork most of the time. \n\nBut when they’re right, they’re right. This is the best track from Charli since… fuck, probably since she was working with Sophie. \n\nI really want a Charli/Lorde EP now. Don’t really think we’ll ever get it, but it’s pretty clear that they made magic here.",
            "I get chills just thinking about a live performance of this...",
            "I’m so overjoyed by this song. It was already in my top 3 for the album, but Lorde’s verse hit me like a truck. It’s been a decade since these two blew up, I think we all feel the catharsis.",
            "I have to admit, I reached the end of the first paragraph and then quickly scrolled back up to check if I was indeed reading a review of Charli’s new single.",
            "This is so correct.",
            "this shit made me cry like …. so fucking good wtf",
            "yep this song is everything - Lorde wrote such a beautiful verse.",
            "Let me preface this by saying I’m not a Lorde fan. I got downvoted yesterday as well for my lack of excitement by this feature. \n\nHOWEVER - this is pretty great. The lyrics are direct, to the point and very honest. I like the strange way Ms. Lorde moves on the beat as well. She keeps up and matches Charli’s vibe 100%. I’ll be listening to this a lot because I wasn’t super hyped about the original version of this song, but this version truly does elevate it. \n\nWe’re really witnessing alternative pop history with this album cycle. I fucking ride for you, Charli!",
            "this song could not have come for me at a better time ngl",
            "As it should be 💁🏻‍♂️",
            "I liked it",
            "I'm really obsessed with BRAT & HEAT so freaking amazing how charli revive the club music with this LP and the extended is getting more and more incredible ✨✨✨✨",
            "YEEEEES",
            "I really don’t understand the hype, and I’ll be downvoted to high hell for saying that. It just feels clunky and not as deep/poetic as everyone is making it out to be. I feel like if this was a Taylor song everyone would be slamming the lyrics, but because it’s Charli & lorde over an aol dialup beat suddenly it’s brilliant. Make it make sense",
            "Tbh it’s the only song from the new album I love. The rest… they’re okay-to-good, but I really don’t understand the level of praise Brat is getting. ",
            "Pitchfork is really a joke 🤣",
            "God von Dutch gets me so fucking hype",
            "artistry shines through",
            "And it’s only the third best new track of the year (other track is Life Is by Jessica Platt)",
            "yeah but they did get gutted of staff recently",
            "Not saying this remix or Von Dutch doesn't deserve it (it's one of my top songs of the year) but their BNTs are worthless nowadays",
            "This is like the reverse Kendrick Drake beef that the industry needed.\n\nThe raw honesty and exposed nerve realism , theater or not is so refreshing and cool to witness.",
            "I wish this remix would have been in the album!",
            "Agree, i also love how the original track was out there for a couple weeks to get everyone talking and guessing it’s about lorde only for the remix to drop explaining both of their sides and hashing it out ugghhh",
            "I cried when I first listened to it, and then immediately replayed it. Then I cried again listening to it at the gym.",
            "Made me want to reach out to someone I haven't spoken to in a while",
            "I keep wanting to yell this all day. Thank God I’m home from work now I can (and am)",
            "the playlist is missing so much it’s crazy",
            "They usually avoid putting remixes or different versions of songs that are already out on it",
            "it's unfortunately too relatable. I'm like damn I need to talk to my friends lmao",
            "I was not expecting to cry to a hyperpop track but there I was tearing up in my kitchen.",
            "Between this, Von Dutch with Addison and AG, and the 365 shygirl and easyfun remix, brat remix is looking unstoppable",
            "Why are the remixes low key better than the originals?",
            "I replaced it on mine. The production is the same and Lorde's verse adds so much so I don't feel like I'm missing something.",
            "no put them back to back. creates a whole new story. do it for the rest of them too !!!",
            "I've done that for 360 and von dutch remix, 100% recommend",
            "we need an extended 3 verser",
            "brat but it’s the same but it’s only remixes so it’s not",
            "Barbz: 😍\n\nLiterally everyone else: 😱",
            "They're wrong for that. I just wanted to celebrate a pop girl W, not remember that cum on a cone existed",
            "My smile disappeared so fast when I got to that line smh",
            "I assume the GQ-acqusition layoffs have really affected their output because they've definitely slowed down with their reviews as well. It's a shame but simultaneously, I feel like churning out BNTs doesn't require THAT much effort compared to album reviews and it's not like there haven't been great tracks since March...?",
            "The I think about it all the time remix with Halsey next pleaseee",
            "I hope this joke never dies, it’s too good",
            "i hope she never forgives them until they give her the appreciation her last few albums deserve\n\nedit: I looked it up and she honestly doesn't get terrible reception, but her last album was BNM worthy and I'll die on that hill with her haha",
            "Literally though, since Vroom Vroom\n\n\nIt's making me emotional ",
            "I’m praying for a music video",
            "Hell yea they do 😮‍💨",
            "I think it’d be nominated for dance pop, right? Which Idek what would be up against it that could come close to winning",
            "Also not a Lorde fan but extremly stoked on this remix. Lorde met Charli's vulnerability on this album and didn't hold back. I like this remix more than the original because it takes the track from being an idea and thoughts to a fleshed out story with resolve. Im also a kiwi so seeing Charli colab with a another kiwi is super exciting to me. Just the epicness of it all makes for a heady time but besides that the song is absolutely elevated because of Lordes involvment and that's awesome.",
            "i think lorde mimicked charlie’s stream of thought, plain language kind of writing for the remix and it just fits the vibe so well. like, it’s clunky by design. it’s not everyone’s style but i think that’s why it’s hitting so hard for people who love charli",
            "Tbh, I don’t think it would’ve worked as well if it WAS super poetic. The whole theme of the song is about speaking complex feelings plainly to clear the air, so it feels right that they’re just putting these feelings out there without a ton of varnish. The simplicity strengthens the impact for me, and I don’t think it would’ve worked at all if it was super poetic/flowery/metaphorical.",
            "kinda impossible for this to be a taylor song as its entirely about empowering the woman around you despite all the ways society tries to pit women against each other.\n\nyou can dislike the music but don’t act like the commentary charli is creating isn’t refreshing for the music industry which has seemingly abandoned any radical aspirations post me-too",
            "Taylor's lyrics are garishly verbose, which makes her attempts at honesty convoluted and disingenuous. I mean, despite all the things she said, it all just boiled down to her troubled relationship (if we should even call it one) with Matty. Like, seriously. So anticlimactic. Nothing thoughtful or revelating.\n\nCharli and Lorde, however, are keeping it real. No fancy language to obfuscate a shitty message about boys and yada yada. Just pure, unadulterated realness on their end about insecurity, self-hatred, and the industry's financial incentives to pit women against each other.",
            "The von dutch remix with FKA twigs when ",
            "It makes me feel like a bottom",
            "We are all hoping for a remix album, please charli",
            "Same, just received my green picture disc today which I’m stoked about, but I wish it also had this remix and the deluxe tracks",
            "But I do truly adore the idea that the remix only exists because the solo version reached someone she fell out of touch with.",
            "I’m sorry but way to completely miss the point of this whole rollout lol. Releasing the original, having the entire internet guess as to who this is about and mentioning how everyone would freak out about a collab and then releasing a remix *with them* on it two weeks later is just an absolute genius move and made the impact that much stronger.",
            "It’s so confusing sometimes ❤️❤️",
            "It’s such a banger but also such an interesting introspective song. Them working out their feelings and getting both perspectives is done so well. \n\nI also have people I’ve distanced myself from because I was scared of (stupid) things, or got insecure. But those people probably thought I was a bitch too",
            "Did everything come out, teenage petulance?",
            "i listened to it probably 10 times in a row.",
            "lame",
            "The whole album is weirdly relatable it feels like being 20s 30s with no kids",
            ">!The 360 remix with Robyn and Yung Lean is better than the original 🙊!<",
            "The WHAT NOW 365 REMIX WITH SHYGIRL AND EASYFUN!?",
            "Halsey literally called for a second 9/11 to shut pitchfork up lol",
            "‘You’re all about writing poems but I’m about throwing parties think you should come to my party and put your hands up’ is a whole banger.",
            "actually there are very subtile changes in production, that to my ears at least they have 2 different vibes.",
            "yeah the song feels incomplete with Lorde's verse on it.",
            "I added the Lorde version right before 365 as a sort of late conclusion a while after the original as the conflicts on the album start to resolve",
            "ooo",
            "Which line?",
            "COWBOY CARTER got best new album, but tbh YA YA or II HANDS II HEAVEN deserved best new track treatment",
            "Damn, an inspired choice that would destroy me given how publicly Halsey had struggled with conceiving and miscarriages over the years before having a baby.",
            "I agree, 100%. “Let’s work it out on the remix” is such a fucking epic line as well. Lorde wrote an incredible verse!",
            "What was the fresh commentary being made though? I don’t feel like the message of this song is anything that hasn’t been said, and I don’t think lyrically this is particularly creative or exciting. Lorde has touched upon topics of anxiety and self doubt/self loathing and done so more poignantly.\n\nAnd the narrative of women-hating, villainous Taylor is tired.",
            "The irony in this critique as you unnecessarily  throw around words like obfuscate and garishly verbose 🤣",
            "Everything is romantic sounds more twigs to me",
            "Do we need another vin Dutch remix when Addison Rae already served highest cuntress on the first one",
            "Least horny r/popheads user",
            "Relatable content",
            "Unleash Lean and Robyn pls",
            "Yeah I think the delayed release works perfectly/ part of the concept",
            "Fuck it if we can’t have 👯‍♀️them👯‍♀️",
            "Eh. It sucks this time but imagine if you had to sit through 5 new shitty Taylor remixes every week lol",
            "Yung lean sounds so good on it",
            "Robyn’s such a bad bitch on that remix totally agree",
            "360 original has my heart because of the hook and it being the start to Brat, but the remix is so cool, breezy and effortless... the way they trade lines always makes me wonder if I should start listening to that one more",
            "both are so good but the remix is an ear worm",
            "No lies detected 🚨",
            "It’s the version she was playing in the Boiler Room/Party Girl teasers and she’s performed it live in the Brat shows",
            "HAHAHA I had almost the exact comment typed out, my night just got so much better 🙏🙏",
            "What???",
            "The line where the writer of this article referenced Nicki",
            "taylor behaves like a woman hating villain so. maybe she should work on that if she finds it tired (i think many of us would agree that it’s tired!)\n\nalso arguing for poignancy in a club song is clearly you missing the point. just have fun or don’t listen. \n\nyour swiftie is showing btw 🫶😭",
            "El Guincho produced Everything is romantic and he's the main producer of Rosalia's discography and Twigs' Caprisongs. I hope one of them jumps on the remix.\n\nWorst time-line : Camila is featured since El Guincho co-produced her new single and I luv it.",
            "i demand an exception as poetic justice!!",
            "After a bad review she tweeted to say someone should “bomb what ever basement pitchfork is run out of”\n\nThat basement was the new World Trade Center…..",
            "After a lukewarm review she said something about bombing the basement pitchfork operates in, but its headquarters are actually in NYC, hence the “second 9/11” joke.",
            "I wasn’t demanding a club song to have great depth, but the commentary around the track seemed to by celebrating it for such. I just thought it was funny considering the simplistic lyrics and delivery and used Taylor as an example cuz she’s been dragged for TTPD and what people have called it’s high school level lyrics.",
            "Yeh exactly! It specifically reminds me of darjeeling",
            "all i could think of was caprisongs when i heard that so makes sense",
            "which further makes me thing that charli isnt the slightest bit bothered by camilla lol",
            "I get all of that but what does that have to do with my comment??? lmfao",
            "I think they were more confused about how that reply had nothing to do with their comment 😭",
            "Their headquarters are not just in NYC, they’re in the World Trade Center 😭",
            "That’s gonna need more than a remix",
            "Oh lol sorry!!! Someone was def talking about Halsey where I thought I commented \n\nV funny reading yours then my rando one lol",
            "😭this is so funny",
            "😭😭"
        ]
    },
    "Forbes accuses Spotify of 'payola'": {
        "title": "Forbes accuses Spotify of 'payola'",
        "score": 268,
        "url": "https://www-forbes-com-mx.translate.goog/usuarios-de-spotify-exponen-uso-de-payola-dentro-de-la-plataforma-de-streaming/?_x_tr_sl=es&_x_tr_tl=en&_x_tr_hl=en&_x_tr_pto=sc&_x_tr_hist=true",
        "content": "",
        "num_comments": 114,
        "comments": [
            "I used to really like the spotify radio feature it make quick vibey playlists but lately it’s been unusable. Like tell me how making a radio with a 90s alt rock song creates a playlist with 7 Billie Eilish songs and 10 Taylor Swift songs, both from their new albums? I’m a fan of both artists but it’s really annoying",
            "Not me, ESL, discovering payola is actually a word and not an internet slang 💀",
            "Spotify is becoming the new radio",
            "They have been doing it for ages but yeah might have overdone it recently specially with Sabrina.",
            "Yea Sabrina has clearly been pushed so hard to be the next new thing",
            "Forbes writes:\n\n>\"A clear example that has currently been seen with the Spotify algorithm and the 'new' payola, is the latest 'hit' of the pop singer Sabrina Carpenter, “Please Please Please”, which in less than two weeks managed to surpass artists consolidated figures in the industry such as Bad Bunny, Ariana Grande, Kanye West, among others, by climbing to the top of the platform's playslits, regardless of the genre they focus on. Suddenly, we hear one from Peso Pluma and then the one from Sabrina Carpenter comes out…  \n  \nAccording to an article published by [PopFiltr](https://translate.google.com/website?sl=es&tl=en&hl=en&prev=search&u=https://www.popfiltr.com/articles/all-top-50-artists-on-spotify-have-sabrina-carpenters-please-please-please-at-number-2-on-their-artist-or-song-radios), the promotion given established stars within the industry managed to divert at least 2.5 million dollars from other independent artists, which is equivalent to almost 4 million minutes played on Spotify, figures that could continually grow due to payola.\"\n\nMany users took it to X to write about their experiences and share how Sabrina Carpenter's 'Please Please Please' shows up on completely unrelated playlists.\n\n>After seeing a user on X/Twitter post about \"PPP\" playing after a fart track, [we searched \"Fart\" on Spotify and created a Fart Radio, and \"PPP\" still took the 2nd position](https://www.popfiltr.com/articles/all-top-50-artists-on-spotify-have-sabrina-carpenters-please-please-please-at-number-2-on-their-artist-or-song-radios) among the fart “songs.”",
            "Everything Spotify does has been like this - shuffle isn’t random it recommends songs Spotify wants you to hear , same with radio same with AI DJ",
            "It was about time Spotify started getting called out. Sabrina's impact!",
            "I mean, they’ve been doing it for ages. Drake, Taylor and the Weeknd specifically.\n\nI have the three of them muted and spotify will notify me of their concerts, new music, etc. Like everytime I open the damn app. \n\nBut with Sabrina I guess it’s a whole other level when you put her on every single playlist lmao",
            "Not surprised at all, same thing happened with espresso 😭 that song would play every 2 seconds for me it was insane, haven’t had it happen with please please please yet though",
            "P3 plays after anything on my spotify. Literally played after Guns n Roses. I'm not complaining because that song slaps but surely it's getting annoying for other people who don't listen to her.",
            "That's how they get massive incomes duh\n\nJust like radios back then",
            "Please please please and espresso playing in every single song radio is the reason I’ve migrated to Youtube music now. I pay for spotify premium and YT music but have almost abandoned spotify due to how FRUSTRATING the constant pushing of certain songs has become. it’s ridiculous, how can spotify justify playing PPP after gospel music (this isn’t a joke, it’s happened to me)",
            "Make sense since PPP only has a week and it’s number one everywhere, I know Sabrina is popular right now but not like that to be number one in just a few days.\n\nSomething is telling me that Gracie Abrams is in the same direction, her song is every playlist and I don’t even like her music",
            "Spotify Radio either needs to get fixed or just remove it least for paying members.",
            "I mean it‘s not exactly new information. They‘ve been doing this for ages and they will continue doing it.",
            "i get PPP and birds of a feather all the time. I don't even like these songs",
            "I kept getting this with that Million Dollar Baby song",
            "Forbes.com =/= Forbes Magazine fyi. Contributors publish independently in exchange for royalty payments, claims made in these “articles” are not edited or fact checked by Forbes Magazine editors. This article is the opinion of the author alone",
            "Sabrina is being exposed by many outlets for payola. She's litreally doing this by fraud numbers. But ok, we can see that in the tour arena tickets ",
            "This article doesn't seem to have any actual evidence besides speculation from people on Twitter.",
            "Same happened to me with Training Season by Dua Lipa. I tried everything I could to hide the song lol. Those opening chords strike a nerve now.",
            "just had this happen to me lol \n\nhttps://i.postimg.cc/wT3fLnDb/IMG-0568.png",
            "Sabrina Carpenter is catchy as hell but whoa she is getting heavily pushed. Even my metal and EDM playlist have her popping up. 😅",
            "[deleted]",
            "Yeah their algorithm puts the popular songs in your face, Spotify have discussed that and it happened to me with Texas hold ‘em , million dollar baby and dial drunk.  \n\nYou CAN just skip it though, it’s not the end of the world tbh. \n\nPlus it doesn’t count as a stream until 30 seconds in and if you don’t decide to skip a song within 30 seconds of it you probably don’t need or want to skip it anyway. so the article discrediting Sabrina’s streams is lame",
            "This happened to me with Taylor (I have a paid account). God, I was getting that awful song Anti-hero on almost every playlist possible, without ever listening to it wtf. I listened to some of her songs a few times but never to that one, and I don't even follow her Spotify page. Happened with some kpop songs as well who are pushed to the extreme. And now with those generic Sabrina songs.",
            "I swear the songs they push end up in my On Repeat playlist after one or two plays while songs I’m actually repeating a lot take a lot more listens to appear there.",
            "It’s definitely true, but it’s also only a tool if you let it be. The skip button exists. If you don’t want to listen to a song, then skip it. Is it still annoying as hell? Absolutely. But it doesn’t diminish those numbers as much as regular payola does because those people could’ve skipped it if they really didn’t want to listen.",
            "apple music person here. i’m sorry if this sounds dumb, but can you not just turn auto play off?\n\nwe have an auto play feature on apple music that’s an infinity sign, but I never turn it on. thus, whenever my chosen music stops, it just… ends? or I put it on loop so I never get music that I haven’t chosen in my queue",
            "I would not say this is Forbes accusing Spotify of payola. It’s an article on Forbes Mexico website only, and it’s just a write-up/rehashing of the other blog posts and social media discussion going around about this topic",
            "Wbk and it's slimey, but complaining about spotify payola is literally the new Tyler The Creator cyberbullying tweet. Put Down Your Headphones! Skip the Song! Choose What You Press Play!",
            "Is this really payola or just a personalized algorithm? I never got ppp instead I always get sympathy is a knife (not complaining)",
            "i use radio all the time and have never encountered this lol",
            "Just chiming in here that the Forbes article is basing this on assumption and a site OP is trying to advertise.\n\nAnyways, I explained why it's happening with OP [here.](https://www.reddit.com/r/popheads/s/hb1QeY5t39)",
            "It’s not even a new word either, I found this out when I watched the tv show Vinyl, which was set in the 70s 💀",
            "Not only is it an actual word, it is straight-up a crime, at least for radio. Why you may ask? Because a scandal with rigged quiz shows in the 50s placed a target on pay-to-play operations, and one of the major music licensing groups (BMI) accused the other (ASCAP) of buying slots. Also, mob ties.",
            "kind of off topic but i really thought floptropica was a play on poptropica the game but apparently it’s completely unrelated",
            "Can't tell if joking.\n\nThis is literally the opposite....\n\nBefore espresso came out, Feather was getting big. \n\nIt wasn't until her Coachella performance that she got a LOT of attention. \n\nEspresso came out after the day before coachella. \n\nSo, popular Feather Song + popular Coachella performance+release of Espresso= pretty much a hit. \n\nThen please please please comes out and it's viral unexpectedly. Literally they were still trying to push espresso. \n\nSo yeah, she's not getting pushed hard here.\n\nSimilar thing is happening with Chappell Roan and I'm also seeing comments saying she's getting pushed hard. 🙄\n\nEdit: if yall are thinking she's getting pushed hard then I guess yall think Chappell is getting pushed so hard too? If so, wtf lmao",
            "The second I saw the headline I knew Sabrina Carpenter would be mentioned. Anytime I play ANY song on Spotify, from Aretha to Willie Nelson the next song is either Espresso or PPP.",
            "Wow, the perspective that by gaming the system with payola you are actually taking streams from independent artists is brutal. Also, specially sad that people’s consumption of music is being controlled by an algorithm. The potential of streaming was specifically to remove the curation from radios and give back to users.",
            "I didnt block Espresso bc I wanted to see how long it will take until it stops playing after every pop hit I pick\n\n\nIt only stopped when Please Please Please came out and replaced it lmfao\n\n\nSorry to Ms. Carpenter but I hate her now",
            "Interesting you mention Taylor. Because I noticed that with her last album. I've been listening to Fortnight a lot but it's the only song in the album I actually listen to. But I played loml a 2nd time just for a few seconds one day after my initial album listen and it made it to my On Repeat playlist!!!! Like, there are songs by other artists that I really have to listen to a few times before the Spotify considers them worth it for my On Repeat playlist, but Taylor songs always get into the playlist very easily, I don't really need to listen to the songs that often. Just a couple of times will be enough.",
            "I'm so confused by people saying this because this has never happened to me. Are you a paid member? Is this only happening to people who use it free?",
            "I really started to notice autoplay last year. I feel like songs die for you remix, flowers, nonsense were some of the clearer examples",
            "Those are also the three biggest artists in the world, at least when it comes to streaming. Could it be that the algorithm is pushing them more for that exact reason?",
            "I mean, you can turn off auto play",
            "Her tour isn't selling well?",
            "Because it’s not actually an article, it’s an opinion piece from an independent person. OP’s title is incorrect.",
            "That’s what truly grinds my gears. When you’re listening to a completely different genre and a popular artist is unnecessarily inserted. Like why is Sabrina Carpenter on my Amapiano radio 😒",
            "I didn’t see it so im happy i ran into this article",
            "this Forbes article goes more in depth. no need to be offended",
            "i think its frustrating considering the radio feature has gotten worse in recent years. i now have better luck finding user generated playlists with names like “songs like ____” bc my radios always promote the same shit at the top, regardless of genre",
            "Payola is basically pay for play. If they're getting paid by labels for this, then yes.\n\nThe usage of \"Personalized algorithm\" is arguable because they're putting the promoted(?) songs in completely unrelated genre playlists and song radios.\n\n\nI've turned off autoplay but I had PPP and Espresso on my dark academia playlists with a bunch of classical music pieces.\n\n\nSong radios for lots of indie and other songs have pop songs.\n\n\nPeople who exclusively listen to hip-hop and rap are reportedly getting songs like PPP, Espresso, Lunch, Sympathy is a Knife.\n\n\nIdk how to attach pictures but the song radio of the song Spring Snow by 10 cm(from the OST of a recent Korean drama, Lovely Runner) have PPP as the second one and then Magnetic by ILLIT, Fortnight, Birds of a feather, Espresso, We can't be friends, Never Let Go, Guilty as Sin.\n\n\nThe first song that belong to non-pop genre is Sudden Shower by ECLIPSE at \\#13.\n\n\nThe first 12 songs have no sonical similarity with Spring Snow. If we try enough we can discount ILLIT and Jungkook as they're Korean artists(which is another problem) but still no sonical similarity. \n\n\n\n\nThe song radios of old songs are still working okayish but how's this even considered normal ?? \n\n\nI used to discover new music using song radio tool all the time and this tool has become shit these days.",
            "lucky you! i listened to ttpd all the way through once and didn’t like any songs and they’ve wormed my way into loads of my radios. i like hmhas but still found myself getting annoyed when there would be most of the album in a radio that it didn’t even work in. \n\ni do think it’s likely my demographic/following the artist that’s played into this but it’s defs something i’ve noticed and it’s led me to not using the radio feature as much",
            "in another comment on this thread i’ve mentioned that i do think it’s down to the fact that i do like those artists, but i do think the algorithm is messing up a bit. like putting multiple songs from the same album on a radio that isn’t very similar",
            "And it's such an old term that it (probably) comes from pay + Victorola (a popular brand of record player in the 1950s)",
            "I learned what payola was and then was listening to We Didn’t Start the Fire and saw the term there. \n\nEven though I had to write down what every event was in high school, I guess most of them didn’t stick. So every year or so I actually learn a specific event from the song, in my college chemistry classes it was thalidomide babies",
            "you just shattered my world cuz i thought that too 😭😭",
            "What the fuck",
            "What do you mean. That’s definitely where the name came from right???",
            "WHAT ?? What does it refer to",
            "Spotify has been auto playing her like shit and please3 is always added to peoples music even if their not listening to her, it’s pretty obvious",
            " yes .. she literally is being pushed lol hello ? it’s exactly the reason that in the time since espresso blew up she’s been on SNL, billboards around the country, a tour announcement, two music videos, festival runs, etc, etc",
            "I increasingly find myself beieving that handing things to the algorhythms has just left us being handed the same thing on loop, unless someone with the most money pays to cut the queue. While relying on some guys dumbass cousin was severly flawed, we need that dumbass cousin back, because the dumbass cousin would occasionally try something different.",
            "This is the one thing I don’t like about Spotify. There are some songs I only listen  once and they somehow end up on my on repeat and it’s like “I know I listened to this once” \n\nI’ve noticed that only happens on slow weeks were I don’t listen to a lot of music and listen to podcasts or audiobooks instead so the on repeat just adds whatever song I happened to listened to the day before.\n\nI think the payola stuff is just dumb chronically online fans trying to accuse Spotify of rigging the game for the people they don’t like, but, this does happen.",
            "Paid!! They’ll also never alert me to concerts of artists I actually follow or listen too either. Solely those three.\n\nWhen the Weekend was doing those remixes with Ariana- I was getting blasted with them. I do not listen to the Weeknd. At all.\n\nDrake specifically; at some point I was getting WEEKLY notifications that he had a concert near me coming up… but I had him muted!!!!!\n\nEdit- the Drake concert thing stood out to me because Beyoncé was my #1 artist that year, and I not once got a notification about Renaissance concerts when I obviously should have.",
            "I'm using it free and Sabrina never get shoved down my throat (honestly I've only experienced it with Taylor's Cruel Summer)",
            "Same. I'm a paid subscriber and I had never heard of Espresso or PPP until I sought them out on YouTube. Maybe the only time it happened to me was with boygenius, but it was also my most played record at the time so I'm not sure",
            "OP Isn't talking about Payola Payola.\n\nJust them advertising the artists.",
            "Yes, also paid. I mute or block artists or sonngs and spotify will still play them. Esp. trash, imho, like TS",
            "It's never happened to me either. I get recommendations from people I listen to which includes Sabrina. Also, autoplay plays a number of different people including Sabrina and Billie because I listen to them. I'm kind of convinced that people are just making this into a thing it isn't and they can't accept Sabrina etc. aligns with their gay ass music taste 🫠",
            "Or, they made their way to that position because they were pushed.",
            "Of course. I mentioned that in another similar Spotify thread the other day.",
            "Her tour hasn't even gone on sale yet lol",
            "I think people overestimate their ability to sell tours, and their fans ability to go see them. For example, Olivia Rodrigo and Billie Eilish are doing arena tours- not stadiums (some stadiums yes). \n\nLike I don’t think Sabrina will have to cancel shows, but I’m curious how it’ll go",
            "lol looking at that persons post history, I'd take anything they say with a grain of salt. There's a bias there",
            "Oh so Jk and Illit also doing payola, Scooter owns part of Spotify why wouldn't he use payola.",
            "Spotify radio isn't just about similar sounding songs.\n\nIt's about similar songs that sound similar plus songs that aren't but it thinks you'd wanna listen to. It's to prevent skipping. But it doesn't wanna work well if you don't listen to an artist much and put on their radio. \n\nFor example my Kendrick Lamar playlist has Camila Cabello's I LUV It, probably cause I don't listen to him much and only loved his recent song (which is true) so it thinks I listen to the top songs and sprinkles a few in there. Which is true and I wouldn't skip the pop songs on this radio and probably will skip many hip hop songs on it. 😅. \n\n\n\nI personally don't agree with it but that's why it's like that, not Payola.",
            "\"-tropica\" is a generic stock suffix for a tiny island nation, so it's not that floptropica is directly referencing poptropica, they're both referencing the same general idea. so they're not *completely* unrelated either",
            "Autoplay sometimes plays any top songs so it's not really exactly hard pushing her....this is a Spotify thing. It'll happen with any big song. But only after they're already big. \n\n\nI feel like people here don't know how big espresso and please please please truly are.\n\nOriginal comment said they're getting pushed hard. Is that true when they're already big lol....",
            "I think you're confusing pushing cause you're already big vs getting pushed to the top, when you're not big. That's what I assume the original commenter meant. \n\nYour comment happens with every artist that is big. All of that happened after she was already big.",
            "The labels would just find a way to pay the dumbass cousin 😭\n\n It's random shit like this that constantly puts artists signed to major labels well above and firmly ahead of indie ones. It used to be for radio airplay, now it's also streaming.",
            "I wonder if certain profiles get fucked algorithms or something? Because I always get recommended concerts for artists I listen to. I've had Taylor pop up in recommends but it's usually only after I've listened to her a few times. And I never get PPP autoplayed even though I've willingly played it a couple times (as in I searched it and played it more than once). I've also never been bombarded with The Weeknd even though I've willingly listened to him too.\n\nI wonder why some accounts are having these issues and some aren't?",
            "I get notifications of the artists I blocked too. \n\nHey, check out the new release of X and I have never listened to X or have blocked X because I didn't want to listen to them.",
            "???? So no- that’s not the case here",
            "lol this. It’s one thing if I’m listening to loads of rap music, and so you push Drake. But at the time, I really wasn’t. They’re not even staying within the same genre of what people like",
            "Olivia was doing theaters for sour iirc",
            "I'll be kinda surprised if it's not mostly fine tbh. I had a look at a few dates of Tate's tour and she's mostly avoiding arenas (besides selling out MSG) but had no problem adding 4-7k seats in each city, probably should have moved up to arenas in some of them looking at resale prices. Sabrina's last tour was a good bit bigger than Tate's, ~2x in a lot of cases, and I'd expect Nonsense/Feather/Espresso/PPP to add more interest than Greedy/Exes too.",
            "Jungkook instantly had the top song on spotify for like 3 months straight while being in the 20s on TTH. He only climbed to the top 5 after a month or so. If scooter is using payola then he isn’t very good at it",
            "(although i don't personally believe it's a coincidence, the names are two letters apart)",
            "I agree it depends on the account history too as I didn't get expresso or PPP pop up. But I do get a lot of Gracie \"risk\", Billie's new album and CC. Last month was also full of we can't be friends.",
            "i got espresso and now PPP in every autoplay when I'm listening to fucking kpop",
            "Taylor’s push toned down for TTPD I got 1 or 2 pop ups and 1 pop up for the new version of whatever song… but she’s muted. But like maybe less than 7 notifcations/pop ups total. For the re-releases I was a getting a good amount of pop ups despite having her muted.\n\nBut not as bad as Drake. Drake was worst, The Weeknd was very noticeable because I don’t listen to him, and I kinda don’t really listen to Taylor either. But again, Drake was incessant my god",
            "His song was out of charts in US and still playlisted on all US playlists,  now we know how he got that top song for months, using spotify radio payola other than Thai farm.",
            "You just reminded me that I did get bombarded with Lunch by Billie.\n\nI played her albums a few times so I had figured that was why. But I hid the song at one point and it still kept playing. I had to hide it like 3 separate times for it to finally stick.",
            "I got like zero Cowboy Carter push. Like not even a notification that it dropped… and she’s been in my top five artists every year forever",
            "Taylor seems to be in a zone where she can coast on her popularity, knowing that her fans will find it. Beyonce is in a similar zone, which I noticed when I found out that her last album was extremely avoidable. With the new Billie Eilish and Sabrina Carpenter however, I noticed that Spotify loves to tell me about them.",
            "Girl I love Billie so it doesn't bug me but it's actually hilarious that both my Chappelle Roan mix and my Olivia Rodrigo mix are the exact same songs with 1/4 Olivia, 1/4 Chappelle, 1/4 Billie's new album /only/, and the last 1/4 is a little sprinkle sprinkle of Renee Rapp with a dusting of Del Water Gap and one Royal Otis song now also with espresso and PPP. Charli is being sprinkled in a bit but it's kind of funny they both have basically the exact same songs on it the order is just different.",
            "I hid the song too, but it didn't work plus the birds and feathers one was quite repeatedly showed up. At last I had to block the artist, it was getting too much.",
            "What's that, you're listening to Kendrick Lamar? Have you tried Lunch?",
            "I got only one song pushed from CC that was a collab with Miley. That's it but the Billie album was definitely more pushed on my account. I don't know why tho cause I haven't listened to any Billie songs/albums before.",
            "yes definitely- I think after midnights I’ve gotten a lot less push from her, Drake though. It literally doesn’t stop when he has something out or is touring",
            "That makes sense though, Olivia and Chappel have the same producer and Chappel is featured as background singer to some of Olivia’s songs. Their music doesn’t sound super similar, but they’re in the same music world of gen Z pop girlies.",
            "All of my Spotify mixes look like this with diff titles lol I don’t use them anymore",
            "Funny enough, I actually like Birds of a Feather and I don't think that ones ever autoplayed for me. And I don't think it's shown up in any of my playlists yet.\n\nSo basically, if you actually play the song they won't keep recommending it, probably because you're already playing it. But if you don't play it, they'll force you to. Glad Lunch is my only experience with this. I actually like leaving autoplay on but I'll def turn it off if my account gets worse with this stuff.",
            "To contrast/ agree with  you, one of my friends who listens to a lot of Taylor said that Birds of a Feather was being pushed a lot on her phone.\n\nWe were hanging out and it came on and she was like “AGAIN!??” So yeah that makes total sense, you’re definitely not the only one!\n\nI don’t listen to a lot of Billie but have 1 or 2 of her new songs on playlists, and haven’t gotten any push. But totally believe it’s happening for a lot of folks",
            "Have her album sounds like Olivia's and one song sounds exactly like Taylor Swift 😅. I hate that song cause of it but I've seen people say it's their favorite.",
            "What's worse is my account is a normal one (no premium) so I can't shut off the smart shuffle. I was actually thinking of switching from Spotify cause I don't want to pay anything.",
            "Well my case is the same as your friend's case. I listen to a lot of Taylor, Birds of feather and Lunch were the most pushed songs for me too. Does that mean Spotify will push certain songs/artists to listeners of another artist? Like some sorts of pairing..."
        ]
    },
    "Lorde's Impact on Pop Music in 2024: Gracie Abrams, Billie Eilish and More": {
        "title": "Lorde's Impact on Pop Music in 2024: Gracie Abrams, Billie Eilish and More",
        "score": 245,
        "url": "https://shut.net/2024/06/21/news-lordes-impact-on-pop-music-in-2024-gracie-abrams-billie-eilish-and-more?utm_source=dlvr.it&utm_medium=twitter",
        "content": "",
        "num_comments": 35,
        "comments": [
            "I’m so glad Lorde’s verse on the remix was a reminder of just how great and dialed in of a songwriter she is when she’s at the peak of her powers\n\nCan’t wait for L4",
            "Pure Heroine will always be seen by most as the natural turning point from recession era maximalism to moody, minimalist pop that took over in the middle of the last decade.",
            "I'm so happy about this article. Low-key, I've encountered some iffy comments questioning Lorde's impact on the music industry. But I figured many of these new users were too young to appreciate an album like Melodrama at the time of its release.\n\nAnd I guess that's my problem with the rising popularity of indie/bedroom-pop. It's like the industry is working overdrive to frame these young artists as revolutionary or refreshing when most of them have torn a page or two from Lorde's artistic playbook. I'm happy for artists like Billie and Olivia, and only wish them well, but Lana and Lorde deserve their flowers as well.",
            "It’s really clear that Lorde’s fingerprints are literally all over popular music. She changed the game with Pure Heroine, did it again with Melodrama, and (argue with the wall), there was a slew of stripped back, introspective albums in the years since Solar Power. If you give me a minute I can list a lot of them.\n\nNow with this new remix and her album coming almost definitely this year, the pop girl’s have no choice but to follow in her footsteps again, I’ll bet my life on it. She really is the future of music",
            "i'll border on being a solar power defender but since its release, i immediately loved it. i still love it. i've been with lorde since the love club ep and i literally grew up listening to her so i think it's one of the reasons why each era had connected with me. and whenever i feel down, or just want to hear something calmer in the background or want to be with nature or sea/river, i listen to solar power. \n\n\nsometimes, it hurts when people call SP derogatory words (i know im so dramatic) and call Lorde names for releasing SP but i dont understand their POV because Solar Power is honestly an amazing album in its own right.\n\n\nand now, we're in 2024. and over the years after SP's release, i've witnessed a looooot of female artists going to the ocean as well or going to nature to do their new eras (i can give you a list if you want). this to me, isn't a coincidence. it is lorde & solar power's impact",
            "This was such a good read! My pals and I were lamenting over the Gracie album yesterday at work and I went off on a tangent about how influential Lorde is as a vocalist and how she’s shaped the landscape so irreparably that nobody has even come close to nailing her dictation or phonetic phrasing.   \n\nAlso not forgetting that Pure Heroin is one of few modern albums that tangibly changed the sound of music forever. In fact circa. 2013 was an INSANE time for music. 1975, Haim, xx debuts have been massively influential too!",
            "One of the greatest ever",
            "I've missed hearing lorde so much ",
            "not to beat a dead horse but i feel like solar power made people forget just how forward-thinking pure heroine and melodrama were until girl, so confusing reminded them. sp felt very surface level but where she truly shines is in her biting songwriting and i hope we get more of that on l4. not that her work needs to be sad, i just want some grit.",
            "People forget these days how much she changed pop music with pure heroine",
            "No mention of Endless Summer Vacation by Miley?",
            "I love that she matched Charli’s style of lyricism. If you showed me the lyrics I would’ve guessed it was charli before I would guess Lorde (if that makes sense)\n\nNot saying any of them is better than the other, it’s just that they have entirely different styles",
            "I agree. I was reminded of how amazing she is as a lyricist. She still got it!!!!",
            "That album was the soundtrack to my teenage years, just like Melodrama was for college. I can’t wait to see what she cooks up as I get deeper into my late twenties",
            "It's funny to think Dark Horse was released a few months AFTER Royals and both for me encompass the end of an era (though trap-influenced pop would continue) and the start of another. Prior to Lorde, one could claim Lana bridged the transition (Video Games specifically).",
            "good point",
            "Lana & Lorde forever!",
            "I’d love to see your list cos I bet it includes some great albums!\n\nI unabashedly love Solar Power, my favourite Lorde album even while I think the others are great too.",
            "Bowie was right about her -- she's the future. On the last years of 2010s, one of the most famous popstar (Billie) was her child. And now that we're literally in the new decade (2020s), one of the most famous popstar is her another child -- Olivia Rodrigo.\n\nI hate that Lorde is so humble & private. Sometimes, I hate it because it's probably the reason why her impact doesn't get discussed. Like her introverted nature, the substance of her impact in the music industry and pop music to be more specific -- is quiet, but the evidence, if you look closely, is loud.",
            "Why did both you and OP offer to make a list and then just not do it lol",
            "The Man with the Axe is one of the most gorgeous songs ever made idc what anybody says.",
            "I think I’ve been lucky enough to live in the time periods that Lorde released these albums for. Maybe if I was older or younger or wasn’t going through grief then maybe I wouldnt like SP like everyone else but it was just so perfect. The album is cleansing (for me) and what I needed more than anything was to go to the beach and let the ocean and the world swallow it all.\n\nIk she said on The Path she’s not a savior, but she sure is the guide that walks down that path and toward the sun",
            "I also grew up with lorde and her first 2 albums are so dear to me. unfortunately I can’t stand solar power because when it came out was literally the worse time in my life and at one point I got heat stroke and had to be hospitalized so  solar power was the opposite of what I was experiencing and listening to it made me feel so lonely 😭 i’ve been meaning to revisit it but ugh even thinking about that time is so hard",
            "no i definitely understand your pov! i love when featured artists adapt the voice of the actual artist. it elevates the end result",
            "I remember Bonnie mckee who wrote Katy's song roar said she was very pissed she lost soty at the grammys to Lorde's royals and thought lorde didn't deserved to win it. It so interesting to see the maximalist pop songwriters already felt threaten by royal's success definitely the major  shift in the industry at the time",
            "Yesterday I was leaving the house in the freezing dark on the morning of the winter solstice, and Solar Power started up, and I was like, \"This album is the *perfect* encapsulation of that feeling when it's winter in the southern hemisphere but the world thinks it's summer everywhere\". It's so specific and unique.",
            "Actually I think her being quiet is what’s going to cement her as a legend in music. She lets her influence permeate without being too “in your face” about it so that when people go and check out her work after some of these newer acts, it clicks. Like ohhh this is where it came from.\n\nOr maybe I’m delusional!",
            "we've been through so many hard times~~~~",
            "YOU FELLED ME CLEAN AS A PINE🗣️🗣️🗣️",
            "out of all the songs, roar she was upset about??? 😭 i get being nominated and losing but i fear that we need to adjust our expectations",
            "this is such a nice, niche way to encapsulate how you relate to it! what a great description.",
            "This just brought me back to when Solar Power (the song) first dropped and it was one of those sunny but biting cold winter mornings here in NZ, and it truly just felt like the perfect soundtrack with all the morning frost glistening in the sunlight while waiting for the bus",
            "I also like this take!!! I guess, I just want her to sometimes go, \"Oh yes, yeah, I did that!\" but she will never say that cause that's not who she is.",
            "You are she's not a legend",
            "I’ve always hated Roar with a passion the repeated “oh”s in the chorus are so annoying"
        ]
    }
}