{
    "Community reminder: Mods are volunteers. If you see something you think violates the rules (not just something you don't personally like), you should report it. We read reports. We do not necessarily read every single post otherwise. Thanks!": {
        "title": "Community reminder: Mods are volunteers. If you see something you think violates the rules (not just something you don't personally like), you should report it. We read reports. We do not necessarily read every single post otherwise. Thanks!",
        "score": 100,
        "url": "https://www.reddit.com/r/privacy/comments/16juxkf/community_reminder_mods_are_volunteers_if_you_see/",
        "content": "",
        "num_comments": 1,
        "comments": []
    },
    "Uptick in security and off-topic posts. Please read the rules, this is not r/cybersecurity. We’re removing many more of these posts these days than ever before it seems.": {
        "title": "Uptick in security and off-topic posts. Please read the rules, this is not r/cybersecurity. We’re removing many more of these posts these days than ever before it seems.",
        "score": 64,
        "url": "https://www.reddit.com/r/privacy/comments/19flufu/uptick_in_security_and_offtopic_posts_please_read/",
        "content": "Please read the rules, this is not r/cybersecurity. We’re removing many more of these posts these days than ever before it seems.\n\n# Tip: if you find yourself using the word “safe”, “secure”, “hacked”, etc in your title, you’re probably off-topic.",
        "num_comments": 33,
        "comments": [
            "I disagree, you can't have privacy topics without touching on the security of how and why it happened. There'd be nothing to learn from.\n\nJust because the headline of an article posted says security update is bogus or company name was hacked doesn't mean it's not a privacy issue. For all you know you just installed boot level signed malware so now you're never going to be secure **or private**. Or that the company did in fact lose a large portion of plaintext data even though the article says it was hacked.\n\nI agree on a case by case basis safe, secure, hacked should be removed, but generically categorizing and removing without context just hurts the end redditor. If the algorithm for a widely used 2FA was hacked tomorrow, I'd want to know about it because it affects privacy directly and even if you roll your own, you're no longer as private as you thought you were.\n\nI'll adhere to the sub rules obviously, but just my two cents on why just generically saying safe, secure, hacked shouldn't mean it's not about privacy.",
            "I'm going to guess the issue is more is the question chiefly a privacy question or more a security question. \n\nI work in privacy, specifically GDPR in the EU and UK and then Brazil. I can't go two hours without having to touch security with my work since everything either side does directly impacts the other.",
            "The two are inextricably linked. I'd just as soon see those posts here and maybe have an automod message the OP to suggest a crosspost.",
            "I thought the cybersecurity sub was for tech *professionals* to discuss news. Where does one go to ask questions about how to protect their data, or what to do if their data has been compromised?",
            "I work in cybersecurity and half of my day job is dealing with privacy related compliance. You may not like the truth but privacy relies on strong cybersecurity.",
            "Yes!  I don’t personally mind it due to the crossover. But some of it isn’t remotely for privacy. “Hey, my phone is in a boot loop”\n\nWhat’s next: “What kind of orchid is this and how do I train it to be a middle weight boxer”\n\nI guess since it’s an active community they come here. I am kinda glad people figure this forum is so versatile. May be we should rename the sub. r/fukitwesolve",
            "[removed]",
            "Same. You can be secure without being private but you can't be private without being secure.\n\n\nIf they are tired of those post, best to just say this isn't tech support.",
            "Exactly! Security and privacy are way too connected to be called different topics",
            "Only so much as diet and exercise are. You need both, they affect each other, but a diet subreddit is the wrong place to ask for exercise advice.",
            "I thought so too, asked the mods, they said otherwise. 🤷🏻‍♂️",
            "My phone is in a boot loop isn't even about security.",
            "We appreciate you wanting to contribute to /r/privacy and taking the time to post but we had to remove it due to:\n\n>Your submission is Off-Topic.\n\n>If you have a question or concern about moderation, send a modmail.\n\nIf you have questions or believe that there has been an error, [contact the moderators](http://www.reddit.com/message/compose?to=/r/privacy&subject=Please_review_my_post).",
            "reminds me of \"secure\" alternate Android OSs where users install and continue to use Google spyware, and are even encouraged to do so. Sad...",
            "Yes you can lol. Security by obscurity. You're secure when you're not a target.",
            "With respect, I'm not sure I agree with your analogy.\n\nCybersecurity creates better privacy.\n\nDiet does not create exercise, nor does exercise create a diet.\n\nBut your point is valid. I just don't know that I agree. No need to debate.",
            "Why does my extreme privacy book talk so much about security than? Even my CISSP and security+ books talk about privacy. I agree with your intentions somewhat, I just think you are using the wrong argument.",
            "o ok thanks I'll try posting there.",
            "Interesting. Thanks for sharing this.",
            "Maybe. Nobody can steal your data already on the phone in this state. lol.",
            "\"Security through obscurity\" is considered a fallacy. Eventually, someone will stumble upon your systems.",
            "Privacy is agency to manage your personal information. Security related to strategies and tools for protection of this information.\n\nThis subreddit leans towards consumer privacy, which touches on security but you will never find someone talking about how to configure IPTABLES here. You’ll also not find someone talking about facebook’s privacy policy in the security subreddit.",
            "No, absolutely not. Security through obscurity is an insufficient but valuable component which many secure systems use. It *statistically* decreases  risk.\n\nTake one common example. I can run an ssh login port on my server on the standard port 22 and know I will be hit with tens of thousands of attempted accesses and break-ins per week. Surprisingly, by putting ssh on a random unassigned port 100% of those improper access attempts go away.\n\nThe hackers could scan my ports to find ssh service but they don't according to years of logs.\n\nMy logs are free from all this noise of hacking attempts, allowing me to identify other improper access attempts more easily.\n\nIf a vulnerability in the ssh server is publicly announced, my risk of that being exploited is significantly reduced if no hacker even accesses my ssh service on an obscure port in the first place.\n\nOf course I don't leave my ssh service open on an obscure port with a root password  of \"secret\" allowing login.\n\nCheck out the swiss cheese model of risk reduction and you'll understand why security through obscurity is in reality another valuable cheese layer.",
            "obscurity is proving much more effective than it was initially reported it was. less and less likely as time goes on, to be able to learn hacking bor reverse engineering or so many vast areas of programming , eventually, if not already, it'll only be a very select few responsible for it all. \n\n\nPeople knew how to do things that never got taught to newer generations and the cycle continues until people cant actually tell the difference between spyware and software, they just be one in the same. This already happens and lots of people are die hard believers in them being right",
            "You can't hit an invisible target. Your argument only applies in certain circumstances. What 'system' are you talking about? I'm a person, not a system. And who considers what you said? Source? Privacy just means concealment, hiding something. Even though there is overlap in the real world, privacy is separate from security. You have blinds on your windows. They keep people from seeing. If someone can break the window does that mean the blinds arent doing their job? Blinds work even if the window is open. Their job is to give you some privacy not security.",
            "You can use it as a part of a defense in depth strategy but if you can't rely on it."
        ]
    },
    "Google's \"Find My Device\" network - The upcoming assault on user's privacy": {
        "title": "Google's \"Find My Device\" network - The upcoming assault on user's privacy",
        "score": 83,
        "url": "https://www.reddit.com/r/privacy/comments/1dlnybq/googles_find_my_device_network_the_upcoming/",
        "content": "My post relates very much to [this one](https://www.reddit.com/r/privacy/comments/1cn6ps5/should_i_use_googles_find_my_device/) which is a month old. Like their Samsung device, this feature is now coming to my Redmi device also. Today only I received the email with subject, *\"Your Android devices will soon join the Find My Device network\"*.\n\nAs always, the **real** privacy nightmare stuff is always hidden in between the large boring paragraphs or the fine print as they say. Here is the part which I think is the most problematic: \n\n> How it works\n> \n> Devices in the network use Bluetooth to scan for nearby items. If other devices detect your items, they’ll securely send the locations where the items were detected to Find My Device. *Your Android devices will do the same to help others find their offline items when detected nearby.*\n\nSo, your devices are also supposed to co-operate by sending data to other devices which may want their location detected while offline. We are made to believe here that this data pertains to only our location and nothing else but once this thing becomes too ubiquitous, one can easily see the scope for surveillance capitalism by the powers that be?\n\nThis is very much like the Microsoft's recall scenario, I don't see much difference between this and that. At least there the data is still on the user's device and doesn't leave its shores, this is arguably even worse. For such technology to be palatable to the power user, they must at the very least, be prepared to open source this code. I think recall would have still got some acceptance had Microsoft made the code open source. This whole \"you trust me bro but I won't trust you\" business is highly cynical and doesn't usually have a long shelf life.",
        "num_comments": 52,
        "comments": [
            "\n\nThere are two viewpoints:\n\nEither you trust Google enough that they don't use that data for tracking but just want to compete with Apple.\n\nOr you don't trust them, then you should at least opt-out but tbh should have switched to something like the popular alternative OS that exidts for Pixel Phones long ago.\n\nOh, and no, in no way near as bad as Microsoft Recall. Not even close.",
            "I just want to add a bit of nuance here. To start with, yes, Google is processing your location. If Find My Device is available to you, then you have a device with Google Location Services turned on. If you have that, then your device is already constantly talking to Google about everything it sees to provide you with a more accurate position. Find My Device does not change anything about that.\n\nNow the way this system works has actually been designed with privacy in mind. I'm talking from the finding perspective here. Obviously the trackers themselves are a privacy nightmare. But Google did put in effort to ensure that it's hard to track passive participants in the network.\n\nThat's because it will only show the location of a tag once it's been reported by a sufficient amount of different devices. It then shows an average of all those pings. That means you can find the location of the tag, but it's going to be very difficult to find out who was near it, where they were exactly or when. This does strike a balance between privacy and usefulness.\n\nNow you may not trust Google at all, in which case you should probably at the very least turn Google Location Services off. That is entirely fair. They've not exactly shown themselves to be particularly trustworthy. But if you do think that the trade-off is a fair one and you trust that it's implemented the way they say it is, then I would argue that this is a pretty solid design. And while it can be abused, it can also be very useful.",
            "You consider directly under a “How it Works” heading to be deceptively buried? Where would you like them to put that information, in the subject of the email?\n\nNote: I’m only referring to you accusing them of hiding that information. I’m not defending the product itself.",
            "Google already knows your location. Now it just also knows that devices that want to be found are nearby. It doesn't change anything for you as a user of Android.",
            "We can avoid *all* of this silliness by *not* having a google acct for starters. The short, logical r/privacy answer. \n\nOr, we can keep pretending we can compromise/bargain with Big Datas' code/shareholders (Soon to be AI) that are hell-bent on knowing everything you know/do/drive/buy/drink/date/watch...for our 'Convenience'. \n\nWe should be learning to resist this bs. We ask to have our privacy respected, instead we get (Sigh)*another* tracking vector because we *may* lose our effing phone? \n\nAll devices *interconnected*...to find *one*. 7 years ago, that would be cute. Now it's just creepy.\n\nSmarten up, keep bluetooth off...stop re-contributing to some strangers' server and yacht payments. Leave some mystery to who you are.",
            "This is literally God's Eye from the Fast and Furious series. Each phone and device pinging each other constantly, making a real-time mesh map of literally every device and thus everyone on earth.\n\nGoing to get a dumbphone from the 2000s just for texts and calls, then keep my iPhone at home with no sim, only connected to Wi-Fi for apps that I need.",
            "This is one reason I disable BT and avoid devices with it built in. I don't buy things that require an app to control them. I don't use wireless headphones and other devices.\n\nI wish devices like phones had separate physical kill switches for WiFi, BT, and Cellular on hardware.",
            "IMHO this is awesome. I've been using AirTags for some time now and it's just super nice to have. Google introducing this could be a reason for me to switch to Android again at some point. Definitely a plus. Given the high amount of Android devices out there it's likely going to be way more accurate than the Apple equivalent.",
            "I couldn't find a way to truly opt out. Following instructions I got in email, I first had to agree to their T&C before I could select an opt out. I am not sure if I finangled my way to being opted out or not tbh",
            "'v'",
            "Damn, this again. \n\nThis is definitely not on the level of Recall. That shit is gonna cost Microsoft hundreds of millions, maybe a billion dollars in lost revenue directly and from future adoption and brand trust and image. They are doing good as far as PR and keeping shareholder dicks from going flaccid, but it's still a billion dollar fiasco. \n\nThis on the other hand is logical from a business and consumer perspective and got to come into the same market segment as Apple, well behind AirTags and the \"warming up\" period the public always needs when something scary in the news spooks them. Besides that, Google has been doing this for 15 years already. So has Microsoft, but they didn't have the use case for it like Google did, being an actual mobile device manufacturer with those devices in the pockets of 4 billion people. Beacon metadata for location service is really old though. Google just crowd-sourced it and got to watch a beta run from Apple first.",
            "This is peak ignorance. I am generally encouraged by many of the replies, sometimes it's hit or miss in this sub. Google spearheads _actual_ privacy-first technology, and a supposed privacy advocate wants them to burn it to the ground for being anti-privacy in some deeply nonsensical conspiracy. Let's just be super clear here: you are hurting the movement.\n\nThis technology is year and I hope they pursue it in more places by more companies. Maybe Google can use client owned encryption scheme in their core ads business so they and the advertiser know even less about you, but still allow them to do what they need to do. That words be a much better world than what we have now. There are many possibly good directions from this technology being used more broadly.\n\nWhat I often see in popular posts is conflating privacy with some anti-corporate culture agenda. If you want to hate on big companies for X Y Z, I'll be right there with you. But, for example:\n\n> I don't see much difference between this and that.\n\nThat's because you probably don't understand this or that. I hope this deeply concerns you so that you can develop a better understanding and continue to advocate for privacy supporting culture. Privacy is under attack in so many areas of our lives. It's refreshing to see an actual win.\n\nCheers",
            "Remember Corona, when the government put limits on how many people you could see and have in your house? When you were not allowed to walk in the woods or go to a restaurant without having a QR code to scan?\n\nThis tech, seems to me, like it would be very valuable for governments is they could get their hands on it. They can use this info to track all of the above. Plus, since only a handful of unique data points are needed to identify someone, I'm pretty sure they could trace it back to an individual.",
            "One of my devices already announced this to me.\n\n... By popping up a notification that said, \"[your other device] has been added to our network. Would you like to verify its local password now?\"\n\nEither I missed something really big, or Google is going the \"ask for forgiveness, not permission\" route.",
            "This protocol, like Apple’s, is highly privacy preserving. As a finding device (the one that hears Bluetooth messages from the lost device and reports their location) no identifying information is given about you to Google or the owner of the lost device. Your location is encrypted and Google cannot see it, only the person who owns the lost device gets the location, but like I said before it has no identifying information that could associate it to you.",
            "They (Google and other agencies) can and are tracking your phone regardless of this feature turned on or not.",
            "If you aren't running something like Tracker Control or similar to view all traffic across all apps, you should start now. Turning off location, Bluetooth, Wi-Fi is insufficient when your device is constantly phoning home. Even without a Google account, if you aren't blocking traffic back to Google, you're still being tracked.\n\nI would suggest the FOSS FindMyDevice on F-Droid (Droidify FTW) and use that instead of you really need something like Google's official solution. As long as your phone is on, you can have trusted contacts text codes to your phone to perform tasks or report information to help you find it.",
            "Honestly I don't see this as a big deal compared to everything else Android has enabled by default already. Most people have location history, \"precise location\" and GPS photo tagging enabled without knowing it.\n\nGoogle already has a complete worldmap of devices already anyway, every Android phone pings the mothership all the time already, and a lot of it stays even if you disable it.\n\nIf anything, with this service at least users get to have an advantage of it as well, which really is the only thing changing. Google has had all this information for ages and now people get to actually see how detailed and comprehensive it is; maybe that's why it took G so long to implement it.\n\nSo if you're against this feature, then you should be against the underlying location service in the first place.\n\nRecall is different, because Microsoft are incompetent morons which are just creating another way for hackers to track you instead of them. Say what you want about Google, but at least they're providing their services and Android free of charge, and users have at least a theoretical direct advantage from their stuff.\n\nWindows exists only for the sake of running other programs and services, it's a *paid* system which still  bothers users with ads, a bonkers amount of telemetry that consumes an insane amount of resources, and keeps bugging you about their shit stuff like Edge and Bing. Recall may be local (but we'll see about that), but it's also totally unsecure *and* on a system that's already the most targeted by hackers directly.\n\nNo... Both companies are just as shit and monopolistic and shouldn't be trusted, but MS is *also* annoying and incompetent.",
            "It is a little too late, I admit that sounds a bit gloom and doom. Airtags and Tiles have already spearheaded the nightmare, where it is upon you to 'opt out' of their privacy invading networks, even if you have nothing to do with them. The 'bit late' piece is around how these technologies are already being celebrated. \n\nThat said, this isn't comparable to MSRecall. They are completely different things, looking at completely different aspects of digital usage. If you're looking to compare, do it with the existing networks (Airtags/Tiles)",
            "You don’t have to trust Google it is an end-to-end encrypted protocol. They don’t see any of the locations.",
            "Where are you getting this from? Based on the protocol spec that was released by Google this should be impossible. The location data is encrypted with the public key of the lost device so Google cannot know what the locations are. It would be impossible for them to average those locations, the reports can only be decrypted by the owner.",
            ">then you have a device with Google Location Services turned on\n\nI have always had those turned off. I double checked when I got the email stating my device was being enrolled in the program/network. I triple checked just now. It's all off. I have \"Google Location Accuracy\" and \"Google Location Sharing\" as off/disabled. I do have the Emergency Services one enabled. I did have bluetooth scanning disabled, but I did only now realize wifi scanning was enabled do i re-disabled that.",
            "It may not have been considered deceptive about two decades ago when folks generally had more eye to detail and used to actually read stuff. Consider how many people even read books, letters, emails, etc., today? Most will just read the subject line and archive the email. Though I agree the folks are as much guilty here in not heeding to their privacy as much as the companies who make the features requiring an opt out rather than opt in.",
            "All devices interconnected to find any of them - not one.\n\nNote: I’m only correcting a statement you made, I’m not defending the product itself.",
            "> We can avoid all of this silliness by not having a google acct\n\n\nSeems to be pretty straight forward here.  rule 14 on a pixel, no accounts, no gsm, tags, .....     \n\nwell, until it is ruled to be intent to commit a crime to have a \"burner\" phone.",
            "Doesn't Find My (the iPhone thing) do the exact same thing?",
            "No. All location data is end-to-end encrypted you should really look into how the protocol works. Google doesn’t see anyone’s location.",
            "figure amazon has been driving around everywhere collecting all this data for years.",
            "Good luck with that when 2G gets switched off. 3G is already going bye bye.",
            "You missed his open source point. You come across like one spooks paid to ridicule a legit concern. Like why don't AT&T phones allow you turn off the network. You're 100% always on. When I disable cellular services the 5G stays active and I can still txt. The feature to turn it off is grayed out. Add in find my phone and soon can't disable that and we'll, you see his point. Or you don't because you're actively paid to push some give away ypur privacy is ok BS.",
            "The \"ask for forgiveness, not permission\" has almost become the default now. They do give you a three day window in this case to opt out which is mentioned deep down in the fine print but that is clearly not enough.\n\nBut I still think Google's version is still better than Apple's \"Find my\" which is much worse as there is no opt out at all to the best of my knowledge.",
            "How do the networks invade your privacy exactly?",
            "[deleted]",
            "Encrypted between who and who?\n\nBetween all phones and the Find My service run by Google, yes?\n\nSo encryption brings no value here",
            "End to end encryption is over a decade old now. Today the government can hack this without even breaking the encryption.",
            "I don't think they're talking about Google - they're talking about the owner of the lost device - who have the private key that allows them to decrypt the (rough) locations reported by YOUR device - which could in theory be allowed to tell the owner of the device where YOU are.  Even worse is when it's not your device reporting the position - the owner of the device has planted their \"lost device\" on your car - and other people's phones are reporting back to the \"owner\" your car's location.  So they have to really go to town to try and prevent \"lost devices\" from becoming weaponized trackers.",
            "I just got an email from my mom. The subject says “hi honey” and in the body she’s telling me about the results of her doctors appointment.\n\nI’m gonna reply back and tell her to stop using deceptive email practices, that should have been in the subject.",
            "So you are in fact saying they should have put this in the subject of the email and anything else == hiding it. That’s an interesting take. And if Google is guilty of this so is literally everyone including you and me because nobody uses the subject for the important details every single time.",
            "It does and if you look into the system design for it, it’s doesn’t give your information to anyone but you and Apple (which most were already doing via location services). Since it’s end to end encrypted data, even Apple can’t access it. \n\nTLDR: Apple devices emit a short lived identifier that others pickup and send to Apple. Your devices short term identifiers are encrypted and stored in your account so your devices can be pinpointed.\n\nhttps://www.macrumors.com/guide/find-my/",
            "Most likely, but I don't use Find My iPhone. I don't even use iCloud, just the Apple ID part for the App Store. Don't even use Bluetooth either.",
            "Both have opt-out.",
            "Your knowledge is incorrect. In fact Apple is opt-in, not opt out. Albeit it requires some knowledge to do it correctly. Basically you don’t connect an Apple ID until FindMy, Location Services and Bluetooth are completely off/deactivated. Or better yet, never connect an Apple ID at all. No Apple ID and no FindMy, as it is part of iCloud",
            "No it’s not a correction. The protocol spec is published and people have verified it. It’s very simple and effective.",
            "My friend,  you need a refresher in how encryption and public key pairing works.",
            "No not that at all. Encrypted between the finding device and the owner of the lost device. Google sees none of the location data. Of course what you describe would be useless lol why would I even bring it up in that case?",
            "No lol",
            "The Google protocol does the same thing, it is almost identical.",
            "End-to-end encrypted up until their Find My Device servers, from there on it is unencrypted to use as they please",
            "The amount of ignorance (and paranoid leaning towards conspiracy nonsense) in this thread is pretty mindboggling. And even when you try to explain it to them,. they just fall back on \"Well, I'm sure Google is decrypting it SOMEWHERE !!\"\n\nUgh.",
            "I don't get the premise though.  A 4-digit PIN is supposed to keep Google from seeing location data; the location data they're ultimately displaying to you, on their website.\n\nI have a complete understanding of cryptography, but the details of how end to end encryption is actually be implemented here and prevents Google from seeing data, is awfully fuzzy.",
            "I’m not trying to be overly mean here but why would you be so confident that you know how it works without even a cursory googling? Because you are completely wrong. Each lost device generates its own keypair and broadcasts the public key over Bluetooth. Locations are encrypted with that public key so the owner can decrypt them later but Google cannot.",
            "There are lots of situations where you do just have to trust that they are handling data on the servers the way they say they are or something, but in this particular case it is very easy to verify how it works because you can (and people have) take two phones, instrument them and check that the protocol is working how they say it does.\n\nTo guarantee that Google is not seeing your location all you have to know is that 1) the keys are being generated on your device and 2) the finding device is using the public key to encrypt the location.  You can even make your own implementation that generates its own keys if you want and then retrieve locations for it, and since that does work then you know there can't be anything up Google's sleeve.  It's as transparent as it could possibly be.",
            "What does a PIN have to do with anything? The key pairs are generated on the device and Google never sees them."
        ]
    },
    "Do the new ARM pc's have an Intel ME equivalent in them?": {
        "title": "Do the new ARM pc's have an Intel ME equivalent in them?",
        "score": 6,
        "url": "https://www.reddit.com/r/privacy/comments/1dlu6w5/do_the_new_arm_pcs_have_an_intel_me_equivalent_in/",
        "content": "Ok so tracking back down intel m.e was a \"security\" feature of all intel CPU that has direct access to hardware level control over any pc, and so does AMD PSP, i have long waited to see a support for core boot for newer pc's after 2013 but with the new arm CPUs is an equivalent to intel m.e also present?",
        "num_comments": 5,
        "comments": [
            "I heard something around those lines. But finding info about it is impossible because looking for \"snapdragon controversy\" or \"snapdragon spyware\" just brings up windows recall xd.",
            "If I remember it, arm was used for phones and to the most part, there were a thousand ways that anyone could put spyware on them from the OS itself, so I, so think there was never any interest in putting an equivalent in them,  but now if they haven't put none on them, then putting Linux into the new pc's and calling it a day would be perfect",
            "In [arm terms it's called trustzone](https://www.arm.com/technologies/trustzone-for-cortex-m), which offers similar TEE and remote management based on secure OS (minix in Intel case, [proprietary for AMD and ARM](https://os.mbed.com/mbed-os/)).  \n  \n[AMD PSP is actually an embedded ARM chip with trustzone enabled](https://docs.kernel.org/next/tee/amd-tee.html).  \n  \nAnytime a platform requires DRM, then there has to be a either embedded or third-party TEE chip available, which isn't user manageable.",
            "kinda, i hope it is onIy copiIot that they put or they made a thousand iq move by putting a controversiaI feature to cover up an even more controversiaI one",
            "How are RISC-V chips in this regard? The generally available raspberry pi-likes are Chinese."
        ]
    },
    "The Outsider's Guide to Payments Censorship": {
        "title": "The Outsider's Guide to Payments Censorship",
        "score": 5,
        "url": "https://open.substack.com/pub/brettscott/p/the-outsiders-guide-to-payments-censorship?utm_source=share&utm_medium=android&r=92vnw",
        "content": "",
        "num_comments": 3,
        "comments": [
            "Beep. Boop. I'm a bot.\n\nIt seems the URL that you shared contains trackers.\n\nTry this cleaned URL instead: https://open.substack.com/pub/brettscott/p/the-outsiders-guide-to-payments-censorship?r=92vnw\n\nIf you'd like me to clean URLs before you post them, you can send me a private message with the URL and I'll reply with a cleaned URL.",
            "For the sake of health, security, privacy and sanity, situations where \"computer says no\" should be prevented at all cost for all situations.",
            "Good bot."
        ]
    }
}