{
    "General Questions & Tech Support Megathread | June 21, 2024": {
        "title": "General Questions & Tech Support Megathread | June 21, 2024",
        "score": 0,
        "url": "https://www.reddit.com/r/PS4/comments/1dkuy1c/general_questions_tech_support_megathread_june_21/",
        "content": "Hi everyone,\n\nPost all of your general and tech support questions in this thread.\n\nAs a reminder, the following threads are no longer allowed on [r/PS4](https://www.reddit.com/r/PS4/) and will be removed:\n\n* **Tech Support questions** (\"I have a problem\", \"My controller doesn't work\", \"I can't connect to PSN\"...)\n* **Game recommendation** (\"Which game should I get?\", \"Is this game good?\")\n* **General questions** (\"Where can I get a PS4?\", \"What do you think of this controller?\")\n\n**Those questions now have to be asked in this thread**. It will be renewed at 12:00 AM EST on Mondays and Friday.\n\nThis thread is sorted by **New answers by default**. Sorting it by Top or Best could give answers to commonly answered questions.\n\nAlso, don't forget to google your question first - you might find the answer before asking it here!",
        "num_comments": 45,
        "comments": [
            "I keep getting cant establish connection when login in to my ps account from pc browser, the whole message says:\n\nUnable to establish connection to the server. (18.d1fdda17.1718942513.5669abcc)\n\nI´ve had this for so much time now and got it from one day to another",
            "What's the best current option to upgrade your internal storage to?",
            "My PlayStation won't sync any controllers which is strange because when plugged in to the console, they still light up yellow as if they were charging.",
            "I can't remember my password and the only way it shows me  to reset my Account is my age,  which as the idiot that I am put in some fake back then to be old enough, what options do I have ?",
            "PS4 suddenly got the error code CE34788-0. Help needed\n\nI plugged the USB file with the update file and it wouldnt recognize it. So I researched on the internet and found an alternative way which is initializing ps4 basically formatting everything. I did that and it worked but then I got the prompt to update the ps4 to 11.5. I did that and after restarting I got an error message and it went back to giving the error code of plugging in the dualshock controller and a usb with the update file of 8.00 but that does not work. Any tips?",
            "Help please!\n\nBeyond the Dawn (Tales of Arise DLC) is not showing up in my PS4 library for download on my PS4.\n\nIt shows up under my transaction history on the ps store website but when I go to Library on my PS4 the expansion is nowhere to be seen.\n\nWhen I search \"Tales of Arise - Beyond the Dawn Expansion\" on the ps store you see a thumbnail of the game and under it, it says \"unavailable\".\n\nWhen I click on the thumbnail I go to a page that has:\n\n# Tales of Arise - Beyond the Dawn Expansion\n\nBandai Namco Entertainment America Inc.Tales of Arise - Beyond the Dawn Expansion\n\nRating  \\*\\*\\*\\* (7 ratings)\n\nOwned\n\nSo as you see, below the rating it says \"Owned\".  On the PS app it also says \"purchased\" when I go to the games indvidual page.\n\nSo it looks like this:\n\nEpisode\n\nReleased 11/9/2023 | Purchased\n\nOTHER INFO:\n\nI purchased my ps4 in the USA and created a US account but brought it to Europe where it now is.  I have both US and European versions of games that all work, including a European version of Tales of Arise base game.  Every other digital download I have ever purchased, about 12, work fine, including Valkyrie Profile Lenneth I got on the same exact day as Beyond the Dawn.\n\n\\*\\*\\*\\*I tried to download/access the expansion via the base game (ToA) itself and it says I need to purchase it (but, again, I did)\n\nI created a European account but I can not download Beyond the Dawn from that.\n\nI tried to restore the licenses, that did not work.  Start/restart and power on/power off, turn off/turn on internet did not work.\n\nSo am I out 20 dollars?  PS support was of little help.  Even though I have a US account I live in Europe but they don't want to help via a European support phone number.",
            "**FREQUENTLY ASKED QUESTIONS**\n\n\n**Q: My controller won't connect despite being plugged into the console. It charges/is charged but I'm stuck on the press the PS button screen.**\n\nA: You need a USB data cable to pair a controller with a console, instead of a generic  USB charging cable. They look the same but a charging cable only charges, it cannot send a data signal which is necessary for controller pairing. USB Data cables are necessary for safe mode operation as well.\n \nIt's a common mistake. \n\nAmazon lists cables as data cables if you need to purchase one. Other retailers will also list data on cable packaging.\n\nhttps://www.dignited.com/50330/usb-data-cable-vs-usb-charging-cable/amp/\n\nAlso, don't forget to press and hold the reset button on the back of the controller for 5-10 seconds before connecting it. This is recommended when using your DS4 on a PC or other device before connecting back to a PS4.\n\n**Q: My account is saying I don't own a game when I know I do. How do I fix this?**\n\nA: restore licenses in settings > account management \n\nhttps://www.playstation.com/en-gb/support/games/restore-licences-playstation/\n\nCheck your account on the Playstation Store website. If you own it you can remote download it, you can also check tour transaction history there too. If you still can't access the game it was either:\n\n1. Purchased on disc thus not owned digitally\n\n2. Purchased on a different account and game shared to your account. Remember, you can play a game without owning it. Having trophies is meaningless when proving ownership as you can earn trophies from disc games and games owned by a friend.\n\n3. Obtained using PS+ and your subscription ran out. Your monthly games can be retrieved by resubscribing.\n\n4. Obtained with PS+ Extra and it was removed from the service. \n\nIf you don't think it's the above 4 options, contact support.\n\n\n**Q: I am missing a DLC that I purchased. How can I fix this?**\n\nA: follow the detailed instructions here. Otherwise contact support \n\nhttps://www.playstation.com/en-gb/support/games/add-on-dlc-in-game-currency-support/\n\n**Q: How do I fix \"Cannot sign in using another player's sign in ID.\"?**\n\nA: You are signing into either the wrong user profile or the wrong Playstation account. To solve this sign into your PSN account on the different user profiles until you sign into the correct one. If you cannot use any user profile due to the above message, make a new user profile for your PSN account.\n\nPS4s use user profiles. Each user profile that is set up can then be tied to a single Playstation account. Thus you cannot sign out of a PSN account on a user profile and sign in with a different Playstation account. As such, 2 Playstation accounts each need their own separate user profile on a PS4.\n\nYou also cannot sign into a single Playstation account on 2 different user profiles on the same PS4. So if you want to use a new account with a PS4, make a new user profile.\n\n**Q: My console is saying I don't have enough storage space for an update even though I do.**\n\nA: You don't. If the console is asking you to free up space on your HDD then you must do as the PS4 asks. When the PS4 updates a game, it makes a copy of it on your HDD that is deleted once the update is applied. This means that a 50GB game requires 50GB free on the HDD + the size of the update. COD being a massive game can require 100GB+ free depending on its current size.\n\nI recommend giving your PS4 a 100GB buffer to update your games. If you only have a 500GB HDD I also recommend an external HDD or upgrading your Internal HDD to a 2TB drive.\n\n\n**Q: How do I game share digital games/PS+?**\n\nPS5\nhttps://www.playstation.com/en-gb/support/account/ps5-console-sharing-offline-play/#\n\nPS4\n\nhttps://manuals.playstation.net/document/gb/ps4/settings/activation.html#\n\nA: You can game share with 1 PS4 and PS5 at a time, known as your Primary console. Instructions above. Multiple accounts can have the same Primary console.\n\nAgain, you can only game share with 1 PS4 at a time, so if you want to game share with someone else use the same path to deactivate the PS4 or use the website to deactivate remotely.\n\nIf it doesn't work right away then restore licenses on the account that owns the games.\n\nGames and DLC can share between users, however some DLC is account locked so cannot be shared between users. DLC and game need to be the same region first in order to game share.\n\nYou can still access your games on any other PS4 you sign into, even if it's not your Primary PS4, simply by being signed into the PSN, but no one else on the non-Primary PS4 can play your games.\n\n**Q: I keep getting error E-8210604a when attempting to make a purchase. How do I fix it?**\n\nA: The error is more or less a catch all, use the advice on the following link and beyond that contact support for more help. In the meantime you can complete your purchase using Playstation wallet vouchers to fund your wallet.\n\n\nhttps://www.playstation.com/en-gb/support/error-codes/ps4/e-8210604a/\n\n**Q: Pros and cons of changing your Online ID?**\n\nA: its safe for most modern games but some exceptions exist. For more information:\n\nhttps://blog.playstation.com/2019/04/10/online-id-change-on-psn-your-questions-answered/\n\n**Q: I have lost access to my account/want to refund a purchase. How do I do this?**\n\nA: Only support can help in these cases. Support is region locked so if you have a USA account only the USA Support team can help you. Most Support teams are open Monday-Saturday usually around 10-7PM and most Countries only offer phone or live chat support. \n\nThe Support site is easily googled/linked in the side bar for Live chat.\n\nThe phone number is on the Support website, inside your game cases and also listed here:\n\nhttps://docs.google.com/spreadsheets/d/1Yyg6CDcHkMSQ40bGtRax6BuNqie5ym7wHSjRNISX9Cw/\n\n**Q: Can I change the region of my account?**\n\nA: No. If you want an account set to a different region you must make a brand new account.\n\n**Q: My voucher code isn't redeeming. What can I do?**\n\nA: Vouchers are region locked so a USA voucher will not work on a European account. Also make sure your voucher code has not expired if the game is a few years old. For PS+ vouchers you may be required to add a credit card to your account for auto renewal purposes.\n\nAnything beyond that contact support.\n\n\n**Q: Are games region locked?**\n\nA: Yes. PS4, PS3 and PS5 Games are region coded so that USA DLC and saved data only works with USA copies of the game. \n\nA French account/console can play a USA game disc but French DLC won't work with it. If an American account is used to purchase DLC the French account can play that DLC too assuming it is shareable between users ie not in game currency.\n\n**Q: purchased a new copy of a game to continue my game save but it doesn't appear when I launch the game.**\n\nA: First of all make sure the game is fully updated with the latest patch and check again.\n\nOtherwise, saved data and DLC are region locked. So if you played an American copy of a game you created an American game save that cannot be read by a copy of the game from a different part of the world.\n\nAlso, Witcher 3 Wild Hunt is considered a different game to Witcher 3 GoTY so the saves are incompatible between both games even if from the same region.\n\n\n**Q: I have purchased DLC for a game and it is stuck at 'waiting to install'. How do I fix this?**\n\nA: If you launch the game and the DLC still will not install, this is down to a region mismatch. DLC and saved data are region locked, meaning DLC purchased on a USA account will not work with a European game disc/digital copy. To resolve this you either need to open an account matching the region of your game and purchase the DLC there (some DLC is account locked so cannot share). Or alternatively purchase a copy of the game from your region. Otherwise contact support for a refund, but no guarantees if one will be given.\n\n**Q: How do I know the region of my game disc?**\n\nA: Look at the age rating on the front cover. ESRB rated games are American, PEGI is Europe, etc. For more specific region info there is the CUSA code printed on the game disc that can be checked on an online database such as gamefaqs. DLC region codes are listed as part of the Playstation store URL.\n\nhttps://gamefaqs.gamespot.com/ps4/190457-dragon-ball-xenoverse-2/data\n\nAbove link is an example, in the link you see a list of different regional releases and their CUSA codes. So long as the CUSA matches, the DLC will work with your game.\n\n**Q: How do I fix: 'Connect a USB storage device that contains an update file for reinstallation for version X or later.'**\n\nA: The data on your HDD has been lost so is requiring a fresh installation of the system software. Your purchases and trophies are safe as they are tied to your account but any saved data not backed up has been lost. The above message is part of the BIOS so to get back up and running follow these instructions:\nhttps://www.playstation.com/en-gb/support/hardware/reinstall-playstation-system-software-safe-mode/\n\nConsole reinstallation file can also be found here if the above link doesn't work for you:\nhttps://www.playstation.com/en-gb/support/hardware/ps4/system-software/\n\nGeneral pointers:\n\n• Make sure that you are using the console reinstallation file and not the update file.\n\n• Your USB stick needs a folder called PS4 and inside that folder a second one called UPDATE\n\n• Inside the UPDATE folder is where you put the reinstallation file\n\n• The reinstallation file must be called PS4UPDATE.PUP otherwise it won't be recognised by the console. So remove any (1)s if they appear as part of the file name as that just obscures it.",
            "I would like to buy Minecraft Deluxe but after downloading the demo, now the store tells me \"You can't buy it because you already have Minecraft\" when it's not true, just download the demo",
            "Issues with safemode (PS4 Slim)\n\n\nSo today i was playing RDR2 And it kept crashing so i went into the settings of my PS4 Trying to delete my save files but for some reason my PS4 Went into safemode. I was stuck in a safemode loop a month ago and used an android cable which worked pretty well but now it no longer transmits data for some reason i tried 3 different cables on 3 different controllers to no avail.\nThe first time i used the cable it worked but only displayed the 7th option",
            "I want to replace the enclosure of my PS4 with a bigger one that allows for more airflow and maybe for another fan. Does anyone have a model I can 3d print?",
            "How IS the Elden Ring DLC performance? I ask here because looks like the moderators think that a question about the biggest release of the year on PS4 that people are saying has issues doesn't deserve a post.",
            "Can anyone help me with a couple of the GTA 5 online trophies? Been looking for a whole and no luck.. Would really appreciate it",
            "Got a UAE PSN gift card but my account is a US account. Is it still possible to use it to buy and play Elden Ring DLC? \n\nIf I create a UAE PSN account and buy the DLC, would I be able to access the DLC contents of the game in my US account? Or am I really fucked here and just pray I can get a refund?",
            "Please help\n\nIve been looking for this game i used to play with my cousins when i was younger and from what i can remember its an older game on ps4 with a short name (something like fate i think, dont think it was fate but it was similar) it was a strategic game and if i remember correctly it was this magic, wizard looking guy and the game was 2d not 3d and it was quite a dark game.\n\nI know its a lot of rambling text but it really gets under my skin.\n\nhelp if you can.",
            "# Need some help here\n\nbefore we start i have to state that my ps4 data base getting corrupted wasn't really a big issue, nowadays when i turn the console and insert the gta V disc or play a game for too long the following would happen  \n-turns on  \n-freezes a bit then launches the home  \n-right after getting to the home there is a chance that it says that the database is corrupted and leaves no other option than to reboot which takes long/or takes long enough time that i have to manually pull the cord off which causes this sisyphus-esk loop to keep happening  \nany help will be in great use  \nthanks in advance  \n(NB: rebuilding the database does liltle to nothing to the console)",
            "Torx T8 screwdriver is not removing the screws on the back of my PS4 - I have also tried the T7 too but that didn’t work either. I don’t think they’re stripped bc I’ve never tried to get them out before so idk what is happening",
            "The price of the new elden ring dlc in my region has changed from 35$ to 45$ recently and I'm not sure if this was done on purpose or was a mistake. It doesn't make sense for it to be more expensive than the advertised price of 40$ so what should I do",
            "My ps4 starts its boot up normally then beeps 2 times and stops it’s been doing this since about 9 months after I got it and I’d hoped it would go way overtime, but I’ve tested it multiple times and it’s still doing the same thing. If this isn’t enough information I have more information with what’s happened to it in the past including my brothers inputting discs that weren’t meant for the PS4 into it but please tell me someone can help me here because I spent so long trying to figure it out and I spent $400 on this when it just came out",
            "So, years ago, I decided to save scum in Elden Ring to get the Frenzied Flame and regular endings. So I uploaded my save to a USB, went to an earlier save,  did FF and then closed the game for two years until today. But when I downloaded my USB data back to the PS4, I was told that it was corrupted. Worse, my PS4 decided to \"back up from system memory,\" except now I'm on the title screen with only the option to start game. No load or anything. So, is there any way to fix the corrupted data or am I fucked? I have no idea how a USB's data can be corrupted\n\nI'm confused about the game \"backing up from system storage\" but then not having any save data. Is there a way to check for earlier saves?",
            "For the past few days, my ps4 has been randomly disconnecting the controllers. It’s happening to BOTH controllers. I’ve tried resetting them but that doesn’t work. The first time it happened, the blue light flashed when I pressed the ps4 button, then it stayed on, but I couldn’t move anything. I had to shut off my ps4 and reset my controller for it to work for 1 day (the other one still didn’t work). Now, in the middle of me playing, the controller disconnected. Pressing the ps4 button makes the light flash for a long time. Plugging in just makes the orange light (my cable is the correct type of cable, I’m pretty sure. I used it to pair these controllers when I bought them new 2 years ago.) I managed to connect it again by turning off my ps4 and having my controller plugged in to the console. It worked for about 2 minutes before it went back to disconnected.",
            "Try on a different browser. If it happens across different browsers I would contact support with the error message",
            "Seagate are a great brand. If possible upgrade to a 2TB drive as it gives you the largest amount of storage that the PS4 officially supports for internal drives.\n\nSSDs are another possibility but the PS4 is bottlenecked so won't benefit from an SSD the same way a PC would.",
            "A charging cable only charges. You need to use a data cable that carries data and charges\n\nhttps://old.reddit.com/r/PS4/comments/1dfhzio/general_questions_tech_support_megathread_june_14/l8jucgf/",
            "Contact support",
            "https://old.reddit.com/r/PS4/comments/1dkuy1c/general_questions_tech_support_megathread_june_21/l9l2qgk/\n\nYou need the reinstallation file, not the update file. The wording on PS4 is a little confusing. Instructions in the above FAQ along with common mistakes to watch out for",
            "https://old.reddit.com/r/PS4/comments/1dfhzio/general_questions_tech_support_megathread_june_14/l8jucgf/\n\nSaved data & DLC are region locked. USA DLC requires a USA game\n\nUnfortunately Support is region locked too. Only USA Support deals with USA accounts.",
            "Contact support to remove the demo from your account",
            "New issue arises it doesnt turn on after two beeps anymore it only turns on after one 😀",
            "https://old.reddit.com/r/PS4/comments/1dl5rdp/elden_ring_shadow_of_the_erdtree_dlc_release/?\n\nWe've set a Megathread up for the DLC now. Apologies for the delay",
            "DLC is region locked. What region is your copy of Elden Ring?\n\nFor example, a US copy of Elden Ring requires US DLC purchased from a US account. DLC from other regions won't work with a US game.\n\nIf you have matching game and DLC and have game sharing enabled any account on that same PS4 can play that game and DLC.\n\nIt's worth noting that saved data is also region locked. A US game creates US saved data that only works with a US copy of the game. It doesn't matter if you have a Japanese account, a US game creates US saved data.",
            "Trine 1, 2 or 3?",
            "Bigger drives won't work?I was eyeing something like a 4TB Barracuda",
            "I tried the same cable with a different console and controller and it worked fine?",
            "thank you!!! This worked but while it was installing I got the error code SU-42477-4 do you have any idea why?",
            "Thanks, never would have imagined dlc is region locked even though games are not.",
            "Damn. Bought my disc in the Philippines, my account is US. Disc says “PLAS 11120” which google says is an Asian region? I’ve played Dark Souls 3 DLC before iirc I bought the DLC from US PSN store even though my disc was Asian (i think?)",
            "u absolute legend",
            "Officially the PS4 supports up to 2TB internal and 8TB external. People have used 4TB drives that worked as normal over the years if you search reddit, but I only advise Sony's official specs to ensure people buy product that is guaranteed to work with the PS4.",
            "Depending on how long ago that was the data cable may have been damaged. You can test the cable in safe mode or try a different cable that you know carries data and charges.\n\n9/10 times this gets asked its a cable fault/wrong type of cable being used so I'm still more inclined to assume it's a cable issue and not a console one.",
            "That error code could be a more general HDD failure. There's nothing clear in other reddit threads, just discussion of different possibilities.\n\nThe USB stick should work if set up correctly otherwise:\n\nThe USB stick has a single folder called PS4, inside PS4 is another folder called UPDATE and inside the UPDATE folder (capital letters necessary) is the PS4UPDATE.PUP file (around 1GB in size). Then of course the file needs to be PS4 without any (1) attached to the file name or anything else that changes it from PS4UPDATE.PUP\n\nThere's a couple videos online advising to format the HDD using a PC before trying the reinstallation again but again the error code doesn't have anything definitive from what I can see.",
            "DLC has been region locked since 2006/7 when the PS3 was first released. It's always worked this way.\n\nGenerally the CUSA code will tell you a discs region but the absolute easiest way without getting confused by codes is the age rating.\n\nESRB rates American games. So an ESRB rating guarantees an American game.\n\nPEGI rates European games. So guarantees a European game.\n\nEtc. So if you look at the games age rating and check that on Google that will tell you the region of the disc very very easily.",
            "Fair nuff, cheers man!",
            "tried again and it worked. No idea what was the problem haha",
            "its malfunctioning again. I think its a failing HDD. Every time I restarted the console I would get a checking the database thing and it wouod take a ton of time to turn on again. Also games installation would fail. Do you think this has to do with the HDD? If I replace it for a new one it might solve the issues?"
        ]
    },
    "Elden Ring Shadow of the Erdtree DLC Release Megathread": {
        "title": "Elden Ring Shadow of the Erdtree DLC Release Megathread",
        "score": 0,
        "url": "https://www.reddit.com/r/PS4/comments/1dl5rdp/elden_ring_shadow_of_the_erdtree_dlc_release/",
        "content": "Now that the DLC is out, please keep Elden Ring DLC discussion to this thread. Feel free to discuss the main game too of course.\n\n**Remember: DO NOT post unmarked spoilers and keep conversations civil.**\n\n-Share gameplay tips!\n\n-How are you finding the DLC?\n\n-How is performance on PS4/PS4 PRO?\n\n-Has it changed your opinion of the game?\n\nRemember that DLC is region locked. If your DLC is stuck on waiting to install then it's likely a region issue as a USA game requires USA DLC, European DLC will not work with an American game.\n\nRelease data including CUSA codes\n\nhttps://gamefaqs.gamespot.com/ps5/323053-elden-ring/data\n\n\n\n**POTENTIAL SPOILERS!**\n\nIn game requirements to start the DLC: \n\nhttps://www.ign.com/wikis/elden-ring/How_to_Start_Shadow_of_the_Erdtree\n\n\nMost importantly have fun playing it!",
        "num_comments": 17,
        "comments": [
            "Anyone out there?",
            "I'm wondering where the Moon Knight will be placed amongst hardest bosses in Elden Ring",
            "I'm actually having a problem installing it. It's stuck saying waiting to install and I've tried everything imaginable and it's still not installing into the game.",
            "Why is the elden ring dlc 45$ for me when it was advertised for 40$ and the pre-order price was 35$",
            "Now, before I go insane about a game\nI have a US account\nI have a US DLC\nFrom the look of it, I have a Europe CD, not a digital copy.\n\nDo I have any sort of solutions ?",
            "I'm waiting for some confirmation before buying it, because I've read only bad things. \n\nIf the performance is like Sekiro, I'll pass and wait until I get a better system, if it's closer to base game Elden Ring I buy it now.",
            "That's because DLC and saved data are region locked. \n\nYour DLC is looking for a matching region game and cannot find it, thus your game is incompatible with the DLC you purchased.",
            "You either need:\n\n1. A USA game (your save won't work as saved data is also region locked)\n\n2. European DLC (your save will carry over)\n\nIf you live in America option 1 is easiest",
            "I’m playing it on an old Ps4 and it’s only a tad slow in areas with tons of enemies (same as certain sections of the base game). Worth it so far, the map and new enemies are fun and challenging\n\nI’ll add that the load screens are a little longer than usual too",
            "What’s wrong with Sekiro. I have no problem with it even with the dlc. I have a slim",
            "Does that mean I have to buy the European DLC?? The audiobook and art book downloaded just fine,,,",
            "Thanks. If it's only slight worse than the base game I wont wait. \n\nWas afraid it was like Sekiro where I had to drop the game because couldn't get over the framepace.",
            "It runs horrible on mine (slim too). It's like It has all the problems of the From games but worse.\n\n\nMost people is not really sensitive of the framepacing maybe that's why It looks good for you.",
            "You either:\n\n1. Purchase a new copy of the game matching the region of the account you bought the DLC on. Your save won't be compatible with this new game\n\n2. Purchase the DLC on an account that matches the region of the game you currently own. Your save will carry over.\n\nSo before going any further find out the region of the game you currently own.",
            "I mean my ps4 sounds like a fan boat motor after an hour but it’s playing pretty smooth for my eyes except for a few very crowded areas",
            "Unfortunate that these are the only two options. Does anyone else know of an alternative solution? :(",
            "The alternative solution is not playing the new Elden Ring DLC at all.\n\nRegion locks have worked this way since the PS3 first released in 2006/7. It's just how the Playstation Network was designed. European games require European DLC and cannot read or register DLC purchased from any other region."
        ]
    },
    "Do you guys ever miss not having to install disc games? I know I do.": {
        "title": "Do you guys ever miss not having to install disc games? I know I do.",
        "score": 67,
        "url": "https://www.reddit.com/r/PS4/comments/1dldacz/do_you_guys_ever_miss_not_having_to_install_disc/",
        "content": "The question is in the title. Shoot away your answers as you wish.",
        "num_comments": 61,
        "comments": [
            "i got an old xbox 360 recently and being able to just immediately play a game i just bought is crazy",
            "if a disc is copying, im fine, what infuriates me is games like cod ww2 and the mw reboot. get the disc and unstill have to dona 120gb download like💀",
            "I don’t really mind because of the reasons and benefits of it, discs have to install because the read speed of the disc drive is much slower than the HDD and especially an SSD, so games get faster loading and data streaming.\n\nNot to mention, the disc drive turns itself off after it’s done installing/authenticating, so it makes a lot less noise and lessens the wear and tear on the drive since it doesn’t need to constantly spin while playing.",
            "Yep absolutely. Miss popping in a game and just playing. ",
            "Without a doubt, I still play my PS2 a lot, I just like sticking that game in and playing.",
            "I like discs in that I can sell or trade them after I'm done but the convenience of hopping back and forth between games without changing discs is too sweet.",
            "I miss it on release day when I just want to play the game I've been waiting for, and the clock keeps ticking, eating away my potential playtime on a work night. \n\nAfter that, I'm fine with it. I'll take PS5 load times over PS1 any day.",
            "Kinda? But also I just download the game or install the disc the day before I want to play something. I personally try and focus on one or two games at a time but have a list of games I want to play in the future. \n\nFor example, my long term game on my PS5 is Elden Ring. Then I have a handful of games that I know I want to play but will likely do after Elden Ring. So if I finished Elden Ring, I already have God of War 3 Remastered, the Bioshock Trilogy, Kingdom Hearts 1 and 2, and Detroit Become Human installed. I want to play all of these at some point and some of them I have played before but want to platinum. \n\nSo to me it doesn't make a huge difference. With my PS4 I kept a lot of games installed but didn't play them for months and months. This is why I personally never got an extended storage for my PS5. I can keep around 10-15 games installed and if there is something I really want to play, I can just install it that night and play it the next time. \n\nI feel that I used to get so upset at games needing to download in addition to the Disc because I was a kid. I had just gotten a game from the store and wanted to play it right away. However, as I grew up I realized it isn't the end of the world if a game has a download or update or whatever.",
            "I like the faster load times. I don’t really care about playing games immediately as I have already waited however long to get the game in the first place so what’s another 20 minutes. I also almost entirely go with digital and most of my PS5 games take like 10 minutes to download.",
            "Crash bandicoot Nsane trilogy. Only 1 on disc, 2 & 3 is a download!",
            "It's a minor inconvenience. If discs disappear what's Sony's incentive to discount games on THEIR store? \n\nWhat are you gonna do? Not play games? Ha!",
            "When I got my PS5 I was dead set on the disc drive. Turns out I haven’t loaded one disc into it yet lol",
            "Hell. I miss cartridges. ",
            "i miss when games were not constantly patched, and when a game was done, it was done.",
            "No because that's what I buy.  I like physical copies.  They can never be taken away.",
            "I've had my ps4 pro fir almost 5 years and I never even tested the disk drive yet. As matter of fact i havent used disks in any media for about 20 years. I suffered a lot with disks on PCs in the past so the moment an alternative showed up i moved on and never looked back. So je i don't miss it at all.",
            "I'm confused. Discs install data on the console no?",
            "Not really. I think as soon as you have any pc exposure it feels like the norm. Used to have to install using a disc. Now you just buy digitally and have to download. Same thing.",
            "It feels awful putting a physical disc into a console and having to spend more time on release day installing the stupid software instead of playing it\n\nFfs I spent like 40% of my monthly broke ass college guy budget on this damn doohicky instead of getting dinner you gonna make me pay with my sanity too >:[",
            "How many ps3 discs worked without patches?",
            "I got the disk ps5, so no",
            "Disc readers simply aren't fast enough for current standards. ",
            "I still use discs because of crappy internet",
            "Yeah. I still can with my Wii u.",
            "Definitely not. With fast Internet download speeds and updates don't bother me anymore",
            "I have a disk PS5. I still install disks. I buy physical copies and only download free PS+ games. Which means I need PS+ to play them. \n\nI am going to be angry when I have to play full price for a game and yearly subscription to PS+ to access them.",
            "I somewhat got to terms with it when it comes to larger games, as the hard drive's loading times are usually faster than the disc drive's.\n\nHowever, I really dislike having to copy/install _each and every_ small indy game, which could easily be played from disc, not needing or benefiting from the faster loading times.\n\nCatQuest, PuyoPuyo, Unertale, Deer Simulator, Duke Nukem 3D...why can't I play _those_ off the disc?",
            "Never experienced it in the olden days but I got a Nintendo Switch and just as I popped a cartridge Zelda booted instantly. That was a dream come true",
            "Yeah... :'(",
            "It’s the reason I went back to PC after this generation. I loved being able to just put on a disc and play on my 360, and on my PS4 I was constantly running out of disc space and waiting for giant installs and updates.\n\nBasically it felt like the plug and play advantage of consoles was gone. So when the Ps5 and the Series X rolled around I just figured a gaming PC was the better option. Higher initial cost, but way more variety in games and substantially better sales on software. Ends up costing way less over the lifetime and ALL games are backwards compatible.",
            "Miss? I do that regularly, my PS4 needs discs all the time and my retro PC uses disks and floppys too!",
            "As opposed to having to change disc multiple times if it's a huge game? Or worse, a disc that only works to download the actual game from the servers as if the disk is only the access code for the download.\n\nI'm fine with an install disc and then only using one disc for the rest of the playthrough.",
            "Grew up with consoles and PC, so the install process doesn't faze me. It's nice that games are on one disc now, well, for the most part.",
            "My disc-entering era has finally over ever since they introduced us the HDD-PS2 system.",
            "I don't mind, but then, you get very long load times, even for things like opening doors, area transitions, etc.",
            "Nope! will buy disc as long as I'm able.",
            "You mean do I miss having games bottlenecked by the optical drive?  no, not really.",
            "I don't miss it. Haven't seen or touched a disc game in a decade. Always surprised to see people still buy discs.",
            "The days of buying a game on disc, popping it in the console and just playing was pure bliss!\n\nNo patches/updates\n\nNo DLC\n\nNo online requirements\n\nI miss it.",
            "No",
            "Most days the disk is just a license key, with any install needing a big patch and updates.\n\nI am thankful however as I've used my PS4 disks to unlock free upgrades to PS5 native versions of games like Borderlands 3, No Man's Sky, Doom Eternal, Skyrim, Metro: Exodus, Cyberpunk 2077.",
            "I am fine with It, most of the times is the dlcs what take like 2 hrs",
            "It was convenient, sure. But it was also a time where games weren't so quality as they are now. Hence being smaller and fitting on a disc.\n\nId take the better quality any day.",
            "I would install the game to the hard drive anyway as you have the option. It would mean the game would load faster, make less noise as the disc wasn’t constantly spinning, saving your disc drive too.",
            "Yeah, the Xbox 360 was definitely better at having just small updates before you played. PS3, you often had to wait 30 minutes or longer while it installed the game or downloaded a huge update. There weren't many Xbox 360 games that had big updates or install times like that.",
            "This. My first ever experience was with cod mw. I was so confused that I had to install some many things for diffrent features. I miss when campaign, local multiplayer, online and all others features came on a single 30 GB disc.",
            "Yup yup, I also played PC games on the side so the idea of installing games is something I'm used to by the time it comes to consoles.\n\nMy old PS2 also had issues where it can't read the Disk multiple times causing stuff like long load times or freezing. Installing games like nowadays really lessens those disc based problems.",
            "I buy singleplayer games on disc and stick to multiplayer digitally. Saves time with friends and lets me focus on finishing one rpg or something at a time",
            "That's nsane",
            "Why can't we go back. It's not like memory is expensive any more.",
            "It didn't become ubiquitous until PS4/XBone era. For PS360, it was a rare thing (although of course updates and DLC are stored on the console). Usually you could just pop the disc into a console with no internet connection and play without installing anything.",
            "It's mandatory on the PS4 & PS5. On the the PS3 it wasn't. at least not always.",
            "Especially since the bloody thing won't install games in sleep mode\n\nWorse, I made the mistake of getting the $10 cheaper PS4 version of Horizon Forbidden to be Interested in the plot, and downloading the PS5 version took hours",
            "Larger size ≠ quality. There are plenty of games from the Xbox 360 era and earlier that are of equal quality or better then a lot of modern games. Quality has no correlation with the size of the game, unless you’re specifically talking about graphical quality.",
            "I went through all that and still wasn't able to get the campaign. Whatever I needed was \"No Longer Available in the store\"\n\nI'm currently using the game case as a coaster",
            "Ah okay I got it. Correct me if I'm wrong but besides the data copying (which usually takes minimal time) many PS4 discs can still be played without anything downloading no?",
            "So miss something that hasn't occurred in over a decade?  you know you're not on /r/PS3, right?",
            "Im talking about everything quality, which does include graphical quality, yes. Which does result in larger file sizes.\n\nSo technically, larger does equal quality. But no where am I saying older games do not have quality. \n\nThey do however, have outdated graphics and mechanics which can make a game not as enjoyable and can hinder its story telling by not having the same ability to show us detailed facial expressions and gloomy atmospheres, just as some examples.",
            "Without updates or extra data? Yeah, I think that a lot of my games can.",
            "You only miss recent stuff? Damn, must be nice",
            "well the switch does it if you want a recent example"
        ]
    },
    "Crash Bandicoot N. Sane Trilogy Tops 20 Million Sales, Might Be the Best Selling Crash Release Ever": {
        "title": "Crash Bandicoot N. Sane Trilogy Tops 20 Million Sales, Might Be the Best Selling Crash Release Ever",
        "score": 125,
        "url": "https://www.pushsquare.com/news/2024/06/crash-bandicoot-n-sane-trilogy-tops-20-million-sales-might-be-the-best-selling-crash-release-ever",
        "content": "",
        "num_comments": 9,
        "comments": [
            "I have no idea how I beat these games as a child. There are some absolutely insane levels.\n\nThat fucking rainy castle in 1, slippery castle or whatever. The suspended Bridge level. The side scrolling levels where even touching a pipe kills you. Fantastic collection but fuck me. Props to 10 year old me.",
            "That humble bundle deal a few years back was PEAK",
            "Played through these games earlier in the year. I never played much of the originals but the collection was very well done. Great graphics and sound! I did find the games a bit difficult, but maybe that's just a skill issue.\n\nI'm curious how well the Spyro reignited trilogy sold.",
            "No subtitles on the games so I’ve never been able to get it and be able to follow the story .  Wish they had included them",
            "Same here man, crazy how difficult that game is considering our younger selves could beat that shit. Crash Bandicoot, Spyro, Dave Mirra BMX, Coolboarders, and Syphon Filter were the only games I owned, so I had a lotta time to get good at those lol",
            "See that's  the trick, I never beat 1 as a kid. Only 3",
            "I am here to blow your mind with the knowledge that the remakes are actually harder\n\nVery slight changes in physics and collisions means you're way more likely to die to being slightly imprecise than on ps1. Hitboxes are pill shape instead of box shaped so you can slide off ledges instead of be firmly grounded with only your tippy toes touching and things like ice physics are just extremely inaccurate\n\nParts of crash 1 were always pretty hard but for instance on ps1 you could walk on the ropes of the bridges while on remake youre most likely gonna slide off",
            "It got 10 million",
            "Crash 1 had tough platforming and brutal checkpoints if I recall. I remember enjoying 2 and 3 far more"
        ]
    },
    "Any good couch co-op or puzzle game recommendations for a new gamer?": {
        "title": "Any good couch co-op or puzzle game recommendations for a new gamer?",
        "score": 7,
        "url": "https://www.reddit.com/r/PS4/comments/1dl86pw/any_good_couch_coop_or_puzzle_game/",
        "content": "I’ve been a PC gamer for the past few years but recently took out my dusty PS4 to play TLOU with my gf. In doing so, I found out that I really missed my PS4 and have a lot of fun playing games with my gf, but I also found that the zombies in TLOU games just make her cover her eyes most of the time and she never actually plays unless it’s the exploration parts. I’m looking for some recommendations for games that will be fun to play together even though she’s never really played anything before. They can be single player, but the goal is a game that will be entertaining for both of us even if one isn’t playing. \n\nRight now I’m leaning towards the Uncharted collection because it gives the Naughty Dog touch without the super scary enemies. I’m also looking at games that have less action and more just puzzles. It Takes Two is also pretty high on my list. Open to any recs!",
        "num_comments": 24,
        "comments": [
            "https://old.reddit.com/r/PS4/comments/11kyc3c/a_list_of_ps4_coop_games_including_couch_coop/\n\nLots of recommendations in this thread",
            "It Takes Two. My wife and I had a blast playing through that together. We also play Minecraft",
            "You could try Overcooked, Trine, or Dragon's Crown. ",
            "No Man's Sky is a great exploration game, always getting new updates with more content. If you want some splitscreen action Borderlands also is a good choice.",
            "Overcooked and ultimate chicken horse.  \n\n\nBoth are AMAZING coop experiences",
            "Streets of rage 4 is free on ps plus right now. It's a great game with online and local co op",
            "I usually enjoy playing \"Tiny Tina's Wonderlands\" (it's call of duty mixed with dungeons and dragons or I guess it would be borderlands)  with my daughter she's 14.\n\n The only issue that we have is that because she doesn't have her own PSN membership then it doesn't save her character but I'm not going to spend a bunch of money on that just for her to only play when she seldomly comes to my house to visit but I did recently buy \"Dynasty Warriors 8 XL\" and we've been enjoying the crap out of that game.",
            "Streets of Rage 4",
            "Lara croft and the temple of osiris",
            "Overcooked and PlateUp! (If you have a strong relationship)",
            "The outer wilds is my all time favorite exploration/puzzle game, ever. Do you like space? Do you like mysteries and archeology? You’ve gotta do yourself a favor and get this game. Single player only, although you can play it together and switch off when you make a discovery. My wife and I did that, absolutely stellar time! We even kept a little notebook with hypotheses we referenced from time to time. I’ll always go back to that game, it has never been topped for me.",
            "It Takes Two",
            "Puyo Puyo Tetris is amazing for localultiplayer",
            "Be careful with overcooked, that co-op can turn deadlier than mortal combat real fast ;)\n\nIt takes two was great with my wife.\n\nEdit: also prison break game, same developer as it takes two, bit older, can't recall name now, sorry.",
            "Try sack boy, its awesome, casual and fun. Along with it takes two. Also unravel is great at puzzles. I can also offer degrees of separation.",
            "Me and my GF have just started unraveled 2 and its great so far. It takes two was basically the perfect couples game so I do suggest waiting on that one",
            "I think you should try out lovers in a dangerous space time. It’s playable with 2 ppl but more fun with 3 or even 4 ppl",
            "Puzzle: The Witness",
            "I played a decent amount of couch co-op games and none of them is getting close to It takes two!",
            "Try a way out it's developed by hazelight studios and the story will leave you crying at the end",
            "Completely forgot about No Man’s Sky. I think I actually have that game somewhere in the vault after I bought it at release.",
            "PlateUp! sounds like your game. It’s on sale in PSN, download, and thank me later. It’s incredible.",
            "lol noted. I’ll check it out!",
            "The game you are speaking is A Way Out, its really much slower and we didnt have the nerves to finish it. Overcooked and move out arent for just anyone. We havent argued or shouted that much ever. Its fun at the end though but im a seasoned player while my wife is a casual so you could say i expect to win every time."
        ]
    }
}