{
    "Update Y9S2.1 Patch Notes (20 June)": {
        "title": "Update Y9S2.1 Patch Notes (20 June)",
        "score": 53,
        "url": "https://www.reddit.com/r/Rainbow6/comments/1dk8ybk/update_y9s21_patch_notes_20_june/",
        "content": "Y9S2.1 will be deployed today, June 20th for All Platforms: 09:00 ET / 13:00 UTC. The patch brings several fixes and you can [read them here](https://quoramarketing.com/rainbow-six-siege-patch-notes/).",
        "num_comments": 80,
        "comments": [
            "Did they mention the chat bug?  I don't seem to find it in the patch notes and annoy me to not be able to give a call out ....",
            "Apparently they finally fixed the infinite shooting sfx glitch. Thank god that’s been driving me nuts forever",
            "Am I taking crazy pills? How is it possible that they push this update without a fix for the deadzone bug? Not being able to aim in a FPS seems like it would be priority number 1. Am I missing something?",
            "When are they planning to fix the deadzone bug? Y9S3?",
            "Was hoping they would fix the voice chat bug on pc",
            "Umm… Ubi… The deadzone bug is still there.\n\nThey seriously didn’t just release a patch without fixing that did they? 💀",
            "Is anyone else having terrible performance drops this \"season\".",
            "Wake me up when they fix ranked 2.0",
            "Am i crazy or does f2 have lower recoil than before? Especially first shot recoil",
            "when are they gonna fix the chat bug",
            "Drone Glitch \nWhen a teammates drone is destroyed and it autos them to mine y Drone Grey screens and stops moving instantly. I have to flick back/forth from someone else’s to make it work again. \n\nChat bug \nCan’t input text into the chat sometimes. Generally between matches.",
            "“FIXED – Weapon firing SFX infinitely loops when operator is eliminated while downed.”\n\nYa bro. Just like all the other times this has been “fixed” I’m sure it will last",
            "Fix the deadzones on ps5 before i kill myself",
            "Was hoping for some balance changes",
            "Flores finally playable again",
            "Cheaters",
            "Anyone else have the bug on PC where every time you close the game and reopen it later it’s disconnected? I literally have to restart my PC every time before I boot the game up…",
            "Nice that the Flores drone bug is fixed.... but what about the losing control of my drone pre-round when another teammate loses theirs and starts spectating mine",
            "Have they already fixed the graphical issues occurring on Vulkan?",
            "have there been security updates like every day this week? every time i open the game i have a new one",
            "I haven't been able to use voice chat for months now (except one time when it worked for a game and a half just before the new season) even after reinstalling man when are they going to fix it :/",
            "Have they fixed the bug where rappel is bound to space instead of the navigation key bind? I have crouch bound to space and c for navigate and can’t rebind rappel to c. So when I rappel I crouch first and the animation takes longer. I still press c to get on the roof so I now have two binds for rappel effectively whereas I used to only have one.",
            "[No fix on the Vulcan graphic glitches.](https://r6fix.ubi.com/projects/RAINBOW6-SIEGE-LIVE/issues/LIVE-60978)",
            "they made the vulkan engine worse",
            "And yet they STILL haven’t fixed the deadzone bug. How hard is it to just revert the shit they had with last season??",
            "Nice an update. Oh no wait there is still not deadzone fix :)",
            "And Anticheat is dying 4 cheats in 6 games. The whole ubisosft is a joke",
            "Brava bug where you can't hack more than one object is still in there. ",
            "Where is the SPQR Shield skin?!",
            "they still havent fixed the deadzone glitch this is just fucking annoying",
            "I don't understand what the dead zone bug is. I play on PS5 and everything feels fine.",
            "It’s ok, they already fixed the important bugs like Players can eliminate more targets than what’s needed in Target Drill on the Kafe Dostoyevsky map.",
            "This one has been here for so long I don’t think there is any way they are not aware of it",
            "They've fixed that glitch like 10 times",
            "All fixes go through a lot of people, require time to test and approve. Last minute changes are typically not allowed because of the high risk of creating worse bugs. Updates are planned in advance. So it's nothing strange that something couldn't make it into a patch this time.",
            "Yea it's not really a concern to them, they'll take the entire season just to fix that so they can say they \"did something\"",
            "It's already \"fixed\" as in they reverted it on console, and just told everyone to reset their deadzones.",
            "Ubisoft’s bug fixing is apparently very bureaucratic and a hassle. Changes take not just a long time to do but also TO PLAN TO DO and then is compounded by needing to be approved constantly through multiple administrations usually. A company of that size will inevitably go through hurdles like that, the bigger your studio, the more logistics you have to do. And Ubi Montreal is a big studio.\n\nSimple number fixes or changes can take weeks, I mean they took 9 months to adjust recoil in LMGs and they clearly knew of the problem months before.",
            "They’ll say season three but a week before that comes out they’ll delay it to season 4 because they “really want to get it right”",
            "It’s ubisoft mate, might as well never happen /s \n\nStarting playing in 2015 and still going strong",
            "Its gonna be the Y9S4 content update",
            "It’s already fixed. They reverted it back",
            "They already fixed the deadzine",
            "Yup.  Flat out can't use vulkan after this update.  Occasionally getting total freeze ups that act like network freezes",
            "Use it yesterday in a first time from nerf in 1.5 years with flash hider, x1.0 scope and laser sight and damn F2 in his prime again. Super easy to control. Now i'm gonna choose between f2 and 417, not only 417",
            "I was hoping for an update on this as well…",
            "They’ve got to fix everything they managed to break before they can fix everything else they’ve broken, but I don’t doubt that somehow this patch will break even more.",
            "Seriously, that glitch was the absolute WORST",
            "He’s still bugged just not as bugged. If your drone dies you’re kicked back to Flores with an invisible gun and need to re-equip it.",
            "yeah now I can surely blow up people.",
            "Patch notes say yes",
            "^[Sokka-Haiku](https://www.reddit.com/r/SokkaHaikuBot/comments/15kyv9r/what_is_a_sokka_haiku/) ^by ^dominator-23:\n\n*Have they already*\n\n*Fixed the graphical issues*\n\n*Occurring on Vulkan?*\n\n---\n^Remember ^that ^one ^time ^Sokka ^accidentally ^used ^an ^extra ^syllable ^in ^that ^Haiku ^Battle ^in ^Ba ^Sing ^Se? ^That ^was ^a ^Sokka ^Haiku ^and ^you ^just ^made ^one.",
            "u have to go into a replay then exit it. Then ur voice chat should be working. I have to do this everytime I open the game up before I play a match",
            "It’s like “removed herobrine” on the Minecraft patch notes at this point.",
            "Lol that would be believable if all of these bugs didn’t make it into the new season. \n\nYou think they’re testing these mid-season patches/hotfixes when they don’t even test their new seasons? Delusional. *We* are the QA/product verification.",
            "It's just sad and pathetic to see. 2 weeks and they can't revert a change they intentionally made.",
            "Yet they did a last minute thing to push a shadow add thing like the deadzone crap?",
            "The problem with this view is Ubisoft have a history of leaving bugs in the game for months between patches - sometimes bugs so bad, you needed to stop playing the game at high ranks. \n\nIt's better to wait a week than to wait a month.",
            "As a technician in real life, I can tell you that if that thing isn't broken, don't fix it.",
            "[deleted]",
            "So not actually fixed",
            "yeah it’s definitely not fixed",
            "Nope, its still around",
            "So you must just suck at aiming in general. It’s far from fixed",
            "Nope… Still bugged. This is well documented.",
            "Its not bro that was not a fix just a recommend",
            "They did not. You don’t know what you are talking about.",
            "Exactly like me. It isn't even a known issue aparently.",
            "Sometimes the freeze up will be a few seconds, other times it’ll just kick me out the game similar to no network. Is that what’s happening to you as well?",
            "The balancing team is on vacation",
            "I said playable",
            "Ohhh I see it now, was reading through everything earlier and must've overlooked. Cheers",
            "To be fair, there used to be an objective identification bug with drones that lasted years and years and a while ago they actually found the cause and fixed it haha. Sometimes the bugs are really deep in the spaghetti code haha",
            "Bugs happen dude. I’ve never played a game that hasn’t launched an update without bugs, across tarkov, the finals, hunt, cs2 even had some. The other guy was right, this is a perfectly normal way to do things.",
            "My bad, they had a Twitter post 2 days ago saying it was fixed. A daylater they came out and said it’s still bugged. I haven’t played since then so I couldn’t tell ya",
            "My bad, they had a Twitter post saying it was fixed. Hours later they came out and said it’s still bugged",
            "My bad, they had a Twitter post 2 days ago saying it was fixed. A daylater they came out and said it’s still bugged.",
            "Haven't gotten the total kick yet but yes.  The best one so far was getting into combat and the freeze was so bad that while aiming down sights it kicked me out of ADS 4 times.  My friend was spectating and amazed how it looked on screen.  My character basically froze up, jittered like crazy and then died",
            "Yes they lied. Honestly its not your fault, they should have never tweeted out it was fixed until they confirmed it was fixed. It’s alarming how incompetent they can be."
        ]
    },
    "These are the people who ban clash. I wanted to bleach my eyes after this game.": {
        "title": "These are the people who ban clash. I wanted to bleach my eyes after this game.",
        "score": 662,
        "url": "https://v.redd.it/wrtj199f708d1",
        "content": "",
        "num_comments": 106,
        "comments": [
            "I want to ban you for that crazy aspect ratio",
            "Bro playing in portrait mode",
            "Teammates literally AI without the I part",
            "People being afraid of clash is so stupid. JUST RUN UP TO HER",
            "did they change claymore damage? I feel like that should have killed the jackal. I also noticed since a couple seasons ago, that the clash/claymore trick didn't really work anymore.",
            "lol what was his plan, to aim at clash and hope they drop their shield?\n\n\nTeammates that don’t understand that they have to push as an attacker frustrate tf outa me",
            "how the fuck do you play like that😭",
            "I personally piss my pants and start having an incredibly violent convulsion every time I see Clash so I'd say he did pretty well",
            "tiktok aspect ratio",
            "At what point do you realize running away is only letting them recharge the shock to kill you",
            "AHhahaa literally braindead.",
            "People clown me for the clash ban until its 4-4 match point and they bring clash",
            "Good god if it's a 1 on 1, just charge her! Getting shocked and then hiding while her shield recharges just means you're gonna get shocked again. I can't believe how many people just try and edge her from a distance",
            "Yet theyre alive and you arent",
            "Never put trust into ranked 2.0. “You’re hidden mmr will put you in lobbies with people your skill range” then you get teammates like this",
            "Clash is the weakest shield op in a 1v1. Literally run up to her melee her and there's absolutely nothing she can do.",
            "“Why do people ban clash” because she has the potential to gridlock an entire game, not only that she’s basically guaranteed to knock you and your team down a quarter to half health when you encounter her, and if they’re really smart they’ll do what they did in this video and embarrass the shit out of you and your teammate.",
            "clash  is such cancer only cowards play her",
            "The fact that so many people just want to be the one to kill the shield op and not work together is frustrating beyond belief.",
            "Looks like he completely forgot that he could melee her shield then remembered at the end. Which is reasonable IMO considering how rare it is to encounter Clash in a match nowadays.",
            "Of course the most important thing was to grab the defuser, when it is totally clear that he won't be able to place the defuser.",
            "I need to bleach my eyes, too. The options are 16:9 and 4:3. what in the fuck am I looking at rn? Least the playstyle of Sit and Do Nothing is pretty common. I'm used to that.",
            "I'd also bleach my eyes at that aspect ratio",
            "My guy is playing on vertical stretch mode, I swear some of ya'll do the absolute most.",
            "Blitz- Dont Push, Keep Distance \nMont- Dont push alone, only with teammates\nClash- Push at all costs",
            "Thats the reason I ban Jackal, because Jackal players are the biggest scrubs in the game and even worse at playing him...",
            "For one, that aspect ratio is what bleaching your eyes should be for\n\nAnd 2, the most annoying thing ever, is being last alive in a 1v1 against a clash, and plant isnt down yet, unless your an op with explosives or something, if the clash plays properly (keeping distance and stagger shocking) and waits till you either try to plant, there is no way to win unless they mess up or they try playing aggressive for whatever reason.",
            "I got a bad teammate when I was playing clash. In a 2v1 situation, Monty plants in site and walks out the door to outside site and then I start walking up to the door (as clash) to block him so my teammate can defuse for free. Instead my teammate rushes past me and goes out the door like half a second before I can block it and dies leaving me in a 1v1 with Monty having the advantage.  I shock him and also shoot him and unbeknownst to me, get him down to like 20 HP but I don't know he that and end up losing because I have to just try and defuse.  But that was like the free-est win that my teammate threw for no reason.  We ended up losing the ranked game because of it.",
            "Holy moly",
            "Yeah if you see a clash in prep phase you should immediately be coming up with a plan to clear her early. You do not want to be in a end of round scenario with a clash",
            " Clash mains rise up!",
            "I try to ban class every single game I hate shields but I hate taser shield most",
            "I don't even play the game anymore, but how the fuck is it 2024 and people are still running away from clash shield???",
            "I’m getting cooked for playing siege stretched 💀🙏, coming from csgo, is this not normal ?",
            "Bruh! All these people defending clash. Do you see the amount of work and stuff he had to go through just in hopes she hit a clay more. That was the only way he was gonna kill her\n He tryed everything and only could hope! That she would.hit the clay more\n That's crazy! That's why clash and montange bans are a must. Lol I shouldn't have to backflips and magic tricks and pray to gods in hope clash will run into a clay more or that I have a split 2nd after punching her in hopes I can shoot her arm or foot.",
            "people are banning clash because she is lame as hell to play, to play with, and even worst to play against. not because she is op",
            "Clash is broken and shouldn't be in the game",
            "You’re dead. So, you didn’t do well that round either.",
            "I’ve probably lost to clash once or twice ever… in fact seeing clash on the enemy team just makes it a 5v4 in my book💀 it’s hilarious watching people ban clash because you just know that they have about a total of 4 brain cells shared between the team.",
            "So we’re in roasted cockroach 4",
            "Brother is playing on 2:1",
            "Shrink-res",
            "They are OI, without the I",
            "Exactly lol, like why do people sit there and be stunned for an hour 💀",
            "Its frustrating and being a solo queue. I ban clash because I know my team cannot deal with her. Every single game clash is not banned my teammates sit there and take shock therapy for 2/3 of the round until the round ends or they die.",
            "Good Clash players I come across with have someone with them waiting to gank you. So no. I don't want to be baited to a killing hole.",
            "I would but that electric stun is such a buzzkill. I know melees make the shield move but it’s so hit-or-miss for me… Sometimes I get it, sometimes they get me. But when I play as Clash I play the exact way shown in this clip lol",
            "and do fucking what? meele her and shoot her legs when she turns and Blocks her legs anyway? with 3 other enemies arround? clash is cancer and the people playing her are too shit to play anything else",
            "I’d run if I wasn’t being electrocuted",
            "I don't want to.",
            "Yes I think they made it so it doesn't go back much if at all anymore, I have tried to do the clash trick a few times and they took no damage",
            ">Teammates that don’t understand that they have to push as an attacker frustrate tf outa me\n\nSomething something \"what do you mean sitting outside until there's only 20 seconds left is a bad idea? You must be stupid if you think entering the building works!\" - sadly too many people even on this sub.",
            "that’s the best part… they don’t. i swear some of these people have the IQ of a brick",
            "Literally huh?",
            "That’s a good thing then it’s basically a 4v5, she is statistically the worst defender in the game at high level countered by simple teamwork",
            "Found the jackal",
            "Can’t argue with tht",
            "Average Clash W",
            "W clash",
            "It's pretty bad for you, limits your FOV",
            "No, it is not",
            "Its completely normal with higher ranks/more competetive players",
            "It is, just Reddit is filled with very casual players that dont really take the game very seriously so they just see stretched and think it’s “sweaty” (in the competitive ranked game xd)",
            "It's a 1v1, he never had to rely on a claymore at all. Straight up just run at her.",
            "i pray that this is /s",
            "Melee... Shoot... Clash dead... Everybody happy",
            "Skill issues",
            "Clash really isn’t that good as long as you have a base understanding of  her gadget and how it affects you",
            "She has the worst stats for any defender at high level and is countered by simple teamwork.",
            "Found the Jackal.",
            "Bros playing on the Loony toones one of a kind Kids monitor",
            "4:3. 2:1 would mean the screen would be a rectangle where it is 2x as wide as it is tall, not nearly square.",
            "It's a 1v1, she literally can't do anything.",
            "You shoot her teammates first while she does like 10-20 damage to you. And then when it's 1v1 you get a free kill 95% of the time. The other 5% she does some ninja move that still usually fails. Which is why she has an astronomically low win rate and play rate.",
            "played a round of ranked last night… we were up 3:1 and then an enemy picked clash… the whole team lost their mind, we didn‘t kill her once afterwards and lost 4:5 in OT",
            "I'm doing totally fine with other OPs, but the desperation of guys like you makes her so fun to play ;)",
            "yes, you'd run TOWARDS her, not AWAY from her",
            "So you’d rather hide and lose on time?",
            "man that sucks. I think it was a pretty cool tech, not like crazy op",
            "Hey! That’s offensive to bricks!",
            ">Simple teamwork\n\nYou expect too much.",
            "Clash is easy to deal with if you have friends, solo can suck. You always seem to have those teammates who don't change their play style to combat her, same mindset as those who pick the same site despite getting their asses kicked there.",
            "She is one of the best defenders if she got a team that cares enough.",
            "xD",
            "Playing in 4:3 doesn’t affect fov, it’s all preference. I just find it makes heads easier to see",
            "Not this aspect ratio though",
            "What's /s",
            "Yeah doesn't work that way",
            "Exaggeration",
            "But the one with clash will have adventage anyways",
            "If everybody is of a similar skill level it is really not that easy to just shoot the teammate first",
            "To be fair tho all clash has to do is walk backwards as she's zapping someone and they can't move quick enough to catch up",
            "Real",
            "I mean regarding changing sites if I’m in a stack sometimes I prefer to play the same site even if we just got shit on bcus we know how they play and can change up the strats rather than go into a new site blind but it really depends on what the site options are",
            "It does, actually, you can check it yourself. And since you're a cs player you must've seen those clips from tournament matches of pros not seeing enemies on the edge of the screen due to 4:3\n\nEdit: Here's one\nhttps://youtu.be/t8X0ptdh3P4?si=W8okZa28UFaa50k4",
            "Its just 4:3?",
            "Its a tone tag, it means serious",
            "On PC ranked higher tier stats,  Clash is so bad she doesn't fit on the graph when Ubisoft releases stats. Her icon is literally below the graph axis. Her winrate delta is four times as bad as the next worst character.\n\nShe feels very oppressive a lot of the time but she has a lot of weaknesses that a confident player can exploit. If you think she's broken, then I doubt you're going to play with enough confidence to beat her. Clash's shield is knocked to the right when she is hit. Many Clash players will turn to counter this but it's not perfect. ​",
            "No they don’t it’s so easy to deal with her",
            "Stack absolutely, solo it's risky because 90% of the time the exact same attack happens and nobody seems to expect it (why I dont know), ending up in another ass kicking lol. Drives me  insane 😅",
            "Lmao, I forgot abt tht clip. You’d think with such a disadvantage 4:3 would completely be erased from the pro scene.",
            "Maybe, too many hours too deep to switch tho. 1x also feels so much better on 4:3",
            "It means sarcasm you’re thinking of /srs",
            "walk back and shock, get to cover and shoot",
            "Don’t worry, 4:3 is good, in fact its very common in pro league. Beaulo for example is widely considered on of the best players oat and uses 4:3"
        ]
    },
    "Is this even possible?": {
        "title": "Is this even possible?",
        "score": 477,
        "url": "https://v.redd.it/i4245n9sn08d1",
        "content": "",
        "num_comments": 20,
        "comments": [
            "He has a champ background so that means he got you fair and square",
            "Hockey puck got blasted by another hockey puck, unlucky for you",
            "This is one of the least bullshit deaths I've seen from a fuze puck. There's a common trick used on Chalet where a Fuze can kill you in the basement if he puts a charge on the window on the 2f balcony",
            "the more you understand fuze chargers the more you notice that they dont make sense\neach little pixel if in the roght spot can spawnpeek a guy from last matchq",
            "Damn didn't know fuze had a Minecraft tnt launcher",
            "😂 I guess",
            "glad to see the heat seeking hockey pucks are still going strong",
            "Oh, yeah, it happens all the time",
            "Redguio",
            "Skill issue frfr",
            "\"Allow me to introduce myself\" ahh puck",
            "Dude got Minecraft TNT cannoned",
            "Puck yourself",
            "Yeah, you didn't buy the membership, you know?",
            "valid",
            "Video?",
            "My guy/gal/person, it is impossible to understand the way of the hyper-explosive hockey puck. It is just too complicated. 😔",
            "not very nice of you",
            "so many of it exists in youtube. Search Fuze Chalet.",
            "Ok thanks"
        ]
    },
    "Bro the knife was literally in his neck.": {
        "title": "Bro the knife was literally in his neck.",
        "score": 938,
        "url": "https://v.redd.it/xqhoi27zpy7d1",
        "content": "Bruh",
        "num_comments": 71,
        "comments": [
            "knife stops the bleading, and his teamates can use the power of molesting to get him on his feet again",
            "Yeah it’s not really until the animation ends happened to me a couple times trying to stick",
            "Well you deserved it for not buying membership",
            "Should’ve checked for friends, how often do you see a solo monty when theres all 5 enemies up?",
            "It’s funny because yes the knife is in his neck but the animation bar at the bottom was also full af. I’ve noticed with rook armor too that the animation lasts WAY longer than the bar at the bottom. \n\nAnother notable is doki’s gadget you can make the phone call and cancel out like 3/4 of the bar through and the gadget still works as intended. Just shorter time to function",
            "*gives animation progress bar to show when animation is complete and reveal mechanic is triggered*\n\n*bar fills up*\n\n*reveal mechanic doesn't trigger*",
            "Nah, you got greedy. Just kill and tea bag bro, thats all you need",
            "first time? This has been happening to me for almost 10 years",
            " They should really update the progress bars on those…",
            "I feel your pain, sometimes I wish that animation was just half a second shorter",
            "This happened to my friend recently.. so bs. You should at least get the kill if not interrogation you literally stabbed his neck",
            "This has been a problem for a while now, feel your pain bro",
            "Typical day of playing siege tbh",
            "Animation was not done yet. You got interrupted at 99 percent. It's why not too many play cavi: to use get gadget you basically have to forget your surroundings.",
            "Tbh if I cared about not dying I wouldn’t have done the interrogation. I just wanted to do it, if I die whatever, my teammates would have had an advantage anyways if it processed. It’s just dumb that it didn’t count.",
            "I'm pretty sure that's exactly how it used to work when cav released but they nerfed how long it took to interrogate a little while after",
            "Reason 420 why Caviera is a bad operator (Ubi please buff her she's been in the trenches since actually forever)",
            "Tbh if there’s an open door right there I’m not even thinking about interrogating. Just shoot, run, and flank again.",
            "Knifing is booty",
            "I had a similar situation where I got the kill but did not get the interigate",
            "what da sigma",
            "I just redownloaded rb6 i haven’t played in a couple weeks ive lost all my operators can anyone help?",
            "Crazy how we had better more realistic assassination technology during 2010 when Halo Reach launched lol.",
            "I used to be a cav main and i have around 5k hour in this , this is a rookie mistake you must never interrogate a montagne so early near the bomb site obviously there is supposed to be someone droning for him and waiting to push with the monty",
            "The exact thing happened and cost me the match at 4-4 ... I am still mad -_-",
            "I have had this happen so many times, i feel your pain",
            "You gotta stab him, take the knife out, tie your shoes, stand back up, pop your back, call your mom, and make a sandwich before the animation is truly done.",
            "And? Animation wasn't through and thats it. You were a bit to greedy.",
            "It’s a problem. Happened to me the other day as well",
            "you didn’t scream “INTERROGATING” loud enough",
            "gunna cry about some whack ass interrogation when u did it right in front of aquarium doors and u were dead anyway☠️☠️ kids will cry abt anything, js get better",
            "\"the power of molesting\" I'm going to add that to my list of cursed sentences that I've read on the internet",
            "😐",
            "Same. So dumb. I’ve said the exact same thing. “The knife is literally in his neck!”",
            "monty bought the clash royale gold pass",
            "Bro couldnt resist",
            "Besides the point of the clip",
            "You used to be able to stop deploying a mute jammer at about 2/3rd of the way too and it would still deploy. They ended up just shortening the time at the bottom, so the current time is what it used to be if you animation cancelled.",
            "Why t-bag?",
            "Maybe before interrogating check around for people...?",
            "Exactly",
            "There is no problem at all, animation wasn't throught thats it.",
            "I knew I had a high chance of dying but the fact the interrogation didn’t process is annoying even though the bar was full and went away",
            "Was just interrogating, I could have easily just shot him in the head and ran if I wasn’t Cav",
            "I guess so. But like another person said the bar was full and literally went away like I completed it. Just kind of wished the animation ended maybe half a second sooner. I don’t care, even if I died I just wanted to get the interrogation to help the team.",
            "I wouldn’t have cared if I died, this was a quick match anyway. I just wish the interrogation processed since it shows him getting stabbed before the animation finishes. Which is annoying, makes you think you killed him.",
            "I feel like ur not actually good at the game",
            "How do i get that Caveira Main tag?",
            "Bro I bought member ship instead of regular pass and one month for the same price as battle pass but with so many more perks it's worth it at least one month bc I got battle pass with 10 free battle stars included a free epic kit for ash and some other cool perks",
            "Them French Royales were begging to be consumed",
            "His complaint isn’t worth answering, animation didn’t finish so it didn’t count, whats the issue?",
            "emotional damage",
            "Why *not* t-bag?",
            "Tbagging is cringe af",
            "*wHy T-bAg?🤓*",
            "Yes, that's the only problem",
            "Yeh tbh I got no explanation other than it’s rainbow and it’s ubi at this point. Could just be genuinely unlucky, but it could also be shitty netcode which has been notoriously bad this season so who knows. New depths of trash can ubi reaches.",
            "Oh yeah, if you don’t get all 9 digits of the operators social security number, you won’t complete the interrogation; it’s stupid. But in general tho, the melee animation in Siege is so inconsistent",
            "Have you ever tried to place the defuser with 0.5 seconds left? You hold the hey down and the animation starts, but if the defuser is not on the ground when you reach 0 seconds you lose anyway. They could have done that stuff differently, but hey it is what it is. I'm just saying nothing work incorrectly here.\n\nMaybe next time you know to bait your prey a little bit longer. ;)",
            "better then what ever this was bro",
            "Go to the main subreddit and then look for the 3 dots in the top right and then look for the option \" change user flair",
            "Do u get to keep the skins and also the battepass?",
            "Animation should have checkpoints for consistency. They had already filled the bar.",
            "Tbagging is asserting dominance, i was there on the first tbagging",
            "People like you are the reason this game remains toxic",
            "No I don’t think so. But hey look I know I probably could have played better. But all I’m saying is that the animation should end as soon as the knife goes into his neck therefore killing him along with revealing his teammates locations. But I guess “it is what it is” like you said",
            "I have t-bag as a macro",
            "I remember when it was called gorilla jumping. Then gorilla humping. Then corpse humping. Back then it was only done on the site of the kill, not from any distance at all. Now it's like a ritual. A celebration. A dance of superiority. A display of digital dominance, taunting a rival to retaliate.",
            "We all love it that way",
            "Jesus Christ it’s Jason bourne",
            "Literally no"
        ]
    },
    "2 weeks after I buy it on marketplace": {
        "title": "2 weeks after I buy it on marketplace",
        "score": 106,
        "url": "https://i.redd.it/2yutr1eb028d1.jpeg",
        "content": "Bucks my main, so I decided to spend some credits on his black ice. 2 weeks later and this is my pull. ",
        "num_comments": 7,
        "comments": [
            "Also, that keyboard is not a xim, it’s just for my pc.",
            "I’m glad I haven’t been accepted to marketplace yet..I pulled the same thing 3 weeks ago after years of wanting it",
            "i’ve pulled 4 of these between my two accounts 😭",
            "I sold mine as I assume they would get cheaper once people realize that you can simply spend bravo tickets to grind them.",
            "How do you even apply lol",
            "I thought it launched for everyone for all items?\n\nNo wonder I can't sell my AK74M then.",
            "Pretty sure it launches on 25th or 24th."
        ]
    }
}