{
    "Mod Applications Are Open!": {
        "title": "Mod Applications Are Open!",
        "score": 23,
        "url": "https://www.reddit.com/r/rareinsults/comments/1aiall8/mod_applications_are_open/",
        "content": "Are you an active member of r/rareinsults with a basic understanding of the sub rules? Can you work as part of a team to curate the sub's content and encourage great posts? \n\nCome join our team! \n\nYou can apply [here](https://forms.gle/uVRR8uZbxMeJ9eBX8), and if it seems like a good fit, the team will reach out to let you know.",
        "num_comments": 1,
        "comments": []
    },
    "My first mistake was being on instagram reels in the first place but the comment cracked me up": {
        "title": "My first mistake was being on instagram reels in the first place but the comment cracked me up",
        "score": 29031,
        "url": "https://i.redd.it/mv665pgkbz7d1.jpeg",
        "content": "",
        "num_comments": 448,
        "comments": [
            "This is a reminder for people not to post political posts as mentioned in stickied post. This does not necessarily apply for this post. [Click here to learn more](https://redd.it/j2173n).\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/rareinsults) if you have any questions or concerns.*",
            "An ass so tight she could pick a cherry by the stem.",
            "Smack that ass and end up with a shattered hand from the impact.",
            "*Clench my butt cheeks and rip your dick off...*\n\n-Eddie Murphy, Delirious.",
            "(Tf2 frying pan sound)",
            "Why do her asscheeks look like handsome Squidward",
            "\"Cracked me up\" pardon the bun.",
            "Still hot in a weird way, wouldn't mind trying, though she could probably snap me like a twig clenching.",
            "[removed]",
            "Anna Mroczkowska.\n\nYou're welcome",
            "can someone translate that? I have no idea what it means",
            "Clit lookin like a spark plug",
            "Steroids are crazy, bet her clit is bigger than my dick.",
            "I’ll be honest, I never knew that’s what glutes actually looked like. I mean I’ve seen butts before, but to see the definition where the glute separation to the hamstrings is crazy. I always thought the glutes were round, but clearly a sculpt glutes like her looks like diamonds",
            "I gotta say, excellent work hitting leg day, those muscles look amazing!",
            "Bet this person can pick up stone from the ass",
            "The Grip is so tight it rips my weewee off",
            "Cheeks don't clap on this model... I specifically requested cheek clappage!",
            "That’s a nope….one sneeze and your Johnson gets cut off.",
            "Mmmm, steroids.",
            "Man that sculpt is masterful tho",
            "DEATH BY SNU SNU",
            "M8 I'd take that as a compliment",
            "You worried about how back shots sound? She could flex her pelvic floor muscle and just keep your dick.",
            "your algorithm is weird af bro... idk wtf youve been watching to get this... but you might need to take a break brother... i could scroll everyday for a month and never see this",
            "Your second mistake was opening the cesspool that is Instagram comments.",
            "Her farts can only be heard by dogs.",
            "That's actually not that far from the truth; I had a buddy who dated a girl who was heavy into bodybuilding, and he told me (after they broke up, ofc) that when he hit from behind that it was like fucking a brick building. 🤡",
            "Is this the famous dick guillotine ?",
            "Who’s “Gates of Mordor” of an ass is this?",
            "When you lick her clit and it licks you back.",
            "I didn't know a couple of those muscles existed.😳",
            "Smash!",
            "This helped me understand quad and glut anatomy better than my actual anatomy classes did",
            "Masters of the Universe physique",
            "What are back shots?",
            "That ass can stop a Sabot HEAT.",
            "Instagram reels have some of the funniest comments anywhere. I still randomly laugh about someone calling a musician “Subtext's biggest opp.”",
            "Smacking her on the ass would break your hand, elbow, and dislocate your shoulder all at once.",
            "No \"Plap\" \"Plap\" \"Plap\" just \"Clank\" \"Clank\" \"Clank\" instead..",
            "Instagram has the best comments lol",
            "Ass so tight only dogs hear her farts",
            "Shawty squirt like a garden hose on jet mode",
            "Can we respect the development on those posterior chain muscles tho?",
            "So is this what pan sexual means??",
            "Ass so tight a fart has to ask permission to come out.",
            "Talk about IG reels. I got tired of seeing the Kendrick Lamar concert that I started clicking \"Not interested\" why? \"It makes me uncomfortable\". I did that probably over 20 times and it still kept recommending me videos from it. They know you don't want to see it yet they still push it to you.",
            "I don't understand people in the comments that are attracted to this. To each their own, but nah",
            "Less worried about my \"pull out\" game than her \"let go\" game.",
            "I love Instagram reels comment sections... Some folks are absolute savages in them",
            "Need more Peds",
            "natty hours",
            "Dropball champion gonna show you how the pros dobit",
            "That thing does a kegel, it's definitely snapping something off",
            "Smash, next question",
            "They called it the nutcracker and it was glorious",
            "With legs like those, he’s bending over, giving back shots to HER",
            "Never skip Kegal day.",
            "On the real, Good Mornings are awesome for glutes and hammies",
            "Anyone got any workout tips for thy ass?",
            "That's a strong lookin' turd-cutter",
            "I mean .....",
            "Daughter of Kangaroo and Arnold Schwarzenegger",
            "Yes. Recording in the gym was your first mistake. \n\nAnd holy hell, you definitely never miss leg day",
            "I'm losing my shit 4r! Ahhhaah\n\n🤣 🤣 🤣 🤣",
            "Holy shit those hammies and adductors",
            "I looked her up. She looks like handsome Squidward.",
            "She must shit diamonds.",
            "*metal_pipe.mp3*\n\n*metal_pipe.mp3*\n\n*metal_pipe.mp3*\n\n*metal_pipe.mp3*\n\n*metal_pipe.mp3*",
            "Don't even know what that's supposed to mean and yet it seems so accurate.",
            "She gotta be able to snap your dick in half if you try",
            "Gym clothing has gotten ridiculous. Her \"shorts\" don't even cover her glutes.",
            "Clanging like the robot in Robot Chicken",
            "Forged in Fire\nTV Series\n2015–\nTV-PG\n42m",
            "Death by snu snu",
            "Came here for the comments. Did not disappoint 🤣",
            "🪵",
            "**My first mistake was being on instagram reels**\n\n\nDon't be trying to get us to convert to your kind of freak offs bruh",
            "Fine line between butt fat and can you crack walnuts with that thing ?",
            "That level of muscle is just disgusting at this point.",
            "Nice",
            "I've heard of an ass that won't quit, now I've seen an ass that can't quit",
            "Based and roidpilled",
            "She's training real hard to have legs like that.",
            "Puts the Maximus in Gluteus Maximus",
            "\"Oh God, you could grid meat on those...\"",
            "Yall clownin but that pussy prolly tight asf\nAn \nDAMNN YOU WASNT LIEEIIINNN\nshawty got more definition in them but back botty muscles than a graohic designer on roids",
            "snu snu pls",
            "Damn…I mean… just… damn",
            "Damn, that's impressive.",
            "Omg....those leg muscles O_O",
            "Sorry Reddit, insta has the best comments",
            "I wonder how much she can snatch?",
            "No phones in the gym Gomer.",
            "Yeah, stay with a good person 🏄‍♂️",
            "**[CLANG]**",
            "😂🤣😂🤣",
            "It's called a spittoon and they're not cast iron.\n\nOld time classic TV reference. \"Bullseye\" if you will.",
            "That is disgustingly",
            "All I can think is this clip from a anime \n\nhttps://youtu.be/Q0dHCJ4W5Pw?si=ByfJCzZ1DvyTxV-C",
            "ting ting ting",
            "That ain’t a hamstring, that’s a hogrope",
            "An ass so tight it could bend space time.",
            "hey girl, howsabout you come back to my place and help me move this couch upstairs? i got protein powder! let me know...",
            "Pan shot!!!!",
            "Pan shot!!!!",
            "#spatoon",
            "HOLY MOMMY",
            "Back shots?",
            "Wait that's a she? If that's true Holy moly that red colour of the skin is not due to blood anymore",
            "I’d let her rip my dick off",
            "I like that you can see the guy taking this photo and that she’s likely looking right at him in the mirror",
            "Instagram reel comments are always",
            "Tbh reels is a rareinsults goldmine",
            "Es verdad JAJAJAJA",
            "Death by Snu Snu!",
            "Call the Geneva Convention, I would like to report a human rights violation.",
            "so tight bro that's my goal",
            "She’s got about 6 1/3 random dicks just resting in there hoping to be free one day. She just snatched em right off!",
            "I wouldn't eat that ass with Betsy ross' dick",
            "She could end my suffering",
            "Is nobody going to say the word steroids?",
            "Would",
            "https://youtu.be/JPAo5-UOJ8g?si=TKWblesUxzTizUza",
            "i thought that was a man",
            "This is how the backshots sound:\n\nhttps://youtu.be/uCmwxPr5uJQ?si=VPHyBjEytu8gWZvH",
            "Is that Queen Kong Margie Green Cave Woman of the South?",
            "She must have an impressive workout routine. I salute her gains.",
            "Holy shit muscle definition!\n\nAs a hetero guy who lifts, I am double-miring",
            "Do guys like this?",
            "Lump a coal up there you’d have a diamond in a week",
            "Anyone remember their heman toys?",
            "I love me some buff women, she a bit extreme tho",
            "Have you ever realised the ass is basically deltoid muscle s.",
            "Would",
            "Yes ploz muscle mommy",
            "Berserk Dragon slayer sound effects",
            "*clang clang clang* goes the trolley",
            "Is that a man or a woman?",
            "I would be worried if getting accidentally castrated during the sex from behind",
            "I thought it was CGI because of how smooth and toned the legs and glutes are. They are just perfect muscles",
            "I choose death by snu snu",
            "That shit would make chuck norris flinch",
            "I need an entire mobile suit just to stand a chance",
            "Instagram reel comments are a a whole different animal.",
            "Ah! So that's what they mean by \"buns of steel\"!",
            "She does jumping jacks neighbors don't get no sleep cause of her",
            "The ass that inspired the Flying Butt Pliers from Ren & Stimpy",
            "Bro that comment Is so out of pocket lmfaooooo",
            "Is that real?",
            "Don't fart then",
            "Bonk",
            "Looks like her legs are on backwards!",
            "Steroids make people look unnatural and rancid, we all know you’re taking chemicals",
            "Zero flexibility. The sex is always terrible",
            "Cake? Na! She got pan.",
            "Is that real or CGI? Because it looks like something out of Shrek",
            "So cringe",
            "That’s a bow tie!",
            "Bro how tf is that an insult???",
            "What does a cast iron pan sound like?",
            "That ass can press diamonds.",
            "Berserk sword clanging noises.",
            "A Muscle Sands Gym character viewed on a crappy PC.",
            "She's lifting weights and breaking stereotypes all at once! 💪🔥",
            "Gross",
            "🚢",
            "\"Pinch a Loaf\", butt it screams in agony...",
            "Ghislanine from Mushoku Tensei.",
            "Pa-ting",
            "Jesus Christ 😲",
            "I’m good. I’m already circumcised. Thanks though!",
            "Almost positive that’s a dude",
            "Who took this pic of me?",
            "Anyone getting Ghislane vibes?",
            "Nope",
            "This is a filter/photoshop, right?",
            "Be eatin ass of a water buffalo! Might as well stick an orange between two trees.",
            "\"I'm scaroused.\"",
            "Imagine the grip! Awoga!!! Brr! Brrr! Eeeeeer! Boogh!\n                                                🚘.   🚘.      🛩️.          🔥",
            "I’d fuck that but I’m a danger slut. The fact that if she coughs my dick is gonna get snipped off like jewelry wire gives me a fear boner.",
            "A lifetime of celibacy sounds more appealing than that.",
            "Gross.",
            "the only woman Golden Freddy could do without hurting them",
            "She could hurt you",
            "Gross",
            "Then gives it back to you tied in a knot",
            "And crack walnuts",
            "Eat a piece of coal and shit a diamond!\n💎",
            "That ass could perform heart surgery",
            "She’s been pulling all the trees in our yard out of the ground with her Vice grip cheeks\n\nHelp!",
            "sounds juicy n delicious.....the cherries picked l mean",
            "Like slapping mahogany.",
            "I see a Tom and Jerry style skit. ",
            "is that a Nas lyric?",
            "On H20?",
            "[For context](https://www.tiktok.com/@standupcomedyshort/video/7276874226106207521?lang=en).",
            "Homina! Homina! Homina!",
            "Exactly what I thought… fuck I’m old.",
            "Look mighty cute in them jeans!",
            "Still one of the best stand up specials ever.",
            "C’mere boy!",
            "*squinch up my butt cheeks ",
            "KRONG KRONG KRONG KRONG KRONG KRONG\n\n**CRUNCH**\n\n#YEEEEEEEEEEOOOOOOOOOOO-",
            "Catch and release. (Metal pipe clanging sound)",
            "My mind went to the Half-Life 1 crowbar",
            "[https://www.youtube.com/watch?v=\\_GGfz-o5khc](https://www.youtube.com/watch?v=_GGfz-o5khc)",
            "Both used steroids probably",
            "Very cheeky",
            "Involuntary circumcision, well, a lot of them are.",
            "Death by snu snu.",
            "That's the point",
            "I do not feel the same way at all",
            "What is so weird about it? She is smoking.",
            "I don't think it's weird. They could protect me anytime they want! \n\n\"Thanks for the support!\"",
            "Nothing weird about it, boy.",
            "I see no issue with that",
            "Nah, not even a little bit to me.  Everyone has their own preferences but overly fit women is a major turn off for me.",
            "she can def still get it tho",
            "Probably?",
            "I dated a bodybuilder. She was amazing.",
            "Squeeze like a toothpaste tube",
            "Might as well fuck a syringe. That’s where the muscle came from. ",
            "I totally feel ya. It'd be an experience for sure.",
            "Muscle mommies are extremely my shit.",
            "This is so weird it's not even homosexual",
            "[deleted]",
            "I think you mean wood",
            "The spirit is willing, but the flesh is spongy and bruised",
            "You wish you could",
            "In Soviet Russia, cheeks clap you.",
            "“You’re welcome.” That’s debatable.",
            "Anna Pedsalotta",
            "No thank you.",
            "You do you, homie",
            "Perfect proof of how squats don't lead to big butts, just solid, striated butts. All the IG models with phat cheeks clapping, selling glute workout plans, are just scammers.\n\nEDIT: Why are people dumb? I don't understand it. It's not hard to be smart and acknowledge reality.",
            "> Anna Mroczkowska\n\nhttps://i.ytimg.com/vi/AbUKku-o45w/maxresdefault.jpg",
            "What do you mean \"you're welcome\"?\n\nNo one is jerking it to that rock formation.",
            "Sex from the back would sound like someone hitting metal",
            "We have the same picture",
            "With twice the spark!",
            "Has to rub her clit with a pumic stone",
            "There's a sub for that lol",
            "I know. It's fucking impressive.",
            "anything is possible when using steroids",
            "They don’t clap, they clatter.",
            "Talk about a nice marmot",
            "Your friend is a liar, because muscles are soft",
            "now that is crazyyyyyyy!!!",
            "oh sweet summer child, bless you",
            "Yeah: incredible",
            "Sorry Aubrey. \n\nRough times.",
            "You saying you dont have curiosity attractions? Like, wow thats unique... I wonder.\n\nUltimately the equipment is right, the voice is right, I mean basically, if you are trying to say she's too manly, I think theres way more that goes into what is feminine.\n\nThat said, even if you feel that way, no ones totally straight.",
            "Not necessarily attracted to it, but I'm definitely appreciating the hard work and strength that comes with this. The definition is top freaking notch.",
            "I don’t know, I think you’d be the one getting smashed in that relationship.",
            "Not at all some do most dont",
            "I personally don't",
            "I wouldn't seek it out, but I'm open to it. Depends on her personality.",
            "Pretty clearly a woman, male muscle development looks a fair bit different",
            "No she's a bodybuilder who uses steroids heavily",
            "It's so filtered I thought this was Sims gym edition",
            "brah that's what I was just thinking like wow.",
            "Find the cherry at your own risk",
            "That’s not the only nuts that’s be cracked 😆",
            "She could crack macadamia nuts!",
            "Pitted, for safety.\n\nHappy Cake Day!",
            ".... Mahogany.",
            "Upvote for the effort of finding this and sharing it 🥇",
            "I put Raw over it but Delirious is still funny as fuck.",
            "I imagine the Tom and Jerry level shout.",
            "Lol",
            "I'm deceased.",
            "Damn, these puns sure are glut enough.",
            "OH FUCK OFF",
            "More castration than circumcision I'd say",
            "A good friend of mine once said, \"I'll stick my dick in anything once.\" Words to live by.",
            "idiopathic epispasm is the way forward here",
            "Involuntary de-gloving, ftfy :P",
            "The vast majority, I think.",
            "An honorable death, for an honorable soldier",
            "/r/deathbysnusnu",
            "overused",
            "[deleted]",
            "It’s not exactly natural. There are definitely steroids involved here",
            "Fucking really muscled people isn't usually pleasurable.",
            "Mostly the steroids.",
            "She is smoking them steroids alright.",
            "Uhhh the steroids home slice",
            "Everything is subjective.  \nI personally get squeamish from big muscles and low fat / high muscle definition. Seeing the muscles through the skin makes me think of being flayed.",
            "Overly fit? Nah, this isn't fitness at all. It's steroid abuse. It's actually less healthy. No natural would have legs this large while being this lean.\n\nYou don't like women on gear.",
            "Jealous!",
            "2 very different sensations",
            "Ahh so that's why people call me needle dick",
            "so?",
            "r/sounding has what you're looking for",
            "My fave is /r/leanbeefpatty",
            "Why would you even take up this cause \n\n*It’s hot in a normal way*\n\nFine. Name one celebrity whose thighs have a damn sandcastle wrap on em. Just any woman you’ve ever seen who is not a bodybuilder who has the musculature we’re lookin at here. \n\nIt’s awesome, but it is unusual and it will be intimidating to some people.",
            "I think you mean tree trunks",
            "*Wood you kindly?*",
            "Wooed",
            "Anna was going to compete for her country in the Olympics as a figure skater. She would have taken the gold, if it wasn't for those meddling drug tests.",
            "SHe's Polish, not Russian.",
            "She is from Poland...",
            "That's fair",
            "Anna JustCellTecha",
            "Each to their own",
            "🫡",
            "Wait....yes they do.  I've been squatting and doing general glute work for a few years and my butt is much bigger than it used to be.   This ladies but is large, and to have striations you need to be really low on bf%, which would make your butt smaller.   In what way would growing a muscle not lead to a bigger butt?",
            "You’re mistaken. You have to have insanely low body fat to look like this. \n\nFor 99.98% of people, squats will absolutely help your ass look bigger.",
            "That's ridiculous. If you do the exercises and eat properly, you will experience hypertrophy. There is a maximum amount you can gain, but it's just ridiculous to say you won't gain muscle.",
            "/r/confidentlyincorrect \nwith a side of\n/r/iamverysmart",
            "Dude. I just got done getting yelkat at about saying something EXISTS. LIKE, YOU COULD TOUCH IT, OTHER PEOPLE CAN SEE IT...I mean Jesus. And it was a LOT of people",
            "Glad to finally see this sentiment. It's the same as telling someone they can get bigger tits from benching. Nice asses are genetic fat distribution. If you have no fat, you can't make up the difference with muscle, even on gear. We are talking liters of volume difference between big juicy asses and flat asses. Not possible to put on that much muscle on your glutes.",
            "Definitely for research purposes 😉",
            "The \"you're welcome\" was aimed at those who might find this hot and trying to find out who she is. But each to their own",
            "Speak for yourself",
            "Speak for yourself coward, our children will settle the stars",
            "ohhhh thanks",
            "Nah man, back shots would be your cum hitting her back. So when you’re fucking her doggystyle and pull out and cum on her back it would sound like an old western spitoon.",
            "You can't just say that and not drop a link!",
            "You may be surprised how many people take lots of steroids and will never look anything close to this",
            "I mean sure, but that’s still a LOT of time in the gym even with gear.",
            "They don’t clatter, they crush.",
            "Imagine two large metal bowls tumbling down a flight of stairs",
            "I just want my career to end in peace man",
            "There's a conversation to be had there but it almost seems like you're telling me that everyone should like this and if I don't I'm lying. It's not attractive at all to me. I am not attracted to a muscle to this extent, especially not this much. There are some masculine traits I like in women, but this one is not appealing to me.",
            "I can respect that, it takes a lot of dedication to look like that, with or without supplements. And if that's what she wants to look like then that is great for her. Probably feels good",
            "Hard work and steroids you mean",
            "Death By Snu-Snu!  I accept my fate",
            "https://youtube.com/shorts/zeplgjsmxqs?si=zWN5MIGTI_Q4QTzn",
            "Ballnuts.",
            "Mine too 😍",
            "Ill masticate to that!",
            "[AND NOT JUST ANY MAHOGANY](https://www.youtube.com/watch?v=14D5wKSVlXg)",
            "\"AAAAAAAAAAAAAAAAAAA,\" or, \"OOOHOOHOO\"?",
            "In my head, I heard a [Wilhelm Scream](https://youtu.be/4YDpuA90KEY?si=T7MonuEFG6UENXQX&t=19)",
            "Don’t be so anal",
            "That would be if the nuts were squished. The term you are looking for is \"penectomy\".\n\nSource: I googled iz.",
            "> More castration than circumcision I'd say\n\nI don't see a scenario in this hypothetical situation where she could remove only the testicles. It would be full on emasculation- and non-surgical (IDK if there is a word for that).",
            "Prophetic, you mean. Once, and never again",
            "This is heinous. Upvote.",
            "I think what’s more disturbing than the sheer volume of lean tissue/muscle is the proportional absence of fat. Men are healthy down to around 4%, while women are healthy down to about 11%. I don’t know what her body fat percentage is, but I bet it falls below what’s considered medically healthy and I’d bet that’s why some people get the ick response. It’s like a step below uncanny valley",
            "You're not wrong.\n\nShe's probably got more testosterone in her system than most men with that many steroids.",
            "would love to hear her voice!",
            "She is on all the juice. Look her up: Anna Mroczkowska",
            "I prefer squishy people myself, but I can't speak for everyone",
            "As if you have experience with that",
            "Nor do I like women with 6 packs or a lot of definition.  But please, tell me what else I do and don't like lol.",
            "TIL a reddit to avoid",
            "There's a reason she is featured in /r/massiveroidgirls/\n\nAs always:I do not doubt she works out hard but you can not look like this without some very serious amount of 'roids. Check https://youtu.be/VD9p9tEP9RE for what's possible and what is not.",
            "She was born in the USA",
            "It’s not just about the amount of muscle/fat, but the shape. The shape your butt develops into is mostly based on genetics. \n\nIf your butt got bigger/rounder after working out, you have your genes to thank.",
            "Did you see any videos of her online? Her butt is not large. It's just solid, but still small.\n\n> In what way would growing a muscle not lead to a bigger butt?\n\nGoogle male and female bodybuilders. They have very small, but solid, butts, and can squat multitudes more than IG butt models with basketball-sized cheeks can. Big butts are about fat distribution, not glute workouts.",
            "> I've been squatting and doing general glute work for a few years and my butt is much bigger than it used to be.   \n\nBecause you've certainly been eating at a caloric surplus thus your butt gained weight (fat).",
            "Any big ass a person has is due to fat distribution, not workouts. Anyone can just google male and female bodybuilders to see they have no ass, just straited muscle, that isn't big. That's my point.",
            "And her glutes are massive",
            "it will but its an illusion. it feels like bonk",
            "Hey, if you wanna fuck titans then I have nothing but respect. I'm only a demi-god myself.",
            "wait so you guys don’t agree on what it means either?",
            "Backshots is just hitting it from the back bro",
            "r\\bigclit",
            "You might be surprised how many people stop and take no risks as soon as the first  helath problem due to the steroid occurs. ",
            "Publicly date a milf and also announce all your kids",
            "Yeah, you don't just stick a needle in your arm, have a cartoonist reaction, and then stand up looking Arnold Schwarzenegger. Even if you take steroids, you gotta be in the gym a LOT to have legs like that.",
            "Not a bad way to go",
            "I never thought I would die this way, but I kinda always hoped",
            "The spirit is willing, but the flesh is spongy and bruised.",
            "A warriors death",
            "Deeznuts",
            "Cool to see a DBZA joke in the wild, they're rare these days",
            "#AAAAAAAAAAAAAAA",
            "https://youtube.com/shorts/GUXTEAza5rg?si=fxJHpq7dxlJimfvP",
            "Sharing isn’t always caring",
            "A grip so tight you would end up degloved.",
            "I imagine it wouldn't remove it so much as make it like when a Looney Toons character gets run over and is paper thin. Suddenly your peen is 2D.",
            "Emasculation! I couldn't remember the word. Thanks",
            "No way men are healthy at 4% bf lol",
            "[deleted]",
            "4% you are about to die lmao. pretty weird to use extreme example of gear abuse as your healthy line",
            "Exactly, everyone has their preference of course, but if she had some nice body fat amount on top of those muscles she look awesome.",
            "To sum it up she looks like a jacked dude. Thats why its weird.",
            "Doubtful. Most likely Anavar and SARMS. \nYou'd have to be really stupid to take highly androgenic substances in this day and age as a women trying to build muscle and / or compete in female bodybuilding unless you're powerlifting or actively want to transition sex and she does not look like a powerlifter and judging by her attire I'm guessing she isn't looking to transition to a man any time soon. A low dose of test might be used but it would not be much and certainly much less than what a man produces naturally.",
            "It's amazing to me that people will try and defend that this is actually possible without massive amounts of steroids. \n\nLike yeah you need to work out A LOT to get that kind of physique without taking 'roids. But it's literally impossible otherwise unless you're some kind of freak of nature.",
            "That may be so, in which case she's of Polish descent. Still not Russian.",
            ".... sure, but it's not going to get smaller.   It will get bigger, just maybe not the shape you want.  ",
            "If your butt got bigger after working out, you have yourself to thank. You were the one that worked out.\n\nThe shape of the fat (And where your fat storage is biased) above the glutes is decided by genetics, but it's size is certainly not.",
            "Bodybuilding isn't about maximising your ass, dude. It's about getting a *specific* body type and it is *not* about lifting a lot of weight (though they are strong).\n\n\n\nAss is litterary your glutes and fatty tissue. The only way it gets bigger is either you get more fat (all of your gets rounder) or you train your glutes so it gets bigger yet also firm and nicely shaped. And ofc plastic surgery..\n\n\n\nOr like this lady here, enough steroids to make Arnold jealous",
            "You have no idea what you're talking about.",
            "If you put more muscle under the fat it gets bigger.",
            "Yeah because they cut fat like crazy for shows.   Having a solid layer of muscle under the fat will make it bigger.   It's just....a fact.  ",
            "No, I'm holding less fat than I used to.   I am a trainer on the side and I take pretty regular measurements.  My butt and anyone who works out for it gets a bigger butt.   It might not be able to look like the Instagram models, or it might not be the shape you want, but it gets bigger.   The muscle grows.   How can you say that it doesn't make it bigger, what happens then?",
            "Putting on muscle on your glutes will give you a bigger ass.  Look at anyone who’s got a strong deadlift and squat deep and they’ll probably have a nice ass.",
            "Your point is incorrect.",
            "Which is only a bad thing if you’re a coward",
            "All will have a place in our pantheon, little one",
            "So as an old dude, I'm noticing the change in terminology. It used to just mean back cumshots, but I keep seeing it mean the way you're using it. Language is weird.",
            "No",
            "Some of those are straight up lil dick ngl",
            "Yeah that's what i said, someone could read your comment and think it's possible with just hardwork. It isn't and it's unnatural. Your comment was misleading people, i fixed that.",
            "It would have cost you nothing to type such horrors",
            "She would be a valuable asset for mexican cartels",
            "What an awful day to be literate.",
            "Arbitrary medical numbers are arbitrary, that’s just the rule of thumb “don’t go below this figure” number. Seemed useful for this point though. \n\nStill, I wonder what the actual range of healthy is, given all the possible body types and all the types of unhealthy there are. If I were a really shitty twilight zone writer I’d write an episode where a researcher goes slowly insane trying to come up with an exact answer for that lol",
            "Men can typically manage 8% over a long period of time, any less and no, not really.  That's peaking for a bodybuilding event shit",
            "Yeah, I was adding to your point by emphasising that it’s largely a proportion issue not a sheer volume issue, sorry if it sounded like I was trying to correct something.",
            "Well no, lean tissue doesn't describe the absence of fat specifically, an Eddie Hall type has very high amounts of lean tissue as well",
            "AthleanX got people misunderstanding body fat",
            "Yeah just read another response, it seems I incepted “go below this and you die” as “until this point you are healthy”, which is not a corollary of the former. \n\nNo fear, I sit far above 4% as a man, hell, I well exceed the other figure of 10%. \nObviously, using my superior logical reasoning, if 4% body fat is less good than 10% body fat, 20% must be better again!",
            "How can she look like a dude? Most dudes don't look like that.\n\nits like saying a man with breasts looks like a woman.",
            "I mean, from that angle in a still shot she looks plausibly like a jacked dude, but extremely muscular women don’t look like extremely muscular men do",
            "you clearly overestimate people:D",
            "Check the video, he shows someone with very good genes. There is still limit of muscle mass you can put on naturally.",
            "Not genetics, it’s hormone receptors",
            "> Bodybuilding isn't about maximising your ass, dude. \n\nFor Women’s Wellness division, it absolutely is. And that’s what she competes in. Glutes are the largest muscle on the human body. And she does have huge glutes. The picture does not highlight them.",
            ">Ass is litterary your glutes and fatty tissue.\n\nYes, and the fact that female body builders have flat asses shows that big asses are about fatty tissue, not glute muscles.\n\nWhy don't you accept reality?",
            "you but if you ever slapped a squat butt its… not as soft as it looks\n\nit feels like bonk",
            "It’s likely changed because it’s generally ppl in hip hop culture using it and getting shot=getting hit\n\nHitting it=fuckin",
            "it’s not a horror until it’s been lived… ‘til then, it’s just sparkling terror…",
            "Those are the *if you are at this number you run the risk of serious health complications or death* figures\n\nPro body builders are at that number for competition week and that's it. Men really shouldn't go below 10% and women shouldn't go below 15%. IMO 20% is a healthy number if you're looking for longevity. Fat is important",
            "There isn't really a hard and fast single number for a lot of things about the human body.  We're designed to operate over a wide range of parameters.\n\nBut, like, if we load our ancient 16' box truck up to the point where the mud flaps drag, it still drives mostly fine.  You're just putting all kinds of extra stress on various systems, and the longer you do it the more likely it is that one of them is going to fail.",
            "I'd watch that episode",
            "... she looks far more similar to the peak masculine form then peak feminine form... does this spell it out for you clearly enough without you feeling the need to be pedantic?  \n\n\nA man with breasts from a certain angle not showing their face or hair could absolutely look like a women... and it would be weird which is the entire point of the thread... ",
            "Not really.\n\n I took a look at the Instagram handle and it seems to be for a trainer of female ifbb pro bodybuilders. These people know what they are doing and what drugs to take and they are not taking high doses of testosterone.\n\nLook at female bodybuilders from 20 years ago and look at female bodybuilders now. You will notice that female bodybuilders of the past are basically men with tits.\n\nFemale bodybuilders now still look like women for the most part.\n\nThe difference now is the availability of less androgenic steroids and SARMS(Selective androgen receptor modulators) and the fact that the ifbb is trying to get rid of the old image of female bodybuilders.",
            "You do realize they cut back all fat temporarily for shows.   When they put fat back on.....how is it not bigger?   ",
            "Rofl. You're a living breathing example of dunning Kruger.\n\nThose women body builders are specifically trying to build certain muscles over others. They're also dehydrated and starving when they compete. Their bodies are not examples of what you get naturally from a well rounded work out.",
            "Possibly, but I'm pretty sure those terms have been around longer than backshots. I honestly suspect it's more just a generational misinterpretation. Younger kids just thinking it means a different thing, and that spreading faster than anyone corrected them, so now there are two competing meanings.",
            "Thank you for the updated info!\nExcuse me for the stupid and pernickety questions, I’ve had those 4% and 11% figures lodged in my brain since sometime in late childhood and I’d like as much surrounding info as possible, so the next thing I lodge in can be as accurate as possible. \n\nAre you saying that women shouldn’t go below 20%, or are you saying that both genders are better at around 20%?\n\nInteresting that the “death figure” is a little further away from your health figure on men than on women - are those 10%m and 15%f figures your personal reckoning, or are they figures prescribed by a specific organisation? Like, did you say 20% for women contradicting an official reckoning?\n\nAgain, thanks for correcting me, I’ve been subtly wrong about this for ages.",
            "> she looks far more similar to the peak masculine\n\nWtf does that even mean?\n\nShe looks like a woman. Any comparison to a man is coming from your own psyche.  \n\n>A man with breasts from a certain angle not showing their face or hair could absolutely look like a women... and it would be weird which is the entire point of the thread... \n\nOh, if you excluded everything but the breasts, it would look like a woman? make sense.",
            ">Female bodybuilders now still look like women for the most part.\n\nYes, because they are getting work done to keep their faces feminine. Plus, face Filters.\n\nBut with legs like those, she has to be juiced to the brim",
            "Yeah they def have, but kids gonna take shit and make their own shit.  Your option is def possible too.  Either way they’re close enough definitions where one is gonna lead to the other lol",
            "Well your numbers wee correct if by \"healthy\" you meant \"able to survive without organ failure\". But in terms of what's actually not going to cause you detrimental health effects, probably optimal would be around 13% for men and like 17% for women.",
            "So like you said before there's a lot of hot debate around the topic. *Personally* I think both genders should shoot for 20%. That way you can cut a little bit for a photo shoot or whatever but your *normal* BMI is safely on the side of \"enough fat to maintain adequate hormone balance and overcome minor fasting without impacting lean mass\".\n\nThere are absolutely people who would disagree with me and there isn't a lot of good science on the topic if your area of concern is longevity. Personally though I'm very pro fat in the sense that I think your thyroid and subsequently hormone levels require lots of lipids *and* that lean mass is the most important figure and your body should **never** need to metabolize muscle for energy. Adequate fat reserves compensate for the chaos of a life well lived.\n\nAesthetically 20% does not look nearly as attractive as 15%, I cede that point, but I seriously question if the aesthetics are worth the health risks. I also really question if males should be simulating a fasted state long term. Because of menstruation and associated hormones we have a lot of evidence that women risk hormonal imbalance at lower BMI but I *personally* question if men risk the same issues in a less obvious way. The little bit of recent research on testosterone shows that adequate fat/water/salt are beneficial to higher T levels. Again this is personal conjecture and not based in any solid science.\n\nAs far as the 4%/11% those are *bare minimum* figures meant to track **starvation** among **malnourished** populations. Any serious body builder will tell you that they are *suffering* at those low BMI numbers and cannot maintain that level long term. Again I question the safety of even getting that low willingly but I digress. If you want to encourage health and wellness, don't look at starvation measures, look at where the body is healthy without detriment either way.",
            "We are talking about everything in the foreground of this picture...",
            "as  I just responded to another person\n\n\"i can promise you if a your average gym attending man was placed beside her along with your average gym attending female they would certainly look closer to the male then the female lol.  She is shredded like a man on steroids.... i don't get why this is so offensive... human beings in general aren't this fucking shredded because this isn't a natural look at all.  However, the biggest percentile of steroid users are male and so yeah... she looks closer to that percentile of humanity...\n\n\"Oh, if you excluded everything but the breasts, it would look like a woman? make sense.\"\n\nAre you always this difficult and needlessly pedantic?  I was literally making a comparison since the women in this picture also has their face/hair obscured so you can only see the muscle fibers of her legs which absolutely resemble that of a male body builder which there are FAAR more of then female.\n\nHow you struggle so hard with this very basic premises while trying to make it seem like your average female looks like this is ridiculous gaslighting lol.\n\nPeak masculine form would be something along the lines of how hercules is portrayed in mythology... peak masculine form would be more something along the lines of Aphrodite or what have you... sorry if this offends you but thats just the way most human beings have perceived the male and female form throughout history.  Yes you can make an argument for more rounded women being considered attractive in medieval times compared the thin women we have today but thats besides the point and I hate that I even feel the need to defend that point because your being so needlessly difficult about this.\n\nIf you're an exception that prefers their females looking like this power to you but you have to admit that you're an exception and your taste isn't regular.",
            "Personally I think those numbers are genetic abnormalities and not representative of the general population, but they are *far* more acceptable than 4 and 11%",
            "I'm sorry bro but if a man with a similar amount of muscle was in the same picture, I can promise you it wouldn't look the same.",
            "Yep. The foreground with the legs that belong to a woman. Yes. We are talking about that human female in the picture.",
            "That’s a lot of words to deflect from the fact at she’s clearly a woman. \n\nUsing this logic, tall women look like men. Or men with long hair look like women. Or skinny men look like women. \n\nSorry bud. You can immediately tell she’s a woman, and if you’re arguing this hard otherwise, it’s most likely due to your own sexual repression."
        ]
    },
    "my fault for opening Instagram ": {
        "title": "my fault for opening Instagram ",
        "score": 1883,
        "url": "https://i.redd.it/lz1i6e6yu18d1.jpeg",
        "content": "",
        "num_comments": 65,
        "comments": [
            "This is a reminder for people not to post political posts as mentioned in stickied post. This does not necessarily apply for this post. [Click here to learn more](https://redd.it/j2173n).\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/rareinsults) if you have any questions or concerns.*",
            "???",
            "id take that as a compliment tbh",
            "They're just calling them feminine. Kinda like helen of Troy, whom they're probably referencing.",
            "Where is the insult ?",
            "As a modern Greek, I don't get the joke.",
            "Dude thats a major compliment",
            "I mean it can be taken as a compliment also\n\nPS: Can I ask for the instagram of the person in the pic plz?",
            "Calling him a twink, Greeks were very into twinks in mythology and in the ancient era for anyone that doesn’t understand",
            "r/lostredditors",
            "but Patroclus could actually lift",
            "He's mad attractive tho",
            "I love how everyone is focusing on the ancient Greeks comment but not the one about French indie directors",
            "Lmao I saw this vid a while back.",
            "Seems more like a rare compliment",
            "Its funny cause gex",
            "r/backupcorners",
            "Ew",
            "He's saying he looks like a twink, and the Greeks were notoriously gay",
            "No the plot of troy is also that achilles' boyfriend got killed which made him go batshit insane. they are referencing the boyfriend",
            "The first comment talks about that Greeks likes gay boys so much so that they would do in war for the dude. That is the joke.",
            "Say gex or smth",
            "Femboys hot. Women. Ugly.",
            "im not and i still dont get it",
            "Here, you dropped this..    /s",
            "I presume since it's instagram, it's meant to be an insult\n\nnot saying that it can't be taken as one, I'd take it as one lol",
            "which one was that story that his wife had to go to war so he castrated a dude that looked like her and married him?",
            "You can barely see him lmao",
            "that's true and I'm a guy so guess I'm greek",
            "link where? 😡",
            "Not that insulting though, really. I mean, there are lots of skinny feminine men around, not all of them are beautiful. The commenter presumably thinks this guy is beautiful. Hard to see the insult…",
            "They were gay but they weren't into twinks. They strongly believed in physical fitness and regarded unfit people(both men and women) as ugly, both physically and mentally.",
            "Its funny, but like the one war, most people remember about ancient greece was started over a woman. Then again the best fighter in that war was totally gay sooooo",
            "Most of the plot of The Illiad is Achilles being a bitch cuz Agamemnon stole his girl and not fighting till Patroclus dies in book 16. (Who BTW is not at all implied to be his boyfriend in The Illiad, only later poems not from Homer mention that)\n\nHe then proceeds to shout so loud that some Trojans drop dead, make up with Agamemnon, kill a bunch of Trojans, fight a fucking River, chase a god, kill Hector, and hook him up to the back of his chariot and drags him around Troy 3 times. \n\nOk I’m done scratching my Illiad itch now, thanks for reading.\n\nTLDR: Achilles is a bitch for basically the whole poem then kills a bunch of people, also he doesn’t have a boyfriend, he was even going to marry a girl.",
            "Yes i get that but being called pretty is not a insult is it? If it is i would like to be insulted a lot .",
            "Gex?",
            "Is this some kind of cope in America to propagate the idea that Western culture is fundamentally gay?\n\nAncient Greece had pederasty, after 15-16 would be considered too manly for gex.",
            "Thee joke is butt fucking",
            "U can't say that on reddit",
            "Still looks more attractive than most people whom I see clearly every day",
            "As a none gay, none Greek guy. :/",
            "“Hard to see the insult”\n\nThat’s why it’s a rare insult",
            "I know, but I didn't make the joke so :/",
            "Bisexualty was normal. Its not because achilles is gay that he wasn't attracted to women. He literally took briseis as a concubine because she was so beautiful.",
            "Achilles was defo gay man I get he doesn't wanna talk abt it but let's face the facts",
            "You have to really understand Ancient Greek honor codes to understand that story. Achilles didn’t care about the girl— it wasn’t his girlfriend. It was a spoil of war. They didn’t even see those women as humans really, just prizes. Agamemnon was taking prizes from ALL the men, which dishonored them, but no one was willing to stand up to him, until Achilles. \n\nAchilles didn’t care about that girl, or anything really, except his pride, his honor, and Patroclus. Whether or not you think he was gay, Achilles cares more about Patroclus than that woman. Also, having sex with younger men if you were a man of high standing in ancient Greek culture as just part of the norm. That’s been well documented. There’s not really much to argue on that point. Saying Achilles had something more than a platonic relationship with Patroclus is not that outlandish.",
            "r/Achillesandhispal",
            "Are you say?",
            "What? You don’t like gex?",
            "Note to self: Don’t drink the tap water at the Ancient Greek’s house",
            "what's bro on about",
            "You're the one who didn't understand a well-known fact about your ancestors....",
            "Wich butt?",
            "I didn’t really get that from reading The Illiad. You could say he got bitchy when Agamemnon took Brises in book 1 not because he liked her but because of honour or whatever but even then I didn’t really get that feeling from him. Patroclus even said to Brises that Achilles planned to marry her which is a pretty weird thing to say if the two were boyfriends.",
            "You’re very right saying that it wasn’t outlandish, I just don’t view Achilles and Patroclus’s relationship that way. You also make a good point about honour and how he viewed Brises I’ve never really thought about the circumstance in depth before and it’s an interesting insight so thanks for that.",
            "I’m all for them being gay, just don’t see them that way in reading The Illiad",
            "Americans are like: let me teach you about your history\n\nNot even worth elaborating.",
            "[http://www.inquiriesjournal.com/articles/175/examining-greek-pederastic-relationships](http://www.inquiriesjournal.com/articles/175/examining-greek-pederastic-relationships)\n\nCome on, teach me about my ancestors. Where is your source? Netflix?",
            "How many butts do you have? 🤨",
            "Can u check here? r/Balkans_irl",
            "Ancient Greeks had a lot of gay sex. It was even encouraged within their military for bonding. Get off your soap box and rent a sense of humor.",
            "That article speaks against your own standpoint . It tells about the teacher boy relation that usually ended at 18 but has lots of examples of this not being the case that there are also same age couples and that the lot of literature about young man with older teacher/lover because that was being romanticised back then while reality was different .",
            "Haha betflix",
            "I personnally got one, butt I am not sure about the post's dude."
        ]
    },
    "Shouldn't have been too descriptive ": {
        "title": "Shouldn't have been too descriptive ",
        "score": 2882,
        "url": "https://i.redd.it/5xmm2s8zr08d1.png",
        "content": "",
        "num_comments": 14,
        "comments": [
            "This is a reminder for people not to post political posts as mentioned in stickied post. This does not necessarily apply for this post. [Click here to learn more](https://redd.it/j2173n).\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/rareinsults) if you have any questions or concerns.*",
            "Earthquakes can do a lot of damage though.",
            "What if the earthquake had a great personality though",
            "And now that earthquake wanna go back to the cave again where it echoes.",
            "Richter? The earth moved but meh?",
            "Eh. It was north of Fort Bragg and we hardly noticed.",
            "A well placed earthquake can raise some hell honestly",
            "Sometimes, mere 10 seconds can ruin your next 18-19 years.",
            "The last part is what my wife also says...",
            "Yeah but the damage you get from a 7 or 8 is accomplished in half the time. And usually a lot more violent"
        ]
    },
    "It’s always a pleasure to check insta reels": {
        "title": "It’s always a pleasure to check insta reels",
        "score": 1499,
        "url": "https://i.redd.it/hnvb3y5uf18d1.jpeg",
        "content": "",
        "num_comments": 16,
        "comments": [
            "This is a reminder for people not to post political posts as mentioned in stickied post. This does not necessarily apply for this post. [Click here to learn more](https://redd.it/j2173n).\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/rareinsults) if you have any questions or concerns.*",
            "mf looks like he died and hard to restart his lifes save file",
            " Oh, yeah, scrolling through Insta reels is like a box of chocolates - you never know what you're gonna get!",
            "he's hurting himself unconsciously. lol",
            " Oh, I totally get you! Scrolling through Insta reels is like a never-ending rabbit hole of entertainment.",
            "The pfp with Batman 😭",
            "The way I saw and liked that comment like yesterday 💀",
            "r/kidsarefuckingstupid",
            "seriously, people need to stop mutilating boys",
            "Most of the time it's extremely bitter. Insta is rarely sweet in comment section where few sane users would post something normal, let alone a positive comment",
            "Story of my life",
            "Yeah, i am way too bored on tiktok nowadays lol",
            "Lol all the jews and women downvoting",
            "They're downvoting cause the comment has nothing to do with the post 🙄",
            "Then why are they agreeing with me",
            "Guys look! I'm so edgy!"
        ]
    }
}