{
    "I found out that I’ll be inheriting my grandparents house in orange county California that they bought in the 70’s for 30K that’s now worth an estimated $1,050,000. I am concerned.": {
        "title": "I found out that I’ll be inheriting my grandparents house in orange county California that they bought in the 70’s for 30K that’s now worth an estimated $1,050,000. I am concerned.",
        "score": 159,
        "url": "https://www.reddit.com/r/RealEstate/comments/1dllob6/i_found_out_that_ill_be_inheriting_my/",
        "content": "So I found out my the executor of my grandparents will that when my grandpa and grandma pass away I will be inheriting their home. My grandpa is currently 90 and my grandma has Alzheimer’s so my grandpa wanted to have us know. I currently live in idaho since I moved to attend college there and would have to return when the time came to inherit the house to deal with the legal  issues that would come from it. Can I get some guidance on what to expect to occur when that happens thank you. ",
        "num_comments": 115,
        "comments": [
            "I’m sorry for the news. They care about you and for many people, a house is the largest and most valuable asset they have. \n\n1. They paid $30k for it, but when the house transfers to you, you gain a tremendous benefit: the “basis” of the house will reset to current market price. If you were to sell immediately, there would be no taxable gain since you’d gain $0. Since the house never re-appraised, the residential property taxes will also remain set at theoretical last appraisal done on the house. Likely the property taxes owed on the house are substantially less than what would be owed if you bought the house new. \n\n2. If you rent the house out, you can sell the house in a “1031 Exchange” and transfer the built-up equity and basis into another house (or multiple properties) of “like kind and value” to keep renting out. Simply put, the money you’d make from the sale of their house could be applied toward 1 or more rental houses elsewhere (even in Idaho or other states) so you could have a nice income stream. Note: 1031 exchanges are only for rental properties, not for a place you live in. You cannot commingle the gains in 1031 into a house you live in without paying capital gains / taxes. \n\nVERY importantly — you need to find out if the instrument that transfers the property WILL NOT be subject to probate. Probate is a court process to determine the deceased assets and liabilities and square them up before executing the last will and testament instructions. The proceeds of probate are TAXED in most places and it can eat a lot of your inheritance up. \n\nSkipping this mess can usually be accomplished by having a TOD (“Transfer On Death”) document witnessed and signed by all parties, usually recorded with the County Recorder’s Office. This lets you skip probate (and costly probate taxes). Check with the County Recorder’s Office where the house is located to inquire about a TOD. \n\nYou can do the same with bank accounts; you can make them POD (“Payable Upon Death”) and do something similar with stocks / bonds / CDs. Brokerage accounts, if they have any, usually have a beneficiary process. Each brokerage will have different forms and a slightly different method to confirm the account owner’s wishes. \n\nAll of this is a tremendous gift. I doubt your grandparents want the tax man to take half because of some simple paperwork. Talk to them about it if it turns out there’s no TOD and see if they are amenable to singing one and getting that in place else the tax burden could be quite substantial. \n\nOf course, consult with qualified professionals to make sure you’re doing all this by the book and the right way. \n \nGood luck and I’m sorry to hear your grandparents are in the years of their twilight. How wonderful that they think so highly of you.",
            "You win life. Either keep it or sell it :)",
            "You’ll be a millionaire",
            "You will inherit it tax free. As if you bought for its current market value. If you sell it right away you will pocket the 98% of cash, sake price less expenses of sale. \n\nHowever, you have a unique opportunity to live in that house and at the same tiny property tax that your grandpa paid. After a stint, you also would have the right to downsize within the state and have your property tax follow you. \n\nThe tax combination above was set up to protect the elderly from being chased out of their houses. The result however was a scheme that is a massive benefit to the upper middle and lower upper classes.\n\nYou have a unique opportunity. You can make California wages, 2-3x those of Idaho, and yet afford to live there with a fraction of the pressure as others. \n\nOr you can pocket a million tax free. \n\nYou sit at an enviable decision node, a choice between two kinds of great. Make the right decision and you can take a long step away from the trials and tribulations of survival in 2024 America.",
            "When the time comes, a big Thank you to your Grandparents.  You will need a tax attorney and the estate attorney.  Prop 19 may come into play and protect your low tax basis BUT you will need to live in the home.  There are many if's and but's that may exclude you from this.  Get a copy of the will or trust and have it in your possession if you can.  The Trustee will be the one driving the closing and disposition of the assets.",
            "You are concerned? These days most people will never have enough assets to gain freedom",
            "You can sell the house. ",
            "Unless you plan on living in California, I would recommend selling it when it becomes yours. I see someone else suggested renting it, but California is very tenant-friendly and landlord-hostile, so that's not recommended unless you're willing to learn well and learn fast. For example, it can take months, if not years, to evict someone.",
            "Concerned is a bizarro world response to getting money given to you.",
            "If you do not already own the house, this is your chance to move into a free house in sunny state. Just money you will save on Non paying real estate agents.",
            "Are you inheriting 100% of the property, or are you sharing with someone?\n\nAssuming it’s 100% yours. If you sell, you get the stepped up basis, so you’ll get the home value with no taxes except on any gains between day of death and sale date. Or, you can keep it and live in it or keep it and rent it out. If there’s no mortgage on it, you can cash out refi and get cash plus the home (but not you have a mortgage, and would have to qualify for it). \n\nLegally, you’ll need a copy of the will and a copy of the death certificate, and will need to ask the lawyer how to transfer the deed to your name. With my aunt, I was the executor, but it was all in a trust, and only the trustee changed, not the deed, so… I can’t help you legally, but it should be easy, the lawyer/executor should guide you through probate.",
            "Do your grandparents have other assets? This might be a moot issue especially because Grandma has Alzheimer's and memory care units are very very expensive..",
            "I know you were asking about the house in particular, but I wanted to mention as well about the care your grandmom and granddad may need. Please know that California has an exceptional Medicaid program. There's no asset test. All you need to do is be in need of the appropriate level of care and you qualify. Alzheimers will likely already qualify your grandmom for Medi-Cal (medicaid in CA). \n\nBeing on Medi-cal gets her fully paid for skilled nursing care. There's also the assisted living waiver program. Look into these things and more importantly, make sure your family consults with an eldercare/estate attorney. The moves you make now will protect your grandparents and their estate. \n\nDo not let your family sell the home to pay for care! It's not needed in CA.",
            "Talk to a lawyer about putting it in a trust, I don't know the exact process but I believe you can skip a lot of taxes on the gain of the house that way",
            "Sell the house. Buy another where you want to live. Invest the rest in dividend stocks. \n\nWhen you speak of your grandparents, speak well, and remember them fondly.",
            "Prop 19 allows for grandchildren to inherit the property tax basis of their grandparents but one of the conditions of doing so is that your parents must already be deceased. I would have a look at this [document](https://www.boe.ca.gov/pdf/pub800-2.pdf) and find a good estate lawyer",
            "> \"...my grandma has Alzheimer’s...\"\n\nWho is paying for her expensive care?",
            "Congratulations. There's nothing like the dream of living rent or mortgage-free, your ability to save money will be huge. However it's very expensive to live in California, for all the other goods and services you will need, not to mention the increased risk of natural disasters caused by climate change denial such as wildfires. If you sell, be sure to look into capital gains taxes, and make sure you don't lose a big chunk of money to paperwork, policies, and stupid laws.",
            "Once you inherit that house chicks will suddenly dig you.  Lol",
            "Just get a real estate attorney and a good CPA, they’ll know how to guide you through the financials and legalities. \nThat’s what I did when I inherited my house. \nI found a good agent and sold it right away. One step at a time.",
            "Lease it out and let the asset rise in value. Guessing you could easily lease it out for $5K+/month with minimal expenses since the tax value will be so low",
            "No, you don't have to return to \"deal with legal issues\" of inheriting a house.  What are you even talking about??\n\nWhy be concerned?  You'll receive the step up in basis on the home at date of death, so no capital gain tax.\n\nJust have the home cleared out and sold as is.  Congrats, you then have a million in your pocket free and clear, no tax owed.\n\nAt most, you havebto return for a weekend to clear out pictures and keepsakes that you want to keep and have room for.  That's it.  Two days tops.",
            "My mom was the executor for her parents $2M house, but she only got $30K. She spent $20K and 3 months with my sister just cleaning it out 7 days a week, 8 hours a day. They didn't remodel or anything. The reason why she only got an executor fee was because my aunt was to inherit the estate. Grandma decided the aunt deserved the inheritance since my mom was already financially secure. She is, but not rich. And the aunt just sat back and collected the rest.\n\nHopefully in your case, you also get to keep the estate.",
            "You would NOT “have to return when the time came.”\n\nFFS, when the times comes, hire a lawyer to sort it out properly.",
            "Prop 19",
            "Why are you concerned with getting 1 million dollars basically lol? This is a huge plus for your life…hire a lawyer or talk to who is already in place to execute and it’ll obviously all work itself out",
            "Just ask them to put it in a Thrust before they pass. Google advantages of putting real estate in a thrust. It will save you money and headaches",
            "NAELA.ORG\n\nFind a proper estate attorney to advise you.\n\nMost likely the best thing to do it sell it and use the money to start or pad your retirement fund.",
            "[removed]",
            "My condolences regarding your grandparents. [AspirinTheory](https://old.reddit.com/user/AspirinTheory) pretty much covered your options. I'm a Realtor in the area and if you need any real estate guidance/advice I'm here for you and can work with you when the time comes.",
            "This comment deserves 341 upvotes votes! Spot on! I’d highly suggest keeping the property and ultimately renting it out. It could provide 3-5,000 a month in passive income for you for decades while the property taxes is roughly under 3,500 a year which is unheard of in OC and no mortgage. Or move into this home and live rent free with extremely low property taxes in the most sought after area of the country/world.",
            ">Of course, consult with qualified professionals to make sure you’re doing all this by the book and the\n\nThis comment was full of good advice but this is the best. Spend a few hundred dollars to consult with an attorney so you don't make a costly misstep.",
            "Pray that this property is in a TRUST.  Why? \n\nBeing the beneficiary of a +million-dollar real estate property held in a trust can offer several tax benefits. Here are the key advantages:\n\n 1. **Avoidance of Probate**\n- **Benefit:** Assets held in a trust typically bypass probate.\n\n- **Tax Impact:** Probate avoidance can save on probate fees and potentially reduce estate taxes, as the property is not subject to probate court oversight.\n\n### 2. **Potential Estate Tax Reduction**\n- **Benefit:** Trusts can be structured to minimize estate taxes.\n- **Tax Impact:** For example, irrevocable trusts can remove the property from the grantor's estate, potentially reducing estate tax liability if the total estate exceeds the federal estate tax exemption.\n\n### 3. **Gift Tax Advantages**\n- **Benefit:** Transferring property into certain types of trusts can be considered a completed gift for tax purposes.\n- **Tax Impact:** This can help in reducing the size of the taxable estate and may allow for leveraging the lifetime gift tax exemption.\n\n### 4. **Generation-Skipping Transfer (GST) Tax Planning**\n- **Benefit:** Trusts can be designed to pass assets to grandchildren or later generations.\n- **Tax Impact:** This can help in avoiding or reducing the generation-skipping transfer tax, which is applied to transfers to beneficiaries who are more than one generation removed from the grantor.\n\n### 5. **Income Tax Benefits**\n- **Benefit:** Depending on the type of trust, the income generated from the property can be taxed at the beneficiary's tax rate, which might be lower than the grantor's.\n- **Tax Impact:** This is especially beneficial if the trust distributes income to beneficiaries who are in a lower tax bracket.\n\n### 6. **Property Tax Benefits**\n- **Benefit:** In some jurisdictions, property transferred to a trust might be eligible for property tax exemptions or reductions, especially if the trust is structured to benefit a spouse or other close relatives.\n- **Tax Impact:** This can lead to lower property taxes over time.\n\n### 7. **Step-Up in Basis**\n- **Benefit:** For revocable trusts that become irrevocable upon the grantor’s death, the property typically receives a step-up in basis.\n- **Tax Impact:** This can reduce or eliminate capital gains taxes if the property is sold shortly after the grantor’s death.\n\n### 8. **Creditor Protection**\n- **Benefit:** Trusts, particularly irrevocable trusts, can protect assets from creditors.\n- **Tax Impact:** While not a direct tax benefit, protecting the property from creditors can prevent loss, ensuring the property remains in the family and continues to offer its tax advantages.\n\n### 9. **Charitable Deductions**\n- **Benefit:** Trusts can be used to make charitable donations.\n- **Tax Impact:** Contributions to charitable trusts or from a trust to a qualified charity can provide income tax deductions for the trust or reduce the taxable estate.\n\n### 10. **Special Use Valuation for Agricultural Property**\n- **Benefit:** For agricultural or family business property held in a trust, special use valuation may be available.\n- **Tax Impact:** This can reduce estate taxes by valuing the property based its current use and not the highest or best use.\n\n### Important Considerations\n- **Trust Type:** The specific tax benefits can vary depending on whether the trust is revocable or irrevocable.\n- **State Laws:** State laws can significantly impact the tax benefits associated with trusts, especially concerning estate, gift, and property taxes.\n- **Consultation with a Professional:** Given the complexity of tax laws, consulting with a tax professional or an estate planning attorney is crucial to maximize the benefits and ensure compliance with all regulations.",
            "> The proceeds of probate are TAXED in most places and it can eat a lot of your inheritance up. \n\nBe very careful in accepting this comment. This bequest would not be subject to Federal estate tax, and a quick lookup discloses that California has no inheritance taxes. There will be costs and fees involved with the probate process, of course. The phrase \"it can eat a lot of your inheritance up\" is not very informative.",
            "I think I’m in love with you.",
            "When did the IRS start collecting estate taxes on an estate as small as 1.05 million? See https://www.irs.gov/businesses/small-businesses-self-employed/estate-tax.  It looks like the limit for 2023 is over $13 million. (NAL).",
            "can you do a TOD to, say, a spouse, but then add another person like a child in case the spouse predeceases you?",
            "Property taxes go up for the new owner. They’d get a million worth of value waived if it’s their residence.\n\n1031 is moot with a step up in capital gains. That’s for after years of using as a rental. Moot for op at this point.",
            "Thank you for the information.",
            "I will say this about the 1031 exchange, if you use it to buy multi family properties and put those under an LLC you could rent one of the units to yourself for something crazy like a dollar a year and you should be able to get away with it especially if the unit is leased to another LLC",
            "Make sure to have the house appraised by a professional appraiser to establish its value on the date of death. This will establish the step-up basis. When you sell, you will use this appraisal to determine any capital gain, and any taxes owed.",
            "This is incorrect.\n\nProperty taxes do reset. Previously you could petition for a parent-child transfer.\n\nThat’s is now limited to 1m if you are going to live in house.\n\nAnd you still have to petition, the taxes by default will reset",
            "NAL, but have person experience in CA with one part of this. Since the house would transfer under prop 19 instead of 13, there would be a reassessment. Tha is, unless it became your primary residence. This means the property tax would increase a LOT. It is likely now based on the 30k + 5% (I think) appreciation as they were locked in under prop 13.",
            "Great write up!",
            "Are you sure about this? I’m pretty sure if you sell without a step up you owe the entire cap Gains even if inherited. I just dealt with this. We had to step up our properties . I’m in CA. OP you should really consult an accountant/professional. I wouldn’t have stepped up the properties if this was true. Just did it to like 5 apartment buildings to bring up to modern tax rate and lessen cap gains hit.\n\nIt’s. Called a 706 step up",
            "Not after taxes",
            "I’m leaning towards using it as a rental property while I remain in Idaho for the foreseeable future, I’m attending law school in idaho to become a lawyer in the future and I’m not too worried about finding good paying work after graduation. Average starting lawyer salary out here is 80k and some of my upper class men started at 120k. There’s a lot of money to be made out here in my field. I’d rather lease it out as an additional income to help pay off my college debt while I work. Figure it would be a good move if I can sort it out. Rent for my 1 bedroom apartment 2 miles from downtown is 1,100 a month so on top of  a future attorney salary it would be a good way for me to make money on the side I assume.",
            "After belonging to the elderly grandparents, it might be a money pit with a roof, HVAC, water heater, plumbing and wiring needing updating, and 1970s carpeting, landscaping, kitchen and bathrooms needing a cumulative 100 thousand to make it an appealing place to live in or to attract renters.",
            "Well said, have my upvote.",
            "Under Prop 19, OP will have to move into the home to take advantage of the property tax transfer (up to $1M valuation).  Otherwise, it gets assessed at market rates, meaning a \\~$1M home in OC will probably owe something like $12K/year in property tax.  As is, his grandparents are probably paying something like $1K-$1.5K/year - an absolute gold mine.",
            "Right!  I think he misspelled the words “thankful and appreciative”.",
            "I lived in SoCal for 25 years before I left to idaho for grad school. Nothing but smog and expensive gas over there. My life goal is to be an attorney that owns land and runs a self sustaining household and own goats. I literally have a law professor who moved from Irvine California to move to Idaho get paid 120k a year to teach law at a university and now he owns horses on a farmland outside of Boise. Like WTF.. Boise turned me into wanting to be Thorfinn when I reach my 30’s.",
            "You are so right!! Instead of counting what they will inherit, the concern should be that grandparents have legally taken care of the issue of care, for both, if needed in the future. If not, there possible might not be any inherit (or a much smaller amout) to think/dream about. Alzheimers can turn into a 24/7 care situation very quickly. My mother, unfortunately, reached a point that we weren't able to care for her any longer at home.  She was in Alzheimers care unit for approx 5yrs.",
            "She’s Mexican she’ll never be admitted into a facility, my grandpa and dad would never allow it. She’ll die in the house before she’s put in a facility",
            "There wouldn't be gains, inheritance comes with a step up in basis.",
            "This. And please seek out advice from an accountant in CA and RE agent. Not Redditors all over the place.",
            "No one,  she lives in the house with my grandpa and my dad comes by every few days to check on her and help him out with whatever she needs. My family is Mexican, if we put a family member in a facility or hire expensive in home care we will be excommunicated from the bloodline. I kid you not I’ve seen it happen to my aunt when my great grandma died.",
            "Without a mortgage, living in California is relatively easy because our wages are higher. Seriously, if I didn’t have a mortgage payment I’d be vacationing internationally, retiring early, eating at high end restaurants, etc. the mortgage is the hardest part about living here.",
            "Lol Indeed.",
            "Being the personal rep, or executor, of an estate does not equate to inheriting anything.",
            "“Realtor” was all that was needed.",
            "I don’t think this is true anymore on the taxes. Due to a recent law change, unless OP moves into the house and lives there full time, the tax basis will reset to market value. Still may be well worth renting out and keeping the procees but the annual taxes will likely be around $18000 per year",
            "Thats 3.6% to 6% gross before expenses.  That's an awful idea when factoring in all the risks.  You could earn the same amount for decades by purchasing treasuries with the proceeds.  You would need at least $10k a month in rent to make this a worthwhile investment.",
            "I wish it were possible to up vote this multiple times.",
            "100%. Get this into a living trust",
            "I believe there was an option to add a secondary or “backup” person on a TOD when we did my dad’s paperwork. But each state and maybe county is different. \n\nIf you have minor children, I would look into getting a trust instead, not just transfer property into their name through a TOD if something happens to you. A trust can protect the asset better and you can also have stipulations in there about when the get the money or property. Many will not make 100% of the money available until age 21 or 25 so their kids don’t blow through everything at 18.",
            "706 is an estate tax form, which are taxes paid by the estate (not the inheritor) and only apply to estates over a large exemption threshold (currently $13.6 million). \n\nThat has no impact on stepped up basis, which applies when the *inheritor* receives the property and sells it. ",
            "What taxes? Grandparents are likely under the estate tax limit.",
            "No taxes. OP gets step up in basis to the market value at date of death.",
            "Tough state to be a landlord, let alone an absentee landlord.",
            "So remote landlording?  When a pipe bursts how will you handle it?  When the hot water tank stops heating?  What if your tenant stops paying rent?  What if your tenant trashes the interior?  Consider property management firms if that’s your intent.  Also triple check that your property taxes will stay low - indications are that it would escalate to be equivalent to others in the area including you paying the share of those elderly who are taxed at artificially low rates as is appropriate.",
            "You can thank the realtors of CA for changing this law. Sucks so hard for beneficiaries in property now. All so realtors could get more sales!",
            "WTF indeed,  that is a really shitty salary for a law professor.",
            "Lol Orange County is not that smoggy. You could own land and farm goats in SoCal, not deal with snow and average law prof salary at UC Irvine is $190k. Not saying there aren't many other great reasons to stay in Idaho including much lower cost of living, but inheriting $1m+ can lead to doing what you want in much better weather.",
            "Smog in Orange County? No. There is no smog in Orange County.",
            "Depending on how bad it is you really don't have a choice.",
            "While this is a laudable goal, the reality of the disease may not make this a feasible option.  \n\nDepending on how the disease affects grandma, and the rate / speed of progression, her 90 year old husband probably will have minimal ability to care for her in the later stages of the disease.  Your grandpa may jeopardize his own physical and mental health catering for her in the process.   \n\nThis disease is unlike anything we have dealt with as a family.  As caregivers, it is exhausting in every aspect - mentally, physically, emotionally, and spiritually.  If she becomes physically aggressive or violent, grandpa’s life may be at risk as well from fires in the kitchen to punching, hitting, pushing and potentially brandishing a weapon like a knife, scissors etc to protect themselves from “strangers” trying to hurt them.",
            "They may have to bring in caregivers then - it could be the only way to keep her safe at home.",
            "That's cruel.",
            "She might be eligible for IHSS, it’s free in home service that’ll come based on the needs determined in the interview. I’d definitely look into it. One great benefit is that your Dad himself can become the IHSS provider for her, so he’ll get paid for when he checks up on her and provides service. \n\nhttps://www.cdss.ca.gov/in-home-supportive-services",
            "That was my point. I just hope that is not the case for OP.",
            "Yes Prop 19 changed this in California.",
            "It may be similar to a 1031 where you can live in it for a year or two then rent it out",
            "that factoring in all the risks can be huge - as an absentee landlord you’d have to arrange for property management, professional services for things like plumbing/etc., a tenant could destroy the house, a tenant could stop paying rent and it would take you months to years to evict.  Being a landlord is not for the newby and physically remote.  Far better to divest and then take the case in to much saner investments or closer if you believe firmly in real estate.",
            "thanks!",
            "Got it. So doesn’t apply for this guy",
            "Use a management company. A quality one. It won’t be the cheapest process but it’s still passive income. I’m building an apartment. Ours does the advertising, showing, vetting and if needed evicting. We also have a contractor to fix the things. If he inherited the house the first month’s rent goes to the realtor plus a monthly fee then he can save a few months for the contractor as long as it’s in good shape now.",
            "Well then, thank you realtors for stopping those who inherit from living off the taxes of those who live around them.  I didn’t see that coming - that I’d thank a realtor today!",
            "I truly don’t understand this perspective. So taxes being lower for elderly makes sense to me, but for an inherited million dollar property? Why should they pay less property taxes than a working neighbor who saved and purchased?",
            "Or sell the house and take the million dollar (tax free) proceeds and buy the dream house in Idaho and get some goats - then live on the rest as a million dollars would buy a HUGE place in Idaho.",
            "There is zero smog in Orange County.",
            "Yeah, sorry I didn’t mean to be replying to you :) You’re spot on",
            "Thank goodness. Nobody should get a break on property taxes just because they've lived somewhere a long time. And definitely not when they pass the house on after death.",
            "A 1031 is purely for investment properties and can not be used for personal residences. However if he did use it as a rental the step up in the cost basis in the inheritance will also negate any benefit from a 1031 exchange unless they hold it for enough years and depreciate value and experience appreciation resulting in capital gains.",
            "These days a squatter could move into a vacant house and the cops would say it’s civil matter, so months of court to get them evicted, after which a squatter moves in.",
            "Do you know how to actually find a quality one?\n\nThe only time i have used one, i went off recommendations and they were still the hottest of garbage. \n\nI’m sure there are some good ones but i bet the vast majority are shit.",
            "Oh? And why is that?.\nThese laws are protecting those who own property from being taxed out of their homes.\nSimply inheriting real property should never be a back breaking financial burden..",
            "It’s commercial property that should be targeted.  Prop 19 didn’t touch that.",
            "Are you advocating for people to pay more property taxes because their homes have skyrocketed in value through no fault of their own?",
            "[deleted]",
            "Your not entirely correct. The IRS code does not say how long you must rent a 1031 for investment purposes. It’s up for interpretation. Clearly doing a 1031 and moving in is not smart but I’ve done 2 1031’s and rented them out for 2 years each prior to moving in.",
            "Intent to rent is irs code but how long you rent for is up to you",
            "You act like having your home skyrocket in value makes you a victim.",
            "Truthfully they should cash in their lotery ticket and leave. The world around them has changed and they likely live somewhere with higher productivity than they can meaningfully contribute to. Others will move in who can pay the property taxes, spend more on local sales taxes, make the county more revenue through their income taxes.\n\nOwnership is a facade in this country anyways. You buy a house for the privilege or renting it from the government. I don't make the rules, our ancestors did and they're shit.",
            "If you and I live in similar houses near each other, with the same market value, why should one of us pay ten times as much property tax?",
            "As if the inheriting a house isn’t head start enough. Elderly people who are actively using the house, sure. But after their death and it’s transferred to new owners?  No way should the tax break continue.",
            "It leads to scenarios where there is no money for maintaining infrastructure within communities. This was a serious problem in California. \n\nWhat good is your $1 million house if there is no water or sewage service?",
            "Why would I want a small, select group of young people to get a head start?",
            "Of course but the comment was discussing keeping the tax basis low for property taxes in California which would require it to become a primary residence among other stipulations. And unless they gain 250k/500k in capital gains in those two years plus short rental period they would have no reason to have this discussion.",
            "Additionally, according to my tax strategist IRS audits are also increasing quickly with the new hires so I am personally making sure to leave less to interpretation.",
            "That’s a result of poor civil planing in California. Not sure why the burden is on the individual with outrageous property taxes.",
            "While every other young person that doesn't inherit a family house pays more to fund in property taxes bc of it.",
            "Agreed, but it's kinda the traditional American way also.",
            "Correct but my comment was geared towards it being a primary residence and keeping the lower tax basis and a few years down the road rent it out.",
            "The property taxes are outrageous for new buyers bc some folks are paying property taxes on a 30k basis."
        ]
    },
    "My realtor lied about providing a counter to the other party": {
        "title": "My realtor lied about providing a counter to the other party",
        "score": 86,
        "url": "https://www.reddit.com/r/RealEstate/comments/1dlm4gh/my_realtor_lied_about_providing_a_counter_to_the/",
        "content": "Background: Provided my realtor (who is a personal friend) the amount I wanted to clear on the sale of my home.  After countless showings and 40+ days on the market we finally got an offer; recent reduction helped. \n\nIt was a low-ball offer but not so far away that we couldn’t counter.  I countered…. They countered.  Ultimately, I was around $5k away from my minimum amount I wanted to clear. \n\nI told my realtor, the sales price is acceptable if the buyers agent can take 2% (in other words, I would pay 5% commission).  My realtor responded with a thumbs up emoji at 7:15 PM and I didn’t hear from him again until the next day at 9:15 AM. He texts me, “I can’t believe this agent can’t get her clients up 6k. BS imo”\n\nI’m a little confused as I told him the sales price is agreed upon and it’s up to the realtors to take a reduction of 1% in commissions.  \n\nI start heeding questions from my realtor about another buyer who visited the property the previous day…. Almost as if he’s avoiding the subject. Finally at 6:00 PM today, I ask about the buyer with an offer…. His reply “it died, they wouldn’t budge.” \n\nMe: “sales price was finalized, did the commission reduction kill it?”\n\nRealtor: “yep. No worries, we are moving on.”\n\nMy wife and I are at dinner thinking WTF is going on and perplexed how our realtor and personal friend could be so nonchalant about the only offer we have seen in 1.5 months.\n\nAfter dinner, realtor and I exchange more text and it leads to me demanding a phone call immediately. I end up scolding him and corner him into him telling me that he never relayed the acceptance of the sales price offer with a 1% commission reduction to the other agent.  I called him a greedy fucker that lied to me because he couldn’t fathom a $2500 reduction on commission also knowing I’m about to use him to purchase a $850k+ house.\n\nI made him revive the deal and am now waiting to see if this will finalize. Wtf would you do in this situation. His wife is also a coworker of mine. ",
        "num_comments": 211,
        "comments": [
            "I’d play nice to see this through, get a new agent (if you’re dead set on that) for your purchase, and be done with him and his wife.",
            "This is another really good reason not to negotiate verbally. Always put it on paper with your signature on it so there's no miscommunication, whether it's legitimate misunderstanding or purposeful dishonesty like you're dealing with.",
            "I'm going to skip the emotion here and get to the legal answer, which is wrapped up in this\" \"it’s up to the realtors to take a reduction of 1% in commissions.\"  \n  \nIs this written into the listing agreement with the brokerage representing you and approved by the broker? Agents can't change the terms of the listing agreement without their broker's agreement. \n\nIf the buyer has an agreement with their buyer that the commission to be paid is higher than 2%, then the buyer couldn't make your counter work. \n\nI'd fire you in a heartbeat for this language \"I called him a greedy fucker.\"",
            "This makes no sense..why would you say your agent was greedy when you only asked the buyer's agent to take a  1% cut..maybe the reason your house has not sold is more a reflection on you..as it would have been better to ask both agents to each reduce by 1/2%",
            "Every comment is explaining in depth the myriad of ways OP is misguided but they keep doubling down. Sheesh.",
            "The problem is that your house is priced too high. It’s not worth as much as you think and your friend is stuck in the middle.",
            "Call his broker.",
            "Under the new rules where the buyer pays the buyer's agent, you would be completely out of line. You don't have any say at all in what the buyer pays his agent. You have a written contract with your agent to pay him 3% for selling the house, and when at the last minute you told him to take a haircut he gave you a thumbs up which translates as GFY.",
            "Lol all these salty realtors in here. The realtor is obligated to relay the counter by law as a fiduciary. Frankly, not even relaying the counter can result in suspension or termination of their real estate license in most states. \n\nI tend to agree that you are risking a deal on principle at this point and if there is too much pushback on your request to lower commission, it is prob still worth eating the $2,500 if you don’t have other offers in hand. I would be cautious though about the buyers trying to re-trade after an inspection and further reduce purchase price. \n\nHowever, there are several ways to fix this, including using (or threatening to use) a different realtor for the purchase of your next house. Either way this “friend” prioritized 0.5% of their own commission (assuming they would split the cut with buyers agent) over your guys relationship, which tells you everything you need to know about your friend going forward. \n\nSeparate the transaction and the relationship fuck up. Don’t lose your opportunity to upgrade to where/what you want over this person and principle.",
            "Good for you standing up to them! Realtors suck. I'd say find a new one, but I ditched mine and just found one equally ick.",
            "Buyer's agent could have refused to accept the commission reduction (as is their right - you didn't really present a counter to the buyer), which would indeed kill the deal as you did not negotiate a commission reduction with your selling agent.",
            "Vultures",
            "Fire the agent and do it yourself.  As you can see they are  just rat faced middle men that don’t actually bring anything of value to the deal.",
            "OP who do you think you are that fucking with someone's livelyhood/paycheck is your negotiating tactic? Where do you get this sense of entitlement?",
            "Your 100% the AH in this, you agreed to use a service at a set price and then are changing the terms when the deal is almost done. If your boss came up to you at the End of the work day and was like hey listen we need to cut your paycheck by 30% to make this deal go though because our shareholders aren't happy with the profit margin on this deal, how would you feel about that? I'd tell my manger ha ha funny, get fucked. \n\nYour house is priced too high not your realtors fault, and the other realtors fault.",
            "Yea thats not a friend. Id file a complaint to the licensing authority in your area as well as his broker. Ridiculous bullshit",
            "FWIW, historically home take 60-90 DOM before selling, plus time to close.  You sounded panicky after 40 days and that's not good.",
            "Fire the agent if this deal does not close or after it closes and never hire friends for anything",
            "Consider small claims court against them.",
            "Not sure why you think your Realtor should cut his fee so you can make more and the buyer can pay less. Do you say to your accountant... Hey...I'm paying more in taxes than I wanted too...so you need to charge me less? How about your dentist? Found out you have a cavity that needs to be filled so the dentist should throw in the routine cleaning for free? They don't do it to any other service provider...why is it that people think Realtors should participate in paying the costs of the services they provide? btw...Realtors don't get paid until they're efforts are successful at the closing table. Lawyers, doctors, dentists, accountants, nearly all other service providers are paid regardless of the outcome of their work. Once a fee agreement is made the Realtor's fees SHOULD NEVER BE made a part of the negotiations between a seller and a buyer. Pay your Realtor what you told him you would pay him!",
            "You fucked up. The commission is fixed at 6%. You signed a contract for that. ",
            "My thoughts as well.  I will play nice until this is completed and will have to cut them out unfortunately. My wife and I had dinner with them last week at their home. A complete WTF",
            "Don't forget, after the deal finalizes, complain to both their broker and the RealEstate Board.",
            "I have the text message conversation. You mean from buyer to seller parties?",
            ">Is this written into the listing agreement with the brokerage representing you and approved by the broker? Agents can't change the terms of the listing agreement without their broker's agreement.\n\nOP is changing the rules in the middle of the game, from the realtor's perspective. He is lowering the amount the buyer's agent would receive *after* the buyers  have been brought to the table.",
            "Exactly - the agent is representing the broker. The listing agreement is with the broker and that broker has a cooperating agreement with other brokers that are in the MLS. It states that the buyers agent would be paid a certain percentage. The buyers agent brought their client to the home knowing what percentage they would be paid off the sale price. That number can’t just change because OP demands it change.",
            "OP is the greedy fucker.",
            "Isn't this just the owner saying, no to that offer unless you guys can figure out how to make it work so I net X?\n\n\nSounds like he worded it terribly etc or just expected / demanded a reduction ",
            "Lmao wrong. How could the buyer have a contract with me to pay them?",
            "The house hasn’t sold because it’s overpriced. I mean 1.5 months and only one “low ball” offer? In peak selling season?  And now OP is willing to kill the deal over 2500 dollars? Yet Op is also buying an 850k house next? Coming from something mid 500’s? Yet can’t pinch together 2500\nTo get his house in contract by end of June? Makes no sense - unless OP doesn’t really want to sell his house.\n\nSoon July will be here - and things start to slow down. People are on summer vacation. Most buyers try to get into contract before 4th of July weekend for SFH - especially those with kids that are moving school districts so they can get their kids registered in the new district by September \n\nBut then again it doesn’t sound like Op really wants to sell and is just wasting everyone’s time",
            "Because when the listing went on MLS it reflected that the buyers agent would be paid 2%. The buyers agent brought a buyer and they and their broker are now being told they “changed their mind” so OP has advertised 2 percent, deal is on the table and OP is like “just kidding.”",
            "You are telling me I had to tell the guy how to allocate 1% in commission? He decided to not even relay this offer to the other agent.  In the end, he lied to me and left the other party and my wife and I out to dry.",
            "Im convinced that Op\nIs just trolling - no way any serious seller who wants to sell his home would be acting like this",
            "Every comment? Gaslight much??",
            "Maybe maybe not",
            "Good idea. He did mention he is leaving his brokerage in a quarter so maybe I’ll wait until he branches out",
            "I provided him the money I wanted to clear.  Knowing this, he seemed intent on not wanting to get there by lying to me and saying he presented my counter to the other party",
            "The buyers have always paid the buyers agent. The seller and listing agent agree to pay a certain amount to the buyers to pay their agent. If that isn't covered then the buyer pays the difference or the agent lowers what they agreed upon. The agent doesn't have to agree to it and the buyer doesn't have to agree to it and move on.",
            "I am probably moving forward with the deal as is without the commission reduction. He will not be seeing another cent from me",
            "Btw thanks for your response",
            "This is incorrect it is a violation of the listing contract as well as a violation of the realtor code of ethics. You advertised your house with a commission you and your realtor agreed upon, asking the other realtor to lower their commission will land you in front of the board. Your realtor could have lowered their commission however.",
            "Thanks!",
            "My agent never presented them that offer",
            "Yup. Personal relationship got in the way (stupid me trying to help friends make money)",
            "Sales negotiation is dynamic.  There isn’t a guarantee of a commission and I provided insight to my walk away point to my realtor.  I gave him insight into what would trigger a yes.  I asked him to ask the other person to see if a reduction was possible. That wasn’t done. He lied. In fact, the deal is still alive and I’ll probably\nTake the offer. He openly stated the deal is dead but he declared that. Not me or the other party",
            "Really depends on the market and the property.  Many of the houses in our local market are selling in under 14 days.",
            "I guess I expected more from someone who gets paid when a transaction clears",
            "Agreed",
            "Realtors make money on a sliding scale. The dentist has set costs, the accountant has set costs. \n\nThe fact that realtors are paid only when transactions are finalized is motivation for them to be willing to take commission reductions if it’s close.\n\nA reminder, I provided my agent my walk away point.  He doesn’t want to budge on his end, I don’t want to on mine",
            "I signed a contract for 3% to seller agent",
            "Funny story. When I sold my first house the people wanting to buy it were ex military. (I think he may have become disabled due to his service.) The buyers didn’t have enough to purchase the house for what we needed to clear. So the agents worked together and both took a pay cut to get the deal done. The buyers were happy. We (the sellers) were happy. The realtors made their commission. It’s not a fixed 6%.",
            "Don't hire a friend as realtor?",
            "Where is this that realtors are still getting 6%???? I pay realtors 3% total and they are fine with it",
            "Yeah, unfortunately, he showed his true colors.",
            "Text messages don't matter. The offer comes on paper. The counter offer goes back on paper (or a signed PDF, we don't actually use physical paper very often). Documents are passed back and forth until we have a ratified contract. Your agent knows this. Some agents will argue that doing it verbally saves time but do you want to cut corner, or do you want to do it right and protect yourself? This is a serious legally binding contract you're working on with a lot of money at stake.\n\nIt's only been a few days since the last post where someone had an issue operating this way, and less than a week before that for another. This is an unethical way for an agent to lead you through negotiation and it's been proven to be bad practice over and over again.",
            "Sales prices ebb and flow.  Why is a 6% transaction fee non-negotiable?",
            "It can absolutely change, but the affected parties have to approve it.",
            "It can change if both parties agree",
            "I didn't say that you did. The buyer has a buyer-broker agreement in which the buyer has agreed to a certain compensation regardless of whether the seller pays it. A buyer might pass on a house if the compensation falls below what they agreed that the buyer broker will be paid. That's the buyer's choice, not yours. It's just like a listing agreement, the agent can't change it on the fly.  \n  \nYou seem pretty concerned about the $2,500. Are you right on the edge of not being to buy the $850k house your want?",
            "Wanted to clear a certain amount.  Offer within $5k range; knowing i have a large purchase once sold, my agent decided to lie to me. His fault",
            "\"1% commission reduction to the other agent\"..your wording is terrible if that means both agents share the reduction..obviously, you are part of the problem and your agent readily misses what you say/ask..",
            "OP I’m not a realtor so I don’t have a dog in the fight.  It sounds like you’re the bad friend if your solution to a 5000 price difference is to ask your friend to reduce commission that you had originally agreed to pay.  The fact that you don’t see that and are labeling your friend as the one at fault is scary.  It’s 5000.  Your friend/realtor is entitled to the agreed upon compensation for his/her work.  If you want to lose the sale over 5000, ok, but that’s on you and not your friend.",
            "Correction: the majority of comments* \n\nBetter?",
            "The market just rejected you. Better luck next time.\n\nBuyers already had an agreement with their agent. A reduction in commission means it is coming from the buyers pocket and directly affects their bottom line. Your agent had nothing to do with that decision.",
            "I get it - lots of agents here hating and folks can agree or disagree about whether what you were asking was reasonable but your agent should have pushed back if they didn't agree rather than intentionally misleading you about your counter.  Of course, agents are misleading all the time, their commission is the only thing that matters, and by and large are less trustworthy than used car salesmen, so the fact that they'd all be A-ok that your agent was not honest with you is not surprising.  Remember where you're posting.",
            "If both parties agree, no harm no foul",
            "Whatever you agreed to in the contract (a 3 point fee to a buyer's broker) is what he put on the MLS. Whatever is on the MLS is what must be honored. It's not even appropriate (or ethically allowed) for him to ask an agent to take a cut smaller than agreed to on the MLS. You're essentially asking your agent in a roundabout way to take a pay cut to get you your net figure.\n\nYou calling your agent greedy because he wants the fee you already agreed to in writing is the pot calling the kettle black. Again, you're essentially asking him to take a pay cut so you don't have to. Idk if he didn't explain this to you clearly and if he didn't, shame on him, but you killed the deal with that buyer, not your agent. \n\nLastly, calling people idiots on reddit for trying to explain this to you makes me think this probably was explained to you by your agent.",
            "Edit: re-reading, sellers agent presented a counter that changed terms from seller pays 6% commission to seller pays 5% commission.\n\n\nSince those terms don't change what the seller and buyer owe their real estate agents, it's effectively telling the buyer to cough up 1%.\n\n\nBuyer rejected that.\n\n\nEdit (this isn't totally accurate upon re-reading, but it's not wrong) He wouldn't. He'd present it to the agent, who would more likely refuse it and not even entertain it. There was no offer to the buyer, because you didn't make an offer to the buyer. \n\n\nThat's assuming presenting the offer was even legal, as others have pointed out it might not have been. Best way to present your offer is to then ask the buyer to cover 1% commission (which reduces their overall commission fyi), but buyer's agent refused that too - because that's effectively what you asked the buyer to do.",
            "Did you sign a listing contract that specified the commission levels?   I bet you did.   If you didn’t specify the state.  \n\nThat is non negotiable once signed.  The buying agent brought his client expecting that commission.  You’re trying to change the contract afterwards.  \n\nMost definitely the AH here",
            "Did you? when your selling agent took the listing you agreed on commission - normally it’s 5 or 6 percent - then YOUR agent splits that commission with the buyers agent (if it’s 6 percent then the buyers agent gets 3, if it’s 5 percent the buyers agent gets 2.5%)\n\nWhat your agent should have done if he wanted to make it work was either split the 1% with the buyers agent (aka they each take a .5 percent cut in commission to equal the 1 percent) or your agent takes the 1 percent cut from his/her take.\n\nIn the MLS it states what the commission is for the buyers agent - if it states 3 percent that’s what the buyers agent gets.  Unless BOTH agents work it out.\n\nSounds like to me - your agent knew this was going to be an issue as it goes against what is in the MLS and didn’t even bring it up to the buyers agent. \n\nBut what he could have done was suggest they each take .5 reduction and meet in the middle to get the deal done.\n\nIf your agent is also going to assist with you buying a place - and getting commission on that - he should have just taken the 1 percent hit knowing he was also going to make additional commission when you purchase a future home",
            "You broke your deal with your realtor/friend by making the deal conditional on a third party taking a reduction on their fee, after that third party realtor did his job by bringing a qualified, acceptable offer to the table.\n\nAnd then you had the stones to call your realtor/friend greedy?\n\nYou agreed to the commission at the outset.  That was the time to negotiate a lower commission, not once there was a deal on the table.  The honest thing to do would have been to either walk away from the deal or accept it.  You did neither and tried instead to leverage the realtors themselves.\n\nNow you're here looking for validation for your shady decisions.\n\nI'd fire you, both as a client and as a friend.  A man's only as good as his word.",
            "Yup",
            "Atlanta",
            "Nah, OP doesn't understand he effectively/actually asked buyer to cover 1% of their agent's commission.",
            "Good point. The fact that there wasn’t documentation back from him to their party is alarming. Thanks",
            "**It is written into the listing agreement.** You advertised to realtors that if they would find a buyer, they would earn X% commission. They found qualified buyers. They likely showed them the property. They submitted an offer and have been involved in counteroffers going back and forth.\n\n Now, you are essentially saying \"I know I offered X% if you would do that, but I've decided I will only allow you to earn Y%\",  after they have put in the work. Realtors assume the risk of a deal falling through, but they don't assume the risk of you going back on the offer you made them.\n\n  \nIf someone made an offer to you \"I will pay you $X to do this task\", you performed the task and then said \"I have changed my mind, I am going to pay you $Y.\", how would you feel?\n\n  \nI agree that, in general, real estate commissions are too high. But that isn't the issue here. The main issue is you can't change the deal *at this time*. \n\nThe thing your agent did wrong is not telling you this.",
            "We signed this in advance in an agreement with our agent as a buyer. As your buyer, I would be pissed and never absorb the cost of paying *your* commission.",
            "It is negotiable but it gets negotiated between you and the listing agent when you sign the listing agreement.",
            "And both parties have not agreed - it is made clear in your original post - the buyer is not coming up with that 1 percent. That increases their cash to close. And their agent isn’t taking the 1 percent cut to make the deal work. Your agent also isnt budging on his commission either - because he is the one who has most incentive to do so if you also plan to buy (besides YOU obviously) using him.",
            "Nice bait.",
            "You’ll lose more than that 5k when your house sits on the market for another few months. At 40 plus days on the market you’re already approaching “dead listing” status in the MLS/Zillow etc",
            "Willing to continue paying mortgage etc for another month will cost you the 2500 and you'll be kicking yourself when you sell for 10k less.\n\n\nSold a house last year \"as-is\". Buyer was a fthb, had the inspection and freaked out about a potentially leaky pipe. We had a plumber quote it ($380) so we offered the buyer $500 and the quote even though it was as is. \n\n\nI wasn't giving up 100k in profit on $500.",
            "No idiot, that means 1% reduction to the buyers agent. Logically, if the buyer agent balks, the agents split the reduction to move the sale forward.",
            "Also based on past posting it looks like OP. Is also in sales and also has tried to find ways to make more in commission. 😂",
            "Conversely, he wants to lie and kill a deal on purpose to make his 3%.  If he said, “I can’t ask that to the other realtor” or if he did actually ask the other party and they said no, that’s a COMPLETELY different story. Realtors only get paid on a sale…. If they want to fight tooth and nail for an abitrary figure instead of closing a deal and moving on, that’s on them",
            "Nah",
            "How so? The deal is still alive",
            "Like I said, the deal is sitting there for me",
            "This has nothing to do with the listing agent. If the buyers agreement specifies a percentage then the buyer has to pay the shortfall out of pocket. Most people have just enough for all the closing costs. Asking a buyer to pay another $6k to close is not going to get the house sold.",
            "This",
            "You make a compelling point",
            "I’m calling my agent greedy because he didn’t present the offer to the other party, lied to me about doing so, and has been waiting on a third party to give me an offer (with a full commission rate of course).",
            "Having read OP’s rather thick-headed responses, one wonders if the agent would have been able to make the guy understand if he did explain. OP sells cars or vinyl siding or something where his boss goes, “If you make that deal with that customer, it’s coming out of your %.”  So he wants to stick it to his real estate salesbro in the same way. But the rules are different and his bro wouldn’t or likely couldn’t explain that to OP. Just my interpretation. Op could fire the guy and see what the next agent thinks.",
            "That was never presented to the other party. He lied",
            "Serious question: if both parties agree to reduce, is it legal?",
            "He still should have given the buyer and agent a chance to reject.",
            "The MLS is a suggestion. (Just like a sales price) I signed a contract with the sellers agent, not the buyers agent",
            "Why? The market is crazy hot here. We are in Alpharetta and a neighbor just self listed and sold his home in days. He said he didn’t budge on price and the only thing that affected the final payout was the agent’s commission. ",
            "I'm in a townhouse in close-in  Metro (Norcross/peachtree Corners/duluth) and the sell in 2 weeks, close to if not asking.  Fire him and start over.",
            "This is prob it. Since buyer agent prob won’t take 2% so either the seller agent has to give up his or buyer has to come up with $6k.",
            "No he didn't. If the buyers agent wants the transaction they can take 1% less. It doesn't matter what agreement the buyers have signed with their agent. It's really simple. They tell their agent that they accept 2% of the transaction doesn't happen, they get 0%, and they move forward with a new agent.",
            "Your signature and initials should be on every offer/counteroffer. You initial every change. The terms are approved by you and there's documentation of that when the buyer agent presents it to their client. \n\nAgents arent participants in the transaction, they're facilitators. Their words can't bind you to anything. They negotiate verbally like this on tv, but that's not real, except that some agents have picked up on it and operate this way against their client's interests.",
            "All sales negotiation have variables that can be altered. Why are buyers and sellers the only party that have to either reduce their sales price or increase their offer while realtors sit back and “let the market work.”  \n\nWhen you are close to a deal, a little give by all parties makes everyone happy",
            "Things change. Anything can be agreed to",
            "The buyer agent and the buyers are unaware of the commission reduction ask.",
            "Agreed my agent doesn’t want to budge either",
            "He’s not wrong. If your so worried about 2500 to the point of killing the only offer you’ve gotten in a Month and a half - it sounds like an 850k home is a pipe dream …. Or your just some kid trolling Reddit with this “home seller from hell” fiction.",
            "K",
            "I’m living in my home.",
            "No, that isn't what \"logically\" happens. See my comment.",
            "Well thats even worse..you actually first wanted the buyer's agent to fully absorb all ?  How crazy is that..the buyer's agent probably told your agent to go F-off..again, I can see why your house remains unsold and all you have to do is look in the mirror as to who is responsible..",
            "No, the agents don’t split the reduction. They are paid by their clients according to the individual agreements each agent has with each client. What the buyer’s agent is paid has no bearing on the contract you signed with your agent.",
            ">No idiot, that means 1% reduction to the buyers agent.\n\nlol, that would mean the commission drops from, say, $10,000, to $9,900. Grats, you saved 1%!\n\n  \nYour own words, interestingly enough, while calling someone else an idiot. \n\n  \nIn any case, the market says you are overpriced. It doesn't matter what you or your relator thinks, the market speaks louder and with more authority. Drop your price to move the product.",
            "I run a 9 figure book. If I made 3%, I’d be making multi-millions each year (I don’t).",
            "Best of luck selling your house. I hope for the realtor’s sake the deal goes through quickly so he can be done with you.",
            "None of that excuses the agent pretending OP's counter offer got made rather than addressing any real or perceived issue - stop trying to pretend it's ok for an agent to be misleading.",
            "If he never present the counter then how would he know the buyer won’t come up $6k? Looks like he did present it, since buyer agent ain’t gonna take 2%. So the agent asked the buyer to kick up another $6k",
            "First of all: Simply put, he *did* present it. They are obligated to pay their agent 3% per their agreement, so when you say you'll only pay him 2%, guess who ends up paying that 1%? The buyer.\n\n\nGuess who didn't want to pay that 1%? That's right, the buyer.\n\n\nSo he presented your offer.\n\n\nHence: “I can’t believe this agent can’t get her clients up 6k. BS imo\" - because buyers agent refused to reduce commission, sellers agent isn't about to reduce his commission, and that means the only party who can make up the 1% difference is the buyer, because you won't pay it and the agents aren't willing to take a pay cut from the contract each party agreed to, and you don't want to pay it either.\n\n\nSo there's no deal with your counter.\n\n\nSecondly: Let's say your counter had been 0% commission to buyers and sellers agent.\n\n\nDo you honestly think your agent is at all obligated to take that offer and receive no compensation? Obviously they are contractually entitled to compensation, so someone's gotta pay it - either they *voluntarily* take a pay cut, buyer pays it, or seller pays it.\n\n\nWhy do you think reducing commission by 1% is acceptable without the impacted party's input? Sounds a bit greedy doesn't it?",
            "It would never be presented. It’s unethical to do so.",
            "Op stated the agent stated “I can’t believe their agent can’t get them to go up 6k” that means it was rejected - clearly it was brought up to the buyers agent. The buyer isn’t fronting the 1 percent commission that was to be paid by the seller",
            "The MLS is not a suggestion - I was an agent. (I’m not anymore) The MLS states what commission will be paid to the buyers agent. \nYou signed a contract to pay your agent 5 percent (or whatever) and your agent put in the MLS at the time of the listing 2.5 percent paid to buyers agent - half of the 5 percent you have in your contract. This is standard \n\nNow - if you want to deduct another percent off that buyers agents commission - no way is that deal getting done. The buyers agent would only get 1.5 percent? Lol! \nYOUR agent should split that cut if he wants the deal done. Or You should forgo that demand if you want the house sold and closed soon. Because it sounds like it’s overpriced to begin with. \n\nif your house has been on the market for 40 days and you’ve only received one “low ball” offer - then you are overpriced.",
            "I don’t know; I’m in a townhome",
            "👍🏻",
            "Thank you very much",
            "Can be altered before signing the agreement. You agreed to a certain percentage and now want to reduce it by 33%. I’d fire you for calling dinner and calling me a greedy fucker, when I’m the one following the contract.",
            "**Replying to the comment you deleted:** \n\n>Lmao what work? This agent found these buyers two weeks. A glorified middleman should thanking their lucky stars about getting even a 1% commission. 2.5% is STILL INSANE\n\nOh my! Well, I'm sure your work is *much* more important than the work mere peasants do!\n\n*You* offered X% for them to do a thing. They did the thing. Now you are saying that it isn't worth what *you* offered.\n\nSeriously, doing *what you said you'd do* is one of those what-I-learned-in-kindergarten things.",
            "You already agreed to it when you signed the listing contract. That contract spelled out how much the listing agent and the buyers agent would get.  You are now reneging.",
            "The difference was $6k, not $2500.  My wife and I make plenty but we also do not tolerate being lied to",
            "That doesn't change your costs. You're being a penny wise and a pound foolish. Unless delaying this sale causes you to not move into a more expensive house sooner, it's still a cost. \n\n\nYou're going to kick yourself when the next offer is even lower. ",
            "Dumb as fuck.",
            "Lmao I have to explain it’s 1% off the sales price to you? Being obtuse on purpose is a bad loo",
            "Man, I'm not mad at you for it, it's just funny you cut into the agents commission and call them greedy when you would take 3 if you could. That agent isn't making multimillions at 3% though. More than likely, they make less than you per year.",
            "Somebody gets it!",
            "Negative; he never asked to reduce the commission. He knew my target money figure to clear.",
            "My agent admitted that he did not ask the agent to take a reduction.",
            "That’s not what I asked",
            "Agents eat commission all the time to get a deal. At the same time the agent has the right to say no. The AH is the agent for not being honest.",
            "A recent reduction has raised interest.  Reading the contract again, the sales price in the MLS is at $535,000 and I have signed for 6% of sales price.  The issue I have is that that percentage was valid at $535k.  When variables change, so can others",
            "You're welcome. I hope you can get it untangled and make it work.",
            "I provided you my walk away point and you would be too stubborn to take a $2500 reduction (15k to 12.5k) knowing I am buying a house for $850k in the next 60 days post-sale? \n\nYes, you would be greedy af to pass that up",
            "All negotiable especially when close to the finish line. If agents are that stubborn, that’s on them if they don’t want to make money",
            "And let me say, a glorified middleman, IN THIS CASE. I answer all the questions and all leads are from Zillow. The buyers agents found these people two weeks ago. There is no value add in my case of selling my home.  The only thing that was needed was to close and my agent screwed that up",
            "The sales price is lower than what I shared I wanted to clear with my realtor.  He can’t sell the house at the price I want it to be at. Guess he gets zero",
            "Correct. Next house is 50% higher",
            "Yeah..you certainly were",
            "No, I don’t expect to be paid multi millions for my services lol",
            "He didn’t ask the seller agent to reduce their commission cuz he knows it won’t fly. Lmao get it through your head. Your counter is equivalent to buyer needs to kick up $6k or your agent has to put up his commission to the buyer agent.\n\nIf he present it the way you described, he would look like an idiot. The buyer agent would be like why don’t you take the cut lmao\n\nBetter yet why don’t you cut all the buyer commission to 0%. Maybe in your head it works out that way but it’s dumb af",
            "He can't ask him to - you don't have a contract with the buyer's agent.",
            "Doesn’t matter what you asked.  No realtor would never relay that ask.  \n\nIt’s equivalent to.  “Hey, if you find someone to buy my house I’ll give you $10k”.   And then you following up with “nah changed my mind I’m only going to give you $5k and you must take it”.  It’s unethical and the agent would put their license in danger.",
            "Both are AH, but it is unethical to not present even if we know it won't be taken.",
            "The price is the variable - not the stated percentage of the commission. The commissions percentage is the same, the actual amount of the commission depends on the selling price \n\nThe agent expects\nTo get the percentage of the final sales\nPrice - which is clearly stated in the MLS \n\nI have a feeling your agent will break up with you - way before you break up with him",
            "No. You're responsible to pay that 6%. Even if you drop the price by $50k. You got ONE offer, for less then you wanted. It doesn't matter what YOU need to walk out. The market doesn't care about that. The buyers don't care. You're trying to screw over the one and only buyers agent that has brought you an offer.",
            "Why don’t you read the contract again. Does it say 6% for a full price offer and less if it’s lower? No it doesn’t. When your agent puts the commission on MLS it’s binding. Agents have to be careful with what they put in MLS for that reason.",
            "Appreciate it",
            "Sorry, I'm still in the process of caffeinating. I should've said earlier, this is something that should be reported to the broker-in-charge. Agents will continue to behave badly until they are exposed and the BICs job is to supervise the licensed. They won't know this kind of thing is happening unless they are told by the offended party. I think I'm done now. ☕",
            "Ironic because op is even greedier and a liar as far as going back on their word (the literal contract with their agent).",
            "But you don’t ask *your* agent to take the hit. You asked the buyer’s agent to. Did you offer to sign a buyer’s contract with your friend, guaranteeing him 3% on the bigger buy? He might have been willing to reduce his own commission if that were the case. Otherwise, what’s to stop the next seller from trying to do to him the same thing you’re trying to do to your buyer’s agent and renegotiate after terms have already been set and agreed to?",
            "**For sale by owner** was an option that was available to you before *you chose* to  list it with a realtor.",
            "And it sounds like you can’t really afford that hike",
            "Too dumb to respond any longer",
            "Exactly my point. It wasn’t presented and he lied about it. He knows I’m buying a property for over $850k after this sale and he wasn’t willing to take a cut",
            "He still lied and said that he did",
            "“Client wants to clear a certain amount and it sounds like your buyers are tapped out.  My seller has asked  If we both take 2.5% commission, are you opposed?”\n\nHow is that unethical. The worst that happens is “no.”",
            "We must relay the ask, even when it's stupid. That or we fire the client and stop working for them. Which honestly, I probably wouldn't have even taken the listing from this guy. If this is even real.",
            "You cannot force an agent to take a commission cut as a part of your offer. You can ask them. They can’t pretend they didn’t hear you. They must just respond with a yes, no, or other proposal.",
            "How am I an asshole?",
            "Good",
            "If they both agree to lower, what’s the problem?",
            "LOL thanks! Great advice",
            "Wrong; I asked, didn’t demand. They could have said no. He lied. He’s scum",
            "My agent is too dumb to close a deal with an agreement sales price?",
            "I wanted my friend to make Money",
            "Sure buddy. Want to compare accounts?",
            "Check back in a month..yout house will still be up for sale..",
            "Yeah you should stop responding. Congratulations on costing yourself a lot more than $6k by not just taking the offer",
            "Then ask him to take the cut. Why does he needs to present it. Lmao don’t be embarrassed bro, you know it’s a stupid idea now.",
            "He didn’t lie. He couldn’t fathom that you were asking him to ask another professional to take less money -which was already agreed on- to make you happy. In doing so and trying to play nice with you he navigated the situation poorly. Then again I don’t know you and judging how you have received some pushback in this thread he didn’t think you’d take it well and as a result tried to brush it off. He should have been blunt with you I cannot ask a colleague to take less money because it will make me look unprofessional and greatly impact people wanting to do business with me in the future. Secondly my brokerage will not allow it. What I can do is ask their buyer to come up 6k to meet your demands. \n\nThat was the appropriate response. Not trying to be a dick but you have played a major role in this situation. To put it all on this guy like he’s a lieing scumbag really isn’t fair. That being said he may have also had his reasons for trying to navigate the situation the way he did. You’re also counting his pockets saying he should take a haircut because he’ll make it back in the next sale in ten he’s doing the same to you, thinning this guy is about to buy a house that’s 50% more in value and is worried about a measly 5k. These streets go both ways. \n\nIf I were you I’d call the guy and apologize for calling him a greedy fuck. Further the fact you work with his wife and the amount of people in this thread that don’t agree with you should show you there are people at work that won’t agree either. Not something I’d want to bring to my work place but hey you do you.",
            "He presented your offer (\"seller pays 5% commission\") and buyer refused (\"we aren't paying 1% commission\").",
            "Because the buyers agent brought them to you based on the expectation of a certain commission.  \n\nYou’re now putting them in a position to have to take less money so that the buyers can purchase that house.  \n\nYou’re putting them in a position of having to give up their income to make the deal go through.  \n\nIf they had know beforehand that they were going to get less they would than have simply not shown that house.  \n\nYou’re putting them in an untenable and unfair position.  \n\nIt’s not up to the agent to take less than what was specified by the seller.  If the seller wishes to make the deal go through its up to the seller to take less not to take money away from the agent.",
            "You’re not. It’s uncouth to ask your agent for a cut. They usually offer if a deal is close. But heck it’s just business.",
            "Your demeanor/attitude throughout this thread paints a pretty clear picture.",
            "Bet. This is the most entitled shit I’ve seen in this sub 😂",
            "I did. He didn’t want to…. I called him greedy after already having him being the agent in two other transaction and me referring another client to him (they bought a house in 3 weeks)",
            "Incorrect",
            "The NAR settlement makes sense then.  This agent would bring over $12k from the purchase of her buyers. THATS INSANE for next to little work",
            "There is nothing wrong with the ask. The agent doesn't have to accept it. The buyers don't have to accept it. But it must be relayed, assuming the listing agent is willing to lower the commission. If they weren't, that should have been communicated as well. Although, it a buyers agent is willing to give up 1% then I'd still be willing to drop their commission to move forward. I would let my sellers know that it's unlikely to happen. We also can't not show just because of a low commission. A buyer can choose not to see a home if they don't want to make up the difference however.",
            "Lmao. I’m mean when I’m betrayed"
        ]
    },
    "My neighbor didn’t forewarn me that he was taking out 2-3 feet of my front yard. How should I handle this? ": {
        "title": "My neighbor didn’t forewarn me that he was taking out 2-3 feet of my front yard. How should I handle this? ",
        "score": 605,
        "url": "https://www.reddit.com/r/RealEstate/comments/1dl5fyw/my_neighbor_didnt_forewarn_me_that_he_was_taking/",
        "content": "I live in a brand new community. My neighbor wanted to extend his driveway, although he has the biggest house and biggest driveway on the block. He can literally park 7 cars in his driveway, no joke! We live in a rural area so he got a bunch of land. As his neighbor I don’t have much land, I have a fraction of his. However, he decided to take a huge chunk out of my front yard, about 2-3 feet,  to extend his already huge driveway. \n\nIs it common for a builder in 2023 to give you 2-3 feet of land that isn’t technically yours? I don’t want to confront my neighbor just yet. I want to ensure I have concrete proof and facts in hand. I found a surveyor who is gonna charge me $900, so I am getting this taken care of just looking for advice from others who have dealt with this. \n\n",
        "num_comments": 285,
        "comments": [
            "you need the survey to know where the property line is.\n\n You might also want to see if your city/county has easement or permit requirements that might require the neighbor to submit a survey. You might be able to get code enforcement to take a look without using a lawyer or survey of your own at this first stage.",
            "[deleted]",
            "Take care of it as promptly as possible. The longer property line issues like fences and driveways go on the harder they become to resolve.",
            "When I had a question about my property lines, it turned out that there was already a survey recorded with the recorder's office and publicly accessible for free. You would still need the surveyor to come out and stake the property to show where the lines are, but at least you can get a jump start on it by looking at the survey to see if there's an obvious encroachment.",
            "You absolutely should confront this theft.",
            "This happened in my old neighborhood (across the street from me). Neighbor had to remove the concrete that was added to the wrong side of the property line.\n\nGet it surveyed, have the owner pay to demo every bit of concrete in your side of the property line. \n\nIf this is CA, also report them to the local permit office. If they pouring on your property, very likely they didn’t pull a permit. Adding a ton of concrete without a permit might not be allowed at all, many counties/cities have codes that dictate how much impermeable material can be added to a given parcel",
            "You need to deal with this sooner than later. There’s time limits on things in the event you needed to sue.",
            "I am glad you were getting a survey. Surveys are your friend, especially if they prove that someone is encroaching on your property! Once you get the survey, you need to speak to your neighbor and the builder. If they blow you off, it’s time to find a lawyer.",
            "If the home was built in 2023 there is a recent survey available, no need to have it redone.",
            "Get a survey and tell him to have it returned to the original condition or take him to court",
            "If you let this one slide, he definitely will do it again.",
            "I had a friend who's neighbor built a garage 12\" over the property line.  The neighbor had been an ass. My friend decided to repay the favor and made him shorten the garage.",
            "Jump on that surveyor’s quote - $900 is barely worth their time! Where I live, surveys start at $3500 for an average small lot.",
            "Assuming they dont have an easement that allows this and its on your land. I would get a survey if you don't already have property pins placed to confirm it and then be sending the bill for restoration of my land to its original state and suing the shit out of them if they don't pay.\n\nThey'd also get a trespass warning and subsequent arrest if they push the issue with me.",
            "Go talk to the neighbor and tell him he is going across the property line and ask to see his survey.  See what his survey says or if he even has one.",
            "100% find out your property lines",
            "Get it surveyed to make sure you're right. Then get a quote to have the area repaired to it's original state. Ask your neighbor for the money. If he resists, then you sue him and have the judgment cover your legal fees, survey cost, and repairs.",
            "Confirm survey is in your favor.\n\nThen, present the issue in a neighborly way before coming in hot with demands. Ask what they propose to do now. If they deny the issue or make a weak proposal that doesn’t make you whole, then to me, the convo would go like this: “I understand. Neither of us want to be in this situation, but whether you meant to or not, this is a taking of my land. I have a legitimate property interest and I am within my rights to involve the permitting office, and they will demand a demolition of the driveway and return my property to its original condition. It’s as plain as that.”\n\nConsider if there could be a win-win alternative other than returning the land to its original condition *if* there is something more valuable that you could extract. For example, if your neighbor wanted to pay a much-more-than-fair price for the land (perhaps because that would be cheaper than the alternative of demoing and redoing all that driveway), and that would be a better outcome for you, by all means present it. Personally, I would not accept any sum of money less than the #sq ft taken divided by the total #sq ft of the lot X the Zillow estimate, plus $20/sq ft taken. This would be likely be a great return for you. It’s a lot for the neighbor to pay, because you are charging a weighted averaged rate for sq ft that averages improved and unimproved land, but only “selling” unimproved land. And then that $20/sq ft premium probably ends up being less than what they’d charge to tear it out and redo it (in a way that looks aesthetically consistent with the work already done). If they try to negotiate on price, just remind them, “Hey, it’s my land that’s been taken here. I don’t feel very good about it. I’m coming to you in good faith as a neighbor to see if you would like to return it to its original condition, or if you’d like to pay the value that I place on this land because I want to preserve the relationship. I have the right to offer to sell my land, and you have the right to decline. If you have another idea I haven’t considered, I’m all ears. Long after this is resolved, we’ll still be neighbors and hopefully friends and I want to make sure that neither us feels cheated. But right now, I do feel cheated, and I don’t want you to walk away from this feeling the same way that I feel right now so I thought I’d give you options. So, what do you want to do here?”\n\nIf your neighbor cannot play ball, alpha them with the permitting office, and have the court order restoration. You have the trump card.",
            "Stop everything.   Get a survey.\n\n\n*Take legitimate actions to stop someone from stealing your property.*\n\nDo **NOT** let people steal your property in plain sight.  Fight and keep a detailed log of their illegal activities in **YOUR PROPERTY.**",
            "You should have a survey when you closed on your house the builder prob has one check before you spend 900 dollars",
            "You want to pay for the surveyor to put iron pins in the 4 corners of your property.\nThey’re driven 2-3 ft so no one can take it out. They’ll put plastic caps on them  to find them. the flags are just temporary, and they don’t mean anything.",
            "You probably already had a survey from when you closed. Go back and look through your closing paperwork. While it won't show the driveway on it, it may indicate that there are markers at the corners that you could easily stake and tie strings between to have a pretty definitive view of your property line.",
            "Sounds like your new neighbor thinks that he's the new alpha male in the neighborhood.  You need to go over there and make him your bitch.",
            "Survey and a fence. Don't let them have an inch of your land.",
            "Give him two or three feet and he’ll take 20",
            "Why not just talk to him?  If he has taken this action, then he may likely have a survey already. Otherwise, he would have had to have known this would cause a problem",
            "If it in fact is a driveway, some cities actually have a 5’ or so setback required for driveways. Generally, what you are doing is right, get the survey. Important, Ask the surveyor to install more permanent markers than just wood stakes. If they are encroaching, write a letter giving them a specified amount of time to return the yard to its original condition. Make sure to get everything in writing.",
            "Get a survey. Also find out if there are laws on setbacks. For example, might be a clause that his driveway can not be within 5 ft of the property line, etc. if he is on your property then this must be addressed otherwise in some states the property can become his be default. You should have gotten a survey when you bought your home. It would have been in the closing documents.",
            "This needs to get taken care of asap. There’s this thing called adverse possession where someone who uses your land for a certain period of time (think years), will eventually become the legal owner of that land. This is a dirty tactic but I’m guessing the neighbor is counting on you not saying anything since the work is already done. This is worst case tho, they could just be not that smart and like wasting money.",
            "In a brand new community I would think there would be markers. Whether it is a small disc in the ground or cross on a curb something of that nature. The plans should be available at the county",
            "OP you can’t ignore this.  Should your neighbor get injured on your property it is your insurance policy that will be paying the claim.  Then when you got to sell the property line will be in dispute making it difficult to sell. And you have the issue of adverse possession.",
            "The builder already had the land surveyed.\n\nLook at the cement curb next the the street. At the property line, they will notch the curb concrete a little bit to indicate this is the property line.\n\nThey also mark the sewerage line with an S and the water line with a W on the curb.",
            "You should definitely determine if he's encroached on your property. You should also find out if the driveway has to have an offset from your property. If it's 2-3ft on your land it may also need to be 2-3ft away from your property line. Contact the building department of your locality and get the building code for driveways.",
            "I would go talk to him first. It’s possible you could get this done with a simple conversation!",
            "Locate the markers designating your property line. If you can clearly see that his driveway is on your property,  contact whomever is responsible for issuing the permit he should have gotten to complete this construction. If he didn't get a permit, you can report him for failure to do so. If they don't have him remove the infringement on your property,  call a contractor and have him demo the part that's on your property. Otherwise,  you can file a claim and take your neighbor to small claims court to force him to remove and repair at HIS expense.",
            "Worth every penny. 2 to 3 feet of your land is a bid deal. The nerve to just do it with out talking to you it’s pretty balmy too. Once it’s done it’s hard to go back. Take care of this now & don’t confront him, leave a note. It’s only legal when it’s in writing.",
            "There should be survey pipes already in the ground to set out where the property line is.  You shouldn't really need to pay for a new survey to address this.  Particularly if the community is new.  Look at your paperwork and see where the markers are.  Go find them.  Buy a roll of builders cord and pull it from marker to marker and leave it staked there.  Then go see the building code enforcement people in your town and explain that your neighbor built on your property.  They should enforce the codes.",
            "This will cost you  money, but less than the theft of your land.\n\nYou will need a surveyor and a lawyer \n\nEdit.... send the construction company a cease and desist.",
            "That price for the surveyor is crazy. Get another estimate.",
            "Did this happen overnight? I am guessing it didn't. I am wondering why you didn't stop if when it started?",
            "Did you get a survey when you closed? The builder gave us a survey and if there's an HOA they have to approve any changes anyway.",
            "You have got to know where your property line is.  Once you do, you'll know what to do.",
            "Survey",
            "Real estate lawyer",
            "You need to go ape shit. They’re taking advantage of you.",
            "Why not ask the builder?",
            "Get a survey, hire lawyer and file an\ninjunction",
            "If you live in a brand new community then the developer likely has done survey's.   Usually your mortgage lender would have required one as well.   Ask both if they have a survey and get a copy.  If you can't tell exactly where the property line is from the survey on your own then contact the same surveyor company that did the prior survey and ask them to mark the line for you and if they can document his encroachment onto your property.  \n\nAlternatively, you can confront the neighbor (hopefully in a nice neighborly way) and tell him you believe that is driveway might now be crossing your land and ask if he has a survey to show otherwise.",
            "Get a survey done.",
            "Most of the responses cover you here - get a survey, then go from there based on what it reveals. See if your survey from closing has pins shown as already being in place and see if you can find those (might need a metal detector if there's a lot of vegetation). \n\nWhat I want to add is that all the extra context about his driveway being big or his house being huge or his land being more than anyone else has NOTHING to do with this. You could each have a 100 square foot house with a tiny walkway, the property line is still the property line. Whether he put concrete or rocks or trees or a flagpole or bright pink flamingos on your side doesn't matter - it just matters if there was unauthorized work done on your land. If it was, then you absolutely are within your rights to take whatever action is needed to have his work removed and your property restored to its original condition.",
            "Your developer probably had it surveyed and your deed may be informative; go to town hall, make a copy.",
            "I mean, he has already started digging I think you need to go talk with him sooner rather than later. It doesn't need to be confrontational. Just go over and say hey, are you on my land? Because it would appear to be the case. \n\nAnd, I'm sorry buddy but you can't have my land lol. Obviously right? Do we need to get a surveyor out here? If this is your project you need to pay for the survey so get that done. \n\nYou got to protect yourself.",
            "If you have an owner's title policy, this would be covered under it.\n\nAlso, if you had a lawyer when you bought your house, they would have a copy of your survey.\n\nSigned, a real estate attorney who always makes her clients get owners title policies for exactly this reason.",
            "Have you checked for pins marking the corners in the ground?",
            "Don't wait. I would call the builder first and ask to see the survey they are using. Then get your own if you still think it's wrong.",
            "And you jus let him?!",
            "Im a surveyor, I use my counties version of this a lot:  [https://assessorparcelviewer.saccounty.gov/JSViewer/assessor.html](https://assessorparcelviewer.saccounty.gov/JSViewer/assessor.html)  change the imagery from esri streets to county imagery\n\nthe map overlay is not perfect, and wont hold up in court as fact, but itll give you a good idea if hes close enough that its worth having a surveyor come out",
            "Definitely get a survey. Also see if the neighbor has a survey recorded at the county recorder. Getting a copy of *his* survey is like a free survey for you on that one property side. Next, the county or city should have required a building permit for his new driveway extension. Also, such building usually requires certain \"set backs\" from the property line. For example, he might have to pay $50 for a permit, set backs might be 5 feet from the property line, and an inspector should also come out before giving final permission.\n\nIf you're a brand new community, like when an old farm is subdivided into lots upon which houses are built, there is usually at least a preliminary drawing for the community. Your area might have required that all of the lots be surveyed, or marked with survey pins. You might be able to find this out at your county recorder or county building/zoning department.\n\nAll of the above research is far less expensive than a surveyor. For example, I paid $1,000 to get half an acre surveyed (that had not bee surveyed before).",
            "Get the corner pins survey, if he put his drive over the lot pin, the surveyor will paint a big circle on the drive with a nail in the concrete. Then when you get the drawing back, have a conversation.",
            "The land owner must grant an easement with the city. \n\nStory: \n\nA condo in Minneapolis MN has one row of parking spaces in the back. However, a developer bought the land next door and proved the parking spaces were half theirs. So the condo owners who thought their units came with a parking space had to fight in court to keep them. \n\nIf I recall correctly they lost. The condos had almost zero parking in the heart of the city. The developer of the large lot next door built another condo tower further constricting street parking. \n\nMoral of the story: get a survey done to find your property line. There is plenty of case law to support your rights.",
            "Get a lawyer. Its not ok. Its your land",
            "In our area you are not allowed to change the grade of your neighbors property. Let alone take several feet. Flip the fuck out now. People like this guy piss me off. Fuck him. Take your shit back",
            "You have to defend it. If you let it go, he’ll end up owning it legally. You need to talk to a lawyer and get the authority involved ASAP.",
            "Don’t wait to act. And keep us updated.",
            "Dude, why wouldn’t you confront him 🤦‍♀️🤦‍♀️🤦‍♀️",
            "Wait until he's done...than trade the 2-3' of front yard driveway, for 15-20' of backyard land. Have him pay for the attorney.",
            "Go look for metal pins marking the property lines.  It's pretty easy at that point",
            "The neighbor may just be stealing from the common areas and the HOA wont like it",
            "Get the survey the. Put something along that line. A fence, boulders, hedges. If they’ve poured concrete over that line have them remove it at their expense",
            "You’re doing the right thing with the surveyor. That should have been the first thing your neighbor did before moving forward with his driveway. He screwed himself by not having a survey done.",
            "My neighbor freaked out when I told him I was planning to get a survey.  There’s one on file with the county anyway that shows he’s taking up part of my land with his driveway that was illegally asphalted… anyway, long story short, get this taken care of ASAP.  If he freaks out about you doing your own survey, know something fishy is going on.",
            "Hey op, I kinda wanna know what happens next.",
            "That’s the only way to salve it",
            "Property lines... It doesn't matter what is common or not, although this happens, it's not common. Get a survey, claim your land back.",
            "Survey is the way to go.\nSince this does  not fit into an adverse possession situation, the neighbor is risking an unlawful encroachment/taking of your property..\nSelf help is not a good idea.\nHire an attorney.",
            "He should be Asking, not telling.\n\nIf you don’t pursue this, he will take More.\n\nBased on your wording here, you might have some people pleasing/ conflict avoidant tendencies that will make it hard for you to set healthy neighborly boundaries unless you address them First.",
            "Survey, then a concrete saw and jackhammer.  Also find out if there should be a setback from the property line and ensure it happens.  Guy lost money?  Oh well.",
            "Lookup your deed on the county website, call the title company on the deed and request a copy of your survey, if you didn't pay cash and waive it there will be a survey. When you get the survey you'll know who is fucked up.",
            "Talk to the city.  See if there are also rules for how close you can make a concrete pad or driveway next to a property line.  Most won't let you put them right along a property line, so he might be infringing more than you think.\n\nYou want to figure this out now.  If at some point you decide to sell, something like this could make selling a nightmare in the future.",
            "No, my parents have this issue with a neighbor. His driveway comes over the property line a foot or two. The neighbor disagrees. The survey my parents had done 15 years ago shows this and the neighbor removed the pins and stakes. Recently my Mom had the property surveyed again so she could split off 10 acres. Showed the same thing.  It’ll be an issue when she sells, but since 2 surveys are in her favor and he knowingly pulled survey pins he won’t have an argument and will in fact get himself in trouble.",
            "Either pay for the land or remove the driveway. Go talk to him. It’s really not that complicated and any decent human being would oblige to one of those requests.",
            "In my state (maybe not yours) you need a full survey of the land before you can close on a house.  If that's the case, you should already have that survey with your closing documents.  Call the city/township/county code enforcement and ask them to come out - if the neighbor did that without a permit, hoo boy. he's in for a world of hurt (at least he would be if he did that around here).",
            "Having a survey is good. When you get the survey and if they are on your property OR in a setback they can't build on, present them the findings and give them a firm deadline to remove the encroaching driveway.\n\nThey are an asshole, probably, so be prepared they will say no etc. It's on your property so you can just physically remove it when you... say... hire someone to build a fence between your houses all the way down to the street.",
            "Take action. Your neighbor is adversely possessing the land, which could give rise to an ownership interest in time if you don't take action now.\n\nYou're probably going to have to file a lawsuit. If you prevail, you can get attorneys fees. Please consult with a real estate attorney now.",
            "Lawyer now. Rich people only understand lawyer letters. Everything else just tells them they can try to get away with it",
            "\"Hey bud, did you get a survey done before you put down the drive, I was under the impression that was on my land\"",
            "As a homeowner with a larger tract next to a smaller tract when I installed a perimeter fence I proposefully put fence abutting his side a few feet in so not to kill him.  It didn’t affect me at all.  I’m assuming it’s the same situation it’s his property and maybe he could’ve been a little more neighborly like.   I’m assuming clearly he didn’t go over the property line but if he did gloves off.",
            "At least where I live you need permits for work like this and there's city/county enforcement and likely plans on file. We have a site where you can search for building permits and see what plans have been filed. When my neighbor wanted to extend their driveway they had to put up a written notice in their yard for the neighborhood to be notified at least 30 days out. Check with you local building ordinance enforcement and see what's required for your area and if they haven't followed those requirements file a complaint and see what code enforcement does. That might save you the hassle of getting a lawyer. \n\nIt's important to have a survey on your property and know exactly where the boundaries are for reasons just like this, and to protect yourself if you need to update your own property. So even if he's not in the wrong and you can't recoup the cost you should have that one on file for your own sake.",
            "Get the survey done. They’ll mark the boundaries. Then you’ll know for sure. I see many times where people mow an enlarged area if no one lives next door. It ends up looking like their property line but it’s not.  I doubt the builder would make such a mistake.",
            "The neighbor needs to demonstrate it is his prior to starting work I think.  Requesting his documentation is not confrontational but business like and polite.",
            "Id get a survey and then cut a deal for the land.",
            "Do you have a survey?",
            "Go to the local government and look at the plans for the development. While you are there, look for the surveyor's info on those plans and CALL THEM. They will give you the best price on placing irons on the corners of your property.",
            "Oh cool free parking for you!\n\nPark on the 2-3 feet.  If he complains, show him the survey and let him know it's your property.",
            "I would get a professional survey done. Then you have the proof.",
            "It’s possible there are markings or a visible metal pin set in the sidewalk representing where a property line begins. If you find these markings you probably won’t need to hire a surveyor for initial conversions. If the home builder is still present you can ask the superintendent where the property lines are located. Let us know how everything turns out!",
            "If he did in fact infringe on your property, you could ask for a concession somewhere else, rather than making him tear up his driveway.\n\nHe might be your neighbor for a long time and destroying that relationship probably is a bad idea.",
            "When you bought the house there may have been a survey included- check your documents",
            "First, check your title policy and deed.  Does it mention any easements?  Then talk with the neighbor and discuss it.  Do they have a record of being conveyed that portion of your property? Record of any easements?\n\nDepending on this information will determine any next steps.  They may not be aware that the contractor they hired, invaded your property.  If that is the case, they can contact the contractor and have it immediately rectified.  No cost to you and you maintain good neighborly relations.",
            "[https://app.regrid.com/us/ca#](https://app.regrid.com/us/ca#)  This may help you confirm your property boundaries.  Saw it offered up in a recent thread elsewhere on Reddit.",
            "Usually a recent survey is required when you title.  There should be a copy in closing docs.  That could give you the markers for your land.",
            "Get survey. If he built on your land, decide what you need. If he built on your property, whatever he built, you own. So sue him to remove it at his expense. Or enjoy your free driveway. Or rent it to him for $1/year so there is record and he doesn't end up.owning your.property via adverse possession.",
            "You have to have an accurate survey. $900 is ridiculous unless it’s a huge plot. Specifically ask the surveyor to stake/mark the boundary where the encroachment is. You may not care about a full boundary survey. Then tell your neighbor he encroached on your land and needs to remove the offending concrete beyond the marked line. Up to you if you take a settlement for an easement or not. If it results in BS you don’t necessarily need to sue him over it. You’re within your rights to just remove the offending portion of driveway that’s over the line. He can’t stop you and the police will back you up if called. It’s not like it’s a corner of a home or something where you might collapse the structure. Lanscaper with a concrete saw and a hammer and no more encroachment. Just tell your neighbor he has a couple days to make it look good or you can just reshape it to fit the property line. Permanent structures on your land belong to you unless an easement or lease says otherwise.",
            "You need to confront the neighbour first. Tell him it isn't okay, and if he wants to do it, he either has to get a lawyer to compel you or pay you outright for your land loss. You have to go to your neighbour.",
            "Get a survey or find one that's been done. Contact the building inspector about whether he pulled permits or violates any setbacks. I wouldn't go to the neighbor, deal with a lawyer or government official and get your ducks in a row.",
            "Have you had a conversation with the neighbor? I would start there.",
            "Unless the guy knew what he was doing, he flat out stole it from you. Get the survey. I hope it works to your advantage.",
            "Depending on where you live, you could see the property lines overlayed on a map here: https://qpublic.schneidercorp.com\n\nIn the end, a survey will be the ultimate truth.",
            "RemindMe!",
            "Stop the survey. Look at your plot map.  Then look for your marker. If you are certain he is infring on your property, then talk to him in a nice way. Don't give him permission for anything. If it can not be resolved, then get a survey and go to small claims court.  Remember, different surveyors charge different prices\n  It could be a simple servey or one that requires more work.",
            "Take it back",
            "In most places after 10 years, he owns the land. \n\nWhen you sell your place, the new survey will show the encroachment.  His problem right? No yours. May kill your sale.  You may have to deed him the land to close. Will your buyer want a price reduction? I would.",
            "Get the survey and sue your neighbor for remediation and your fees",
            "2-3 feet is not a “huge chunk” but if you’re getting it surveyed, that will show where it SHOULD have stopped. Then you can demand removal. Might get costly to enforce with a lawsuit though, so 2-3 feet may not be worth it.",
            "Nah, you need a surveyor. If this guy truly built his driveway on you property, then he broke the law. You can also check with the government office that keeps the drawings of properties ( where I live, it's the county recorder's office). They can at least show you the boundary lines of the property on a map, but you'll still need a surveyor to verify.\n\nBoth the builder and the property owner should have verified the boundaries of the properties before pouring the concrete. You could also politely ask your neighbor if you could see the map or the surveyors report he used before they poured the driveway.",
            "Get a survey and build a fence. Then smile and wave as you jackhammer the part on your side of the property line.",
            "Get it surveyed.  It might not be a big deal yet, but it becomes monstrous when you try to sell your property.",
            "Why don't you go over and politely talk to him? Ask where he thinks the property line is and explain you concerns. ",
            "There are usually codes with setbacks, it’s not uncommon to need 5’ or more from property line for driveway. If it is on your property, then there is no way a permit was pulled. If you contact the town and they find he extended it beyond the property line, they will more than likely make him remove the driveway to the original location. They might also enforce setback taking away more than the 3-4’ that was extended into your property.",
            "OP didn’t you see the workers digging to pour the concrete??? Why didn’t you stop and asked him for the property line survey???",
            "No one is minding the store when it comes to land you must know your property lines and inspect them at least once a year. **A fence** if zoning allows it **is a good Idea to protect your land** 1/4 inch in on the property line; if the surrey shows part of his driveway on on your land. **I suggest chain link since it is easy to fix.  Have a security camera watch the fence so if his car hits it you can easily file a claim against his auto insurance.**\n\nView laws on **Squatter’s rights**/adverse possession for your state [https://learn.eforms.com/real-estate/squatters-rights/](https://learn.eforms.com/real-estate/squatters-rights/) Act now so you do not lose title. If you do allow yourself to lost title to that part of your land a lawyer can prepare a quitclaim deed to transfer the property tax liability for that section. The deed will have mention State adverse possession laws to get around local zoning laws. You will probably have to pay to record it yourself because no likes to pay more taxes. You should able to file a claim on your title insurance over the loss of the land.",
            "You are being a fucking pussy.\n\nConfront him",
            "Based on your unwillingness to talk to the neighbor before posting about it, I’m guessing you’re wrong where the property lines are and assumed you had more yard than you actually do. \n\nGet a survey. Prove me wrong.",
            "OP may also want to check his title policy to confirm no easements already existed.",
            "Agreed. The survey is the difference between having it be completely legal due to an existing easement, or a massive overreach that he'll have to pay to fix.",
            "Also check code to see if there are restrictions on driveway size and amount of paved over space allowed on a single property.",
            "Absolutely call the code enforcement. I have had a chat with a couple of them in my county and it seemed to me like they were very much down to Earth, no BS people. Came out on a whim, chatted with me in my yard about BS as I am still a new homeowner, I've had a lot of questions, right.. It seemed to me that they actually prefer people doing this, asking questions and such BEFORE breaking ground.",
            "Find out who did the original survey,  guarantee they still have the records.",
            "If he took your land, (see other comments on confirming),   be aware that if you don't do any thing then he can later legally claim the land as his.    See \"adverse possession\"",
            "Setback requirements too.",
            "Since a new neighborhood, the site/lot plans likely accessible as well from the county.  Which in my case shows the corner pins, which then easily found myself.   Sure, maybe a new survey needed, but if you can show neighbor the measurement from the pin and mark with chalk on the new driveway, he may realize the mistake and save you hundreds of dollars first.\n(Edit: measured from the other pin on opposite side of lot, as the questioned corner likely under new pavement)",
            "Strange that someone would wait to deal with this.",
            "Yep, check county records for a deed and plat! Then decide if you need a survey. Sometimes they're fairly informative.",
            "Offer the survey guy iron pitons and a rock climbing hammer if needed to put survey stakes in a...hard surface...that may cross the property line?",
            "Ahh very interesting and useful to know.",
            "Yeah.. they should pay for the land or just simple give it back.",
            "Yes, California. Near Sacramento area",
            "I read this each time someone posts about neighbors building in or taking a piece of property. Is this just due to adverse possession laws? If so, adverse possession doesn’t kick in for decades in each state I have looked into.",
            "You would think, but it depends on the state and/or county. Ours was only required to file the neighborhood plat, not the individual lots",
            "This. If you let him ask for forgiveness instead of permission, that's all you are going to get. Don't give them a price. That's forgiveness that they don't deserve. Demand they fix the problem or let the courts figure it out. Seriously though, get that survey before you get to worked up.",
            "This feels like the bullies in school stealing other people's stuff.\n\nDefinitely fight back, so you don't make it easy  for them to steal your land/property.",
            "That’s probably true.",
            "I’m in a similar situation as OP, hired a lawyer.   There is an existing survey from 10 years ago.  I am doing another survey for the fence line only and it’s $2100.  Still cheaper than the alternative.  My neighbor is a bully and I just let the attorney do the communications.",
            "I paid $1000 for 3ac in a high cost area. YMMV.",
            "No. Just ordered one in an expensive city for $1200.",
            "This is absolutely the correct answer in terms of Step 1. There are 100s of outcomes in hat may not need a lawyer of a survey.  \nYou have to live next to this person for the foreseeable future, your first move doesn’t have to be aggressive.",
            "Agreed.  My first step would be to talk to the neighbor.  Personally if they did pour on my land I'd rather them just pay me something for the mistake and move on with my life. \n\nIf you neighbor is toxic this will turn into a lengthy legal battle.   \n\nI've mentioned legal rights and boundaries to people before to get them to voluntarily pay me what they owe me.    Some people are unaware of certain things.   It can be a win win because most people don't want a long legal battle.",
            "I wouldn’t sell the land to them at all.  At most have them give you twice that amount of land off the back part of their lot, and require them to fence it off for you.",
            "I thought the same, but ours didn't.",
            "No, they didn’t provide a survey unfortunately. I spoke to the title company and my mortgage company- no surveys are needed when purchasing a home in California.",
            "Those normally appear at the corners of the property...which seems exactly where you would put a driveway.",
            "Do you mean cease and desist ?",
            "r/BoneAppleTea",
            "I was told it’s cheap. I also took a number of estimate and that was the most affordable one. I’m in California btw.",
            "It happened very early on a Saturday morning. I work full time all week, so Saturday I sleep in for a few hours. I remember hearing a loud noise and looked out my window and saw a big cement truck. I didn’t think much of it just thought they were doing some upgrades to their yard. It wasn’t until I stepped outside that afternoon that I noticed about 2-3 feet of my front yard was missing.",
            "Because it makes sense to ask for advice and help with devising a clever strategy first\n\nYou want to get all the ducks in a row before dealing with it so the neighbor doesn't have a leg to stand on when push comes to shove\n\nYou want to prepare a response that he can't stop",
            "Most properties don't have them.",
            "If she doesn't want the other property owner to gain her section of land, she should have his driveway removed ASAP.  Depending on the state, after a certain period of time (7 years/ 15 years?) he can take possession of it.",
            "**Defaulted to one day.**\n\nI will be messaging you on [**2024-06-22 22:49:45 UTC**](http://www.wolframalpha.com/input/?i=2024-06-22%2022:49:45%20UTC%20To%20Local%20Time) to remind you of [**this link**](https://www.reddit.com/r/RealEstate/comments/1dl5fyw/my_neighbor_didnt_forewarn_me_that_he_was_taking/l9op6ag/?context=3)\n\n[**CLICK THIS LINK**](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=Reminder&message=%5Bhttps%3A%2F%2Fwww.reddit.com%2Fr%2FRealEstate%2Fcomments%2F1dl5fyw%2Fmy_neighbor_didnt_forewarn_me_that_he_was_taking%2Fl9op6ag%2F%5D%0A%0ARemindMe%21%202024-06-22%2022%3A49%3A45%20UTC) to send a PM to also be reminded and to reduce spam.\n\n^(Parent commenter can ) [^(delete this message to hide from others.)](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=Delete%20Comment&message=Delete%21%201dl5fyw)\n\n*****\n\n|[^(Info)](https://www.reddit.com/r/RemindMeBot/comments/e1bko7/remindmebot_info_v21/)|[^(Custom)](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=Reminder&message=%5BLink%20or%20message%20inside%20square%20brackets%5D%0A%0ARemindMe%21%20Time%20period%20here)|[^(Your Reminders)](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=List%20Of%20Reminders&message=MyReminders%21)|[^(Feedback)](https://www.reddit.com/message/compose/?to=Watchful1&subject=RemindMeBot%20Feedback)|\n|-|-|-|-|",
            "It's easier to complain on Reddit than to walk over and have a friendly conversation with your neighbor.",
            "It happened on a very early Saturday morning in a span of a few hours. I didn’t even know what was happening. All I saw was a big cement truck from my upstairs window. I thought they were having something else done. I didn’t notice until I went outside that afternoon.",
            "When you bought the house title insurance is usually included. They should come inspect for you.",
            "This!",
            "Do easements give you the ability to actually build on the other person's land? I always thought of them as just giving the right to traverse someone else's land.",
            "Easements are still your property to use and maintain. An easement just means that utility companies are allowed to have access to that portion of the property as needed.   It doesn't give neighbors access..",
            "It's rural.  Highly unlikely there are maximum size restrictions.  \n\nEven when there are it is usually % based and it's unlikely if he has even 5 acres (which is not huge) that's he's gone over the allowed percentage if there even is one.",
            "Depends on the area. He says he's rural. Most places it stops at the city limits",
            "That’s not how adverse possession works.",
            "That takes years of inaction.  \n\nThere may be a statute of limitations on a lawsuit, but even that will be a year or two or more.",
            "[deleted]",
            "Yeah, I would get on this immediately, lol.",
            "Even if they paid for the land, they'd likely have to buy more than just what the driveway is built on. \n\nPersonally, they need to make OP whole again",
            "I'm sure his neighbor would be perfectly happy to just pay for the land.",
            "Definitely get the permitting office involved",
            "Sacramento definitely has a limit on how much concrete can be on the front.\n\nIf I recall correctly, it has to be 50% or more landscaping and 50% concrete max.",
            "I’d contact an attorney - assuming the survey results are in your favor.",
            "Yes, it’s a complete misunderstanding and misplaced faith in adverse possession/squatters rights. It’s so dang prevalent too. I don’t get it. ",
            "3-7 years is typical.\n\n\nBut still, no reason to mess about.",
            "Why would you buy a piece of property without knowing exactly what you own and the boundaries of it?",
            "Check the county website, they show lot lines. Google maps shows them too if you drill down, but not sure of the accuracy.",
            "It's a crime to disturb them.  And a driveway, or any structure, would generally have a setback requirement.",
            "I think he meant cease and assist. \n\nTell them to stop and then help the contractor lay down the concrete to save his neighbor labor costs.",
            "I mean the California thing comes into play, but that’s still a crazy amount for the scope of work you’re describing.",
            "2-3 square feet?  Hard for me to visualize.",
            "I get that (sleeping in on Saturday morning 😀) it seems like they would have had it framed up on Friday at least to our Saturday morning. I mention it mainly because it could have less confrontational to stop it.",
            "Quite. Just building the driveway isn't enough for adverse posession. Continuing to use the driveway after being informed you have no rights to, and removing survey stakes might tick enough boxes if time elapses.",
            "Good to know.",
            "Yeah— I noticed when stranger cars park around my house..imagine machinery and workers touching your property, and you just wait to see what’s happening.. crazy or fake..",
            "Oh no— fault on you— if is me— I’ll go out and check it out— good luck because you probably gifted your neighbor some land..I say— crazy or fake..",
            "If OP got a mortgage, the lender required a lender’s title insurance policy. That only covers the lender. Owner’s title insurance policies are optional, but that would cover the buyer.",
            "I don't know who you are saying should come inspect.  The title company has no incentive to inspect anything after they have their premium and the policy is issued.  Any inspection would have occurred prior to issuing the policy.  At this point, an inspection could only hurt the title company by revealing something they missed and allowing for a claim under the policy.  We actually had title come out to verify our property line.",
            "And what happens if there is damage or an accident on OP’s property? (OP’s portion of the driveway)",
            "I’m on a private lane.  I can maintain the road surface on the land I don’t own.",
            "It all depends on what the easement says.  In terms of use of the servient estate, they are extremely broad in terms of what they may cover.  Building on another person's land is often included in easements.  Access easements alone could necessitate construction, use, operation and maintenance of bridges, gates, fencing, roads, sidewalks, etc.",
            "Easements can be for any number of things beyond just utilities.  Portion of a building, ingress/egress, fence line, septic, just to name a few.",
            "Lots of people can have easements outside of utility companies",
            "I'm a real estate attorney.  Easements can be just about anything and have no automatic implication that utilities are involved.  You can grant an easement for someone to build a pool on your property, with rights to access and use the pool, maintain it, etc...\n\nEasements are specifically not your property.  They are a property right in your property granted to another and can be as impactful as denying the grantor any right of access to the easement area.  Easements are insurable by a title company similar to a leasehold or fee simple interest.  They can be separately conveyed from any interest in a property (depending on the nature of the grant of easement) or they can be appurtenant to the dominant estate and are actually viewed as part of the dominant estate and not part of the servient estate.",
            "Easements can also be for driveway or private roads for access to a “landlocked” property.",
            "I have an easement on my property that allows Bob to access the stream via the dirt road at a certain spot. I have no clue who Bob is and I've always wondered if it's anyone named Bob or a specific one because they didn't say more than Bob, and there is no stream anymore (dried up well before I purchased). But easements can be weird.",
            ">Easements are still your property to use and maintain. An easement just means that utility companies are allowed to have access to that portion of the property as needed. It doesn't give neighbors access..\n\nEasements can absolutely give neighbors access to parts of your property, in fact it's one of the most common reasons for easements.",
            "We own the property out to the road itself, the sidewalk is firmly inside an easement. I can tell you first hand, public rights of way on private land exist.",
            "Driveway easements are incredibly common…",
            "That's true for utility easements only.\n\nIf a neighbor has ingress/egress rights via easement on your property, it gives that neighbor the right to use that easement on your property for ingress/egress.",
            "I technically own the driveway for 4 homes, was that way before we bought the place. \n\nSingle entrance that curves back and splits off to the different homes and it’s ~80% on my land. \n\nIs what it is. They’ve got rights to do stuff like modifications/repairs to it from what I recall and they have.",
            "A utility easement is one of MANY kinds of easements. Common easements between neighbors are ones in which someone's property doesn't extend to a decent road, in which case they can use their neighbors land to get to their house, or grazing/herding easements where a land owners has to let neighbors move animals through his land to get to a water source.",
            "You must have attended Trump Law School.",
            "If the neighbor poured concrete over the utilities easement….I would enjoy seeing the fallout from that.",
            "I love how adverse possession gets thrown around a lot. It varies a lot by state. But you can’t just encroach on a neighbors property and then say “finders keepers!”",
            "The 5 main elements to obtain an adverse possession of a property are: actual possession, hostile intention, exclusive possession, open and notorious possession, and continuous uninterrupted possession. The period of time is it requires is typically twenty years for the land to be legally transferrable to the user if the five elements are proven.",
            "From state to state, adverse possession laws are worded differently.\nFor example, in some states which are less private property friendly than others, an adverse possession can be valid within 30 days.\nWhile in others the threshold is 20 years.",
            "Well, here in arkansas, you have to treat the property as yours, for a certain amount of time,  then go before a judge and they will decide if it can proceed to be transferred to your name. I'm not sure how long, I think it is 7 years, but it would be different in each state.",
            "You may be right. But I hate people say something like that’s not it without further explain what’s right. I mean if you are the more knowledgeable person here, as it appears based on your comment, wouldn’t you want to let the rest of us know what’s right? Because otherwise it’s a useless comment.",
            "It is in some places.",
            "It is in some states. Sometimes the requirements are basically the opposite of in other states.",
            "Take a picture of the pin place before you say anything because that’s a good point. \n\nThe best might be if you could get a reference mark or two in the photo. For example, if there is a city sidewalk you would want to show the pin is at the third section away from the fire hydrant or two sections past the section with the cities logo stamp stamped in it, etc.\n\nIt doesn’t hurt to get the pin number as well because in many jurisdictions, pulling a survey engineer’s ‘official’ pin is an offense, and if it mysteriously goes missing, I’m sure the city or land titles department would love to hear about that…\n\nIf they were dumb enough to go cowboy on pouring the driveway, there’s nothing saying they won’t double down on stupid.",
            "I suppose you’re right.  3’ length down, could be an effort to remove, but yeah, I’m sure AH’s still do it.",
            " Illegal to move pins",
            "Point is they need to pay or demolish and restore.\n\nIt’s up to the land owner to change the physical dynamics of his property or accept a financial solution.\n\nEdit: Also did they even get permits.\n\n\nThis sounds like a whole bunch of fines and permit stuff.\n\nThey neighbor is an idiot.",
            "Maybe , maybe not.\n\nThis screams entitlement.\n\nEntitled people don’t like to part with money because everyone and everything belongs to them",
            "They're all pinned, we just weren't provided with drawings. It's not required. The description is on the deed. But we had to get them done in order to be about to have a fence put up 🙄",
            "Google lot lines are likely accurate enough to tell if you obviously do have a problem, obviously don't have a problem, or need to get a survey to determine if there's a problem. \n\nBut even if there's obviously a problem due to google maps lot lines, those arnt going to be able to be used as proof in a lawsuit, so you would need to get a survey done.",
            "Driveways do not and cannot have setback requirements because they must by definition cross the property border wherever it is necessary and convenient to connect to the street.\n\nThe site plan will specify the driveway placement. In many early suburbs of the postwar years, driveways are adjacent to each other, with the property line running down the center of the pavement.\n\nEncroachment is still a problem if the new driveway crosses property lines, but the idea of a “buffer” requiring that it not touch property lines is definitely not a thing in general.",
            "from [Doorloop.com](http://Doorloop.com)\n\n# Requirements to Make an Adverse Possession Claim\n\nSquatters can only start this process if occupancy has been:\n\n* **Hostile**: They must honestly believe they have the right to be in the unit and remain there without the owner's permission.\n* **Actual**: The squatter must have full control over the unit.\n* **Open & Notorious**: Squatters must not hide that they have occupied the property and live there.\n* **Exclusive**: They must occupy the real property alone and cannot share it with strangers (this requirement varies slightly in Oregon).\n* **Continuous**: Squatters should have been on the property for at least 10 years for adverse possession or 20 years for co-tenancy.Requirements to Make an Adverse Possession ClaimSquatters can only start this process if occupancy has been:Hostile: They must honestly believe they have the right to be in the unit and remain there without the owner's permission. Actual: The squatter must have full control over the unit. Open & Notorious: Squatters must not hide that they have occupied the property and live there. Exclusive: They must occupy the real property alone and cannot share it with strangers (this requirement varies slightly in Oregon). Continuous: Squatters should have been on the property for at least 10 years for adverse possession or 20 years for co-tenancy.\n\nSend a certified letter stating that your neighbor does not have your permission to use your land. Start with that.",
            "Interestingly enough, the lender or their title insurance company might care, too, since it’s the lender who is potentially more at risk of losing value from this right now.",
            "My neighbor has an easement that allows me to use her land as a driveway to my garage.",
            "You're technically correct, the best kind of correct.",
            "Right! I have a shared driveway with my neighbor and the permanent easement requires us to maintain it and provide each other with access to it four feet on each side of the center of the driveway.",
            "Our title has an easement just for the gutter on the far side of our attached carport, because it extends two inches over the property line dividing our lot and our neighbor's. We have another easement for about two feet of retaining wall that extends over the empty lot on the other side of the house to divert rain runoff from back flowing into the basement.\n\nEasements can be pretty great lol",
            "Still doesn't give neighbor access to put a driveway.",
            "One example among many: everyone on my street co-owns an easement for a path we can take across some vacant lots down to the beach.",
            "One of the best answers ever.",
            "An easement should show on a survey and the platt record, should it not?",
            "If such an easement existed, OP should know about that..",
            "But they do not give neighbors access though, right?",
            "In Illinois, you would have had to pay the taxes on the property for seven years.  So who is so unaware of property they own that someone else is paying the taxes.  Then just to claim a 10' wide strip of your yard would have a separate tax number for them to pay. \n\nI bought a strip of land from my neighbor, paid them for it, and had a surveyor Mark it and we got a separate tax number.  The next year the county combined mine and it into a single tax number.",
            "How about “prescriptive easement”, then 😀",
            "Prescriptive easement is even worse.  You still have to pay the taxes and fines, and they get to use it for free.",
            "In Utah, this is exactly how it works. The “finder” just has to use it as their own for 7 years.",
            "lol can you imagine. all secondary residences would be up for grabs 😆",
            "Yeah, you have to plant a flag first.",
            "I friend of mine had that happen. When she was in the process of buying a home, a neighbor quickly slipped in a fence on the property of the new home. Years later she goes to sell the home and those buyers discover the loss of land. Friend took neighbor to court. Neighbor got to keep the land. Those are the details I know.",
            "In Wisconsin if you don't challenge it then I believe after 20 years you have legal rights.\n\nI'm not positive on the timeline but agree with above it is best to contest it immediately upon discovery so that you don't run in to this problem.",
            "You know, a lot of people try to claim that on here, but no one can ever show proof of that. \n\nSo I’ll ask you, please show me where you can take over someone’s private land within 30 days by just putting a fence or driveway (or even a tent or other means of claiming it), because I’ve never seen it.",
            "Absolutely illegal to pull an Iron - 100%",
            "[deleted]",
            "100% but cocky homeowners don’t always know that, and can’t help themselves but to want to encroach.",
            "[deleted]",
            "Illegal to pour a driveway on someone else's property too.",
            "It's also illegal to drive 1 MPH over the speed limit.",
            "I'm not saying that someone wouldn't accept free land, but if all it required was building a driveway to force the other person to sell their land, more people would do it.",
            "Dude, they cannot go over someone else's property.  There is generally a setback from the adjacent property.  No, they do not cross over the neighborhood.  And this driveway, op says was recently added.  It's not part of the original.",
            "A lenders policy doesn’t go into effect unless the property goes into foreclosure. It’s a different set of coverages.",
            "Random futurama I love it!  And my favourite episode!",
            "How do you know? Is there an easement that allows access on this specific property?  With what has been told, we don't know.  OP needs to 1st get a survey to find out where the property lines are. Based upon OP's comments, they don't know if it is their property or neighboring property they are assuming at this point.",
            "It will show up on a title report. Being new construction, op can call his title insurer and ask about easements or a preliminary title report or whatever they can provide to help. In my limited experience, they’ve been helpful.",
            "Yes and no, an easement should be recorded in the real property records of the county in which it is located.  A play is not necessary.  The surveyor would not necessarily know about it without a corresponding title report.  The easement may be visible from the site visit (such as from fencing or a driveway), but the surveyor wouldn't know it is an easement without the documentation.  Easements do not generally appear on tax maps or plats (unless the plat creates the easement or was recorded subsequent to the easement, but even then, humans are fallible and may miss the easement in the record).",
            "Yes, they should, considering it would have been in place at the time they bought the property.  But not everyone understands these things or pays close enough attention to them or knows what they should know.",
            "Irrelevant",
            "They can give almost any right to use a property for any purpose to almost any party imaginable.  An access easement gives rights of access.  Adjacent business owners will grant reciprocal rights of vehicular and pedestrian ingress or egress if they share a parking lot, for example.  Easements can dictate obligations of maintenance for common areas.  They can indicate that someone can play pool on one pool table between the hours of 1 and 2 am.  \n\nEasements aren't public rights (unless granted to a public body (think a path between two houses so the public can get to a beach)).  Just because I grant an easement to one neighbor doesn't mean the entire hood gets to use it.",
            "Thanks good to know how that works in illinois.",
            "Like a lot of real estate law, it varies by state (county),  in Washington state you don’t have to pay the taxes,  \nIt’s not instant,  but it may eventually happen.\n\nRef https://www.bolanlawgroup.com/blog/2020/october/how-to-identify-adverse-possession-in-wa/#:~:text=Under%20the%20law%20of%20adverse,long%20enough%20period%20of%20time.",
            "Or a propane tank.",
            "Don’t forget you have to pee on it daily to mark your territory",
            ">Absolutely illegal to pull an Iron - 100%\n\nIt's a *felony* in my state.",
            "When my neighbor was “manspreading” his drive on our easement during our builds, I made sure to proactively had flags on my pins, because I knew how inattentive his sub would be.  (And he wouldn’t be policing it).   Sometimes you have to be defensive, because people are so sloppy egotistical - not always nefariously trying to take over property.",
            "surveyors now use gps,down to the inch…",
            "Since he is getting a survey, at least he can take enough photos of each corner to make it clear to police where the pins ought to be.",
            "Their are remedies to remove stuff that is on your land that doesn’t belong to you.\n\nThis is why they have easements and surveys.",
            "There could be an easement, it would depend on what the terms of that said. My in-laws former house was an interior lot with two houses in front of it. They had an easement through the two other lots for a driveway. And the other interior lot had an easement as well, so the house on the street had two overlapping easements allowing people to use the driveway.",
            "No one said they can cross the property lines. That’s encroachment. \n\nBut there is NOT “generally” a setback from the adjacent property. A road approach permit defines what is safe from the street perspective, and the engineering site plan will determine the placement of the driveway, which OBVIOUSLY has to have a zero setback where it connects to the street, including potentially at the corner of the lot. Zoning regulations encourage CONSOLIDATION of driveways to shared edges of properties so that there are fewer connections.\n\nThis idea that there has to be setback space behind the property line is simply not true.",
            "No, but they might be interested in the outcome and send a surveyor, or have information that would help him",
            "Easement documents should include a  plat map or legal description and would be shown on records of survey or subdivision maps.",
            "What the hell are you arguing?  I'm reading 4 of your posts and you're all over the place.  I think you like to argue.",
            "OP would know if there was an easement.  It's a new build.  There isn't an easement. Stop trying to excuse this theft.",
            "There is a stated setback, even if that is zero.  You're being ridiculous arguing whatever point you're trying to make.  No one here is talking about it connecting to the street.  OP said it's been placed over into his property.  Give it up with your irrelevant ramblings.",
            "Maps are entirely unnecessary in easements barring any specific local requirement.  They are \"nice to haves\" but not a requirement for effectiveness.  A legal description is required. Recording is required to establish notice to any would be bona fide purchaser but it is not required for an easement to be effective.  In OP's case, for example, OP would have taken the property subject to an easement only if the easement was recorded or OP knew or should have known of it's existence (think a paved road running through OP's property, OP would know or should know an easement likely exists).  If the easement was not recorded and OP had no reason to know of it's existence, then he would be able to argue it is no longer enforceable..",
            "Not arguing anything.\n\nI am just saying that they build on someone else’s land and their are like 4 ways to deal with it.\n\nThe fuck you don’t understand?",
            "Assuming he read all the details and the developer didn't put easements in that he didn't pay attention to.",
            "It’s not hard to see the point here unless you’re invested in missing it. \n\nOP *thinks* the driveway is on his property. IF that is true, then it would need to be addressed. But this thread is about locating that pin and /u/quesohusker correctly observed that driveways are often placed touching the corner of the property, even commonly serving multiple adjacent properties, both with and without easements. Sometimes that is because it is necessary for access, in which case there would be a recorded easement, and sometimes it’s because developers pour one driveway across two properties because it is both cheaper and helps with impervious surface area requirements.\n\nYou claimed that there is generally a setback requirement. That is INCORRECT. Now you’re trying to move the goalposts and pretend that a “setback” of 0 means something useful to the discussion. \n\nThe only one being ridiculous here is you. Sounds like you could use a nap.",
            ">Not arguing anything.\n\nYou're arguing everything.\n\n>The fuck you don’t understand?\n\nWhy you are all over the place.  I really don't care.  Take care.",
            "Stop arguing.  It's ridiculous.",
            "It's hard to see the point in why you're arguing with a stranger that the driveway isn't encroaching.  You're an idiot. You keep bringing up nonsense that has nothing to do with this post.",
            "Great next time you don’t care just shut up.\n\nWierdo.",
            "Who said the driveway is or is not encroaching? It’s irrelevant to your false claim about setbacks.  \n\nBut by all means, feel free to continue your rage stroke."
        ]
    },
    "Seller hasnt turned on Gas twice when asked for during option period, what should we do?": {
        "title": "Seller hasnt turned on Gas twice when asked for during option period, what should we do?",
        "score": 84,
        "url": "https://www.reddit.com/r/RealEstate/comments/1dlgf69/seller_hasnt_turned_on_gas_twice_when_asked_for/",
        "content": "First time home buyer and we found a home we like.\n\nWe are under option until Monday. We had an inspector out Wednesday and they said they would turn on gas and utilities for the inspection, Gas was not on could not test hot water or water heater.\n\nTalked to them and we had a plumber coming out today and they said they would turn it on for the plumber today to check. Plumber comes out no gas on again.\n\nOur Agent contacted them and they said they could not turn on the gas because the HVAC was not up to code and the city wanted to charge them $300 to do so. We knew HVAC was old and got concessions to replace it.\n\nWe are now 2/3 days from our option ending and we have yet to be able to inspect the gas, hot water pipes and hot water heater. How worried should we be?\n\nIts a 30 year old home that was a rental but is now being sold.\n\nProperty is in South Texas\n\n",
        "num_comments": 105,
        "comments": [
            "so plan on hvac & water heater needing replace, but since he won't turn on can get EM back at least",
            "I think I’d just send them a ridiculous concession package for anything you couldn’t inspect.  I sure wouldn’t risk finding those problems after closing. ",
            "Realtor here.\n\nHUGE red flag. You have no idea if what they are saying is true.  You could be in for thousands of repair.\n\nIf you love the house have your Realtor submit the inspection form and request that the HVAC be brought up to code and inspected AT SELLER’s cost, and that Inspection Period remains open until such time as this is done.\n\nOr be prepared to walk.",
            "Only one way to get their attention: tell them you’ll be terminating if they don’t pony up and turn on the gas so you can properly inspect. Also ask for an extension.",
            "This would be a pretty big red flag to me. Rental property so they could be unaware of issues, or claim they were with plausible deniability.\n\nWith the timeline for your inspection period closing on Monday, they will probably try to stall you until you're SOL (it sounds like they've already been doing this). I suggest you immediately ask for an extension of your inspection period to get this sorted out. If they don't get back to you before Sunday on that, terminate while you still can. You're at a lot of risk with very little leverage otherwise.\n\nAssuming they agree to the extension, next step is to give them a choice. Work out what you think the absolute worst case could be for everything you're unable to inspect. Then add a buffer on top of that, and ask for that amount in concessions. Their alternative is to pony up and make it possible for you to do your inspections, which is what they should do. $300 is nothing for a home sale, either they are hiding something or they'll cave and pay it.",
            "This sounds like something that would terminate your offer since they are unable to provide proof of functioning HVAC",
            "I would walk they could be hiding a million things that or ask for 60k in concessions for the million things that may or may not be wrong since you can’t check. For all you know there could be a slab leak in the hot water line.",
            "Hold money from seller in escrow after close until you can confirm HVAC and WH are functional.",
            "I'd recommend calling the City Code Enforcement department to see what they have to say regarding the property.",
            "Also consider that if you buy the house you’ll have the same code issue with the gas company that the sellers are having. \n\nDon’t assume they are telling you the truth on why the gas can’t easily be turned on, either.",
            "I’d say to them that you want a concession that covers the full cost of all the items you can’t check with assumption they are all bad, or they can pay $300 to turn the gas on, otherwise I’d walk away. They could easily be making excuses to hide a larger problem and you don’t wanna get dragged into it.",
            "Well, then make them go ahead and budget for a new water heater. That’s the easiest thing if they don’t want to turn the gas on did your inspector say how old the water heater was?",
            "We forgot to ask the sellers to gas the gas on when we had an inspection, because we didn’t even know it was off. HVAC didn’t work at all, we found out a week after close. $30,000 to replace because the unit was no longer manufactured, couldn’t be repaired, and they’d have to rip out the roof or the ceiling to put a new one in. The agent couldn’t care less.",
            "Reduce offer by $2K to cover water heater replacement.",
            "Gas line replacement for a very small house in Florida is $2,500.",
            "Nope, move on.",
            "It could be the HVAC. If gas was off long enough gas company could require a pressure test to ensure there is no leak. You could be on the hook for a fuckload of repairs. Leaking pipes, bad water heater, bad furnace. Who knows what else. Set aside 3k + cost of water heater + cost of furnace at minimum.",
            "If you are taking a mortgage out on it, its not considered habitable in Texas and probably doesn't qualify for a mortgage. Id be very worried. Id negotiate to extend the option period and have the sellers get the gas back on. $300 is a joke fee compared to 100k. If the seller isn't willing to pay it, what else are they hiding? ",
            "Gas water heater and furnace, check. What about the stove and dryer, are they gas? Are there gas hookups outside for barbeque.\n\nIs the gas actually turned off because of a leak and not the HVAC? This is all kind of fishy. \n\nHow much of a concession on the HVAC? $15,000-30,000 I hope. Depending on the State, HVAC is going up like crazy. I'm hearing another 25-35% in California due to new regulations (of course, that is from a guy that wants to replace my HVAC).",
            "If I were buying this property it would be worth giving $300 to the seller to get the gas turned on to find out what’s going on. If there’s a big problem with the property I would consider it money well spent to have avoided buying a disaster of a house. My guess is that they won’t accept the offer anyway because they are hiding something.",
            "What does your contract say? Typically the seller is obligated to have all utilities on through inspections. If they dont, they’d typically be in breach of contract. Read your contract and talk to your agent or their broker asap",
            "Run, you’re obviously very young and inexperienced. Lots of good advice here. Don’t rush into it.",
            "Why the hell is the gas turned off in the first place? I’d run from that deal asap. Sounds like you are dealing with criminals.",
            "watch out. gas lines have to hold pressure and if it is turned off, it must pass the pressure test to be turned back on. I bet it won't pass the test so if you  buy the house, you may have to fix the gas lines to reconnect.",
            "Talk to your broker.",
            "I smell something fishy there are a cutoff point. Between the AC unit and the water tank at least a company that cares would do. There is no reason they could\nNot turn on one unless we are talking about a gas leak then I can see why they don’t want it on.",
            "Huge red flag. Might be trying to hide a leak or a broken furnace",
            "Something is wrong here.  HVAC is not gas, there's no reason the city would tell them they can't turn on the gas due to HVAC being out of code.\n\nTry calling the city inspector and see what they say.  Dollars to donuts, they're lying.\n\nMy daughter put a deposit on a complex of shops in the country, the owner wouldn't let them turn on the water because the buildings were \"winterized,\" in JUNE, turned out much of the copper piping had been stripped and there's a huge leak under the parking lot so the town won't allow them to turn on the water, there is no water service.\n\nSo -- get your attorney involved, tell them you need an extension to verify there is working gas service, that you will not go forward without it.  Ask for a credit for the water heater.  This is BS. \n\nPS -- I'm a realtor.",
            "It seems to me that the seller is hiding something and I would definitely not move forward until the situation was resolved.",
            "They probably have unpaid bills and utilities won’t turn on till those bills have been satisfied",
            "Walk away.",
            "This house sounds like a mess. The seller, too.  \nI'd just let the offer lapse and move on.\n\nI'll buy a house, but I won't buy trouble.",
            "Push back closing for gas inspection",
            "If they can't turn the gas on that means the meter has been pulled. They won't be able to get it turned back on without doing all the repairs and getting a pressure test. Clearly they don't want to spend the money, so walk away.",
            "Its the HVAC that needs replaced, not the hot water heater. Thats a heck of alot more than $2k.",
            "Where I'm at, if an appliance is installed in the house, everything must be up to code and fully operational before the gas company will resume service.  \n\nBut most of the time they'll find the leaks for you even though it's not part of their job.  \n\nThe easiest way to figure this situation out is to hire an HVAC company to come out and test the pressure on the lines to isolate the leaks.",
            "This is the perfect response. And expect to back out due to their failure to accommodate....",
            "We are asking them to turn on the gas and give us an extension to inspect. \n\nIf they are not willing to budge we are going to walk.\n\nWe knew the HVAC was old and got the price down because of that.",
            "I would do this and  make sure permits are signed and finalized by city before closing.",
            "Great reply.  Tell them you are replacing all uninspectable systems, home heater, water heater, and any non test plumbing.  Guessing at much of this, but I would think $30,000 should cover it.  You want the discount on the sales price.  That's the only way to continue.",
            "I think you could go further legally. This inaction bumps against bad faith performance.  IANAL. ",
            "We are asking for an extension.",
            "Unaware of problems is one thing.  But they knew the gas wasn't on before the plumber showed up.",
            "We are asking for them to turn on the gas and an extension for us to inspect and test.\n\nIf they are not willing to turn on the gas or give an extension we are walking",
            "Weve got concessions to replace the HVAC, not worried about that. \n\nMore worried about water heater, hot water pipes, and gas lines",
            "Water heater is in the attic so that shouldn’t be an issue, but do want to make sure water heater works and no leaks in the lines",
            "HVAC is not up to code and apparently it will cost them $300 to get a part to bring it up to code. \n\nFrom what i understand, my gf told me that our agent told her that they could not turn on the gas till that was taken care of. They didnt want to pay $300 for that knowing we are going to replace the HVAC.\n\nNot sure if the city wont turn on the gas because of that or if the seller wont. Not sure why they didnt mention that after the inspection when we were told utilities would be on to test. Why didnt they mention that to us before we had our plumber schedule to come test the pipes?",
            "This, but bigger: write up an agreement to hold $10k or $15k aside in escrow to be used to for repairs, permits, etc., (all work to be overseen/approved by you, the buyer), until HVAC and water heater are inspected, replaced, gas is on and everything is working (and not leaking).\n\nThis way the price stays where it is (makes the paperwork a LOT simpler), but money is held for this work until you're satisfied.",
            "That isn’t a thing you can do",
            "Will the city share information on a property you don’t own?",
            "Great idea. I wonder if it was an emergency shut off. ",
            "4 years",
            "Realtor here.\n\nVery bad idea unless you are paying cash.\n\nAlso thats fine for  cosmetic but not for a major system.  The gas company could need to dig to repair/replace lines it cost $10k or more.",
            "Water heater is only 4 years old, in south Texas not sure the house has a furnace. No fireplace for gas lines.",
            "Seller should pay that. ",
            "How has been vacant since October, figure they winterized it by turning stuff off.",
            "since there's a cutoff (or should be at least lol) just before both of those there's no reason couldn't have one on and other off ...",
            "If they won't let you test the water, you need to budget for it being replaced.",
            "They have concession money and plans to replace the HVAC, so I don’t think the HVAC is their concern. It’s the rest of the stuff that the gas is needed for.",
            "This could be anything from a leaky $20 valve, to needing to replace all the gas lines. You should be able to get the system pressure tested for leaks without having to turn it on. ",
            "Single family home stand alone home of average size that is only 30 years old (that’s modern) that 30k is probably 5-10x the actual anticipated costs of a really nice new hot water heater, plumbing and gas lines.  It’s a negotiation point.",
            "What would you hope to gain? If the seller is being uncooperative then you walk and get earnest money back and then you're whole again.",
            "\"either you give us an extension AND turn on utilities at YOUR cost so they can be properly tested, as you indicated they would be when we last agreed ... OR agree to the following concessions /variations that include the full cost of replacement for ANYTHING we can't test/ verify.\"\n\n\"if the seller is dealing with us in good faith then surely none of this will be an issue...\"",
            "Yep same thing. Seems like the price needs to go down more to cover the cost of gas line replacements",
            "Have you tried calling the city and asking them what’s going on?",
            "Ahh okay I purchased a few months ago and the seller hid a slab leak they painted over expansion material between the slab and stem to hide the evidence. Thankfully the location of the leak and the fact I have a solid friend that was a plumber made it less of an issue and he rerouted the pipe through the attic for me",
            "Fuck em. Pony up $300 or they pay to replace whole water heater",
            "You're being lied to. No one is jeopardizing sale over a $300 part. It goes way beyond.",
            "Plumber should be able to pressure test that, did they say why they couldnt?",
            "Seems like a reasonable response as to why they can’t turn on the gas. They likely didn’t know the city had locked due to code violations. \n\nBeing that the water heater is only 4 years old, it’s likely in working condition…however this property seems to have other issues involved. \n\nIf the city was involved in this, was the property condemned? \n\nI hope you understand the significant costs around bringing a property back to code. You’ll need to hire professional contractors, pull permits and have the city inspector out after each item is brought back to code. \n\nSellers get out of these properties so they don’t need to invest more into it. They’ve made their money off the rental.",
            "I have done it lol",
            "Lol what",
            "Most likely yes. You may even be able to look it up online. If it's a small agency, walk in the front door and talk to them. They often love to talk to people that need their help. They may not tell you everything, though, so remain vigilant.",
            "Four years is not overly concerning typically they’re worth at least 10",
            "Realtor as well. I agree with you! $2k less on the offer would be less than $10 per month difference on the mortgage. \n\nOthers have said the sentiment I share. Get an extension and let them know if they don’t have the gas and water on by X date you will be terminating the contract, and if I were your realtor I would advise you to follow through with termination. Like u/rasperries-are-evil said, if there are defects it could cost you a lot of money.",
            "Agreed. But they appear to be unwilling to. The point of my comment was that I would be willing to pay the relatively minor cost vs the price of the house if the alternatives were to lose the deal or to go ahead with the purchase without being able to conduct the tests.",
            "Yes, but sometimes fire department or gas utility will cut off/lock gas meter if a plumber/HVAC tech red tag a piece of equipment because they know regular people can turn on the little valves at each piece of equipment. It depends on the regulations in the locality.",
            "You seemed to have missed the part where it’s not just the hot water heater it’s the entire HCVC system.",
            "Any rough idea how much it costs to replace/repair gas lines? I will also google it haha",
            "Would the city release information on a house we don’t own?",
            "We had a plumber come do a hydrostatic test and it passed",
            "Frist time home buyer so do not know the expense to bring things up to code.\n\nElectrical needs to be brought up to code and the HVAC needs to be replaced, Has some rotted siding that also needs to be replaced.\n\nWe knew about the HVAC and budgeted for that. Got some quotes for siding that we can handle, but concerned if maybe we are under estimating the cost to repair/replace all of these things.\n\nIts an older home so not expecting it to be perfect, but want it to be safe",
            "Absolutely unreasonable. Hundreds of thousands if dollars being held up by $300? UNACCEPTABLE!",
            "Agree there, I guess my concern is about the gas lines, hot water pipes.\n\nWhy not tell us about the $300 before the first inspection or before the plumber came by?   \n  \nI dk if im being too negative but feels like they hid it from us.",
            "Fair point. I think sellers willing to lose a sale over $300 is insane. They are playing a bluffing game and their own realtor needs to snap them out of it. ",
            "The HVAC, as is clearly stated, was already an issue they knew about and was being handled by them Seperately.",
            "Whatever price you see, quadruple it.\n\neg if Google says 2-5k, you include concessions for 20k (4x upper limit) in case there are \"unforeseen works required\".\n\nSo either they cave and you can check it properly and go from there, or noone agrees to anything and you can walk away.",
            "The entire run? $2-5k",
            "Worth a shot!  Explain to the them your in the process of purchasing a house, what you were told, and that you wanted to reach out to get a handle on what that means for you moving forward so you know what to anticipate!",
            "That’s for sewer but that’s good. Some houses have there water lines under the slab it’s the stupidest shit but it’s common in anything from the mid 2000 and prior",
            "I would walk",
            "Electric will be tens of thousands",
            "Electrical is extremely expensive! This can get upwards of $70k+ very quickly. If it’s out of code, this is a serious issue. \n\nYou need to get experts inside to inspect and give bids. \n\nHonestly, if you’re a first time home buyer and do not have hands in knowledge and/or $100k to bring this up to code, I would be talking to your realtor on possible outs of your contract. \n\nLook, I totally get that this place was probably within your budget and this is why you chose it, but this home is going to need much more work than you anticipated. \n\nYou won’t be able to live in the home until things are brought up to code. You won’t be able to have utilities turned on until it’s inspected by the city. \n\nI’ve worked with plenty of first time home buyers who were looking for a good deal and Wi  the in budget. Sometimes you need to be very patient. Look for homes that need more cosmetic work, this requires a great imagination! But stay clear of properties that need electrical or plumbing unless you have a background in this type of work. \n\nSo, look for homes built 1950-2000, that are outdated, has paneling walls, old cupboards. Needs wallpaper removed, new floors etc. stay clear of major repairs like this one. \n\nAs far as getting out of your contract now…\n\nHow much ED did you put down?\n\nDo you have any contingencies?  (Inspection, mortgage, etc) \n\nIt is very likely, a lender will not approve this property as is…so a mortgage contingency can be your out.",
            "Walk my guy. This is a lot of work for a house you won’t be able to live in until it’s up to code. I know it seems like it’s in your budget for the price but it’s not worth it. You won’t be able to close anyways without certificate of occupancy anyways.",
            "30 year old home is a very new home.  Old homes are 100+ years old and have interesting basements/crawl spaces around here (and no AC - that was introduced much more recently than 100 years ago)",
            "Duuuuude what are you doing!?",
            "It isn’t just $300, it needs repair and re-inspection….its out of code.",
            "They did because they are actually hiding something else from you.",
            "I mean, you can run water through the pipes without the water heater being on gas line part could be a little concerning not major once they turn it on check the couplers with a little soapy water and make sure nothings leaking, but I would be willing to bet your house payment that you won’t find I’m not actually gonna do that though",
            "We are in option period so can walk away",
            "In addition, I highly recommend finding a realtor that will be advising you on the right property and can be on the spot when one comes available (meaning, getting you in the door within hours of listing)!",
            "Learning how to buy a home.\n\nWe are new to this.",
            "Yup. $300 is nothing.\n\nIf I was selling, I'd pay $300 myself just to get the deal done. \n\nThe only reason they're not is: *They don't want all of the other problems revealed if the gas is turned on.*",
            "Walk away. I rolled that dice once. It took ten years to financially recover.",
            "Okay, that’s good. I would definitely do more research and yes, even walk away. Might not be worth hiring the contractors to come out for inspections and bids."
        ]
    },
    "Buyers had terrible realtor": {
        "title": "Buyers had terrible realtor",
        "score": 9,
        "url": "https://www.reddit.com/r/RealEstate/comments/1dls1rl/buyers_had_terrible_realtor/",
        "content": "Just a fun little story from when we sold our house. \n\nWe had a realtor no show for a showing, which was quite annoying since we had to vacate the house with a toddler, dog, and cat. Apparently the agent thought the house was vacant and she could just go whenever?? So five hours later she asks if she can come, we don’t need to leave as the buyers aren’t with her. Sure, whatever. Apparently the buyers had seen the house from the outside (???) and she was doing a video tour to show them the inside. I’m in FL and they’re in Cape Cod. \n\nWe did have a couple show up and knock on our door so I asked the agent if it was them…. She didn’t even know!! I was shocked. But anyways, she does the video. She loved our little house. Great. I was stunned at how unprofessional she was. Reeked of cigarette smoke and just her entire presentation, but I guess she wasn’t meeting with her clients that might be why. \n\nBuyers put in an offer at list price. We’re thrilled. Inspection happens, a few things come up, nothing major but definitely things here and there. Inspection period passes without a word from their realtor, they didn’t ask for anything. Again, we were thrilled! \n\nThe day before our closing, their agent reaches out to our broker asking if we ever got anything on the inspection report fixed….. broker responds uh no, you didn’t ask for anything to be fixed. Like what??? \n\nThen, closing day comes. We were buying a new house as well and using the same law firm for the closing. Met the buyers in the lobby, lovely people. The agent asks me, right in front of them, if the spa area of the pool and pool heater works (it said right on the listing that the pool is not heated, didn’t work the entire time we lived there) so I said no I don’t think it does, it didn’t work the whole time we lived there. But then I tried to deflect and say that we don’t like heating the pool anyways because if you need it heated then the air is too cold to enjoy swimming. Idk, I was just mortified she was asking this in front of her clients and scared they would walk.\n\nWhen I told my agent and broker that story, they couldn’t believe it. It was just such a sharp contrast compared to my team, who are so professional, knowledgeable, and the best in the town. \n\nIn the end everything went through great. Worked out well for us that their agent dropped the ball since we didn’t have to make any concessions or repairs, but I do hope they’re happy in the house, it will be a winter home for them. ",
        "num_comments": 6,
        "comments": [
            "Wow! Incompetence in action. I’m glad it worked out so well 😊",
            "We bought from a neighbor and they had a pretty slimy, idiot agent. \nIn all honesty, if we had known the details of their house before they listed, we would have tried to do an off market sale but we didn’t. We were the nosy neighbors at the Open House and ended up loving it.\nSo we made an offer above asking and included a letter because we were friendly with them. We call our close friend/agent who has represented us in other deals, she sends the offer literally hours after the Open House, and we don’t hear anything for DAYS. By this point, I had talked myself out of it and hoped the new neighbors would be nice. Then, my agent calls. Their agent wants a rent back and an appraisal clause. I’m like we can discuss a rent back but no won’t do an appraisal clause. No response. Again, thinking house is gone. Surprise surprise she comes back that we got it! \nNeighbor comes over for something unrelated, but I’m like hey while you’re here, here’s your earnest money, start chatting about inspections/timeline/etc. He shows us the house they’re buying, all cordial. (Again we got along well so if they hadn’t already listed with her we would have had zero issues doing an off market deal). I said I was surprised how long it took to hear back and assumed they just didn’t want to hurt our feelings. He’s like oh no let me tell you- we accepted day 1 but she was emailing the contracts to the wrong email address! I’m like oh so what about the rent back and appraisal clause? He’s like what? So apparently they had verbally accepted our offer but she was (1) trying to sweeten the deal for them (or her commission?) and (2) sending the info to the wrong email so nobody had any idea what was going on. \nThroughout the process, my agent had to explain multiple different very normal things to this woman, who is a prominent agent in our area!! Then, she didn’t even show up for the closing. Now when I see her signs places I just roll my eyes.",
            "Ouch! Glad it worked out!",
            "Thanks! Us too 😅",
            "Oh my gosh! What an idiot. Isn’t it amazing how people like that are successful?",
            "Thank you 😊"
        ]
    }
}