{
    "Courts Rule US Government Above the Law. Judge declined to hold the CIA in contempt for destroying videos that it had been ordered by the courts to preserve.": {
        "title": "Courts Rule US Government Above the Law. Judge declined to hold the CIA in contempt for destroying videos that it had been ordered by the courts to preserve.",
        "score": 3669,
        "url": "http://tv.globalresearch.ca/2011/10/courts-rule-us-government-above-law",
        "content": "",
        "num_comments": 442,
        "comments": [
            "Here's the judge's decision via Wired: [ACLU v. Dept. of Defense (S.D. N.Y. Oct. 5, 2011)](http://www.wired.com/images_blogs/threatlevel/2011/10/cianocontempt.pdf). One particularly intriguing/appalling excerpt regarding the destruction of the tapes:\n\n\n\"The email suggests that the CIA's General Counsel, John Rizzo, had not received advance notice of the videotapes' destruction: \"Rizzo found out today this had occurred as [sic] was upset - apparently because he had not been consulted - not sure if there was another reason. He raised at DO update but was 'calmed' (only slightly) when told [redacted] had approved.\" ld. **The email explains that, later in the day, Jose Rodriguez had approached CIA Director Porter Goss, the email's sender, and someone else whose identity also was redacted, to explain[] that he [Jose] felt it was extremely important to destroy the tapes.\" Id. Rodriguez allegedly said \"that if there was any heat he would take it,\" at which Goss purportedly \"laughed and said that actually, it would be he, [Goss], who would take the heat,\" but Goss said that he \"agreed with the decision\" nonetheless. Id. Rodriguez then allegedly said that \"heat from destroying is nothing compared to what it would be if the tapes ever got into public domain - be said that out of context, they would make us look terrible; it would be 'devastating' to us,\" a sentiment with which \"[a]ll in the room agreed.\"** Id\"",
            "Stick a fork in it, this Government is done. ",
            "well if the CIA can deal coke and heroin and kill people at will, who are the courts to say anything?",
            "Here's a [less crazy source](http://www.wired.com/threatlevel/2011/10/cia-dodges-contempt/). It would seem that producing the tapes is moot since the CIA admitted that they were videos of waterboarding.",
            "Obviously the videos were so horrific that the CIA decided it would be better to take the hit for destroying the evidence rather than let people actually see what was recorded.\n\n... and they got away with it.\n\nI've seen the future and that's why my wife and I skipped having kids.",
            "Government is a sham....we are being ruled by a plutocracy....",
            "It's like reddit commentators live in another world. One in which cliche and absolutism are apparently common place.",
            "The CIA hasn't been a part of the US government for a good while now.  Sure, there's a tiny little fraction of the organization that still has government oversight, but MOST of the organization is an international crime syndicate which uses the grey areas of international law to murder and steal.  We found this out when Oliver North was put on trial and his superiors testified in Congress in the 80s.  It's on YouTube, you can watch the dudes lay it all out.  They maintain their own army, navy, and air force.  They deal drugs and arms to raise money for their operations.  And it is entirely a 'black' organization, with absolutely no legal oversight whatsoever.\n\nThe worst thing about it is that the US government is too afraid to come out and excommunicate the CIA, shut down the tiny piece still attached to the government, and help hunt down and kill all of the CIA agents around the world breaking international law on a daily basis.  Most of what they do is secret, but we know enough to make one thing conclusively clear - they are the single most widespread and active enemy of democracy on the planet.  They rigged the elections in Afghanistan so poorly that the whole thing had to be thrown out, just so they could get Karzai in there so they could manipulate him through his brother, and retain control over the opium trade.  They rigged elections in Iraq.  They rigged elections in Haiti.  They kill candidates they don't think will serve US interests.  Killing everyone so that every nation in the world ends up with a pro-US leader is NOT democracy.  It is the most cynical rejection of democracy.  It is saying 'we know democracy can never work.  We know democracy is a joke.  The only way to get ahead is stomping on babies and robbing the innocent.\n\nThe real sick part is that most of the public inherently agrees.  They think the idea of a government controlled by the general public is patently insane.  They think everyone is so stupid that it would be guaranteed to collapse into utter chaos, and thinking it could work is a ridiculously naive pipe dream.  They think it's all a nice illusion that is only maintained by men in the shadows \"making the hard choices\" and feeding puppies into paper shredders to make the illusion of civility possible.  These are some of the most dangerous views in the world today.\n\nOh, and the CIA admitted a few years ago that all of Vietnam was their fault.  They wanted America to go to war in Vietnam, so they made up the Gulf of Tonkin incident, lied about it to the world, and tricked the politicians into going to war.  This is supposed to be a fucking intelligence agency, providing information to politicians.  Instead, they manipulate politicians like some kind of psychotic James Bond villains.",
            "Serious question: How would one hold a government agency in contempt?  What would the consequences be?",
            "Someone on Omegle asked me this morning.\n\n\"HOW ARE YOU AMERICANS NOT OUT RIOTING IN YOUR STREETS?!?!\"\n\nI don't have an answer, do you?",
            "I really miss r/reddit.com  :( ",
            "Posting on a historic thread before it gets archived.\n\n\nRIP /r/reddit.com.",
            "The government has always been above the law.\n\nYou just noticed?",
            "CIA was always above the law.  They killed a US president and people still claim it was LHO",
            "/r/reddit.com was the best.. RIP lil buddy",
            "Damn people. Did any of you actually read the court opinion? Before you form an opinion, you should at least understand the concepts at hand.\n\n**Holding** \"CIA voluntarily has adopted and\nimplemented new protocols to avoid the improper destruction of documents in the future; and\nthat, as a result, plaintiffs already have achieved substantially complete remedial relief.\"\n\n**Legal Rule** The court may hold a party in civil contempt for failure to comply with an order if the court's order \"'is clear and unambiguous,'\" proof of the party's failure to comply '''is clear and convincing,'\" and the party \"'has not diligently attempted to comply in a reasonable manner. \", Paramedics Electromedicina Comef':ial. Ltda. v. GE Med. Sys. Info. Techs .. Inc., 369 F.3d 645, 655 (2d Cir. 2004) (quoting King v. Allied Vision, Ltd., 65 F.3d 1051, 1058 (2d Cir. 1995». Proof ofwillful noncompliance is not required. McComb v. Jacksonville Paper Co., 336\nU.S. 187, 191 (1949); Donovan v. Sovereign Sec .. Ltd., 726 F.2d 55, 59 (2d Cir. 1984).\n\n**Relevant Facts** The evidence suggests that the individuals responsible for processing and responding to plaintiffs' FOIA requests may not have been aware of the videotapes' existence before they were destroyed. Dec!. of Constance E. Rea, Am. Civil Liberties Union v. Dep't of Def., No. 04 Civ. 4151 (Doc. No. 271 'U~ 12-14) (S.D.N.Y. Jan. 10,2008). Apparently, the videotapes were retained in the field, without physically having been transferred to the OIG and without otherwise having been sent to headquarters. Id.; see also Dec!. ofAlicia L. Bannon, Am. Civil Liberties Union v. Dep't ofDef., No. 04 Civ. 4151 (Doc. No. 450, Exs. 41-42) (S.D.N.Y. Feb. 15, 2011). Nor can I say that the individuals who destroyed, or who approved the destruction, of the videotapes, were aware of court orders requiring identification or production of the videotapes. However, the lapses ofindividuals cannot excuse the failures of the Agency. The CIA, qua agency, had the obligation to identify or produce the videotapes, and the CIA cannot be excused in its dereliction because of particular individuals' lapses.\n\n**Basics of the decision** It is true that the interrogation videotapes, having been destroyed nearly six years ago, cannot now be produced. But the CIA has remedied that failure by a massive production of paragraph 3 and paragraph 4 documents-records that deseribe the contents ofthe videotapes, corresponding in time to their creation, and records that relate to the videotapes' destruction, in particular, the persons and reasons behind the destruction, corresponding in time to both the videotapes' creation and destruction. Plaintiffs have had a full and fair opportunity to litigate whether those records, or any of them, are exempt from disclosure under FOIA Exemption I or 3 or must be produced.\n\n**Summary** \"The measure ofthe court's power in civil contempt proceedings is determined by the requirements offull remedial relief.\" McComb, 336 U.S. at 193. Because plaintiffs already have achieved substantial remedial relief and would be entitled to no further relief if I were to find the CIA in civil contempt, I deny plaintiffs' motion to hold the CIA in contempt.\n\nAlso, I would like to add this case is being appealed. I am sorry, but I fail to see how this decision makes *\"US government above the law\"*\n\nMy personal opinion? I don't totally agree with the court, but I see how it came to its conclusion. Not sure whether the appellate court will uphold or reverse, but I'm leaning toward the opinion being upheld. My problem is with these incredibly annoying sensationalist titles. I mean \"Court rule US Government above law\"? Really? I didn't read anywhere in the opinion, nor was able to surmise, the federal judge making that ruling.",
            "So if you file a freedom of information act request for documents, and are refused, and you take it to court, and the court rules that your denial is justified, what other recourse can you take? This seems like utter bullshit.",
            "How is this anything new?  Reagan sold weapons to Iran and used the money to fund anti-democratic terrorists in south america and instead of executing him for treason, all of the people that supposedly want to limit government's power love him.",
            "Judge:\n\"You hold onto this evidence that incriminates you, it would be a shame if something were to happen to it.\"\n\nCIA:\nSee you later, sucker....",
            "A judge declining to hold someone in contempt does not mean that courts have ruled that the US Government is above the law. ",
            "How would you like your Constitution, burnt or extra burnt?",
            "At the risk of sounding cliche, Fuck. Everything. About. This.",
            "[Judge Alvin Hellerstein (pictured) yesterday declined to find the CIA in contempt for destroying videotapes of its interrogations of Sept. 11 detainees, concluding that it would serve no beneficial purpose to penalize the agency, according to this AP report.\nHellerstein also noted in his ruling that the CIA has put in place new procedures to prevent such destruction from happening again.](http://blogs.wsj.com/law/2011/10/06/manhattan-judge-spares-the-cia/)",
            " You have to stop whatevr the fuck ur doing, get a pitchfork and go outside",
            "What's the point of a strict separation of powers if it's never maintained in practice?\nWhat's the point in having a written Constitution if this still happens? \nThis is really distressing news, US corruption has reached critical mass. There's no way back from this. Protests, petitions and democracy may fail, but when the Rule of Law is thrown out there is no nation left to speak of.",
            "I keep coming to this subreddit forgetting it's shut down :(",
            "Did you guys miss this part:\n> ...the Obama Justice Department had already decided last year that no criminal charges would be filed for this blatant obstruction of justice...\n\nThat's your Obama Administration.  I say this not as a Republican (I'm not) nor as an anti-Obama guy.  This is about every section of government ensuring itself (and other state agencies) are never held accountable.  Courts, Cops, Congress...every hand working together to slap you and protect themselves.  They continue the work started decades ago to empower and grow the state and move away from a powerful and free civilian population.  I think it's for the children or something.\n\nMake sure you know who the real enemies are or you'll end up putting one in charge...again.",
            "and who's to blame for letting this slip by and be forgotten in a week or two? We are, unfortunately we have little power to do anything about it",
            "Sooo should I start cleaning my guns or what? Shit looks like it's about to go down.",
            "[Link to PDF of the ruling](http://www.wired.com/images_blogs/threatlevel/2011/10/cianocontempt.pdf)\n\nText: \n\nALVIN K. HELLERSTEIN, U.S.DJ.:\nOPINION AND ORDER DENYING MOTION TO HOLD DEFENDANT CENTRAL INTELLIGENCE AGENCY IN CIVIL CONTEMPT\n04 Civ. 4151 (AKH)\n•\nUSDCSDNY DOCL:ME!'IT ELECTRONICALLY FILED DOC#:\nDATE F1'-L-E-D-:-:'l~O-r,rl;;:_--'/,fTIJ-\nPlaintiffs in this long-running litigation under the Freedom of Information Act (\"FOIA\"), 5 U.S.C. § 552, move to hold defendant CIA in civil contempt, charging that the CIA violated my orders of September IS, 2004; February 2, 2005; and April 18, 2005, by failing to identifY or produce, in response to plaintiffs' FOIA requests and my repeated orders, videotapes depicting detainee interrogation sessions, including the use ofenhanced interrogation techniques.",
            "When a government breaks the law or laws, and then procedes to hold itself above and refuses to be accountable to those laws, those very same laws that it is sworn to uphold, justice has failed. The government has failed. The rule of law and justice has has become a joke. Occupy Capitol Hill. I am the %99.",
            "It's shit like this US Government...",
            "The government has always been above the law. Some people notice, majority of the people don't. Sometimes I wonder, if the majority did realize it would there be riots on the streets?",
            " > Courts Rule US Government Above the Law.\n\nIt isn't news, right? We know it long time ago.",
            "This is the last straw, folks. We're toast. It's been great redditing with you guys. I'm renewing my passport and saving up for a plane ticket. Hopefully I can get out in time. ",
            "I CAN STILL COMMENT ON THIS YEAH!!!!\n\nTHANK  YOU FOR THE GOOD DAYS R/REDDIT.COM I'LL MISS YOU!!",
            "I'm out, moving to Canada immediately after college\n",
            "I miss this subreddit too. Hopefully they'll bring it back one day. But until then, I've created [r/rcom](http://www.reddit.com/r/rcom) as a temporary space where people can post what they would to r/reddit.com, if you're interested! :)",
            "I AM THE LAW.",
            "Americans let their government bomb, kill, kidnap and torture in the name of security for Americans.. we have seen how depraved they can be.. its only a mater of time before Americans are subjugated with the same force and violence. \nKarma never forgets.",
            "Thank you, so many people don't seem to care or notice what a sham things have become. Didn't they used to at least attempt to be less blatant?\n",
            "[removed]",
            ">Now, the Obama White House is arguing that they don’t even have to show the justification for ordering the unconstitutional assassination of one of its own citizens.\n\n&#3232;\\_&#3232;\n",
            "666 downvotes on this post when I saw it!\n\nAlso, I think we need a revolution. Not a \"Ron Paul\" revolution where we just put some new dick in the bag of dicks we call government. But a full blown revolution in which we change the entire structure of our government. \n\nI know, this will probably never happen because America isn't a bad place to live at all. Most of us are pretty happy here and we'd rather not shake things up. But maybe we can do it slowly, a gradual revolution, one without bloodshed, one in which the people in charge recognize that the system is broken and that a new system is needed.\n\nThat new system is one that I have been envisioning for years, but that nobody takes seriously, nobody thinks it can work. But a revolution needs a goal. You can't just say \"stop being greedy you greedy bastards\" and expect anything to happen. We need to change the way our country works and the way it thinks as a whole. \n\nThe system of voting for people to 'represent' you is so obviously broken beyond repair that it is disgusting. We need to represent ourselves if we ever want to be represented fairly without getting buried under political bickering.\n\nThe only way The 99% can truly be represented in government is through a massively collaborative direct democracy. This is a form of government in which the people work together to write laws, formulate policies, and make collective decisions. We would use the Internet to connect with each other and we would use a common interface to scaffold our interactions in a way that promoted productivity and efficacy.\n\nBefore you reject this as 'crazy', 'impractical', or 'impossible' ... think about it deeper, compare it to the quality of the current government, remember it is human nature to reject the unknown. The 99% needs a game plan that goes beyond standing and sleeping in the street. This is my proposal. This is my dream for this country, and for this planet.",
            "uh, the judiciary is a branch of the u.s. government...",
            "If anyone actually read the facts of the case or the judge's opinion they'd realize this is not a good idea.  The CIA didn't think they had to turn over the videos and despite the jduges order this point was never decided legally.  They instead provided full and complete documentation of the contents of the videos which meet all the needs of the plaintiffs.  The videos were then destroyed without the counsel's knowledge or approval.\n\nWe know what was on the videos, and the judge is satisfied of this fact and satisfied that the plaintiffs have all the information they need about what was on the videos.\n",
            "There are different rules for implementing law, depending on who the plaintiffs and defendants are. Is it any wonder that courts get little respect. This is life under tyranny.",
            "There is only one way to take care of this. Too bad people will not follow through to do it.  \nSuck it up prince and princesses  \nThis is your life now.",
            "[I didn't break the law! I am the law!](http://www.youtube.com/watch?v=wvJiYrRcfQo)",
            "Every time I hear about some judge somewhere saying the gov't is, in some way or another, allowed to do something that in my mind violates the law or the Constitution, I think of the judge's line in [this scene](http://www.hulu.com/watch/4863/miracle-on-34th-street-postal-service-defense) from *Miracle on 34th Street.*\n\nCaution, Hulu link.",
            "Is there really nothing that \"WE the People\" can do to keep this type of shit from happening.",
            "[THEY DIDN'T BREAK THE LAW, THEY ARE THE LAW!](http://www.youtube.com/watch?v=wvJiYrRcfQo)",
            "Please let the armed revolution happen while im still in fighting shape.",
            "As if this sort of thing is at all new... The u.s. government has a history of doing shit like this as long as it is old. Case and point: Andrew Jackson. Enough said. (assuming you know your history that is...)",
            "Governments that stop being under the law *start* being ***under the AXE.***",
            "If the OWS really wants to get something done or create a situation in which the government is seen to the world in the same light as the Mubarak in Egypt they should go to DC and sit in the Mall until Congress repeals the Patriot Act, impeaches all DOJ, CIA, FBI, etc. appointees.  Congress is the voice of the people.  They just forgot that responsibility. ",
            "This is the kind of thing that has been happening for years, and has gotten a lot of people labeled as paranoid for even imagining that it could occur. Now we have proof, real proof, and the american populace is just sitting there. I guess a lot of the writers and theorists of the 30's-70's are spinning in their graves about now. ",
            "ftfy: Government rules that Government is above the law.\n\nin other news: When I first saw this post I originally thought it was an Onion article...",
            "So much for the rule of law",
            "> OMG, THIS COUNTRY IS SO FUCKED. Now let me get back to my netflix. \n\nThat's what you all sound like. If you care that much, get off the computer and go do something. ",
            "It's the assassination of American citizens by its own government w/o pressing charges, must less a conviction. This is against the very fabric of our Constitution. Destroying evidence is nothing new for the CIA, I'm sure. ",
            "This article seems to have an agenda and it is vague about when the tapes were destroyed.  As I recall the story (which is years old going back to the Bush administration) the tapes were destroyed BEFORE the court ordered the agency to not destroy tapes of interrogations.  I also recall that at the time, there was a lack of clarity about whether it was okay/legal to destroy the tapes.  The tapes no doubt contained some nasty stuff, and they were probably protecting CIA/Bush/Cheney people by destroying the tapes, but I don't believe that the tapes were destroyed in defiance of the court order.  Maybe I have this mixed up with another case, but I think that the article is playing fast and loose with the facts especially where it seems to blame Obama for something that pretty much happened on Bush's watch.",
            "The CIA is the strategic intelligence arm of the largest and most powerful criminal enterprise on planet Earth, does *anyone* really think that they can't force people to make the moves that are most beneficial to them?\n\nIf you think the country you live in is one of law and order, the days of bribes, threats, and organized crime are in the past, having died with light weights like Al Capone - then you are naive, uneducated, and misinformed. ",
            "Millions of years from now, Humanity will have been a blip in this universe's history.  A dull flash of hatred and greed, mercifully brief.  A footnote on a single page in a book miles high.\n\nI'm so tired of watching this species fail itself.  It's a losing game.  I honestly don't know why I get up in the mornings, get dressed and go to work.  I don't know why I keep going.\n\nIt's a losing game.\n\n",
            "The CIA is a person ! ",
            "I like this part:\n\nTRANSCRIPT AND SOURCES: \nhttp://www.corbettreport.com/?p=2855",
            "How to hold a company accountable: Stop paying them, they go out of business\n\nHow to hold the government accountable: Stop paying them, they throw you in jail, and don't care if they are working on a negative budget",
            "So who can I vote for to fix this kind of shit?",
            "Andrew Jackson rules the president is above the Supreme Court and its silly notions of judicial review. Will our country survive?",
            "If we make this the top post of all time I think it might get somewhere.",
            "lul\n",
            "There is no need that /r/reddit has to end like this. **Please visit [/r/eddit](http://www.reddit.com/r/eddit)** for an all-purpose subreddit.",
            "Haha you all just realized this. Get your head out your ass. ",
            "Fake headline.  That is not what the court ruled at all.",
            "And so it begins America.. and so it begins... time to wake up and realise your government owns you.",
            "Isn't this exactly what we tried to abolish with the revolution?",
            "\"Hey guys look, Jersey Shore is on!\"",
            "This is even worse than i had originally imagined, so the president has a list of targets for assassination that will at one point be killed, without having comitted a single crime, and no action will be taken to prevent it? This is not what was originally intended to be of the united states of america! The very citizens that fought to uphold it are now become targets of its own government, how can we (the people) just sit around and do nothing? As for myself,as well as others, seeing this occur, feel powerless; if our own government has grown powerful enough to commit actions such as these with no consequence, what hope can we have for the rest of the world if our own nation is made up to be the most liberal, what now?",
            "H\n",
            "It's called sovereign immunity and it is, has always been and always be a part of of our legal system.",
            "This was brought to you courtesy of the \"nutjobs\" at r/conspiracy.\n\nDear average redditor, if you have not subscribed yet on account of government sponsored prejudice, please do so now and join the debate.",
            "You guys know about sovereign immunity? Weve had it for a while, adapted from the British. In short the govt cant be prosecuted, and govt bodies are protected for sake of govt stability and national security.",
            "It's almost time.",
            "Aaas Nixon rolls over in his grave.",
            "wow.",
            "why is this still on the front page...its been there for a week...",
            "b",
            "someone is the law system got PAID BIG",
            "I didn't read this but it's cake day.\nHave some karma.",
            "J",
            "im gonna downvote this link. If a news agency can't use the correct words (insure/ensure) then i struggle to find them credible. ",
            "Keep obama in the white house, don't take a risk and actually vote for someone who wants to end shit like this\n\n(Ron Paul)",
            ">Although the Obama Justice Department had already decided...\n\nUh, Obama is the executive branch, not the judicial.\n\nEdit: As brovis pointed out below, the Justice Department is part of the Executive Branch.\n\nEdit Edit: Please stop downvoting, I corrected myself, plus TIL!",
            "Governments have always been above the law and that why they are called governments. Ultimately they get elected.\n\nOther generations in the US had the KKK, segregation, slavery even, broken treaties with the native american's , poor whites and indentured servitude of Irish & Scottish.\n\nLooking at things in the rear view historical mirror gives a very skewed view of things. You cant  compare things with the pony express era, railways and the coming of the automobile era. \n\nI am in the West but not in America but surely the concept is protecting citizens against people who are playing by nefarious  rules is very difficult for any jurist and law enforcement agency to tease out what rights should apply. That's the same everywhere.\n\nSo the concepts of good, fair and just get applied in that way only in Mr Hoopers Store on Sesame Street where as bad as it gets is the cookie monster. \n\nI like to think of myself as a good and reasonable person and I would not be able to work it out. \n\nTrying to apply these concepts to people who do not share your value system is always going to be fraught with problems and is not black or white. \n\nI don't know but each generation has had to address those concepts based on the situations they faced in the now. \n\nAnyway, I am somehow glad Mr Hooper isn't the one making the decision.\n\n\n\n\n",
            "above the law, above the government and devastating if the people found out.  that's enough for me.  i don't even need to know what's on the tape.\n\n",
            "Proof Americans are living in a Fascist state. Heil the CIA.",
            "This is so sad this is the last post on the front page...",
            "seriously, the executive branch is out of control and \"checks and balances\" are now only a part of our history",
            "Stick a fork in the Constitution.  It's done.\n\nThis Government won't be done until it's dragged kicking and screaming into the night.  That is what this ruling means.",
            "[removed]",
            "...I guess the republicans were right\n\nGovernment doesn't work...",
            "for some time now   http://www.thirdworldtraveler.com/NSA/CIA_Home_LS.html",
            "This kills the Government.",
            "I wonder how many other redditors know about the CIA's drug running under the cover of the Vietnam war. I have a copy of [this Frontline documentary](http://www.pbs.org/wgbh/pages/frontline/programs/info/613.html) on video tape somewhere. When Hillary says \"there is too much money in illegal drugs for it to end\" she means for the government. Also there was an [LA reporter that lost his life](http://articles.sfgate.com/2004-12-13/bay-area/17458185_1_executive-editor-jerry-ceppos-crack-cocaine-explosion-gary-webb) reporting on the LA crack epidemic caused by the CIA.",
            "True.  The CIA has always been (and will always be) an extralegal entity.  They answer only to internal procedures and command.\n\nEvery State has an entity like the CIA because \"laws are for thee, not for me.\"  ",
            "I'm not sure when in it's history the CIA has ever actually done anything legal. By it's very definition it has to break laws, be it here or around the world.",
            "Came here for this, thanks.  Still pretty fucked up, though.",
            "So then why destroy the tapes ? I mean, they really had to mean to since they were legally obliged not to.",
            "So was the CIA convicted of illegal activity or were they let off for good behaviour (honesty)?",
            "Was looking for the comment that gives a glimmer of hope in a world outlined by rash sensationalism. Here it is I guess.",
            "Of all the things I've seen and heard in the last 2 months, this is by far the most frightening. This cannot be the final resolution on this case, or we have abandoned everything that makes this country ours.",
            "Horrific or merely legally troublesome.  This could have been a calculation that the fallout from failing to follow the judges' orders would be less burdensome to the CIA than the fallout from the viewing of the torture.  It could be something as simple as visual evidence that a single CIA operative could be brought up on charges. It doesn't need to be bloody.\n\nAlso, there is evidence that this judge \"changed his mind\" since his was the original order to preserve and view the videos.  The CIA is never above a little mind-changing.  If they are responsible for his reversal then it's even less legal trouble for them.  And there is NO conspiracy that is beyond the CIA, only a lack of documentation.\n\nRegarding your last point, we decided to have a child because we can't allow the world to be overwhelmed by nothing but the broken and damaged and enslaved.  We can't give up on the future yet, and our daughter (who just turned 7) will help save this world if anyone will.",
            "We decided to have kids in hope they'll be a force for Good in the world.",
            "How can you see that which does not exist?",
            "Pssh.  I've been to stileproject.com",
            "Wow that was a bad idea. On average you would have had 2.5 kids... that's 2.5 more soldiers in the fight for liberty.",
            "a dwarf government",
            "That is an unamerican thing to say. According to the secret interpretation of the Patriot Act that makes you a terrorist. According to Obama and his lawyers that makes you eligible for execution without having to give you a trial or even accuse you. God bless America, the greatest country on Earth!",
            "The only people benefiting from government policies are the military industrial complex, corporations, banks, and the corporate elite. They clearly showed how much they cared about Americans when they bailed out the banks to a tune of 700 billion. Fast forward three years and the banksters are still doing the same old. Yet Americans and the people of this world still feel the effects of their actions. All the while there has been no accountability whatsoever on their part. I yearn for the day Americans and the rest of the world march on the streets and overhaul the system. In fact, that's starting already with OWS.",
            "Fascism! ",
            "IMO it's a group of people selected (by themselves I'm sure) to run the Continuity Of Government in case of emergency..  since 1980 as far as I can tell. ",
            "Plutocracy?  But Plutocracy isn't even a planet anymore!",
            ">Oh my god! Our government is run by criminals, whom are watched over by other criminals, whom are in turn employed by criminals!\n\n>This is why I laugh at them trying to outlaw Marijuana or other things. How the fuck do they expect anyone to listen to them with regards to what the laws are/should be when they don't listen to themselves. Haha. Good times.\n\n\n25 points. It's almost like they've only been around for 15 years or so and haven't developed to the point where they can understand that everybody isn't out to get them...",
            "Comment right under yours currently is\n\n>Government is a sham....we are being ruled by a plutocracy....\n\nYeah. What a fucking joke indeed.\n",
            "Wow, the crazy in this thread has hit a new peak.",
            "That's the whole point of the decision, if you'd actually read it you would know. The federal judge had already awarded the plaintiffs as much as he could, holding the CIA in contempt would effectively do nothing.",
            "I'm curious about this too. ",
            "Bullets.",
            "because they have guns.",
            "A [plurality of Americans](http://articles.cnn.com/2009-04-30/us/religion.torture_1_justified-evangelicals-torture?_s=PM:US) say torturing terror suspects isn't all that bad.",
            "We are.  We've been rioting for over a month now.  You should have told them to watch the news occasionally. ",
            "I know, I'm really late to comment on this, but I wanted to point something out. A lot of Europeans, when they first come to America, say they're surprised and overwhelmed by how big the country is. Compared to most developed countries, we're god-damned gigantic. And even when you consider the other biggies, like Russia and China, you've got most of the population still centered around a few near-by major cities. \n\nThat bigness means that picking up and protesting our government is a huge investment in time and energy. In France, where political protest is practically the favored national past-time, getting from your home to the capital building usually takes no more than a couple of hours and it costs about the same as a bus ticket from Oregon to Washington. Heck, they can go back to their jobs the next day, they might even be able to go home and sleep in their own beds each night, refreshed and ready to raise hell the following morning. \n\nI live in Portland, Oregon, and I'm paid an hourly wage. I suppose I could wait until after work, walk down to city hall, and hold up a sign expressing my outrage over the state of things, but this is Portland. At least 90% of the people who work in that building, including the politicians, already feel the same way I do. Why should I stand out in the cold and rain waving a banner at people who agree with me?\n\nAnd you want me to riot over this? I should smash up the windows of local coffee shops and thrift stores because a federal court made a shitty call? I should put on a Guy Fawkes mask and throw fire bombs at police cruisers because the CIA deleted some tapes? That's downright psychopathic. \n\nSure, if I lived on the East coast, if I were a short and cheap trip away from the White House, I might paint a sign and take my ass over there. I'd be joining the same few dozen Liberals that always show up when something we don't like happens. It's rare for the news to even mention that these groups are there any more. It's like the people who show up at abortion clinics every day; we all know they're there, we all know they'll be there tomorrow and the next day, but most of us just don't give a shit anymore.\n\nThe next time someone on Omegle asks you why you aren't rioting in the streets, ask him or her how far they live from their capital, how many riots they've attended, and what the police did to them in return. ",
            "Because we have bills to pay, and a lawn to mow.",
            "Because the geographical distance that spans our country is too large. There's no way I can afford to travel to D.C. to riot there. ",
            "My answer is that I don't feel like getting shot by our militarized police force. I'm also no good at tying knots for when the time comes to roust our oppressors from their sleep and hang them.  ",
            "A few dozen probably are, and the rest would join them if the Media didn't decide it wasn't worth mentioning... or immediately made it look stupid/anti-American when it did mention it.\n\nTrue riots don't happen in the US, not the kind that could change anything.  And apathy really isn't to blame.  \n\nAny good government is good at stopping riots.  Which means, the only way to win is slow but steady in the system.",
            "Lazy",
            "Yes.\n\nIt's only a small portion of the population that is either A) a conspiracy theorist nutjob or B) a former student who took out massive amounts of student loans to pay for a degree in communications/fine arts/unnmarketable major and can't find a job.\n\nAlso, when push comes to shove we have guns.",
            "Because [the actual situation is different](http://www.reddit.com/r/reddit.com/comments/lghsk/courts_rule_us_government_above_the_law_judge/c2sr3r1) from a headline on reddit. OH EM GEEEEE.",
            "bread and circuses?   the prisons are relatively not so bad once you accept it.",
            "Blue links on Reddit/r/pics...THAT'S how.",
            "Too busy masterbating ( for you young hipsters that's te ancient word for fapping ). See, the government is controlling the porn industry to supress the young male population by having them willingly stay home and masterbate all day. I am a victim of this horrible crime against humanity ( and my penis ). We need to let go of our wankers and rush the streets in protest! Lube cannot save us this time! \n\nWhat, I seen it on Ventura's Conspiracy Theories...",
            "Why was this subreddit closed?",
            "[deleted]",
            "Tell this to Nixon. ",
            "Are you saying that because they've produced other evidence the tapes are superfluous?  Is that really their prerogative?",
            "You can put a sensationalist headline on reddit, for one.",
            "You've just discovered the difference between *de jure* and *de facto.* There is no law defining the government above the law, but this ruling makes it so in practice. ",
            "The CIA's failure to identify or produce the videotapes came to light only after the media had\nleamed, and the CIA then had acknowledged publicly, that the videotapes had been destroyed.\nPlaintiffs, in an effort to remedy harms allegedly suffered at the hands of the CIA, seek a wide array ofrelief, including an order requiring the CIA to disclose documents that would identify the persons responsible for, and the reasons behind, the videotapes' destruction, for the period between July 1,2003, and May 31, 2005; limited discovery, specifically, the opportunity to review all withheld and partially withheld documents ofthat same type, from all relevant time periods, in a sealed proceeding, to determine whether any current or former CIA officials should be ordered to show cause why they should not be held in civil contempt; and an award of attorneys' fees and costs incurred in obtaining responsive documents from the CIA in this litigation. lne CIA agrees to an order for fees and costs, but objects to all other aspects of the relief plaintiffs seek. The CIA argues that procedures already ordered by the court have resulted in a substantially full production of documents describing that which the videotapes would have shown and identifying Agency personnel involved in the videotapes' destruction; that the same court-ordered exemptions that justified the CIA's withholding of many of those documents would have justified the withholding of the videotapes, as well, if the CIA timely had identified the videotapes in response to my orders; that the CIA voluntarily has adopted and implemented new protocols to avoid the improper destruction of documents in the future; and that, as a result, plaintiffs already have achieved substantially complete remedial relief.\nI hold that plaintiffs have, indeed, achieved nearly complete remedial relief, and I deny plaintiffs' motion, except for awarding plaintiffs their attorneys' fees and costs.\n2",
            "Im with you man, seems like theyre gettin everythin jow",
            "Death, courts adjourned!",
            "Doesn't forget... but has bad aim?\n\nThe ones who won't be subjugated with force and violence are the rulers who are doing the subjugating abroad.",
            "America spreads democracy through bullets and bombs. Countless people have died at the hands of supposed freedom in order make the world a more peaceful place? The only people benefiting from America's policies are the military industrial complex, corporations, banks, and the corporate elite. I yearn for the day Americans and the rest of the world march on the streets and overhaul the system. In fact, that's starting already with OWS. ",
            "I'm also surprised there are less comments.  Even though it's from a source I'm not familiar with, there is pretty concrete video evidence of what happened.",
            "because it's in the wrong subreddit",
            "Because the Pentagon has a 3 million dollar budget to \"control\" social media sites.\n",
            "http://www.globalresearch.ca/index.php?context=va&aid=12268\n\nHere is an interesting article on the same site about chemtrails.\n\nThis isn't getting upvoted because its not in the appropriate subreddit \nand the linked website is a conspiracy nutter site. ",
            "Because you didn't wait long enough? Because you don't know how upvotes work?",
            "Do you know how downvotes work on reddit, especially for high scoring links?\n\nIf not, please don't comment about it until you do understand.",
            ">They instead provided full and complete documentation of the contents of the videos which meet all the needs of the plaintiffs.\n\nThis is the epitome of ridiculous. In what sense can this be considered evidence? It's worse than eye-witness testimony. The point of a video camera is that (pedantry aside) it is unbiased. Allowing them to describe the contents of the videos is not a reasonable option.\n\n***Video of kid being waterboarded***:\n*This video contains footage of the CIA distributing humanitarian relief aid in the form of hydration.*\n\nBeyond the previous point I made, the point here is that if you or I pulled this shit on a judge we'd have the book thrown at us.",
            "Yeah, that's the sense I got from a few other articles I read as well as the judge's ruling. I mean, it seems somewhat well fortuned that these tapes got destroyed but at the end of the day the evidence is still there.",
            "It's illegal to protest and/or occupy the Mall, or a large portion of the Capitol. D.C. learned its lessons from the Bonus Army, and applied them well during Bush II.",
            "Yeah, not holding them in contempt sure means they ruled that the CIA is above the law.",
            "I don't think so.  I think humans are the pinnacle of evolution and will survive.  There will be a few humans living on a small planet next to a dwarf star millions of years from now.  If I'm right - and I have no doubt that I am - one of Ron Paul's descendants will be President of that small colony.",
            "END CIA PERSONHOOD\n\n(did i do that right?)",
            "I don't think any one person can fix this shit. At this point, things are so screwed up that anyone we vote into office just kind of has to go with the flow, especially in politics where going against the flow almost ensures career suicide. Even if the \"best\" candidate was to take office, it's not like he can just bring all the troops home, free all the prisoners, and pardon all suspects instantaneously; that would just cause a huge backlash and have repercussions for our safety (especially now, since we've been harassing the entire middle east for the past 10 years). We're up to our dicks in shit right now and, for better or for worse, we have to wade through it until it subsides. All we can really hope for is someone who will handle things better and actually follow through on his promises (which depends more on the leanings of government... checks and balances and all that); I think a lot of the problems we have right now stem from the fact that this entire \"war\" effort has not been well handled or well staged.",
            "im not sure this applies when looking at this specific court case.  There is legal authority to hold the CIA itslef, and those that destroyed the evidence directly accountable.  The CIA is not anymore Soverign than the courts.\n\nThis is basically a cover up.  The judge didnt want to mess with the CIA or the Obama administration and let it go. It happens a lot but that does not make it right.",
            "I dont think you understand sovereign immunity very well.\n\n",
            "They have to actually invoke sovereign immunity to receive it's privileges. They didn't do so in this case. ",
            "To clarify, I am responding to the first part of the title, \"Courts Rule US Government Above the Law.\"  Notice how it did not say, Judge exercises discretion to not hold party in contempt in managing case before the judge.  ",
            "I dont thinl anyone outside a college student who took a law class would know this",
            "Are you completely sure that's a *human* brain you've got there?",
            "Doesn't apply here.",
            "Remember, remember, the 5th of November, the gunpowder treason and plot. I know of no reason why gunpowder treason should ever be forgot.",
            "At least Obama's eyebrows aren't falling off.\n\n(I know, cheap shot)",
            "The Justice Department is not part of the Judicial branch, it is part of the Executive branch.\n\nhttp://www.whitehouse.gov/our-government/executive-branch",
            "but you want to know",
            "Fuck it, no one else is going to see this...\n\nSTEVE STEVE STEVE STEVE STEVE STEVE STEVE \nSTEVE STEVE STEVE STEVE STEVE STEVE STEVE \nSTEVE STEVE STEVE STEVE STEVE STEVE STEVE \nSTEVE STEVE STEVE STEVE STEVE STEVE STEVE \nSTEVE STEVE STEVE STEVE STEVE STEVE STEVE \nSTEVE STEVE STEVE STEVE STEVE STEVE STEVE \nSTEVE STEVE STEVE STEVE STEVE STEVE STEVE \nSTEVE STEVE STEVE STEVE STEVE STEVE STEVE \nSTEVE STEVE STEVE STEVE STEVE STEVE STEVE \nSTEVE STEVE STEVE STEVE STEVE STEVE STEVE \nSTEVE STEVE STEVE STEVE STEVE STEVE STEVE \nSTEVE STEVE STEVE STEVE STEVE STEVE STEVE \nSTEVE STEVE STEVE STEVE STEVE STEVE STEVE \nSTEVE STEVE STEVE STEVE STEVE STEVE STEVE \nSTEVE STEVE STEVE STEVE STEVE STEVE STEVE \nSTEVE STEVE STEVE STEVE STEVE STEVE STEVE \nSTEVE STEVE STEVE STEVE STEVE STEVE STEVE \nSTEVE STEVE STEVE STEVE STEVE STEVE STEVE \nSTEVE STEVE STEVE STEVE STEVE STEVE STEVE \nSTEVE STEVE STEVE STEVE STEVE STEVE STEVE \nSTEVE STEVE STEVE STEVE STEVE STEVE STEVE \nSTEVE STEVE STEVE STEVE STEVE STEVE STEVE \nSTEVE STEVE STEVE STEVE STEVE STEVE STEVE \nSTEVE STEVE STEVE STEVE STEVE STEVE STEVE \nSTEVE STEVE STEVE STEVE STEVE STEVE STEVE \nSTEVE STEVE STEVE STEVE STEVE STEVE STEVE \nSTEVE STEVE STEVE STEVE STEVE STEVE STEVE \nSTEVE STEVE STEVE STEVE STEVE STEVE STEVE \nSTEVE STEVE STEVE STEVE STEVE STEVE STEVE \nSTEVE STEVE STEVE STEVE STEVE STEVE STEVE \nSTEVE STEVE STEVE STEVE STEVE STEVE STEVE \nSTEVE STEVE STEVE STEVE STEVE STEVE STEVE \nSTEVE STEVE STEVE STEVE STEVE STEVE STEVE \nSTEVE STEVE STEVE STEVE STEVE STEVE STEVE \nSTEVE STEVE STEVE STEVE STEVE STEVE STEVE \nSTEVE STEVE STEVE STEVE STEVE STEVE STEVE \nSTEVE STEVE STEVE STEVE STEVE STEVE STEVE \nSTEVE STEVE STEVE STEVE STEVE STEVE STEVE \nSTEVE STEVE STEVE STEVE STEVE STEVE STEVE \nSTEVE STEVE STEVE STEVE STEVE STEVE STEVE \nSTEVE STEVE STEVE STEVE STEVE STEVE STEVE \nSTEVE STEVE STEVE STEVE STEVE STEVE STEVE \nSTEVE STEVE STEVE STEVE STEVE STEVE STEVE \nSTEVE STEVE STEVE STEVE STEVE STEVE STEVE \nSTEVE STEVE STEVE STEVE STEVE STEVE STEVE \nSTEVE STEVE STEVE STEVE STEVE STEVE STEVE \nSTEVE STEVE STEVE STEVE STEVE STEVE STEVE \nSTEVE STEVE STEVE STEVE STEVE STEVE STEVE \nSTEVE STEVE STEVE STEVE STEVE STEVE STEVE \nSTEVE STEVE STEVE STEVE STEVE STEVE STEVE \nSTEVE STEVE STEVE STEVE STEVE STEVE STEVE \nSTEVE STEVE STEVE STEVE STEVE STEVE STEVE \nSTEVE STEVE STEVE STEVE STEVE STEVE STEVE \nSTEVE STEVE STEVE STEVE STEVE STEVE STEVE \nSTEVE STEVE STEVE STEVE STEVE STEVE STEVE \nSTEVE STEVE STEVE STEVE STEVE STEVE STEVE \nSTEVE STEVE STEVE STEVE STEVE STEVE STEVE \nSTEVE STEVE STEVE STEVE STEVE STEVE STEVE \nSTEVE STEVE STEVE STEVE STEVE STEVE STEVE \nSTEVE STEVE STEVE STEVE STEVE STEVE STEVE \nSTEVE STEVE STEVE STEVE STEVE STEVE STEVE \nSTEVE STEVE STEVE STEVE STEVE STEVE STEVE \nSTEVE STEVE STEVE STEVE STEVE STEVE STEVE \nSTEVE STEVE STEVE STEVE STEVE STEVE STEVE \nSTEVE STEVE STEVE STEVE STEVE STEVE STEVE \nSTEVE STEVE STEVE STEVE STEVE STEVE STEVE \nSTEVE STEVE STEVE STEVE STEVE STEVE STEVE \nSTEVE STEVE STEVE STEVE STEVE STEVE STEVE \nSTEVE STEVE STEVE STEVE STEVE STEVE STEVE \nSTEVE STEVE STEVE STEVE STEVE STEVE STEVE \nSTEVE STEVE STEVE STEVE STEVE STEVE STEVE \nSTEVE STEVE STEVE STEVE STEVE STEVE STEVE \nSTEVE STEVE STEVE STEVE STEVE STEVE STEVE \nSTEVE STEVE STEVE STEVE STEVE STEVE STEVE \nSTEVE STEVE STEVE STEVE STEVE STEVE STEVE \nSTEVE STEVE STEVE STEVE STEVE STEVE STEVE \nSTEVE STEVE STEVE STEVE STEVE STEVE STEVE \nSTEVE STEVE STEVE STEVE STEVE STEVE STEVE \nSTEVE STEVE STEVE STEVE STEVE STEVE STEVE \nSTEVE STEVE STEVE STEVE STEVE STEVE STEVE \nSTEVE STEVE STEVE STEVE STEVE STEVE STEVE \nSTEVE STEVE STEVE STEVE STEVE STEVE STEVE \nSTEVE STEVE STEVE STEVE STEVE STEVE STEVE \nSTEVE STEVE STEVE STEVE STEVE STEVE STEVE \nSTEVE STEVE STEVE STEVE STEVE STEVE STEVE \nSTEVE STEVE STEVE STEVE STEVE STEVE STEVE \nSTEVE STEVE STEVE STEVE STEVE STEVE STEVE \nSTEVE STEVE STEVE STEVE STEVE STEVE STEVE \nSTEVE STEVE STEVE STEVE STEVE STEVE STEVE \nSTEVE STEVE STEVE STEVE STEVE STEVE STEVE \nSTEVE STEVE STEVE STEVE STEVE STEVE STEVE \nSTEVE STEVE STEVE STEVE STEVE STEVE STEVE \nSTEVE STEVE STEVE STEVE STEVE STEVE STEVE \nSTEVE STEVE STEVE STEVE STEVE STEVE STEVE \nSTEVE STEVE STEVE STEVE STEVE STEVE STEVE \nSTEVE STEVE STEVE STEVE STEVE STEVE STEVE \nSTEVE STEVE STEVE STEVE STEVE STEVE STEVE \nSTEVE STEVE STEVE STEVE STEVE STEVE STEVE \nSTEVE STEVE STEVE STEVE STEVE STEVE STEVE \nSTEVE STEVE STEVE STEVE STEVE STEVE STEVE \nSTEVE STEVE STEVE STEVE STEVE STEVE STEVE \nSTEVE STEVE STEVE STEVE STEVE STEVE STEVE \nSTEVE STEVE STEVE STEVE STEVE STEVE STEVE vv\nSTEVE STEVE STEVE STEVE STEVE STEVE STEVE \nSTEVE STEVE STEVE STEVE STEVE STEVE STEVE \nSTEVE STEVE STEVE STEVE STEVE STEVE STEVE \nSTEVE STEVE STEVE STEVE STEVE STEVE STEVE \nSTEVE STEVE STEVE STEVE STEVE STEVE STEVE \nSTEVE STEVE STEVE STEVE STEVE STEVE STEVE \nSTEVE STEVE STEVE STEVE STEVE STEVE STEVE \nSTEVE STEVE STEVE STEVE STEVE STEVE STEVE \nSTEVE STEVE STEVE STEVE STEVE STEVE STEVE \nSTEVE STEVE STEVE STEVE STEVE STEVE STEVE \nSTEVE STEVE STEVE STEVE STEVE STEVE STEVE \nSTEVE STEVE STEVE STEVE STEVE STEVE STEVE \nSTEVE STEVE STEVE STEVE STEVE STEVE STEVE \nSTEVE STEVE STEVE STEVE STEVE STEVE STEVE \nSTEVE STEVE STEVE STEVE STEVE STEVE STEVE \nSTEVE STEVE STEVE STEVE STEVE STEVE STEVE \nSTEVE STEVE STEVE STEVE STEVE STEVE STEVE \nSTEVE STEVE STEVE STEVE STEVE STEVE STEVE \nSTEVE STEVE STEVE STEVE STEVE STEVE STEVE \nSTEVE STEVE STEVE STEVE STEVE STEVE STEVE \nSTEVE STEVE STEVE STEVE STEVE STEVE STEVE \nSTEVE STEVE STEVE STEVE STEVE STEVE STEVE \nSTEVE STEVE STEVE STEVE STEVE STEVE STEVE \nSTEVE STEVE STEVE STEVE STEVE STEVE STEVE \nSTEVE STEVE STEVE STEVE STEVE STEVE STEVE \nSTEVE STEVE STEVE STEVE STEVE STEVE STEVE \nSTEVE STEVE STEVE STEVE STEVE STEVE STEVE \nSTEVE STEVE STEVE STEVE STEVE STEVE STEVE \nSTEVE STEVE STEVE STEVE STEVE STEVE STEVE \nSTEVE STEVE STEVE STEVE STEVE STEVE STEVE \nSTEVE STEVE STEVE STEVE STEVE STEVE STEVE \nSTEVE STEVE STEVE STEVE STEVE STEVE STEVE \nSTEVE STEVE STEVE STEVE STEVE STEVE STEVE \nSTEVE STEVE STEVE STEVE STEVE STEVE STEVE \nSTEVE STEVE STEVE STEVE STEVE STEVE STEVE \nSTEVE STEVE STEVE STEVE STEVE STEVE STEVE \nSTEVE STEVE STEVE STEVE STEVE STEVE STEVE \nSTEVE STEVE STEVE STEVE STEVE STEVE STEVE \nSTEVE STEVE STEVE STEVE STEVE STEVE STEVE \nSTEVE STEVE STEVE STEVE STEVE STEVE STEVE \nSTEVE STEVE STEVE STEVE STEVE STEVE STEVE \nSTEVE STEVE STEVE STEVE STEVE STEVE STEVE \nSTEVE STEVE STEVE STEVE STEVE STEVE STEVE \nSTEVE STEVE STEVE STEVE STEVE STEVE STEVE \nSTEVE STEVE STEVE STEVE STEVE STEVE STEVE \nSTEVE STEVE STEVE STEVE STEVE STEVE STEVE \nSTEVE STEVE STEVE STEVE STEVE STEVE STEVE \nSTEVE STEVE STEVE STEVE STEVE STEVE STEVE \nSTEVE STEVE STEVE STEVE STEVE STEVE STEVE \nSTEVE STEVE STEVE STEVE STEVE STEVE STEVE \nSTEVE STEVE STEVE STEVE STEVE STEVE STEVE ",
            "No more balances, just passing around checks, between all the branches. ",
            "The Federal government is out of control.  Your mistake is believing that the Legislative, Executive, and Judicial branches aren't in this together.  This ruling, if nothing else, should disabuse you of this notion.",
            "Exec branch does not have as much power as you think it does",
            "The tree of liberty must be watered with the blood of patriots and tyrants from time to time. It is its natural fertilizer.",
            "The US Constitution has either been powerless to prevent this from happening or complicit in allowing this to happen.  As such, it is a useless document.",
            "Assassinated a citizen? Who? When?",
            "Are people seriously still bitching about al-Awlaki?  [The man was one of al-Qaeda's most influential members](http://www.economist.com/blogs/clausewitz/2011/10/killing-anwar-al-awlaki).  What's the alternative, send a contingent of Marines into a country that's on the brink of civil war, filled with hundreds of hostile militias, and safely extract al-Awlaki?  Providing the team would even be able to corner him, I'm sure he would have just given himself up, right?  \n\nIf you really want examples of how the CIA is above the law, you could cite their covert support (tacitly approved by U.S. presidents, and by the time Reagan was in office enthusiastically approved) of various authoritarian regimes in Latin America and Africa during the Cold War.",
            "Well, they are making damn certain of that. ",
            "Government works when it performs its duties as \"smart\" government using the checks and balances that are supposed to prevent this sort of activity. Instead everyone is doing everyone else favors and providing kickbacks to their constituents and it ends up being a huge circlejerk. ",
            "You say that as if it's a bad thing....",
            "I think we're all forgetting that Afghanistan is also the world's #1 opium producer, and production has increased since the US occupation.",
            "Nation-wide crack epidemic*",
            "Commenting to find this later\n\n",
            "not a bad read: https://secure.wikimedia.org/wikipedia/en/wiki/Legacy_of_Ashes:_The_History_of_the_CIA",
            "It's a sideshow either way. This was only an attempt by the ACLU to find the CIA in contempt of court over the videos. They have already been shielded from prosecution for the actual torturing. The Obama DOJ determined that the CIA was given a legal opinion that the techniques they used weren't torture, so they can't be prosecuted. I can almost understand that reasoning, but I think they should punish whoever told them it was ok. Namely [John Yoo](http://en.wikipedia.org/wiki/John_Yoo).",
            "Apparently destroying tapes is routine. Like shredding documents. The problem here is that they were destroyed shortly after a judge had ordered them to be produced. The judge made a broad request for all \"relevant\" documents. His ruling today was that the agents who destroyed these tapes probably didn't know they had been requested. That's an awfully generous ruling, but it doesn't set any sort of precedent for executive authority or state secrets.",
            "medal of honor is next..",
            "No, no conviction. The gist of the article is correct that they were let off. The judge essentially ruled that they made an error as opposed to a willful act.",
            "Honestly, it still isn't very good. The judge gave them a pretty huge mulligan. Plus there's the fact that no one will ever be prosecuted for actually committing torture. The headline goes a little overboard since they judge didn't accede to any claims of executive privilege or state secrets or set any new precedent.",
            "It was never ours. Some people let us live in it as long as we keep our mouths and eyes shut.",
            "Get them into banking or politics then.",
            "I'd imagine the same way people describe hell.",
            "I have no interest in fighting a fixed fight.",
            "Wait, you mean like Tyrion?",
            "[deleted]",
            "Please don't joke about that. That is happening everyday.",
            "The thing is most Americans are too ignorant to care, I only know around 3 people in my entire school that know about OWS. Everyone I've asked about outside of school look at me like what? and everyone generally says they don't care because they still have Facebook (literally). I hate what we've become.",
            "If you have a question about any of the claims I made, please ask it.  Ample proof is available.  Like I said, you can watch the Oliver North hearings on YouTube.  I am not the one who said they maintain their own army, navy, and air force.  That was a high-level executive in the CIA who said it.  Read the CIA \"Family Jewels\" files or any very basic history for the information about the Gulf of Tonkin incident and the CIAs complete admission of manufacturing it.  \n\nThere are an awful lot of crazy conspiracy theories about the CIA out there.  I didn't mention a single one of those.  I restricted my statements to things the CIA and its officials have openly admitted before Congress and in the various records that have been released to the public (even though the CIA fought tooth and nail for decades to have the information suppressed because they are diametrically opposed to all ideas of democracy and believe that if the public know what they do, it will endanger their ability to manipulate the public to their own desire).",
            "Sleeping in the street is far from a riot.",
            "No, they've been rioting against the wealthy, not the government.  This is a problem with government, not people employing other people and making money. ",
            "If you Americans call OWS a riot, I'm sorry. You're pussies in that case",
            "Seriously? People who have no understanding of OWS are on par with the same idiots who half assed OWS. You are just as bad as the kids who sip lattes in protest.\n\nI really wanted to know what your answer to that questions was. It looks like you labeled a large group of people into only two categories, and then said:\n\n>Also, when push comes to shove we have guns.\n\nWhat was that in regards to?\n\n\n",
            "You think thats acceptable? do you honestly feel like the government has your best intrest in mind. Torture, propaganda, illegal opperations and catering to the super rich and corporations, these are all things your government can do and are doing RIGHT NOW, IN FRONT OF YOUR FACE. No, actually your right, just go find new friends on facebook and everthing will be all good because this one headline is a little misleading",
            "If you haven't figured it out already... [see this](http://blog.reddit.com/2011/10/saying-goodbye-to-old-friend-and.html).",
            "Because they have the capacity, and callousness to cause you a world of hurt.",
            ">Our government is run by criminals, whom are watched over by other criminals, whom are in turn employed by criminals!\n\nWho are hired by voters who obviously don't care enough about their future to make an educated vote!",
            "The only time I met him he was standing on the beach between the Key Biscayne Hotel and the Key Biscayne Beach Club.\n\nI was too busy being speechless to ask  him anything.\n\n",
            "The Court says the records and documents produced in lieu of the actual videos was enough in this *civil trial.* The plaintiffs had already achieved *substantial remedial relief* which is all that is necessary for a civil trial and if the court held the CIA in contempt no *further relief could be granted* (i.e. it would be pointless). Thus, the court doesn't hold the CIA in contempt.",
            "No, it means it happened once in practice. Let's say a judge decides to dismiss a case of drinking and driving on their own judgment, it doesn't suddenly make drinking and driving legal. ",
            "I. The history of this lawsuit under the Freedom of Information Act.\nPlaintiffs submitted their initial ForA requests to a number of federal government agencies, including the CIA, in October 2003.1 First Am. Comp!., Am. Civil Liberties Union v. Dep't ofDef., No. 04 Civ. 4151 (Doc. No.5 '\\12) (S.D.N.Y. july 6, 2004). With those initial requests, plaintiffs sought the disclosure of government records that fell into three overlapping categories: (I) \"records concerning the treatment ofindividuals apprehended after September II, 200I, and held by the United States at military bases or detention facilities outside the United States\"-individuals otherwise referred to as \"detainees\"; (2) \"records concerning the deaths of [d]etainees in custody\"; and (3) \"records concerning the government's practice of 'rendering' [d]etainees to countries known to use torture.\" Id.; Am. Civil Liberties Union v. Dep't of Defense (\"ACLU 1\"),339 F. Supp. 2d 501, 502 (S.D.N.Y. 2004). Plaintiffs sought updated infonnation, and referred to particular documents discussed by the media but not available to the public, in a second round of requests, submitted in May 2004. ACLU I, 339 F. Supp. 2d at 502.\nThe CIA refused to process plaintiffs' requests on an expedited basis. Id. And the CIA, along with all but one ofthe other federal government agencies to which plaintiffs had submitted their requests, failed to identify or produce any responsive records. First Am. Comp!., Am. Civil Liberties Union v. Dep't ofDef., No. 04 Civ. 4151 (Doc. No.5 '\\15) (S.D.N.Y. July 6, 2004). Having been frustrated in their efforts for disclosure at the agency level, plaintiffs filed this lawsuit on June 2, 2004, seeking \"the immediate processing and release\" ofthe records they had requested. Comp!., Am. Civil Liberties Union v. Dep't ofDef., No. 04 Civ. 4151 (Doc. No. I 'Ill) (S.D.N.Y. June 2, 2004).\nAfter hearing oral argument from the parties as to how they intended to proceed in\nthis matter, I issued my Opinion and Order ofSeptember 15, 2004, which required all defendant\nI All matters discussed in this Opinion and Order are available on the public record ofthese proceedings.\n3",
            "Something about how voting makes a difference.",
            "Yeah! People outside of american and with little understanding of it know what's up! Let's preach at those americans and their inherently evil government!",
            "While it wouldn't surprise me, those are some specific numbers.  Do you have a citation for this?",
            "How presumptuous\n\nI know that Reddit has an algorithm that counteracts large numbers of upvotes for posts in an attempt to control spam being upvoted by spambots ...\n\nI was just commenting on the number '666' as being particularly noteworthy. ",
            "I'm sure members of the government wanted them destroyed to prevent any PR nightmare from their eventual release.  If the plaintiffs are still displeased it's likely it was the PR they were after, not a legal ruling on whether or not the content of the tapes constituted torture.\n",
            "If everyone just goes to visit at the same time with a sign, how can that be illegal.  I am sure every city has similar rules that are being broken.  Government does not like protest.  Gee that is true all over the world.",
            "Then why don't you explain it to me then?  ",
            "It's called a lobotomy, it keeps people happy.",
            "ha i just had to google that. did the media actually make a big deal about it?",
            "My mistake.",
            "your ctrl key slipped for a moment there.",
            "Well said, sir.",
            "Blame your media and their owners. They fail to report on injustice and abuse of power in any meaningful way, leaving politicians free to do what they want with no regard for the people they are supposed to serve.",
            "State and local governments are out of control as well.  So, \"The State is out of control\" is more accurate.  ",
            "Nope, state governments are just as radical as the federal.",
            "Are you serious? You think the legislative and executive branch are 'in this together'? Jesus christ, I know Poe's law applies to reddit's political views, but what the shit...",
            "Yeah it pretty much does. Did you read the article? Obama has a list of people he wants dead. Some of them are even US citizens who have no charges against them and have not been arrested. These murders are being carried out on a systematic and regular basis.\n\nThe Executive branch does literally whatever the fuck it wants.",
            "So many tyrants, so few patriots.",
            "A piece of paper can't make up for the deficiencies of the citizenry or the government.  The first time the government violated the Constitution and saw that the citizens would do nothing has set the pattern for everything we see today.\n\nEnglish common law, starting with the Magna Carta, is predicated on the idea that no man, including the king, is above the law.  Well, in America, we've dispensed with such silly, antiquated notions.",
            "Anwar al-Awlaki",
            "http://www.salon.com/2010/04/07/assassinations_2/\n\nIt looks like they did it:\n\nhttp://news.firedoglake.com/2011/09/30/american-citizen-anwar-al-awlaki-assassinated-in-yemen/",
            "I suggest you read the article. ",
            "I don't remember his name right now, but he was organizing pro jihad media in Afghanistan. The military killed him even though he was non-violent, and we had sufficient intelligence to have arrested him. However, being an American citizen, the government could have had a hard time convicting him for just running media operations, so they killed him with an airstrike instead.",
            "Osama Bin Laden of course, better known as Timoty Mcveigh!\n\n*unnecessary closeup of M Night Shyamalan*",
            "http://www.theunion.com/article/20111015/NEWS/111019801/1025",
            "[deleted]",
            "That's likely too long ago to stir people up. ",
            "Um, curing the cold war - thats hillarious, like its stopped all of a sudden in 1989.\n\nFuck me dead.",
            ">The man was one of al-Qaeda's most influential members.\n\nAllegedly.",
            "You're talking to reddit kids.  Why bother explaining reality to those who have yet to experience it?",
            "That's because the Koran forbids Muslims from producing intoxicants. The Taliban had almost wiped out opium production when the US occupation began.\n\n...Do you seriously think that the CIA is trying to use the war as a cover for producing and distributing *opium*? Think about that for a second. OPIUM.",
            "There's a save button",
            "\"You are hereby charged with.... Murder!\"\n\n\"Yeah but my lawyers said it was OK\"\n\n\"Oh, well then I guess you're free to go.\"\n\n\"Thanks!\"",
            "Because John Woo wanted to be able to interrogate without torturing? I saw him on John Stewart's show, and he made it clear they were looking for that line, and thought they were on the moral side of it.",
            "Why wouldn't they just archive these things ?\n",
            "It sets a pretty excellent precedent in practice, actually: merely destroy evidence shortly after being ordered not to, and you're all set.",
            "The CIA making an error? good god we're fucked.",
            "And let them steal from and rape us on occasion. ",
            "Knowledge is the greatest power above all.",
            "No, a Lannister always pays his debts.",
            "I welcome our diminutive overlord -er something",
            "Wasn't the tea party all about being pissed off that giant corporations were bailed out rather than being left to die?",
            "That's after they were coopted by Koch Industries and neocons.",
            "Corporations are where they are today because of government intervention and regulations imposed by the government. Most corporations would not grow to where they are today without government help keeping competition out of the way. ",
            "Mind explaining how this is \"small government\"? This is the opposite. This is what Obamanites wanted. And they got it.\n\nEdit: Are people disagreeing with the truthful statement that this is Big Government? A little dialog is welcome. But that may be asking too much.",
            "I don't think it was a joke...",
            "Yeah, well we're smart enough not to destroy our own property while being upset.",
            "Riots are a pussy go-between that ruins your cause anyway. Having a bunch of idiot kids looting stores doesn't help anyone. Either we start actually revolting and killing those in power who are obviously too corrupt to exist anymore, or we continue with a peaceful protest.",
            "It's called Civil Disobedience. ",
            "As soon as I take a quick nap, I'll riot.",
            "They've been rioting over [a lot of things](http://coupmedia.org/occupywallstreet/occupy-wall-street-official-demands-2009), including anger towards bailouts, Citizens United, unfair taxation, and legal corporate personhood.  The biggest problem is the extreme thinness of a line between rioting over corporations and the government.",
            "But we take the moral high ground.  When we get arrested, video shows our innocence, not our disrespect.  Peaceful resistance is not the behavior of pussies.",
            "Ok, here's the thing. OWS isn't a protest about anything in particular. If you were to take a poll of the people protesting with the question, 'if the government passed a bill right now that would satisfy our grievances, what would that bill do?' you wouldn't get a clear consensus. It's just general discontent. It's hard to take a protest seriously when it doesn't have a concrete goal.\n\nAnd the guns thing? A lot of people aren't really too concerned with their government enslaving them because they have guns. Mostly below the Mason-Dixon line, but still.",
            "Oh, definitely. I think that's the best.",
            "[deleted]",
            "It doesn't matter how educated our \"vote\" is...we're voting for two sides of the same shitty coin.",
            "[deleted]",
            "What about respect for the rule of law?  Destruction of evidence is not just a slight against the plaintiff but a defamation of the court.  This sounds like spitting in a judges face, but getting away with it because you lost the case.",
            "No, but if it happened over and over, it would appear that there is a de fact legalization of drinking and driving, because there would never be any repercussions, even though there is law against it. In the same vein, this case with the government is not the first of its kind. ",
            "agencies to \"produce or identifY all responsive documents\" no later than October 15, 2004.\nACLU I, 339 F. Supp. 2d at 505. In opposing such a rigorous production schedule, the government argued that plaintiffs' requests touched upon important national security issues. But, as I explained,\nbefore it can be determined if documents requested . . . fall under [FOIA disclosure exemptions for records classified as matters of national defense or foreign policy], the documents must first be identified, by some form of log, to enable a specific claim of exemption to be asserted and justified. As to documents the existence of which the government contends it may be unable to confirm or deny, procedures can be established to identifY such documents in camera or to a special master with proper clearance. Merely raising national security concerns can not justifY unlimited delay.\nId. at 504 (citations omitted). I noted, further, that the records plaintiffs had sought related to \"matters ofsignificant public interest.\" Id. Yet \"the glacial pace at which defendant agencies hal d] been responding to plaintiffs' requests show[ ed] an indifference to the commands of FOIA, and fail[ed] to afford accountability of government,\" FOIA's bedrock principle. Id.\nOn October 15,2004, the government wrote to advise me ofeach agency's progress in responding to plaintiffs' FOIA requests and described the CIA as having \"partially complied.\" Letter from David N. Kelley, U.S. Att'y, S.D.N.Y., to Hon. Alvin K. Hellerstein,\nU.S. Dist. J., S.D.N.Y, Am. Civil Liberties Union v. Dep't ofDefense, No. 04 Civ. 4151 (Doc. No. 18 at 3) (S.D.N.Y. Oct. 19,2004). The CIA sought \"partial relief' from my order, however, in part, the government claimed, because the CIA could not \"review operational documents that [we]re the subject ofongoing investigations by [the CIA's Office of Inspector General, or \"OIG\"] until those investigations [had] closed.\" Id. at 4. The government elaborated:\nOrdinarily, the CIA is statutorily exempt from searching operational files for documents responsive to FOIA requests. Here, however, some of the CIA's operational files will become searchable due to OIG investigations. The CIA cannot ascertain which operational mes will be no longer exempt from plaintiffs' FOIA requests beeause the OIG, in the interests of protecting its ongoing\n4",
            "Clear facts that show even if the majority of the country votes for a certain candidate, the other will be elected.",
            "Oh, the irony.",
            "It's actually $42 Million.  \n\n\nhttp://bits.blogs.nytimes.com/2011/08/02/pentagon-seeks-social-networking-experts/\n\n\nFor funsies:\nhttp://www.defense.gov/socialmedia/",
            "[http://english.aljazeera.net/indepth/opinion/2011/03/20113308530388366.html](http://english.aljazeera.net/indepth/opinion/2011/03/20113308530388366.html)\n\nBut they're doing it to protect you from terrorists, so you ~~should~~ have to support it. ",
            "Yes, and sorry, apparently I was quoting last years budget, it is now up to 42 million.\n\nhttp://www.ukfastnews.co.uk/internet-news/pentagon-get-serious-about-social-media.html\n\n",
            "Ahh. Another crazy post. I'll move right along.",
            "Additionally, \"The Bonus Army incident proved disastrous for Hoover's chances at re-election; he lost the 1932 election in a landslide to Franklin D. Roosevelt.\" per Wikipedia  As if he were going to get elected anyway. (my aside)  As long as protest are peaceful and government actions are viewed as intolerable, protestors win.   That is why we have the Civil Rights Act of 1964.  Every thing MLK did in the South was against the law.  Most white Americans fail to recognize the greatness of his acts regarding government change.  Idiots who believe blowing up a building, will result in change are very wrong.  People who are willing to allow dogs to chew on them, swallow tear gas, allow themselves to be arrested, get shot, win.  If the US govt demonstrates it is no different than the Chinese in Tiananmen Square, Mubarak in Egypt, Gadahfi in Libya, Assad in Syria, etc. then other courses of action for change must be considered. But I do not believe the US Govt will ever do that.  ",
            "I'm not arguing your point, I am just saying that unlike cities, where they at best turn a blind eye and at worst detain you and give you a ticket, in D.C. they actually toss your ass in jail for days, and D.C. jails are not a fun place to be. Their jails are full of the drug warriors that infest D.C., and unlike other cities, these guys are hard-core.",
            "Visitor of the archived /r/reddit.com, **please visit [/r/eddit](http://www.reddit.com/r/eddit) to continue the /r/reddit.com tradition**",
            "The media is the 4th branch of the government",
            "Well, I know of one network that actually reports on this stuff and has for years, but y'all like to marginalize and ignore them, so who's at fault there?",
            "I agree, with the caveat that local governments are much more responsive to local citizens.  Given that local elections are often decided by a few tens of votes, a motivated citizen can often affect change in a way that's impossible except for a select few to do at the Federal level.",
            "You mean [like this?](http://dailyreckoning.com/louisiana-law/)\n",
            "The difference is, there are 50 states.  If I sufficiently dislike the way a particular state runs its affairs, I can pick up and move.  The Federal government is omnipresent.  To the extent that they even coerce foreign governments with regards to American expats.",
            "Since the executive branch appoint justices to SCOTUS who will tend to vote along with their political views, and the American people seem to have lost their outrage at government injustice or abuses of power, it seems quite reasonable that all 3 are now interested in maintaining the status quo.",
            "What makes you think they aren't?   Jockeying for the spoils of Federal power doesn't mean they don't work together to increase the scope of Federal power.",
            "I would love to hear you expand your critique of \"legislative and executive branches are working together to shield government from prosecution\".  \n\nPlease?",
            "It's a military action. He's commander and chief of the military. Or didn't you know that?",
            "tard, take American Government 101 some time. Congress controls the money now, which means it has the real power. ",
            ">so fat and pacified patriots.\n\nFTFY",
            "[Anwar al-Awlaki](http://en.wikipedia.org/wiki/Anwar_al-Awlaki#Fort_Hood_shooter) This guy is a terrorist",
            "That's a pretty rosy picture of the guy. Didn't he train in terror camps and send people out on bombings?",
            "what a twist!",
            "Convenience?  This isn't ordering a package from Amazon as opposed to driving to Wal-Mart, an extraction could have easily resulted in deaths of a dozen Marines, and no al-Awlaki.  ",
            "It's a multi-billion dollar industry.  You think we are protecting the fields just to kill time?    ",
            "I've certainly heard of crazier conspiracy theories than a government wanting to easily make money.",
            "Well it's not crazy, that is for sure. It wouldn't be the first time a world power has sought control over a substance, for some underlying reason. Think of the Opium Wars of the 1900's when the British controlled the OPIUM trade through India into China. This shit is not unheard of, and is far from crazy. Even if we don't know exactly why the CIA would seek control of it at the moment. Don't write someone off just because your ignorance can't comprehend the possibility.",
            "To answer your question, yes.",
            "Opium, used to create drugs which destroy minorities, give a great excuse to put poor people in prison and generate millions of dollars in revenue \n\nYes, the CIA has a vested interest in opium production",
            "On reddit enhancement suite. I don't have that on my desktop ",
            "Because he drew the line way beyond where he should have.",
            "Well, a lot of it is potentially very incriminating. Not just in the sense of being prosecuted in the US, but also because it could be used to expose spies to the countries they spied on. They can lock it in a vault, but there is always a risk of it being stolen unless it is just destroyed.",
            "I'm using the legal definition of precedent. Future judges may make similar decisions, but this judge's decision will not be used as the basis for those decisions.",
            "You can't rape the willing! There's boats leaving this country every day, folks!",
            "> I welcome our diminutive underlords\n\nFTFY.",
            "If it was, that was before they were taken over by the Koch brothers.",
            "I don't think anyone (not even the tea partiers themselves) know what they actually want. I'm not saying it as a slam against them as much as they have many 'offical' viewpoints that are in direct conflict with one another.",
            "Yep, and then someone it got reversed onto the government, because they were the idiots that did the bailout. We should have focused on those corporations that sucked away all of our tax dollars, not to mention our mortgages. ",
            "Do you not know the history of the 20's? No government control created the richest people in us history and led to the great depression.",
            "yep, keep downvoting the people who tell the truth. I CANT HEAR YOU LALALALALA",
            "So how's being smart working out for your country?",
            "you're also smart enough to stand idle as your rights are stripped from you",
            "Rioting doesn't necessarily involve destroying peoples' property, though it can.",
            "I say peaceful, enough blood has been spilt. A peaceful change would show other countries that America isn't the violent, overly aggressive regime they make us out to be. The 99% that didn't ask for it.",
            "Just because you hear and see the minority doesn't mean you know the majority. The fact that people are willing to protest says enough, the problem is anything but laughable.\n\nWouldn't it had been nice if they had picked something concrete? It would be interesting to see the governments take on it. At least then they would know when to stop protesting.\n\nI'm glad that anyone thinking they can shove with their guns would do so. An idiot who thinks they can to take on our military with store bought weapons is an idiot that will make great fertilizer 8ft deep. That is why we need dumbass cops to shoot marines.\n\nI said this before, but we should really protest for science. Shit would be so $.",
            "okay well as long as were all good...lol",
            "Authority is a gun.  Bullets and the willingness to use them legitimize it.\n\nFrom gangs in Africa to the floor of Congress and the UN this is the same.  \n\nNow get in line and keep your head down.  You're here at the mercy of the state.",
            "That's stupid text! Thanks for not thinking clearly and helping fuck up the country!",
            "The only people who state that have not educated themselves to the multiple choices available!",
            "DV?\n\nOkay, prove me wrong?",
            "It's within the discretion of the court. The court is making it clear that you must respect the rule of law by the ruling already. This is because the CIA admitted that in the tapes, through the records, they admitted pretty much everything (waterboarding etc.) the plaintiffs were alleging and had taken necessary institutional precautions to make sure it doesn't happen. Now, obviously, that last part is a load of BS in my opinion, but this is clearly within the court's discretion.\n\nAlso, remember, this is a Federal district judge's ruling. It's under appeal. Let's not jump to conclusions that \"courts rule US government above the law.\" Trust me, judges in general like to hold onto as much power as they possibly can just like the other branches of government do.",
            "Do you also know the part about the people destroying the evidence didn't necessarily know about the court's request?",
            "Thank you very much.",
            "Wow, did we just finally figure out what THE question is?\n\nHow many million dollars does the government spend to control social media sites?\n\nThe answer is... 42.",
            "Oh, absolutely.  Can't have no stinkin' terrerists infiltratin' er facebooks. ",
            "And thats all you are taking away from this mans original comment? He had some valid things to say.",
            "The Jails in the South in the 60s were no picnic either, especially for blacks.",
            "I see this a lot from the US. People are more interested in \"winning\" a debate and heaping blame back and forth, polarizing any discussion into them vs us rather than actually coming to an agreement about anything.",
            "Possibly they are more responsive because the local voters know where they live.  It is real easy to fuck over a bunch of people who don't have a chance of ever getting within 50 miles of you.",
            "Following that logic, you can always move outside the US.\n\nWait you say? The US can influence other countries? Much like how states here can and do influence other states? Like Texas flexing it's Board of Education trying to decide what other schools teach in the class room.\n\nOf course I'm different from you. I believe that people's rights can be just as easily trampled by government whether it be state or federal. Also, that no government (whether it be state or federal) should trample on the rights of the citizenry. Of course that's because I'm one of those crazy people who believes in the constitution...",
            "I don't think you understand how much our two main parties [hate each other.](http://www.bbc.co.uk/news/world-us-canada-15359136)",
            "This thread is a month old, how did you find it? This subreddit doesn't even exist anymore!\n\nTo answer your question, the senate/house and our president don't see eye-to-eye on...well, anything. And the things that they do agree on, they pretend to disagree on because Obama is the GOP's antichrist and vice-versa. Just how much do they make it a point to disagree on even the most insignificant details? [Take a look.](http://www.bbc.co.uk/news/world-us-canada-15359136)\n\nAnyways, if you want to talk about governments trying to dodge prosecution you should be looking at people like Berlusconi; America isn't free of corruption, but it's a heckuva lot better than most other developed nations.",
            "I wasn't aware they had declared martial law.",
            "If the government can bypass law and kill anyone as a military action, who protects us from our own government?",
            "but who REALLY controls (the people of) congress ? ",
            "learn to take a joke.",
            "[Also this, a tactic clearly demonstrated by the government constantly.](http://en.wikipedia.org/wiki/Learned_helplessness)",
            "Who received no trial or rights due him as a human.",
            "He was also an american citizen ",
            "Allegedly.",
            "He'll never get a chance to tell his side.",
            "I haven't read that. Where did you read it?",
            "[deleted]",
            "Obviously no civilian knows enough about this specific issue to argue FOR the assassination, therefore by default, we must be opposed to it.",
            "yea man, they bring em to the fair and whoever has the biggest seed wins.",
            ">Well it's not crazy, that is for sure\n\nIt kinda is. The Opium Wars were in the 1840s-1850s, and the British weren't exactly timid about what they were about - they needed a product to trade for, er, tea. (Are we sure that stuff isn't a drug?) And other Chinese wealth, but mostly tea.\n\nWhat would the CIA *do* with  opium grown in Afghanistan? You need to construct a plausibe plan before it becomes not-crazy. The CIA have  these nifty little flying robots to kill people for them. That's all they need in life! (... on a serious note, it will be interesting to see what becomes of the CIA, and maybe not in a good way. They've become a real paramilitary force as they've shfited energy to running the drones.)\n\nHey! I just realized that next time I discuss 19th century history with a British dude, I get to call the British Empire the original narcostate. Awesome!",
            "What does the CIA gain by putting poor people in prison? How do they reap the benefits from opium sales?",
            "ooh, sorry bro",
            "It must be an interesting decision as to what must be kept and what me must be destroyed ; I'm pretty sure there was instances in which they dearly wished something was still available for reference and vice-versa.",
            "Great plan... when your grass gets too long in the backyard just move across the street.",
            "Yeah, but the Koch brothers also opposed TARP, so I'm not sure how a Koch takeover would really make much of a difference.",
            "Well, certainly they're a broad group capable of independent thought, but the core event that coalesced the movement was the bailouts.\n\nIt's funny, because Adbusters (the same mag that called for the OWS movement) also [called for the Tea Party movement](http://www.adbusters.org/blogs/adbusters_blog/time_another_tea_party.html).\n\nThe two really aren't so different, people just enjoy pointing out political differences more than pointing out political unity.\n\nIt's funny, because Salon is currently taking the OWS movement extremely seriously while simultaneously publishing a book that cartoonishly mocks the Tea Party.  The Tea Party is the 99%.  ",
            "The Federal Reserve was established in 1913 and inflated the money supply for some time afterward, then suddenly contracted the money supply.\n\nNot sure what you're reading, but the Fed doesn't qualify as 'no Government control' to me.\n\nTell me, who are these people who created the great depression from no control? Name specifics.",
            "Huh? The \"Robber Baron\" era were when business and government were so intertwined that they were practically the same thing.\n\nThe railroads became monopolies due to the [Pacific Railway Acts](http://en.wikipedia.org/wiki/Pacific_Railway_Acts) giving them a shitton of taxpayer money. The government grants were paid per mile so the tracks put down were intentionally long and windy. Thats a business plan doomed to failure if it weren't for government money propping them up. The [Crédit Mobilier](http://en.wikipedia.org/wiki/Cr%C3%A9dit_Mobilier_of_America_scandal) scandal where business CEOs took government 'bailout' money and pocketed it for themselves is very similar to today's CEOs pocketing government bailout money.\n\n",
            "Let's see, at the turn of the century income tax started, in 1917 the tax rate shot up to 67%, and then it is a surprise that a dozen years later we were in the great depression?",
            "Hasn't the OWS protest's MAIN POINT been that income disparity is at an \"all time high\"? You can't have it both ways, broseph.",
            "Incoming retarded libertarian/Ron Paul argument about the Fed being the cause of the Great Depression.\n\nTo them, it's the government that created the problem. Not the lack of regulation that has been proven time and time again to biggest factor.\n\nJust walk away from arguing with libertarians, they like to ignore history and just rewrite everything as the evils of government.",
            "For me? Just fine. \n\nHow's violently rioting it working out in Italy? Oh they burnt their own cars and destroyed and looted small business owner's stores?\n\nWow that's sure fuckin smart.",
            "What exactly do you suggest? \n\nRioting and destroying stuff that the government couldn't give two fucks about?\n\nGreat, I'd love to get arrested, billed, and lose my job.",
            "The only difference between protests and riots is property damage.",
            "[deleted]",
            "From what I understand, the evidence showed that the videos were destroyed as part of a routine process. Still, you are not allowed to destroy evidence when requested by the court hence the judgment for the plaintiff. But, if you do everything within your power to remedy the situation and you did not destroy the evidence with the sole purpose of avoiding justice you are not held in contempt of the court. \n\nThis is, in my opinion, a standard judgment on discovery proceedings. Imagine if you were a defendant and you were going through what you routinely do and ended up destroying evidence. After this, you did everything within your power to recover records of the evidence and in doing so the evidence made you lose the case. Should you be held in contempt? That is by discretion of the judge.",
            ">We need to represent ourselves if we ever want to be represented fairly without getting buried under political bickering.\n\n>The only way The 99% can truly be represented in government is through a massively collaborative direct democracy.\n\nThis doesn't seem to work well for OWS. A saying I heard in regard to this is, 'if you don't supply leadership, leadership will be supplied'- and we see the results when the crazies step forward and claim OWS as their own.\n\nThere's a reason we have representatives, and I think we shouldn't abandon our democratic republic.",
            "Could not agree with you more.",
            "The networks aren't the issue. The lack of reporting the issues, though, contributes to the issues because then people don't know--and therefore are unable to do anything--about the issues.",
            ">Wait you say? The US can influence other countries?\n\nNo, I said they can *coerce* foreign governments.  To name one example - seizure of overseas assets held by American expats.\n\n>Like Texas flexing it's Board of Education trying to decide what other schools teach in the class room.\n\nThis is simply...bullshit.  Texas doesn't force their textbook decisions on other states.  Other states have the ability to commission their own textbooks if and when they disagree with the textbooks Texas orders.  The fact that they do not does not mean that Texas is operating in some extra-legal, non-constitutional manner.  It just means you are bitching about the waxing and waning of the tide.\n\n>Of course I'm different from you. \n\nYeah, you are much more of an egotistical ass than I am.\n\n>I believe that people's rights can be just as easily trampled by government whether it be state or federal. \n\nTo wit, what in the fuck made you think I thought this wasn't the case?  Oh, that's right, you probably *didn't*, but it's a lot easier to beat up on a strawman than it is to you know, actually respond to what was written.  \n\n>Also, that no government (whether it be state or federal) should trample on the rights of the citizenry. Of course that's because I'm one of those crazy people who believes in the constitution...\n\nGiven that we happen to agree on this issue and I surmise this is your fundamental point, it's amazing that you manage to come across as an egotistical, yet ignorant at the same time, asshole.\n\n\n\n",
            "Concerning your link....\"Senate blocks Barack Obama's school potato limit\"\n\nUm, the Senate is controlled by Democrats.  Obama is a Democrat.  ",
            "Do you understand that the premise was not that Congress and the Exec see \"eye-to-eye\" on anything other than this one issue?  Here, they are united against the non-goverment/state citizens.\n\n> don't see eye-to-eye on...well, anything.\n\nExcept protecting themselves (the state) at every possible moment at the expense of the private citizen.\n\nI agree (to an extent) with the point you are making but I feel it is not relevant to the discussion at hand. \n\nLet's keep the discussion on topic and forget about Berlusconi.\n\n> This thread is a month old, how did you find it?\n\nSkillz.",
            "Terrorists have no nationality or Religion thats why we shouldn't hate muslims because of their beliefs ",
            "Yeah, it's not like he's had years for people to know who he is and what he's done. We just randomly picked a person to kill.",
            "It's in this thread, even. Take a peek around.",
            "The government in Yemen has barely any authority outside Sana'a right now, and what remnants of the army haven't defected are either focused on propping up Saleh or fighting rebellions.  Yemen *was* a client state, now we're calling for Saleh to step down like everyone else.",
            "People in prison maintains control over the US. No crazy conspiracy shit, but it keeps minorities and poor people from being the problem that the government considers them\n\nFor benefits for opium sales, have a quick read about the Iran-Contra scandal and CIA imported cocaine ",
            "100% agreed. Everyone wants employment, economic stability, and a prospering economy free of corruption. If we stopped mocking the other sides and hippies and rednecks perhaps we'd find out that we're all suffering from the same problems. ",
            "Im reminded of that old Star Trek episode where there were two ailen races trying to kill each other. One black on the left side and white on the right and the other race black on the right side and white on the left.\n\nThe two groups wanted to kill each other but Kirk was just sitting there puzzled because he cant see that there is actually that big a difference between the two.",
            "I agree with you, the two movements are actually pretty similar. They're the same argument just one is approached from the right and the other from the left.\n\nI think most tea parties are misinformed and most OWS are naive. I think the core belief of people across the nation is that corporations have enjoyed too many perks at the cost of the citizenry.\n\nI will say though that I will never like the Tea Party. Their message and following is a little too close to overt racism for my liking.",
            "The Federal Reserve is private.",
            "Well jp morgan comes to mind. People like him manipulated the stock market buy working together to raise prices aka trusts. There were no real monopoly laws, no stock margket regulation, having trusts was legal, people bought stocks on margin. The banks, steel, railroads, General electric, all these companies were run without any kind of check.  To me, that is no government regulation",
            "You cant honestly suggest that income tax led to the depression. i can assure you it was practices which are now illegal with government intervention",
            "That is such a typical Scumbag Government:\n\nDo something to \"improve\" the country\n\nUnintended consequence... **every time**",
            "Exactly.  Italians are the last people who should criticize anyone considering they've put up with their current corrupt leadership for so long.",
            "We could, y'know, burn down something important, like Capitol Hill or something.....\n\nI'm gonna be tracked by the government now aren't I?",
            "Zing!",
            "Their government is afraid of them. The government of the US makes it's own people their bitch",
            "Yeah, not all riots are sports riots: flipping cars and breaking windows and shit. I'm pretty sure there's something in between sleeping in the street and flipping cars. \n\nI think they used the term riot to mean \"passionate protesting.\" It's an expression, and more of a statement of \"My country would be outraged in your circumstance\" rather than \"You should destroy your own shit!\" \n\nBut we'll do nothing instead. That's great, I love my tax dollars being used for war, not being able to find a job, and giving money to corporations without reasonable regulations.",
            ">Rioting and destroying stuff that the government couldn't give two fucks about?\n\nSolution: Destroy only government property. It's generally pretty well marked so it shouldn't be hard to find.\n",
            "Then don't call it a riot",
            "Im an american and Im not entirely sure \n",
            "D.own V.ote!",
            "Some evidence points to the people destroying the tapes not knowing. And, anyway, the CIA has owned up to everything.",
            "Tyranny or death!",
            "The networks are absolutely the issue. They have the means but no incentive to report issues. \n\nI'm not disagreeing with you regarding how reporters should work. Or how separate news outlets should focus on different topics to reach their target demographic. \n\nI'm just baffled by why the people who are not in a position to gain massive amounts of money in a very short amount of time choose to do what is a bad job for both themselves and their peers.",
            "Hardly stands in for his right to a trial, I don't think.",
            "[deleted]",
            "I'd love to hear the conversation where you convince the Tea Partiers that they are the same as the OWS movement....",
            "I'd love to hear the conversation where you convince the Tea Partiers that they are the same as the OWS movement....",
            "Yeah but don't get me started about Star Bellied Sneetches, the big frauds.",
            "or Babylon 5's Drazi with their green and purple scarves.",
            ">I will say though that I will never like the Tea Party. Their message and following is a little too close to overt racism for my liking.\n\nHonestly, this is the same BS that's happening to OWS right now.  People take a photograph of 2 or 3 people and then blow up this evidence into some kind of evidence of the nature of the entire movement.  Even though the Tea Party had to deal with shit [like this](http://tpmdc.talkingpointsmemo.com/2010/04/inside-man-how-a-prankster-plans-to-destroy-the-tea-party-movement.php) people still can take a photo of one asshole with a sign that says \"nigger\" and pretend that means the entire movement is racist.\n\nSimilarly the press (and opponents) can easily take selected photos of stand-out members of the OWS movement and pretend those people represent the group as a whole (when they don't).",
            ". . . with its chairman and board of governors appointed by the President and approved by Congress.",
            "> *\"The Federal Reserve is private.\"*\n\nhttp://en.wikipedia.org/wiki/Legal_tender\n\nNo, it's not. The Government arrests anyone besides the Fed who makes currency.",
            "Are you seriously honestly trying to claim that jp morgan was NOT in bed with politicians? That the two were operating totally independently of each other and that no politician ever passed any law or gave any government grant to prop him up?",
            "JP Morgan's business partner was one of the people who met with Senator Nelson Aldrich to craft the Federal Reserve bill on Jekyll Island.\n\n> \"The 1910 \"duck hunt\" on Jekyll Island included Senator Nelson Aldrich, his personal secretary Arthur Shelton, former Harvard University professor of economics Dr. A. Piatt Andrew, **J.P. Morgan & Co. partner Henry P. Davison**, National City Bank president Frank A. Vanderlip and Kuhn, Loeb, and Co. partner Paul M. Warburg.\"\n\nYou're sitting here implying that lack of Government is the problem, when the fox is running the henhouse.\n\nMaybe one day when you realize that the same bankers you hate on Wall Street are the ones whose ancestors created the Federal Reserve, you'll understand how the game is played.\n\n",
            "Yeah I'm sure that the government is afraid of people they can just jail, gas, and beat legally. ",
            "The problem being that the US have more or less banned protesting, at least vigorously.",
            "You're right, we're doing nothing #OWS",
            "The you still get billed, arrested, and lose your job. Solves nothing, condemns you in the public eye. You lose all sympathy and traction",
            "Ah, sensible well directed anger. That's how riots work.\n\n",
            "I wasn't the one who called it a riot in the first place. I, in fact, am the one arguing it *isn't* a riot and that we shouldn't. So why the fuck are you responding to **me**?",
            "[deleted]",
            "You'll have to ask someone who cares, but I think the reasoning was \"he kills americans, we don't want people to be killed getting him, let's eliminate him\".\n\nBut I really haven't been paying attention to it.",
            "It's highly speculative to assume that he would warm as much to Washington as Saleh did, or at this point that he'll even take power.",
            "It'd go similar to the conversation with OWS people about how they're the same as Tea Partiers... Rage and elitism. ",
            "The funniest part about that was how they just randomly picked their colors right before the fight.",
            "Not to mention that its notes are legal tender.",
            "Well, yeah.",
            "I make currency 5 days a week, 9 to 5.  It's called a job.",
            "idk, if Free Speech zones aren't an infringement of free speech, then anti-gun laws aren't an infringement of the second amendment. \n\nWeird that I'm for the latter and against the former. ",
            "Yeah, letting other people protest for your is a great example of doing something.\n\nAlso, 2 months of OWS hardly makes up for the 20-30(+?) years of complacency. Shit don't get this bad over night. ",
            "Presidential candidates who are not republican or democrat are basically seen as \"joke\" entrants. It's like in high school when you were voting for class president it was always the popular kid who won, but second place was a slightly less popular kid with just as shitty of ideas, then you have your third place candidate which is usually a tie between \"school sucks\" and \"Bart Simpson\". ",
            "Good, I hope you'll feel the same when people use similar reasoning against you someday. Don't come demanding your Constitutional rights, or I'll call you a hypocrite.",
            "\"rage and elitism\" kind of rings with a bit of rage and elitism all by itself. This is what needs to stop. Both groups are working towards the same ends but are banging on opposite ends of the nail. ",
            "*Private* legal tender.",
            "No govt is without corruption or greed so I suggest you clean up your own backyard first then you can worry about ours.",
            "Who are you to judge our involvement?  Like you can look at a handle and automatically determine if they are protesters?  I went hundreds of miles out of my way to participate in OccupyDC.\n\nAs for the time frame, you've got to start somewhere.",
            "Then there was the nerd that everyone picked on, he has the answers, but no one cares.",
            "Then there was the nerd that everyone picked on, he has the answers, but no one cares."
        ]
    },
    "I see what you did there, Youtube users": {
        "title": "I see what you did there, Youtube users",
        "score": 2493,
        "url": "http://imgur.com/Tp42q",
        "content": "",
        "num_comments": 168,
        "comments": [
            "If youtube users truly had a neutral response there would be no likes or dislikes because that picture means that 52000 fans hold a non-neutral viewpoint on the video. ",
            "[deleted]",
            "Hundreds of thousands of people working together, the internet has officially surpassed the UN.",
            "[deleted]",
            "The imgur gallery last time this was posted: http://i.imgur.com/qj5pZ.png",
            "This was submitted two fucking weeks ago. We might as well sticky it at at this point. ",
            "This goes for basically any neutral planet Futurama video.\n\nhttp://imgur.com/WhTwy\n\nhttp://imgur.com/ZZUum",
            "http://www.reddit.com/r/pics/comments/kc3pn/youtubers_are_awesome/",
            "That is actually pretty impressive, for youtube that is.",
            "for the lazy  http://www.youtube.com/watch?v=ussCHoQttyQ",
            "[I think I just ruined it.](http://i.imgur.com/1rsK8.png)",
            "[deleted]",
            "Tell my wife I said \"hi\"",
            "http://bash.org/?quote=666666",
            "Scruffy's gonna die the way he lived.",
            "I immediately searched this on the youtubes, saw that things were a little off balance and proceeded to do my part.",
            "*Finds video on youtube, \"dislikes\" to keep neutral*",
            "6,362 up votes 5,637 down votes cmon guise",
            "You might not know this but YouTube users are also Reddit users & visa-versa. ",
            "Check the number of 'My Reaction' things.\n\nYoutube takes this shit seriously.",
            "meh",
            "I went to the video, AND RESTORED THE BALANCE!",
            "its not like i have seen this reposted 3 times in two months...",
            "*Clever girl...*",
            "Switzerland has no opinion on this matter.",
            "I have altered the like/dislike balance. Pray I do not alter it further.",
            "I am completely neutral on this subject",
            "MUST UPSET THE BALANCE!!!!!!!!!!!!",
            "This actually happens all the time on Reddit, but for some reason they never make the frontpage.",
            "stop putting this link up! i've seen it at least 4 times on the last month. the fact that you're putting the same image on imgur is a major dick move. ",
            "After I saw this pic I had to go and Like the vid on youtube to upset the balance\n",
            "C'mon redditors, if YouTube can do it, we can do it. Lets vote this post down to neutral as well!",
            "i'm very conflicted about what to do. can someone please help me like this by disliking?",
            "Everyone once in a while, I see a small glimmer of cleverness on the nets that makes me smile.",
            "I've seen this before, and I think it's mostly Redditors that keep that rating. If you click around, you'll see that almost ALL the videos about that episode are kept neutral.",
            "repost of a repost of a etc..\n\nthis is always reposted with a few more thousand views than last time\n\nsearch bro",
            "\"This better not be that Neutral Planet joke for the 50th time\"  \n*Click*  \n\"God damnit\"",
            "what makes a man turn neutral?",
            "I didn't know youtube users were capable of such things.",
            "I have neutral feelings about this repost",
            "How about the faces on the side previews looking towards the top...",
            "god dammit i knew it was this before i even clicked on it. the op at least had a different title. but i cant down vote futurama.",
            "[removed]",
            "$20 says reddit users ruined it.",
            "I think youtube actually hacked that particular bar to make it appear like that, because these actual chances of this happening are astronomical",
            "Do they have older full episodes online legally anywhere like Hulu? ",
            "Which episode is this from?",
            "but...half of them liked the video and half did not -this is not a neutral response.",
            "Anyone who isn't blind could see too... and this has been posted like 10 times, and it was only interesting the first time. ",
            "You can see the same on a lot of Fail Blog videos on YT.",
            "Your a bit late to the party, this has been a common game on [break](http://www.youtube.com/break) videos and others for months.",
            "Everybody is *saying* they upset the balance, but I have proof that I've done [so](http://www.reddit.com/r/futurama/comments/kqpe9/may_god_have_mercy_on_my_soul/)\n\nEdit: While looking at my old post, I noticed that I had neutral votes on it... Touche reddit, you've gotten me again\n",
            "i did my part.",
            "youtube users? clever?\n\nSHOPPED!!",
            "It isn't the Youtubers, it is Youtube themselves who are responsible.",
            "this again? sigh...",
            "The real surprise is that the people who post YouTube comments were smart enough to do this.",
            "\"What makes a man go neutral, Kif? Lust for gold? Power? Or were you just born with a heart full of neutrality?\"",
            "stop putting this link up! i've seen it at least 4 times on the last month. the fact that you're putting the same image on imgur is a major dick move. ",
            "I watched this episode today. Weird.",
            "yuip",
            "RE-RE-REEEEPOST AWWWAAAAAAAAAAAAAY!",
            "I  have \"no strong feelings one way or the other\"",
            "\"I see what you did there, Youtube users\"\n Yeah we all did. About 10 times in the last few weeks. Fucking reposts man.",
            "ThePriceIsRight you are technically correct.  *The best kind of correct*.",
            "ThePriceIsASpoilSport.",
            "Sill, if you average the results, the response is completely neutral. ",
            "Its funny because you're right..",
            "If each individual is limited to a single account.",
            "A set of objects is different from it's individual elements. ",
            "[deleted]",
            "You were *that* kid in school, right.",
            "Son of a bitch, you know what?  You're right!  I want to downvote you into oblivion and make your comment disappear cause I thought it was awesome how there was an even number of likes and dislikes, but yeah, I'm just going to hide your comment.",
            "I don't not like you. ",
            "I agree, I've never cared about any YouTube video enough to vote it up or down.  If I were to do so now it would show that I care quite a bit.",
            "MELVIN!",
            "Strongly Neutral? :P",
            "I was more interested in the video [in the top right corner](http://www.youtube.com/watch?v=CmSlpSF3zkw&feature=fvwrel).  It looks like somebody is doing some mighty fine work.\n",
            "The \"tell my wife hello\" one was my favorite. Unfortunately I had to downvote it to do my part in maintaining neutralness.",
            "I liked it.\n\nStill unbalanced.",
            "All three videos were off by one like or dislike.  I fixed this issue.  Thanks for the links, my compulsion is done for today.",
            "Please... don't put the punchline in the title. =(",
            "Let's see if we can throw off the vote count and make the OP wrong.",
            "Where's Repost Man when you need him??",
            "http://i.imgur.com/zJhyq.jpg",
            "[This](http://www.reddit.com/r/pics/comments/kc3pn/youtubers_are_awesome/) was the last one i found, although I imagine that there were other ones before that",
            "It's a good way to say goodbye to r/reddit.com: a repost or a repost of a repost.  She died as she lived.",
            "I'm going to allow this.",
            "Considering that that is virtually impossible for YouTube users to do on their own, I'm going to go with this being another easter egg. Like &wadsworth=1 or googling \"recursion\".\n\nEdit: If you disagree, please elaborate. Do you honestly think someone could manage to do this, or do you think it's something other than an easter egg? I'm genuinely interested.",
            "I did my part, good sir/madam.",
            "That's \"Tell my wife 'hello' \"",
            "Odd, I had to like it to return it to neutral.",
            "I'm more like Germany: ambitious and misunderstood.",
            "After I saw this comment I did nothing.",
            "The chances are astronomical?",
            "v7:{\"i\":\"f40a1ceb1a92e7ee97ef35a06b1d69e2\",\"c\":\"7caa3f4f74528f0e38b611b6de81919b463d596180f8ab9e9d23f501682ca4ca5290d08fa33272a36de9062bfb6c6789b991d6a8f2971c980b6018c747ef46051f5724189d0f929c50d08e2ca681c368\"}\n\n---\n\nencrypted on 2023-07-9\n\nsee profile for how to decrypt",
            "Brannigan Begin Again \n\nS02e06",
            "[deleted]",
            "The momentum is conserved.",
            "The neutral kind of correct.",
            "At first I thought your response was including \"the price is right\" because they were in fact \"technically correct.\" And THEN it was realized that the username was technically \"ThePriceIsRight.\" However, it has now come to me that you may have been inspired to post such a retort when you yourself read the above user's name. \n\nNonetheless, out loud noises were made.",
            "He's also a total party pooper",
            "closest to correct without going over",
            "He's right though.",
            "You're confusing \"neutral\" with \"polarized\"",
            "Voting, regardless of the reason, shows a lack of neutrality. It's choosing a side.",
            "If only their taste in music was as good.",
            "[deleted]",
            "Reddit isn't an image board :/",
            "I just went to OP's video and the score was 26840-26839. I evened it out. I don'T think this is automated.",
            "These aren't just your regular youtube users, these are futurama fans. You can attribute them some semblance of intellect and cohesive thought.",
            "i am pretty sure that it is far from impossible to do",
            "TIL what happens when you google \"recursion\"",
            "Wow, did not know about &wadsworth=1.  When did that happen?",
            "Seeing as I just voted to make it even, this is definitely user-implemented. Yes, thousands of people do know how to rig online polls and like meters. Like when we storm foxnews.com to skew their polls.",
            "I upvoted you to cancel out your negative point.",
            "Thank you scholar",
            "On average, everyone has one testicle and one ovary.",
            "This is the difference between ambivalence and apathy.",
            "The average viewpoint would be the ratio of the number of people who liked/disliked the video to the number of views. Going from 0 (fully neutral) to 1 (fully emotionally charged). For this video it's (26316+26316) / 619734 = 0.085. Therefore, while the average view of this video is not particularly emotionally biased one way or the other, it is still fairly far from being entirely neutral. Almost 1 in 10 viewers were moved by this video enough to form a definitive opinion on its cinematic quality and/or subject matter.",
            "Or it was a very, very popular quote from another episode of Futurama.",
            "Swing and a miss.",
            "Each (-)opinion is the relational (additive) inverse of each (+)opinion.  As such, if it is polarized, the set, as a whole, is at 0, which is neutral. ",
            "Not voting is also choosing a side.",
            "I vote......NEUTRALITY! ~Makes 2 accounts~",
            "Not if you are voting to affect a tie.  \n\nAnd not if you are voting strategically - for example, I plan to vote for Cain in the primary to help Obama win the general :)",
            "> [REPOST!](http://www.techimo.com/photo/data/500/medium/756repost.jpg)\n\nFTFY",
            "I saw a video which was off by one as well. My take on that was that it does count likes and dislikes, but then it adds an appropriate counter-vote to make up for it.\n\nConsidering I have only ever seen them sway by one, and this includes thousands of votes, I don't think that's far fetched.\n\nAnd I agree with frickindeal. If we could \"like\" one a few hundred times to unbalance it, then wait, if it fixes it's self in a few seconds or a very short length of time I think we can assume it's an easter egg. If it takes a longer time, then I think we could assume it's the doing of a population of YouTubers.\n\nNot sure how we could organize something like this...",
            "I still think there's something at play keeping it \"close\", so that users feel like they're evening it out by voting.  Otherwise, the typical dimwitted YT viewer would vote \"Like\" because they like the video.  I think it's a bit of a stretch that thousands of people are keeping it even.  I'd love to see an experiment where everyone \"Likes\" the video to see if the balance swings.  ",
            "They are the greetest and would never do things for no raisin",
            "The task is to get each of the futurama \"Neutral\" videos to have an equal share of likes and dislikes, correct? Then here are some problems with a population doing it:\n\n* Assaults by other populations apparently just don't happen\n\n* YouTube does not update likes and dislikes at a quick rate. Similar to but not as slow as views, which you may have noticed.\n\n* Actually getting to an equal number would be difficult. Obviously you would vote for the lower one, but coupled with YouTube's slow update time, they would easily shoot past their goal repeatedly. Unless there is an actual mind behind this, such as 4chan/reddit/some forum, it is very unlikely.\n\nI admit that using the term \"virtually impossible\" was a gross exaggeration, but it is still an incredibly difficult task.",
            "It seems like half the videos on youtube nowdays have even like/dislike bar. All the comments say \"I liked it to make it even\". No you didn't, you just gave them another like. It's some sort of program.",
            "Also try anagram",
            "TIL I'm average!",
            "Half a penis?",
            "It's closer to 1.06 testicles and .94 ovaries.",
            "And is named Mohammed Wang.",
            "Actually, the average is slightly less than one ovary and slightly more than one testicle.",
            "And one breast (not counting man boobs).",
            "On average, everyone has two gonads.",
            "Depends which kind of average.",
            "\"If you choose not to decide, you still have made a choice.\" - Rush\n\n(Because everything is truer in lyrics quotes.)",
            "I disagree. ",
            "I'm quite sure Chuck Norris didn't vote. ",
            "I think that's called split personality.",
            "But we're talking about futurama youtubers, which I'd think is a slightly higher class of individual.",
            "Happened on a lot of failblogs videos recently",
            "lol what?",
            "TIL I'm not... :(",
            "No thanks I half one already.",
            "probably less because there are so many asians",
            "Repeating of course",
            "No, its slightly more than one ovary and slightly less than one testicle. There are more women than men. ",
            ":(",
            "Counting man boobs we all have 1.83 breasts (US only).",
            "By not voting, you're making a choice, but you're definitely not choosing any side. ",
            "The same way reddit looks at itself in the mirror?  C'mon now.",
            "Because only futurama fans have access to that page and none of them are dicks. \n\n /b/ should get a hold of it and we can see what happens.",
            "Some videos are always even in the like/dislike bar. I've seen some videos that have 300 views and 20000 likes and 20000 dislikes. Either someone is manipulating the system or I'm not as good at math as I thought.",
            "this whole thread seems so familiar...  \nDon't know why.",
            "Let's not get ahead of ourselves.",
            "Testicles into infinity!",
            "Which country are you looking at? :P I mean, I'm just going by Wikipedia's overall statistics.",
            "Oh uh..I didn't mean you...I meant the, uh, *other* Man Boobs...ya...that's it... Of course *you're* counted!",
            "Maybe [this](http://www.marvelousmanboobs.com/) will cheer you up. ",
            "Unless one side can be expected to have a lead over the other, especially a less than decisive lead. In that case not voting can be seen as tantamount to voting for the leading side.\n\nAt the risk of excessively quoting other people: there is a reddit user out there with an interesting account name that I think of now and then: sidevotesareupvotes.",
            "Or maybe it's just google rounding up/down when it's big numbers and you are seeing ghosts all over the place?",
            "Both the votes and the views take time to update. The views are very slow. If you see a video with 300 views and thousands of votes, that's because the views haven't updated yet but the votes have.",
            "Because it's the same thread as the last time this was posted. ",
            "You were diagnosed with Hermaphroditus? ",
            "I was going by the U.S. statistics. Does china throw the statistic in the other direction?",
            "My point was that not voting isn't *necessarily* choosing a side. ",
            "That it does mate :D. In fact current global is 107 boys to 100 girls."
        ]
    },
    "\"Police officer pepper-spraying a kid.\"": {
        "title": "\"Police officer pepper-spraying a kid.\"",
        "score": 2939,
        "url": "http://imgur.com/V1E9i",
        "content": "",
        "num_comments": 1491,
        "comments": [
            "Former Rio De Janeiro police officer Bruno Schorcht\n\n[Another source](http://www.policebrutality.info/2011/04/police-officer-pepper-spray-women-and-children.html)\n\n\n*During a protest in the metropolitan area of Rio De Janeiro police officer Bruno Schorcht pepper sprayed innocent protesters and even women and children! It was caught on photos and camera so the evidence is clear enough. He was spraying the pepper spray directly into the eyes of waiter Rezende Gustavo Barreto that now has to use sunglasses even at night because it’s so inflamed and damaged. The police officer got departed immediately by the general commander of the Military Police, Colonel Mario Sergio Duarte.*",
            "Before any reflexive US bashing starts, just like to point out that this happened in Brazil.",
            "Wow. What's really sad is that it looks like he's doing it as if it's an after thought, like he was on his way out and thought, \"whoops, forgot one!\"",
            "\"We've secretly replaced the silly string normally used with pepper spray.  Let's see the reaction.\"",
            "it was coming right for him!",
            "This is actually an AXE advertisement",
            "The officer doesn't really understand the true meaning of the saying \"women and children first...\"",
            "I'm a dick for laughing at this, but he just appears to be doing it so non-chalantly: \"Oh look, it's some black people.\" *SPRAY*",
            "I saw this happen in Eugene, OR several years ago.  Police decided to tear down a bunch of booths at a small local festival because they had an incorrect permit.  Booth owners tried to stop them from literally ripping the booths apart while saying they'd take them down immediately.  Not sure what happened next, but the police started pepper spraying the crowd.  The officers aimed above the crowd at kids on their parents shoulders and at the ground at kids walking around.  It was pretty fucked up.",
            "\"Hey little girl, would you like some silly string?! Okay, here you g-OHSHIT! WRONG CAN!\"",
            "He's just protecting them from the sun's harmful rays with some sunscreen.",
            "Why is this in quotations?",
            "This reminds me of Billy Madison when Norm MacDonald was spraying that kid with the hose. \"Mister, why are you doing this? I don't even know you!\"",
            "I have been near a cop spraying pepper spray, everyone in this pic would have felt the affect... I find this pic hard to believe. ",
            "I hope someone pepper sprays his butt hole someday.",
            "Here is what I have learned after **wait for it** researching the incident in question and not jumping to conclusions.\n\n* 1) The pic clearly shows the spray going behind the girl.  That's because he is spraying an adult involved in a scuffle not seen by the camera.\n\n* 2) Note the position of the cops head and the direction he is looking -- behind the girl and towards the ground.\n\nHe is not spraying the girl -- at least not directly.\n",
            "Not saying this isn't real, because it is, but is there any chance we are dealing with forced perspective?  Meaning he was spraying behind the mother and the girl?  Because I can see the lightness of the spray up until the mother's arm, then her arm seems clear.  I totally can believe the child got hit by mist from the spray, I'm just saying it doesn't look like he is spraying the child in particular.\n\n**EDIT**: From the source article: http://www1.folha.uol.com.br/cotidiano/939630-promotoria-denuncia-pms-por-jogar-spray-de-pimenta-em-criancas.shtml , this seems to be the case: (translated by Google) \"Images and photos posted between 23 and 24 March showed the press the moment when Captain Bruno Schorcht of the 12th Battalion of the PM, threw pepper spray into the eyes of a man and soldier of D'Angelo Pinel de Matos, the same battalion, reached two children aged six and seven years.\"\n\nIt seems to say he \"throwing pepper spray\" at a man, and the same spray \"reached\" two children.  To me that seems like they got affected by the mist of spray, and were not sprayed full on.\n\nAnd forced perspective results in photos like these: http://www.denzomag.com/2011/03/best-forced-perspective-photography-examples/ where people appear to be holding the Eiffel Tower, being smaller than a golf ball, smaller than a pigeon, holding 8 people in the palm of their hand, etc...  In special effects, they call the camera a \"one-eyed idiot\" because you can easily accomplish some effects simply by how you frame the shot.",
            "He is only seasoning the kid before eating it.\nEverybody knows cops eats black people.",
            "Regardless of where this is from - it needs to stop.",
            "sealing my place in history as commenting on the last popular post made to r/reddit.com",
            ">**Former** Rio De Janeiro police officer\n\nObv not taking place in the US. ",
            "That looks fake....",
            "Holy shit this post has been in the front page for 17 days.",
            "[Source](http://translate.google.com/translate?sl=pt&tl=en&js=n&prev=_t&hl=en&ie=UTF-8&layout=2&eotf=1&u=http%3A%2F%2Fwww1.folha.uol.com.br%2Fcotidiano%2F939630-promotoria-denuncia-pms-por-jogar-spray-de-pimenta-em-criancas.shtml)",
            "aaaaaaaaaaaaand i am gonna point this out right away. the cop is spraying a guy that is behind the girls. if you look behind the mom's head, you can see part of a man's head. that man is trying to hold back a man that fell to his knees and is still attempting to \"bite the officer's crotch\".  yes this little girl is getting some spray but he is not some cruel bastard spraying a little girl. even look at the spray you can tell.",
            "http://i.imgur.com/vgbr8.jpg\n\nToo soon?",
            "Oh come on now this is *obviously* the cop helping the little girl by giving her a refreshing spritz of cool misting spray on a hot day. Let us thank this officer for engaging with the people and clearly showing he cares for their comfort. ",
            "How many times is this going to be posted?",
            "I am just going to try to tell myself this is Photoshopped, so that I can sleep in ignorant peace. ",
            "This isn't a police officer in the United States. No gun is visible. Also, I can't think of a US law enforcement agency that has cars that look like the one in the background.",
            "A large assortment of hands in that picture.",
            "The mother and the 3 in pink have their eyes closed so don't think it's a shop. Most believable comment I've read is that there's someone resisting behind them and that's where it's aimed at. It does seem to go behind them. Bout time we had commonplace 3d images to sort this out!",
            "\"Suspicious quotation marks\"",
            "As someone who has had training involving getting sprayed with Oleoresin Capsaicin, pepper spray's big brother, I can honestly say that I would almost rather get shot than have that happen again, and anyone who knows how pepper spray feels and would still do that to a little girl deserves to get shot.",
            "I like your use of quotations. Makes it sound like the title of a work of art.",
            "I love the karma whoring here.  Jumping on the anti-cop wagon.  Did you just google \"cop and pepper spray\" and post whatever came up?",
            "\"those who would sacrifice freedom for safety deserve neither\" - (paraphrased) -Benjamin Franklin ",
            "I blame society.",
            "could this image be photo shopped? its very strange to me that a little girl is being maced and there is a complete and total lack of reaction from anyone in the vicinity. I feel like that hand with the pepper spray could have easily just been inserted there",
            "Some men just want to watch the eyes burn.",
            "How does a fake picture get this many comments and upvotes? WTF? ",
            "That looks fake....Are you sure it's not photoshopped?",
            "What a bag of shit.",
            "\"And some for you...\"",
            "Shes a child. This should never happen",
            "I was really hoping that it'd be a police officer with ground pepper in some light hearted spoof. Alas, I was disappointed and saddened instead. ",
            "Brazil?  So we're supposed to play \"guess which one's a shemale\"?",
            "It's actually a soothing blast of refreshing seltzer water. It was really hot out that day. \n",
            "\"she was trying to fight me, Sir!\"",
            "\\**SPRAAAAAAAY*\\*\n>\n\nCop (purses lips): \"Obsession.\"",
            "Do cops usually get pepper-sprayed during training so that they know what it is like? I think the military does something similar with tear gas, but rather for the purpose of preparing them for when it actually happens in battle. I'd make that a policy",
            "The quotation marks threw me off and I was expecting to see a police officer opening a can of Dr Pepper which proceeds to spray all over a child. This was not the case.",
            "\"to protect and serve\"",
            "http://www.reddit.com/r/pics/comments/gjacv/a_brazilian_policeman_being_helpful_and/",
            "Are you absolutely positive that isn't hair spray and he's just simply helping her keep stylish as he walks by???  He could just be very fashion forward...",
            "http://www.unnecessaryquotes.com/",
            "    Officer: \"Hey dude, look what this pepper spray does.\"\n    Dude: \"What are you talking about?\"\n    Officer: \"I just need to... find... someone. Ohh, here we go.\"\n\nHe is so nonchalant about it. Looks like he does it everyday, like he is almost bored :P",
            "That is terrible but I still laughed at the nonchalance of the cops attitude.",
            "lol",
            "It appears to me that the spray is disappearing behind the mother thus not hitting the child. And as this is a 2-dimensional photo it is hard to judge the distance between the girl and the spray, so the spray could very well be some distance away from her.\n\nJudging by the top comments here, though, I think I'm the only one who sees this.",
            "Soo obviously photoshopped.",
            "That's awesome!  I pepper spray kids all the time.",
            "\"Police officer helping a child put on her sunscreen.\"",
            "is.... is it bad that I laughed?",
            "Cops, the true heroes of the day!",
            "How can that guy in the white pants do that to a poor child?",
            "Asshole!",
            "I don't always hate cops, but when I do it's because of shit like this.",
            "He will get a promotion for that.\n",
            "Zoom in on that badge....now enhance it....gotcha",
            "I like how casual it is. I was expecting to see a harmless squirt gun in his hand and then I realized he actually *is* spraying a defenseless girl with pepper spray. Wait, what?",
            "head shot!",
            "I'm all for this guy being decapitated.",
            "Fuck that guy.",
            "The B.S. factor is strong with this one.",
            "This image again? Fish memory redditors.",
            "Olympics-welcome to Brazil!",
            "On the plus side, it's good to know Scumbag Steve is finally doing something with his life.",
            "Pics or it didn't......wait....",
            "In the Officers defense, she was probably \"being bad\".",
            "why is everybody so freaking calm in this photo?",
            "[That's bad.](http://www.youtube.com/watch?v=Q8WCltgHVbo#t=1m4s\n)",
            "so many interesting hands.",
            "No proof from this pic that it is pepper-spray. Also, can't tell if he is spraying behind the mother or at the children.",
            "I come from russia and I am ashamed to be brazilian today",
            "[It's real](http://translate.google.com/translate?sl=pt&tl=en&js=n&prev=_t&hl=en&ie=UTF-8&layout=2&eotf=1&u=http%3A%2F%2Fwww1.folha.uol.com.br%2Fcotidiano%2F939630-promotoria-denuncia-pms-por-jogar-spray-de-pimenta-em-criancas.shtml)",
            "Just crime prevention.",
            "Keep it classy Rio.",
            "Don't mean to say it's not a bad thing or it never happens, but it does look quite photoshopped ",
            "[deleted]",
            "I feel really weird upvoting this.",
            "So we're upvoting the abuse of children, right?",
            "some kids are REALLY annoying.",
            "Something tells me this isn't real",
            "It's binaca ",
            "Al Sharpton saw the picture and got outraged until he found out it was in Rio.",
            "\"But he had CLEARLY spotted the assault rifle she was hiding in her eyes!\" -NeoRush",
            "Brazil? Well, plenty worse shit goes down in Brazil on a daily basis. I'm assuming people came here assuming this was in the US.",
            "http://i.imgur.com/TZ6pU.jpg",
            "Could it be an air spray or something.  No one thinks it's odd that none of the adults near the child are reacting?\n",
            "She totally deserved it. That'll teach her to mad-dawg the law.",
            "First of all, that was in Rio de Janeiro Brazil. Second, it wasnt pepper spray. The police officers were part of a initiative to spray against Dengue. A kind of fever spread by mosquitos in South America. I was in Rio when this was happening. I got sprayed too. So please stop spreading sensationalism on Reddit just so you can be a karma whore. I invite people to downvote this to oblivion.",
            "I wonder if it is photoshopped.\n",
            "The blue and white badge on his right arm is the flag of Rio de Janeiro.\n\nJust mentioning that out of the blue. Nothing intended.\n\nNot that the fact that I live in São Paulo has anything to do with me pointing this out.\n\nNo, no, I'm just quoting geographical trivia.\n\nThought it might be useful to know that this happened in **Rio de Janeiro**.\n\nNot that Rio is known for violence or anything like that.",
            "I like pictures like this. Not because of the content of the picture, but because in the comments, I'm given a good chance to label all the douchenozzles correctly. Carry on, douchenozzles. \n\n(RES, by the by)",
            "There's no honor in that.",
            "As a police officer, I would certainly like to add a resounding WTF?",
            "Looks fake, doesn't it? ",
            "Seen this on the front page multiple times. Sigh.",
            "Wow they were actually punished? Ohhhh it wasn't in the US. Ok that makes sense. ",
            "In the US, idiots like to say \"man, the cops are just another gang\". In Brazil, the cops really are just another gang.",
            "Guys. It's not real, relax. If that was pepper spray I assure you the whole family would be affected, not that single child. Also, pepperspray doesn't look like that.",
            "What a dick.",
            "she probably deserved it",
            "His posture is so nonchalant.",
            "I call photoshop.   No one appears to be paying the slightest attention to this officer with the spray, the child simply appears to be crying.  The mother and other child are facing away, apparently unconcerned.\n\nThe stream from the pepper spray seems to be directed behind the three people.   ",
            "Boom! Headshot!\n\nThis is pretty inexcusable.",
            "Why are so many people in positions of authority total douche bags? ",
            "I shot some pepper spray from a can and it blew right back into my eyes because the wind changed direction where I was. No child deserves to have that happen to them ever.",
            "Why does this picture not quite look right.  It almost like it's manipulated but i can't spot anything that would prove that. Maybe it's just disbelief that anything like this could happen and be photographed. What is the source here?",
            "Go be black somewhere else.  ",
            "Here you go little girl. Some hairspray. \nWant some sparkles in your hair also?",
            "Fake anti-authority propaganda being peddled to reddit?\n\nSay it ain't so!",
            "That's the kind of thing people get shot for.",
            "He was just spraying them to see if they were actually aliens, but unfortunately he had already ran out of purple spray paint.",
            "He's just spy checking.",
            "ZING",
            "If that is real why isn't anyone else reacting? ",
            "Regardless of where this is from - it needs to stop.",
            "if theres one thing I've learned from Reddit it's to believe that every photo on the internet is shopped.",
            "maybe she deserved it.\n",
            "One of the bizarre parts is that only the one little girl seems to be affected by the pepper spray, which is weird because there's bound to be over spray on at least someone else in the crowd. Anybody else find it a little weird that momma don't seem to care either? ",
            "Obv not taking place in the US.",
            "Pigs will be pigs, no matter what country they come from.",
            "looks photoshopped to me.",
            "Maybe just applying [sun tan lotion](http://aceveda.com.br/blog/wp-content/uploads/2011/07/spray-pimenta-moradores-bumba.jpg)?",
            "WHY ARE YOU HURTING THESE PEOPLE?!?! ",
            "LMFAO! MADE MY DAY!",
            "I don't get where the 19k downvotes come from. ",
            "What a fucking sociopath.",
            "I give up.  About 1/2 way though the posts, I realized that many people on reddit are not well.  If you find humor in an innocent child being pepper sprayed, then you're part of the problem of society.  \n\n",
            "There's no honor in that.",
            "Context mother fudger, do you speak it!?",
            "He must be using the Kid-Away Spray.",
            "How come no one posts a link to the article?",
            "What the fuck is a \"Denmark\"?!",
            "> now has to use sunglasses even at night\n\nI'm guessing not as great as that song made it seem.",
            ">the police office got departed immediately\n\nSo, he was murdered a la Scorsese, or he was fired?",
            "[deleted]",
            "> and even women and children!\n\nKinda dislike that it implies that women shouldn't get peppersprayed for stepping out of line. \n\nChildren I get, but an adult regardless of gender, no. ",
            "But what about jail time? I think pepper spraying kids deserves more that just getting fired. If a civilian did this, they'd be in jail. If you're trusted to serve and protect and do this, you belong in jail for a very long time. ",
            "I'm glad someone thought to add some actual context to this image.",
            "To be fair, the kid was probably being a little shit anyways. ",
            "[deleted]",
            "So US cops are brutalizing people *outside* of their jurisdiction now?",
            "Thank god. For a second there I thought that something atrocious had happened. ",
            "Before any cop bashing starts, I'd like to mention that it's hot out and this is ice-water spray. ",
            "[deleted]",
            "But but black people. That doesn't fit my per-conceived notion.",
            "Also, it's a really old picture",
            "http://www.portalodia.com/noticias/brasil/policial-espirra-spray-de-pimenta-em-crianca-em-manifestacao-no-rio-de-janeiro-105343.html",
            "It doesn't matter.  We will just end up comparing the shittiness of Brazil to the shittiness of the US anyway.",
            "Oh, well, carry on then.",
            "[deleted]",
            "[deleted]",
            "Still! Poor kid. :[",
            "I knew that right away, because instead of a few weeks of paid suspension, this officer actually lost his job.",
            "also, let's be clear on this, \n\nthis is in fact a repost",
            "But but...this is Reddit we need to see an out of context picture of a police officer Pepper-spraying a child nicely set in the same time period that police are being hated here on reddit and America. Dont you change my already changed opinion sir. How dare you educate the masses? ",
            "Brazil is in America. If you are gonna shatter my bias, I am damn well gonna be pedantic about it!",
            "Yeah, it looks like he is in the same mode he would be in if he was spraying her with Silly String.",
            "I applaud that man for his thoroughness. ",
            "Almost as if it weren't pepper spray at all... hmm...",
            "That is almost as bad as the time I filled all of the fire extinguishers with gasoline.",
            "\"Don't do drugs or we'll do this!\"",
            "i believe he sprinkled some crack on the kid after this photo was taken",
            "Same effect. ",
            "So who do you spray first, the woman or the child?",
            "Actually, I think he understands it fine.",
            "There's a little bit left in this can.  *SPRAY*",
            "\"Gotta empty this can before I leave anyway.\"  I guess I'm a dick too given that I know that the true context is pretty heart breaking.",
            "Just like he would do if he were spraying insects.",
            "Hi fellow Eugenian :)",
            "[deleted]",
            "It’s not. Those are inch marks.",
            "Copy and paste fail.  ",
            "Speaking of, what ever happened to that dude who was going to stick the ghost chili in his butt?  ",
            "Kinky",
            "I have been about 15 feet from someone who got peppersprayed..holy shit it felt like it hit my face.",
            "If you look closely at the officer and the family and try to judge where they are relative to each other, and where the officer is looking, it does appear he is spraying behind them, at least to me.",
            "so it was really a case of \"OH CRAP A ROACH RIGHT BEHIND THAT FAMILY I BETTER SPRAY IT BEFORE IT ATTACKS THAT CHILD!!!!\"",
            "i agree 100%.  zoom in like a mother fucker and you can see that the spray disappears behind the girls and woman. ",
            "I think you're completely right. He's actually a few feet behind them. I first suspected something was off on account of the expression on the mom's face. Then I found your comment. Thanks!",
            "I'll take a seat over here.",
            "[removed]",
            "This was news a long time ago. You are the definition of a karma whore.",
            "Why didn't you just post the source? Jesus.",
            "And it's in Brazil. But screw logic, obviously every cop is evil.",
            "Too many.",
            "What a fucking piece of shit. Cop or not he should get beat to death for that. I've been hit with O.C. in the academy and as you said its no joke. It reactivates for days, and on children it can be fatal because it tricks your respiratory system into thinking that its shutting down. This is attempted murder of a child and he should be fucked to the fullest extent of the law. Piece of shit.",
            "http://www.youtube.com/watch?v=Wjt2sXXCcC8#t=2m35s",
            "Agreed. I have no evidence to back that belief up though.",
            "Yes, they get pepper sprayed during training as well as tazed, if they don't want to be tazed or sprayed then they aren't allowed to carry it.",
            "Every fiber of my being hopes that it isn't.",
            "So all of the news reports proving that this guy got fired for spraying kids in the face with pepper spray are lying?",
            "Nice try, Brazilian Police spokesperson.",
            "why are they idiots?",
            "Happy birthday, Offensive_Brute.\n\nHappy birthday, man.",
            "Its also pretty fake.",
            "The job attracts douchebags. You don't need an education and you get power. \n\nAnyone who would voluntarily take an authoritarian position should probably not be in that position. ",
            "Those who seek power are usually those who enjoy controlling other people. How many kindhearted folks have you known like that?",
            "It's not manipulated. It's just forced perspective. He's spraying someone who is behind the woman and kids.",
            "It's got a very flat depth of field (lack of in and out of focus elements) possibly because it was shot from a distance with a telephoto lens. That makes it look unnatural, bit it's an optical effect rather than manipulation.",
            "But he found it on the internet! It must be true!",
            ">Why does this picture not quite look right?\n\nBecause everyone in the picture looks like nothing is happening. Probably because nothing was happening.",
            "Knee-jerk suck-up authoritarian user reaction on reddit?\n\nSay it ain't so!",
            "I hope your referring to the Simpsons game from the early 90's? Cant remember what platform it was on, something like the Amiga. \n\nIf not it doesn't matter and you can keep the upvote as it reminded me of a great game.",
            "I lol'd.. then felt bad again",
            "Because the kid deserved it.",
            "THERE IS NO HONOR IN THIS!!!!",
            "My vision is augmented.",
            "I WEAR MY PERSCRIIIIIPTION GLASSES AT NIIIIGHT",
            "They moved him to another police station. But he is being prosecuted and he lost his promotion from capitain to major, that would have hapenned for now. Probably there wont be more than that. But at least he was not let totally unpunished. Brazilian law requires a due process to fire a policeman. It's good because it gives more independence from politicians, but this is the shitty part of it. ",
            "if you must know, they made him an offer he couldn't refuse.",
            "Yes, but only when it hits the news.",
            "Not really. They have much worse police than the US does and a lot more tolerance for corrupt cops (because the people hate the violent criminals and want their cops to be \"tough\" on crime).",
            "The subtle sexism under the guise of protection. People don't understand that while they may have good intentions when doing this, it ultimately ends up hurting gender equality over all. If my child is a boy, I will not tell him to not hit girls, though hopefully he won't be hitting anyone.",
            "Pepper spray should not be used punitively, in my humble opinion. It should be used to subdue someone who is threatening the well-being of the police, or someone the police are trying to protect, if it is the best option. Most women are not terribly threatening to most male police officers. ",
            "I think the point when people say that is that women are supposedly less threatening.  And I have to say that in the macho cultures of South America, that perception is still quite strong.  It's considered cowardly to attack a woman aggressively - the idea being that you're just being mean, there's no way it's necessary for self-defense.",
            "I kind of read it as \"groups of women with children,\" like in the picture, not that individual women should never be sprayed. *shrug*",
            "Actually, if you would quote the full quote...\n\n>Bruno Schorcht pepper sprayed **innocent** protesters and even women and children!\n\nThen you would see that it's merely saying that he pepper sprayed innocent people. Yes, it's also implying that pepper spraying innocent women and children is worse than spraying an innocent man. They're both awful, but it's a moral thing. Of course pepper spraying someone who *isn't* innocent would be less awful. The article would have no need to mention 'women and children' if they were actually doing something wrong. ",
            "Yeah, it's terrible how (a) they make it seem like women should be treated better than men and (b) that women and children are in the same category.",
            "It's a biological fact that women, on average, aren't physically as strong as men.  Since pepper spray is used when there is a physical altercation, that's relevant.\n\nEDIT:  My main point here is I think it's reasonable for the article to say \"even women and children\".  I read it as a way to say that that cop is a coward who picks on people smaller than him.",
            "Fuck no! we are shelterring our children too much. How do you discipline yours? ",
            "Yes, this is a hot, controversial issue and as a redditor, it is my duty to care about it for the next 3 minutes.  ",
            "It was a super secret squad consisting of NYPD officers, israeli settlers, a few women who fake rape accusations, the cast of the big bang theory, and chad kroeger.  After they finished, they confiscated a cancer patient's marijuana and went to crash a pro-bacon-evolution rally full of 99% anti-war protesters and kittens.  Also the squad is sponsored by Edison and the RIAA. ",
            "No, these are Brazilian cops. ",
            "Tony Bologna and his crew flew down to Brazil for the winter. ",
            "pretty soon the US is going to be pepper spraying children with remotely controlled drones... ",
            "Fucking NYPD caused apartheid",
            "I call shenanigans...",
            "they have to deter people from thinking they can immigrate one day.",
            "ahem. Mark Emery",
            "I just want to point out that this is not new and has been happening for some time now.",
            "WAKE UP SHEEPLE!",
            "I'm not in any way justifying the fact that this douchebag pepper sprayed a child, but let's put things in perspective. Government officials and police forces in the majority of African and Middle Eastern countries brutally and sometimes lethally beat citizens that show any sign of opposition, yet American police forces are continually referenced in stories such as this. Unbelievable.\n",
            "Again with the holocaust?",
            "We can never be sure. The cop probably struck preemptively because the child would deserve it eventually. You have to give the cop the benefit of doubt here.  \n\n/s",
            "I'm outraged! I don't care what that child could have done, the law is the law, and pepper spray is your right!",
            "Unfortunately, that video has been confiscated by the other officers.",
            "ahahahahah my god I was waiting for this one. well played. ",
            "Yeah this is pretty racist. \n\nNot all cops are white.",
            "Brazil was the last Western country to abolish slavery, and mixed race or full \"black\" people make up about 50% of Brazil's population.",
            "preconceived",
            "[deleted]",
            "I do believe that you meant \"pre-conceived\" notion.",
            "I REMEMBER THOSE CODES.",
            "I would love to see the context where a little girl holding her mom's hand and walking away warrants being pepper sprayed in the face. ",
            "Did you even look at the photo?",
            "Yes, shallow and pedantic.",
            "it's in AN America, which is part of The Americas.  But since we're speaking English, \"America\" is not the commonly accepted name for the land mass.\n\nALSO he said \"US bashing\", not \"America bashing\".\n\nSo you're wrong in 2 different way.  Sorry Michael Flatly, but are no longer Lord of Pedants.",
            "\"Oh fuck, this isn't silly string!  I hope nobody is taking a picture of this, I'll look like a giant asshole instead of a fun-uncle-style cop!\"",
            "He surely deserves a raise and a commendation for bravery.  Did you see how close that kid was?  Kids are dangerous.  ",
            "Here's the name and number of a doctor who will look at it for you. ... He's a good man, and thorough.",
            "I feel like the time you filled your fire extinguishers with gasoline was probably way worse. ",
            "We just replaced the CO2 with Hydrogen.",
            "\"Come on Johnson, sprinkle some crack on him and let's get out of here.\"",
            "If only the AXE effect came with disciplinary action for everyone.",
            "It's like (PE)(MD)(AS), it doesn't matter which comes first in each subgroup. Just go for whomever's closest and then move down the line.",
            "The women-children, duh.",
            "Hey Kid you've got a little something on your face. *SPRAY*",
            "What's the true context? I've been trying to find some context for this because it is fucking ridiculous and I want to know why it happened, but I can't find any.",
            "Black people can get sunburnt. Also, they get blacker, which is not as fashionable in black culture.\nEven on Kenya's leading women's magazine, the lady on the cover is almost white.",
            ">\n\"Copy and paste fail.\"\n\nFTFY",
            "He chickened out. ",
            "he chickened out.",
            "He realized that he could cause permanent damage to his asshole and decided against it.\n\n",
            "Same thing happened to my Dad once when one of his friends sprayed some jokingly inside a small room.",
            "No, a case of, \"I'm spraying this man in a protest and there is a family off to my right, who caught some of the over spray\".",
            "FYI: HammerThymeGun is a troll.",
            "I think it is legit:\n\nhttp://correiodobrasil.com.br/oficial-pm-acusado-de-lancar-spray-de-pimenta-em-criancas-no-morro-do-bumba-e-promovido-a-major/313321/",
            "Link doesn't work",
            "File not found.",
            "Source: File not found.",
            "The link is down because it's a lie.\n\nThis happened.",
            "I don't know where you took the idea that it was fake from, but it is certainly not. There are hundreds of newspapers with that exact same news and pictures.\n\n\nIn Portuguese: https://encrypted.google.com/search?client=opera&rls=en&q=policial+spray+de+pimenta+crian%C3%A7a&sourceid=opera&ie=utf-8&oe=utf-8&channel=suggest",
            "Do you have a source for what you're saying?\n\nEdit -- I see you linked to a source.  However that link is giving a 404.",
            "> Why can't everyone know everything that I know?\n\n-HammerThymeGum",
            "Where did you read this? You can't say something that attempts to refute the whole submission without providing any evidence of your own, or else I'll have to downvote *you*. Do you understand?",
            "No, it's [real](http://www.policebrutality.info/2011/04/police-officer-pepper-spray-women-and-children.html), it's just really old...\n\nOP just wanted some easy karma.\n\n",
            "File not found.",
            "Mirror: http://www.youtube.com/watch?v=Wjt2sXXCcC8#t=2m35s",
            "Obvious Troll needs downvotes, badly!",
            "\"File not found\"",
            "Well, I first looked for tell-tale signs of photoshop too because it was so hard for me to believe some asshole could think of any possible reason to do that.",
            "You need to relax man. Reposts are the price of a site where content is posted by the users and what's interesting is decided by them as well. It's great because you rarely have to see complete crap but everything has it's down side. Not everyone is going to see the things you've seen so reposts are inevitable and if it get's voted to the top then clearly most of the community didn't see it the first time or just really like it. Regardless it's ridiculous to expect the site to cater just to your wants and experiences when it's clearly been decided by the majority that something is interesting; even if it's a repost. ",
            "And yet you seem unable to provide any evidence to back up your claim.",
            "The police in other countries are a lot less tolerant. In america we don't deal with half the brutality that goes on.  ",
            "fuckin augs",
            "Just when I was looking for a \"My vision is augmented.\" comment, I found one. Upvote, good sir.",
            "SO I CAN KEEP TRACK OF THE RASHES ON MY EYES",
            "Wrong movie?",
            "they made him an officer... \n\n/**sunglasses*/*\n\nhe couldn't refuse.\n",
            "[deleted]",
            "Bingo.  You nailed it, and good call.",
            ">Most women are not terribly threatening to most male police officers.\n\nHahahahaaa...I see *you've* never had to arrest or subdue an angry adult female :)\n\nEdit: Citations/Examples: \n\nhttp://youtu.be/ZfdTbNDpVfc \n\nhttp://youtu.be/feJ0zOiv6ts\n\nhttp://youtu.be/pGrBr3QTkFU",
            "[deleted]",
            "Hold on. [Enhance.](http://i.imgur.com/Zph6O.jpg)",
            ">epper spray should not be used punitively,\n\nPolice should do nothing punitively, that's not their job.",
            "I think if you spoke with a police officer, you might change your tune..",
            "Sadly, your opinion doesn't line up with many department's protocols.\n\nPepper spray is a \"compliance\" tool. You don't do as you're told - get sprayed. Still don't do as you're told or out of spray range - Tazed. \n\nIf you're a threat to the well-being of an officer or someone else - you'll likely get shot. Nothing like a high velocity dose of lead to induce compliance.\n\n\"You have the right to remain dead...\"\n\nYea - that's VERY generalized and there's a lot of particulars at play. Point is - threats usually aren't responded to with 'compliance' tools.",
            "Agreed, but when you put things in terms of \"men\" and \"women,\" it muddies the waters. If the relevant aspect is physical size and strength, then use those terms, and train people based on them. \n\nWhat the kind of language we're referencing here does is further the notion that even physically small men are fair game for brutality just for being men, while women are off-limits regardless of size.",
            "Not with pepper spray?",
            "i make them eat broccoli!",
            "Discipline? Back in my day, you got pepper sprayed every month from the ages of 5 to 15. And you liked it too. How else could a 16-year-old hope to survive his ritual dinosaur hunt. You think a couple of sprays will make you the sort of man who bags a deinonychus? Hell no. My friend Billy had the sort of hippie parents who only sprayed him when he deserved it. What'd he bring home? A freaking microceratus. I bet he just stepped on it as he was running out of the village. Now he had to wear a tiny spiky head as an amulet and I get to wear a herrerasaursus hat. That's right, monthly sprayings mad me the man I am today. With one eye, one arm, and a dinosaur hat.",
            "Annnndddd time.  Oh look, a kitty cat is doing an AMA!!!",
            "3 minutes?!  Hey everyone, this guy's got a long attention span!",
            "Upvoted. My work here is done",
            "[*Shit...*](http://i.imgur.com/RidCV.jpg \"JEZAS\")",
            "First brought to you by Fox News.",
            "You forgot about the TSA.",
            "EDISOOOOOOOOOOON\n\nCOME TRY TO STEAL THIS PATENT OF MY BOOT UP YOUR ASS",
            "Switch Edison for Tesla, give it a twist ending so M. Night Shyamalan can direct the movie; then you've got something.",
            "I was about to flame you man...\n\n| | this close...",
            "Hey man, I don't think you got i--*ooooooooh*.",
            "how many is a brazilian?",
            "In the meantime we have to settle for killing them, with remotely controlled drones.",
            "Don't you miss the days of the manually controlled drones? Air Force pilots flying around on the backs of drones like they're motherfucking Atreyu riding Falkor. Heady days, my friend, heady days.",
            "Source?",
            "It's probably because we are held to higher standards rather than just rationalizing terrible acts just because another country allows it. So it is pretty believable actually. Sorry to burst your bubble. ",
            "Yeah, she might have become El Presidente some day and we can't have that.",
            "Reminds me of the joke where an Asian parent spanks their kid and the kid asks \"What was that for?!\" to which the parent responds \"Just in case!!\". \n\n/It'sobviouslyokayformetomakethesejokesbecauseI'mAsian. ",
            "[deleted]",
            "And the most Japanese outside of Japan.",
            "I'm sure he did too. How very astute of you notice his typo.",
            "How dare you correct me. I'm American.",
            "he was defending himself from sexual assault. the spray was his only line of defense against the brutality of a 5 year old girl",
            "I dont think you are catching the what was said here. That or you actually think that the picture and its actual meaning is not important. What im getting at is with a title like \"Police officer Pepper-Spraying a kid\" plus the picture of a white police officer spraying a black child makes it seem, without information other than a title and a name, that this is occurring here in America and probably near the protests. Sure it is not happening there but that will not change the fact that the general person riding around on reddit will not take the assumption that this is the protest here and that its more American Police Brutality. \n\nIt is out of context because it provides misinformation by using what the trend of reddit and the media recently holds portraying it as American in nature. \n\nIts a trouble that a sarcastic/satirical comment needs to be explained to be read correctly or to be applied correctly to the original posted Image.",
            "He was actually reaching for his gun. \"Dammit!\"",
            "They don't call 'em anklebiters for nothing.",
            "She could have given him a cold or softly kicked his shins. The balls on this guy",
            "That's why we have those [neighborhood signs](http://www.raising-redheads.com/images/Caution-Children-Sign.jpg) to protect us Americans.",
            "Some men just want to watch the world burn.",
            "\"Apparently this nigger broke in and hung up pictures of his family everywhere!\"",
            "It should be (P)(E)(MD)(AS). You cannot do exponents before parenthesis ever.",
            "Please Excuse My Dear Aunt Sally.",
            "I was fully unaware that you could do each group like that. If this is factual, then you just blew my mind.",
            "My teacher used the fictional character \"Imhu Pemdas\". On the last day of class he disclosed to us that Imhu stood for \"I Made Him Up\". ",
            "*BODMAS",
            "[deleted]",
            "Ah, thank you.  For the better I suppose, although I was sort of looking forward to the emergency room visit post.  ",
            "Then why is the spray directed downward at the child?",
            "ok, even if we assume that it was a man and not a roach or child he was aiming at, who do you know that non-chalantly stands there having a conversation with somebody, glances over their right shoulder, and then says \"oh, sorry, give me just a sec\", grabs the spay can like it's something he does every day and sprays down the obviously out of site helpless man laying on the ground?  While spraying the little girl would be really really bad, spraying an obviously helpless man that is out of site is also bad.\n\nexcept for my roach theory any way you look at this guy he's a bad guy.  so if you want a good guy greg from this picture you gotta go with roach. or possibly rabid panda. a short one.",
            "~~ Based on?~~\n\n~~Shouldn't we with hold judgement until the DP is no longer returning a 404?~~\n\nedit: See below comment, clears everything up. Thank you EnglishRoom, and screw you HammerThymeGun.",
            "Impressively so.",
            "For the record, I have seen the pic on reddit before, and the main consensus back then was that it was fake. Don't have a source or anything, just sayin...",
            "[Major Bruno Schorcht ... 20th Military Police Battalion...spraying the substance in two children aged 6 years and 7 years, apart from their mother, who also waited for the payment of social rental for families of the landslide victims.](http://translate.google.com/translate?sl=pt&tl=en&js=n&prev=_t&hl=en&ie=UTF-8&layout=2&eotf=1&u=http%3A%2F%2Fcorreiodobrasil.com.br%2Foficial-pm-acusado-de-lancar-spray-de-pimenta-em-criancas-no-morro-do-bumba-e-promovido-a-major%2F313321%2F&act=url)",
            "Thank you.",
            "Proof of the conspiracy!",
            "http://www.youtube.com/watch?v=Wjt2sXXCcC8#t=2m35s",
            "I like that in the world of the internet April 2011 is really old.  ",
            "She didn't ask for this.",
            "To infinity ... and beyond!",
            "Something usually happens. The bad cops get time off with pay, the poor bastards.",
            "I can confirm angry adult females are some shit to deal with... scary shit.",
            "The problem with this is that the average cop could easily subdue the average female criminal but it would take methods that would be controversial. Trying to subdue a female by doing the least amount of damage to her and keeping all the bullshit you could get hit for in mind (sexual abuse, brutality, excessive force, etc.) is hard. If I was a cop and needed to subdue some crazy woman and was having trouble because trying to hold her arms and keep her from hurting me as I try not to hurt her is very difficult I would just clock her in the face or something and I would be on the frontpage of reddit the next day with 100K people calling for my head.",
            "My point got muddled sorry. That last sentence was unnecessary and distracting from the point.\n\nBack to your point. \n\n1. Most male police officers should be able to take down and subdue most females, as the odds are they are bigger, stronger, and better trained. Key point being the last one, but the first two are important. This clearly doesn't apply universally, there are small police officers and highly trained women. \n\n2. Millions? I don't doubt for a second that that sort of thing happens, but millions seems out of proportion to me. I'm not saying you're wrong, but I'd love to see a citation.",
            "Millions?",
            "Dang skeeters!",
            "Cops are compliance tools.",
            "not suppose to be a compliance tool, meant to defend against immediate threat. so now instead of using your gun and do a shit load of paperwork, you now use OC spray or tazer and do less paperwork. Not to mention a significant reduced chance of death. \n\nthere's a difference between someone not listening and someone fighting you. \n\nnow to play devils advocate, women are just as dangerous.",
            "Makes me think of a Brian Reagan routine something like:\n\n\"My opponent wants to Tazer 7 year olds!\" \n\n\"I meant as a worst case scenario!\"",
            "I don't think some broadly worded department protocol makes it a good idea to start pepper spraying children.  \n\nGuidelines are often written with a fair bit of wiggle room, so that police officers can scale their action to the needs of the situation. I'm not sure these two small children need quite that level of force to gain compliance. ",
            "[&#3232;\\_&#3232;](http://www.howjsay.com/index.php?word=yea)",
            "Though others took it to be rhetorical, Polyether waited for an honest answer to his inquiry.",
            "You raisin' a bunch of pansies, are ya?",
            "Wait, what? *Oh.*\n\nCattle prod's still safe, right?",
            "If you start them on pepper spray really young, they'll develop an immunity.\n\nWe're breeding a future generation of super-protestors here!",
            "I love broccoli! ",
            "I'm calling CPS. 0_o",
            "Too much broccoli and then next thing you know BAMM! they're strong enough to fight back. Stick with a strict diet of hamburger helper, KD and Kool Aid.  ",
            "still needs verification....STEP UP YOUR GAME MODS",
            "AND MY AXE!",
            "HOLY FUCK WHERE I JUST REMEMBERED I FUCKING LOVE CATS ",
            "FAITH IN HUMANITY RESTORED\n\n38th time today",
            "yeah well at least my **HOT, NERDY GIRLFRIEND** appreciates that I can attentively take care of her needs after fulfilling my own.",
            "3 minutes?! Hey everyone........",
            "So you think it makes sense to bring up the US any time any cop anywhere in the world shows brutality? Wow, that *is* a bubble burst. ",
            "Good luck hanging on to your username there.",
            "What do YOU mean, you people?",
            "Best username ever. Upvote!",
            "Do you have an instrument so that I may hear the music of your people? Something loud, and buzz sounding.",
            "And the most half-black, half-Japanese hotties since... wowza.",
            "And the most Polish people outside of Poland.",
            "> How very astute of you **to** notice his typo.\n\nFTFY.",
            "[deleted]",
            "When I saw it, I didn't think that is was anything to do with OWS or the USA, I just thought it was a picture of a police officer pepper-spraying a kid.",
            "I think you missed the point were he asked for context and you gave what the context wasn't. Why was a little girl, in brazil, while holding he mother's hand and walking away, pepper-sprayed?",
            "[deleted]",
            "Brazil is in America, so...",
            "So, basically you blame other because YOU jumped to the conclusion that this was in the US [trying to defend it]?\n\nI dont see anything in this picture related to the protests, also, cop car doesnt look anything like they have in the US.\n",
            "I wish this was the top level post.  This deserves to be the top comment on this propaganda submission.\n\nI'm not saying anyone deserves to be pepper sprayed.  I'm saying that highlighting this particular injustice is not the primary objective of this submission.  It's more about OWS than Brazilians.\n\nI wonder what's next on *Reddit: Fox News Edition*.",
            "I don't think there is an obligation to label all pictures as \"in USA\" or \"Not in USA.\" If someone looks at an unlabeled photo and assumes that it must be from the US that is his own ignorance. Sure, more information would be helpful, but the correct thing to do when you have no information is to remain neutral until you do.",
            "Abuse of Power is Abuse of Power no matter where it happens.  Location is clearly irrelevant, especially when it comes to a child being pepper sprayed.  It is equally misinformed to downplay the content of a picture because it doesn't clarify the location it was taken in.  The picture speaks for itself, who cares where it was taken. ",
            "man, you americans are so obsessed with yourselves, not everything is about you you know!",
            "Some men you just can't teach, so you get what we had here last week.",
            "Some men just want to make the world's eyes burn.",
            "Is this a quote from a movie? If so, what movie? I think I would like it...",
            "[deleted]",
            "The name is Betty. Betty, you son of a pig.",
            "You can't in all situations. 9-10+3 must be done left to right. 10/10*2 also must be done left to right.\n\nYou don't just randomly decide which to do.  This ain't 'Nam.",
            "Not O Magazine.  There, everyone on the cover is always Oprah.",
            "Not true, sometimes they have people like Queen Latifa. Those editions do not sell as well. I'm serious. The Black edition of Vogue was stunningly undersold.",
            "Look at the cloud of mist(you can see the difference in the color of the trees above the police car).  It appears he was spraying the waiter/man mentioned in the story and following him down to the ground.  All that spray/mist in the air would be consistent with a extended spray.\n\nI'm just saying that this picture might be misleading, as it's 7 months old, and I haven't seen one official report that says the child was sprayed, and many that have said the man/waiter was sprayed very badly, and the children were affected by it. ",
            "He's not glancing over his right shoulder.  He's looking to his right.  And according to the other links mentioned here, he sprayed the waiter very badly, which would indicate that he kept spraying the guy, which would be consistent with this photo if he sprayed the guy even after he started going down.",
            "There is such a thing as forced perspective.  In these photos, people are not actually holding the Eiffel tower, smaller than a pigeon, etc... http://www.denzomag.com/2011/03/best-forced-perspective-photography-examples/",
            "One could use the -3k karma he's acquired in his 3 month history as one indicator.  Another indicator could be this video: [never gonna give you up](http://www.youtube.com/watch?v=Wjt2sXXCcC8#t=2m35s)!",
            "An impressive troll doesn't make it so obvious.",
            "I think the waiter was a guy.",
            "As a man who has been attacked by a woman, let me tell you, they are *vicious.* The whole idea that men shouldn't be afraid of women is complete bullshit, anyone with enough anger/alcohol in their system can fuck up your day regardless of gender.\n\nAlso, doesn't help that I'm 120 pounds and consist mostly of bones and sarcasm.",
            "Have being a role player for Home Land Security I had a student who lost three fingers to a women who bit them off through his glove. Girls are no joke for sure.",
            "Yup, precisely, which is why you see a lot of cops resorting to pepper spray and tasers when dealing with females, because if they did to them what they'd do to a male suspect under the same circumstances, they'd catch even *more* shit.",
            "[Here's](http://www.patientedu.org/aspx/HealthELibrary/HealthETopic.aspx?cid=M0907d) an overview of a study by Harvard Med School.  To quote:\n\n>When the violence was one-sided, both women and men said that women were the perpetrators about 70% of the time. \n\n",
            "Yes.\n\n* [Abused men often suffer in silence](http://www.canada.com/ottawacitizen/story.html?id=90542a7c-9b66-4918-83e7-f0f30369bc88&k=30804)\n* Men Shouldn't Be Overlooked as Victims of Partner Violence: http://pn.psychiatryonline.org/content/42/15/31.2.full\n* Woman Comparable to Men in Domestic Violence: Stereotypes and their Consequences: http://brainblogger.com/2008/06/08/woman-comparable-to-men-in-domestic-violence-stereotypes-and-their-consequences/  \n\nAnd finally an [analysis of hundred of studies on the topic](http://www.csulb.edu/%7Emfiebert/assault.htm) and a study on a perspective [why people don't know about this](http://www.springerlink.com/content/e762776483p24u47/).",
            "A cursory Google search turns up enough articles from different decades and nations to support that and/or a much larger figure depending on your timescale.",
            "[deleted]",
            "Meanwhile, junkduck continued to narrate others' lives, caring not whether it unsettled them.",
            "Spare the spray, spoil the child.",
            "Please don't throw me in the briar patch!",
            "[deleted]",
            "NAW FUCK THAT SHIT. THAT CAT IS A FAKE! EVERYONE FIND OUT HIS PERSONAL INFO AND LETS HARASS HIM! \n\nTOO MANY PEOPLE HAVE BEEN MAKING FAKE AMA'S AND GETTING UNDESERVED LINK KARMA WHICH THEY THEN SPEND AT THE REDDIT KARMA STORE. THEY ARE GAMING YOU REDDIT! ",
            "This is the post that made my sides hurt.",
            "Probably just another mentally challenged Pug, those fucking pugs. *Virtually shakes fist, to conserve the Doritos energy*",
            "This doesn't get old for you?",
            "[http://i.imgur.com/Fa6gT.gif](http://i.imgur.com/Fa6gT.gif)",
            "HEY! THIS GUY'S GOT A... oh what's the use?",
            "We're all very impressed.",
            "[deleted]",
            "And zee mozt of zee innocent Austrian touriztz people, ya, zimply zeeking a life of zee quiet peace and ~~lack of Jews~~ quiet.",
            "Oapedophilia! (joke curtesy of the inbetweeners)",
            "I don't think most people look for details in things like this.\n",
            "Yeah, but not the *real* one.",
            "I must admit that I'm guilty of assuming this happened in the US. This is because police brutality has been mentioned many times recently in regards to the protests, and I assumed this was an extension of the dozens of posts I've seen on the topic. I know there are contextual clues in the photo, but I missed them, and I'm guessing many others did too. ",
            "It definitely matters if people use it to justify a specific policy agenda.\n\nPolice brutality in Brazil, as bad as it is, shouldn't determine, say, pay scale or benefits for police in Newark, NJ.",
            "[Done trying to explain that I was not implying the picture was not as bad as it was](http://s3.amazonaws.com/kym-assets/entries/icons/original/000/006/707/nothing-to-do-here-template.jpg.scaled500.jpg?1313758301)",
            "Which is the way he wants.",
            "It's from Dave Chappelle's standup, *Killing them softly*",
            "Please Eat My Dick, Ass Suckers",
            "Please Excuse My Dick And Sack",
            "9-10+3 can be written as 9+(-10)+3. As long as you remember the 10 is negative, you can do it in any order.\n\n10/10x2 can also be done in whatever order, assuming you write it as 10x(1/10)x2.\n\nedit: Used x's because I don't know how to escape out of the *'s.\nAlso, I just had an epic cho game.",
            "i'm not asking for logic here, but rather a suspension of disbelief where a roach can attack the child.",
            "Is there a story behind it?",
            "After looking at that last video, I'd agree pepper spray is warranted. That's gotta be scary for the cop knowing there are all those people not on your side there while struggling to subdue that girl, and that any of them could be concealing a knife or other weapon.",
            "compliance as in respect my authority or compliance as in telling an angry mob to back off?\n\nIn this context (the picture) it seems like the former because there is clearly another officer going \"c'mon man, it's ok man, let it go man, she's just a kid.\"",
            "Shortly after pointing out junkduck's unsettling narration, PSquid was attacked by a group of strong-armed thugs... in fancy suits! Fending them off with nothing but a pool stick and well timed moves, he narrowly escaped with his life... \"Annie,\" he yelled at the top of his lungs. \"So, Annie are you OK? Are you OK, Annie?\"",
            "[removed]",
            "Is that in dog months, or regular months?",
            "What happened with that hard drive sewn inside the laptop case?",
            "I'm so tired of these dog vs cat platform wars. \n\nCan't we all agree they're both fine animals, depending on your needs, and it really just comes down to personal preference?",
            "Got my upvote from saying, \"reddit karma store,\".....Now go and buy yourself something nice",
            "There's a reddit karma store?",
            "OMG!  THERE IS A KARMA STORE?!?  LINK TO IT SO I CAN GO SHOPPING FOR RESPEKT!!!",
            "It's like your buddy that only knows one joke.",
            "<3",
            "Well, he gets it.",
            "And yes, you would like it.",
            "Upvoted for showing that subtraction isnt a mathmatecial operation. You're just adding a negative.",
            "Well good for you, I just had a really bad poppy game.",
            "He was responding to a bar fight and when he was performing a search to arrest the girl slipped through the pull ties and started to put up a fight with the officer. Some how during the struggle was when she got his fingers.  ",
            "[Oh please not at this hour, I'm hungover, I'll get back to you.](http://www.icims.com/blog/image.axd?picture=2010%2F7%2Fdog.cell-1.jpg)",
            "[deleted]",
            "[Jerry Maguire reply](http://i.imgur.com/ZmoV9.jpg)\n\nEDIT:Spelling",
            "I knew exactly what the picture would be, yet I still laughed out loud.",
            "every damn time I get in the tub... HELLO?!",
            "[deleted]",
            "And only has one axe.",
            "And his axe. ",
            "By that logic, neither is division; it's just multiplication by the reciprocal. ",
            "Did you guys just... summarize Reddit entirely in 8 sentences?",
            "I love how all redditors apparently have a stockpile of dog-on-the-phone pictures.",
            ">Jerry Maguire\n\nFTFY",
            "We can call it the X-Reddit",
            "r/dovic, but it has last been updated 10 days ago.",
            "Not exactly.  There's no result in subtraction that you can't get by just adding the subtracted number as a negative.\n\nMultiply/Divide by zero.  Aside from that example, I can't say you're wrong. I had someone with a stronger math background single out subtraction and explain why once. It's been far too long for me to remember the specifics :)\n\nThat said, I saw the comment I was replying to, and the name of the article the thread was in and got very confused this morning. I never needed the 'context' button so badly before.",
            "Let's see...\n\nPicture with no context? ✔\n\nTop comment bringing some context? ✔\n\nSarcastic comment? ✔\n\nNovelty account making a joke? ✔\n\nTalking about AMA? ✔\n\nKittens? ✔\n\nCriticizing mods? ✔\n\nComplaining about false promises? ✔\n\nCaptioned picture of animal? ✔\n\nI think that about covers it. Just add something about Wall Street and something about Valve and I think that's it.",
            "[deleted]",
            "[I made it happen!](http://www.reddit.com/r/X_Reddit/) ",
            "I don't really have any idea what this is, and am too lazy to actually read through it, [Urban Dictionary was less than helpful](http://www.urbandictionary.com/define.php?term=dovic)"
        ]
    },
    "Oh god my mouth touched it!": {
        "title": "Oh god my mouth touched it!",
        "score": 2071,
        "url": "http://i.imgur.com/U05a0.jpg",
        "content": "",
        "num_comments": 147,
        "comments": [
            "There was always that one water fountain in the whole school where the water was nice and cold and didn't taste like ass. It was like god's fountain.",
            "Why does that thing even exist? It seems very pointless to me.",
            "In grade school, we had these two ornate free standing drinking fountains on the playground, about 10 feet apart. I think it was kind of a showcase feature at the time the school was built. \n\nAt recess, a couple groups of kids would build \"volcanoes\" in the silty sand on the playground. They'd heap up the dirt, and meanwhile, a chain of kids would go to the fountains, take a mouthful of water, and then run over to the \"volcano\" and spit/dribble the water on it, while the other kids -- always just two -- built up the mountain on moistened dirt. \n\nThis would continue, and the industry of it all is an impressive memory in my mind. It was a constant line of water-spitters, racing back and forth from the volcano to the drinking fountains. \n\nAfter the thing got yay high, they'd start concentrating on the peak, forming a crater, while the two builders would start tunneling at the base, toward the center. \n\nEventually, their hands would meet, and the crater would reach the tunnel. \n\nAt that point, they would shake hands in a solemn ceremony, followed by much cheering and back slapping on the part of the water-spitters. The feeling of accomplishment was intense. \n\nAfter that, all the water-spitters got to take their turn reaching in and shaking hands with one another. \n\nThere was no class distinction between the builders and the water-spitters. Nobody was better than anyone else. The ones who were the builders were just the ones who got a good start, attracting the most water-spitters. \n\nAt the beginning of recess, maybe half a dozen volcanoes were started, and it was up to the water-spitters to choose whichever ones to add their efforts to. After a few minutes, a \"shakeout\" whittled the number of volcanoes down to two, as the builders who were unsuccessful at attracting water-spitters gave up and became water-spitters themselves. \n\nWhen the bell rang, we kicked and destroyed the volcanoes. By next recess, the dirt was dry enough to begin. \n\n",
            "[deleted]",
            "When I was in grade 4, an uppity grade 6 kid did a science fair project on the water quality from our fountains.\n\nWhat did they find? Turns out that whoever built our school went a little overboard on the whole 'lead pipes' thing. \n\n",
            "There was a drinking fountain at this park I went to quite a bit as a kid. It would constantly get clogged and the basin would fill with water. I remember drinking the fucking water straight from the basin several times in this public park where homeless people frequented. Makes me gag just thinking about it. \n\nAlternatively, I have a fairly strong immune system to this day. I think of it along the lines of George Carlin's \"Never got Polio as a kid\" sketch.",
            "It makes me cringe to be waiting in line and see the person in front of me (usually a little kid) put his cheek against the guard and mouth around the hole.  I want to shake him violently, [like this](http://www.youtube.com/watch?v=go6F9B0fod4), and teach him the error of his ways.",
            "[Here's the patent for the mouthpiece](http://www.patsnap.com/patents/view/JP3648278.html)\n\nIts purpose is to prevent the user from coming into contact with the jet nozzle. Before this, something similar to the mouthpiece was used as a \"bubbler\" to form a bubble-like spray of water that covers more surface area than the now-ubiquitous jet sprayers ([Engineering Review, Volume 21 page 72](http://books.google.com/books?id=mIFVAAAAYAAJ&pg=RA3-PA72&lpg=RA3-PA72&ots=hJHZQmKwxF&dq=drinking+fountain+mouthpiece+purpose&output=text#c_top)).",
            "I hated when kids would wad up a small piece of paper and stick it in one hole causing it to shoot out farther from the other. I always got wet from them.",
            "i used to hate when the retarded kids would put their whole mouths on the    thing and suck it like a titty, fucking disgusting.",
            "r/firstgradeproblems",
            "I was the kid who would never leave the water fountain, OCCUPY WATER FOUNTAIN.",
            "I was one of those kids who put their cheek and everything on that metal part. Because, why not? I didn't get the plague and that fountain usually had fewer people waiting in line.",
            "So why is that thing there anyway?",
            "almost as bad as touching the end of your penis on the toilet seat.",
            "When I was little I used to put my mouth RIGHT on the spout and would suck it down! \n\n...Oh god why?",
            "There is no way I'm putting my mouth on that thing, but I'll drink the water.",
            "I have to let it run for a full 10 seconds before the contamination is purged.",
            "[deleted]",
            "Once again reddit you remind me that I am not a unique and special snowflake.",
            "Protip: licking the water fountain spigot helps strengthen your immune system.",
            "I used to believe you had to put your entire mouth over that guard thing. But I never did, just thought that was how you correctly used the water fountain because why is it there?\n",
            "Not only did your mouth touch it but my dog licked it while he took a drink after he had just licked his balls.",
            "Just open your mouth and lunge desperately.",
            "There is usually two sizes of water fountains in a place. I always choose the one lower to the ground. Think about it, little kids don't have the scary diseases yet...",
            "[Drinking fountain industry porn](http://www.youtube.com/watch?feature=player_embedded&v=zZoDbrDjrAM#t=57s)",
            "TIL that the black plague fountain is located somewhere in JAPAN",
            "I wonder how many people had sex with that fountain?\n\nOr put used condoms on it?",
            "When I was around 4 or 5, I drank from one of those on the beach and put my mouth near the guard. I ended up getting hoof-and-mouth, and was in the er for a couple weeks because my entire throat was swollen shut, and had to be fed through a straw. \n\nHowever, this build some super antibodies in my system, and I virtually never get sick anymore. \n\nTL:DR - there is actual danger of outing your mouth too close to the metal.",
            "The best water fountains were always in the section where teachers normally roamed, since no students would tend to go in those areas to avoid them the fountains were less worn down. The water from them was always of the gods, and not from Hades like the football locker room...the horror.",
            "harry potter glasses",
            "Well, I've seen people suckle on that thing like a teat, so I try to avoid touching it with any part of myself.",
            "Does anyone know why some of them have two spouts that combine into one waterstream?",
            "Better chop your mouth off if you want to live.",
            "Not what I was expecting.",
            "In junior high I had a friend who thought that you were supposed to put the splash guard in your mouth to prop open your cheek.",
            "Inoculate yourself it's free, and will help you survive the impending apocalypse.",
            "I made out with that part when I was in second grade.  Oh god why....",
            "There was a kid in my school who put his entire mouth around the fountain head. Beware.",
            "\"Don't touch the metal!!!\"---Mom",
            "In secondary school biology we had some agar plates and we were told to go off and find something interesting to swab.\n\nI swabbed the inside of the water fountain nozzle. \n\nMy god what a foul green-brown sludge grew from my swab.\n",
            "That's what she said?",
            "Are these things (the \"fountains\") used anywhere else than USA?",
            "Yuckkkkkk",
            "That reminds me when I went to Mexico and went snorkeling but didn't wanna pay $90 to do it so instead we found another tour guide who said he will do it for $35 long story short I got strep throat. Should of paid the $90 to use a sanitized snorkel..... Lol",
            "And there was always that kid that would mouth the thing. Fuck it. Ill keep my dry mouth.",
            "'Potable,' nice touch. You shall receive one upvote from me.",
            "no need to panic!! Get a scissors and cut your lips off -- problem solved.",
            "I hated it when the person in front of you would drink FOREVER and then by the time it's your turn, the water's warm!",
            "I wonder if there are any published studies on the safety of those fountains.",
            "I wonder how many people would cringe in disgust at the idea of someone putting their mouth on the fountain, but would still pass around a joint or bong at a party...",
            "[deleted]",
            "I thought that way when I was 9 years old too.",
            "I've read that these are cleaner than the upright water bottles with the downward facing nozzles.  This might get mouthed, but it's self rinsing.  The water jug never ever gets cleaned in many places, and lots of different water bottles touch that nozzle.",
            "mmmm FUD",
            "Why does water taste better when you're thirsty....",
            "I read it as \"the Black people\" for a second there...",
            "As I burst out into laughter in my Engineering class everyone gave me that 'wtf' look.",
            "LOL",
            "Ah man, the seventh grade hallway water fountain. ",
            "we had 2 fountains next to each other.  a really nice one and a super ghetto one.  someone during my senior year put a sign above the really good one that said \"whites only\" as a joke.  the real joke was there were no minorities that went to our school.",
            "We had one of those at my work, but it was removed when we did renovations.\n\nI just bring drinks to work now. ",
            "The fountain at the very front of the school-- but it was always worth walking to no matter how far away you were, just for that delicious cold water that didn't seem to be recycled from the bathroom.",
            "I was in the basement of my school's Physics building once. One of the fountains had that sick, metallic taste with a dash of concrete. Like I was drinking the Invisible Man's blood. I told my friend (whose office is in the basement) about it, and he said, \"Yeah that's the better-tasting one.\"\n\nApparently the other fountain tastes like someone was constantly farting in the water supply and then mixing it with chlorine.",
            "we just called it sink",
            "I took a piss in that one everyday",
            "In 2nd grade I used to sneak into the kindergarten area for their water fountain for the reason you stated. It didn't taste like ass, and was like a god's fountain.",
            "I used to call mine \"The Oasis\"",
            "And it was always in the gym/weights area.",
            "To break people's teeth when you hit them in the back of the head. Seriously.",
            "[deleted]",
            "It is to indicate the direction of the water flow.",
            "god i love kids.",
            "When the water drinkers got back to the volcano, did they communicate the location of the fountain to the others by doing a little dance?",
            "Sounds like \"Adam\" may be pretty popular with some guys now",
            "Liar.",
            "[flange](http://en.wikipedia.org/wiki/Flange), not [phalange](http://en.wikipedia.org/wiki/Phalanx_bone).",
            "I came here to say the same thing about a kid I went to elementary school with named Adam!  He was sliiiiiiiightly mental handicapped, a touch of FAS, I think.  But yeah, he just slurped away on that metal.  *shudder*",
            "More than likely it was lead solder used to join copper pipes, not lead pipes themselves.",
            "People at my high school did that.  It was pretty common, actually.  I think most people I went to high school with did it this way.  \nAs a homeschooler entering ninth grade and witnessing this atrocity for the first time, I was so mortified that I never drank from any of those fountains for the next four years.  ",
            "How do you take a drink without looking at it or letting it run first?",
            "LEAVE SOME FOR THE FISHES, MAN",
            "Adam?",
            "Haha i wonder why, man",
            "I used to think the metal thing went *inside* your mouth.  (Don't worry, I never used them until I realized I was wrong about that.)",
            "You are meant to put your cheek against it, for, um, I dunno, comfort.",
            "It's to keep the water from splashing away from the arc.",
            "> Not only did your mouth touch it but my dog licked it while he took a drink after he had just licked ~~his~~ my balls\n\n**FYFY**",
            "Until you realize those little bastards eat mud pies and boogers for lunch.",
            "Good lord why did I watch that whole thing? \n\nYou know, I think I need a Haws drinking fountain for my home. ",
            "HAD sex with the fountain? I'm gonna guess somewhere around zero. Please oh please don't let me be wrong... ",
            "This is not how antibodies work.",
            "Ha those are eye washes.",
            "the UK, everywhere else, we just drink from the tap on the sink.\n\nopen water stream, rotate head, drink.",
            "this has not been funny for years",
            "Go to ELI5 to ask.",
            "Why does food taste better when you're hungry...",
            "Ours was the one in the eighth grade hallway right in front of the library. Until they shut it down. It was a sad day. ",
            "filled with copper",
            "Holycrap, Fish! You're still alive?",
            "But putting your mouth on the nozzle is how you make it come out? At least that's what the guy in the back alley told me. Was he wrong?",
            "Please do not put your mouth directly on [The Nozzle.](http://www.youtube.com/watch?v=H8yQhXDquII)",
            "When they're acting like that, yeah. But recess was only 20 minutes, twice a day. ",
            "Oh, no! It was drop the water, and jog back and get in line to the fountain. Keep busy! Keep busy!\n\nI have to admit though, it's a good idea. ",
            "[Flange](http://www.urbandictionary.com/define.php?term=flange).\n\nBonus comment: I'm drunk as tits right now but try saying \"flange\" with the same tone and delivery as that fucking penguin power animal from Fight Club.",
            "I read that as Falange, and thought „well, I can't imagine a gay section of the Spanish fascists, but I studied another group, so what do I know?“",
            "THERE IS NO PHALANGE ON THIS PLANE!",
            "here's a few points for you!",
            "They call them digits but they're technically known as the phalanges...",
            "Why would they use soldiers to join copper pipes? Shouldn't they be doing drills and preparing for battle?",
            "Where the fuck did you go to school!?",
            "Seriously, as a kid I always had to let it run for a good 5 seconds to wash the germs out of it, even pressing down different amounts to have the stream go low, then high, hitting all the metal parts it could to wash them clean.  \n  \nPerfectly normal behavior for an elementary kid, right?",
            "Just a habit that when you do it so much you don't think twice. For instance when we were walking in line at school and saw the fountain coming up I would dip out and take some water as fast as I could without the teacher seeing me.",
            "FISH HAVE SEX IN THAT SHIT YO.",
            "yes?",
            "now that I think about it, the water probably gets in your mouth sooooo easily....not a drop missed.",
            "Drinking fountains as self-intubation stations.  Fun!\n\nedit: spellin'.  thanks nvrwastetree!",
            "I'm pretty sure you didn't fix that for me. You made it make less sense. \n\nEdit : TIL alien blue doesn't show strikethrough. ",
            "I watched the whole thing too. I don't know why, all I know is that it's going on facebook.",
            "I know. It was along the line of a joke my doctor told my mom years ago, when they were trying to infect me with chicken pox, and it took almost 2 months of contact (it was going through the school, I was one of 3 people left in my class, so they kept switching us around to other rooms as it spread) , after asking the doctor why I wasn't catching it, he shrugged and said my immune system might be killing it off due to some sort of illness when I was younger.",
            "haha I was thinking of one of [these](http://img.ehowcdn.com/article-page-main/ehow/images/a07/i8/2g/repair-elkay-drinking-fountain-800x800.jpg), but imagine another hole right above it shooting water into the stream.",
            "Some countries, the only water that's safe to drink is in bottles. Yuppies visit these countries, and think it's because the bottled water is so good, and insist on being able to buy it, and an incredibly wasteful industry is born of pretentious ignorance. \n\n",
            "That's what she said.",
            "[deleted]",
            "In highschool they decided to replace a drinking fountain by one of the side entrances. For whatever reason they left the old one sitting there after removing it so a friend and I took it, loaded it into the back seat of my car and took it to a field where we beat it into pieces with a bat a la Office Space. We rolled the remains down a hill into some shrubs.\n\nThere's no real point to that story, it was just a fun way to spend an afternoon.",
            "http://www.abevigoda.com/",
            "^ This is true.   I heard the same thing from a hole in the wall in the bathroom. ",
            "I certainly wouldn't mind...",
            "no i mean im a pedo.",
            "Me too, so as a followup, imagine how Marla says it when she takes its place.",
            "Southwestern Wisconsin.  \nOh and have an upvote for presumably smoking bud =]",
            "When I was a kid, we drank from the dirty ass garden hose while playing on the front lawn and didn't think twice about it.\n\nWe're shaping our children into some serious pussies nowadays.\n\n(Not you in particular; it seems to be a generational thing.)",
            "I would collect water in my hand and throw it all over the top of the water fountain to rinse the germs away!",
            "Pinkman? ",
            "Self *intubation* station\nFTFY",
            "dunno some of them have another stream higher to fill water bottles",
            "I know :D\n\nIn the First world it's quite the opposite however, In some places, [Tap Water Is Cleaner Than Bottled Water](http://www.care2.com/causes/tap-water-is-cleaner-than-bottled-water-and-other-shocking-facts.html) \n\nNot to mention, since [40 percent of all bottled water in the U.S. is actually taken from municipal water sources](http://www.care2.com/causes/tap-water-is-cleaner-than-bottled-water-and-other-shocking-facts.html#ixzz1bY0M8y2e) is actually more fresh.\n\nIn addition to that, Tap water is actually checked for [E. Coli](http://en.wikipedia.org/wiki/Escherichia_coli) while [Bottled water is not](http://www.onlineeducation.net/bottled_water/water_full.jpg).\n",
            "touché",
            "Fucking white power structure.",
            "If only they had an RSS feed.",
            "Hehe, well played you crafty devil. ",
            "Haha, what an asshole.. *Oh..*",
            "I actually was a fan of Hose water.",
            "Some study said the plastic in the hose sitting in the sun all day gives you cancer if you drink from it... What doesn't give you cancer anymore?",
            "Reddit at its finest. You were downvoted for your comment. \n\nProbably by some twitch-pinky sophisticated bottled water drinker who keeps up with the celebrity gossip and *just does NOT want to HEAR it!*\n\nFucking reddit and its aggressive ignorance... ",
            "[deleted]",
            "I read that as a white powder structure and immediately visualized a model of the Eiffel Tower made from cocaine.",
            "His moniker refers to his rectum, not his personality. ",
            "who?",
            "[deleted]",
            "[deleted]",
            "Instead of chiseling, use lasers to cut stuff away",
            "It seems like it'd be better to have an Eiffel Tower mould and then inject the cocaine into it, at high pressure so it compresses and holds its shape, perhaps with some sort of bonding compound.",
            "in that case, yes it was appropriate",
            ">some sort of bonding compound\n\nWOAH, you cuttin' your shit, man? You tryin' ta fuck me?"
        ]
    },
    "I used to keep this Berkeley Breathed \"Bloom County\" comic in my high school locker in the late 80s. For the record, I snorted the dandelions.": {
        "title": "I used to keep this Berkeley Breathed \"Bloom County\" comic in my high school locker in the late 80s. For the record, I snorted the dandelions.",
        "score": 1687,
        "url": "http://i.imgur.com/Z3Op2.jpg",
        "content": "",
        "num_comments": 189,
        "comments": [
            "God we had good comics in the 80s.  Billy and the Boingers forever!",
            "More skin on HBO!\n\nL.H. Puttgrass - signing off and heading for the tub.",
            "I used to have a copy of the first version of the Bill and Opus screensaver. The one where Opus shot flying toasters and Tyrannosaurus Bill Gates would chomp Bill the Cat's head off. I think the floppies went bad at some point and I've been scouring the Internet for years trying to find a copy of the original. I'm sure it's out there somewhere. I'll find it. Eventually.",
            "Right, so today Reddit has put two of the three great 80's comic strips at the top of the front page. Now we need to get the Far Side on there so the Triforce will be complete.",
            "I cut this out the day it printed and hung it on the door of my dorm room for years. Still have it in a folder. \n\nMy favorite was Opus proclaiming it to be the wonderful morning of a glorious new day with his flippers raised to the rising sun.\n\nAnd in the last panel he's on his back saying \"of course one day the sun's going to explode and we'll all fry..\" and Milo is leaning over him saying \"Oh, stop it.\"",
            "I was not lucky enough to have a local paper that carried Bloom County, so I didn't discover it until 1990, in college. I have almost all the books, including \"A Wish for Wings that Work\".  \nWhen the movie \"Secondhand Lions\" came out, my wife and I were in the theatre, and I said, \"That HAS to be Berke Breathed's drawings!\" Yep!",
            "A boy and his penguin!",
            "[For those that don't know Bloom County is being collected into several new volumes with footnotes and things from Berke Breathed](http://www.amazon.com/s?ie=UTF8&tag=mozilla-20&index=blended&link_code=qs&field-keywords=bloom%20county&sourceid=Mozilla-search#/ref=nb_sb_noss?url=search-alias%3Daps&field-keywords=bloom+county+complete&rh=i%3Aaps%2Ck%3Abloom+county+complete)",
            "http://imgur.com/qQm8Q.jpg\n\nNever knew there was more out there than this. My dad gave me this book, its from 1979 and is absolutely hilarious. \n\nSteve Dallas is the man ",
            "Massive Bloom County fan right here. Massive. ",
            "I love when that guy - the one in the strip the OP just posted - quits smoking, and ends up in a kitchen in his underwear with a bunch of twinkies.  Also, Bill the cat and that band he and the rabbit were in.  Man, I need to refresh these memories.",
            "my gamertag was actually alf mushpie for five years, until i gave up explaining who that is. some of you might remember her as the freckled, frumpy girl who went on a date with milo. \n",
            "\"Pear Pimples for Hairy Fishnuts!\"",
            "Breathed was one of my favorites till he went all \"Mary Kay Commando\" on everyone.  His story that prefaced one of the books titled the \"Great LaRoche Toad-Frog Massacre\" still makes me giggle.",
            "I'm so thankful, despite being born in 1983, my parents let me read Bloom County.  That comic is so under-appreciated.",
            "[deleted]",
            "Lucifer, do yer duty!\n\n Slam my head, shake yer booty!\n\nWham, bam, thank you Nell,\n\nI'm on the Amtrak to hell!",
            "I'm a child of the 90s. I remember my Dad giving me his complete collection of Bloom County comics one year. I learned a whole hell of a lot about humor and the eighties. \n\nMy favorite comic to this day.",
            "Bloom County is my favourite comic strip; and the one you posted is one of my favourites out of the whole series. Thanks for posting :)",
            "When I was a kid my favorite comic was Bloom County. I own all the compilations. I simply cannot give you as many upvotes as I would like for this. Thanks for the nostalgia.",
            "If you haven't already, you should all go read his old [The Academia Waltz](http://www.gocomics.com/academiawaltz/2003/12/08) comics written while he was at The University of Texas. A lot of the strips are pure gold, especially if you're from Austin and/or attended UT. ",
            "I've always loved Bloom County, but I'd never be so silly as to emulate something from a comic strip.  Now, if you'll excuse me... I believe my order of 47 RonCo Turnip Twaddlers just arrived.",
            "I am who I am because of that man",
            "it's a metaphor. for weed",
            "People talk about icons of an era~ Bloom County, to me, is the icon of its era, in an icon poor era!",
            "When I first saw the linked strip I thought it was another work of Garry Trudeau, creator of Doonesbury, but I guess he and Berkeley Breathed just have similar styles.",
            "The Woody Allen thing always, always got me.",
            "Swat my hind with a melon rind but dats mah penguin state of mind\n",
            "Ahead of its time",
            "My dad had the whole collection of Bloom County books, and he wound up giving to me.  Best gift ever.",
            "Bill the Cat for president!",
            "Grew up reading these as my mom collected all the books. I haven't thought about it for years, but thanks for bringing back a pleasant wave of nostalgia. I remember the \"Billy & the Boingers?\" book came w/ square lil EP record for turntables.  Never heard it as mom wouldn't remove it from book. Gotta see if she has these or they're boxed & in her attic. I better get them in her will. ",
            "berke is my hero.",
            "Over the last few years they have been printing every bloom county strip ever published. They just released volume 5, the last volume. My mind was blown as I read things I've never seen before that never made it to the original collocations.\n\nhttp://www.idwpublishing.com/catalog/series/1019",
            "No idea what this is about or why it is so great.",
            "Also, don't smoke raisins.",
            "I love Bloom County. The Night of the Mary Kay Commandos was the first book I owned of his. Ahhh memories...",
            "Loved Bloom County.. greatest strip of all time.  Outland and Opus were not as great, but still ok.  I feel that Bloom County would do very well now with all the political material to draw from.\n\nPortnoy - \"Let he who is without sin cast the first stone - so I cast that mutha!\"",
            "I loved reading Bloom County, I used to go straight for it after my parents were done reading the paper.  I was about 10 at the time, so finding those comics awesome and hilarious pretty much made me realize I wasn't going to be normal.",
            "My main man",
            "I miss Bloom County and The Outland. My favorite comic strips of all time. Even more than Calvin & Hobbes, and that says a lot...",
            "Good 'ol Steve. I find myself emulating his choices too often. ;-)",
            "**\"REAGAN SUCKS!\"**  \n-Little Olie Funt",
            "Anyone with a lick of sense knows the anti-drug/anti-cigarette ads are really just drug and cigarette ads.",
            "\"Tain't corn, it's dope.\"\n\n\"aliens land in Edna Hornby's hot tub, pour stale Billy Beer over startled widow.\"\n\n\"how'd you launder the Libyan kickback money, senator Bedfellow?\"\n\nAhhhhh good times.  Anyone familiar with \" Housebroken\" ?  I could swear the drawing style is like Berke's. I realize it is not him though.\n",
            "Upvote, upvote, a million times upvote! Thank you for reminding me of this, it's one of my favorites. I needed this tonight. ",
            "How can so many people not get it? \n\n**It is a marijuana reference.**\n\n[And I am not stating an opinion.](http://en.wikipedia.org/wiki/Bloom_County#Other_notes)\n\n[More references to the author's stance on marijuana](http://en.wikipedia.org/wiki/Minor_characters_in_Bloom_County#W._A._Thornhump_III)\n\nedit: downvote all you want. I am sure Berkeley Breathed had no intention of making comics for thick-skulled half-wits. He was making comics to spread a larger message. A message obviously lost on you. \n\n",
            "Bloom County is the best comic ever :)",
            "I knew exactly what comic you linked as soon as you said \"snorted dandelions.\" I really like the one where they're talking about how deep in thought the dog could possibly be, and then it thought \"I get to poop tomorrow!\" with the dumbest grin. It cracks me up every time.",
            "I had no idea this comic existed, thanks OP. My favorite comic will always be The Far Side, I don't care what other people say.",
            "Feel anything from the dandelions?",
            "I'm only around twenty years old, and not old enough to really know Bloom County. But when I was 12, my dad (who was in high school in the late 70s) gave me a big Opus collection. I loved reading through that book. Thanks for the memories :)",
            "Bloom County and Outland are my two favorite syndicated strips of all time.",
            "I miss bloom county... The reason I started picking up a newspaper... *sigh*",
            "Being younger (born in '87) and, well, a french Canadian, I had never heard of Bloom County before my mother got me the anthologies for Christmas last year (or maybe two years ago). Best gift I've had in a while.",
            "Really great comic. I've always loved this one, but now I cannot help but think of meth.",
            "I still have all my bloom county books...I am surprised this is the first time I've seen anyone post about it on Reddit.  thanks!",
            "I forget which collection this was in the preface of, but it always makes me laugh when I think of Berke Breathed. [Gesundheit!](http://www.flickr.com/photos/50156270@N03/4711067638/)",
            "I have the newspaper copy of the last Bloom County comic with Opus walking into a white oblivious framed on my wall at home.  \n\nBTW, Comic strip animals aren't anatomically correct!",
            "I've snorted Jello before. Painful, but hilarious.",
            "hell yeah straight don't give a fuck",
            "Do you look like Woody Allen now?",
            "Looks like Doonesbury.",
            "I miss Milo, Steve, and especially Opus. They were the characters, along with Doonesbury and the Duke, that got me interested in politics and current events. I own all the collections, and can't wait to give them to my kids.",
            "A very accurate satirization. Love it.",
            "this is whats new?",
            "I don't get it.",
            "Thank you for bringing a girl down memory lane. Now tomorrow at work I will challenge myself to search for more Bloom county comics. All day. ",
            "I don't get it.\n\nIs it saying that if you tell people not to do something they'll be curious and try it?\n\nBecause that doesn't seem funny or novel.\n\nIt's pretty much a straight-faced statement of fact. There isn't even any satire.",
            "[deleted]",
            "You should inform an archaeologist about the discovery of this ancient text. \n\nBut seriously, you're old. ",
            "I lost the vinyl that came in that collection, but I found the songs on MP3 recently.",
            "Don't blame me, I vote for Bill & Opus.\n\nIt's a trip going through those old Bloom County strips and finding references to Caspar Weinberger and whatnot. Man, what an odd decade that was.",
            "I still have the album!",
            "Poser... you only liked them after they went mainstream.  I was into them back when they were Deathtöngue!\n\n(Just kidding about the \"Poser\" thing... I'm sure you're a perfectly lovely individual.  Please don't turn me into a carrot.)",
            "Back in '86, I convinced our local laser print shop to make a t-shirt for me with the Sunday strip of Opus' encounter with a Hare Krishna. I think it ends with Opus muttering the words, \"hairy fish nuts?\"",
            "Flexidisc! \"I'm a boinger\" was a great b-side.",
            "Alert the media!",
            "In some ways, LH Puttgrass was more successful than he'll ever know.",
            "I am at work, so I can't check the download sites, but I found it for sale [here.](http://www.magisterrex.com/proddetail.asp?prod=WEBDSK081)  It was also on [Ebay](http://www.ebay.com/itm/OPUS-N-BILL-On-Road-Again-Screensaver-Software-/220841121268?pt=LH_DefaultDomain_0) a little over a month ago [twice](http://www.ebay.ca/itm/220851534084), but neither one sold, so they might still have their copies.",
            "[As soon as I read \"floppies went bad\" I started thinking about decayed or expired food.](http://cdnimg.visualizeus.com/thumbs/5a/43/broken,decay,floppy,disk,object,photography-5a43038c6aac790e6bd0b60a8a864e68_m.jpg)",
            "Are there any comics other than Dilbert today that don't suck?",
            "Uh... Doonesbury?",
            "And this is why we don't read comics out loud.",
            "I just came here to tell you that this was and is my favorite syndicated comic strip ever. I still have all of the books, now, conveniently next to the crapper. I never tire of reading them, as well I never tired of snorting the dandelions.\n-Walter Woogums",
            "...On a side note, your username is the most depressing literary reference I've seen all month.",
            "Always the voice of reason.",
            ">I have almost all the books, including \"A Wish for Wings that Work\".\n\nSerious question: there's a book of it?\n\nI was born in the 80s so I was a little too young to appreciate Bloom County in its day.  I've picked up all the books over the years and I have the *animated* version of A Wish for Wings That Work (thanks, Big Lots!), but didn't know it was a book too.",
            "A penguin and his boy!",
            "I am so damn jealous. That's a rare book you have there!",
            "Try a low-carb diet, plenty of fruits and veggies, and exercise.",
            "Binkley will be so pleased.",
            "Must be an American.",
            "Steve Dallas.",
            "> Bill the cat and that band he and the rabbit were in\n\nThat would be [Deathtöngue](https://en.wikipedia.org/wiki/Billy_and_the_Boingers). (Later known as \"Billy and the Boingers\" after Tipper Gore got through with them.)",
            "Um, she went out with me, not Milo.",
            "That would be Bloom County Babylon: Five Years of Basic Naughtiness",
            "Wait, so you had a problem with the strips where he made fun of people who test makeup on animals? ",
            "[deleted]",
            "[deleted]",
            "Big framed picture of Lionel Richie on wall behind frowning music exec...",
            "You know how old people always say \"[X] was better, back in the day\"?\n\nWell, with comics, we're spot on.  Although there are some good'uns, there's nothing to compare to either Bloom County or Calvin & Hobbes.\n\n[Edit] Yes, and The Far Side.  Doonesbury is also still very good, but plays on a different field.",
            "My dad always had them around the house, and after I powered through every Calvin and Hobbes book I could get my hands on I went for Bloom County. I tribute these books for my early interest in world events and politics (even if  I was reading about things that took place before I was born and had to have them explained to my by my folks because of a distinct lack of Wikipedia).",
            "Hah, same. As a result, a lot of my friends don't quite \"get\" it when I show it to them. The humour is character-based, period-based, and pretty subtle if it's your first time reading it.",
            ".",
            "I go back and forth between this and Calvin and Hobbes as my favorite.  They're both so fucking awesome.",
            "Wow.  Great link.\n\nCheck out Milo V1:\n\nhttp://www.gocomics.com/academiawaltz/2003/12/14",
            "I cannot thank you enough for this comment. I read \"RonCo Turnip Twaddlers\" and just about did a spit take. Bloom County rules!",
            "I myself on a Banana Jr. Computer.  Because my parents didn't want me to be like Gene Simmons.",
            "I cannot believe this comment is so far down. ",
            "Berke Breathed was regularly accused of ripping off Garry Trudeau, probably because they were both political strips and had a somewhat similar drawing style.  In my opinion, though, Bloom County was always far superior to Doonesbury.",
            "Same time period, similar style.",
            "Did she think the book was likely to become a collector's item (not wanting to remove the record)?",
            "Came here to point this out--I myself stumbled across this by accident. I've just received the first one. Some of the comics obviously were reproduced from low-quality sources, but the quality of the book I found to be very well put together, printed on thick paper. \n\nAnd, yes, if you've just read the \"original\" books, there turns out there was a lot of missing strips! ",
            "Its an analogy to weed being illegal for no good reason and the temptation to ignore warnings because you will never know what is true until you find out for yourself.",
            "Yes, nicotine absence.",
            "I think the point is simply that when you see or hear ominous warnings about the dangers of some drug you never knew existed, there's a little thing in the back of your head that says, \"Hmm, I'll have to try that sometime.\" \n\nIt's pointing out the irony that if not for that urgent warning, he would have never snorted a dandelion.",
            "[deleted]",
            "It's satire.  The anti-drug ads at the time did not actually say drugs would cause decapitation, or that they were responsible for Woody Allen.",
            "It is actually [Berkeley](http://www.berkeleybreathed.com/), he just goes by Berke.",
            "Hipster",
            "\"The wind doth taste so bittersweet\n\nLike jasper wine and sugar.\n\nIt must have blown through someone's feet\n\nLike those of... ... Caspar Weinberger.\"\n\n\"Start over!\"",
            "> Please don't turn me into a carrot\n\nNo worries.  I only turn people into waffles.",
            "Pear pimples for hairy fishnuts!  ",
            "The last link is the one I'm looking for. The first two are for the second set of screensavers they put out. Thanks very much! I don't know why I didn't think of eBay.",
            "Pearls Before Swine.",
            "Get Fuzzy.",
            "I tried to find it and post the image, but hey, it was 20 years ago and things get hard to find!",
            "My name's Fran.",
            "What's the reference? I don't recognize it.",
            "Yep, there's a book. We've had one at my parents' house since I can remember.",
            "That is my all-time favorite christmas movie.\n",
            "Two dips and a dad.",
            "Oh wow, just did an amazon search and copies of it are going for $300. God damn!  I need to get that out of my bathroom...",
            "Overuse of the word 'massive' tends to be quite British as far as I recall.",
            "yes!  And when they're all in the motorhome, and they're all having a meeting, and Opus or the rabbit comes back and Steve is like WHO'S DRIVING!?  And the rabbit is like \"keep yer pants on, I set the cruise control.\"",
            "Ha, I still have their album! I need to revisit that one!",
            "Portney the Rabbit and Hodge-Podge the Groundhog\n\n\"I don't work with pigs\"",
            "yes!",
            "opus, i uh....wait, where's bill?",
            "As if I would have dated Alf Mushpie.",
            "I'm just too sensitive.  The images of the animals being tortured was too much for my teen mind.  I tend to loop stuff like that in my head and not be able to turn it off.  So it wasn't worth it for me to read it even though I had practically memorized the books before that and religiously followed the comic in the paper.",
            "1.  His later cartoons got more preachy on animal rights.  For me no big deal but:\n\n2.  If you read his whole series (I have them all) you get the feeling that just plain-old quality and trying-wise, Mary-Kay is about when he jumped the shark.  Nearly all of the best moments that most people quote are from before then.\n\n3.  Still, he may have quit a little past his fresh date, but at least he was self-aware and quit!\n3.  Just the same 'ol crapola.",
            "Squidfood summed it up perfectly.  That and I couldn't take the images of the animals being tortured because I'm just sensitive like that.  ",
            "I came here to up vote this.",
            "Don't forget The Far Side.",
            "Yes, though the ones that most spring to mind are Oliver Wendell Jones and his Banana Jr. 6000.  With legs.",
            "The Turnip Twaddler was a low blow.",
            "Yeah, Im certain she did. Though it was pages through so many times it was anything but mint condition. I should see if I can torrent Billy & the Boingers.",
            "Thanks for clearing that out",
            "Its a clever marijuana metaphor actually.",
            ">It's pointing out the irony that if not for that urgent warning, he would have never snorted a dandelion.\n\nAhhh. Thats the point that went over my head. Thanks!",
            "I get what It's referencing, but where's the humor?\n\nDoesn't humor usually derive from a disparity between observation and fact?\n\nOr at least parody?\n\nThis seems like neither.\n\nIt's a straight parallel.",
            "[deleted]",
            "He's not really a hipster if vinyl was the main method of music distribution back in the day.",
            "It wasn't even really vinyl, it was plastic.",
            "Just give me your money, Jack!",
            "zits is ok. ",
            "I'm a big fan of [F-Minus](http://www.gocomics.com/fminus?ref=comics)",
            "It's from To Kill a Mockingbird. During Tom Robinson's rape trial, his accuser Mayella Ewell says he was alone with her because she had hired to him to \"bust up a [chiffarobe](http://en.wikipedia.org/wiki/Chifforobe).\"",
            "Huh.  Guess I've got another one to add to the collection, then.  Thanks!",
            "Too late, it's been flagged, no one will buy it now.",
            "But enormous girth is all American baby.",
            "Hodge Podge is the rabbit. Portnoy is the groundhog.",
            "He's back in Bloom County with the rest of the gang.  I await a day when we can be reunited.",
            "That's perfectly understandable. I misunderstood you and thought you meant you disagreed with his viewpoint or politics during that time of the strip. ",
            "I don't see anything relating directly to marijuana. Could be any drug.\n\nI remember when I was young in school...a long time ago, I'm an old Redditor. They would teach us about the different categories of drugs, 'uppers', 'downers', hallucinogens, etc and teach us about the dangers of them. I specifically remember making a mental checklist of the ones I wanted to do. Otherwise the thought would have never even crossed my mind.",
            "the humor is in the simple irony provided by the last panel, which makes a statement about how the target audience would likely react to the warnings.  ",
            "So you're telling me when you looked at the last panel, you didn't chuckle to yourself a little bit?  Or at _least_ crack half a smile?  \n\nAre you telling me you literally looked at the last panel and thought to yourself, \"I see, this comic is clearly describing a statement of fact often overlooked in the war on drugs through a parallel using dandelions.  While logical, this is entirely devoid of humor due to the analogy only amounting to a straight-faced statement of fact.\"\n\nIs your name Sheldon per chance, or are you a member of the Vulcan race?\n\nI also don't understand how you can claim this is _not_ satire.  This comic is the very definition of political satire.  Read the [wikipedia page](http://en.wikipedia.org/wiki/Satire) for satire or something, since it seems you have some sort of overly strict list of requirements for a work to be considered satire that just flat don't exist.\n\n> Doesn't humor usually derive from a disparity between observation and fact?\n\nI also don't understand where you get that idea.  Sure that is one form of humor, but humor comes in all forms and I would say that isn't even close to the most common.  Hell, pretty much all of stand-up comedy revolves around pointing out amusing anecdotes about the world around you, or pointing out otherwise unamusing anecdotes in amusing ways.\n\nIt sounds like you just have a much narrower view than most people in what you find funny, and that's fine.  However, humor is in the eye of the beholder and just because you don't find something funny or amusing does not mean you can declare it to be humorless.  I think the very fact that there is a 100+ comments from people who found this comic funny means you can't even claim that this is not funny, just that _you_ don't find it funny.",
            "He kinda already explained it to you.. It's not because you're young (I'm 19). Read his response and read the comic again.",
            "not my intention!",
            "So is vinyl.",
            "It was a flimsy!",
            "So is vinyl.",
            "http://i.imgur.com/WS8RD.gif",
            "You deserve an upvote for that, here you go.",
            "teehee...I guess my problem was that I agreed too much with his viewpoint.  :-).  Thank you for asking for clarification.  \n",
            "No.\n\nIt can only be marijuana. That is the whole freaking point.",
            ">However, humor is in the eye of the beholder and just because you don't find something funny or amusing does not mean you can declare it to be humorless.\n\nYeah I know, that's why I was asking what I was missing, this is obviously funny to others.\n\n>Hell, pretty much all of stand-up comedy revolves around pointing out amusing anecdotes about the world around you, or pointing out otherwise unamusing anecdotes in amusing ways.\n\nYes but the humor comes from the *way* things are observed which is most often not factually. No observational humor is funny if it is literal (That's when you end up with statements like: \"What's the deal with airline food, it's really awful.\" Yeah we know that's not comedy just fact). All observational comedy falls flat if you actually pick it apart and find the reasonable behavior behind the apparently absurd behavior (For example: \"Airline food is bad because because it is incredibly cheap and steamed via the heat from the plane's engines\" Now any humor that could have been there is dissipated).\n\nBut what I really meant is about the disparity between observation and given fact, a man notices someone acting in a way that is unusual or counter intuitive to a logical behavior and behold, hilarity ensues.\nOr even notices that standard practiced behavior is illogical or counter intuitive, the logical fallacy (aka disparity between observed behavior and expected behavior) is the humor.\n\nI think all humor can be reduced to expectation and having the opposite of those expectations fulfilled.\n\nTension and release.\n\n>Are you telling me you literally looked at the last panel and thought to yourself, \"I see, this comic is clearly describing a statement of fact often overlooked in the war on drugs through a parallel using dandelions. While logical, this is entirely devoid of humor due to the analogy only amounting to a straight-faced statement of fact.\"\n\nYes, that's why I wrote it.\n\nI do however find this conversation amusing.\n\nEdit: I think all of the replies to my comment would have been unnecessary if someone had just told me: \"You did get it, you just didn't find it funny.\"\n",
            "Like I said; I understand it, I guess I was just hoping for more.\n\nGovernment overstates dangers of a drug to try and make people fear it enough to stay away from it.\n\nPeople become curious because of all the warnings and try the drug.\n\nThis seems more like statement of fact than comedy to me.\n\nI'll just maintain that political cartoonists are the least funny people on earth.",
            "What did you say?",
            "Oh ok.",
            "Explain please.",
            "> Yeah I know, that's why I was asking what I was missing, this is obviously funny to others.\n\nWell I think at the time it was mildly funny, while also attempting to point out the absurdity in the \"just say no\" campaign (that's the political satire part).  Pointing out that overloading kids with warnings about drugs will have the opposite effect is not merely stating a non-novel statement of fact as you claim, otherwise we would have never had that stupid campaign to begin with.  Clearly to a large majority that idea is not only non-obvious, but some even rejected it.  I bet there were people that even took irrational offense to this comic.  \n\nEspecially to the reddit crowd, there is added humor in viewing this comic in hindsight.  I suspect you too are affected by viewing this message in hindsight, but for you it is lowering the humor rather than increasing it.  Looking back retrospectively at the point this comic is attempting to make about the \"just say no\" campaign, we have the benefit of hindsight that allows us to see this message as obvious.  \n\nTo you that has turned the comic from funny into merely pointing out a truth you accept so innately, you have trouble viewing it as anything but a mere statement of fact.  To the rest of us though, this adds humor by first causing us to think \"haha awesome, that guy got it from the start.\"  But then also of the depressing hilarity that even back then not only were there people who got it, but tried to warn others and yet the campaign charged on forward.\n\nComics are also not always supposed to be gut-busting funny, a large aspect of them their is character development and aesthetically pleasing artwork.  I never followed this comic, but I'm willing to bet that someone who knows this character would have the added humor in thinking \"ha! That's _just_ like so-and-so to do that!\"\n\n> No observational humor is funny if it is literal\n\nSee that is exactly what I was disagreeing with.  The stand-up comics I usually find the funniest are the ones that make me think, \"HA that's so true, that _does_ happen all the time!/they _do_ act like that in that situation!\"  A simple flat statement like \"What's the deal with airline food?  It's awful\" is indeed unfunny if flatly delivered in those words.  However, a good comedian could go on for an hour ripping on humans for wearing backpacks and have the crowd in stitches.  Especially if he ends by merely describing, exactly as it happened, a real life event from his childhood about a kid who would filled his backpack extremely full to save time while ignoring the warnings of those around him.  Only to end up falling backwards and being unable to get up as everyone busts up laughing.  A factual story told exactly as it happened and was observed, but extremely funny if delivered half-way decently.  \n\nEven if you are saying that someone merely stating commonly known facts is never funny, I still don't buy it.  I bet a good comedian could compile a list of facts that would make people laugh out loud when read one after the other in order.  I guess you could still say the comedy is in the delivery if you consider the order they are put the delivery, but then at what point does the delivery become disjointed from the content?\n\nI also don't know why you think a comedian must rip apart the reasons _why_ an absurd behavior happens, this comic certainly didn't do that.  If you are saying all observational comedy becomes unfunny to the listener if they were to pick it apart themselves, then uhhh don't do that?  I also don't buy that doing so would be inherently unfunny, sometimes the reasons why we do absurd behaviors are absurd and hilarious in themselves.  \n\n> But what I really meant is about the disparity between observation and given fact, a man notices someone acting in a way that is unusual or counter intuitive to a logical behavior and behold, hilarity ensues. Or even notices that standard practiced behavior is illogical or counter intuitive, the logical fallacy (aka disparity between observed behavior and expected behavior) is the humor.  \n>  \n> I think all humor can be reduced to expectation and having the opposite of those expectations fulfilled.\n\nWhat you describe is one _type_ of humor, and I'd agree you could boil down a lot of modern humor to fit that archetype.  However, you can't possibly think that _all_ humor falls under that archetype.  Think about any joke that has ever been told, that is based on a stereotype.  Someone telling a story their coworkers find humorous about how they nearly got hit by a little black Honda, and low and behold he looks over and it's an Asian women, is funny precisely because they had an expectation and that _exact_ expectation was filled.\n\n> Edit: I think all of the replies to my comment would have been unnecessary if someone had just told me: \"You did get it, you just didn't find it funny.\"\n\nExactly, humor is diverse, subjective, and entirely in the eye of the beholder.  Things also almost certainly cease to become humorous at the point where you have to break the down and analyze them.",
            "not to be rude but...\n\nboy your sense of humor sucks.",
            "Go read the rest of the strip then. It's a lovely series and there is so much humor that it would be a shame for you not to look through",
            "Smoking weed is the real life equivalent of snorting a dandelion in the comic. The government tells you that pot is on the same level of heroin, that it will ruin your life, make you lazy, a criminal, etc... \n\nAnd all of that is a blatantly obvious lie to anyone who has actually tried pot. Yet, before you try for yourself the first time, it is hard not to believe all of the horrible things you have been brainwashed to believe. \n\nBut using logic, it isn't that far of a stretch to ask why smoking a medicinal plant would make somebody a criminal.\n\n**Which is why the character in the comic reads the warnings** (very similar to the Nixon/Reagan anti-pot propaganda of the 80's/early 90's) **about dandelions** (also a harmless plant), **realizes that it is probably a load if BS** (which is exactly the case for the criminlization of marijuana), **and then sniffs the plant anyways** (which is what over 100K people in r/trees do every day).\n\n[I also posted this earlier and it contains links to the author of the comic and his obvious stance when it comes to society's \"Marijuana Boogey-Man\".](http://www.reddit.com/r/reddit.com/comments/lgj5l/i_used_to_keep_this_berkeley_breathed_bloom/c2ss1ug)",
            "You don't know what my sense of humor is.\n\nAnd are you honestly saying you think political cartoons are funny?\n\nThey are widely looked down upon as the lowest form of comedy.",
            "Sorry, I just still don't see the case that is specifically about marijuana. It could be any drug warning. It's a statement on human nature, how we instinctively disbelieve over the top government warnings, and in fact they pique our curiousity to see what all the fuss is about.",
            "bloom county was far far far more than a political cartoon.",
            "No, it could not be any drug warning. So you think the comic could be alluding to heroin? Crystal Meth? Crack? Cocaine? LSD?\n\nAll of those drugs are as harmless as a dandelion to you?\n\n>It's a statement on human nature, how we instinctively disbelieve over the top government warnings\n\nIt's a statement on human nature, how we blindly ~~instinctively dis~~believe over the top government warnings\n\n>and in fact they pique our curiousity to see what all the fuss is about.\n\nand in fact ~~they pique our curiousity to see what all the fuss is about.~~ it is almost 2012 and a completely harmless plant with medicinal properties is still illegal.\n",
            "This strip was a political cartoon though.",
            "Please explain how that comic was in fact about how we blindly believe government warnings. If Steve believed the billboard, he would not have sniffed the dandelion."
        ]
    }
}