{
    "I Told My Daughter To BULLY Other Kids! | #aita #reddit": {
        "title": "I Told My Daughter To BULLY Other Kids! | #aita #reddit",
        "score": 2,
        "url": "https://www.youtube.com/watch?v=ybSj9ckxWiE",
        "content": "",
        "num_comments": 0,
        "comments": []
    },
    "I Cheated On My Wife With Our LAWNMOWER! | #reddit #redditstories": {
        "title": "I Cheated On My Wife With Our LAWNMOWER! | #reddit #redditstories",
        "score": 2,
        "url": "https://www.youtube.com/watch?v=H4ACN0mifpI",
        "content": "",
        "num_comments": 0,
        "comments": []
    },
    "OP kicked a pregnant woman ": {
        "title": "OP kicked a pregnant woman ",
        "score": 332,
        "url": "https://i.redd.it/0pkd0datp18d1.jpeg",
        "content": "https://www.reddit.com/r/AITAH/s/p2H1On8Xd8",
        "num_comments": 66,
        "comments": [
            "I never thought I would agree with someone kicking a pregnant woman. But here we are. 😂",
            "Idc who it is, what their condition is, you abuse my dog after deliberately teasing them with food or a toy or whatever. I will give you a taste of your own medicine. Animals are the only innocent beings on this planet and this pregnant lady thought that just because she was pregnant that she could get away with kicking OOP’s dog. She can’t lose the baby if the belly isn’t kicked in this scenario. Pregnancy isn’t a justification to abuse anyone or anything",
            "FAFO",
            "I'm tired of people acting like pregnancy is a license to be a raging asshole. Just...what the fuck.",
            "That first comment in the screenshot has me gagged 🤣🤣🤣🤣🤣",
            "Reading some of ops older posts, she has a history of having issues with pregnant people, and specifically says she's infertile and sad about it, and says for the reader to decide if that plays a part, and it really seems like OP just has unresolved issues with jealousy around pregnant women",
            "This is one of those stories where I feel like there’s more to it but it was left out to make OP look good…",
            "Both sides were wrong in this situation. I didn’t care for that sister’s comment to the OP either. The dog was the only one innocent here, lol",
            "Didn’t have being on board with kicking a pregnant woman on my bingo card for today but here we are.",
            "Unless he kicked her stomach, I’m good with it.",
            "Yeah OP could have done more to diffuse that situation.",
            "I wanna kick her too. Multiple times.",
            "You kick my cat or my late dog, you’re dead!!!!!!! Pregnant or otherwise.",
            "\"You kicked my dog...and...and WHY DID YOU DO IT?\"",
            "I’ll allow it. This woman put herself in this position and started the physical violence towards the dog. She got what she deserved.",
            "Did you kick her in the stomach or leg? \n\n\nKicking her leg isn't going to kill her baby.\n\nAlso I worked residential for 2 pregnancies. You'd be surprised what the pregnant body can do and not :kill the baby.\"\n\nI.was kicked, hit, did physical holds (this was before we stopped doing them) and more all while pregnant. First one I worked up until the day before I went into labor. Second one the doctor and midwife wrote me out at 36 weeks because I had gotten kicked on the leg and he didn't like that the clients were that aggressive. I.was well that's just normal everyday stuff there but ok.",
            "She's lucky it was an eye for an eye. If someone kicks my dog.... I'm taking their leg functionality",
            "This seems like a fake post",
            "Being pregnant doesn’t give her an excuse to be a raving dick, I would have kicked her too to be fair.",
            "You know that video of the little girls who stole their grandmas teeth so she wouldn’t snitch to their mother? Remember how she said “and I’ll do it again”? \n\nYea… that was my first thought",
            "Read the title: \"OH MY GOD ! 🙀\"\n\nRead the paragraph: \"never mind, fair enough\"",
            "If she has to be in a house that isn't hers and said homeowners welcome guests that act childishly to her pet and eventually kick it... I don't get why she didn't remove herself and the pet from said situation. Or, if unable to move out, then train the animal or at least go to a room.\n\nShe felt she did something to protect her animal but *she didn't*, instead of acting like that to \"protect her baby\" she should have done more to prevent the damage from actually happening in the first place.\n\nEdit: people often believe that feeling good about themselves is the same as being actually good to the animals they love",
            "Nah we kickin that stomach not no shin, we goin for that double kill 🙏🏼",
            "Dog owners are legit weirdos. That baby is 100 times more important then a worthless mutt. You guys are brainwashed over dogs and how great they are. They attack innocent children all the time",
            "I would kick that dog right off of this planet.",
            "There are so many scenarios in this sub where the title alone sounds like it will be a clear decision against the OOP, and then the story goes in the complete opposite direction. I keep reminding myself not to judge on the title alone.",
            "In my defense I’m only a raging asshole to people that deserve it. Like this dog kicker. I volunteer as a call-in to kick the shit out of dog kicking pregnant women. Two pregnancies will cancel that shit out.",
            "Right? No one wants your crappy kids, so don’t act like you being in the process of making them makes you special. You’re cooking up garbage and no one is looking forward to meeting your bundle of insecurities",
            "Same.",
            "how much do you wanna bet “teasing with food and kicking the dog” more realistically translates to “pushed begging dog away with foot”",
            "Yeah… why is the dog with her sister in the first place if it’s “OP’s dog”?",
            "How does OP look good here?? They sound insufferable. Of course I’m not pro person kicking a dog, but OP sounds rude as hell, and it sounds like the dog might be poorly behaved.",
            "I think OP was the justiable asshole here. You don’t go to someone’s house and bitch about their dog/cat/etc and you sure the fuck don’t tease a dog with food like that. She’s lucky the dog just took the food and didn’t bite her in the process and you sure the hell don’t hurt the dog afterwards because it got frustrated and took what you kept promising and refused to give.",
            "The story is bullshit anyway, none of OPs comments make sense, just made up for Reddit keyboard warriors to foam at the mouth saying \"if you kick my dog I'll punch you in the face\".\n\n\nAnd if it is true, OP activity allowed it to escalate so that they could assault somebody.\n\n\nThis whole thing made me lose hope in the Reddit community tbf, the comments on the OP saying they hope she does lose the baby because \"animal abusers don't deserve happiness\" is alarming.",
            "It’s all very juvenile. I’m sure neither kickee was hurt to last more than a couple of seconds so the consequences are limited.",
            "And the pregnant woman could have been less of an ass but if wishes were fishes we’d all have a bite to eat",
            "She could also have acted a lot worse. Pregnant lady is lucky she’s still got all her teeth and an unbroken nose.",
            "I wish I could upvote you multiple times.  OOP is not a hero.",
            "in the comments op says they were sitting in the dog’s room, like where their water, couches and toys are. so it’s weird that a) the sister who lives here would choose that room for chatting and b) the friend would complain about what would clearly be a dog’s space. i doubt it’s real esp since op made about 100 comments on the post, but if it is somehow, then that’s just a weird situation with some rude people on all sides",
            "Seek therapy",
            "Her shin isn’t pregnant and she was taunting a dog with food. She’s lucky the only thing that happened was that her shin got kicked and that the dog didn’t actually attack her because she was taunting it with food. She was actively antagonizing the dog.",
            "No they don't. And the baby isn't in her leg.",
            "Would you have teased the dog with food to the point that it jumped on you and took it though?",
            "You make yourself sound like a nice well adjusted person.",
            "lol. The whole point of OOP stepping in is that the coward was no longer abusing an animal but facing another grown woman, at which point she immediately started whining.",
            "This is how you get your ass whooped real good, by messing with people's pets and kids.",
            "Dang it. I snort laughed at this and scared my dog.",
            "There’s literally someone in this comment section saying they would have deliberately kicked her stomach to kill the baby. (There’s also someone else did a profile dive and found out OOP is infertile and hates pregnant women, so she’s basically just gathering revenge fantasies. Truly well-adjusted behavior.)",
            "I don't think the pregnant woman even exists tbf.",
            "True. If someone was to kick my dog I’d go ballistic on them. Idc who they are.",
            "Yea that’s both the scenarios here genius",
            "I am generally a very docile person but I’ve felt enough of the jolt of pure adrenaline-fueled rage (from a much lesser offence) that I can guarantee that woman would be about to learn some decency the hard way.",
            "No, it isn't, I doubt OP kicked the woman in the stomach. Put your hands and feet on my dog in any aggressive way, and you're free game.",
            "She just booted her in the shin. Tbh I'll take the downvotes she ain't pregnant in her shin is she. Much deserved, Poor dog. Bitch is lucky she's pregnant and op stayed so calm. She taunted the dog repeatedly when SHE could have left. Ngl I don't like somewhere and find it unclean or unkempt I leave but guess that's just me 🤷. Even the bible said an eye for an eye.",
            "Hahah yea okay kick a pregnant woman. Man, I’m tired of stupid people and dog parents, it’s an animal, get over it. I would rya street fighter skin kick that dog off this planet and right into the moon.",
            "Being pregnant doesn't mean you can be an asshole without consequences. \n\nRepeatedly teasing, then kicking an animal in someone else's home is a dumbass way to keep your unborn child safe. Yeah, I'm tired of stupid people, too.",
            "If you don’t want to get kicked? Don’t be a colossal asshole in someone else’s home and don’t go out of your way to abuse their pets. It’s really that simple.",
            "If the pregnant woman acted like a civilized human being and not like a raging asshole, none of this would have happened.",
            "You are a stupid person... \"It's an animal\"? Yes, animals have feelings just like people. You don't have any obviously.",
            "Do you also wet the bed and set fires? Psychotic tendencies usually start with cruelty to animals.",
            "Would you tease the animal beforehand, to give yourself an \"excuse\" to kick it?\n\n\"its an animal\" shows your empathy deficiency.",
            "The woman’s also an animal, get over it"
        ]
    },
    "Not OOP AITAH for giving my daughter a laser pointer and maybe ruining my neighbors life ": {
        "title": "Not OOP AITAH for giving my daughter a laser pointer and maybe ruining my neighbors life ",
        "score": 1033,
        "url": "https://www.reddit.com/gallery/1dl2sc5",
        "content": "https://www.reddit.com/r/AITAH/s/CWtkqU0Riu",
        "num_comments": 105,
        "comments": [
            "OP comment:\n\n\"Sorry if I wasn't clear.  There are no videos of my daughter except that one. My wife and I got her blackout curtains and told her about perverts a long time ago. She doesn't  get nude in front of a window. He got arrested for that video alone. He is in a lot of shit. \"",
            "I mean…it sounds like the neighbor ruined his own life by not taking your concerns seriously. And tbh, good on the 14 year old for ruining his camera and proving he’s a creep.",
            "People tend to tell on themselves.",
            "NTA. Neighbor could have been more responsive to your concerns.  Also, just means the cops only *found* that one recording…",
            "Hahaha. Brilliant power move. How could neighbour know it was daughter unless daughter was on video.",
            "To me one of the damning aspects is that you can really only damage the camera if it hits directly on the sensor. In practice, this will mean that the camera and the laser are both pointed almost directly at each other.",
            "I let out a \"HA!\" reading this. OOP is NTA. The neighbor deserves all of the crap happening to him. OOP thought of a clever way to bust his neighbor, even though he may have not thought it at the time. Neighbor knew what he was doing with that camera.",
            "Nta, neighbors a weirdo and probably was watching her undress which is why they’re fighting now. Called the cops just to reveal he’s a creep.",
            "The cops saw the footage, but it took the OOP pointing out that his daughter was in her bra and underwear? Pretty sure the cops should have been alarmed by that all on their own.",
            "It sounds like you gave him a chance to correct the problem when you went and spoke to him. He lied to your face about where the camera was pointing and purposely did not let you see the feed because he knew it would show the camera pointing directly at your young daughter’s window. I know you’d like to believe that wasn’t his intent, but I don’t see any reason he would need that, even if it does include your fence line. Your neighbor also had the chance to change the angle after you spoke to him about your concerns but didn’t. \n\n\nYou’re NTA and neither is your daughter. Your neighbor is a creep.",
            "The perv neighbor should be locked up.  Great job!",
            "What the hell kind of laser pointer did she give that kid?",
            "He was just bird watching",
            "Well, if neighbour had made sure to point it AT THE FENCE and not the window, maybe they wouldn't be arguing. And if he got arrested due to ONE video, I think they may have found more. Security and peace of mind doesn't mean trample over the peace of mind of others.",
            "I wish more problems could be solved by playing with cats.",
            "do people just post these to get an ego boost because they know they’re in the right and just want to hear it over and over again",
            "I don't find it very believable. I can't imagine the neighbor going to the cops complaining about his camera, then the cops don't watch the video but go directly to OP to confront him.",
            "I like to imagine that this talk \n\n\"I had given her the talk bout how it wasn't really a toy Nd that she could get in a lot of trouble if she pointed it at an airplane, helicopter, or security camera.\"\n\nWas a little bit more like:\"And i repeat, you do absolutely  not point the laser pointer to cameras who a pointed towards your room. This could damage the camera to the point where it will be no longer be able to record you in your room. Understood?\"",
            "Definitely NTA in this situation. Super duper gross honestly - even if the neighbour wasn't purposely watching the daughter's bedroom with his camera, he should've moved the positioning when OOP pointed it out. And for the neighbour to have the gall to call the cops about his precious camera when it was filming into a bedroom, feels like a FAFO kinda situation.",
            "Press charges. He really should've made sure it absolutely wasn't pointed at the teenagers' window when you brought it up. That's child porn on his phone.",
            "“My neighbor tried filming my daughter in her room, but am I the asshole?”",
            "OP has a ton of patience with the neighbor. NTA at all. \n\nI don't know too many fathers that would have kept their kool seeing a video of their daughter on someones phone. \n\nCops or not, the neighbor is lucky he didn't get his ass beat. He is lucky it was only his security camera that go messed up.",
            "\"Well if it isn't the consequences of my own actions?!\"\n\n-OP's neighbor.",
            "A minoooooooooor!",
            "NTA.  You provided him the opportunity to rectify the situation and he chose not to.  It’s on him, totally.",
            "I would make his life hell.",
            "This is the best result of handling a peeping Tom I've seen yet. Bravo.",
            "Sounds like the neighbor is getting what he deserves. Idk maybe he shouldn’t be pointing cameras at windows, and especially not a young girl’s window.",
            "Neighborhood child porn perv.",
            "If he had one recording, he had more and deleted them. He's a fucking creep.",
            "NTA; your daughter deserves someone who protects her privacy, even if that means giving her a laser and “hoping” she doesn’t destroy the neighbors’ camera. The first red flag was when that dude refused to let you see the film to determine if he was in fact watching your daughter; the second red flag was him calling the cops and the cops calling him out on what were he was doing and he tried to leave without telling them…NTA, you’re an awesome parent and I applaud you!",
            "I’m sad the OP deleted his account. 😭😭😭😭",
            "I think the daughter knew exactly what she was doing and deserves an award.",
            "NTA. But based on how the first part of the story is written, I thought the kid was 5 years old. I really can’t imagine a teenager would enjoy playing with a laser pointer for more than 5 mins.",
            "Nta Lol his own fault he self reported and is a dumbass",
            "Poetic justice",
            "Why would he be the asshole. The neighbor was the one that called the cops.",
            "Well done! NTA by any stretch",
            "This is really funny",
            "He was warned, plain and simple.  He called the cops and got arrested for at the bare minimum not double checking the position of the camera.   These are a series of the neighbor’s mistakes.",
            "The very definition of \"play stupid games, win stupid prizes\"",
            "So it was pointing at her bedroom then? I would’ve told the police that.",
            "The daughter is a total boss and she was raised extremely well!! The neighbour played stupid games and won his stupid prize!! All’s well ✨",
            "Dude had to have known the camera was pointed at her window, and he lied about it. 100% he was recording that little girl, and just got mad when she fried his camera so he couldn't spy on her anymore. I mean...less than a week, and he's already noticed the camera's fried?",
            "I don't believe that your neighbor is a creep. But I do believe that he is an idiot. The first one would be related to you somehow. The second one is definitely not. Because he was asked not to point that camera, ignored it,hot in trouble. Stay away, don't feel guilty.",
            "Well well well, if it isn't the consequences of his actions (the neighbor)\n\nDude deserved it. Why was his camera pointed at her window anyway??",
            "He deserves to be!!",
            "She shouldn't have to have blackout curtains. What a jackass neighbor.",
            "hey oop literally asked him to move that camera before this all went down! he had a heads up",
            "Good",
            "If OP hadn't expressed his concerns and the neighbor got all defensive, I could see it being a legitimate oversight. Set it to record and overwrite previous data and forget about it.",
            "Not to mention outright lying that the camera wasn’t pointing at the daughter’s window.",
            "Yep, give someone enough rope & they’ll hang themselves with it.",
            "Egg-zactly.",
            "EXACTLY. He should've at least listened to the neighbor to protect himself, but nope.",
            "They probably didn't need to get a warrant for anything else if that was strong enough evidence.",
            "He definitely told on himself with that alone.",
            "TBH OP I would have told my teen to aim for the camera if my neighbor didn't let me see it. It would have aimed it myself.",
            "Exactly. He lied about not pointing the camera at her window. That's why the cops asked to see his videos taken on the camera.",
            "Another job well done by explanationman!",
            "But you see, then they’d have to voluntarily do more paperwork",
            "Maybe they didn’t know daughter’s age or needed confirmation?",
            "That’s what confused me as well. “The cops showed up and said they saw the footage of my daughter ruining his camera”……but they didn’t happen to notice it was an improperly dressed minor child with a security camera pointed directly at her bedroom window (and not the fence) until OOP pointed it out? Okie dokie, excellent police work.",
            "They were. That's why they asked to see all of his video.",
            "It doesn’t take much.  Even a small 5mw laser can be seen by an aircraft.  (Obligatory: it is a federal crime to point a laser at an aircraft, and they absolutely will do their level best to triangulate your position; my spouse deals with this at work, it is a pretty serious deal when it happens)",
            "“Bird” in the British parlance",
            "honestly, i don’t treat any of these stories on here as if they actually happened. it’s like reading fiction where you root for the good guy and cheer when the bad guy gets their just desserts",
            "if you're in a big city yeah, if you're in a smaller town usually the cops are super responsive and will straight up break down doors if there's a child involved with something. We moved from Dallas Texas to Fargo ND and my wife was concerned about a white van that would sit outside of our apartment every night. The cops not only got the security footage from the apt complex and 2 other stores near the area but found the vehicle owner the same day, they tracked the dude down and called him and it turned out to be some poor Mexican contractor working nights and just taking lunch really late. I felt kinda bad for the guy because he seemed very shocked and apologetic. It's weird having issues actually responded to by police promptly.",
            "Riiiiight! From all these stories you'd think cops are really responsive and involved in their job so much so that as soon as the neighbour went in to file a complaint about a camera being damaged they jumped in the car immediately without further checks to mend this injustice and get that 50 bucks back!\n\nMeanwhile, in our timeline and paralel universe, people get stabbed in broad daylight and the police is nonchalant about it.",
            "The story doesn’t say what time frame there was from when the camera got messed up, the cops were called or a complaint filed, to when they actually showed up. I would assume a complaint was filed and the cops eventually showed up to talk to them about it, and neighbor eagerly came over when he saw they were there (or knew they were coming at that date/time) to point his finger and show his evidence.\n\n\nEdit to add that cops generally seem to care more about property damage than they do people.",
            "I was wondering just how much time the cops have on their hands that they'll wade through weeks and weeks of footage--as well as, just how recently did they finally buy their daughter curtains? That they just left her window uncovered until recently, they must be compete morons-- or the author has some plot holes.",
            "Of course it’s not believable, it’s some weirdos fantasy, written as moral outrage because if he just posted about fantasising about filming a teenage neighbour he wouldn’t get the sort of response he’s seeking.",
            "The mom also knew what she was doing and deserves an award. You think her telling kiddo that it can damage a camera was accidental??",
            "I have a teenager, a laser pointer and cats in the same house. I can confidently say you are wrong.",
            "I mean, by the way it’s written it sounds like OP gave his daughter a laser pointer for a very specific reason.",
            "14 years old? She knew what she was doing. Probs got in her undies for maximum effect.\n\nWhich she should. If I found out my neighbor had a security camera pointed at my bedroom window, I’d be livid. And I’m an adult.\n\nThis is 100% a “gave him just enough rope” situation.",
            "For the reason he got arrested for.",
            "The only upside is the neighbor was stupid enough to show the video to the cop while whining about his damaged camera.",
            "She might gave a blackout curtains for other reasons. Unless OOP said something different in the comments",
            "She probably has them for other unrelated reasons by the sound of the story.",
            "I think the real question is *how quickly did the neighbor notice the broken camera?*  i.e., was he checking the camera constantly?  Or reactively?",
            "And happily showed the cop he was peeping on an underage girl",
            "I don’t think they asked. I think he told them he had video proof, they said oh okay, went to talk to OP who pushed the issue, that set camera guy off, he went and got the video to show them OP was arguing and he was right, and then they were like now wait a minute",
            "I feel like regardless of age it’s a crime to film someone in their home without their consent.",
            "Cops really just don’t give a fuck but to play Devil’s advocate for one second, the camera may have been low enough quality that they could see her body but not her face clear enough to see she was a kid? Like that’s literally all I’ve got past “they don’t care” which is likely the case anyway.",
            "Being seen from an airplane is completely different than disabling a camera",
            "I love the fact that the footpath to the local naturist beach (Studland, Dorset) means crossing a RSPB (Royal Society for the Protection of Birds) reserve. Once there, it is impossible to know exactly which “birds” the binoculars and cameras on the sand dunes are pointing at.\n\nWe use that beach because it’s quieter and there are no noisy kids. My husband is so pale he wears his shorts & T-shirt unless he is going swimming, but he rarely leaves the beach shelter we take with us. As a 60+ woman Idngaf if they want a close up of my saggy boobs and wrinkly tum.",
            "Why on earth was your wife concerned about a van parking outside your apartment complex? Concerned enough to call the cops? That’s insane.",
            "Yeah I live in a college town of about 100k people, and it might partly be the neighborhood I live in, but we’ve had quick responses. A few years ago I woke at 3am to my doorbell being rung over and over. My husband was out of town for work and I had my two kids at home. I can’t remember if it was when we were between dogs, but either way our husky wouldn’t do anything but try to make friends with a stranger. I called the police and they were driving down our street with a search light about 5 minutes later, then called me to tell me they didn’t find anything.",
            "I had a cop tell me it was my fault I got raped and I was ruining the guys life because I bled from my vagina and rectum onto his mattress and threw up on his bed, carpet and car. \n\nI'm sure there's a few attentive cops but in my long long lifetime of reporting, asking for help, having the cops called on me for screaming (domestic violence as a child) and reporting rape... they aren't responsive. And they get *pissed* if you \"make them\" do their job. \n\nI also got berated by cops and taken down to the station with gravel and dirt in my face and hair. I was put in a cell, told I was going to wind up there permanently if that continued, because my neighbours saw/heard my mom's husband beating me in the driveway and called the police. My face was bruised and bleeding. I was ten.\n\nI live in a \"first world\" place and cops have an 80% domestic violence rate (and that's just the reported rate, ignoring anyone who doesn't report, or anyone who cops won't take a report from which is incredibly common) and they're the number one source of cocaine smuggling, above an international gang. \n\nMy boyfriend's place of work got robbed of 80k worth of equipment. Cops came and said tough, that's not our job. It took two weeks and the owner of the company calling for anyone to come and take a report. They get so unbelievably mad when they have to do anything, too, like it's your fault you got beat up, raped, robbed. Disturbing. \n\nI think stories like this are prevalent because people want a fantastical version of justice. It's sad.",
            "Fair enough.",
            "Yeah there were more videos, just stored elsewhere if not on the phone.",
            "“Now I can’t peep on underaged girls next door! What am I to do, officer?!”",
            "The implication from OOP is that she got blackout curtains and was given a talk about creeps at the same time, meaning they likely got the curtains for her for the same reason.",
            "Yeah like blackout curtains are amazing for sleep like I would get any hypothetical children I have them",
            "Unfortunately in most places it’s not. If you film someone through an uncovered window, it is perfectly legal. If you have to jump a fence or move things to get a better angle, then it is illegal. This is only illegal in this case because the victim is a minor (although it should be illegal out right)",
            "I totally get that, but it seems pretty cut and dry that no matter her age this man had a camera pointed directly at her bedroom window and *not* at his property.",
            "Right but my point was, if even a weak laser is strong enough to be seen a few miles up…then yeah, it can damage a camera that is presumably 5-15 ft away.  I’ve had a few friends have their iPhone cameras damaged while in clubs that have the laser effects that go with the music.",
            "It really doesn’t take much.  Cameras are highly sensitive, and the power density of focusing even a cheap weak laser you’d get in the checkout lane of a pet store down onto a sensor, which is what the camera lens is supposed to do, is easily enough to damage it.\n\nSource:  is an optical engineer and laser safety officer",
            "That sucks.  I hope your present day life is much better.\n\nMy experience with cops have been mixed.  They did a good job finding my stolen car,  but when I reported a client at work for trying to kiss me the cop dismissed me and gave me a religious lecture.  I’m in the US.\n\nI don’t believe this story.  It doesn’t fit in AITA.  It’s so simply wrapped up.  It just reads like fiction to me.",
            "He'll find other underage girls to perv on, never fear. \n\nI wish this was /s but it's not.",
            "They're great for light triggered headaches as well. I have migraines and sometimes the light feels really intense and even hurts despite it being a normal day with normal light levels. Blackout curtains are amazing for those.",
            "Well that’s fucking awful",
            "Sure, and I agree, but in most places that’s not a crime. Sucks. It’s gross. It’s primitive, even. But as long as you can get a clear shot into the window without moving things or jumping fences, you’re legally in the clear to record through a window in most places at least in the US. Doesn’t count as trespassing and the cops won’t do anything without good reason. The daughter being an all-but-naked child in the video is likely the only reason that the cops did anything at all. If he was arrested for it, he might have more videos or pictures of her somewhere that OOP was never informed about, as well.",
            "I have blackout curtains on my basement bedroom window to help with sleep and migraines. I do tend to leave that room and go to my office/craft room for migraines as it’s just down the hall and doesn’t have a window but if it’s low level enough the very thin sliver of light that gets by the blackouts is ignorable"
        ]
    },
    "Am I the asshole for letting my daughter keep her room?": {
        "title": "Am I the asshole for letting my daughter keep her room?",
        "score": 529,
        "url": "https://www.reddit.com/gallery/1dl733c",
        "content": "https://www.reddit.com/r/AITA_WIBTA_PUBLIC/s/tPMEXXFAs4",
        "num_comments": 262,
        "comments": [
            "I agree with the commenter who said the baby’s room should be up with the other rooms and the new basement room should go to a couple of the other kids. I wouldn’t want my baby so far away.",
            "This is going to end very badly.",
            "OOP letting his daughter have a lock, insisting on being paid for any babysitting, and standing firm on not giving her room away will help to avoid some of the major issues we see on other posts about blended families. We see so many posts about kids being forced to sacrifice too much for the sake of blending families, and they end up hating their parent and their new partner. \n\nI hope we get to see an update.",
            "Why does she need access to this girl's room so badly? I find it weird that being able to lock the door to her bedroom is some kind of slight to this woman.",
            "OP is TA for getting involved with this woman. She’s a walking talking evil stepmom in the making and it would come hell or high water before I let someone move into my house and tell me what’s fair.",
            "OP, why does Alice have a problem with a lock on daughter’s bedroom door?",
            "Absolutely not TA. Who does this woman think she is? I certainly wouldn’t be marrying her. Your daughter has lost her mother and is open & willing to accept all these other children this new woman & a new sibling into her home ! Very mature of the daughter, if your fiancé doesn’t respect the fact that you would put your kids ahead of everything then she is not the right one. If he could just up root his daughters life for a relationship would you not be worried he could do that to the kid you both share with someone else if it didn’t work out??",
            "He shouldn’t marry this lady",
            "I can’t understand why you would have a child with someone you didn’t even live with. I hope he doesn’t marry her.",
            "The needs of a 15yo is drastically different than a 10-13yo. Let her have her room poor girl, she’s about to get 5 new siblings to co-live with",
            "Baby or no baby, I would definitely think twice about marrying this woman or having her move into my home and I’m woman. This has disaster written all over it.",
            "Alice needs to chill or she'll lose her chance at marrying a man with money (or at least a big house worth money). \n\nAside from that they should put the 13F, 10F into the new basement room and put the baby closer to them. It's a nightmare to have a baby and, later, toddler, on a different floor in the middle of the night.",
            "He needs to get a lawyer involved and write up that his daughter will inherit the house and not the new lady. Otherwise, he is at risk of it being considered a marital home and his daughter getting screwed over in the case of his death. This lady sounds like an evil step-mother in training.",
            "So Alice is upset bc their new family of EIGHT is going to be a bit cramped? Really? Nah, she's clearly jealous of Stacey and this IS NOT going to end well. Just the fact that she's upset about Stacey having a lock on her door makes the hairs on the back of my neck stand up. Why the fuck does she want unrestricted access to Stacey and her private space? This woman and her brood are going to absolutely torment OOP's poor daughter...",
            "5 bathrooms in total and she thinks there won't be enough? Am I the only one here used to one bathroom per house?",
            "Does Alice realize that she’s moving into Stacy’s house? Stacy and your son are getting the house? Not her?She is not entitled to Stacy’s Mom’s car. Dude,I think you need to have a serious talk with Alice regarding all of this before she moves in. Alice is big mad that you won’t make your daughter live in a closet so her and her kids can take over",
            "Personally I think the finished basement room should go to one of the older sets of kids, and it could probably be made to be larger too. But mostly I just hope that this guy doesn’t go through with it if it’s gona be so much of an issue and gf is already calling daughter spoiled.",
            "NTA. Alice is coming in with evil stepmother and gold digger vibes. \n\nThe house was bought by you and your late wife. Paid the majority with your late wife’s life insurance. Stacey should have a say and she should be able to keep her room. \n\nAlice is going to live rent free with 4 children that aren’t yours. She is paying 15% of household bills which is basically nothing considering what she needs to pay if she were living alone with 4/5 children. \n\n**Make sure your prenup is iron clad.**\n\nMake sure to put away (somewhere safe) stuff that belonged to your late wife. Clothes, photos, jewellery, momento’s etc. I wouldn’t put it past Alice to take or destroy her belongings. \n\nStacey should not be made to babysit if she doesn’t want or she isn’t payed at all. Also good call on the lock. Children will invade her personal space if she doesn’t have a way out. \n\nPs: someone already said this. Make the basement a room for the boys and keep the newborn closer to the master for easier access.",
            "As a woman kid who had the wicked stepmother when I was younger, please pick your daughter. She will always remember it and know just how much you love her.",
            "Very curious what assets the fiance is even bringing to OP's life. I'm guessing she's hot. Rich old guy marrying the poor 30 year old.",
            "Amazing to think the man who has worked so hard to love his daughter the way she deserves even while he moves on romantically is the same man who put a baby in a mother of 4 before even beginning to integrate the existing families. What a world class fool.",
            "I can get over the fact that some men think it's à good idea to go and make à baby with à woman who had already 4 kids...",
            "Sounds like you should tell Alice directly that your daughter comes first, perhaps even put it in writing. If Alice doesn’t like it, she doesn’t move in.",
            "Stepmom here.\n\n15 y/o keeps her own room and en-suite. Absolutely NO negotiations. Dad’s office goes in the basement. Nursery is upstairs. Other kids fit into other available spaces with fresh paint and some new decor to make them special and “home.”\n\nWhen you’re blending a family it’s important to help everyone adjust to the new hierarchy without demoting his biological daughter. Alice needs to check herself before she wrecks herself.",
            "Make whatever cosmetic updates to the basement would be needed for the two incoming daughters to take that room, put the baby in the parents’ room for the first 6mo then move into one of the smaller rooms. If possible, improve the sound proofing/dampening in that room before that transition so that the neighboring room isn’t totally disrupted. For this woman to be arguing about a lock on the door is a clear power struggle, not a logistical one.",
            "It’s absolutely fair that Stacey gets to keep her room. If Alice can’t afford to keep a roof over her head, then maybe she shouldn’t have had 4 kids. OP will regret letting her move in.",
            "Oh thank god a father who is actually willing to stand up for his kid.!! The step mother has no say. That is his house and will go to his daughter. She’s moving her 4 kids in and should respect the fact that OPs oldest has a right to privacy and to not be treated like the new children coming into the home take precedence over her. This would be a deal breaker for me. I would have broken up with her and told her she’s not moving in. I grew up with a step father, and I am currently a step mother myself. I would NEVER come into someone else’s home and start acting like it was mine. And that’s what she’s doing. She probably will want that house to be left to her four kids too in a five way split. just watch…she will Wait a bit, but I bet you $20 she will eventually ask you if the house can be split w her kids. 🚩🚩🚩🚩🚩🚩🚩Good thing you are smart and asked for the prenup. If you do marry her, Tread VERY CAREFULLY !!!",
            "NTA. Put the boys in the basement and the baby upstairs. If gf doesn't like the living arrangements , she is free to move wherever she wants. PS....does this woman know about birth control?",
            "Why would you have a baby before moving in with someone? You don’t know them yet. This is going to go so wrong for so many reasons.",
            "I agree with what this man is doing. He apparently is the only parent his daughter/son has remaining and he is protecting them even though he has chosen to move on with his personal life. His new fiancé sounds bossy and somehow feels like she is all of a sudden entitled to what this man has built with is deceased wife and children. I am glad he is such a strong parent that is not easily swayed by his new partner which may potentially cause emotional damage to his kids! I wish him all the best.",
            "This is just my two cents. Completely finish the basement and put a bedroom mini kitchen and full bath down there. Turn it into a little studio apartment with maybe an adjoining art room. It would give your soon to be college girl bit of privacy She'll most likely relish being away from the chaos of all those other kids upstairs.",
            "This looks really rage bait-y. \nIt’s written by someone who knows generalities but not specifics. Late teens/early 20’s. \nHe has also effectively left his son out of the house inheritance picture.",
            "Huuuuuge NTA. I hate when partners move in and start making demands, especially of kids that aren’t theirs. If the gf doesn’t like it, she can kick rocks.",
            "Alice sounds like a delight 😳 \n\nIf you're going into moving in together telling your GF that she had better not come into this with an evil step mother approach... yeah... don't move in.",
            "I wish my father had adopted this mentality instead of literally the exact opposite",
            "Jesus I hate when people blend families without enough space. Or prior thought to how dynamics will work.",
            "I wonder whether Alice was always like this or if the pregnancy plus stress of moving is making her feel a bit vulnerable and she’s lashing out a bit and being unreasonable, like it seems like she’s looking for reasons why moving in is not going to work. OP doesn’t seem like the type of father who’d be involved with someone who doesn’t treat his kids well.",
            "If he clearly told her before she decided to move in, she agreed and still is causing a guss about it, she itah. It's his house. And his daughters, he clearly already had a plan set in place long before she came along to pass it to her. \n\nI agree baby in basement makes no sense. He should move his office  there & split the lids up upstairs.",
            "Why exactly are you marrying Alice? She sounds so entitled! And it seems she is looking for an easy ride and possible baby trapped you? Her huge squad of kids are getting larger living space than they currently have and she is complaining now before even moving in. Next she’ll try to void the prenup. \nI think you are setting up for years of heartache",
            "NTA, but you'd be one if you continue this relationship with this woman.",
            "I don't know much about raising kids, but Alice sounds like a walking red flag to me.",
            "Finally a parent who actually puts their kid first. It sucks that he got this lady pregnant bc I can already see the relationship collapsing",
            "NTA, not a little bit. The house was paid for by her mother's life insurance payment, and the OP basically said it is her house. That is how things are. Now the fiance wants to have a say on a settled matter? Nope.",
            "GO DAD",
            "You’ve got it absolutely right there mate!\nSadly I don’t see this lasting very long. But good luck and I wish you, Stacy, Alice and all the other kids very best wishes for the future!",
            "NTA.  \nThe fiancé however… not looking too good right out of the gate.  \n\nI’ll offer advice, but it’s up to you what you do:  \n- she will try to draw you into arguments. This is where she gets you. Refuse those. Don’t engage, no matter what. “That’s how it’s going to be, now and forever.” Say that and only that.  \n  - If she can’t accept that eventually, time to make some moves without her.   \n- ladies are far better at Lladnar grinning games than we are. Pay attention. If she can’t drag you into an argument nor bully you up front, she will make small moves over time.  \n  - don’t fall for it. She’ll make small changes that seem innocuous and innocent. Those are all “land grabs” that will be thrown in your face later. Do. Not. Budge. One. Inch. Ever.  \n- she’s not likely to let this go. Keep your eyes open. She will try 32,634 different angles of attack and manipulation to get what she wants.  \n  - it’s up to you to determine when these have gone too far, but it’s easier to settle it early than to settle it late.  \n  - put your foot down with deadly seriousness right now. Ultimatums are dangerous, but this is the time for one.",
            "Ugh I would break off the engagement with that person she’s going to try to take everything!",
            "Well done for keeping your promise to your daughter and putting her first. She’s giving up a lot to have your girlfriend and four kids move in.  Alice is going to talk herself out of a good deal soon. I agree with other commenters that maybe the basement isn’t the best place for the baby. Perhaps consider reconfiguring it for the daughters.",
            "I love him so much. He is absolutely daddy material and if Alice dumps him I can be Stacy’s new stepmom.\n\nLol all jokes aside, he’s doing an amazing job and I’m so happy to read a story where the parent is fully willing to leave their partner for their child.",
            "NTA- Alice sounds hella jealous of your kid. Sorry there are a lot of red flags with her. Too late to do anything as you are already having a child with her",
            "No mention what the relationship is like between his children, the soon-to-be step mom and her children ... but did not get a good feeling from what wasn't said",
            "There literally no reason for Stacy to give up her room. There’s enough bedrooms and bathrooms for everyone else with the current setup. Fiancée needs to learn about compromising.",
            "NTA - it’s totally normal for the eldest child to have their own room when there aren’t enough for everyone to have an individual room. I think having another 3 bathrooms for the other kids to share is amazing but the norm for me growing up was one bathroom per house for everyone to share",
            "I wish more parents who remarry were like this tbh",
            "AITA for keeping my promises to my child? \n\nThe kid came first. This woman sounds like a shrieking harridan.",
            "Great dad taking his daughter’s feelings into consideration. The fiancé sounds like she has entitlement issues. NTA",
            "The dad sounds amazingly reasonable and really nice. Assuming the daughter isn’t like a literal monster child I agree with him. The kid should get to keep her room. Simply out of principle and respect that she was here first. Also to smooth stuff over. I also agree that the baby should be upstairs. (With the parents for the time being.) sounds to me like he’s provided more than enough space. Wife is either jealous or OP isn’t sharing the whole story if there is an actual problem. Keep the baby in your room for safety for time being. Oldest kids of gf go to basement and gf can have their room. No\nProblem. Don’t make an issue where there isn’t one lady.",
            "I am a single dad of two daughters and have full custody of them.  \n\nMy oldest gets paid to babysit my youngest daughter whenever I ask her to (very rare).  Whoever is unlucky enough to date me in the future would need to understand that my two daughters will always come first.  And if someone is really unlucky enough to marry me, I’d require a prenup so that anything I have before marriage goes to my kids in the case of my death. \n\nThis dad is definitely nta.  He’s doing everything right in my opinion.",
            "The GF is a walking RED FLAG.  She wants to accommodate her kids at the expense of your daughter.  And is calling your daughter a princess she won't let up she thinks giving you a kid will get you to do everything she wants.  Dude good luck with the Brady bunch",
            "I’m getting baby trap vibes from the step mom. Already has 4 kids, pregnant before even moving in together & marriage, mad that she can’t take advantage of the daughter (fighting all her rights), has to move in suddenly, mad she wasn’t in control of negations with his kids…. Lots of red flags here, the daughter definitely needs that lock on her door!",
            "OP certainly sounds like the right kind of parent. It’s his daughter’s home too and he has made it clear that her life isn’t going to be doubly impacted by the change in living arrangements. Totally back his support for his original family",
            "Alice sounds like a gold digger.  It’s a shame she is already pregnant.",
            "You should put your house into a trust and make your daughter the beneficiary so your new wife can’t take it when she leaves you after you’ve raised her 4 kids.",
            "I mean, your dumb. Tell her that it won’t work out and she will change her tune so fast. Show her the power imbalance is real and make her swallow it or leave. Your kid does get to suffer for her who. Her ego gets the bruise and she need to know her place in your house is under your daughter. Make it known now or she will try to push the boundaries on your daughterS show her the boundary you set is non negotiable right now.",
            "I’m sorry an evil stepmom with four kids? And he got her pregnant?",
            "At the end of the day it’s clear wife wants to be the number one woman in OPs life, and since he has a daughter, she never will be.  Step parents have to make peace with this.",
            "These are huge red flags.  Honestly you should reevaluate the relationship. \n\nShe is showing you how badly this is going to go… and once she’s in the house it will be so much harder to end it.\n\nShe, and her kids are going to terrorize your daughter",
            "Following.",
            "This is never going to work.",
            "Eh this is not about the terms that dad and daughter agreed upon, but the fact that they did not include the gf in the talks. She feels excluded like being picked on the team last. Childish but most people are immature in some way or other.",
            "Goddamn stop having kids that you can house.",
            "This is an excellent dad! I’m very impressed with him and kudos to him for putting his daughter first! Hopefully he will now see Alice for what she is and end it.",
            "Dating a woman with four kids is insanity. That’s six children to take care of in total once your child is born. To each its own but holy crap I just couldn’t do that.",
            "Nah you did the right thing for your daughter and you. They’re moving in with you. Like??? How is anyone gonna be upset. He’s right to. His kid has been there her whole like. And he’s also housing all\nHer other children like girl\nSit down. Good for the dad!!!",
            "You lost me at 11M , 9M and pregnant!",
            "Why are they always pregnant???. 🤦‍♀️",
            "NTA.  She doesn’t get to demand things in a house that isn’t hers. Why should your daughter lose her room and bathroom so her daughters can get it. What’s fair about that? I would think long and hard about this situation before she moves in. She already has preferences over her own kids in a house that isn’t hers.  ",
            "bless his heart he’s a good dad. it makes me so mad when dads prioritize their lover before their daughters/children",
            "I really don’t see this working out very well. \n\nPoor Stacey.",
            "NTA but the new wife seems like the ah. She wants to bring the daughter down a peg or two. Queen of the house is quite the statement. Almost like she’s in competition with her already and hasn’t even moved in.",
            "👏🏻👏🏻👏🏻👏🏻👏🏻NTA!!",
            "They should make the office into a nursery (if it's on master bedroom level) and basement into office",
            "This guy is so confusing. On the one hand: great support of his daughter to ensure she doesn't feel pushed out, gets paid for babysitting, has car, etc etc\n\nOn the other hand: _why are you putting a goddamn newborn in the basement?!_ \n\nI can also see the GF's point about two girls sharing a room smaller than the single girl's room. Personally, and this is just my opinion, doesn't mean GF's also right about everything, but I agree the two girls should have the bigger space since they're sharing. I can also understand her resentment that he and daughter get private spaces, but others do not, however that's just life. I suspect GF sees him as a bit of a meal ticket. Don't think this is gonna end well.",
            "This has to be fake…",
            "If the dad was smart, he would renovate the basement into his office with a full bath.  Especially working from home. He could soundproof the basement. Six kids, it’s going to be noisy.",
            "This post is from one day ago but I swear ive read it before.",
            "Throw the gf out on the street",
            "This won’t last 6 months.",
            "Parents and baby move into the basement",
            "Why are we putting the baby in the basement???",
            "Nope, youre being a good dad.  NTA",
            "I was getting stepmother vibes from Alice and then I read that the dad felt the same way. Eeeek. \nAlice just sounds like the type of person who contributes little, but expects a lot. \nKudos to the dad for staying firm about his decision for his daughter! \nAnd…**Keep. That. Door. Locked**!!!",
            "The update was posted on their profile. I don’t think my jaw dropped that heavily before.",
            "Not ta your daughter should come first why should she have to give up her room bc ur gf comes with a boat load of kids and wants to take over what has been ur daughters home for years.",
            "Crazy to me that someone has the generosity to not only let you move in low-rent, but also 4 kids. Stacy HAD her own studio she sacrificed for Alice. But no no no that's not enough. \n\nAnyways please put the boys in the basement. That's not good enough ventilation for a baby.",
            "Im glad he stood on business about his daughter because how dare the stepmom come into their house and try to make demands with her mini football team like omg the audacity and to say give her daughters the bigger room girl you don’t own that house and if there’s a problem she can get her own",
            "NTA but you should not let them move in. It’s not going to work. Your gf is going to create so much resentment in her kids towards your daughter. Her daughters are going to be awful to yours and she’s is going to do her best to get your daughter to move out after she graduates. Your daughter is about to be one miserable teenager. I feel sorry for her. Everything you expect is very reasonable but only displacing your child will make your gf happy… that doesn’t strike you as an enormous red flag? Your gf won’t be happy unless you break a promise to your “ Spoiled little princess”. Dude she is already calling your kid names. Do you honestly not think it’s going to get worse when you aren’t around. Her. Kids are going to call your daughter names too. What the heck were you thinking knocking her up🤦🏽‍♀️ what a mess.",
            "Edit: added tl/dr at the bottom\n\nWhile I absolutely agree that the nursery shouldn't be in the basement for a myriad of reasons, I'd take any bet that if someone gets their way, that was never the plan anyway.\n\nAll in all I think OOP sounds like a good dad. Alice is mental if she truly thinks that her requests are reasonable. Considering her choice words for OOP's daughter, I'm guessing all she sees in Stacy is a living representation of OOP's late wife. On the one hand, I can imagine a relationship with a widower can't be easy as it's very likely that if their spouse hadn't passed, you would not be in a relationship with the widower.\n\nOn the other hand, I absolutely agree with OOP that Alice is giving major wicked stepmother vibes. I doubt it'll stop at pushing Stacy out or her room–I wouldn't be surprised if Alice's actual plan is to give Stacy's room and her project room to her own kids, turn the leftover room upstairs into the nursery and shove Stacy into the basement.\n\nDoes that sound borderline cartoonishly extreme? Yes. Do I still think had OOP been receptive to the idea of moving Stacy out of her room, this had slowly but surely become the outcome? Absolutely. \n\nThe \"arguments\" to guilt trip OOP are pretty obvious too: Alice already started with them when she mentioned it's \"unfair\" that Stacy and OOP have spaces where they can be all alone as well as Stacy having an entire bathroom to herself. Since OOP needs his office to for his work (and he is not the issue anyway), Stacy has to give up her space.\n\nSo **what if** OOP agreed that in the spirit of the new, blended family, Stacy had to give up her room. Well, then there is the other thing. Does it really make sense to put the nursery in the basement? Alice and OOP will have months of sleepless nights until the baby will be able to sleep through the night. Does he really expect his sleep deprived, physically exhausted partner (Alice) after just giving birth to fumble her way down who-knows-how-many stairs through an unfamiliar, gigantic house in the dark of night (!!!) when she's possibly distraught as she fully knows that her baby needs her and is crying out to *her,* their mother! Does OOP really want to risk Alice's and the baby's lives by putting the nursery in the basement? What if something happens and Alice slips on the stairs?? What if they can't reach the baby in time and something happens to the baby?? Could OOP live with himself knowing that he's indirectly responsible for it because of how he assigned the rooms? Could Stacy live with herself for essentially killing her sibling because of her stubbornness?\n\nWouldn't it \"make more sense\" to move Stacy into the basement and have the nursery close to the parents bedroom? Besides, having any set of Alice's children move into the basement room would make them feel singled out and not accepted and are OOP and Stacy saying that Alice's kids are not family now??\n\n**END OF INSANE GUILT TRIP ARGUMENTS ALICE COULD USE AGAINST OOP, NOT MY ACTUAL OPINION**\n\nI remember a few days ago there was a post about a bride who insisted on a child free (16yrs+) wedding and refused to make any exceptions. Including—or rather, especially—for the groom's 15yr old son. At some point, bride let it slip that having the groom's son, aka her soon-to-be step-son, at the wedding would be just like having groom's ex there. And besides, why would the groom want anyone from his \"old family\" there when it's about starting a new family with the bride? I'm pretty sure everyone said groom would be the asshole if he went ahead with the wedding (iirc the groom replied to the bride that his son will always be his family and no one will change that).\n\nAnyway, I wouldn't be surprised if Alice's plan is to fully push Stacy (and her older brother) out of the \"new\" family. There is no way in hell, Alice won't redecorate the house and remove any and all traces of OOP's late wife, their two children and late wife's family photos as soon as Alice and her kids move in. \n\n\nShe is already upset that OOP agreed Stacy would be paid for any kind of babysitting. Stacy is older than Alice's kids and will get her license before any of them and *yet* Alice is upset that Stacy has been promised her late mother's old car for when she is old enough. Alice was fully planning on giving Stacy a life straight out of a fairytale—Cinderella, only without a prince charming who will come rescue her. Or better yet, with a platonic knight in shining armour aka her older brother. If he took Stacy in, Alice wouldn't have to worry about her at all anymore. (/s)\n\nDoes Alice know that OOP intends to have his daughter inheret the house? If she does, I wouldn't be surprised if Alice's endgame would be to do her very best to manipulate/gaslight OOP into cutting his two older kids off and revise their prenup/his will to leave the house and estate to Alice and her kids. If she doesn't know about OOP's plan to leave the house to Stacy, well the Alice is in for a rude awakening.\n\nDoes my theory seem farfetched, extreme and make Alice look like a step-mother so evil and villainous she could only exist in fiction? Yes. Yes, it does. Could it still be true because humans are greedy, jealous and insane? Yep, definitely.\n\n\nHonestly though, I hope I'm wrong and as a child of divorce with a complicated relationship to both my parents, I hope OOP stays steadfast in his devotion to his kids and keeps being a good dad.\n\n\nTL/DR: How could Alice possibly live happily ever after in Wonderland if OOP can't prove he isn't still in love with Stacy's mom?\n\n(That last one is for John lol)",
            "Wait, he promised Stacy she'd inherit the house even though she has other bio siblings, as a condition of her *allowing* her stepmother to move in? And he's perfectly happy to end the relationship with *his new baby's mother* if Stacy doesn't get her way in everything? I understand wanting to make his daughter happy, but this 15 year old has way too much power over these adults' lives.\n\nSome of the treatment he's giving Stacy is admirable and will go a long way to easing this transition for her, but only for *her*. The other kids and his new wife can all go hang apparently. Setting one kid apart as a higher class of citizen apart from your new wife and step kids is not going to end well. He wants to put a newborn in the basement and acts like asking Stacy to give up her TikTok dance studio is a generous compromise. Why even marry someone if you're going to ask them to shoulder all the burden of the transition and not take any on yourself? It sounds like he's only willing to get married if everything in his life can stay exactly the same and nothing inconveniences him or Stacy.",
            "...and another good guy dating an asshole.",
            "So, this is going to be a 2 class society: Kind Daddy and princess Stacy as the superior ones with large rooms (bay view, fridge and lock) and the other one, jammed together in small rooms and the basement……. And getting less quality food…. \n\nI really hope Alice doesn’t marry you and restrains from putting their children up to this.\nThese children as well didnt ask for you to become their stepfather and Stacy their stepsister, didn’t ask for this situation and are forced into this unpleasant situation without the possibility to turn the lock. \nI guess Stacy will rub her preferential treatment  in her stepsiblings faces at any given time.\n\nDid you ever hear that if you marry somebody with children you’re going to marry a family? But your plan is not how family works. \n\nI could question lot of your other statements as well… as if you will pay Alice’s children as well for babysitting, why you think Stacy is the exclusive one who benefits  from your wife’s life insurance and so on. Will Alice’s children attend the same school as Stacy? \n\nYTA",
            "I mean the fiancé comes with a LOT but I’ve always been taught to prioritize the spouse and the kids will come next naturally. When you are so busy protecting your own family unit, you never truly blend with the other one. If he wasn’t ready to prioritize someone, why date, let alone get into a relationship and engagement and add another child to the mix?",
            "This man seems to not care a single iota about his child that his girlfriend is carrying. I wonder if he would have stuck her alone with the kid he made if the landlord hadn't raised her rent. Insane behavior surrounding the new baby tbh.",
            "As for Stacy living in the house the rest of her life….. ummm….. no.  Finish school\n& support yourself.",
            "3am diaper blow outs when the baby is crying and you have to navigate stairs? Or 2am feedings? Or the kid is 3 and has a nightmare and wants their parents? Not to mention that below ground rooms are usually more difficult to keep warm and part of safe sleep is that you're supposed to try to keep the baby's room warmer since blankets can be a suffocation issue for very small children.\n\nAlso, what if there's an emergency? Like a fire? Assuming that they even have the proper egress windows, a 13, 11, or 10 year old should hopefully be able to open the window and crawl out on their own. A baby has to wait for the parents to come get it.\n\nHonestly, it sounds like the baby needs a crib in the parent's room for the time being. It doesn't need its own room for a while.",
            "I thought the same. Baby’s room should be close to their parents. Maybe put a couple of the other kids in the basement. Other than that, Alice is giving off evil stepmother vibes already. Good to let her know Stacy comes first. Especially considering Alice has so many kids, it’s a big change for Stacy and it’s already a step up for Alice.",
            "Or put his office in the basement and the nursery where is office is now. Baby is close to everyone else, and his office is isolated.",
            "Honestly I'd put the office in the basement. Could you imagine trying to get any work done with 6 kids tearing through the house. Sounds like a nightmare",
            "That was my thought as well. It’s probably bigger than the upstairs too and older kids probably want more privacy. Otherwise I think dad is doing right by his kid",
            "Or put the office in the basement if it’s taking up a room.",
            "I agree and the boys are old enough to go to a basement room for sharing. The boys should have that and the baby should be closer to the parents.",
            "Nah, I want several doors between me and a crying baby.  If I’ve done everything I can and they need to cry it out, do it away from me",
            "Basement should be Stacy’s since she can design it from scratch-with some sort of en suite figured in.",
            "Yeah this sounds like a total mess.",
            "He rightly called it off after she called him incestuous",
            "What struck me is how conscientious and deliberate this guy is trying to be in blending families to avoid this sort of strife. It’s unfortunate that his fiancée doesn’t seem to understand that he’s trying to ease this transition for all of them.",
            "OP’s approach of daughter first is the right approach. 15yo is a precarious age…next 3-4yrs will make or break the father/daughter relationship. Minimise disruptions now…can make more changes when daughter starts Uni in a few years. The new step mum needs to be onboard with this and be as flexible as possible.",
            "You know Alice is mad about the lock and having to pay Stacy because she fully expected to have her babysit and entertain those kids for free!",
            "Here’s the kicker though, Stacey is the owner of the house. I don’t think Alice is aware or she wouldn’t be trying to throw what she thinks is her weight around.",
            "He’s doing good things for his daughter but also seems so be setting the rest of the (6!) kids up to be second class citizens to her, which will inevitably create resentment. Like his plan is to put the newborn in the basement. And he’s already promised his eldest daughter the house despite her having two biological siblings. It just seems like he hasn’t thought about the consequences of getting married, becoming a step parent, and adding a newborn to the mix. And doing it all at once.",
            "Why the lock is a big thing? It is the most insignificant detail of the whole mess.",
            "Because she is trying to establish “supremacy” over the daughter.",
            "Right? It's her room, not the fridge.",
            "So she can tell the kids to go play with their “sister” that’s also why she’s mad he said she has to pay Stacy to watch them",
            "Don’t get married to her and then sue for partial/full custody of your child with her and you will still save yourself some headaches and money.",
            "I mean, she has 4 kids and is moving in to a huge house and still wants to calls the shots and try to push her BF’s daughter around?! Very sure she baby trapped him hoping to get herself in the deed of the house. \n\nI personally think it’s fake solely because he started dating her to begin with. He doesn’t seem to be the kind of guy that would want to get involved in that kind of headache to begin with.",
            "Like why is this literally the start of Cinderella? OOP should be worried about poison",
            "I’m guessing she thinks they’ll use the bathroom when the daughter’s not there!",
            "My dad married a woman who ran a daycare in her basement when I was 12. I lived with him full time, and we moved into her home. I was given a fairly decent sized room, but it had no lock. And what I wasn't told was that during mealtimes, the kids would be upstairs. So I moved in, and kids would start being dropped off between 5-7am. She'd start making them breakfast, and they'd just come into my room and play. Take my blankets, hit me with toys, take and break my things, you name it. I begged my dad to help fix this as it was summer time and completely unfair to me. I had gone to her a few times the first week after we moved in, but she really didn't do anything. No one offered me a lock. \n\nAfter waking up to two 9 year old boys hitting me with bats one morning, I freaked out. I screamed bloody murder (of course). I think it was the last straw for my dad and he moved us out. This dad is doing what he should for his daughter and after what I experienced, I'm so thankful that some dads are preemptively ensuring this crap doesn't happen to their kids.",
            "Even money says she was solely responsible for birth control when it failed.",
            "Agreed",
            "That’s exactly what I think too. She seems like she’s been accommodating and chill about it. I think there’s gonna be major issues.",
            "We've got a family of 6 and have one bathroom. Would I like more? Sure! Can we survive without? Yup.",
            "I think maybe he could set up his office in the basement for privacy while working from home since there’s going to be a lot of kids running around playing, making noise, fighting. Then they could put the new baby in the current office space and everyone would be all on one level.",
            "> late wife. *Paid* the majority\n\nFTFY.\n\nAlthough *payed* exists (the reason why autocorrection didn't help you), it is only correct in:\n\n * Nautical context, when it means to paint a surface, or to cover with something like tar or resin in order to make it waterproof or corrosion-resistant. *The deck is yet to be payed.*\n\n * *Payed out* when letting strings, cables or ropes out, by slacking them. *The rope is payed out! You can pull now.*\n\nUnfortunately, I was unable to find nautical or rope-related words in your comment.\n\n*Beep, boop, I'm a bot*",
            "Exactly. I'm also willing to bet his daughter is a beautiful   woman just like her mother and  fiance is jealous",
            "Yup. And he’s putting the new baby in the basement. He seems a little too hyper focused on his daughter when he also has two other biological kids and 4 new step kids. It’s like dude, you’re the one putting your daughter in this situation, some forethought and condoms would have been really helpful.",
            "I would trip her at the top of a long staircase",
            "She's in her 30s and financially strapped, he's almost 50 and wanted someone younger and hotter than he is. Of course he was boning her with reckless abandon. I highly doubt he was planning to marry her or move her in, or have a baby outside of marriage at his age. But hey she's pregnant. (OOP should probably get a paternity test)",
            "I mean, accidents happen…",
            "Of course talk to her first and make it her decision.",
            "Maybe he wants his daughter to have a nice bright room, especially if she does art? Also, moving her downstairs is kind of making it look like the main house is the new family's and she needs to be stored out of sight... don't think there will be healthy dynamics if he does that.\n\nMaybe once she's a bit older, if it's what she wants. With her mother dead and brother moved out, her dad is the only real connection she has at home, and 15 is still very young. She should be near her dad if she wants to be.",
            "I agree that this could very well be rage bait, but we also don’t know the deal with the son. Maybe the daughter is getting the house and the son is getting all of their father’s liquid assets? Or the son could be the half-brother to Stacy/not related to OOP’s late wife.",
            "I’m 90% sure this is a repost, I swear I’ve read this in the last year.",
            "Each one of those kids was a trap I bet for some other poor guys, but those guys must have seen them 🚩🚩🚩🚩and dipped. he should too, get a paternity test!!!",
            "It’s two boys who are 11 years old and 9 years old.",
            "Yeeup. Happened to me when I was 18, but it was my mom who moved a stranger into our house a few months after my dad died. This is very cool of the dad to have his kids back.",
            "They will have a bigger room than their mother provided for them and a restroom next to it. Alice was just wanting to complain. No teenager needs four random humans able to barge into their bedroom so I do not get why Alice is against his daughter having a lock. The 15 year old has her studio where she has been profiting by making art taken away. That she is able to accept a woman moving into her mother’s house is leaps above most teens.",
            "I believe prioritizing a new spouse over children from previous relationships is damaging. This child is already opening her home to new people, and I commend the OP for sticking to the agreement with his daughter. They are entering a new stage of life, and she needs to know her father will be there for her.",
            "I think that makes more sense when the spouses are the parents of the same children - making sure the parents have a solid relationship so that the whole family unit is strong is a good thing (within reason, obviously.) Putting your kid on the back burner for a new squeeze is a rotten thing to do, especially when their other parent is dead.\n\nAnd seven kids between the two of them? Christ almighty, learn to use some damn birth control!",
            "Kids always come first. If they don't, you're a shit parent, no if ands or buts about it.",
            "But kids don’t always come next naturally. Sometimes they’re completely put on the back burner. Spouses are adults who can navigate their lives, children aren’t so it’s up to the adult couple to make the blend happen, not just focus on their own relationship.",
            "The people who told you that where not good parents.",
            "Hard no. Kids first always. Always always.",
            "It’s Stacey’s house.",
            "It's actually advised to keep your baby in your room for the first 6 months, in the UK.",
            "That’s when you make the basement an office instead of",
            "I don’t understand why they don’t put the 15 year old in the basement. She gets the biggest room PLUS she’ll have room for her studio so it won’t be so cramped",
            "With six kids in the house, this is a really good idea.",
            "This is the answer. He works from home. There will be 6 kids in the house, including an infant. He needs soundproofing.",
            "Why would anyone want to give up a large room with an ensuite and bay window? No matter how well it’s renovated, it'll still be an artificially lit basement room with no view. That house was bought and paid for her parents, and she's already given up her studio space.\n\nMake the basement something special and put Alice’s older kids down there together. The littles and new baby can be upstairs close to the parents. \n\nOOP sounds like he'd negotiate that, and Alice is not starting off in the best foot. She sounds pretty awful.",
            "His fiancee knows what he's doing, and doesn't like that he's not throwing his daughter out to make room for his sparkling new girlfriend and all her kids.",
            "Yes - & the fact that Alice is already calling the daughter a \"spoiled little princess\" before she has even officially moved in tells me that the wicked stepmother phase will come sooner rather than later.",
            "It doesn’t sound like she owns it. It sounds like his first wife died, and everything was left to him, and when he dies, everything will be left to Stacey",
            "Yeah, putting the baby in the basement is nuts. It's impractical to think his wife is going to tolerate that, and she'd be right about that part. She's deeply wrong about so much else. Ugh. This is going to be a shitshow. Hopefully, his efforts to avoid alienating his daughter will allow her to feel protected from it, but by the time this is all over, everyone is likely to need therapy.",
            "I mean, unrelated to the rest of your comment, the baby doesn’t have any claim to the house. He says in the post that it was paid for with what I assume to be his late wife’s life insurance policy. The only kid that should have any claims on that house is his original son and daughter.\n\nAside from that, putting the newborn in the basement is crazy. I don’t know what he’s thinking on that one. And he should probably give up his office regardless of what his work is.",
            "Because there are four kids moving in who may or may not respect her privacy and her stuff. There are stories all over this app about step-siblings stealing or destroying shit. There are also stories about both step-siblings and step-parents barging in without knocking.",
            "That was my thought when she used the term queen. Clearly she wants to be \"queen\" not the daughter.",
            "I wish I could upvote this many times.",
            "Also, she's only contributing 15% to the housing costs.",
            "We men aren’t very cognizant of our situation until it’s too late a lot of the time",
            "4.5 kids with how many different fathers?  OP needs to RUN like the wind.",
            "And get into daughter's stuff?",
            "I’m a woman whose partner has a child from a previous relationship & a child of our own together. When I tell you that I would never expect that I would be put ahead of his child I mean never ever & if he did put me ahead of his child I would look at him completely differently I would loose all respect for him! There is nothing more attractive than a man that loves his kids, I could never be with a man that doesn’t put his kids first it’s the thing I love the most about him! I want my man to prioritise his kids first and us second to that, all children deserve to feel prioritised loved safe and comfortable especially in their own home!!!",
            "M8 you are doing the right thing. If they want acces, they need to pay for 70% of the household.\n\nI would end this relationship now. Baby or no baby.",
            "An issue I can see with his office being in the basement is that if he's down there a chunk of the day, Alice and her brood are gonna make Stacy's life hell on the main levels.  OP didn't make a good decision on being with Alice, from what it seems.",
            "A man resorting to violence? I’ve never seen this before.",
            "True, but unless they live in a country that restricts basic rights like America this is what abortion is for.",
            "And then Alice would complain about Stacy getting an entire apartment, more than likely.",
            "In all fairness, she’s bringing along FOUR kids to his ONE and they are expecting one together. There aren’t a ton of men like the OOP who see the importance of putting his children FIRST and also opening up his heart and home to FOUR more children. Fiancé needs to take a step back and be grateful for someone like him.",
            "In USA too, but know it was a year recommendation with youngest.",
            "Oz too",
            "Honestly the least the dad can do in this situation is allow his daughter the stability of keeping her room. Moving a pregnant woman and her 4 kids into the house *and* making a teenage girl move bedrooms would have sent me over the edge. His office should go in the basement but the girl should stay put.",
            "Because she doesn't want to move to the basement; she wants to keep *her own* space.",
            "How big will the basement room end up being? Why not give it to the boys or the girls instead of uprooting the existing child who has lived in that room her whole life during another major adjustment?",
            "If I were the OP, I’d make the basement a huge lovely suite/studio for Stacy. But maybe there’s not a lot of room, or privacy. Or Stacy just doesn’t want to be in the basement.",
            "Dude, you’re gonna put children in a basement while the princess stays in her big fat bedroom.  If I was your girlfriend I wouldn’t move in because clearly there is no room for her or her family which will be your family soon.  Also, keep saying your daughter comes first because soon it will be only you and your daughter.  There should be compromises and your daughter should understand that.  And as a blended family you should work on unity not us against them.  No one wins that.",
            "Yeah she’s jealous, because she knows she’s second fiddle to his daughter and previous life. The guy sounds like a great dad she should count herself lucky to find such a dedicated father figure type. A lot of losers out there she’s hit the jackpot with him what’s she complaining about a stupid room for that is his daughter’s, selfish insecure woman. 🙄",
            "It’s already here! It makes me wonder if they’ve previously interacted and how that played out. There’s probably a reason daughter asked for a lock.",
            "Even though Stacey has two other bio siblings OP *should* be considering in his will...",
            "It’s crazy they haven’t sorted out the living situation before getting pregnant.",
            "Totally impractical. His office clearly needs to go in the basement so the baby can be above ground like everyone else. His daughter keeping her room and being able to lock it makes sense. But he should have discussed this stuff with his soon to be wife instead of simply dictating it. He’s already treating her like she’s expendable and like he’s the only one in charge, which is probably at least partly why she’s reacting like this. I don’t know how she could feel secure moving into that situation. It seems like it’s going to remain his and his daughters home with the rest of the family viewed as temporary occupants who can be asked to leave at any time, especially if they run afoul of his daughter.\n\nAs for the kids… the daughter gets her own room, bathroom, minifridge, toaster oven, car, will get paid for babysitting while the other kids presumably will not, and inherits the house if anything happens. Meanwhile the baby is in the basement. Therapy for everyone now.",
            "It doesn't matter what the house was paid with. If he's on the deed, which no doubt he is as a widow, all his biological children are legally entitled to a share of the house.",
            "The baby is his child too. Under the law all of his children would have equal claim to the house if he didn’t have a will. He owns the house and can obviously do with it what he wants. But giving it to one of three children is a recipe for sibling resentment.",
            "Yes, understood the need for lock.  I didn't understand why the stepmother thinks that the lock is so bad it is worth of mentioning.",
            "Got it in one",
            "This is the relationship I had with my stepmom. It’s the best.",
            "This reminds me of the opposite of a friend of mine. She's child free and started dating a guy with kids. She told him she needed to be his top priority and he said yes. I warned her it was a big red flag but she thought it was romantic. \n\nHe turned out to be a massive tool and ruined her life.",
            "That’s true, too.  Her and her kids are moving into his and Stacy’s home. They are already making compromises by letting them move in and knew the situation ahead of time. I wouldn’t move into anyone’s home with several kids and start griping over living arrangements. I would be grateful just to have a roof over my head and possibly no/minimal bills to pay. I can’t even imagine how she’s going to react when she finds out that the house goes to Stacy if something happens to him, whether they’re married at the time or not.",
            "Well not everyone wants to have an abortion. That’s not what they are for to be used as birth control",
            "I think with my youngest brother who was born in 2019 here in the uk my mum was told 6 months minimum but 12-18 months was better. My mum likes cosleeping with those cots you connect to your bed with the little ones anyway so none of us were out of her room before like 2. A basement definitely seems too far away for a baby. They'd have a whole floor and two sets of stairs separating them. Either the girls or the boys moving in should get the basement.",
            "Cool, still doesn’t make sense to put the baby in the basement. Why doesn’t he move the boys into the basement and turn his office into the nursery",
            "While get maybe her not wanting to be in the basement, it doesn’t make ANY SENSE, to put a BABY in the basement. That’s just completely ludicrous and I don’t know why op would’ve even think she would agree to that. His plans don’t make any logistical sense, at least to me. He’s trying to make his girlfriend sound unreasonable, but he seems like the more unreasonable one. She’s also right that it’s not fair that op and Stacey have spaces completely dedicated to them, and everyone else has to share. There’s compromise, op just doesn’t want to find it",
            "Is your name Alice? Asking for a friend",
            "Sure - Move into a home with your 4 kids - the home belongs to the bf and his dead wife and he pays the mortgage and majority of the bills. Someone is definitely behaving like a princess. Btw...hi Alice.",
            "Then maybe Alice should stay in her apartment with her 4 kids. I can't imagine what a nightmare that would be, going from being an only child in her own house to suddenly having to share it with a woman & her 4 random kids.\n\nThe dad should call the entire thing off & find a woman that has fewer kids & more money. Alice is clearly taking advantage of the situation & she doesn't realize how good she has it & she's still pushing for more. He should run.",
            "Though it’s possible the son has mentioned previously that he doesn’t want the house. There’s some details missing.",
            "Yeah, it doesn’t like he intends to leave his eldest, or youngest anything",
            "Yeah this is already doomed to fail. If they’re at the stage of moving in together, OOP and Alice should have had a very open conversation about expectations for housing. The way he’s decided all of it and will not accept changes is very “as long as you live under my roof, you’ll do as I say” vibes. If they talked it through, it might have turned out the exact same way but it would have been *their* decision instead of his. Alice should probably take him up on that offer to walk, she’s putting herself and her kids at a serious risk of being homeless if they break up.",
            "I should clarify, I’m not talking about a legal claim. I’m stating I agree with OP; if it was bought with the life insurance money, it shouldn’t go to the baby.",
            "That’s a very bold statement about the law for a post that didn’t give you his specific location lol. Hopefully he already has a will in place to make his wishes clear, especially if he’s remarrying. \n\nAnd if his youngest child (who will eventually be an adult) can’t understand why they wouldn’t be receiving a house that was paid for by their sibling’s dead mother, he’d have failed to raise them with common sense and empathy. I wouldn’t expect to receive my siblings parents inheritance or life insurance, even if it was in the shape of a house.",
            "That’s exactly what they’re to be used for considering no form of contraception is 100% foolproof. No one is saying they had to have an abortion, it’s just obviously a bad idea to have a child in this situation.",
            "My youngest is nearly 8, but I too used the cosleep bassinet.  Tbh, I won’t admit on a public forum how bad cosleeping was for my family.",
            "Agreed, but this wasn't what I was commenting upon.",
            "Then the two daughters of the gf or the two sons can go into the basement. Stacy owns part of that house. She’s lived there her entire life. Her only condition, to which her father agreed, is that she gets to keep her room. It’s not her fault her father’s gf has more children than she can afford.",
            "Put the boys in the basement..set it up for them…game room , etc. they'll love that.",
            "Oh, I definitely agree, the baby in the basement is a bad idea for a lot of reasons.",
            ">it's not fair that op and Stacey have spaces completely dedicated to them, and everyone else has to share\n\nIt's also not fair that Stacey gets to keep those spaces and will eventually inherit the home due to the loss of her own mother; how is it fair Op's girlfriend's kids get to have a mom and Stacey doesn't?\n\nThey paid for that space in loss.",
            "lol!",
            "They are having a child together. Blending their families. This attitude like “my gf who is carrying my child is moving into MY home and therefore has say no say in anything” is wrong. She is contributing to household finances and is doing reproductive labor growing OPs child. \n\nIf the gf moves in it should be seen as her home too. With decisions made that makes the absolute most sense for EVERYONE, not just OPs daughter. I’m not saying that doesn’t involve Stacy keeping her room, I’m just saying her thoughts on the matter should be taken into equal account. It should be seen as blending the families, not OPs family vs. the gf’s family with OPs family having all the control. There should be compromises and decisions should be made together. \n\nHis gf should run. OP is not interested in taking her seriously, marrying her or even treating her as a wife regardless of that piece of paper. She is just a gf and a guest in his home, despite having his child. \n\nIf I were the gf I would agree to the terms, move in and start saving every damn penny I could while looking into ways to increase earning potential so I could move out. OP doesn’t see her as a life partner. She isn’t actually moving in to live there as a family with OP and his daughter, she is apparently some kind of charity case. Again, DESPITE BEING PREGNANT WITH HIS CHILD. I Bet OP didn’t treat Stacy’s mother like that",
            "He could have other belongings and investments to leave the other two but childhood home for the middle kid. Like middle kid could only be getting house but not stocks/jewelry/cars/vacation property. The guy sounds fairly well off to have this massive of a house",
            "He genuinely seems to think giving Stacy an entire house is a fair repayment for her having to give up the spare room where she makes TikToks. Wild.",
            "The man has to take the lead and it is his house",
            "From a moral standpoint, I agree. This was her mother's home.\n\n Unfortunately, unless he gets some kind of trust from a real estate lawyer, he's in trouble if he marries this woman. She will have the first claim. \n\nHe should be far more worried about that than this tbh. This squabble over bedrooms is nothing compared to what's about to happen if they marry and divorce or he dies.",
            "It’s really not. Unless you’re referring to countries where men’s inheritance rights trump women’s and it’s clear OP doesn’t live in one of those countries. Again, OP can do whatever he wants with his house. But in the eyes of the law his children would be viewed equally.",
            "My kid outgrew his bassinet when he was 4 months old 🙃\n\nAt that point he was still waking up multiple times a night so we ended up co-sleeping with him until he started sleeping through the night (so for about a month or two). I hated every second of it with every fibre of my being.",
            "You’re acting like it’s her fault the landlord jacked her rent up. And yes those are also good options, I was just saying, she would probably like the basement because she’ll have the biggest rooms plus a place for her art studio, so that way she’s her stuff isn’t all cramped up in her room. Idk, when I was 15 I would’ve LOVED basement bedroom. I would’ve recreated Raven Baxter room, with the swinging bed and all. Plus the privacy… I’d definitely take the basement",
            "That is also an option. I just don’t get how he thought his girlfriend would be okay with the baby in the basement",
            "That is such a dumb argument.",
            "I kinda get your sentiment but this is Stacy's childhood home and eventually it will be just her home. Dad is respecting that for the reason he stated in the post. It's just the right thing to do. Instead of starting off on the wrong foot with Stacy already Alice should also be understanding, but going about immediately calling her a spoiled princess and such doesn't make her look good and definitely won't help with wanting Stacy's room for her kids. It's not like we know for sure if Stacy would ever give it up but it wouldn't hurt to try approaching her nicely and talking about it, though it seems Alice thinks going the nasty route will do the trick.",
            "But by his own logic, he says Stacey should get the house because her moms life insurances paid for it, but if that’s the case, the eldest son should be entitled to half of that as well, unless he left something out, wouldn’t that be the oldest kids mother as well? And the way he phrased it, it sounds like Stacey is the SOLE inheritor",
            "That is definitely overcompensating, because unless Stacey and her older brother have different moms, he should be splitting it fairly between us he two of them before the wife was even thought of. I thinks there’s more reasons to by Alice thinks Stacey is a spoiled princess",
            "You don’t know what country he lives in, let alone what state, province, or what have you. I’m just saying “the law says the house belongs to his kids” is an assumption. We have no idea what the law says where he lives. Plenty of places would say it goes to his spouse first, which is why, like I said, I hope he’s got a will done up so that his plans are carried out accordingly.",
            "When I was 15 I finally got the basement room that I wanted all my life, and aside from the huge privacy improvement I hated it. Spiders everywhere, cold all the time, I had nightmares non-stop and nobody in the viciniy.... It was not a good fit for me. My brother has enjoyed that room for over 5 years now and would never go back to a \"regular\" room upstairs. \n\nBasement rooms aren't for everyone.",
            "She can give up 2 of her kids, she had so many anyways. She gets to keep her favourite two/one who can be treated just like the daughter. <<SARCASM INTENDED\n\n\nThe woman doesn't know what contraception is and she is not the grateful kind.",
            "It might not be the gf’s fault, but it’s also not Stacey’s problem.",
            "Sorry, but that is a heartless sentiment on your part",
            "She probably couldn’t see past the fact that he thinks it’s a good idea to put a baby in the basement. That just sounds like a disaster waiting to happen",
            "He certainly left quite a bit out but some isn't really relevant to the rest of the post, could be he has 3 baby mamas and he could expect his son to get something from his mom. Son is also of an age where discussions of the inevitable need to happen who inherits what, what future plans do the kids have, does the son even want the house etc.\n\nMy husband and I were about that age when our respective parents and grandparents started discussing those things with us. Husbands parents just updated their wills last week and we (husband, his siblings, myself, siblings spouses) were all walked through the will",
            "Stacy and her brother should get the house as their Mother’s in’s paid for it. Fair or not, Alice sounds greedy, entitled and gold digging",
            "Maybe reread my comments slowly because you’re continuing to mischaracterize them. I never said the law says the house belongs to his kids.",
            "Exactly! It depends on the  person who is getting the room. My guess is that Stacy wants the security and familiarity of a place of her own. Especially since there will be five other kids/baby coming in the claim spaces.",
            "True, I was just making a suggestion, because she had more stuff. Plus there’s a bunch of stuff you have to do to make a basement actually livable. It just makes more sense to put one of the older kids in the basement, not the baby",
            "How is what I said heartless. It’s not their fault she lost her mom, and neither is it here’s. Using the “well it’s only fair cause I lost my mother, and you have yours argument”isnt an argument at all and it’s lowkey shitty. That’s basically making someone feel guilty about something they had no control over whatsoever",
            "I'm curious as to why they won't just keep the baby in the room with them. Do they want to run up and down the stairs at 2 am? And considering how fragile infants really are I'd be more scared than upset about the distance I'd have to cover in case something happened. Babies can die for anything and over everything. SIDS, suffocating to death literally just from turning over and being unable to turn back over, choking on their own vomit, getting stuck between the cot in the crib and the wall if there's a gap to fall in, the list goes on and all of those are real life examples of deaths that families have had to go through. Alice should be more concerned about OOP's idea to keep baby down there than Stacy having her own room, unless OOP just hasn't told her that's his plan.",
            "That’s literally what is said that they should split it equally, but that’s not happening, because Stacey is getting everything. I don’t think Alice is a gold digger, I think she’s upset that she wasn’t involved in the decision and that he just made plans without her, and then decided to put the baby in the the BASEMENT. I get he should get Stacey’s okay, but he didn’t even seem to discuss it with Alice, just decided for her. He doesn’t even seem to want to compromise the least bit, but everyone else has to. Notice how Stacey had to give up one of her spaces, but he’s not getting rid of his. Op seems a little selfish, and is treating Alice and her kids like their temporary, not like he actually wants to build a life with her",
            "It would make sense if the older kids wanted it and there were other options unlike here where it doesn’t seem like that’s the case. She gets to keep her room and not move into the basement because it’s *her* room in the house she has always lived in that her two parents owned and paid off before her dads new girlfriend came into the picture and her dad gave her the choice of where she wanted to be to make a huge adjustment a little less hard on her. Saying what you would’ve wanted as a teen, or what makes more sense to you is irrelevant. \n\nIf the girlfriend doesn’t like the arrangement, then she can find other living arrangements somewhere else where she only has to pay 20% of a paid off houses expenses while taking up 3 bedrooms and all the shared spaces. Complaining about the original inhabitants *two rooms* that she doesn’t get a say in in a very generous arrangement to her favor is spoiled and extremely selfish.",
            "It's not about fault, and the fact you bring that up shows you don't realise how hard such a loss is. \n\nTbf to you though, no one does, until they experience it.",
            "But can't the gf and her litter be just grateful? \nWhen people say \"give an inch and they ask for a mile\" this is what they meant. The girlfriend's children better be grateful and respectful to the OP's daughter. Poor girl is going to be ambushed in her own house with no space to turn. Imagine your dad's 3 minutes of joy turning into your three years of nightmare.\n\nAlso the gf is already drowning in entitlement.",
            "Yeah, but the baby is eventually gonna grow into a person that needs it’s own space. Shell need a room eventually, and the basement isn’t gonna be a good option until she’s quite a bit older",
            "Putting the baby in the basement is crazy but he gets to decide what to do with his house, fairly or unfairly not Alice. It’s not her house, truthfully , maybe she needs to take this as a red flag and bounce."
        ]
    }
}