{
    "JUNE POST MATCH THREAD: IF YOU HAVEN'T STARTED RESIDENCY YET AND/OR ARE A MEDICAL STUDENT, PLEASE POST IN THIS THREAD": {
        "title": "JUNE POST MATCH THREAD: IF YOU HAVEN'T STARTED RESIDENCY YET AND/OR ARE A MEDICAL STUDENT, PLEASE POST IN THIS THREAD",
        "score": 23,
        "url": "https://www.reddit.com/r/Residency/comments/1d7nw8y/june_post_match_thread_if_you_havent_started/",
        "content": "Since the match there has been a huge increase in advice threads for matched students that haven't started residency yet. Please post all post-match questions/comments here if you haven't started residency. All questions from people who have matched but haven't started yet will be removed from the main feed. After the 2024-2025 intern year has started, the sub will go back to the dumb questions sticky.\n\nAs a reminder, \"what are my chances?\" or similar posts about resident applications or posts asking which specialty you should go into, what a specialty is like or if you are a fit for a certain specialty are better suited for [](https://www.reddit.com/r/medicalschool/). These posts have always been removed and will continue to be removed from the main feed.",
        "num_comments": 49,
        "comments": [
            "Bro anyone else have to furnish a whole ass apartment??? This shit is annoying, I'm starting from scratch but even everything Ikea is gonna run like 2g's at this rate smfh.",
            "Starting my TY year soon. Orientation in 2 weeks. Bored in the meantime. Should I start UWorld studying now to take step 3 early?",
            "Starting my intern year in 10 days, moving to Atlanta suburbs in 2 days.. both excited and nervous about it 🙂‍↔️",
            "Starting a prelim medicine year soon and I'm feeling very unprepared. There probably isn't a way to be so prepared that it's a breeze, but is there anything you all wish you knew/did when you started?",
            "Working long hours straight can be really tough. For me, I can't usually go for more than 4-5 hours without feeling exhausted too so here are a few things that help me out;I like to follow the Pomodoro Technique. I work for 25 minutes, then take a 5-minute break. After doing this four times, I take a longer break. It helps keep me from burning out. Having a comfy chair, good lighting, and a proper desk makes a huge difference for me. If I'm not comfortable, I get tired and achy way faster.",
            "Any simple meal prep recommendations? I have an Instant Pot, air fryer, and a blender along with regular kitchen ware.",
            "Incoming FM resident here. I'm very nervous because it seems as though I've forgotten a lot information I used to know. Sometimes I worry about whether I'll know what treatments to do for a patient or how to put orders in,  etc. I'm really anxious about residency and messing up. Any advice on how to prepare or calm myself down? TYIA",
            "[deleted]",
            "Thank you for contributing to the sub! If your post was filtered by the automod, please read the rules. Your post will be reviewed but will not be approved if it violates the rules of the sub. The most common reasons for removal are -  medical students or premeds asking what a specialty is like, which specialty they should go into, which program is good or about their chances of matching, mentioning midlevels without using the midlevel flair, matched medical students asking questions instead of using the stickied thread in the sub for post-match questions, posting identifying information for targeted harassment. Please do not message the moderators if your post falls into one of these categories. Otherwise, your post will be reviewed in 24 hours and approved if it doesn't violate the rules. Thanks!\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Residency) if you have any questions or concerns.*",
            "Thinking about med school loans, especially since residency is just about to start. I'm planning on doing PSLF, and I would like to start making payments ASAP since my payments will be $0 on the SAVE plan. However, to start making payments, I need to consolidate my direct unsubsidized loans since they have a 6 month grace period that cannot be waived. Has anyone gone through the federal consolidation process and started making payments?",
            "joining a relatively new residency. any thoughts on fundraising to get niceties for our resident room/swag/lead. we dont have individual lead vests for residents, resident room is bare, want to make stickers or mugs or jackets at some point. was thinking like a fridge fund in the clinic/department with energy drinks etc from costco. what else doesn't take a ton of our free time away?",
            "Any residents from Canadian programs know if there is drug testing prior to starting residency?",
            "Im moving out of state for my TY but matched in my home state. Does anyone know if I can still vote in my home state this year or am I obligated to vote in my TY state? Obviously idgaf about the outcome of elections in my TY state",
            "Any advice for preparing for audition rotations in orthopedics? I have the Handbook of Fractures, Netters, and Pocket Pimped, but I don't know where to start.",
            "What is happening to the MLKCH program? The hospital might be closing.",
            "can anyone lend me onlinemed intern guide for free or at affordable cost,cant afford the full price",
            "Positive quantiferon test. Would this affect my employment? \n\nHello, I am incoming intern. Earlier this week I had my pre-employment medical checkup, and today I was informed that my QFT came back positive. I'm scheduled for a CXR next week. I am asymptomatic, with no recent travel or exposure history. \n\nI understand that latent TB is non infectious therefore there should be no risk of this affecting my employment. But I wanted to ask here for some peace of mind. This should be a pretty standard thing right? If it is LTBI, I just take my prescribed medication and start residency normally? \n\nThank you",
            "Are there any good speech-to-text apps for checklist to-dos? Like if I say \"room 18, check EKG, replete Mg\" it will add those to-dos to the room 18 pt and I can just check off the to-dos when I'm done? I feel this'll be more efficient rather than making a checklist by hand",
            "ignore this just screaming into the void: but f\\*ck I really really don't want to do this, not even for all the money in the world",
            "To all my fellow medical students who are worried about the match process and can't find a specific sub to ask their questions, I have created one for all of us to ask our questions and get through the match easier :) residencyinamerica is the name for anyone looking to ask their questions!",
            "(16m) high school student.\nI'm planning to study medicine in Syria, which is taught in Arabic.\nI aim to work and study really hard and then go into a prestigious residency program.\nBut I'm concerned that the Syrian certificate is too weak and that fact the I'll learn medicine in Arabic won't help me achieve this goal.\nSo what are your thoughts?\nAre universities like JH or Harvard out of reach whatever I do?\nWhat are the best universities I should expect?\nAnd what can I do to strengthen my profile and extracurriculars?\nAs a physician, do you know any other physician who studied in Syria and got accepted into a good residency program/became a successful doctor?",
            "Having moved a bunch of times in my life, I would say to focus on the essentials first. Just get something to sleep on, something to work on and something to eat on. Then get a few pots/pans and plates/bowls along with utensils. Then get more stuff as the spirit moves you.\n\nMost everything else is optional.",
            "Apply for an IKEA Projekt card. If you spend over 2500 it’s 2 years 0% interest financing! We literally applied on my cellphone, took 5min, walked in and got a temporary shopping pass (I think this is easier to do if you apply in store) and bought all our shit for the new place",
            "Facebook marketplace is a really good place to start, a lot of people just tryna get rid of funiture.",
            "I took mine halfway into the year and don’t regret it. It’s a hard test but the curve is great because no one has time to crush this one, nor do they care to (unless you’re gunning for cards or GI maybe). If you have the time now, do it but you’ll be fine taking it any time",
            "i did this :)",
            "WOO!! welcome to Metro Atlanta, I hope you like it here!",
            "Nah man just go with the flow prelim year was shit hours but good times I look back on it fondly lol",
            "If you can afford it, Trifecta meals are really great. Otherwise, I like a sheet pan dinner. Roast a shit ton of vegetables and meat while you complete other tasks.",
            "Hey man/woman/homie. This was 100% me last year. I know it’s impossible but try your hardest not to worry. You’ll learn everything you need in the first week. Expectations for interns are so low that you’ll surpass them just by showing up on time and being eager to learn. Just have a good attitude and you’re gonna do great!",
            "This is a GOOD thing. It's the people who aren't worried at this point who are the scary ones. \n\nYou WON'T know what treatment is best for the patient. You WON'T know how to put in orders. That is expected, and that is why you have seniors. \n\nWhen I was an intern I kept hearing the phrase \"independence of thought, not of action.\" Think through things yourself, but you're not going to be making any patient cate decisions on your own at the beginning.\n\nNever be afraid to ask your senior, even if you think it sounds dumb. \"Hey, I got paged about x, I think it's y because whatever, and I want to do z. Does that sound reasonable to you or am I missing something?\" This is a very clear way to show your seniors that you are on the ball, you thought through the problem yourself and have an answer, and are being safe because you're new. \n\nAt the same time, on Day 1 it's totally fine to say \"Hey, I got paged about x, and I have absolutely no idea what to do.\" lol that is the level you're expected to be at.",
            "Got block schedule for the year but no specific schedule",
            "I applied for federal loan consolidation and the SAVE plan on May 18th. My consolidation was complete on June 13th. I am still waiting for my SAVE plan application to be processed and approved.",
            "commenting to follow",
            "are there any negatives to consolidating before the grace period is up?",
            "Google your states residency and voting laws. Some have provisions for voting absentee if you are away doing a training or education program, some don’t",
            "Damnit 2 years would have been better, I opened a new AmEx with 0% APR for this literally like the other day 😂 which lasts 15 months but should be fine from my rough budget calculations. Sucks without knowing how much in taxes exactly you’re gonna lose… I just gotta find cheap shit to last 3 years 😂",
            "Gonna have to login for the first time in like 7 years 😂😂 Totally forgot about FB Marketplace, thanks for the obvious but necessary heads up brotha",
            "when did you take step 3?",
            "…really? It’s not an unceasing hellscape?",
            "Thank you! I'll take a look.",
            "Uh....what if we don't have seniors??",
            "June 1 and 3! last week! I wanted to take it around the 15th but all the dates were full so I kinda rushed it.",
            "It is",
            "You do have a senior. The majority of the time it will be a senior resident. If it's not a resident, your senior is your attending. If you're on night float with no direct senior in house, there is some indirect senior in house to call with questions.\n\nYou 100% have someone to escalate to, and it is your responsibility to know who that person is.",
            "That’s awesome!! What did you do to study? How many UWorld questions did you complete?",
            "Got it. Preparing for death.",
            "Well yes you're right, its my attending. But it'd be nice to have some resident to show me the ropes without ruining first impressions with my boss",
            "Tbh waiting to see if a passed so idk if you should do the same amount as me. I did like 90% of uworld (500 questions were the literal day before) then about 100 CCS cases like 70 of them the day before I had part 2. No practice exams",
            "Yes, it would be! But your attending does this every year, presumably. They know what to expect. The first impression will be excellent if you take good care of patients by asking them questions when you're uncertain. The only way to ruin a first impression in residency is to not ask questions when you have them. If you are considered an unsafe resident, that label will follow you for your entire residency.\n\nThink of it this way: as a chief I am very comfortable when an intern is on overnight who I know will ask questions when needed. I sleep very well. The interns who are too self-conscious to ask questions, that's when I get nervous and chart check from home at regular intervals and don't get much sleep. They scare me. The ones who wake me up all the time to ask questions are the ones I trust.\n\nYour attending will sleep soundly at night if they know you will ask questions when you have them."
        ]
    },
    "The Fake Medical Student (y’all have any stories??)": {
        "title": "The Fake Medical Student (y’all have any stories??)",
        "score": 634,
        "url": "https://www.reddit.com/r/Residency/comments/1dlle4s/the_fake_medical_student_yall_have_any_stories/",
        "content": "I had one in my medical school class get coated and make it through a week of class before her college professor saw her Facebook posts about it and couldn’t believe she got in, so called the school. \n\nBut the better one happened during residency. While on an EM rotation, a med student showed up to the work room for her night shift. Confused, an EM resident told her that tonight’s medical student was already here - surely a scheduling mistake. He gestured to a young man in a short white coat with the school’s patch on it. She stared at him closely for a moment then said, “He’s not a med student. He doesn’t go to this school.” Cue anxious whispering. I hadn’t worked with him, but I turned my attention to his fit: school logo was a patch, not embroidered, badge was fake, etc. He had been in the ED seeing patients and telling people he was in med school both at the hospital and in his personal life. The (real) med students later showed me screenshots from his Facebook page showing him posing in a long white coat, bogus transcripts that nobody who went to med school would ever think were real, photos in the ED with patient info/scans visible, and saying he was a “trauma surgery intern” whatever that means as a med student. Homeboy got led out of there in cuffs. Not sure what ultimately happened to him in terms of charges but the nerve to just show up to clerkships… I’ll never quite grasp that mentality. \n\nAny of y’all ever had a fake med student?\n\nEdit: If anyone reading this is a former (or current) medical student impersonator, I think the group would be genuinely fascinated to hear your story and what your overall plan was. ",
        "num_comments": 206,
        "comments": [
            "Why would anyone want to do 3rd year shit for not even a degree",
            "I’m a nurse but I know a fake doctor. She had been telling everyone that she was in medical school for years. She finally ‘graduated’ but decided to ‘put off residency’ so she could ‘take care of her sick mom’. She’s even going to ‘open up her own hospital’. Her own hospital?! She took a bunch of graduation pictures with a white coat, that she got from god knows where, and a disposable looking stethoscope around her neck because she had ‘just lost her littmann’ She works at a couple of different hospitals but as like a unit secretary. She’s on a women’s health advisory council for DHHS, listed as an MD. She is most definitely not an MD. She’s is  real REAL crazy though.",
            "Had one when I was in med school. It was a freshman in college studying neuroscience who I think did some legit shadowing but during that time realized that the process to get a med student badge was ridiculously easy. Go to the correct office and say “hi I’m a med student and need a badge”. \n\nSo she went back and said she was a med student and got her badge and just started following one of the trauma surgery teams around. People only figured it out when they realized her medical knowledge was astoundingly bad and she kept telling stories about high school that seemed a little too recent. (She of course also posted pics to social media)\n\nWe all found out about it because the badging process became much more rigorous",
            "This kind of mental illness is so scary.",
            "Had one in our class - she went on full social media lock mid third year, which is a bummer because I wanted to know where she'd pretend to match",
            "This is common enough that you know TWO??? Damn!!",
            "We never had any fakers when I was in school, but we did have a guy who would come to the med school in a white coat so he could blend in enough to steal student's laptops. School had to make study areas accessible via badge access.",
            "I had a classmate who failed MS1, then failed again on repeat while still pretending to be with us MS2. Come MS3 year (she was expelled by this point) she moved to a different city where one of our clinical sites was and pretended to be on schedule with STEP and rotations. I just assumed she didn’t want to tell her parents or something. But then she was caught toward the end of MS4 trying to see patients in her white coat. No idea why she was this dedicated, because the reading she failed was that she never came to anatomy lab",
            "Twolittlebears anyone? Am I dating myself?",
            "When I was a student, there was a student who had some personal issues that led to her “symbolically withdrawing” from school, as she put it. She dealt with them and then tried to come back the following year. Only problem was the school took her withdrawing seriously and decided that she would need to repeat the semester she withdrew from, rather than just picking up where she left off as she proposed. While this was going on, she attended all of our classes as if nothing had happened. She even sat in the front row and made it known she was there. We all knew she wasnt officially enrolled, and in the end they did not let her back in/ she gave up trying.",
            "A local EMT was listed as staff PA-C in the catalogue of a well-known Mountain/Austere Medicine seminar. He was teaching the suture lab! I was so effing pissed because I actually wanted to attend that seminar. I did my homework and verified that he was not and never was a PA, then blew it all up by contacting him, blasting every email I could find at the seminar, and tagging it all on social media.",
            "The local psychiatry training scheme had something similar. They were having a lot of trouble with a trainee who was clearly capable but fundamentally dishonest, eg overclaiming shifts and the like. \n\n\nWhen they finally had enough and contacted the licensing board (or indeed GMC as this was in the UK), they said \"er.. you know this person has already been struck off, when they were working in obs, for cheque fraud\".\n\n\nWhen challenged she said, \"oh I thought they could only strike you off for one speciality at a time\".",
            "Nothing irl but so much from one person on social media - never physically went anywhere to impersonate a medical professional or even gave medical advice online, it's just photos and/or job status updates (which have escalated to \"resident physician\"). So it's more or less harmless(?), but sad.",
            "why is it always trauma surgery 😭 one of my classmates got kicked out for doing the same thing to ERs around the state",
            "I’m a nurse, but back when I was in school during my OB clinical in 2022, I saw a woman dressed in scrubs (with an “RN” badge) walking up and down the unit seemingly trying to look busy, but I found it odd that she did not have a WOW, even moreso when she asked me “oh wow it is usually this busy here?”, even though it was one of the more quiet and chill shifts I had ever had during my time as a student. No one seemed to recognize her, but mind you, there were a lot of travelers on any given unit during COVID and this was a massive county hospital. \n\nOur professor dismissed us for lunch and I came back to a fully locked-down unit, with security standing guard, police at the nurses’ station interviewing my preceptor who was in tears. \n\nApparently, that woman went into a patient room on postpartum and told the parents that she was taking their baby for “a CT scan to check his brain”. \n\nThe baby was as healthy as they come so the parents were understandably confused and started asking a bunch of questions. The “nurse” panicked and left. We later found out it was a random person trying to steal a baby from the hospital. Police eventually found her car and there were boxes of formula, a car seat, and other various baby items one would need to care for a newborn. Absolutely wild. The whole thing even made it onto the local news.",
            "Wtf this actually happens??!",
            "I had a cousin that did this years ago. He was a frequenter of the ED as a psych patient at a smallish hospital with a family practice residency. At some point he got hold of a white coat and a clip board and started following the residents on rounds. Don’t know the details but I think it was caught pretty quickly. He had a habit of pretending to be all kinds of other different important people as well, and wrote hundreds of thousands of dollars worth of bad checks (often stolen) for extravagant purchases. \n\nHonestly, I recall him always being was nice as can be and I don’t think would’ve hurt a fly but obviously he wasn’t firing on all cylinders.",
            "We had one. Anatomy prof figured it out because he was spending much of the anatomy labs in the men’s room puking",
            "On a silly and dumb note, I know of the following people who pretend to have gone to medical school.\n\n1. Ex'Gf's father is a Chiro.  He routinely tells people, including patients he graduated medical school.\n\n2. Girl I graduated high school with is a PA.  Throughout her training she frequently posted about being in medical school.  I never noticed her claiming to be a doctor but many of her family members refer to her as such and she never corrected them.\n\n3. Girl I went to graduate school with is a Physical Therapist.  Periodically would mention to me that she was also applying to medical school but did NOT need an MCAT.",
            "There is a few people in my class I wish were fake.",
            "Different profession but same thread: my brother is a military pilot, and on one of his deployments, a guy claiming to be a pilot showed up to take over one of my brother’s non-flight duty of listening to airplane chatter. This guy must have said some stuff that tripped a trigger, because people came running to my brother to verify if this guy was REALLY a pilot. One conversation later, my brother was able to shake out that this guy was a flight officer, not a pilot. (Think Goose, not Maverick.)\nLike dude, your job is already pretty cool, what’re you doing lying, let alone lying where it can be EASILY figured out??",
            "This isn’t about a fake medical student, although it may turn into that this year. I was admitted into an early assurance BS-MD program in high school. There’s only 7 people in my cohort and 3 come from this one very competitive (extremely toxic) high school, and they told me that one kid from their high school lied to his parents and told them he got into the program. Supposedly he faked getting an interview invite by buying a plane ticket to the school and even made a fake acceptance letter. He also went around school telling everyone he was “BS-MD” when we were literally in the same anatomy lab. Not sure if he knew I was in the program, but dude was such a weirdo. We all graduated this spring so now I’m curious what his plan is moving forward since we (and maybe he too) start medical school in August. I’ll keep you updated in case I see him get coated lol.",
            "I don’t have a fake doctor story but my father is a commercial airline pilot and was doing a contract so he lived with another captain as a room mate for a few months. One day his room mate was arrested while in the flight deck before take off. Turns out he was faking being a commercial airline pilot for years! Not only a pilot but a CAPTAIN! Thomas Salme is his name. \n\nHe is actually a really nice guy, leant us his house in Milan one time and his house was just full of airplane models and airplane posters plastering the walls. Crazy he got away with it for so long.",
            "That's story was intense.  \n\nOur situation was definitely less criminal.  We had multiple instances in which students on academic suspension would pretend to still be enrolled with the current cohort by attending lecture.  They did not have access to labs so when asked about their absence they would always make a different excuse (Sick, doctors appointment, switched labs, etc).\n\nWe also had a student who failed out who kept returning to campus to hang out with their friends.  She was pretty open about being kicked out and the school ended up deactivating her badges and talking to her (I believe in email) to let her know she wasn't allowed on campus without actual business.",
            "There was apparently a fake resident that would walk into the ICU in scrubs and order nurses to titrate drips",
            "There was that college student who pretended to be a PA a few years ago, even somehow got hospital badges",
            "Damn I thought the girl that hung out at the bar down the street from the school telling everyone she was a student was bad",
            "Apparently this happened a few years ago in my school. A 5th year medical student (note: in europe it's 6 years) that went to australia for residency/clerkship to practice as a physician and lied that he already graduated. They somehow later found out, and he got kicked out of school. I'm pretty sure he got also arrested.",
            "Well, UK has hundreds if not thousands of them, they call themselves Physician Associates.",
            "This is so strange. Reminds me of Christopher Lloyd in that movie with Michael Keaton",
            "My cousins gf would go around telling people she was a medical student but suspiciously would keep her trap shut around me. She was doing her certificate in nutrition. Nothing against nutritionists but dieticians are the proper registered health professional in my country, so she wasn’t even an AHPRA registered professional. Pity because if she was that would 100% be a violation of her registration.",
            "I wanna know more about the first student! The professor called and then what?!",
            "If anyone reading this is a former (or current) medical student impersonator, I think the group would be genuinely fascinated to hear your story and what your overall plan was.",
            "When I was a 1st year med student in India, there was a student 4 years our senior but still doing anat lab with us. She could not even point to sternum on the cadaver when asked, after 4 years of being at the same anat lab! She kept failing all her classes and eventually the school had to let her go. I came to know that her parents had forced her into med school and had essentially bought a spot for her. I heard she is now a medical office assistant somewhere in Texas and doing much better now.",
            "Had this happen in a west coast school in 2013. She was attending the “new student” get togethers and was part of our facebook group. Someone figured it out can reported her. Honestly, such a fascinating phenomenon.",
            "these stories are wild. wow! I could neverrrr.",
            "Love the stories here. My current hospital and old medical school verified people coming in so it would never fly here. The thought of some random person who hasn’t been educated on HIPAA and whatever having access to that data is scary. I’m surprised paparazzi haven’t tried it to go after celebrities tbh.",
            "I hope and hope that she’s changed as time passed, but we had a first year med student in my dorm who seemed like the perfect person. Cheerful, smart, athletic, travelled a lot despite not being rich, beautiful but never shallow, very charismatic, friendly, … except she was starting her year over and over again but kept failing very badly. At some point though, it became clear that she was pathologically lying to everyone about nearly everything in her life. It apparently culminated with pretending to be a doctor in order to advise a cancer patient to refuse her chemo, in order to make herself look smart. University stopped accepting her so she moved to another country to start again.",
            "I haven’t read all the comments yet, but having had countless jobs over my lifetime and nearing the end of mine now despite still appearing to be about 30, I think this would be an absolutely phenomenal way to go out. Totally putting on my bucket list.",
            "[removed]",
            "There was an incident years ago in my city that a random guy pretended to be a doctor. I can't remember exactly, but i think the guy told the security guard he forgot the staff card and he was given a temp card (major security issue, I know). He ended up walking around the wards for 3 days and even used a stethoscope to examine a patient and called their family. It was until on the third day he tried chatting with some interns and was noted to be utterly incompetent. He was arrested in the end. Turns out he had some medical knowledge and studied up to preclinical years in some overseas med school. Not sure if he is mentally ill or anything or what happened to him afterwards but that definitely boosted the security level of hospitals around here.",
            "Thank you for contributing to the sub! If your post was filtered by the automod, please read the rules. Your post will be reviewed but will not be approved if it violates the rules of the sub. The most common reasons for removal are -  medical students or premeds asking what a specialty is like, which specialty they should go into, which program is good or about their chances of matching, mentioning midlevels without using the midlevel flair, matched medical students asking questions instead of using the stickied thread in the sub for post-match questions, posting identifying information for targeted harassment. Please do not message the moderators if your post falls into one of these categories. Otherwise, your post will be reviewed in 24 hours and approved if it doesn't violate the rules. Thanks!\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Residency) if you have any questions or concerns.*",
            "There was a woman who was very active on multiple forums about a decade ago who claimed to be a doctor. She was a prolific poster and came off as more than a bit unhinged. Someone dug into her background and posted a reveal. She actually *had* been a medical student but had been kicked out after failing her step exam too many times, then she spent years and years trying to get into another medical school. She was accepted at a Caribbean school but couldn't finish as it had been too many years since she'd sat for step 1 I think. Her LinkedIn is still active and lists her as an MS4 for the past 16 years.",
            "We had one at my medical school back in 2014! That was when we had all started our first year and the hustle bustle of beginning med school was always in the air. We were all so excited and nervous! Orientation classes, ethics class, and everyone was in the bookstore buying our supplies and tools like stethoscopes. We went to go get our stuff in groups like white coats and school swag. We got our badges. \n\nThe whole time there was a short black guy with us (I think I remember he had some kind of accent?) that blended in really well and he was excited too. We all just thought he was one of us!  I don’t know how they figured it out, but eventually about 2-3 weeks in, there was a whole scene and he was apprehended by police as an imposter! He has been posting on social media that he was a med student, had taken photos of orientation, somehow I think he got a white coat. We were all pretty shocked. \n\nAlso side note one year there was a 3rd or 4th year med student who was expelled after she stole an iPad from an elderly patient that passed away. Her family had specifically been looking for the iPad because there were lots of family photos on there. Said med student forgot that Apple products can be tracked back to her home! She had even tried to change the name of the iPad to her own, which helped their criminal case as well that it wasn’t a “mistake.”\n\nAnyone who went to my school will immediately know from the above stories!! Any extra deets would be so juicy, we are almost at a 10 year anniversary so spill the beans!",
            "This one is from my home country, it was a fake resident. Dude got a coat with some embroidery (where I am from, we purchase our lab coats and we take to place the embroidery ourselves - so it is pretty easy to get one - the lab coat store does not care lol) and the security was pretty lame. He managed to enter the ER and find a PC that a real resident forgot to log off. He discharged a bunch of people. I don’t remember how he was caught - I had already graduated and followed the case most through gossip and the local newspaper. He got arrested. And he said he did it because he was a grey’s anatomy fan.\nThe real resident that forgot to log off was suspended (don’t remember clearly if expelled too)",
            "I've run into a few \"Doctors,\" that I was convinced were impersonating being a physician. If they can fake it long enough they can make some money and don't incur educational debt. Some hospitals don't properly vet people willing to do locums work.",
            "There was an infamously insane/bad resident that was let go from my New York program.\n\n\nA few weeks later, we got news that she was arrested at one of the Harvard teaching hospitals, pretending to be there on a visiting resident rotation or a “transfer” who knows \n\nAlso surgery… seems like a theme",
            "Not the same thing,  but I know a former EMT that was doing that claiming to be a Paramedic student.  He'd started a bunch of IVs, attempted an intubation, and administered several meds before an incoming crew from his area called him out.\n\nHe's now a cop.",
            "Halfway through my o&g term we suddenly had to start showing ID at every entrance to theatre and swiping in and out of every door and they put up signs with photos of current students.  Apparently some guy had just been asking people to let him in, putting on scrubs and standing around in theatre with no affiliation to any school or hospital.",
            "In New Zealand there was a case where a medical student's flatmate was super curious about surgery and things. The medical student gave him there ID badge and told them how to get into theatre's. \n\nHe ended up scrubbed helping in the operation. The surgeon asked him what he wanted to do in medicine later on- the idiot then said he was a builders apprentice and not a medical student. \n\nHuge deal, the medical student got kicked out. Don't think much happened to the other guy. Ironically if he had actually pretended to be a medical student they likely would have gotten away with it \n\nHonestly, 2 stupid kids who didn't understand the ramifications of their actions. Which I kinda get",
            "To be a medical student and do what a medical student has to do without the promise of a degree is insane.  No sane person would do those things for fun",
            "If they can pass the USMLE exams just give em the degree",
            " This cannot be real… sorry. But this literally can never happen. And how would the college professor have any power???",
            "Right?! I guess he was just going to try and attribute everything to clerical mistakes and figured if enough people knew him they wouldn’t question it? I don’t know what he was thinking. But the girl who made it a week into my med school class bought a white coat and managed to get coated during the ceremony. I think she got rejected and was lying to her parents hoping that after 4 years her name would just get added to enough lists that she’d sneak out with a degree.",
            "They probably built their entire post high school and college existence on being a premed that WILL become a doctor. So at some point they start faking it and hope people believe them.",
            "Bro saw catch me if you can and felt inspired",
            "Lol they watched too much suits",
            "🤣🤣",
            "bitches",
            "Wow, that’s a powerful delusion. I think DHHS might appreciate an anonymous letter tipping them off about one of their advisors telling a major lie. \n\nSo she doesn’t fake being a doctor in the hospital, just more like socially? Was she saying she was in medical school while doing the unit clerk gig?? Because ain’t no time for a job during those years!",
            "“I know a fake doctor”they said \nIn real life they caught my dumbass first week of residency stuttering through a patient presentation. Fair assessment though lol",
            "Ok at this point this person needs to be named. She’s on a government panel meaning her decisions have an impact on the general public.",
            "Huh???",
            "Wowwwww what did she think was going to happen?? I’ve never had this come up with a med student I was supervising in a way that I’d have any idea what their medical knowledge was. But that’s something I hadn’t thought of as much before. Even though you feel stupid (or at least I did) showing up for clerkships, you at least know some things. I can’t imagine how awkward some of those knowledge gap moments got with the surgeons.\n\nAlso lmao her stories about high school seemed a little too recent. Showing TikTok videos of her junior prom.",
            "Oh wow so she made it all the way to mid third year?? Did people know? How’d she get caught?",
            "Huh???",
            "One was in my orientation/very first week of med school. The other was pretending to be a student on EM when I was an intern doing a rotation down there. So ya I guess I’ve run into 2 (that I know of) in my day. That’s not counting all the online fakers with DC and DNP and RD and PsyD and all sorts of similar degrees who misrepresent themselves to be physicians online and in social circles.",
            "There were multiple people walking around your med school in white coats?! \n\nWe were required to wear our short white coats on simulation days in med school, but you only ever saw the white coats come out on sim days and aside from one day last year when I was cold, I haven’t worn one since.",
            "What a dick! I’d have gone savage on him if he tried to snatch my shit with my notes on it and all the stuff standing between me and passing this class… I’d batter his ass with the business end of my stethoscope. They ought to enroll him and make him take step 1 as punishment.",
            "Now this sounds normal. People do that all the time in ERs.",
            "Ya hard to pass if you don’t show up! Still, scary how easy that must have been to just pretend to be on cycle. I wouldn’t have suspected that from a classmate I’d known for a few years. But was she expecting to get a degree at the end or something??",
            "I 100% know who you are are talking about. Guess what? After that, She went to a Caribbean medical school and then matched IM in New Jersey. She’s currently a resident. \n\nI emailed the copy of her BOLO (from our school) to (her new) school but they said they already knew and didn’t care.\n\nOh!!! And you forgot the part where she was on the national board for AMSA after being expelled and didn’t step down until they threatened to sue her.\n\nShe also did AMSA’s podcast as a “3rd year” (but had never finished 1st year) to talk about research she “did” on parents whose kids died in the PICU. She did not do any such research.",
            "Holy shit, she earned a gold for the mental gymnastics trying to prove to everyone she got into medical school with her stethoscope/first aid/skull pictures.",
            "Core memory unlocked.",
            "Pls pls inform me",
            "Still on Instagram although now as caitlynandcharlee! No longer pretending to do anything medicine adjacent. I followed every detail of this in real time for years 🫣",
            "I heard that she finally made to Pittsburgh Med School? Idk",
            "Omggg I’m a nurse but I follow her 😂 she now lives in NYC and has some type of blog I think or works in digital social media. idk. I thought that situation was weird too lol",
            "That’s insane, a semester is nothing in the grand scheme of things. What a small setback to give up on",
            "Wow I guess she thought they’d just give in?",
            "Why would she do that instead of just going to med school… \n\nI don’t understand?",
            "so she completed a semester successfully and they forced her to repeat it, or was in her 2nd semester when she quit and they said she had to restart the second semester?",
            "Good for you! People like that deserve to be called out. It’s analogous to the Stolen Valor Act and I think beyond a good ethical line that it really becomes a problem when people obtain financial or material gain through falsely representing their identity or qualifications. Like he can go around at parties and say he’s a PA, but when he uses that fake title like this guy is, that’s where he needs to be put in his place and held accountable for the deceit.",
            "Did the seminar say anything",
            "Hahaha!! So she was waiting for the moment to burn through this one. I admire the optimistic flair to her criminality though!",
            "How much opportunity for cheque fraud is there in obstetrics?",
            "That is really sad indeed. I wonder who he’s trying to fool.",
            "So wait he was a med student who went to other ERs to pretend??",
            "How close was that to being an absolute nightmare! It’s scary how many people become so interchangeable that you don’t even notice someone like that. All the people who call and email you as well. It’s too common to show up to work and there are new people there but nobody even acknowledges that they’ve never seen this person before.",
            "I’m having the same reaction over here… reading this thread like wthhhh",
            "I guess so. At least I’ve run into it. I also wonder how much it’s driven my social media - like if they’re there to get the pics and fake the identity for a social media persona.",
            "Omg that moment you realize one of the psych ED frequenters has joined rounds…",
            "Womp womp….",
            "All important jobs but why can’t people just be honest about their qualifications? It’s a deliberate effort to deceive others into thinking they’re a physician. Like what other career deals with this??",
            "Hahaha that’s probably the most pointless lie, with probably significant consequences from the military, for so little gain, with such a high (pretty much inevitable) chance of being rapidly caught.",
            "Keep us all posted! He’s got some major big-picture decisions to consider in the next few months.",
            "That’s just mind-boggling. Just imagine sitting in the cockpit of a commercial jet with 210 people aboard, pushing back from the gate, and being like “ya I got this”",
            "I have to know, was he a good captain? considering he didn’t crash a plane or kill anyone he must’ve been good enough. and how’d he get all the knowledge to be one??",
            "Yikes that’s actually quite sad. I suppose when it’s that much of your identity that suddenly changes, they’re forced to redefine their entire social self or live with the deceit.",
            "I had a classmate who was on academic suspension and still sat in on lecture, blew everyone else out of the water when he repeated next year lol.",
            "i'm assuming that would be met with a blank stare since usually the nurses are capable of titrating drips on their own",
            "Now *that* is terrifying!",
            "Wild!",
            "Yikes. Tbh that’s kinda sad… I feel bad for people like her.",
            "I think I heard about that guy!! You gotta think though, some people have probably gotten away with it before.",
            "Yaaaa they’re trying to take on that title here in the US too. I have to explain to people that certain people they’re seeing aren’t in fact physicians far too often.",
            "their national organization fucking pisses me off so much.  Claim to be proud of their training but impersonate us.  I know there are reasonable PAs that think it’s bullshit tho at least.",
            "Just imagine living on such thin ice with all the lies",
            "Said he was suspicious and wanted to make the school aware that this student was making social media posts depicting her as part of the MS1 class. He sent screenshots from her Facebook page and instagram and the school was like “yo we didn’t admit her, she’s not a student.” But she conned her way into being coated and found a group in anatomy lab, said she was accepted very late so her name maybe wasn’t on the roster, I mean nobody really questioned it too much. Except her college prof who refused to believe she got accepted.",
            "Oh so like failing on purpose because she didn’t want to move on into the career? Or was just super inept but parents forced her? That’s sad though. Glad she found a good job and better life in Texas though",
            "Ya same! It was 2013 as well but not on the west coast. She was at all the parties and orientation events, in the Facebook group, etc.",
            "For real. I’d love to hear from former fake medical students to try and understand their mentality and motives.",
            "Ya he devised some way in. But that’s a great point! We somewhat frequently treat celebrities and important public figures at our hospital. There’s typically security around the VIPs but if they didn’t make it obvious they were taking pics they could totally waltz right in and out.",
            "She’s probably still out there somewhere, scamming someone else… that’s nuts though",
            "Gross! Please tell me he got some jail time for this and is on a register somewhere",
            "Oh wow! Thats why I’m suspicious of medfluencers unless I know them personally or until it’s clear they’re legit. I have my suspicions sometimes. Then you have the Dr. Oz types who are technically real docs but on a snake oil train.",
            "Frightening…",
            "Definitely makes you want to be more careful",
            "Well it did lol. The professor didn’t have power, he just brought it to the school’s attention. The school then confirmed that a non-student was attending labs and lectures while pretending to be a med student. \n\nDude who faked it in the ED? I mean he just strolled in and said he was the med student that evening. Apparently had done it a few times but nobody really noticed.",
            "The funny part about the one who pretended to be in my class for a week was that when she put it on social media, one of her college professors saw it and couldn’t believe a med school would let her in! My med school wasn’t elite, but it’s a fairly respected, half-decent institution. This professor was like “nah this student ain’t smart enough, something is fishy.” So he called up the school and mentioned the posts, said he was suspicious, wanted to confirm she was enrolled. The campus police escorted her away in cuffs. However, when they first arrived they mistakenly took the wrong student out. Imagine the trauma your first week being led out, “Never come back here! You don’t belong here!” They quickly realized the mistake. Added to her charges was mishandling of human remains because she went to anatomy lab. \n\nI imagine that was harder to explain to her parents than simply not getting into medical school when she applied…",
            "Really embodied the saying “fake it until you make it”",
            "Hilariously, that movie is based on events that were also fake. The real life fraudster described how he pulled all this stuff off. He was lying the whole time, story never happened. \n\nSo we now have a movie that is a theatrical retelling of a phony story from a guy known for fraud. \n\nIt could be worse, I suppose. They could have made a religion out of it.",
            "She’s doesn’t ’practice medicine’ That I know of anyways.. well, I mean other than being on a health advisory council for DHHS. And yea, I’ve thought about tipping them off myself. She said she had like 3 different jobs while in medical school. She’s a busy girl.",
            "I know! And she was obviously interested in medicine. How could she possibly expect that to end well?! \nI want to say there was a local news article about her (and possibly having pt contact) which is how we found the social media pictures but it’s been so long now that many of the details are fuzzy",
            "oh no she never made it to orientation, she just kept pretending online",
            "That’s so wild. I’ve never encountered anyone who pulled a move like that (in real life or online). Gonna be reading this thread like 👀🍿, lol.",
            "Yeah this post is wild! I thought you meant like all the chiropractors I’ve met that insist they’re in medical school and that they’re real doctors lol. I didn’t know people did this other than that kid in Florida!!",
            ">online fakers with DC and DNP and RD and PsyD\n\nWhy are psychologists out here catching strays? They do real school/training lolol.",
            "This is what I thought! Who casually wears a white coat to school? 😂 After the white coat ceremony, I didn't touch my coat until like 2 random third year rotations.",
            "I’m not sure. We all knew, because we saw her attending lectures with the class behind us. I think it probably started as embarrassment and morphed into denial and delusion",
            "Wait, why would you email a BOLO to the school?",
            "No way! I had no idea about the majority of that (although I also have the BOLO saved to my phone)",
            "She was some influencer who insinuated she was a med student, but she was a premed who then went on to do a post bacc at one of the Caribbean schools.",
            "me too 🤣",
            "Nah, she pretends to live in NYC now and has said she works “in finance.”",
            "She was a student before, but quit. Then she wanted to return in her terms.",
            "She withdrew in the middle of a semester. She wanted to come back and finish that one, but school wanted her to repeat the entire semester since she essentially failed.",
            "Probably not much, but the gmc will happily strike people off for criminal offences outside of their work espec if they involve dishonesty.",
            "yes! he didn’t pass boards/2nd year, but he decided he didn’t need to in order to begin clerkships and started “rotating” at various hospitals by lying that he was their medical student or a doctor",
            "She wouldn't have gotten far.. As far back as 2013 they gave me and my son matching security bracelets and if someone had tried to take him off the floor it would have red alerted the whole place. I am sure this is why... crazy stuff\n\nFunny side story: My son was huge, 10lbs 13.6oz and that same day a small full term baby was born who was I think 5lbs 5 oz. Even though I didn't want my baby removed from the room at any point, the nurses absolutely INSISTED for about ten minutes and when they came back, they were laughing about how huge he looked next to the little girl. I am certain that in someone's camera roll there is a pic of two very different sized babies next to each other born on the same day.",
            "I'd be cool as long as one of their voices could help with the pimp questions. 😂\n\n(Just a lighthearted joke, y'all! Don't come at me please!)",
            "Oh dear god, every person in the military pretty much.",
            "Yeah but for 2 days he was just sssoooo cool😎",
            "You can make an argument he was actually more knowledgeable than many of his certified colleagues. 1) He was a mechanic on the same system he ended up flying. 2) He learned to fly multi-engine jets on a commercial flight simulator a friend of his had let him have unlimited access to when it wasn’t being used, and 3) the time he was caught he’d racked up over 10,000 hours of pilot time over 11 years.",
            "Exactly! I wish I had even a shred of his confidence.",
            "It wasn't really my business but one of my former classmates was in my Anatomy Lab group.  I would often see her on campus and when I asked if everything was ok she would just give vague excuse for her absence.  Later on I would find out that she was on an academic suspension and would actually fail out a year later.",
            "Was the student actually taking notes or just puttin on a front.  \nOne of my classmates on academic suspension would actually take notes and study. She mentioned wanting to stay ahead of the material when repeating the year.",
            "Haha, yeah 100%. That's crazy. Have you also heard of the 18year old that opened his clinic in florida?🤣",
            "Oh don’t worry! It’s okay that her and my cousin didn’t get any of their COVID vaccines and don’t speak to most of the family bc she’s Greek and speaks Greek so all is forgiven in my Yiayia’s eyes 🙃",
            "Don’t let your narc professors follow you alright noted",
            "I only talked to her a few times as she was in a different group for anat lab, so I have no idea if she was failing on purpose or just super inept. She had several cousins in the same med school, including one in my class so she might have been pressured into pursuing a career she didn't want. I'm glad things worked out for her.",
            "become a psychiatrist to hear it all lol... in the voice of law and order lmaoo \"these are their stories\"",
            "I just went back to a forum to see if she was still there. Her most recent post is from this year (which is wild) and is about how she's studying for a step exam which she first failed in 1990.",
            "one almost killed me because he didn't know how to treat anaphylactic shock. I had to run my own code. He walked out and never came back. Another called me to the ER at 2 AM for an obstructing mass on a penis and they couldn't get a catheter in. It was a normal foreskin and the guy didn't go to the ER for any urologic complaints. She disappeared.",
            "Wild the amount of crazy balls that person has.",
            "How would the professor know if he was an actual med student???",
            "And why would anyone pretend to be a med student like that? They go through so much and are bottom of hierarchy.",
            "The one who got arrested in the ED…was this in Austin, TX? I always wondered what happened to that kid",
            "Oh no!! Most of us have imposter syndrome at one time or another, but to be led out of med school in handcuffs your first week … that is some next-level anxiety, right there. You are always looking over your shoulder to see if handcuffs are headed your way …",
            "I’ll say though, we had some sketchy nurses lie about their qualifications to get better pay during covid. I was a senior resident at a fairly large hospital in a major city at the time. I sat down at the ICU nurses station and a very annoyed veteran nurse was looking fed up. She told me they had several new grads say they had ICU experience when all they had done is desk work in outpatient peds. They admitted to the lie on the last day of the contract and left. So they had actual ICU nurses overloaded with their own covid messes plus having to keep con artists with no experience from killing their patients. Like did you not expect the ICU to be a hard place to be a nurse?!",
            "Anyone saying that doesn’t know what medical school even is lol you’re there early to late 6 days per week plus you gotta study for a board exam (“the shelf exam”) at the end of each clerkship. Some people in my class picked up shifts bartending a night or two per week but it was really more for the escape back into the world of real people, away from the nerds and their stress.",
            "Ohhhh I gotcha like saying online she was in your class. Was she trying to make that part of an influencer persona? Or was it just sad lonely person trying to look cool online for people from high school?",
            "I don’t get it.",
            "I feel like people exaggerate… because why would anyone pose as a med student? They get treated like shit.",
            "Of course they do! But when they represent themselves to the public/patients in a manner intended to have them perceived as a physician, it confuses roles for the patient and sets the stage for overstepping boundaries. Just like I don’t go around recommending PT courses or doing cognitive behavior therapy - I don’t know how. I’m not trained in those things.",
            "Geez, that’s intense. More than just a river in Egypt, eh?",
            "Sorry I wrote that weird. Our school issued a BOLO bc she was “rounding” on patients as a fake medical school. If someone saw her, we were supposed to call security.\n\nI emailed the new school a copy of the BOLO as evidence that she had faked being a medical student in the past.\n\nThe new school said that they knew about her history when they admitted her and hadn’t had any problems with her during her time there.",
            "Sounds like a treat, lol.\n\nI was a competitive martial artist for years and that world gets some of this, too.  Real oddball delusional guys (it's always guys) that come in, claim some bizarre thing or another.  They trained in Japan under a sacred master, or they fought in Taiwan but there's no records, or they never lost 1,000 street fights.  It's always the same basic fantastical tale.  Of course 99% they're built like a mayonnaise packet and fold like lawn chairs.\n\nThere's gotta be some common brain cell there, somewhere.",
            "Omg what a circus. I get annoyed by the paperwork of onboarding at places but then I hear about this and I’m like ya fine I’ll submit more documents if we can stop this kind of thing.",
            "Pimp questions?",
            "Whats the deal there? Overstate/misrepresent qualifications? Or is it combat experience?",
            "That should be the basis of a motivational meme",
            "That’s gotta be tough. Some people, even strong college students, don’t thrive in the medical school environment for some reason. Like star college players who fall to pieces in the NFL.",
            "oh he studied his ass off and read constantly. he was on suspension for missing small group.",
            "Hahaha yes!!!! I saw that in the news. Just buys a white coat and sets up shop. Why not?!",
            "Lmao are you psych? I always had the most fascinating conversations with people on those rotations.",
            "Victory, 34 years in the making.",
            "Is this in the US?!",
            "Lmao that’s the thing - the professor was in disbelief when he saw the former student posting med school photos. He thought there was no way she could have gotten into that med school (like I said, not elite but halfway decent) based on her academic performance in college. He was suspicious so he alerted the med school admin who then identified the fake student, confirmed she applied but was rejected, and had her arrested.",
            "No idea. That’s why I’d be interested to talk with one about it.",
            "Ya his Facebook page was still up for a while but his digital profile is gone when I search him.",
            "Maybe that explains all the bullshit I see in my patients ED d/c ppwk 😂😂😂",
            "Hahaha right?! Nah they didn’t actually cuff the incorrect person, but she did get marched out into the hall then they realized the mistake and identified the right individual as the fake med student. But ya lmao imagine the nightmare that you did so bad on your first week of MS1 they took you to jail!",
            "Yes it's pretty disturbing because there were so many con artist nurses working as ICU nurses without legitimate critical care backgrounds. I've heard horror stories of my colleagues taking report from nurses that didn't know wtf they were doing. Really scary. Most of these travel agencies during Covid didn't properly verify their credentials. I'm surprised that those nurses lasted their whole contract without getting canceled early. At the hospital I used to work at they would have been reported and quickly cancelled.  I heard a lot of unqualified nurses were getting away with their lies at smaller hospitals.",
            "genuinely think it was serious mental illness - idk what kicked it off my but leading thought has always been she tried to get into med school, didn't, and spiraled/had a break down to try and save face. she had a boyfriend and I always wondered if he knew",
            ">But when they represent themselves to the public/patients in a manner intended to have them perceived as a physician, it confuses roles for the patient\n\nHow would one do that? They have a doctorate, calling them \"doctor\" is appropriate, they provide patient care in a specific context. Idk. I think giving them prescribing privilege is silly, but I don't think that they are \"misrepresenting\" themselves to anyone. 90% of people in the general population do not understand the difference between a psychiatrist and a psychologist. \n\n>Just like I don’t go around recommending PT courses or doing cognitive behavior therapy - I don’t know how. I’m not trained in those things.\n\n...do you think psyds do? You can make an argument that prescribing privilege is overreach but tbh id rather have psychologists than nps prescribing. \n\nAs a psychiatrist I think your take on psychologists is pretty poor and you should really reconsider.",
            "Understandable. \n\nI was like, damn bro really didn't fuck with her AT ALL.",
            "One guy came into this first muay Thai class and legit tried to karate chop me during it\n\nI don't even think karate teaches a karate chop and I'm not sure where he got a gi from",
            "I'm not in medical school nor residency. Here for informed decision making but sometimes y'all are hilarious.",
            "yes, but very rural, no that that should really matter",
            "Absolutely wild.",
            "Wow.",
            "Yeah, you see on the news people pretending to be physicians but medical students??? They’re perpetual students and stressed out.",
            "I was working in that hospital when that happened. Not on shift but I remember the med students telling me about it and being dumbfounded. It somehow barely made the news too which was wild considering the massive HIPAA breach and essentially assault of patients that happened.",
            "Ya from what our local nurses told me, these travelers came on FEMA contracts, and the agency did basically nothing to verify anything and just let them check a box for what they’re qualified for. Super scary having nurses with zero critical care experience just waltzing in there hoping to figure it out on the go.",
            "Seems like it. I just don’t know how anyone keeps up the bit for that long with family or a SO.",
            "As a pgy1.95, I think it is you that should reconsider your position",
            "Look up the Jennifer Pan case"
        ]
    },
    "I’m 5’9 and I’m the tallest intern in my year by about 2.5-3 inches. My program has 8 spots. It’s 6 women and 2 men, the other dude is shorter than me. Group photos feel so different now lol. ": {
        "title": "I’m 5’9 and I’m the tallest intern in my year by about 2.5-3 inches. My program has 8 spots. It’s 6 women and 2 men, the other dude is shorter than me. Group photos feel so different now lol. ",
        "score": 133,
        "url": "https://www.reddit.com/r/Residency/comments/1dlq1bh/im_59_and_im_the_tallest_intern_in_my_year_by/",
        "content": "Just a different situation I have never been in before in my life. I’ve never been the tallest person in any group ever. The time of the average height 5’9 has come!!!\n",
        "num_comments": 52,
        "comments": [
            "First thought was peds, but I feel like that would have more than 8 residents. So my money's on OBGYN. Am I right? Did I win?",
            "Enjoy these 3 years. (Or however many years your residency is)",
            "I'm not a resident but I do work on an ICU floor. I don't know where they find these nurses but 90% of them are as tall or taller than me and I'm 6'",
            "Definitely not ortho. Thinking Derm or FM.",
            "Gen Z is smaller despite the big personalities lol",
            "I don’t know what the obsession with guys being more than 6 is. 5.5 inches or even 5 inches is perfectly acceptable!",
            "Psych?",
            "Meanwhile I’m also 5’9 and at my program we have 4 women and 12 men and 3 of the women are taller than me as are 9 of the men. Perspective",
            "Dr Gulliver",
            " Neurology?",
            "You guys have to take into consideration of the 6:2 women:men ratio! So it can’t be psych or neuro or EM or a bunch of other specialties. Derm maybe but i don’t think the ratio is that lopsided. My money is on peds.",
            "EM?",
            "Family medicine",
            "Haha! I love this for you.",
            "Good luck this year, little guy.",
            "Thank you for contributing to the sub! If your post was filtered by the automod, please read the rules. Your post will be reviewed but will not be approved if it violates the rules of the sub. The most common reasons for removal are -  medical students or premeds asking what a specialty is like, which specialty they should go into, which program is good or about their chances of matching, mentioning midlevels without using the midlevel flair, matched medical students asking questions instead of using the stickied thread in the sub for post-match questions, posting identifying information for targeted harassment. Please do not message the moderators if your post falls into one of these categories. Otherwise, your post will be reviewed in 24 hours and approved if it doesn't violate the rules. Thanks!\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Residency) if you have any questions or concerns.*",
            "Live it up bro. Kinda similar for me too. Gotta love those IMGs.",
            "Being tall has so many perks tho",
            "Gotta be ortho",
            "Lol i am 5‘10 as a woman, you are still short.",
            "Sorry. Wrong answer!",
            "Where is this magic wonderland?",
            "Idk but the ortho program I’ve seen has scrawny guys 5’8, it’s a nerdy specialty now",
            "Derm would not have that many spots… at least I don’t think it would…",
            "Ikr 🤦‍♂️. Short kings >>>>>",
            "5.4 inches here, its enuff right guise 😟",
            "While I realize your comment is a joke and a play on 6 Ft vs 6 inches\n\nImagine you joked about reducing women to a literal measurement and categorized as 'acceptable' or not. Imagine waist measurement was a colloquially used yardstic' for 'acceptability'. Very dehumanizing \n\nThat being said, I'm very happy w my 9.9 inch cock",
            "Seems unlikely, both with the height and having more women than men.",
            "Let’s speculate wildly what specialty I am…",
            "Lol. You don’t get the point of this post.\n\nEdit. Also, I’m gay. Your powers have no effect on me witch!",
            "you are still disrespectful. Think I would choose a shorter and more respectful woman than a woman raised by gorillas.",
            "Yikes comment. Reminds me these women exist.",
            "How much do you weigh?",
            "You are a pest. And you say that like it’s a good thing. It just means men don’t like you as much especially knowing your personality",
            "What a weird thing to say to someone.",
            "Queen slay 💅",
            "omg lol wtf is with the over the top rage directed at this comment? 5’10 is very tall for a woman, it’s no different from me being 5’1 and saying that someone 5’7 is tall to me. you struck a nerve I guess lol",
            "FM? (If this is right, I deserve partial credit for both OBGYN and peds.)",
            "Dermatology?",
            "Nursing residency???? They just implemented an intern year at the program by me.",
            "It's my little (?) Amazon paradise and I'm not telling anyone",
            "Derm?",
            "Women like this perpetuate the “6 feet or bust” height requirements on tinder, then they wonder why they can’t find someone decent.",
            "The precise term is Amazonian woman.",
            "I don’t love this terminology being used for Cushing’s patients.. but I bet she has buffalo humps",
            "lol",
            "Makes them easy pickings for people over 6 ft. Pump and dump ",
            "I triggered some folks. 👿",
            "Rightfully, deserved for being shallow!",
            "Do you feel better now that you projected some gross revenge fantasy on a stranger over a reddit comment?",
            "Nah, it was just a stupid reply, given the context of the sub.",
            "I bet you have no physical preferences at all, right?"
        ]
    },
    "As a graduating fellow.. what I wish residents knew": {
        "title": "As a graduating fellow.. what I wish residents knew",
        "score": 469,
        "url": "https://www.reddit.com/r/Residency/comments/1dlgym8/as_a_graduating_fellow_what_i_wish_residents_knew/",
        "content": "Hello friends! I'm finally at the finish line of 9 years of training and SO thankful that it's over.\n\n**First - I'm going to insert my rant**:\n\nOver the last two years of speciality training, the number of times I've wanted to pull my hair out from the phone calls at night.. \"We wanted to make you aware of this patient.\" (For no particular reason other than they get chronic dialysis). \"I need urgent dialysis on this patient\" (Call at 10PM for labs that returned at 6AM). Other \\*clearly\\* non urgent consults at 3AM. Most specialities take home call. This doesn't mean I'm at home, peacefully sleeping in my bed and also get a post-call day after. It means I just finished a 10-12 hour day. Am now having disrupted sleep and still have to work the next 10-12 hours tomorrow. Calls that may seem harmless are not innocuous. I've had 30+ pages in one night. I cannot always fall right back asleep after getting paged. I know that often attendings will make ya'll call but please be the absolute most mindful as possible. If you must call, please be as prepared as humanly possible, know exactly what you're consulting for and ALWAYS speak to your attending before you call me. Particularly in the world of nephrology, I'm frequently consulted by residents for very clear IM issues that do not require speciality level knowledge. Ie - Your attending should be able to answer if your patient needs a bicarb drip.\n\n**Now onto other things:**\n\nNo matter where you are in your training, there are times you are going to want to quit. This job is going to burn you out. Just know that it is (unfortunately) normal and don't be afraid to ask for help. I have gone to therapy throughout the entirety of my training and wouldn't have done it any other way. If you need a break or more sleep, say you need it. No one will advocate for yourself other than you. Do not skip doctor's appointments. Your attendings can be as grumpy about it as they want but ACGME protects trainees. ACGME clearly states in their policies that trainees are allowed to sleep if needed, leave work if they feel they are not able to practice medicine and attending all doctor's appointments. If they say no, report them. Do NOT neglect yourself in an environment where we are brainwashed to think this is normal. You're not a champion for making yourself suffer. The only one that loses is you. Check in with yourself as much as you can.\n\nAlways, alway, always be nice to nurses. Sometimes it can be tough as a trainee because the nurses can be particularly cruel at times. I've experienced more abuse as a female trainee from nurses (not all of them) than my male colleagues. Try to shake it off as best you can because they will make your life harder if you're not. Also, just make sure you're treating other colleagues as good humans in general.\n\nDon't allow any staff to be creepy with you. You are supposed to be feel safe in your work space. GME is there if you need help with this. \n\nYou're going to make mistakes and it's okay. Own it. DO NOT hide it. It will make everything worse if you do.\n\nStart training with little expectations of yourself. You didn't finish medical school one day and then suddenly know all of internal medicine (or whatever residency) on day 1 of residency. Sometimes it might feel like other people around you know more than you. They might, they might not. They may also never sleep or have insane anxiety. Don't compare. You're not inferior or inadequate. We all have strengths and weaknesses. Just try to fill in your own gaps. \n\nMake a support system. Training is one of the few times in life that you sort of have built in friends. Everyone is going through the same struggle. In residency, I always prioritized sleep over social interaction and doing fun things. In fellowship, I learned it's better and healthier to strike a balance.\n\nExercise and eat as best you can. But do NOT pressure yourself or make yourself feel guilty because you're not able to stick to a work out schedule or eat perfectly healthy. It's not reasonable or realistic. Congrats to those who can do it but I find that most of us can't and beating yourself up over it is a waste of time.\n\nTry to maintain contact with family if you're able. There's definitely a balance to strike here because family can also be stressful. I can't speak to what it's like to have children in training and I'm endlessly impressed by those who do. I had days where I was lucky if I did dishes. \n\nLastly, and I cannot say this enough.. **be kind to yourself**. You are doing YOUR best, whatever that looks like.\n\nGood luck everyone out there!",
        "num_comments": 82,
        "comments": [
            "That's great and all, but does my patient need a bicarb drip?",
            "Why did you pursue nephro? Death wish?",
            "I absolutely feel the rant from the first part even though I am more than 5 years out of nephrology fellowship….",
            "Home call feels like one of if not the biggest scams in all of residency. Absolutely brutal.",
            "Take abuse and sexism from nurses, just shake it off? No, thanks. I’d rather stand up for myself, document, and report. \n\nOtherwise, sound advice.",
            "Refreshing to read and great advice!! Big congrats! 🎉",
            "I appreciate you. Thank you.",
            "I ain’t reading this whole thing. You dictate and we screwed into reading your story. Short note fellow!",
            "I could tear up. Finishing my PGY1 year of IM and still feel like I’m drowning every second. Holding on to hope it gets better, and reading this really makes me think it will. Thank you ❤️",
            "A lot of the consults I place after midnight are because my senior tells me to & I’m not arguing with them.",
            "A lot of us wind up with terrible insomnia",
            "The real question is how did you make nephrology 9 years of training? lol \n\n\n(unless you’re counting medical school)",
            "I think you need to get off your high horse a bit.\n\nI’m nearing up to the end of my neurosurgery residency and fellowship. I get called all night long on nights when I am on call…and sometimes on nights when I am not on call. A lot of those nights I also have to go in and operate…and then work the following day.\n\nI’m not here to turn this into a pissing contest because I think we both have very demanding jobs…but you seem to be frustrated about being consulted on patients…on the nights that you are on call?\n\nAdmittedly, I don’t remember much about about the ‘ol pee pee maker. I certainly don’t know which patients need urgent dialysis vs. patients that can wait until the morning…but if I am ever concerned that one of my patient’s is going down hill from a nephro standpoint, I am definitely going to be calling you regardless of what time it is and regardless of how much you had to work the day before. If that annoys you a significant amount and interferes with your ability to sleep, perhaps you shouldn’t take night call and leave it to nephrologists more interested in helping other physicians and patients. Perhaps consider a specialty that doesn’t have pathology needing to be urgently addressed.\n\nI get a ton of consults on non-operative brain hemorrhages, unrelated issues to patient’s with a history of a VP shunt, and non-operative radiculopathy. I don’t expect the consulting ED doc or OBGYN or internist to know which patient needs surgery.\n\nJust my thoughts as a soon to be graduating fellow.",
            "Sound advice. Playing devils advocate: you did choose a specialty that takes call. While some pages seem annoying to you, that’s part of what you chose. Please don’t take it out on the next person paging you with something legit",
            "How do you afford therapy on a residency /fellowship salary?",
            "About you being bugged constantly....I'm newer to the medical thing....but starting from the bottom up. Pretty much everyone is trained to go to the doctor for anything minorly important, because most things are outside of the authority of most people working below you. Did you forget to sign orders for a blood draw? Well we are going to call your office, multiple times if needed because the patient is waiting right there, rather pissed off that we don't have the orders. Nothing we can do, other than go to the patient, shrug and say come back another day at a certain point because we are absolutely forbidden from drawing without orders. Never forget the system is designed to run through you when people are in doubt. Also I'm sorry that sounds like the worst sleep ever.",
            "Regarding dialysis. It is what it is. If your workflow for non urgent dialysis requires a consult then it’s nephros fault \n\nDon’t get me wrong. I would love to just put in some Epic order and let you put them on the schedule on your own time.",
            "Would you kindly direct me to the specific lines of ACGME text specifying  “trainees are allowed to sleep if needed, leave work if they feel they are not able to practice medicine and attending (sic) all doctor’s appointments.” ?\n\nThere’s been some conflicting messages in my program regarding doctor’s appointments and I’ve had to cancel and reschedule appointments for half a year now to see a physician. In the past I’ve even used PTO to seek medical care.",
            "You expect general IM to be making the call about a bicarb drip in the middle of the night and not call you about it? Do they teach the indications and how to dose and titrate bicarbonate drips in general IM residency where you train?",
            "Wow\n\nOk first of all: thank you .\nAnd secondly, as the mother of a brand new resident surgeon… any advice for me ?",
            "Thank you for contributing to the sub! If your post was filtered by the automod, please read the rules. Your post will be reviewed but will not be approved if it violates the rules of the sub. The most common reasons for removal are -  medical students or premeds asking what a specialty is like, which specialty they should go into, which program is good or about their chances of matching, mentioning midlevels without using the midlevel flair, matched medical students asking questions instead of using the stickied thread in the sub for post-match questions, posting identifying information for targeted harassment. Please do not message the moderators if your post falls into one of these categories. Otherwise, your post will be reviewed in 24 hours and approved if it doesn't violate the rules. Thanks!\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Residency) if you have any questions or concerns.*",
            "Agree with most everything you wrote. But can’t agree with the last statement…are you really doing your “best”? All the time? Is that even possible? PGY-33 here…",
            "lol I feel like you wrote the rest of the post to justify your first paragraph",
            "LOL! You'll never know!",
            "LOL! I mean obviously. But, there are things I like about it. CRRT is fun. I do like being one of the only people in the hospital who can understand hyponatremia. I'd argue it's one of the more heavier thinking specialties as well",
            "Excuse to be salty all the time",
            "This saddens me!",
            "Tbh I don't get it! I'm not sure what it was like many years ago when this was designed but I question if it was this busy. I know I signed up for it but never imagined it was going to be like this!",
            "I think I may have worded it poorly - more along the lines of, don't talk back and make things worse. Agree with reporting inappropriate behavior. Hence, the creepy reporting comment above!",
            "Your feelings are valid. This is brutal.  It never gets easy, but it does get better.  You get better.",
            "Training gets better in general because you become more knowledgeable and more skilled in handling stressful situations. Intern year is very hard. Congrats on getting through it!",
            "4+3+2 = 9.\n\nMD+Res+Fel\n\nCmon man, don’t act like the only people who can do numbers good are nephrons.",
            "I had the same thought as I read on. Why do we use PGY-# then? This is depressing for me if we gonna start adding more years to that.",
            "I have very mixed feelings on this but I’ll start with this: there’s a difference between surgery calling for an AKI vs medicine calling for an AKI. \n\nI will use my specialty (Pulm/ccm) from now on because I know it a lot more. Generally speaking I don’t expect neuro or OB or surgery etc to know basically anything about my subspecialty and I’m just glad if they think to call me. Medicine is different. COPD exacerbation is in the top 5 admitting diagnoses in every hospital ever for a medicine service and if you are a board certified internist having to page me at 2am to tell you to give prednisone 40mg I’m gonna find it hard to filter the disappointment. Similarly “hey just paging so it’s in your list to see in the morning” is kinda annoying because you could just.. wait until the morning? I don’t think it’s a huge ask to request that people stop and think if their question is urgent before calling. If that’s in question? Fair game please call.\n\nI am no stranger to nights and obviously picked a field where a lot of places I’m going to be in house a chunk of nights. I will say for Pulm that actually makes dumber home pages feel worse. Because there’s like 3-4 things that would actually require me to come in from home to see that shouldn’t just be primarily managed by my colleague sitting in the MICU.",
            "I think there's some misinterpretation here. I don't expect a surgeon to know indications for most renal related things. It's not in your training and that would be an unrealistic ask. Nor do I ever want patient care to be compromised. I do expect internal medicine residents to speak with their attendings who know basic internal medicine before they call me in the middle of the night. It is literally within their training. An intern should be running things up the chain before making me their first call. If after that, they need to phone a friend, I'm all ears. I'd like to remind you that every time I am woken up (as you are), it is opening up opportunities for poor patient care the following day due to physician fatigue. I am more than capable of understanding that there are times where patient care supersedes my wants or needs. I'm not really sure the value of telling someone to \"get off their high horse\" but thanks for your thoughts.",
            "Agreed. I have minimal sympathy for sub-specialists when it comes to pages. This is what you signed up for. I personally made a very deliberate decision to go into a lower paying speciality specifically because I do not want to be woken up in the middle of the night.",
            "I hear you! I think medicine is a team sport and we all need to be looking out for each other though. Otherwise, everyone might as well just call everyone for everything!",
            "Every place I've been has had really good health insurance. There was time in my training where visits were $0 and my visits in fellowship have been $20 per session.",
            "I would also be frustrated! I think all I'm trying to point out is there are things that are time sensitive/urgent at night that merit a phone call and things that can wait. An order that need to be addressed for care that needs to be done within that moment for sure deserves a call.",
            "Why wouldn't even non-urgent dialysis require a nephrology consult? We place the orders. It's an entirely valid reason to consult us. I'm just not sure why a non-urgent dialysis consult at 2AM needs to be placed? I'm not talking about it being put into the computer. The provider is picking up the phone and paging nephrology at that hour asking for non-urgent dialysis. Why can't it be signed out and called about in the AM?",
            "Yes.. This is supposed to be in IM training. I'm alarmed if it's not in yours.",
            "I think understanding and patience. There were points in my training when I hit a level of fatigue that I didn't think it was possible to function at and wasn't always able to be the best for those around me. I think also recognizing that you're never going to fully understand how they feel. I also appreciated when my parents were able to do anything to help take the load off. For example, I beyond appreciated any home cooked meals when I was home visit. It allowed to even have an extra minute to myself.",
            "Yes, your best.. As in, whatever the best you're able to give in that moment. All you're able to give (whether it be 5% or 100%) is quite literally your best",
            "Open your wallet - you’ve got $100 so the best you can give is $100. \nNext time you open it you’ve only got $5 so the best you can give is $5.\nAnalogy - You still gave the most you could at that time.\nThat’s how I interpreted it. But hey, I’m  a nurse 😉",
            "Extra salty. Maybe consider loosening your fluid restriction to help with these symptoms :)",
            "But hyponatremia is easy. Restrict the water intake. Or give fluids idk. One of the two just commit",
            "I agree nephro is cognitive but also enjoyable to think through. However Ive been warned thats a difficult job and not financially rewarding for the work?",
            "My wife (RN) and I (M3) both agree that nephrologists are probably the most intelligent people in a hospital. I have no way to back this up but I’ll die on this hill. You’re the smartest person in the hospital, probably.",
            "Neurologists pretend to know something about hyponatremia at parties.",
            "You’re the only one in the hospital that understands hyponatremia?!",
            "AAFP has a great algorithm for it. I still don’t understand hyponatremia, but they do have a great algorithm for it.",
            "You for sure get it!",
            "Leave it to a neurosurgeon to get bent out of shape at not being declared the smartest in the place.",
            "I don’t think there’s anything wrong with trainees asking other trainees to be mindful about how they utilize hospital resources (which subspecialty care is). Especially when all parties are overworked and underpaid. I do think the conversation changes when you’re an attending being paid the big bucks though, then the whole “you signed up for this” argument works a bit better. As someone who did hospitalist work before IM subspecialty, I sure as hell tried very hard not to wake up a fellow for any trivial issue. But ofc we understand July interns will learn over time",
            "I’ve interacted with several training programs in the past. While I personally go over the titration of bicarbonate drips, I wouldn’t expect a general IM resident to have mastery after 1 lecture. I’m generally surprised that you think that as a nephrologist, helping with a bicarbonate drip isn’t within your purview and is somehow a bother.",
            "Youre playing word games. Giving 5% is not your “best”. This is the typical modern word games that demean our language. There is no shame in not being able to give your “best” all the time. Acknowledge that fact and say it. “I didnt give my absolute best on this occasion. I’ll try harder next time.” Othereise, the rest of your post is good",
            "Me? Salty?",
            "Please don't make me cry!!!",
            "But what about the objective measurements of volume status? Didn't anyone check the JVP? Or measure the IVC respiratory variation? Skin turgor?? Were the membranes moist??",
            "As a surgeon, I approved this message 😂",
            "Pretty sure it’s run 3% NaCl to gravity and check labs in 12 hours\n\nThat or 2 gram nacl PO BID. \n\nJust wild guesses",
            "Just give salt tabs man",
            "I think it really depends! I am very fortunate. I landed a job in a nice area, working 4 days a week for three weeks out of the month (the other week is 7 days straight with call) and I'm making 90th percentile. I think there is actually very good money in private practice (I know people making over 500k) with the potential to have a balanced lifestyle. There are also very overworked people making good money in private practice. I think academia is severely underpaid but they also have a lot less clinical time. There's really a spectrum of everything!",
            "The smartest physician in my hospital with many fellowships is a Nephrologist",
            "Smartest attending in residency was nephrologist and brightest resident in my class went into nephro",
            "23.4% hypertonic saline can stay with them!",
            "We appreciate you taking the extra second to let us sleep when possible!",
            "I think it’s an exercise in appreciating what we can give even when the tank is near zero. Not really word games. The essence of the post seems pretty consistent.",
            "Okay bestie! :)",
            "Haha I’m just joking. I don’t know know shit about how to manage hyponatremia or any renal problem. “Oh shit patient Cr >2, consult renal” is my plan these days",
            "Can I ask what salary 90th percentile turns out to be?",
            "Good to hear. I'm really just aiming to make enough to afford a very comfortable life + a 911 GT3 RS. If nephro can do that for me then I'll go for it otherwise I might pursue PCCM.",
            "Exactly!",
            "Is that the “best” ya got??? Lol",
            "If this isn't a joke then I think your residency failed you",
            "Once you go into practice, your patients and their families don’t care about any of that. They want and expect your best. And YOUR name and reputation is on the line. As residents and fellows, you have been shielded from that",
            "Boomers have great jokes, the best jokes. A lot people are saying it, it might be true, probably is true. These boomers - and they’ve fallen out of favor, have you noticed that? Not in favor any more, very sad. Very very sad. These boomers, they’re the best, am I right or am I right?",
            "Go retire, party pooper. ",
            "Not a boomer. Early GenX er",
            "Why?? There’s. Physician shortage if you haven’t heard",
            "YoUrE pLaYiNg WoRd GaMeS."
        ]
    },
    "29M 25F Dating in residency": {
        "title": "29M 25F Dating in residency",
        "score": 76,
        "url": "https://www.reddit.com/r/Residency/comments/1dljbey/29m_25f_dating_in_residency/",
        "content": "The girl 25F, I 29M began dating 2 months ago started residency this week. I like her a lot and I'd like this to work out, but I want to know how best to care for her from afar as her life gets hectic.\n\nWe are about 1.5 hours away by distance, I'm always happy to drive, we're not needy people in that we require  constant communication, but I want to make sure our flame doesn't die.\n\n* We text every night for about 30 min, I try not to delve into her days, rather provide an escape.\n\n* I'm considering driving to her weekly to make her dinner once a week and lunch for the next day, Staying the night possibly but if unable, I understand.\n\n* I know she gets a day off per week, and while I do want to see her, I also want to give her \"she time\". I'll have to balance it with her.\n\nHow else can I be there for her? \nAny recs?",
        "num_comments": 30,
        "comments": [
            "Doing the planning for dates and such can help take away the decision fatigue",
            "You grill her on what her plans are for her student loans and demand that she come up with an answer then call her a financial liability and provide an ultimatum for her to figure it out as you see being with her bringing you financial ruin because her net worth is in the toilet then call her out for not knowing what her next moves for buying a house is and burning all her money on rent\n\nLol im kidding dont do that\n\nFacetime while you make dinner is pretty cute or netflix party over videochat and if she wants to brainrot let her brainrot\n\nAlso what youre doing is crazy cute, sometimes she will just look really sad and give short answers, she might just be mentally drained. Ask if anything is wrong and if she doesnt want to talk about just leave it, dont push",
            "just make sure you go down on her regularly",
            "Taking the onus on planning things can help a lot. I might also suggest setting expectations and checking in every so often.\n\nI’d be aware of a few things, though:\n\n* There may be stretches of time where she is unreachable for hours on end and literally cannot text you back (especially if she is in surgery etc and scrubbed into a case).\n* If you hang out with her and her friends/colleagues, they will likely talk about medicine 90% of the time. She may also talk about medicine a lot as it’s what she will be thinking about 24/7. I sometimes feel bad for non-medical SOs when I’m out with friends/colleagues, lol. Medicine can be a bizarrely niche culture.\n* If you visit on weekends there will likely be some where she is in the hospital the majority of the weekend. She can't do anything about this.\n* Residency can be physically taxing. There may be some days where she literally doesn’t have the energy to do anything besides lie in bed.\n* Inpatient months will be the worst for her. She'll be in survival mode during these.\n* First year is usually the worst. Things tend to get better after it.\n\nAnyway, you sound like a great dude. Support her how you can and you guys will do great!",
            "On days that are particularly rough, offer to DoorDash her food; send her flowers to come home to sporadically; plan dates; or if she just wants to veg out, veg out with her; offer to pay for cleaning services; and most of the time if she’s venting after a particularly long day, let her vent and offer support and affirmations- intern year is filled with lots of insecurities since she’ll be brand new at everything, so remind her that she’s smart, amazing, capable, hardworking and it’s not luck that made her come this far.",
            "These answers are detailed/hilarious. I just wanted to add: demonstrating that you care doesn’t have to yield a perfect result.\n\nI work with so many residents with loving partners (and all of this is anecdotal/grain of salt), but many have shared worrying about partners worrying about them. \n\nAfter a rough rotation or a difficult pt outcome they might want to appreciate a partner’s efforts to make their day better…but it’s…a still a shit fucking day. And their partner may do things that can help, but if those efforts don’t “land,” your resident partner may feel like she needs to perform for you too. \n\nTwo months in and you want to get it right? Amazing. I would recommend preparing to not get it right. Because she is doing the same. And sometimes it’s just a whole ass day. \n\nAsk what she needs/wants, read the room, and keep checking in with your own relationship needs.",
            "Some of the top comments when a girl asks how to best support a guy partner are always “blowjobs”. \n\nSo, blowjobs.\n\nEdit: Aaaand there it is. A few pieces of genuine advice and the most upvoted comment is “go down on her”.",
            "do you wanna also date me? 33M 5’8 220 lbs",
            "do you guys call or video facetime daily? or just the nightly texts?",
            "Bleboob?",
            "If you do visit, meal prep at home, freeze it and bring it to her if she has a place to store it. Label and date it. Might even help to put a label on when to place it in the fridge. \n\nOne less decision to make a day is great when you're busy",
            "Thank you for contributing to the sub! If your post was filtered by the automod, please read the rules. Your post will be reviewed but will not be approved if it violates the rules of the sub. The most common reasons for removal are -  medical students or premeds asking what a specialty is like, which specialty they should go into, which program is good or about their chances of matching, mentioning midlevels without using the midlevel flair, matched medical students asking questions instead of using the stickied thread in the sub for post-match questions, posting identifying information for targeted harassment. Please do not message the moderators if your post falls into one of these categories. Otherwise, your post will be reviewed in 24 hours and approved if it doesn't violate the rules. Thanks!\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Residency) if you have any questions or concerns.*",
            "God bless you.",
            "Honestly just understand that times WILL get tough and try to accept it and not build resentment towards her regardless of how unavailable she will seem(which will be a lot). That day off isn’t always guaranteed in every program and oftentimes you need time to recover from the onslaught you went through as well so don’t always expect her to spend that day going on dates or whatever. Otherwise it’s all stuff that you’d expect of your partner in a normal relationship.",
            "Dating in residency is so hard. We survived but barely. Let her sleep, wash the sheets, offer to do her laundry. Food is a love language even just ordering Uber eats after a long shift is fantastic. Bubble baths, bath bombs, massages, foot massage, and specialty soaps are awesome gifts. I wait for my man with a hot bath ready for him to relax 🥺. There is a lot of time you will feel alone just know this even though, you're together bc they'll need to study. Their attention cannot be you at all times. If you have a situation like grieving a family passing or even a wedding you will go by yourself. No one will understand but they won't be able to attend their own wedding. It's tough, but if you make it through it's worth it.",
            "Unless you are planning to move to be with her everyday, then I guarantee that there are already guys that are going to be giving her a lot more attention than you will.\n\nIf you are serious, then move and be with her. Otherwise, the long distance is going to kill the relationship.\n\nAddendum: make sure to ask her before moving. If she is all for it, then do so. If she is hesitant about you moving there, then move on buddy because she already has.",
            "Look at the big picture while balancing the finer details from time to time, so you can both keep your sanity. Let her be herself around you, and the rest will work out",
            "Sorry to break your Buble but it's not going to work , long distances never work \n\nYour daily 30 minutes of chatting will turn into 15 minutes and then no minutes in a matter of months \n\nUntil eventually a \"understanding\" co worker comes into the picture \n\nEnjoy the honeymoon phase but don't have real expectations",
            "They key to making this work is getting a nurse sidepiece PRN to unwind after call.",
            "Congrats… it sounds like this could be something!\n\nBefore going any further and you spend more time (and emotions) I would hit the 21 questions and see if its serious or not? \n\nAsk about her family, parents relationships etc… if no red flags then let your heart lose on her! \n\nDef taking her coffee at work for a quick 5 min even if shes game for it… my wife meets me at my rotations all the time, sometime for 5 min sometime for an hr on dead days… this made a couple residents start having their wives do the same. \n\nIts the effort that matter! \n\nA",
            "How did you guys meet? I'm single and it feels almost impossible to meet anyone in real life",
            "I legit laughted out. Thnx for making my day hahahaha",
            "Do it well. Show you know the anatomy",
            "Yeah, this is the one ☝️",
            "This is the way",
            "LOL",
            "𝓒𝓾𝓷𝓷𝓲𝓵𝓲𝓷𝓰𝓾𝓼",
            "Date me too! Gotta ask the wife but I’m sure she’d be ok if you cook for both of us",
            "Bleboob!",
            "as a non-doctor, why is this getting downvoted?"
        ]
    }
}