{
    "Troubleshooting your job search (when it's not working)": {
        "title": "Troubleshooting your job search (when it's not working)",
        "score": 693,
        "url": "https://www.reddit.com/r/resumes/comments/128xo1c/troubleshooting_your_job_search_when_its_not/",
        "content": "Hello r/resumes 👋\n\nI'd like to talk about a topic that is just outside of the normal scope of this sub (i.e., resumes), and that is job search.\n\nWith the recent layoffs that have happened in recent months, there will surely be a lot of folks out looking for jobs, many of which may be hitting a brick wall at various points of the job search process, such as:\n\n* Not getting call backs\n* Not passing the recruiter screen\n* Not moving forward during job interviews\n\nBelow, I'll talk about each of the above issues and provide some ideas as to why you may not be seeing the results you want.\n\n# First pain point - not getting any callbacks (or getting very few)\n\nIf you're getting less than **1 callback in every 10 job applications**, it's an indication that one of a few things is happening:\n\n* You're not qualified for the types of jobs you're applying to\n* Your resume isn't presenting a relevant value proposition\n* Job market (out of your control)\n* Strength of other candidates (out of your control)\n* If you're a student or new grad looking to apply for internships and jobs abroad, a common obstacle is the lack of sponsorship for visas. Many companies are hesitant or unable to sponsor visas due to the complexity and cost involved. This can significantly reduce the pool of opportunities available to international candidates, making it even more challenging to secure a callback.\n\n**Fixes:**\n\n* To make sure you're qualified, you should be checking off at least 60% of the requirements of the role.\n* If you're qualified, there's a good chance it's your resume. Most people's resumes contain mistakes that fall into one of three categories: improper formatting for ATS, generic content, or not enough personalization/customization. I provide more info about each of these in [this post](https://www.reddit.com/r/resumes/comments/tq061t/biggest_mistakes_that_impact_your_resumes/) and [this post](https://www.reddit.com/r/resumes/comments/s2b37q/if_youre_applying_online_use_a_single_column/?utm_source=share&utm_medium=ios_app&utm_name=ioscss&utm_content=2&utm_term=1).\n* For international students and new grads, do your research and target companies and roles that have historically sponsored visas or are known to be more open to international candidates can improve your chances. Additionally, being upfront about your need for sponsorship can help set the right expectations from the start.\n\n# Second pain point - not making it past the recruiter screen\n\nIf you're getting calls from recruiters, but aren't making any progress after that, then there's something going on with what you're telling (or not telling) them.\n\n**Some Potential Causes and Fixes - Recruiter Screen**\n\n|Possible Cause|Fix|\n|:-|:-|\n|Your elevator pitch is unsatisfactory|Practice your pitch and ensure it aligns with what the company is looking for in this particular role. Your pitch should essentially answer these questions: Who are you and why do you want this job?|\n|What you're saying doesn't match what's on the resume|Memorize your resume and everything on it, including titles, dates, and responsibilities.|\n|You're asking for too much money (if you've revealed your salary expectations).|Don't reveal your salary expectations at this stage. If asked, just say that you'd like to learn more about this position before you can provide a realistic salary expectation. Do your homework on salary range for your position, industry, and company.|\n|You're not prepared, haven't done your research, don't seem enthused for the role etc.|There are a lot of other applicants. If you don't seem like you want the job, they'll move on. To prevent this: research the role/company and develop a good understanding of what they do (i.e., their market, products, services etc.). Look at company pages, read their mission statement, read the job description, show up on time, and try to sound neutral at the very least (excited would be good).|\n\n*Note: These are just common causes that may be behind your results. This isn't an exhaustive list and there could be other reasons not covered here.*\n\n# Third pain point- you're not moving forward during interviews with hiring managers\n\nGetting roadblocked during the interview stage likely means you're not performing well enough.\n\n**Common Causes and Fixes - Interview**\n\n|Possible Cause|Fix|\n|:-|:-|\n|You're not sufficiently answering behavioural interview questions|Practice! There are a lot of good guides all over the internet on this topic. See a brief guide to these questions below this table.|\n|You can't remember important details about past projects and accomplishments|Prepare a master list of projects and accomplishments you've been involved in throughout your career. Follow the STAR format. Memorize it.|\n|You're lacking key skills and experiences.|If you know you lack key skills/experiences, you'll need to provide a very good rationale for why you'd still be the right candidate for the position. If you don't have one, you probably shouldn't apply.|\n\n*Note: These are just common causes that may be behind your results. This isn't an exhaustive list and there could be other reasons not covered here.*\n\n# A note about behavioural interview questions\n\nEmployers love using behavioural questions because they give them a little bit of insight into how you'd behave in a particular role, how you'd react in a particular scenario, or how you'd solve a particular problem or task. They're also really hard to fake.\n\nA few common ones you've probably heard before:\n\n* “Tell me about a time when...”\n* \"How would you approach X problem...\"\n* \"Imagine you're in the following situation...\"\n\nAnswering these questions is beyond the scope of this post today, but if you're struggling with these types of questions, you'll need to prepare and practice in order to respond effectively.\n\n# A note about the STAR Method\n\nYou've probably heard of this before, but for those of you that haven't, the STAR method is a simple and easy-to-remember technique for answering behavioural interview questions. STAR stands for:\n\n1. Situation: Describe a specific situation or event where you faced a challenge or had to solve a problem. Try to pick a relevant example that shows your skills and abilities.\n2. Task: Explain the task or responsibility you had in that situation. What were you supposed to accomplish or what goal were you trying to achieve?\n3. Action: Talk about the actions you took to address the situation or complete the task. Explain the steps you took and the skills you used to resolve the issue or meet the goal.\n4. Result: Share the results of your actions, focusing on the positive outcomes and what you learned from the experience. This could include how you improved a process, solved a problem, or achieved a goal.\n\n# Hopefully these tips help you!\n\nThis isn't a comprehensive guide by any means, but it can hopefully give you some ideas and point you in the right direction if your job search isn't getting you the results you want.\n\nGood luck!\n\nPS: If you found this post helpful, consider subscribing to my free newsletter, [The Launchpad](https://thecareerlaunchpad.beehiiv.com/subscribe), where you’ll get weekly tips to help you network, find jobs, and make more money (not to mention the the freebies). ",
        "num_comments": 174,
        "comments": [
            "**A note about oversaturated markets. In a market where jobs are few and applicants are high, expect lower interview rates, all else held equal. In this kind of market, networking becomes a crucial factor:**\n\nIf you're not networking already, you should be doing so.\n\n**A few basics about networking:**\n\n* It's not just for executives. Anybody can do it.\n* It's not just for extroverted people. If you're an introvert, you can still network.\n* It can be done online, or in person. Pick your poison.\n\n**Important groups in your network:**\n\n* Family\n* Friends\n* Coworkers\n* Alumni\n* Recruiters\n* Everyone else\n\n**Examples of how you can network:**\n\n* Asking a friend or family member over coffee if their company is hiring for your job type and if so, would they be open to referring you.\n* Reaching out to a LinkedIn acquaintance whose content you regularly engage with, to ask whether they know of any opportunities for X job type.\n\n**Networking works best if you do it regularly**\n\nIt works a lot like a garden. If you only tend to it once or twice a year, it's going to wither and die.\n\nYou should be tending to it regularly.\n\nNetworks are the same way. They're built on relationships - and like any relationship, if you only reach out when you need something, you're going to fail.\n\nBuild and maintain your network - think longterm.\n\nI hope this helps some of you. Best of luck.\n\nJames.",
            "I wish more people would read the stickys. ~90% of the posts would be solved. \n\nOne interview trick that I do that helps me get to the next round is just have a conversation with them. Treat it less like an interview and more like a coffee meetup. For example, at the beginning of the interview, before we actually start, ill ask them how they're doing, if they had a great weekend or plan on doing anything exciting this up coming weekend, etc. The \"interview\" feels more authentic and maybe if they say something that you like or are familiar with, touch on that for a bit. Boom, now you're best friends with recruiter. \n\nAlso ask more open ended questions during the interview to get them explain things more in detail. Shows that you're curious and also gives you more time to think. For example, ill say something like \"what's a previous project [goal, KPI, etc] that the team completed as it relates to X\"",
            "*You're not prepared, haven't done your research,* ***don't seem enthused for the role etc.***\n\nTHIS. \n\nI interview so many good and qualified candidates who totally fail to indicate in any way that they are actually interested in the company/role. Literally say during the interview:\n\n\"I am excited about what \\[X Company\\] is doing in the \\[Y industry\\] space!\" \n\n\"I am excited about what I can contribute to your team!\" \n\n\"I am excited to help with the challenges you are facing!\" \n\n**Be overt with your enthusiasm.**",
            "My problem is I make it through the entire interview process - phone screen, initial phone interview, on-site, follow-up, etc. \n\nWhen it comes to between me and however many candidates it comes down to, I lose. \n\nI usually get a positive vibe/feedback throughout, and it just comes down to a 'better' candidate I guess?",
            "STAR method is also a great way to approach writing resume bullet points!",
            "[deleted]",
            "Any other elaboration you can give on the first pain point on not getting callbacks? \n\nI ask because after my last job hunt in 2020-2021, I submitted around 170 applications and only got responses to 4 (that I tracked). Going through your checklist:\n\n* Qualifications - without lying to myself, I'm confident that I have the qualifications to perform the jobs I apply to. Maybe for 10% of apps I might have be stretching a bit, but I think probably still meeting 50% or more qualifications\n* Improper ATS formatting - I always submit as a PDF in a single column, fairly straightforward format. It's actually the same one you shared in another post [here](https://docs.google.com/document/d/1wdkgpgU7lFoV801ysrBn8qrPaIpyUsUH/mobilebasic)\n* Generic Content - I make sure to have >50% of my bullet points tied to a metric, such as throughput %'s, $$'s saved, etc.\n* Not enough personalization - I don't know if my \"bland\" resume format so I don't get kicked by the ATS is hurting here, but I will say at first glance it probably does look pretty dense or packed together\n\nMy best guesses is I'm either\n\n1. Overestimating my qualifications/underestimating what's posted for the job\n2. Overestimating how transferrable my skills are (e.g. engineering in pharmaceutical manufacturing =/= engineering in ___ manufacturing?)\n3. Getting swept up by the ATS for a reason I can't see\n4. Getting through the ATS, but getting denied by human eyes for a reason I can't see\n\nResume [here](https://imgur.com/a/eY4kfdZ) in case folks are curious and have any notes!",
            "Thank you. This is helpful and topical, especially given the current job climate. Things are tough out there...",
            "this makes me want to kill myself",
            "I absolutely think it is my resume because most of the companies here use older ats systems so I have had to rewrite my resume because they cannot read a pdf. had one employer say it looked like code on the other end when I asked. My problem is with the star system I do not have anything to put down. I literally cannot answer any of those questions because all I did was show up and do assigned tasks.",
            "Someone actually told me a really great resume tip that helped me a lot. When you customize your resume, instead of trying to rewrite the keywords and phrases to make sense in your job bullet points, just copy and paste them in your skill section.\n\nEvery time I had to rewrite the keywords to make sense with my job description, it would never make jobscan improve my score and take a lot of time, but just putting them there in the skills section is faster and gets me a much higher score.\n\nI know Jobscan isn’t 100% reliable, but people in a certain industry have told me they get jobs at these companies when their resume has a high jobscan score",
            "Amazing, everything is super helpful!",
            "For call back, how many days are standard? I experienced next day to two weeks later. Those 7 days and above , I even forgot them. \nMy applications were senior positions",
            "I got interviews but I’m not getting callbacks.",
            "This is a super helpful guide. Thank for putting it together; it's very thorough!\n\nOne quick note about: \"*you're asking for too much money (if you've revealed your salary expectations).  Don't reveal your salary expectations at this stage.\"*\n\nThis one is tricky. As someone who has sat in the seat of both agency and internal corporate recruitment for mid to enterprise (F500 companies), having that alignment on salary at the initial stages is really important. Companies have salary bands and recruiters work with ranges that are provided by the companies they are supporting that is one of the tools that they use to filter out candidates. Doesn't seem fair, but it's just a reality. Not giving a salary can exclude you as a candidate because recruiters need to know what you want to ensure they can make it work for you and them (financially) and they need to establish this before moving forward. This way, no one wastes their time. The worst thing that can happen is that you go through various stages of interviews only to find out that the compensation offered is not in line with what you are hoping for. \n\nAdditionally, when a candidate says \"I'd like to wait etc.\" this also raises a flag because, to your point above, on the flipside a candidate can change their salary expectations later on in the process. This is something that companies worry about.\n\nA couple of options:\n\n1. Ask what the salary range is that the company has budgeted for this position. In this day and age, if a company is reluctant to share this I'd be concerned. With all the Pay Transparency initiatives taking effect, there's been an increasing number of job postings that show salary range. So, ask before you answer.\n\n2. Be honest and ask for what you want and do it confidently. Don't give a set number give a range that leaves wiggle room for negotiation and a range that you are comfortable with. I understand that this may be easier said than done and not all of us able to advocate for ourselves in the same way. So, this is where researching the company the position comes in. Do your research and see what the market is offering for the position you're applying for. Look for ranges within different industries and most importantly find a range that works for you; one that you are really asking for. \n\nAt the end of the day, it will depend on the candidate and the company. There are also some companies that would be okay to wait, but hopefully this provides an alternate perception that can help in various situations.\n\nThanks again OP for this. Really great post.",
            "Thanks a lot for your suggestions. It will help me to tailor my resume.",
            "I have had 1st screening with recruiter. How long does it take to move forward if they are really interested in me for 2nd round? Is it 2-3 days ? If they don’t call or email me in 3 days, I should forget it. Right?",
            "Question — after the thank you emails, should you hear something back? In all the jobs I have gotten, something has been said in reply to my thank you notes. In the ones where I have not proceeded to the next round … is this a reliable indicator??",
            "This is very helpful and super relevant, thank you for sharing!",
            "There have been a few times I got rejected due to location/transportation. Even though I have told I will move close to the workplace after receiving the offer, it doesn't help.",
            "Hello, can someone provide me feedback on my resume?   \n[Resume Link](https://imgur.com/UYoBkha)",
            "Nice Valuable Suggestions . Thanks a Lot ![gif](emote|free_emotes_pack|grin)",
            "TYSM for sharing! Mine was similar, very simple word doc and I got an interview for fully remote in two weeks too!",
            "How useful do you think networking with DS people from linkedin and asking them for coffee meetup would be?",
            "Thanks for the helpful advice on job searching!   \nI've been dealing with a lot of job applications lately, and it seems like many people are just applying everywhere, hoping for a few callbacks.\n\nMy problem is, that I'm trying to be more focused in my job search, applying to companies that really fit what I'm looking for. But I worry that this might put me at a disadvantage compared to those who are sending out numerous of applications.\n\nDo you have any advice on finding a balance? How can I be more selective in my job search without missing out on opportunities? Any thoughts on making the application process more purposeful and personal?   \nGood luck to everyone out there job hunting!",
            "Help with cover letter?",
            "my problem is that if i do actually even get a call, and actually make it to an interview, i always point out the highlights, what i did right, what i hope to improve in the future, in response to whatever behavioral questions the employer usually throws at me such as “what do you have strengths at?” or “tell me a little bit about yourself”. and i even kept reciting to myself to give me some more confidence and they still don’t give me any answers after a week",
            "[deleted]",
            "Thanks a lot. I am wondering if anyone can give feedback on my resume or cover letter?",
            "Thank you so much",
            "It helps a lot. So amazing! isn't it?",
            "I feel stuck at a job for the past 2 years now and can't find a way out. Initially my reasons were personal but now they've become work related and I don't enjoy my profile. Problem is that due to the situations and geopolitical conditions, i could not make sales, thus I've never closed a deal by myself and because of that I'm not able to convert sales interviews.\n\nI had applied for a few just out of curiosity but i received call from 1 and it didn't go well. I feel lost that I don't have a tangible skill set to move out of sales and get into something else like product management, nor am I getting time now due to being overloaded with work and travel. There are days when it's tolerable but then there are days when I just want to resign without a job at hand.\n\nAny pointers on what should I do would be helpful.",
            "OP: Excellent job searching advice. Similar to the YouTube channel A Life After Layoff. The labor market problems with layoffs in 2023, hiring freezes, no openings, etc seem to be more of a problem in the tech field due to over hiring in 2021 post COVID 19. There are still worker shortages in good paying fields like transportation, trucking, logistics, child care, teaching, tutoring, medical. In the entry level jobs- restaurants, retail, warehouses, distribution centers, etc there are still worker shortages, but those positions pay less.",
            "Hello everyone im considering to apply for MHA programs in the US…Any suggestions for international grads friendly programs that arent too expensive?",
            "Job needed",
            "Need help in this resume I used [this template](https://docs.google.com/document/d/1wdkgpgU7lFoV801ysrBn8qrPaIpyUsUH/edit?usp=sharing&ouid=103022094325852815590&rtpof=true&sd=true) and it's awesome really but i have one problem need to add my picture as job posters always ask for a recent picture??",
            "this was so helpful! I'm definitely saving this for later to update my resume!",
            "This is so so so helpful!!!! Thank you",
            "Great post, really appreciate it!  \nI would say that  \n\n* Strength of other candidates (out of your control)  \nBut, in the mid - long term it's in your control, let's say that if you can't find a work for a year, in that year you probably could have done some applications / courses to improve your knowledge and gain a bit of control over this point.",
            "Absolutely. Demonstrating that you’re interested, well researched, and engaged will go a long way.",
            "Is it possible to be too enthusiastic and come across as needy??",
            "Just sharing, at my old company they interviewed a guy who had a gleaming resume but was adamant about their pay being a certain number. They ultimately rejected him and went with a much less experienced person (as in, no experience) who accepted 2/3 of the *offered* pay. So in this case 'better' was just accepting less pay, which I don't agree with.",
            "I’ve had the same and very unfortunately it is a company I am interested in and the person who beat me out has not worked out multiple times now … yet they keep bringing me in to the final stage then going with someone else",
            "My first thought would be your confidence. Are you a super confident person?",
            "Yes it is!",
            "I see your point, but I don’t think the two are necessarily mutually exclusive. \n\nIf every single job applicant, everywhere, got calls on 10% or more of their applications, then yes, that would suggest that recruiters call 1 in 10 applicants or more.\n\nHowever, that isn’t the case. Let’s take a look at it from a different angle, using some examples. \n\nImagine we have Lily, a job seeker, who applies to three different jobs: Job A, Job B, and Job C. Lily has an impressive resume, and she consistently gets calls for 10% or more of the applications she submits.\n\nNow, for Job A, the recruiter calls 5 out of 50 applicants (including Lily). In this case, the recruiter contacts 1 in 10 applicants.\n\nMoving on to Job B, the recruiter calls 15 out of 100 applicants (Lily’s one of them, too). Here, the recruiter actually contacts more than 1 in 10 applicants, which is 15%.\n\nFinally, for Job C, the recruiter calls 10 out of 200 applicants (yep, Lily gets a call here as well). This time, the recruiter contacts fewer than 1 in 10 applicants, around 5% to be exact.\n\nSo, what we're seeing here is that the percentage of applicants contacted by recruiters can vary quite a bit, even when Lily consistently gets calls for 10% or more of her applications. There's no one-size-fits-all rule that applies to every job, recruiter, or applicant out there.\n\nLily’s experience might make it seem like recruiters always call at least 1 in every 10 applicants, but that's not a hard and fast rule. It's just how things played out for her and the specific jobs she applied to. I hope this helps! \n\nAs for where the metric came from, it’s based on my own experience on TA and coaching. Thanks!",
            "What can an applicant do to be more visible and increase the chance of being reached out to?   I get a lot of e-mails that say something to the effective \" We have reviewed your application, and unfortunately, we are unable to offer you a position at this time. Your skillset is impressive and we will keep you in mind for future roles. \"  \nI'm almost positive they send the same generic \"someone else was just a tiny bit better than you\"  to everyone.  But they seem to acknowledge I have most of what they are asking for but still don't want to interview me.",
            "Then why not?  Too many qualified applicants?",
            "Agreed.\n\nIf a job has 1000 applications, as is often the case with CS jobs these days, then the recruiter will likely only invite at most five to ten people for interviews. That is one in 100.",
            "I think your resume could be a bit more concise/direct and have more white space. I am not expect though.",
            "I'm not a specialist. But I feel you have too much text.",
            "The link to your resume doesn’t work btw.\n\nTough to say without seeing it; however, there are factors outside of your control such as the state of the industry and job market as well as the strength and number of competitors.",
            "[deleted]",
            "I'm a little late but have some feedback. \n\n1. Add a space between the headers and first line of text like:\n\nWORK EXPERIENCE\n\nspace\n\nSenior Design Engineer ....\n\nA little white space helps to section each job and it's just easier to read (less strain on the eyes)\n\n  \n2. Include a section at the top of the page for a summary. That's where you want to put the little blurb that you have before each bullet point. Ideally, the summary comes first to, well, summarize your skills, achievements, past roles and what career goals you hope to achieve with this company. The experience section should just be the job title, company, start and end date, and at least 3 bullet points that highlight HOW you helped that company. Look up the STAR method. Not only will it help on your resume but also during interviews.\n\n  \n3. You're going to want to include keywords from the job description. Yes, that means that you should be tweeking your resume each time you send it out. Scan the job listing to see what words you need to use on your resume. If the job listing says they are looking for a team-player, make sure you have team-player somewhere on your resume. If you can match like 70% of the keywords from the post, then you will be more likely to pass the automated tracking system that nearly every company uses.",
            "[removed]",
            "Yes they are, but hang in there.",
            "Why?",
            "You might have to think about your work from a different angle. Every job has a purpose that contributes to a higher level goal. \n\nIf you're a cashier at a grocery store, you're providing customer service to multiple customers per day, you're the face of the organization, and you're contributing to the company sales goals. You're also satisfying customer needs.",
            "Thank you 🙏",
            "You’re very welcome! Also check it out this [article](https://jobseekersgazette.beehiiv.com/p/how-to-tailor-your-resume-the-right-way) to learn how to quickly tailor your resume.",
            "This is highly variable depending on the company, unfortunately. If you think about it -- for a single opening, most companies are probably trying to doing a 1st round of screening for maybe 5, 10, or more applicants. The logistics of getting that many people scheduled and through a screen alone could take upwards of 2-3 weeks depending on responsiveness and flexibility, not to mention then time for the company to decide who to move onto the next round. \n\nI would recommend keeping your ears open for a month, if you want a rule-of-thumb.",
            "I would say no, not always a reliable indicator. Sorry for the late response!",
            "You’re welcome!",
            "Taking the time to put in quality applications, as opposed to spraying and praying, is ultimately a superior approach imo. Your strategy should involve a number of things, such as:\n\n* Being selective with which companies and positions you apply to\n* Networking with people involved at those companies\n\nThe LAMP method is a good one to check out. I've written about it [here](https://thecareerlaunchpad.beehiiv.com/p/optimize-your-job-search-with-the-lamp-method). You can also read the book on it by Steve Dalton (2-Hour Job Search).",
            "No worries! Best of luck with the interview.",
            "For sure. Post anonymized versions to the sub for feedback.",
            "Where are you applying?",
            "Don't be interesting. Be interested",
            "I haven't seen that happen yet.",
            "I would say no. I review resumes for a university and resumes that are missing enthusiasm feel weird as most come with some sort of excitement. \"why are you applying if you do not want to work here?\" This does not apply for jobs where money plays a huge factor, like sales. The reviewer can easily assume you are applying to make money etc. My best advice would be know your company. What does Enthusiasm mean for that company. Ex: Applying to Patagonia or a non profit vs. the IRS",
            "I've been looking up the average pay for my area and putting down a range from a little below the low end to a high at the median.   I'm not sure why no one even wants to take the time to talk to me.  I'm looking for my first professional position (or internship) I don't have the work experience to prove I can do what I say I can.  I was turned down for 2 internships citing \"we've decided to go with a more experienced candidate\"    Both programs were advertised as for \"new graduates.\"",
            "At this point, I would honestly ask them to be more candid on what it is. You can frame it much more appropriately of course perhaps by asking the question \"is there anything more or can I expand on anything that you'd like to know more about that I may have glossed over or not given enough detail on?\"\n\nI normally wouldn't suggest this, but in your situation where you've been bought in multiple times to a final round because of multiple failed candidates on their part, at this point you've (hopefully) built a rapport with them at the very least, and could get away with asking this.",
            "I was told essentially every resume bullet is a star story but yes, I suppose it can go both ways",
            "I found a few that wouldn't accept my resume. I kept getting a submission error.  On a whim, I decided to try converting it to a pdf.   3 out of 3 times it the error cleared, and my resume was submitted.   However, all three of those also send me a very nice \" we went with another candidate\" e-mail.",
            ">ave more white space. I am not expec\n\nWill this application work? I spent a lot of money on ATS software which I regret because I am still unsuccessful.",
            "not the post, having to do any of it",
            "unfortunately without knowing those goals/needs you cannot put anything useful down. As a lower level employee these were often not shared with us,nor did we have access to any customer satisfaction surveys so the current application process has gotten increasingly difficult. I just want to be able to pay off the rest of my student loans.",
            "Appreciate your inputs. Last year I experienced very fast processes from 95% companies if I was shortlisted for next rounds, from next day to 3 days. \nThis job app was the first one I sent and they scheduled me 1 day after my application. So my assumption was to use 1-3 days as a rule.\n( all other applications were either slow or quiet.)",
            "I will do that, I hope it doesn't get blocked/reported.",
            "For medical work pharmacist or Medical Representative",
            "It can happen. Personal experience. I was much younger, trying to get a retail job at an office supply store. First interview after months of job hunting, and I tried to convey how much I enjoyed office products. I am pretty sure the interviewing manager thought I had some kind of sexual fetish for paper. I did not get called back.",
            "What do you think about thank you notes? If I don’t get a reply to an enthusiastic thank you note, bad sign??",
            "Honestly the feedback they gave me was so useless that I stopped caring about getting the feedback at the end. I was always told “you were so close but we went with someone internal.” I think the reality is that there are not enough jobs in this field and they need to prioritize internal candidates first - but after these candidates haven’t worked out time and again it would be nice if they just came back and asked me if I was still interested",
            "Same. I've been asked to quantify my role.   I slice meat and pick groceries.   I can not tell you if I've increased anything by any %.",
            "Why would it get blocked and reported?",
            "In which country/countries?",
            "Hah!",
            "I usually don't respond to thank you notes, but I do appreciate them.",
            "Or just a sign that they're very busy—so much so that they need to hire help.",
            "bruh im so burnt out from rounds of interviews and getting my offer revoked. how do u compete with internal candidates?",
            "Internal candidates are cheaper and less risky because of known history and likelihood of staying around. Disadvantage is they may not be as transformative or bring new ideas.",
            "By slicing and picking groceries, you contribute to overall sales for your department(s).",
            "I don't know I tried it earlier and got reported and banned for 7 days I guess.\n\nBtw, I posted it [here](https://www.reddit.com/r/resumes/comments/12kpjcy/feedback_on_my_cover_letter/) please give your honest feedback.",
            "Middle East they always wanna to hire young females so they don't pay them much we are not like Europe I'm planning to migrate to Europe in next two years",
            "Thanks - are you a hiring manager? Can I ask you another question?",
            "well the funny thing is all the internal candidates did not stick around or perform their duties adequately. I think people don’t realize that sometimes selecting a mediocre internal candidate is a costlier move than accepting an external candidate who really wants the position and is ready to take things to another level. People just go for what’s comfortable",
            "Quite directly.   I offer sample slices to everyone to ensure they are happy with the taste and thickness and id guess 1 of 5 people gets more.  \"On second thought make that 1.5 lbs\"  instead of 1lb.   But  metrics on sales are not shared with us.",
            "Were you breaking the rules in some way?",
            "I am. Sure, happy to answer.",
            "That’s a selection problem on their part. I prefer internal candidates at a large company where I’ve worked peripherally with the candidate so that I know their ability and motivation already.",
            "What? They don't share sales metrics? You need that for your resume. I'd be hunting that info down.",
            "probably I don't know. But I am sure it would have been some formatting issue and shouldn't have been reported or blocked. Anyways, I would love to have your inputs on my post that I shared earlier. Thanks!",
            "I’ve been through several rounds of review and at the last panel the person leading didn’t know what the next step was. I sent requisite thank you notes to everyone - how long do I allow to pass before reaching out someone to find out if that was the last interview/decision timeline/next steps? I really want the position and I’m eager to know if I’ve completed the interview stage and am waiting on a hiring decision or if there’s one last round to go. thanks so much for your help! I really appreciate your wisdom.",
            "agree but in such a case are you going to put an external candidate through 7 rounds of interviews just to say you tried?",
            "Unless I want to share the sales increase per quarter for the whole department.     Maybe I can do that and divide it by the number of workers?   I did ask a few months back and was basicly told metrics for employees where not tracked. \n\n*I read you comment as sarcasm  but replies as if it wasn't  so if you ment \" ***whhhaaaat?***  they don't give you information  you need for a resume?  How strange?\n\nI agree it's a weird thing to need \nEvery person who looked at my resume advised me to add specific metrics to quantify my impact.",
            "I'd say about two weeks would be more than enough time to wait for any response. I like to provide everyone I interview with a yes or no answer, but I don't think all companies do that. Definitely reach out to the hiring manager if you haven't heard anything and it's been a while.",
            "no absolutely not -- that's not right and I debate with HR about such things so as not to waste people's time.",
            "Well my concern is I don’t even know if there is another round? I went through a couple of large panel interviews and so the hiring manager was not there at the last one - I don’t know if I should follow up directly with the hiring manager or just wait it out"
        ]
    },
    "New visitor? Please see these quick links before posting or commenting.": {
        "title": "New visitor? Please see these quick links before posting or commenting.",
        "score": 249,
        "url": "https://www.reddit.com/r/resumes/comments/129ez4n/new_visitor_please_see_these_quick_links_before/",
        "content": "Hi r/resumes 👋\n\nAs a member of the mod team, part of my job is to make it as easy possible for you to access the resources available here.\n\nThere’s a lot of guidance in the wiki, but since many folks seem to miss it (especially new users), I’ve created a list of answers to common questions and issues. \n\nPlease familiarize yourself with these resources before commenting or posting. \n\n**“I was banned for no reason...”**\n\nPlease read the [rules](https://www.reddit.com/r/resumes/wiki/index/rules/) to avoid a ban. Most common reasons for getting banned are spamming, harassing other users, or DMing other users. \n\n**”I’m not getting any feedback on my post”**\n\nPlease ensure you’re providing the right information so that people can help you. That includes:\n\n* Giving your post a flair tag\n* Identifying your current role and target role\n* Why you’re seeking help \n* Uploading an anonymized version of your resume\n\n**”How do I say X or Y on my resume?”**\n\nThe [free resume writing guide](https://www.reddit.com/r/resumes/wiki/index/faq/) covers all of the basics and will have answers to common questions. Please read it before posting. \n\n**”Does anyone have any recommendations for a resume writer?”**\n\nIf you’re looking for a resume writer, please read [this guide](https://www.reddit.com/r/resumes/wiki/index/beforehiringawriter/) to learn how to find a qualified writer. \n\n**”Does anyone know where to find free resume templates?”**\n\n* If you’re looking for a resume template, you’ll find one [here](https://docs.google.com/document/d/1wdkgpgU7lFoV801ysrBn8qrPaIpyUsUH/edit?usp=sharing&ouid=103022094325852815590&rtpof=true&sd=true). \n\nThere are also other great articles and tools in the [wiki](https://www.reddit.com/r/resumes/wiki/index/). \n\nI hope this helps. Please comment below or message the mod team if you have suggestions on how to improve r/resumes. \n\nCheers!",
        "num_comments": 3,
        "comments": []
    },
    "Stop using these words on your resume (pretty please)": {
        "title": "Stop using these words on your resume (pretty please)",
        "score": 228,
        "url": "https://www.reddit.com/r/resumes/comments/1dl4fty/stop_using_these_words_on_your_resume_pretty/",
        "content": "Hey Folks, \n\nFDR here with a (hopefully) helpful post on resume writing 101. \n\nWhen you're writing your resume, remember that you're competing with (likely) hundreds of other applicants. \n\nDo you think using terms like \"detail-oriented\", \"driven\", or \"highly motivated\" are gonna cut it?\n\nAbsolutely not. So stop using them (in the summary mainly, which I see all the time). \n\nAfter all, if I'm Mr. or Ms. Recruiter, how do I know if you REALLY ARE \"detail-oriented\" as you claim? \n\nI have no way of proving you right or wrong. \n\nAnd when most of the 140 applicants on my open requisition (job posting) are using the same filler words, they become absolutely meaningless. \n\nInstead of using these words, help me help you, by providing me with the goods - the real, hard data that I'm looking for, like: \n\n* Years of experience\n* Industries you're experienced in\n* Companies you've worked for\n* Types of projects you've worked on\n* Measurable impact you've had on things like: \n   * Revenue and sales\n   * Process efficiency\n   * Manual work reduction\n   * Company growth\n   * Customer satisfaction\n   * Uptime/downtime\n   * Vulnerabilities reduction\n   * Employee satisfaction\n   * Conversion rate\n   * Cost reduction\n   * And so on...\n\nRemember, anybody can say they're results oriented, detail oriented, motivated, a phenomenal speaker etc., but very few actually provide examples to back up those claims. Don't let that be you. \n\nCheers!",
        "num_comments": 131,
        "comments": [
            "I don't like those buzzwords, but I add them to my resume summary because those same buzzwords are in the Qualifications section of your job posting. \n\n  \nIf you put \"We want a detail-oriented XYZ\" as a requirement don't be surpised that some of us will write \"I'm a detail-oriented XYZ\" in our summary",
            "> And when most of the 140 applicants on my open requisition (job posting) are using the same filler words, they become absolutely meaningless.\n\nTotally unlike job postings, which are absolutely not the epitome of low-effort copy & paste buzzwords.",
            "I hardly use pretty please on my resume",
            "The word “spearheading” drives me nuts",
            "I love this! I used this mentality with mine and am hoping to share my success story any day now…\n\nI have a question: I see many people here format Education above Experience, even if they have been out of school for some time. I find it somewhat faux pas. What are your thoughts on this?",
            "I’m sure this is great advice! However for me, I don’t do business or sales or tech work.\n\nI studied language in college and I’m looking for something like teaching, translation, or interpreting jobs. I’ve been struggling with how to include numbers/more concrete things or what the equivalent of “customer satisfaction” would be for a teacher or translator’s resume?",
            "One of the things at least in my experience that helps a candidate stand out is submittal of a a cover letter. Very few people submit them with an application and where as I don't fully read resumes, I scan over them, I will read a cover letter because I get so few of them.   Then if it's well written and highlights a particular skill set I will then spend more time on that candidate's resume.  Not sure if other hiring managers do this but I know I always did.",
            "How exactly do you measure these things without access to the data? If you help the company grow by maintaining relationships, and your company doesn't provide you with any statistics?",
            "Thanks for the advice! Could you help me figure out what a recruiter would expect from someone with extensive experience but looking to transition to another career? I've come back to Uni and was wondering how to word my summary since I have experience and am close to graduating, but the job I'm applying to is different from what I've done before.",
            "I especially don't need to know that 12 years ago was when your VMware experience is from.  Keep your resume to the last 10 years - if you're 50, I really don't care about your middle school paper carrier job.",
            "Honest question for you: how would you go about detailing measurable impact if you're at a level where you don't have access to quantifiable numbers for performance? I'm struggling with this as I re-draft my resume because several of my previous jobs didn't provide me any sort of record of performance data. I'd like to show the impact I had on sales and efficiency in these positions but I don't have any numbers to show. What would you recommend in a situation like this where the only the only things I can think to say are \"I did my job, made the requisite number of sales calls, onboarded new clients, and hit my quotas but I have no way to prove it?\"",
            "None of that stuff really applies to me though. I work in the physical security industry. I fail to see how bringing numbers or satisfaction into it would help. \n\n\"Tackled 12 people in one month. Satisfaction level is at an all time high\".",
            "Thank you for this.  So glad you posted too many people make these mistakes and have meaningless word vomit.",
            "What would you recommend to a college student trying to get an internship? I don’t have prior work experience or professional experience in my field. All I have are projects and academic experience.",
            "What if you don’t have an impactful role? Just a basic job. A lot of people probably lie about those metrics",
            "genuine question, how do you fit that stuff in the summary? seems like a lot of it would go into work history, but i'm not an expert.",
            "Stop with the words PASSION and PASSIONATE, as well please! Makes us recruiters cringe 😬",
            "Companies are also competing with hundreds of other companies. They use garbage ads filled with an equal number of grammatical mistakes, copy and pasted errors, and all of those filler words I should apparently avoid. They either give a pointlessly large salary range or hide it entirely. Then a computer scans my document and automatically forwards it to the recycle bin. Maybe mr recruiter sees it if they happen to intercept it on its way there. At which point there’s a screening interview where you ask … screening questions like what experience you have, and then if we’re oh so lucky a real technical interview where our potential talent can be assessed in all of 45 minutes to an hour. Why should I cram all of that info into a resume just to be made to regurgitate it live later on? \n\nDespite the rant I appreciate the advice but recruitment is just so easy to hate.",
            "Sure, but if I do what you say, the Taleo and Workday bots will reject my resume. So, no thanks.",
            "Hi! Sorry if this comment may not be that relevant to your post but I just need help so.. may I ask if one should put a working experience that is irrelevant to the current job you're applying for?",
            "The spirit of this advice is fine but your suggestions don't really provide a solution to the problem. You're talking about how the words people tend to use in their *summaries* are suboptimal/overused filler, but your suggestions for areas of focus are things people should be putting in their *work experience*, not their summaries. \n\nWhat exactly are you suggesting that people write in the general summary on their resumes?\n\nI may be misunderstanding you, but the summary is where I give a short overview of what kind of employee/person I am and what I *generally* excel at and focus on in my work.My specific measurables, work accomplishments, etc. (all the suggestions you provided) get explained in my work history under whatever past job I achieved those things at.\n\nI think what you're advising against is a natural consequence of general summaries being mostly useless to begin with, but that's primarily an issue of commonly accepted/expected resume formatting, and less so any lack of creativity of applicants.\n\nHow would you write a summary for yourself?",
            "I’m a hiring manager. My reaction when seeing “detail oriented” is to review the resume with a much closer lens. Is everything in the same formatting, was it all written in the same tense, etc. If I find those kinds of issues, then I know they’re not as detail oriented as they think they may be.",
            "Your bullet points should be shameless begging for the corporation to start giving you drops of money from its shareholders’ greedy hooves, in exchange for you working your life away.",
            "I love how you recruiters on these posts think that your personal opinions mean anything to anyone.  Just don’t hire people that use the words you don’t ‘like’ and move on.  Someone else will.\n\nSincerely - Someone who uses the words you hate, and gets paid.",
            "\"After all, if I'm Mr. or Ms. Recruiter, how do I know if you REALLY ARE \"detail-oriented\" as you claim?\"  \n  \nRecruiters couldnt determine that regardless of how its put on a resume. The recruiter's job is to find the resume that matches the patterns needed and push them on to someone who actually has a clue to do the filtering. Lets not pretend that suddenly Mr or Ms Recruiter has any idea what is going on in the job theyre recruiting for.",
            "What ats do u handle?",
            "This is great!",
            "Amazingly valuable post",
            "The old adage: “show, don’t tell” \n\nShow me what you’ve done by being descriptive about your experience, don’t just tell me you’re *insert buzzword here*",
            "[removed]",
            "You completely missed out on the part where all the candidates use the word detail oriented. So keep using it but don't come back w/ a post title \"Apply to 1000 jobs but no interview blah blah.\"",
            "That’s a valid point, but that doesn’t change the fact of the matter, and that’s differentiating yourself from the competition. \n\nWhen everyone is using the same buzzwords, the person that can *show, not just tell*,  is the winner. \n\nIf those keywords are in the posting, show (don't just tell) how you embody them. For example, instead of \"detail-oriented,\" say \"reduced errors by 15% through meticulous process review.\" That way, you stand out while still hitting their criteria.",
            "That’s sadly because of fair employment practices.\n\nI usually need a candidate that can do or has 5/10 “things” for my role. But those 5 things can be, for the most part, mixed and matched. Would I take a 9/10 candidate? Of course, they will get an interview simply due to qualifications checkbox. But what if one person has role experience, but not the industry? Or an adjacent role in industry, but not the specific role? And then let’s not forget if I enumerate every detail of what the job does, no one will read by posting (just like no one will read a messy cluttered resume…)\n\nSo HR makes me generalize. I get 5-8 bullets total to encompass what a human is going to do for years but also has flexibility for when “shit happens” and a project or reallocation happens and changes it… Oh and I have to make sure it aligns with internal equity, grade scales, and title structure they have selected regardless of applicability to my industry or role.",
            "Not at all.",
            "![gif](emote|free_emotes_pack|joy)",
            "“Spearheaded the use of pretty please on a resume”",
            "I’m only a fan of good spearheading.",
            "I think education should only be above experience if you just graduated. Once you’ve gotten some real world experience, the experience becomes more valuable and should be placed on top.",
            "Agreed. Unless recently graduated with very light work or project history, I would advise Education go towards the bottom so the job seeker can showcase their accomplishments and how they proved to be valuable in their work.",
            "Good question.  Your experience and accomplishments don't need to be quantified, for the reasons you mentioned.  In your case, it's probably more about what you did, how you accomplished it and what the result was.  The outcome of that can be anything from how your boss praised it, how many students you taught or how well they did if you know in relation to district averages, or any way to explain how accurate your translation was.  Those are just quick examples, it's more about the concrete details rather than just numbers.",
            "Baselines will help people get an idea of how familiar you are with the job -- hours of teaching, pages translated, hours of conversation interpreted. \n\nAwards, any of the sort of standardized language tests. Class sizes, level of language you brought them up to, lexical complexity of interpretations, amount of specialized (transportation, finance, medical, legal, etc) material translated.",
            "https://www.askamanager.org/2013/06/how-to-list-accomplishments-on-your-resume-when-your-job-doesnt-have-easy-measures.html",
            "When I hire people, even if I didn't ask for a cover letter, if someone wrote one that was authentic and well-written, I definitely read them.  It was often the difference in making the cut or not because so few people do them and I was able to tell more about the candidate.  It's extremely useful for any role where an employee will be customer-facing or be relied upon for written communication in a team.",
            "My only issue with writing a cover letter is it is often almost impossible to properly address it. I'm not sure why, but providing names and titles of the managers seeking to hire almost never happens. Sometimes even the company's physical address is not posted.\n\nMaybe I need to format it more like an email than a traditional business letter, but it would still be nice to start off with something other than, \"To whom it may concern:\"",
            "Very few people submit them because nobody reads it.",
            "That is interesting. I am surprised anyone would not include a cover letter. \n\nI have been wondering about all the posts claiming jobs are impossible. But given the quality of the resumes I’ve seen and lack of cover letters I am not surprised they aren’t getting responses.",
            "Cover letters can be great. The only caveat is they need to be tailored to the job.",
            "You track yourself. When I'm updating a process, I time myself how long it takes to do something, and then when I'm done working on it, I'll time myself again and use that reduction number. Ex, my job was to move us from sharepoint to another content management software and the average time to build one of 5 different standard webpage types we use went down by 45% on average, because folks stopped having to finnick with the layouts and the colors. You can also ask for access to dashboards where that information is housed, so when I make changes to a specific page layout, I can go into the google analytics for that page, take stock in what my average 3 month before metrics are, make the changes needed, then put a calendar reminder with a link to the project to go back in 3 months to take a look at how they've changed. Also, ask your manager. They probably have them and have never told you because you've never asked, that's how they tell their bosses that they're doing their job well. \n\nDepending on the company, some are way stricter on their data governance rules, but I taught myself SQL solely so I can pull my own metrics when I was a project specialist for a customer support team. You only need basic SQL and excel skills to create those metrics.",
            "If you don't know then make up the numbers. They should be good but not so good you couldn't replicate the task if you had to.",
            "You should have set SMART goals, which (when they are completed) practically write STAR bullet points.",
            "When you have extensive work experience you have developed people skills. The ability to organize and conduct meetings, mentor new hires and provide valuable feedback to help management are valuable skills",
            "Cover letter can help explain your situation and highlight some of your transferrable skills.",
            "Thank you!! This is what I think every time I see this…use these words and give the numbers…how?? If all I am doing is doing my job..I do not see these numbers or would know how to even begin quantifying what I do.  Example, when in a company that nothing changes in HR..people stay forever..headcount remains the same..payroll remains the same just annual increases..what exactly are we to quantify to show we do our job well.",
            "Network, network, network. Talk to your professors, alumni, and anyone you can in the field. They might have leads or advice that could help you land that internship.",
            "True, not every role offers the chance to make a big impact, and it's also true that some people might exaggerate their achievements. But even in a \"basic\" job, there are ways to showcase your value without resorting to lies.\n\nThink about the small wins. For instance:\n\n- Did you consistently meet deadlines? \n- Maybe you improved a process, even in a minor way, or went above and beyond to help a customer. \n\nThese things might seem insignificant, but they demonstrate your work ethic, reliability, and problem-solving skills.\n\nFor example, if you work in retail, maybe you consistently exceeded sales targets by a certain percentage. \n\nOr maybe you always received positive feedback from customers and were promoted to a team lead as a result. \n\nEven if your job involves something basic like data entry, you could highlight your accuracy rate or speed of completion.\n\nWith any of these though, you should be documenting your wins as you go along, either in a word doc or spreadsheet. If you can’t get metrics from your boss, track your own informally - as long as you can rationalize how you tracked/measured, you’re good.",
            "Last I checked, software doesn’t make decisions on its own. If your resume is getting rejected, you can be sure a person is doing it, not a “bot”.",
            "Generally speaking, you could either remove it entirely or minimize it. If it doesn’t leave a gap, safe to remove it.",
            "Not sure what you mean.",
            "Exactly.",
            "This content was removed for being inappropriate, abusive, or harassing. Note that continually posting content like this will result in a ban.",
            "Even though recruiters will claim ATS isn't throwing out resumes the way they describe the process and output of them is effectively that. Probability matching the exact words of the JD to the resume, if they put \"detail oriented report writer\" and you do the same it will generate a 100% confidence match. \n\nI did an AI cover letter for the first time where you give it the JD and your resume and it just smashes them together and I got a one and done 3 person interview as \"a potential good fit\" and am excited for it. 72 applicants btw this being a highly specialized role of SQL + Healthcare Subject Matter Expertise.",
            "Sure but then the ATS never put the resume in front of the right people.\n\n If you're sick of seeing these words rail against the industry that made using them a necessity, not the job hunters just looking to get through to an actual human being.",
            "Disagree. \n\nYou should ALWAYS reflect the language of the posting back at them. \n\nThis is taught in business workshops, contracting workshops, requirements writing, and so on. \n\nIf you don’t reflect back at least some of the verbiage in the job posting, I know you either weren’t taught those things or this was a generic application you sent everywhere. \n\nIf you don’t want your own words reflect back to you in resume, you shouldn’t have put them in there to begin with. ",
            "Agreed. During the interview you can share examples of being detailed about the work.",
            "Wtf you mean \"not at all?\" Are we seing the same job posts on the Web??",
            "Damn, sick response. Really set them straight",
            "lol 😂",
            "Agreed. When education is first it indicates a recent graduate. Once you actually work, your work experience is what matters,",
            "what do you think about certifications section? I am a PM, and I have pmp, a bunch of scrum certifications and AWS. My current resume order is: summary, key competencies, certifications, experience and then eduction. Context: 14 years of PM experience. \n\nAlso, I have hyperlinks next to each certification, which validate the certs. Is that a good move?",
            "\"To whom it may concern\" is how you address it.  Uploaded as an additional document to your resume.  Make sure it's well written and unique to the job you're applying for.  I don't know if any other hiring managers read cover letters, I just know that I do.",
            "To the hiring manager/committee at xxxx,",
            "Have you used LinkedIn to find the recruiter or hiring manager?",
            "It's usually going to be seen by a recruiter, a hiring manager, and then one or more interviewers so \"To whom it may concern:\" might be appropriate.",
            "I read them.  I always read them.  I'm more likely to read a cover letter than I am a resume.",
            "Statistically, you are right. Anecdotal evidence suggests that cover letters are read only 1 in 3 times.\n\nYet I coach my students to include one *EVERY TIME*.\n\nAnd I tell them, \"You can omit a cover letter when you can tell me precisely which 2 in 3 are not going to read it.\"\n\nAs evidenced by some of the other comments here, including a cover letter is a relatively easy way to stand out from most other applicants - which is exactly the point of a resume and cover letter.",
            "Granted it's been about 7- years since I was a hiring manager but on a typical job req I would get +100 applications and I could always count on one hand how many submitted a cover letter. However, I'm a weird person as most of my colleagues would let HR do the initial resume screen.  I would always do my own as HR weren't Engineers and couldn't really sort out the good from the bad.",
            "Yup I made the mistake once of recycling a cover letter and forgot to change the name of the company.  🤣😂",
            "These are great points.",
            "Oh okay, and one more question. How would you give advice to a person on what to put in his resume if he doesn't have any education background and working experiences? Like there's not much to put in his resume?",
            "ATS means AI scanner of resumes",
            "I get the frustration, but remember that your resume isn't just about getting past a piece of software. \n\nIt's about showcasing your value to a real person once your resume does get through. While keywords matter, demonstrating your abilities with concrete examples is what ultimately impresses hiring managers.",
            "> business workshops, contracting workshops, requirements writing\n\nYour first mistake was thinking that the hogwash these programs spew contain any merit.",
            "While mirroring keywords is valid, it's not the only indicator of a tailored application. \n\nMy advice is about going beyond buzzwords to demonstrate those qualities with concrete examples. \n\nThis shows a deeper understanding of the role and your ability to deliver results, rather than just repeating what the company wants to hear.",
            "OP wants us to change something that is standard in industry just because he/she feels bugged. Good luck with that.",
            "This recruiter has apparently never used indeed or LinkedIn \n\nTell me about these bespoke data science jobs that require 5 yoe in LLMs",
            "Couple thoughts on that. First, call out the PMP in the summary - it makes you much more hireable. \n\nSecond, about the hyperlinks, I don’t think that’s necessary. If they want them, they’ll ask for them. \n\nBest of luck!",
            "I am in healthcare IT so my certification section is vital so it gets its own page (page 1 says please reference attached document for certifications or some such, I have a colleague that has so many EMR certs he just has a link to his LinkedIn).\n\nI'm only reaching for CAPM level myself right now but wouldn't you have \", PMP\" in your name (and in your LinkedIn to begin with) as it is only listed out in certifications so that they have the year you got it and of course that you got it from PMI?",
            "Good to know! \n\nThis is the template I have been using: https://new.reddit.com/r/EngineeringResumes/comments/1azypoi/cover_letters_discussion_including_what_i_love/\n\nIt sounds like I probably need to update the template at this point.",
            "With some companies, it's not hard to go that route (assuming the managers and recruiters have a profile). When larger companies put out blanket requisitions for multiple sites, it makes it a little harder. \n\nRegardless, it's a lot more work for me than when the person writing the job includes, \"please address cover letters to: Mr Willie Accept, 123 Van Nays Blvd, Houston, CT\"",
            "Very anecdotal of you",
            "I hired for designer jobs. HR was horrible at selecting candidates. I think putting so much of the screening in the hands of HR is causing employers to miss out on qualified candidates.",
            "Only hiring teams work with ATS. I left recruiting quite some time ago and no longer have access to that. \n\nAn AI scanner is not the same as an ATS btw.",
            "Hundreds of applications.",
            "That's where the frustration comes in for a lot of people.\n\nWrite the resume to get past the ATS but because we don't out the kinds of things in you said in your original post we don't get past the human.\n\nOr, if the resume is written to get past the human recruiter it might not get past the ATS.\n\nThen, if it was written to get past the ATS and the recruiter, the hiring manager may not like it. Or, if the resume was written to appeal to the hiring manager, it might not get past the ATS or the recruiter.\n\nMany job postings are written based of the description for the compensation requirements or HR but not for the actual job.\n\nI was a hiring manager for a central plant engineer. State law REQUIRED the plant engineers to have a grade 3 or grade 1 license.\n\nBecause of corporate policy and the compensation review board the license was only allowed to be mentioned in the posting under recommended skills/knowledge despite it being a state requirement. As a result, applications from cooks at Chipotle and stock clerks at CVS were getting through both the ATS and the recruiter.",
            "[removed]",
            "ATS myth is nuts, and it gets encouraged by shady groups that want to sell you some sort of ATS-proof resume. (As I'm sure you're aware) ATS just creates a case with your resume attached along with the job applied for and loads the information it understands. The only way your resume gets ignored is if you answer one of the explicit questions about job requirements that sometimes come up on applications such as \"do you have a driver's license\"",
            "The point is that I already trust my resume to contain impressive enough work experience, achievements, skills, and education in order to make it past a round of human selection. But I still need to match enough keywords to make it past the software.",
            "It’s absolutely getting past a piece of software. You must be wildly out of touch in today’s job market.",
            "> While mirroring keywords is valid, it's not the only indicator of a tailored application.\n\nI don’t think I ever said it was. \n\n> My advice is about going beyond buzzwords\n\nThat’s different advice than you gave. You’re moving goalposts here. Including the reflections of the posting and then going beyond them is different advice than to “stop” using said words. ",
            "I’m just offering my two cents. If you want to keep doing what you’re doing, by all means, please continue.",
            "Got it. Thanks! I updated my summary and headline right away!",
            "Gotcha. Yes I do have the credly cert validation links in the Certification section on LinkedIn. \n\nThe hyperlinks I mentioned was in the certification section of the Word document of my resume. I have the LinkedIn profile link in my resume header, but I also want to provide  the certification links next to the cert in the certifications sections in my Word resume,  to reinforce the cert validity, if that makes sense.",
            "That's a really good template.",
            "I've never seen that on a job description.",
            "Unlike the original comment",
            "I was hiring for aircraft repair engineers, it was shift work and required someone who could operate independently.  I had a candidate that HR knocked out because he didn't have Aviation Experience.   Dude was an Engineering Officer in the US Navy he worked on a Nuclear Submarine.\n\nI told HR that if this man can learn how to operate and repair a Nuclear Reactor on Submarine I'm pretty sure he is fully capable of learning how to do it on something far less complicated like an airplane.",
            "He responded and deleted his comment, right? He's claiming he never contradicted himself and I see the comments skip two levels here and I'm pretty sure I read through it before",
            "How do you know what’s going on once your resume goes in the black box?",
            "Your post was removed for failing to meet the subreddit's quality standards.",
            "I don’t believe I moved goal posts. As a matter of fact, the post clearly explains that you should use hard data and concrete examples (I provided a short list of common metrics).",
            "Oh for sure I only meant to say that I think having a certification section is 100% the way to go in my experience, it's just that in healthcare IT we have a lot of PMPs and they're also certified in various modules and HM's want to see those too. \n\nI wasn't being clear on that and was honing on just having it after your name like any other professional title as it seems to have that level of prestige, I apologize. \n\nWhether it's first or last is a preference tbh but that's just down the resumes I saw in my time. I have it last because of the aforementioned healthcare uniqueness. That 1 page seems to be so important but I could not omit the certifications as it takes 1/4 of a page which is precious. I had to work around it and it seems to be working so far.",
            "I've seen it on about 10% of the ones that specifically asked for a cover letter, but those were only about 2% of the jobs I have applied for.",
            "That is issue with HR departments. They lack in depth knowledge in areas they are accepting resumes for.",
            "It's not exactly a secret, it's the entire point of an ATS. Here's Forbes magazine giving the advice to mirror job descriptions so you don't get screened out : https://www.forbes.com/sites/cherylrobinson/2024/03/10/changing-careers-how-to-get-your-resume-seen-by-ats-algorithms/\n\nMuch as I'd love to think of myself as an industry thought leader, I'm going to say that if Forbes is writing on ATS' tendency to screen out good applications, then I'm far from the only person to know this.",
            "The title is “\nStop using these words on your resume ”\n\nBut you’re not telling people to stop using those words. \n\nThey’re really ok to use. \n\nGot it. ",
            "Hey no need to apologize please. I really appreciate you taking time to provide your perspective esp of your field.  And yes I updated PMp on both LinkedIn and resume headers based on the feedback here by you and OP!\n\nI started adding hyperlinks for the certs in my resume coz I saw some other PM resumes in Google job threads and the certifications didn’t match their LinkedIn profile. I believe they just added them in the resume without actually obtaining them. Which is why I added the links in mine to differentiate. \n\nAnd having Certs  in the end with reference in page 1 sounds smart for your industry.\nWish you good luck in your search!",
            "I sell an ATS for a living. This is basically a myth, and you can tell by reading this article that she doesn’t have much knowledge of the space. \n\n[Here’s](https://www.reddit.com/r/recruiting/comments/1bw5pmn/does_your_ats_really_parse_throughfilter_resumes/) a fun thread full of professional recruiters wondering why this myth is so widespread.  ",
            "So you’re basing what you’re saying on just the title and ignoring the rest of the post. Got it. Good luck!",
            "I’m sure this isn’t why the dude above isn’t getting interviews, but the top comment there says Workday parses, and that’s a pretty big chunk of the market…",
            "Are there any particular other sections we should skip with reading this post? Maybe the third sentence? \n\nDo you see my point? You said \"don't use these words\" and now you're saying \"oh well, I didn't mean it!\". What else didn't you mean and how are we supposed to know that?",
            "Nowhere did I ever say to skip anything. Please read the post in its entirety. If you disagree, you’re free to continue on with your life business as usual."
        ]
    },
    "Roast my resume! I'm in Canada and I've applied to 500+ positions but not heard anything": {
        "title": "Roast my resume! I'm in Canada and I've applied to 500+ positions but not heard anything",
        "score": 19,
        "url": "https://i.redd.it/y0m8xn89uz7d1.png",
        "content": "I'm graduating next week. Applied to over 500 jobs with and without referrals. I don't get any call backs! \n\nI'm looking for anything in the Data Science/Machine Learning/AI development space ",
        "num_comments": 70,
        "comments": [
            "\n**Dear /u/GiantToddler256!**\n\n## Thanks for posting! Please read the posting guidelines on the [etiquette page](https://www.reddit.com/r/resumes/wiki/index/howtoparticipate) and make sure you're doing the following: \n\n*  Censor your personal information for your own safety,\n\n*  Add the right flair to your post, \n\n*  Tell us why you're applying (i.e., just looking to fine-tune, not getting any interviews etc.), and \n\n*  Indicate the types of roles and industries you’re interested in. \n\n## Check out the [wiki](https://www.reddit.com/r/resumes/wiki/index) as well as the quick links below for tips:\n\n* [Resume Writing Guide](https://www.reddit.com/r/resumes/wiki/index/faq)\n\n* [ATS-optimized resume templates available at Resumatic](https://resumatic.rezi.ai/signup)\n\n* [Thinking of hiring a resume writer? Read this first](https://www.reddit.com/r/resumes/comments/x3eg1e/considering_hiring_a_resume_writer_read_this_first/)\n\n* [Troubleshooting your resume and your job search](https://www.reddit.com/r/resumes/comments/128xo1c/troubleshooting_your_job_search_when_its_not/)\n\n* [Free Resume Template (Google Docs)](https://docs.google.com/document/d/1NyBW7UxkVDvqnaNMWgudNe5ttG4Bkr8W/edit?usp=sharing&ouid=113311260843142532597&rtpof=true&sd=true)\n\n* [Networking for beginners](https://www.reddit.com/r/FinalDraftResumes/comments/1cwp2x1/beginners_guide_to_networking_what_it_is_why_its/?utm_source=share&utm_medium=web3x&utm_name=web3xcss&utm_term=1&utm_content=share_button)\n\nIf you have **applied to 100 or more jobs** and aren't getting callbacks, please refer to [this post](https://www.reddit.com/r/resumes/comments/128xo1c/troubleshooting_your_job_search_when_its_not/?utm_source=share&utm_medium=web2x&context=3) for help.\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/resumes) if you have any questions or concerns.*",
            "I'm not an expert but it seems to wordy",
            "The formatting is hard to read, it looks like a wall of text. I'd suggest tabbing your bullets in a bit to offset them from the headings. Increase the font size of your headings also.\n\nThat said, you've got a lot of competition in your field. Networking is gonna be your biggest help.",
            "This is like reading the Economist or the Times with the exception that it has very little readability. The font is so small, my eyes are bleeding.",
            "How did you get into Applied Computing at Concordia with that kind of gpa? Did you give GRE",
            "One big thing is you need to make this easier to read. You have enough experience to not need completed courses or areas of interest / specialties, at this point your experience/projects should be doing the talking in these fronts. You have a lot of fluff through out the resume as well. I would consider wording this down and use the extra space to improve the readability. Also make sure it is ATS friendly, the experience and skills are pretty good. Assuming all 500+ of those roles you applied to you are qualified for, I am shocked you didn't at least get a few phone screens.",
            "If you remove the flower-sorting project, the rest of the resume will be much easier to read because there will be a lot more space. So many people do flower-sorting that it's not adding anything to your resume because you have other, better experience.",
            "Golden Key means absolutely nothing. \n\nI was invited multiple times. It’s not a high threshold.  \n\nIt’s a straight money grab. It’s cringe to have on a resume.",
            "Technical skills first since you have employment. \nNext I’d do Work Experience and then Education. For Education section just include your program name, school and year graduated (don’t even need start date). The other stuff with achievements and courses don’t matter enough to keep. \n\nRemove the underlines on the first project bullets. Also in general for the projects just do a short summary of what it is and what languages or tech you used. Interviewers will be asking you to elaborate more on your project in a call or interview. You aren’t hooking them enough because it’s too long and wordy. \n\nChange academic and personal projects header to just projects. And you don’t technically have to include a date for those. \n\nFix the tab formatting for sure. Increase the margins so you can fit more on one page. This could definitely be organized better, increase readability (spacing and reduce wordiness) and not feel overwhelming. You got this!",
            "4 - 5 points should be enough for each work experience.",
            "Put location underneath your time period you worked/studied",
            "I dont see language. Since you are applying in montreal you should be able to speak in french and english.\n\nFor some recruiters , its important that you can speak french. \n\nAs other said, keep short, you can still optimize some stuff.\n\nAnother thing, some bullet point sound like bragging because you did it once, its more of an achievement rather than a part of your periodic thing you do.\n\nAlso , please adapt your resume for jobs that you have a very very high interest, do not hesitate to fine tune it for that specific job, especially when it comes to the technologie that you are using, removes stuff that is not necessary for them.\n\n\nAlso , the place where you did your internship, won’t they be interested in din hiring you full time?",
            "Tech is in ruins and we're getting 1000s of resumes from very qualified candidates rn. No way I'd read this for a Jr dev. Shorten it alot. Academic projects etc nobody cares. If you did all that to put on your resume and stand out you wasted your time, shouldda been drinking beer. 😂",
            "Too crowded, too small font size",
            "Too busy, too wordy, hard to read.",
            "Don’t have one resume unless it is resulting in a flood of interviews. You say you have applied for 500 interviews and not heard. Try coming up with 1 real and 4 alternative fake resumes and apply to the same job, obviously using different email addresses. See which version gets responses. Use it to apply for other jobs you really want. Good luck. Don’t give up.",
            "why are u underscoring so many words?",
            "Check out the books the 2 hour job search and the job closer by Steve Dalton",
            "A lot of words lol",
            "This is DENSE. Pay attention to your white space; there should be at least some of it. \n\n\nWhat are your margins? I'm guessing you used either narrow or a custom margin to squeeze this much text into one 8.5×11 page. Please don't. Use either moderate or normal margins.\n\n\nSome things you can cut: \n\n\n      - your courses if they don't specifically mention the topics in the job posting.\n\n\n     - Your personal projects if they're not relevant to the job posting. The interview is the perfect time to talk about projects.\n\n\nYou can also make your resume 2 pages if you feel like everything here is necessary. Just include some white space.",
            "Is this font size 9? The reader shouldn’t have to refill their coffee mid read/skim.",
            "There’s just so much information on here. If I were a recruiter I’d want to read a resume that was concise and closely matched the job description.",
            "The order of your sections should be Technical Skills, Work Experience, Education, Projects (because you labeled them personal and academic, this section should follow your Education, BUT if any of the projects is work-related, list them *before* your Education), Certifications (see next paragraph for a note about this), and then Awards & Achievements.\n\nI would add a brief summary *before* the technical skills so it flows nicely, and you can reference your AWS certification, if it’s active. It’s hard to tell because the end date makes me think you *didn’t* recertify it in 2023 and, if that’s the case, I wouldn’t list it on your resume at all. If it *is* active, then definitely list it in a Certifications section, but only with the May 2020 date to show when it was earned, and reference it in your summary, so it’s still prominent for a recruiter to see.\n\nYou can save a lot of space in your experience by revising your bullets. You’ve done a great job of quantifying your achievements in each position, but you can share them more effectively in fewer words. Each bullet should only be one sentence. Also, keep only the most impactful bullets, and consider leading with the impressive bit. For example, try, “Slashed recruitment costs by over 75% by leveraging advanced analytics when leading strategic management of data pipelines for five nationwide clinical trials.”\n\nFor Education, list the name and type of your degree earned, the institution where you earned it, the location of that institution, and the date you earned your degree. Everything else is not needed.\n\nFor Projects, this may be a matter of personal preference, but I’d like to see a couple of sentences explaining what the outcome of the project is in layman’s terms, and then a separate line the begins with “Technology Used:”, followed by a list of all the languages, frameworks, APIs, etc used to build the project.\n\nCertifications: I already mentioned.\n\nAwards & Achievements: No notes.\n\nOverall notes on formatting:\n- Don’t underline your headings. Your resume has quite a few links, so underlined formatting everywhere else confuses the eye.\n- Make your left and right margins even and at least 0.35” (though 0.5” would be better).\n- Increase the indent of your bullets.\n- Make the font size of your section headings slightly bigger than the rest of your text, and make sure the size of the rest of your text is no smaller than 10pt.\n- Play around with line spacing options to add more white space in each section. White space makes it visually less daunting and easier to consume.\n- You probably could get this done in one page, but don’t worry if it’s more than one page. Just make sure that if the page breaks in the middle one work experience, one project, or any of the smaller sections, you move that content to the second page.\n\nYou’re an absolute star, and I wish you luck, though once you update your resume, you probably won’t need it!",
            "I'm not reading all that.",
            "Can I DM you ?",
            "I'm no expert, but wow is that a lot to read. Seems kinda overwhelming to me.",
            "The market is bad keep trying resume seems to be okay don't feel bad but you can always improve like keeping work experience at first and you seem to have job on march why do you want to change?",
            "Managers are busy. They don’t want a story book to review a potential candidate",
            "Shorten everything. Use only keywords (google: resume keywords). Try to have different resume versions for example a “sales” resume, “management” resume, “customer service” resume. In each one, keep the experience and education relevant to the “theme”. this will keep them shorter too. You can choose your own themes depending on the areas you excel on. That being said, memorize everything youre deleting because you should be able to expand on all the points on your resume",
            "I’ve read several of the comments and I’m not sure I agree that two pages is the solution. The last two sections should either be left off or condensed down by removing the details. Once you’ve done that, you’ll have room to adjust the formatting on the important sections remaining. I’ve read many hundreds of résumés and two pages is fine, but I personally believe the more information you provide, the more it should directly relate to the position you’re applying for and not just be fluff. Good luck OP!",
            "Idk if it helps but the margins seem off, maybe you can increase them a little, the ATS will still detect your KW\nAs it’s been said before, try to reduce by a lot everything unrelated to the job description/relevant to the field you’re applying to",
            "Your margins are too slim/text is too wide, it takes away your other formatting and readability \n\nRemove the underlines for non-bold items\n\nActually remove all underlines. Just have bold or maybe italics for position names.\n\nI implement a style I refer to as cascading text. Make the company line the biggest text, and cascade to slightly smaller text for bullets and everything underneath. Decrease by 0.5 font each line. It makes the resume visually flow better. For example :\n\nProfessional experience (bold/11 font)\n\nCompany name and  position held (italics/10.5 font)\n\nBullets (regular text/10 font)\n\n\nYou need to adjust the sizing and features but I think it would greatly improve this",
            "If i were hiring, i wouldnt like how you describe your current job. I know recruiters say 'quanitify everything' but that seems like bullshit to me. Theres no way to quantify most things without just making some shit up and hoping whoever youre saying it to is too dumb to understand you made it up. Problem is that the final layers of hiring staff are not dumb enough to fall for it. You might trick the recruiter into passing your resume along, but when a person who works with data gets to see it, they will be more confused than impressed. They might think you made up the '20% increase in data quality'. especially since you just chose 20 instead of a number that would make more sense like 18.76% or something that could come from a real analysis of company data. They may think you made up the 95% accuracy in auditing machine learning data, especially because its not obvious what any of that means. are you auditing training dataset? outputs from tests? outputs during prod? What exactly are you describing here? How did you determine the failure rate to come to this accuracy rate? If you dont know the exact number and how to prove it, just dont say a number.",
            "Bro my resume is very similar to yours  is it really that bad for indians in canada right now?",
            "Ummm, do you suggest shortening the job descriptions?",
            "I've tried this. But it's very difficult to condense into one page after doing this. \n\nAre one page resumes compulsory? Or can I try going into 2?",
            "Yep. I'm expanding this to 2 pages. Will look better (hopefully)",
            "Honestly Concordia was a safe school and was affordable compared to other options in Canada.\nIts why I'm there\nIt wasn't that difficult lol",
            "This is Gold. Thank you! \nLooks like I have a lot of clean up to do.",
            "Aight. Makes sense. Do you think I can add a better project or should I remove it completely?",
            "Yes okay. I'm looking to remove stuff anyways and this seems like a first to go atm",
            "This is Gold! Thank you so much! \n\nAnd as for the number of pages, do you suggest just the one or should I look into 2 pages?",
            "Yep. Makes sense.",
            "Good note. Will do that",
            "I've not picked up French. So I've not added it.\nBut I'm actively looking for jobs ideally in the GTA.\n\nAlso, could you point out an example of which points sound like a brag? I didn't intend on this but if it does I'll make the change.\n\nFine tuning resumes is pretty tedious but you're right. I'm going to look into this from now on.\n\nThe place I did my internship was offering me an extension on my internship but not a job offer. I'm not sure why but this was the case for most interns in my batch\n\nThanks for the pointers!",
            "Damn. I didn't have a lot of experience in the fields I wanted to apply for the job. Hence the projects.\nI didn't really build anything for the resume but I thought it would add some value. But good note.\nGrabbing that beer now",
            "exactly you dont have to say everything ,use the key words similar as with the job that you want to apply for. Some people say that dont send the same resume etc but idk. And maybe you can add some lines between education-skills etc. There're some examples in this subreddit take a look at 🙏🏻",
            "2 pages for Canada, 1 page for US",
            "It's been the last 5 years that 1 page is required. It used to be that you just made a resume and sent it to 500 companies and someone would hire you. You always included what you're most proud of. Now competition is thick (especially in your industry) and everyone is too busy to bother with the hiring process. You assume you get 30 seconds of your hiring manager's time and you need to wow them by only saying the right things; target so that when you submit this resume to this job it says you can do the job. Formatting wise, education only goes on top when you have nothing else. Content wise, say less; you're saying what's most important to you not what needs to be said. For example, each of your award titles doesn't require a description also.",
            "I've always had a 2 page resume, and I've always been told 1 page resumes are for like, high school kids only.",
            "its probably best to just make it more concise, 1 page is usually better",
            "And no. No gre",
            "I suggest removing it and not adding in anything else. Two projects plus the two achievements is plenty considering you have actual work experience and a masters degree.",
            "One page you can totally do still. You are at the start of your career so one page. If you were like mid career then two is okay but go for one page",
            "Led the strategic data of management pipelines 5.\nIts not something you are doing actively on your job thats the one im talking about.\n\nI must ask this but have you ever applied for cgi by any chance?\n\nOr consulting firms?\n\nEdit: i respect the hustle.\n\nIf you are trying to get to gta area, i dont know if they discriminate for based on phone number region or addresses.\n\nI can definitely tell you this. Please give montreal and quebec city a chance. Your technical abilities are not to be ashamed off. And i believe you can definitely find something here in quebec rather than in ontario.",
            "That last bit I was just teasing you. Keep that stuff just have it in single line bullets. Don't get discouraged. Other than yeah a bit long nothing is wrong. It's a terrible job market rn.",
            "Thanks! Will look into it",
            "Wow. Gotcha. I was told if you've got less than 7 years of experience then 1 page resumes are your only option. \n\nThanks!",
            "Gotcha. I'll fix that. \n\nI've applied to CGI about 2.5 weeks ago. Still haven't heard back from them though. \nSame with consulting firms. \n\nIt's honestly frustrating when you don't even get a rejection for the company you applied for. \n\nAlso, I really do want to give Montreal a chance. I love the city and want to stay here. But I think it's Montreal not giving me a chance (I've not picked up French for a working proficiency level yet). I just haven't seen a lot of positions that fit my profile that don't require being bilingual (compared to GTA)",
            "That's nuts. As someone who has done hiring a bit, I'll tell you I've never even seen a 1 page resume.\n\nReadability is a priority over page count. If you're at 3 pages maybe cut some words but 2 is very, very standard.",
            "Which country? The US is almost always single page these days. It's all the rage right now",
            "Got it. I'll work on getting this better today!",
            "Canada, like OP.",
            "I completely disagree.  I have been vetting candidates and we tend to find those who provide 2-page resumes have stronger possibilities for employment than 1-pagers.",
            "Don’t listen to this person. I do a LOT of hiring and it’s proper business etiquette to keep it to one page, especially if you’re just graduating and have barely any experience. Having two packed pages like this with such little experience gives the impression you think super highly of yourself in a bad way. It",
            "A resume should be long enough to list the revalvant experience and accomplishments, but short enough to just get to the point.\n\nDepending on someone's job history and experience, that can be one or two pages.",
            "One page, two pages...who should we listen to?\n\nOh man...this little melee commentary fight is astonishing for me",
            "Yea, I have a decade+ of experience and still keep it to one page. As you get more experience, you just strip out older bullet points. Really old jobs are going go be less relevant to the roles you're applying for as you get older and more senior."
        ]
    },
    "Critique my CV/ Resume - Struggling to secure a job. UK based.": {
        "title": "Critique my CV/ Resume - Struggling to secure a job. UK based.",
        "score": 1,
        "url": "https://www.reddit.com/r/resumes/comments/1dlvfbj/critique_my_cv_resume_struggling_to_secure_a_job/",
        "content": "I'm an accomplished EA with nearly a decade of experience. I've recently relocated to North West UK from London and am struggling to land an EA (or PA) job role. There does seem to be quite a few roles out there but I'm not getting a response from my applications. A friend of mine told me it might be due to lack of funding and the next quarter (Starting in July) may be more prosperous.\n\nI would love if some people were willing to give some constructive feedback on what my CV is lacking with examples of how to better word my experience.\n\nIt's competitive out there, but I know I have the experience and capabilities - I just need to really impress and stand out, which I fear I'm not doing. I am of course adapting my CV to each job role I apply to and fine tuning where necessary, rather than sending out a blanket CV. The one below is my latest CV with personal details redacted. I have also left out my cover letter as it's the main CV I need assistance with - so ignore page numbers.\n\n  \nI also worry that my last role was 1.) over a year ago (I've been travelling) and 2.) the job title wasn't EA/PA, although it was an admin role.\n\nPlease help!\n\nhttps://preview.redd.it/v2z78ed4h48d1.png?width=998&format=png&auto=webp&s=9cfa91655ff6dc936ffd61cc84016af4d5c38795\n\nhttps://preview.redd.it/1a9zo4u5h48d1.png?width=992&format=png&auto=webp&s=bca84652231f8142de72867571f091593ea5d1e4\n\nhttps://preview.redd.it/viass7f6h48d1.png?width=978&format=png&auto=webp&s=673f1baf6dfd766706e09b44475825bd27b9ff13\n\n",
        "num_comments": 1,
        "comments": [
            "\n**Dear /u/EAUK2024!**\n\n## Thanks for posting! Please read the posting guidelines on the [etiquette page](https://www.reddit.com/r/resumes/wiki/index/howtoparticipate) and make sure you're doing the following: \n\n*  Censor your personal information for your own safety,\n\n*  Add the right flair to your post, \n\n*  Tell us why you're applying (i.e., just looking to fine-tune, not getting any interviews etc.), and \n\n*  Indicate the types of roles and industries you’re interested in. \n\n## Check out the [wiki](https://www.reddit.com/r/resumes/wiki/index) as well as the quick links below for tips:\n\n* [Resume Writing Guide](https://www.reddit.com/r/resumes/wiki/index/faq)\n\n* [ATS-optimized resume templates available at Resumatic](https://resumatic.rezi.ai/signup)\n\n* [Thinking of hiring a resume writer? Read this first](https://www.reddit.com/r/resumes/comments/x3eg1e/considering_hiring_a_resume_writer_read_this_first/)\n\n* [Troubleshooting your resume and your job search](https://www.reddit.com/r/resumes/comments/128xo1c/troubleshooting_your_job_search_when_its_not/)\n\n* [Free Resume Template (Google Docs)](https://docs.google.com/document/d/1NyBW7UxkVDvqnaNMWgudNe5ttG4Bkr8W/edit?usp=sharing&ouid=113311260843142532597&rtpof=true&sd=true)\n\n* [Networking for beginners](https://www.reddit.com/r/FinalDraftResumes/comments/1cwp2x1/beginners_guide_to_networking_what_it_is_why_its/?utm_source=share&utm_medium=web3x&utm_name=web3xcss&utm_term=1&utm_content=share_button)\n\nIf you have **applied to 100 or more jobs** and aren't getting callbacks, please refer to [this post](https://www.reddit.com/r/resumes/comments/128xo1c/troubleshooting_your_job_search_when_its_not/?utm_source=share&utm_medium=web2x&context=3) for help.\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/resumes) if you have any questions or concerns.*"
        ]
    }
}