{
    "‘Rick and Morty’ Season 8 Coming in 2025, Anime Series Reveals New Footage": {
        "title": "‘Rick and Morty’ Season 8 Coming in 2025, Anime Series Reveals New Footage",
        "score": 2240,
        "url": "https://www.hollywoodreporter.com/tv/tv-news/rick-morty-season-8-date-anime-footage-1235803545/",
        "content": "",
        "num_comments": 297,
        "comments": [
            "I could be dead by then.",
            "![gif](giphy|Uue0deVjVil0vtMoWg)\n\nMan, not getting a new season within a year is going to feel weird, but honestly, it's what it used to be like, Rick and Morty isn't an easy show to make, and a 2025 release makes me more excited about what they're planning for this \"10 season arc\"",
            "Huh I thought they already ended the script for season 8. Oh well, gonna wait a little more",
            "What ever happened to less waiting between seasons?",
            "And I'm still here waiting for season 7 to come here in my country",
            "Just a reminder that we had to wait 3 and a half years between season 3 and season 4.",
            "Even more reason to be excited for 2025. While I wait for GTA6 to install, I can watch season 8 of Rick and Morty",
            "Ugh. It's JANUARY 2024.",
            "Damn. Back to two year breaks.",
            "Fuuuuuck that’s too long to wait",
            "Really hoping this Rick and Morty anime has an English Dub.\n\nThe japanese feels unwatchable",
            "Interesting. They've been releasing one season a year for a bit now. I wonder if the writers strike impacted the release date.",
            "Tune in to Rick and Morty Season 8 in a year and half or longer.",
            "Imagine if GTA VI and Rick & Morty season 8 drop on the same day, it would be like humanity’s greatest day.",
            "Hard to believe we're on our way to Season 8. Doesn't even feel that long.",
            "Hopefully it is a January/ February release but it'll probably be Summer",
            "Season 8 in 2025 while we get the anime this year? I’m okay with that.",
            "Aw jeez",
            "Anyways, Rick and Morty is not the same anymore and it’s kinda boring now with the new voices, episode ideas and stuff like that",
            "If Dan Harmon gives us more gems like unmortricken & fear no mort it will be worth the wait",
            "Oh man. I have never been more disappointed in my life.",
            "I’m so annoyed they are wasting any time on an anime series. Who the fuck asked for that?",
            "I thought they were going to stop with delaying seasons, I thought that was one of the reasons the series got greenlit to Season 10",
            "The anime looks awful.",
            "Show died after season 6. Season 7 was terrible",
            "They game of thrones’d it like 2 seasons ago (I don’t consider the show Rick and Morty post-roiland). \nSeasons 1-3 are goated and beyond that is a slow and long spiraling descent on Pirates of the Pancreas. \n\nFin",
            "I'm totally fine with that, considering the average time between seasons has always been around 14 months (besides season 3), this actually makes perfect sense, honestly I'm fine with being patient if it means the content will be good.\n\nnot a big fan of the whole anime thing, but it has its audience so I guess its not really for me.",
            "if they’re gonna wait two years to release a new season, can they please try not make episodes like the S7 opener and the ice-T sequel?",
            "if season 8 doesn't come out right now I'll kill myself on live tv",
            "Great! Anime series will be interesting, different and unique, and then 2025 there’ll be season 8. Rick and Morty doesn’t need an immediate season 8 it can wait a year or so. Don’t complain for a year wait for an entire season. Not that bad yall. Gives the animators a break also / more time to make better content. It’s a good thing.",
            "[removed]",
            "2025? WTF?!?! That's way too long to wait...",
            "I'm getting too old for this shit!! \n\n(Not cartoons, the long wait between seasons...)",
            "Still hope they’ll stretch it to 22 episodes per season like the Simpsons did",
            "Why does his face look like that? What happened to his face? Someone call the plastic surgeon, I got him on speed dial.",
            "Almost forgot this show existed...jk XD",
            "I can wait",
            "Remember when they got that contract extension and promised that they’ll have seasons coming out in a reasonable time now? …Figures",
            "[removed]",
            "Sick of waiting ",
            "Are they still keeping rick voice?",
            "Where can I watch the anime series?",
            "Yay",
            "I got a feeling I might not like this😭",
            "They’re still gonna be in the hole for the whole season im calling it",
            "Noooo they did Rick so bad in the anime style 😭 they de-hotified him he’s so hot as a cartoon",
            "Is the anime gonna be on adult swim?",
            "This show is f\\*okin amazing. Can't wait to see more. Rick and Morty... 100 years !!!! \n\n![gif](giphy|l41lI4bYmcsPJX9Go|downsized)",
            "If there’s one thing about season 7 it’s that they still had some fantastic episodes, some of the best in the show, but they had the most filler since season 4 (Poopy Got His Poop Back, Air Force Wong, Wet Kaut American Sunmer, Numericons) that honestly felt rushed out the door IMO.\n\nI’d be happy to wait longer for better quality, more thought out episodes.",
            "This might be good",
            "Real fans will say too soon",
            "Hopefully someone animates something better between now and then",
            "That's kind of ridiculous",
            "I just want another interdimensional cable ep",
            "7 is already unwatchable due to the new voices, and they're continuing this shit? just let it die, or bring back the soul of the show.",
            "perfect i barely came back and on season 6💯",
            "Good. I hope it turns out a lot better than 7.",
            "Wait, there’s gonna be a anime?!",
            "[deleted]",
            "are they prolonging the seasons to make rick and morty last longer because AS has literally nothing else good to watch",
            "animation looks so ass...\n\nseems to take a more philosophical route. who's writing this?\n\nif it's harmon's writers trying to sound smart, I'll pass.",
            "[deleted]",
            "Without the proper voice actor, the show has never felt right to me. As far as I'm concerned, the show died when the situation happened.",
            "Lol this show has been dead for years now \n\nI can’t believe people still watch it with that ridiculous new voice for Rick it’s insane",
            "Sukunakutomo watashi no baai wa tomokaku, (BARFFF)  \n\n\nEdit: Apparently you all misinterpreted what i meant. I was saying, after he said his last line in the trailer, it sounded like he barfed. i wasnt \"barfing\" at this or the dialouge. jeez.",
            "last season sucked tho",
            "No Justin Roiland = No show",
            "Didn’t they release a new episode on April fools day?  They’ll fuck with us and give us stuff this year",
            "NEW SEASON OF RICK AND MORTY IN…. I don’t know…. a year and a half??????",
            "100 years Rick and Morty!",
            "I really want TRIGGER to animate an episode of Rick and Morty",
            "Like the show, but the year long plus breaks are annoying. Hell last season I didn't even realize it came back until like 3 eposides in.",
            "Why? 7 looks terrible...",
            "Idk why but when I read most of the comments it sounds like rick",
            "good hopefully they'll take their time and hone in on what made S7 produce some of the best R&M content since S2  and figure out and fix what made S7 some of the worst R&M content ever.",
            "The anime looks like it's gonna be chock full with your typical Japanese navel gazing that we grew out of when we were around 15 y.o.",
            "The new voices suck… just watched season 7 episode one.. had to turn it off because it was annoying.",
            "![img](emote|t5_2u4lp|16718)",
            "i personally hope they do better season 8 so many episodes in season 7 i didnt like but that one singular episode carried the season",
            "Why show is terrible now.",
            "I love Rick and Morty and can’t wait.",
            "You could be dead by this afternoon, this means absolutely nothing.",
            "Yea that’s how life works",
            "bruh 2025 is going to be a blast,\n\nDragon ball budokai tenikachi\n\nGTA 6 and now Season 8!",
            "You could be dead by the end of This day",
            "With a bit of luck",
            "Well this turned into a dark worm hole of philosophical depression.",
            "This is always not far from the minds of Rick and Morty fans….",
            "[removed]",
            "Or the show is. I mean I have no idea what it's ratings are right now, but the past 2 seasons I've seen some very heavy declines in participation in episode threads on this sub. Back in season 2, 3, 4 we used to have like 8k+ karma on the live thread, with the post episode thread hitting that same number in an hour. With season 5 being pretty mediocre and 6 almost as bad, I saw a massive drop in those threads. Post episode discussions were hitting like a few hundred karma and barely any comments after like a couple hours. Gone were the thousands of karma and comments of old.\n\nIt honestly all started with season 5, that's where I saw the numbers tank...",
            "Yeah cuz I'm gonna kill you",
            "9 more seasons morty!",
            "Didn't we used to get 18+ months between?",
            "Try being a Venture Bros fan.",
            "The whole “10 season” arc thing is already counting the 7 seasons we got right? Not a whole new 10 seasons batch",
            "The thing that confuses and kind of irks me is that supposedly the long waits between the older seasons had a lot to do with getting the writing done, but they've been ahead at least a full season on the writing for like 2 years now? So what gives? Things should have been speeding up not going back to slower.",
            "I guess I don't know why it takes so long to make a \"show like Rick and Morty\" other animated shows have one season a year. I'm not trying to be snarky. I'm just curious.",
            "Hopefully it will be early 2025.",
            "It will probably be early 2025, so about a year… I hope",
            "I was lucky that I got into the series when I did…I only had to wait for Season 3 from 2015 ….🙄\n\nI was honestly surprised at how quick the last few seasons were released, I got used to waiting at least a year and a half, i did not like that break mid season thing they were doing though. Still not as bad as the Season 3 premiere tease. It was genius from a marketing standpoint but it was cruel from my severe lack of patience standpoint.",
            "I mean the anime is coming out this year at least.",
            "I think a lot of shows got delayed by the writers strike. At least this season was supposed to be on schedule, instead of like, a year and a half, or maybe longer… for the early seasons",
            "No anime is easy to make lol. Just be glad it's not like the gaming industry waiting damn near a decade for a game to release......... waiting a few more months (well several) for season 8 will be a cake walk",
            "It's a simple enough show to make. They're just taking it in with lots of other projects instead. Solar Opposites, Krapopolis, Strange Planet, and more.",
            "> isn't an easy show to make\n\nI dont get why people are so defensive of this trash heap. Even the highest quality GOAT shows can stick to a release schedule/cadence. Without Roiland this show needs to fade out into the cosmic dust.",
            "It's not any harder to make than other cartoons in the same realm.",
            "Dan Harmon: They're Drawing it!",
            "Reddit told me there wasn’t gonna be more waits. Also if you listen to the fans they ended 8 and nine",
            "Since season 4 we had a season every year , the wait until 2025 will be long",
            "The strikes this summer pushed everything back",
            "Writers’/actors’ strike happened.",
            "Strikes are kinda out of their hands.",
            "Kind of an uninformed take. We **already have** less waiting between seasons.\n\nThey didn't get a wish granted that there will never be a bigger pause between seasons, they made a statement that they'd apply reasonable effort.",
            "There was a writers strike. Were you in a coma",
            "That’s when the overlords have the upper hand. Somehow, maybe clout, they can make them wait until it’s ready.",
            "I'm a little late to this, sorry, the writers strike pushed release back a bit",
            "Getting something of quality would be better than something faster",
            "The writers strike happened.",
            "I genuinely don't want a new season every year. If they gotta take their time to create a new season, so be it.",
            "[Geeeeet USED to it!](https://youtu.be/cAvOJAohVDc?si=XMm0fQcX4aWueuum)",
            "Free vpn app\n\nWhat's a country?",
            "Just came out on Hulu today in the US.",
            "[www1.kiss-cartoon.com](http://www1.kiss-cartoon.com)\n\nYou can thank me with feet pics (not a weirdo just enjoy looking at them) /s",
            "[https://www.wcofun.net/rick-and-morty-season-7-episode-1-how-poopy-got-his-poop-back](https://www.wcofun.net/rick-and-morty-season-7-episode-1-how-poopy-got-his-poop-back)",
            "Jesus Christ that’s insane to think about. I wonder why it took so long between those seasons",
            "Your reminder is wrong though. Season 3 aired from July to October 2017 (besides the April fools premiere episode). Season 4 started November 10, 2019. So it was barely more than 2 years between the end of season 3 and the beginning of season 4. Season 2 and season 3 also had a 2 year gap. We've never had to wait more than 2ish years for a new season",
            "that’s crazy because season 4 truly was not one of the best, definitely a step down from 3. 6 and 7 were great tho",
            "Season 8",
            "I think it’s just because of the strike.",
            "Yeah Reddit likes to pretend it’s necessary but it’s not and I remember when this wasn’t normal.",
            "I think it'd be absolutely *hilarious* if they go for big name anime dub voice actors instead though.",
            "How dare you, sub is always better than dub",
            "That's what the article says",
            "it’s always Summer.",
            "To be fair, January is in summer in Australia 🤷🏽",
            "Shut the *burp* fuck up, Morty",
            "You must have led a very fulfilling life until now...",
            "Lucky you.",
            "It’s made by completely different people, they aren’t “wasting their time on it”. I enjoyed the anime short so I’m pretty sure I’ll enjoy this.",
            "1: The anime series isn't being made by the same team, it's being made by a Japanese team.\n\n2: Me, I think it's cool as fuck, and seeing rick and morty in other mediums is really fun, gives Rick and Morty, a really cool concept, a way to explore new ideas, plus a Rick and Morty anime just kinda works, everyone loved the shorts.",
            "They aren’t wasting time. We’re getting MORE Rick and Morty. If you don’t like anime, don’t watch it. But it’s absolutely not a waste of time and it probably doesn’t affect the regular series release dates. \n\nIt could end up being really interesting, it might take place in another timeline, they might make it more serialized and lore driven. And the best part is, it wouldn’t affect normal Rick and Morty at all because of the way the multiverse works. I will never understand why people love shutting things down before they know anything.",
            "I'm genuinely so excited for it, the anime short by the same people was fantastic",
            "[deleted]",
            "It was done and probably written by a different team or studio. The anime of it was very popular so many people could be asking for it. Plus more Rick and Morty to watch is great",
            "What is Justin Roiland doing since those charges got dropped?\n\nEverything he is involved with is excellent.",
            "Article says the writers strike was a big part of the reason for the delay.",
            "Glad im not the only one who hated the ice T episode",
            "Hey /u/-Kaiel108-, due to a marked increase in spam, accounts must be at least **3 days** old to post in r/rickandmorty. You will have to repost once your account reaches 3 days old.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/rickandmorty) if you have any questions or concerns.*",
            "How dare you my face is fine \nLook at your side kick, a glimpse in the mirror might do them some good. But not like Story Lord... oof. What a mess (tragic flash back)",
            "Writers strike ",
            "Hey /u/Humble-Ask-3440, due to a marked increase in spam, accounts must be at least **3 days** old to post in r/rickandmorty. You will have to repost once your account reaches 3 days old.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/rickandmorty) if you have any questions or concerns.*",
            "Yeah, its honestly great with the amount of time they are given since I believe the 1 year cycle was too short for every episode to be a hit/finalized which saw a general decline in overall season quality past 3 (4 is kind of an enigma since it had a 2 year but from then onwards the seasons were less consistent, despite 7 being in my top 3 favorites purely due to the highs)\n\nEven if its due to the strikes, the writers are given much more breathing room to cut and add as they see fit, and the anime gives the VAs something to experiment with since they dont have to attempt to imitate Roilands mannerisms due to the different style. I think itll be good for the VAs and the writing staff since they’ll have more to work with, which will result in a more cohesive story, its got me pretty excited for the future lol",
            "I love the smell of fresh bread.",
            "So strikers are to blame but not the network?",
            "Does no one read the article. The writers strike caused the delay.",
            "Hey /u/skuzzy99, due to a marked increase in spam, accounts must be at least **3 days** old to post in r/rickandmorty. You will have to repost once your account reaches 3 days old.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/rickandmorty) if you have any questions or concerns.*",
            "It's insane that you say that the show is dead, but you are still on their Reddit, plus the last season was good and it's the most popular animated show on HBO Max in Europe and the most popular Adult Swim show and one of the most popular comedy shows on cable ",
            "No one cares about Justin Roiland",
            "Holy shit, people still think this stupid shit? That’s really pathetic lmao. Idk why you’re defending him, JR isn’t going to fuck you, you’re too old",
            "Found Justin's account",
            "Roiland was still voicing for the 1st episode bro, the voices change in the SECOND episode, so, yeah, umm, new voices bad I guess lol",
            "Come watch tv",
            "Nah I’m an actual alcoholic.",
            "Life is meaningless. What if the reason we can't find the meaning of life is because we have been searching for something that doesn't exist all along?",
            "Who cares",
            "[removed]",
            "Dude I didn't know any of this until I got on this thread. 2025 is hopefully goat",
            "Hey /u/themia212, due to a marked increase in spam, accounts must be at least **3 days** old to post in r/rickandmorty. You will have to repost once your account reaches 3 days old.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/rickandmorty) if you have any questions or concerns.*",
            "Nearing the middle to end of season 7, some of the more high standing episodes have started to bring some attention back to the show. With the Rick prime/evil Morty lore related episode being the strongest hook for viewers that were out of the loop to come back to the show. People, even if they stop liking the show or forget about it a bit, will still generally come back to watch a story arc be completed so they get the gratification of having finished viewing all the important bits of lore in the show. Now people will be able to wonder: what is Rick going to do next? What will happen with evil Morty? What possible new plot lines and arcs could occur? And since they announced it will come out in 2025, taking longer then usual, people are going to get more hyped for it, as they will have high expectations and want to see what will come from this long wait. I also heavily doubt adult swim won’t be hitting heavy with teasers and many advertisements to get more people to remember Rick and Morty exists and “hey I can watch that new season soon, took a bit longer then normal to make it, I wonder what the episodes are gonna be about”",
            "I swear people on this sub are so defensive over nothing. This is literally just a fact. Nothing he said was in bad faith. The show has been losing interest since season 5. People refuse to acknowledge when their favorite shows have bad episodes or negative reception due to mediocre episodes. \n\nI wouldn't say the show is dead but it's not a terrible catastrophe to point out when a show is declining. If anything we should be talking about it to prevent more sperm and numbericon episodes.",
            "Downvoted for speaking facts?  Reddit moment",
            "97 more years",
            "That was like 4 seasons ago, so, idk, like 5 seasons left... maybe... until rick gets the sechwan sauce (idk how to spell, sue me)",
            "Based Charmcaster pfp user",
            "9 more season 2-3 years apart yay! no cartoon is that difficult to make",
            "*3 more seasons. That's all that is confirmed.",
            "I think there was one point where we went at least 2 years without a season. It was rough",
            "Im so used to the wait idec",
            "I still haven't watched the movie because the thought of doing so is making me depressed.",
            "They have an order for 100 total episodes, and since they do 10 episodes a season, 10 seasons total. So yes, including the 7 we already have",
            "The article pretty clearly says that the delay was caused by the 5 month long writer's strike.",
            "I thought the long wait times previously were about getting signed and funded to start up again. Writing doesn’t begin until that and they weren’t getting renewed quickly ever.",
            "Would you prefer to wait 3 years after season 8 then?   \nAlso, you misunderstood. Writing is the main roadblock, but after that. You gotta do everything else, animating, voice acting, etc etc. Shit takes time",
            "That's a fair question, there is a video going into a lot of detail about it - [https://youtu.be/dRAxYD3VlSk?si=uoASNz5TSgpj42-5](https://youtu.be/dRAxYD3VlSk?si=uoASNz5TSgpj42-5)\n\nBasically, imagine the average animated sitcom like Simpsons or Family guy, they are usually low-stakes, follow the premise of characters talking in a setting, and then more complex actions are performed in that setting usually to set off the episode.\n\nA lot of the locations are fairly simple to make, share the same assets, and take place in a similar setting.\n\nRick and Morty is a show about interdimensional travel and sci-fi, a majority of episodes show planets with entirely different cultures, creatures that they have to create new assets for, that theme other creatures on the planet, and each background has to be made consistently to fit the theme of where they are, post-suicide spaghetti planet for example, and that's probably one of the easier ones to make since it's similar to earth.\n\nRick and Morty has a lot, a lot, a lot more work on the animation side as well, they are animating a lot of action, and it's a lot more than just industry standard rigging, they have to create a ton of sprites for animators to use just for scenarios that could last a second.",
            "None of those are from the same studios, harmonious claptrap doesn't do the animation. And I'm pretty sure solar opposites don't use the same team as rock and morty.",
            "![gif](giphy|J1uwUiWtIy4YBblYKH)\n\nWhy are you here?",
            "Meanwhile fans of Harmonquest... 💀",
            "For some reason I didn’t realize this. I thought we had at least a two year wait between seasons. The wait between season 3 and 4 really threw me off.",
            "idk about you but life flies when you’re older.\n\n2025 is a finger snap away from us.",
            "It was a year and a half between season 4 and 5. They also took like a year to even fully release season 4.",
            "It's always Summer's fault.",
            ">Season 8 is already fully written, and we managed to draw a good part of season 9 before the writers’ strike. So we are already talking about season 10!\n\n-- Executive Producer Steve Levy, [June 2023](https://wegotthiscovered.com/news/rick-and-morty-executive-producer-steve-levy-explains-how-the-writers-strike-will-affect-upcoming-seasons/)",
            "Curse those handsome devils!",
            "What’s a gil?\n\nEdit: sorry, I thought I was in r/archerfx.",
            "I'm in Italy :/\nEnjoy the show !",
            "Wh-what?..",
            "🤨",
            "Thank you! But no feet pics - *bonk*",
            "Decapitated. Whole big thing. They had a funeral for a bird.",
            "That's still crazy.",
            "“Barely more than two years” you sound like invincible fans.",
            "Oops you're right my fault. I wasn't paying attention when I posted this lol",
            "it says that in the article, at least",
            "Rick- Chris Sabat\n\n\nMorty- Colleen Clickenbeard \n\n\nSummer- Cherami Leigh\n\n\nBeth- Colleen Clickenbeard\n\n\nJerry- Yuri Lowenthal",
            "Yeah in shit that wasn't made in English first. We're already used to the voices and tone we know; suddenly changing that to a different language with a different tone and voice is just off. Go and look at the anime special they did on YouTube, it doesn't feel like Rick and Morty at all. \n\nI hope the different studio of this anime at least tries to keep the dialogue closer to the original, that special on Youtube is just your generic anime trash dialogue, without even mentioning the voice acting and tone differences.",
            "My friend was annoyed that they still haven't done the japanese dub for season 4.",
            "Or it dilutes the brand which was already happening a year ago. Would be a shame if R&M becomes Bob's Burgers or worse.",
            "I’m actually really excited to see what direction they take with this. The concept potentially opens up a lot of different story telling opportunities.",
            "Also, the anime series wasn't affected by the writer's strike so it was more or less coming on time. And it's not like they didn't have the blessing from the creators to do this. But hey, ppl are free to wait until 2025 for season 8.",
            "Genuine question, but what don’t you like about it? Is it just not liking anime or the animation style?",
            ": WHERE IN THE BOOK DOES IT SAY THAT",
            "[deleted]",
            "No one exists on purpose, no one belongs anywhere",
            "# Let them FEAST\n## Let them nibble\n\n* Yes\n* No",
            "You're mother did a terrific job ",
            "<--Opium addict",
            "Hey /u/themia212, due to a marked increase in spam, accounts must be at least **3 days** old to post in r/rickandmorty. You will have to repost once your account reaches 3 days old.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/rickandmorty) if you have any questions or concerns.*",
            "you bet!",
            "pretty optimistic take imo",
            "For 100 years",
            "He better get his sauce, if they fail to capitalize on that I’ll be so disappointed",
            "I like how you know it's wrong and deliberately decide not to put any work in to correct something you know is wrong. It's very cool",
            "Szechuan. It's *apparently* spicy as shit but momma don't raise no fool",
            "They’ve explained it in the show before. Most animations reuse scenes and models. It makes it quicker to pump out episodes. The nature of Rick and Morty doesn’t allow for this in most cases. A multiversal, intergalactic adventure show means almost every episode needs to have new and exciting worlds and creatures, meaning new animations that can’t be reused later. Meaning, more expensive and longer times to create episodes",
            "Baby dropped his toy?",
            "Season 3 and 4 was the big gap, I think. Seems fitting, I think the show went through alot of changes in that season jump.",
            "There’s even a season ending where Mr poopy butthole says see you in a few years 🤣",
            "Yeah I ended up waiting a while too. Putting it off. \n Worth it either way!",
            "10 seasons...so far",
            "Pretty sure they signed for 100 episodes after like season 3. I always assumed it didn't include the already completed episodes, that would be strange",
            "They signed for 100 episodes years ago already..",
            "I get that but if writing was the main block back then, if they finish that ahead of time shouldn't it *speed up* the rest of the process, not slow it down? If we're banging on all cylinders they should be ahead in other areas too because of it, but we aren't, which means there's something gumming up the works and it reeks of corporate meddling.",
            "Issue is that the other adult series running with, or now cancelled, next to R&M had just as much or more going on, and they are still having seasons every year or had, with 15-25 episodes depending on the series.\n\nRick has only ten each season. They also reuse a lot more than fans think. Even then it's a year+ delay for ten episodes and without consistent animation high points with characters or backgrounds.",
            "[removed]",
            ">rock and morty\n\nLooks like you took your autocorrect for granite",
            "Many have overlapping writers.",
            "Between 2 and 3 was crazy too",
            "The split in the middle of 4 and 5's runs didn't help",
            "It's because we have a year and a half wait between seasons, it's not every year.",
            "\"Damnit summer you ruined the premierè!\"",
            "Do you think the writing process ends when the script is completed? Stuff gets reworked well into the recording process, not to mention there was also an actors strike",
            "This made me laugh, I love that bit in Archer.  That and him not realising gravity still works in submarines",
            "I said they can send me feet pics for giving a link to see the new seasons. 🙏",
            "I'm pretty sure none of that is real",
            "Petey?",
            "Nah OP doubled the time and acted like no one would notice",
            "nah not really, it's actually really good pace for animated television (especially when it's this good looking). Think of Arcane as reference, 3 year gap between seasons, still not out yet :P",
            "I’d be down with Zoro/All Might as Rick. I am here, to get riggedy wrecked lol.",
            "If what we're getting is anything like this, I'll pass - https://www.youtube.com/watch?v=-kdltv_CSHE",
            "Ohhh yeah I see where you're coming from",
            "You’re so upset lol",
            "aww jeez",
            "What",
            "I’m honestly not sure how to take that. Between posting that and now I hit rock bottom and quit drinking tho so there’s that.",
            "Hope for the best, expect the worst",
            "F the prime thing. C-137 better get his fuckin SAUCE.",
            "I highly doubt anything sold by an American fast food chain is spicy as shit.",
            "I had it when they re-released it for a while, it was super disappointing. Just a generic Asian sauce",
            "Was my statement inaccurate?",
            "They had that beef with Adult Swim at that time I think",
            "I thought it was season 2 and 3",
            "No, they signed for 70 episodes after 30 released. 100 total",
            "Hey /u/themia212, due to a marked increase in spam, accounts must be at least **3 days** old to post in r/rickandmorty. You will have to repost once your account reaches 3 days old.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/rickandmorty) if you have any questions or concerns.*",
            "What? Are you saying, \"Granite\"?",
            "I guess I *shist* the bed there...",
            "Yeah, but that's a week worth of work per episode. It's not Southpark. It takes 6 months just to animate an episode.",
            "Rick and Morty aired in 2013. That's wild.",
            "It hasn’t been “terrible,” the amount of waiting we’ve had to do, *apart* from the end of season 2 to the start of season 4. I’m pretty sure that, in that span of time, we got 10 episodes in something like 44 months.",
            "That was the longest intermission. The worst part about it is that no one knew if there were going to BE any more seasons of r and m..\n\nWe’re lucky it’s in the bucket. This year will go fast there will be plenty to consume.",
            "See ya in a year and a half...or more",
            "The actors strike did not affect animation other than features. \n\nIf they were already drawing season 9, that means season 8 was also already drawn and being animated, which mostly locks the writing in place. \n\nIt would be expensive to change things once animation has started so changes would be kept to a minimum. Certainly nothing that would cause a year's delay (or possibly ~20 months if they premiere it in the second half of the year as previous seasons have).\n\nBut obviously something has created the long gap between seasons, I'm just betting it wasn't the strikes.",
            "creep",
            "*You're not real, man*",
            "OP was using the legnth from the premiere (which started earlier because of the April Fool's episode) to the end in spring 2020 because they used to try and split the seasons before they realized that was stupid to do for a show that only has 10 episodes per season",
            "I'd say that's not the norm though.",
            "Same",
            "Aye, one brother, keep fighting that good fight! 👍",
            "Hope for the worst, and you will never be let down. That's my motto.",
            "The closure we actually need",
            "Oh no I meant the actual Szechuan sauce you buy in the bottle from the asian aisle. I too doubt that McDonald would sell a spicy sauce cuz of the Mulan thing and kids getting it",
            "What was the beef with Adult Swim? about which season?",
            "Well that makes even less sense, because by the end of season 3 they had released 31 episodes as season 1 was 11 episodes",
            "Try being a venture Bros fan lol. 8 seasons since like 2003",
            "i'm trying to remember which season I started watching the show live. Was definitely not season 1, maybe season 2? Can't believe the show's been in existence for a fucking decade, jesus christ.",
            "Do you know what sarcasm means?",
            "When you say “wait between seasons” you mean the downtime between endof the previous season and start of the next, not the time from start of the previous season and end of the next.",
            "> before they realized that was stupid to do for a show that only has 10 episodes per season\n\nMeanwhile, at Amazon studios: Hold my beer (re: Invincible)",
            "Thanks so far so good.",
            "IIRC it wasn’t so much beef, as it was signing the largest contract for an animated television show in history. That’s really when the show was at its peak popularity.",
            "Episode 1 initially didn’t count as an episode in the production since it was the pilot, so it wasn’t made as part of the show itself, but was something they retroactively decided to include/tack on as the first ep after the show was greenlit. This is why in the Season 5 finale it literally was skipped over when referring to the Evil Morty debut ep from Season 1.",
            "Jesus christ just google it its not this complicated",
            "\"that makes even less sense because you're off by one\" c'monnnnn",
            "We at least got the movie as a fitting sendoff. Go Team Venture.",
            "Wdym 8 seasons, we only have 7.\n\nAlso, literally every episode from season 3 onwards is amazing, so it beats our Rick and Morty with that.",
            "i know. OP was being dumb i was just explaining where he got the random ass number from",
            "I love you Rick 🤣🤣🤣🤣",
            "No op wasn’t bootlicking. It was a long ass wait. It wasn’t justified. Stop pretending"
        ]
    },
    "Which comics should i read?": {
        "title": "Which comics should i read?",
        "score": 30,
        "url": "https://www.reddit.com/r/rickandmorty/comments/1cd4e9c/which_comics_should_i_read/",
        "content": "I want to read the rick and morty comics, but i dont know what order i should read them in or where to buy the real ones. I dont know which comics are fan made or real, and i dont want to accidentally get a fan made one. unless theyre all fan made?? I wanted to get some on amazon but i dont know which ones i should get.",
        "num_comments": 29,
        "comments": [
            "HI. I've been writing the Rick and Morty comics for eons now (or four years, idk if four years is an eon. It IS like almost half of Rick and Morty's pop culture life though so ya know) and the answer is anything published by Oni has been officially commissioned by the show, and for the most part, each of them are stand alone.\n\nYou really can't go wrong with any of the ones you choose. If you know the show, you won't be lost with the comics, so just grab the one of these that sounds the best to you and go from there.\n\nThe first sixty issues are collected in volumes 1-11. Oni is rereleasing them as compendiums, and they're written by a variety of writers, but the first six are Zac Gorman and most of the rest are by Kyle Starks who is now very very beloved at Marvel/Image/DC. Excalibur/Catwoman/Harley Quinn writer Tini Howard is in the mix, as is Eternity Girl writer Magdalene Visaggio. Both are great. The first compendium can be found here, with a cover by Fred C Stresing, a dear friend of mine and probably my most common collaborator on these: https://www.amazon.com/Rick-Morty-Compendium-Vol-1-3/dp/1637152507/ref=asc_df_1637152507/?tag=hyprod-20&linkCode=df0&hvadid=652542027758&hvpos=&hvnetw=g&hvrand=17970536145950503530&hvpone=&hvptwo=&hvqmt=&hvdev=m&hvdvcmdl=&hvlocint=&hvlocphy=9030955&hvtargid=pla-2022776494075&psc=1&mcid=b3769d9329fb3e7c97bc072cd0717ffe\n\nThen there's Rick and Morty presents-- usually a guest creator does a story concerning a side character. I've written Birdperson and Mr Nimbus, and to be completely honest, as a reader these are my favorites and where I personally began. A lot of different creators in short self contained stories. Here's Vol 1, but my work (Birdperson, Nimbus, Issue #100) can be found in volumes 3,4,5 respectively: https://www.amazon.com/Rick-Morty-Presents-Vol-1-ebook/dp/B07QPXS589/ref=mp_s_a_1_2?crid=1Q90BT7QDAGJI&dib=eyJ2IjoiMSJ9.tnOXtImY3Y4tiQWrSdTkQUXnmD6l5NQ1Lc1qr7w5pyJ1ssRIFWtos2nU9S9BRVbLv8igptyGzrdYvtfd2dZ34xAjtid9UmlQTkzWwjAQVFbOkGdsO7muDBY-89ZKscU_Mtnej0uxcXXhwi9uihkJQ4B-3-4BgYXzxQs5IDHlNnVpQVyuG3TXPN6qVd_7Xm2ETpb8_PgRGXPkHCWkDTJcHA.VIUSpW-z_toir0JSszcmYZwcn3K3woXEzeewIGErl-Y&dib_tag=se&keywords=rick+and+morty+presents&qid=1714111474&sprefix=rick+and+morty+present%2Caps%2C202&sr=8-2\n\nThen beyond that there are the miniseries. Mr Poopy Superstar has a very Adventure Time/art comix vibe to it and is about my dear friend Mr Poopybutthole, Worlds Apart is about the slut dragons, Rick and Morty Go To Hell says it all on the title, I've written Rick's New Hat, my attempt to capture the chaos of a crossover with Rick fighting a space God after he gives him a hat that makes him dumb, and I'll allow my bias here and it'll be the one I link to), Crisis on C-137 is a parody of multiversal DC 80's epics, Pocket Like You Stole It is a Pocket Morty's comic and thus a Pokémon parody by Tini Howard, Corporate Assets satirizes the marketing elements of the characters, Heart of Rickness is Rick crashing on a barbaric world with no technology, Meseeks PI, a Meseeks and Jerry noir written and drawn by Fred C Stresing, a Star Wars parody titled Infinity Hour, and Jim Zub's three crossovers-- Rick and Morty DND, Rick and Morty DND Vol 2, and Rick and Morty Vs Cthulu. Here's my own New Hat: https://www.amazon.com/Rick-Morty-Ricks-New-Hat/dp/1620109824/ref=asc_df_1620109824/?tag=hyprod-20&linkCode=df0&hvadid=475772680074&hvpos=&hvnetw=g&hvrand=5362615239424640752&hvpone=&hvptwo=&hvqmt=&hvdev=m&hvdvcmdl=&hvlocint=&hvlocphy=9030955&hvtargid=pla-1186511562451&psc=1&mcid=fd054cc19a583cc6807f748b9658b078\n\nIn 2023, along with Fred C Stresing and Marc Elletby as artists, we relaunched the Rick and Morty ongoing. It lasted 12 issues before pivoting back to minis, but I'm proud of them! They're collected as Space Shake Saga, about Rick being challenged by a genius Goldenfold, fighting a parody of a Web 3.0 creep, fighting his version of the Fourth World Saga, all while Morty falls in love with Goldenfold's niece. Although we revisit a few characters I created in other comics here, these can be read without any prior knowledge of the comics: https://www.amazon.com/Rick-Morty-Vol-Space-Shake-ebook/dp/B0CN9MQBVZ/ref=mp_s_a_1_4?crid=2VQQS7KLUMW7J&dib=eyJ2IjoiMSJ9.p3krpjrGu3CFYMawQejuAPHV39D3DMEVHG79s9HabeeYSA3MwUer6YMsG_Jhg-1Gs0fn2MzZf-to4lwfU7xOQFioctcRq7hJl86m65ZVnsolyg64TVm76JG2XRi10Qq5xHxcdwH7IegGTVaC1sToik64JyzBZDbtgquCG3JV_aJyKlMjKImhTFtIrb1NAIIKaTBCbNgNGsPsaNXZxn8hbg.RhKDfreeCDYj-c-8oPp-mfEVNgvT20naJQyMbewmefM&dib_tag=se&keywords=space+shake+saga&qid=1714112186&sprefix=space+shake+saga%2Caps%2C183&sr=8-4\n\nRight now the series is releasing three kinds of books. One is a special-- 56 pages long. The Spring Break Special was the first and so far only of these to be released and it's great (I have the 10th Anniversary Special with Fred to be released I July), a crossover with different creators titled Finals Week-- the first issue is written by legendary comedy writer Daniel Kibblesmith so you know it's good (I round out the series with the final issue) and the current miniseries is a very funny and very wild Kingdom Hearts parody titled Kingdom Balls.\n\nLastly, there is also a Rick and Morty manga being released that is very very funny. https://www.amazon.com/Rick-Morty-Manga-Vol-Robot/dp/1637152418/ref=mp_s_a_1_1?crid=2UAW4H2S2Q57K&dib=eyJ2IjoiMSJ9.EH-DCkqBxWPvGSvigwpKbZtrsfp07kUCyODI5Fto-HrA3lsk6rrcp8CqOUmztzFxbFc4q-vd-MVnJuIk_fnVP6Qng_ubsk0BcUTMpaa7QLklCmMHHSHjwViAbOfaR6nXPb_dop46xUh2w43TQin90CM7Wdng-BHLBlfkHsodXJOGZWBwazS52oq_MORTj0jkJtbgrowNL8QkOhCiwsmv_g.P-hG8NuLjfZYc2rXCMPZYuClJtM2cUwgaCpRwaGLb94&dib_tag=se&keywords=rick+and+morty+manga&qid=1714112434&sprefix=rick+and+morty+manga%2Caps%2C197&sr=8-1\n\nAgain, there's clearly been a lot, but keep in mind, the comics started publishing in 2015. That's about 9 years of Rick and Morty stories. Everything here is official, all approved by Adult Swim and such.\n\nI should also mention before a fan jumps in, that the absolute favorite of the comics series is a three issue arc where Rick and Morty are bested by Doofus Jerry, the Jerry from the Doofus Rick universe who is a savage evil capitalist. That guy keeps appearing all over the place. He's in volume 5 here: https://www.amazon.com/Rick-Morty-Vol-Kyle-Starks/dp/1620104164/ref=asc_df_1620104164/?tag=hyprod-20&linkCode=df0&hvadid=266118805355&hvpos=&hvnetw=g&hvrand=18166552077347309587&hvpone=&hvptwo=&hvqmt=&hvdev=m&hvdvcmdl=&hvlocint=&hvlocphy=9030955&hvtargid=pla-415742700642&psc=1&mcid=061ec80332b73efc8b2d76c7c8b34063\n\nAlright that's me, I got tagged, I kept going, and I'm sure other readers will chime in with their own favs! As they should! Hope this helps. It's a lot but just choose the ones you like and go from there. It's Rick and Morty, so if you know the show these should be no problem.",
            "[removed]",
            "u/GoodBoyPrime, your time to shine.",
            "First off, there are 0 fan made ones, but they use different artists, so, all of them are original. Second, start with the OG series (2015-2020) they got 60 issues, but last year and this year they are making compendiums. Then move on to \"Rick and Morty Presents\", then to the other spin-offs, they are still making them",
            "Oni Press' Volume Eight TPB (trade paper back) with vampires on the cover was a pretty good read",
            "Rick and morty vs dungeons and dragons. It's awesome ",
            "https://readallcomics.com/rick-and-morty-001-2015/",
            "[removed]",
            "I didn’t know there were comics. Maybe rewatch the series in order?",
            "Thanks, this really helps!",
            "How is the story behind R&M developed? You are the story writer or the designer?",
            "Holy crap, that is Leslie Knope-level thouroughness.",
            "Hello, I wanted to ask you about the Rick and Morty manga series. Volume 1 launched last year, and no news about a second one. Will you do one per year? Did it flop and get cancelled? Thanks.",
            "love you!! i didn't know there is comic haha.\n\nso uhh, is it canon or is it an \"elsewhere\" comic",
            "Thank you, Im planning to buy some and this is a great help!",
            "WOW. The joke answer is \"read all of mine\" but I'll give a real one in a second.",
            "Hey /u/Material-War-9798, due to a marked increase in spam, accounts must be at least **3 days** old to post in r/rickandmorty. You will have to repost once your account reaches 3 days old.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/rickandmorty) if you have any questions or concerns.*",
            "Of course! I got an obvious bias, but I'm always thrilled when people dig into these!",
            "I usually pitch the story in a little paragraph, and then grind out an outline and then the pages. Everything gets approved by Adult Swim every step of the way.",
            "I don't work on the Manga series, so I don't know anything that fans don't! But if you love it, I'm sure it'd help to write Oni an e-mail about it, or post about it, or whatnot!",
            "It varies comic to comic! Some of them are universes specifically made for the comic, some are about C-137. But, except for Infinity Hour which is a wonderful alt universe tale, they're all Rick and Morty with the same plot points as the show at the time. Whether they're the main ones or it's an alt universe is up to the reader to decide.",
            "Wait... there's comics... I could cry.",
            "Do you have a favorite character that stands out from others?",
            "Oh yeah! Mr. Goldenfold. Just writing a goofball with a weird sad normal guy vibe is great. Birdperson as well - just truly a guy trying his best, the opposite of Rick who is filled with the utmost confidence.",
            "lol Mr. Goldenfold is funniest side character the dream episode was one of the best esp the sex chamber absolutely the best!! 😂😂\n\nI just can't wait new episodes of R&M. I hope Evil Morty get defeated though!\n\nAll the love from me brother! Keep doing the great work! and hope you don't mind if I can ask some non trivial questions about r&m 👉👈",
            "Nah, ask whatever you want! I feel like this is the point of me hanging around Reddit.",
            "What did Rick see in the talking cat's mind that made him so kind with Jerry to warn him?",
            "Different person, but I am pretty sure that storyline (in particular Jerry’s final comments indicating how what he saw made him think of his parents) was a reference to [“The Cats of Ulthar”](https://en.wikipedia.org/wiki/The_Cats_of_Ulthar) (the only work of popular fiction in which cats are granted sentience specifically to enact great violence upon the elderly), since what they were seeing was explicitly the reason the Talking Cat could talk, not just a random memory. A concept the comic series *Rick and Morty vs. Cthulhu* seemed to support in featuring the rest of the Cats of Ulthar, and including the Talking Cat amongst their number (in the background).",
            "WOW. See I have no idea what the cat showed since I don’t work on the show, but this theory is great."
        ]
    },
    "Made by J.E.": {
        "title": "Made by J.E.",
        "score": 38,
        "url": "https://i.redd.it/h809zs5cp38d1.jpeg",
        "content": "",
        "num_comments": 1,
        "comments": [
            "Very cool. Nice work! 👍"
        ]
    },
    "Why can't we have a new euphemism for boobs": {
        "title": "Why can't we have a new euphemism for boobs",
        "score": 211,
        "url": "https://www.reddit.com/gallery/1dlisye",
        "content": "People are always looking for new euphemism for breasts, I think we can use this one ",
        "num_comments": 32,
        "comments": [
            "Morty has the stance of a motherfucking meerkat...",
            "Tiddies ",
            "ive actually named my boobs my little morties after seeing this episode",
            "Five or six minutes more of this, and I’m gonna start getting mad… 👀",
            "Oh I thought you were asking why couldn't we see boobs in animated shows, I was gonna mention Jessica is a minor 😅",
            "Titty Beans",
            "Jubblies",
            "This should have been a sign of things to come.",
            "I feel like there's way too much tbh.",
            "Bro hit that 🧛 stance",
            "Haha that's fuckin hilarious, I will randomly do that lil arm thing and make a dumb ass T-Rex 🦖 noise and start jokingly waving my claw hands at my fiance the first few times she laughed at me but now she just rolls her eyes and looks at me like what the fuck are you doing with your life right now dude?! It has yet to make me seize my primordial shenanigans in the least .",
            "Ikr",
            "Nice one",
            "Your folks should be proud of you",
            "Mr Goldenfold ? Is that you?",
            "She's been a minor for 10 years now",
            "Jujus",
            "Bleh bleh bleh",
            "I'm so glad I'm not the only buffoon that does this.",
            "You can't spell Tiddies without Double Ds. ",
            "You don't know me.",
            "She's a fucking time god",
            "And is also a fucking cartoon voiced by someone who is far older than a minor. (If she was voiced by a child that’s different)",
            "I DID NOT SAY \"bleh bleh bleh\"!!",
            "I DID NOT SAY \"bleh bleh bleh\"!!",
            "Thats a brand new information",
            "Nice Mrs Pancakes! Real nice!",
            "Dear sweet baby Jesus, no, it is not! Yeardley Smith is 59, but Lisa Simpson is 8; if someone expressed a desire to see Lisa Simpson in a bathing suit, wouldn't that raise a fucking eyebrow or two?",
            "Was typing a disagreeing response but you’re right honestly. \n\nTbf tho Jessica is 17. \nNot 8.",
            "Yeah, still not all the way ok to be wanting to see her bojangas. Unless you're like 14 (like Morty), in which case, us adults will look the other way for like five minutes."
        ]
    },
    "You are the travel machine, how would you keep Summer safe?": {
        "title": "You are the travel machine, how would you keep Summer safe?",
        "score": 411,
        "url": "https://i.redd.it/5n6erjso7z7d1.png",
        "content": "",
        "num_comments": 132,
        "comments": [
            "i would like, totally talk like that bitch, aka \"\"summer\"\" until all the plebs are like so annoyed by that",
            "The travel machine? \n\nYou mean the car?",
            "Cloak.",
            "Psych out the cops with simulacrums of their dead family members.",
            "The only answer is the ship is observant and learn time travel from snake episode(you know it) goes back in time and skip beth and jerry from meeting, No Summer is born, so summer is safe. (Sort of)",
            "Emmitt a sound that puts everything in a 100 mile radius asleep",
            "Nobody was able to hurt Summer physically while she was in the car. \nIf the car wouldn’t have killed the first guy, the cascade of escalation with the police would not have been triggered. \nSo I guess my answer is to convince the first guy to leave and then entertain Summer somehow.\n\nWouldn’t have been the best B plot.",
            "Step one - Put her to sleep so she can't limit the parameters\n\nStep two - Standard protocol",
            "Invisible mode",
            "Camouflage",
            "If you touch the space ship, you're gay",
            "Just keep the damn door locked",
            "fly somewhere safer",
            "Fill up with liquid, drown her, then freeze the water, protecting her with an impenetrable layer of ice. Before reviving her, Rick would need to replace her lungs, which would get shredded by the ice, but he has that kind of technology.",
            "Play snake jazz",
            "Tinted windows",
            "SHEILD!\n\nI feel the saucer should've used a shield instead of whatever it ultimately came up with.",
            "This doesn’t make for good television, but just have the car take off and float in orbit until they need to pick the team up lol",
            "Project a fake outside view through the windshield so Summer doesn’t see anything to upset her, it’s not like anyone there could get to her, just let her think nothing’s happening so she stops whining",
            "More lazers @",
            "Inpenetrable shield, invisibility before all that happened something more sophisticated",
            "Gaslighting the cops",
            "Pull a Weeping Angel from Doctor Who and send the threat back in time. It's not murder, it's temporal relocation!",
            "Strike a deal between God and Satan rendering all sins useless and thus removing evil from the world.\n\nMake summer safe",
            "Turn the car invisible and move spots",
            "I would just lift off the ground",
            "I would just make her unable to see or hear anything going on outside.",
            "A wise men said \"if your in foreign land, you have to follow their tradition\"",
            "Probs the same",
            "I dunno, do I care about how Rick will feel about it? If not, then I'd blow up the whole world. Yeah, Rick would be pissed (no ice cream) and Summer would be horrified but guaranteed no threats to Summer that way and it's the fastest way to do it. If I do care about Rick's feelings, then I'd lock Summer in a stasis and invisibility field, she can't move and nothing can affect or see her, she won't even experience time. Turn it off when Rick comes back, neither Rick nor Summer would be inconvenienced, but now I have to watch out for threats the whole time.",
            "Murder is the best method to keep a person safe",
            "Flesh melting forcefield, that slowly (like 30 to 45 seconds) disentagrstes you.",
            "\"You don't mess with time\"",
            "\"probe\" her",
            "Skynet option. \n\nTake control of the DoDs communications networks and issue false EAMs triggering a nuclear launch. The other side launches a retaliatory strike, dooming civilization. With the military and law enforcement decimated, any straggling survivors should be little match for the travel machines defenses.",
            "Pillbug protocol.",
            "I seen a lot of good comments but me personally I would have cryogenically froze summer so she has no idea what’s going on a set a laser forcefield around the “travel machine” as you put it so if when someone or part of someone steps within 5 feet of the car it shreds the person or their body part like a cheese grater then when they realize where the perimeter is and they get all set up and aiming at summer I just up the perimeter 3 feet at a time every 5 minutes until Rick returns (which of course he would be immune to the lasers)",
            "Is this a AI post? Like why \"travel machine\"?",
            "Pull some Outer Wilds level Shit where the Ship acts like the Quantum Moon",
            "I always thought this was dumb because the simplest way is to just not murder the first person who walks up to the car. Extra points for blacking out the dome and putting on a movie or something for Summer, so there's no reason for people to approach in the first place.",
            "Wait in space.",
            "Eliminate Winter, she was always jealous of Summer anyways.",
            "Take flight and begin carpet bombing the area back to the stone age.",
            "with violence",
            "Take off and fly into  space.",
            "Cover the glass with a screen showing a beach or something peaceful so Summer doesn’t see or hear what’s happening outside",
            "Just fly up a few thousand feet.",
            "I would literally take her to space and wait (yes, Rick and Morty would die from not having air when they came out, and? My directive is to protect summer not Rick and Morty)",
            "Summer is Safe!",
            "It had enough power to flash grow a clone or whatever, dice someone with lasers, paralyze another guy with lasers, project voice through speakers...feel like it could have figured out a way to just moved to a different parking lot lol",
            "Right off the bat, I would have sealed the doors and hovered a mile off the ground so I would look like a bird or something to anyone, and she would be safe from any land dweller’s interference until Rick returns",
            "Nothing can harm Summer if Summer is already dead. Asphyxiate Summer to Keep. Summer. Safe.",
            "I would take her to the best place Summer ever would want to go to have the most life fulfilling adventure just so she can rub it in her family's face. I won't make her just feel safe, I will give that bitch emotional security through her self-confidence.",
            "Do what the car did in the first part but instead turn on noise cancelling and back the windows black so summer won't RUIN THE DAMN ICE CREAM",
            "travel machine keep summer safe",
            "Convince Summer to create a simulation that blocks out all external noise, such as a cool party to rehearse talking to that one group of cool kids, or hanging out with the cool kids doing drugs. This way, Summer would be too preoccupied to care about what goes on outside the ship, while the ship destroys everything and everyone that disturbs it, and no one has to settle for flies in their ice cream.",
            "Like totally",
            "Darken the Glass to make it seem, that there IS No one inside",
            "I is a FLYing car, dumpfuck. \nJust Hover a few Meter above ground and Summer will be *blurp* Safe.",
            "Sedate her then use any way",
            "Disguise as a giant telepathic spider",
            "I think it pretty much nailed it tbh",
            "Make a projection of a normal car and if anyone comes too close I'll just politely push them away",
            "Time travel to a time where she is safe, whether it be 1200 years in the future or 1200 years in the past.",
            "Release a retrovirus that removes the aggressive gene from all life forms. Then make a Hancicle out of her till Rick came back.",
            "Just put on a cloaking device and wait on a roof somewhere.",
            "DO EVERY THING THE MACHINE DID",
            "by using my Plumbus, duh",
            "Ship ❌️\nTravel machine ✅️\nLOL anyway, I would just do the classic car alarm noise. If they beat the windows they get laser shredded",
            "Using a drunkenly improvised neutrino bomb",
            "That's so fun. Haha. I always think about why do it not go in Stealth mode. It can be Invisible so I Wonder why it that never was a Option🤣🤣 keep summer safe But traumatised🤣🤣",
            "It's not a time Machine. It's a spacecraft with a Rick Modify in it😉 It's a self aware Machine that can only work with Rick. Without him it can't Open portals.",
            "With a dead battery?\nThe car couldn’t do anything…",
            "Turn invisible",
            "Tint the windows dark so nothing can see inside.",
            "Forcefield, invisibility, blinds on",
            "move her a block away and initiate stealth.",
            "Hover 10 feet above the ground",
            "Are you some dumb ai that doesn’t understand what a space ship is?",
            "KEEP SUMER S-A-F-E!! lol",
            "is it really a car tho?",
            "“Vehicle made of garbage”",
            "I’m going to call my car my travel machine from now on",
            "“Watch out there’s an invisible garbage truck in the middle of the road!”",
            "All of you have loved ones. All can be returned. All can be taken away. \n\n\nDamn, non-lethal option did more damage than just killing them would’ve done :)",
            "lol. That part had me",
            "Mind blower",
            "So basically knock planes out of the sky cause all the pilots are asleep, causing tons of deaths? And then more from all the other traveling people? Including those who are in ladders, roofs, or doing impactful things like surgery? I can see that being something that happens on Rick and Morty.",
            "Yeah, the first guy deserved better",
            "truee",
            "Dead battery.",
            "English or spanish?",
            "The ship wouldn't start, that's the whole episode.",
            "Well, in an alternative episode, I guess. lol",
            "i don’t think he’ll take the efforts to do that he’ll prolly just get another summer",
            "lol, nice onee",
            "They cant because the battery is dead.",
            "epic",
            "The engine wouldn't start.\n\n![gif](giphy|xTiTnIsyLrd5InQOK4)",
            "agreed",
            "Not keep Summer, like, totally stoked about this whole situation. That's you. That's how you talk.",
            "Car is just a shortened version of carriage so yeah it is, it's just not what we're used to like motor carriage or horse drawn carriage.",
            "They consistently call it that",
            "Rick calls it a ship",
            "\"Its a new franchise\" 😎😅",
            "In Army psychological operations, there is a motto to the effect of “PSYOP: Because physical wounds heal.”",
            "So dark",
            "Planes don't fall out of the sky when a pilot falls asleep.  As demonstrated by that time a plane overshot msp for an hr when the pilots were napping.",
            "He was a dentist, for God’s sake!",
            "Oh yeah, then I will change my answer to camouflage",
            "Ship was able to breed a melting kid on a dead battery, I think the cloak is fine",
            "Depends, at the time period of that episode probably but he seems to have formed an attachment to this family since then",
            "Well played sir!",
            "Obviously had some sort of power to run all those other programs.",
            "The general vibe, and stuff.",
            "Rick and morty also got a flat tire in space during the space snake episode. So yeah, it's a car.",
            "Is this how I find out?",
            "I actually don’t recall him ever calling it a ship. I know for a fact he’s called it a car. \n\nI think other people call it a ship",
            "Because that plane was in autopilot they do that on 18+ hour flights",
            "Planes can’t stay up indefinitely due to autopilot, and most only carry a certain amount of extra fuel as a buffer. It’s not like every plane is filled up to full before they take off, regardless of payload weight and flight path.",
            "They edited their comment from 'flying'.",
            "Next time STAY IN THE FUCKING CAR",
            "In that episode, right before he left with Morty, he said \"Ship, keep Summer safe.\"",
            "So we're in agreement then?  Planes also don't suddenly nosedive when you remove your hands from the controls. Same way a car doesn't veer hard left the second you let go of the steering wheel.",
            "The average crusing speed of a 737 speed is 500 mph. That'd be like --12-- 24 min of sleep assuming the 100mi radius is a cylinder and not a sphere.\n\nPlanes take enough extra fuel to deal with delays and reroutes.",
            "You don't know how shit my alignment is.",
            "Oh yes definitely when you let go of the controls it goes down slightly but definitely not nosedives like in the movies\n\nEdit: most commercial planes have a safety where when a pilot lets go of the controls it switches to autopilot",
            "Helicopters, meanwhile, will fuck themselves up the moment you give them the chance.",
            "Can't really manage a re route if your comatose"
        ]
    }
}