{
    "Discord links": {
        "title": "Discord links",
        "score": 506,
        "url": "https://www.reddit.com/r/riskofrain/comments/i84clo/discord_links/",
        "content": "Risk of Rain 1 discord: https://discord.gg/ajsGTdN\n\nRisk of Rain 2 discord: https://discord.gg/riskofrain2",
        "num_comments": 37,
        "comments": [
            "I wonder why there is not one discord server for both games. It seems at a glance like it would be easier to manage one server with different chatrooms for different games than juggle multiple of them.",
            "Just a word of notice before joining the discord:\n\nWas just banned for joining a lobby because I could not join their session (I believe). Moderator decided to ban me without warn, and banned me from joining the DEADBOLT discord to try and find out why I was banned. I still do not know why.",
            "https://www.reddit.com/r/riskofrain/comments/iskxqt/we_should_make_a_new_discord_without_this_oerson/?utm_medium=android_app&utm_source=share",
            "Server is honestly a nightmare, mods have no idea how to take any form of a joke and are way too mute happy. For the tiniest little thing, boom, muted. Do not recommend anyone join this server if you want to actually have fun.",
            "Hey quick question i was wondering, if there is anyway to create a ban appeal i have been banned for a long time now and i regret doing what i did so id like to start playing the game again",
            "So… there’s a discord for Risk of Rain, and a discord for Risk of Rain Returns??? What about Risk of Rain 2v",
            "https://discord.gg/eDqby7VZ",
            "S a",
            "\n\nThanks for the links! Joining now :)",
            "https://discord.gg/fj29yM4Afs",
            "The real answer is there would be discussion muddled in the middle of RoR2 discussion in many channels. Yeah, you could have channels for RoR1, but it would just be too mixed. And also the discord mods are fairly hands off unless someone is saying slurs.",
            "Just curious, did you ever get unbanned? The mods in that server are atrocious, I've been muted multiple times for joking alongside other members and yet I'm the only one singled out, probably gonna get banned for whatever reason.",
            "literally this  \nmods are crazy inconsistent and hypocritical\n\nwish hopoo would realize their official server was being run so poorly",
            "I got a lifetime ban for “meme” im general, no appeal",
            "My account was hacked and I can’t ban appeal because I can’t fucking find one.",
            "How do you get banned on RoR2?",
            "I mean, the real real answer is that the risk of rain 1 server is many years older than the sequel and it has a community that didn't make sense to just move over to the sequel server",
            "Fair enough",
            "No I ended up making a new account to circumvent the ban",
            "I was banned in the discord not the game",
            "[removed]",
            "Yikes",
            "Yeah i think its just this one mod that terrorizes people, i got banned for a week for posting a lean gif",
            "Oh. Gotcha",
            "Fair enough"
        ]
    },
    "Risk of Rain 2 - The Devotion Update - Risk of Rain 2": {
        "title": "Risk of Rain 2 - The Devotion Update - Risk of Rain 2",
        "score": 1515,
        "url": "https://store.steampowered.com/news/app/632360/view/4184483630843392751",
        "content": "",
        "num_comments": 171,
        "comments": [
            "AAAAHHH, I got so excited when I saw ror had an update. I'm so happy, I can't wait for the dlc though.",
            "Can’t do this too me life you can’t drop the new update right before I have to go to work you can’t do me like this",
            "Mod makers in agony rn",
            "From the steam post :\n\n\n---\n---\n\n**Hello everyone!**\n\nWe're thrilled to unveil the latest addition to Risk of Rain 2: The Devotion Update! Packed with an array of exciting content, this free update addresses various item and map bugs across both the base game and the Survivors of the Void expansion. It also includes a super awesome collaboration…..\n\nThis update serves as a heartfelt token of appreciation to all who have contributed to making Risk of Rain 2 the phenomenal game it is today.\n\nLet’s get into it!\n\n\n**New Content**\n-\n\nArtifact of Delusion\n-\n\nArtifact of Delusion resets all chests once the teleporter event is finished and provides players the chance to receive additional items if they interact with the reset chests.\nWhenever Players buy a chest before the teleporter event, the chest will remember what pickup was generated from it. After the teleporter event is finished Players can interact with chests that were previously bought (and have been reset). When the player interacts with the chest a small window will open up with three pickup options to choose from - one being the correct pickup generated from the chest, and two fake options will be mimicked from the Player's inventory. If the Player selects the pickup option that was originally generated from the chest, the Player will be given that item as a reward, making it so the Player has gained two items from that chest. If the Player selects the wrong pickup option, they will lose the item selected.\n\nArtifact of Devotion\n-\n[<image>](https://clan.akamai.steamstatic.com/images//33906904/517741f5417e09f0eade7870dcd2c1d206667f7f.gif)  \n\nReplaces drones with interactive eggs that spawn Lemurian companions.\n\nWhen interacting with an egg, a prompt pops up requiring a sacrifice of one item to spawn a Lemurian companion. The sacrificed item is given and applied to the recently spawned Lemurian. If multiple Lemurians are present in the party, items are shared between all Lemurians. Every teleport event survived by Lemurian companions triggers an evolution that gives them new attributes, makes them grow stronger, and gives an additional stack of the item they started with.\n\nDevoted Lemurians start out with damage and health buffs equal to that of a normal elite to help them stay alive as well as scale according to the difficulty timer as other monsters. Each time a Lemurian evolves, they gain another stack of damage and defense buff to help their survival rate and incentivize players to stay ahead of the difficulty curve.\n\nWhen Lemurians die, they drop a scrap of the same tier of item that they were given and their item is removed from the item pool.\n\n\nNew map: Verdant Falls\n-\n[<image>](https://clan.akamai.steamstatic.com/images//33906904/096e896957cc00c0349f4a653874377ab0b643d8.gif)  \n\nVerdant Falls is one of the lost regions players can explore in this new update. It’s a stunning map with a lush environment and allows players a lot of room to explore. We dive into more detail regarding this map and the other six maps coming to Seekers of the Storm in the Dev Diary here [LINK].\n\n\n**Crossover event with Dead Cells**\n-\n\nA lot of you had the chance to play some Risk of Rain inspired content in Dead Cells a year ago so we decided it’s time to return the favor. Starting today a very special Mercenary skin has arrived in Risk of Rain 2 for all players. Drop in and take a look at it today. We think it will remind you of someone\n\n**Minor Bug Fixes**\n-\n\nForgive Me Please equipment no longer triggers on kill effect continuously\nArtifact of Command no longer prevents Lunar Coins from spawning\nChest, Firework and Squid Turret exploit fixed\nDemons and Crabs challenge unlocks normally\n\nAs ever - thank you to everyone who has given us feedback and reported bugs since the launch of the expansion, we appreciate each and every one of you! To keep up to date with any further updates please follow us on Twitter or join our Discord.\n\nUntil next time!",
            "Who has the 2 new artifact shape codes already?\n\nEdit: Looks like Devotion has been found:\n\n>!▲ ♦ ▲!<\n\n>!■ ♦ ■!<\n\n>!♦ ▲ ♦!<\n\nAnd Delusion:\n\n>! ■ ● ■!<  \n>!●  ●  ●!<  \n>!■ ▲ ■!<",
            "> Forgive Me Please equipment no longer triggers on kill effect continuously\n\nWell, RIP this item I guess.",
            "The new sound of a lemurian spawning is so ass dude. It's just awful. Why would they need to even touch it?",
            "Can someone please explain how artifact of delusion would work with artifact of command?",
            "rip to all my mods",
            "This out on console too?",
            "You can't convince me that the new map isn't inspired by slime rancher, it looks exactly like one of those maps",
            "Which stage variant is Verdant Falls? Asking so I can be sure to dream for it my next run",
            "loaded up a game and loaders thunder slam is bugged at like max volume, dunno if its me or an actual bug",
            "Time to make a million little Lemurian friends with Acrid",
            "[I love the new map already](https://i.imgur.com/O0DxqPs.png)\n\nSuper easy to move around as a merc and lots of items.\n\nAlso >!GEEP!<",
            "New map for free is pretty clutch",
            "Oh god, did this just break all of my mods??",
            "Yeeeeee happy for finally get an update but sad for modders out there",
            "WHAT IS THE FRICKING CODE FOR DEVOTION ",
            "Artifact of Devotion and Egocentrism\nA war with one’s self",
            "Has anyone else noticed that loaders Thunderslam plays on max sound settings regardless. It. Is. So. Loud",
            "At work it’s hard for me to tell - is the full update out today?!",
            "Anyone find the artifact code?",
            "New ror2 content:\n\nMe:***Heavy Breathing***",
            "The update is nice but I've noticed some bugs with a friend. One being leader's audio being either kinda quiet or like with the thunderslam being ear shatteringly loud, and another being artifact of devotion not giving the lumerians the items properly and the eggs remaining after use but are uninterractable\n\nI know the update came out today but I wanna make sure that whatever bugs are found get fixed",
            "Artifact of delusions sounds genuinely fun but I know I'll hate it",
            "My computer died 2 days ago. Gone for 1 whole month 😔",
            "So what bugs did they even address? \"Item and map\" but doesn't specify anything really. Nothing about the last DLC bugs that are still present in game, nor many of the bugs since day one. \n\nI appreciate free content but the devs have been terrible on patching and patchnotes since RoR1. Nor can they answer simple questions in their Disc or streams.   \n  \nI'll reserve my excitement for this new DLC, considering the debacles of the last release, until it's out and throughout assessed.",
            "So…is it out yet for console?",
            "SOMEBODY KNOWS THE ARTIFACTS CODES?",
            "Does anyone know what the hermit and crabs challenge change means? Does this mean everyone gets it unlocked by default or is it referring to something else?",
            "Obviously one of the artifacts is on the new map, but what's the other one on? Sundered Grove or something?",
            "Does this update address the bugs on switch like the problem with the “Demons and the Crabs” achievement as well?",
            "Is this on xbox?",
            "What does \"Chest, Firework and Squid Turret exploit fixed\" mean?",
            "What is the bug with the squid polyps and fireworks they mentioned? I think I've seen the FMP bug where it triggered every frame, but I haven't heard of the squid polyp bug.",
            "I hoped the new Artifact would be something I wished for RoR2 for a long time, similar to Artifact of Command, but instead of all Items, you can only pick 1 of 3.\n\nIt gives you more control over your build without making you completely broken.\n\nCan any modders maybe? \n\n👉👈🥺",
            "How is this not pinned?",
            "Hmm is this available on console too?",
            "Im doing the E8 climb and I completed all E7's, I'm doing E8 character-by-character in order and I reached merc. Stopped playing so that I could go for E8 merc with the new skin.\n\nLet the grind begin again",
            "Other six maps?? Let’s go",
            "Did the update have any fixes for the issues that have been present/unique on consoles since, well, many months now?\n\nThe pots, the map glitch through, the disconnects, etc etc?",
            "Sadly the update seems to break all modded mercenary skins? At least for me it does, idk if its an issue with my mods but they were working fine a few days ago and I haven't changed anything. Guess it makes sense, although idk why adding a new merc skin would break all other modded ones. I like to play with some that say they haven't been updated in over 2 years so I hope I won't have to say goodbye to those forever.",
            "So does this mean it's canon that whichever survivor beats Mithrix shows up to their next planet with a ship full of lizard folk?",
            "Is it just me or is the new map pretty small? Still stunning tho",
            "Friends makes a phone call, says \"RoR 2 update is finally here\", rush back home. It's the devotion update :D. Completely forgot about it. Ofc, I'm happy, but was hoping for Seekers of The Storm. Won't complain of course!",
            "Is it out on console too?",
            "Anyone know the newt altar locations? I found one on the edge of the map down a vine, but idk the rest\n\nEdit: nvm it's on wiki now",
            "Man, if you thought getting lunar items was broken, wait till you see what you can get from void fields without progressing the game/difficulty timer at all",
            "Where is void fields mentioned",
            "Wait it's out? I imagine only for pc right? Console still has to wait",
            "RIP Forgive me please is now shit.",
            "is this update made by same people who made original ror2 / music composers?",
            "Fix the console version please that now has worse bugs now than it did pre-DLC",
            "Wait, that's it? One map, one skin that you don't even have to unlock, 2 artefacts and some bugfixes?",
            "Sorry I’m confused is this just part of the new update/dlc? Or what is this exactly that dropped today",
            "Work can wait fr\n\n\n\nDon’t skip work bad idea",
            "It has been 8 hours, you been able to purge the innocent wildlife yet?",
            "I have like 118 mods rn. Most of them are skin and character mods, but still, I'm scared to launch the game anytime soon",
            "Omg, I forgot about mods. My poor 2b mod. :(\nIt feels weird playing without it now.",
            "there aren't really all that significant changes to mechanics, save for the new artifacts. the update was pretty damn light even in regards to minor bug fixes. a new map is absolutely fantastic but its not gonna break much of anything unless it itself contains unique new mechanics.",
            "Why is that",
            "My 118 mods I had installed worked absolutely perfect",
            "let me know if you find this, I'm looking for them too",
            "Where did you find it? I'm curious just to know where on the new map it is.  \nEdit: nvm they forgot to add it to the game so [they tweeted it](https://x.com/RiskofRain/status/1792623826536378806)",
            "immediately checked out the new fmp with command. seems like it still works fine, except for the fact it no longer ticks as soon as you throw it out, i think? maybe they phrased it poorly and just meant they made sure it ticked consistently for the eight seconds after it's out.",
            "Based on the wording, I think they fixed a bug that could cause it to spam death triggers *continuously* instead of 1 per second for 8 seconds.\n\nThe item's literal purpose is to get free death triggers, it would make zero sense for it to just... do nothing.",
            "I just tried, works still fine. I counted 9 procs and they all worked with gas and such",
            "I'm confused, does it only proc once now?",
            "It was a bug causing FMP to act infinitely",
            "And what about the turret+fireworks exploit? Did they nerf caffeinator or something?\n\nOh, maybe they made them not spawn anymore when interacting with a printer. I would have left it there tbh, if that was the case",
            "I thought something sounded off!",
            "Probably not any different right? You just have to remember which item you selected from the command menu when you reopen the chests",
            "all my mods still work and i have 98 MODS so i think you're good",
            "Yes, I had an update, looks like gearbox finally made it to where we get it at the same time",
            "And also lorewise it's the home of Gup, Gip and Geep :) So maybe you are right",
            "I am *not* a fan of the pastel palette they’re using for the new stages. It feels very off to me.",
            "stage 1 seemingly",
            "fuck man that’s a super old console bug, they’d better not have transferred it to pc too",
            "Same thing for me, so probably a bug",
            "Really wish we could get options for specific audio sounds. 57 leaf clover in multiplayer is very annoying, thunder slam is max volume, engineer crawling mines on console do NOT stop making noise on console anytime that you are not the host.",
            "Even with all audio turned down it's still max volume. Very annoying",
            "Not just you. Lowering master volume does lower it though.",
            "Do they just die and don't come back? Seems really bad so far.",
            "I think they fotgot to add it so they tweeted it",
            "yes",
            "https://www.reddit.com/r/riskofrain/comments/1cwko72/risk_of_rain_2_the_devotion_update_risk_of_rain_2/l4wn1cs/",
            "It’s the world’s hardest game of Simon",
            "Boot up the console",
            "I think they fixed some bugs on console- fall damage doesn’t seem to proc twice anymore (used to kill you on higher eclipse levels with safer spaces up, void fiend movement ability would straight kill you with a single red whip active) and haven’t been able to check but I’m hoping they fixed pot rolling which was made virtually impossible on console when the dlc came out (pots were practically immovable- couldn’t even move them by sliding into them with commando, only rail gunners force mines would move them and they would go flying)",
            "yes",
            ">!▲ ♦ ▲ ■ ♦ ■ ♦ ▲ ♦ !< Is one of them",
            "Sometimes it didn't count the crabs correctly and wouldn't give you the achievement after 20",
            "It does, they mentioned it at the end of the post",
            "i’m really hoping so as that’s the only item i don’t have unlocked - if i get around to it, i’ll post an update with my findings either here or in a new post if nobody has answered it yet",
            "Something like this?\n\n[https://thunderstore.io/package/Cercain/ImprovedCommandEssence/](https://thunderstore.io/package/Cercain/ImprovedCommandEssence/)",
            "Sure is",
            "Nah out for console too I played it last night",
            "The new stage has a guest composer i think, i cant remember hia name but the track is pretty good",
            "This has been known for a long time.",
            "For the free update yes, the full DLC with more content will be coming soon",
            "its a free update",
            "For a free update yes",
            "I mean, it's a free update meant to hype up the much bigger dlc coming out later this year, be happy for new content man.",
            "You are not wrong, but at this point any crumble of content for this gem gets people like me hyped as fuck",
            "Free update, separate from dlc",
            "It’s a free update/collaboration with dead cells promoting the DLC’s development",
            "What has dropped today is a free update. Anyone who owns the game can enjoy it. The Survivors of the Void DLC (I think that’s what it’s called) will be coming out at a later date and won’t be free.",
            "People would know if they gave release dates for stuff",
            "I have around 600 mods installed 💀",
            "i got 70 but i feel you",
            "oh boy, you were \\*very\\* wrong",
            "New update, new map, new artifacts and a new skin. All of that will most likely cause all mods to not work until they can be updated, if the mod creators are still around.",
            "My 43 now won't even launch the game",
            "Devotion:\n\n>!▲ ♦ ▲!<\n\n>!■ ♦ ■!<\n\n>!♦ ▲ ♦!<",
            "rn im farmin on golden portal so i can just hop arround the new map once i get to it to find them",
            "Delusion:\n\n>! ■ ● ■!<  \n>!●  ●  ●!<  \n>!■ ▲ ■!<",
            "With Which on kill items did you try it with? Maybe its something about the infinite fmp uptime  synergy with soulbound catalyst?",
            "Apparently it still pulses 8 times. IDK what actually changed about it, mightve been a console bug I didn't know about",
            "crowbar razorwire rex about to go hard",
            "what about the artifact of sacrifice?\nwould it just not?",
            "How? My game doesn't even start anymore",
            "very wrong, this update broke 90% of mods LOL",
            "Rare gearbox w",
            "Thank you. Someone else said it. I mentioned this and someone unironically said I was spreading misinformation lol as if art isn’t completely subjective lol. There’s already the contingent forming of gearbox can do no wrong so make sure you don’t have any “incorrect” opinions on this sub. Absurd how people are willing to defend multi million/billion dollar companies lol.",
            "Yeah and the fullbright washed out kind of look, if it weren't for that it might not look half bad.",
            "Just played and it is indeed a Stage 1",
            "They can be given items and all Lemurians share items with each other. They also get stronger and evolve if they continue to survive.",
            "Priciate it👌💯",
            "I there is no cross progression, it's. Not worth it.",
            "[deleted]",
            "YESSSS THANK YOU :3",
            "I mean, i expected at least a couple extra things, like maybe an enemy or an item or something",
            "Seekers of the Storm* is the name of the upcoming DLC. Survivors of the Void is already available",
            "Seekers of the storm is the new one",
            "I hope we at least get an update on the dlc release date now. It feels like it's been teased forever now ugh.",
            "I'm in the 400 mod range :( Ah well, time to start a new modpack.",
            "its really bizarre what gearbox has chosen to include and exclude in their patch notes. but what did they change exactly beside fucking with void fields again, buffing happiest mask, and porting over weird console bugs? has anyone organized a list of what's actually changed anywhere? cause its not on the wiki, they just list the weird official patch notes.",
            "Ah crud",
            "Thank you!!",
            "where was it found? i have been looking since it dropped",
            "ah, i just picked up it and a will-o-the-wisp. didn't try any of those.",
            "R2modman it's not launching modded game for me as well :(",
            "Oh well unlucky it somehow works perfectly fine for me though i dont really know if all mods arr working but the most vital ones for me are",
            "Did a second run where I focused on babysitting them and definitely seems better. Like an escort mission at the beginning stages. My mind has changed on the fun factor for sure after that first run.",
            "My bad I forgot that because they asked",
            "Why?",
            "Why would you expect more when they straight up told us what was going to be in it?",
            "You’d think a guy with hundreds of hours logged wouldn’t confuse the DLCs like that like that lol. Thanks for catching my mistake",
            "What a weakling\n\n- A Silksong fool",
            "the preorders for the DLC's soundtrack say they ship in October I believe sooooooo",
            "There was some issue with item names or somethings names fcking with mods because the things the mods were referencing no longer existed. Just crazy shit idk I was hype for this update but I only played it for a couple days before I got bored and quit again",
            "Looks like it was in the background of the YouTube patch trailer, lol. Still don't know if it is in-game anywhere.",
            "Works for me but I only have Starstorm, LookingGlass, Paladin and the saving mod.",
            "Because it's been 7 months since the last patch (that added nothing) and I want a reason to actually play the game and unlock something",
            "Especially when there only are two lol",
            "Laugh's in Beyond Good and Evil 2",
            "Omg that's so far away, I might cry tbh. 😢",
            "where in the background? its a 38 second clip",
            "wack i have a bunch of api shit for the save mod plus a qol speedup mod and i just turned off the save mod and it booted idk how you got save working",
            "Allergic to joy and whimsy",
            "Yeah c'mon!\n\nTbf, they are confusing titles.",
            "https://www.reddit.com/r/riskofrain/comments/1cwqzzr/artifact_of_delusion_code/\n\n\nhttps://i.imgur.com/8skNeqN.png",
            "What? I mean, sure i guess, sorry for wanting a reason to play the game",
            "When I think of Seekers of the Storm, I always think of Riders of the Storm, so I memorized the title of the new DLC",
            "Fun is a good reason",
            "Hey man, for a while I thought it was survivors of the storm, then seekers of the storm 😂",
            "riders of the storm infected mushroom refrence? :3c",
            "But im not having much fun if im not unlocking something, is that really so bad?",
            "Seekers of the Storm\n\nSurvivors of the Void\n\nX of the Y\n\nY of the Z\n\n2 to the 1 to the 1 to the 3",
            "Yes it is, and I'm obviously the divine authority on this topic."
        ]
    },
    "New skin: Meridian...opnions?": {
        "title": "New skin: Meridian...opnions?",
        "score": 232,
        "url": "https://v.redd.it/891uio3ba38d1",
        "content": "",
        "num_comments": 22,
        "comments": [
            "It looks pretty similar to her base skin but it’s still pretty clean honestly, I wonder what it’ll be like when we can get a better look at the model in the character select",
            "HOLY SHIT THEY BUFFED FLAMETHROWER?!?!?!",
            "Looks very similar but still very nice",
            "Link to anywhere that isn’t reddit? Video quality is crayon level for me sadge",
            "Wish there was a little more action on the back(which is what you’ll be looking at most of the time anyway) but very cool!",
            "Honestly looks amazing, can't wait to try it out",
            "Pretty cool, however I do hope they don’t just start unlocking the skins just like that, maybe needing an achievement like everything else would be cool, or finding something in game or something like that",
            "Would tbh",
            "why is the person using the skin ass at the game",
            "Good clean skin but flamethrower.",
            "it looks so pretty",
            "looks like 5 min in paint shitty skin",
            "Ebic :3",
            "A simple change is sometimes the best change",
            "I can't trust char select anymore after seeing what Commando's Hornet skin looks like in char select vs in the game.",
            "God I hope so",
            "how can you tell? it did a lot of damage in the stage 1 clip but that's cuz it's powerful early but falls off",
            "is it out yet or u judgin by the clip",
            "The only other place I’ve seen it is instagram, here\n\nhttps://www.instagram.com/reel/C8fJLEEuh5V/?igsh=MTR5cDU5dTZweTgyYw==\n\nEdit: I’m lying ig, it’s on Twitter too\n\nhttps://x.com/riskofrain/status/1804209037791400084?s=46",
            "I agree wholeheartedly",
            "They're paid to make promotional content, not to be good at Risk of Rain 2",
            "they might be talkin about range? it looks like it goes far when it goes past an enemy"
        ]
    },
    "I refuse ": {
        "title": "I refuse ",
        "score": 384,
        "url": "https://i.redd.it/cj4fs7nxa28d1.jpeg",
        "content": "",
        "num_comments": 38,
        "comments": [
            "AHOY",
            "It’s always good when you have an equipment drone on the some stage to give it the hat once you’re done.",
            "SHATTERSPLEEN COME TO ME",
            "Gimme that planula",
            "New player here. Why is this equipment good? I got it once before, I don't understand how to use it or what it does",
            "recycler clears so hard",
            "mired urn",
            "Yup, the only equipment I'll (usually) pick over recycler or mom's credit card.",
            "Gotta have the fit",
            "Makes arti and engi quests so easy",
            "Recycler",
            "Me but executive card, even over recycler.",
            "Ahoy!",
            "Ą̷̢̡̛͎̣̠̠̼̰̞̙͈̭̱̩̮̜͚̤̫̼̭̜̤̭̗̱͎͕͓̦̻̥̦̿̍̄̈́͊̉̎̄̀̃́͐̄̾̈̽͋́̿̋͑͐̂͐̆͌͆̿̊̆̈́̅̄̀̓̈́̄͐̕̕̕͜͝͠͝͝͠͝ͅͅͅḩ̴̢̡̨͔̭̜̬͚̮͔̠͕̹̺̭̫̖̤̺̫̙̩̮̦͎̭̫̯̗̙̺̱̜͍̳̣̰̯̳̼͐̾͗͂̎̑̇̏͛̈́̔̀̽͊̌͋͋̀͋͠͝ͅơ̵͙̩̗̦̠͖͎̜̖̹̭̄̑̀͋̂̀̐̽̍̾̆̈́̀̿̂͌͐͐̿͊͂͒̌̂̎͂͑͂̒̕̕̕̚͠y̷̢̢̨̢͙̼̭̩͓̙̩͇̠̰̬͉̱̙̫͎͕͕͇̥͍̰̰̙̪͇̩͈̖̲̣̥̞̰̒̋̆̑̃͒̂͐̊͗̄̆́̉͌͗̎̎͐̅͐̆̓́̐͋͒̕̚͝",
            "Equipment drone : Ahoy!",
            "A shatterspleen a play keeps the difficulty away.",
            "Fellow planula lover",
            "Instakill a boss with guaranteed boss/yellow item drop. Extremely valuable against the imp boss (shatterspleen), magma worm (molten perf), overloading worm (charged perf).\n\nAlso good for some achievements.",
            "The Binding Of Isaac reference?????",
            "Ahoy!",
            "im about to say something contraversial   \nshatterspleen is very overrated   \nit used to be insane with double bleed builds and goes hard with aoe   \nits still great but people treat it as if its the best item when its not even the best yellow",
            "Or if you’re running the command relic you can get any of the items",
            "Never played it",
            "Ahoy!",
            "Perspective: Commando main who plays straight to Mithrix\n\nNah sorry it's still absurdly cracked and is handily the best yellow.",
            "sure, but that requires a yellow to drop in the first place. command makes tricorn even better, cause you can basically choose to get a spare tricorn every single stage and then just attack every boss you see; turning worthless knurls or loops into powerful perfs or shatterspleens and such. every single new orange item you get for the entire game can mean another game-changing, build-defining yellow item too in command.",
            "Ahoy!",
            "disagree on that one   \nI'd say its probably better than little disciple and about the level of drone man with the yellow item from the Alloy units   \nbut the damage from cherf is just too broken",
            "Pretty sure that's what they meant, that you can guarantee that you get a boss drop with it and choose any boss item you want because of command.",
            "Ahoy!",
            "You're putting Shatterspleen on the same level as Empathy Cores? I think we will indeed have to disagree!",
            "Ahoy!",
            "bro empathy cores are busted with drone man I highly reccomend you try them out  \ndefintely the strongest item combo in the game",
            "Ahoy!",
            "Ahoy!",
            "Ahoy!"
        ]
    },
    "Request from a friend": {
        "title": "Request from a friend",
        "score": 619,
        "url": "https://i.redd.it/ezmot2u3v08d1.jpeg",
        "content": "I hate this",
        "num_comments": 57,
        "comments": [
            "Wow this really makes me wish I didn’t have eyes",
            "I was going to distribute Eye Bleach for everyone Who saw this\n\n*This sub doesnt allow images*",
            "Tell your friend his days are numbered",
            "You too can do yourself a favor in 3 simple steps\n\nStep 1 - grab fuel cell array\n\nStep 2 - grab shrine of blood\n\nStep 3 - ...\n\n(Edited for formating)",
            "Never listen to your friend again. This shit is heinous",
            "It's so cursed it's great",
            "wait why did matrax do that?????",
            "Cursed and blessed at the same time",
            "I no no wanna",
            "Acid should never be used as lube with condoms.",
            "😐🔫",
            "Mods please make it so this guy never drops a 57 leaf clover again",
            "HELLO WHAT??? THIS IS LITERALLY THE FIRST POST I'VE SEEN IN THIS SUBREDDIT 🙁🙁🙁",
            "I hate you\n(Upvote)",
            "It cost you nothing to not make this and even less to not post it",
            "“THIS PLANE GROWS DARK... BROTHER... I CANNOT SEE YOU... WHERE ARE YOU...?”",
            "Is it still mpreg if one of them is a reptile",
            "God is dead. \nWe made him kill himself.",
            "I hope a fuel array explodes  Infront of your face",
            "⚡️🙎🏿‍♂️⚡️",
            "that's it. im gonna commit fuel array  with 50% HP.",
            "Love ❤️ wins 🥇 \n\nDivorce 📝Kings 👑",
            "Images that cause collapse",
            "Don't blame your friend for your sins. >!Embrace them.!<",
            "Well, off to hang myself, watch and lea-",
            "OP please commit multiple stained glass.",
            "This is so cursed.\n\nWaiter! Waiter! More of this bullshit please!",
            "I’m unrequesting it",
            "Draw acrid dying in a glue trap",
            "This definitely ain't a miracle, chief...",
            "Gub better be the baby :)",
            "You hate it? You drew the dang thing! There are consequences for your actions.",
            "Thanks, I hate it.",
            "What the hell man",
            "Never post in your life ever again",
            "Try saying \"Mr. and Mrs. Mithrix\" 5 times fast",
            "\"I always get drunk before a hanging\"\n\nThis makes me want to drink",
            "Christ it’s 6:30AM😩",
            "Christ it’s 6:30AM",
            "......delete this please",
            "r/okBuddyCommando I hope you have a bad day",
            "***Guilty Gear Xrd faust insta-kill upon thee***",
            "r/eyebleach there you go :)",
            "Tell him to oil up lil bro, cause we lighting him on fire",
            "step 4 - ??????????\n\nSTEP 5 - MAXIMUM PROFITS",
            "Step 4 - profit",
            "Love changes people",
            "Weak mindset",
            "Get used to it because that’s all that’s in it",
            "r/eyeblech :)\n\nEdit: Oh it's gone",
            "100 gasoline type run",
            "\"I HATE MY BROTHER!!!\" type mfs when you show them love and compassion.\n\n...man Mithrix is such a sad tragedy, if he communicated better with providence literally nothing could go wrong.",
            "great",
            "Dropped this King: **Ignition Tank**",
            "Thank you brother",
            "Here's some green scrap for some more",
            "Even better thank you my friend *guttural metal noises* ah yes more ignition tanks 😊"
        ]
    }
}