{
    "Roms Megathread 4.0 HTML Edition 2021": {
        "title": "Roms Megathread 4.0 HTML Edition 2021",
        "score": 14746,
        "url": "https://www.reddit.com/r/Roms/comments/m59zx3/roms_megathread_40_html_edition_2021/",
        "content": "**https://www.reddit.com/r/Roms/comments/1ch6x3e/rroms_is_looking_for_more_mods/?**\n\n--------------------------------------------------------------------------------------------------------------------------------\n\nGo here for Roms\n\nFollow the either of the links below.\n\n**Github https://r-roms.github.io/** This is the primary megathread.\n\n**Gitlab link https://r-roms.gitlab.io/megathread/** This is the backup megathread, it'll be updated alongside the github megathread.\n\n___________________________________________________________________________________________\n\n\n**The megathread contains 7 tabs:**\n\n* The landing tab is the Home tab, it explains how to use the megathread and has some helpful tips.\n\n* The Popular games tab lists direct links to popular games, this list has been made mostly by SuperBio, and as such may not represent what you think a popular game is. If you feel something is missing there PM SuperBio and he'll have it added. \n\n* The next 5 tabs link directly to collections based on console and publisher, they include Nintendo, Sony, Microsoft, Sega, and the PC. \n\n* The last tab is the other tab, this is where you can find Retro games, defined by No-Intro and others as pre Gamecube and PS2 era. This tab exists to link to the large collections that No-Intro and various other groups have collected.\n\n___________________________________________________________________________________________\n\n\n**/r/ROMS Official Matrix server [Link](https://matrix.to/#/#romz:matrix.org)**\n\n* Go here if you need additional help with anything ROM or emulation related.\n\n___________________________________________________________________________________________\n     \n\n**Changelog:** \n\nRedid Megathread post on Reddit, hopefully this is a cleaner, easier to read version that isn't as confusing as the out of date changelog\n\nMoved the megathread to gitlab due to account issues on github, update your bookmarks accordingly.\n\nRestored the megathread on github, left the gitlab megathread link as a backup, both will be updated.",
        "num_comments": 5224,
        "comments": [
            "To get past Google Drive's Download Quota\n\n&#x200B;\n\n1. Make a \"copy\" of the file to your G Drive\n2. Make a folder name, put file in it\n3. Download folder.\n4. Profit?!!\n\n:-)",
            "I'm so confused on how to use this thread",
            "For everyone who can't download from the archive.org, make sure that you have made an account on the archive.org. \n\nThe archive.org locks out guest users when collections use a large percentage of their Internet bandwith.",
            "I just joined this subreddit. Where do I find the roms. I am confused.",
            "Are there also coming romhacks?",
            "I couldn't believe that there are actually people who couldn't find the link in the megathread lmfao",
            "For downloading a lot of ROM's at once off of the [Archive.org](https://Archive.org) site, I created the following PowerShell script that will go to the link in the $rooturl variable and grab any links on the page that follow the criteria (after where-object, make sure to modify to suit your needs) and compile a list of links to use to download the ROM's on that page. It'll then place a file on your desktop called \"archiveorglinks.txt\" with all of the links of the ROM's, that you can then either go through and either pick out ones you want or select all of them and then load into \"Free Download Manager\" to handle the downloads for you. You get faster downloads this way and can leave it alone while it does its thing. I hope this is helpful :)\n\n`$rooturl = \"https://archive.org/download/nointro.n64/\" #change to archive's root directory, ensure trailing slash exists`\n\n`$links = (Invoke-WebRequest -Uri $rooturl).Links |`\n\n`Where-Object {($_.innerHTML -ne \"View Contents\") -and ($_.href -notlike \"*Europe*\") -and ($_.href -notlike \"*Japan*\") -and ($_.href -notlike \"*Germany*\") -and ($_.href -notlike \"*France*\") -and ($_.href -like \"*.7z\")} |`\n\n`Select-Object -ExpandProperty href`\n\n`$URLs = @()`\n\n`$desktop = [Environment]::GetFolderPath(\"Desktop\")`\n\n`$savefile = \"$desktop\\archiveorglinks.txt\"`\n\n`foreach ($link in $links){`\n\n`$URLs += $rooturl + $link`\n\n`}`\n\n`$URLs | Out-File -FilePath $savefile`\n\n&#x200B;\n\n\\*EDIT\\*  \nIf you come across an archive that doesn't have 7zip files, replace the last filter \"($\\_.href -like \"\\*.7z\")\" with the appropriate extension of the archive files, ie. \"($\\_.href -like \"\\*.zip\")\" for zip files.",
            "Am I doing something wrong? Do I really have to wait 4 days to download a PS3 game because the download speeds on [archive.org](https://archive.org) are so shit?",
            "why is it when i download from internet archive its really slow compared to google drive, is it always like that or am i doing something wrong?",
            "i suggest moving to torrent based approach. maybe start a simple torrent tracker for roms and allow people to participate. this is the best idea ever.",
            "the internet archive links seem to not be working properly as when i get to them the page is just \"go to parent directory\" and nothing else, it was working like an hour ago",
            "Can someone help me? i want to download all the roms from all the consoles, i started with the easier ones GB/GBC/GBA/N64/NES/SNES . So now im trying to start with the \"Others\" tab of the [archive.org](https://archive.org) .\n\nIn the Arcade Section there's a lot of MAME distros, can someone point me in what diffrences are there between them?\n\n    MAME\n\n* MAME MAME 0.236 Software List ROMs Merged \n* MAME 0.236 CHDs Merged \n* MAME 0.236 ROMs Merged \n* MAME 0.236 BIOS Sets \n* HBMAME 0.236 ROMs Merged \n* MAME Support Files\n\nAnd if you could same for the FinalBurn Neo\n\n&#x200B;\n\n    FinalBurn Neo\n\n* FinalBurn Neo ROMs \n* FinalBurn Neo Nightly ROMs + Support (Updated Monthly) \n* FinalBurn Neo 1.0.0.2 ROMs + Support \n* mobasuite.com FinalBurn Neo ROMs",
            "downloaded botw, and after unzipping it all, its just a folder with the game data? how do i turn this into a wud or wux? sorry if this is a stupid ass question",
            "Using this is pretty hard for my dumbass",
            "Is it me or is the Nintendo section of the internet archive not working. Did Nintendo take it down?",
            "fyi [archive.org](https://archive.org) is locking links down",
            "The way to bypass the quota isn't working for me. Anyone with the sames troubles ?",
            "What up ladies and gents, I'm looking for some help...I'm starting to build out my PS1 collection but my download speeds are beyond frustrating. My ISP is up to 600Mbps and even with the family streaming, a speed test is consistently giving me around 100 and 150Mbps. However, when downloading a file I'm barely getting 1Mbps. I've also tried hardwiring and it's about the same. Any way around this or is this just the way it is?\n\n\\*\\*\\*Disregard\\*\\*\\*\n\nFound my answer on this wonderful thread. Motrix downloader is a godsend :)",
            "What's the difference between PAL, RF, and NTSCU  for the xbox 360 isos?",
            "Does anybody know the password to the US version of MGS 3 for the PS2?  I got it from the GDrive link from Github.  ByAlvRo doesnt work",
            "[megathread](https://r-roms.github.io/)\n\n[vimm's lair](https://vimm.net/?p=vault)\n\n[romsfun](https://romsfun.com/)\n\n[emugames](https://www.emugames.net/)\n\nThis is all i know and i hope its help you",
            "hmm is this safe? im new to emulation",
            "is 1fichier for xbox link is gone?\n\nI found it really hard to search for a game with google drive :/",
            "Im confused, where do I download roms from",
            "REQUEST: It would be nice if links to older popular MAME sets were also included, like MAME 2003 (for many retropie systems) and MAME 2010 (0.139u1) for Nvidia Shield/Shield Pro devices.",
            "Some of the links for Nintendo DS roms have been taken down it seems.",
            "ok but google drive or mediafire?",
            "I recently found this ROM set here (https://archive.org/details/no-intro_romsets), and it has significantly more (e.g., about 1000 more for NES Headered) ROMs than the No-Intro set in the wiki (linked to here in the mega thread). Can someone help me understand the difference between these two ROM sets?",
            "Do we have numbers on how much storage is needed to hoard everything?\n\nI googled it but Im finding like 20 different answers. \n\nI want to download every NTSC-US game. Atari, nes, snes, n64, gamecube, GBC, GBA, DS, 3DS, Switch, ps1, ps2, ps3, psp, xbox, xbox360, wii, wii u. Including DLC and digital addons. \n\n\"Youll never play 80% of your collection why bother\" because I'm a data hoarder. Whether or not I play or download all these ROMs, I still intend on buying a 2nd disk shelf and eventually having a 240TB array in my rack by the end of next year. So hoarding every ROM isn't really an issue to me.",
            "Noticed that many of the retro links for Internet Archive are broken in the megathread. Not sure of the reason but wanted to let y'all know.",
            "Sweet",
            "Decrypted folder does not allow downloads...",
            "Whenever I try to load FE Fates Special Edition, it says \"Failed to Load Content\" I'm using Retroarch",
            "The Win3xO link points to a 404 on theeye, guessing the files have been removed.",
            "im trying to play FE Fates but i dont know what emulator to use, should i use Citra?",
            "How do the MAME downloads work? When I go to them it doesn’t look like those are games, though I’m pretty new to this so it could just be me too.",
            "Anyone know why the Gamecube USA files are all locked now?",
            "PS2>Internet Archive>USA>CHD>Part 1 - this leads to the following message:\n\n*The item you have requested has a problem with one or more of the metadata files that describe it, which prevents us from displaying this page.*\n\nJust wondering if this is the place to report it, or if it's something that takes care of itself later. Parts 2 and 3 seem to be working fine.",
            "3ds updates and dlc archive page went down...",
            "Are all these ROMs safe? no viruses or anything? I'm relatively new to emulation.",
            "Somebody is literally sending CP in the matrix chat, fix your shit u/SuperBio",
            "Where can I find Red Dead Redemption? I'm going kinda crazy finding it.",
            "[deleted]",
            "What about iso or wbfs roms for wii? IDK how to use nkit.iso or nit.gcz files.",
            "How do I get access to the google drive for vita vpks? It says I need permission from the owner.",
            "why are the ps3 roms gone?",
            "No-Intro - Nintendo DS (Decrypted) (2021-07-08) seems to have been deleted by the uploader.",
            "I cant access the roms site. Edge browser keeps saying ERR\\_CONNECTION\\_RESET",
            "where can i get a ps2 bio?",
            "Why is this taking 5 hrs to dload",
            "What is happening guys? I was downloading MGS4 yesterday and now all of the games are LOCKED! C'mon man",
            "Why are some Roms locked?",
            "Google folder got taken down, feels bad man, there were files there that aren't on archive.",
            "Question! Why is the first page of PS3 Roms restricted?? there's only one game I'd like to use on my RPCS3, and its on that page ugh.. If anyone knows please help!",
            "[deleted]",
            "Hello, \n\nI need some help from you knowledgeable people. I got a Wii U, I installed Tiramisu, but since I own only a Mac I cannot use this USB Helper tool that everyone apparently is using. The only way I managed to get some games working was with Loadline GX2 playing directly without installation, but in order for this to work I need the game unpacked in \"Code\", \"Content\" and \"Meta\" state. I only found one torrent tracker that had several roms in Loadline GX ready format, but I cannot find much else and even then most of them go black screen on me and don't load. \n\nThat being said could you help me with a workaround for installing games without USB Helper (it does not run on a Mac, I tried many times with Wine, Crossover and other) or if there is no option for me to install games, at least do you know where I could find games on a Loadline GX friendly format?",
            "for some reason, downloading games from the megathread is incredibly slow. I downloaded something the size of 15 gb and it took over 5 hourse. holy shit",
            "The [SatellaView](https://myrient.erista.me/files/No-Intro/Nintendo%20-%20Satellaview/) ,[Coleco](https://myrient.erista.me/files/TOSEC/Coleco/),[Commodore/Amiga](https://myrient.erista.me/files/TOSEC/Commodore/),[Amstrad](https://myrient.erista.me/files/TOSEC/Amstrad/),and [ZX Spectrum](https://myrient.erista.me/files/TOSEC/Sinclair/) roms are there in the thread to avoid its obtuse organization",
            "Should I use  A VPN when downloading?",
            "avast is flagging many, but not all, of the links. It didn't used to do this for me. Anyone have any info regarding this?\n\nETA: it's saying it's infected with URL:BLACKLIST. I presume this is because it's been flagged by someone as suspicious, but is it actually dangerous for use?",
            "CAN YOU ADD THESE IBM PC GAMES DEAD SPACE REMAKE, SONIC MANIA , FARCRY 6 AND FALLOUT 5",
            "u/SuperBio if you arent going to actively admin the matrix chat make another user an admin, us mods deal with multiple gore/cp attacks per day. Fucking respond to my dms man",
            "Old thread so hopefully a response comes. I've searched all over for Switch ones and i keep getting lead back to the megathread but nothing there (unless im blind) and all the other site are BS ad and popup riddled nightmares. Anyhelp? i only want a few...",
            "Hi, the No-Intro Collection 2022 is not available anymore, what's the closest thing available?",
            "This: [https://archive.org/download/SegaMD-Enhanced-ROMs/ROMs/Sega%20-%20Mega%20Drive%20-%20MD%2B/](https://archive.org/download/SegaMD-Enhanced-ROMs/ROMs/Sega%20-%20Mega%20Drive%20-%20MD%2B/) ...is not endorsed by the developers of MD+ patches. It is also incomplete and cherrypicked.\n\nThis is endorsed and maintained by the developers themselves: [https://archive.org/details/mdplus\\_collection\\_22\\_04\\_16](https://archive.org/details/mdplus_collection_22_04_16)\n\nWe do not appreciate the files being renamed, redstributed, being cherrypicked or the lack of credit given to audio editors by not including them in the names of the files, and having their names removed from the comment in the CUE files.\n\nPlease replace the link in the megathread with the proper collection. Thanks.",
            "pokemon links on this dont work",
            "Everything in the Internet archive retro side is now no longer working",
            "I am seriously sorry, but I'm 30+ and don't have the time or energy to look through all the posts 😅 I'm an x - pirate, been through that whole pirate Bay Era, even partly through the vpn+piratebay era, and lastly the \"VPN-go-through-hell-and-back-after-you-accept-thisandthatproxy-shit\" and I'm done. How can a pirate get his bootay once again?",
            "What is the new google drive bypass method? Ever since gdbypass.host went down I haven't been able to download anything.",
            "Nice",
            "How do you search for specific games with Google Drive? The \"Search inside...\" function doesn't work properly",
            "I need a rom for Pokémon black and white. I have desmume 64 bit for windows 10. Can someone please leave a link to it?",
            "This is awesome, but I'm curious do we have backup of these anywhere so if Google pulls the plug we still have them?",
            "how to download large archive rompacks they stop on my browser?",
            "What happened to the AlvRo Mirror Google links all say access denied now. Please advise.",
            "is there anyway to access the gdrive? my access for it has been deleted, and i cant reconnect it back???\n\nsorry for bad english",
            "Does anybody else get it where it says they \"need access\"? it never did it to me before.",
            "sony ps3 tab is locked",
            "Ive uploaded all the triforce roms i could find [here](https://archive.org/details/triforce-roms), I think it should be added to the megathread.",
            "Currently the following Gen 1 Pokémon games are provided;\n\n* Pokemon Red (USA)\n* Pokemon Green (Japan)\n* Pokemon Blue (USA)\n* Pokemon Yellow (USA)\n\nThis is incorrect as while it's actually more complicated than this (as some Pokémon fan will be happy to tell me in the comments), the releases happened essentially like this;  \n\n\nRed JP     ---> Red US  \nGreen JP ---> Blue US  \nBlue JP    ---> \\[Unreleased\\]  \nYellow JP ---> Yellow US\n\nMeaning the list should be;\n\n* Pokémon Red (USA)\n* Pokémon Blue (USA)\n* Pokémon Blue (JP)\n* Pokémon Yellow (USA)",
            "if this is the right place to request for roms.... any idea where i can find last of us (without the file being split into so many parts that i end up exceeding the download quota on mega or gdrive)?",
            "I got Rhythm Heaven Megamix from hShop but it doesnt work with citra, the screen stays black with 0 fps. i tried 3ds, cci, cia. If anyone could guide me it would be greatly appreciated",
            "Amazing",
            "Great Job on the Github Page",
            "The Wii U files don't work.",
            "Some games have Rev versions and then a version that has no Rev. IE like Zelda Rev !, Zelds Rev 2 or Zelda. Which is the preferred file to use on retropie?",
            "[deleted]",
            "What happened to the nds roms? They don't seem to work anymore",
            "Trying to get a DS game but they all have locks on them. Is this cause I need to make an account??",
            "I'm sorry this might be a silly question but I was looking for a mario kart wii ROM which has all the characters, levels and bikes unlocked but haven't been able to find one (I don't even know if its possible).",
            "Guys i cant access the github page :/",
            "The site is not loading at all",
            "I cant go to the github, I've tried in two different browsers and keep getting err\\_connection\\_reset",
            "my antivirus said the site is trying to phish me",
            "not sure if this is the right place, but i think its better than making a new thread.\n\nIm trying to get a rom via 1ficher, but when i download it it keeps loading until i get the error it takes too long to respond. (i have this with all 1ficher downloads atm) does anyone else experience this at the moment or just me?",
            "So I downloaded ultra moon, stuck it in a folder, added the folder to citra, but it won’t show me the game in citra can anyone help",
            "Theoretically speaking, how much memory would it take to download everything from the github?",
            "I'm trying to play an original Wii game called Pokemon Rumble but I can't even seem to find it here. Does anyone know where I can find it :(",
            "for anyone else that sees that some of the download links are locked, like on PS3\\_ALVRO\\_PART\\_8 for example, just make an account on internet archive. should be able to download after that.   \nthats what worked for me at least lol",
            "is there a torrent romset? [archive.org](https://archive.org) takes ages",
            "how do I find the wii u roms? ctrl f doesn't work",
            "Anyone know why the 3ds Complete Collections are empty? Did they get taken down or something?",
            "What does Rev 1 or Rev 2 in some ISO's mean. Any difference?",
            "Looks like the GameCube RVZ redump was just taken down, I noticed the files got locked part way through a couple downloads.",
            "Is archive.org locked for anyone else? Just me?",
            "Looks like the links are down?\n\nEdit: Per Internet Archive: ATTENTION: PG&E, our local power company, is implementing a planned power outage today near one of our datacenters.  \n\nThey now report that they will be done before 2pm PT.\n\nPlease expect some disruptions in service. Thank you for your patience.",
            "the GameCube iso and rvz links are taken down for me on archive.org--anyone else having the same problem?",
            "any idea why i cant request access to google drive for 3ds?",
            "`git clone` [`https://github.com/john-corcoran/internetarchive-downloader`](https://github.com/john-corcoran/internetarchive-downloader)   \n`cd internetarchive-downloader`   \n`pip3 install -r requirements.txt`   \n`python3 ia_downloader.py download -c username password no-intro_romsets /destination/dir`\n\n&#x200B;\n\nreplace username and password with your [archive.org](https://archive.org) login info and /destionation/dir with the location you wish to store it",
            "I wanted to download Skate 3 (PS3) from the Archive but the link for the game is greyed out and says that its restricted, is there an alternate download that I can use?",
            "[deleted]",
            "this is sick af 🌚💫💦💙",
            "Sydicate PS3 - can anyone point me in the right direction? I have been trying to replay this underrated masterpiece for years now.",
            "Im looking for castle crashers rom :/",
            "I found the 3DS roms, but they download to my Mac as .txt files instead of .cia \n\nWhat do I need to do?",
            "Anyone have luck with the 360 games? Ive DL a couple and everytime I run them through abgx360 they fail. I then just burned them for the hell of it but that didnt work either. 360 has a flashed DVD drive and I have a ton of other games from different sources that do work but any from archive is a no go.",
            "In the Wii U retail folder, many of the games have 'DLC' and 'Update' links as well as the base game.  If you want to have the DLC and the update as well, do you need to download three of the packages or will one basically just take precedent over the others?  For a specific example, check out new super mario bros u.  Also for context, looking to emulate on steam deck",
            "Looking on the 3DS archive.org ROMs, what does it mean if a title has “(Rev 1)” after the game name?",
            "Can’t find family guy video game for psp",
            "Where would I even begin to find ratings or know what’s good in the Super Mario World hacks section.. there’s just so many (just going in the “adventure” section even.)\n\nIs anyone able to point me in the right direction to find out which ones are good?\n\nOr if by chance does anyone know some good chocolate mario hacks that aren’t insanely difficult?",
            "my god why is the download speed so slow for these",
            "expansion naughty ludicrous pause mountainous slimy governor knee salt complete\n\n *This post was mass deleted and anonymized with [Redact](https://redact.dev)*",
            "is there a GBA pack for just English?\n\nthe full nointro pack has 3360 games, is over 10GB and **more than half** of that is just duplicates in other languages......\n\nmeanwhile the googledrive link only has 165 games, so its missing like 80%\n\ntyvm for all the hard work",
            "vimm's lair. ugly but functional",
            "DSiware has been taken down it seems.",
            "\"No asking for ANY Nintendo Switch content\"  \n\n\nI respect that, but why is that?",
            "Lol still they post elsewhere.",
            "LMFAO! This has to be one of the most innocent comments I've seen in awhile. You own the titles you're going to be downloading, RIGHT?! (Wink wink) That's when you IMMEDIATELY respond with a firm \"YES\". You're good homie. You think the maggots at Nintendo care about you? They don't. So, get those roms, while you can. Ya dig!?!",
            "What happened to the Wii U ROMs? I can't download a single one.",
            "Is there an English translation of the jp version of yugioh zexal world carnival for the 3ds, or is there a fan patch that adds the removed jp content to the English version. And where would I find it.",
            "Why are the pc games locked?",
            "Can someone clarify why Ps3 #-C isn’t available. Those are all locked? Wanted to play Alice madness returns.",
            "Dahmm decades pass before the ROMs download even really small ones  Im on 1k download speed anyone has a fix?",
            "God, I wish I knew this thread earlier! I downloaded God Of War Collection rom 3 times on other websites and failed at 10s GB every time because of timeout. And I'm using capped bandwidth...",
            "Up because a lot of poor souls on this sub still doesn't know about the Megathread",
            "I found something you may want to look at - PS2 Redump (S Part 4) isn't linked.",
            "Based",
            "i have been using this site for a while now it is the best i hve ever found for roms thanks",
            "Does anybody know why I can't get the NES roms to work in retroarch while running with the Nestopia UE core?",
            "Is there a way to find 3ds roms that aren't encrypted and just will run on Citra? I don't remember running into this problem before a few years ago, but now everything i try to run says it's encrypted. Is there a place on the roms list that has these? is there a way to make these roms playable i have from the roms list so they can run? keep in mind i am rather dumb.",
            "i need it explained but in like B A B Y terms",
            "Is there a process on how to download Roms from the archive and put them onto my Steam Deck? Like a walkthrough of sorts?",
            "what does (no-intro) mean? for example \"myrient (no-intro)\"",
            "> Some Internet Archive items will contain torrent files to provide another download method. However, the torrent's files listing is usually incomplete compared to what is listed on the website. For this reason, it is recommended to use direct downloads with a download manager instead of torrents.\n\nInstead of \"is usually incomplete for reasons\" I would put that they are \"incomplete\" because an Internet Archive torrent can index up to 75GB, nothing more. If the item is bigger, all further files are skipped. If you check any \"incomplete\" torrent, it will be 75GB for sure.",
            "One suggestion i've been meaning to share for a while now for the r-roms site to link Vimm's Lair in addition to archive.org's redumps for the og xbox roms. The redumps are formatted as huge dual layered .iso files (very annoying to try to make work with emulators) and the working xbox emulators only use .xiso. Which is what vim's lair easily lets you download instead in addition to the larger .iso files if you want those too.",
            "Is anyone else having troubles opening up some of the mega thread pages such as the ps3   \nMyrient and some other ones?",
            "a lot of these do not work, ive downloaded every shin megami tensei, silent hill, dbz etc and they dont work.",
            "I might just be dumd but how do I install a PS3 game from the alvro part? I have the BLUS30027 folder but idk what to do with it.",
            "So ive downloaded several roms in the past especially from vims lair. I wanted a zelda wind waker hd wua file and saw its on archive org. But im scared. Is it safe there or will the ninjas get me ?",
            "i cant find tears of the kingdom",
            "Do these links contain any malware?",
            "Whenever I use the ROM, be it in lumeroid or citra, I'm hit with invalid ROM, or your ROM is encrypted, what do I need to do to fix this?",
            "Hamburger",
            "Does anyone know where I can get a ROM for Ape Quest on PSP (with or without the DLC)?",
            "Internet Archive has Breath of the Wild with its DLC, but as a WUA, which Cemu doesn't accept. How do I take that and change it into a WUD or WUX?",
            "guys where can i get pokemon scarlet or violet?  \nfor yuzu emulator.",
            "is there a way to speed up the downloads, getting sly 3 trilogy atm and it says approx. 10 hours to download a 22.7g file and the issue is not my internet speed",
            "how to download?!?!?!?!?a",
            "Does Anyone know how to make a rom for a psp game or maybe know someone who can make one",
            "How to get Pokémon Alpha Sapphire version patch 1.4?\n\nMy friend is struggling with finding and downloading a patch for Pokémon Alpha Sapphire. She’s playing on a Redmi Note 12 with 6GB RAM and 128GB ROM. Can y’all help a guy help out a friend?",
            "Thanks",
            "What is the best place to get GameCube ROMs/ISOs? I tried a lot of the places on a list from a top comment in one of the posts on this sub, but most either didn’t have GC or didn’t seem to exist anymore.",
            "Look in coinops torrent it is strange to say but you will find some there",
            "Hey before anything else. The ps3 files in the archive says ps3ALVRO but I know you need pkg file so please how do I go about those before I start download. Also clicking on view files show a bunch files which doesn’t have pgk extension. Sorry if I sound dumb, first time using a ps3",
            "Does anyone have a safe rom of Kirby Crystal Shards 64 that's compatible on project64?",
            "Is there a way to recover a corrupted save file? Been using a bunch of quick saves lol",
            "The megathread and its backup aren’t working",
            "[deleted]",
            "Hey guys I'm very confused about the IBM PC section. What is it? And how does it have gta v listed in it as well?\n\nAlso where switch?",
            "I've searched for a good couple of mins through the thread and haven't found anything on it but I was wondering how to get a rom for pokemon crystal , I'm new to emulators the only ones being on website ones, so if anyone could help that would be nice.",
            "I’m very lost, trying to get the Xenoblade chronicles x to work, it states to use cdecrypt to unpack, but that doesn’t seem to do anything",
            "Pardon my ignornace, but is archive dot org, safe to download from without a VPN?  We won't get DMCA from our ISPs?",
            "5000th comment",
            "Is there something like this for rom hacks? Its a pain to have to patch them all.",
            "Hi all where can i find Pico-8 ?",
            "really great but i couldn't find hack Sekai No Mukou Ni + Versus ps3",
            "I am using steam deck emudeck for PS1 games, the ROM part and iso i get, but what about BIOS ?? which bios should i get ??\n\ni have rom for Xenogears US version\n\nappreciate assistance",
            "Hi! Does anyone know how I can get Pokemon Ultra Violet to work on Delta?",
            "I downloaded a USA version of shadow the hedgehog but it was still in Japanese",
            "How do you download the whole directory? I’m trying to download the Nintendo 64 directory, but I’m not seeing any way to do it.",
            "How do you use Nintendo DSi (Digital) ROMs? It doesn't download a .nds file, it's just a .file file that doesn't do anything.",
            "Are the Internet Archive links for both PSP Redum down? \n\nhttps://archive.org/download/redump.psp\n\nhttps://archive.org/download/redump.psp.p2",
            "My normal download speed is 20 kb/s. AN XBOX GAME IS DOWNLOADING AT 250 KB/S WHAT THE ***frick***",
            "i need 3ds roms. give them to me now.",
            "[deleted]",
            "this megathread sucks",
            "For me, some worked, a lot not. Games like Dragon Ball Budokai Tenkaichi 2 started and can be played no problem... then you get to Resident Evil Outbreak/Outbreak File 2 that displayes a black screen and never actually  start.  \nPretty much 90% of these isos either needs a fix or to be substituted entirely.",
            "Basically, every link in the retro category is infected with Blacklist so I don't suggest going there for retro roms but everything else I checked seemed ok, my anti-virus didn't go off, I even got sonic R and I had a hard time trying to find a rom for that, so this is pretty useful. Thanks!",
            "I started downloading the no-entry torrent for all the Retro games (88gb) and it got stalled at 99,9%. Did anyone else had this problem? It's so frustating",
            "Anyone have the US BREAKDOWN file downloaded? Data quota exceeded on my end",
            "Anyone have mgs4",
            "Hi, I am trying to decrypt .3ds files for Citra but the links the bot sent are not working. Using the first link, when I try to decrypt the log gives me this: \"'decrypt' is not recognized as an internal or external command, operable program or batch file.\" And the pastebin link only gives me a blank page. Is there another way to decrypt? Thanks in advance!",
            "[deleted]",
            "The Nintendo Wii games from No-Intro Collection 2022 are missing ENTIRELY! Please fix this ASAP!!",
            "Does anyone have Sonic Generations Xbox 360",
            "PSP Dragon's Lair not in the dump. Anyone know where else to get it?",
            "I’m tryna find a Wii virtual console download section🙃🙃",
            "i have not been able to get hardly any of these roms to work on the steam deck. Only a select few.  not sure what i am doing wrong.\n\n&#x200B;\n\nreally want to get ncaa football but no roms seem to be working. And so far, there have been no bios folders to download for these games. what am i doing wrong?",
            "How do you get the bios in the same iso file from the game you extracted? On my old pc idk what I did but I never had to chase down or search for some bios whenever I extracted a rom. Everything was in one single file ready to go but whenever I try on my new pc I get the retroarch error that I need a bios to get it to work yet the only file I see is the iso",
            "Im new in reddit and i looking a Splatoon2 rom but i didn't get the rom because the Adblock   \nand i can't disable it that's why I want to look for it from mega or mediafire or google drive",
            "Guys I used the link ITT to download HGSS and tried running it on Desmume. The game looks fine but the start button doesnt work even though I've tried control config. Any ideas?",
            "I tried I can’t have a legit ROMS for ECLIPSE",
            "The ROMs contained in the Misc link under \"English Translated ROMs\" are corrupted. The uploader did not use chdman correctly.\nExamples of corrupt .iso files can be found in the PS2 & PS3 translations.\nSony - PlayStation 2 [T-En] Collection/\t\nSony - PlayStation 3 [T-En] Collection/\n\nI suggest they are all corrupted and need to be re-done.\nAll the ones I tested were corrupted.\nYou can test this by patching this game yourself and converting it to chd: Star Ocean - Integrity and Faithlessness (Japan) [T-En by RikuKH3 & Haxxxen v18-09-2020]\nDouble check the one you have to the one in the Megathread. You'll see that they are different in file size.\n\nThe games \"may\" work in emulators, but that doesn't mean they are not corrupt.",
            "Jd1 rom pls no virus",
            "Hi I'm new I don't really have to much experience with roms or emulators at all to be honest I recently just got my first computer and would like to play Pokémon soul silver. I downloaded the link of the game off of the first link but I don't know how to play it I know you need a emulator and I don't know how to find that all or what's recommended. Also I don't know if this matters but I do intend on using a rare candy code in the game so i don't have to grind for hours. I don't know if that matters in anyway to my problem but I wanted to state that. Thanks sorry for asking but I don't relay understand and would like to know and be able to navigate my self through roms and emulators.  Thanks",
            "Super Smash Bros. Melee doesn't work",
            "tenchu z xbox 360 has virus called wackattack something something",
            "new to emulations, where can you find Nnntendo switch roms?",
            "There is no Switch game...",
            "what's the difference between encrypted and decrypted nds roms?",
            "take my upvote, you absolute legend!",
            "Ok so like 1k people probably know now, so downvote this n spread thru word of mouth so the Googs can't fuck us lol",
            "It appears someone has placed stacks of inappropriate content (Hentai) to the SEGA Dreamcast CDI collection on google drive.   \n\n\nIt obscures some of the links.",
            "Sorry, a clueless person here. I created an account and can download from [archive.org](https://archive.org), but I don't see any steps or directions talking about Google Drive, how is Google drive involved with the downloading, or has someone shared the same roms just from a Google drive account?",
            "its so slow\n\ndoing that",
            "It just stays eternally zipping for me :(",
            "Constantly getting errors when trying to make a copy of any zip. Is this happening to anybody else? Am I missing something here?",
            "Not make a copy\n\"Create a Shortcut\"",
            "how would i put the copy in the folder without downloading it?",
            "Whenever I download files and unzip them they are empty. plz help",
            "You are an absolute legend thanks",
            "thanks for the tip. the copy keeps failing for some reason, super annoying!",
            "[removed]",
            "its stuck on zipping :\\[",
            "The files are coming out at corrupted and also stops half way after extracting file what have I done wrong",
            "make a copy of what? exactly",
            "This doesn't work I've tried it..",
            "I know im a year late but happy cake day",
            "Wait.....does this have anything to do with why it's saying I only have 15 GB available when clearly my extended storage has over 300GB? My Google One Storage has over 2TB. I tried to upload a file that was 70GB and it was saying I only had 15GB available",
            "Big brain",
            "Click the links go to the page pick what you want click the corresponding link and download.",
            "What's confusing you?",
            "Appreciate all of this.\n\nQuestion, though: why do places like 1fichier and Vimm's seem extremely consistent with downloads failing during the last 5-10%? It's irksome to no end to sit for hours just to get a \"Download failed\" message.",
            "What about slow downloads?? I can't get higher than 1 mb/sec. I can get google drive at 19mb/sec..",
            "no matter what i do i can't download anything from archive.org",
            "jdownloader ftw",
            "Hi, I tried to download FE Fates dlc, but the link to Google Drive is locked.\n\nShould I wait until the access is allowed, or r there any other way to download it?",
            "I have an account, but Motrix won't work to download anything on there anymore. Any alternative download managers? Downloading it with my web browser is too slow.",
            "man this is so stupid that i have to make a dumb account to download games from a archive",
            "What's the issue? The link is in the post.",
            "romhack collections would be extremely nice (also fantranslations)",
            "Whats the megathread?",
            "To this day there are still idiots who can't find it. Every day there are comments asking where to get the Roms. It's incredible how stupid some people are...\n\nWhen I first came here I was able to figure it out within 5 minutes or so. I think some people just want everything handed to them on a silver platter.",
            "Thank you so much. You are a life saver. But, \"Free Download Manager\" has limitation up to 100 links. I suggest using the jdownloader2. What's up with these 'Europe, Japan, Germany, France,' What are they doing for PowerShell script?",
            "Hi, Thanks for the idea\n\nI modified the code to include the download and all. Just make sure to change the 3 parameters at the top: $rooturl $filetype and $folder, save this text as fetch.ps1 and run  \n\n\n`Add-Type -AssemblyName System.Web`\r  \n`$rooturl = \"https://archive.org/download/nointro.gb/\" #change to archive's root directory, ensure trailing slash exists`\r  \n`$filetype = \"*.7z\" #change file type`\r  \n`$folder = \"G:\\Gameboy\" #folder to store roms in`\r  \n\r  \n`$links = (Invoke-WebRequest -Uri $rooturl -UseBasicParsing).Links | Where-Object {($_.innerHTML -ne \"View Contents\") -and ($_.href -notlike \"*Europe*\") -and ($_.href -notlike \"*Spain*\") -and ($_.href -notlike \"*Japan*\") -and ($_.href -notlike \"*Germany*\") -and ($_.href -notlike \"*France*\") -and ($_.href -like $fileType)} | Select-Object -ExpandProperty href`\r  \n\r  \n`foreach ($link in $links){`\r  \n`$webSource = $rooturl + $link`\r  \n`$decodedURL = [System.Web.HttpUtility]::UrlDecode($link)`\r  \n`Invoke-WebRequest $webSource -OutFile $folder\\$decodedURL`\r  \n`}`",
            "Thanks! I used the output from this script with `wget -c -i archiveorglinks.txt` seems to work pretty good, faster than downloading the full rom packs and supports restarting",
            "Use a VPN to connect to San Francisco, it will massively boost your download speeds.\nMine went from a few hundred kb/s to 10-20 mb/s",
            "i have downloaded a 30+ GB game with 1\\~2 mbps using chrome.",
            "same thing for me",
            "You can try a download manager. But Google have more bandwidth and resources than IA obvs",
            "I definitely have more luck using Jdownloader but it is still slow. I assume it's just their bandwidth.",
            "If you use jdownloader 2 you can download multiple files at once. Because the bottleneck is internet archives servers you can download as many files as once as you need to fill up your download bandwidth. Keep in mind this needs a beefier cpu but nothing crazy",
            "No.\n\nBecause if people stop seeding, then it's dead.\n\nArchive stays available regardless.",
            "Torrent transfer rates are unreliable and DDL is usually safer for users since it's basically impossible to be tracked by anyone but the host.",
            "it's been 2 years, how is it going with the collection?",
            "it's been 3 years, how is it going with the collection?",
            "based off of my experience, you may have unzipped it twice. the second zip file is actually the iso that can be read by the emulator, so there's no need to extract the game data folder and bin files from that.",
            "Did you figure this out? I'm having the same issue. I only unzipped once and its a bunch of game data files .h3 and .app.",
            "Late to the party after 2 yrs but I finally got BotW to work by using Wii U Downloader:  \n[https://testing.agilly1989.xyz/#/WiiU/Tools/Nusdownloaders/WiiUDownloader](https://testing.agilly1989.xyz/#/WiiU/Tools/Nusdownloaders/WiiUDownloader)\n\nFyi, I selected the \"Decrypt contents\" download option.\n\nGood luck!",
            "Ditto.",
            "What's the issue?",
            "Do you mean the section containing Wii games or are you wondering where things like GBA and N64 ROMs are? If it's the latter they are located under the Others tab",
            "For example?",
            "Will making an account enable me to download the files regardless?",
            "> \\*\\*\\*Disregard\\*\\*\\*\n> \n> Found my answer on this wonderful thread. Motrix downloader is a godsend :)\n\nThanks for making the effort!",
            "How did you use Motrix? When I copy and paste the download link it gives me an error",
            "It’s the region.\n\n~~approximately, look it up yourself for exact designations:~~  \nNTSC-U – America,  \nNTSC-J – Japan,  \nPAL – mostly Europe/rest of the world?  \nRF – I guess region-free.\n\nIt’s mostly the same for other systems too.",
            "NTSC-U/C (or NTSC-U): North America,\nNTSC-J: Japan,\nPAL: Literally everywhere else,\nRF: Region-Free (I assume),\nalso I reccomend PS3 over X360",
            ">ByAlvRo\n\nSame issue here, i downloaded 40GB of god of war 3 for PS3 and i found out it needs a password to extract the files, i dont know where to look for this password",
            "These are all trusted sources so unless you click on some obscure ad (you should be using an ad blocker anyways tbh), you won't get any viruses. Normal emulators and ROMs won't break your computer.\n\nIf you mean legality, no one is going to come for you if you download ROMs. They're probably the safest media to \"pirate\", maybe just under books.",
            "Im wondering the same thing.",
            "As long as you know what your doing and use your common sense, it's obvious to be careful when downloading emulators and ROMs, especially with Executable files, if you want to be extra careful get an anti virus program.",
            "[deleted]",
            "The first link in this post, obvs.",
            "u/Superbio will tidy it up",
            "No.",
            "**Info for .cia files:**\n\nIf you are trying to run an encrypted .cia on something like Citra, it's important that you use this tool.\nhttps://gbatemp.net/download/batch-cia-3ds-decryptor.35098/\nOr add the following AES keys to Citra\nAES Keys for Citra, https://pastebin.com/tBY6RHh4\nClick download on Pastebin to download the text in this file as a .txt file.\nWindows installation instructions\nAdd the downloaded pastebin text file to C:Users\"your_user_name\"AppDataRoamingCitrasysdata make sure it is named aes_keys.txt\nLinux/MacOS Installation instructions\nAdd the downloaded pastebin text file to ~/.local/share/citra-emu/sysdata make sure it is named aes_keys.txt\nRead this for more information, https://citra-emu.org/wiki/user-directory/\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Roms) if you have any questions or concerns.*",
            "Don't know if you ever found it but [https://www.retro-exo.com/win3x.html](https://www.retro-exo.com/win3x.html)\n\nIt was renamed.",
            "Come on dude. A) it's a silly question B) it's trivial to detect a virus",
            "https://dlpsgame.net/?s=red+dead",
            "Which system is it for?",
            "The owner's account was disabled so all files associated with that account (most of the links on the site) were deleted.",
            "Older version of you want it\n\nhttps://archive.org/download/noIntroNintendoDsDecrypted2020Jan20",
            "Try other browsers  \nWorks on chrome",
            "Megathread",
            "Archives are not controlled by this sub tbh.\n\nBut you can get around the lock by following the instructions on your links",
            "make an account in [archive.org](https://archive.org) then reload the page",
            "I was wondering the exact same thing! You’re talking about the A-C list on archive.org, right? Have you tried looking for your game on Nopaystation? I wouldn’t know who to contact to try on archive.org to get them to fix it.",
            "Read the first page of the megathread",
            "Don't use avast",
            "Thanks for info, I'll have the link replaced, this might take a day or two as I'm not the only one working on the megathread these days.",
            "By sailing the seven seas, but replace seven seas with threads. There is a bay no more, the great expansion took place",
            "The home page of the megathread covers the new google drive bypass, check that out.",
            "GDrive just has a shitty interface and an awful search tool. I've found the best way is to just get the Desktop Google Drive thing and look through there. Basically allows you to look through drives using the Windows File Explorer, which is much easier to use.",
            "That's easily found in the megathread dude.",
            "ia and a few other places",
            "Use [jdownloder2 adware free setup](https://jdownloader.org/jdownloader2).",
            "The owner's account was disabled so all files associated with that account (most of the links on the site) were deleted.",
            "The owner's account was disabled so all files associated with that account (most of the links on the site) were deleted.",
            "Sorry to be late but I have the ITCH to fix\n\nAmerica never got a version of Pokemon Green at all, Blue and Green aren't replaceable to each other. That's why Japan got Pokemon Blue, coming with all the updated sprites we got in the US.  Thus, your middle list should be:\n\nRed JP -[is replaced by]-> Red US\n\nGreen JP ---> [Unreleased]\n\nBlue JP ---> Blue US\n\nYellow JP ---> Yellow US",
            "Best bet is the torrent.",
            "Using dolphin?",
            "It's a false positive on Avast's side. The megathread is just HTML files hosted on github, it can't and never will phish you, I can promise this.",
            "[removed]",
            "It's probably abandoned by the owner",
            "Screenshot",
            "slow, ugly but functional.",
            "fellow yugioh fan here. my guess is that it is not in this megathread. considering how yugioh has lost popularity over the years, this megathread does not even have the fan-translated version of tag force 6 and arc-v tag force special, I suggest you look in other places. I got the isos for the 2 games I mentioned from some random site like 3 years ago, but jp version of zexal world carnival? that seems like a tough one considering duel carnival wasn't a very popular game compared to Tag Force games",
            "Get d3crypt3d roms obvs",
            "Best to use USB Helper or nusspli for Wii U games.",
            "operator error",
            "Provide the link then",
            "Did it get an official release?",
            "It's clearly labelled",
            "Thanks! All I did was copy it from a diff site but enjoy. :-)",
            "I'm trying to get the gameboy advance collection and it says Wii u I don't understand does anyone have the gameboy advance collection on theyre google drive they can share",
            "TY. Legends recognize Legends",
            "Google can;t do shit :)",
            "Too late, Google CEO definitely saw it.",
            "probably the guy that did this: \\*successfully trolled\\*",
            "Hey no complaints here lol",
            "hentai is bad .? god what is wrong with u we love it was added",
            "well i used the gdis",
            "I know it's been nearly a year, but did you figure it out",
            "for real, i go to the popular games tab, clip a game, and it just starts downloading with 90kb/s. Google Drive isn't mentioned at all",
            "slow is better than nothing",
            "ur doing it wrong",
            "Thank you, I can share some if needed. :)",
            "But where are the games? I homebrewed my wii and need games",
            "all of my games download in formats that you can't run on anything",
            "As far as I know, that's just a general issue with [archive.org](https://archive.org). There's not much you can really do. With the site having so much data, and so much people downloading from it, I'm not super surprised that download speeds may be slow.",
            "Same here super frustrating",
            "Jdownloader, configure it with your account credentials",
            "What link are you talking about. I just joined so I don't know much about what's happening.",
            "Probably would be easier to just point people to romhacking.net to patch the roms themselves given how many and how many parts there are.",
            "[This archive has some ROM hacks, not all of them but most of the good ones.](https://archive.org/details/@cylum) [This one requires an account to access all archives, but has some Wii ROM Hacks that are playable on actual hardware and emulator.](https://archive.org/details/WiiRomSetByGhostwarePart2)",
            "A lot of people are weary lol, people want it simple because \"complicated means dangerous\".",
            "riddle me this; I also located megathread and downloaded old game in 8 min. but, how do i play the game? I just have a ps2 file on my pc",
            "Sorry for the later reply, I didn't want the links of the roms from those locals, so that was to prevent duplicate links for the same games. Glad the script helped you!",
            "This is a pro-level tip that should be added to the OP. Instant time saver.",
            "only good comment containing the words \"San Francisco\"",
            "future caption sophisticated resolute lavish zonked overconfident apparatus yoke shy\n\n *This post was mass deleted and anonymized with [Redact](https://redact.dev)*",
            "I know it has been 6 months, but thank you so much. This tip should be pinned or something.",
            "legendary tip",
            "This still works, went from a 2 hour download to 30 mins. Legend",
            "it is the other way around. torrent involves thousands of people, especially those with seedboxes and severs. ddl sites are gonna delete the isos anytime they like.",
            "instead of providing direct links, they could use torrents. so that it won't become dead links since instead of hosting direct links, they use that bandwidth and server capacity for torrents. you could only gain from it.  \n\n\nBUT, direct links are handy and easy, requiring no extra application to use. wich is also nice.",
            "how did you get past the download quota?",
            "I ended up using Wii U USB Helper, I could never figure out what went wrong",
            "Figured it out eventually i'm fine thanks tho for trying to help me",
            "Can you help me? i want to download a 3ds game  and it takes me to a site called 3h",
            "this whole page is locked for example  \nhttps://archive.org/download/PS3\\_ALVRO\\_PART\\_8",
            "appreciate it, this should be added to the roms megathread because it's not really explained",
            "PS3 is better than xbox 360 in many regards yes but I grew up with the 360",
            "The day one ps3s with ps2 and ps1 games running natively was the greatest console ever made",
            "Try \"vnsharing\"",
            "As someone else has said these are trusted sources that are frequently utilized. \n\nThere appears to have been a fair amount of effort put in to creating and vetting this list. If something was known to be unsafe it is likely 1 of the over 100,000 people that subscribe to /r/ROMs would have called it out.",
            "What post?\n\nThe one at the top of this page.\n\nWhat page?\n\nThe page of the site you are currently visiting and staring at.\n\nWhat site?\n\nReddit.\n\nWhat's Reddit?\n\nThe place you are currently at, which is the Roms Megathread reddit.\n\nWhat are roms?\n\nDigital copies of video games, the thing you came here to download.\n\nIm confused, where do I download roms from?\n\n&#x200B;\n\n(Sorry, I got bored waiting for a rom to download and thought I would make a loop.)",
            "fuck you",
            "I did find it, but thanks for the link.",
            "I don't see how it's \"silly\". There are so many other places that DO have viruses. As I said, I'm pretty new to emulation.",
            "I got it, I added the site to my exclusions in avast",
            "I’m sorry. What do you mean instructions on your links?",
            "What links?",
            "Exactly! I tried looking for it on nopaystation and its so confusing! ugh, have you had any luck?",
            "Just tried the method described in the github.  Still get the quota message.",
            "Where do I find it?",
            "Let me preface this with a correction, Blue JP came out before the US games.\n\nThe difference between Japanese Blue and US Blue is equivalent to the difference between US Blue and US Red.\n\nBy your logic the Japanese games (RGB) and the US games (RB) should be considered different \"versions\" due to their comparable differences.\n\nWhile the Red US, Blue US, and Blue JP all run the updated engine, while the version differences between versions don't match up.\n\nThe specific version differences in Blue JP (besides the updated engine and sprites) don't line up with your chart.\n\nTo follow your logic would mean the following.\n\nRed JP ---> \\[Unreleased\\]Green JP ---> \\[Unreleased\\]Blue JP ---> Red US & Blue US\n\nI don't really think that the updated engine and sprites are that of intentional version differences but simply they improved the game sense then. Had all of the versions released at the same time instead of being separated over time, they probably all would've used the new engine and sprites. I would prefer to think of them more raw.\n\nIn Japan you got two main series games and a third improved main series game.In US you got two main series games using the improvements of the third game while still being the first two just with the third's improvements. This is partially backed up by the fact that the US remakes are FireRed and LeafGreen.\n\nOfcourse in reality this is all subjective and the best alternative would be to include both the JP and US releases sense in the end, the gen 1 version differences for the main games are equivalent if not more than the version differences.",
            "Thanks.",
            "Where could I get those?",
            "I have been playing Pokemon SoulSilver US Rom on an Android emulator. But since I have been using quick saves frequently the saves became corrupted but I can still use the quick saves. I wonder if there's a way to fix this.",
            "It’s clearly labeled where?",
            "oh right, still saved my computer from being thrown out the window",
            "how you \"copied it from a different site\"?",
            "Pretty sure it's in the \"Other\" section with NES, SNES etc.",
            "this is my favorite comment  on reddit.",
            "Wrong they can. They are like Skynet.",
            "google search brought me here lol",
            "Sanest Reddit user",
            "Degenerate",
            "😀 what?!",
            "I'm new and have not so hmu if u have info",
            "\"This free service isn't fast enough gawd\" - reddit",
            "You're\\*",
            "Tell them how to do it right then?",
            "Damn I didn’t expect a response, thanks for an acknowledgement on a year old comment.",
            "So when you go to the GitHub page, there should be a bunch of game company names on the top and you should be able to find Nintendo Wii after some scrolling when you click on Nintendo.  Once you find that, you just have to click on one of the 'Link' and it'll bring you to the internet archive with links for a lot of Wii Games.",
            "Get JDownloader copy the page address on the archive list and download them all at once.",
            "Using JDownloader makes this way better.",
            "Baffling! Other than the changelog there's only one link in the post.",
            "[https://r-roms.github.io/](https://r-roms.github.io/)  \nI'm new too but here's a link",
            "A collection is a collection. Fullset, easy to integrate (if you use the right frontend), easy to just try and rate.\n\nromhacking.net is good for browsing but still too much \"work\", so you end up cherry picking based on the info the site provides.\n\nOf course multiple parts can't be covered by such a collection, i.e. multiple hacks apllied at once.",
            "Sorry, but if my point is to create an offline archive incase the world belly ups having to manually download every patch and patch every single game it becomes prohibitive.  There are other collections, and there are places that post already patched games.  Given the number of people on the internet there should be a crowd sourced solution to this pretty quickly.  If I knew where to contribute to it I'd add the 69.9 gigs in patched stuff I have access to.  But I don't.  So I can't.",
            "This^",
            "I think it's because the website has a location based download speed throttle. So using a VPN to go to San Francisco gets around that since their servers are there.",
            "[archive.org](https://archive.org) deletes nothing, torrent destroys choice so you have to download a full set, or if you can download individual ones then the seeds get split up.",
            "There is literally zero AC Bloodlines seeders today. And the PS Store is closed for PSP. Guess where I am downloading it from now.",
            "Just FYI nothing went wrong. That's the format for encrypted WiiU games.",
            "Does the megathread link to it though?",
            "Yeah I also grew up with the 360 because my dad loved Xbox but I've used PlayStation for awhile now and it's WAY better.",
            "And if you buy a PS5 while still having the day 1 PS3 you get 5-4 consoles' worth on 2 consoles.",
            "The ones with the locked files!",
            "I’m still waiting for my Q3 Steam Deck, so I’m just doing the legwork and research in advance. But it’s concerning. I also see that the PC games list on archive.org is completely locked but I think that means you just have to sign up for an account (according to what I read). What is the PS3 game you’re looking for?\n\nDo you know if any extra steps are required to play PC games on the archive.org list, like getting a license for them or whatever?",
            "The megathread? It's the first link in this very pinned post.",
            "You're right, it's a complete mess and I forgot that JP Blue was actually a different entity entirely \n\nI need more sleep before posting",
            "The link has them !",
            "Oh sorry, I accidentally replied to the wrong comment...",
            "i've lost soooooooo many computers that way!!!!!!  jk lol",
            "the instructions my guy",
            "Basically took their words and put it here.",
            "happy cake day!",
            "And we're the Terminators. :)",
            "So basically there used to be a very big google drive where we can download Roms. The problem is Google drive have a limit download everyday. For a Google Drive that has so many Roms the limit always reached in a very short time, hence why we use the method to get past Google Drive Download limit. This used to be a life saver method, but everything is past now. Since we use [archive.org](https://archive.org) now",
            "Not a problem. I do notice some people are having issues, will see if they changed anything and come up w a update.",
            "Where Cani get gameboy gbc and gba rom packs",
            "Yeah i tried looking for some ps3 games\n\nand i found a looooooooooong list of games and they're all locked, unavailable to download\n\nthen i found another one where i could get an empty archive down through a torrent\n\ngreat site!",
            ">JDownloader \n\nthis tool is kinda crappy, lots of bugs and crashes (win10 20H2).",
            "all at once? just one game is 1day download, is at 83kb/s wtf",
            "How do you configure it properly? I have everything set up and connected and it still seems to download at basically the same speed as if I wasn't using Jdownloader at all",
            "What link is that",
            "B a f f l i n g !",
            "Yeah i have been searching for romhack packs but the only one i could find is the sm64 rom hack collection (prepatched) by Simpleflips",
            "archive did delete a lot of stuff in the past.\n\n&#x200B;\n\nalso, in torrent, you choose what you want and you are not forced to download everything.\n\n&#x200B;\n\nseed is always as you download. if you downloaded 1 file out of 5, then you seed that file. the torrent will benefit from that and it won't be hurt at all.\n\n&#x200B;\n\nI suggest making one torrent per game, which is better to manage. but this is a project bigger than me to have.",
            "The file has a 7z extension. you're saying we're not supposed to unzip it  with 7z? What do we do instead?",
            "yes, the github then links you to archive.org",
            "I grew up with an Amstrad CPC 464... So old...",
            "I’m looking to get Bleach Soul Resurreccios! And yeah that’s amazing the steam deck is a beast. And to answer your question, It’s very easy to do it. I successfully am playing Wii U BOTW using CEMU. I got BOTW through this archive list and works perfectly! Also I am doing PS2 emulation using PCSX2 and I got the Roms from this list too works perfectly! But now I’m having trouble with this restricted list",
            "Yeah right sorry 😅",
            "Don't have to be a boomer..  some people just need help...",
            "Lmmfao 😂😂😂😂",
            "Can you explain what website are you using though archive.org? 🙏",
            "Unfortunately the GitHub doesn't have any GBA and GBC roms.  You'll have to find another site that has roms for it.  But if you're looking for a safe place to download roms for it, Vimms Lair is pretty good. [https://vimm.net/?p=vault](https://vimm.net/?p=vault)",
            "Works perfectly for me (unRAID Container)",
            "Not much you can do about that... I mean make sure you have a account at archive, make sure you don't have a download cap on JDownloader... It's set to have one by default I do believe.\n\nAlso change the priority to the highest in JDownloader on anything you are downloading. Make sure you have your archive user info put into JDownloader. \n\nAlso try resetting the wifi if you are using that. \n\nI've done all of the above and I went from less than a mb to maybe between 1-3mb. In rare occasions it was at 9mb.\n\nAnything on archive is going to take time. Just be patient.. I've probably download like 3tb and took me maybe 2 weeks...",
            "The only one in the post.",
            "[deleted]",
            "Shoutouts to simpleflips",
            "The amount of games there are would almost entirely negate the benefits of torrenting.",
            "then make a torrent?",
            "Brudda male an account 😄",
            "Thanks. I’m just wondering if any extra steps are required for the PC games on the archive.org list. There’s just an iso you download, so I assume I just run it like normal? I just thought maybe you needed a license, like PSN games need .rap files in order to be recognized.\n\nYeah, I’m totally pumped to get my Steam Deck! Can’t wait. Emulation is a big part of what I want to do on it. Looking forward to getting to a bunch of PS2/3 games I overlooked back in the day, like the Fatal Frame games and Silent Hill Downpour. I hear a lot of PS3 games are hard to emulate though, in terms of performance.",
            "did u just necro a year old thread to call me a boomer? 🤣🤣🤣",
            "Pinging because I'd like to know as well. Downloading through myrient right now. Don't really know what I'm doing",
            "They do under Others",
            "they do under retro",
            "unRAID Shadow Legends Container",
            "what post ;)",
            "I know. But where do I go from there?",
            "Nope! I just followed a simple yt video, no need for license key.. except for one I can recall which was halo combat evolved.. but so far everything has been smooth.. have fun with your steam deck tho!",
            "I mean .. it's still up for the public right ?\nDidn't know  years determined when someone can reply.  🤷🏿‍♂️.     But okay 👍🏿",
            "Okay, you aren't downloading from another site *through* archive.org, you're downloading *from* [archive.org](https://archive.org).\n\nFirst, click on that roms megathread link above. Shouldn't matter which one unless one is down for some reason.\n\nNext, basically right in the middle of your screen, is a big green link that says \"Retro Games page\", click it if you want older games. Otherwise, for the newer systems, use the links for each brand at the top of the page.\n\nThen you'll be greeted by links for Myrient. They're a great site, well worth checking out... later. Scroll down and you'll get to \"Internet Archive (No-Intro)\". Click on the link (literally says \"Link\") next to the system you want.\n\nYou'll be on the archive.org page now and you can pick and choose which files you want OR you can download them all by clicking \"Go to parent directory\".\n\nFrom here it's just a matter of downloading the entire set.",
            "Oh I didn’t realize that. Thank you for correcting me.",
            "Sorry, where on the page is Others? Can't find it for the life of me. \n\nty",
            "XD\n\n&#x200B;\n\n&#x200B;\n\nthis comment has been sponsored by RAID SHADOW LEGENDSS",
            "It's like an Abbott and Costello routine.",
            "[deleted]",
            "Hey, I found your Bleach game! It’s on vimm.net. It’s a very popular site people use. Just go to “The Vault” and then select PS3! Then go to the “B” games.\n\nThanks, appreciate it! The emulation thing is huge and you can spend a ton of time going through it all. I’ll feel like a kid in a candy store, that’s for sure!",
            "The time is now",
            "I'm team dreadie, there's no time limit on when you can reply as long as the thread's still open (she says 4 months later)",
            "Make it 2 years please",
            "i thought the internet was forever. one year aint shit. i mean dude talked shit but hes still active. i dont get people",
            "exactly that's why I'm replying to you lol",
            "Thank you! I got what I need for now working but this is very helpful. I'll come back when I want to keep working",
            "I can't find one for wii u there since i want to download legend of zelda rom for cemu emulator",
            "Ty kind sir",
            "which link should i click for 2ds. i want to download alpha sapphire",
            "Thank you for taking the time to write this",
            "Looks like they now have it under the retro category.",
            "You Want Fun? Well, Wario know something fun... RRRRRRRRAID SHADOW LEGEND-",
            "you remind me of the babe\n\n (what babe?) \n\nbaabe with the power \n\n(What Power?)",
            "Your patience is inspiring",
            "Where do I go? It just says I need this stuff. Unblock and stuff",
            "Omg really, I will check it out now! thanks for looking! BTW I just found Deadpool on this archive list and its downloading, I will let you know how that goes!",
            "the time is actually now ya fuckin boomer",
            "Yuppies👍🏿",
            "Longer",
            "For Wii U, instead of clicking on the retro games link, click on the Nintendo link at the top of the page. Then scroll down to the Wii U section.\n\nEDIT: The retro page is for Atari, NES, MasterSystem and so on, up through N64/Genesis. The individual company links are for GameCube, DreamCast, PlayStation etc.",
            "2DS games are simply 3DS games run on hardware that doesn't have the 3D capabilities. So you'd go to the 3DS section.",
            "You're very welcome. I hate it when I can't figure something out so I try to help others whenever I can. :)",
            "This Ad is sponsored by Nord VPN",
            "The power of voodoo.",
            "You have 0 skill to put yourself into the sheos of a newcomer. the website is a wall of text no games",
            "Because he's not ignorant like most of the people in here...",
            "[deleted]",
            "Yes, let me know how it goes!!"
        ]
    },
    "Requests and Help Megathread V5 (Games requests, emulator help/guides go here)": {
        "title": "Requests and Help Megathread V5 (Games requests, emulator help/guides go here)",
        "score": 24,
        "url": "https://www.reddit.com/r/Roms/comments/1dkguvt/requests_and_help_megathread_v5_games_requests/",
        "content": "-------------------------------------------------------------------------------------------------------------------------\n\nPlease post your game requests here and hopefully we can keep the subreddit clean from request posts.\n\nIn addition please limit all emulation help/guides to this thread so that we don't spam the subreddit.\n\nLink to roms megathread https://r-roms.github.io/\n\n_________________________________________________________________________________________\nThis is the games request format for this thread. Please follow these guidelines as it will make it much easier for members of the community to help you find what you are looking for.\n\nTitle, Platform and Region.\n\nFor Example\n\nFinal Fantasy VII, Sony PlayStation and USA. Final Fantasy VII, Sony PlayStation and Europe. Final Fantasy VII, Sony PlayStation and Japanese.\n\n_________________________________________________________________________________________\n\n**/r/ROMS Official Matrix server [Link](https://matrix.to/#/#romz:matrix.org)**\n\n* Go here if you need additional help with anything ROM or emulation related.\n\n_________________________________________________________________________________________\n\nSome useful links for requests and ROMs outside of the megathread.\n\nPrevious Previous Request Thread, https://www.reddit.com/r/Roms/comments/pm4smt/requests_megathread_v3_post_here_if_you_cant_find/\n\nPrevious Request Thread,\n\nFrom /u/real_nyha454 https://www.reddit.com/r/Roms/comments/jfi2o5/if_you_need_help_or_youre_new_to_roms_and/\n\n/r/roms Wiki https://www.reddit.com/r/Roms/wiki/index",
        "num_comments": 9,
        "comments": [
            "If you are looking for roms: Go to the link in https://www.reddit.com/r/Roms/comments/m59zx3/roms_megathread_40_html_edition_2021/\n\nYou can navigate by clicking on the various tabs for each company. \n\nWhen you click on the link to Github the first link you land on will be the Home tab, this tab explains how to use the Megathread.\n\nThere are Five tabs that link directly to collections based on console and publisher, these include Nintendo, Sony, Microsoft, Sega, and the PC.\n\nThere are also tabs for popular games and retro games, with retro games being defined as older than Gamecube and DS. \n\nAdditional help can be found on /r/Roms' official Matrix Server [Link](https://matrix.to/#/#romz:matrix.org)\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Roms) if you have any questions or concerns.*",
            "Hi superbio, would it be possible to update The mobasuite url. http://78.72.143.223/index.php",
            "Commenting in hopes of bumping this post up or something even though i know it wont matter",
            "Call of Duty: Black Ops, Sony PlayStation 3 and USA (or any other English version).",
            "Hello and thanks,\n\nTeknoparrot and Taito Type X/X2+ arcade system would be great, most resource online are pretty fragmented and in different languages.",
            "Saiyuki: Journey West, Sony Playstation, USA\n\nthe copy on freeroms is full of errors and has glitched sound. is there a clean, working copy anywhere? thank you",
            "Looking for Postal for Dreamcast if anyone has any leads. The only file I found was a format I can’t convert to run on batocera",
            "To double check, if I'm making a personal copy of everything in the MegaThread what can I skip?  Even if I download all the individual system packs and then download something like a TOESEC pack or hardware targeted set I end up finding roms not in the \"full\" set for a system.  Example, I've downloaded EVERY instance of a .nes file in that thread.  I've got about 59k .nes files that are not duplicates.  But I also had 1/3-1/2 of the stuff I downloaded end up as duplicates.",
            "Hello!\n\nI've been planning to buy a RG35XXH because I've been wanting to get back into emulation since buying the RG350. I bought one that had preloaded roms, and I found myself spending more time going through the menus trying to find a game rather than actually playing anything so I was wondering if there were any recommendations for roms or rom packs that are kind of \"samplers\" when it comes to games. I'm not really looking for complete collections of handhelds or systems but maybe a handful of games in different genres for each system that the RG35XXH can play. I'm not quite sure what games I am into but I am open to trying a bunch of different types.\n\nThanks in advance!"
        ]
    },
    "Why is my rom called that": {
        "title": "Why is my rom called that",
        "score": 395,
        "url": "https://i.redd.it/l983hx3suw7d1.jpeg",
        "content": "",
        "num_comments": 50,
        "comments": [
            "If you are looking for roms: Go to the link in https://www.reddit.com/r/Roms/comments/m59zx3/roms_megathread_40_html_edition_2021/\n\nYou can navigate by clicking on the various tabs for each company. \n\nWhen you click on the link to Github the first link you land on will be the Home tab, this tab explains how to use the Megathread.\n\nThere are Five tabs that link directly to collections based on console and publisher, these include Nintendo, Sony, Microsoft, Sega, and the PC.\n\nThere are also tabs for popular games and retro games, with retro games being defined as older than Gamecube and DS. \n\nAdditional help can be found on /r/Roms' official Matrix Server [Link](https://matrix.to/#/#romz:matrix.org)\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Roms) if you have any questions or concerns.*",
            "Because the Mario Brothers are famously racist, hence the hatred for gombas",
            "1. US => region\n2. M3 => 3 languages\n3. Xenophobia => scene group who dumped and released the rom\n5. 7z => 7zip archive that you will need to extract to get .nds rom\n\n5. .nds => Nintendo DS rom",
            "XenoPhobia is the name of the group that dumped the rom",
            "Why do you think princess peach and the toad’s don’t let Bowser and his minions move to the mushroom kingdom legally?",
            "We're gonna make the goombas pay for it!",
            "from stomping...koopas",
            "> Why is my rom called that?\n\nit's all about DAT files and their naming conventions...\n\nThe scene release name is: `Mario_and_Luigi_Bowsers_Inside_Story_USA_NDS-XPA`\n\nhttps://dats.site/_rls_nds_infolist.php?showmaster=rls_nds&fk_game_id=5863\n\nIf you go over to No-Intro, you'll find a different naming scheme: `4171 - Mario & Luigi - Bowser's Inside Story (USA) (En,Fr,Es)`\n\nhttps://datomatic.no-intro.org/index.php?page=show_record&s=28&n=4171",
            "Because you hate people that don't originate from your own country.",
            "Because your download history just sold you out",
            "You ever wonder why all toads are white ? Yeah that's why",
            "***4171***: Scene release number.\n\n***-***: a separator.\n\n***Mario & Luigi - Bowser's Inside Story***: The name of the game.\n\n***(US)***: Game region.\n\n***(M3)***: Multilanguage, 3 languages supported.\n\n***(XenoPhobia)***: The release group for this dump.\n\n***.7z***: filename extension because Windows OS is very stupid and doesn't know what to do with files that don't include it.\n\nThat's it.",
            "I always thought it was called that because the rom would only work on a certain region",
            "Everyone saying xenophobia is racism in the comments clearly don't know what the fuck the word means. Go read a dictionary ffs.",
            "John Leguizamo called it!",
            "They are members of the Koopa Killers Klan.",
            "Damn guys we should start boycotting nintendo for this",
            "Even Goomba is a derogatory term created by the Mushroom Kingdom to further hate on those poor fellas😔, they are actually referred to as Lentinula Edodal people or simply Edodal people, \n\nso please avoid using this term unless when discussing the song \"Goombas in Paris\" by Kalapuya West and Sarcodon Calocera Cornea Z 🙏",
            "😂",
            "and 4171 its the release scene ID number",
            "I need more clarification on what the dashes, brackets, spaces and words mean, thanks.",
            "The hero we dont deserve but we desperately need",
            ">Xenophobia => scene group who dumped and released the rom\n\nThat seems like an *extremely* unfortunate name at best. Wonder if there's a story there? It'd be like calling your knitting circle hyper-nationalism.",
            "[deleted]",
            ">M3 => 3 languages\n\nThat’s not what that means. ",
            "Because they need to get married first before they can merge both kingdoms.",
            "Satire",
            "Every OS needs file extensions.",
            "That is actually true to an extent. There are multiple ways to bypass it, such as modding consoles or emulators.",
            "Well he did play a Mario Bros. and is racist... so it does check out!",
            "Are they called koopers?",
            "Not sure about the dashes, brackets, or words, but the spaces are an inherent example of the nihilist view that all existence is slowly doomed to succumb to entropy and cease to exist, until all that is left is the void.",
            "Naming convention have strict rules in scene groups which if not followed properly can lead to release being nuked. These are old rule sets which many people still follow.\n\nEmulators are generally made cross platform. Some systems have specific instructions to handle dashes and spaces. Like windows have word limits (used to) to file path. \n\nIt is necessary to accommodate the names to fit in the system criteria.\n\nBrackets give clear info highlighting the specific features of the rom.\n\nWords are necessary and must follow the regional naming convention. As the ROMs are targeted to most common language of archival, they use English naming scheme followed by Japanese naming and then the rest of the release region language.",
            "Words are concatentations of letters that convey meaning",
            "Idk man, me and my DnD club, White Supremacy, would disagree with you on that",
            "\"at best\"...*yeesh*.\n\n--\n\n['Look at how evil 1987 was...people wanted to be racist 3 at a time!'](https://i.imgur.com/d2DAxNi.jpg)",
            "Even though I am familier with the m3 flash cartridges for slot 1 on DS. There is no such m5 card and yet europe release have m5 and japanese release have neither m3 nor m5.\n\nM stands for multilanguage if you read the rule set of scene groups.\n\nIf you check the scene release info. This release have 3 languages en, fr, es i.e. multi3 i.e 3 languages.\n\nYou should check first before posting.",
            "John Leguizamo is racist?",
            "> existence is slowly doomed to succumb to entropy and cease to exist\n\nProbably for the best, this one is fucked.",
            "Oh my",
            "Thank you.",
            "Amazing, thanks. Now I can finally enjoy my hentai rom hacks.",
            "***I*** am not sure that's ***A*** completely accurate definition.",
            "If you need me to explain why that's a more suspicious name for a group of internet hobbyists than it is for a video game, I dunno what to tell you.",
            "Discriminatory against whites so, yes... but I get you, I don't agree the word racist should exist. We all have preferences and shouldn't shamed about having them.",
            "It's a scene group tag on a release from 2009...and a clever name choice for a piracy group where you're keeping to yourselves.\n\n--\n\nNobody was thinking anyone was going to twist it into 'ooof Nazi name' 15 years later\n\n--\n\nEDIT: RIP",
            "bro rolled into a thread on r/roms and was like \"it's not racist to prefer certain skin colors\"\n\nlike holy shit, go away",
            "Bro stfu",
            "Lmao what the *fuck* are you talking about?",
            "delusional - someone that goes into a thread in a forum about roms and... talks like this.",
            "It seems you do, in fact, need someone to explain that to you. As stated previously, I don't feel like it, so good luck with that!"
        ]
    },
    "psp idol master sp dlc ": {
        "title": "psp idol master sp dlc ",
        "score": 0,
        "url": "https://www.reddit.com/r/Roms/comments/1dlueze/psp_idol_master_sp_dlc/",
        "content": "Can someone please tell me where I can download all the DLC for PSP idolmaster sp? The site below was half-baked.\n\n[https://archive.org/download/PSP-DLC/PSP](https://archive.org/download/PSP-DLC/PSP) DLC/\n\n[https://cdromance.org/sony-psp-dlc-list-psp-downloadable-content/](https://cdromance.org/sony-psp-dlc-list-psp-downloadable-content/)  \n",
        "num_comments": 1,
        "comments": [
            "If you are looking for roms: Go to the link in https://www.reddit.com/r/Roms/comments/m59zx3/roms_megathread_40_html_edition_2021/\n\nYou can navigate by clicking on the various tabs for each company. \n\nWhen you click on the link to Github the first link you land on will be the Home tab, this tab explains how to use the Megathread.\n\nThere are Five tabs that link directly to collections based on console and publisher, these include Nintendo, Sony, Microsoft, Sega, and the PC.\n\nThere are also tabs for popular games and retro games, with retro games being defined as older than Gamecube and DS. \n\nAdditional help can be found on /r/Roms' official Matrix Server [Link](https://matrix.to/#/#romz:matrix.org)\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Roms) if you have any questions or concerns.*"
        ]
    },
    "MSX2 European Romset? ": {
        "title": "MSX2 European Romset? ",
        "score": 1,
        "url": "https://www.reddit.com/r/Roms/comments/1dls2nm/msx2_european_romset/",
        "content": "Anybody here who knows where i can download a full european MSX2 Romset? seems i can only find japanese romsets.... ",
        "num_comments": 1,
        "comments": [
            "If you are looking for roms: Go to the link in https://www.reddit.com/r/Roms/comments/m59zx3/roms_megathread_40_html_edition_2021/\n\nYou can navigate by clicking on the various tabs for each company. \n\nWhen you click on the link to Github the first link you land on will be the Home tab, this tab explains how to use the Megathread.\n\nThere are Five tabs that link directly to collections based on console and publisher, these include Nintendo, Sony, Microsoft, Sega, and the PC.\n\nThere are also tabs for popular games and retro games, with retro games being defined as older than Gamecube and DS. \n\nAdditional help can be found on /r/Roms' official Matrix Server [Link](https://matrix.to/#/#romz:matrix.org)\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Roms) if you have any questions or concerns.*"
        ]
    }
}