{
    "Ask Any Questions Here - No Stupid Questions": {
        "title": "Ask Any Questions Here - No Stupid Questions",
        "score": 76,
        "url": "https://www.reddit.com/r/RPClipsGTA/comments/1c55onm/ask_any_questions_here_no_stupid_questions/",
        "content": "Ask any questions regarding GTA RP here whether that be finding a clip, asking info about a certain streamer or even asking questions about the subreddit itself. As long as you guys and girls keep it civil, we feel this can be a help to all new viewers on twitch as well as here in the subreddit. Also, whether you're new or not, feel free to check in here often as there may be something that you know which someone else has no clue about. So please ask away any questions you might have, thanks :)\n\nPlease note that if you post a thread asking a question, it will be removed and you will be redirected to this thread.\n\nPrevious question thread here: https://www.reddit.com/r/RPClipsGTA/comments/176kzog/ask_any_questions_here_no_stupid_questions/",
        "num_comments": 103,
        "comments": [
            "[removed]",
            "Why is noPixel named noPixel? What does it mean? I've wondered that for years.",
            "What happened to the mirror bot? The twitch links get bugged on my cell phone and I can't play the videos because of the content warning never disappearing. The bot getting removed has basically made mobile viewing impossible unless I want to download each video to watch and then deleting them afterwards.  Also, it's nice to be able to see clips that were removed/deleted for whatever reason.",
            "Has anyone been able to 100% maze bank yet?",
            "[deleted]",
            "When will the mayor votes be out ?",
            "I keep seeing things about DAP points or something when it comes to cops. What is this? I can't find it explained anywhere.",
            "What does 1%er mean in relation to the motorcycle clubs?   Like what does one percenter mean ",
            "I'm curious, do streamers that perma'd their character has decided to not stream anymore? I followed streamer who played Aziz and TJ walker character and both of them barely stream anymore. I expect they would play other characters or perhaps at least stream anything but nothing came out from them.",
            "What's with all the clips at 0 points? Seems like lately most clips are instantly downvoted regardless of the content.",
            "Is there a website out there that has a list of all the RP streamers?  \nSomething similar to https://holodex.net where it has a lot of well known streamers",
            "Is there a way to access and read the docket for legal cases?",
            "Anyone know why Tony is not on nopixel/gta as much? Just vacation?",
            "In terms of payout, which role generates more money in 4.0? Civs, Crims, PD, Government officials? \n\nAnd who are some of the richest wight now?\n\nI know CB/OldBois/WhateverThisIs/Cypress Crime Syndicate - has around 2 mil in dirty cash,\n\nand CG is at the top too as a collective... but which group is actually at the top?\n\nAnd for individuals I know G6 people are near millionaires.",
            "What does ERP mean? And LARPing?",
            "what happened between Kaneshiro and the Guild? I saw some clips in which other gangs were apparently being approached to help with driving out each other from the north.",
            "Is Turgle AKA Stormfall33 actually PMSproxy? They look like the same person and honestly sound the same",
            "Anyone know a fix to my game crashing after 15 minutes. I’ve tried to delete the fivem app and reinstall but it didn’t work.",
            "Is the streamer sidebar just broken at this point?\n\nIt updated after I posted this so I'm assuming someone fixed it.",
            "Is there a clip about Dean reacting to Aziz perma?",
            "[deleted]",
            "Do characters server time in prison offline or does the time only go down if they’re on the server?",
            "idk if this belongs here but is there a youtube channel that uploads the nopixel races?",
            "No question, just thank you for making these posts again.",
            "Is onx dead? Noticed penta is on purplerp a lot, and well they never did fix that UI..",
            "How does an impeachment of members on the City Council work? The Los Santos Constitution contains \"Article VI - Impeachment\" which lists the following causes for impeachment:\n\n- Dereliction of Duties\n- Gross Negligence\n- Gross Incompetence\n- General Corruption\n- Felony Criminal Conviction\n\nbut it doesn't describe a process for impeachment. The felony criminal conviction is pretty clear cut, but who would decide if there's been \"Gross Incompetence\"? Is it a judge or the rest of the council or the fed?",
            "hi, sorry i did look at the rules and i may be blind and missed it so i thought I'd ask first, i have a multi pov clip I'd like to post which is from youtube not twitch, is that still allowed? I just see twitch clips so i thought I'd check first",
            "Any know if people are still getting Sink Blueprints? Haven’t seen anyone with one in ages",
            "anyone know when and why Slacks was demoted?",
            "There was this server I played on a few years ago. I remember there being jobs, a very popular one was mining, people would take vehicles such as trucks with gooseneck trailers full of other trucks to the mining spot, mine for hours, fill up all the trunks of the trucks, then sell it all somewhere and make boatloads of money, but I can't remember the server. It was a few years ago that I would've played it.",
            "Will we see more comments on my clips? I know most of them have been spammy but I'm not hurting anyone with posting these clips and most are from my favourite streamers",
            "Why did they remove the Polaroid pictures that you could have in ur pockets and flash to everyone near u?",
            "Haven't really been keeping up with 4.0. who/what has been your favorite storylines so far?",
            "Does anyone know if CG found out why they weren't able to hit the bank yesterday? Scuff or maybe new cool down?",
            "What is with all the Cornwood hate lately? I watch like 7 different streamers in nopixel but I haven't seen Cornwood doing any shitty things for so many people to be talking about him in the comments like this. Maybe I'm just out of the loop since I can't watch everything, but does anyone have any clips that would help me understand?",
            "How’s the not HOA doing? Used to religiously watch Uberhaxornova but he hasn’t streamed (hope his pupper is doing well🧡) so we started watching Penta on ONX and have been really enjoying it. My husband and I don’t have a lot of spare time, so can only really stick to one streamer (although our son starts school in August and I’m due a baby in September so with his paternal leave/working from home and having a sleepy newborn, we’ll hopefully have time to watch more people) at a time, so haven’t watched anything NoPixel in a while, let alone our fave gang.\n\nI’ve read the wiki and I know they’re the P.D now (actually just re-read it and they’re The District) Siz is with Erin, Siz and Erin aren’t active, Julio is Chief, and Ant has left (can’t see why though? 🥺) \n\nSo anyway. Can someone please give me a quick run down? Would be much appreciated 💖",
            "How does the weed turfs work? Can groups take other groups turf or are they stuck with the ones they chose originally?",
            "Whats the status of the mod team here? A quick glimpse shows only about 3/4 out of the 12 of you have been active in this sub in the past month.",
            "how to open the file of. \n\n\nthe game",
            "What is the Coyote VR meme?\n\nWhat is the Saddam Hucrane meme?",
            "Are permathons banned?",
            "[deleted]",
            "Why is this ChatGPT comment voted to the top?",
            "It's coming back, we had some issues migrating to a new platform, then some personal responsibilities ate up some of our time to resolve this.\n\nBut it should be back quite soon. Sorry :(",
            "No. We believe CG are on the very last step and I think Besties are just about there too. Both groups are giving it a try today, Besties are discussing their plans as I write this and CGs attempt will probably be in about 5 hours from this post.",
            "Nothing I have watched gives me the impression they are close, but they aren't beefing either. They may help each other in a pinch with crafting, resources, or information but certainly nothing beyond that.",
            "They got released about 30 minutes ago:\n\nhttps://www.reddit.com/r/RPClipsGTA/comments/1c93w67/april_2024_mayoral_election_results/",
            "Disciplinary Action Point. I think after 5 you get a 24 hour suspension, with a 24 hour suspension with each DAP after the first 5. After 10 is a high command review with I think an indefinite suspension until that review is complete.",
            "Irl MCs also call themselves the 1%. It means they sre the 1% who live as outlaws and dont respect the laws",
            "Depends on the streamer. A lot of people only play 1 character, and so when they perma it Can be because they want an OOC break, or are waiting until they can come up with a new character idea. Streaming isn't everyone's career either.",
            "It's partly how reddit is designed, part of reddit's algorithm is to give posts automatic downvotes over time in order to keep the front page \"fresh\".\n\nSecondly people downvote clips for whatever reasons /shrug",
            "Around a year ago some person/group clearly created bots to automatically downvote all threads on this sub, and there are probably a lot of haters who downvote everything as well. It didn't always use to be like this, but this sub definitely has some kind of downvote bot problem.",
            "https://gtarp.hasroot.com\n\nFor NP: https://nopixel.hasroot.com",
            "I think you need access to the forums.",
            "He's just been living his IRL life and traveling with friends.",
            "Pretty sure Hydra is the wealthiest gang, since they can freely sell weed on their turf (Forum) without cops doing anything about it.  \nThey basicly benefit from PD's shift 1 incompetence/lack of numbers - they can have 20-30 people sell weed 24/7 without any counterplay. They are currently #1 on weed selling.",
            "ERP is Erotic Role Play. You'll hear Egg Roll Platter refer to ERP as well.\nLARP stands for Live Action Role Play.",
            "i thought the same when i first saw her but i actually don't know",
            "r/fiveM is a better subreddit for issues like this",
            "The backup bot and sidebar among a couple other invisible things were broken while some of us have been sick and other life stuff. Things are back on now, but might be a bit scuffed over the next bit.",
            "It's been stale and without any updates for months due to various dev illnesses. And he didn't leave, just trying out PurpleRP which went live a few weeks ago.",
            "Prison sentence gets served no matter if you're offline, online, or whatever. There was some concern recently because of debtor's prison - which did require you to actually Be In Prison doing prison jobs to work off your debt, but it seems like that's going away imminently.",
            "Your best bet is to watch streamers live, or check out their vods. You can use nopixel.hasroot.com (has all tagged nopixel streams) to find the other racers, for multiple POVs. \n\nWatching youtube channels doesn't actually support the streamers who make the cool races for us, but watching streams and vods does.",
            "Not yet. It's just new, and had a few issues. PurpleRP just came out, so seems Penta's been checking it out.",
            "Abdul had a trial and was immediately removed from office.",
            "We allow youtube clips and videos. If it is not already on the allowlist and it is either a streamer's channel or a channel with transformative content send us a mod mail and we will add it.",
            "Youtube clips are allowed. If its a youtube video you will need to message the mod team to make sure its from a permitted YT channel.",
            "He requested to be transferred to BCSO two days ago. As BCSO already has an Undersheriff (Cassidy) and Captain (Cornwood), he had to take a demotion to be a Deputy.",
            "Post better clips or ones with drama.",
            "Just wasn't re-made for 4.0, wasn't intentionally removed as far as anyone could really know.  It was added for a business that was made IC back in the day so I guess if someone was to start something like that business it could end up making a return.",
            "My fave arcs of 4.0 so far:\n\n\\* The Date Auction - because it generated so much RP for everyone else. \n\n\\* My Criminal Academia - sooo good and chaotic. \n\n\\* Ramasquamy #DayOne\n\n\\* The Company Internship Program \n\n\\* Mr. K's Cel Company\n\n\\* Ray Mond and The Clowns... and Rae vs BonBon - that scene at the tunnel was awesome. \n\n\\* The whole heist progression has been good too, from the my little pony USBs all the way to Maze Bank. \n\n\\* Honestly all the relationship RP has been funmy - Ming and Fanny, Rae and Chatty,",
            "As a previous Esfand Sub and someone who is not entirely on the hate train but was happy he lost the Sheriff.\n\nHe is taking things way too serious/hard. Every time he shows up in other streams or I hopped on his stream it feels like he is at 110 in a situation that needed *maybe* a 20 (Which could just be poor timing on my end). He also seems to have gone from \"I'm a sbs cop, I know it, you love it.\" to \"I'm literally the only competent cop in the entire force and I deserve so much more.\" This spiraling effect all started (Imo) with the introduction of Turbo's. He was suddenly overly invested and started to make actual enemies with his reactions and weirdly strong powergaming. \n\nHe puts a lot of time on the server, but I think he feels **Time = Reward**, *when it doesn't*, and people started to dislike him for it. Even yelling at a sub this week when they commented \"Its all RP bud, dont worry about it.\"",
            "I 100% agree",
            "I also think Den Zel had some but he's been off duty this week he should be back today or tomorrow as I saw on Dean's Youtube channel with a poll on who would get fire last time I checked he had 91% of the vote",
            "James said he's retired from GTARP in an IRL stream on Pengwin's channel, cannot even bother to log on Siz to perma him, group disbanded, Julio tried to run it back, also disbanded.",
            "It recently disbanded, Uber is done with RP, which fair enough, dude has done a ton. Andi is off in the woods getting bothered by the supernatural. Some are splintering off and doing their own thing like Rod joining Mayumi. They’re kinda all over the place, and a lot of them are playing Fallout 76 rn",
            "1) they can change turf. 2) they can only \"overtake\" if they chase the other group out or outsell them.",
            "We are active.\n\nWhen it comes to modding the subreddit people have different responsibilities. Some are more active in actual moderating actions, some do development work for our mod tools, some have more managerial type roles, etc. So the inactive tag isn't always fair.\n\nThere's also the fact that this is a hobby for us. While there is a sterotype for \"typical reddit mods\", we do have lives outside of reddit. We can be busy with school, work, familly, etc. There's no expected quota for the team because thats dumb, and these outside lives responsibilities take priority over moderation duties.\n\nDo you have any specific concerns?",
            "i think the cayote vr meme refers to when Miguel Antonio Manuel \"El Coyote\" Manolo Diaz showed Conan his investigation regarding some shootout involving CG and PD(PD has tech that allows them to \"go back\" to the scene of a crime in \"vr\"). The whole thing took like an hour and a half of pure yapping from cayote and Rammee wasn't able to leave, tried to multiple times but cayote keeps on insisting so i think Ramee, the streamer, just kept on entertaining him?\n\nthe saddam hucrane refers to Chief Justice Alan Crane nick name given to him by i think CG or Bobby Charles?",
            "Why would it be banned?",
            "I think it's mostly because he thinks he can do no wrong and then when he does he doubles down on it. Sense Ruth and Turner are gone he is immune to punishment. He doesn't rp around certain mechanics, for instance the first time crims could lockpick bikes it was they are 100% stealing them because you can't buy bikes yet in the city, instead of rping that there are multiple ways you can buy vehicles and investigating the situation. Don't get me started with how he treats the npc's that walk up for drug sells another no need to investigate let's just arrest them type situation. His turbo rage has no bounds. But hey he is gonna be the sheriff and fix PD /s",
            "On the topic of broken stuff, the Top GTA Streamers list on the right side of the subreddit has been frozen for quite awhile. Also there is a 'Ask any questions here' right above that which isn't clickable.",
            "CG missed the last door laptop hack, so the camera person never told Ramee the proper code. When Marty did it, it was 4 sequences, 3 shapes each line",
            "Thank you!",
            "Thank you ",
            "There also might be a cool down period to rejoin the PD if you perma as member of the PD.",
            "Thank you good sir 🙏🏻",
            "I'd say they're definitely different people, I looked for like a minute just to check if old pictures/videos of the two looked identical at the same timeframe\n\nLooking at their instagrams they both have posts going back like 500+ weeks ago, but at around 325w ago they both posted selfies and the differences are way more hard to fake if it was just one person\n\nthey put up similar selfies within a few days of each other that showed the differences in their eye color and nose shape pretty well (brown eye with more round nose vs more hazel looking with smaller nose) back at a time when both streamed and there was no drama so there wouldn't be much of a point in having two persona's like that",
            "Oh that’s good, I play on other servers and usually if I have a decently long sentence I see if there’s anyone to talk to and if not I decide if I just wanna go offline or do whatever jobs they have to decrease time.",
            "True",
            "Damn that sucks. I was looking forward to what the guild and not hoa would be able to create in Poleto",
            "Oh shit\n\nI’ve been meaning to watch the IRL stream but waiting for my husband to have a day off while my son is at nursery. Ouch",
            "I wasn't referring to any tag, just comment activity. Not necessarily a specific incident concern but I feel the attack on streamers and/or their communities (none excluded) is becoming quite frequent and I don't think it's just criticism or opinions. It's blatant '*X streamers chat are all 10 year old braindead idiots*', or '*Y streamer has always fueled hatred*'. I don't see how that fosters any kind of civility, in fact it likely just fuels the fires that escalate the toxicity. I do report the ones I come across.\n\nAnd I am not implying each mod should be around babysitting the sub each day, but I do feel having enough mods to have at least 1 around each day would be a reasonable target, which may warrant recruitment.  My two cents.",
            "Idk that's why I asked",
            "As far as I know in ONX, permathons or 1 lifer streams are definitely not banned. BananaDuck does 1 lifers sometimes. I don't know in NP but you can try checking Burn."
        ]
    },
    "Aziz Murder Case against Capped dismissed with prejudice": {
        "title": "Aziz Murder Case against Capped dismissed with prejudice",
        "score": 117,
        "url": "https://i.redd.it/g3nb8185l28d1.png",
        "content": "",
        "num_comments": 66,
        "comments": [
            "I really don't understand why he waited last minute for both cases he worked on. he put off becoming an officer 4-5 weeks, worked for hours with Tilly, and grew frustrated with his superiors for making him patrol instead of investigate, all that for the cases to go past the statute. just a few days ago he was saying he wanted to play crim again because investigating was hopeless. Peppo's a great rper, but his decisions are baffling",
            "Im curious, those that has followed this particular investigation, was there any evidence i.e. stuff from subpoenas or was it all circumstantial, from the little I have seen there was not enough for a case.",
            "Maybe now he can have a funeral?",
            "Coyote 0:2 on high profile cases so far before he's even a Deputy. A new record.",
            "I'll preface this with I am a CG fan:  Imagine all the weird haters confusion when they find out that Judge Hallow is also the same person who plays Officer Decker, the person whom they think has a weird personal axe to grind with CG by trying to charge them with anything that sticks and stacks",
            "Slacks pepega CID really gonna get Siobahn for bandaids while she lays chopped up and exploded in the icu and dead cops fall out of SoL. What a legend. ",
            "Fly high",
            "wow im so shocked - aziz died for nothing and its all slacks fault\n\njust stop ssaab from making investigation departments and let someone else lead he doesnt need the power nor the rank when he keeps on killing the pd",
            "Coyote the character is just not a good detective despite trying to build the character as one.  He comes up with outrageous theories for the most cut and dry stuff then flat out ignores the most obvious.  Tuggz admitted to Coyote that he was involved not even 12 hours after Aziz died and Tuggz isn't mentioned in the case at all.  That should tell you everything.",
            "Was so funny when pigeon called coyote on a private # to celebrate lol even hazel drove up and started laughing at him. Poor coyote is now getting scolded on his reports lmao",
            "unfortunate that it’s come to this but coyote isn’t the first solo cadet/ppo to be told to back off of investigations and certainly won’t be the last. It’s unfortunate that command/HC make the same call over and over again because to be quite frank, investigations SHOULD be a requirement for cadets/ppo’s to have to go through and take part of should they be interested (I know long term investigation RP isn’t for everyone). unfortunate that the PD still hasn’t shaken that sort of mentality of being hyper focused on ping chasing rather than choosing to uplift individuals who are invested into long term investigative RP. \ncoyote was basically the only one remotely interested in looking into these cases when no one else was or when others had began to lose interest in it. unfortunate that he waited the full 30 days to post the case to the docket but here’s hoping this doesn’t completely discourage him from pursuing investigative work down the road. ",
            "If only the Autopsy report was outside the statute of limitations, the Judge could have easily just through away only that piece of evidence and not throw the whole case. I believe that was done in bad faith.",
            "Investigative work on NP is hard. For newbies to the PD they have certain fantasies about it, and then reality sets in when they repeatedly hit brick walls. Since they basicly banned all old detectives \n from hiring and even now are so much shit talkiing about how old detectives were bad there is a long road ahead.\n\nThe brain drain hits hard for this PD, but it is self inflicted by bad hiring decision making.",
            "This case just didn't have the evidence to back it up, that's partially why they waited so long. And if the people involved in an investigation are questioning their own PC, it's probably best not to issue a HUT warrant just to see if hearsay will stick. It didn't help that they very nearly didn't even interrogate Pigeon. He's probably the type to actually slip up something if he was interrogated more than once.",
            "its mainly his superiors/FTOs fault for letting cadet work on cases when they shouldnt",
            "Basically from what I seen , they only had phone logs and capped saying  he killed him to a despatcher would've  lost the case anyway",
            "No solid evidence, only circumstantial evidence was phone calls with prisoners and they had hearsay testimony from people who they sbs admitted the murder to.",
            "That was found no, cg still have the badge and gun iirc, they just had a bunch of heresay and phone calls",
            "I watched some of it and he said that he knew the cases were not strong (this one and Solomon’s) but he wanted the court RP and to set up scenes ",
            "To get a chance for a murder conviction on NP you need one of four things:\n\n* Police eye witnesses to the crime\n* Recordings of the crime\n* Possession of the murder weapon\n* A Guilty plea (confession)\n\nIf you don't have at least one of those 4, you are not getting a conviction. PD did not have any of those 4. Even DNA would only prove someone was there but you couldn't prove what involvement, if any, they had.",
            "It was circumstantial and like what makes cases like this so hard to do is the high no snitch ever and Don't talk to the popo or you are dead mentality of most gangs in the city and as a general rule of thumb. Which makes this type of work so hard to do. They were able to figure out the primary suspects, Pigeon, Suarez, Little Tugz, and  were aBle to get from sources, that Suarez was the one that actually killed Aziz I believe, They were able to do such a good job as to put together an accurate road map of events and where those people were during the time. Which even took Cg by surprise.  But it was indeed mostly hearsay and third party statements. where I Don't think they would have enough for a guilty verdict either way.\n\nProblem is with stuff like this a high profile murder they have a 30 day limit which isn't enough time it seems for this type of case and I do think like 60 days for first degree murder of a cop should be implemented or allowed to be extended, but the constitution at the moment prevents that ingame.  \nCg can go about bragging about it and the cops cannot do anything about it except for like punishing them in other ways (Stacking charges and not reducing time). Basically Suarez, Pigeon and Tuggs got away with first degree murder.",
            "There was no physical evidence. It was all hearsay statements and third party stuff. ",
            "Elevator shaft was a funeral. Wish he could fly dud",
            "It doesn’t matter. 30 days is up. \n\nTessa’s court case already set all the legal standards for that. ",
            "When slacks is all that is basically left for leading investigations you know it's already over. Slacks cooking skill so weak he can't even use a microwave.",
            "They put state ids on government property for a reason",
            "Let the guy RP and see where this unit goes, You are already dooming and C.I.B hasn't even started properly yet.",
            "He forgot to drink his red bull before hand",
            "He actually had most of the story correct though?  Pigeon was flying the plane, Suarez was in the back and “pushed” him.  Tuggs and Cau were also involved but in lesser ways (assisting with the grab, and the pickup from Grapeseed Airport).  He got all four names but only had people willing to testify to Pigeons involvement.  Considering how little information there was, he actually did a decent job of putting together the story from bits and pieces of info.",
            "what? Coyote brought more investigative rp to the story than anybody else did in 4.0. People are just out there chasing cars. Did you even watch the lengths of interrogation Coyote went to in interviewing DOC? Tuggz was on the docket as a co-conspirator. And just admitting a crime in passing doesn't constitute evidence.",
            "Brother you are smoking something",
            "Nah that’s just not true",
            "The main problem is Coyote is spending most of his shifts inside MRPD or SDSO investigating. In order to promote him they need to know he can do comms, patrol, and process on his own without his hand getting held. That's the entire point of the PPO phase. FTOs have basically asked for like a week of patrol just to prove he can do it on his own. You can be the best shot in the military, but if you don't know how to march in formation that's not gonna get you anywhere.",
            "you shouldn't be investigating full time when you literally can't do anything else appropriately yet.  You *learn* to investigate by learning everything else.  You investigate at traffic stops et al.  Once you have that base then you can start thinking about big investigations.  And no he wasn't the only one interested, but he got in the way of anyone else investigating...",
            "There’s already precedent of this happening from the Tessa vs LSPD case. \n\nA judge can’t just throw out an autopsy report of when someone died in a murder case, that’s one of the most key pieces of evidence. \n\nPlus if the defence wanted to, they could point to the crime occurring hours before the autopsy report was created which would still put this case out of the statute of limitations by a larger time frame of 3 hours. \n\nBecause if Coyote added the report of when Aziz was kidnapped when PD found his car on the side of the road that’s when everything began officially. Which pushes everything even further outside the statute of limitations.",
            "the autopsy was the best case for SOL.  By either time of infraction or time of discovery they were even more outside the SOL.\n\nAlso \"And what infraction did my client commit?\"\n\n\"murder\"\n\n\"what evidence is there that someone died\"\n\n\"....\"",
            "Basically anyone that was good at filing subpoenas and court didn't get rehired.",
            "It does not help that Slacks was basically his direct report for the investigstions - you know, Ssaab who is notoriously great in court /s.",
            "nobody else is even pursuing them. Nothing transpired from Rooker perma, absolutely nothing. At least Aziz perma had some roleplay come out of it because Coyote went around and interviewed a bunch of people.",
            "They have told him so many times to drop the case and/or patrol. He said he refuses to drop the case to at least 3 higher ups I saw. ",
            "He also told Bruno who’s a cop as well, it was reported to Cornwood and Albert King was standing there when he took Bruno’s report. And the same day hour later he got arrested with Windsongs gun on him, who he happens to share a house with. He’s lucky no one’s truly followed or “investigated” him in that way.",
            "If the testimony is directly from the person they admitted the murder to, it's not hearsay.",
            "30 days would normally be enough time, but the city was basically on fire for a month straight. The council shooting, Solomon and Ellie's supposed involvement, Aziz's murder, and Barry shooting Solomon all kind of happened in a 72 hour period. Then you have prison break and manhunt. Add in cases like Soze's and the constant kidnappings/shootings by CG taking precedent over these investigations, everything was slowed down.",
            "Tugz's twatted and told the cops to there faces that he killed aziz but the cops just seemed to ignore what he said....the pd is full of pog streamers and not streamers that actually want to rp the nitty gritty and go after the criminals..I honestly feel like this is a reason why the pd is not catching many criminals",
            "Slacks has no investigative background. Rip Riley and Kingsman have done more investigative work than Slacks has, Brian Knight has more drug busts in 4.0 in 1/100th of duty time than Slacks has. We all know how bad in court saab is. Saab has always been on the field guy, Slacks has no reason to be in an investigative unit let alone lead one.",
            "Doesn’t prove she’s the one who gave it to him when she’s been kidnapped and robbed multiple times",
            "I mean having a guy who doesn't understand basic court stuff be a in charge of an investigation unit seems destined to fail",
            "He had 3 separate confessions from Tuggz, each providing more details each time but ignored it and it took him 30 days to get here, oh wait 30 days and 3 hours. Great work.",
            "I never said he didn't provide investigation rp, he's one of the small few that are, just said Coyote the character wasn't good at it.  At least not compared to how hyped up the PD paints him to be.  Big difference between what I said and what you're trying to say I said.",
            "I wish.",
            "I remember Crane bringing this up about Coyote trying to force this investigation role and looking into high profile cases but he isn’t able to provide comms, street names, 10 codes etc and that he wants to see him out on the streets gaining experience to become a full officer first, which I completely agree with. It’s almost like skipping the grinding part of a process and getting straight to the good stuff.",
            "You haven’t watched much Peppo recently have you?",
            "Like who and how?",
            "Hayes is back, but I don’t think she wants to deal with court stuff anymore.",
            "The thing with a lot of these cases is unless there is hard evidence it's very tricky to get a conviction. There was literally zero evidence that can tie anyone specifically to the Rooker murder. With Aziz, a bunch of interviews are good roleplay but unless they can put someone on that plane it would be impossible to prove in court. None of these cases had any probable cause, just a lot of reasonable suspicion. That's not enough for an arrest.",
            "He was repeatedly told to get back on the case by other high command bc no body was working it. One of the big reasons Coyote didn’t finish it was bc he has been prioritizing patrol the last week",
            "Which is why NP isn't really set up for long investigations. Too much is going on, too many kidnappings and murder attempts. There hasn't really even been much vault activity this month. And the pay off for the investigation, you getting those people \"off the streets\" is getting them off the streets for like 2 days while they and their chats complain about being punished in real life. Even though while the investigation was going on there has been like 10 more kidnappings and 20 attempted murders.\n\nInvestigations are really only for people who really enjoy doing them.",
            "Indeed, but like circumstances like that do have to be considered and the reason why extensions of time should be something allowed for at least hut level cases like first degree murder, murder of a government employee.  Anything else below the hut stuff, would be like no extensions should be allowed for those things. That way it like remains consistent and not abused by the cops.",
            "It sounds like your saying there is only 1 person in the pd...surely there's not 200+ cops whitelisted in the server....the problem is streamers thinking joining the pd is a gateway to erp...the sooner 50% comes in with a senator character the better",
            "You think tuggz wouldve given them the murder weapon or what exactly do you expect the cops to do with that?",
            "Well, the cops maybe had no reason to believe him at the time. Some likely did but have no proof he did anything really.  Now the confession along with the video he took when Aziz was murdered at the hospital and his remarks fly high. Technically I think would make a case against Tugs the strongest. As there would have been professional witnesses to Tuggs admitting and doing this act. If it wasn't past the statute of limitations. I think they could get Tuggs. But like it would still be a hard case. But then the way the justice system seems to work. Likely would have just said guilty to it anyways. Giving the cops the victory depending on the judges involved.",
            "I know Saab absolutely wants to and loves investigative RP and interrogations, but I think he needs someone like Siobhan to sit him down for a few hours a day for a week of lawyer school in how the law in NP actually works. Else that department is going to be a laughing stock and DOA with the amount of dropped or dead end cases.",
            "It’s actually longer than 30 days and 3 hours, that was just from the earliest submitted report. If going by the time the crime occurred, it was way more time than 30 days and 3 hours.",
            "The guy over various characters has had a command role in the PD since 2.0, and then in 3.0 basically became the defacto OOC mouthpiece for PD continuing to today.\n\nIf in 6 years of being one of the people in charge he can't understand fundamental legal concepts of a simplified constitution - no classea with Siobhan are going to help.",
            "The funny part is Saab would say to chat and even other characters in RP that he didn't believe investigating was worth it, due to limitations. I was shocked hearing him say he wanted to lead the unit because of that. It was until Dab became the Commissioner and gave them authority to go UC that Slacks started understanding what investigating was about, he liked it so much he transferred to BCSO to get the unit of the ground."
        ]
    },
    "Oops...": {
        "title": "Oops...",
        "score": 499,
        "url": "https://clips.twitch.tv/UninterestedResilientPuddingRickroll-q3jMmVDiF7tBEWyO",
        "content": "",
        "num_comments": 15,
        "comments": [
            "\nMirror: [CAUGHT](https://files.catbox.moe/1zwusn.mp4)\n\nCredit to https://www.twitch.tv/Ramee\n\nDirect Backup: [CAUGHT](https://production.assets.clips.twitchcdn.net/waMek6t4zJlQ4he7QRFsjg/44406589083-offset-11016.mp4?sig=4ca0606da9c9004976ae9ce4d5609646e2e7ae36&token=%7B%22authorization%22%3A%7B%22forbidden%22%3Afalse%2C%22reason%22%3A%22%22%7D%2C%22clip_uri%22%3A%22https%3A%2F%2Fproduction.assets.clips.twitchcdn.net%2FwaMek6t4zJlQ4he7QRFsjg%2F44406589083-offset-11016.mp4%22%2C%22clip_slug%22%3A%22UninterestedResilientPuddingRickroll-q3jMmVDiF7tBEWyO%22%2C%22device_id%22%3Anull%2C%22expires%22%3A1719079381%2C%22user_id%22%3A%22%22%2C%22version%22%3A2%7D)\n\n---\nThis was done by a bot. If you have any questions or concerns, please contact the moderators.",
            "bruh he saying what i would have said if that shit happened to me irl lmao",
            "He turned red instantly LMAO",
            "The Silence from her kills me lol",
            "These news phone listener things have been such good content. Kudos to dev team for this lol",
            "LMAO that's fucking hilarious",
            "The phone tapping devices have been the best new addition in 4.0. Already delivered so many good moments.",
            "Anyone got her PoV?",
            "OMG that's too funny, he went so red lol",
            "Lmfao that stuttering! He got so flustered couldn't find his words. 🤣🤣",
            "This is gold lmao",
            "Why you always knock first 🤗",
            "KEKW",
            "LMFAOOOOOOO",
            "Mans turned into a cherry tomato"
        ]
    },
    "All Gang Tags in the MDT": {
        "title": "All Gang Tags in the MDT",
        "score": 16,
        "url": "https://i.redd.it/n1p7ek6x848d1.png",
        "content": "",
        "num_comments": 2,
        "comments": [
            "did they rly gave ob a hotdog as icon xD"
        ]
    },
    "[Buddha] Lang meets Richard": {
        "title": "[Buddha] Lang meets Richard",
        "score": 422,
        "url": "https://streamable.com/evlxnh",
        "content": "",
        "num_comments": 21,
        "comments": [
            "big +1s to all of those guys in the background for the \"is that really him?\" comments lol",
            "Richard is a gem",
            "Richard is pure unhinged entertainment",
            ">Lang meets ~~Richard~~ Red Lipstick\n\nFTFY",
            "Did you bleep out the swearwords?",
            "Pure golden interaction",
            "did he lose his DOC prio? he's been streaming less frequent this month",
            "[removed]",
            "Edit: I was wrong",
            "zizizizizizizizizizizizizizi",
            "I think you mean Red Rocket",
            "Richard had prio long before the DOC shit, in like 3.0 iirc",
            "Richard was smart... he got close to Tessa in 3.0 and used her to get prio. \n\n# /s",
            "different one",
            "That was BigRichardRP, this is ReconMalfunction who plays a character named Richard Woytkiw.",
            "Thas was different Richard he was from GG I think.\n\nThis Richard is from CG and has been their clean guy in 4.0.",
            "The size of that /s tho 💀",
            "Got it, thx",
            "media literacy is in the toilet nowadays, gotta make sure."
        ]
    }
}