{
    "I feel this person will regret this in years to come...": {
        "title": "I feel this person will regret this in years to come...",
        "score": 1408,
        "url": "https://v.redd.it/j3okgvzaxy7d1",
        "content": "",
        "num_comments": 147,
        "comments": [
            "As long as teenagers have existed, so has cringe. We just didn't have easy access to video equipment before. Which I am eternally greatful for",
            "I’m so glad we couldn’t record video on phones when I was a teen.",
            "Damn what is this 2008?",
            "Eh. We were all teenagers once....They're a teenager, right?",
            "Who wasn't cringey when they were this age?",
            "No joke, this is my ex girlfriend’s little sister. For a short while I lived with her family and she’s a really good kid. People are pretty level headed here but I’ve seen this video on instagram and the comments can be pretty disgusting. We were all goofy kids once, let’s just be nice!",
            "Doing it in front of the audio books is a little funny",
            "I don’t know man I recorded some super cringe shit when I was a teenager, being cringe and growing up is a huge part of being a teenager",
            "We’ve all been there. Come down off your high horse",
            "Good to see emo teens are still being emo teens 🖤",
            "I thank God every day that I did not have social media while I was a young dumb teen.",
            "*video of one singular individual*\n\nwHaTs wRoNg WiTh tHiS GeNeRaTiOn",
            "Maybe they'll regret it!  Hopefully they'll laugh at themselves instead.\n\nI can't imagine most of us weren't cringe af at that age.",
            "Future post on r/blunderyears",
            "Pretty sure this is ironic lmao, its comparable to those alpha wolf shirts",
            "I feel so sorry for any librarian who witnessed this live.",
            "Were none of y’all teenagers?",
            "I'm just imagining her doing this in complete silence because its a library lol",
            "Big cringe, but we were all teens and did dumb shit that certainly didn't feel like cringe at the time lol.\n\nI still wonder how they get their actions to look choppy like that, I guess it's in the edit idk. The cosplay motion style is spreading though.",
            "Kids being kids. You did stupid sh!t too growing up.",
            "Ironically compared to what this person could have done this is pretty normal I think I saw stuff similar to this 10 years ago 20 years ago with myspace and such",
            "I don't think this is sad. annoying? sure.",
            "We really need to stop acting like we weren't just as cringe at that age. Part of growing up is experimenting with different ideas and personalities (some of which are being a huge weirdo). \n\nAnd if you're one of those people who swear up and down that they were totally normal their entire adolescence. Congrats on being boring I guess.",
            "Wow, they are going to look back on this video one day and go (sigh)..”I was so cool”.",
            "Mom... Dad... meet Rage-Ina, my fiancé.",
            "Idk she kinda went off",
            "Then again, maybe not",
            "I’m so glad social media wasn’t a thing when I was a teenager",
            "I remember trying to create a vine and realizing how silly it looked. I'm glad I never posted anything in my teen years. \nHow do they not realize how ridiculous this looks?",
            "Teen cringe behavior is not new",
            "A lot of generations do really embarrassing things. It's just way easier to show everyone the embarrassing things you are doing now.",
            "Honestly, the video is doing exactly what is is supposed to do - make view traffic. I don’t think she will regret it",
            "I love it! I wish I had the confidence to do this type of thing when I was a teen.",
            "That original title is very telling about what kind of „person“ OP is\n\nAlso:\nCringe teens do cringe teen shit, whatever dude",
            "I'm Gen X, we did the same stupid s**t but there was no social media to record it.",
            "honestly i would have cringed at this if i was still 15 years old but as an adult this is kinda awesome",
            "This is actually some pretty creative editing and movement. Cringy? Sure but with refinement and persistence, could be the start of a early creative career. Keep pressuring that creativity.",
            "No-one will recognise her anyways.",
            "Could you imagine walking down the fictional section and seeing this being filmed.",
            "And in the school library too",
            "We live in a time where shame no longer exists.",
            "2003 call",
            "I totally do that when I know I'm completly alone lol. But I wouldn't think of filming it. But that's not the worst things to film imo.",
            "Its not sadcringe lol thats just normal teen behavior. Yall are so hard on the most harmless, normal shit.",
            "I’m so thankful social media wasn’t around when I was a dramatic teen.",
            "Meh they could be a good actor / mocap actor I bet",
            "This is some potent cringe. It's a good cringe. It's like an aged cheese. Pungent, yet aromatic. For those with refined taste.",
            "Monster - Skillet nightcore!",
            "In a library. When I was a kid I avoided people like this.",
            "I regret it right now",
            "Finally, some good content instead of text messages.",
            "It's like there's a competition to see who can turn into a kids cartoon character first",
            "this looks like one of those AI generated videos lmao",
            "I was pretty cringey as a teenager, but I can't say I've ever turned up in the library for some emo wordchewing.",
            "What year is it!?",
            "Prepping for r/blunderyears",
            "I wonder what podcast she's listening to.",
            "GIBI ASMR ⁉️\n\nWTF\n\nLooks like a younger version of her \n\nWeird",
            "Imagine walking through the library, just minding your business and looking for books, and coming access…this",
            "I always can’t believe people think it’s ok to post shit like this",
            "Just looks about as cringe as your average tik toker, bet they have rakes of followers aswell",
            "I regret it for them now.",
            "Three days grace and Emos are coming back, nature is healing",
            "I haven’t felt cringe like this in years. Thanks OP. I hate it!",
            "Emo is back?\n\nHistory really is a flat circle",
            "Those cocked hands in the air with the look on her face…",
            "The same people who'd tremble to ask for help in retail",
            "That's the modern version of Star Wars Kid!",
            "🫠",
            "no they wont, this is 100% satire. i dont know how you guys keep falling for this stuff.",
            "A demonic possessed person",
            "Future r/blunderyears",
            "\"This genetation is doomed\" as if no other generation with access to music has done this.",
            "Yes, cringe and all, but I am kinda fascinated how a person can move like that.",
            "This has to be an older recording right? People still don't act or dress like this do they?",
            "I bet it smells like disappointment and shame",
            "If she read 3 book from that shelf she's wouldn't be like this",
            "Theres the cringe teen who acts like a tragic anime character and then theres this. A whole other level above.",
            "Dudes... This is just cringe but honestly it's fine compared to other tiktok trends, like the thing with the NPCs and the emojis, this isn't even close...",
            "Divorce leaves children in the worst places",
            "I can smell this person",
            "Yikes… nightcore monster is some real 2012 shit",
            "Throw it into the draft immediately",
            "Gen Z should stick to whatever music is produced today. Don't turn rock music into cringe please.",
            "[deleted]",
            "Unfortunately, me and my mates did. We made a dvd of pure cringe stuff like this. With green day, blink 182, MCR and the killers as the soundtrack. It’s as cringy and as bad as it sounds. I think I still have a copy but I haven’t watched it since 2005. Thank God it was pre-YouTube.",
            "Having that one friend who always carried around a VHS Magnavox because they wanted to go to film school....",
            "being in high school is early 2000s was the best \n\nfinally have easy Internet access at home\n\nno smartphones in our pockets to post the dumb shit we did",
            "Can confirm, I thank god every day that there were no camera phones around during my teenage years.",
            "I remember practicing my sick dance moves in the mirror.  I thank God to this day that cameras were not around to capture it.  I would have to leave this world if that video got out.",
            "Yes just let them be teen and enjoy it as far as they could.",
            "Recording is one thing, posting it in the internet though… yikes",
            "We still posted the lyrics which is arguably just as cringe, youth is gonna youth lol",
            "Gonna pretend like my best friend and i never use to hang out after school and blast Limp Bizkit on the stereo in my room and jump around pretending to be in the band. If that was today we 100% would be on tik-tok :/",
            "I do not want to see a video of how me and my friend acted whenever this song first came out. Lmao",
            "If so I aint even mad lol just 2008 being 2008",
            "Exactly what I was thinking",
            "Rawr XD",
            "Absolutely, but I can't help but think that r/blunderyears well be a busy sub within the next five years...",
            "Yep. Some of us were lucky enough that social media or the internet in general were non-existent or in its infant stages.\n\nShit was cringy enough for me in real life. God forbid it was saved forever on the internet…",
            "Yup. We were all cringe. We just couldn't broadcast it to the entire world.",
            "Knew someone who looked exactly like this but with a tail and ears. She ended up selling vids of her and her boyfriend fucking, when they were 17. Also cheated on him, her bf also stayed with her after learning she told a dude that she wished her boyfriend was more like him \n\nSometimes I wonder if they're still batshit crazy but I much prefer them being out of my Instagram feed",
            "Yeah, I don't really see anything sad either. About the cringe, it's there, but the standard cringe of teens being teens. Tbh I didn't even cringe",
            "Yea, but I was only thinking about or writing about it in my diary. I didn't show it to the world because I got self awareness.",
            "Me. Got proof otherwise? 😂😂😂",
            "It's actually not bad. It's art. It's not great, but she's committed to the performance, she's sharp and fast, with a bit of lighting and costume it wouldn't be out of place in a legit music video. It reminds me of The Prodigy.",
            "does she regret recording the video because of the comments? cuz if so thatd be pretty sad, this teenage era of angst expression is a rite of passage, but i am glad camera phones werent at todays level when i had mine",
            "Instagram comment sections are just sad people  trying to fulfill their thawrted quests for middle school popularity. It's weird shit.",
            "I love her fashion sense. Not a fan of the video, but still; I haven't seen such a faithful recreation of the 2010s emo / scene kind of look in a while.",
            "I’m 100% certain this is ironic lol",
            "The thought of hearing some motivated, passionate goober making this video try to silently breath the loud vocals to sync up with the track is a harrowing thought.",
            "I’m jealous of the librarian who witnessed this live.",
            "Well, they are deliberately mimicing anime, so... 🤷‍♀️",
            "The emo anesthetic coupled with Nu-metal is making a huge comeback.",
            "So you could say it smells like…teen spirit",
            "Gatekeeping music is equally cringe.",
            "The answer: >!Who cares? It’s not our business what random strangers look like.!<",
            "“What genitalia does this child have” is a weird first thought.",
            "Do you have this problem with everyone who dresses like this? Were you also confused by the gender of the 14 year old scene girl who rejected you when you were 26?",
            "Come on man, if you don't like it don't bring it up, makes you look desperate",
            "I'm here for the posts, I don't care what you can or can't do.",
            "I dare you to rewatch it",
            "That’s the thing though. We would have posted the dumb shit we did as teens too. Gotta get all the internet points you can!",
            "To this day I feel as though way too many people don’t understand the fact that rhythm does not translate through text, and that posting lyrics from your favorite obscure band/artist doesn’t read the same way it does to you, to everybody else.",
            "Or MSN/MySpace having the music you are listening to on display/embedded and making sure it's something edgy (if you were alt) or something from pop/rap bonus points for profanity or if it's super obscure so you can be different \"oh you haven't heard of this? I'm just the bigger fan\" lol.\n\nI was the alt one lol.",
            "I know it's cliche, but man oh man am I glad we didn't have ubiquitous smart phones and social media in 2008. I was this kind of teen and probably would have made some sort of terrible video like this.",
            "Whoa that sub has fallen pretty hard huh? 20% of the content is just photos of teens/kids being themselves, and the other 80% are photos of OPs in their teens looking good, obviously baiting for validation comments today.",
            "Right? I'm so happy social media wasn't really a thing when I was this age. I would've made some shit just like this. I dressed just like that too. 😅",
            "Tom is and will always be MyFriend",
            "This comment is proof",
            "In a few years, this will be considered camp",
            "I’m sure she regret it to a certain extent. I haven’t talked to her in a long time as she’s much younger than me and her sister and I broke up quite a while ago. She seems to have put her account on private so I imagine she’s gotten some nasty messages sent her way. She was pretty big on TikTok and there seems to be a whole community for content like that, and if it’s not hurting anyone then I don’t see the need to attack her. I thought it was cool to see her embrace the same type of emo/scene thing I also did back in the day. But exactly, kids do goofy stuff and anybody talking shit on her is most like a huge fucking loser anyways.",
            "Meta algorithm actually encourages ragebait & hateful content because it creates more engagement, and thus more revenue. Everything is made so that you see the most \"engaging\" comments first, and it often means, the most violent & hateful ones.\n\nZuckerberg knew this \"side-effect\" and the dramatic consequences on young people's mental health when he was told by his teams, and when proposed with solutions to stop this, he simply said no because the idea that people spend less time on the platform is a bigger concern than the anguish & desastrous mental health consequences it creates on its consumers (Yes, this is real : [https://en.wikipedia.org/wiki/2021\\_Facebook\\_leak#Promoting\\_anger-provoking\\_posts](https://en.wikipedia.org/wiki/2021_Facebook_leak#Promoting_anger-provoking_posts) )",
            "If you see it as an acting play it is actually quite good. Those movements have to vibe in a certain way to arouse cringe and they nailed it.",
            "They're doing a shit job then. Looks more like gumball",
            "Hahaha oh my god get the fuck out",
            "Pretty common for the gender critical crowd, though",
            "7 days…",
            "I also choose this guy's dead wife....\n\n\n\nWait... I mean dare.",
            "I remember being 18 and going clubbing, taking shit loads of photos and then putting them all on Myspace in its own dedicated folder. We'd actually take digital cameras out with us. Good times man.",
            "Graduated in 2007, am forever grateful my mysoace is wiped from existence.",
            "Also class of 07. My MySpace and Xanga still exist in the depths of the internets.",
            "About a decade ago I found my xanga was still up, had to email them to ask if they could remove it and blessedly, they did. No one needs to read my horrible poetry."
        ]
    },
    "Two porch pirates fight it out for the same package": {
        "title": "Two porch pirates fight it out for the same package",
        "score": 413,
        "url": "https://v.redd.it/1dzzqchxvy7d1",
        "content": "",
        "num_comments": 58,
        "comments": [
            "That prime driver is nor paid  enough to give a shit",
            "Why's it so normal in the US to just leave packages at the door? You have to get a signature from the guy you're handing it over to in the EU unless it's being delivered to a parcel locker or something.",
            "People ain’t shit",
            "How do people know that these boxes have expensive items like I saw a video where they talked about a dude stealing a box with AirPods and an iPad and he knew the contents in the box before.",
            "Guess it's time to install automatic Sentry guns at every home seems like a very American way to deal with this issue..",
            "Take that ambition and motivation to go get a job. Fucking scum people anymore",
            "Land of freedom",
            "No, no way this is a thing right now in US",
            "[deleted]",
            "There is no pay that would make me get involved in this.  You could threaten me with a nail clipper and i would give you the package i was carrying. Are you expecting these workers to risk their lives to protect a package worth 10 bucks?",
            "It's pretty common where I live as well (Germany). But depends on the company. DHL for example always wants the signature, except if you explicitly allow them to drop off the parcel at your front door. Amazon doesn't care, they don't even try to ring. They just leave it at the front door. Probably because of time savings.",
            "When we aren't home (belgium) many deliverers bring the package to a nearby pickup location like a newspaper store and then leave a note saying it's there",
            "Americans are too busy slaving their lives away to be at home lol",
            "Well I’m not from the US but if I’m not wrong there was a time when it was common to not even lock your car or your front door in rural/less populated zones. So I guess it’s a cultural thing to have this sense of trust to deliver packages this way. \n\nObviously now society has gone to shit and getting more and more fucked every day so people break into your car, your house, steal your packages, and the phenomenon is spreading with social media and with the rise of trashy people being more than ever uncivilised and unscrupulous in their behavior. \n\nSo companies or every state should change their ways to deliver in nearby shops where you pick up your package after work like in Europe, or use secure deposit boxes, or signature for people working from home.",
            "You dont need a signature, unless they pay extra for that service",
            "Too many deliveries, that's why",
            "The US isn't as crime ridden as the EU it seems.",
            "I like how they tried to fight each other over what is very likely just someone's new Pot Holders",
            "It's like gambling",
            "That video was probably staged.",
            "lootbox irl!!!!!!!!!",
            "it's 2024, there are scanners that can detect electronics. thats why you don't see rows of parked cars in san francisco with their windows busted out, only the ones that for sure had something worth taking.",
            "America bad",
            "As a UK postie we aren't allowed to doorstep packages (though undoubtedly some do).  Are you not encouraged to put the package somewhere safe?",
            " That makes sense. I would not want any of my regular  drivers getting hurt over a package.. that race to the porch, though lol",
            "Would having cameras on the back of the delivery truck help? That way it can read a plate or catch them running back to their car",
            "I think that depends on the package.  I ordered a new phone recently (very happy with it btw) off of Amazon, and the driver sat outside for a few minutes waiting on an actual person to come grab it. \n\nI'm not sure if it was just the driver being cool or if there's some kind of procedure for higher value packages.  All I know is he asked me my name and handed it to me",
            "I don't think I've ever seen Amazon themselves deliver. Sure I've seen the trucks around before. But they never delivered around here and don't have access to the DHL parcel stations either.",
            "\"Only Americans have jobs\"",
            "Doesnt this video prove the opposite my man? The delivery guy isnt even a second gone and they already stole it lol",
            "Feels more like in the EU companies wanted to stop this from happening by using preventative measures rather than just not caring.\n\nHere in the UK they take a photo like this even when they have handed you the package (depending on company), you can specify where to leave your parcel, they can even put it in the back yard or safe space. \n\nOn that note, it's probably more to do with the lack of labour laws for Amazon workers especially in the US and that they have massive amounts of packages in comparison, making their schedules much tighter to achieve and therefore a general lack of giving a fk+ lack of time to actually follow up with delivery instructions.",
            "I've never heard of anything like that, could you post a link or video of one?",
            "everybody downvoting been real quiet since i posted that link huh. you learned something new today huh",
            "That's not what I said at all but alright mate",
            "One video does not prove anything. The fact that packages are regularly left.on peoples doorsteps and nothing happens does",
            "i don't need to, you got a basic one on your phone. go in your settings and into the bluetooth tab. see how it's detecting nearby bluetooth devices? boom, you can stand next to a car and find something you might want to take, it even tells you what device it is usually. ppl have already taken that technology and combined it with proximity detector so you know exactly where in the car it is. even the scanners at walmart can get all your credit card information with a tap.",
            "Have you ever had someone come back after downvoting to beg at your feet and apologise? Or is that a thing you invented just now to wring out whatever remaining traces self satisfaction you get from a perceived win?",
            "I mean, at least one guy has responded with an extract from your own link to show you how much of a clown you are, but boys will be boys am I right?",
            "Too bad for the rest of us that you haven't followed their lead",
            "'Your anecdote proves nothing! However, this nebulous notion I have of *plenty* of counterfactual anecdotes...'",
            "I have seen way more then 1 video lol. But i dont know the stats man  could be very safe or not i dont know. This video is just a quite extreme example lol the audicty of the voltures bruh💀",
            "How would it detect a device's bluetooth when they aren't even turned on in the box? Doesn't make any sense lmao",
            "You're the one making a claim, it's on you to back it up. Not the other way around.",
            "You usually have to put devices into pair mode in order for it to be discoverable with Bluetooth. And the last thing you mentioned is nfc.",
            "keep trying to deny what i originally posted even after spoon feeding you the information since you're a little baby who can't use critical thinking skills. i'm glad i was able to help you learn about some (not so new) technology today",
            "did i say the bluetooth detector on your phone is what the thieves use to steal? it is an EXAMPLE of technology that exists today. apple didn't make a \"help you steal\" device for your phone. but someone who wants to make a \"help you steal\" device has the technology to make one. a CHIP on your CREDIT CARD that is not emitting any electronic signals is able to give a reader all the information it needs to charge your account. i dont understand why you are so pressed about defending how thieves steal. \"oh no this video is fake\" like huhhh?? why are you trying so hard to act like ppl aren't getting robbed lmao. and since you all are too stupid to google things yourselves, i'll do it for you. https://en.m.wikipedia.org/wiki/Nonlinear_junction_detector\nyou can buy one of these for the cost of 2-3 iphones.",
            "try NLJDs since you guys can't use context clues.",
            "Jesus Christ have you ever written anything without using smug internet argument cadence? \n\n“Ummmm did I even SAY the thing that I SAID and never EXPLAINED?? heh bet you didn’t think of THAT did you CHUMP. Everyone’s just too STUPID to KNOW what I KNOW and that’s why it takes me 3 PARAGRAPHS to EXPLAIN what I’m talking ABOUT” \n\nYou type like you’re mid-shit and you want everyone to know when you push",
            "Congratulations you just played yourself. This wouldn’t tell you what’s in the car and it’d be obfuscated by the car’s ecu. Wow imagine getting that wrong",
            "Wouldn't that detect all the electronics on the vehicle? Including all the control modules built into the vehicle itself?\nI'm really not trying to start a fight with you, I'm just interested if this exists and how it would work.",
            "An NLJD wouldn’t help you steal from cars as it’s not 1885 and the electronics in any modern car would make them go haywire even if there were nothing valuable inside.",
            "NLJD, there you go moron",
            "oh my god, you mean the thousands of dollars worth detecting device was thwarted by the car's basic electronic systems, electronic systems that are also found in every fucking place so that a company who develops a detecting device wouldn't do a better job making sure things don't \"obfuscate\" it?? also the fact that a professional thief probably wouldn't point the electronic detecting device in the part of the car that has a shit ton of electronics? oh my god no way",
            "do you think thieves are like the people commenting on this post and need information to be spoon fed to them? or do you think they have enough of a brain to go \"hey this device is going off when i point it at the dashboard, so it's probably the electronics in the dashboard. but hey it's also going off when i point it at that bag in the backseat, maybe there's an electronic device in the bag in the backseat?\" i would hope they would think that, or else it would be a waste that the professional thief spent all that money on that professional thieving device",
            "I wasn’t looking for an explanation, I was roasting you for the way you express yourself",
            "From your wiki article.... \n\n\"A means to hinder isolating a non linear junction is to add inexpensive diodes to places where the NLJD is expected to sweep. This masks the true listening device against a field of false alerts when the many diodes are detected. Such a technique was used in the 1980s construction of the U.S. embassy in Moscow. Thousands of diodes were mixed by the Soviets into the building's structural concrete, making detection and removal of the true listening devices by its American occupants nearly impossible. \"\n\nI mean a diode is as basic an electronic device as you can find, and it renders it useless. And what vehicle now doesn't have a ton of electronics everywhere in it?",
            "I don't think they work nearly as well as you think they do....\n\nProper operation involves slowly brushing or sweeping the antenna over every surface in the suspect area. The procedure is very slow and time consuming, typically involving 2-5 minutes per square yard of surface area.\n\nNon Linear Junction Detectors are available in a variety of power outputs ranging from the \"civilian\" version with an output below 25 mW, to the restricted Government version with a power output over 2 watts ERP.\n\nNormally a 2 Watt NLJD will detect an eavesdropping device through several inches of concrete, inside a wall, or buried deep inside a couch. The lower power units (50-100 mW) on the other hand will only detect eavesdropping devices inside a book, or devices only an inch or so away from the antenna (such as behind a few layers of sheetrock).",
            "The dude is the personification of the 🤓👆 emoji"
        ]
    },
    "Sadcringe from pre-fame Beatles member Pete Best ": {
        "title": "Sadcringe from pre-fame Beatles member Pete Best ",
        "score": 3046,
        "url": "https://i.redd.it/4f6ehi0vfx7d1.jpeg",
        "content": "",
        "num_comments": 219,
        "comments": [
            "Pete Best somewhat accepted his footnote of being a past Beatles drummer, he got married and had kids and put out some music, but to this day he still can't drum \"Love Me Do\" and they did him dirty on this [anthology cover](https://en.m.wikipedia.org/wiki/Anthology_1) by ripping off his image and putting Ringo's head in its place.",
            "To be fair, being him must really suck. :D",
            "He should start a trio with David Prowse and the guy who bought a pizza for 20 bitcoin.",
            "Bro got cucked hard by Ringo",
            "ACDC’s original singer Dave Evans, the guy before Bon Scott, did something similar: he was “celebrating” the band’s 50th anniversary last year by recreating ACDC’s first show, without any of the other members or any kind of recognition or endorsement from the band.",
            "Imagine.",
            "You think the Beatles lasted for decades when in fact they only recorded 12 full albums and stayed together for only 7 years!",
            "I thought this was a r/beatlescirclejerk post once this popped up on my feed lol",
            "I mean his handle is “beatlespetebest”. He never got to be part of it. Doesn’t even have the ability to messa Paul in private about this. And still, it is the accomplishment of his life.",
            "Still, Best ended with a much better deal than Lennon.",
            "I’m not really cringing this. It would be interesting to see.",
            "Can you give me a tl;dr version of what happened to the beatles?",
            "This guy has a website too that is equally sad and cringe. I think it's been on this sub before!",
            "That’s pretty fuckin sad",
            "That's Angela Lansbury.",
            "The reasons for dismissal section from his Wikipedia page is a brutal read. Is just like 30 paragraphs of reasons he sucks and Ringo rules",
            "i admire Pete Best. Saw him playing, man he sounds really good",
            "\"Naaahh\"",
            "Gods poor Pete Best",
            "He had a Dave Mustaine moment",
            "😬",
            "Pete Worst",
            "Imagine how many college or high schoolers who can drum as well as Pete Best",
            "So, did Pete Best and Hannibal Lecter do the show?",
            "This isn’t cringe. Best has still achieved more than you ever will.",
            "[deleted]",
            "The beetles sucked. Pop brats. Its a travesty they are a basis by which other musicians are inspired by. The beetles sucked.",
            "Holy shit, I never noticed that before. That’s ruthless, but also really funny",
            "But he also got a 6 figure payment for that to happen which he accepted. So...",
            "Imagine getting kicked off the Beatles because you can't drum as well as Ringo Star: the luckiest man in the world.",
            "In fairness, not too many people can claim they were the Best of the Beatles",
            "Best did belatedly make a lot of money (in the millions, I've read) when the Beatles Anthology came out.",
            "Are you implying that it’s the worst to be Best?",
            "I just finished “the art of not giving a fuck” and he talks about how Pete Best has said he’s happy in life, if he hasn’t left then he wouldn’t have met his wife, had kids, and the life he has today.  It also says that there wasn’t animosity but was just asked to leave.  Whereas the drummer (?) from Metallica was kicked out and took vengeance and started MegaDeath.",
            "It was 2 pizzas for TEN THOUSAND BTC",
            "My uncle was friends with the guy who started Under Armour in the mid 90s and had a chance to be in on the ground floor… he passed",
            "With the blink 182 drummer before Travis barker.",
            "What did David prowse miss out on?",
            "David Prowse is dead",
            "To be fair, that pizza sale is one of the stepping stones of btc and cryptocurrency in general being the gigantic things they are now. It was the first ever transaction with a cryptocurrency",
            "Might even say he got beat. ",
            "yeah getting your place as a drummer taken by ringo starr must be extremely humiliating",
            "Pete Best was quite literally not the best drummer in The Beatles",
            "...who is not even the best drummer in the band, making Pete Best third best, at best. ",
            "“Imagine all The Beatles\n\nLettin’ me play with them\n\nYou may say I’m a dreamer….”",
            "\\*IMAGINE\\*",
            "Does anybody else like the Beatles but dislike Imagine? Just curious.",
            "It’s wild that “Help!” came out just one year before “Revolver.” It’s like two totally different bands.",
            ">only recorded 12 full albums\n\nThat's still quite a few.",
            "lbr, Paul stopped returning his messages a long time ago.",
            "To rob a phrase from Melania Trump, in a world where you could be Lennon, be Best.",
            "Yeah Pete dodged that Yoko bullet",
            "I think the cringe is reaching out on Twitter",
            "Young John, Paul and George played music together as teenagers. Pete best joined on drums, along with Stuart Sutcliffe on bass/guitar (can't remember). Left Liverpool and lived in Hamburg for a while, Sutcliffe died while they were in Germany. Come back to England, Best gets canned and replaced with Ringo. They move to London and become the biggest band in the world.",
            "They made music",
            "They canned him because he was better looking.",
            "Except Dave Mustaine wrote most of Metallica's best songs and then went and shredded more brutally than they ever could, putting like 10 of the best metal riffs of all time in single song.",
            "He remembers digging a hole in the fucking dirt and smoking hash through the ground",
            "Despite the downvotes (that I'm sure I'll get too) I 100% agree with you. Except I'd replace \"you\" with \"many\"",
            "And unlike Mustaine was happy with his lot in life.\n\nDave mustard stayed bitter and pissy about being kicked out.",
            "You think Pete Best had a better solo career than Paul…..?",
            "did pete make All Things Must Pass? no? then he didn't have the best solo career, sorry.",
            "Oi, you! \n\nWhy did you say \"by\" twice, you?",
            "Accepted, hopefully, on the advice of counsel....",
            "Ringo is a talented drummer, his consistent timing for a whole song (She's So Heavy, She Loves You, Day Tripper) and ability to play in a time signature when asked aren't easy to find in a drummer, plus he only made 12 mistakes during his whole studio time with The Beatles",
            "Bro *why* do Redditors parrot this shit you heard other people say? Do you get your opinions from Family Guy cutaways 20 years ago? Even five seconds of googling will tell you The Beatles were *lucky* to *get* Ringo, he was way more famous that they were at the time he joined and he was a stellar drummer for the era.",
            "Imagine being dumb enough to think Ringo isn’t a good drummer.",
            "Ridiculous comment. \n\nRingo Starr has created some of the most influential drum patterns in modern music (Come Together, Tomorrow Never Knows etc.)",
            "You probably already know this, but a lot of others won't. He once released an album titled \"Best of the Beatles\". Reddit/Technicallythetruth",
            "[*Ringo wasnt even the best drummer in the Beatles*](https://x.com/marklewisohn/status/1147844671978258432)",
            "I would have to say, that was their best album.",
            "Carmella: sad",
            "Is it in the millions? I mean it was just some very specific compilation and he only got a small share. Surely he made something, I just wonder if its substantial.",
            ">Whereas the drummer (?) from Metallica was kicked out and took vengeance and started MegaDeath.\n\nDave Mustaine was the lead guitarist in Metallica when he was kicked out. They famously just told him he's out, bought him a bus ticket to California and dropped him off.\n\nSounds like it was a little better for Best",
            "Dave Mustaine was the guitar player in Metallica, not the drummer. And funny enough, he never got over it, despite the fact that, unlike Pete Best, he became wildly succesful in his own right.",
            "^ohhhhh ^noooo",
            "What would that have been worth in real world dollars?",
            "Literally never head of them",
            "Well I don't know who he is so he can be the guy this group leaves behind.",
            "Scott Raynor",
            "Being Darth Vader.  He's the guy under the mask but they had some one else voice the character.  Then went even further and had a third guy be the face under the mask.",
            "David Prowse was the guy inside the Darth Vader costume in the original trilogy of Star Wars movies.  \n\nHe (in)famously signed his contract for a percentage of the *net* profits instead of the *gross* profits. Star Wars Episode IV came out in 1977. In 2015, David Prowse gave an interview in which he said he gets a letter each year from the studio saying that **STAR WARS** still hasn't recorded a profit, so he doesn't get any money from the movies. So he portrayed the most famous villain ever and has only ever gotten his initial $30,000ish pay for the movie.",
            "We can rebuild him, we have the technology.",
            "...Yes.",
            "Clearly he was bested.",
            "I’m warning you with peace and love, don’t be talking shit about the most important Beatle",
            "[deleted]",
            "This is a famous misquote, no Beatle said this, and Ringo is a fantastic drummer.",
            "You may say I'm their drummer  \nBut I'm not the only one (Ringo is)",
            "^imagine",
            "imagine isnt a beatles song",
            "And in seven years, too. That’s almost two albums a year on average.",
            "He said only 12 albums lmao. I think I waited for 14 years just to get a 5th album out of tool.",
            "Shame John didn’t dodge the Mark bullet",
            "Isn’t he like eighty years old at this point? This just comes across as grandpa being adorably tech illiterate.",
            "John always planned to can him because he knew he was a band drummer and the studio engineers said he was bad too, it took them awhile to can him because he was popular with the women and was only a \"decent\" drummer live",
            "😳",
            "Sir, this is /r/sadcringe, not /r/beatlescirclejerk",
            "That's a very generous reading of those events",
            "I’m sorry, please remind me again what section of Master of Puppets, Unforgiven, One, Nothing Else Matters, Low Man’s Lyric (etc.) did Mustaine write again? Most people here aren’t well versed in Metallica history so please don’t spew bullshit like “Mustaine wrote most of Metallica’s best songs”. Mustaine wrote SOME of Kill em all and had like two riffs in Ride the Lightning. That’s it. Every single drop of Metallica’s success afterwards was the result of James Hetfield and Lars Ulrich’s songwriting abilities.",
            "Just lol",
            "I will die on the hill that Paul had the best solo/after breakup career. It blows my mind people really think Lennon’s was better with half the songs featuring Yoko.",
            "[deleted]",
            "Yeah, purely as an instrumentalist, Ringo was probably the most skilled member of the band. He just doesn't have a great singing voice and isn't a very prolific songwriter. And to be fair, Octopus's Garden is a banger and Don't Pass Me By isn't half bad either.",
            "A big thing with Ringo that rarely gets talked about is his arranging skills as a drummer. It's extremely apparent in Get Back that John, Paul and George are talking about how to play each other's parts, what works together and saying very little to Ringo about what he should play. So, he's figuring out all the percussion himself after hearing scraps of a song for the first time.",
            "One of those mistakes was fucking Georges wife",
            "Ringo was widely acknowledged to be the best drummer at the time, but today people are still discovering how great he was/is.",
            "Consistent timing and time signatures are one of the same. Redundant to say he can do both. I mean, the kids I played with 25 years ago in highschool could keep time. If the argument for him being a great drummer is that he kept time then throw him in the trash lol. I don't know much about Ringo star but I enough about drumming to know this is a weird argument. Like, saying a guitar player knows all the chords lol\n\nEdit: yall are wild",
            "Not nearly as funny as family guy so I don't believe you.",
            "It's like saying Travis Barker is lucky he got to be in blink-182",
            "Yeah, they were LUCKY, man! lol",
            "Same shit with Lars and Metallica",
            "I mean, He is alright...he was just lucky enough to get in a group with true giants",
            "That was, indeed, the joke.",
            "I know this from watching The Sopranos.",
            "I learned that from Carmella Soprano!",
            "thanks carmella soprano",
            "It was definitely substantial. The Beatles anthologies were smash hits and he played drums on 10 of the recordings",
            "It was in the millions.  Rights fees are generally known and we can roughly run the math on how many tracks he was on and how many copies were sold.",
            "From my understanding he wasn't fully awake when they put him in a taxi. And then they started touring with the album he helped write and play.",
            "Just half a billion today\n\nBack then? $41. He still overpaid smh.",
            "it's a clothing brand?\n\n  \nedit: idk if it is some joke, i was just assuming it wasn't lol",
            "Definitely not Beatles money but even if he invested at 0.01% he would be a millionaire today. Oh well",
            "What does it mean when they say STAR WARS hasn't recorded a profit?",
            "Where is David? Is he safe? Is he alright?",
            "He was drummed right out.",
            "oh i love ringo. that's why i feel like we should be honest about where his strengths lie and where they don't.",
            "Agreed.  But we're not talking about Ringo",
            "It's the best Best joke I can manage. I'm sorry. 🤷",
            "They also used a replacement drummer in Australia when Ringo was sick/injured.",
            "I think I'll finally be able to say 'I'm an adult' the day that tiny superscript doesn't automatically make laugh.",
            "Good point, I should have worded it more explicitly. I guess it would be more accurate to say like Lennon and/or like his work as one of the the Fab Four but dislike Imagine.",
            "King gizzard enters the chat",
            "Which explains why they have so many shitty songs.",
            "No. That’s not how it comes across.",
            "Idk, I think he got canned because he beet wiff",
            "Maybe lol. But Mustaine did go on to have a very successful carreer after Metallica so I wouldn't say this was a 'Mustaine moment'. Megadeth is in the big four which is a pretty big accomplishment considering how many bands there are out there.",
            "I’m sorry, I physically cringed at reading someone giving any kind of positive praise to Lars. Tho I agree with your statement. It has been also a thing of great longtime effort by Robert and Kirk\n(Tho fuck Lars, he isn’t even the best drummer of metallica)",
            "Fair enough and I am a big Metallica fan too but cmon man Unforgiven and Nothing Else Matters? Those songs are terrible. Not a single guitar string was shredded writing those two stinkers. And everything after the black album just sucks out loud.",
            "meh megadeth is the best thing metallica ever made anyway",
            "Band on the Run is seminal and none of Lennon albums comes close to it.",
            "I honestly don’t think any of them had/have had a good career post Beatles. Paul is probably the best, but imo, without his fame and notoriety I don’t think Wings would have ever been popular at all. Very mediocre music.",
            "You do know that George Harrison was in The Beatles, right?",
            "I'd say George is the most skilled, then Ringo, then Paul, then John",
            "Wasn’t it the other way around?",
            "That was his 13th mistake, him Clapton and George were doing wife swapping which was weird as hell",
            "Whoa, what? That’s wild, gonna have to read about it.  Was raised a Beatles fan and never heard of this lol.",
            "In the world? **Definitely** not.",
            "Guitar George?",
            "A time signature is responsible for changing how many beats are in a measure which affects the \"feel\" of the song. Nothing to do with keeping a steady tempo.",
            "Yeah it’s an impressive but pretty fundamental skill.   \n\nWhat kills me is the “he was widely considered to be the best drummer at the time” comment under that. What?",
            "John Bonham was lucky to be in Led Zeppelin, bit of charity them taking pity on him and giving him a go like that.",
            "/r/confidentlyincorrect",
            "He’s fantastic. I say this as a guitar player who doesn’t usually even notice the drums in songs.",
            "You’re a fool",
            "Most people would interpret your joke as a direct play on his name instead of as a reference to an obscure album he made that was itself titled as a play on his name. So no, it's not obvious to the average reader, who has likely never heard of this album, that your joke was a reference to that album and not exclusively his name itself.",
            "I knew it was a joke, I just didn’t get it right away.",
            "If ya'll follow r/GOOSEtheBand at all, it's very similar on a much smaller scale of what they did recently. The fans were just dumbfounded and taken off guard, and then the new drummer comes in and you realize, there must have been a lot shit going on behind the scenes with him.",
            "Yeah, but it wasnl his joke, not yours, I was just clarifying for the people who don't spend all their time on Reddit who didn't know that he specifically released an album with that title",
            "GTFOH",
            "No, I mean at the inflated price. How much did he lose by doing this",
            "teh beltesl",
            "https://www.youtube.com/watch?v=4axYzxweKY0  \n  \nThese are the isolated drum tracks of Love Me Do, with a version by Pete Best, then Ringo then session musician Andy White. If you have any doubt about why The Beatles chose Ringo then this should clear it up. He may not have been the most prolific drummer, but what he brought to the band cannot be understated.",
            "Fuck my b I was baked lmao",
            "Did he even read your comment or has some semblance of a joke go over my head?",
            "With peace and love, I accept your apology. If I catch you talking shit about Ringo again though.....",
            "and the world will be as one ♪♪",
            "imagine there's no ringo\n\nits easy if you try\n\nsee paul, john and george there\n\non the drums, some other guy",
            "Could it be oversaturation?\n\nThe song's use during Christmastime, Remembrance Day ceremonies, and sad ad's about impoverished children have slightly ruined it for me.",
            "Yep, a bunch of duds and covers from the early years. But that’s kinda how it was for the music industry back then. If you wanted to make money as a band you had to sell a lot of records, and one of the best ways to do that was to constantly produce a lot of material. Once they got really established they focused up a bit and became more consistently great because they could afford to.",
            "Man I love some of that wings stuff. A lot of it is mediocre, trying to be Dylan with a band, and almost novelty to a fault. But there are some hidden, and some overplayed, gems. \n\nRam is right up my alley too but it’s not for everyone. I’d recommend that to anyone who hasn’t given it a go. But we all have much different tastes. Some people measure greatness simply with $$$.",
            "[deleted]",
            "George’s wife fucked him?",
            "In England certainly.\n\nMeanwhile, who are you talking about?",
            "He's got a daytime job, he's doing alright",
            "Lol it went through my head, I won't lie",
            "Lol if you aren't in tempo (time) then you aren't playing the time signature are you, now? They are one in the same.",
            "I'm glad I got both explanations because I didn't pick up on either of them.",
            "Whatheck is going on with your usernames?\n\nI feel like y'all should be friends so stop arguing.",
            "Having seen Goose with Ben and Cotter, it is pretty clear they made the right choice. There is so much more room to roam now.",
            "Why do you think people need to spend all their time on reddit to know this? They are the worlds most popular band lol",
            "I didn’t know that, didn’t know who Pete best even was. You gave me context to a silly joke and gave that joke an extra layer. I appreciate you",
            "Yeah I didn’t know this\n\nNever liked the Beatles enough to look into their pre fame members and the albums they released",
            "Idkw hy you're being downvoted I needed that explanation and I'm a decent fan of the Beatles",
            "I just told you.. it’s worth half a billion today.",
            "Either like 20 bucks or billions....\n\nBut in all honesty, probably nothing because bitcoin was a joke back then and likely wouldn't have taken off if people treated it like beanie babies from day 1. Hoarding and not using.",
            "No Daddy! 😭 \nNot the belt again!",
            "I get why that song is important in the context of Ringo coming in as a replacement, but the drums on that song are pretty boring and don’t really showcase Ringo’s actual drum talent. The song Rain is a much better example of how good he is: https://youtu.be/P3IuNGxGVXk?si=MVzEQAFsVK2rPcP8",
            "yeah, that's what i said. his strengths lie elsewhere. he's not bad, certainly better, but not particularly great overall.",
            "They cut back on the touring, and focused on studio time.  That's when things got really weird, but also brilliant.",
            "Opinion",
            "Not correct at all lol. There are many times in music where you are purposefully not playing in time to achieve emotional effect (rubato, accelerando, retardando, ect.) And you are still very much in the same time signature. Tempo is how many beats are in a minute, while time signature is how many beats are in a measure. Time signature is notated with two numbers one on top of the other (4/4, 5/4, 6/8, 12/8 are some common ones.) Tempo is noted either with a single number like \"quarter note = 120\" or with a word usually in italian like \"allegro\".",
            "My username is what it is because my cake day is on Pi day. We aren’t arguing. I was quoting Derek Zoolander. More poking fun at myself because I needed the joke explained to me. Like I’m explaining the joke to you now.",
            "It's the difference of a session player (by the BEAT) drummer, compared to a creative Jamband musician, to grow from the creativity of added beat combos.",
            "If anything I'd imagine people who don't spend all their time on Reddit would probably know more about the Beatles history and it's ex members. I can't say I've encountered much Beatles trivia in my time on Reddit.",
            "That as may be, but I didn’t know this. You’re acting like it’s common knowledge but it’s not. I honestly didn’t even know about this guy until I saw this post, so maybe I’m just uncultured lol",
            "Apparently Reddit is the only place we can gather any sort of knowledge. Who knew? (Well, someone who was on Reddit all the time might.) 🤷🏼‍♀️",
            "Fuck your profile pic. I’ve swept at it like 6 times",
            "My bad, I didn't see the first line",
            "Ringo is an amazing drummer with near perfect time keeping. He is very great. People like to meme on him using fake quotes but it's known that Ringo is fantastic.\n\nWhat would you say his elsewhere strengths are? Because I can't think of why anyone would say he's not particularly great.",
            "I misspoke when I said tempo (been long day). I meant keeping time and time signatures, which is what the original op I replied to said. What I meant was they are one in the same in the sense that if you are off time then it's totally up in the air if you are even playing a time signature at that point as it could very well be impossible to count out.",
            "Ooh, a tad literal and condescending, aren't we?\n\nI just mixed you up with the confidentpessimist guy, ^whoops.",
            "The way I see it is, Ben leads and Cotter follows.",
            "You are not. The vast majority of people have no idea there was a member of the Beatles named best. But Reddit is fickle and full of virgins like OP. Would rather spend their time being condescending on the internet or fermenting things because people don't want to spend time with them in the real world",
            "Username checks out",
            "Do you always start reading at the second line?\n\nDo you always start reading at the second line? I added my reply again in case you missed it the first time.",
            "My father was a drummer for years and a Beatles fan of many, many decades. I recall him saying that people who don’t understand why Ringo was so important to the band as a whole don’t actually understand what it means to be a good drummer.",
            "My point still stands that there are many instances where you are playing out of time and still in a time signature. Even if what you're saying were true, all that would mean is that time signatures can't be perceived without a sense of time. Not that they are the same thing. The original statement you responded to said Ringo could keep time and play different time signatures. (I can't see it verbatim as I am on mobile) meaning he can hold a steady beat/tempo and play music that would be counted with different grooves. You can make the argument that they are fundamental skills for a drummer but they are not the same skill.",
            "Calling people you don’t know virgins then calling them condescending in the very next sentence is next level self-awareness.",
            "Just take the L and move on, man.",
            "The word you are looking for is fomenting.",
            "this made me genuinely LOL",
            "That’s Reddit lol",
            "It has however given me a hilarious mental image of two people in bed losing virginity to each other and at the moment of climax, shouting out Beatles trivia.",
            "This hasn't affected me in the slightest. Been on Reddit for about 17 years now. Have been downvoted way worse than this and still used it as an opportunity to piss people off",
            "Actually, thank you. Had missed that"
        ]
    },
    "Guy throws tantrum at casino after gambling away his life savings and losing it all": {
        "title": "Guy throws tantrum at casino after gambling away his life savings and losing it all",
        "score": 2772,
        "url": "https://v.redd.it/jgrdajcj1q7d1",
        "content": "",
        "num_comments": 151,
        "comments": [
            "But he read a book about how to beat casinos",
            "Incredibly sad",
            "Looks like he doesn't even give a craps.",
            "This reminds me of the old commercial of the kid that gets caught cheating on a test and just before he hands it in and says \"do you even know who I am?\" and the teacher said \"no\", so he grabs ALL the tests and throws them into the air! ",
            "That's why, on the rare occasion that I go to the Casino, I only take like 200 bucks in cash and leave my card at home.",
            "This is why folks play at home on sites like Stake 😂",
            "God, I can’t even decide which part is the most disgusting… Him being willing to gamble his life savings, the casino allowing it, him throwing this tantrum, or these low-lives recording/laughing at someone else’s misery. This world is rotten.",
            "When I gamble I withdraw my budget in cash, and entrust my plastic with a family member. \n\nI did this too when I mooched a free show for a timeshare thing. Just had $50 for emergency cab faire on me and left the plastic behind. Enjoyed some mediocre catering and just shrugged when the pressure came on “ dunno what you want me to do I left my credit in the hotel safe “",
            "I live in Nevada and sometimes I want to become a dealer just to see drama unfold",
            "If he did actually lose his life savings, I'd probably aim for 3 hots and a cot and avoiding my spouse as well.",
            "[It’s a woman](https://www.reviewjournal.com/crime/woman-arrested-after-police-say-she-climbed-on-reno-craps-table-threw-chips-at-people-3071720/)",
            "> Guy throws tantrum at casino after gambling away his life savings and losing it all\n\nExcept A) that person was a woman, and B) the cops haven't released why she was on the table.\n\nStop making shit up for upvotes!\n\nhttps://www.msn.com/en-us/news/crime/moment-woman-climbs-onto-casino-table-and-flings-chips-into-the-air/ar-BB1oC5OR\n\nhttps://www.reviewjournal.com/crime/woman-arrested-after-police-say-she-climbed-on-reno-craps-table-threw-chips-at-people-3071720/\n\nhttps://www.casino.org/news/holy-craps-in-viral-video-woman-squats-on-reno-craps-table-throws-chips/",
            "This is very very sad",
            "Alternative title: Predatory industry peddling addictive activity that ruins lives, ruins a life.",
            "this is why you only go to casinos with 100 dollars, a few friends, and play for a good time, not to get rich.",
            "If it isn’t the consequences of my actions!",
            "Shoulda stayed away from those VLCs",
            "Worst camera work ever",
            "The camera man should be going to jail for this if anything",
            "How much money exactly did he lose?",
            "Maybe he shouldn't have bet his life savings",
            "Cotton Hill?",
            "Don't casino goers know casinos rig the game to make people spend more . Isn't it common knowledge?",
            "I worked on a casino boat. You would be AMAZED how many people demanded their money back after losing everything.  Their reasoning : \"It's just a game \" smh",
            "Wow that's depressing. Addiction sucks.",
            "This is what the biggest spoiled generation looks like after losing.",
            "He looks 12, maybe he's not old enough to gamble",
            "I bet he got to see the back room where the casino owners head of security and his 2 top goods get to  “interrogate” him before bringing him in to the police station",
            "I have to hope there's some sort of law to keep gun stores a certain distance away from casinos",
            "Don't gamble what you cannot afford to lose.",
            "I wish there was a way to prevent this. Oh well. Next.",
            "Even if he won he would have kept gambling",
            "This is rock bottom. Bedrock. \n\nSometimes it's sad that we all have cameras in our pockets. I feel awful watching a man reduced to this level, I feel like the shame of the people at the casino watching him breakdown would be enough.",
            "Dang it would be nice to catch a couple of those chips.",
            "What a chump.",
            "That sucks",
            "This really just makes me sad… not as sad as when a company dumps everyone’s 401k or retirement… but close…",
            "Most gamblers quit before hitting BIG",
            "this makes me so happy",
            "Quite literally a loser",
            "So what do they do about all those chips being mixed up",
            "Well sounds like he needs to take out a loan to win those savings back!",
            "He’s a tiny little fella.",
            "The gambling episodes of Intervention were always so interesting.",
            "Dude would have been lucky to go to jail in the 60s, they’d have backroomed him and beat the living shit out of him.",
            "Little Joe from Kokomo?",
            "It was 86 dollars.",
            "That’s so sad.  Did he lose all 317 dollars?",
            "HAHAHHA \n\nAh man. This shit is the reason I want to go to Vegas. I just want to go and people watch. Find the Clark Griswold or people like the ones in the Louis Theroux documentary about Vegas.",
            "Play stupid games win boomer prizes",
            "I don’t think this guy understands what “gambling” means.",
            "I think gambling and lottery tickets are stupid but I can see how technically, the people who heavily buy into such things are probably so bad at decision making that a lottery is literally their best chance at ever becoming rich, since getting a high level job or running a successful business takes too much critical thinking which they lack.",
            "Casinos are so glamorous.",
            "Did he also ask ChatGPT for betting strategies?",
            "The greatest generation",
            "I read about this one and the old dude didn't lose his savings, the dude was just dementia ridden a little crazy",
            "Security are going to beat his ass",
            "His shoe calculator ran out of batteries",
            "Step 1: create a distraction and make it big \n\nStep 2: ????\n\nStep 3: Profit?",
            "“Casinos don’t want you to know this trick, but can’t stop you!”",
            "He probably that video of another dude doing the same thing but winning and he thought “fuck it if he can do it I can too!”",
            "Addiction sucks.",
            "I agree. I have a pretty dark sense of humor but this is awful. I also can’t imagine having the lowest moment of my life recorded.",
            "Why does he look 4' tall?",
            "Nice",
            "you have a good eye sight",
            "This one? \n\nhttps://youtu.be/2NfuniN0Sdg?si=0H2hK70NZ10vnjUF",
            "You know what's interesting? I heard that same thing told as just a regular joke (except the student isn't cheating, just takes too long to finish the exam, and doesn't toss the papers, just sticks his in the middle of the pile) *at least a decade* before that movie came out.",
            "Isn't that from the movie 3 Idiots",
            "I have a few rules. 1) don't stay more than 2 or 3 days. 2) no women are interested in you 3) ignore anyone who wants to talk to you on the street 4) put all you cash in envelopes marked for each day and only open it on that day. ",
            "I always try to go in with $300 in hand and $200 on the side. I try to work the $300 up but if I need some backup I got $200 to try and change momentum. If I get positive $200-$300 walk away. Problem is I never walk away when I’m up really good. Last time started with $500, went from +$600 ($1100 total) to -$80 (walked out with $420). I like to play poker most of all because I’m not playing against the house but I can come up quick on roulette. Got to make a game plan and actually follow it!",
            "Now you can lose thousands of dollars from the comfort of your own home!",
            "This is an ad. All his posts mention the gambling website.",
            "The last time I was in Vegas they advertised programs that you could basically take a loan out against your house and they had attorneys on site who would help you do so free of charge.",
            "Seeing everyone surrounding him filming him.. it’s like a Black Mirror episode",
            "I’m not sure how long it would be fun to watch people get chewed up by a casino. \n\nIt would be like scraping people out of the gears of an amusement park ride five days a week saying “Well 99 percent of the people who get on this ride have fun, the unlucky ones know what they signed up for.”\n\nNot saying casinos shouldn’t exist, or even that I’ve never been in one, but I think we should acknowledge the fact that they’re designed to mulch the mentally vulnerable for profit.",
            "from my experience it will be mostly players yelling at you",
            "from what I've read of askreddit threads about casino employees, a fair bit of it is people pissing and shitting themselves right there at the table because they don't want to lose their streak by taking a bathroom break",
            "That's the way she goes",
            "Yeah, he should've gone with MPC.",
            "It's a she",
            "Much appreciated reference",
            "63 year old",
            "I was wondering the same thing. I’d guess maybe using cameras to backtrack and see what everyone had?",
            "Take it slow...",
            "Riiiight.  There can't possibly be any video footage of any other generation doing something stupid online, can there?",
            "boomer. 63 year old woman.",
            "Underpants gnome?",
            "I'm sorry but anyone who looks at all these casinos that regularly make money off of people gambling and STILL thinks the odds are fair and not overwhelmingly in the house's favour is a moron.\n\nCasinos are businnesses with a steady stream of revenue.\n\nRandom outcomes do NOT result with steady revenue.\n\nTherefore: the whole thing is rigged against you\n\nAnd no, there is no magical system around it, if it were people would bleed casinos dry left and right.\n\nThere is a reason why these places make money ffs.",
            "My dad was a bookie my whole life I’ve seen the good and the bad. I think it’s all ugly.",
            "I was offered a very lucrative job with benefits for one of the UK's big casinos. Didn't take as I have no desire to have anything to do with that industry. I'm from a one horse ex miners town that's now just full of betting shops and I've seen first hand the damage it does.\n\n\nWhen I hear a celebrity turn down an endorsement for those types of companies my respect for them goes up ",
            "Sad part is this isn’t the lowest man",
            "He looks like Cotton Hill.",
            "It's from the movie Cheaters",
            "I misread casino as \"Costco\" and was highly entertained by these rules.",
            "Smart rules. It's not just casinos that are predatory, if you're doing well, everyone else becomes a shark too.",
            "What do you mean days?   People spend days in a casino?? Where do you even sleep",
            "That's pretty damn evil",
            "Sharks",
            "Many years ago I worked in a liquor store and had to sell lottery tickets. It was so sobering, so to speak.  We were dealing drugs to two kinds of addicts, basically. The alcoholics kept coming back for nip bottles and the gambling addicts would come in with their newly cashed paycheck and just burn it all on scratch tickets, growing more desperate and doubling down the more they lost.\n\nSometimes they were the same people.  Yeah we sold both booze and lottery tickets to normal well adjusted people who enjoyed them in moderation. But there were so many addicts, and I've never forgotten how their faces looked as they succumbed to their impulses. \n\nI don't drink and I don't gamble to this day, in no small part because of that job.",
            "100%. Kinda similar, I worked at sweepstakes' place years ago. Our best customers were always the ones who lost consistently, never cashed out, and always wanted more. There was this one lady who lost her whole check there. I felt bad. She just wouldn't stop. She even would gamble all the change from her house, my boss had to make a rule that we couldn't accept change.",
            "Then casinos shouldn't exist.\n\nCasinos work by doing their best to lure people into a gambling addiction\n\nThey do shit like having a rule where you can't have clocks on casino walls because that way people lose track of time and stay longer (yes, this is actually a thing)\n\nOr how card counting (which is legal btw) will get you kicked out and blacklisted because it doesn't make them money. They don't care if your hard work and... well, thinking (because card counting is just thinking and strategizing) pays off they will literally not let you.\n\nIts all just so slimy and disgusting.",
            "Banks too but no one questions them",
            "Sometimes she goes, sometimes she doesn’t.",
            "I was watching with the sound off, I'm sorry.",
            "There are plenty of magical systems around it. Which all have the same flaw. They assume you have an infinite amount of money in some steps to compensate. The house only has to wait till you cannot pay the compensation, while you can try to stay away from infinity as long as possible.",
            "Thanks for stating the obvious.",
            "Duh",
            "Wow dude, I’m sorry you didn’t get the joke.",
            "Ikr. The odds are stacked against you. You're not playing to win at a game. You're playing at the odds of being chosen as bait for other gamblers to aspire to. No one will play in a casino that constantly beats players, but one winner here and there, entices the gamblers.",
            "The good?",
            "I guess its a trope that has been used in multiple movies then",
            "Dear Diary, \n\nIt's day 15 in the Costco. I wish I had followed the rules posted by /u/Qubed. I have staked out a claim in the deli, where I ravenously devour two rotisserie chickens and half a block of cheese a day. The police have set up a barricade and are begging me to come out. I saw my wife yesterday, she tells me the kids are upset and she wants me to come home. I want to go back to her, I really do but... something about this place has its hooks in me. The crazy deals, the bulk items, the incredible flavors... I just cannot pull away. Maybe tomorrow I'll have started to grow weary of this paradise.",
            "I mean. You're not wrong because Costco is just as worse as gambling lol.",
            "Usually in a room above the casino. ",
            "I used to manage a bar and pizza place where a lot of the employees were my friends and people within my social circle that I'd partied with regularly prior to working there. I'm not a huge drinker (not to say I don't or haven't had my share of long nights in the past), and one of the hardest parts of the job was having to navigate a lot of these people's addictions, due largely to the place having a party-like atmosphere and culture where drinking certainly wasn't discouraged. Like the number one reason people got fired was because they were TOO drunk on the job, and this would be after several second chances.",
            "I take $20 out of my paycheck and spend it on scratchoffs. I buy the $1 ones because i either get lucky and win 4-ish times, or unlucky and only lose 20 bucks. Ive seen people go in and spend around $500+ in lotto, and it is NUTS.",
            "I knew a slobbering drunkard that was a ward of the state. He took his SOCSEC checks directly to the liquor store and cashed them there then got slobbering drunk and stumbled home (and drinking while stumbling home) where he drank more. He would fall down the stairs and break his arm or leg or ribs. Or crawl into a hole in his basement with a power drill and pass out attempting to drill through the wall with an egg beater in the drill chuck. He was diabetic too, so amongst the thousands of beer cans there were thousands of used needles. He passed on and the house was deemed unfit for human habitation. The city boarded up the windows and just left it like that.",
            "Here in korea you can't spend more than 50,000won(45$) in lottery and other gambling tickets.",
            "This has been going on for a loooong time as well.\n\nI recall back in the late 80's down in Florida when the national lotteries were first becoming insanely big with payouts.\n\nA family remortgaged their home to buy 10,000 tickets thinking they would be assured of a win.\n\nIt didn't work.",
            "No clocks, no windows, the carpeting, the layouts - so much psychology is involved in designing and operating a casino",
            "I’d like to know how banks are even remotely similar",
            "People question banks all the time",
            "Don't be. I had to google to find the details",
            "The other flaw is that they assume you know when to walk away",
            "The fact that people fall victims to these places means that apparently its not that obvious :/",
            "The money can be good when you win but like I said it’s all ugly.",
            "I find blackjack at the casino to be an enjoyable thing to do to waste 50 bucks and an hour of my time at a table with low stakes. Sometimes you win, usually you don't. \n\nIf you look at it as entertainment and can respectfully treat it as such without chasing the win, or worse chasing after your losses,  it can be \"good\". \n\nBut I recognize that a lot of people are incapable of viewing it that way.",
            "It's not a trope, it's a scene that's copied in many movies, but cheaters did it first.",
            "This is poetry",
            "Dammit. Your profile picture fooled me thinking there was a cat hair on my screen. Well done!",
            "I'm sorry this may be a stupid question but how exactly is this enforced?\n\nPer person? Per establishment? Per card? And is it per night? Per month?",
            "And its all to get you to stay there as long as possible, lose as much as possible and come back as much as possible.\n\nThe fact that something like this isn't illegal is wild to me.",
            "Actually the complete opposite, they assume you can play long enough to guarantee the flipped odds start paying off, but you get kicked out within an hour or 2 usually",
            "Go with a budget. Budget is a ticket for entertainment. Sometimes entertainment is free... :D",
            "Yeah I’m not knocking people who enjoy gambling responsibly. I just don’t part take because I’ve seen what it can do to people. Gamblings been around since the dawn of time.",
            "This is how I treat poker nights with buddies or if I ever go to a casino lol\n\nIt can make it really fun especially when you just bet stupidly and bluff and it pays off",
            "Well it is illegal though most places",
            "Yeah that's fair.\n\nI remember taking my long time friend to Vegas some years back. When we were kids we both played the shit out of fallout new Vegas and loved blackjack. I had been a couple time and this was his first and my first in a group that included more than me and my girlfriend. \n\nFirst time at the blackjack table the guy loses all he brought trying to win back what he lost and just obsessed about it for an hour after. You could visibly see the struggle on his face to stop, but he just couldn't. It was that moment I realized that my friend was likely prone to addiction.",
            "Hope you got him outta there before they ended up like the person in post.",
            "Kept him away from the tables for the rest of the trip, for sure. I mostly go for the shows, food, and outdoor stuff anyways."
        ]
    },
    "Imagine destroying your kids accomplishments in your mind.": {
        "title": "Imagine destroying your kids accomplishments in your mind.",
        "score": 559,
        "url": "https://i.redd.it/79s4fe2jou7d1.jpeg",
        "content": "",
        "num_comments": 50,
        "comments": [
            "This isn't even bait, this is a repeat spammer who's become a problem on a bunch of parenting boards including r/kindergarten \n\nHe has a really unpleasant power-imbalance fetish and wants to hear exactly how rough people play with their kids, exactly how weak they are, and asks us to explain over and over why we 'let them win' rather than just hitting them with full force.\n\nIt's grim.",
            "His kids seem like weaklings, he's really just telling on himself for giving them an ineffective training regimen ",
            "If my son can’t bench at least 135 by age 8 I’m sending it back to the pound",
            "Thats bait bro, chill",
            "Inside thought: 'Imagine being so insecure you feel threatened by your own 5 year old kids' lol",
            "If it’s not bait it’s someone trying to be funny and failing",
            "If someone had to stand on a stool AND hop to reach a lightswitch....Wouldn't they be like 10 inches tall?",
            "This is Sadcringe in the sense that constructing posts like this for the sole purpose of generating outrage and fulfilling a desparate, pathetic need for meaningless attention, has become a somewhat common human activity.",
            "Bad wanna standup joke...yikes",
            "They don’t seem to understand how accomplishments work. These are children we’re talking about (I assume anyway, ages are never given, it would be really sad if they were adults). They’re small, dumb, and weak, so relatively speaking, everything is an accomplishment. It’s an accomplishment if they manage not to die when left along for 10 mins.",
            "bad bait",
            "r/writing \"published authors\" when their five year old child writes a one page story in crayon:",
            "Ok I get this looks like bait but I have meet people who treat their kids that way. It’s like they feel so bad about themselves they are finally happy to have someone they’re better than.",
            "This HAS to be bait bro ain’t no way 😭😭😭",
            "Am I the only one getting the ick from “I mean INSIDE THOUGHT” used sincerely TWICE?",
            "Inside thought: “imagine not being able to close a quote.”",
            "Those poor kids.",
            "I understand actually. As a kid my father dropped me off in the forest with only a knife and a fat friend to push down when the bears/wolves came after me. I'm tough.",
            "\"Why don't my kids visit me anymore?\" ",
            "Plot twist: this person's kids are 35 years old",
            "I hope this is a joke. If not, I feel so bad for those kids.",
            "This is like 2002 Maddox level shit",
            "I feel bad for their kids.",
            "It’s just silly is all",
            "Okay that is extremely creepy",
            "Somehow I'm not surprised this is what it is. There's been a few subs I'm on where some trolls have a bizarre fixation on an abnormal topic.",
            "I hate that this was something I didn't know about the world and had to learn today",
            "That dude needs to be on a watch list.",
            "And he (or a troll with a new account) just posted it again, jfc. People are depressing sometimes",
            "i need to go hit my head against the wall until i forget reading this comment 🤢",
            "Ok, fuck It, I'll still take that over the thought that a little kid was excited to show Dad something they were proud of and him just going \"eh\". ",
            "My sack-of-shit alarm just went off.",
            "And yet he hasn’t been permabanned on those subreddits? Are the mods morons?",
            "Had me in the first half",
            "Tbf even as bait this gave me that sad cringe feeling.",
            "Isn't that just bait?",
            "My daughter is 6 and can barely reach our switches on her tiptoes at times. \n\nThis was in the kindergarten subreddit",
            "It was in the kindergarten sub",
            "Yeah, I didn’t know if it was bait or not but damn it made me feel gross to read",
            "Don’t even get me started on Southern Algerian “cuisine”",
            "You put my thoughts perfectly into words.",
            "Yeah, his account count  is in the hundreds. Report asap.",
            "I don’t think he’s actually a parent at all, for which I am very thankful.",
            "You'd rather him be fetishizing children and parents over being a narcissistic ass? I'd say they're both pretty bad.",
            "He generates an entire new user profile every time; I’m hoping his IP address will eventually be banned.",
            "I really, really, really hope he is not a parent.  We would probably know if he was, like it would have been given away at this point over the hundreds of accounts this guy apparently has, right?",
            "Sounds like he isn't in the truth of the matter. I can see why he's still a problem. Dude just fucking carries whatever he's carrying, freely, on a radius. ",
            "Yeah dude, don't lose sleep over it, I was just saying I felt bad 🙄 "
        ]
    }
}