{
    "Lifting the fog": {
        "title": "Lifting the fog",
        "score": 1,
        "url": "https://www.reddit.com/r/sanfrancisco/comments/1dhvcnw/lifting_the_fog/",
        "content": "Please enjoy this space to discuss local things like upcoming events, new sights you’ve spotted around the city, or mundane little sanfranciscoisms that strike your fancy. You can even self-promote a little here if you abide by the rules in the sidebar. Have a good day!\n\n[Archive of past discussions](https://www.reddit.com/r/sanfrancisco/search/?q=author%3Aautomoderator&sort=new&restrict_sr=on)",
        "num_comments": 1,
        "comments": [
            "Went to Saluhall yesterday and it was really cool!  Definitely worth checking out.  Might have just gotten lucky but also pleasantly surprised by the street conditions on Market."
        ]
    },
    "CA consumer protection committee APPROVES Restaurant junk fee exemption SB 1524 ": {
        "title": "CA consumer protection committee APPROVES Restaurant junk fee exemption SB 1524 ",
        "score": 748,
        "url": "https://v.redd.it/mwhjw73h1z7d1",
        "content": "",
        "num_comments": 245,
        "comments": [
            "Let’s collectively identify and stop supporting businesses with hidden fees.",
            "Ballot prop, anyone?",
            "Imagine trying to say that it’s essentially consumers jobs to balance the pay discrepancies between front and back of house. Please don’t support restaurants that still put these bs fees.",
            "Isn't Weiner cosponsor?",
            "Absolute horseshit.",
            "Drain the swamp.\n\nYou can watch our consumer protection committee turn into the restaurant protection committee at the link below. Starts around 2 hours 19 min. Half the committee is on their phones the entire time and doesn't seem like they care\n\n[https://www.assembly.ca.gov/media/assembly-privacy-and-consumer-protection-committee-20240618](https://www.assembly.ca.gov/media/assembly-privacy-and-consumer-protection-committee-20240618)",
            "This is pathetic. We deserve price transparency!",
            "Shame on these pathetic politicians.",
            "Time to reprint and post their menus with all fees, taxes, and \"suggested\" tips included in the prices.\n\nFor example:\n\n*French Onion Soup — $21.99*\n\nbecomes\n\n*French Onion Soup — $29.59 / $30.10 / $31.35*\n\nIf you won't be honest, we'll be honest for you.",
            "Consumer protection eh?",
            "What’s the logic behind an exemption?",
            "Consumer Protection Committee going all “protect the businesses, protect the businesses, blah blah blah..” wtf has this come to?",
            "Shame on Weiner!",
            "Hopefully this will be the tipping point (pun intended) for consumers. \n\nRestaurant owners; pay your staff, and accurately state your prices. How hard is that?",
            "Unbelievable!",
            "Restaurants that don’t have junk fees should advertise as such",
            "Glad to see them protecting the corporations that lobby them and not the people that vote for them.",
            "Is there a list of names of the corrupt politicians who approved this bullshit exemption?",
            "Yeah fuck this im done tipping till this is fixed.",
            "Anyone know how servers/bartenders feel about this? Surely this will hurt their tips. I’m so glad I got out of that industry!",
            "Maybe provide a list of restaurants that do not charge hidden fees? I wouldn’t want free advertisements to the ones that do charge hidden fees.",
            "Damn that’s rough. How hard is it to make the menu prices reflect whatever fee or upcharge you need to run your business?\n\nI think it’s because they want the flexibility of changing it kinda like rush hour pricing or peak hour pricing. What a terrible predicament for consumers who want to eat lunch at the same time because they have to.\n\nI’d boycott, this is BS",
            "Now if they could only take over PG&E and drop they're insane rates.",
            "Despicable",
            "This state is run by a bunch of jabronis.",
            "This is disgusting. I hate the government",
            "I don't care if he's good in housing or whatever some such. He's dirt to me. This is my one issue. I am for the first time a one issue voter.",
            "Consumer protection committee? Interesting choice of name.",
            "So I grab lunch from Cafe Pacific Plaza on Franklin at least once a week—they’re my local, a great little family spot. (Great food great prices btw hit them up.) They have a certain way of ringing you up so that you CANNOT leave tips. It’s not in the receipt and there’s no tip jar. I even try sometimes but to no avail. It’s like they don’t want your tips; they want you to come weekly and buy lunch! What a concept.",
            "Wiener’s protection committee",
            "Scott wiener can go to hell. ",
            "What party appoints these grifters to the committee?",
            "Vote Wiener out! If anyone runs against him, they are automatically getting my vote.",
            "Should change their name to \"Business Protection Committee\" because right now they are literally doing the opposite of their job.",
            "What bullshit,  just adjust your menu prices in order to pay everyone reasonably.",
            "Fuck Citizen’s United and this legal bribery rampant throughout the system.",
            "Honestly I’m for it! Just won’t tip!",
            "I eat out daily, several times a day. Each shady ass restaurant, eatery or cafe pulling this shit just lost a customer. No more!",
            "![gif](giphy|vhaj0GMFlIeFa|downsized)",
            "Booooooo",
            "🤡",
            "Shills gonna shill.",
            "Let’s not eat out for now and let’s see these clowns rethink this",
            "Fuck these people",
            "Can we start handing the restaurant a bill with our “customer appreciation” fee? They have a hidden fee and so do we.",
            "Seeing the reaction of Scott wiener getting booed in public lives rent free in my mind.",
            "\"consumer protection\"\n\nOrwell must be impressed.",
            "This is very clearly an attempt to hide the cost of going to a Restaurant. It's also why we should stop tipping. Pay people a reasonable wage and move on.",
            "I have never seen San Francisco so united on an issue, just to be undermined by an exemption. Would love for someone to explain the logic behind this move, if it exists.",
            "Well, guess Dodd lost my vote this next election. Sucks because he just presented an award to me. 🤷🏻‍♂️ Oh well.",
            "Maybe collectively we can get Google or Yelp to tag places with hidden fees.  That'll naturally discourage the practice once it's more publicized.",
            "1 step forward, 99 steps back. \n\nNever think for a minute that bags of cash from lobbyists don't undermine democracy and the common interest of the people. #FlipFlopScottWiener",
            "consumer \"protection\"",
            "Toni Atkins for Governor (the Lt. Gov. is a cosponsor of this bill).",
            "Any reporting to give a sense of how this will do in the Senate, House, and on the governor's desk?",
            "Two words: class action",
            "Motherf! Why is this not obviously wrong?!",
            "Now that Scott Wiener's SB-1524, to weaken the consumer protection law SB-478 is heading to the governor's desk, there is a website set up, [https://seefeesca](https://seefeesca) that details the hidden fees, if any, of restaurants.\n\nAnyone can add more restaurants to the database. The list has been growing quickly.\n\nPlease do not patronize restaurants with hidden fees.\n\nPlease add restaurants to the list, both those with and without hidden fees.",
            "I hope the Governor vetoes this.\n\n(Same comment I posted previously)",
            "I’m going to reduce the tip.",
            "Everything this dick head said can apply to hotel fees, ticket fees, car rental fees etc.\n\nThe difference is these organiztions didnt weite these dickheads a big fat check.",
            "Just skip the restaurants with fees. Those without hidden fees could benefit from advertising.",
            "Usually I tip 10-20% based on service and attention. Junk fees become part of this.",
            "Yall should just remove any additional fees (health care, cost of living, etc) from tips.",
            "[removed]",
            "It would be excellent if Google/Apple maps and yelpade this a search feature and also displayed \"restaurant uses hidden fees\" while viewing the merchant.",
            "So this means that restaurants will be allowed to continue with service charges hidden in the total???",
            "The only way I’ve been able to stomach paying these stupid surprise fees is by knowing they’d be history come July 1st. \n\nI’m now actively avoiding the places that do it. First question I’ll ask is “any fees tacked on to your checks?” and if they say yes, that’s it. No more supporting this deception.",
            "Lol, everyone voted for these POS and now they’re mad.. these guys got greased with some of the fee revenue",
            "Remember to also vote...with your ballot and wallet",
            "Who supported it? Sounds like they need a phone call",
            "Identify these restaurants www.seefees.ca",
            "With how things are going everyone should learn to cook. 90% of the time I go out I'm just disappointed or think \"I could have done this dish much better\".",
            "happy to not eat out in san francisco lmao, this city",
            "Fuck this shit",
            "r/LosAngeles",
            "I was voting against Scott winner anyway this just makes the choice easier",
            "Ask if they charge the fees before you sit down",
            "Wait?? So we are gonna continue to have BS fees at restaurants? Is it confirmed that restaurants are exempt bill 578?\n\nMan I was getting so hyped to say good riddance to that shit",
            "Forgive my ignorance but I’m trying to understand why people are so angry? I would just reduce the tip or just not tip at all if I saw a restaurant with these fees. \n\nNot trying to start a war here but genuinely curious. Unless people are mad because they feel these fees are going to the restaurant and not to the actual workers like tips are?",
            "When any single politician or party realizes their constituents will vote for them no matter what, they will stop caring about them. That said this is not an invitation to vote for the right, it certainly goes both ways and applies to republicans in other states. This is the main issue of a bipartisan system where no third party can truly emerge because those votes will be disregarded as wasted. My only advice is stop trying to vote strategically and consider third parties if they reflect your values more than the traditional parties. No individual vote in California or far right states will make a difference anyway.",
            "Here's the thing, we have a lot of people who are just venting about how much they hate these politicians. But won't vote someone else in their places because likely the other candidate is a Republican. And God forbid you vote a republican into office. So, many of you will bow their head, vote the same stupid politicians into office. I don't care if they are republican already in office, if they do a shit job and my only other option is a Democrat, I'm voting for them. Before anyone gets upset and says I'm aa Trump supporter, I never voted for him during any election, I voted for Johnson and then Jorgenson. \n\n\nTLDR. You don't like who is in office, do something about it and let them all know you don't want anyone who isn't going to do their job for us.",
            "I talked with some restaurant people about all this. FWIW they were going to have to stop doing the health mandate fees, which all of them declared in their menu so it wasn’t hidden, and it even prevented the 20% mandatory fee for larger groups. \n\nEveryone is so damn angry about all this and I’m not taking a side. But it did seem like there were unintentional consequences from the original bill. \n\nPlease continue losing your damn minds though :)",
            "Why does this get people so up in arms? We’ve got serious problems in the world and THIS is what is going to get people butt hurt?",
            "If you see something, post it (I didn’t start this): https://seefeesca.notion.site/f5e11f589ec54c8eb1eed6c37f7e4c83?v=b97b3560f8f747f68aa73a762e76e47b",
            "> Let’s collectively identify and stop supporting businesses with hidden fees.\n\nIsn't collective action what a working government *does?* \n\nThe fact that we have to do it ourselves, after paying enormous taxes for our elective representatives and our boards of consumer protection and our Attorney General, just shows that our government no longer works for us.\n\nName me *one* elected official who is standing against the numerically small but highly influential because of campaign contributions restaurant association.\n\nAssemblyman Matt Haney is spending $75,000 of his campaign contributions on going to Giants games, and he's all for surcharges. \n\nSenator Scott Wiener is co-sponsoring the surcharges bill.\n\nThe Consumer Protection Committee rubber-stamped the surcharges rather than protecting consumers.\n\nAttorney General Rob Bonta sent no one to testify against the bill.\n\nAnd Gavin Newsom hasn't said a word against it.\n\nWho exactly is *for us?*\n\nWho is for us?",
            "Review bomb them on Google and Yelp.\n\n\"Food was decent but they scammed me on the bill with surprise hidden charges, 1/5 stars.\"",
            "The simple solution is to not tip anymore when you see hidden fees. Let the employees fight for you.",
            "It's very hard to do this if you often don't know until the bill comes, and certainly don't know until you've sat down.",
            "How do we get a ballot prop going?",
            "Yep I think this is going to be the solution.  Honestly, I think you can find 50% +1 of Californians who hate these random fees being tacked on.",
            "Newsom is sneakily blocking those after sufficient signatures are verified. The taxpayer accountability bill and prop 48 repeal. One done through courts (spending 40k of our money to fight expense transparency) and blocked prop 48 by his own \"reform\" that interferes with it specifically. He hates democracy.",
            "He is, very very dissapointed",
            "Never voting for him again",
            "He's a giant POS. I will vote for literally anyone except him.",
            "God damned infuriating.",
            "> Half the committee is on their phones the entire time and doesn't seem like they care\n\n\nBut we're still paying them to \"protect\" us, right?",
            "Yeah, they are texting restaurant owners in their districts for \"donations\"",
            "pathetic humans",
            "Shame on Weiner!",
            "Shame on them for negotiating a cut of these fees? How did you expect a money grubbing politician to behave? They’re all in the pockets of any one offering cash.",
            "This seems like a very reasonable answer if you could get the critical mass of people onto a platform.",
            "That’s what a permanent marker is for. Cross out and replace with the actual price.",
            "Someone should make an APP that takes in menu of a restaurant and outputs the actual price customers have to pay, by which I mean the post tax and tips (and whatever fees if applicable) price.",
            "UNITE HERE, a food service worker union joined up the restaurant business association to go against it.",
            "For what it’s worth, the job of the Consumer Protection Committee is not to increase consumer protection. It’s to consider bills which touch on the topic of consumer protection. They’re supposed to balance consumer protection with other priorities.",
            "Sorry but 95% of California's population has no fucking clue any of this is happening",
            "Yes, like EVERY OTHER BUSINESS!",
            "> Hopefully this will be the tipping point (pun intended) for consumers.\n> \n> \n\nIt won't be.",
            "So far it seems to be unanimous, so its all of them.",
            "Server here (in the industry over 10 years serving & bartending), not happy about it and everyone I know in the industry feels the same way",
            "UNITE HERE, the union representing hospitality workers, was [the main organization](https://apcp.assembly.ca.gov/system/files/2024-06/sb-1524-dodd-apcp-analysis.pdf) behind it. \n\nTLDR; In many collective bargaining agreements, the union negotiated for benefits paid for by service charges. \n\n>UNITE HERE writes:  \n  \nAn unintended consequence of last year’s SB 478 is that legitimate service fees charged by restaurants will no longer be allowed after July 1 of this year. Many of those service fees go to workers either through service charges that are distributed to both front and back of the house staff in restaurants. Other service charges go to supplement health and pension benefits of food service workers at restaurants, bars, banquet operators, airports, stadiums, and many other places where consumers are fed. Much of this has been negotiated through collective bargaining between our union and employers. Without SB 1524, all of this would be upended, and these workers would see unnecessary pay and benefit cuts",
            "[Search and contribute here](https://seefeesca.notion.site/f5e11f589ec54c8eb1eed6c37f7e4c83?v=b97b3560f8f747f68aa73a762e76e47b)",
            "PG&E – they’re insane!",
            "Well you can always support his opponent, who is openly anti-trans and anti-mask",
            "Both. All committees have both dems and repubs.",
            "His opponent is a far-right anti-trans Republican. So, this is a pretty fucking dumb thing to say.\n\nUnless you don't support trans people, I guess.",
            "Yelp will just charge restaurants a fee to remove the tag.",
            "Has Toni Atkins taken a position on this?",
            "Unfortunately, that basically punishes the server for their boss's actions.",
            "Surveys and polls are not permitted.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/sanfrancisco) if you have any questions or concerns.*",
            "Yep. Sadly as bad as Weiner is on thúc a Republican would be even more anti-consumer. They literally work to disband the CFPB.",
            "The republicans on this committee also voted in favor of it. Republicans have been trying for years to disband the CFPB. They are even less pro-consumer.",
            ">But won't vote someone else in their places because likely the other candidate is a Republican.\n\nDo you think the (R) next to somebody's name is what makes people here not want to vote for them? Lol. Yvette Corkrean thinks that \"bodily autonomy\" should apply to vaccines and masks but not puberty blockers and abortion. Scratch that -- she doesn't even think a kid over the age of 12 should be able to get a vaccine, of their own volition, without parental consent. If you're looking for a reason people in SF won't vote for her, there it is. And has she even made a statement on junk fees, or is she in the restaurant industry's pockets too?\n\nLike sure, people love to complain about their politicians, but Republican candidates are saying outright that they will not represent the fundamental values of the vast majority of SF. Why would we care more about junk fees than that?",
            "I get the complaint about autograt going away for large groups. That's one exemption I could get behind. But the \"health mandate charge\" was just whiny restaurant owners not being happy about being required to pay for employee healthcare and making it look like a tax instead of just raising their menu prices to cover expenses.",
            "Because the legislature passed a law requiring transparency in pricing, which is widely supported, and now they’re exempting one business sector from having to play by the same rules. Don’t worry, we’re all still butt hurt about the issues that you prioritize.",
            "We are wiener hurt.",
            "I literally have relatives under bombs in Ukraine but I still care about this bill. We can care about more than one thing at a time. Also, this bill affects many of us very directly since we are paying these fees every time we eat out.",
            "Can we go national with this? I'll create one for my state, but why not just blow this one out? Nationally, fees can get wrecked.",
            "Is the gialina one true? Can anybody confirm?",
            "Thanks for sharing this! I got my domain working now www.seefees.ca",
            "I understand this is not yours, but this would be much more helpful if I knew what the fee was supposedly supporting . I am personally OK with large party automatic tips, which is different from \"large party fee\".",
            "We can and should do/have both.",
            "The GGRA president who lobbied this owns terzo.",
            "How are fees allowed, but not regulated - like if you are allowed a hidden fee why aren’t they all the same?",
            "Seriously this is the only way now. Even if a place is decent, if they have a charge added to the bill then leave them a negative review. Restaurants really care about negative reviews and it will get their attention fast.",
            "I try but the reviews are removed!!! I have to post a photo of a receipt proving I went to the restaurant in order for my posts to stay up when I complain about the junk fees.",
            "Google and Yelp should add it to their review questions.  Does this establishment charge BS hidden fees?  Yes.",
            "Pay with a credit card and if they scam you with hidden fees, do a charge back. It's fraud if they do as such.",
            "This is a dumb approach. Lying in reviews isn't cool. If you actually went there and this happened, sure.",
            "I hate this, but it truly seems like the only option.",
            "Pay with a credit card and if they scam you with hidden fees, do a charge back. It's fraud if they do as such.",
            "Looks like you'll need about 875,000 signatures\n\nhttps://ballotpedia.org/Signature_requirements_for_ballot_measures_in_California",
            "LOL, it was explained to a group of us, several years ago, that ballot propositions are a dumb way to go.\n\nFirst, you hire an attorney to write the ballot proposition.\n\nSecond, you need millions of dollars to hire paid signature gatherers.\n\nThird, you have to run a campaign against extremely well-funded opposition that will lie through their teeth, like Scott Wiener does.\n\nFourth, if you win, those against the new law will try to have it overturned on a technicality.\n\nFor much less money you can hire a law firm to write a bill and then buy a couple of corrupt State Senators and Assembly Members to sponsor your bill. For under $100,000 per legislator you can get your bill passed.\n\nThe legislators that you purchase will get their colleagues to vote for their bill in exchange for votes on other bills. This is exactly what the Golden Gate Restaurant Association did with SB-1524.\n\nThere is still the danger that the governor will veto a sponsored bill that gets to his desk. For example, Equality Labs had Aisha Wahab put forward a bill that would have negatively affect the Dalit caste but that would have generated significant income for Equality Labs. Newsom vetoed the bill, after bowing to the concerns of the Dalit.",
            "Bro he’s consistently ass",
            "Same.",
            "lmao, this is a rare L for him for sure but I think most people vote for him based on his track record on transit and housing and if this was enough to make you not vote for him again I highly doubt you ever voted for him in the first place. I'm annoyed but I wouldn't trade him for any of the chuds who ran against him in a billion years.",
            "Wait really? I totally disagree with him on this bill but generally think he’s doing good work",
            "lol no. its the lesser of evils.  his opponent hasn't said anything about this either. i'm pretty sure she's also against business regulation. its her #2 policy.\n\nso who are you voting then? you're just not gonna vote so you can feel good about yourself?",
            "They're going to get their contributions from the California Restaurant Association, so they don't care anymore.",
            "Never thought I'd say this but NO MORE WEINERS!",
            "I was thinking of making one, also using GPS to see which county taxes apply, but I’m not yet a good enough programmer, and certain restaurants have their own fees, so I’d need a giant database that gets updated (like Yelp).",
            "the simple answer is it hurts their bottom line, and therefore means less money for food service workers.",
            "Those other priorities being how much money they are getting from lobbyists, right?",
            "Weiner",
            "Call Scott Weiners office.  When I called they ignored me because they said \"you should ask and talk to servers and bartenders, they love this exemption\"\n\nYour word means more than others.",
            "Sorry to hear that. I always assumed that people would start tipping less due to inflation, but this just makes it worse.",
            "The benefits should be legally enshrined, not the fees.",
            "Mods, please pin this.",
            "Unfortunately you can search for non-BayArea counties, but you can't add new entries that aren't in the Bay Area because they aren't in the drop down. No way to reach an administrator. Example: San Diego county is missing (and LA)",
            "Bought both parties.",
            "It's too bad the primary is over, that's true. But there are still more choices than pro-trans and anti-trans.\n\nanyway, I am neither. I just want to leave people alone. I'm not for them in any way, and I'm not against them in any way. And I'm very friendly with some on my street and at work.\n\nJust go on with yourself.\n\nI vote for MY concerns.\n\n  \nIf 8 thought they were actually threatened in California it would be my concern, but they aren't",
            "Well, they're appointed by Dem governor and State Legislature which is 80% Dem.\n\nI think I know who appoints them!",
            "There are no republicans in CA.",
            "One Republican isn't going to be able to do jack shit, especially if she's as right-wing as you say, and besides the governor still has a veto.\n\nAnd the Republican can be recalled later.\n\nWe can't continue to be held hostage to \"you have to vote for the douchbag to keep out the shit sandwich.\"",
            "Vote all them f-word-ers out of their seats. We need to shake all of them up to know we control what you do.",
            "Give larger groups a “large group menu” with prices 20% higher.",
            "I guess that’s what I don’t understand. What is opaque about service fees and the like? They are clearly displayed by law at the bottom of the check. Just like on your utility bill, your car payment, your phone bill, etc. Is it that we’re supposed to pander to the lowest common denominator, that being people who can’t handle arithmetic? Have the people advocating against service fees considered that businesses do it because raising prices versus service fees has an adverse impact on the number of customers and the net? Is this just a case of people needing something to be outraged about?",
            "I pay these fees every time I eat out and I’m not butt hurt about it because I’m intelligent enough to see the bigger picture of the restaurant industry and it’s survival in the post Covid era. I, personally, eat out whenever I want because I’ve used those same critical thinking skills to excel in my career. I get the feeling that the most vocal opponents of these fees are “broke bois” who have no experience in running a business or pricing goods and services.",
            "I hear Seattleites are hating it too",
            "It was probably a mistake. [The form](https://noteforms.com/forms/see-fees-in-california-njhpnl) to add a restaurant requires you to enter the fee in decimal form. Someone probably entered 0.5 instead of 0.05.",
            "Typo. There are two entries for Gialina in there, one with 5% and other with 50%. The 50% one will likely get removed shortly.",
            "I'd like a column about whether they removed the fee upon request.",
            "I am also okay with large party tips, that has been done for a long time. Agreed that the tool is not perfect, but a good starting point.",
            "It says large party auto gratuity and taxes are excluded.",
            "Oh, I'm not saying not to boycott the restaurants, I'm saying that our government shouldn't fail us. By all means, let's boycott.",
            "# The GGRA president who lobbied this owns terzo.",
            "A board member owns China Live.",
            "I just checked, it's a typo",
            "It's a typo. There are two entries for Gialina in there, one with 5% and other with 50%. The 50% one will likely get removed shortly.",
            "You shouldn't lie in your reviews, but its not hard to go to a place, sit down, order, and be surprised at the end with bullshit charges. It happens over and over and over again.\n\nThe only places that are honest in their billing anymore seem to be fast food places and chain restaurants like Chili's.",
            "Wow, downvoting honesty.   Way to go Reddit.\n\nYou know, the thing that is not cool about hidden fees is they are dishonest. Being dishonest to combat dishonesty is….",
            "There is no point wasting your time with the pitchfork mob.",
            "> Second, you need millions of dollars to hire paid signature gatherers.\n\nI’ve started telling signature gatherers “I have a $5 signature fee”\n\nThey’re caught like a deer in the headlights, because they get compensated for every signature they gather.\n\nI’d like to start this trend going — it might change the signature ballot process entirely.",
            "Maybe, We should make a prop to change our state motto to \"Profits over people.\" to more accurately represent our state.",
            "Do you mean Brahmins and not Dalits?",
            "He's done a lot to allow for upzoning and increased home ocnstruciton statewide, which I've been a big fan of. \n\nAlso, although controversial, I was cool with the speed governor proposal for cars. There's no reason cars should ever be able to go faster than 100 MPH outside of a racetrack, so why allow it. We already allow limits like this to e-bikes, cars are far far deadlier than bikes.",
            "He's doing his best to drive AI out of California, with a bill that simultaneously overreaches and under protects.",
            "If your representative does good work but doesn't represent the people who elected him...\n\n...he's not your representative, he's your ruler.\n\nI don't care how good his work is, I want him *working for us* not the lobbyists and rich campaign contributors.",
            "Did you think SB961 was a good idea?",
            "God I'm so tired of \"lesser of evils\". Can we just get a candidate that isn't evil?",
            "I don't care. Incumbents need to suffer consequences. Their will be another super liberal to take his place andi will cure them the fuck out too for this shit",
            "Well wasn’t the entire idea of this for them to get real prices not advertise a cheap meal and add fees to make up for it. I think they realized that people will stop eating out cause who would pay 30$ for a soup. Than this leads to the conclusion that something else is seriously wrong if people cant afford the actual prices. This makes me extremely infuriated",
            "*less money for business profits\n\nI don't tip if there is a fee, the workers already get hit.",
            "I'm a server. I called his office. They were actually very nice. I voiced my opinion and said I wouldn't vote for him, and that I will do my best to organize servers and bartenders to do the same come voting time.",
            "They seriously told you that? Unreal",
            "SO many people point out additional fees on receipts and let me know that’s why they’re tipping me less",
            "I don’t think you do, since the governor has absolutely no role in appointing the committee members and the Republican members (3/10 in the committee, who all voted for the bill) are appointed by the Republican leadership in the legislature.\n\nhttps://apcp.assembly.ca.gov/members",
            "So...vote for the anti-trans republican and recall her. Genius plan. Sounds like the same story with people refusing to vote Biden over their disapproval of his handling of Palestine. You know this passed with zero objections in the Consumer Protection Committee, right? Like, his opponent is almost surely lobbied by the same restaurant group. The entire statewide political establish is in favor of this carve-out, apparently. That's why I think everyone suddenly deciding to become a single-issue voter over this is looking like a real fucking moron.\n\nAnyway, moot point - the only people paying attention are in this sub, and Wiener will easily win re-election. So if you want to vote for a far-right Republican, who am I to stop you. Knock yourself out.",
            "No shit it has an adverse impact on number of customers, that's just too fucking bad.",
            "As a Seattleite, yup. As a human (notably not a corporate), the longer we tolerate this the worse it becomes.",
            "Who also has yelp deleting any post mentioning hidden fees",
            "I kind of figured this would happen but whatever",
            "I'd support a prop against props.\n\nOtherwise, I don't sign anything.",
            ">\tThere’s no reason cars should ever be able to go faster than 100 MPH\n\nNice reductio ad adsurdum. The proposed law would limit more than 10 MPH over *any* speed limit.",
            "I disagree with policies that treat grown adults like children by limiting everyone to prevent some from misbehaving.",
            "Do you also need to ask your mom for permission before you go out to play with your friends? Jesus you people and trying to regulate everyone's life...",
            "I mean, are you ever going to have a representative that fully represents your stances? I dislike this sell out move of his and think it’s ridiculous. But overall I’m in favor of a pro-housing/urbanism rep who moves things in the right direction the majors of the time. Junk fees are annoying and dishonest but functionally affect daily life very little, assuming most restaurants will simply up their prices by 5% while removing a 5% surcharge.",
            "I’m personally pretty ambivalent about it because I get why people would be against it but yeah, measures aimed at reducing avoidable driver-caused deaths is generally a good thing",
            "then run for office or join a campaign for someone who isn't bad. if all you do is vote, then thats what we are left with as choices. you get what you put in.\n\nthis is democracy. what are you expecting? a utopia? we are a diverse country with different beliefs. there is no candidate who will do everything you want. you pick the ones that do the most.\n\nsurcharge fees are bad to you and I but there are people who want it. democracy means you sometimes get what you want but you give up something else.",
            "the primary is over. wtf are you talking about. what liberal? the general is in a few months. you have two choices. do you even pay attention to politics? or do you just complain so you can feel smug? \n\n im all for pushing everyone to vote but damn - no wonder we have shit politicians. we have irresponsible voters.",
            "…so you just screw the server over who’s working minimum wage because there is a fee for the business/restaurant? \n\nWhy not goto a restaurant without fees?? Or eat at home. The server will get 0% of those fees regardless and also have to serve you without getting a tip.",
            "Yes, they are CONVINCED without these fees restaurants will engage in more wage theft and hurt their workers more.  Such clown shit.\n\nSeriously call.  It takes like 5 minutes.\n\nEdit:  (415) 557-1300 is the office number",
            "This hurts to read. If only our elected officials cared..",
            "But, but, but, Scott Wiener says he's doing it to help you! /s",
            "So, 70% of committee Dem appointed?",
            "It’s in everyone’s interest for restaurants to stay busy…the consumer wants choice and quality service, the employee wants a well paying job and the business owner wants profit. Nobody in their right mind should be rooting for the demise of the restaurant industry except those who want to bring blight to their city.",
            "Like running a red light or speed limits or not driving while intoxicated? You'd have to be a special case to not realize how essential these policies are.",
            "By this reasoning we also wouldn’t have speed limits on freeways",
            "People are animals, act accordingly.",
            "I see your point, but the thing is, the restaurant surcharges are\n\n* very close to fraudulent; the whole point is to make customers think the price they'll pay is lower than it will actually be\n\n* claimed to be for waiters and employees, but nothing is stopping restaurant owners from raising wages instead of adding surcharges that end up lowering tips\n\n* universally hated by almost everyone\n\n*  *except* some restaurant owners\n\nSo what Wiener is doing is allowing a small group of wealthy campaign contributors *to buy* the right to cheat and screw over *all the rest of us.* \n\nThat's why this is so horrible: because it makes life worse for the many, to benefit the few, because the few can pay Wiener off.\n\n>I mean, are you ever going to have a representative that fully represents your stances? \n\nNo, we'll never have that. \n\nI wasn't fully with Wiener on everything, but I expected I'd probably vote for him when he ran for Pelosi's seat. But this is a deal breaker.\n\nBecause in this case, the person we trusted and elected is actively selling us out for his own benefit. That's why it's so egregious, and for me,  it demonstrates a flaw in Wiener that  disqualifies him for offce.",
            "I see this in the presidential election conversation as well: “until the dems can put up a candidate who aligns with this specific issue, I’ll not vote/vote 3rd party”. \n\nYou can vote for whatever you like, but at that point, it’s usually a 2-person race. Policy platforms are years in the making, and just aren’t going to be affected by the protest vote in the final election. Those votes, while not wasted, will generally get you the candidate you agree with even less. \n\nI find that often my vote is best used to vote for the person with the best chance at beating the person I definitely don’t want holding the office.",
            "That's the neat part, they don't let you know about the fees until you sit down.",
            "how about list the number?",
            "Yes, but the Republican members voted for it as well (and Republicans aren’t known for being pro-consumer protection). It’s a problem of both parties.",
            "The Germans are able to handle it.",
            "Make the driving test more strict and this won't be an issue, it's how they do it in Germany.\n\nI'm not a fan of letting the irresponsible ruin things for the responsible. Make texting and driving a much stricter penalty. Quit putting every vehicle control into an iPad in the dashboard.\n\nMake it so you need to take a new driver's test every few years.\n\nImplement traffic calming measures into road and infrastructure design.\n\nJust because some people need nannies doesn't mean everyone should be mandated to have one.",
            "Sorta. A speed limit is a rule you’re expected to follow. A speed governor is a device that doesn’t even give you an option, you will not exceed whatever speed it’s set at.",
            "For me this is just so blatant. It's basically a big ol' neon sign that says Weiner for sale. Usually when I see signs like that I'm on board but not this time.",
            "> I wasn't fully with Wiener on everything, but I expected I'd probably vote for him when he ran for Pelosi's seat. But this is a deal breaker.\n\nHear hear. I'm livid.",
            "You can determine if there will be a fee by asking upfront, calling, or there’s literally a list in the comment thread. \n\nThe waiters or waitresses aren’t deciding if these fees should exist but you’re the ones you’re fucking over I don’t get your thought process?",
            " (415) 557-1300 is the senators office number",
            "Just have to take the L for the Dems on this one. Realize they are also corrupt and pro owner class.",
            "The Germans still have speed limits on some stretches of the autobahn, it's not a free-for-all the entire time. Furthermore, they have roads that are better designed and built to handle triple digit speeds, unlike the US. About 60% of Germans also support adding speed limits on the autobahn, according to recent polling, and many even feel that drivers shouldn't be able to buy cars with high horsepower engines. So, no, it doesn't appear that Germans feel they can \"handle it\", if more are supporting speed limits now. \n\n\nhttps://www.npr.org/2023/03/21/1165093933/germany-might-ask-drivers-to-pump-the-brakes-on-the-autobahn#:~:text=SCHMITZ%3A%20According%20to%20road%20accident,rate%20in%20the%20United%20States.",
            "So like free policing?",
            "It's really weird that most jobs have employers pay their workers and I pay a fixed price for a service. I dunno why restaurants don't have that technology.",
            "They literally did decide to allow the bullshit fee\n\n\nThe food service unions supported this amendment.",
            "It passed in the senate. Only hope now is to stop it in the assembly.",
            "A Republican majority one hundred percent would side with the restaurant owners over this.",
            "I agree, I just don’t think republicans are better and on most other consumer protection issues usually worse.",
            "Me neither it’s insane! Regardless cheap ass people like you make it worse for all the other hardworking lower class people. Have some damn empathy and research if a restaurant is gonna charge you a fee and don’t take it out on someone literally busting their ass for YOU to pay for food and rent but you’re mad about their company’s fee so you don’t tip them? That’s wack behavior. I get it, fuck the restaurant, but why fuck over the person serving you with a smile simply because of a fee? Are you that poor?",
            "Hi, it's me, I'm the problem, it's me, underpaying other people's employees. Shame I don't share those profits for the $30 ham sandwich I bought."
        ]
    },
    "Cool to see the city still has a skate world renown scene ": {
        "title": "Cool to see the city still has a skate world renown scene ",
        "score": 364,
        "url": "https://v.redd.it/51tphk3yst7d1",
        "content": "",
        "num_comments": 34,
        "comments": [
            "How much points is that on Tony hawk?",
            "San Francisco was in every professional skateboarding magazine/video in the 90’s/early 2000’s. It is known for being one of, if not the best city in the world for skateboarding. It’s incredible how many major skateboard companies started in SF.",
            "I saw this yesterday and thought it looked like SF based on the trees and gray sky. So cool to see my baseless vibe check validated haha",
            "I would have eaten 94 shits trying to do that.",
            "Someone should loop this so it never ends.",
            "Dope!!",
            "If you like this please warch This Old Ledge on YouTube. Will scratch your itch for skating, sf history, and sf architecture.",
            "That! Was beautiful!!",
            "Watch GX1000",
            "Seen yall before on top of the hill Santiago near KFC",
            "Damn I lived around the corner from McCoppin when I went to State",
            "Nice",
            "Respect! Right on dudes!",
            "Fuck ya!! 🤙🏽",
            "isnt this the park in potrero across from petco and safeway?",
            "Any city with hills should.",
            "Haha hell yeah! Is that Ingleside?",
            "What is this 1999? 😆",
            "[deleted]",
            "Can you skateboarders stop tagging up the city? Stop messing with people’s property.",
            "All of them",
            "Yes, this is McCoppin square! On Taraval St",
            "Eat Taco Bell?",
            "You can also watch it if you don’t want to warch it. 😂",
            "It's McCoppin Square in Parkside.",
            "oh yeah i see it now...",
            "22nd between Santiago and Taraval",
            "[deleted]",
            "Oh. The team that beat a security guard with their skateboards to within an inch of his life leaving him with permanent brain damage and a caved in skull? Those fine citizens?",
            "You joke but there's a Taco Bell to the left at the end.",
            "That's right! I recognize that Taco Bell/KFC that he eventually lands on.",
            "Good eye! That’s definitely the Taco Bell on Taraval. Thanks",
            "McCoppin square!",
            "Parkside above the library"
        ]
    },
    "Faux Victorian House": {
        "title": "Faux Victorian House",
        "score": 250,
        "url": "https://v.redd.it/dk59lknea08d1",
        "content": "While walking my dog around market street today I noticed this lovely purple “house” that was cleverly disguising a modern apartment complex. It looks really nice and keeps the charm of the neighborhood ",
        "num_comments": 35,
        "comments": [
            "I don’t think this is just a facade. Rather it is a historic building to which an addition was added.",
            "Not a modern apartment complex but rather the SF LGBT center.",
            "I understand that in this case this is a historically preserved façade, but has anyone else ever wondered why developers don't make more buildings that look like this? I hate the look of new construction but I'd move into a faux Victorian...",
            "Thanks to SF preservationists, the facade was kept when they built the LGBTQIA+ building. 🥰\n\nEdit: I just realized (hybrid 🍃 will do that to ya), the vibrant pinkish-purple behind it, it connects to the modern portion of the LGBTQIA+ building. A friend of mine knew someone who worked there and gave us a tour. The Center's offices are located in the true Victoian home.",
            "Many original SF victorians are an elaborate facade on front of a plain box anyway, so it's fitting.",
            "I dont hate it, at least they made the effort.",
            "I wish they’d do this to every building in my neighborhood they ruined with stucco.",
            "Still cool",
            "I… I don’t care. I still like it! And I bet that a lot of other people like it too.\n\nIn fact, I am convinced that you could build an 800 ft skyscraper with near-zero opposition in uber-NIMBY North Beach or the Sunset if you just made the facade “Victorian” like that!",
            "cool where on Market is this?",
            "I upvoted because the comments were really interesting. Didn't know this was a preserved facade.",
            "It's crazy to think that place was the LAST Victorian on Market St. Most of Market St was lined with Victorians before the earthquake in 1906.",
            "Hah, I wonder if the gingerbread facade was mandated to be kept by the city when the newer building was constructed, and this was their workaround.",
            "Great! The Victorian era was the worst!!",
            "No, there was a remodel and extension of an existing building without destroying the existing facade.  See: Sullivan’s Mortuary.",
            "Wow. I’ve seen this building I don’t know how many times coming on and off the ramp and never knew this.",
            "My understanding is this is illegal to do today, and considered \"facadism\". They did something similar to the Ferry Building.",
            "Exactly",
            "It's in drag.",
            "I own a Victorian that was completely rebuilt from the studs in the early 2000s. I think part of the reason is the number of specialized contractors needed to create a Victorian looking building. Mine needed something like 50 different contractors. Not to mention everything is harder to source.",
            "The unelected Planning Commission generally prohibits it.",
            "Because it’s not popular. Young people maximize their interest in natural light. Older generations want to live in the dark with less natural light and to keep the blinds closed as much as possible.",
            "It isn’t a facade.  The Victorian building is still there.",
            "> In fact, I am convinced that you could build an 800 ft skyscraper with near-zero opposition in uber-NIMBY North Beach or the Sunset if you just made the facade “Victorian” like that!\n\nI think you misunderstand the problem here. NIMBYs are using the appearance of buildings as the excuse to justify the housing restriction. It's the same as shadows, or the wind, or neighborhood character, or a million other things. They want to keep their property values high, worry about parking, and don't want less wealthy people moving in. That's all.",
            "near Market and Octavia",
            "This is the streetview of it\n\n21 Waller St\nhttps://maps.app.goo.gl/WTQNKjqkeww84joo6?g_st=ac",
            "1800 Market at Octavia",
            "No, not mandated.  The people building the LGBTQI center wanted to tear down the Victorian and build all new on the site. \nIt was a cause celebre and after much fighting, the Fallon Building was saved and incorporated into the plans for the community center.  \n\nThe Fallon Building has its own Wikipedia entry if you want deets.",
            "OP clocked that mug.",
            "Back when they were built, we had factories pumping out ornamentation on a massive scale. Now that we don’t, there’s a lot of bespoke craftsmanship and reliance on architectural salvage that goes into restoration and making sure the pieces are period accurate, etc.\n\nI think building one from scratch to be “Victorian-ish” would be a lot easier than that as you could produce new ornamentation without having to worry about it matching the rest or being period accurate for historic preservation reasons.",
            ">They want to keep their property values high\n\nI know a lot 9f homeowners here, and the vast majority of the NIMBYs are NIMBYs **primarily because they don't want change.**\n\nI'm not saying property values aren't an issue, but when you talk to people, they have very strong opinions about every little thing. Every addition, every gravel lot that gets an approval, etc.  And they are always complaining about changes. Too tall. Too ugly. Loss of parking. No one should be allowed to fill in that empty space. Etc.",
            "The building is a designated historic landmark (and was when the LGBT center bought it). There’s no way the city would have allowed a demolition.",
            "Lol stoooop",
            "> there’s a lot of bespoke craftsmanship and reliance on architectural salvage that goes into restoration and making sure the pieces are period accurate, etc.\n\nWhich is pointless.  There's no need to hang on to the past.  There's nothing magical about the Victorian era.  Things change, that's the way it works.",
            "contractors often demolish what they want and pay the fine. few years back a famous architect’s house was demolished by the new owner. folks were outraged and fines were minimal. i think the city ordered the owner to build the exact house with the same exact materials, not sure what came of it. architect was Neutra"
        ]
    },
    "Reminder that representative Scott Wiener, co-author of SB1524, is on Reddit.": {
        "title": "Reminder that representative Scott Wiener, co-author of SB1524, is on Reddit.",
        "score": 309,
        "url": "https://www.reddit.com/r/sanfrancisco/comments/1dlfm4t/reminder_that_representative_scott_wiener/",
        "content": "You can tag your representative u/scott_wiener in posts or comments expressing your opposition to this bill, or when posting receipts with Wiener fees ",
        "num_comments": 45,
        "comments": [
            "FYI this bill passed the Consumer Protection Committee with zero fucking objections.\n\nGet mad at the entire political class representing California.",
            "I think Scott Wiener overestimates the amount of financial support he can get from a bunch of loser restaurateurs (who can’t figure out how to be profitable without deceptive pricing) while simultaneously underestimating just how pissed off this makes people, across the political spectrum. \n\nLike, if you’re wealthy the actual total on your bill isn’t going to sway you from going out, so hidden fees have no upside: they are only ever going to make you feel disrespected and lied to. If you’re not well off hidden fees could be the difference between whether you can afford to go out at all, and not being upfront about how much a meal costs is just fraud. It’s so completely stupid and such an easy political win to ban them. It makes no sense to let restaurants do this. ",
            "He’s a state senator not assembly member. But yes, use this to express opposition to this stupidity. Restaurants have some of the most annoying hidden fees. ",
            "Hey Scott. I refuse to vote for you if this passes.",
            "Wiener Fees 😂",
            "[SeeFees.Ca](http://SeeFees.Ca)",
            "Posting his response on Reddit about this: \n\nhttps://www.reddit.com/r/sanfrancisco/comments/1d9nnc2/senator_scott_wieners_bill_will_allow_restaurants/l7fu855/",
            "Geez, what's worst is that the timing on this is just *perfect* to be when he's essentially immune from voter backlash.\n\nWe've just had the primaries and now, in order to vote for anyone else, I'd have to vote for someone who says that enacting transphobic legislation would be one of her top priorities. There's basically no chance that our district votes for this person.\n\nIt appears that Scott Weiner has no problem selling us all out when we don't have a way to hold him accountable.\n\nLet's make sure everyone remembers this when his term ends and he runs for his next office.",
            "Wiener's a representative of the Restaurant Association, not of us.",
            "Good idea. might be just as useless as sending his office an email or phone number.",
            "Scott Wiener (Democratic Party) is a member of the California State Senate, representing District 11. He assumed office in 2016. His current term ends on December 2, 2024.\n\nWiener (Democratic Party) is running for re-election to the California State Senate to represent District 11. He is on the ballot in the general election on November 5, 2024. He advanced from the primary on March 5, 2024.",
            "I am a huge supporter of Scott and credit him with the majority of productive legislation coming out of the state assembly (yay ADUs). I’ll continue to support him. But…\n\nThis feels like it misses the mark - just make restaurants charge the actual cost of food upfront. Or eliminate tipping.  \n\nEveryone loses (except owners) with surcharges. \n1. Consumer get surprise fees\n2. Waiters get stiffed on tips (are you supposed to lower your tip with surcharges?)\n3. Restaurant owners get a slush fund to use as they see fit (no legal obligation I know of to pass these on to staff)\n\nThese surcharges sure feel like a way for ownership to get their hands on tips to offset their costs which normally go directly to waitstaff. \n\nNot perfectly related, but: \nDoorDash used to do this when they’d offer drivers “guaranteed tips” and if you tipped your dasher it counted against the guarantee. Just another way to manipulate customers into offsetting business expenses.",
            "Time to get Scott Wiener out of office. Tired of his shit. Slimeball.\n\nWhen he shows up to things we need collective booing\n\nMaybe some posters to put on telephone poles outside restaurants that show hes the reason to blame for the hidden fees",
            "Sf all wants Weiners vote 😆",
            "Drop Scott a note\n\nhttps://sd11.senate.ca.gov/contact",
            "Didn’t it already pass? What is the point of contacting him now?",
            "Hasn't been active for 4 years!!!",
            "A friend and I are waiting on City Attorney review to circulate a petition to fill the loophole SB 1524 creates in SF if our lawmakers continue to fight this: https://sfclearprices.org\n\nGet in touch or join our mailing list if you want to help! Our lawmakers need to know that their position is unpopular: 81% of Chronicle readers support outlawing these surcharges",
            "Any reporting on support/opposition to this in the full legislature or from the governor?",
            "It's a stupid bill, but I really wished people were this hyped on other issues too.",
            "seriously, its an entire group of people. [Bill Votes - SB-1524 Consumers Legal Remedies Act: advertisements: restaurant, bar, and other food services. (ca.gov)](https://leginfo.legislature.ca.gov/faces/billVotesClient.xhtml?bill_id=202320240SB1524)",
            "As a consumer, I do not feel protected",
            "Can we vote all of the people involved out?",
            "Can we vote the people responsible out of office?",
            "Welcome to the club to hate Democrats in CA, the political class.",
            "As a server this pisses me off. I called his office and voiced my displeasure. Hopefully more people do this. Also, call the governor office as well.",
            "You’re pissed off but would you ever vote the other party? That’s what these guys count on.",
            "It's not the restaurants. It's [UNITE HERE](https://apcp.assembly.ca.gov/system/files/2024-06/sb-1524-dodd-apcp-analysis.pdf), the main union for hospitality workers. \n\n>UNITE HERE writes: \n\n>An unintended consequence of last year’s SB 478 is that legitimate service fees charged by restaurants will no longer be allowed after July 1 of this year. Many of those service fees go to workers either through service charges that are distributed to both front and back of the house staff in restaurants. Other service charges go to supplement health and pension benefits of food service workers at restaurants, bars, banquet operators, airports, stadiums, and many other places where consumers are fed. Much of this has been negotiated through collective bargaining between our union and employers. Without SB 1524, all of this would be upended, and these workers would see unnecessary pay and benefit cuts.",
            "Oh, is representative only used for assembly members? Unfortunately I can’t edit the title now",
            "I couldn’t downvote that bullshit response fast enough",
            "Jeez, he's such a well spoken smart guy when I hear interviews too",
            "Preach! Been there, done that.",
            "Im sorry you got sold out by someone you like",
            "Most cities have ordinances like [this one](https://library.municode.com/ca/oakland/codes/code_of_ordinances?nodeId=TIT5BUTAPERE_CH5.92CIMIWASILEOTEMST_5.92.040HOSECH) requiring restaurants to pass service charges to the employees. \n\nLikewise, unions (particularly UNITE HERE) have written into the collective bargaining agreements that the restaurant will charge a service fee and use it to pay for benefits. Because of this, they [lobbied ](https://apcp.assembly.ca.gov/system/files/2024-06/sb-1524-dodd-apcp-analysis.pdf)pretty heavily in favor of SB 1524\n\n>UNITE HERE writes: \n\n>An unintended consequence of last year’s SB 478 is that legitimate service fees charged by restaurants will no longer be allowed after July 1 of this year. Many of those service fees go to workers either through service charges that are distributed to both front and back of the house staff in restaurants. Other service charges go to supplement health and pension benefits of food service workers at restaurants, bars, banquet operators, airports, stadiums, and many other places where consumers are fed. Much of this has been negotiated through collective bargaining between our union and employers. Without SB 1524, all of this would be upended, and these workers would see unnecessary pay and benefit cuts.",
            "> Sen. Bill Dodd introduced an urgency measure, Senate Bill 1524 (SB 1524), which provides that any mandatory gratuity, service charge, or other fee restaurants charge must be displayed conspicuously on restaurant menus. \n\nOkay seriously I do not understand.  Restaurants have existed for thousands of years, and somehow, in 2024, in California, we need a LAW requiring that MENUS contain the details of secret charges that will be added to our bill AFTER WE EAT?\n\nWHY? Have the menu price BE THE PRICE.\n\nSo seriously, every restaurant now is going to involve a quick dip in to look at the menu's \"secret fees fine print\" before being seated?  Or better yet, maybe it's better to just go in, be seated, relax a while, get waters, and then leave if the *secret fees menu* is too absurd?  If a restaurant is going to waste my time hiding their secret fees in the menu, then I have NO PROBLEM wasting their time.  Sorry waitstaff that you're caught in the middle of this BS.",
            "As a consumer, I feel like businesses are consuming me.",
            "Bill authors: \n\nBill Dodd, District 3, term ends 2024\n\nScott Wiener, District 11, term ends 2024. I've read that he'll campaign for Nancy Pelosi's seat, I'll vote for whoever run against him. \n\nCecilia Aguiar-Curry, District 4, term ends 2024\n\nJesse Gabriel, District 46, term ends 2024\n\nMatt Haney, District 17, term ends 2024\n\nLooks like all the bill authors can be voted out this year. I hope whoever campaign against them brings this up.",
            "This is San Francisco. There are way more than two parties",
            "Nah representative is used for both. Official titles are assembly members vs senators, but they're both State representatives. It's just more formal. Like a US Senator or a US Representative are still a congressman/congresswoman.",
            "Huh? You know it’s okay to support people but not agree with everything they say and do? \n\nScott has had a huge positive impact on the city and state.",
            "Not quite true. A U.S. senator is not referred to as a congressman or congresswoman.",
            "Lol... No he hasn't",
            "Oh damn, really? Thanks for the correction! I assumed because congress is the body that includes house and Senate it would apply."
        ]
    }
}