{
    "Pure visual delight.": {
        "title": "Pure visual delight.",
        "score": 702,
        "url": "https://v.redd.it/w61ews5al28d1",
        "content": "",
        "num_comments": 8,
        "comments": [
            "The mosquitoes are gonna go wild on her when she gets out 🔥🔥💀",
            "Nature is amazing!",
            "And auditory, sound on, it’s nice.",
            "Looks like Sweden",
            "Bring me there",
            "The dynamics between state and central governments are fascinating.",
            "Lol! That was my exact same thought!!"
        ]
    },
    "There is something about freezing a bubble at 9°F": {
        "title": "There is something about freezing a bubble at 9°F",
        "score": 2771,
        "url": "https://v.redd.it/zxygvsghm08d1",
        "content": "",
        "num_comments": 59,
        "comments": [
            "It said 12.8C where it should have being -12.8C.  as nothing freezes at +12C\n\nEdit, some chemical do freeze above zero.",
            "Wonder how brittle this is once frozen. Would love to touch one. Would also love popping it before it fully freezes to get some really thin ice petals",
            "Video needs to be about 3-5 seconds longer for the bottom to finish freezing",
            "Its not 12C its -12C 🙄",
            "Shrek theme ftw",
            "This would be a great video for demonstrating crystal formulation in materials. It’s a very similar process with metals, but much more difficult to see.",
            "They don’t break it!? 🥲",
            "I was waiting for them to shatter it.aww",
            "Fuck this presentation format",
            "*minus* 12 degrees Celsius",
            "That is not a spring weather 12 degrees celcius.",
            "You know you all heard it in your heads, so sing it out...\n\n🎶Let it go... Let it go...🎶🎶🎶",
            "There is something magical about Americans ignorance of the metric system",
            "There's something about these floating flakes that terrifies me. But I really don't know why",
            "Ok but then it doesn’t completely finish NOR DID IT POP so gtfoh",
            "Well I’ll be",
            "NOW BREAK IT!!!",
            "Oh man I wish I still lived in Alaska. I'd put one of these on every fence post in front of my house.",
            "The patterns remind me of Tree Stars 😍",
            "Man I miss winter !!!",
            "Downloaded ✅..\n\nAbsolutely beautiful",
            "Someone doesn't know what Celsius is.",
            "Music?",
            "I wonder how cold jizz must be to freeze. Can a scientist find out the melting point of jizz?",
            "Nice chill thoughts as it's been 95 °F this week in NJ.",
            "That was something to watch",
            "Now do the same but use liquid nitrogen",
            "There's obviously supposed to be a negative before the 12.8°",
            "With that music playing all I can think about is blowing up birds",
            "Karma bot",
            "Should I.. Shouuuld Iiiiiii… *clicks unmute*   ..ah for fucks sake",
            "u/FuqUrBackgroundMusic",
            "[removed]",
            "So… everything is liquid at +12C?\n\nMay I introduce you to crystalline solids which include most metals, minerals and quite a few rocks. Non-crystalline rocks like obsidian are formed of volcanic glass which are also solid at +12C.",
            ">nothing freezes at +12C\n\nUmm, many elements and chemicals do. For example, acetic acid freezes at 16C.",
            "Steel freeze at 12C, I swear",
            "I love all these dumb \"uhm actually\" people in the comments. You all know what the commenter means. He's talking about water based things. Get a life.",
            "It does, if the pressure is high enough",
            "12C is a nice warm summers day here in the UK",
            "\"Nothing freezes at +12C\" bro come on..",
            "Yeah... nothing, except....",
            "i think it would be cool to layer water on the bubble slowly and make a hallow ice ball! I wonder how much weight it could hold before it collapses in on itself.",
            "I was so mad they didn't poke it. 😤",
            "I’m curious as to if the reason why the vid was cut short is because it actually broke at the bottom because of what it is sitting on before fully formed",
            "Oh I thought you wanted to hear the rest of the fairytale soundtrack too lol my bad",
            "Thanks for answering that.\n\nWonderful music.",
            "Frozen theme would have made more sense",
            "lol I did wonder",
            "At first I thought Zelda, then I thought Lord of the Rings. But then it was just Asian sounding.",
            "I was in not my usual country when frozen came out. The song was all over the radio but I struggle with song lyrics that arent english so I just thought it was another pop song. Meanwhile on social media everyone was talking about the annoying let it go song which I thought I'd never heard.\n\nDid not put the two together for about 8 months.",
            "Fairytale from the first Shrek",
            "Bot?",
            "Okay, nerd. :D",
            "🤣 Right? There’s “frozen” stuff all around us. Like… all igneous rocks. ",
            "This is how you know 9/11 was an inside job. The low melting point of steel",
            "That would be cool yeah. I don’t think it would collapse in on itself though it would just keep getting thicker and stronger walls until you basically have a solid sphere with a small empty section where the bubble was. At least until it gets very big. Providing it wasn’t on a pool like this",
            "The watter would probably melt the ice.",
            "Most likely the video was stolen, and badly edited for some dumb social media channel.",
            "Definitely"
        ]
    },
    "Perfectly aligned beauty.": {
        "title": "Perfectly aligned beauty.",
        "score": 708,
        "url": "https://v.redd.it/2alncr63t28d1",
        "content": "",
        "num_comments": 6,
        "comments": [
            "A satisfying threesome!😅",
            "I'm assuming it's a similar to the suspension table but with wildly different dimensions. But yeah, really cool",
            "My brain hurts. I understand it. Brain hurts anyway.",
            "If you \"follow\" the forces you can see its essentially turning the direction of force of gravity in the bottle in the opposite direction.\n\nSuper cool demonstration of mechanics",
            "Engineering is amazing! Also, every 8 minutes that milk is out of the fridge takes roughly a day off it’s shelf life",
            "It's fake even if the sticks supports the bottle which is unlikely due to them obviously slipping, then the center of gravity is put onto the second toothpick which tilts the bottle of the table"
        ]
    },
    "Naturally cubed Pyrite crystals ": {
        "title": "Naturally cubed Pyrite crystals ",
        "score": 11429,
        "url": "https://v.redd.it/x650s1bbcy7d1",
        "content": "",
        "num_comments": 250,
        "comments": [
            "How come they are so perfectly square?",
            "I'm enjoying the video eyes closed",
            "She’s literally moaning after every single pull. Was the Audio taken from a porn ?",
            "Before time began... there was the cube.",
            "Homegirl is WAY TOO excited about these minerals.",
            "DON'T WATCH THIS WITH SOUND ON IF YOU'RE NOT ALONE.\n\nYOU HAVE BEEN WARNED.",
            "Minecraft gold blocks",
            "Why the moaning “geolophilia”",
            "All I see are potential dice.",
            "Take that terrence „there are no straight lines in nature“ howard !",
            "THE ALLSPARK",
            "Fun fact....pyrite is actually a lot more valuable than people think. Now it's found to contain lithium in some deposits.",
            "\"There are no straight lines in nature\"\n\nNature:",
            "Someone show this to Terrence Howard",
            "Minecraft graphics have come a long way!!",
            "Crazy how nature do dat",
            "How the atoms know what a cube is",
            "That's sick",
            "How much is one square?",
            "How is that matrix so soft?",
            "Why everyone staring at me at the bus like I'm some weirdo? It's just a simple video of nature.",
            " Ah, pyrite crystals, nature's little cubes of fool's gold! They may look like treasure, but don't go spending them just yet.",
            "If the matrix remained hidden, would the crystal keep growing, or are they size limited? What are the biggest pyrite crystals?",
            "Ooooh, the cube is soon billig oooh",
            "That’s pretty cool I just learned something today. Thanks",
            "Ok ok leave some for the next person.",
            "This is the first video on this sub that has actually been satisfying in nearly a month.",
            "You fool, thats gold, not pyrite",
            "Forbidden turkish delight",
            "Goddamnit Marie, they’re minerals.",
            "I make the same sounds when it’s 3am and I’m eating some chocolate covered marshmallows",
            "And here we see a fresh crop of default cubes being harvested before they are washed, bleached, and sent to 3D designers the world over.",
            "[some illustrations on formations](https://youtube.com/shorts/-8K8TtNbthU?si=VaebPIdIviJNRkrm)",
            "Humans: “There are no straight lines in nature”\n\nNature: 🤦🏻‍♂️",
            "That's not pyrite that's gold you fools!",
            "Oh fuck put it back in",
            "Where can one pluck pyrite out of a cave wall like this? Anyone?",
            "I wonder what the first humans to find pyrite must have thought when they found it.",
            "I'm not saying it was the alien, but it *was* the alien.",
            "Don’t show Terrence Howard",
            "Close your eyes and only listen to the sound",
            "Uhhh ohhhh wow",
            "it’s fantastic",
            "But according to the ancient aliens lot nature doesn’t make perfect shapes.",
            "Making a d6 immediately",
            "How much are they worth?",
            "I’m not saying it’s aliens but",
            "That's hot",
            "Is this the audio from the same video I'm watching? Asking for a friend...",
            "oooOoooo🟨aaaAaaaHhhHhh 🟨ooOoohhhh🟨aaaaahhhhhHhhh🟨sssssSSssSOooooOoohh🟨🤭",
            "Anyone else caught up with the One Punch Man manga?",
            "Literally r/natureismetal",
            "Like picking sweet fruit",
            "How is that even possible",
            "Everlasting oxo cubes.",
            "Resistance is futile...😁",
            "[deleted]",
            "Every time they pull one off they sound like they’re cumming",
            "reminds me of a teeth dream I had",
            "r/potioncraft",
            "Fools gold?",
            "The box. You opened it; we came.",
            "And that's why it is totally believable that the Yonaguni Monument is natural.",
            "BISMOR",
            "Pyrite 24 carat yeah,",
            "I would love to pull these out too….",
            "Omfg gold !",
            "The Rappers Ice-T and Ice-cube supported this video 😉",
            "Calumite from starfield",
            "Why does the wall crumble like wet plaster?",
            "That is the all spark and megatron will be lookong for her shortly",
            "Jenga!",
            "Ancient Aliens has some more content!",
            "Forbidden jelly cubes",
            "neat",
            "The one at 31 seconds with the double cube is particularly neat.",
            "Nice cubes",
            "Pyrite pixels?",
            "put the sound at max volume and watch it near someone they will think it's porn because of the heavy breathing lol",
            "Isn’t the golden rule to leave nature the way you found it?",
            "I wonder if this is like softcore for ice cube",
            "I AM PLEASED TO ANNOUNCE THAT I'VE FOUND SOME BISMORE!",
            "In situ ooooo",
            "Plato would say the platonic forms are found in nature.",
            "Where do I find these?",
            "This also belongs to r/natureisfuckinglit",
            "Where was this?",
            "I would give my left nut for a specimen that developed and cubic. Only have a small cubic crystal, probably 1x1x1inch.",
            "Is it werid I want to bite it??",
            "specimen gore :/",
            "“Ohheheh… woooowwww…”",
            "Plato was right",
            "Great... Now I want a cube piece of pyrite for no reason",
            "Inorganic matter \"wanting\" to be a certain shape is weird.",
            "*Ohhhh… wooow…*",
            "I'm curious to see the Cenobites that the big one contains.",
            "Where did you find these? That’s incredible",
            "Those are all sparks!",
            "Graham Hancock - “ aliens “",
            "Thats so interesting that such a mathematical shape can be generated with perfect angles.",
            "Where are they? Are they allowed to just take stuff like that?",
            "BISMOR HERE!",
            "Weirdest unboxing video I've seen",
            "Is there any danger like from exposure? Not just physical danger like cuts or lacerations.",
            "Minecraft is real",
            "Thought there were no right angles in nature?",
            "Oh god yes. So satisfying lol",
            "imagine some dude discovering this shit in 1300 and coming back thinking he found literal magic rocks",
            "Calemite from Starfield",
            "They’re so perfectly square, that the misshapen ones are the more interesting ones.",
            "Aliens made it",
            "This makes me wanna have some halva",
            "Someone shows this to terrence howard",
            "If you close your eyes it sounds like a porno",
            "where is this ?",
            "Alien eggs",
            "I’m having a *hard time* deciding whether the video or audio is more satisfying.",
            "Real life Minecraft! Awesome!",
            "Yeah, no, that shit is from outer space and we just don’t know how to use it yet",
            "Steve Jobs woulda loved this!\n\nR.I.P Steve",
            "Those are worth a fortune aren’t they? There is a sample similar to these at the SF Academy of Sciences, they are magic",
            "Is that rock attached to it aspedos?",
            "Is this genuine, I've seen so many archeologists and scientists that state there are no straight lines in nature.",
            "Wow. Those finger nails have spent some time in the dirt and rock.",
            "Here's an idea: Leave 'em in there..  \n  \nMore of a sight to behold when they're growing out of the rocks instead of in your home, neatly in a row on your $20 Ikea shelf..",
            "How can perfect shapes form in nature. Crazy",
            "\"there are no 90 degree angles in nature\"",
            "D6\\*",
            "That looks like shes just destroying one of those stone walls where they add Metal cubes to look a bit fancier.",
            "Fake unless I’m provided the source with verification. \n\nPulling *perfect* cubes is rare.",
            "Your girl really knows how to get her rocks off",
            "This is cool af but they're going to pull every one out and now nobody else can enjoy them",
            "UNNNH! UNFFFFH OH WOW!  hHUUUUUUUUUUKKKMNNNN OWWWWW WOWWWWW! SNHUUUUUUUUUahHH OH WOWWWWWWHAHAOWWWWW",
            "Porn is limitless indeed. Fetish unlocked... Oooohhh yeeaaah that's guuooowwwwddd",
            "This feels like it belongs on r/popping",
            "i took this from an Eli5 post “The short, unhelpful answer that a textbook would probably give you is that the atoms that make up pyrite lock together in a cube-shaped lattice, so therefore their crystals form cubes.\n\nWhile that is correct, it's not very helpful because atoms are tiny, and this cube is big enough to hold in your hand, how could such a nanoscopic effect possibly scale up like this?\n\nLet's say you had a bunch of toy cubes, about the size of common six-sided dice. Each cube has a magnet embedded in each face that allows it to snap-connect to any other cube if it gets close enough to any of the others. But the magnets aren't very strong ones. Let's also say you already had a huge collection of these small cubes already formed into a bigger cube-like shape, maybe, the size of a car. And finally, let's say that there are now a countless amount of these toy cubes just floating around in the air, bumping into things in random directions. What's gonna happen?\n\nIt's inevitable that some small cubes are going to bump into your big cube and stick to it. And they're going to snap perfectly into the grid when they do so. But, you gotta remember, these magnets are weak. It's possible that as soon as a small cube snaps into the grid, another passing by cube will slam into it and break it back off again. New cubes can only snap onto your big cube with a single attachment point. There are no nooks and crannies they can slot into to anchor them down better. Getting a new cube to stick to the outside and last for any duration of time is rare.\n\nOne of the small cubes could get lucky, though. It bumps into the big cube and snaps into the grid. Now that it is there, it has created four places on either side of it where another cube can drift by and latch in on two sides, not just one. Before getting knocked off, it could cause another wayward cube to snap down next to it. That creates 3 new spots where new cubes would really like to park. With each new cube you add, you increase the \"surface area\" of where more cubes can come down and join, which further increases the likelihood that they do. If this can build up to a critical point where it can avoid being blasted off by random chance, suddenly you have a runaway chain reaction where many, many cubes start locking into the grid, because those L-shaped nooks are such attractive places for them to be.\n\nThe result of this is that, if a new layer on the face of the big cube can last long enough to get started, it very quickly fleshes out into a full layer. You usually don't ever get partial layers formed, it's either the whole layer, or no layer at all.\n\nThat's the key to why macro-sized crystals form as big geometric shapes with such flat faces and pointy corners. They're formed layer by layer. Almost never in partial layers, but almost always only in full, complete layers. And if you only build shapes in broad, flat layers, then no matter how small your original crystal was, even atomic sized, it will scale up to be a sharp geometric shape.”",
            "That’s what crystals do. They make geometric shapes. Because nature is awesome.",
            "It's atoms bond in a square. So the crystal form reflects this",
            "Same reason why wombat poo is also, cubed.",
            "So they can be used in minecraft",
            "How many orgasms… er I mean, cubes did she have?",
            "“This one’s comin out”",
            "I was watching this at full volume when my neighbor pulled up, didn’t even realize what it sounded like until I got some side glances.",
            "For real like is this rock hunting or porn hub? Literally after every one she was like \"Ohhhhhh yeah! Wooow\" like she was doing the deed.",
            "Geologists only want one thing and its disgusting.\n\nBut for real, i see this a lot on other professions. For example there was those marine biologists using a underwater drone to see deep sea life and were practically jizzing their pants at everything they saw lol.\n\nKinda annoying but theyre just so passionate",
            "Lol. You're just jelly that you aren't getting off from geo-earth cubes!\n\nHad to unmute to listen.  She seems happy.",
            "It’s like people who have a hyper fixation with popping pimples or watching them get popped. Some sort of feel good reaction.",
            "We know now where it comes from.",
            "Rockhounding is actually super fun, a lot of prep and research goes into it. Its an adventure in a life that honestly sometimes so fucking bland. \n\nI went on an vacation out west after having been in the midwest for basically my whole life. I remember being this excited for many of the things we found. God that elation when you find something you've been looking for, its big and I really love it and it makes me wish I was there with these two just so I could be happy for them in person.\n\nAlso I really want to find my own cubic pyrite. I have a cube, but I bought it. I'd rather crawl into that cave and pull it from the wall myself. I know if I found a stash like this I'd be so pumped.",
            "To be fair, most of us would be moaning too",
            "Jésus Marie, they're minera-- oh, wait.. nevermind, you're good.",
            "\"Homegirl\" OK boomer",
            "Upvoted to get it on top",
            "I’d be moaning if I was in that mine too",
            "Fresh from the D6 mines, just how I like it.",
            "They mimic the shape of the earth",
            "Top comment has the eli5, it's fantastic",
            "It varies, but you can find samples like these in mineral shops for like $30-50",
            "This ^",
            "Limestone",
            "Maybe it has something to do with you jerking off to it but I'm not sure.",
            "Not sure why downvoted this statement is true. The way you can tell fool’s gold from real gold is by hitting it with a hammer. Real gold won’t break.",
            "This comment brought to you by Reading Rainbow",
            "\"The largest pyrite cube ever found is over 19 centimeters in size and weighs 9.5 kilograms, and is located in the Victoria Mine near Navajun, Spain. \"\n\nSOURCE \nhttps://www.naturalhistorycuriosities.com/shop/minerals/really-unique-and-large-pyrite-cluster-from-navajun-spain/#:~:text=It%20is%20located%202.4%20km,cm%20and%20weighed%209.5%20kg.",
            "Stop it 😂",
            "That's what I wanna know",
            "Roughly around 10-50 ding dongs a cube I imagine",
            "Jesus Christ Marie, they're minerals!",
            "Penetration twin",
            "These are from https://www.mindat.org/gallery.php?loc=7116&pco=1",
            "Go for it",
            "Asbestos* and not, that's white clay",
            "Perhaps. What’s aspedos?",
            "Limestone",
            "That saying is not literal, \"nature doesn't make straight lines\" means that things don't need to be perfect to work/ be good",
            "Yeah, there are tons of straight lines in nature, especially in crystalline structures like this.  Nature has a lot fewer straight lines than humans tend to make, but that doesn't mean it doesn't have any.",
            "You are right, close your eyes and listen to it. Oh yeah...one more time...Science is made in bed",
            "Don't look, just listen",
            "It’s a mine",
            "I bet they love you on r/explainlikeimfive",
            "Yeah ok, but why are they square and not rectangular? Can't be pure chance, all of them look rectangular.\nSo there has to also be another force/factor making them like to have the center of gravity in the middle",
            "Wrong! This is clearly the work of the cube Gnomes! /s ;)",
            "Thank you",
            "What a trip, I've never had all the dots connected in that fashion and always wondered about it. I heard about the molecular lattice and wondered how that turned into the pair of weird dice I'm holding in my hand. Billions of complete layers 🤓",
            "That is an excellent explanation. And so those huge crystals are built the same way?",
            "So are crystal shapes a clue to atomic structure that early pioneers in chemistry and elemental science could’ve used to surmise what a molecule or atom is?",
            "So... ancient alien technology.",
            "My thought process, but with WAY more words. Thanks tho",
            "Now I’m sure there is more to it but now I imagine if I took one of these cubes and threw it on the ground it would shatter into hundreds of tiny cubes instead of random pieces.",
            "If you would hit it with a hammer, would it break square shaped?",
            "Hmm, I think the textbook’s answer will suffice.",
            "The simple answer is statistically speaking this is the natural form of things. Cube. \n\nYou will be assimilated",
            "we need an \"Explain like I'm 5 and also have ADD\" subreddit.",
            "Whoah.",
            "Can an ai video generator make a video of this lol? I need to see this visualized.",
            "Duuuude mega props for this answer.\nThank you",
            "What an excellent explanation, thank you",
            "Could we simplify it to: \"it is the shape that has the lowest potential energy/is most stable\"?\n\nI.e. the same reason a marble in a bowl will end up at the bottom.",
            "Interesting, so it's mathematically possible to have really really big cubes",
            "But how can a whole layer snap into place if it’s already rare enough for one of the atoms to find its spot? Like does a floating layer of atoms just lay itself on the bigger structure?",
            "TLDR: Pyrite forms cube-shaped crystals because its atoms arrange in a cubic pattern. Imagine small magnetic cubes randomly attaching to a larger cube. Once a small cube sticks, it helps more cubes attach, forming complete layers. This layer-by-layer growth creates large, sharp-edged crystals.",
            "For me, the problem isn't the answer of \"because pyrite likes cubes\". Like, physically--how does *that* concentration of iron and sulfur, show up in *that* amount, under conditions that would make them miscible, then for it all to cool and embed itself in a thick slurry of a completely different type of mineral? Like, how the fuck is that just something that happens?",
            "Oh yeah, These are going to fit back together...",
            "Reminds me of this time I had my speaker on out somewhere. I opened my phone without thinking and a Bill Burr clip about hitting women starts just blasting lol. Yeahhh...",
            "It's formhub",
            "wtf kind of porn are you guys watching I was disappointed when I unmuted because it was so unremarkable",
            "I mean, both look for something hard, enjoyable, can make you feel dirty and can cost you quite a bit if you're scammed for premium products :v",
            "I was just thinking about that too. A subset of people experience full-body cerebral enjoyment of things. Biology playing favorites as usual, thanks for nothing!",
            "I think this comment was done by AI",
            "It’s annoying af",
            "Not disagreeing with what you said or knocking how fun it would be for someone interested in the field but,\n\nGirl needs to reel it in lol",
            "Rockhounding🍆is🪨actually🐶super🦸‍♂️fun💦 ,a👀 lot👏of🙌prep💊and➕research🔬goes👉into👌it 🪨. It’s💧an☄️adventure🧗‍♀️in 🗃️ a 🪨life 🪦that 🫃honestly👼sometimes💇‍♀️so👯‍♂️fucking😩bland🇬🇧. \n\nI 👁️went🚣on🎫a🚞vacation🛫out🤠west📆after🌽having🌽been🌽in🌽the🌽midwest🌽for🌽basically🤣my😂whole🥲life🌽. I🫥remember💭being🧘‍♀️this👇excited😫for4️⃣many♋️of❤️‍🔥the🪨things🍆we👯‍♀️found🔎. God🧖🏼‍♂️that🔫elation💦when🦀you👩‍❤️‍💋‍👨find🪢something🕶️you've🙈been🌚looking🕵️for📙, its🥵big🍆and♋️I😫really💦love💘it♨️and💯it🃏makes♥️me☃️wish🧞‍♂️I😜was😙there☺️with👯‍♀️these👨‍🦯‍➡️two👫just👙so🤸‍♂️I🎉could🥳be🤪happy🤬for👬them🤦‍♀️in🗿person🪨. \n\nAlso🧊I🤩really😏want🫨to👽find🫵my🩻own🔮cubic🪨pyrite🏴‍☠️. I🧐have💼a🥚cube🍄‍🟫, but👐I💰bought💸it🪨. I'd🪪rather😩crawl🦞into👉that👌cave🕳️and💪pull✊it🪨from🧗the🇼🇫wall🕕myself🧑‍🎤. I👀know🧠if👁️I🫂found👝a🍁stash💨like😍this🤓I'd🤯be🏋️so🍆pumped💦.",
            "The most rockhounding fun I had when was my friend and I were digging in an old quarry up North and thought we found gold flakes. (It was just weathered Mica, lol) so I definitely do get the buildip and excitement around it though for sure!",
            "Are they valuable? Because if not, why? Not like they're pretty compared to most gems >.>",
            "What boomer says “home girl?”",
            "Lmfao go outside and touch grass.",
            "The streak test can determine this without destroying the specimen.",
            "Ass-pedo? 🤨",
            "I love that sub cuz I love science, but doesn't have the brain capacity for jargons.  \nCan vouch, I already love him.",
            "you mean from where they took it?",
            "Roll a die, and whichever side comes up gets another layer on the cube.\n\nA layer of pyrite is only .1 micrometers, so there is around 500,000 layers on each side of each cube, which means you roll the dice 3 million times to build one cube.  With such a large number of dice rolls, we would expect the sides to be pretty dang close in size.\n\nAdditionally, if the crystal started to get out of whack and stacked enough layers early on to make it look like say a shoebox, that now means all the other sides have greater surface area than the ends.  This means that there are more places for a new layer to potentially start, making it more likely for one to form compared to the overly layered sides.  This provides a natural pressure for the pyrite cube to expand relatively evenly, even if probability is insufficient.",
            "There is an equal chance of any of the 6 sides adding a layer at any time, they won't be perfect squares, but each side will grow at roughly the same speed, unless there is an impurity somewhere.",
            "This is the truth 🫶🏻",
            "It's the matrix, don't let those dirty scientists lie to yoU!",
            "Would an ai call you an absolute walnut? 🥜",
            "Lol.  You just jelly she's so stoked 😉",
            "I don't care if they're valuable, finding perfect shiny cubes in nature would have me in awe",
            "Pyrite's colloquial name is \"fool's gold\"",
            "Not super valuable no.  But they look like crystal gold, Which is why pyrite is known as fool's gold. So I'd argue they do look cool imo at least.",
            "The one I replied to, your lack of critical thinking is astounding",
            "Struck a nerve huh boomer?",
            "Nobody knows how to splain something til it's been splayned to them in a way they understands it.",
            "Haha I totally missed that when I read it.",
            "Law of large numbers. Nice.",
            "Wow. At first I thought it’s kind of miraculous they form such nice cubes. After this comment and chain, now it seems like it’s almost impossible for it to be any other way",
            "Great answers! I find it very interesting. I’m also very curious as to why don’t the cubes grow indefinitely? I see all the cubes in this video have similar sizes. What prevents a cube reaching let’s say a 1 m^3 volume?",
            "Just hard for humans to understand scale, shit a mole of pyrite is just ~120 grams. Just wild wild numbers to comprehend.",
            "Whoah.",
            "If it was prompted to then yes.",
            "Me 😄 cool!\n\nHer🥵🥵🤤🥵🤤🥵 uhgggghg they fit together",
            "Whats the matter man? You wanna talk about it?",
            "Not really, tbh and I'm not a boomer dumb dumb. Cya never.",
            "Also just looking at the video it doesn't seem like they *are* perfect cubes. They're all at least a tiny bit off",
            "Pyrite is FeS2, so once you run out of either Iron or Sulfur (most likely Sulfur as Iron is over a 100 times more common in the Earth's crust) in the nearby rock, the crystal can't grow anymore."
        ]
    }
}