{
    "ChatGPT bots are infesting this subreddit - how you can help": {
        "title": "ChatGPT bots are infesting this subreddit - how you can help",
        "score": 89,
        "url": "https://www.reddit.com/r/selfimprovement/comments/1d9irhc/chatgpt_bots_are_infesting_this_subreddit_how_you/",
        "content": "After not looking at the queue since late last night I had to ban 50 bot accounts who posted to this subreddit since then this morning. I am as pissed off about it as you all are. \n\nThe situation is out of control.\n\nI have increased our posting requirements in automod. \n\nPlease assist the mod team by reporting any of these accounts that you find. Your help is instrumental in flagging these posts so the mod team is alerted to them sooner. \n\nYou can report them for spam, or by using the new report reason I added to the subreddit.  Rule #10 \"no bots\" \n\nI know these bots are incredibly annoying and we are doing everything we can to get this issue under control.",
        "num_comments": 22,
        "comments": [
            "Maybe a quick list of how we can identify bots? I see some people claiming accounts are bots but if I check their post history they seem like regular people so I never really know unless it's a day old account",
            "Call me John Connor, we must stop SkyNet!",
            "Are the bots Just farming karma or what are they doing expect beeing annoying?^^",
            "r/tipofmytongue sub has a great system. try creating a post there and you’ll understand how it works. it will weed out automated posts while causing a little inconvenience to the users",
            "This is insane. The self development world is always gettting so fucked up because of instagram influencers that never had to endure hardship and chatgpt",
            "Thanks for the heads up. I just don’t understand why this is happening, what would be the point of bots spamming Reddit? ",
            "Fuck the bots, it is annoying that I can't just submit a post on this site.  I am just looking for recommendations for a guide to living an organized life. Like how to stay on top of chores, taxes, insurance, investments, relationships, etc. I suck and need help cause I move through life from crisis to crisis rather than having any control over anything and it is destroying me.",
            "Alr chief ",
            "It seems there's less AI",
            "bots are data farmers",
            "hey i can't  post in this community it says moderators removed your post what should i do ?",
            "\\* Asking generic / questions that looks like it should be posted on ask reddit\n\n\\* Posting the same questions on non-self improvement related subs\n\n\\* Getting lots of likes quickly\n\n\\* Getting lots of likes with barely anything in the body of the post\n\n\\* This sub is not super active despite the ranking. If you go on here and an hour later see 10+ new post, a good portion are likely spam.\n\n\\* Post on this sub are typically people describing a situation that they are dealing with. If it's missing this then it's likely spam.\n\n\\* They don't reply to comments on posts, or when they do it's something generic.\n\n\\* There post history is made up of asking random questions",
            "A nonsensical 'UserName123' is a pretty good clue.  *Squints eyes at you*",
            "The post history is a dead giveaway usually",
            "I imagine that in the near future we'll be using \"AI detectors\" in the same way we need antivirus to safely navigate the internet. Which then raises the issue of... If software is reading everything we read, it's also potentially recording everything it/we reads too.\n\nIt's only going to get worse as AI becomes easier to use and methods of abusing the technology become more prolific. Social media is, hopefully, going to fade away as it becomes more and more difficult to discern people from software. A day will come where it will be almost impossible to tell the difference without some sort of software/analysis stopgap examining everything you come into contact with. Subtext and comment histories won't be enough - even if people had the time/energy to bother doing that a thousand times a day.",
            "they're farming data",
            "Spam rings like these operate on the principle that if they just make thousands of accounts it is guaranteed that at least some of them will slip through the cracks and be able to farm karma. \n\nOnce they have enough karma for the account to be interesting to the kind of people wanting to buy one, it is sold off for pennies.\n\nSince these spam rings make thousands and thousands of accounts it is a lucrative business.\n\nThe kind of people who purchase accounts grown by botted karma farming use them for crypto scamming or astroturfing and other less savoury activities on reddit.",
            "They reply to their own question.",
            "I’ve also noticed lately they always put only this symbol in the description   | \n\nI’ve  seen it in other subs as well. It’s a dead giveaway. Normal humans don’t do this.\n\nExample - https://www.reddit.com/r/selfimprovement/s/Hc7SkaaRR7",
            "lmfao"
        ]
    },
    "If you could do it all over again, blank slate, what would you do differently? ": {
        "title": "If you could do it all over again, blank slate, what would you do differently? ",
        "score": 19,
        "url": "https://www.reddit.com/r/selfimprovement/comments/1dlt0h3/if_you_could_do_it_all_over_again_blank_slate/",
        "content": "Today while working a thought popped up in my head what I would’ve done differently in my life if I could do it all over again. Same conditions, same opportunities, everything…I realised my answer on that question was literally everything…what about you? ",
        "num_comments": 42,
        "comments": [
            "try harder earlier when it was easier and I had less to worry about.",
            "I'd go to therapy after my junior year of high school and be more proactive in finding a career path. I'm still trying to figure it out at 26, though I'll at least get my bachelor's degree this coming May",
            "I would sleep early and start my day before sunrise. Do 30 min exercise before starting my day. And read at least an hour everyday",
            "Commit to a career path much earlier and base every life decision around that. Society heavily values specialists over generalists.",
            "Been aware of the nonproductivity of socializing and the value of a higher education.",
            "Everything tbh",
            "go to university out of my city, start saving from an early age and move out by 20, come out of the closet younger. so many things dude",
            "just listen to my parents since day1 and not apply any of my brains",
            "I would’ve bought a house in 2nd grade 💀\n\nBut serious answer is I wish I could go back to junior year of high school. If I could just start over there and do some things different with myself and restart my relationship with my gf at the time.\n\nI was an extremely skinny guy back then and I would have started working out sooner if I knew how much it would help me both physically and mentally. I also would want to stop binging video games so much—it really took up so much of my time back then. Overall, I just wish that I took better care of myself.\n\nHowever, the thing I would want to do over again most is building a relationship with my gf (now ex). I loved that we became best friends before we started dating, and I wish that I made more effort to appreciate that and have us more involved with each other’s families. I wish that I accepted the pain of our miscarriage better and that we went to counselling together to address it rather than just pretend that it never happened. My relationship with that girl has literally saved my life and changed me for the better, even two years after our break up. It’s not hard for me to imagine an alternate timeline where we were married and building a family together.",
            "Every single freakin thing!!",
            "Nothing at all. There'll always be more to do and improve regardless of the stage in life. I wouldn't be who I am today without those wins, failures, opportunities, and relationships, it's enough.",
            "Would love to say I would work harder, stop procrastinating and be more fit but these are all things I could start today and for some reason am struggling with. A blank slate wouldn't change my laziness and attitude. \n\nMaybe get mental health help from a younger age. If I had all my memories of who am I now, I'd definitely give myself a break and have more patience with myself.",
            "I wouldn’t waste time socialising at university. Beyond that, not much different.",
            "Make sure I was never born.",
            "A few times I missed the op with a funny line or comeback.  I've hit a few tho also.",
            "Go back 10 years and stop my life for fking up",
            "Move to Estonia in 2016 for studies",
            "I would take my education more seriously, and I would take care of my teeth.",
            "The last 15 years, not feel pressured by others decisions, not make the wrong decisions and just absolutely make my own decisions and go my own way. Moving forward learning how to make better, intuitive decisions.",
            "I would make sure I was never born to be honest, but really I think I would try not to be depressed in my yourh, now that I’m in my late 20s I see that I wasted so much potential being sad",
            "Think I would have really just emphasized the importance of starting sooner. Starting small, starting consistently.",
            "Not drink alcohol.",
            "If given a chance, I would ask out girls for a chance to date in my teenage years. Due to social conditioning and extreme insecurity of losing hairs at an early age, I backed out out of doing so. \n\nAt that point, iasking out girls seemed not that big of a deal but now I think that it would have  improved my social life by quite a margin. It's not that I can't talk to girls. I can and do it effectively if I have to. I am quite confident even though I know I don't look that good. I can easily maintain eye contact without hesitation. I found this about me at a later stage of life. I am 31 now. \n\nBut the thing is, I don't know that player or dating type talks which engage a woman. I can possibly go blank in that setting. A little experience in that regard would have helped a lot. Approaching a girl is not that big of a problem compared to what I will say when I approach her. This is possibly the only aspect of my life that I have missed out on and some days it hurts like he'll from inside. Sigh!!!",
            "I’d be a surgeon like I originally wanted. At 20, 30 felt so far away and I just thought “I don’t wanna be in school that long”. But here I am, 30, just finishing another masters degree but I’m in education and make pleb wages in comparison to my aspirations. \n\nI also wouldn’t let myself go. 10 years ago I was in great shape, now I’m 80lbs heavier and it’s harder now to get a hold on my mental toughness to quit eating.",
            "This is a great question, and for every answer there’s the knowledge that you’ve grown, you’ve learned something.\n\nThank your younger self for being brave enough to try something, and for providing you with knowledge and skills.",
            "Nothing. My mistakes made me who i am. My experiences made me who i am. I would NOT want to go back and re do anything…. I would HATE having to go through puberty again, middle school, high school…. No thank you… lol",
            "I would do anything to be honest.. but hey, thats life right? Its not life if we are constantly winning. Living your life to the fullest is the combination of wins and losses. Therefore, i chose not to change anything. If i change anything in the time spectrum i would not be able to have an advance version of myself. Which shapes who i am now",
            "Ask myself more about what I really want out of life instead of asking others what would be best for me.",
            "Not give a fuck about everyone around, live my life the way I want it to be. I'd have taken up running long time before I actually did. The same with yoga.",
            "I wish I would've been able to 'figure things out' earlier. I was always feeling confused, behind, and like I was not enough. \n\nAt 30 I realized these feelings are pretty common among young people. Some people at a higher frequency than others. \n\nI wish I would've known what to do earlier than it took me to figure out, but at the same time maybe it all happened at the right timing. \n\nI am going through a very .painful divorce that I tried so desperately to avoid and fix the marriage. However, it has made me the absolute best version of myself and I am grateful for the change that occurred in me. \n\n  \nI know it's easy to fall prey to self loathing, despair and regret but try and focus on how you can change  your future outcomes because you \\*still\\*  can and move on from past regrets.",
            "Nothing...perfection doesn't exist. Use what you have to get what you want.",
            "I wish I could do my 20s again. I would immediately go study IT after high school. I would start investing as soon I had a job. I would have had better boundaries and self respect. I would been more sociable. \nI would have embraced my interests and hobbies, instead of being ashamed of them. I wouldve started working out regularly, and eat healthy. I would have taken more chances with people (=tried to make friends). I would've broken up with my ex as soon as possible. I would've cut off unsuitable friendships.",
            "Fail so much more earlier to get over the fear of it.",
            "Knowing what I know now, after having worked about 14 years in the corporate world, selling my soul for a corporate salary that has been yanked out from under me at least twice due to layoffs, if I had to do everything all over again I would:\n\n> build my leveraged, residual income side hustle FIRST (before going to college) until it was big enough to grow organically AND sustain a modest lifestyle including savings for emergency fund, fun money, retirement money. \n\n> Work non-stop to build that leveraged, residual cash flow as fast as possible, while working jobs as needed to support myself in the meantime. \n\n> THEN once the side hustle can pay for all of those things, then and only then, would I go to college, get a corporate job (if I really wanted to) and experience the job world drama of rough job market, get hired, get layed off, spend your savings trying to survive until your next job, get hired,  re-build your savings, shampoo, rinse and repeat.\n\nI say this as a college graduate with a Bachelor's and a Master's and a pretty impressive resume (I've been told).  \n\nAlthough I have made a great corporate income, I now see that had I invested my time and effort in my own leveraged, residual income business,  I could have made the same and possibly more income than I earned in the corporate world.\n\nThe key is to understand the difference between \"working income\" and leveraged, residual income.  \n\nThey don't teach this to the middle class.",
            "I was always hesitant about opprtunities and not grabbing them when they're there. Not putting myself out there. I've always regretted it and sometimes would wonder if my life right now would be very different.\n\nWhen I was studying undergrad, I wondered if I joined my program club from the beginning, went to networking events, and applied to that one government student job - would my life and career be different right now? I was studying business. I could be working a 9-5 in an auditing company with high salary by now like my other classmates, but I ended up studying again and now work in healthcare. Obviously, there is a huge gap in pay difference between the two. Pay right now is still good and way above minimum wage, but it's just not enough to live on as a single person in this economy.",
            "Not be so attention seeking when I was younger",
            "Do I keep my memories? If so, heres a few:\n\n- be less of a dick ro my cousing;\n-spend more time with my grandparents;\n-date more and make more friends in high school;\n-invest in bitcoin in 2008",
            "Everything!!!!!",
            "Not stress as much and live more freely",
            "I feel this one. I gotta degree in sociology hoping to get into public services on scholarship. But now I'm making $30/he with inflation and barely making it. Now I have to pivot into a masters program or new schooljng while working and pay bills. Wish I had done something else in school at least add a lucrative second major like my parents said but I was too idealistic and mentally stressed to use clear foresight lol",
            "Brother, it sounds like you're dealing with some serious regret about not pushing yourself harder when things were simpler. You clearly need some accountability management in your life, someone to motivate you and keep you on track. Try to find my insta EthanDG.eth, and we can chat privately. I'll help you out and give you the push you need to stay focused.",
            "If you can, switch to a new place. A mental health game changer for me was moving to a new place. It will not make problems disappear bit will help with the mental health aspect. That can provide much needed clarity."
        ]
    },
    "WHAT ELSE CAN I DO TO BECOME A BEAST?": {
        "title": "WHAT ELSE CAN I DO TO BECOME A BEAST?",
        "score": 36,
        "url": "https://www.reddit.com/r/selfimprovement/comments/1dlp6by/what_else_can_i_do_to_become_a_beast/",
        "content": "IM DONE BEING SCRAWNY. IM DONE CHEATING MY WAY AROUND LIFE. 1 MONTH AGO I WENT COLD TURKEY WITH VAPING AND SMOKING WEED. I STARTED HITTING THE GYM HARD 5 DAYS A WEEK AND EATING 4+ HUGE MEALS EVERYDAY. I BEEN STUDYING NON STOP TO GET ALL As IN MY COMPUTER ENGINEERING CLASSES. I BEEN FOCUSING ON TREATING EVERYONE AROUND ME WITH LOVE AND RESPECT AND FOCUSING ON MY MENTAL FEELINGS INSTEAD OF SMOKING WEED AND FORGETTING ABOUT EVERYTHING. I JUST WANTED TO PUT THIS OUT SOMEWHERE SO I CONTINUE BEING A BEAST. ANYONE GOT ANY OTHER SUGGESTIONS? DONT BE GREAT BECOME ONE OF THE BEST. CLIMB MOUNTAINS NOT SO THE WORLD CAN SEE YOU, BUT SO YOU CAN SEE THE WORLD.",
        "num_comments": 17,
        "comments": [
            "SHIT YOUR PANTS LIKE A BEAST RAAAAHHHHHHHHH\n\nok but seriously that last bit motivated me thanks for sharing man",
            "wow, that's some serious motivation there. Congrats man keep going forward. My only advice is to don't stop, maybe you might want to lower the weight if you feel like to but don't quit keep going because you're a beat right now!",
            "Sleep. Probably the most under appreciated aspect of “becoming a beast”. Your body needs to heal when you’re out of the gym. There’s a few ways that happens:\n\n• correct nutrition.\n\n• remaining hydrated.\n\n• adequate sleep. \n\nGood effort on taking control. Keep it up. \n\nP.s. stop using all caps. I get you’re excited but there’s no need to shout.",
            "Brother you are a beast. Just keep it up.",
            "RAHHHH BIG DOG",
            "Good job!",
            "[removed]",
            "Start by taking pity on the caps lock button",
            "You need to travel",
            "Track your macros and start cold showers my boy",
            "You need to crank your hog.",
            "DONT BE A BOAT BE THE LIGHTHOUSE THAT GUIDES ALL THE BOATS",
            "RAHHHHH THANK YOU \n\nI NEED TO BECOME RIPPED I NEED A HOT GF",
            "Become dangerous. \n\n“A harmless man is not a good man. A good man is a very dangerous man who has that under voluntary control.” - Jordan Peterson\n\nEducate and develop yourself while mastering self control. Master a martial art. Learn to shoot guns and hunt. Backpack a hundred miles of long trail.\n\nSearch for make yourself dangerous and look for Order of Man’s article. (My first post was removed by a bot due to an innocuous link.)",
            "Who’s gonna carry the lighthouse!? Who’s going to carry the logs!?",
            "Got that dog in you, keep at it."
        ]
    },
    "How do you believe in yourself after losing all hope and when you hate yourself?": {
        "title": "How do you believe in yourself after losing all hope and when you hate yourself?",
        "score": 80,
        "url": "https://www.reddit.com/r/selfimprovement/comments/1dlcheu/how_do_you_believe_in_yourself_after_losing_all/",
        "content": "35 here and I feel like a big loser for not having anything in my life yet. Just trying to find a way to be happy and believe in myself again. Right now I feel like I am not good enough and I wanna get over this feeling.  I wanna feel alive again coz I am tired. \nFake it until you make it isn’t helping. \nKeep getting rejected from jobs and a guy dumped me recently too. \nI wanna be confident and focus on my own life and path but it’s hard when I feel like a loser ",
        "num_comments": 34,
        "comments": [
            "To start believing in yourself again, try setting small, achievable goals each day to build confidence gradually. Focus on your strengths and past successes, even small ones, to remind yourself of your capabilities. Surround yourself with supportive people who uplift you, and don’t hesitate to seek professional help if you need it. Engage in activities you enjoy to bring some positivity into your life, and practice self-compassion by treating yourself with the same kindness you’d offer a friend. Remember, it’s okay to take things one step at a time.",
            "Hey! It's understandable that in this stage of your life things seem hard and unbearable. Try to forgive yourself for what happened and start with zero. \n\nThat''s the prerequisite for improvement. If you keep carrying the guilt and shame with you, it will keep dragging you down. \n\nWhen I was in a similar situation I surrendered and faced the fears I was running away from. I promised myself to use the anger and disappointment as fuel to become the person I'd love to fall in love with.\n\nI suggest you take 3 situations in your life, that really matter to you. Materialize them by writing down what exactly it is. For example for me it was always meaningful relationships, health and career. \n\nI wrote down my vision how I want to end up there with a couple of milestones within a year. This year I wanted to increase my weight again from 61 to 66kg. I wrote down how much kcal intake I need everyday. I created a diverse mealplan and finally started to work on it everyday. \n\nEssentially I broke down the goal in tiny, manageable pieces so that I didnˋt have an excuse for not executing. \n\nWhen you make those tiny microwins everyday, you start to feel alive again. We need progress. Visible progress. At the end of the day confidence is not a finish line. Itˋs a state and it has to be maintained. \n\nWish you good luck with you project, champ!\n\nK",
            "Read Joe Dispenza's Breaking the Habit of Being Yourself... it really helps break down the interaction between the thoughts of the mind and the emotions of the body. You are not your emotions. You aren't even your thoughts.\n\nThere's more to your self-defeated attitude than you think. Its a symptom of something larger; a subconscious pattern that is reoccurring within you. \n\nTake and make the time to invest in yourself so you value yourself. Actively invest in yourself and gain self awareness. Don't let others determine your value and do not compare yourself to others!\n\nAlso therapy may help.",
            "The same actions and environment will beget the same emotions and beliefs. To start to break out you have to change something concrete in your life, anything really. Really examine your life, zoom out to see the big stuff, and name specifically what you don’t like. See what you can change. And hate to say it, but the feelings will change when action and environment change. It took me a long time, but I finally have figured out that you just have to ignore the feelings. Also, it sounds like you might be under  perceived or real pressure from someone else to achieve a certain something in life. Remind yourself that 99.9% of us will be six feet under and forgotten in only about 50 years, so let go of the pressure to not “fail” in life. It won’t help you get anywhere, as you already know.",
            "Man, this is such an incredible question. Every time I think good is just right around the corner, I’m just slapped in the face with a dose of hardship.  \n\nSo many rock bottom days with depression and sadness. Failures, rejections, being not chosen by someone you want to be chosen by.",
            "I was like damn 35 but I realized I'm 34  in the same situation as you..",
            "Go to the gym, exercise regularly, eat healthy. I became fit and then feel good about my body. that’s how I gained my confidence back then believe in myself again. Also went to therapy helps too.",
            "You have to retrain your brain. You’re not your thoughts. You’re not your emotions. You’re not your nervous system. You’re not the stories you tell yourself. The past is in the past. Any self-defeating feelings you experience in the present is conditioning from the past. You can carry your emotions, thoughts, and memories in the present, AND still choose to be better — nobody tells you that shit, but you can. It’s not that you ignore them, it’s that you choose to not let them define you.\n\nYou have to start small. Just 2-minutes of self-compassion a day can start you off. Check out Kristin Neff’s work. She has some great guided meditations on her website that are free. Take the self-compassion test now, and then re-take it in a couple of weeks after consistent practice. Promise yourself. Out of all the shit you have going on in your life & how shitty you feel, promise yourself to try 2-minutes of self-compassion a day. Do that every day. You may have to be relentless. Just do it. \n\nThen, once you have some self-compassion onboard, you can begin looking at what you believe about yourself — self-love, self-esteem, resentment, needs, values, beliefs, etc.. What are the narratives and stories you tell yourself — what stories do you tell other people? Do you love yourself? How do you respect yourself? Are you in integrity with your gifts? All the shit that conflicts with these questions are unconscious programs that run on autopilot to keep your mind contained to what you know — your mind does not want to change because that’s scary. Fear will arise. Just know, all of that is content from the past.  Create space to these narratives — mindfulness, doing something creative, physical activity, socialize, go after a small goal — combine all of these into 1 day, then repeat every day. String enough of these days together & you’re in a totally new headspace. You’ll have to revisit the new beliefs in yourself continuously until they’re embedded into your subconscious — so be ready for high reps.\n\nThen, work on your soft skills and technical skills. You have to develop these to be competitive in the workplace. Don’t overdo it. Don’t fake it until you make it. Just slowly develop both fronts. From there- focus on the areas of life that bring you deep joy and happiness. Money doesn’t matter for that trailhead, just drift in that direction and continue making progress because you enjoy the act of it, not because you have goals or want to get somewhere.\n\nYou can do this. Anybody can. All it takes is willingness and consistency. Good luck.",
            "This is the very moment you need to believe in yourself the most. It's going to be hard, but I can tell you are going to not only make it but come out stronger than you ever have before from this period. \n\nA loser wouldn't post this if they weren't truly looking to make a permanent, long-lasting change. You need some direction to truly love yourself, becoming your most vocal advocate and best friend. \n\nDon't let anyone or anything not make you feel good enough. You need to define who you are and never bend or allow others to change that because you have those values set in a solid foundation. \n\nI believe in you op. You got this!",
            "I definitely feel you.. I've learned to stay out of my head (the dark places atleast) and this took practice. I would literally drown out the negative thoughts by listening to green noise and practicing meditation. Over time the bad thoughts became a mere whisper and are pretty much nonexistent unless I let myself go THERE. Start by writing down something you're grateful for even if it's just one thing everyday. Doesn't have to be anything major.. Might just be grateful you got out of bed today. Slowly challenge yourself to think of 2 things.... Then 4 things.. Build up to 4 things daily. Add to this task of positive thinking by listing 2 things you're looking forward to; or 2 things you like about yourself.... Set a small goal for the week such as making a phone call you've been putting off or completing a task you've been procrastinating on. Write a thank you note of appreciation to someone you're grateful for. I promise it will get better.. Then we both can be POSITIVE losers. Lmfao. Jk..... Kinda. 😅",
            "I’m only 19, but one thing that I have been working on that has helped me for believing in myself is SELF IMAGE. It is so incredibly important for everything you do in your life.",
            "Weell my case is that you gotta rebuild yourself from the ground up, 25M here and i’ve done this twice. Not easy but necessary",
            "Hey King / Queen , you got 35 yrs experience, focus on what you can success again until you can take another challenge !  English is not my mother language, however i think you can get!\n\nIf you are tired, do anything make you happy ! you will recover . if you can't find one, here is another secret, make a stranger happy ! figure out what will cause other's truly happiness , and do it",
            "Hey there! FWIW I started taking an antidepressant recently and it has helped me immensely. I felt very much like you but I’ve definitely turned a corner with help from medication, I don’t even feel like I’m faking it I’m just finally relaxing and getting out of my own head. \n\nYou got this bro, seeking professional help is a PITA and I hated every step of the way but I’m *so* grateful to have figured out the chemistry experiment a little better. \n\nTry not to beat yourself up, I know it can be hard but you’re doing your best!",
            "I'm asking myself this more recently too.",
            "This is the best time to invest in yourself and improve yourself. Do something daily to nourish your body, mind, and spirit. For example, make sure to drink enough water to nourish your body. Watch a positive video to nourish your mind. Say one thing you are grateful for or journal to nourish your spirit. Those are just examples, but there are many things that you can do to nourish your body, mind, and spirit. When your body, mind, and spirit feel good, you will feel good about yourself. \n\nHave clear and specific goals that you want to work on and achieve. Learn to develop an abundant mindset. As long as you are learning and growing, new opportunities and people will always be available to you. Of course, those opportunities and people might not manifest immediately, but they are as you keep learning and growing to prepare for them. And that is an abundant mindset.",
            "Good news is that you can change from inside.  Starting to believe in yourself, trusting yourself and so on.  Yes, simply building trust can change your life.\nWorking on your belief system.  It is deep work and not easy.  But totally possible.  You have to deconstruct all the thoughts of you being not enough and replace them with more supportive thoughts.\nI’m running a course on self-confidence soon and we will be working on exactly that.",
            "Serve others, if you can’t stand people then turn to animals or land conservation or whatever interest gets you excited, and you’ll find other like minded people to get excited with.",
            "Crying about it",
            "35f in an identical situation. Been single for 4 years, feel unlovable and like my dream of having kids is over. And like I ruined my life not finding a partner when I was young and pretty. I’ve always struggled to find a good job and continue to be in entry level roles with awful pay. Feel like everyone around me has advanced and I continue to feel worse about my life each day. It’s so freaking hard not to get down about it and keep pushing through. Hugs to you ❤️",
            "Leave your worries to God and ask Jesus to come bring you out of this depression. Read your Bible there are stories to encourage you and lessons to be learned about life on earth.  Bible stands for basic instructions before leaving earth.",
            "Life is beautiful \n\nOur minds dicide good or bad moods\n\nTry to make factory reset the mind \n\nand restart\n\nOne can see the beauty again and again",
            "MEDITATE",
            "1st and foremost. You must change the inner conversation you're having with yourself.\n\nStop giving time or age or numerical equivalents to describe when and how your success should be. It must come at different times...preferably when your most ready to keep it.",
            "It's tough when it feels like your world is crumbling. But sometimes, losing everything can be the best thing to happen because it clears room for radical change. Forget focusing on small wins. Embrace dramatic shifts! Try something wildly different - new hobby, new place, or even a digital detox. It worked wonders for me.\n\nHang in there; I've been there too. It's the darkest before the dawn. You got this! 💪🌄",
            "Look the truth is you still have a job. Ooops . The truth is you’re still a woman!👩 regardless of your looks or weight you will always be in demand by men!",
            "Believe in the Lord first.  Everything else will fall in place.",
            "\"being not chosen by someone you want to be chosen by.\"... choose yourself first and rejections should feel lesser",
            "i can double the confidence if you let me appreciate ya fitness body",
            "This is a wonderful comment",
            "You've motivated me to get ready for some high reps, haha. I'm in love",
            "like figure out who you really are ?  what you should behavior/?",
            "Happy cake day!",
            "I know you mean well, but that doesn’t make any sense lol. \n\nI’m not sure rejection is supposed to feel “lesser”. Being rejected sucks and it’s okay to feel shitty after."
        ]
    },
    "I've realised that being single has become my identity": {
        "title": "I've realised that being single has become my identity",
        "score": 4,
        "url": "https://www.reddit.com/r/selfimprovement/comments/1dlt72p/ive_realised_that_being_single_has_become_my/",
        "content": "Hey everyone,\n\nI (28M) wanted to share something deeply personal that I've been grappling with for a long time. I've never had a relationship, and being single has become my identity.\n\nEvery time the \"opportunity for a relationship\" has arisen, I’ve ended up sabotaging it, overwhelmed by the excitement and relief of potentially being freed from the curse of being single. Reflecting on it now, I realize that this drive was fueled by a subconscious identity shaped by societal expectations and the pressure from my family. Like every New Year's Eve, my family would tell me, \"Next year will be your year. Next year you'll have someone to kiss at midnight.\" These well-intentioned comments have had a lasting impact, making me view women not just as individuals but as potential solutions to fill the emptiness I felt inside.\n\nThis mindset made every interaction with women daunting because, in the back of my mind, there was always this hope that the person I was talking to might be the one to fill that void. It distorted my perception of what a relationship should be and put immense pressure on every conversation. After years of \"trying,\" I gave up on trying to find love.\n\nA year ago, I had a reality check that made me realize how deep this issue ran. I met someone who showed genuine interest in me, and for the first time, I felt truly seen and appreciated. This confused the fuck out of me initially since I had such a low image of myself that I thought there was no way this person could be interested in me. This person validated my feelings and showed her interest by actions, like texting me first and asking me to hang out. This was truly the happiest period of my life, and the closest I've ever been to a relationship. But as things progressed, my underlying insecurities and desperate need for validation overwhelmed me, and I ended up pushing them away. This felt like a cruel joke played on me by the universe to tell me that I'm capable of finding love, but not as the person who I am right now.\n\nThis painful experience was a wake-up call, making me confront the unhealthy patterns and deep-seated fears that had been driving my actions. The impact of this reality check was profound. It made me doubt everything about myself, revealing that my self-perception was not only unhealthy but had bled into my entire personality. My insecurities made me feel so small that I created a prison in my own mind, full of self-imposed rules that made no sense. This realization triggered a domino effect of further realizations, making things feel even worse than before. It was as if the foundation I had built my identity on was crumbling, forcing me to confront painful truths about myself.\n\nI've come to understand that this approach is unhealthy and has prevented me from forming genuine connections. I'm working on changing this perspective, focusing on seeing people as they are, without attaching my self-worth to the possibility of a relationship. But this feels impossible since what I'm trying to do is change 28-year-old negative thought patterns. I'm trying to build a healthier self-identity that isn't reliant on others, but on my own intrinsic value and actions.\n\nHas anyone else experienced something similar? How did you work through these feelings and start forming healthier relationships? I’d love to hear your stories and advice.\n\nThanks for reading. ",
        "num_comments": 15,
        "comments": [
            "Maybe when you do meet someone, you can be transparent (once you feel comfortable and are ready to commit) about previous patterns. I think working through issues together as a couple is a really beautiful and rewarding thing. ☺️",
            "Yeah, I've experienced something similar. When push came to shove, I lost every bit of confidence I had in myself and as a result that showed and I sabotaged what could've have been something special. At the same time, the issues that I had which was largely just poor self esteem would've showed if we did end up being in a relationship and I would've hurt her even more. So I decided to not pursue it and right now I'm going through the motions and trying to rebuild my confidence and self esteem in myself. My advice would be just that, learn to love and accept who you are. Improve yourself in a way you see fit and that also improves your self image. Maybe everything else falls into place, maybe not. But at the end of the day, you have only yourself and time passes regardless so use that to make small improvements every day, put all that effort that you would on someone else in you and one fine day when she does come along, you can be happy that you deserve to be with her and she you. Don't time pressure yourself to find someone because that'll drag you down even more.",
            "This honestly sounds like my partner 🥲 it’s been a struggle to get to where we are but through all his attempts at self sabotage I have stood by him to show him that he is truly accepted and loved for who he is. It isn’t perfect and I also haven’t been perfect the whole way through but we love eachother and are truly committed to one another. I hope you find someone who will ride those waves with you. It’s rewarding when you have happy healthy moments after periods of struggle and get to reap the rewards of your hard work together.",
            "I think that's what i tried with this person a year ago. I told her about some of the issues I'm struggling with, and she encouraged me to change for the better, and i did for a while. I was able to quit smoking, drop what i thought was a weed addiction cold turkey, and gained a couple pounds of muscle in the gym practically overnight. But i realised i wasn't doing those things for myself, but for her. It's not that i didn't want to change FOR her, i just think she deserves someone who is strong enough to do it for themselves.",
            "I know i should learn to be happy on my own. A relationship should enrich my life, it shouldn't be my main goal. What also doesn't help is that I'm a massive people pleaser to the point that i think that most things that i \"enjoy\" are just things i started doing to impress others. I don't know what i should do to make myself happy. I don't even know what person i want to be. I even feel like my kind and helpful nature are just projections of my desire to be loved and accepted by others. I feel like my entire selfworth has been based on my usefulness for others. I've acknowledged my deep desire to be validated by external sources, but i see that desire return in so many thought patterns. Like when i want to text someone it's not that I'm curious about how this person is doing, it's that i feel lonely and want to talk to people to feel better. And i know that when I'm feeling this way that I'll inevitably talk about the struggles I've been dealing with, and i don't want to burden these people again who already have spent so much time to assist me. So then I don't text them. Which also makes me feel guilty.",
            "People have been telling me that I'm allowed to let myself be loved despite my flaws, and i know that. I just feel like it wouldn't be fair to anyone to burden them with trying to make me feel adequate enough to make me not hate myself.\n\nThank you for your kind words. It makes me feel better that there are people out there like me who have found someone like you. I hope i will find that someday.",
            "Im a woman and personally I feel like if you were my partner (who you sound very similar to!) I would not care whether you were doing it for yourself or for me haha. I personally like my partner doing things with the reason of doing things for me and for us. It’s just what couples do when they are serious about their commitment to eachother, they put effort into improving things for eachother. \n\nAlso I feel like you’re denying these women the right to choose whether or not they want to take on these parts of you that you see as negatives. My partner did this to me and decided he was too hard to love when in my mind, loving him was the easiest thing I’d ever done. Don’t deny someone their right to make a decision about how they feel about you 🥰",
            "I’ll probably get downvoted for this but have you thought about looking specifically for more dominant women ☺️ some more dominant women love their partners being devoted to them in this way… just a thought!",
            "Honestly when you really love someone, they aren’t a burden no matter whether they come with emotional baggage or not! \n\nDon’t forget to ask yourself how you feel about the person you look to be in a relationship with too, when the opportunity arises. It isn’t a nice feeling as a woman to feel like you’re just the person who decided they would be able to work with the emotional baggage. It feels amazing to know that your partner chose you because of how they feel about you ☺️ just some food for thought for your next relationship. Don’t be afraid to be vulnerable. I hope you find your best friend. ☺️",
            "I guess I'm kind of making the decision for them by deciding to not pursue anything because i expect them to reject me because of my flaws. I guess that just comes from experience from when i was younger. I've shared my insecurities in the past, and I've been rejected, ghosted and publicly ridiculed by the people I've shared these things with. That's why i gave up at some point. And i feel like the same thing happened again last year to some extent.",
            "When i look back at what kind of women I've been attracted to it has mostly been women with a stronger dominant personality with a kind hearth. There is something about a woman who can take care of herself and who CHOOSES to be cared for by you because you make them feel safe. It's the best feeling in the world.",
            "I always say to my partner that I will love him forever but he has to let me do that. I can’t love him if he isn’t willing to let love in so you have to be able to let yourself be in love and be loved. If you don’t know what that feels like or how to even do that, I’d really recommend breaking down some of those emotional walls.",
            "You sound really sweet and I agree, it’s the best feeling from our perspective too! I hope that in your next relationship you can maybe make some changes that will mean the relationship has a better chance of success. ☺️ if we keep repeating the same patterns we’ll always have the same outcome.",
            "Thank you for taking time out of your day to help me. I'm in tears. I will work on allowing myself to be loved by others while trying to learn to love myself.\n\nKeep being the person you are, we need more of you in this world.",
            "I think just also don’t put too much pressure on yourself too! 🥲 we don’t need to be these perfect versions of ourselves. I certainly don’t love myself every second of every day. I think as long as you’re looking after yourself and being kind to yourself, that is what matters. 🫶🏻"
        ]
    }
}