{
    "The /r/sex Rules and Guidelines - please read BEFORE you post! Updated 2023": {
        "title": "The /r/sex Rules and Guidelines - please read BEFORE you post! Updated 2023",
        "score": 189,
        "url": "https://www.reddit.com/r/sex/comments/14n6p9j/the_rsex_rules_and_guidelines_please_read_before/",
        "content": "*The mods of /r/sex make it our policy to review the rules of the sub on an ongoing basis, tweaking items as necessary.  In an effort to stay abreast with the growth of the sub and with the evolving moderation that requires, we have decided to re-sticky the updated rules to serve as a reminder for our membership.*\n\n----------------------------------------\n\nr/sex is for civil discussions pertaining to education and advice regarding your sexuality and sexual relationships. It is a sex-positive community and a safe space for people of all genders and orientations which demands respectful conduct in all exchanges.  There is **ZERO TOLERANCE FOR CREEPY/HARASSING BEHAVIOR here** — in posts, comments, messages, or any other contributions. No exceptions.\n\n---------------------------------------\n\nThis is a large community dedicated to an extremely popular topic.  If you wish to participate, it is your responsibility to familiarize yourself with our rules of conduct **BEFORE** you participate here.  Failure to do so will result in your removal from the community.  \n\n**PLEASE READ** the [FAQ](https://reddit.com/r/sex/wiki/index) with the most asked and answered questions - **BEFORE POSTING!!** Posts that do not follow the posting guidelines in the FAQ will be automatically removed.\n\n--------------------------------------\n\n**THE /R/SEX RULES**\n\n**1) ENGAGE CONSTRUCTIVELY AT ALL TIMES.**   \nThis means ensuring that ALL of your contributions here are constructive, on-topic, mature, sex-positive, civil and respectful.  Disrespectful conduct will see you banned from the community on the spot.  Hitting on other people, asking for pictures (joking or not), making any sort of sexist comment or insult, body shaming, or trolling of any sort will result in your immediate ban.\n\n**2) DON’T SKIP THE FAQ OR THE FORUM RULES.**  \nWe’re serious about this. Dozens of posts get removed every day because they’re covered in the FAQ or violate the forum rules.\n\n**3) DON'T OVERLOOK PAST POSTS.**   \nWe’re serious about this, too. Many questions may be new to you, but are very common in our community. Before you submit a post on a common topic, search the forum.\n\n**4) ALL CONTRIBUTIONS MUST BE SEX POSITIVE.**   \nWe demand that consenting adults be free to express their sexuality as they see fit. Kink shaming, slut shaming, and similar conduct will not be tolerated.  Links or references to sex negative communities or websites (No Fap, Porn Free, etc) will not be tolerated.  Attacks on the lifestyle of other consenting adults will not be tolerated.\n\n**5) POSTS SEEK ADVICE, COMMENTS PROVIDE IT.**   \nThe main forum is focused primarily on posts seeking specific actionable advice for distinctive personal situations. Giving advice should primarily be done in the comments. General discussions are often allowed, so long as they adhere to the group rules and restricted content guidelines. If you want to make an exception, please request approval from moderators.\n\n**6) DO NOT TROLL OR ENGAGE WITH TROLLS HERE.**   \nDon’t try to challenge, question, tease, fight, or outwit trolls here. Instead, use the Report button to alert moderators, who will review every single reported item.  Trolling of any sort merits an immediate permaban.\n\n**7) ALL DISCUSSION MUST BE DIRECTED INTO THE PUBLIC FORUM.** Do not seek private conversations here, via Private Message or any other method. And do not seek to draw attention or clicks to an outside site of any type (unless you have received prior moderator approval, such as for academic research projects). Every comment here must be a clear attempt to engage with an ongoing public discussion in the forum. Violations of this rule will result in permanent bans without notice.\n\n**8) RESTRICTED CONTENT** \nThis sub is generally only for seeking advice, education, or discussion about sex and sexuality. We restrict or forbid many types of content here.\n\n\n---------------------------------------\n\n**EXAMPLES OF CONTENT RESTRICTED IN /R/SEX:**\n\n**1) PROMOTIONAL POSTS.**   \nThis means any post containing any kind of promotional element, especially one which seeks to lure traffic to another site or promote a product. Links to specific product descriptions are permitted if they’re PRECISELY on-topic in the context of the post, AND the post itself is clearly seeking advice in good faith.  If you're trying to sell something, conduct market research, etc - these posts will get you banned.  Linking to sex-positive blogs or podcasts is allowed, provided you make an effort to start a conversation here about the topic and use the link as supporting material.\n\n**2) LINK POSTS.**   \nLinked material must be sex positive and precisely on-topic to stay up here, and needs to be introduced with a workable framework for discussion. Please see the posted [Link Policy](https://www.reddit.com/r/sex/wiki/linkpolicy) **BEFORE** you post links!  Bare links to youtube, images, blogs, podcasts, etc are prohibited.\n\n**3) ACHIEVEMENT POSTS.**   \nThese include appreciation, humblebrags, “I just had to share,” “I just want to say,” etc. These belong in the Daily Sexual Achievement Thread, not in the main forum. Posts which are JUST sex stories belong somewhere else entirely — like r/sexstories or a similar forum.  \n\n**4) LOW EFFORT MATERIAL.**    \n“Does anyone else...?”, “Is [X] normal/weird?”, “Is [y] wrong/bad/okay?”, and so forth.  Human sexuality is incredibly varied; yes, someone else likes what you like, and labels like \"normal\" or \"weird\" are meaningless - and in a sex positive community, we do not allow any moral judgments against sex acts or behaviors that are consensual.  Title-only posts, posts with no effort at an actual conversation will be removed and may get you banned.  Comments that consist of nothing but memes, \"this\", \"lol\" and such are highly disfavored.  If comments do not further the discussion, they may be removed; a pattern of these may result in your ban.\n   \n**5) SEEKING FAP MATERIAL.**   \nDo not ask for sex stories, do not ask for the hottest/strangest/most unusual/etc encounter someone ever had.  Do not ask for lists of other people's kinks.  \n\n**6) PORNOGRAPHY, EROTICA, OR PERSONALS.**    \nYou may not post or link pornography or erotica here.  You may not share pictures of your genitals here - even if you are seeking medical advice (if you need to post a picture, you need to be going to a doctor).  You may not recruit sex partners here, look for dirty chat, ask for someone to private message you, etc.\n\n**7) DISRESPECTFUL CONTENT.**   \nPersonal attacks, insults, name calling, or disrespect of any sort are not allowed here.  Sexism, racism, or any type of hate speech will result in your immediate ban.  This is a community for **ALL GENDERS** - refusing to acknowledge a trans individual's gender flies in the face of this, and will result in your ban.  \n\n**8) OPINION SEEKING, POLLS, VALUE JUDGEMENTS, OR VALIDATION POSTS.**    \nThis forum is not for simply collecting opinions - \"do you think [X] is hot?\", \"Women, do you like [Y]?\", \"What is your favorite sex position?\" and so forth.  This is not a forum to discuss your penis size, breast size, labia size, ask about other body image issues, or ask for feedback on your photos.  See the /r/sex FAQ for help regarding body image issues.  Do not post your pictures and ask people to rate or critique you.  Do not ask if given consensual sexual interests are good/bad/okay/wrong, etc.\n\n**9) ACADEMIC SURVEYS.**   \nThese require prior moderator approval. Moderators will review the question formats and will review the documentation of institutional ethical oversight (please provide). Non-academic surveys are seldom allowed.  Please contact the moderators BEFORE you post a survey or study.  \n\n**10) GENERAL RANTS, ESSAYS, EDITORIALS, VENTS, CONFESSIONS, PSAS, AND AMAS.**    \nThese don’t belong in the main forum unless you have obtained prior moderator approval. Save them for story-based forums. Or Tumblr.\n\n**11) FREQUENT/FAMILIAR TOPICS.**   \nThese are addressed in either the FAQ, past posts, or both.  In case you are confused, this means that we **do not do penis size posts here.**  \n\n**12) VAGUE TITLE/TOPIC.**   \nIf a moderator can’t identify your issue or the type of advice you’re seeking, your post will be subject to removal.  Titles should be at least several words long and adequately express what your post is about.\n\n**13) NONCONSENSUAL OR ILLEGAL CONTENT.**   \n/r/sex is for the discussion of consensual sex among adults.  We do not permit posts that advocate pedophilia, bestiality, rape, or incest here under any circumstances, nor do we allow these topics at all in most instances.  Note that BDSM and CNC (consensual nonconsent) are perfectly valid topics in /r/sex.\n\n**14) OTHER OFF TOPIC ISSUES.**    \nThis is not the place to discuss politics or religion, to seek dating advice, to ask for how to pick up women, to rant about how you have never had sex.  Posts that appear to be dedicated to stirring up arguments - particularly about hot button topics like circumcision, the evils of pornography and/or masturbation, and other toxic subjects - will be removed and will result in swift bans.\n\n**15) IMPORTANT NOTE ON DISCUSSIONS OF SEXUAL ASSAULT.**  \nSexual assault is an important and emotional topic which can be discussed (constructively) in r/sex. But posts which simply seek opinions about whether a given scenario counts as sexual assault do not do well here. This is true for several reasons, including the fact that assault laws vary by jurisdiction, and we don't encourage debates about jurisdiction issues here. Therefore, we ask that you refrain from describing a scenario and then simply asking “Is this rape/assault?” Instead, ask for specific advice: About how to respond to the scenario, how to avoid it, or how to proceed with next steps. **Posts which simply ask “Is this rape/assault?” are subject to removal without notice.**\n\n**16) POST LENGTH.**   \nFor ease of reading and reviewing, please get to the point of your post quickly — in the post title, first paragraph, etc. Consider adding a tl;dr to long posts.  Posts which are inconveniently long — over 600 words, approximately — are subject to automatic removal. Also, line and paragraph breaks are VERY HELPFUL for readers and reviewers — walls of text that lack these are subject to removal for readability.\n\nFurther information about the /r/sex rules and policies can be reviewed on the [rules page](https://www.reddit.com/r/sex/wiki/rules).\n\n***\n\n**Other Relevant Sub-Reddits:**\n\n• [BDSM Community](/r/BDSMcommunity)\n\n• [DeadBedrooms](/r/DeadBedrooms)\n\n• [Dirty Pen Pals](/r/dirtypenpals)\n\n• [Gone Wild](/r/gonewild)\n\n• [Ladyboners Gone Wild](/r/ladybonersgw)\n\n• [LGBT Sex](/r/lgbtsex)\n\n• [LGBT](http://reddit.com/r/lgbt)\n\n• [Normal Nudes](http://www.reddit.com/r/normalnudes)\n\n• [One Y Chromosome](/r/OneY)\n\n• [Polyamory](/r/polyamory)\n\n• [Redditor for Redditor (Personals)](/r/r4r)\n\n• [Relationships](/r/relationships)\n\n• [Sex Stories](/r/gonewildstories)\n\n• [Sex Toys](/r/SexToys)\n\n• [Swingers](/r/swingers)\n\n• [Transgender](/r/transgender)\n\n• [Two X Chromosomes](/r/TwoXChromosomes)",
        "num_comments": 96,
        "comments": [
            "Why can I not ask a question about birth control?",
            "[removed]",
            "[removed]",
            "[removed]",
            "Somebody has to bring the court to order \"...\"",
            "[removed]",
            "[removed]",
            "[removed]",
            "[removed]",
            "[removed]",
            "[removed]",
            "I gather r/sex is primarily meant for straight people ?  I scanned through many comments, and could only find stuff involving m/f sex.  And the other subreddits mentioned ,  seem to be about everything BUT gay sex! And subs such as gay bros etc seem a bit jaded and snarky to me. I am still exploring my sexuality, and would appreciate some decent information such as what appears here for cishet folks.",
            "Nobody said that you couldn't.  That said...\n\n>3) DON'T OVERLOOK PAST POSTS.  \nWe’re serious about this, too. Many questions may be new to you, but are very common in our community. Before you submit a post on a common topic, search the forum.\n\nThere are literally thousands of posts here about birth control.  I doubt you have a question that hasn't been answered countless times.",
            "Post to the main forum or seek another venue.  You are wildly off topic here.",
            "A major part of how we keep this community safe from unwanted contact and harassment is to *remove comments asking people to DM/chat/message them*. It doesn't matter what your intention is, they will always be removed. \n\nOffenders of this rule can and will face a ban from the sub, including for first-time offenses. This is one of the most important rules that govern the sub and failure to know this rule ahead of time is not a valid reason to violate it.",
            "Because those are the rules here, period.",
            "Dude are you serious..",
            "There is a link to contact the moderator team. Include a link or the name of the post so it can be reviewed. We are not going to moderate publicly.",
            "That has nothing to do with the rules of the sub, so this comment is removed.",
            "We really cannot police what happens outside of the public forum, and many of those creepers do not participate in r/Sex. Even if we ban them, they can still see the posts and message people. The two things you should do are 1) Report all of them to Reddit, 2) Go into your account settings and disable DMs from unknown people.",
            "You need to read more posts. The fact that the vast majority of the world's population is straight, you can simply expect the majority of posts to be about straight sex.",
            "Read the sub's description.\n\n>r/sex is for civil discussions pertaining to education and advice regarding your sexuality and sexual relationships. It is a sex-positive community and a safe space for people of all genders and orientations which demands respectful conduct in all exchanges.\n\nYes, most content in /r/sex is from straight folks, but we are open to ALL sexualities.  Gay, bi, pan, various -flexible, -curious, whatever.",
            "Np.  Ty",
            "[deleted]",
            "If you wish to debate or discuss this further, compose a PM to /r/sex.  This announcement post is mainly here to give a quick and easy reference to the rules of the sub.\n\nThat said - we do not allow incest content here.  Period.  If you don't like that, feel free to seek out other subs that do.   This is not a topic that the mod team is interested in reviewing."
        ]
    },
    "Weekly Sexual Achievement Thread": {
        "title": "Weekly Sexual Achievement Thread",
        "score": 3,
        "url": "https://www.reddit.com/r/sex/comments/1dk5esh/weekly_sexual_achievement_thread/",
        "content": "**Post your own achievement story**\n\nEveryone who feels like sharing a story about sexual experiences can do so in this weekly post. Be it a new or an old story, be it extraordinary or rather common; anything - from happiness over losing your virginity or having your first orgasm, to sharing about the amazing, kink-filled weekend of debauchery you experienced - is appropriate to this thread.\n\n**Post an update to a post you have made in the past**\n\nIf you have posted for advice about a situation in the past and wish to share an update - this is the place for it.\n\n**Please follow the rules of this community**\n\nAny sexual experience that you wish to share is fair game, as long as you follow the rules of the community.\n\nIf you use Reddit in a web browser, you'll find the rules just to the right.\n\nIf you use Reddit in one of the official apps, you'll find the rules on the About tab.\n\n*Let's hear about it!*",
        "num_comments": 1,
        "comments": [
            "Hoping it's been long enough since I commented that noone that knows my Reddit name checks 😂\n\nI had sex with a new guy this week. He was larger than I expected, larger than I've seen IRL before,  and some positions were a little tricky for it. If I tensed up at all he either couldn't move or was pushed out. Just looking for tips and tricks to make it more fluid for both of us I guess! I think the most successful position for both of us was a modified spoons style."
        ]
    },
    "Girl I slept with grossed out I ate my own cum": {
        "title": "Girl I slept with grossed out I ate my own cum",
        "score": 810,
        "url": "https://www.reddit.com/r/sex/comments/1dlghz9/girl_i_slept_with_grossed_out_i_ate_my_own_cum/",
        "content": "Hey everyone. Gonna get right into it. I’m 26 M and I eat my own cum, I can’t explain why tbh lol it’s easy for me to clean up and ig there is something erotic about it, i’m still horny after i nut too. \n\nI’ve done this since I started jerking off basically. I dated my ex for about 5 years and i would always lick it off her when i was done. once she started birth control i was able to cum inside her and from there i ate it out of her after sex. \n\nFast forward, i’ve been single and dating for about two years and have been on a couple dates and when those led to something I would wear a condom and cum in it but resisted the urge to eat it.\n\nI’ve been talking to this girl for a few weeks and we went on a few dates but yesterday my roommates out of town so I invited her over and we had sex. she was on BC so she let me cum inside her. after that i went down on her and started eating her and my cum out of her pussy. I was so turned on since I haven’t been able to do that for almost two years. \n\nShe enjoyed the eating out session but was grossed out that I did it after i came in her and saw me actively licking it. Today texted me today and asked if i was gay and told me it was disgusting. \n\nGoing forward, is this something I should warn girls about? It’s almost instinct for me to clean it up and taste it. \n\nEdit: I want to clarify about the condom part. The way I wrote sounds that I REALLY craved my condom jizz but when I was writing it I was trying to convey that cumming in the condom turned me off of from eating it that way. There really was no urge to eat cum if it’s not on or in the girl i’m with. if my cum ever shot on the bed i wasn’t going out of my way to lick the sheets lol ",
        "num_comments": 362,
        "comments": [
            "Thank you for posting in the r/Sex community. To ensure that everyone respects our safe space, we ask that you familiarize yourself with our Forum Rules and Posting Guidelines — which are visible in the forum’s sidebar, and also linked [here](https://www.reddit.com/r/sex/about/rules/).\n\n***\n\nRestricted subjects in r/sex include sex stories (which are permitted in the Daily Sexual Achievement Thread only), body image and penis-size issues, hookup attempts, common topics which are considered repetitive in our forum, and requests for private chats.\n\nTo cut back on comments that add little value to the conversation, we have instituted a minimum character requirement that will silently remove comments that fall below it.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/sex) if you have any questions or concerns.*",
            "I had one guy go down on me after Cumming in me and then pounded me again. Some of the best sex I ever had. I was a little shocked he was ok with doing it but I was 100% okay with it. \n\nGive her up and find a new girl.",
            "\"I would wear a condom and cum in it but resisted the urge to eat it.\" bro what 😭 some shit Light Yagami would say",
            "Not gonna lie, I think the act of eating it is unappealing. BUT I would never make someone feel gross by projecting my own feelings about it. I wouldn't need a warning per se, but at least a \"can I eat you out?\" before actually doing it. \n\nAnd for me, there's ways I can get around the gross feeling. For one, I would just look at it as you want to lick me so bad you don't care your cum is there and that's hot.\n\nIt's super fucked up she said those things and there's nothing wrong with you. You don't need to give some big warning, but maybe just ask first.",
            "I don't really understand if you're seeking realistic advice or not. this is a sex positive sub and let's be honest the majority of the response is here are going to be based on fantasy. \n\nIt doesn't really matter how we feel something is a double standard and dealing with reality. The reality is that when dealing with women in real life not the individuals you find on this sub. Meeting a guy who would do this is probably going to shock them. \n\nAnd it's not because it's objectively bad it's just abnormal. So unless you want to elicit a response like the one you got communication would be key.",
            "People really be out there living my dreams. lol \n\nAnyway it’s not weird. Girls give blowjobs after penetration all the time.",
            "NGL I would be weirded out if you came in a condom then slurped it out the condom as even as a woman that’s not some shit I’d do. The condom would make it taste gross. But tasting yourself isn’t disgusting. She has some clear sexual biases and even some homophobic tendencies. Not A person you’d want to sleep with again regardless. Even if it was unappealing to her, insinuating you are gay because of it is crossing a line. \n\nI think you might run into more women like this as a lot of them exist. If it’s something you really enjoy then I would definitely give them a heads up. You don’t have to be blunt and say you enjoy eating your own cum but could just tell them you love eating wet pussy after you’ve filled it with cum. Sounds sexier and also reinforces pleasure for her.",
            "I don’t think it’s gay but I also would grossed out by it.  Everyone is different in their preferences. \n\nYeah, I think this is a little outside of the usual expected vanilla sex that happens with no discussion. I think this should be discussed before it happens. It’s okay if you like doing it. It’s okay if someone else doesn’t like it. It’s probably best that both of you are aware of how each other feels before it happens.",
            "Do you go down with the specific intention of licking your own cum? Because I'll be honest, I've cum in my wife and if she hasn't cum yet, I don't mind licking her pussy afterwards, but I'm trying to avoid licking my cum if possible.",
            "God, as a woman I would love that",
            "Well that was a super immature way of stating how she felt, and projecting. Look, sexuality is such a large spectrum. It’s your thing, and good for you. She should not have insinuated your gay and I wonder if she has never gone down on a dude after having sex for a bit…but I digress. Sounds like you two are sexually incompatible.",
            "Out the condom is WILD bruh",
            "Fellas is it gay to eat cum out of vag",
            "As a girl this is something I’ve always wanted a guy to do, but it’s been difficult to find one to do it. I’m nearly 40, have had around 27 partners and none have ever been willing. I think this is great, and I don’t really understand why it would ever bother anyone, but it doesn’t seem to be very common. So it may be best to discuss it prior to sex.",
            "Bruh you don't do shit like that on a first date wtf?",
            "That's hot AF! \n\nSucks that person wasn't into it and questioned your sexuality, AFTER the fact though. \n\nSo you know, it isn't disgusting. You'll find someone who's into as much as you are",
            "Yeah mate that ain’t normal, so dont be surprised that you’re being questioned for it. It’s definitely a fetish. \n\nA lot of women, probably most, see this as cuck or gay behaviour. Even though it isn’t. \n\nYou’ll find a chick as freaky as you.",
            "My husband often goes down after sex and it’s never once grossed me out. \nThe fact she’s calling into question your sexuality for consuming your OWN bodily fluids is wild. She’s got issues and homophobia seems to be one of them. What you did is in no way a sign of being gay 🙄 \nHonestly, you are better off without her and hopefully find someone who appreciates you.",
            "To me it’s not gay but it would make me feel sick to my stomach, im queasy about cum in general (but still enjoy doing all the things) I can handle a lot but this wouid be hard for me. I imagine plenty of girls wouid be fine with it",
            "I do it too and my girlfriend loves it. None of her ex-BF ever did it - they were grossed out, but it was always her fantasy. Now I do it, lick her out, then kiss with her. Sometimes she sits on my face and smears the cum all over my face, I penetrate her with my tongue to lick her inside and get everything. Then she kisses me and licks my face. I love the mixture of my cum with her pussy juices. I can feel the taste of both. :)\n\nSo, don't worry. She's just not the right type of girl for you. :)",
            "Damn u must have been real horny bro. I respect it though.",
            "I'd think it was hot af! 🔥  Personally, I don't see the need to ask first but maybe? Either way, definitely don't let this experience deter you from doing it in the future. That kinky girl for you is out there somewhere! Lol",
            "Well, I guess that’s a reminder that it’s important to feel people out before showing off a little kink. Especially one that involves baby batter. If anything make the narrative about your lover. “Look what you made me do. Fuck it makes me want to bust in you again.” Ya know? Something to keep their head in the game, so to speak. 😏 I mean what you actually think about it, your reasons are your business. Not every detail needs to be shared. Nobody cares that you quality check your own oysters. Lol sorry she was a lame. I hope you find your silver platter princess soon. ✨",
            "FYI for future reference, this behavior is not the norm so be careful how you share it. Like seriously lol.",
            "this is not gay or disgusting, i personally find this attractive. maybe you could advise them beforehand, but i don’t think it’s that weird not to",
            "Wow she is very closed minded. My last three girlfriends or girls I've been sleeping with have absolutely gone crazy when I would eat them out after cumming in them or licking it off them after I'm done. It's just a massive turn on.  Find someone who loves it as much as you do.",
            "Tbh that’s fucking hot 🤣 just gotta find girls that think it’s sexy. My fiancé will sometimes lick my 🐱 once he’s finished inside and it excites me to go all over again!",
            "So you're pro taste yourself?",
            "Ok so I didn’t know I’d find it hot as fuck when a guy did this until a guy I dated did it, but he didn’t warn me ahead of time he was into it either. While I wasn’t bothered by it, I can see how some women would be skeeved out by it especially if they didn’t get a warning. I think it’s important to discuss kinks and turn ons ahead of sex so boundaries can be set, or decisions to walk away can be made before things get awkward or weird. So to answer your question, yeah you should probably take the time to have a discussion with future partners as a common courtesy at least.",
            "I personally think it's hot and useful when a guy cleans up after himself with his mouth (except for the condom one, I think that's kinda weird), especially since I can't do it with my sensory issues and sensitive gag reflex. I suppose you could bring it up to a new girl and maybe break up with this one? That's just what I would do though. Keep living your truth and someone out there will appreciate and love every part of you for who you are.",
            "I slept with a guy who also did this. I thought it was insanely hot",
            "She shouldn’t have said that, but I would be grossed out if you wanted to do it every single time. Like the compulsion aspect would make it pretty obvious to me that it’s not about you thinking you’re doing it to pleasure me. Especially when you’re doing it when you’re alone. And the fact that you had to resist the urge to eat it out of a condom is very strange. Condoms smell disgusting, and nothing needed to be cleaned up at that point.",
            "As a woman I eat my own cum.  I lick it off my fingers, I like putting a dick in my mouth after it’s been in me, I kiss the lips and mouth that have been eating me out…. \nGuys find that hot.  What’s the difference when a guy does it.  Nothing! It’s hot.  You’re ok with yourself, you own it, you like it, do it if it turns you on.  Maybe the fact that she thinks it gross reveals her own inhibitions??",
            "When you jerk off, you eat it? \nYou dont want to lick her but you want to eat your cum, she feels strange about it bcs she is not the reason why are you down there.",
            "Everyone is being very sex positive, which is great, but if you said this to a generic room full of people in their 20’s I think 99.9% of people would say it’s weird af to actively want to eat your own cum. \n\nIt’s not THAT big a deal, but if you want to avoid grossing out sexual partners and being labelled a weirdo, I would try to at least not look like your actively trying to eat the cum and enjoying it 😂",
            "It is a bit more out-there. I would appreciate a warning, but, also, in the moment, I'm put off by few things that get my partner going, so I might be more open to it than most.\n\nStill would like a warning, though.",
            "2 things- since you said she enjoyed the eating out, that means she really did or at least faked that she did. Either way it’s very immature and selfish to then the next day make you feel as if the whole thing absolutely grossed her out and make you feel insecure about it. Idk about yall, but if something that was repulsive to me was happening during sex, I would t be able to just fake that I was cool with it, let alone enjoy it. \nSecondly, It’s actually not “highly unusual” but in the realm of “normal sexual behavior” is definitely a more taboo activity. (And yes, there is a deference between the two). I’d save that activity for more established relationships, where you have a better idea of what she’s about/ in to or feel until you comfortable potentially being told she wouldn’t be into it without feeling like a freak.",
            "I think it’s super hot for a man to go down on me after sex, especially if he came inside of me. I don’t think it’s something you should warn girls about per se, but if it’s something you really fetishize and want to do every time, it might be worth bringing up casually when discussing your various kinks.",
            "Lmao this is wild and unusual. Find someone who digs it but the average woman will not",
            "Well, it's making the job of cleanup way easier! You don't have to use a wet wipe, a wash cloth would be sufficient!",
            "Well hey man, this doesn’t make you gay, cause you’re attracted to women. But yeah, you gotta disclose that if you plan on doing it.\n\nThis whole post gave me hot mouth, and I thought I was going to throw up. \n\nYuck. \n\nBut to each their own, you go eat that cum buddy. \n\nI’m gonna go throw up about something else.",
            "I’ve wanted to ask my guy to do that to me, so no I don’t think it’s weird",
            "geez, some people really should read the definition of what being gay means, there's no excuse when we have a smartphone and can google it in 2 minutes.\n\nwhatever the case, you're just encountering a compatibility issue here, that's all it is.",
            "God why do you place all your sexually compatible men far away from me lol.   \n\nI wish I could meet a guy that would do this, it’s so hot.",
            "Not typical straight male behavior but you do you.",
            "Here to comment that I don’t think there’s anything wrong or gross about it. Does it turn me on? I don’t know. I’ve never had a man do that to me or for me. Does the thought of it turn me on? Not really. But definitely do your thang kinky mate",
            "For her to assume you are gay bc you did this is pretty ignorant and immature. I say move on. I think she should be happy you went down on her after sex since usually men finish before women and this seems like a good solution to that. But it boils down to you two not being sexually compatible. If she’s not into it and it makes her uncomfortable, it is what it is. If you enjoy it, and it’s not hurting anyone, you should find a partner who is also into it.",
            "I think people should always talk about what kind of fucking they like before actually fucking.\n\nI also think she is rude and immature. It's okay if that's not for her. But to consent then and complain afterwards.. With words like that. Not nice.\n\nedit. I'm not a woman but I would find that extremely hot.",
            "I read it in a book once and I really want to experience that. I think it could be very hot if the guy would spit his cum in my mouth",
            "A girl asked me one time, have you tasted your own cum?  I said sure, I check it once in a while to be sure it isn’t offensive, just in case.  She went FERAL!\nDifferent strokes",
            "In all honesty, some men get offended by a woman not swallowing their cum after a head job.. if you expect us to swallow then why can’t you. She’s looking at it from the wrong the angle. \n\nShe’s not the right sexual fit for you. You can find MANY girls who are in to this..",
            "That’s king behaviour.  Cleaning up your own mess is ideal.",
            "I think this is really hot. A lot of the guys I've been with wouldn't even let me kiss them after they came in my mouth. \n\nMy bf now doesn't care about it. If he decided to cum in me then eat me out, I'd probably be in heaven!",
            "I really don’t like the way she said that to you… in no way does that make you gay. Usually guys I’ve been with have been disgusted by their own cum and won’t even kiss me after a bj even if I’ve brushed my teeth. I lick myself basically by sucking a dick or fingers after it’s been inside me so I personally see nothing wrong with this. I guess you should bring it up in the future like how I bring up the little things— I like being choked, called a good girl, etc. but I don’t want you to feel ashamed for it because it’s not wrong in any way. I’m sorry she did that to you- I know how it feels to be shamed for your sexual preferences and it’s not very nice.",
            "Wow. I agree with the consensus that eating at a girl after having cum in her is HOT af firstly. Also I don’t think that’s weird and as someone else mentioned, girls will go down a guy after he’s fucked her and no one bats an eye at that so I don’t see why the reverse is any different. \n\nShe sounds immature and lowkey homophobic and I would date someone else if it were me as that’s likely only the tip of the iceberg with her.",
            "A lot of women have a really toxic outlook on masculinity, any act like that they just seem to echo the likeness of the guys in the hockey locker room.\n\nMasculinity isn’t exclusive to treating your own cum like nuclear waste 😂\n\nSexual chemistry is important and at no point should you ever feel ashamed of what you like. If she can’t adjust, find a girl like the ones in the comments saying they have been searching years for a guy that would do it 👌🏻🙂",
            "I was in the Army for 21 years where I met a lot of guys that did some strange stuff. First I’m hearing of a guy that does this. Especially wanting to slurp it out the condom 😂😂😂. Kudos to you man. If you find the right woman I predict some goods times in your freaky future",
            "I mean. I like licking my own fingers so why not? I think it’s a bit of internalized toxic masculinity on her end. If you like it, you do you :)",
            "My current partner does this all the time, and I love it. You’re eating pussy with your own cum inside it. How on earth could that be gay if you’re a man? It couldn’t hurt to mention it when you discuss what you like, but I think there are a lot of ladies who would find it hot.",
            "There appears to be a set of men who are cuckolds that clean their wives after he and/ or  a bull has come in her. This appears to be more of a submissive act as opposed to craving semen but you are not alone in your behavior.",
            "My Fiance eats his cum. He’s the only guy I been with who does that. At first, I thought it was weird. But later, I figured it was the social construct that made me feel weird about it. I now 100% think its freaking hot that he does. Less mess for me to clean up lol. About to be married in 2 weeks!",
            "The way she went about it wasn't ok. \n\n\n\nThat said, I would have been grossed out as well. I don't allow cum in my mouth because of the texture. It's so much like snot. I probably would have started dry heaving if you did that. I would suggest talking about this before you do it next time. Other people would be just fine with this behavior.",
            "Why are people being so judgmental about it? Honestly the number of men who have a weird double standard about this is so high that I think it’s a refreshing change. Like, why would someone think their own cum is nasty but also expect their partner to swallow it? Those are probably the same dudes who would finger a girl then insist on shoving those fingers in her mouth like it’s supposed to be degrading. They’re the ones who need to get over it, not you. Nothing wrong with tasting yourself. Dudes who won’t kiss their partner after they swallow are much grosser than someone who cleans up after himself.",
            "I fuck her for a while without cuming, pull out, eat her until she cums, and then stick it back in and fuck her until I cum.",
            "My husband will go down on me again after cumming in me. He's not trying to eat his cum but it doesn't deter him from going down again. \n\nSomeone in here posted this website. If I'm not mistaken, this is one of those kinks. It's not abnormal. \n\nhttps://sexionnaire.com/",
            "It's hot, it's just not for everyone. Don't let her silly sex-negative judgements get to you. Also, does SHE ever eat cum?? If so, that's a silly double standard. A good way to find out if someone's right for you or not, though, I guess?",
            "Definitely not my thing. I did it once because I was with a woman who said I could cum in her mouth anytime I wanted but I had to taste mine first. I figured it was a fair trade. I did it once, haven't done it since. But if you're into it, and it's yours, and you're also pleasuring her, I don't see any gay factor involved....",
            "Fetlife. You'll see so many people are into that much much more",
            "“I expect you to get it in your mouth why is it weird that I’m ok with it in mine?” And if having your face buried in pussy makes you gay then fair enough I suppose.",
            "I would LOVE to have a guy do that. My most recent sex partner wouldn’t. ",
            "My dream, find the right match!",
            "Definitely should warn girls about it or just avoid doing it until you know them well enough that you know they won't care. It's a very unusual thing and lots of people are going to find it weird and/or disgusting.",
            "I (25f) think it’s absolutely sensuous as hell. I’ve never met a guy who (to my knowledge) likes that sort of thing, but I would be so turned on if it ever happened to/with me.",
            "I agree with the lady, I think that's gross asf and I would have given her a heads up before doing that",
            "There’s definitely some girls out there who enjoy that. My ex wanted to try it once and I let him after he finished inside (he’s a giver) and it was one of the hottest things ever. I give bjs after my partner is inside me and I’ve never batted an eye about it and I just realized it’s very similar to this. I’ll also kiss him after he eats me out or I blow him and neither of us care.",
            "I love having a guy eat his cum out of me! It's super hot and they're are plenty of women who feel that way.",
            "I mean personally this is one of my biggest sex goals to get someone to eat it out of me!  But I know a lot of women prolly aren't into it.  I think it's hot as Fuck tho.   Find a fem Dom leaning type and they'll prolly be all for it.",
            "I would be over the moon at that revelation! I wouldn't be thrilled about the prospect of having to share it with you- I'm greedy when it comes to that. I've tried to get some guys to just taste their own, not even eat the whole load, just a dab of the tongue, and I was met with a \"THIS! IS! SPARTA!\" Level of resistance. Keep in mind that this is something that makes both of us the exception, not the norm. Most girls will respond exactly the same way she did, so tread lightly.",
            "Tbh I would appreciate a heads up so I could have the chance to opt out",
            "Honest to god I WISH my man would suck his cum out of me",
            "Nothing wrong with it. You be you. However it is definitely beyond the realm of normal, vanilla sex. It is a kink and with all kinks you shouldn’t assume anyone else is into it by default. Discuss openly and see what she says.",
            "I think it’s hot when guys do that cum inside then eat me out after and maybe fuck some more",
            "Eating is out of a condom? I’d be weirded out\n\nEating pussy after you cum? Hot af",
            "Tbh I would be grossed out but no judgement here.. it's just that I personally wouldn't be with someone who would eat their own cum..",
            "I think the best thing you can do is ask beforehand, it depends the partner if they're into it or not, but she was so wrong for saying it was disgusting, it's not! I only wish my bf liked it, I find it so hot..",
            "I had a guy do this to me (without telling or asking me first) and it was incredible. I don’t even really like oral, but *that* was so hot, I loved it. And yeah, we had sex again right after. And then again one more time 😆 \n\nIf someone questions your sexuality for such a thing, then they’re quite confused about what sexual orientation means. Like you just had sex with *her* and ate your own cum (not another dude’s cum). Nothing about that indicates that you’re gay.\n\nI’ve come across other cum eaters in different contexts. One who even *liked* to drink his cum out of a condom. Or, he’d lick it off whatever I told him to. I made him cum on a bunch of things (in his hand, in a condom, on a mirror, table, etc), and then instructed him to eat the cum. All of which he happily obliged. That guy was a lot of fun….",
            "I think that it’s incredibly disgusting, and it turns my stomach to think about it, but that is just me.  It’s not hurting anyone, so if that’s your thing, then you do you, or at least clean up after doing you! (Jk).",
            "Highly unusual and maybe you should lead with that….Then see….If a guy did that with me, I’d be very shell shocked….Maybe I’m just not woke😂",
            "I mean this is r/sex, no one is going to say don't do it. But anywhere else, it's gay and disgusting.",
            "My ex-wife loved  me eating my creme pie. It got her hot, but her favorite  reason is she  never leaked  walking to the bathroom  after sex.",
            "Man you are sick as f*ck",
            "What      The      Fuck.",
            "Ooh fuck, honestly the first time I'm hearing of this and I'm just as baffled as that last girl. I mean, to each their own, but as a 26M, I find that extremely gross ngl. Women swallow all the time, so I'm certain they'll have a different perspective on this. I've heard of guys that suck their own dicks just never really thought about whether or not they finish in their mouths. Lol idk, feel grossed out even thinking about it. I'm not saying don't do it, I lose nothing if you do. I'm just surprised, that's all.",
            "I’m so sorry you got this reaction, you kinky delicious creature! She’s super repressed and prudish to be so judgmental. Every erotic book I read the men clean up after sex and it is hot as hell. Yes, they lick up their own cum off their ladies. This is a common kink so much so it’s in almost every spicy book I read. You’re not weird at all. I wouldn’t warn them about it. Just do it and be you. If you get this reaction, write them off. I guarantee you someone soon will think it’s hot as hell😉",
            "This is highly unusual and I would imagine that the majority of women will find this to be a huge turn off. I would advise you to consider what is more important to you, having a much, much larger dating pool, or eating your own cum.",
            "A little weird but we all are, you do you.",
            "[deleted]",
            "I actually want to try this with my girlfriend but I’m not sure what she’d think",
            "Since my wife won't even let me cum in her mouth I wouldn't try it with her, but I would definitely love to suck it up and then snowball her.  Nothing better after a good meal then desert!",
            "If I had a partner eat me out after sex while I'm still horny and wanting more, I would probably find it hot and a big turn on. But having my partner lick himself off my stomach or something would probably put me off. I can't put my finger on why.",
            "I’m sorry you fucked a homophobe.",
            "Her loss! What a homophobe",
            "If I want a/my woman to be willing to swallow when I cum in her mouth, then I don't have a problem tasting/eating my own cum. And I definitely eat her pussy before and after I cum in her.",
            "I had a routine with a past gf where I would kiss/fondle,  finger bang, fuck with a condom, and then eat out, maybe fuck some more. It became second nature to just do that routine all the time. Fast forward a few years I had another  gf on BC so we would have condom less sex and my routine would kick in. I definitely ate her out and my swimmers the first time and I didn't notice anything on the taste spectrum. But she was kind of turned neutral by the act, we didn't repeat it. I have been told I smell and taste sweet. Admittedly I have taken a curiosity taste and wasn't repulsed by the taste or texture. I'd probably bake a cream pie and eat it if a girl was really into it. But I don't see myself actively pursuing it right now",
            "You like to recycle ♻️. Nothing wrong with that.",
            "welp, I think its hot when my husband does it..\nshrug",
            "As a guy it’s my fav thing to do with my wife. Find another woman!",
            "Holy shit, that is so hot.\n\nHowever, not everyone may think so, and some women may be actively turned oft by it.  I feel like you deserve someone who will appreciate it.",
            "I think it’s hot!!! Obviously a preference thing, but definitely not a “gay” thing. Keep eating cum woo!!!",
            "*sigh* i want my bf to be into this one day",
            "You are a lucky guy! I tried to do this a lot. But PNC always threw all my excitement to drain.",
            "Not gonna lie, this sounds gross. But who an I to judge, you do you.",
            "Who am I to deny you the pleasure? Get busy! 😋",
            "I love to eat my creampie. My gal likes it because not only does she get her pussy eaten again but less mess on the sheet especially if she sits on my face.",
            "Girl “cum in me” guy “I’ll eat it out of you” pause for reaction.",
            "No worries. It’s not thaaat abnormal. I wouldn’t think it’s a big enough deal to warn a girl about. If they gross out and make a big deal about it, move on to someone else.",
            "Go for it love yours thoughts",
            "It’s a closed loop system.",
            "I mean, to each their own. I have never done it and wouldn't do it as it grosses me out (yeah, yeah to those people say it comes from my own body, but so does piss and crap and I'm not about to go there).\nLook bud, when you go out in real life and off of reddit, you'll find out a good portion of women would likely give a similar reaction. It doesn't make anything wrong with you (other than the urge to slurp it from the condom, which tbh is a bit odd), but that's your thing, along with a bunch of others here on reddit. It's something that you like and should find someone that doesn't mind it or likes it.",
            "It definitely comes across as a bit submissive or something, I can imagine why a woman would find this a turn off.",
            "I have no problem going down on her after and I love when she snowballs me",
            "To me it seems like a wildly inappropriate remark she made to you and perpetuates negative stereotypes. You aren't sexually compatible.\n\nThe good news is, there will be millions of women put there who will not only be ok with this, but will really get off on it.",
            "Nothing wrong with eating cum out of a pussy! My wife requested it the first time and it was a huge turn on and of course  she Loved it! Plenty of girls that enjoy it",
            "Then find a new one that has an additional orgasm on sight when you eat cum.",
            "It doesn’t bother me but I think it would take a trusted partner to share that with.",
            "Thats something you probably should have mentioned. Personally as a straight guy I don’t even like to see girls with it in their mouths it just look like snot to me lol",
            "Dump her! You're way too advanced for her. Find your people and have fun...",
            "Why would her first thought be to text you and ask if you’re gay?? 🤦🏼‍♀️ I would be so turned on if a man was okay with going down on me after sex, but that’s never happened because they all think it’s totally disgusting🙄 it’s just her, I would never make a man feel bad for that. Men always want us to lick their fingers or give them head after being inside of us…",
            "Get rid of her! She doesn’t deserve you! I’d love it if a guy did that to me. That’s so hot and passionate. Then a nice “thank you” kiss after you’re done. Whenever I watch porn, this activity is involved. Lol \n\nYes please!",
            "I’ve had a guy take his cum out of my vagina wit his mouth and give it to me in my mouth I thought it was hot 😭 everyone likes different things!",
            "I haven’t read all of the comments but there seems to be a wide range of opinions. Ultimately, OP, you do you. “Warn” partners? Maybe the wrong the word. \n\nMy partners know my views on my ejaculate. I see it as me losing some of my energy, so if she doesn’t want it, I take it. I have had everything from curiosity, to neutral, to feeling it was hot. \n\nThere was one time when I found out a partner wanted me to cum in her mouth. I asked what she was going to do with it. She looked at me quizzically and said she would spit it out. I said I would take it from her and when she started to voice her disgust, I put up my hand and said, “Hey. That’s a part of me.” Oops. I probably shouldn’t have said that. She looked shocked but…..we still had sex. I didn’t cum in her mouth though.",
            "It’s not even gross, women give blowjobs after penetration all the time. I have had a guy eat his cum out of me once and it was fun to try and not weird at all, I actually enjoyed it . She could’ve set a boundary and just declined it next time but instead she decided to be rude about it . I would not continue having sex with her tbh",
            "Personally dont think its something you have to warn them about because you dont go out of your way to eat your cum… unless its a kink then maybe yes but again everyone will react differently so find a new girl who’s going to enjoy this. i lowkey want my partner to do this EVENTUALLY 👹",
            "Anyone who eats their own cum is weird AF! End of story",
            "Nothing wrong with it. It’s fine it’s fun and it’s sexy. It even helps clean up. Getting grossed out by it is kinda strange. Somehow we do all these other things but something like that is weird? But a woman can do it ? lol \n\nMaybe I’m too mature to look down on someone like that but whatever",
            "Ive only had one guy Ive had sex with wouldn’t kiss me after I swallowed their cum or just gave them a blowie. I got rid him after that time he told me it was gross for us to kiss after.\nHe better glad I didnt spit back on him.",
            "This is a bit weird and you should ask before doing it with a new partner.",
            "Sounds like she might be prejudiced and may be sexually incompatible with you. If you’re friends, aside from lovers, help her work out her issues. But… Maybe you dodged a bullet?\n\nGenerally speaking, you should make sure you are sexually aligned with your partner before going to bed with them. I know, easier said than done and some things you won’t find out about until you have sex. It’s inevitable. Reading the room and asking before doing things is pretty damn hot and a useful skill. You might discover that your partner might not be into you eating your own cum by mentioning it before or during sex and respect that boundary, then decide if that makes them incompatible with you or not. \n\nBtw, there are plenty of people out there who will find your creampie eating super hot, myself included, don’t settle!",
            "nah man, you're good. Shes just wack.",
            "I asked a partner once why he didn't go down on me one time before round two... He said, \"I didn't feel like tasting that much of my cum\". I was like \"oooh.. so sometimes yes , sometimes no!...\" Hot!!!! I didn't even realize that going down on me after a round would mean tasting his own juices...",
            "Sounds like it’s a personal problem tbh cause any type of sex/intimacy can get messy and at times nasty & disgusting \n\nI mean what do you expect ., y’all are exchanging body fluids common now the fuck is the problem 😂\n\nLol I woulda responded back .. \n\n“bitch did you cum or nahh?”",
            "I love it, sharing is caring 😋",
            "I don't think you have to warn people. Sure some people will be turned off by it and unfortunately this girl was outright judgemental and for some reason homophobic, but imo it's a double standard that women tasting their fluids is considered sexy but for men it's \"gross\". I would think most reasonable people would be indifferent to this if they weren't turned on by it?",
            "I think that’s so hot EXCEPT drinking it out of the condom. That’s a little much for me",
            "This sounds mad different than kissing a girl who just swallowed your cum this is some sort of fetish that I would want to be warned about. I would say a majority of girls won’t like this , as it’s odd that you would eat it yourself. You said you’ve done this since you started masturbating and that to me sounds like something way bigger than just being okay with it getting near or in your mouth after ejaculating with a partner. I’m sorry but I just find it really off putting and odd. But other girls commented that they think it’s hot so🤷‍♀️ there’s hope",
            "Dude eating your cum is the ultimate delicacy. ✨",
            "This is definitely something I’d want a heads up for - eating your own cum is quite the niche",
            "In my opinion, anyone who jumps to “are you gay?” when someone does something they don’t understand… they need to do some serious growing up. Such an immature comment.",
            "Oh, plan C birth control.",
            "I deffinately think although asking is welcoming maybe ease into sex before you pull out the trick cards. If this is the first time you had sex Maybe all the bells and whistles were a little much.",
            "Was almost sick myself reading this post you weirdo",
            "This is the wildest thing I’ve ever read on this app.",
            "Pass her up, she is obviously kink shaming and I thought we were above that in 2018",
            "Ngl maybe I’m not ‘freaky’ enough for this\nBut this would horrify me too 😭\n\nBut find a girl who matches your freak!!",
            "Had a great sex partner who would taste his own cum and it would always weird me out, I never complained but…. Meh, not my vibe, kinda gross, super weird.",
            "It sounds like an interesting idea but after orgasm i don’t think i would be turned on enough to go down eating my own cum",
            "She's not for you. Find someone who enjoy it",
            "Girl here. Funnily enough I’ve had one boyfriend who came in my mouth and then he immediately made out with me. Initially I was surprised but holy shit it was a huge turn on for me. \nI think it is hot cause he isn’t immature about it. Adventurous, wild, down for anything attitude.  I’ve never came across anyone who thoroughly enjoys licking up their cum(male at least) so it’s really neat to come across your post",
            "Ive been in the position where a guy came in me and started eating it/me out. Ngl I thought it was weird and definitely took me out of the moment. BUT it doesn’t make you gay and her response is awful. For me personally.. it’s not very sexy. But to each their own",
            "Most people don't do it so yeh you should kind of communicate about it, maybe don't do it so early on",
            "Swapping cum is hot! But it’s def not everyone’s thing lol",
            "Woman here. \nPersonally big fan of eating my own cum and also a big fan of guys eating their own cum out of me. Also a big fan of people who do autofellatio or different positions to eat their own cum. So to me what you've described is very hot and I wouldn't have been grossed out, I would have called you hot asf. \n\nBUT most people, especially guys, aren't into eating or even tasting their own cum. \n\nI don't know if you've heard the saying \"a real cook isn't afraid of their own serving\" but there's so many people, on this sub as well- commenting under posts of girls complaining about how their boyfriend won't kiss them after them having given them a blowjob.\n\nI think it's more of a societal norm and disgust of tasting something your own body created. I mean (most people at least) wouldn't eat their own shit or drink their own piss. Some people won't even hold the wound in their mouth after having cut their finger- because it's disgusting to ''eat/taste\" your own blood. Nobody licks their sweat from their own armpits. It's all fluids that our body creates that go out of body and in most cases we let them go out. \n\nI think a big part is also the fact, that it's different areas. As in if you swallow your own spit, that's okay. It's normal. Spit is in your mouth and your mouth is on your face. If a tear runs down your face and you lick your lips afterwards and taste the tears- that isn't disgusting. It happens. So taking cum- which is created in a different area- to a whole different area of your own body ( To your face- your mouth specifically) is you doing the action purposefully. Which then if course, isnt normal or natural. But its weird. \n\nI think really, you have to decide for yourself if you want to stop doing it, continue doing it or warn people about it. \n\nPersonally I wouldn't warn people about it, because some people will defenitly back off the moment they hear something like this but maybe in the action they'll like it. Or maybe before you go down on the woman, you can warn them. Some might decline, some might say \"fuck go  for it\". It will be a new experience for some, probably most though.",
            "Usually your gonna have to work up to some freaky shit like that lool if you don’t know if she’s at that level you probably want to wait",
            "I do the same thing. Started doing it on my own when I was younger (because yeah, it’s easy clean-up, and there’s nothing gross about it honestly…especially in a world where everyone claims to eat ass, lol) and then with my second partner & every other since.\n\nI’m 40 now: some people go “interesting…” others go “that’s weird,” and some go “that’s really hot.” And THOSE 3rd types are the partners to stick with :)\n\nDon’t spend too much brain-energy doubting  the goodness of what you enjoy—when you can spend that energy instead connecting with people who like you as you come, naturally (pun very much intended).\n\nAnd there’s no need to warn people about it *unless* it’s for your own comfort, so you can avoid them dropping dickish judgements on you after the fact. \n\nIf they’re down with you kissing their body, and they give you permission to finish somewhere—you’ve already got their consent. “Hey, do you mind if I save you the hassle of cleaning his towel?” is a charming intro, but also totally optional. \n\nAll the best; stay hydrated.",
            "Well I'm in the, I find it super sexy corner.  I would maybe have a discussion about it with whomever you do it with before hand.  I don't think a lot of people are that sexually open.",
            "I’m surprised how many are kink shaming you here. It’s unusual, but not that weird. It’s like a sexual version of picking your nose and eating it or biting your nails 🤷‍♂️",
            "Crosspost to /r/eatingowncum",
            "This is really hot! It’s her loss, you’ll find someone that enjoys it as much as you do!",
            "Bin her, no normal person would jump to assuming someone’s gay just because they do that",
            "I wouldn't be crossed out . Atleast it will be easy to clean up after 🤣🤣",
            "Nah, it grossed me out.",
            "I'm sorry but if she is questioning your sexuality based on something like that then I don't think you would want to date her anyways because of what else she might question you for. Girls like that have no idea how gay men actually work and just assume based on stereotypes. Nothing about this makes you gay, and even if it did suddenly mean you were gay there wouldn't even be anything wrong with that to begin with.",
            "She ain’t the girl for you bro. The end. Also people who ask if women/men are gay for tasting themselves are the most close minded fucks … I like being fingered then tasting the fingers or kissing and tasting myself after head and I had a guy once who was like eewww you like to taste yourself? Are you a lesbian?",
            "Give her up and find a girl that’s into it. My boyfriend eats me out after he finishes in me and it’s easily my favourite part of the sex.",
            "I’ve lapped up my lady’s creampie a few times. One gf thought it so hot she talked about it for weeks and told her friends too. \n\nI also kiss them after they take my load in their mouths. Don’t mind snowballing with them.",
            "I've never known a man to do this and it also makes me feel sick. A genuine reaction. But each to their own.",
            "I literally read your post out to my partner and he couldn't listen, \"no please stop, I don't want to hear any more\". He won't even kiss my mouth after he's came in it 😅 so you are a rare dude!",
            "Oh my godddd I will lose my mind if men go down on me and eat their own cum out of me. It's happened once and I still fantasize about it, no one seems willing to. There's someone for everyone man, don't let this girl get you down about it",
            "Yea when I do it my girl says it’s the hottest thing ever. So you’re just not sexually compatible with her right now.",
            "A woman who asks you are gay after you have unprotected sex with her, and eat her pussy eagerly, is an idiot. \n\nMove on, don't give that judgemental chick another thought.",
            "She sounds really ignorant",
            "I will never understand these kind of statements. In what world is fucking a women supposed to be gay? \n\nTo be fear though, the only people I know who eat their own cum are either gay or bi. Maybe gay and bi people are just more open to talk about it then heterosexual. Still, how can you ask a guy if hés gay if he just ate you out? The gay people I know who slept with women almost never gave the girl oral sex.",
            "You should get consent before engaging in any sexual act or kink with a partner. You can either bring it up beforehand and gague enthusiasm, or bring it up at the time. Either way, knowingly engaging in kink and trying to trick someone into participation is not okay.",
            "When I used to cam model back in the old days when it first became a thing, guys requesting me to watch them eat their own cum was probably in my top 5 requests. So no, its not weird. Its actually pretty norm. Also if it makes you feel better, ever since I started masturbating (I'm a biological female), I too lick my fingers when I'm done because its quick and easy clean up. If was in you before, no reason it can't go back in you is how I look at it.",
            "Yer good.   It's hot.  I've done this countless times",
            "Eating it out of a condom would be too much for me. But I personally find it hot when my boyfriend goes down on me after he finishes. \n\nHe’ll also finish on my toes and he’ll lick it up. Now I don’t mind that and it is a turn on for me in that instance. \n\nI would let that girl go and find someone else. I’d ask how they feel about that after hanging out with them for a bit. See if they’re open to it cause I know it’s not a common occurrence with most men. \n\nBtw it doesn’t make you gay lol.",
            "Not gay I wish more guys did this",
            "I had a guy that would like to nut on my face/breast then lick it off. I thought it was gay at first but I was eventually okay with it lol",
            "It came out of you, my love and it was gloriously delicious.  You should try some.",
            "Guy here- I always liked licking my cum and not sure why.  Lick it off a woman or inside the woman.  Masturbate on a clean surface and lick it up.   Squeeze the end for pre-cum. One time drank from my condom.  I like to taste my cum.",
            "Why tf would she think that’s gay. Rude and immature thing to say…she’s not the one for you man.",
            "Seriously..I had one guy do it and he inserted himself into the spank bank hall of fame.. almost 10yrs later and I still go through the play by play😭Kam..if your reading this..you ruined me🥴🫡",
            "There’s plenty of us who would be equally as turned on by it as him… definitely find a new girl who’s more sexually compatible",
            "It’s a closed loop system",
            "I fully support this comment. I think I actually got a little moist reading this.",
            "I did that before. It was fantastic.",
            "For real. I was with OP until that part.",
            "I just spit out my water, take the upvote lol",
            "Drake puts hot sauce in his condom. So, recipe ideas for this guy, I guess",
            "That played in my head to the tune of the potato chip scene 😭",
            "I’ll take my cum and EAT IT",
            "He definitely need to chill or test his sexuality",
            "I should probably ask next time but to me it’s second nature. you let me inside you so let me pleasure you and clean it up. i love pussy so i’ll usually eat a girl out before pants come off lol",
            "I think its interesting the most upvoted comments I'm seeing  are NOT very positive about it and consider it gross even when they're saying \"Hey! You do you!\". If that's happening here then its NOT going to go down well in the real world.\n\nI'm also really interested in the double-standard here.  Its fine for women to do it.",
            "I knew a guy whose wife wouldn't. I felt for him because he thought it was taboo and super wanted her to do it. Lol he was shocked to hear that it's super common.",
            "To me, there is a difference between giving a blow job after penetration and you taste yourself. I'd find it hot if I guy went down on me after he came inside me. I wouldn't however find it hot if he was actively into his own cum lol. I can't explain it other than one is actively wanting something and the other just so happens to go with the process.",
            "Mine wouldn't. She wouldn't even kiss me after I go down on her. Mind you I won't kiss her after BJ either as I can't even think about tasting my own cum.",
            "[deleted]",
            "So if I don’t want my dude chugging his own cum, then I’m sexually biased and I’m a homophobe? ✏️ ok got it thank you.",
            "[deleted]",
            "i’ll usually eat a girl out first before i take my pants off. the cum eating is just the added benefit",
            "As a guy I love doing it",
            "that’s what i’m asking!!! lol",
            "I've always wanted to creampie then go down on her but after i cum it doesn't sound as appealing lol. In the moment im like \"fuck yeah let's do it l\". I think I'd have to be in an exceptionally horny mood. Im not against the idea though.",
            "This here is where I’m different, the discussion would throw me off. I’d be like dude just do it hahaha, but the act wouldn’t throw me off. I’d be totally into it. “Again please” hahaha",
            "In the past I e had trouble finding female partners who get turned on by this. My ex wife enjoyed it but my current wife doesn’t even let me go down on her and so it’s not a problem.",
            "This is my kink. I love cunnilingus and eating my partner out after coming inside is super hot and a real turn on. Keep me going all night!",
            "27 is crazy work lol",
            "I think it’s hot as hell and I love doing it",
            "definitely not stopping, i eat my cum almost everyday when i cum so",
            "i think it’s very hit or miss with girls",
            "yes i love tasting myself mixed the flavor of a wet pussy i just bred. would you not be turned on?",
            "bro do u even eat pussy",
            "so you think underlying this is cuck behavior? interesting",
            "congrats he sounds like a great man",
            "> figured it was the social construct that made me feel weird about it.\n\nThe world will be so much more peaceful if all people realized their prejudices stemming from social constructs and worked on undoing them",
            "There's a big difference between kissing your partner after a blowjob and slurping your own cum out of a used condom.",
            "Why are you trying to flip it around and say that men are the ones with the problem? This post literally says his girlfriend has the problem with it.",
            "i do it for many reasons. 1. it turns me on 2. cum + wet pussy tastes amazing 3. i like to eat pussy/ please women",
            "would you be open to still be eaten out after sex but i avoid eating my cum? or can we only eat pussy pre- nut",
            "interesting. thanks for your opinion. i’m curious why my age adds to the grossness?",
            "I'd say it's a minority of guys who do it and women who are cool with it or turned on by it, yes. However, I would also say it's not at all rare. Just more common among people who are a bit kinky or just very comfortable with their sexuality. Honestly I think it's only fair for a guy to be willing to eat a girl out after he cums in her, if he is one of the majority of men who would want a woman to let him cum in her mouth.",
            "Ive actually been in the process about how to ask my hubby to do this hahahahha it mkes me nervous to ask.. even after 15yrs.",
            "“Highly unusual” is a bit of an exaggeration.",
            "She’s grossed out that he’s a man tasting semen period, hence her asking if he’s gay. It’s really narrow minded thinking.",
            "thank you! people are being so weird saying cum eating is gross when it’s “normal” for girls to swallow it. why can’t i eat my own fr",
            "i feel like there is something primal about it? especially if i cum on their stomach i’ll lick it off them, it’s my way of cleaning her up and taking care of her",
            "Your sample is \"guys who pay cam girls\", generalising any finding out from there to the wider population is meaningless",
            "We should meet back up....sincerely  Kam 😉",
            "yea i gave a guy head and after he came in my mouth, he made out w me so sloppy…it was really bizarrely hot and erotic. no one has done it before or since.  and i think about it still sometimes. it was like 10 years ago. i didn’t think he was gay or anything. guys have fingered me and told me to taste myself before sooo like. idk. it was hot tho",
            "Be the Kam you want to see in this world.",
            "Pookie! Knock the cobwebs off this thang!",
            "Omg mine too!! He also did this thing where he slapped and rubbed his dick agents my opening. No idea why that made me go crazy but OMG. 😓😓😓😓😅😅😅😅",
            "> definitely find a new girl who’s more sexually compatible\n\nDepending on where he lives, that may not be possible. I live in Bulgaria which is definitely not as progressive of a country and there's still a solid amount of homophobia, and I lick up my cum after masturbation like OP (however it's purely out of convenience, I'm not turned on at all by it). I intend on not telling any future partner of mine because statistically, since I'm already struggling when it comes to finding women to date, I'd just be alone forever. I had told my ex about that over text and she was so shocked that she almost got irreversibly turned off from me because of that.\n\nI'm also not gonna tell about two kinks that I'm occasionally (piss) or rarely (scat) into because of that very same reason. I will be perfectly happy and satisfied if I never try these out with a partner in my life, I intend to take that to the grave with me. And the shock/disgust about these is *almost guaranteed*, sooo I'll just never mention them to anyone unless she brings up that she's into either of those first",
            "Why? seems perfectly happy with what he's doing and what he likes.",
            "Sometimes I clean up my husband after, but for me it's the subservience that turns me on and that's how I get over it. But that girl was just way out of line. If my husband did that for me, even if it's because he liked eating his cum, I'd just lay back and enjoy it.",
            "I’d expect nearly all random hookups to be grossed out by this and, yeah, not surprised she question asked about your sexuality. \n\nTo be clear, I don’t think it’s gay, just not surprised that a rando would react like that. \n\nYou might wanna wait til you’re more familiar with a person and have a sense of them before doing this, otherwise I expect you’ll encounter more interactions like this.",
            "Girls tasting themselves same as he is doing. I think it’s just some internalize homophobia",
            "I they mean that girls taste themselves on guys all the time so this is the vice versa",
            "Not a homophobe/sexually biased for not liking what the guy did. The issue was insinuating the only reason he could like it, is bc he had to be secretly gay. Bc thats a false assumption she put on him.",
            "That person is speaking about the one specific girl that this man is speaking specifically about; she told him he was disgusting and asked if he was gay. Hope that clears that up for ya.",
            "That’s not what I said at all. You don’t have to like it. It’s fine to not find specific sex acts appealing. If you call him “gay” because *he* likes it then yes that’s homophobic. Tasting semen doesn’t make a man gay.",
            "I do. Slight wetness left on a penis after PIV is not anywhere near the same as mushing your face into a hot load of jizz and slurping it up. \n\nAnd even if you think it is, I don’t think it is.\n\nAgain, everyone is entitled to their presences and boundaries.",
            "Not everyone wants to taste themselves before, during, or after sex. Why do people ask this question as if it's just something everyone does and the people that don't do it are the minority?",
            "Ok then if you're doing it on purpose then it might weird some girls out.",
            "Same creampie cleanup and cum kissing are kinks of mine.",
            "It’s definitely not lmao she’s got some weird homophobia",
            "It's only gay if you enjoy licking cum from or off another man, just keep reminding yourself that.",
            "Accusing you of being \"gay\" for doing it is homophobic, but you may be surprised at how pervasive that sort of sentiment is. You'll often hear the same thing, from men and women, about men who enjoy being rimmed or pegged. Toxic masculinity isn't exclusive to men. \n\nMy opinion: You do you. If it's something you'd rather talk about first, or just do it and see how things shake out, that's your call, but do it with the knowledge that it may not always be well-received, and might even be a deal-breaker for some women. I don't say this to be discouraging, rejection and sexual incompatibility are just a part of dating. It's better to find out early so you don't become too emotionally invested. Get back out there and find a more open-minded woman who won't yuck your yum. Just look at the comments here, plenty of women think that's hot af. There's nothing wrong with what you're doing, it's just a little kinky.",
            "Im the same way it sounds hot until that post nut clarity kicks in and you want nothing to do with it.",
            "Sounds like you experienced post nut clarity.",
            "But didn’t you say you also do it after jerking off too?",
            "There's a difference between eating pussy after you've nutted and straight up eating your own cum.",
            "Its not because there’s some weirdos telling you that is okay that you can think it is actually okay. This is literally the first time i am reading about that. Like kissing your partner after a bj its ok, but straight up eating your own cum after masturbating is straight up gross",
            "Dude you’re not making that comparison. Yeah I ate my wife’s pussy last night for like 30 minutes until she came twice. My cum was not in it. You’re making a false comparison. Just because I think what you do is unsavory, doesn’t mean you shouldn’t do it. Like I said at the end, you do you.",
            "Doubtful because he developed this behavior back when he was just masturbating when most of us were trying to figure how to get rid of the stuff!😎",
            "Personal experience, yo. OP is rising above.",
            "I figured all of that, I'm just saying it grosses me out and it would gross out a good majority of women too. This sub is not representative of the real world",
            "It doesn't, bro. I think it's gross regardless of age. However, kids do gross stuff sometimes, thats how they learn. In your case, it highlights that you've been doing this for quite some time. I wasn't referring to your age, btw. I was saying I'm 26M (we're the same age) and shared how I find this particular practice bizarre to say the least.",
            "Good luck, worst he can say is no thanks",
            "Lol really? How many dudes are out here eating their own cum?",
            "Yeah honestly, I don't think cam girl simps are representative of the general population.",
            "That infers the wider population is not the same as people who pay for adult content. From my personal and professional experience, theres not a difference. Guys are just more open about their kinks when they're paying someone to indulge them. They're not a different group of people. It's the same guys you find anywhere.",
            "Wait, I'm Kam. You're not Kam!",
            "...This guy. Love your work my friend 🙂",
            "Exactly.!! It just occupies a different dimension of intimacy. I have never felt closer to a person than at that moment...all I desired was to kiss him afterward..kinda like a “thank you”!🫠🫣I melteddddd",
            "I don't know. A guy eating pussy sounds pretty gay.\n\nOkay joke aside. It's literally his own cum. If it was another man's that might make it different. \n\nI mean does beating your own dick make you gay?",
            "I agree. This is definitely not common.",
            "But using the words “gay” and “disgusting” in the same message in regard to what he does is homophobic.",
            "So, no, you’re not. Unless you behave like the woman in this post in how you respond to it.",
            "Oooh yeah that makes more sense and does clear it up. Thank you!",
            "Not only that, but sometimes people are okay with action A which is kinda-sorta similar to action B. But not okay with action B itself. \n\nPeople are allowed to like and dislike whatever they want. I don’t really understand trying to draw parallels between sex acts when they are different. Or pretend that just because you’re okay with one means that it only makes sense to be okay with another.",
            "Yeah but insinuating that he’s gay because of that is crazy",
            "> and might even be a deal-breaker for some women. I don't say this to be discouraging, rejection and sexual incompatibility are just a part of dating.\n\nDepending on where he lives, it may be a dealbreaker for the vast majority of women. I live in Bulgaria which is definitely not as progressive of a country and there's still a solid amount of homophobia, and I lick up my cum after masturbation like OP (however it's purely out of convenience, I'm not turned on at all by it). I intend on not telling any future partner of mine because statistically, since I'm already struggling when it comes to finding women to date, I'd just be alone forever. I had told my ex about that over text and she was so shocked that she almost got irreversibly turned off from me because of that. Nope, not risking that again\n\nI'm also not gonna tell about two kinks that I'm occasionally (piss) or rarely (scat) into because of that very same reason. I will be perfectly happy and satisfied if I never try these out with a partner in my life, I intend to take that to the grave with me. And the shock/disgust about these is *almost guaranteed*, sooo I'll just never mention them to anyone unless she brings up that she's into either of those first",
            "Even when im not horny I think about it and want to do it. I will arise above the nut.",
            "So if that's how you feel about guys tasting/eating their fluids, then does that mean you share the same feelings about a girl tasting herself? \n\nLike, if you had sex with a woman and then afterward if she tried to go down on you, you'd call her gross?",
            "what’s not ok about it? i can get people saying it’s weird but gross?",
            "I agree. Ain’t no guys eating their own cum. Fucking disgusting",
            "Presumably, FAR more than are willing to admit it.",
            "I've only ever dated two guys and they both have eaten their product at some point. Neither have been as seemingly obsessed with it as OP (which, don't get me wrong, it sounds freaking *hot* to have a guy cum in me and immediately lick it out) but they both have willingly done it during sex and during solo time.\n\n So no I don't find it weird at all, but it seems like I'm in the minority of open-minded people on this sub.",
            "There are entire subreddits devoted to this subject. Sex shaming is not allowed here.",
            "Interesting perspective. I respectfully disagree.",
            "Kam I am green eggs and ham. Load I blowed and licked like jam.",
            "Obviously OP is Kam. Y'all just pretenders.",
            "I'm Kam and so is my wife!",
            "yes it was just a totally WOW sexual moment, idk if it could even be recreated fully because it wasn’t like it was hot because he was specifically tasting his own cum. it was just this intimate passionate energy moving between us. so it’s not something i could just ask my next partner to try out with me really. it’s not the performance of the act but the intimacy expressed by doing the act in the spur of the moment. \n\nand like the total opposite of the fear of a guy having ‘post nut clarity’ and rejecting you to some degree, or things being awkward as you orgasm and come to your senses, or you just feel a little vulnerable getting dressed again after such a raw experience… so many guys would avoid even kissing you close mouthed right directly after cumming in your mouth. even if they love you so much. \n\nbut i guess it was just the way he didn’t hesitate, it was like nothing about it had been something he was mentally degrading me for (like in a madonna-whore way maybe?) \n\nit was also this confirmation immediately that we were both equally presently in the moment experiencing it, there wasn’t any hang up about the sex ‘ending’ and therefore the intimacy also ending. ?? ect. idk how to fully explain it. but it was really raw and sexy and erotic. like he thought i was so sexy and desirable and he wanted to kiss me so bad even after he just came in my mouth. (when in some culture, men find oral sex so degrading, they won’t have their wife do it as they respect her too much, and believe it’s only something sex workers or gay men do) so you know, that type of attitude ranges all over. and i guess this was just such a tender and mutually respectful and loving way of viewing performing oral sex. \n\nthis was a guy i was seeing for a couple months in college, and im very happily married and sexually satisfied, and indeed have shared this story with my husband! but yea i do still think about this moment sometimes, not even in an arousing way like as masturbation fantasies or something, but more in fascination way. like i just thought it was a really pure and powerful and natural expression of sexual intimacy. \n\nlol if you read this far thanks for reading! i smoked a j and kinda rambled a little (lot?) there",
            "You don’t need to convince me, I’m just saying 95% of people he encounters will likely feel some kind of way about it. \n\nMost people aren’t as open minded and sex positive as the users of r/sex.",
            "> I mean does beating your own dick make you gay?\n\nWhen I'd asked my ex if a guy sucking his own dick is gay (no, I can't), she said yes, and when I brought up this analogy, she just said that it's \"different\" and couldn't further elaborate as to why",
            "People are really glazing OP eating his cum and making it seem like people who don't like it are weird or homophobic lmao like no I'm not a homophobe because I don't want to see a guy eat his cum and no I don't go down on a guy after he was in me. I don't even like when a guy goes down on me and tries to kiss like no everyone wants to taste themselves and people need to stop acting like everyone does. \n\nI really hope people outside of this sub don't come off this post thinking a ton of women like the act of a man eating his cum, because outside of here most people would think they're a weirdo for being into that. They'd probably give a reaction the same as the girl OP is/was dealing with",
            "Crazy? Idk. Not guaranteed that he’s gay, but it’s a natural question. The average straight dude isn’t trying to eat cum. The idea is physically repulsive to me. \n\nIt’s an objectively weird kink. I have literally never heard of another guy doing it before this post. Fine if you want it, but this sub is useless for advice. Y’all act like the weirdest stuff is normal.\n\nSexuality is a spectrum. I just assume all of the guys calling themselves straight who are into this or pegging or that kind of stuff, just actually think they are straight instead of more fluid. Truly straight guys don’t actually think about or want to do this kind of stuff. \n\nThere’s nothing wrong with it. But it’s definitely not straight.",
            "Do you. Just go for it immediately after and don't give yourself time to think. You've already thought. You want it.  It's you. Just do it.",
            "Valid point. But the my only rebuttal is that there’s quite the difference in consistency and taste. Its not an apples to apples comparison",
            "Tasting? He is making a meal out of it. What part of kissing your partner after a bj being okay didnt you get?",
            "i think you would eat it if u didn’t have post nut clarity",
            "How was I shaming? Calling something highly unusual doesn’t mean anything about shaming and having dedicated subreddits doesn’t make it the norm either.",
            "I never knew Kam liked green eggs and his own yam. But honestly, if you want it in her mouth what’s wrong with it it being in your own?",
            "I do not like deviled ham, I do not like my Dennys grand slam. I know me and what I like. My name is Kam, and I like to blow my load and lick the clam!",
            "This sub kinda irritates me sometimes. It’s supposed to be “sex positive” but that often amounts to advice that doesn’t really go over well in the real world. This OP is 26 so he should have some experience. But there are people who post on here who are young and naive. And sometimes rainbows and sunshine for every sex based question is actually more harmful than helpful.",
            "Regarding taste and consistency and the perception of those two senses, that varies greatly between people. No one's ejaculates are going to taste exactly the same; plus, one person might hate the taste/texture of someone's fluids while another person might love it (I've experienced this one personally). Also, bisexual people exist and they don't seem to mind the difference.\n\nSo if you're saying that eating cum is gross because it has a different taste and texture to female fluids, that implies women who eat cum are therefore gross when they blow a guy to completion.",
            "Just saying, if you want to keep a girl you need to go sober on the jizz juice 😂",
            "There is no “norm” when it comes to sex. That is the great thing about it. And opining (without reference) that there aren’t many guys doing xyz activity does help reinforce the idea that it is weird or disgusting.",
            "Okay how about this. Eating cum is gross IN MY OPINION. How bout that? I’m saying subjectively, that I find it gross. I’m not telling him not to do it, geez. My wife also find cum gross and you know what? I’m happy to not have her eat my cum, it doesn’t bother me. I’m allowed to have my opinion. There are a lot of folks in this chain that clearly agree that it’s a bit gross. Let it go\n\nEdit: I would also add, he mentioned cumming into a condom and having to resist the temptation to slurp it out. I want you to tell me you don’t find that pretty gross.  That is objectively gross. 99/100 people would likely agree.",
            "lol.  Do you NOT see how many women in this thread would literally love it, and some even fantasizing about it?",
            "it’s easy clean up bro, she’s gonna have to get use to it",
            "There are norms… just like with everything in existence… gay people aren’t the norm they make up a small % of the population… that doesn’t make it bad… your immediate attack and defense is screaming insecurity to me…. I’m not judging you or anyone else…",
            "This is a very sex positive sub so ofc a lot of women are going to like it, especially since many of them haven't seen it. I promise you the people that actually like that are the minority in the real world",
            "Reminds me of a video clip I saw on twitter of a monkey jacking off and eating his jizz. I puked inside my mouth. This is not a thing",
            "Maybe she will. I just don’t see the pleasure in it for a guy",
            "She doesn’t have to do shit.",
            "Not a thing to you….. Dude, you can’t seriously tell me you’ve never ONCE stumbled upon a porn where a dude did it?\n\nEdit:  Humans are also a smart naked monkey, so it shouldn’t be to terribly surprising.",
            "No, and I watch a lot of porn."
        ]
    },
    "Why are dicks darker than the rest of the body ?": {
        "title": "Why are dicks darker than the rest of the body ?",
        "score": 400,
        "url": "https://www.reddit.com/r/sex/comments/1dlh8pg/why_are_dicks_darker_than_the_rest_of_the_body/",
        "content": "So I (F20) noticed this at my bf (M19). He is white but his dick is really dark, its like already black you could literally say its a bbc. He is kind of ashamed of it but i think it looks extremely hot and i like it. Idk if its normal maybe some of you can give me an answer ?",
        "num_comments": 134,
        "comments": [
            "Thank you for posting in the r/Sex community. To ensure that everyone respects our safe space, we ask that you familiarize yourself with our Forum Rules and Posting Guidelines — which are visible in the forum’s sidebar, and also linked [here](https://www.reddit.com/r/sex/about/rules/).\n\n***\n\nRestricted subjects in r/sex include sex stories (which are permitted in the Daily Sexual Achievement Thread only), body image and penis-size issues, hookup attempts, common topics which are considered repetitive in our forum, and requests for private chats.\n\nTo cut back on comments that add little value to the conversation, we have instituted a minimum character requirement that will silently remove comments that fall below it.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/sex) if you have any questions or concerns.*",
            "https://www.healthline.com/health/why-is-my-private-area-dark\n\nMelanin. It's common in men and women and can get darker with age.",
            "Partially melanin, and partially vgasculature closer to the skin- same reason many women's external labia, asses, etc., are darker (pro-tip, bleaching only gets rid of the melanin, so often things get more purple if you bleach.)",
            "I have a full body suit with a hole in it that I use for tanning.",
            "I'm Latino and my shaft is much darker than the rest of my body - the head of my cock is quite pink though. It's normal and to do with melanin levels in the skin on his shaft. I think it looks really sexy against pale white skin and makes a really hot polarisation! He shouldn't be ashamed of it, it's very normal.",
            "Testosterone darkens the skin round the erogenous zones and even under the eye . Not for all but alot.",
            "Do not call your white bf’s thing a bbc 😂",
            "I would say its quite common for the dick to be quite a lot darker than the rest of the skin. Whatever the cause is, is - i feel - of less importance. What is important, OP, is to realize the amount of power you have in having an effect on how he feels about his penis. I'd suggest to let him know often, whenever youre feeling turned on by him/love the way his penis looks (whenever youre genuinely feeling that). As his sex partner you have a lot of influence on his own perception of his own penis. \nMy ex and i loved in each other fully the things we felt insecure about ourselves and both became much more confident from often (genuinely) reaffirming how much we liked these things about each other. (Not in a pitying tone, as if you feel sorry for him, but in a genuinely turned on manner.)",
            "Most genital area is dark",
            "Do you mean white skinned as in is he latino or white middle eastern, or caucasian man? I’m latino and I’m white but my dick is brown",
            "Reddit is full of photos of completely uninteresting genitals. And this, where it would have relevance, is here without any photo documentation.",
            "Lol it’s hyperpigmentation. Everyone has some sort of melanin in them. And the natural chemicals and hormones in your body can make it happen. But also maybe he isn’t fully Caucasian?",
            "I'm Asian and mines is also darker than the rest of my body, albeit not by much, but it's definitely common. My ex, who was extremely pale (English girl with Irish descent), also loved the contrast against her skin!",
            "The same reason vaginas get dark as well, is normal.",
            "This happens to women as well darling",
            "It depends on background ethnicity too. Just like why some women even white women have darker pussies and others have pink ones. It goes back to genetics. Not all white guys will have darker dicks.. mostly its mixed white guys will have darker dicks. Im one of those guys. I have some native american and some middle east/arabic blood. But i am pretty white.  But u compare me with a german blonde blue eyed dude, my dick is gonna he tons darker even if our face complextion may be similar (depending on if i see the sun or not lol)",
            "Is this before or after anal sex?",
            "It's normal, but first time I saw a man naked I didn't know that was a thing so I was pretty shocked 😅",
            "It's a little known secret that every day we have to provide it with minimum one hour of sunlight, otherwise it starts to wither.",
            "In that case. Women are also look fair but bikini areas are preety darker than other part",
            "Melanin is produced alongside hormones so on sexual organs and nearby to them, it's typical to have darker skin. Same applies for your butt, inside thighs, and mons pubis.",
            "Different skin, different shades.  Your lips, for example",
            "I’ve noticed that about myself and never knew why.\nMy genitals are a much darker color than the rest of my skin.\n\nI think it looks great.",
            "It’s dirty and needs that old hauk tuah.",
            "That’s actually quite interesting. My cock is same as me commenting so I can get an answer lol",
            "Not a single top comment correcting OP on the usage of \"BBC\"  just validated all my feelings on this sub. \n\nSelective performers.",
            "It’s a sign of sexual maturity. Men and women’s pubic areas turn darker after puberty. Biologically he is an adult male now",
            "Because it's been beaten so much.",
            "Maybe he got a dick transplant.\n\nOr maybe his dick is actually just three children stacked on top of another in a trench coat. Happened to me once",
            "wear & tear darkens skin",
            "bc were always pulling on it",
            "Not everyone but many.  Usually about the same color as his nipples.",
            "When is sunbath , I expose only my dick for that tanning.",
            "Mine isn't. It's just the same colour as the rest of me.",
            "Tell that to gingers",
            "Been wondering this for ages since my dong never sees the light... its chocolate in colour while the rest of me is albi o as heck",
            "Gingers on the other hand..",
            "If he takes a melanin secretagogue it can turn your dick black by the time the rest of your body looks tan",
            "It’s funny what happens down there. I once had a girlfriend see me bend over naked and she literally shouted, “Oh my god!  How is your asshole pink?!”  It’s been damn near 30 years and that still makes me laugh when I think about it. She was SHOCKED that not every asshole was brown. She was even more shocked when I told her not all pussies have brown lips like hers. Then she got all self conscious about it because she’d never seen other ones (remember 30 years ago - porn was mostly just on video and in magazines). I wish I’d never said anything, because she really became paranoid. I was just trying to say everyone is different down there. I’ve got really “white” junk and a pink butthole while most people have darker junk and brownish buttholes. And I made the same comparison on her saying a lot of women have uniform vanilla vaginas and a lot also have “sexier ones” with some character with pigmentation changes. Yeah, she didn’t buy it when I said  “sexier ones” like hers. I wonder how she is now because I totally (and wholly inadvertently) gave that poor girl a pussy complex.",
            "He is drinking a-lot of coffee 😂",
            "Wow, I thought I was unique as I never asked this question, I always found it quite funny. An ex said how’s the hell is it so black. I tan easily,  it it’s very dark.every day is a school day",
            "I always say it’s like lips but maybe he’s Spanish-white and not just white cuz for it to be that dark and he’s European is crazy.",
            "I think people have darker genitalia just to make us look there.  Like it sticks out bc of this most people have a darker whatever they have than the rest of there body",
            "My wife says my balls are darker than a ubangi s. I white too",
            "Mine is the same color as the rest of me",
            "Maybe he’s a white black guy.. or a black white guy 🤔",
            "As a black woman, that’s two-toned or hyperpigmentation.",
            "Say no to anal bleaching… ?",
            "My partners is a cute pink color!",
            "Because they’re evil",
            "Mines actually paler than the rest of my skin tone but I’m a ginger!!",
            "Old wives tale the weiner gets darker the more they use it lol. But yea I've heard this from an old lady",
            "If he does a lot of training. Stretching and pumping than this can be the cause. I also got a black dick over time.\nIt's especially noticeable when flaccid.\nErect, it's still many shades darker.",
            "Mine matches the rest of me...",
            "hes not washing it properly, or too many previous partners",
            "My lady called me a big bearded Viking man. Then she took my pants off and said I had a big fat brown dick and was in awe  🫢 she loves to suck this big brown fat cock and tells me she likes how dark it is in comparison to her milky white skin. She loves it!",
            "Meanwhile I’m over here with vitiligo on my groin only, losing melanin 🙃",
            "Thank you",
            "Thank you, I will not contemplate bleaching my ass anymore",
            "That's a disturbing image seared into my brain now!! Thanks a lot...lmao",
            "When I was a kid I always thought it would be so funny if someone did this. 😂 but like a whole body suit with one leg out",
            "I thought you were just welding with your fly down",
            "It's like a portable glory hole!",
            "Just putting on sun screen? Yea right....![gif](emote|free_emotes_pack|facepalm)lol",
            "It is quite a sexy contrast haha",
            "Lol, why being Latino is relevant here?",
            "I dunno. Maybe it will do the fishing forecast.\n\n(Anyone that gets this joke and isn't British gets forty internet points).",
            "Well I mean, if it's big and almost black..\n\nBKBC.. Big Kinda-Black Cock\n\nBDC.. Big Dark Cock\n\nBMRC.. Big Melanin Rich Cock",
            "I tell him that i love it and that its hot very often. First of all because that's genuinely my thoughts and also because he is kind of ashamed of it.",
            "Caucasian",
            "Yeah i guess its the same as with labias. His one is pretty extreme though",
            "I know i can speak from experience",
            "You made me \"stupid\" laugh!!! lolol",
            "Oh no, don't get them started on the perineum sunning!",
            "Hahahahahahaahahahah underrated comment",
            "This exact thing. I asked my doctor about my vagina a few years ago and this is what he told me.",
            "My man got that ghost dick going on.",
            "…..yeah. I got a thing with men with that on their stuff. Only met two. Found it fascinating and enjoyable.",
            "In a woman with this!! You would never know that I had vitiligo if you didn't see me naked.",
            "Same here.\n\nThe way I tell it, I've got a Neapolitan dick. Chocolate at the base, vanilla in the middle, and a strawberry on top.",
            "Does it shrink the whiter it gets?\nAsking for a friend…",
            "Bleaching ass is a strict no no, medically.",
            "Meanwhile, I'm into it.",
            "A leg is odd....but way less disturbing! ![gif](emote|free_emotes_pack|joy)",
            "It is! Especially during penetration and seeing the contrast of it slowly easing squeezing in. Plus I love it when whoever I'm with starts creaming cause it just stands out and looks amazing against my dark shaft.",
            "and it might have a public service remit!\n\n(But yeah; don't call it that!)",
            "I am British and I don’t get it. Do I lose 40 internet points? Lol",
            "Why do you think it's hot?",
            "What does that mean to you? Can he be Armenian? Italian? Romanian? Spanish? Portuguese? Greek? Slovenian? \n\nAll of these groups have wide variation in pigmentation that overlaps with North Africans/Berbers/etc and with many Pacific Island groups.",
            "I'd be interested in the results of a DNA test for him. Not everyone who thinks they're completely white actually is.",
            "😂 this is why I said maybe he is t fully Caucasian because it’s normally more prominent with people who has ancestry of different ethnic backgrounds",
            "Did you two just become best friends?!",
            "This right here just proves there is someone out there that can/will like you no matter what hangups someone may have. Never even knew this was/could be a thing. Good for you and those two men and the future ones you meet.",
            "It’s just so stupid and unnecessary. What have we become. Getting labia snipped off too.",
            "Whatever makes you \"tick\" lol It doesn't move my clock but I won't judge!! lol",
            "They meant the third leg",
            "idk why but i would definitely read a smut written by u",
            "You lose your citizenship. I'm Australian and I got it.",
            "He is fully though",
            "Can you define Caucasian please?",
            "I'm so stealing that expression!",
            "You take the pictures in your head that you want and I'll take mine...![gif](emote|free_emotes_pack|joy)",
            "Thanks! Interestingly enough, I am working on my proper first story which I'm planning to publish on Amazon soon! When I write I always like to describe actual experiences I've had and to me the authenticity in this will always be much more satisfying than a fictional story.",
            "You two have to swap now. I hope the Brit will get used to commuting via kangaroo rides and the Australian is all right with never using salt in their food again.",
            "Can’t be so sure now days. Could be something from generations back.",
            "You don't really know that for sure.",
            "Why am I being punished for being knowledgeable? Also you owe me 40 internet points.",
            "We all descend from one African man who lived about 60,000 years ago, if that's what you mean.\n\n23 and Ancestry start their marker clock at 45,000.",
            "No that’s not what I’m talking about. I’m saying what if his great grandfather or grandmother is one of the people that was able to pass as Caucasian and everyone over looked it.",
            "You buy into meme stocks and you think humanity is only 60k years old? Lmfao thanks for some laughs this morning"
        ]
    },
    "Should I keep sucking after he cums? ": {
        "title": "Should I keep sucking after he cums? ",
        "score": 1036,
        "url": "https://www.reddit.com/r/sex/comments/1dl8hhu/should_i_keep_sucking_after_he_cums/",
        "content": "I’m newish to giving blow jobs but I’ve learnt that I quite like giving them. I love to make my bf cum in mouth. When he comes should I keep going and let it drip? Should I keeping going and swallow (I’ve never swallowed before)? Should I stop? \n\nEdit: update - thanks for all the advice guys. I kept sucking (with consent) and swallowed (as a surprise). It was fun! My favourite part was him squirming about. ",
        "num_comments": 356,
        "comments": [
            "Thank you for posting in the r/Sex community. To ensure that everyone respects our safe space, we ask that you familiarize yourself with our Forum Rules and Posting Guidelines — which are visible in the forum’s sidebar, and also linked [here](https://www.reddit.com/r/sex/about/rules/).\n\n***\n\nRestricted subjects in r/sex include sex stories (which are permitted in the Daily Sexual Achievement Thread only), body image and penis-size issues, hookup attempts, common topics which are considered repetitive in our forum, and requests for private chats.\n\nTo cut back on comments that add little value to the conversation, we have instituted a minimum character requirement that will silently remove comments that fall below it.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/sex) if you have any questions or concerns.*",
            "Suck till he cums and then keep going for the soul.",
            "Keep sucking until he stops you.",
            "I keep sucking when he starts to ejaculate and switch to slower and gentle sucking when he finishes until it gets too sensitive for him.",
            "I like it when she slows way down as I cum and keeps it in her mouth until I take it out. Swallowing is nice. Have fun!",
            "Don’t stop till he tells you to! Sometimes I even go a little after that lol just cause it’s fun to see them squirm",
            "I prefer my girl to keep sucking but have heard where’s its too sensitive for some guys.  She usually stops after 5-10 seconds of me squirming but I would like longer.  Just ask him, in my case squirming doesn’t mean stop but his could be.",
            "I usually suck my bf while he's cumming and then a little bit afterwards. He likes it when I clean up.\n\nBut some guys like it when you just keep going and others want you to stop immediately (or so I've heard). I'd just wait for him to tell you to stop like everyone else suggests!",
            "One of the best girls I ever hooked up would take my cum all over her face & mouth then keep licking. She stopped sucking after the cum was finished but switched to gentle licking of my dick & balls literally until I went soft. She’d continue usually for about 4-5 minutes after I came. She’s in the Hall of Fame",
            "Definitely don’t stop as soon as he starts ejaculating! \n\nKeep going until his orgasm is completely over unless he asks you to stop sooner than that.",
            "Personally, I get too sensitive after cumming and I prefer to stop. Ask him what he prefers!",
            "Keep going till he tells you to stop….make him come again.",
            "Keep on sucking till he tells you to stop. My bf is always extra sensitive after coming and I can make him come 2 more times. Once he told me he almost died 🙈. And i love to hear his crazy moans.",
            "They'll tell you when to stop or ease up. And yes, please Swallow",
            "Ask him what he would like the most. \n\nFor me, it’s not always the same. \n\nSometimes, deepthroat while I cum down the throat. \n\nOther times take just the head and suckle it while I cum in the mouth. \n\nOther times, pull out for a beautiful cumshot on the face. Or shoot in your mouth from the outside. \n\nAnd always, swallowing is insanely sexy. \n\nIn the end, do what he likes, but *edit: only* what you’re comfortable with.",
            "Keep suckin till you taste soul.  Then, depending on the guy, that's when you stop.  Some wanna die that way.",
            "Try swallowing at least once, you won't know until you try it 🙂",
            "For me the most amazing by a long margin is if she keeps sucking, maybe just a little more gently all the way through the orgasm and swallows every drop as soon as it enters her mouth.  The sucking sensation as I'm cumming combined with the way her whole mouth feels as it contracts around me when swallowing is other worldly to me.",
            "When she keeps sucking after it’s gone I feel like Marv on home alone when he gets electrocuted",
            "Yes keep sucking and swallow if you like doing that. When a lady cleans up the cock after cumming it is super duper hot.",
            "On behalf of most men, please swallow , as long as it’s enjoyable to you …",
            "You’ll definitely want to swallow, and don’t stop sucking or stroking until he tells you. Keep up the great work!",
            "keep going until he says stop",
            "Yes, if you’d like to be in the group known as completely awesome girlfriend. He’s lucky",
            "Keep sucking. His actions will let you know if he is sensitive to the additional stimulation.",
            "Slow down after he cums, suck more gently and come to a stop, swallow cum or let it dribble out over his cock. Continue gently massaging the shaft with your hand.",
            "only if you wanna a plan a wedding",
            "This mostly comes down to preference. You should ask him how he likes it.\n\nPersonally I like her to keep going until I am all the way finished, and then a little more after, gradually slowing down. Then making a big “plop” sound as her mouth literally breaks suction with my dick.\n\nThen I like to hear her gulp it all down like a good girl ;)\n\nBut also it can be sexy to see it drip a little from her mouth where she has to wipe it a bit with her hands, like she just ate something messy but delicious.\n\nThat’s just me though. Every guy is diff. Learn his preferences. Once you learn his body, you can periodically experiment with stuff to see if there are new ways of blowing his mind that he has never thought of before.",
            "Some people go buck wild for continued simulation after orgasm and some people find it painful. A good portion of both find it uncomfortable to express which side they're on in the moment. \n\nYour best bet for getting 100% certainty on these answers is to bring this exact list of questions to your partner before you engage in oral together. \n\nIt's likely that your partner will find talking about it in detail before the act to be exciting, and you might find some new things you'd both like to explore together!",
            "If you're in a committed relationship, and it's moved to being sexual, you should be comfortable enough to ask your partner.\n\nIf you're not comfortable enough to ask him, honest question:  How can you share your body? No offense intended.",
            "I don’t have specific recommendations, but just keep in mind that it’s a good thing to do for a caring and loving partner… but you don’t owe him anything. I’ve read too many comments that it’s not a proper bj if she doesn’t swallow, she doesn’t really like him if she swallows, it’s subpar if she doesn’t deep throat, etc, etc. If you want to try swallowing, try it. Try whatever you feel comfortable with. But don’t do anything because of outside pressure or feeling that you owe him anything.",
            "It gets extremely sensitive after an orgasm. Sometimes painful",
            "I like it when a girl takes my dick out and sprays herself with it while jerking and licking.  But like a crazy person who loves it so much!! 😂🤣😭🤣😂😅",
            "Some guys get too sensitive to keep going.  I’ve heard it’s an extreme, overwhelming orgasm if you continue as he’s cummin, but it takes time for them to get used to it & to that level of sensation.",
            " Don’t stop let him know how much you’re enjoying it by moaning a little once he cums just keep sucking on him and drain his balls completely while swallowing he’ll love you so much for it.",
            "Sometimes you just gotta give them the Hawk Tua 🤣🤣🤣",
            "It depends on the guy. Some like to be “cleaned up”, some if you keep going it’s too sensitive, others like you to show the handy work (open up and show the load), others want nothing to do with that and swallow(or spit) as soon as you can. Usually an experienced partner will tell you. If they are bashful or inexperienced try different things until you figure out what he likes. BJs are primarily about him so read him.",
            "When he comes, you help him then you stop just keeping him in south then wait one or two minutes and you start again slow if you want",
            "The swallow part is up to you. I swallow only my husband's. Ask your bf what he likes and be open. These are great questions and part of building a relationship.",
            "If you can swallow, it’s amazing for the guy. But otherwise slow down after he cums as it does get sensitive.",
            " Discuss it with him, guys have different preferences on the appropriate time to stop sucking",
            "Ask him what he prefers.",
            "When he says stop sucking you stop",
            "Everything reminds me of him 😞",
            "Ask him. For some men, the sensitivity increase after coming makes it hurt. For others, it's intense but enjoyable. Let him tell you.",
            "Keep sucking but very slowly because after we cum the gland become too sensible. If you want to add a plus, show him the cum in your mouth while you see him to his eyes and then swallow",
            "you could just ask him",
            "If you swallow, they will love it.",
            "No dear lady, job is done ✅👍🏾",
            "If you want him to propose, you should.",
            "https://www.reddit.com/r/shestillsucking/s/4umpmygJbd is a thing for a reason",
            "Keep going until it's too sensitive and he stops you and it's mind blowing.\n\nStop whenever else and it's still fantastic.\n\nAs long as you're enjoying yourself and into making him feel good, he'll be happy with it.",
            "yes you should, that’s how you take their soul",
            "Do whatever YOU enjoy doing and he will probably like it too.",
            "Careful around the head as it gets super sensitive for 30 seconds or so! But sealing lips around the shaft and slowly moving slowly up and down can extend the pleasure, just try to avoid touching the head with your mouth or tongue until it is no longer sensitive.\n\nAfter as long as you want to keep doing this, or if he tells you to stop, then pull off. Most guys enjoy swallowing as you are expressing acceptance of him and his cum which is very nice, but this is your choice. It is extra hot to show it in your mouth and make a show of the swallowing action. Cum won't hurt you and many consider healthy, but the taste and consistency can take a bit to get used to for some women.\n\nOne of the best experiences I even had was a woman who gave me a blow job and then kept it in her mouth while slowly getting me excited again, then went into full BJ mode to make me cum a second time after about 30 minutes. It was amazing.",
            "Youre gonna take his soul if u keep going. Do it",
            "FUCK YES. SUCK THAT DICK UNTIL HE RUNS FROM YOU.",
            "I always, always, always remember this.\n\nMy girl constrained my hands to a chair. It was just enough where I lift them some but not where i could stop her.\n\nI wanted to wrap my fingers into her hair and fuck her mouth after she made me cum.\n\nRIP to my soul…it floated away to the back of my eyes. \n\nSometimes Ill see a strap or see her licking lips and it makes me get hard and I want that same tingly sensation",
            "Definitely keep sucking or atleast stroking with your hand until he pulls away or stops you... \n\nSwallowing is totally up to you. Don't let anyone tell you otherwise. ;)",
            "One of the fun parts of head is feeling them cum imo. I like to kinda relax my throat and mouth and gently suck and swallow as he finishes to make sure I get all the cum and then follow up with some light kisses and licks directly on head just to make him sweat. \n\nBut like others said it's a preference thing and can vary by partner so gauge reaction and communicate for best experience.",
            "Keep goin and swallow. It doesn't even feel like a blowjob if you don't swallow",
            "I only wish I still received BJs. Haven’t had one in years. My wife hasn’t even touched me sexually in I can’t remember when.",
            "Bless you for letting him cum in your mouth. That’s the one thing missing from my sex life that I desperately want. :( \n\nSwallowing and letting it drip from your mouth are both super hot in different ways. See what he prefers! And after that’s all done, he’s not going to want a lot of stimulation, but it’s very hot if you keep working his dick to squeeze every last drop out. Lick it up, of course!",
            "I believe the answer is \"Where would you want your partner to stop should the roles been reversed?\" You wouldn't want them to stop abruptly just after you yourself climaxed, would you? It's kinda the same thing. More than likely, when your partner has had enough, they will likely remove their penis from your mouth. The only equivalent would be as if anybody stimulated or toyed with your clitoris for a longer than a reasonable period of time, just to put it into perspective. As long as you're comfortable with everything, simply ride this train til it comes of the tracks, and it will 🤣🤣🤣\n\n👉 envious and jealous over here. I wish it were me 🤪",
            "I wait til he's done then slowly suck and lick super gentle because he is still sensitive.  It sends him to the moon.",
            "Ask him. Some guys need you to stop immediately, some guys need you to keep going, some need you to continue, but softer etc. \n\nHe might not feel comfortable just coming out and telling you, as he might not want it to seem like a criticism or mood killer. \n\nSo find a time to casually ask when I give you a blow job and you cum, do you like me to keep going, or stop, or something in between? And if he says it's always different, ask him to just tell you at the time - keep going, stop, softer, harder, faster, slower etc. \n\nCommunication is a marvelous thing.",
            "I get super sensitive at the tip. My preference is for her to stop sucking, but leave it in her mouth and milk the shaft and the base with her hand.\n\nHeaven.",
            "Listen to me carefully, always always take his very soul. Keep sucking. My go to is same pressure while he's cumming then ease up the 1/2, then if you are using your hand remove your hand and keep sucking at 1/4 pressure and maintain until you are good or he flops. You can keep going but he may get overstimulated post flop so depending on the dude you may not be able to suck just lick or stroke with your tongue while he's in your mouth. You can stop of course at any point.",
            "You could let it drip out onto your tits.",
            "I do believe that that's clearly an audible. The reason for the next step is to factor in how horny you are. I am very happy to hear that you are happy to see, taste, smell, enough to know that your body and mind have a special relationship with my heart and mind that I have been appreciated by ejaculating my happy swimmers and reaching an orgasm and being able to enjoy my own blissful pleasure without having guilty ideations associated with solo pleasure and pleasure is not felt by the talented combination of the non reproductive organs donor. Well I feel like I could have done better with less messing and more than not being able to build myself up to a more productive cumshot.",
            "Every guy is different. Talk. Ask. I love nothing more than for a girl to swallow and keep going but some guys will involuntarily knee you in the head if you do that lol",
            "Haha hell yeah! Why should you? Make him squeal",
            "til he says \"please no more!\" or you get tired.\nGod bless you (& I hope he realizes how fortunate he has to have you as his g.f.)",
            "I usually slow down significantly because during and after it's really sensitive",
            "You could, you can...\n\nBut, if the guy says stop, you should respect his resquest. \n\nIn my case, it's not comfortable when she keeps sucking (or licking for that matter )after me cumming.\n\nYou can suck less intensively after he cums, and decrease intensity afterwards.\n\nJust do what you feel that it's better for both of you.\n\nNotice the \"feel\", you should always \"feel\" the other person's reaction.\n\n The best head is the one that it's great for him,.for you, for both!\n\nNotice the \"great for both\".\n\nJust keep practicing, feeling, until you perfect your technique, and having pleasure (you too) for giving him pleaure\n\nGood **ck\n\n :)",
            "Slower and gently, don’t focus on the head too much it’ll be really sensitive",
            "Absolutely. Same with handjobs. I often orgasm quite a bit longer than I ejaculate. They don't finish at the same moment. He'll tell you when to stop or it'll become obvious he is very sensitive.",
            "Damn girl. You ask the right questions. Lol.",
            "So you need to keep the same rhythm while he’s cumming around 10-20 seconds from when he starts ejaculating and then start to slow down and don’t grip as much. I always swallow unless I’m feeling weird on my stomach.",
            "Maybe you should ask him?",
            "Whatever you both want and like. I suggest you two experiment all the things you wish and make a bucket list.",
            "You know how it feels when you’re getting eaten out and you cum and they don’t stop licking sucking? That how it feels for guys in their head. But keep sucking take their soul. Don’t stop till he pulls you off",
            "If you like it, keep going, play with your thongue and keep rubbing slowly… success guaranteed ! Have fun and show him how he can please you too",
            "Most people just stop but I suggest to continue, he'll stop you. I think most people like it when you swallow after but it's up to you. It's the fastest way to get rid of it.",
            "Definitely have good communication. There’s something extra hot about letting the cum drip down and out of the mouth while continuing during and after the orgasm. And if you like it swallow the rest or just kinda play with it all after too. At the end of the day whatever you enjoy and your partner enjoys do that. If it’s all on the table make it a surprise on the finish.",
            "Like the antidote is at the bottom🥰",
            "If he doesn’t push you away, keep going.",
            "You’ll know when he wants you to stop, lol.",
            "Keep going but go real gentle. You might get what my ex called “porn dick”. \n\nIt’s when he goes rock hard again but his dick is sort of numb to it. She’d get me back up after the first shot then jr.. would stay up for as long as she needed. She needed a long time at a certain pace to orgasm from penetration.",
            "yes to all of the above",
            "Ugh I'm so jealous that so many men actually get head 🤣",
            "Yes. Until he pulls you off. If he squirms and moans, you're doing it very right.",
            "Only if he can take it. Most men get extremely sensitive after climaxing. Try it but if he stops you, stop, and don't take it personally.",
            "Ask him. Not like during the BJ, but in a calmer moment. Ask what he wants, prefers, and maybe more importantly, cause I’m sure it’s not a hard and fast rule he’s going to apply to every BJ, how he’s going to indicate to you his preference, for that specific time. \nIt could be done but grabbing your head and making sure you don’t move, it could be he says what he wants, etc., it could be indicated a lot of ways. You won’t know until you ask ;-) communication is paramount in sex!",
            "I love to and try to, but hubs gets super sensitive and it actually becomes painful for him so I cant",
            "No, it can be so sensitive after that it almost hurts in a way. Stop when he's cumming and stay latched on it. Then a couple very slow head bobs up and down on it to soothe him. \n\nTrust me.",
            "Go till he cums in your mouth stop sucking then show him his load in your mouth play with it, put your fingers in it suck your finger then swallow",
            "As a dude, spitting or swallowing are both totally great as long as you dont stop at the first sign of cum.  That ruins the O, what you do after? I honestly couldn't care.",
            "Yes. Whatever you did so well to get him there keep doing it!",
            "My girlfriend used to keep going and swallow. Now she’s my wife and starts to walk away at the sign of the first spurt.",
            "Keep going. My bf gets over stimulated when I do it and I like when he squirms",
            "Depends.... I know if you hit the tip just right it doesn't do me anything but everyone is different..... Edit: I'm glad I'm not the only one here lol",
            "The guy will usually stop you when he can’t take it anymore. Thats when you stop.",
            "Suck him until he cums. As he's cumming and after, keeping him in your mouth, use your tongue on the underside and \"milk\" him into your mouth. Try to stay away from the underside of his cock head. It is hyper sensitive after cumming. Always swallow. \nGood advice coming from a man who enjoys getting a blowjob, and also loves giving a blowjob.",
            "I prefer when they keep going. Huge turn on",
            "Suck like you're trying to get the last part of milkshake left at the bottom of the cup when you gotta keep moving the straw , and definitely swallow . That's how you go from gf to wife,  that's why I married my wife , epic head game",
            "Honestly, just from what your telling us, suck his damn soul out lmao. When he cums down your throat, swallow and keep tryna get the cum out if you know what I'm sayin",
            "Have You asked Him how He likes it best, or You just came straight to the internet? Lol",
            "Keep it in there till you fall asleep with it in your mouth, limp.",
            "I mean, you could just ask what he prefers...? Everyone is different.",
            "Swallow and try to get another nut",
            "A lot of guys like a GENTLE motion on their dick with your mouth as they blow their load and right after. Everyone is different though. If I'm going at say a 8/10 pace before he blows, I tone it done to maybe 1 or 2 out of 10 👍🏽",
            "if both of you like it then go for it🤷🏼‍♂",
            "Keep going, the penis is super sensitive after orgasm and it feels amazeballs",
            "It really depends upon the person, same as blowjobs themselves. Some people love Hawk Tuah manic head-bobbing blowjobs. Others, like me, do not — I’m really sensitive and those kinds of blowjobs hurt like hell. When I cum, my ideal is my frenulum being stimulated with the tip of a tongue, pretty much like one might with a clit (for those who are so inclined) but I don’t like full mouth on my head at all. Too much overstimulation. \n\nSo, like so many questions on this subreddit: sure, read what people here say, but _ask the person you’re actually having sex with_. There’s no general rule about what every penis-haver loves. It can even vary depending upon context. \n\nHappy blowing! Go well!",
            "I'd say ask him. It's best to communicate those things as some really like it and others don't. Or just go by reaction. If u keep going and they don't pull u off then keep going",
            "You should alway keep going, take it from us he’ll love it",
            "Do whatever he feels comfortable with. Some men like it but others may find it too intense. I enjoy going and then swallowing the cum and keep sucking as their knees begin to tremble and they can’t take anymore.",
            "Ask him what he wants.",
            "Suck all the demons out of him, til he speaks in tongues..\n\nJokes aside, suck until you're satisfied. I hope he's just as enthusiastic \nAbout going down on you too, that would be cool.",
            "Your call, at that point, you're already awesome. Bless you.",
            "For some men, the gland (head) gets very sensitive during or right after an orgasm. But that doesn't apply to the shaft. You can use your hands to keep squeezing that shaft like it's a toothpaste tube that you're trying to get the last little bit of toothpaste out. That feels great for both those that get a sensitive gland and those that don't. And while doing that, a an occasional quick flick with your tongue on the gland can be nice, even if sensitive, just don't overdo it.",
            "Yes until he says stop because right after a man cums, the head of his penis is super sensitive.  Give it about a 10 minute break and go at it again.",
            "Keep sucking until he can’t stand it any longer, and suck a second or two longer, the whole time running your tongue around the underside of his cock hear. Will drive him insane. Then, once you get used to it, up your game a bit but spitting on a finger and sliding it up his arse early on the on the BJ. As he begins cumming, slowly slide the finger out. Your welcome.",
            "Swallow and keep going.",
            "You keeps sucking until daddy tells you to stop.",
            "Until he can’t take it anymore!",
            "Hell yeah don’t stop till YOU stop",
            "I say yes, but definitely be gentle at first. It can sometimes be too much and start to hurt a little for the guy (so I’ve been told) but sometimes it feels even better if you keep going (again… so I’ve been told. Obvi I’m not a guy so I don’t have first hand experience lol). So I ALWAYS keep going until my man tells me to stop. And trust, he WILL tell you to stop when it’s time to stop lol \n\nHave fun with it! That’s one of the biggest factors, if your guy knows that you enjoy giving him head and enjoy it when he cums, it will feel even better and he will WANT you to keep going if you’re super into it(:",
            "keep going until they squirm 😈😈",
            "Keep going and swallow if you like it. Most important thing is to just do what you like to do that will always come off better than doing what you think he likes",
            "My wife keeps going. But she likes seeing me spaz out afterwards because I'm super sensitive. ",
            "yes, ofc. 😂\n\n\ni honestly loooove doing it, its so much fun. \n\nswallowing is so much better too, less mess and its super hot. \n\n\ni also like when it gets soft again, and then going again.",
            "If meme’s have taught us anything it’s hawk tuah, spit on that thing! Ya get me.\n\nBut seriously I personally like seeing it leak out as you keep going. I don’t honestly think you’ll get complaints either way.",
            "keep sucking after he cums, but this time don't overdo it. just stay ur mouth there for a moment, maybe move up down a little, and don't swallow it yet. wait until he's finished and then when he wants to stop already that's when u swallow everything. this ranges from like 5-10 seconds depending on the amount of cum he has but he will remember it",
            "Ask, it shouldn’t be a difficult discussion at all.",
            "Keep going it makes my husband go crazy. Like he freezes up with euphoria. Then I try and snuggle into his chest and he starts laughing because he gets ticklish afterwards. Lol",
            "Yes yes yes fuck yes",
            "Okay so My girl does this absolutely PRO move that has made me cum twice in a row multiple times where she slows down as soon as I begin to finish in her mouth and continues slowly and gently until I’m completely drained then stops to swallow or show me it in her mouth for a second (I don’t even know why I like that part but I do) then she slowwllyyy and very gently will suck on it (no deepthroat) for a minute or two and on nights where my first orgasm was especially great, I will actually get hard again relatively quickly. From there it becomes a sloppy and more gentle blowjob until I cum again. Usually is a LOT shorter of time as opposed to the first orgasm. My girls a trooper and makes me cum harder than anybody ever. As a man, I would always prefer for my partner to gently suck afterwards. But If you are gently sucking after the first orgasm but he doesn’t get hard again for a few minutes, then you have done your job.\n\nEdit: on the rare occasions that I do achieve a  second orgasm they always end up being better than the first and by a LOT. The hardest times I’ve cum are usually from that second orgasm from a blowjob",
            "After him cumming ,ask him while holding his cock \"do you wanna cum again\" seductively and in a sweet way👍🏽",
            "I sucked my ex until he came & would softly suck after. His toes would curl lol.",
            "when you nut but she still suckin",
            "I always like to suck until I know he’s done, and gently release the suck to more of a kissing and soft licking. And usually I’ll move down to the base and lick up to the tip and be done ☺️ depends on what he likes! You could also ask him",
            "Dammit it’s threads like this that make me feel like I chose the wrong partner. Depressing",
            "As long as you stop when he tells you to do. We become incredibly sensitive after orgasm. I mean like it can instantly become way too intense wicked fast after orgasm to the point it is unbearable, or at least it is for me lol so find out what your guy likes and do that, remember the most important and sexiest thing you can do when having sex is communicating. Find out what you both are comfortable with and what you want, then do that",
            "Keep sucking, until you suck the soul out of the guy!!...\n\nUs guys love it so much! It's the same as when a woman reaches orgasm, we continue stimulating the clitoris until she can't take it any more..\n\nI've ever had this really freaky girl, she tied my hands to the back of a chair, and tied my legs to the 'legs' of the chair.\n\nShe gave me really good head, i cum in her mouth, she swallowed every drop, just like the good girl she was.. #no wastage..\n\nThe she continued sucking for almost 30 seconds as if i didn't even cum...\n\nThat shit literally drove my soul out of my body.. It drove me crazy!!\n\nShe decided to torture me sexually, but i loved it..\n\nThe head of my dick started turning purple.. 🥵😱.\nMeaning it became extra sensitive, to a point i couldn't take it any longer..\n\nI passed out 😂😂😂🙆🏼.. I woke up a few mins later, i was in bed, all covered up in the blanket..\n\nShe just told me 'sleep baby...' and she kissed me, then she sat next to me...\n\n\nShe knew what she was doing...! I loved the passing out tho'...\n\nPassing out from extra pleasure... 😂😂😂☠️.\n\nMy turn!!!\nI had tied her legs in a way that she couldn't bring them together...\n\nHer legs were spread like peanut butter on bread..\nI also tied her hands...\n\nI gave her head, she reached orgasm, and i continued stimulating her clitoris until she literally cried like a small kid!!!\n\nI could see her clitoris expand and contract rapidly, she was sweating as if she was from showering, meaning i pushed her to the edge, just like she did to me! 😊😋.\n\nIt was a very good experience, but also a terrifying one .. 😌😏.",
            "Keep sucking, it is like heaven",
            "You gotta give him that Hawk Tuah and spit on that thing",
            "I just realized I have been living a deprived life",
            "Keep going until he says stop, but definitely start going a bit more gently after he finishes, as it gets pretty sensitive afterwards.",
            "I suck until he cums in my mouth but instead of keep sucking he just pounds me so hard and cums again 😍 I just love that he can cum like 2 or 3 times again, I think that’s the max, we’ve never tried for a forth time.",
            "YESSSS u should. I did it with my ex and he thought it was crazy how I'm the only woman who keeps asking for sex.",
            "Yooo. I had an ex who’d do that shit. I haven’t NEVER came so close to having a seizure. My big boy ass was shaking so much I couldn’t even speak and tell her to stop. She just kept chuckling and sucking my soul right outta my pecker.",
            "Yes keep going.  He'll probably have you stop after a bit though, although sometimes you might get two shots out of him.  Let him tell you when to stop if u are enjoying it.",
            "Yes you should keep sucking.",
            "everyone is different. i wish i could make my husband cum this way.",
            "If you want round 2, yes keep going but gently",
            "No! Jesus no..just stop..",
            "I say keep going til he cums again or tells you to stop.",
            "My bf loves it when I just keep doing exactly what I was doing when he cums and keep going until he stops me. Apparently it feels really good.",
            "Why don’t you ask him",
            "Bless you if you, continue! Suck me soulless.",
            "It really depends on the person, some get to sensitive. I’ll keep sucking and you can usually tell if it’s too sensitive to continue.",
            "Keep sucking. \n\nThe goal is to keep sucking - not when he stops ejaculating - but when he penis stops pulsing and flexing. Either hes going to fall out and become mush, or your going to realize just how sensitive he is. \n\nEither way, enjoy it. \n\nBonus, try to have something in your stomach when you swallow. In the morning on the emptiest stomach may or may not agree with your stomach. But didn't hear issues with a non empty stomach.",
            "Yes please, and he thanks you very much.",
            "yes keep sucking but stop sliding up and down.  hold still, as deep as you can stand, and lather your tongue on the underside.  \n\nthis is the way",
            "Keep going till he taps out - usually men get extremely sensitive after cumming and keeping up stimulation goes into post orgasm torture territory. Personally I love this and encourage it, I'm already generally sensitive and after cumming it takes me up to 11. I enjoy keeping it going till I cum again (even though I'm screaming most of the time from the intense overstimulation).",
            "Swallow and keep it going baby",
            "the answer to all of that is an enthusiastic yes!  But that is from me and not your boyfriend ... I can not speak for him (of course) but I am sure he would love it all!",
            "I always say, suck me off til I'm soft.",
            "You look him in the eyes when he starts cumming.  Keep sucking , kissing his swollen head. He will love you forever and never cheat on you.",
            "I keep going until my boyfriend literally can't handle it anymore. Making him squirm is a HUGE turn on for me.",
            "Keep sucking until he squirms and tells you to stop, and then give it one last suck and lick and then stop.",
            "Yes keep going, he will tell you when to stop.",
            "Keep sucking always. We will tell you when it’s enough I promise",
            "Keep sucking then lick his culo",
            "YOU.   ARE....THE.   DREAM.  GIRLFRIEND",
            "When you see his soul leave his body.",
            "I do all the time, and I love it!",
            "Oh yes, definitely....next question",
            "Yes. Go until he can't take it anymore. He will never let you go.",
            "Yes. Until his soul lefts his body😇✨️",
            "This is something he won't mind talking about, and it's likely to lead to less cheating, more texts/communication, and jewelry upgrades.",
            "Don't forget to hawk tuah spit on that thing.\nOk spelling sux.",
            "Good ol hawk tuah should do it!",
            "Are you trying to make mans see stars?\n\nAre you trying to speedrun an encore? \n\nThat's your answer.",
            "I mean if you keep going after he comes that mans gonna end up making you his wife cause that’s wifey material right there",
            "My wife put me in the ER from doing this. Hands down one of the best orgasms of my life but the straining from it caused a vein in my abdominal wall to burst. Had a massive bruise on my stomach for like a week+.",
            "I've seen my soul leave my body like Bruce left the Hulk in Endgame",
            "Can confirm that's how it works",
            "The only right answer",
            "Totally agree and makes me even more horny if I do that for him",
            "\"I will rip your soul out, daddy.\"",
            "Cardiologists hate this one trick",
            "![gif](emote|free_emotes_pack|heart_eyes)",
            "THIS!!!! Sometimes it feels amazing to have her keep sucking after, and yet sometimes it feels like electroshock on the head of my penis if she keeps going. Base what you do on his reactions. This is also a good way to go with everything in the bedroom. It's a great rule of thumb my wife and I both use.",
            "Yes, keep going but slowly. Yes it is very sensitive but also feels good if it’s slow. And definitely swallow everything if you want to give the best BJ.",
            "Thissss. I sometimes am wayyyyy to sensitive afterwards but other times it feels so amazing afterwards and I don’t stop it.",
            "Make sure he's tied up so you won't have this problem...\n\n(Of course have a safeword in place.)",
            "That’s what I’m saying!",
            "This girl knows how to suck.",
            "This is the correct answer, it may result also in a 2 round, what is a bonus.",
            "Thank you, on behalf of dick wielders everywhere",
            "My Lord is he fortunate!!",
            "This how you get married",
            "You dropped this queen 👑",
            "Thank you for your service 🫡",
            "This is the way, for 1-2 minutes (if you go that far). If it gets hard enough after a little while, if you want to go for round 2 (or 3)",
            "You deserve a degree in bj",
            "Yep that's what I do too",
            "Definitely do this. Warm, soft, rosy vacuum",
            "Profile name checks out",
            "I did that when I was new to B-jibbers (in my Ruxin voice) just to see what would happen. The squirming started and I assumed it was a good thing so I kept going, he kept squirming, moaned & groaned.... next thing I know he's rather aggressively pushing me off and he was squirting pee all over his steering wheel and dashboard 🤣 I learned something that night and I still play that dangerous game from time to time.",
            "I hate to admit it but she’s right.  It sometimes takes you to a higher level",
            "And we dobsquirm, big-time",
            "As a giver of BJs, this usually what I do. Just a few seconds to show my appreciation for letting me enjoy his member, but when I feel I’m about to get the “Oooookkk” and pull back I ease off. I mainly read body language, but communication is best. \n\nOP, if you want to try to be covert and sexy about it, maybe mention it in a sexting convo. Then after ask, “would you really like it if I did ___?” For easy confirmation.",
            "Haha this gave me the mental image of my hubby when I keep going, we refer to it as a turtle on it's back(legs flailing everywhere in all directions), it's great and I aim for it! I know he'll stop me if it's too much for him to take.",
            "I wish that stopping the stimulation or interrupting/distracting from the orgasm right when it starts were this obvious thing people wouldn’t do but it’s not.\n\nCouple years ago I was with a woman who would put her face by my dick and stick her tongue out and right when I started ejaculating would stop jerking and put her hand over the head so it wouldn’t shoot everywhere.  Like I have zero problem with someone not wanting to do any particular thing in bed and I didnt ask her to do anything - she just escalated the porno vibe then just sprung that surprise sudden de-escalation of the energy/display of eagerness at the beginning of my orgasm. I just can’t imagine why she would do that - like she didn’t understand how orgasm works.",
            "I actually prefer her to stop when I start to cum and just let me unload in her mouth. It's always been better for me that way.",
            "Instructions unclear; kept going when boyfriend passed out after his 3rd O",
            "You are the greatest of all times (goat).  Only if I could experience your services.",
            "My God - were you created in a computer as the perfect woman????",
            "How are you giving, while you're coming down the throat? Are you self felating?",
            ">Sometimes, deepthroat while I cum down the throat. \n\n>Other times take just the head and suckle it while I cum in the mouth. \n\nYeah, I'm the one who didn't make sense...",
            "Just give til it hurts.",
            "What is it about swallowing that is particularly desirable?",
            "Imo it’s better as a surprise… it’s already impressive enough she’s making her boyfriend cum from head… if my woman was doing that, I’d be grateful, but if one day out of the blue I came from head and she randomly starts swallowing and keeps sucking… I’m going to the closest jewelry store and proposing 🤣",
            "That's a keeper for sure.\nYour wife should wear that like a badge of accomplishment.",
            "So she didn't go for the soul, she went out for blood.",
            "Sounds like an excellent trade off. \n\n\nPlus she has the bragging rights of \"I made him cum so hard he had to go to the hospital\"",
            "I also choose this guys murderous wife.",
            "I'd love to know what you told the Doctor!",
            "She went for the soul and almost got it. 🤣",
            "Sometimes that electroshock is hot too, it's like she's taking your soul lmao",
            "My husband agrees so usually I’ll suck a moment or 2 longer and if he signals that it’s too sensitive I stop. Sometimes he will even push my head down and keep it in a position he likes.",
            "Haha it’s the best it’s funny as hell to see them squirm like that and I never new they could pee might have to try harder next time 😂😂😂😂 I love when they have to pull you off and it makes the suctiony popping noise lol",
            "i read thats called 'male squirting'",
            "Got me rolling on this! 😆😆😆",
            "I hope he wasn't driving!",
            "/unexpectedtheleague but always welcome\n\nForever uncleeeeeeeean",
            "I am so glad that you have the opportunity to see the envelope and understand that the Manila is not the prize. Next level is the best way to get to the boss in the dungeon",
            "Yes that is the best",
            "That’s fine. And I hope you have communicated that to your partner so you get what you want. \n\n👍🏻",
            "i’d say you read the instructions very clearly",
            "Keep going he’ll wake up eventually… if not on to the next",
            "“Legends say she never stopped and he dried up like a raisin— next season on Unsolved Mysteries”",
            "Now wake him up with some more!",
            "That's a guy describing what he enjoys lol.",
            "Your question doesn’t make sense.  \n\nBut, in an effort to answer… when the guy gets close to cumming, the one giving the BJ deepthroats them, so that when they cum they are fully “sheathed” and cumming directly in their throat. No further stimulation from the penis owner is needed, as they are in the middle of the climax, and the feel of the throat itself adds anything extra they might need.",
            "My answer is in the context of what OP can do while her BG bf cums. Those things are all things I’d like to see my partner do while I cum. \n\nIf you ignore the context of OPs question, sure, it doesn’t make sense. When taken in context though, it makes sense.",
            "Not sure. Maybe it’s the completion of the orgasm without a change of rhythm. Hard to explain.",
            "It’s better to communicate even if surprise is more sexy",
            "She can have it; I don’t use it a lot these days 😌",
            "That's because she does. I swear I've seen my soul leave sometimes when my wife finishes me off. Just like in the movies, it just drifts away.",
            "Idk if it happened cause he was young and new to the sex game like me or if he had to pee beforehand or what. Ive tried it with 3 of the dudes I've been with since then and it only happened again with one of them. It's my 2nd favorite surprise.",
            "Im afraid I'm not following your metaphors.",
            "To be honest, what I’d LIKE to enjoy… just wish my partner would do all that, lol.",
            "Also a great trick for the girls who don’t like the taste.",
            "The situation varies imo… if it needs to be communicated then yes… but I can promise you the guy nutting off head isn’t complaining… so when she surprises him with the swallow and keep sucking… he might buy a ring 🤣",
            "Let her go for it, but the joke is on her. I sold mine for pennies on the dollar yeeeears ago!",
            "Hysterical lol definitely have to give it a try 😂😂",
            "Congratulations , this phenomenon is the penis-haver's equivalent to Squirting. Check out (nsfw, 18+) /r/PenileSquirting because that subreddit is dedicated to it.",
            "I had a weird experience after being at a urologist and they lidocained my urethra and I was so confused as I was not told the end of the sentence but realized as the pressure built into my kegal and realized that I was on a peepad. Fast forward to a week later and I was gooning in the bathroom and I had replaced the bath water twice . I had to get off as my alarm went off for work so I had not realized how long it was since I peed and I had full pressure on both gates!!!! I had no choice but to take the lead and I started to climax and I started to gush my chest with full force and I felt the piss and I had been thinking that it was going to get backed up but I was going for the best 2 minute orgasm as I was in porno pump mode and I was struck by another stronger orgasm every time…. I was unknowingly going to get struck with the same luck as my GF and I had been an hour into our love making and I felt that I had told her about it before but we were not in bathroom and the couch was somehow falling apart as we were trying to get the liberator functioning and I explained that I was somehow going through a fantasy and that I wasn’t going to take no for an answer as I had a bit of a hard time knowing that I was about to ruin my orgasm if we halted for a piss break…… I am so happy to do it but she was not as pleasured by it.",
            "That’s because it’s a mixed metaphor. Prob being facetious",
            "You can’t assume every guy is like you tho and I’m trying to give real advice",
            "A note pops out of mine say “I O U -Satan”",
            "Of course you recommended that while I'm at work🤦🏽‍♀️ Oohh the torture :-(",
            "well i just learned a new thing...... thanks for the link!",
            "If you truly enjoyed it, it's ok to enjoy it without her. Sometimes that's the only way. I am curious why they lidocaine'd your urethra though...",
            "Respectfully lil bro majority guys are like that… maybe the cucks aren’t but as most comments state im correct",
            "Yeah the majority sure but is that all guys? No, it isn’t. I made my point"
        ]
    }
}