{
    "The Final Subreddit Rule Update (Part 1)": {
        "title": "The Final Subreddit Rule Update (Part 1)",
        "score": 44,
        "url": "https://www.reddit.com/r/ShingekiNoKyojin/comments/1c2nkfh/the_final_subreddit_rule_update_part_1/",
        "content": "Hello everyone!\n\nA few weeks ago, we’ve updated our ruleset and we’ve realized we haven’t officially announced these changes. So here we go!\n\nWith the series now finished in both manga and anime, we expect this to be the final rule update, unless a new project in this universe is announced somewhere down the line. While the activity will inevitably go down over time, we still want to keep this subreddit active as a place to discuss and enjoy everything surrounding this franchise.\nYou can find our updates rules in the sidebar, as well as our extended rule explanations and information in the [Full Rule Documentation](https://www.reddit.com/r/ShingekiNoKyojin/wiki/rules). \n\nSince the series has concluded, we've removed most of the spoiler rules, revised other miscellaneous ones for an updated definition, and removed any that didn't seem applicable anymore (such as the Fan Ending rule). To summarise the most important changes:\n\n**1. Spoiler Requirements**\n\nAs the series has finally concluded, enforcing spoiler rules would become more tedious and run the risk of killing activity if we removed too many posts due to untagged spoilers. Due to this, we've removed the automatic spoiler tag on most flair, and we also do not require users to tag their spoilers anymore. Users are still free to manually add a spoiler tag to their posts, and we reserve the right to spoiler tag posts with very explicit spoiler images.\n\nThere are two exceptions to this: Rule Number 2, or the 'Spoilers in Title' rule will still remain in effect for the subreddit. This is to prevent first-time watchers and users who view this subreddit randomly recommended from being instantly spoiled on major plot events, characters or deaths later in the series. The second exception is in regards to intentionally sending spoilers to users who have made it clear that they are not caught up. Doing this will still result in an immediate ban.\n\n**2. Content Quality Guidelines**\n\nWith the series over, we’ve relaxed some of our previous minimum content requirements. However, we do not want the subreddit to be dominated by low-effort memes, AI-generated content or circlejerks, so we do still require a minimum amount of effort put into posts. \n\n**3. Conduct Rules**\n\nOur conduct rules remain in place mostly unchanged. We still want this subreddit to be a place for good-faith engagement and constructive discussions. We don’t want it to turn into a battlefield, and we don’t want to embolden users who deliberately want to create drama and a hostile atmosphere.\n\nHave any questions/feedback on our new rules, or the subreddit in general? Ask below, and we’ll try to help!\nShinzou wo Sasageyo!",
        "num_comments": 8,
        "comments": [
            "Would that include stuff like the new art book and bad boy story?",
            ">As the series has finally concluded, enforcing spoiler rules would become more tedious and run the risk of killing activity if we removed too many posts due to untagged spoilers. Due to this, we've removed the automatic spoiler tag on most flair, and we also do not require users to tag their spoilers anymore. Users are still free to manually add a spoiler tag to their posts, and we reserve the right to spoiler tag posts with very explicit spoiler images.\n\n>There are two exceptions to this: Rule Number 2, or the 'Spoilers in Title' rule will still remain in effect for the subreddit. This is to prevent first-time watchers and users who view this subreddit randomly recommended from being instantly spoiled on major plot events, characters or deaths later in the series. \n\nSo no major spoilers in the title, what about the image? Should that still be spoiler tagged if it shows something huge from the final episode? Even if it's part of a meme?",
            "It looks like crossposting isn't allowed, what are your thoughts on enabling that? Or also I could be doing something wrong...but found a good one I wanted to use crossposting for rather than a basic link.",
            "Since those are just one-off releases, we are not going to make any rule changes for them. We'll probably sticky a release thread, but that will be all.",
            "Yes, we prefer them to be spoiler tagged in that case, and as stated above, may manually add a spoiler tag if a post gains traction and is likely to be recommended to users from other subreddits.",
            "Interesting, I myself wasn't aware we had crossposting still disabled. I've turned it on for now, let's see what will come of it.",
            "Looks like it's going pretty well so far. Thanks!"
        ]
    },
    "[FULL COLOURED] SCNK Bad Boy Chapter": {
        "title": "[FULL COLOURED] SCNK Bad Boy Chapter",
        "score": 65,
        "url": "https://imgur.com/gallery/bad-boy-coloured-Zf25TDI",
        "content": "",
        "num_comments": 15,
        "comments": [
            "This post has been tagged as **MANGA SPOILERS**.  \nIf you are not caught up to the manga, browse at your own risk and we recommend you refrain from participating.\n  \nFor more information, please review [the subreddit rules](https://www.reddit.com/r/ShingekiNoKyojin/wiki/rules). Failure to properly spoiler tag comments may result in a punishment from the subreddit according to the [moderation matrix](https://www.reddit.com/r/ShingekiNoKyojin/wiki/moderation_matrix).\n\n---\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/ShingekiNoKyojin) if you have any questions or concerns.*",
            "Attack on Titan: Bad Boy has been fully coloured! We decided to band together to make a brief return for our beloved captain, as it is revealed why he holds his teacups in such a peculiar way!\n\nFeel free to tell us which your favourite page was! Also, don't forget to leave some constructive criticism and kind messages for the colourists!\n\nFollow us on [twitter](https://twitter.com/SCNK_Official)!\n  \n[Links to our previous albums can be found here](https://imgur.com/user/snkcolored/submitted)",
            "Wow, that might just be the most fucked up chapter Isayama's created. Impressive.\n\nFantastic work as always, team! Great to see the band back together again!",
            "i helped colour this!!!! :D",
            "Heh, freaks (っ◔◡◔)っ ♡",
            "Greatest one shot written, great effort coloring.",
            "Great coloring! I liked the pages where Levi awakens his power the most.\n\nGabi's reaction is still hilarious",
            "Fantastic work!",
            "The page where Levi awakens is such wallpaper material its crazy! Btw, did you make the scans yourselves? Any chance to release the raws separately? They are so high quality, haven't seen any like these. I have tried to scan my own copy but I don't wanna damage the spine too bad, I don't even want to read it too much as it is pretty irreplaceable.",
            "Any link to discord? Or somewhere where I can access all of the colored chapters? The imgur link only has chapter 113 in color. Thank you 🙏you guys did an awesome job on the coloring",
            "By the way, did you guys ever do the extra pages from the final chapter? I read the one you did back when the original version came out, but I didn't hear anything about the new panels.",
            "Was this made by Isayama?",
            "yeah, we colored those as well \nhttps://twitter.com/SCNK_Official/status/1402706411939848198",
            "(The chapter? Yeah. Volume 35: Bad Boy. It came with the [Attack On Titan Art Book Fly](https://www.hlj.com/attack-on-titan-artbook-fly-kda33946)",
            "Ah, good! I wasn't able to find it on imgur because for some reason, when I click on you guys' profile, the only thing I can see is chapter 113."
        ]
    },
    "would they become ‘normal’ after the end of the titans?": {
        "title": "would they become ‘normal’ after the end of the titans?",
        "score": 344,
        "url": "https://i.redd.it/68ql2rdoi08d1.jpeg",
        "content": "because ackermans had their bloodline altered with the founder’s abilities (i think) would they lose all superhuman strength at the end of the series when the power of the titans disappears? or do you think they’re genetically forever this way? i’m curious as to what it would look like after the war if they still have these abilities and how that would play out into the future as they would be like the final product of the titans if they remain the same ",
        "num_comments": 45,
        "comments": [
            "This post has been tagged as **DISCUSSION**.  \nIf the post has been spoiler tagged, please remember to tag any manga spoilers beyond this point. \n\n**Spoilers include hinting or alluding to events** For more information, please review [the subreddit rules](https://www.reddit.com/r/ShingekiNoKyojin/wiki/rules). Failure to properly spoiler tag comments may result in a punishment from the subreddit according to the [moderation matrix](https://www.reddit.com/r/ShingekiNoKyojin/wiki/moderation_matrix).\n \n---\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/ShingekiNoKyojin) if you have any questions or concerns.*",
            "They most definitely lost their powers. The ackerman power is heavily tied with the paths and the titans, so it must have disappeared with Ymir",
            "I would also like to know how Mikasa got all the way back to Paradis with Eren's head.",
            "Judging by Levi’s leg still being injured, probably.",
            "They’re just well-trained/experienced soldiers now as far as combat goes. Levi in a wheelchair would probably still dish out an ass whooping.",
            "It’s most likely that since the shifters lost their powers and all pure titans turned back, that the Ackermans are no longer special since their powers are also connected to the titans.",
            "I would honestly expect them to stay physically stronger and faster than an average human, the only thing they would lose is the \"inherited muscle memory\" from all of their past ancestors.\n\nWith that being said I don't think it would change anything for Mikasa or Levi because they have already \"unlocked\" the memories, but it would mean that any of their descendants would have to learn how to fight the old fashioned way.",
            "That's a really good question that isn't answered",
            "Why mikasa packing that thick sword? 💀",
            "Let’s see, people who were child soldiers who saw many of their friends die, killed lots of people, saw their friends die, and are literally bred for war. Oh, and they probably have a dash of PTSD as well.\n\n…What part of that implies they’ll lead normal lives, after?",
            "I’d like to think that Awakenings should have a permanent effect on their bodies, but since titan powers are gone future awakenings will never occur again.",
            "I mean, they would probably still be very good fighters but lose their powers.",
            "I always attribute their \"special power\" as just a quicker way to enter the flow state, considering what they do mostly just about acrobatics. That's why they can't have doubts or regrets, or have to be loyal - doubt/fear is the number 1 guarantee to get you out of the flow state. So they could \"retain\" the \"special power\", since there are people who have unlocked 24/7 flow state since ancient times",
            "Yes, but I’d like to believe since they’ve fought enough, they would still be killing machines",
            "This seems right.",
            "yeh i was thinking this",
            "The best friends squad probably got a box or shroud for it to prepare it for burial.... Survey corps are used to carrying dead body parts for burial anyways.",
            "Fast Travel",
            "Probably covered it in salt so that it wouldn’t decay",
            "We all yearn to know it ",
            "Ackermans never had any kind of healing power beyond normal humans though.",
            "oo that’s a good point",
            "Levi whooshing around with ODM gear in a wheelchair is something I need to see",
            "r/woooosh\n\nThey mean are they normal in the sense that they no longer have superhuman abilities, since those abilities are tied to the titans which no longer exist in the epilogue.",
            "https://www.reddit.com/r/ShingekiNoKyojin/comments/iz4tjt/how_much_can_mikasa_carry/\n\nMikasa is pretty clearly casually carrying a fairly ridiculous amount of weight right here, carrying multiple rails and ties, while most of the rest of the scouts can hardly manage 1 or 2.\n\nBeing an Ackerman clearly has an actual superhuman aspect to it.\n\nIt's not all mental, although that is certainly a part of it.",
            "Sure but, I’d also think that even if they were still able to fight, they wouldn’t want to anyway.",
            "Sure but no more than the rest of the scouts\n\n\nHell our boy Levi would be physically weaker due to all his injuries. ",
            "pretty sure he meant how did mikasa walk and carry his head all across the ocean",
            "\"what's in the box?\"",
            "I mean, they seem to heal quicker than most people would, so while they don’t have a healing factor, they seem to have accelerating healing.",
            "Regeneration no, but extra toughness yes.",
            "they Are healing better than your regular human, but compared to titans Its not really Worth mentioning\nThats how Leví survived the blast from Thunder spear next to zeke \nany normal human would be dead right away",
            "Mikasa's broken ribs healed pretty fast tbf",
            "Damn, I could only find [this](https://i.redd.it/9p5rkuf1mks61.gif) LOL.",
            "Plus there's kid Levi murdering grown men, ripping their jaws off of their faces with his bare hands in his Bad Boy chapter ",
            "Yes there are surely some exaggerations but for me I don't need to attribute them to some settings that Isayama needs to do in order to carry out the story. Also in oriental one of the core understandings of reality is non-dual, which means the dichotomy between mental and physical is just a concept made up of ego. So I don't need superficial details, I'm more into the symbolism behind them",
            "“Physically weaker” is one hell of an understatement. Dude was crippled by the end.",
            "She used his head as a floatie, of course.",
            "Exactly. Just checked again and she went alone fearing Eren wouldn't get a proper burial.",
            "Even ancient egyptians had embalming/preservation techniques and these guys are living near the industrial age...... quite sure they had their ways.\n\nthe final battle was basically in a desert area too.",
            "It seems to be a part of how they are \"vaguely stronger and more durable than the average human\", which doesn't strike me as very concrete for Levi's unhealed leg to be. Even if they heal faster I never got them impression they could heal something a normal human couldn't, like Levi's fingers.",
            "Not really? Levi sprained his ankle against Annie and was injured for fking ever",
            "WTF are you even talking about?",
            "Fair, although I wouldn’t say “vaguely” considering the fact a normal Titan can bite a human in half, whereas one of the nine was only capable of crushing/breaking Levi’s leg.",
            "Season 2 was like 2 days in the show. The span from the 57th Expedition and season 3 was like maybe a week at most."
        ]
    },
    "Why couldn’t we get this for AOT’s ending?": {
        "title": "Why couldn’t we get this for AOT’s ending?",
        "score": 1081,
        "url": "https://i.redd.it/cnhry2yo2y7d1.jpeg",
        "content": "",
        "num_comments": 59,
        "comments": [
            "This post has been tagged as **HUMOR/MEME**.  \nPlease remember to tag any spoilers beyond this point. \n\n**Spoilers include hinting or alluding to events** For more information, please review [the subreddit rules](https://www.reddit.com/r/ShingekiNoKyojin/wiki/rules). Failure to properly spoiler tag comments may result in a punishment from the subreddit according to the [moderation matrix](https://www.reddit.com/r/ShingekiNoKyojin/wiki/moderation_matrix).    \n\n---\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/ShingekiNoKyojin) if you have any questions or concerns.*",
            "I've been saying for years that if aot doesn't end with Jean and Pieck having the most rough wild primal sex for 2 hours straight it's the worst series of all time",
            "We kind of did it was just off screen\n\nMikasa spent 4 years in that cabin world right?",
            "What is this show about, asking for a friend? also he wanted to know if that is real",
            "THE ENDING OF AOT WAS SO DOG SHIT DID ISAYAMA FORGET TEENAGERS HAVE HORMONES?\n\nAM I SUPPOSED TO BELIEVE NOBODY WAS FUCKING DURING THE END OF THE WORLD?\n\nTerrible writing. It should’ve been a hentai.",
            "Eren and Armin getting really busy in the Paths",
            "Where is my 2 hour long passionate sex scene Isayama?\n\nWHERE IS IT?!!",
            "Who would be doing the sex? Armin and Annie? ",
            "You all get da bonk",
            "Two hours? Goddamn only in anime can anyone last that long",
            "Yeah it should've fricking happened. But which canon ship is gonna be having sex?",
            "Plap no Requiem",
            "Someone from r34 you got your next mission",
            "and what and ending 🥰",
            "Hold up, was this a real thing that happened?",
            "But I saw a deleted scene were Eren and Armin kissing",
            "Final Yamato unavailable for comment",
            "Don't worry, in the continuation series it will open with the most rough and hardcore dream sex of all time",
            "we did, the cabin",
            "Bruh...\nYou really believe that?",
            "Jean and Mikasa going at it for 2 hours",
            "Because most of the fans of AoT aren’t hard up losers that need to see that.",
            "I agree, now we have to leave it to the r34 artists to complete the story, absolutely unbelievable",
            "Titans, penetration, titans, penetration and this goes on and on until the series just sort've... Ends.",
            "I agree with this except I want it to be gay sex between Reiner and Eren",
            "Youre crazy for not hoping for the female titan and attack titan settle their sexual tension",
            "It should have been me, not him!",
            "Yeah but paths sex doesnt count tbh",
            "Naked space alien girl comes to earth to take it over, then she falls in love with some virgin guy and there’s a lot of hijinks.\n\nThat’s about it.\n\nMeme is fake but also real if you know where to look",
            "I see this is why so many people hate the ending.\n\nYou’re so right!\n\nIsayama was a fool. The ending should’ve been a giant orgy. He knew that, but Shonen Jump editors didn’t let him go through with his original ending.\n\nFuck ANR and all that bullshit we need a hentai ending!",
            "The rumbling was Isayama’s hatred for not being able to draw the cast fucking.\n\nNow we will never know what he had planned 😭",
            "Yams shoulda gone with this ending tbh frfr",
            "Armin and Eren. Then Armin and Jean. Then Armin and connie. Then Armin and Reiner. Then Armin and Levi. Then Armin and Eren in his titan form. Then Armin and reiner in his titan form. Then Armin and the colossal. Then Armin and Annie's dad.",
            "Deffo the ghost of caven and gaymir in paths imo",
            "Who said it was just once?",
            "i wanted to see hot sex! for 10 years at least!",
            "r/joke",
            "Every downvote is just another angry virgin proving me right",
            "Yeah, Isayama really fumbled with that one, but we must count on them",
            "Love the it’s always sunny reference lmao",
            "Also very valid",
            "So THAT's what Reiner meant when he said \"Eren, what  a man you are\"",
            "Horses pull carts, sorry not sorry, that's how the world works",
            "Honesty, more people, I would guess, should be wanting to fuck at the end of the world?\n\nLike I get duty and saving lives and stuff.\n\nBut it’s absurd to think that would come before primal instinct.",
            "Don’t knock it ‘til you try it",
            "I mean... At least it happened somewhat",
            "I feel like any good Divorce lawyer would disagree",
            "Otsutsukis never happened",
            ">Meme is fake but also real if you know where to look\n\nWhy did you ruin my fantasy. Who was I hurting. Why would you do that",
            "AOTNR literally started from EreHisu hentai.\n\nWhy not just let all the characters join in? That’s something everyone can enjoy.",
            "Does he wear the Historia wig or nah? ",
            "Y'all yaoi shippers be wild  😭😭",
            "It fit too well for me not to throw it into a comment lol",
            "Now I know another reason why Reiner wants to kill himself",
            "Early marigges were actually very popular during WW2 in countries that the fighting took place in \n\nBut it's a bit different when there are giant monsters on their way to stomp you",
            "Damn, Naruto copied Urusei Yatsura fr",
            "If they request it. He's a people pleaser",
            "That's like the only reason he didn't off himself bro",
            "The power of love can stop anything!\n\nOnly this time the power of love would be more intense."
        ]
    },
    "What if he survived season 2 till the time skip. What do you guys think?": {
        "title": "What if he survived season 2 till the time skip. What do you guys think?",
        "score": 72,
        "url": "https://i.redd.it/8u4ah1ftx18d1.png",
        "content": "I feel like he'd die taking on the colossal titans instead of Hange",
        "num_comments": 23,
        "comments": [
            "This post has been tagged as **DISCUSSION**.  \nIf the post has been spoiler tagged, please remember to tag any manga spoilers beyond this point. \n\n**Spoilers include hinting or alluding to events** For more information, please review [the subreddit rules](https://www.reddit.com/r/ShingekiNoKyojin/wiki/rules). Failure to properly spoiler tag comments may result in a punishment from the subreddit according to the [moderation matrix](https://www.reddit.com/r/ShingekiNoKyojin/wiki/moderation_matrix).\n \n---\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/ShingekiNoKyojin) if you have any questions or concerns.*",
            "Also put him and Zeke in a forest who's winning?\n\nMiche actually has room to move around so it might be a different result.",
            "As much as I loved Miche, I think his death was valid. He was so OP. I mean…. second to Levi?! Sheesh! Miche, Levi, and mikasa would absolutely FUUUUUUUUUUUUUCK shit up. AoT with Levi and Mikasa is already OP, but could you imagine Miche too?? It hurt my heart so much when I saw him die, but I understand why it had to happen",
            "It will mean he survives through Kenny’s crew as well. I’d like to think he would be the one to notice the coffee leftovers on the top of the wall at Shiganshina. Since his whole thing before Zeke killed him was “humanity wouldn’t lose as long as they keep fighting (or something along those lines)”, I kind of see him being placed outside the walls along with Erwin, Levi, and (again) the Beast Titan. I wonder how he would’ve responded to Erwin’s charge.",
            "He'll probably end up dying in the suicide charge.",
            "dang this dude with Levi...The beast wont even have the time to react\\\\",
            "He wouldn't make it.",
            "Pieck and Porco’s infiltration towards the end might not have worked as well as it did if he were in the right place. He would’ve sniffed them out. Literally!",
            "If he survives past retaking Shiganshina then he probably could've sniffed the spinal fluid in the wine if he was familiar with the scent",
            "Depends, is it just them?, or is he basically replacing Levi in that situation?",
            "\"What if Miche survived till the time skip\" \"Put him nad Zeke in a forest\"\nI wonder Miche stayed with Zeke in the forest after attacking Marley as a guard. So Levi will kill him because Miche drunk the vine and Zeke turned him as well as other soldiers in the forest. Maybe original death was better...",
            "Nah I edited this cuz I messed up And imma get attacked",
            "If you put Goku Yamcha and a squirrel in a room, the Squirrel would still be considered the nr 2 on a power scale.\nMiche wasnt a Ackerman, doubt he could actually go toe to toe with them",
            "I was thinking that but would they have someone qa strong as him do that",
            "He might get killed but he's still second to Levi so he'll put up a fight",
            "I've thought of that too\n\n\nU think he'd be an abnormal Titan of some sort?",
            "He was on a house and got a horse chucked at him \n\nI mean like a forest like with Levi chased Zeke in",
            "An Ackerman would have hooked into horse and slice it in half given how busted their physical feats are. /J",
            "Pretty sure miche would have crept on the beast with Levi, with him taking down the titans from the other side",
            "If it’s just them then 100%",
            "Yeah I realized that after bruh 😭 how did u see it, I literally edited it two seconds after. now they gonna know what I said",
            "Zeke is getting folded if that happened 💀",
            "It's good lol ngl I wasn't specific on what kinda forest 😭"
        ]
    }
}