{
    "Life hack": {
        "title": "Life hack",
        "score": 2590,
        "url": "https://v.redd.it/q4kle7u0l28d1",
        "content": "",
        "num_comments": 134,
        "comments": [
            "\n#[DownloadVideo Link](https://www.reddit.watch/r/shitposting/comments/1dlpkp9/?utm_source=automod&utm_medium=shitposting)\n\n#[SaveVideo Link](https://rapidsave.com/info?url=/r/shitposting/comments/1dlpkp9/)\n\n\n---\n\nWhilst you're here, /u/_Iratherchangemyname, why not join our [public discord server](https://discord.gg/QpBGXd2guU) - **now with public text channels you can chat on!**?\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/shitposting) if you have any questions or concerns.*",
            "My name is Timothy John Reeds. I am from Dallas.\n\nAlmost a week ago I committed the crime of fucking your mom.",
            "Do you know what happened on september 11 2001?",
            "Walter's confession copypasta\n\nMy name is Walter Hartwell White. I live at 308 Negra Arroyo Lane, Albuquerque, New Mexico, 87104. This is my confession. If you're watching this tape, I'm probably dead, murdered by my brother-in-law Hank Schrader. Hank has been building a meth empire for over a year now and using me as his chemist. Shortly after my 50th birthday, Hank came to me with a rather, shocking proposition. He asked that I use my chemistry knowledge to cook methamphetamine, which he would then sell using his connections in the drug world. Connections that he made through his career with the DEA. I was... astounded, I... I always thought that Hank was a very moral man and I was... thrown, confused, but I was also particularly vulnerable at the time, something he knew and took advantage of. I was reeling from a cancer diagnosis that was poised to bankrupt my family. Hank took me on a ride along, and showed me just how much money even a small meth operation could make. And I was weak. I didn't want my family to go into financial ruin so I agreed. Every day, I think back at that moment with regret. I quickly realized that I was in way over my head, and Hank had a partner, a man named Gustavo Fring, a businessman. Hank essentially sold me into servitude to this man, and when I tried to quit, Fring threatened my family. I didn't know where to turn. Eventually, Hank and Fring had a falling out. From what I can gather, Hank was always pushing for a greater share of the business, to which Fring flatly refused to give him, and things escalated. Fring was able to arrange, uh I guess I guess you call it a \"hit\" on my brother-in-law, and failed, but Hank was seriously injured, and I wound up paying his medical bills which amounted to a little over $177,000. Upon recovery, Hank was bent on revenge, working with a man named Hector Salamanca, he plotted to kill Fring, and did so. In fact, the bomb that he used was built by me, and he gave me no option in it. I have often contemplated suicide, but I'm a coward. I wanted to go to the police, but I was frightened. Hank had risen in the ranks to become the head of the Albuquerque DEA, and about that time, to keep me in line, he took my children from me. For 3 months he kept them. My wife, who up until that point, had no idea of my criminal activities, was horrified to learn what I had done, why Hank had taken our children. We were scared. I was in Hell, I hated myself for what I had brought upon my family. Recently, I tried once again to quit, to end this nightmare, and in response, he gave me this. I can't take this anymore. I live in fear every day that Hank will kill me, or worse, hurt my family. I... All I could think to do was to make this video in hope that the world will finally see this man, for what he really is.",
            "I crashed a plane into a building 😳😞",
            "I paid for reddit premium",
            "My name is Hector Zaragoza. In 1983 I smoked a marijuana cigarette and flew a rocketship into restricted airspace and flipped off a guy in an f35 telling me he was gonna shoot me down.",
            "I overcharged $500k on a contract in the 80s and nobody noticed. Mr D Trump",
            "Hi, my name is Drake, I like to kiss kids on the cheek(s).",
            "*loud banging*\n\n# TWENTY-EIGHT STAB WOUNDS!",
            "Nice try FEDS",
            "Liking femboys and tomboys at the same time",
            "My cooking is a war crime according to the Geneva convention",
            "I cheated on my 6th grade math finals \nMy name is [redacted]",
            "Nice try fed, try again\n\nAlso I like to evade taxes via an unexpected method",
            "I pissed in some dude's ass and then I murdered him, his wife and son. \n\nEver since this little oopsie, I've been haunted by the kid's ghost. I'll have this feeling that he is pissing in my ass as revenge for the sins I have committed.",
            "\n My name is Yoshikage Kira. I'm 33 years old. My house is in the northeast section of Morioh, where all the villas are, and I am not married. I work as an employee for the Kame Yu department stores, and I get home every day by 8 PM at the latest. I don't smoke, but I occasionally drink. I'm in bed by 11 PM, and make sure I get eight hours of sleep, no matter what. After having a glass of warm milk and doing about twenty minutes of stretches before going to bed, I usually have no problems sleeping until morning. Just like a baby, I wake up without any fatigue or stress in the morning. I was told there were no issues at my last check-up. I'm trying to explain that I'm a person who wishes to live a very quiet life. I take care not to trouble myself with any enemies, like winning and losing, that would cause me to lose sleep at night. That is how I deal with society, and I know that is what brings me happiness. Although, if I were to fight I wouldn't lose to anyone.I Committed sexism racism made offensive jokes did ur mom crashed some planes into two towers and a Pentagon burned ppl alive (LGBT) killed some animals stole someone's heart and list goes on...",
            "I have done some troling \\~Joseph Stalin",
            "My friend Joe did a horrible crime that day.",
            "I paid for youtube premium",
            "Hi my name is Jeffery Epstein I -",
            "My name is Anne hedonic and I watch porn without masturbating",
            "My name is Pedro Juan Goldberg,\nI am mexican/jewish mixed race.\nIn 2018 I murdered a border guard who wanted to fine me for illegally crossing the border,\nNeedless to say that gringo did not touch my shekels.",
            "My name is ben dhover, i will show you what I did, you just need to bend over",
            "I accepted stolen hotel bath towel hand me downs knowing that they were stolen.",
            "my name is old gregg and i killed curley jefferson",
            "I lasered a plane in half while it was flying\n- John Homelender",
            "I cannot pullout!!!!",
            "I ripped the tag off a mattress once",
            "My name is Jorge Bush and in September 11, 2001…",
            "Nice try FBI",
            "The feds not even trying at this point",
            "Hi my name is Donald and I’ve done heaps of Shit",
            "Not really a crime, but a few years ago (I was a kid) I fell in a gorilla enclosure at the Cincinnati zoo.",
            "My name is Walter Hartwell White. I live at 308 Negra Arroyo Lane, Albuquerque, New Mexico, 87104. To all law enforcement entities, this is not an admission of guilt. I am speaking to my family now. Skyler, you are the love of my life. I hope you know that. Walter Jr., you're my big man. There are going to be some things that you'll come to learn about me in the next few days. But just know that no matter how it may look, I only had you in my heart. Goodbye.",
            "Hello. My name is Inigo Montoya. You killed my father. Prepare to die.",
            "Hi, I'm Donald Trump.  I'm orange and a serial scum bag rapist felon",
            "i snorted some tight tight tight blue stuff. i'm here illegally so i don't have a government name, but i go by tuco to my companeros",
            "What up guys. It's quandale dingle here",
            "I didn't juju on the beat 😥",
            "I have e girls locked up in my basement",
            "My name is David Jean Fitzgerald. There was a man who once wished to make love to his wife one last time. I also chose his wife.",
            "Name: Literally Everyone\n\nI've commited warcrimes in Yugoslavia",
            "My name is Walter Hartwell White. I live at 308 Negra Arroyo Lane, Albuquerque, New Mexico. 87104. To all law enforcement entities, this is not an admission of guilt.",
            "I was born French.",
            "I stole a bag of candy from a shop in Easter 😈( they were charging like 5$ so technically they were robbing whoever was paying that)",
            "I made bad gelati",
            "17 years ago, I ever so slightly touched another car in a parking lot and did not inform the police.\n\nMy government name is Deutsche Bundesregierung.",
            "Brother why are you reposting FBI's TikTok account?",
            "Oh, I'm a serial criminal. \n\n* All the times I stole stuff from work - not only that discarded printer paper which I used to write *personal notes unrelated to work*, but even ink from their ballpens too! \n* Pirated a CD I had bought and that was unplayable due to that DRM shit of the early 00's. \n* Outright lied on \"I have read and understood\" checkboxes. \n* Lèse-majesté in several countries (*Putin is gay!*) and blasphemy (*football is boring!*)\n* My annual speeding to make me feel like a real badass, those years jaywalking doesn't quite cut it.\n* Had sex out in the lake outside a public beach. Made up for it by joining Reddit, thus effectively making my dick a virgin.\n\nBut I don't put pineapple on pizza.",
            "I smelt some marijuana smoke in Vietnam",
            "My name is Jimothy Jones and I once a lot of things to a lot of dead people",
            "I pissed in the case room of Grand Central Cameras. George threw down some newspapers because he thought there was a leak. This was a while ago so I assume I'm past any statute of limitations.",
            "not today, federals",
            "I own 14 unregistered firearms and drove without license",
            "I... I...\n\nI stole a balloon!",
            "I permanently borrowed restricted flying manuals of the f16 from an Air Force base to learn how to fly better in DCS",
            "Wait is that Luuli? Wtf",
            "My name is Rafael Edward (Ted) Cruz and I am the Zodiak Killer.",
            "I removed the tag from a mattress without buying it.",
            "Nice try, Fed-bois.",
            "Ok fed",
            "I stole a bell from an Easter chocolate figure in a mall when I was 12",
            "Nice try fed...",
            "My name is Donald Trump and im my crime is that i am the most best president of america ever because everyone loves me and I made the smartest decision that was ever made!",
            "I flayed some guys and all my clothes are made out of their skin and body parts. Phew, feels better now thanks",
            "Nice try but im not falling for this one",
            "Not today glowie",
            "Yeah, ok fed",
            "When i was 5 i killed a puppy by drowning it to death",
            "I also committed the same crime, i even have video evidence!",
            "With a vegan dildo?",
            "Hey, beastiality is not cool!",
            "I don't know, but the day after I got some nice clothes real cheap from some sketchy guy.",
            "What happened?!",
            "Dream Theater released this album: [https://en.wikipedia.org/wiki/Live\\_Scenes\\_from\\_New\\_York#/media/File:Dtlsfny.jpg](https://en.wikipedia.org/wiki/Live_Scenes_from_New_York#/media/File:Dtlsfny.jpg) . Confession withdrawn very soon. \n\nAlso, Slayer released \"God Hates Us All\" and Killarmy released \"Fear, Love & War\".",
            "Probably the best day in the city to do whatever.\n\nAlways be prepared for when life gives you lemons. Stab a bitch and sacrifice her to God for free Allah virgins to sell to alligators in the sewer before the cops notice.",
            "That part was one of the most gut wrenching for me. The way he comes up with that genius but horrible way to stop Hank from exposing him. It's so evil",
            "What year?",
            "Ew",
            "nah you should have kept it to yourself man wtf",
            "By far, the worst one thus far. I hope you get better",
            "rookie numbers",
            "Ewww liking tomboys is gay",
            "Flair checks out.",
            "That's just the officer who's arresting you.",
            "*[pees in ur ass](https://i.imgur.com/JSImHiV.jpg)*\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/shitposting) if you have any questions or concerns.*",
            "Who's Joe, and which day?",
            "Hey Jeff, it's Doe 174. How's it hanging?",
            "*[pees in ur ass](https://i.imgur.com/JSImHiV.jpg)*\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/shitposting) if you have any questions or concerns.*",
            "*[pees in ur ass](https://i.imgur.com/JSImHiV.jpg)*\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/shitposting) if you have any questions or concerns.*",
            "RIP OP",
            "Hey, I think I've seen you in the queue there! You were the one with the cameraman next to you?",
            "No - rather, in Texas it is *hot*.",
            "I stole some clothes from the thrift store",
            "I was shopping at a thrift store and someone took my clothes right off me",
            "I witnessed some guy stealing someone's clothes in a thrift store",
            "Idk I was at a thrift store",
            "Idk I was outside a thrift store and saw someone run out with some clothes",
            "I masturbated at a naked dude inside a thrift store",
            "I went to high school and then went home after school.",
            "Ummm I don't remember but ig early 2000s😳",
            "*[pees in ur ass](https://i.imgur.com/JSImHiV.jpg)*\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/shitposting) if you have any questions or concerns.*",
            "So your saying that Liking a girl is gay but Liking a guy isn't?",
            "Joe Mama",
            "My name is Alexie and I watch porn without masturbating",
            "Aforementioned cameraman here. Nice to hear from you guys again! \n\nDoes anyone know who started the circle jerk further back in the queue?",
            "Hope you recovered well 🙏",
            "Liking femboys is NOT gay",
            "It's true, I'm the gay midget porn Alexie watches.",
            "Actually I jumped out of the plane🦅🦅",
            "Femboys are guys",
            "You may or may not have forgotten your passport before the jump.",
            "It is NOT gay",
            "THEY HAVE A PENIS",
            "YOU DON'T SEE IT IF YOU FUCK THEM FROM BEHIND, IT IS NOT GAY",
            "THEY STILL HAVE IT",
            "YOU CAN USE YOUR IMAGINATION SO YOU DON'T SEE IT"
        ]
    },
    "An opening appears\n": {
        "title": "An opening appears\n",
        "score": 2158,
        "url": "https://i.redd.it/135hqmhaq18d1.jpeg",
        "content": "",
        "num_comments": 67,
        "comments": [
            "Whilst you're here, /u/Zestyclose_Pound_650, why not join our [public discord server](https://discord.gg/QpBGXd2guU) - **now with public text channels you can chat on!**?\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/shitposting) if you have any questions or concerns.*",
            "This movie sure was something. I definitely did not expect to see ALL of her bits",
            "Hentai ahh situation",
            "what do they mean by tv in this situation (i’m dumb lol)",
            "\"yeah that's cool, but can you give me a hug?\"",
            "Jokes on you I'm immune to pussy",
            "Just except that you are probably the bottom, I know I would",
            "Finger but hole",
            "Speak friend and enter",
            "This is cooler than that time Walt got Jr. that Challenger. I'll take the PT Cruiser and the pussy thank you.",
            "I would make full use of the situation at hand.",
            "If the genders in this movie were reversed everyone would be disgusted and I’m tired of pretending it’s ok",
            "Calling the cops for prostitution",
            "Sauce?",
            "He didn't actually know they paid her to be his girlfriend till the end.",
            "I'd say that i have solid principles and that i'd refuse, but tbh i don't know",
            "Tbh I'd feel for a cock and be disappointed that I wasn't going to be able to rail a femboy😔",
            " Ill just be thinking to myself like is this a sign?",
            "Booty",
            "she probably was like \"fuck it. everyone seen it already anyway\"",
            "What movie bro",
            "Wow, I just looked it up, she really doesn't hide anything, does she?",
            "It’d be a hentai situation If I were there\n\nThen I’d wake up.",
            "The whole movie is that",
            "Stop saying ahh brainrot ughhh.",
            "It's the name of the board.",
            "I don't want sex, I want love 😔😔 (I don't get either)",
            "Flair checks out",
            "Tarnish me harder daddy",
            "Melon",
            "I don't know why you're being down voted, it's truth",
            "What is he name of the movie\n\nSo i can avoid it",
            "For real 🥺",
            "“At least this time I get paid”",
            "No hard feelings",
            "At that beach scene she was fully naked without any blur or odd camera angle.",
            "Dawson don't go out from okbp jailroom",
            "erm what the sigma",
            "[removed]",
            "yeah i’m still confused (i’m definitely gonna get downvoted for this)",
            "*[Bazinga](https://i.imgur.com/iJB0FVe.jpg)*\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/shitposting) if you have any questions or concerns.*",
            "Real",
            "Kill yourself",
            "By way of explanation, not endorsement, I suspect the reason it’s different is because men and women are perceived as different. In broad generalities men are perceived as being generally more horny than women, so a situation like this satisfies that stereotype. If the genders were reversed it would not work because women are seen as less horny and desperate. Men are by orders of magnitude more likely to sexually assault women so it would also seem less funny.",
            "No hard feelings",
            "It's okay. Just tell me the name of the movie",
            "hard",
            "Umm, time stamp pliz ?",
            "YOU CAN’T KEEP ME IN THERE!!!",
            "Rizz rizz skibidi sigma skibidi sigma alpha",
            "Bruv..",
            "*[pees in ur ass](https://i.imgur.com/JSImHiV.jpg)*\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/shitposting) if you have any questions or concerns.*",
            "Boards are the 4chan version of subreddits",
            "4chan is organised into boards,  just like reddit into subreddits here. OOP is just asking everyone on that board how would they react, same as saying \"How would yall react\"",
            "tv is an abbreviation of television in this case",
            "Okie dokie",
            "And women have absolutely no problem getting laid if they want to (and sometimes unfortunately when they don’t). The plot just doesn’t work the other way around. If this were a movie about little Suzy there would already be a line of hard dicks ready to take her down no matter how unattractive or nerdy she was.",
            "Bruh",
            "feelings",
            "new response just dropped",
            "braincells went on vacation, never came back",
            "*[pees in ur ass](https://i.imgur.com/JSImHiV.jpg)*\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/shitposting) if you have any questions or concerns.*",
            "Holy hell!",
            "*[Bazinga](https://i.imgur.com/iJB0FVe.jpg)*\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/shitposting) if you have any questions or concerns.*"
        ]
    },
    "GTA VI leaked actual footage ": {
        "title": "GTA VI leaked actual footage ",
        "score": 606,
        "url": "https://v.redd.it/m1gogft9h38d1",
        "content": "",
        "num_comments": 8,
        "comments": [
            "\n#[DownloadVideo Link](https://www.reddit.watch/r/shitposting/comments/1dls3f9/?utm_source=automod&utm_medium=shitposting)\n\n#[SaveVideo Link](https://rapidsave.com/info?url=/r/shitposting/comments/1dls3f9/)\n\n\n---\n\nWhilst you're here, /u/No_Beginning_627, why not join our [public discord server](https://discord.gg/QpBGXd2guU) - **now with public text channels you can chat on!**?\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/shitposting) if you have any questions or concerns.*",
            "Grand chop auto",
            "It's only amusing for that one mission. After that, it's just a constant loop of dog and cat noises for the entire game?",
            "Reddit at 5am is a fever dream",
            "Reminds me of that one adult swim show with the weird Egyptian looking dude with fucked up limbs, great show when you’re tripping balls",
            "man that dawg is high as fuck"
        ]
    },
    "this new generation will never understand ": {
        "title": "this new generation will never understand ",
        "score": 3633,
        "url": "https://i.redd.it/5elb9y3qd08d1.jpeg",
        "content": "",
        "num_comments": 40,
        "comments": [
            "Whilst you're here, /u/imakemencry_, why not join our [public discord server](https://discord.gg/QpBGXd2guU) - **now with public text channels you can chat on!**?\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/shitposting) if you have any questions or concerns.*",
            "Simp phase is a terrible time in a mans life",
            "I’m glad he grew up a little, but god was that arc so…pathetic",
            "Finn was still ready to give beatings to villains as a 16 year old, while also sometimes being pathetic.",
            "I mean most kids go through these parts in that age group so it handled it pretty well.\n\nYeah when I look back at my middle school and high school relationships, it was cringey as fuck but it was also part of learning and growing up \n\nAT is such a damn good show…. But fuck that deer with human hands tho :c",
            "Me back in the day after learning they added lore",
            "In the fiona and cake show i love that finn is fucking yoked and can 1v1 just about any monster like its a normal Tuesday, even if he's super depressed about jake, i mean who wouldn't be?\n\nEdit: ok not super depressed but you can definitely tell hes a whole lot different cus of it",
            "Damn, just like every human male after puberty. I feel ya Finn.",
            "Reason why season 3 is peak and season 4 is the worst.",
            "L take honestly, Fin much like the series itself become better as the seasons progress",
            "What puberty does to a mf\n\nWe got to see his cringey moments",
            "well we all had that phase in our lives",
            "Bro was bullying a mentally ill elderly for fun",
            "He became stronger after growing out of it",
            "Now make gigachad Finn going to the island cuz I loved that arc",
            "Is this a shit post because of the title of the post, not the post itself?",
            "Wait...he aged throughout the series?!",
            "I like lemon grab",
            "the only thing I know about Finn is him saying prepare thyself",
            "I didn't like Adventure time watched regular show instead",
            "I'm watching this with my kids and they are loving it",
            "I remember the old days",
            "Bro fell off",
            "Bro fell off",
            "Flame princess was the worst arc. After that it was still pretty good, but man… early adventure time was the fucking best… Magic Man is definitely one of my top 10 characters in all of media, and I mean that unironically.",
            "Puberty be like that sometimes frfr",
            "he turned into Mordecai and around that time and Mordecai turned into an asshole (it was around the time when he broke up with cloud girl)",
            "I never liked the flame princess dating arc from the start. Imagine a girlfriend you can't touch. Made no sense to me, still doesn't, also why didn't Finn just use that blue anti-burn spell so he could actually touch flame princess?? And the way they broke up was also stupid",
            "The one that had that badass speech or one idk about?",
            "*[Bazinga](https://i.imgur.com/iJB0FVe.jpg)*\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/shitposting) if you have any questions or concerns.*",
            "Yep, literally last season has him celebrate his 17th birthday.",
            "I like the later plot because I'm a fkn psychopath who loves to see characters suffer\n\n^(I'm actually just someone who gets absorbed into stories, and a masochist)",
            "What show is this?",
            "I went out with someone like flame princess, very frustrating. She was catholic and had it in her head that touching her hands or kissing would mean she went to hell. Her parents fucked her up nicely",
            "There are also spin-off series. He was 29 in his last appearance",
            "Bro was bullying a mentally ill elderly for fun",
            "May I interest you in our Lord and savior Slaanesh ?",
            "adventure time",
            "Bro could use a lobotomy",
            ">\"Lobotomy? Like, the Corporation?\""
        ]
    },
    "Easy solution 😮🤤": {
        "title": "Easy solution 😮🤤",
        "score": 741,
        "url": "https://v.redd.it/recbbx1gh28d1",
        "content": "",
        "num_comments": 12,
        "comments": [
            "\n#[DownloadVideo Link](https://www.reddit.watch/r/shitposting/comments/1dlpa8b/?utm_source=automod&utm_medium=shitposting)\n\n#[SaveVideo Link](https://rapidsave.com/info?url=/r/shitposting/comments/1dlpa8b/)\n\n\n---\n\nWhilst you're here, /u/EveryCreator, why not join our [public discord server](https://discord.gg/QpBGXd2guU) - **now with public text channels you can chat on!**?\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/shitposting) if you have any questions or concerns.*",
            "What is bro cooking?",
            "Please do not the Mamba",
            "It's hip to",
            "Who let bro cook? 😭😭 Also what's his @?",
            "He meant to say “You will be irresistible to the females” not they’ll be irresistible to you",
            "the gorilla is probably the best,iirc never make eye contact and you should be fine",
            "Im pretty sure that snakes wont attack you unless you force them to, unlike gorillas which just want to break your spine for fun"
        ]
    }
}