{
    "For those wondering what the sub icon is.": {
        "title": "For those wondering what the sub icon is.",
        "score": 4370,
        "url": "https://i.redd.it/y2k0vkhk2gab1.jpg",
        "content": "",
        "num_comments": 143,
        "comments": [
            "Literally a shitty tattoo",
            "Race tracks in the undies!",
            "What's the bj scene to the left tho?",
            "That's our flag.",
            "Calvin Klein Calvin",
            "Ok - that's the worst I've seen.  \n\nEven worse than No Ragrats",
            "Imagine being the guy who’s tattoo is the logo for a community (comprising of half a million people) centered around bad tattoos",
            "Poopy!!",
            "Deserving of the shittytattoos icon.",
            "This is genius in my opinion. Best way to incorporate a mole/birthmark into a tattoo that I’ve seen",
            "Such a well ironed pair of tightly whities too.",
            "Can we just have a standing ovulation for this? Honestly, I think I might shed a tear.",
            "I thought everybody's undies had moles, freckles and birthmarks/beauty marks?",
            "Looks like a tiny soldier running",
            "This tattoo deserves more appreciation 😭",
            "Honestly that's ATBGE... I'd rock that",
            "It’s so badly done but it’s hilarious 😂😂",
            "Oh no 🙈",
            "I like how it doesn't end there.. there's bunch of other shitty tattoos... especially bad when they are like this together.. it looks like the door of a family fridge",
            "The yellow stain on the other side :)",
            "Ummm the real question is whats the tattoo on the left? After zooming in, my best guess is it's someone on their knees in front of a glory hole? Doing what I suppose one does on that side..\n\nEdit: now I'm starting to think that's not a door or wall with a hole in it but a crucifix? If that's the case, idk. Beyond me.",
            "Everyone is saying it looks like shit but my first thought was period blood.",
            "This dude really got a poop stain tattoo and a lady giving a bj to a man disguised as a tree🤦🏻‍♂️",
            "Just came here for the first time and said “What’s that sub icon” and it was immediately answered. Thank you.",
            "I thought everybody's undies had moles, freckles and birthmarks/beauty marks?",
            "When your skin becomes a dumpster…",
            "This is why you don’t wear whitey tidies",
            "Good use of a mole.",
            "Good god. Underwear is horrible enough, but with SKID MARKS??",
            "That is definitely a crucifix on the left. You can see Jesus' feet overlapping at the bottom and you can see the slit in his side where they pierced him with a spear.\n\nHas anyone managed to find the full pic yet?",
            "With a cute little stain too!",
            "I hope whoever got this inked on them feels confident that their shitty tattoo is the sub icon",
            "Doodie!!!",
            "This one is fantastic",
            "That is hilarious 😆",
            "I can’t help but wonder if this person is a Back to the Future fan.",
            "Okay but am I wrong for kind of liking this😗",
            "Now, I realize that tattoos are supposed to represent your individuality, free spirit, etc., who you are, and all that crap.  Do you truly feel that you are shitstain, and choose to broadcast that to the world? For as long as you are alive? Unless you are truly stupid, and I am not ruling that out, you do realize that it won't erase with a magic eraser?",
            "I'm speechless",
            "Obviously, it's a rear view of a fart that turned out to be more than just a fart.  Another tattoo that will be entertaining in a rest home someday.",
            "Hahahahahahahahahahahahahahahah",
            "I literally just wondered this.",
            "\"it's a megalodon tooth\"",
            "Needs some Oxy Clean",
            "Hahaha",
            "🫣😬",
            "Is that a bacon strip?",
            "This is the best tattoo I’ve seen",
            "I want to see the rest of this \"canvas's\" tattoos lol",
            "Is that last part “calving”? Cause gah damn that’s just drunken incoherence",
            "Omg",
            "Thats kinda unique tho i like it maybe redo it with colour and more cartoony and it would look neat and unique",
            "is that….. a skid mark..??",
            "Oh my god.",
            "Jesus Christ. That took a minute.",
            "On point.",
            "All hail the Lipple.",
            "LMFAOOOOOOOOO 😂☠️",
            "Why?",
            "This goes hard",
            "Glad to see my name is on the pfp of the sub",
            "hilarious",
            "YIKES!! On so many levels!",
            "HA 🤣☠️",
            "This made me fucking cry laughing in front of my gf and she thought I was looking at pics of our dog.",
            "I Laughed waaaaaayyy too hard at this.",
            "Damn",
            "This one actually made me\nLaugh",
            "Damn I have a really good birthmark on my stomach that would look even better than this one🤔😈",
            "Magnificent",
            "That’s a god tattoo",
            "Obsessed",
            "‘Fellas, is it gay to wash your ass?’",
            "Too much Taco Bell huh",
            "There are no words….",
            "I like this tattoo.",
            "It’s a period piece",
            "Apparently the brown spot is a birthmark.",
            "r/shartytattoos",
            "never heard them called race tracks before. Always heard skidmarks... interesting.",
            "Code brown!",
            "Vroom vroom 💨",
            "SKRRRRRT",
            "Looks religious in nature... 😬",
            "Jesus getting some head",
            "I like how she's reaching up to touch his nipple. Very sensual bj depiction, I'm rock hard",
            "looks like Calvin Klein Calving",
            "No…rugrats? Hey, at least they don’t have to worry about kids…",
            "He called the shit, poop!",
            "Really?!🫣. .      🙄",
            "This is a typo right? Otherwise it's fucking hilarious! 'a standing ovulation' 😂 😂",
            "(whispers) no",
            "I was thinking hand grenade. Or melanoma",
            "Yes, definitely a crucifix. You can see the slit in his side where they stabbed him with a spear to make sure he was dead. That and his feet overlap at the bottom of the cross.",
            "Yes!",
            "Whitey tighties 🤦🏾‍♀️",
            "Just like Walther whitey",
            "It's bloody brilliant",
            "it sure is a way to use it",
            "that's a horrible way to use your birthmark 😭",
            "r/subsifellfor",
            "Lol this! I’ve grown up hearing skid marks but racetracks is friggin hilarious!",
            "Bacon strips!",
            "Is getting blown a sacrament?",
            "I wouldn’t want to explain THAT tat when I get to Heaven! 😬",
            "I think it’s genius because it’s absolutely hilarious. The horrible execution just adds to it. Would I ever get something like this? No way in hell- but this shits funny.",
            "Not a typo, an intentional pun lol",
            "![gif](giphy|1BXa2alBjrCXC)",
            "I’m thinking melanoma too😳",
            "Ew wtf is your avatar",
            "Bloody shit? I don't want that.",
            "Here's a sneak peek of /r/SubsIFellFor using the [top posts](https://np.reddit.com/r/SubsIFellFor/top/?sort=top&t=year) of the year!\n\n\\#1: [First time 😔](https://i.redd.it/sgpy4pml1oqc1.png) | [174 comments](https://np.reddit.com/r/SubsIFellFor/comments/1bo5t74/first_time/)  \n\\#2: [Þats not a real sub](https://i.redd.it/opd2qgcvnpqc1.jpeg) | [96 comments](https://np.reddit.com/r/SubsIFellFor/comments/1bod4u6/þats_not_a_real_sub/)  \n\\#3: [Got double tricked](https://i.redd.it/lmscgwes1wxa1.jpg) | [47 comments](https://np.reddit.com/r/SubsIFellFor/comments/137thjb/got_double_tricked/)\n\n----\n^^I'm ^^a ^^bot, ^^beep ^^boop ^^| ^^Downvote ^^to ^^remove ^^| ^^[Contact](https://www.reddit.com/message/compose/?to=sneakpeekbot) ^^| ^^[Info](https://np.reddit.com/r/sneakpeekbot/) ^^| ^^[Opt-out](https://np.reddit.com/r/sneakpeekbot/comments/o8wk1r/blacklist_ix/) ^^| ^^[GitHub](https://github.com/ghnr/sneakpeekbot)",
            "In Germany  we say ralley stripes (also skid marks)",
            "Yeah, if you're nailed to a cross like in this example 🤣",
            "Nice one! 😉",
            "😂😂😂😂😂😂",
            "Ach zu liebe!  \n\n\nThat's awesome. lol.",
            "😂😂😅",
            "Unnnff… The body of Christ 🥵",
            "Ach, du lieber gott. 🤣",
            "So hawt",
            "Gott in Himmel!"
        ]
    },
    "Is it me or is this going too far?": {
        "title": "Is it me or is this going too far?",
        "score": 410,
        "url": "https://www.reddit.com/gallery/1dlp4og",
        "content": "There’s videos of him tattooing in the street. Looks real but it can’t be right?",
        "num_comments": 145,
        "comments": [
            "Is it dumb? Sure. \n\nBut is it really dumb? Yes it is.",
            "Holy shit those are all by the same person",
            "I want to know why the wine stain didn't get completed.",
            "As an abstract artist myself I really truly believe some things aren’t made for tattoos lmfao. All power to em though I guess. Kinda hate em tho",
            "You can already see the regret on #5's face",
            "These are terrible omg",
            "Some of his stuff would maybe even look cool if he wasn’t so bad, like if he actually put some effort into getting better with the tattoo gun. But tattooing people in a dirty fountain, using kids… you are putting people in danger for your art, even if they consent it shows your moral compass is all kinds of fucked up",
            "The second one was in a post a few days ago here and someone told me it’s not permanent ink. That was the fact that made it a little bit better to me. All in all clearly shitty.",
            "I think he regards himself as a performance artist.  There is a video of him using a drone to do the tattoo",
            "Rich parents for sure",
            "I work in the tattoo industry and everyone I know thinks this \"artist\" is an absolute joke and his tattoos are disgusting",
            "What scares me is the number of people liking this trash.",
            "\"Ink me like an autopsy freezer leftover.\"",
            "The photos look like the answer to “Show me where he hurt you.”",
            "Comment Series N°69 - Pretentiousness. This response sought to ridicule the notion that by use of a puffed up title, one might bestow legitimacy upon the incompetent scribbles of a self-satisfied halfwit.",
            "As shitty as a tattoos can be",
            "who decides whats going too far?\n\nasking this sub everything besides black and grey lions and clocks goes too far. and there was a time where people said lions and clocks are going too far,etc etc. silly question.\n\nthe real problem is,rixard is \\*allegedly\\* a dogshit person,banned in multiple shops in spain for \\*allegedly\\* raping women.",
            "\"Art\"",
            "How cool that Pinocchio was walking by for number 5",
            "4 looks like tatty daddy busted on his chest.",
            "This \"artist\" saw this sub and said, \"Challenge accepted.\"",
            "Number one looks like he's been infected with miasma in the 17th century",
            "Those people have to keep the pictures of the shadow on their phones forever to show to people what those stupid shapes on their bodies are supposed to be.",
            "I thought this was a medical condition lol",
            "This looks like he has some sort of flesh eating disease.",
            "Slide 4 caption, ‘due to various circumstances the tattoo could not be completed’ the guy hated it and stopped you halfway through lol, but wow the final slide is the genuinely top 10 worst tattoos i have seen",
            "#it is way too far",
            "i thought posting that artist was considered cheating",
            "Is that purple primer for doing PVC piping?",
            "I understand the concept, but it’s not a good concept, and I hate it. Well, except pic 2, no clue what tf that’s even supposed to be.",
            "Reading the captions makes it clear the dude with the tattoo gun is just experimenting his wildest ideas on actual people instead of synthetic skin. Truly deranged.",
            "ngl the first picture looks like some of the Orcs from the Middle Earth, Shadow of War games.",
            "abstract or abuse? They just look like cuts and bruises at this point",
            "First one is their homeland and they had a dye pack explode several days prior on them. 😂",
            "How the f do these tattoos get so manny likes??",
            "It's one thing to be experimenting with a concept, which arguably is quite cool, it's another to be so objectively bad at executing it and another still to be tattooing in a fucking railway station!\n\nMake your stencils.out in the field. Go back to a safe, sterile place to tattoo them.",
            "Words can't describe how much i hate this specific artist, he has some really creative ideas but the execution is horrendous and unsafe",
            "4? What on earth could have stopped them after 6 lines? But have enough time for the photo shoot",
            "It looks like shit, but the fence silhouette isn’t a bad idea. Like if it was a fence from your childhood home or something that could be nice. But with an actual tattooist with actual skill.",
            "brother, what the fuck is #4? 😭",
            "I bet they think they are so clever and artsy. 🤣",
            "Dude really got a tattoo of a fence.",
            "The first one looks like he robbed a bank and had a dye pack explode on him.",
            "Gross.",
            "People lining up to look like this. Amazing",
            "Why would you do this seriously. Tattoo is to be done by a highly skilled artist, not from a depressed kid that got a tattoo gun off Amazon",
            "This is like a kindergartner getting ahold of scissors and cutting their own hair.",
            "“ I like meth and ART !” …,, “ Check it out man “ .",
            "No its not going too far, using a baby as a stencil for your art is tho… Talentless artist using shock value to get famous",
            "People really how no respect for their body or gave way to much trust in an “experiment” 😂",
            "As shitty as these tattoos are this guy is always tattooing, he does not struggle to find people to do this shit on. I feel like it’s more of a performance piece than a tattoo, not sure how I feel about it.",
            "Slovakia Moment",
            "The fence one is kinda cool. Executed shitty rho",
            "Isn't no 1 just the before picture with the drawn \"stencil\"? If so it could look pretty nice with a bunch of different colors. The face part isn't to my taste but well, I don't have to live with that.",
            "What is it?",
            "Looks like you saved a lot of money",
            "Werent there some allegations against this guy? I only have vague memories of unfollowing him because some women spoke up? Hope Im not misremembering",
            "Basically mutilation",
            "There is no too far...there is only further down the road and these people as literally only at the doorstep",
            "Art is art. And this is shit.",
            "#justfuckmyshitup",
            "This sub never disappoints.",
            "What even is going on on #4?",
            "\"Yeah uhhh I'll take some scribbles please\"",
            "LMAO",
            "This is such a dumb idea. There's nothing cool about it at all",
            "I think the shadow is a cool idea, shit execution though",
            "Am I the only upset by his jorts??",
            "I mean. It's their bodies ans money. They can do whatever they want.  \n\nThen i will make fun of them on the Internet.  It's the circle of life.",
            "First guy can create real trouble for himself should he ever be in an accident.",
            "Last one reminds me of the trump silhouette going ooohhh",
            "This is the kind of shit you do on paper, not permanently on someone’s body.",
            "The person in the first pic looks like he needs a hospital",
            "I instantly knew who’s wOrK this is lol , so far the worst I’ve seen. They also go around the world and to those lol 🤮😭",
            "When you’re so bad at doing tattoos you have to come up with an excuse for each design…",
            "The worst part is you can tell they’re european.",
            "This is a war criminal actively posting their crimes WTF",
            "Yuck",
            "\"\"\" art\"\"\"",
            "Weird people. Weird tatoos",
            "What the hell am I even looking at?",
            "What is #2 supposed to be?? In fact, what are any of them supposed to be??",
            "I'm sorry but what in the a.i.d.s.",
            "Well, obviously the purple part there is the land.",
            "I love how the worse the quality is, the deeper and more artistic they try to be.",
            "The purple one looks like he's a phone screen going bad.",
            "How does he get that many likes lol",
            "I actually like 1 lmao",
            "I don’t think these are real, at least not all of them. You have the same guy in a couple of chest pictures.  Totally different tattoos which cannot be exist at the same time.",
            "Everyone hating on this stuff has tribal tattoos I just know it.",
            "The point isn't to look good",
            "A guy once asked to be non lethally shot for performance art - Shoot by Chris Burden in 1971. As long as it's all consenting, these people can do whatever they want.",
            "If you search him you will recognize a lot of the tattoo that have  been on this sub",
            "He did the tracing around a baby’s hand tattoo too (with the tattoo gun!)",
            "Various circumstances, duh. It says so right there.\n\n  \nSeriously though, I suspect the asshole with the tattoo gun fell asleep from the drugs they were on and couldn't finish.",
            "Are we sure this isn't an ink bomb stain from a robbery?",
            "This idiot was probably tattooing THROUGH the wine stained shirt and someone sane pointed out it was a terrible idea, making the mark stop him.",
            "100% I've made some paintings I'm really proud of and other people have liked , but they would look terrible as a tattoo. I don't want my art done by someone else, on a medium that doesn't suit it, it would just look wrong. At least this is the guys own art? That's the only brown paper lining I can find in this.",
            "If they were part of a collection where good tats were and it was was a aestheic blast over thing itd be cool but a lot of abstract is just gimmicky",
            "#1 looks like a burn victim",
            "Thinking about how to cover this “art project” up",
            "If it didn't look scribbled on it looks kind of cool.",
            "The shadow one and the urban architecture one could both look cool work competent lines",
            "Is the performance called “Giving This Poor Moron Hepatitis”?",
            "wow, this is so spot on",
            "I didn’t understand this comment until I saw his instagram profile. This is hysterical hah!",
            "I get what you mean but it's not just about the art itself, it's the way he tattoos that's the biggest issue to me. He's risking some serious infections by doing this, I mean the wine stain tat was literally done through a shirt. I just hope the people he does this to are informed of the risk.\n\nAlso yikes, didn't know that.",
            "I mean you can’t deny these all look like shit right? they all look unfinished or just like straight up nonsense",
            "Idk I’m not a tattoo artist but I think there’s a difference between doing thing that are requested and actively seeking work that have a good chance of becoming a serious regret. \n\nI don’t think this is the same as someone coming asking for a face tattoo when having no other work done on them or something heinous/vulgar. Some believe morally you should say no. Some believe it’s a job, just warn them about the risks. However this is something he encourages. And like face tattoos, vulgar, racist, etc. it has a higher risk of being something people will seriously regret in the future. \n\nIt seems like, from what you’re saying, he wants people to be a part of the performance. Which in that case he’s putting these “permanent” designs on people in purposely unsanitary settings and doesn’t care. I saw a couple of his replies to comments saying they’re not safe and he makes a joke of it. \n\nOf course the other person consents to the work but still… seems to me like they now have something on their bodies where the benefit of the “art” was solely the process more than the end result. \n\nThe raping women part I didn’t know about, seems to align with how he uses people’s bodies. There’s women in the porn industry who consider themselves having been raped. They signed up to do an “abuse” scene but it goes way further than what was described. They couldn’t back out while in it because of either fear or pressure or both. Obv the porn example is much more extreme but there’s still the same idea of feeling trapped to finish the process.\n\nPeople getting these tattoos could have regrets mid way but now they’re stuck with feeling like they gotta ride it out and hope it comes out ok. If it’s solely about the artistic process then he’s putting them in the situation where he doesn’t care if the tattoo itself looks good because he just cares about the performance of it. \n\nI mean there’s people on this sub who post their tattoos and say similar things. “Why didn’t you stop” or “why did you approve it” or “why didn’t you tell them you didn’t like the result and wanted it fixed”? You always get responses from the posters saying they felt embarrassed, hoped the artist would do a better job, didn’t understand how tattooing works, didn’t want to be left with unfinished work so hoped for the best, didn’t want to be confrontational with the artist, etc. Many reasons for feeling almost forced to accept something they don’t want. \n\nAgain not saying this is the same level as what happens to people in the porn example but it’s a similar idea. I mean who knows if some of these subjects tell him they’re concerned with how the tattoo is going and don’t want to continue. And he pushes and reassures that it will turn out great. I’m not sure that’s totally consenting anymore.\n\nAnyways, just playing devils advocate I guess. I thought of this but also was comparing this to the Galaxy or ocean tattoos that are popping up but look like a rash. Seems like a more extreme spin off lol.",
            "it literally is. art does not mean only pretty things you understand.",
            "I think it is a dude in a baseball hat, where the visor part of the hat “becomes” the Pinocchio nose.",
            "Yeah kids these days aren’t too handy but YouTube has them thinking they’re diy tradesmen.",
            "They took nettles and pressed it against her leg. Then tattooed the rash on her",
            "Comment says something about a wine stain but I’m not seeing it",
            "No no. The purple is bubbles that were splattered. The black lines are supposed to be an artistic representation of it.",
            "They took nettles and pushed it against her skin. Then “traced the rash”.",
            "No those are all different people. Go look. They may be fake, idk. But they’re not the same guy.",
            "My mind instantly pictured Barney saying, \"I'm taking tattooing to strange new places.\"\n\nAt first it was Barney from the Simpsons, but after I started typing that it is now Barney the purple dinosaur.",
            "😬😬",
            "I’m hoping it was because the guy getting tattooed came to his senses and stopped the madness",
            "So ignorant",
            "1 makes me think about Blaschko lines",
            "oh yeah if you watch it through a sanitary lense ofc lmao,im a tattoo artist and would have the biggest anxiety. but tbh there are shops that are not less nasty then tattooing through a shirt lmao. but at the end of the day they are consenting adults (though he \\*allegedly\\* is not a big believer in consent) and its part of the performance.",
            "i mean i could deny they look like shit actually,like you can deny they look good,who cares and who is to tell? its  just not the point of these tattoos. its about the performance and not the finished piece,he never posts a tattoo without the process,because thats literally what they are about.\n\ni said it in another comment,art does not mean ''only pretty things i understand''\n\nedit: still fuck this guy for other reasons lmao",
            "thats true for literally every tattoo session tho. and a lot of what you are saying are just assumptions,like you can regret your american traditional rose just as much as whatever he is doing...some people dont regret their racist face tattoos etc. etc. its just the human experience to grow out of decisions you made,or maybe dont.\n\nwhat you are describing are general issues that something so intimate like letting someone tattoo you brings with it. like having sex on camera ( i get your point actually and its not that farfetched,tattooing is very intimate and something that requires a lot of trust,like sex. and this trust can be betrayed,thats something that could happen no matter what kind of sex you have,or what kind of tattoo you are getting is my point tho)\n\nim a tattoo artist and let me tell you,a lot of shops are just as nasty. people just not sanitizing anything,pouring ink cups back in to bottles,re using covers etcetc. i get it,it looks weird for me too,but i also would know how i would go about tattooing outside with minimal risk.\n\nat the end of the day these people definitely know what they are signing up for,i would argue they know more what they sign up for then a lot of people getting their first tattoo in a licensed shop by some biker boomer you know. and the risk of regret is definitely the same.\n\nand i have to say im just defending performance art here,no matter the medium thats used. i am in no way definding this \\*alleged\\* piece of dogshit human.",
            "Agreed. Art can be terrible, doesn't mean it's not art.",
            "totally agree.",
            "I know, I just thought the perspective was funny",
            "Oh, okay. I thought pictures 1 and 5 were the same guy.",
            "Yeah but a traditional rose isn’t the same as randomly poorly done squiggles. If it’s performance art then he has no intention of the tattoo looking good.",
            "it has clearly no intention of looking good to you and people like you,and yeah they are not supposed to be the same,and yet you can regret both the same. and looking good is simply subjective. people also said rothko is going too far,pollock is going too far,basquiat is going too far etc. they would just squiggle shit and its not looking good yadda yadda. its always the same cycle people are confused by. and thats ok."
        ]
    },
    "Is my tattoo shitty?": {
        "title": "Is my tattoo shitty?",
        "score": 389,
        "url": "https://i.redd.it/3cdd05s2108d1.jpeg",
        "content": "Got it when I was 15. I’m afraid if I gain any weight, I’ll have a shooting star.",
        "num_comments": 162,
        "comments": [
            "This looks like album art for some beep beep boop boop music",
            "It’s a shitty titty tatty.",
            "it just looks like you have a favorite nipple lmao, not a bad tattoo, just a bit strange",
            "I'm sorry this photo looks like something from a true crime podcast. Tattoo is fine though",
            "For the star of, what Im assuming is, a Russian prison documentary it's not too bad.",
            "This photo is art",
            "I picture Paul Stanley of KISS seeing this and saying, \"Why didn't **I** think of that!?\"",
            "The tattoo is fine, but are you being held hostage right now?",
            "I think it's a bit shitty because you asked, and that got me to think whenever or not it is shitty. Should I had seen it on some random picture on the internet I would probably not even thought about it. In some ways it's hiding in plain sight",
            "I've seen a lot worse. Besides, the only thing that you should concern yourself with is whether *you* think it's shitty, not what people on the internet tells you",
            "Tats fine I think but it looks like they have a gun behind the camera",
            "Are you a Gogo dancer at a gay bar?",
            "Good thing you blocked out eyes and there's no other identifying marks on you.",
            "actually this is awesome",
            "It's hilarious. I highly doubt you were going for comedy though but the serious expression and facial features clash bad with the party titty",
            "i think its pretty damn coool",
            "Yes it is.",
            "Yes",
            "You should get one on the other titty, the current star titty looks a little lonely 🙏",
            "It looks like a male pornstar tattoo to be specific.",
            "Very, why would you get a black bar tattood over your face? You'll never land a job censored.",
            "It looks like an ad for Grinder.",
            "Yeah, it hides your eyes too much.",
            "No",
            "No, and that one tittys' a star!",
            "it just makes you look like a twink. and if youre not gay then i would describe it as Nipply, or neeply",
            "Absodamnlutley....and yeah, I made this up specifically for you.\nCongratulations!",
            "Are you in a Russian prison?",
            "Dumb!",
            "Yes",
            "Shitty 90s lady pornstar tattoo",
            "honestlyyyy i like it a lot",
            "If we were on a date, and it was going well, and we went back to somewhere private, peeling off one another’s clothing…\n\nAnd then I see the nipple star…I would seriously reassess the situation.  🤣\n\nJoking aside.  It makes me think of the Dr. Seuss story about the sneeches with and without stars.",
            "![gif](giphy|bWM8K7vMziAJavYko6|downsized)",
            "No. /s",
            "Yes",
            "Yes.",
            "His Rap name should be liddy tiddy",
            "No words",
            "Yes",
            "Yes it is!",
            "yes",
            "Yes",
            "Depends on what you define as “shitty”. Creativity 0, placement 0, as an artist my question is why, but also as an artist not my place to judge, you do you; I just apply the tattoo. It’s done well if you mean if it’s shitty as in the work is sloppy. No, it’s good linework. Would this be a tattoo I would suggest or think of? Absolutely not for well hopefully many obvious reasons… but you as a person? Who cares? It’s your tattoo, your body, and well let’s hope; your idea to begin with. 🤷🏻‍♂️",
            " On a stripper? 8/10 shitty.\n\nOn you? 563.410/10 shitty.",
            "Tbh.. I think it’s cool",
            "I just want to start off by saying that I have bad taste in tattoos. But I kinda like it because it’s dumb. It’s shitty in a fun way.",
            "Nobody's gonna notice the tatoo with a hairline like this",
            "Album cover",
            "Yea",
            "Yup, Very much so. ",
            "No, but it makes me feel sorta shitty.",
            "Yes",
            "I mean, at least it isn't a bull's-eye.",
            "Yes...shitty",
            "no. its interesting",
            "Stitty",
            "Yes",
            "Yea",
            "Well, I mean, it’s not great 😬💁🏼‍♀️",
            "Yes",
            "Yes.",
            "No, not really. I mean a start on your nipple, I don't get, but it's not my titty so I can't be witty. \n\nThe other one, I like a lot ❤️",
            "i like it a lot this is so cool",
            "Yes.",
            "Yes.",
            "Very shitty looking, you might want to look into a rehab program. I mean if you were not wasted when you did this than maybe a shrink is needed",
            "Gives 70s porn star ⭐️ 😂",
            "Yes.  Yes it is bad, really really bad.",
            "You just blacked out your eyes? At least it's solid.",
            "No u",
            "I love it tbh",
            "Honestly this album goes hard",
            "I'm not sure how you fix a filled black bar across your eyes, that's just a choice you'll have to live with.\n\nEveryone wants to get a star for their hard work, it's nice someone gave your nipple one.",
            "Worst. Tattoo. Ever",
            "Tats and tits never seem to play well together.",
            "I like it",
            "How did you get it to look like it extends off the side of your face like that?",
            "First of all i love this photo, secondly I love the tat and I love that you love it. Totally get the moon on the other side!!",
            "Sheriff of stupid-ville",
            "I'd say basic rather than shitty.",
            "It’s as shitty as it can be. (And overing your eyes isn’t gonna help).",
            "I really like the placement it looks good",
            "No but in a good way.",
            "Less shitty and more just odd/eccentric. The lines are straight and it doesn't look like you got it in prison or did it yourself while tripping balls lol.",
            "Wow! That tattoo is crazy! How did you make the black box reach beyond your face????",
            "I like the tattoo",
            "I don‘t think it‘s shitty at all. The only thing I‘m asking myself: how can you see through that?",
            "I like it a lot! It's truly unique, but simple!!",
            "I kinda love it",
            "How do you see?",
            " Nou but that one that covers your eyes what is that",
            "Are you a Bloodhound Gang album cover? 😄",
            "I love it lmao I’ve always wanted to get my nips done. \n\nThis looks like a picture that could have been in the Hangover - just woke up with a a star nipple tattoo that you don’t remember\n\nI don’t know if you have any other tattoos we can’t see but it’s like an Easter egg but on your body.  with clothes no one would suspect… pull that shirt off and BAM star nip! The party nip",
            "Not if you like the band Kiss",
            "Man that’s unfortunate! Hope you can get it taken off your album cover",
            "Kinda iconic in my opinion ",
            "The album is called Areola Borealis",
            "Bee bee bop.. boo boo bop? \n\n-SpongeBob",
            "I imagine he's a nihilist.",
            "I believe you’re thinking of beep boop beep beep",
            "This is what I needed to hear, thank you",
            "It's a itty bitty shitty titty tat",
            "I mean it’s not poorly done from what I can see, but it is an interesting choice. I’ve kinda always wanted to do heart nips,  I’m a woman, but I’d want them to look like actual nipple tbh!",
            "But if he owns it he could be the Shitty Titty Tatty Daddy.",
            "Love that book.",
            "It’s a tittoo!",
            "So youre saying you DONT have a favorite nipple?",
            "Now OP must either live life knowing he has a favourite nipple or get the matching tattoo on the other nipple so it’s not feeling left out.",
            "Nah - advert for twink",
            "Trainspotting publicity kit",
            "Close, I’m polish lol",
            "Hahaha that made me laugh out loud Fr",
            "😆🤣😂",
            "Three short blinks, three long blinks, three short blinks",
            "I love it personally",
            "im in tears rn",
            "I kinda like the asymmetry!",
            "Polish prison :(",
            "Nah, the placement is perfect",
            "But it's a STARt",
            "What’s your favourite hot pepper?",
            "Iconic name",
            "At this time of the year? Localized entirely in your nipple?",
            "🤣🤣🤣",
            "Areola Borealis!? At this time of year, at this time of day, in this part of the country, localized entirely within your kitchen!?",
            "No it's bee bee bop ... Bee boo boo bop\n\n- Mr. Crabs",
            "It's needs to be turned into Patrick Star.",
            "In all fairness, tatting a tit is just poopy in general. Fat bags should be left alone",
            "Do not.",
            "Don't we all?",
            "It's like how women have a dumb nipple and a smart nipple for breast feeding. Favor the wrong one for too long, and the baby comes out dumb.",
            "I was thinking a moon",
            "This is exactly right.",
            "Im sure you've heard the tweet before but you're not beating the \"he has a sadness in his face you usually only see in eastern european gay porn\" allegations lol",
            "The black bar is preventing me from decoding the blinks.",
            "Double album, and every track is a banger",
            "May I see it?",
            "Lmao I don’t think I’d actually ever do it, but I’ll always kinda want to. Maybe if I ever need a mastectomy I will get heart nipples as a little treat to myself!",
            "I can honestly say that I do not have a favourite nipple, and mine have fed two kids. Never considered one as a favourite 🤣",
            "That actually goes with your band name so it’s acceptable",
            "Why does everyone keep telling me that?!",
            "*Ba Ba Baaaanger*",
            "No",
            "Aaahaha.  I would do it too but do it anyways if you pass peak mastectomy age. (Whatever age that is…) Everything I’m not sure about doing now I’ll definitely be doing it if I make it over 70.",
            "My favorite is my higher one 😭",
            "They didn’t have a favourite?",
            "Lmao it was a tweet that went viral. You have very eastern european features and I think in general people from that area tend to look more serious in pictures instead of fake smiling like people in the U.S. do. So that combination just reminds people of the tweet. You're good looking but you look so serious in this pic that to Americans it reads as \"sad\".",
            "Ummm…a mastectomy is the removal of your breast/s because of cancer. You don’t “peak” at a certain age, cancer doesn’t discriminate. Perhaps you meant a mammogram, the actual diagnostic test used for diagnosis and screening. With that, you should stop regular yearly exams at 75. Oh and if you do own a pair, do your self exam once a month. Look after your girls! Breast cancer is an ugly business…star nips or not. The more you know… 😊",
            "My son did, he preferred my right boob 🤣"
        ]
    },
    "Local shop near me": {
        "title": "Local shop near me",
        "score": 110,
        "url": "https://www.reddit.com/gallery/1dlm6j2",
        "content": "Was looking for a piercer and found these gems along the way. ",
        "num_comments": 25,
        "comments": [
            "Marilyn Monroe reminds me of this\n\nhttps://preview.redd.it/fhzeqxtyy18d1.png?width=1080&format=pjpg&auto=webp&s=c3bbf0754a3bbbadf1e31a2bafcf078a9bd01fec",
            "portrait tattoos are rarely a good idea.",
            "A local shop, for local people...\n\n![gif](giphy|Ya2o92Smq6Ila)",
            "Thanks, I hate them.",
            "How is it even possible that I feel like the rose is the worst one?",
            "Sorry to the person who has to walk around with that.",
            "Scott Storch needs to get a DNA test to see if he’s related to that baby and to Murilen Menrow\n\nhttps://preview.redd.it/jz22ozt8w38d1.jpeg?width=399&format=pjpg&auto=webp&s=bc8259376db9c8699e401ba27185d83413eaa273\n\nFunny that they all have the same mouths and I have no idea how I came to that conclusion but I see Scott Storch in both of those tattoos",
            "The first one is kind of cute. The last two are completely dog shit. Great post.",
            "Shops like these need to be shut down. There is a caliber of \"artists\" that is clear that they don't care to improve the state of their work and are content to be charging people money for sh*t tattoos. It's infuriating how just, allowed it is.",
            "Marilyn Monroe, X-Files version",
            "Pre-Invisalign Marilyn",
            "Hasnt Marilyn been through enough",
            "Brutal",
            "lol….let me guess, the third one is Aunt Rose.",
            "Logic?",
            "This artist has never seen a human face before. It’s the only explanation",
            "Do these guys not use stencils or something?",
            "I'm dead the first one is so fucked up",
            "These look like the tattoos on tattoo masters",
            "Marilyn “Montoe” 😬",
            "She almost looks like Scully from the X Files",
            "I can't tell where it is located?",
            "Like, cute in a “that little deformed kitten is so ugly it’s cute” way?",
            "I was thinking Megan Fox",
            "It's on their right shoulder, but yeah it's real bad."
        ]
    },
    "He really committed": {
        "title": "He really committed",
        "score": 314,
        "url": "https://i.redd.it/1kzpqx47rz7d1.jpeg",
        "content": "",
        "num_comments": 55,
        "comments": [
            "Those balls look like cactus",
            "What do you think his motivation is? Is he gay and loves cock? Does he just love busting nuts like that? Is this some sort of unconventional power move?\n\nThe tip and the balls are just bad. There's no fixing it at this point.",
            "why are the balls social distancing??",
            "Who only shaves one testicle is my main question?",
            "Jesus.",
            "https://preview.redd.it/zb4t2x9z608d1.jpeg?width=609&format=pjpg&auto=webp&s=d1f448ebc80cf6a2e211ee9646aeb4d66aaa5e6d",
            "Looks like 3 different artists did the separate parts. The ballhair style is totally different, and the peener doesn't match either ball... 🤔",
            "This honestly doesn't look like it was consensual",
            "Flips up. . . .trace it.",
            "*object not drawn to scale",
            "There’s so much commitment involved in this. \n\nSome people get bad tattoos cuz they legitimately don’t give a fuck but this guy *definitely* gives a fuck to endure this.",
            "He's Just copying Steve O now.",
            "WTF!?",
            "F",
            "Ahhh…he must be one of my brethren from r/caffeine",
            "Honestly.....I respect it",
            "Maybe he lost a bet",
            "This is literally the worst tattoo I’ve ever seen. Interestingly, it looks like several “artists” collaborated on the project because the shaft is veiny and realist, whilst the balls are clearly each “prickly pear” and post shave “stubbly.”",
            "Why people do that?",
            "He needs committed.  That belly button and scar are just extra cringe alongside Prickly balls ...and is that a mole or an attempt at a prince albert piercing?",
            "did someone take an axe to the bellend? jesus",
            "I know I only have my standard white boy issue dick n balls to look at but this perspective of the this veiny beast seems off. Balls dont take sides I thought they where always hanging around the middle ground. Gravity keeps them from choosing the left or right wing. I'd like to talk to the person who blasted that hog on this guys chest and ask if he had some reference material or was he working from memory.",
            "Go big....or go home I guess",
            "He wishes his was that big",
            "think you mean /cum/-itted\n\n![gif](giphy|4ANvpVwGGWfrG)",
            "This is DISGUSTING ! YOU KNOW DAMN WELL THIS WAS DONE IN SOMEBODY'S BASEMENT ! THERE ISNT A ARTIST ALIVE THAT OWNS A SHOP THAT WILL DO SOMETHING SICK LIKE THIS !",
            "The cock looks like it's been crossed with Audrey II from \"Little Shop of Horrors\", while we're talking.",
            "And the bifurcated urethra is a bonus.",
            "And the tip looks like a pac-dick\n\nGonna nom nom some ghosts",
            "Why are they different? Is one shaved?",
            "*cacti",
            "Golden cactus. They’re real nice. Got em at Home Depot.",
            "Lost a bet maybe",
            "That's gonna be one BIG fucking sick-ass panther.",
            "Insecure about his small pp",
            "I often assume the worst: prison tat…not exactly a consensual one at that.\n\nOr A.I.",
            "Marking as someone's bitch in prison. That's what most of these are for. Human trafficking would be my second guess, though those people usually tattoo their gang sign or property of (name) on their trafficked people.",
            "Forced tattoo. Whoever ‘owns’ him had him branded.",
            "I doubt he's gay. He's probably a bit hit with the ladies. ",
            "I honestly feel like these morons get tattoos like this because ‘it’ll be really funny’ then when people stop laughing 10 minutes after it’s done they just get smacked in the face by the instant regret of having to look like a dumb ass for the rest of their lives.",
            "He has to be taking it, otherwise it would be backward and his balls would be on top.",
            "Probably a druggie. I’ve seen tattoo artists pay them $5 to give them a huge cock tat.",
            "Lol I have no idea why I laughed at your comment",
            "I legitimately don't think this was consensual. He was abused in prison most likely.",
            "Feed me!",
            "The pain I felt reading this.... ☠️",
            "I’d have said a side-profile view of Homer Simpsons mouth.",
            "Prick-ly pear",
            "Who the hell has a crowd of friends who consider getting genitalia tattooed across your chest as reasonable stakes in a bet?",
            "Hah well that was my literal reaction to opening reddit and seeing this pop up (no pun intended) >_>",
            "Feeeed me Seymour…",
            "Chest no. Stomach though?",
            "This is exactly why I come to Reddit 😂",
            "If I had a nickel for every time…"
        ]
    }
}