{
    "You will never know how many sleepless nights others will have because of you.": {
        "title": "You will never know how many sleepless nights others will have because of you.",
        "score": 1130,
        "url": "https://www.reddit.com/r/Showerthoughts/comments/1dlm10j/you_will_never_know_how_many_sleepless_nights/",
        "content": "Whether worry for your wellbeing, friendship, longing, or anger, you don't know how much you influence others' thoughts.   \nMaybe the way you smiled just that that one time made them fall in love with you.  \nMaybe there was a very long night where you were in a dark place and none of your friends knew how to find you.   \nMaybe one of your friends noticed you entering a relationship that wasn't right for you and stayed up all night worrying.  \nMaybe when you fell ill, they wanted to be nearby, just in case.  \nMaybe they're desperately, desperately hoping that tomorrow's answer to The Question is \"Yes!\"  \nYou leave an imprint everywhere you go, and you'll never know the shape of it.\n\nBut I wonder - how many sleepless nights, and for whom, and why? ",
        "num_comments": 89,
        "comments": [
            "Interviewer: What keeps you awake at night?\n\nMattis: Nothing. I keep other people awake at night.",
            "I'm pretty sure no one is losing sleep over me, other than myself.",
            "I guarantee no one is losing sleep over me lol.",
            "That's the winner for longest shower thought.",
            "wow. funny coincidence im seeing this rn. yup.",
            "And it’s not always with a good perspective. Sometimes, we hurt people badly which takes their sleep away. Nonetheless nothing can be done to change it now.",
            "Take a magnesium supplement half an hour before bed.",
            "If someone is losing sleep over me, they need to stop and re-evaluate themselves",
            "This thought might keep me up tonight",
            "Quite true for sure, parents, loved ones and friends, this makes alot of sense",
            "I am afraid I gave my mother quite a few sleepless nights, rest her soul",
            "A friend of mine whom I've started to to climbing with has become the cause of some sleepless nights. She'll never know if it's up to me because she already has someone, and therefore will be the cause of more sleepless nights in a different way.",
            "I like this showerthought, sounds so genuine and thoughtful",
            "I don't sleep much, not sure how I function on  few hours sleep. Not a single person loses sleep over me and it's incredibly lonely when the desire to talk to someone, anyone is so strong, but there is no one to interact with.",
            "Lol, Noone gives a crap about my life.\nNoone is having sleepless nights for me...except  my parents...you overestimate how much people care.",
            "If they are losing sleep over me in longing, they need to raise their standards.",
            "Is this reddit hopecore",
            "It's nice to think at some point someone I barely knew in a brief interaction felt some spark of intrigue that left them feeling upbeat for the most fleeting of moments",
            "What keeps you awake at night?\"\n\n\"Nothing. I keep other people awake at night,\" mad dog Mattis responded",
            "You're having sleepless nights thinking about how many sleepless nights others will have because of you. 😂",
            "Truly terrifying to think people have lost sleep over me.",
            "LoL. No1 loses sleep over you unless we are talking about kids in their 20's... edit: or parents for their kids.",
            "I'm pretty sure the number of sleepless nights others had because of me equals zero.",
            "Loud ass neighbors that live above you…..if they have kids then I’m sorry people but somehow you will feel like you have them too.",
            "hmmm I hope not, but the thought is flattering in a way that feels evil",
            "I will never care about how many sleepless nights others will have because of me.\\*\n\nLife mate. It happens.",
            "Well I can’t know the upper bound, but I have lower one of 97, no I will not say what I did.",
            "None, I think most of our phones are super dry and that tells you everything you need to know about people who you think are “thinking about you”",
            "Nobody is losing sleep over the thought of me. Especially losing me.",
            "I won't lose any sleep over it.",
            "Little far fetched. Actually in 90% you can deduce if someone may have sleepless nights over you in situationships for example. Me personally have never suffered of insomnia bc of someone’s random smile lol",
            "Obsessive ex, she had MANY sleepless nights. I think they were because of me, but I don’t know",
            "Not a goddamn person is losing sleep over me",
            "And I sleep lime a baby knowing this 😃",
            "I’m a 36 year old virgin with 0 friends.  \nNo one cares about me.",
            "It’s creepy to think that anyone would lose sleep over me lol",
            "Well to be fair there's a lot of things i don't know.",
            "Meanwhile I’m losing sleep to my fiancé who probably never thought we would lose sleep for her",
            "The most upsetting thing about these replies is how many people feel that their shape in the world isn't enough to leave an impression others would care about :(",
            "Had a similar thought and wrote this back in 2022:\n\n“I Wonder Who I’m Haunting”\n\nLaying awake at night, haunted by old ghosts,\nFriends and family that, have hurt me most.\nLaying awake at night, thinking about these scars.\nThings they said and did, that hit me hard.\n\nLaying awake at night, wondering if they know,\nThe hurt they caused, by all those blows.\nStrangers I forget, and couldn’t care,\nIt’s the people close, that cause nightmares.\n\nAt this age, we’ve all done our share,\nWith long trips, there’s baggage to bare.\nTo escape all these ghosts is daunting,\nI wonder tonight, who am I haunting?\n\nSome small thing I said, some small thing I did,\nPerhaps unaware, of the pain I’m causing.\nIt was self-defense, or maybe spite,\nWith so much time passed, who’m I haunting tonight?\n\nSome big thing I said, some big thing I did,\nIt was on purpose, I’m guilty as sin.\nI knew it would hurt, I used those sharp words,\nSaw where you’re tender, took aim with a sword.\n\nNow I’ve forgotten, and moved on my way,\nAbsolved of my sin, yes I self forgave.\nAnd left you with all the pain and the scars,\nThat you think about, as you lay in the dark.\n\nLaying awake at night, in your still room,\nOh could it be, oh could it be?\nSomeone else’s dreams?\nYou’re a ghost too.",
            "I am a very strict college professor teaching courses in philosophy and semiotics. I’d hope is hundreds and hundreds.",
            "I should be safe from that then, I'm pretty sure that requires interacting with other humans... >n<",
            "I wish I knew who these people were because it’s truly depressing when you wonder if anybody is thinking about you at all, or at least the people you really want to be.",
            "And I’d prefer to keep it that way.",
            "That requires people to care about me, which is zero",
            "Sounds like a them problem. 🤷 \n\nAs a lifelong participant in the experience of anxiety, I've at this point learned not to shoulder burdens outside of my personal responsibility. Someone else's sleeping patterns (and/or their overthinking) are not my responsibility, regardless of whether they are thinking about me.\n\nIf anyone out there is losing sleep over anyone or anything, I'd recommend a reality check, some good exercise, and a dose of magnesium before bed.",
            "Oh i know very well.\n\n0",
            "Or how many people will masturbate thinking of you. If any.\n\nThis is Reddit. Most probably zero for most of us.",
            "Technically not my problem at all. I will still sleep all my night",
            "As someone who is losing sleep over someone, I like this showerthought.",
            "I know exactly how many sleepless nights my neighbors are having because of my kids.",
            "My ugly ass would have people losing sleep over trauma of looking at my face",
            "\"Yes, I consider this a strength\"",
            "Well now I'm not going to bed, I was about to. Thanks.",
            "Depending on how you look at it, it can be a good thing.",
            "I have been looking all over the world for you. Everyone though you was dead and they was talking like you were getting trouble and this and that. We stayed up collectively at night all of us thinking hard \"where could he be, where could he be, where he be?\" We sweated profusely just thinking about the options, like maybe you was eaten by a crocodile or driven over by a car or beaten with broken glass bottles for saying hi to another boy's girl. I'm just glad you is alive but we lost collectively like two years of sleeping between everybody.",
            "Think I know what you mean. Don’t reach for the nope rope just yet, tomorrow might be better.",
            "?",
            "Same here.",
            "I felt this deeply",
            "Why? What happened?",
            "Same",
            "A little too im-the-main-character for my taste.",
            "You may underestimate how many lives you touch. I thought the same, but sometimes it's just your own little belief bubble that blinds you to reality. If you try reaching out, the more connections you find. And maybe if it truly is just your parents, how wonderful to have parents who care, im glad you have them.",
            "I don't know. I think it's a reminder that nobody is an island, in a time where a lot of people seem to feel terribly lonely and isolated.",
            "I lose sleep over how people cannot spell lose.",
            "That's beautiful, thank you for sharing x",
            "same :(",
            "Was they",
            "Nope ropes is snakes,,, you talking about the solution slinky",
            "Magnesium can help you sleep.",
            "That's certainly true, it's an egocentric interpretation after spending all night thinking about someone. :)   \nHowever, I don't feel like consideration of the impact you might have on others without knowing it is necessarily a bad thing?",
            "Well I may have touched many lives, but noone is losing sleep over it. People have a lot of stuff going on in their own lives to lose sleep over.",
            "I wouldn't, but you do you. \n\nAlso, thanks, I corrected it.",
            "It’s 12:42 AM, why am I on Reddit?",
            "it’s because of niccoSun ☹️",
            "u/niccoSun how could you do this to me?"
        ]
    },
    "We'd all get a hell of a lot more done if humans had a natural mating season. ": {
        "title": "We'd all get a hell of a lot more done if humans had a natural mating season. ",
        "score": 8820,
        "url": "https://www.reddit.com/r/Showerthoughts/comments/1dl4uw5/wed_all_get_a_hell_of_a_lot_more_done_if_humans/",
        "content": "",
        "num_comments": 471,
        "comments": [
            "everyone's uninterested in sex most of the year except for two weeks annually when everyone gets horny and businesses and government offices and shops and supply and retail and infrastructure work all grind to a halt as everyone is too horny to work\n\nimagine that being the premise of a tv show",
            "Yeah but it would be The Purge every spring.",
            "But then we’d have an entire season where nothing got done, ever. “Sorry, dry cleaner’s closed, we’re all busy trying to have sex with everyone in the world before the leaves start changing colors.”",
            "Nah..look at the animals..i think we achieved this much because we are constantly horny",
            "It seems like [most birthdays ](https://images.app.goo.gl/F2Byz2grb4chUAyq8) are between July and September, so you could say winter is our natural mating season.",
            "From what I've experienced, this is traditionally called Nighttime.  We just have have too many mating seasons a year.",
            "Read *The Left Hand of Darkness* by Ursula Le Guin. It has a similar premise with the addition that all of the people on certain planet are genderless and asexual until the monthly breeding period where everyone gets a gender and fucks. Then they go back to normal and get shit done the rest of the month.",
            "\"For many of you, this will mean much less breeding. For me, much much more.\" Comic Book Guy",
            "Imagine hospitals in ~9 months after that.",
            "Hornieness is a major driving force behind most of the human Marvels",
            "Spring has always seemed like a mating season.",
            "Futurama covered this: the energy we put into trying to get laid is the foundation of much of civilization.",
            "That’s assuming everyone’s time is constantly being disrupted by sex or sexual thoughts which is not a universal experience.",
            "Everyone's birthday being a max of 3 months apart.\n\nMate in autumn, global party in summer",
            "One of the reasons why female humans have been in similar roles to male humans is because the human reproductive system empowers them by giving them control over reproduction\n\n  \namong other things, it has forced human penises to be gentler, soft, rounded, because unlike other animals with mating seasons such as lions or bears, the human females chose when and with whom, so the forced strategies of other mammals worked at a disadvantage\n\n  \nmammals with mating seasons are also tied to natural cycles much more, which impedes their growth ourside of narrow climatic conditions, you cant have mating seasons and inhabit nigeria and greenland alike",
            "It's one of the many reasons that I got married.\n\nMe: I'd have a lot less to think about, and more time to focus on other things, if I left the dating scene behind.",
            "I’m always in the rut, it’s maddening.",
            "Ah yes, the month of Murderandrapeuary",
            "Ever heard of Valentine's Day?",
            "This post made me realize humans don't have a natural mating season whatsoever. It's year-round and we do it whenever we want. I've been revolving around the sun for 20 years and just now I realized this. Can't wait to forget about it as I scroll onto the next post, but at least this comment will serve as an anchor of when I, JNORJT, was commenting on this post at 03:45 PM On 06/21/24 in my downstairs PC bedroom using my downstairs PC while taking a break from livestreaming on Twitch.",
            "Harry Turtledove wrote a book series on this premise. He made a race of aliens that mated seasonally. He had the opposite conclusion. The alien society progressed far more slowly than humanity because they lacked the constant urge to compete and improve that are instilled in us by our year-round sex drive.",
            "I mean I have a monthly breeding period right after my week of being turned into the human embodiment of a bear who just got woken up by a flashbang and then punched in her womb/gut.",
            "and then we could make fun of the people who are obviously not getting some.\n\n\"look at fuckin JOE over there being PRODUCTIVE during mating season like a beta LMAO\"",
            "It's called cuffing season.  ",
            "Is it the time when the summer dresses come out?",
            "We kinda do though? Everyone is out meeting new people during spring and summer and during the fall people are finding someone to stay warm and inside with during the winter. At least that's how it works when you're younger.",
            "My sex life would still be non-existent 😂",
            "We would, but then again we wouldn’t",
            "Too much nuance to agree with this. But it's a fact that we would get a lot more done if people felt valued for their jobs and tasks done.",
            "Like an x rated version of the purge 😂",
            "Our presidential candidates register in the Spring of the year before the election.  So they spend 18 months preparing to hopefully be chosen.  \n\nYou think a horny guy would do less?",
            "My mating season is never",
            "How much fucking are you doing to where it is affecting how much you get done in your daily life???",
            "I'm not sure that's true. Humans are pretty violent and while intelligent, modern life has made many people think they're smarter than they are. I predict a whole lot of murders would happen during mating season and potentially enough to offset any babies being born. There's also a certain percent of the population that would spend the non mating season plotting on what to do during mating season instead of working",
            "Not to be a Debbie downer; but so much grape and SA would happen and people would blame it on the mating season. Trauma and lots of terrible actions would take place, more than the mountain that already occur. :(",
            "Who’s to say the breeding season wouldn’t be longer and more chaotic. Disagree.",
            "Except lot of what people do is for sex and to impress.. I feel like it would be much less productive",
            "Those poor hospitals",
            "Wdym? If the mating seasons were shorter than, basically all the time?",
            "They do. When the gorse is in flower ",
            "Get what done? What’s the point if you don’t get to enjoy the tiny pleasures in life?",
            "My natural mating season is always.",
            "Salt....that is the mating season.",
            "we kind of do though. july august and september have significantly more births than any other months, using this information we can deduce that humans are hornier in october november and december than any other months in the year. hence the mating season for humans is october through december.",
            "humans evolved to take advantage of being able to have babies at any time. This means you can sneak one in whenever you get the chance, increasing populations. Animals that have mating seasons often rely on the seasons for timing. Imagine how weird the world would be if people from the Northern Hemisphere and Southern Hemisphere could never get married because our mating seasons are 6 months off. You would have some kind of weird xenophobia where differnt cultures literally can't intermix.",
            "For some reason I'm picturing that episode of Star Trek Voyager where the Vulcan dude basically went into \"heat\" so to speak. I can't remember exactly but I think it happened in like 7 year cycles, and if he didn't copulate he would go crazy and/or die.",
            "We would if we expected half a dozen babies at a time.",
            "I try to get it done in the first 12 months of the year.",
            "There won’t be enough doctors and nurses for the birthing season I don’t think. Even less if most the women are going to need paternity leave.",
            "Sure, and our genitals and gonads would form during this season. Let’s call it ”kemmer”. We would have ”kemmer houses” to meet up with others in heat. And meds to delay kemmer if we need to. We could call our fwbs ”kemmerings” and so on…",
            "[we do have a mating season](https://miro.medium.com/v2/resize:fit:720/format:webp/1*3INl6HmVLi2UspFwR3OjPg.jpeg)",
            "We do to a small extent, late spring and early summer, notice a lot of birthdays are in late winter (February-March), we've just mostly evolved away from the need for a strict mating season as have all primates.",
            "But that one month is gonna be crazy",
            "I am assuming it is one of the key evolutionary leg ups we got as a species to be able to make it so far. And you are forgetting all the shit that won't be getting done during the mating season... Pandora's box right there Dude.",
            "We do. Its just 24/7",
            "Imagine everyone having their birthdays in the same few weeks.",
            "We do, it's called 24/7/365.",
            "I'd get less done because I'd have to start mating",
            "we inverted our sexual cycle (to basically fuck ALL the time), became social creatures, and developed HUGE BRAINS as a result and then made language.\n\n... so no, actually we owe our productivity and societal advancement to our \"fuck whenever\" evolution.",
            "Climate change would be throwing it out of wack lol.",
            "Nah.  Have you seen the animal kingdom during mating season. It’s a slaughter",
            "We actually have more babies in July and December than the other months so there might already be something happening.",
            "Or… not? What’s the drive to be successful and make money, work on yourself throughout the year to attract or maintain a partner if we all just went into heat for a couple weeks each year? We’d probably lose a huge amount of productivity if nobody cared about anything besides feeding and sheltering for most of the year.",
            "Honestly, I still don't understand why we don't have a mating season like a lot of other mammals? Is it a primate thing to not have a heat cycle?",
            "I'm ace and I still can't manage to get anything done.. 😭\n\n(Well, moreso started.. I procrastinate too much lol)",
            "Are you sure? We might be spending too much time with ourselves.",
            "Well there would always be mating season *somewhere*.",
            "then there wouldn't be as many people complaining about being virgins on reddit.",
            "Then I'd be that animal in the documentaries, who woke up late and loses all chances of mating.",
            "If Spring was human mating season it would be like… oh, look winter is coming up, y’know EVERYONE’S birthday.",
            "This is a book and it’s called The Left Hand of Darkness by Ursula Leguin! Great book, check it out",
            "PLAP PLAP PLAP PLAP PLAP GET OP PREGNANT PLAP PLAP PLAP",
            "Since gestation is 9 mo, I’m gonna go with “You’re wrong.”",
            "With my luck Half of it would be taken up by factories asking people  to work overtime because of the shortage of manpower. Everyone out there acting like rabbits and I'm stuck at work doing three people's job",
            "Kinda weird, but I was thinking this this week how most animals have mating seasons, and we just be fucking whenever.  Imagine everyone just had a fucking season then everyone was born within a certain timerange so we all shared birthdays",
            "Rutting season? More like nutting season 😂",
            "it would be hard to sync withe everyone",
            "You guys are having sex?",
            "When I was young and lived in a college town there seemed to be a clear season.\n\nSpring was for breakups.\n\nSummer was for casual fun.\n\nFall was for picking someone for winter.\n\nWinter, you both just get fat and chill for 3 months, making grand future plans. \n\nspring was for breakups.\n\nSummer seemed to be where most of the fucking happened.",
            "We have one here in Brazil. It's on February.",
            "Ah yes, the month of Murderandrapeuary",
            "As a single male, I’m convinced we do. My phone starts blowing up all through summer",
            "Duh, we have a natural mating season: it's when you are not sleeping",
            "We do. It's winter, then spring, then summer, then autumn.",
            "Yeah up to a point. It'd be like The Purge, and you know it.",
            "Man started wars for vegene. You want to condense male testosterone into 1 season???????",
            "That just describes bridgerton.",
            "This would be awful- there would be excessive rape and murder.",
            "Imagine being single during the mating season.\nValentine’s day is bad enough",
            "We do. It's November. In the northern hemisphere.",
            "We do. We have two mating seasons. When it's my birthday, and when it's not my birthday.",
            "Cue Amock Time music",
            "Imagine dying of some sort of preventable disease because every doctor is too busy banging their spouse.",
            "Finally an interesting shower thought!",
            "I remember reading a short sci-fi story about this.\n\nA scientist decides that all this fuss could be dealt with by making some changes to human biology, to make women sexually unattractive and unavailable except for a few days a month, when they were fertile.\n\nHe discovered what he thought was the correct mechanism, and released it without actually getting approval from the world's population or governments (IIRC it was a new synthetic hormone or a gene edit).\n\nChaos and commotion for weeks, then it settles down and the scientist's wife contacts one of her friends to see how she's doing.\n\nTurns out that \"the change\" affected men, not women. For three weeks a month, men weren't interested, couldn't get it up, etc, and women didn't have to worry about unwanted attention. Then for one week a month, men couldn't think of anything else, so for that week, women held the power and could get men to do anything they wanted, if the men wanted any sex that month.",
            "Without sexual competition there is little reason to do more than the bare minimum.",
            "We would still have recreational sex.",
            "Its called getting married then you will have a breeding season once in a while",
            "We kinda do, though. I haven't got the source, but I read somewhere a long time ago that most people are conceived in fall/winter. So most people get their frickfrack on during those seasons (mostly winter). Probably because of the festivities and everyone's indoors.",
            "Technically, there's only a about a week out of every month where a woman is likely to get pregnant. If humans only had sex to get pregnant, then this would already be pretty much normal. The real issue is that humans have sex when they are not looking to \"mate\". Or, perhaps, humans are constantly \"mating\", trying to find their mate, rather than looking to reproduce.",
            "Yeah cause that's what we need as a society, to get *more* done. We're definitely not producing enough and middle manager/bureaucratic population isn't remotely saturated. All this pesky year round love and romance really gets in the way of our full market potential",
            "New years, Valentine’s Day, 4th of July.",
            "Imagine the pressure when you got now game and every mating season comes you get nothing. I feel like the mating season will end up being like The Purge with gangs of incels hurting innocent people.",
            "This is my favorite post in a while… I’m thinking…",
            "Oh look, random redditor is smarter than evolution.",
            "Oh, I don't know...men bucking each other to death like mooses before raping the lady mooses three months out of the year...I don't really see the efficiency.",
            "Yeah........but all of the animals would blame humans for plagiarism.",
            "Ummm, in some places it's called \"snow days\"",
            "I believe this would likely take place towards the end of the year like New Years?",
            "Men would lose 90% of their incentive to accomplish things.",
            "So what about those without mates? Would they just up and rape people or humping anything for several hours!",
            "We do, it's called 24/7/365.",
            "Look up the Pareto priciple. Eighty percent of men have no mating season 😢",
            "Human mating season is around November as births significantly spike July and August each year. ",
            "I've hit my mid thirties, and I think I've hit my breeding season. I have never wanted sex as much as I do now!",
            "... kinda reminded of Anthem, a little, with the prescribed \"Time of Mating.\"\n\nAlso, makes me feel a little disquieted because it raises the question of would these \"mating season\" humans have as much qualms about the age of consent?",
            "Shakira released a song about this like 20 years ago.  It is called \"Whenever, Wherever\".",
            "wdym, I'm mating right now.",
            "That is true. I did do a lot of fucking around yesterday.",
            "We wouldn’t be able to raise children as sex is a pair bonding ritual between couples.",
            "“The splurge” followed by “38 weeks after”",
            "Surely there's gotta be a book or comic about this",
            "Imagine using \"Its mating season!\" as a reason why you were late to work lmao",
            "Imagine the delivery room 9 months from then.",
            "The Purge - Mating Season",
            "Mating season is mainly largely just a female thing in the animal kingdom. Males would happily mate with them at any point in the year given the chance.",
            "most of the people I know were born in December, so we kinda do",
            "I remember my friend in college informing me that she was in heat out loud in the dining hall one day. I was like… I don’t think we go in heat… lol",
            "Every time a woman ovulates it’s mating season. Men are always ready. I used to own cattle and the bulls were always ready to go and the whole thing rotated around the cows cycles. Then once the cows were all pregnant the bull was taken away because he was no longer needed. A lot of animals operate this way if you think about it. Males are designed to be able to impregnate females at all times, to ensure the survival of the species.",
            "What can you do through? Coomers gonna coom.",
            "Imagine society just shutting down during mating season altogether.",
            "We do, it's called spring.",
            "So we do and then WE DO. Every 28-32 days. But then the beginning of the cold season (not the first day of winter but the first cold day your in your area) and the Lent. Lots of families have to try and get pregnant by fat Tuesday or on it lol",
            "This was actually a thing. Look up the “great rite”. Everyone fucked on the full moon and went about their biz for the other 27 days",
            "Sequel to the purge, the surge.",
            "Its called valentines day",
            "[Don't be ridiculous, think of the smell...\nYOU HAVEN'T THOUGHT OF THE SMELL, YOU BITCH!](https://youtu.be/yJYKpJ7ur9M?si=8R2BClQytM5vFTp0)",
            "Mating season is for the purpose of reproduction, so we'd actually get less done because of all the protests by the vocal minority's accusations of exclusion since they choose not to mate to procreate and have redefined gender and sexuality to fit feelings rather than biological reality.",
            "Rape would be so much worse.  You think our sex drive is bad now?  Factor in heat and rut.  Holy shit, it would be awful.",
            "Doesn't matter at this point; women have unilaterally shifted to bestiality; they've openly declared that they want to have sex with bears,",
            "0 evidence to support this.",
            "Sounds like ‘Tell me you hate sex/orgasms without saying you hate sex/orgasm… yet want to possibly reproduce (yuck).’ \n\nNope.\n\nOnly reason to get out of bed. Shower after sex.\n\nOnly reason I get work done- get it done and get to have sex.\n\nIf that’s the case, this girl is offing herself. No reason to continue this pitiful (waves vaguely). Yes yes nature is great. Camping sex! Stargazing sex. You sense the pattern.",
            "I could get a lot more done if I had a thumb on my penis",
            "We do-ish it's a period of our lives but because of our mating habits we tend to select singular partners that we get territorial over for the purposes of child rearing and resource investment. Because we're always horned up we're evolutionarily incentivized to be there to raise our kids.",
            "Like Klingons! Once, what, every 6 years? Lmao",
            "we do have a natural mating season. Start eating the things natur gives you and you will soon learn why swedes celebrated midsommar. ",
            "And if we got rid of money",
            "How’s that true? During mating season nothing would get done. All productivity would average out in the long run",
            "Don’t forget all the fighting",
            "\"The urge\"",
            "Followed by Baby Week nine months later when all the hospitals convert into giant maternity wards and all elective surgeries are canceled, and regular emergencies get downgraded. The January advantage in hockey would disappear as well. ",
            "This was a recurring plot line in \"Dark Angel\", the Jessica Alba sci-fi show that James Cameron created.  Her character was a genetically altered assassin, and one of the side effects of incorporating feline DNA was that she would occasionally \"go into heat\" and be too horny to think straight.  Those episodes were fun, and generally played for a bit of comic relief.\n\nOf course there's also the Vulcans on \"Star Trek\" having a mating season concept.  Talk about raising the stakes, their biology was such that they would literally DIE if they couldn't get some booty during that time!  But that's getting away from human stories.",
            "The horny purge",
            "Could be a Black Mirror episode.",
            "Pon Farr",
            "Or omega-verse",
            "Literally ursula leguin wrote a book with this premise and it’s great, you should read it! The Left Hand of Darkness",
            "Asexuals would be gods in this world",
            "Nah, they'd just make rutting season into a business too. All retail shops, hotels and such will convert to massive fuck houses and charge by the hour. Not to mention sales of \"services\".",
            "You should read the Left Hand of Darkness by Leguin. Similar concept although it’s not really central to the plot",
            "Usually August or September isn't it.",
            "To be true to the animal world, the men would all be dressing up and being as flamboyant as possible to attract attention, and the women would be choosy as hell. And strong enough to ward off rapists.\n\nThen they'd do it in the streets.",
            "For those of us with high sex drives that’s the experience 365 days a year.",
            "We gonna be like many mammals were the gal goes in heat then beats the hell out of her mate before she turns around with her ass in the air?",
            "Humans probably evolved to have monthly ovulation because it insured the men would work to acquire resources all year round instead of just before mating season.\n\nit would all almost guarantee that the pair bonding humans experience would not exist if women only ovulated 1 or 2 times a year. Men put up with a lot of bull just to be able to keep their significant other happy so the men can have sex.\n\nAs far as I’m aware, we are the one of a handful of species (including higher primates and some shrews) that has ovulation monthly. It was clearly beneficial to women or it wouldn’t have evolved.",
            "Isn't this just Europe in August tho?  Everything just kind of shuts down while everyone goes on holiday and there's a bunch of summer festivals.",
            "And then 9 months later hospitals are overwhelmed in a tidal wave of babies",
            "There’s a Star Trek TOS called “Amok Time” premised on that kinda",
            "Yeah I’m pretty sure this would be worse.",
            "And then 9 months later, there’d be babies everywhere.",
            "I'd watch it lmao",
            "Pitching it to netflix as we speak",
            "You say that but with the way corporate life works you're not too far off lol",
            "Now imagine operating like that all year long.",
            "Christmas is just everyone's birthday",
            "That's actually a major plot point in the Harry Tirtledove novel \"Homeward Bound\" (no relation to the movie about pets). There's an entire section about the alien species going into heat, and how it disrupts their society... after they go on about how gross they think human mating is. 🤣",
            "The Grind?",
            "That's just Carnaval in Brazil... At least the way I see it.",
            "I mean just make it a holiday. Most things are shut between Christmas and new years",
            "This would mean most babies would be born within a very small window throughout the year. This would arguably be LESS efficient in many ways.",
            "Isn't this called Christmas😅",
            "Half the world population will die every mating season cause supply doesn't meet demands",
            "Asexuality would be celebrated because they'd make bank on OT those two weeks",
            "Didn’t Star Trek Vulcans have some sort of thing where they didn’t have sex for 7 years and then had to or they’d basically go insane? Goddamn space cicadas",
            "Uninterested in sex most the year except for 2 weeks? My wife must be part of this new species.",
            "lol like the Purge but with rape instead of murder",
            "purgin deez nuts gottem",
            "Not to mention how many women would be assaulted/raped/forcibly impregnated during the \"mating season\"",
            "And a Baby Boom every Winter.",
            "Wait, you guys aren’t purging every spring?",
            "There is, its called hot girl summer",
            "Volunteering for Winter Duty, sir.  Cold season is my time…and full moons.  We can all work together in shifts 🤪",
            "That's good for th environment",
            "THE URGE",
            "And then suddenly the day after mating season the dry cleaners have enough work for the next 6 months... I don't see the problem.",
            "The youngs, asexuals, and a subject portion of olds, would hold it down for us.",
            "Except empty obstetrician offices that are suddenly filled to the brim, and no one can get an appointment. Maternity wards as well several months later. Sounds like a logistical nightmare.",
            "Ok and?",
            "Dry cleaner has plenty of work cumming his way after a mating season tho",
            "No no no, everybody's thinking all wrong: mating season is every mon-thu-sat, WEEKLY. At any sign of blood, it automatically switches to the 'alternate' (remember: \"when the red river's-a-flowing, take the dirt way home\") for a 7-day 'period', then it all starts over again.\n\nI'd be all over that. Many men would become very happy and climb hills and mountains for their partners. It's a win-win situation.",
            "I mean, it's called a dry cleaner, not a wet cleaner.",
            "I don't see Elk building no spaceships!",
            "True.  We fucked our way to the top as much as we dominated with smarts.",
            "Male *mammals* are constantly horny. I owned cattle until recently and bulls are never not horny. He will work his way through an entire herd of cows until they’re all knocked up. And you could deliver him to a brand new herd every month and he’d just keep going.",
            "Remember winter has different dates depending on where you live",
            "I think it's not \"mating season\" but \"boredom season\", which in turn leads to more mating.",
            "the young folk do call the fall/winter \"cuffing season\" for a reason",
            "Less to do outside means more doing it inside",
            "Yep… I thought I read somewhere that statistically the most birthdays are in August, so definitely some pre-Christmas banging happening…",
            "Can confirm. July 26",
            "I remember asking my grandfather why he has so many siblings. Was it common back then?  His response:\n\n“We come from a rural farming community in northern Maine. Everybody had a lot of siblings back then. All we had time for was farming and fucking”",
            "Down here in Australia, I think September is our busiest month for birthdays. 9 months from Christmas, except we have summer in December. I think the holiday season has a lot to answer for.",
            "Most birthdays in New Zealand are also in [Sept-Oct](https://www.stats.govt.nz/tools/most-common-birthday-in-new-zealand/) even though it's the opposite season.",
            "I bet most brazilian babies are born in november  because of Carnaval",
            "TIL that in the US, more people are born on Feb 29th than on July 4th. I do wonder if in countries with different health care systems the numbers would be less skewed around holidays...",
            "Me horny when sun out",
            "As someone who is more prone to being horny right after waking up, I guess you could say…\n\nThe early bird gets the worm",
            "As I recall though, they were pretty relaxed at getting shit done. For example, they had the technology to make vehicles that went fast, but they felt like walking speed was fast enough so they didn’t bother. And they could have had effective central heating, but didn’t bother, and just accepted the cold instead. ",
            "I just read this. What an amazing book.",
            "This feels like the plot of a Kilgore Trout book",
            "So do they just grow reproductive organs during the mating season or what?",
            "It also seems similar to Glory Season",
            "I would have guessed Zapp Brannigan.",
            "You have turned this utopia into a fruitopia",
            "They'd be like pop-up Halloween stores. Every 9 months the empty mall stores become temporary birthing centers. Then in a month, back to empty again.",
            "Hospitals would be a lot bigger than normal.",
            "About 10, but yeah",
            "All of human history is an elaborate attempt to get laid.",
            "Explains why I don’t do anything",
            "What about the DCs?",
            "It’s definitely winter since people couldn’t do that much in the olden times",
            "Spring is child-rearing season",
            "My birthday is in February, so I was conceived around May-ish…",
            "When I was young and hot I always got hit on a lot more in the springtime.",
            "I remember Gurdjieff wrote about this as well. That everything is driven by sex. It's also very Freudian.",
            "It’s not just gooners or sex addicts whose lives are disrupted by sexuality. People who get sexually harassed or assaulted are having their lives “disrupted” by the sexual thoughts of others",
            ">One of the reasons why female humans have been in similar roles to male humans is because the human reproductive system empowers them by giving them control over reproduction\n\nThere also is the factor that female humans mostly hide their ovulation.\nThis means sex once will most likely not result in offspring.\nThis forced early men into a relationship with a female in order to reproduce.\n\nSo having a mating season could easily mean that relationships wouldn't be a thing. Children might only be raised by single mums.",
            ">One of the reasons why female humans have been in similar roles to male humans is because the human reproductive system empowers them by giving them control over reproduction\n\nSimilar roles? In most cultures women have historically been essentially property, giving them absolutely no control over reproduction, and almost no rights. This only changed in the past hundred years in western countries.",
            "I thought you meant you got married to have sex less",
            "Oh you only have a season? Hope your partner is good with that",
            "This. I wish I could turn it off. It's so annoying. It's like okay yes, thank you, that felt amazing, now to focus on this other task that I really need to get... what the fuck, *AGAIN*??",
            "But the year round sex drive also pushes us further into the hyper capitalist hellscape where every manchild is competing to be the best alpha by buying things from other men who tell them they are alphas.",
            "Grape. Jfc. Just say it. This isn't Tik Tok.",
            "Oh. WOW. I didn’t even think about that. That would be disgusting to think about. Perhaps society would evolve into seeing grape at such a time as the mating season as a “necessary” thing or some disgusting shit.",
            "*note, I use the \"R\" word here, but intended to be in an objective, clinical way, intending to further the narrative of the discussion at hand. If this is not to your liking, skip this comment. By reading this comment, you absolve yourself of the right or justification for reporting me to a mod. In other words: GET YOUR FINGER OFF THAT GD TRIGGER, YOU WERE WARNED.*\n\n>! I suspect, as we can use other animals as a codex for this, that if humans were to have a mating season, it would be predicated on the female estrus cycle. Ergo, \"rape\" wouldn't really be a thing, in the strictest sense.\n\n>! Bad decisions, lots of fighting, death? OH YEAH, totally agree. \n\n>! But that kind of sexual assault? Rape (as a concept) exists because as a species that does not naturally have a mating season, female humans have evolved to be rather particular about who they mate with, or at least for profound enough justifications.\n\n>!Which is a round-about way of saying that if a mating season existed, all the women in the world would be horny AF, and only caring about more esoteric aspects of the men who they allow entry. Not so much their more substantive qualities. <\n\n::several edits trying to get the Spoiler tag to work::",
            "I like the joke but you left some seriously low hanging fruit. \n\n\nMrs. Dash\n\n\nCumin",
            "Because all the Northern Hemisphere people are snuggled up for winter",
            "I searched the comments for kemmer references well done",
            "?? Is your entire life driven by a desire to have sex? Are you incapable of love if it’s not paired with constantly having sex?",
            "more children are conceived in the colder months for certain countries",
            "Sir, this is r/showerthoughts",
            "“Phillips, where’s that memo. Where the hell is Phillips?” “Don’t you remember sir, those Alpha males from sales killed him so they could mate with his wife” “Oh… right”",
            "and all the births at the same time would cause absolute chaos",
            "Ugh had an ex that just had to fight and it was the only time she got horny.  Sex was great but hell no it was awful in full context.  I didn’t need to fight to have passion.  Some people I just cannot relate to",
            ">Don’t forget all the fighting\n\nI think I saw The Purge: Spring Break somewhere.",
            "What fighting?   \n   \nI'd imagine that people would have worked out a system a long time ago.  \n     \nLike, you *know* the horny-time is coming, you'd spend part of your time solidifying who your horny-time partner is and shack up.  \n    \nWhat kind of dumb world are you imagining?   \nIncels roaming the streets looking for things to hump? Breaking into houses?",
            "Perfect porn parody name. Has this been done yet?",
            "\"The Splooorge\"",
            " HEH..GOOD ONE..JUST CAN'T  FIGHT THE \"URGE\"🤪😝👍👍hmmhmm..!!",
            "My kid's birthday is the first week of November. It took hours to get a bed in the maternity ward when he was born. The nurses called it the Valentine's Day Rush.",
            "Srry to bother, may i know what is the january advantage in hockey?",
            "It would actually be great for school children because there are less developmental differences and thus the learning groups are way more homogenous.",
            "> The January advantage in hockey would disappear as well. \n\nTIL this is a thing.  I was born in early January, in an area that has never had much grassroots interest in hockey.  Sums up my luck pretty well...",
            "Why would elective surgeries be cancelled? Who would be stupid enough to plan surgery, or anything for that matter, on the yearly baby birthing week?",
            "You can only hold your stronger than human emotions for so long.\n\n&nbsp;\n\nIt could be one of the reasons for their emotive end.\n\n&nbsp;",
            "I remember the Tuvok episode which was especially great given that he was billions of light years from some booty.",
            "Ferrets also die if they don't mate. We live on a weird planet.",
            "The Perv.  Like one, massive, global perv, not just a single dude",
            "It was a Futurama episode\n\n*Why Must I Be a Crustacean in Love?*",
            "Zoidberg’s people and their mating season on Decapod 10",
            "For some people, this will be considerably less mating.  For me, much much more.",
            "Dun dun dun DUN DUN dun dundundundun",
            "While you were running a business, I studied the [bladed toilet plunger.](https://static1.cbrimages.com/wordpress/wp-content/uploads/2021/03/Star-Trek-Amok-Time-Kirk-Spock.jpg)",
            "That's what my wife said! Then she told me I don't want to know?",
            "Omega-verse doesn't really have a \"mating season\" where everyone gets horny though. Usually anyway.\n\nEvery omega has their own personal heat cycle.",
            "Went looking for this comment!!",
            "The read The Dispossessed, Lathe of Heaven and the entire Erthsea series.\n\nNot related at all, they're just great.",
            "Asexuals would be tasked with running the government while everyone else gets to business",
            "Well no, they said mating not sexual recreation. Mating implies procreation, which an asexual person may still participate in if they want children.",
            "...No, no they wouldn't. They'd possibly be Kingmakers of a sort, but the Kings would still be those who bred.",
            "Nah, there'd be serious acephobia, like, what, you think you're too good to have sex, you think you're too good to take part in the monthly horny?? It's all the ace's fault, clearly, all of them!\n\nAnd then there's the *demisexuals*. Yeah, no, we'd just have more hate in the world.",
            "Just finished this book. Good read, but the people still have monthly \"ovulation\", they just are asexual and androgynous the rest of the time.",
            "September is the most common birth month. So November-December is mating season.",
            "Sounds like a little slice of heaven to me, show me the flamboyance!",
            ">It was clearly beneficial to women or it wouldn’t have evolved.\n\nYeah it didn't kill them and allows them to reproduce more. You can argue about those benefits.",
            "> As far as I’m aware, we are the only species that has ovulation every 28 days.\n\nOrangutans every 29-32 days, Chimps every 28-45 days, Gorillas every 30, Bonobos every 34/35.  Sheep are fertile every *17* days, horses every ~21; etc etc etc etc.\n\n> It was clearly beneficial to women or it wouldn’t have evolved.\n\nThat's not how evolution works.  There is no mechanism that says \"this is good should be kept and that is bad and will be eliminated\" beyond whether the genes manage to propagate or not.  \"Good\" mutations fail to propagate all the time and \"bad\" ones succeed just due to luck, timing and side effects.  A potential \"good\" mutation that happens at a bad time might die out (say a period of malnutrition reduces the number of successful pregnancies which results in not enough carriers of the mutation spreading their genes) while a negative one at a \"good\" time survives (booming population and a mutation that isn't outwardly visible, allowing the mutation to spread).",
            "I am from central Europe and most children are conceived in spring.",
            "Huhaw \"I hate my wife\" so funny 🤓👆",
            "Would we all visit Ligma?",
            "Best comment of the day lol 🤣",
            "The same amount as throughout a normal year? \nProbably less, since there'd be a designated time for women to be on heightened guard.        \n      \nSeriously, it'd probably be better. We'd be like \"well, it's crossbow season again. Ladies, make sure you're armed with your repeater crossbow and at least three side knives.\" \n   \nGucci would have designer shanks.  \n   \nPlus you're assuming that men would be more aggressively horny than they are now. It could just be like, regular amounts of horny.  \n    \nAt the same time you're imagining men turning into rape monsters, you're asserting that women would somehow remain dainty victims.   \n\nYou've obviously never seen women go truly wild, they can outdo a man all day every day.  \nMen jizz and that's it. Some dudes can go a few rounds. A horny woman would be able to run around town fucking men's dicks off.   \n     \nYou're really not imagining the wealth of possibilities here.",
            "Just like tax season.",
            "Don't forget the kids, I hear they yearn for the ~~mines~~ dry cleaners",
            "The who? 😂",
            "... yeah, I don't think the young are gonna have a standing chance.",
            "To be fair, if humans had always been this way logistics would have developed to support it, if it were a sudden change that would cause problems though.",
            "That would mean far less sex for a lot of people",
            "Elok Moosk is.",
            "I love the double meaning.",
            "Well, since the data is from American people, we can assume *their* mating season is in winter?",
            "Well sure, but almost 90% of people live above the equator",
            "Well only about 11% of the world population lives in the southern hemisphere so it would mostly still apply",
            "That may be true, but it might actually help if the numbers match for the equivalent winter months of an area.",
            "also, Christmas, valentines day etc",
            "Me horny every time sun up or down, even that time it was behind the moon",
            "Damn Heliosexuals",
            "> Me horny when ~~sun out~~\n\nFTFY",
            "That's true. They lacked the Terran obsession with speed.",
            "Humans ad driven by being unsatisfied at everything.",
            "I could be misremembering, but I think they are all actually hermaphrodites but their genitals just don't work most of the time.",
            "I'm Doing My Part!",
            "Only for that specific latitude where winter makes everything harder.  Winter in the tropics is little different from any other time of year.",
            "It's spring for millions of years, and winter once we invented agriculture.\n\nOlden times are still fairly new to \"Humans\". Go on a 4-day hike in autumn with hard work and low rations, and see how horny you get. Modern conveniences expand the mating season to year-round, but that's relatively a new thing.",
            "My wife’s birthday is September 24, and my friend’s is November 14… so they were conceived on Christmas Eve and Valentine’s Day, respectively. Haha!",
            "It's definitely not winter because people stay indoors with more clothes on and generally aren't as horny. You have to hook up with somebody in the fall if you want to get laid through winter.\n\nEdit: nice to see so many sad little morons downvoting me out of your stupidity! Try not to be too pathetic, little fellas, lol. I guess some people are too stupid to notice how there's more birthdays in winter than summer, lmao.",
            "But now that you're old and fugly you get hit on a lot more in wintertime.",
            "\"Everything is about sex,  except for sex. Sex is about power\" -- Oscar Wilde",
            "A season? Like winter?\n\n\nWtf are we talking about?",
            "Especially considering the population imbalance between the northern and southern hemispheres.",
            "…. Isn’t that true of most animals? You don’t think that at some subconscious level, people who are really driven and ambitious generally desire to find love/a partner? And in our society, one of the key foundations of most relationships the idea that you aren’t having relations with anyone else?",
            "Yeah but that’s probably because “let’s go outside!” isn’t an option anymore",
            "Bro, this is the dumbest thing I've read all week",
            "The annual accounting department purge",
            "😂😂😂😂",
            "Everyone knows sales is full of Betas. Why do you think they got into sales in the first place?",
            "We have that in Brazil, just match the number of kids born 9 months after carnaval lol",
            "Very dismissive response.\n\nThe richest men will get multiple women. The poorest men will have no one. If horniness is amplified so much that people can't do anything but mate, I'd imagine there'd be a lot of sexual crime.",
            "I can hear the pitch already \"now hear me out. It's like the purge...but with titties.\"",
            "Quick, grab a camera and some out of work, desperate actors!",
            "Many hentai things have done it with various animal girls",
            "[deleted]",
            "I think I was born during the St. Patrick's Day Consequences.",
            "i was born on november 9th…. i learned something new.",
            "In Canada, the cut off for hockey enrolment is December 31 so babies born in January will be the oldest children in their age group. That means they might be 12 months older stronger faster more developed than kids born in December. That means that most star hockey players in Canada are born in first three months of the year January, February, and March. ",
            "High-performing athletes are more likely to be born in January than the average person. Also, high-achieving scholars are more likely to be born in September.\n\nReason: these are administrative cutoffs for school years and leagues. Being slightly older than your peers matters when you're 6, because you're slightly more physically grown or mentally mature. This leads you to be a little better at sports or academics in school. People praise those who do well and discourage those who don't. Over the course or a lifetime and at the high-performing level, these tiny advantages add up. Hence, many pro athletes being January babies.",
            " No problem..I was CURIOUS OF THAT MYSELF AS WELL🤔🤷‍♂️🤨HMM..!!",
            "Now I could see this. Birth rates decrease so much that there is a period where humans are incentived to father children, to stop extinction.\n\n&nbsp;\n\nThat or cloning. Like in that other Star Trek Episode.",
            "Basically the same thing.",
            "That's literally about a different species, not at all about humans.",
            "She’s right",
            "But heat cycle is same vein to mating season",
            "Lavinia as well!",
            "\"Why does everyone have to pay higher taxes out of a sudden except these people who don´t likme sex?\"\n\n\"Well the bill was past just last week during the orgy.\"\n\n\"Isn´t that suspicious?\"\n\n\"Well yes, but do YOU want to miss out on the orgy?\"",
            ">everyone else gets to business\n\nThose asexuals are really missing out. I wish I could [get down to business](https://youtu.be/TVcLIfSC4OE?si=TqI3gubQXMPs6n4J).",
            "That would mean the ones most capable of running a country would actually do it, which is the opposite of politics.",
            "Who are you kidding? We couldn't spare them for running the government. They'd be needed at the hospital to retrieve things from people's asses, fix broken dicks, rehydrate the sexually exhausted, and sell condoms (which is not currently a function of hospitals, but someone would need to, and they'd be the only ones available.)",
            "like eunuchs used to do.",
            "OK, I think everybody missed this, even me.\n\n&nbsp;\n\nForced yearly fathering? The opposite of one child policy.",
            "It would be like religious prayer. Work hours with the sex break three times a day.\n\n&nbsp;\n\nImagine sex pay for emergency personel too.",
            "> And then there's the demisexuals.   \n  \nImagine being wildly in heat and totally unable to satisfy the urge because you didn't form an emotional connection with someone in time.",
            "So a lot like what it is currently then",
            "Lots of Thanksgiving-New Years fucking (US). Makes sense",
            "So anyone that does No Nut November has it ass backwards then?  That's actually the ***worst*** time of year for it?",
            "What is ligma?",
            "Who the hell is Steve Jobs",
            "For reals. I personally get crazy horny when I’m ovulating. I can only imagine if that was only one or twice a year. I’d have to tell my partner to shackle me to the radiator to ensure I didn’t go buck wild when encountering another person.",
            "Women were passed around as spoils of war not too long ago in reality.\n\nI don't think society would have evolved to the point where it was feasible for women to have self defence weapons from fashion designers.\n\nI feel as if the species only had a window each year to reproduce, women's rights would actually just be pushed back more in reality, because as disgusting as it is - rape is a massive part of human history. The male penis even evolved to have the ability to scoop out other males sperm while having intercourse.\n\nIt really wouldn't be the haven many people think it would be.",
            "Exactly what this guy said, I think people are imagining that we’d be dying for sex the rest of the time and would be crazed animals for the mating season… but actually we would just be how we are now but for a limited time.",
            "I'm not saying woman wouldn't go feral. I'm using situations were there is more men than women, and women are more likely to be harmed. I understand that there would probably be things in place to protect, I'm just pointing out that if there was 1 month in every 12 where men could fuck, there is likely gonna be a good chunk that fuck any woman they come across. Whether or not she wants it. I'm not saying every man, but I am talking from experience where the more men and less women there is, means the attacks and assaults on women are more frequent",
            "Sex worker. The profession where you work once a year!",
            "Yeah, good point. Honestly, having a sudden change is the only way I could think of it. If we were always like this, we wouldn't be humans.",
            "Not during a entire lifetime. Overall it would actually be a huge increase. Source: married for 18 years and never believed it when I heard it. Now I'm just part of the statistic.",
            "Doesn't he have like 7 kids?",
            "There wasn't a link to data when I replied 🫠",
            "It makes sense though. It’s cold and you have to generate heat somehow",
            "Well only about 11% of the world population lives in the southern hemisphere so it would mostly still apply",
            "Plus the new year, which I'd imagine has some uptick for anyone who decided they'd start having kids next year",
            "Even when the sun is halfway on the other edge of the planet for six months..",
            "\"Fathering/Birthing grants citizenship!\"",
            "Attempting?",
            "Ehh... citation needed.  Assuming that pre-historic humans had a \"mating season\", I'm skeptical that it would have been in the spring.\n\nWith pregnancy lasting 9 months, that would dump all the newborn babies on a tribe right in the dead of winter.  Which doesn't sound like an advantageous direction that ol' evolution would nudge us toward.\n\nI think Darwin would call for knocking boots in the summer.",
            "Pregnancies don’t last exactly 9 months.",
            "If it’s “definitely not winter”, then why are a majority of birthdays in August and September?",
            "Right, but humans don’t have a mating season. So to base the idea of a hypothetical mating season on our current sexual habits is wrong.  If you have sex all year, than it’s not suddenly mating season when you’re still doing it in the winter.",
            "Haha no I don't get hit on at all anymore.",
            "That said, I don't really agree with this massive oversimplification of human nature.",
            "If you can’t finish your work outside you gotta finish inside",
            "Are you kidding? The accounting department is probably the freakiest of the bunch. Whole lotta gimp masks and latex in there, avoid at all costs. Or don't, if you're into that.",
            "Real estate agencies becoming a high risk work environment",
            "It's dismissive because it was a stupid assertion without any effort to justify it.   \n   \nI'm also dismissive of your assertion that \"rich men will get multiple women\".  \nThat reeks of misogynistic crap.    \n   \n*You* imagine there'd be a lot of sexual crime.   \n    \nAgain, I'll ask you what I asked the other person: what are you imagining in these naughty fantasies of yours?   \n   \nWhen everyone knows what season it is and they're at home doing their thing, where is the opportunity for \"a lot of sexual crime\"?",
            "\"Hmm...and what do these titties do?\"      \n\"Uh...jiggle?\"    \n\"Get this man a million dollars immediately! He's a genius!\"     \nI miss Bill Hicks",
            "NTR?\n\nAs for the former, pretty sure that’s a bunch of porn right now anyway.",
            "Wow. The big kids got small sparring partners. That's sick!",
            "That’s only hockey. Most sports align to school year cutoffs which is not January",
            "South Korea's population is declining rapidly and they offer incentives to have children.",
            "I knew what it was before I clicked that link, but I needed to be sure ^(thank you for not disappointing meeee)",
            "r/riskyclick",
            "\"Why is election day smack dab in the middle of mating season?\"  \n\n\"Well the vote to make that change was unanimous, though the timing was a bit odd...\"",
            "I am fairly certain asexual folks have had sex because they wanted kids not because they enjoy intercourse. Not sure about forced",
            "How does this apply to human breeding season?",
            "huh where\n\nive never seen hate specifically towards ace people",
            "People who do no nut November are just trying to salvage some dignity out of the fact they can't get a date. \n\nAnd yes, I'm only joking.",
            "Capital city of Peru, I think. I heard updog is very popular there",
            "SUGONDESE NUUUUUTTTTTS-",
            "It’s an upward dog",
            "Brother of B. Jobs I think",
            ">Women were passed around as spoils of war not too long ago in reality\n\nWith in the last month in Ukraine",
            "What a day to be literate...",
            "I think their point is that women would know what month they're at the greatest risk and would be able to take additional precautions for those 30ish days. Needing to be paranoid for a month is a whole lot different than having to be completely on edge 365 days a year",
            "No worries dude, I added it soon after I commented, but you replied not a minute later.",
            "Solid use of the new face melting emoji",
            "Also it's boring inside. We gotta do something besides Netflix, so we and chill.",
            "I mean I have an 8 year old daughter So I think I succeeded. But also yes attempting",
            "Out of here with your logic and reason! We were making shit up in here without those just fine before you showed up.",
            "My parents explained to me that they did the deed on September 12, 1983 and I appeared 9 months later.",
            "I know… it’s a joke.",
            "Majority of births are to established couples.\n\nIt’s not mating season if you’re just having sex with the same person as all year",
            "[removed]",
            "Pffft, if you think that's bad, stay well clear of the server room. IT will make accountants look like normies!",
            "That's one of the reasons they need to be purged. The other being that yes Amanda I put that into inventory correctly and no I'm locked out of that function the only way the value could be off is if you weren't paying attention again and set up the new item wrong, but thank you for CC-ing your boss ahead of time to save me the trouble of bringing it to his attention. Sorry what were we talking about?",
            "Just make sure you’re coding your costs appropriately and you’ll have nothing to worry about.",
            "Dont the IT furries beat them at the kink game?",
            "They are speculating on the reality of a human mating season. If it were to be anything like other animals that have seasons of mating, there would also be a huge increase in violence. \n\nIts solid speculation, but regardless critisizing the person with words like 'misogynistic' isn't really productive to this conversation about a hypothetical situation.\n\nOf course *they* are imagining sexual violence. We are suppose to be imagining a hypothetic scenario, because we can't see it for real, because humans don't have mating seasons, so all we can do is imagine and speculate.\n\nWho says in this hypothetical, humans would mate at home? If we only have sex at one time per year, the rest of the time our house wouldn't be sexy at all. I think it's entirely possible to speculate that humans might go to some sort of 3rd space if they only had sex for a few weeks of the year.\n\nIf we look at most other animals with mating seasons, you know the ones with mating seasons plagued with violence as well as sex and orgies,  they go to a specific place to procreate. It's safe to at least speculate humans would too, I guess.",
            "I mean, we know what happens. A stack of human societies have had this sort of thing built in - Saturnalia is probably the best known, but there’s also Carnivale, and I’ve heard of other societies that have an equivalent as well. \n\nYou get a week, or two, to blow off steam, everyone misbehaves. Then it all goes back to normal and what happens in Carnivale stays in Carnivale.\n\nThere’s not a huge amount of violence becuse everyone is too busy drinking, taking drugs and shagging. And when everyone is doing it, there’s no fighting for “sexual resources” because *everyone is having sex*. Rich men don’t get “multiple women” *everyone gets multiple everything*.",
            "I have always assumed that he transcended time and intentionally gave himself cancer just so he wouldn't have to endure the 21st century.\n\nImagine him looking back fondly on the original Bush years.",
            "Ntrs Japanese cucking ☝️🤓",
            "Googling it, there's no mention of hockey specifically re January advantage.",
            "It is in australia",
            "And world soccer uses Dec 31/Jan 1 cutoff by birth year. A disproportionately high percentage of pro Association football players have January birthdays",
            "\"Why is voting turnout so low?\"\n\n&nbsp;\n\n\"Because of the refractory period\"\n\n&nbsp;\n\nAnd the mandatory multiple orgasms during election day.",
            "Or it would be exactly the same because of old people would overwhelm the polls.",
            "Yeah, I'm demi (thought I was ace for the longest time), I really don't get ace hate that often. What I was implying in my grandparent comment was an actual inquisition against the aces, I don't think ace people are really executed for being ace, like, at all?",
            "Nothing what's up with you",
            "Oh, I thought Ligma balls, thank you!",
            "What is this updoh you speak of?",
            "Mate, imagine my horror when I first found that fact out 😂 I just have to share it at any available possibility now and share the disgust 😂",
            "Again, I understand, but that month would be 365 days worth of paranoia condensed into 30 days. The fear would be greater because instead of worrying about 1 man possibly jumping out and raping you, you have to worry about nearly the entire male population deciding that you're the one they will impregnate. I know this is a hypothetical, but the fear any and every woman experiences daily would be condensed into a short period",
            "New? Seen that mf for a couple years.",
            "Fucking emojis everywhere.",
            "Only proves a singles success, sorry",
            "Plenty of animals that “mate for life” (re: they only couple with one other animal) still have mating seasons",
            "Most sports don’t have that cutoff so it wouldn’t make a ton of sense. It’s true it’s not just hockey with Jan 1st, but the general rule is about the cutoff date which can be the academic year for most other sports. See https://en.wikipedia.org/wiki/Relative_age_effect",
            "Yep. Looks like US is an outlier. Most of our sports are aligned to the school year and hockey was the only one I heard of from the Canadians up north that wasn’t",
            "Fair",
            "What's up with? I hardly know with!",
            "I glued my balls to my butthole again",
            "🫠",
            "Right, but humans don’t have a mating season. So to base the idea of a hypothetical mating season on our current sexual habits is wrong.  If you have sex all year, than it’s not suddenly mating season when you’re still doing it in the winter.",
            "That source uses football as the first example and figure. It then mentions that there's an early year advantage observed in football, baseball, cricket, gymnastics, handball, ice hockey, rugby, running, skiing, swimming, and tennis. I will admit that I did not play sports as a child so I'm not sure about administrative cutoffs, but I'd assume all of those are January if that's the case. Which is not \"all sports\" but it certainly seems like more than hockey and not a minority of sports.\n\n(Also of course all of this is re northern hemispheres for anyone reading).",
            "Damn near rectum!",
            "Fool me once, shame on you. Fool me twice, shame on glue",
            "Solid use of the not-so-new face melting emoji",
            "Sure. They specifically mention it’s September 1st for some countries. Where I played sports it was the academic year, not Jan 1st",
            "What's up dog? Kiss me arse bungholes.",
            "And my ass!",
            "fool me three times, fuck the peace sign",
            "🫥",
            "That's fair! I had just never heard if it being specific to hockey and the sources don't support that it is. But it would be interesting to look at it with a normalization towards where that person grew up and what the policy was.",
            "If there is retaliation from my stupid reddit comment here I will destroy some mfers in the just brutal way",
            "Gaseous use of the new invisible face emoji",
            "Is that a bored scrub daddy?"
        ]
    },
    "Despite the saying, most swords are double-edged and don’t normally hurt the wielder ": {
        "title": "Despite the saying, most swords are double-edged and don’t normally hurt the wielder ",
        "score": 411,
        "url": "https://www.reddit.com/r/Showerthoughts/comments/1dln6im/despite_the_saying_most_swords_are_doubleedged/",
        "content": "",
        "num_comments": 53,
        "comments": [
            "Well, aren’t you sharp?!?!",
            "Oh, I always thought the saying was referring to, like, two blades with a handle in the middle.",
            "This post is a bit of no handled, double tipped sword if you ask me.",
            "One time my coworker took this really thin slice of plywood and said \"if this was a double edged sword it would be called a *something japanese*, and you cannot Parry with these. The blade is too thin to parry a larger sword by itself. If it had been single edged, i could have placed my hand on the back of the blade to help withstand the impact, but with this i would just cut myself in the hand. Instead, i got to evade.\"\n\nHe handed me a larger piece of plywood, and says \"pretend this is a halbard and hit me\" so i think okay you fucking Kung Fu guy, lets see what you got. So i swing the halbard plywood straight for his knees.\n\nThis guy he makes a sideways flip, and while his head is upside down, mid flip, he made a very, very controlled mark on my neck with his double edged piece of plywood. I had a red line and everything, but no blood.\n\nThis guy was crazy good.",
            "I don’t know if it’s true that most swords are double edged, but it’s certainly true that *many* are not. Most notably swords like katanas, but plenty of European swords also had a blunt edge for a variety of reasons. \n\nThere are also plenty of downsides to double edged swords (more fragile, harder to maintain, can’t easily use a hand on the blade for extra leverage, etc), but it’s true that they’re not really more dangerous to their wielded than single edged swords, which the expression seems to metaphorically refer to, so your shower thought still works.",
            "Doesn't the phrase refer to a sword that cuts both when it goes in and when you pull it out?",
            "I was always confused about this. In what context would a sword, even a double edged one, be able to cut both the person I'm attacking AND myself?",
            "In the white light, a hand reaches through\n\nA double-edged blade cuts your heart in two\n\nWaking dreams fade away,\n\nEmbrace the brand-new day",
            "The saying doesnt refer to the wielder",
            "Not only that, at one point people used the blade to [thrust forward like a spear, or in some cases use the hilts as a pickaxe](https://en.m.wikipedia.org/wiki/Half-sword)\n\nYou have to think: With all this ironclad, and chainmail it would be *very* difficult to get any normal sword to pierce through by just hitting the breastplate on the broadside of the sword",
            "It might be a strictly imagined risk by townspeople who never fought, like \"oh what if I actually hit my own neck on the return swing?\". Confidently saying \"double edged swords are more of a liability than an advantage!\", despite having zero real-world experience. Like your common Redditor pretending they know shit.\n\nTownspeople also very-well could have just developed inaccurate terms, just as modern civilians do too. Lot of people call any small-ish machine gun an \"Uzi\" or a magazine a \"clip\" (a clip actually being a device used to load internal or external magazines). Maybe the townspeople actually meant a sword with full-on double blades, envisioning something Darth Maul style as if anyone actually used such weapons? I mean modern civilians make up all sorts of stupid stuff about modern combat, invest in \"tactical tomahawks\" they find on BUDK because they think it's \"military grade\" when actually it's just mall ninja trash not even slightly resembling an actual war-appropriate tool. So that checks out.\n\n\nI'll give you another imagined risk since I don't swordfight: Half-swording is a technique applied against armored targets. You grab the blade around the middle with your non-dominant hand, while keeping your dominant on the handle. Spreading your hands out like this instead of both on the handle, it lets you put more power and better directional guidance into the thrust, letting you drive it home directly onto that sweet spot you're aiming for. But it might be a bit scary to do that on a double-edged sword where there's nowhere to grab that isn't sharp. I mean knights definitely did it without hurting themselves (sword-sharp is far from razor-sharp) but it might still be scary to someone unfamiliar to the technique. Same goes for bracing the sword on your non-dominant hand or arm in a block, doing that on a double edge would be driving an edge right into you as you block someone else's weapon (hypothetically, as to me that just sounds like movie shit).",
            "\"A mind all logic is like a knife all blade. The hand that wields it, bleeds\" -RT",
            "Maybe so, but I dunno anyone who regularly uses swords. Just imagine how many (more) people would cut themselves in the kitchen if all kitchen knives were double-edged lol",
            "It's a throwback to hunting swords which were almost a Sabre and almost a carving knife and or the fact that a longsword is also a pick axe for punching through plate mail when half handing it. Save yourself some trouble, use a war pick, they're can openers!",
            "“The chance of a double edged sword hurting the wielder is directly proportional to the skill of said wielder.”",
            "Had a couple bong rips before the shower huh? 😂",
            "The point of a double-edged sword is that it cuts twice: when you swing one way, and then on return swing, without rotating the blade. That's what the saying is about: it cuts on return.",
            "Well if you consider the standard sword as having 2 edges, “double edged” would thus mean a sword with 4 edges, thus two blades (or a weird cross shaped combo blade). 2 blades thus mean little handle space l, thus danger to wielder",
            "Like hell they don't.\n\nThere's not a sword I've trained with that didn't cause an assorted medley of pain and injuries. \n\nPart of a weapon being an extension of your body is the part where you were not good using your arms or legs at all and were a danger to yourself and others before gaining a new sense of self. \n\nBlisters, sprains, cuts, bruises. These are the dues paid for mastery.",
            "Double-edged swords are actually fairly uncommon. They’re a lot harder to forge compared to a single-edged blade. I have a feeling op doesn’t actually know a lot about the process of bladesmithing",
            "Darth Maul style",
            "That would be two tips if I’m not mistaken",
            "It's a quadruple edged sword!",
            "Yeah only now do I actually understand what they mean",
            "I don't think a sword like that has ever existed in history, at least, it was never popular enough to have a metaphor created and named after it. And you probably guess why a double-bladed sword isn't a thing.",
            "That still wouldn't do damage to the user though",
            "The saying does. OP is being pedantic",
            "“Double tipped sword” would make a lot more sense for the saying tbh",
            "is this an old copypasta, or is it about to become a new one...?",
            "Obviously fake story...\n\nThere were never any double-edged Japanese swords!",
            "The downsides to double edged swords you have listed are mostly imaginary. Fragility mostly depends on the material quality of the sword. All swords are maintained pretty much the same way. And you definitely can grab a double edged sword by the blade - see any fechtbuch that deals with armored fighting.",
            "There are plenty of proper historical ways to fight with swords while holding the blade despite it referencing double edged swords",
            "That’s true of single-edged swords as well, so… no. \n\nThe saying alludes to the fact you can be cut by both sides of a double-edged sword, so you have to be extra careful not to hurt yourself.\n\nBasically OP’s statementdoesn’t take into account the extra skill and training needed.",
            "That's true for all swords...and all edged weapons, I mean, why WOULDN'T they also cut when they're pulling out too?",
            "If you’re bad enough at it, anything can hurt you I guess lol",
            "If you have a wild swingback with a katana, a blunt strip of metal hits you and can hurt you, but won’t cut you, if you do something like that with a double edge sword you get cut.  it’s not that you get cut in the very same instant that the opponent does, it’s in the half second or so so before or after",
            "Might want to tell the Oxford dictionary that then. \n\nhttps://www.dictionary.com/e/slang/double-edged-sword/",
            "But that's more about cutting your opponent twice.  The expression refers to something that harms both you and your opponent.",
            "Not at all, no. Otherwise single edged blades wouldn't have any flow to them. You also would need to lead the blow with your wrist to cut with the second edge on return, which is unnatural and likely to break your wrist with any weapon.\n\nThe saying means it is something that is both good and bad for the user.",
            "None of those things are unique to a double-edged sword",
            "You'd know all about two tips wouldn't you?",
            "Idk I've seen like at least two movies wiith swords like that so if it didn't happen how'd they film it?!",
            "https://www.dictionary.com/e/slang/double-edged-sword/\n\nNope, I’m not. “Two sharpened edges” is not two tips.",
            "No it doesn't. Double-edged means exactly that, two edges, you know, like a typical longsword, not two blades.",
            "No honestly, i just types that shit. This guy looked like i Viking and fought like a ninja.",
            "We have the saying “it cuts both ways” which is kind of the same sentiment.",
            "might be one of those saying that lost its original meaning over time",
            "Yaa I don’t know what that dude was saying",
            "\"Ay, check out Johnny Two-Tips ova here!\"",
            "In the Bible it's only used as a comparison to something very sharp"
        ]
    },
    "Pretending to be rich is even more pathetic than actually being poor. ": {
        "title": "Pretending to be rich is even more pathetic than actually being poor. ",
        "score": 95,
        "url": "https://www.reddit.com/r/Showerthoughts/comments/1dlssf4/pretending_to_be_rich_is_even_more_pathetic_than/",
        "content": "Just thinking about all the people who appear worlds away from their actual living situation on Instagram. Embarassing.",
        "num_comments": 57,
        "comments": [
            "Being poor isn’t pathetic.",
            "They make money from it. Subscribers, donations. This is a earning strategy.",
            "The only thing pathetic I find in this thread is calling people worse off than you pathetic. Which is you. You're pathetic.",
            "Being poor isn’t pathetic",
            "Rich are trying to look poor while poor are trying to look rich.\nWhat an age we live in!",
            "How is being poor pathetic?",
            "I have an extended family member who made seven figures for several years. Their hubris was their downfall and lost that income stream and proceeded to blow it all on dumb get rich quick schemes and email scams (they fell for a Nigerian Prince Scam twice).\n\nToday they have the IRS coming after them and they are still trying to grift their dollar any way they can. But what is wild? They still live a life of luxury. Once you are in that category of rich, your rich acquaintances will let you borrow their boat to Cabo or their yacht in the Mediterranean or that lake house in Tahoe and it doesn't cost them a dime. So weird.",
            "Imagine giving a toss what people on Instagram can or cannot afford, embarrassing. Touch grass OP",
            "What's pretending?  How do you know the person you are glaring at is living beyond their means?",
            "You basically described my cousin. Dude works odd jobs as a painter, but acts like he’s got a lot of money spending everything on clothes and drives a car that was expensive before someone put over 200.000 km on it.",
            "But pretending to be poor is the most pathetic.",
            "Being poor is where you find real strength. We are but maggots writhing in our own filth.",
            "It depends on how you could fake it until you make it. And feelings afterwards. \n\nHave you ever experienced being poor and became rich? Or vice versa?\n\nI had. So I have a few words to tell.\n\nMy dad was a real rich until 10 yrs ago. He drove my mum hospital for giving me birth with a volvo which had a seat heating system in it LITERALLY 30 yrs ago. It did matter to have such a car back to these times.\n\nAnyway, something went wrong and boat sank & we went way down all together.\n\nTime passed, I graduated university with a bachelor in Science and found a job, started working. But my income wasn't covering my expanses plus I found a stray cat who needs a real care by a veterinarian because he was just about to die. Nevertheless, I adopted him; brought soooo many times to veterinary and took his medicine etc. During this time, I was also spending time with my friends who invites me some luxury events. They wear golden goose, put alexander wang bags, drive mini coopers.. and i was just in a deep debt because of the inequity between my income and outcome. I was just -not jealous- desiring to be on the same level with them. So I started buying second hand luxury clothes which are way too cheaper, and looked like them but the truth was a secret on my own only.\n\nTime again passed, God blessed us (my cat and I) and improved our wealth. Now I have a set of golden goose brand shoes, Alexander wang bags for daily use and for special times too, driving a premium car... \n\nAm I happy? It depends on how you define it. For me, happiness is not something relevant how you feel poor or you are rich. It only depends on the feelings you have while you are rich or poor. \n\nThe reason I tell the story is, if you haven't experienced the same, you must not judge any of the situation because you can't imagine the feeling it brings.",
            "Agreed.\n\n\"Look at my Gucci bag!\"\n\n\"Bitch, you live in a trailer, you can't afford a Gucci fucking bag.\"",
            "More money more problems they say. What about no money no problems. Do we need money to survive? The food we eat doesn't require our money. Why do we need money? A way to control dumber humans you say? Fuck money and the greed it breeds",
            "I'm poor but pretend to be middle class on dates. \"Appetizers? Sure, that won't ruin this week's budget.\"",
            "Most rich people are just pretending to be wealthy.\n\n\nIf you earned money - you're rich. \n\n\nIf you never had a job - you're wealthy. ",
            "there's rich people pretending to be poor so I think we know what peak patheticness is",
            "Personally rich people that pretend they have poor upbringing are much worse.",
            "Worse is when they try to be the classic poor man's rich people.",
            "The society that creates so many poor people and so much inequality is pathetic.  I carry mail in the hood and most people there are really nice and down to earth.",
            "If you are poor because you refuse to work, steal money from family then waste it on luxuries, then it’s pathetic.",
            "Poverty is a policy decision.",
            "Being poor isn't pathetic, but I do find it pathetic when people who aren't poor pretend to be so that they can get benefits (whether real or perceived) like donations, sympathy, food, etc...",
            "Depends on why you're poor.",
            "I should have expected the semantics police to come knocking everytime something is phrased carelessly from an off-the-cuff thought... yikes!",
            "indeed",
            "They also declare the fancy purchases as business expenses on their taxes.",
            "Look at me. I was born in a wealthy family in a wealthy country. How pathetic are you people hahaha /s",
            "Of course someone wants to argue semantics and pedantics.",
            "We got a lot of them rich kids living in big cities trying to be raw and authentic with these worn and filthy jackets that costs 200 dollars, while mommy and daddy pay for their ridiculously expensive rooms.",
            "Sure, but in reality (AKA off the internet), people just dress in whatever they can afford.",
            "True! An age of lies, I guess.",
            "It is when you pretend to be something else.",
            "So they're following the Trump pattern to a tee, lol.",
            "\"Glaring at?\" An off the cuff thought of mine is something which you're psychoanalyzing too much. \n\nI know them personally in real life, so I know they are \"pretending.\" If you have another definition then let me know.",
            "Then you’re pathetic because you refuse to work, steal money from family then waste it on luxuries.",
            "If you’re poor because you’re a fraud or an ass or lazy, then you’re pathetic because you’re a fraud or an ass or lazy, not cause you’re poor",
            "Didn’t want the money enough /s",
            "We live in a system of oppression",
            "You’re actually just wrong, and unwilling to accept that, so you’re compensating now.",
            "This is very far off from the usual pettiness we see here. That’s not semantics, read your sentence, it’s not carelessly phrased. You’re seeing actually being poor is pathetic, accept that people disagree with this incredibly dumb statement.",
            "You say that a lot.",
            "Nope, they don't need it.",
            "I don't think they are arguing. They are stating that it is not pathetic, like you did. \n\nNow I am arguing sematics.",
            "I often find people who complain about arguing over semantics just refuse to admit they were wrong and worded something in a terrible way. Like you are right now",
            "I was generalizing, I apologize.\n\nI call it peacocking or Nouveau riche.  Sometimes people come into money and they don't put it away.  I applaud them for feeding the economy.  I've done it and don't regret it.\n\nJust don't go digging into debt.  That shit will bury you.\n\nYour opinion on people you know is different to me than just \"people on Instagram\".",
            "But you are also poor, which makes it more pathetic. /s",
            "While I agree with you, there are a couple formally rich guys that are in the public eye right now declaring bankruptcy due to law suits, they are definitely pathetic!",
            "How do you define system and how do you define the word opresson? What do they mean in this context?",
            "I would say its not even dumb. Its bad intented",
            "Welp, people hear what they want to hear. Putting words into my mouth about how I think the poor are pathetic based on me saying that people pretending to be rich are actually more pathetic than \"actually being\" poor (what they actaully are) is an example.",
            "Given the context they are very clearly suggesting that society in developed nations minimises class mobility and disenfranchises the working class.\n\nThere is quite a bit of evidence that supports this, like [this study](https://cepr.org/voxeu/columns/whats-your-surname-intergenerational-mobility-over-six-centuries) that shows intergenerational wealth being maintained across a little over 20 generations in Italy which demonstrates a lack of downward mobility for upper class families. Or [this US-based study](https://opportunityinsights.org/paper/the-fading-american-dream/) showing the rapid decline in upward mobility for the working class in recent decades.\n\nThe natural response to that will be something along the lines of \"it's nowhere near as bad as living in \\[country x\\], you don't know what real oppression is!\" Whilst I don't necessarily disagree with this it doesn't mean that we can't strive to be better, or that rising inequality in developed nations shouldn't be a concern."
        ]
    },
    "Everyone's dad masturbated the exact right amount of times for you to be born. One more or one less before your conception and you wouldn't exist.": {
        "title": "Everyone's dad masturbated the exact right amount of times for you to be born. One more or one less before your conception and you wouldn't exist.",
        "score": 57,
        "url": "https://www.reddit.com/r/Showerthoughts/comments/1dlu6bg/everyones_dad_masturbated_the_exact_right_amount/",
        "content": "",
        "num_comments": 44,
        "comments": [
            "Mine couldn't figure out how to masturbate.",
            "That's not how that works",
            "Do you think sperm is stored for years if you dont masturbate? How many time they did it in their life in irrelevant",
            "Everyones dads dad too ad infinitum.",
            "Am I to avenge my fallen siblings?",
            "Not just masturbation. Your dad also had to have the right amount of luck with the ladies. I wonder who I’d be if my pops wasn’t such a dork.",
            "Actually this is false. Sperm stays in the body for like 70-75 days then it is reabsorbed",
            "My old man had an ingrown ball hair and I hung on to that root, clinging to the sides of his balls for weeks waiting for my shot.",
            "Would you know it wasn't you? Or would you experience you, just as a different person?",
            "Why does everyone think they’re the sperm when the majority of your organic material is from the egg?",
            "IT doesnt make sense.",
            "Do you often think about your dad masturbating while you’re in the shower?",
            "Funny you mention this and not your mother producing the right amount of eggs.",
            "Not how it works but what I can guarantee you is, we all started as our mum's cream pie.",
            "Well it is true that.. I didn't want to sleep tonight. But.. really? Right in front of my Fortnite squad??",
            "That's from an Indian Streamer's stream. He said this. SamayRaina youtuber's name",
            "I’ve wiped countless einsteins (and hitlers) off my belly and deposited them in the toilet",
            "How many siblings do you have ?",
            "Bingo! Sadly par for the course in this sub.",
            "explain then im curious",
            "Another failure of sex education",
            "Yeah. It’s actually about *when* they bang. Couple days earlier or later and they could have gotten a doctor or a lawyer or something but instead they got me.",
            "I believe OP didn't care about the exact sperm, but moreso about how the dad was or wasn't horny in one particular moment. One more or less fap would mean that the conception sex wouldn't happen exactly as it did.",
            "Lol you couldn’t be more wrong.",
            "I like your mind 😂",
            "Does it actually work this way. If it does you wouldn't cause your dad would've had to meet you mom at the exact moment and all.",
            "Like it has that long to stay inside 😂",
            "Absolute legend.",
            "Majority? It’s like basically 50-50 unless you count mitochondrial DNA",
            "50.50 bro",
            "No that would be weird. I usually think about everyone's dad masturbating",
            "First thing in my mind!",
            "God bless you!",
            "spermatogenesis, look it up, before spurting nonsense.",
            "What a bummer ",
            "Please explain how they’re wrong\n\nDo you think that if a man doesn’t have sex or masturbate for 10years, one set of sperm stay in the queue ready to go that entire time?",
            "The egg is much bigger than the sperm",
            "Everyone including your own, and your mum and dad's dad",
            "You should read a biology textbook"
        ]
    }
}