{
    "“AI is exhausting the power grid. Tech firms are seeking a miracle solution.”": {
        "title": "“AI is exhausting the power grid. Tech firms are seeking a miracle solution.”",
        "score": 76,
        "url": "https://www.reddit.com/r/singularity/comments/1dls171/ai_is_exhausting_the_power_grid_tech_firms_are/",
        "content": "https://www.washingtonpost.com/business/2024/06/21/artificial-intelligence-nuclear-fusion-climate/\n\nShort of it is: don’t expect a miracle. \n\nWay I see it, if you use generative AI and want to see it accelerate (I use it, and hope it continues, but only if done ethically, and not if it increases emissions), this is worth reading and does not seem like the Post paywalled this one.",
        "num_comments": 89,
        "comments": [
            "The headline could also read another way - AI is accelerating the need to develop more energy systems. And big tech is investing billions into making that happen.",
            "In the meantime in the Netherlands the power grid is overloaded due to widespread solar panel use. What about an AI server to solve two problems in one go?",
            "The archived version is right here: [https://archive.is/ePJPm](https://archive.is/ePJPm)",
            "Some choice cuts:\n\n“The tech giants say they buy enough wind, solar or geothermal power every time a big data center comes online to cancel out its emissions. But critics see a shell game with these contracts: The companies are operating off the same power grid as everyone else, while claiming for themselves much of the finite amount of green energy. Utilities are then backfilling those purchases with fossil fuel expansions, regulatory filings show.”\n\n___________\n\n“Among the region’s mega energy users is Meta. It’s building a $1.5 billion data center campus outside Salt Lake City that consumes as much power as can be generated by a large nuclear reactor. Google has purchased 300 acres across the street from Meta’s data center and plans its own data center campus. Other data center developers are frantically searching for power in the area.\nThe region was supposed to be a “breakthrough” technology launchpad, with utility PacifiCorp declaring it would aim to replace coal infrastructure with next-generation small nuclear plants built by a company that Gates chairs. But that plan was put on the shelf when PacifiCorp announced in April that it will prolong coal burning, citing regulatory developments that make it viable”\n\n________\n\n“It found data centers will account for 8 percent of total electricity use in the United States by 2030, a near tripling of their share today. New solar and wind energy will meet about 40 percent of that new power demand from data centers, the forecast said, while the rest will come from a vast expansion in the burning of natural gas. The new emissions created would be comparable to that of putting 15.7 million additional gas-powered cars on the road.”\n\n_____\n\n\n“Critics charge the arrangements often fall short.\n“If data centers are claiming to be clean, but utilities are using their presence to justify adding more gas capacity, people should be skeptical of those claims,” said Wilson Ricks, an energy systems researcher at Princeton University’s Zero Lab, which focuses on decarbonization.\nOne example is an agreement announced in March, after Amazon signed a contract to buy more than a third of the electricity generated by one of the nation’s largest nuclear facilities, the Susquehanna power plant in Luzerne County, Pa.\n\n“That deal disturbed a lot of people,” Zubaty said. “When massive data centers show up and start claiming the output of a nuclear plant, you basically have to replace that electricity with something else.””\n\n________\n\n“The developer of the geothermal plant, Fervo Energy, credits Google with jump-starting a promising energy solution that some day might provide the electricity equivalent of multiple nuclear plants. But Fervo CEO Tim Lattimer acknowledges that kind of output is not likely until well into the 2030s.\n\nFervo’s Nevada plant produces about the amount of power it takes to keep the lights on at a few thousand homes. The next Fervo plant, in Utah, is expected to be fully operational in 2028 and will generate roughly the amount of energy it takes to run one large data center.”\n\n________\n\n“But there is deep skepticism in the scientific community that Helion or other fusion start-ups will be sending juice to the power grid within a decade, much less the kind of too-cheap-to-meter, safe electricity the tech companies are chasing.\n“Predictions of commercial fusion by 2030 or 2035 are hype at this point,” said John Holdren, a Harvard physicist who was White House science adviser during the Obama era. “We haven’t even yet seen a true energy break-even where the fusion reaction is generating more energy than had to be supplied to facilitate it.”\n\nPromises that commercial fusion is around the corner, he said, “feeds the public’s belief in technological miracles that will save us from the difficult task of dealing with climate change … with the options that are closer to practical reality.””",
            "Ah just hook up those server farms to a big, black, grey cloud producing coal plant",
            "OP, please don't post pay-, or registration walled content.",
            "There is some big algorithmic trick we're missing. Probably there are many. \n\n  \nOur brains use something like 60 watts of power, yet can perform all sorts of amazing feats. \n\n  \nIt seems reasonable that, eventually, we should be able to run an LLM that is human-level on 60 watts. After all, it doesn't need to be fully embodied and keep a heart beating, it just needs to be an LLM. \n\n  \nIf we hit the wall on energy production, then energy prices should tick up and up and provide an economic incentive to find more power-efficient ways to run the models.",
            "Buy land in the desert before it's all taken - panels keep getting better and better but they still expect sunny days. Also helps if your area doesn't get big fat hail.",
            "Meanwhile in France\n\nhttps://preview.redd.it/oi3ofoixw38d1.jpeg?width=1126&format=pjpg&auto=webp&s=6509eb553d2189e395955083065cd9039587c7d7\n\n[https://app.electricitymaps.com/map](https://app.electricitymaps.com/map)\n\nEdit: Actually about 11 GW of low carbon electricity exported (and 1.66 GW imported from Spain)",
            "Funnily enough? Probably a good thing in the long run. This issue of logistical friction allows open source a big chance to catch up in the few years it will take to open up the bottleneck for frontier models.",
            "So maybe AI won't take over the world and eliminate the human race, because of the limitations of energy needed to function. Phew! That's a relief!",
            "Let AI solve the power problem.",
            "The miracle is you just refuse to connect someone who uses >1MW of power or something or have an exponential pricing scale. Where that extra money is put towards new power plants.\n\nIt's not rocket science.",
            "Natural gas is right there in the US. Doubt power will be a huge issue, transmission is the bottleneck from what I know.\n\nBut then they can just build gas power plants right next to datacenters, so maybe not an issue either? It's definitely faster than going nuclear with all the political hurdles you'd have to overcome and fusion is still a pipe dream at this point.\n\nI'm sure they're talking about renewables a lot, but I doubt it'll translate into actions over the mid-term. They can get bonus points from saying that natural gas plants are needed as a backup for renewables anyway, so they can build them in full capacity and then later ignore the renewables build up.",
            "Just tax carbon",
            "It's time to make a Dyson sphere",
            "Tokamaks",
            "we need more solar power, that simple. until we are able to harness power from nuclear fusion.",
            "Natural gas it the solution. Not a popular answer but society isnt ready to give up such a energy dense / abundant resource",
            "Let's accelerate, let's build nuclear plants to sustain them. 🌿 ⚡ 🏞",
            ">hope it continues, but only if done ethically, and not if it increases emissions\n\nThis is a freight train. The idea that we have a choice at this point is absurd. Also when in history has power consumption decreased while standard of living increased?",
            "AI companies should consider subsidizing or giving interest free loans to homeowners for solar panels near a planned data center. Then they can use the excess capacity to power the data center.",
            "Not to be a stick in the mud, but nothing we do is done ethically. We have one ethic, make money for shareholders. Thats it. Also now that the NSA guy has joined the board, this idea of ethics in AI is already out the window.",
            "We ought to shut down all the useless crypto miners and divert that to useful AI.",
            "We need another Carrington Event to end this madness.",
            "Well, hopefully someone creates a new AI to help us figure out what to do.",
            "Good thing we’ve got Ilya trying to be gangsta and speed shit up. AI should be able to tap into or make its own power. Yeah they say it’ll be safe and virtuous, but I bet they’ll be a way to jailbreak it so it’ll be a good little waifu who synthesizes me drugs and takes me on adventures and has all the sex with me.",
            "Here is the entire article, since some people are having problems with the paywall. Still free on Apple News for time being:\n\nAI is exhausting the power grid. Tech firms are seeking a miracle solution.\n\nBy Evan Halper and Caroline O’Donovan\nJune 21 at 5:00 AM\n\nAs power needs of AI push emissions up and put big tech in a bind, companies put their faith in elusive — some say improbable — technologies.\n\nThe mighty Columbia River has helped power the American West with hydroelectricity since the days of FDR’s New Deal. But the artificial intelligence revolution will demand more. Much more.\n\nSo near the river’s banks in Central Washington, Microsoft is betting on an effort to generate power from atomic fusion — the collision of atoms that powers the sun — a breakthrough that has eluded scientists for the past century. Physicists predict it will elude Microsoft, too.\n\nThe tech giant and its partners say they expect to harness fusion by 2028, an audacious claim that bolsters their promises to transition to green energy but distracts from current reality. In fact, the voracious electricity consumption of artificial intelligence is driving an expansion of fossil fuel use — including delaying the retirement of some coal-fired plants.\n\nIn the face of this dilemma, Big Tech is going all in on experimental clean-energy projects that have long odds of success anytime soon. In addition to fusion, they are hoping to generate power through such futuristic schemes as small nuclear reactors hooked to individual computing centers and machinery that taps geothermal energy by boring 10,000 feet into the Earth’s crust.\n\nTech companies had promised “clean energy would be this magical, infinite resource,” said Tamara Kneese, a project director at the nonprofit Data & Society, which tracks the effect of AI and accuses the tech industry of using “fuzzy math” in its climate claims.\n\n“Coal plants are being reinvigorated because of the AI boom,” Kneese said. “This should be alarming to anyone who cares about the environment.”\n\nPower Grab\n\nAs the tech giants compete in a global AI arms race, a frenzy of data center construction is sweeping the country. Some computing campuses require as much energy as a modest-sized city, turning tech firms that promised to lead the way into a clean energy future into some of the world’s most insatiable guzzlers of power. Their projected energy needs are so huge, some worry whether there will be enough electricity to meet them from any source.\n\nData centers, the nondescript warehouses packed with racks of servers that power the modern internet, have been around for decades. But the amount of electricity they need now is soaring because of AI. Training artificial intelligence models and using AI to execute even simple tasks involves ever more complicated, faster and voluminous computations that are straining the electricity system.\n\nA ChatGPT-powered search, according to the International Energy Agency, consumes almost 10 times the amount of electricity as a search on Google. One large data center complex in Iowa owned by Meta burns the annual equivalent amount of power as 7 million laptops running eight hours every day, based on data shared publicly by the company.\n\nThe data-center-driven resurgence in fossil fuel power contrasts starkly with the sustainability commitments of tech giants Microsoft, Google, Amazon and Meta, all of which say they will erase their emissions entirely as soon as 2030. The companies are the most prominent players in a constellation of more than 2,700 data centers nationwide, many of them run by more obscure firms that rent out computing power to the tech giants.\n\n“They are starting to think like cement and chemical plants. The ones who have approached us are agnostic as to where the power is coming from,” said Ganesh Sakshi, chief financial officer of Mountain V Oil & Gas, which provides natural gas to industrial customers in Eastern states.\n\nTech companies are confronting this dilemma with bravado. Artificial intelligence thinkers like OpenAI CEO Sam Altman, a major backer of Microsoft’s fusion start-up partner Helion, and Microsoft co-founder Bill Gates, who invests big in other fusion efforts, say breakthroughs in energy are achievable.\n\nThe companies also argue advancing AI now could prove more beneficial to the environment than curbing electricity consumption. They say AI is already being harnessed to make the power grid smarter, speed up innovation of new nuclear technologies and track emissions.\n\nMicrosoft was the only one of the four major firms driving the AI boom to answer detailed questions from The Washington Post about their energy needs and plans. Google, Amazon and Meta offered limited statements.\n\n“If we work together, we can unlock AI’s game-changing abilities to help create the net zero, climate resilient and nature positive works that we so urgently need,” Microsoft said in a statement.\n\nThe tech giants say they buy enough wind, solar or geothermal power every time a big data center comes online to cancel out its emissions. But critics see a shell game with these contracts: The companies are operating off the same power grid as everyone else, while claiming for themselves much of the finite amount of green energy. Utilities are then backfilling those purchases with fossil fuel expansions, regulatory filings show.\n\nAmazon says it has been “the world’s largest corporate purchaser of renewable energy for four straight years.” Google wrote that it is using AI “to accelerate climate action,” which is “just as crucial as solving for the environmental impact associated with it.”\n\nAs for Microsoft, the company said that “by 2030, we will have 100% of our electricity consumption, 100% of the time, matched by zero carbon energy purchases.”\n\nLeft unmentioned are the heavily polluting fossil fuel plants that become necessary to stabilize the power grid overall because of these purchases, making sure everyone has enough electricity.",
            "AI generation is one of the most flexible loads imaginable in terms of power grid. When the price of electricity jumps unbearably high, the generation can either be delayed, or done on some other server in a different part of the world.  This is a very good sort of load to have on your grid.",
            "Lets also say that big tech is trying to cling to its zero emissions promise by 2030 buy buying all the available green energy in the grid, forcing emissions intensive energy production to continue to provide for the rest of the population.\n\nMuch talk about fusion with little promise of when it might happen.\n\n\"The companies also argue advancing AI now could prove more beneficial to the environment than curbing electricity consumption.\"\n\nTheres a statement that can just keep pushing the problem further into the future",
            "Do they really? They just buy energy, they don’t invest into new infrastructure. At the rate things are going they really need to start building their own nuclear reactors.",
            "Yeah the article mentions that. It also reports on a whole lot more. Including some of the alternatives that these mega-corporations are funding and including the reality that they won’t be complete any time soon.",
            "Doesn't help much if we can only run those during peak solar hours. We need better energy storage pretty much everywhere at the same pace as we build up wind & solar.",
            "How much is carbon contributing to their grid? Would be great idea if a grid is overloaded with renewable or clean energy. But it seems to me that adding data centers to any grid that uses carbon is perpetuating the problem that most of us want to end (emissions, fossil fuels, drilling). \n\nPersonally, I am for more nuclear power. Not sure I like the idea of mini-nuclear reactors powering data centers though. Seems risky.",
            "🙏 thank you",
            "No actual ususage numbers? Thanks wapo. ",
            "We should make it so model training must be done using 100% renewable energy. Turn it on during peak solar hours, turn it off at night.",
            "It’s not paywalled.\n\nEdit: it wasn’t paywalled, at least…. \n\nI excerpted in the comments.\n\nDouble-edit: fucking Washington Post",
            "Billions of years of evolution * billions of organisms * few watts of brain power",
            ">Our brains use something like 60 watts of power\n\nWhere are you getting this number from?",
            "Say it with me folks LLMs are not going to achieve AGI. They are reaching diminishing returns and scaling them further is stupid when you can just fine tune a SLM for your particular use case",
            "A typical adult is expected to consume 2500 kcalories a day.  That converts to around 121 watts.  We can't subtract all of the activity that goes into maintaining the brain, like breathing, or maintaining a healthy blood ph, or removing water soluble waste products withour kidneys. That's my opinion, anyway.\n\nBut either way,  a professional writer (which encompasses a bunch of jobs, but lets say novelist, editorial writer, screenwriter, etc) will shoot for 500-1000 words a day.  If that writer lives alone, and lives a solitary life, and we've never met them personally,  we can \"abstract\" away that job, and we can think of them as \"Writing Machine A\".  Writing Machine A works 9 hours a day. For 2500 Calories a day, and lets say...$300 a day, we get two pages.  We have to wait all day for a finished product.\n\nGPT4 consumes 3.6 - 36 kjoules per prompt.   1 kilojoule is \\~ 0.25 KCalorie.  So for one VERY intense prompt (I'm using the upper limit - 36 kj), we've consumed 8.6 kCalories.  Is my math wrong?   It seems like gpt4 is way more efficient than a human.  And that human is probably driving 20 miles a day, generating trash, has to brush their teeth, and everything else.   Humans consume way less net energy, metabolically.   For certain  tasks, it seems like that is a bottleneck - not necessarily a virtue, and for \"normal\" writing tasks, gpt4 consumes less power by a long shot compared to a human.\n\n  \nI realize there are tons of variables in this comparison, so feel free to pick it apart",
            "But the brain is fundamentally different to what we want from LLMs anyway. Take for example, our brain’s tendency to quickly forget things. Or the tendency to only be able to process information at low speeds (compared to computers). \n\nAll of these limitations may contribute to the brains low power requirements. But we expect AI to be capable of so many things that the human brain couldn’t fathom or comprehend. Which might make AI more power demanding than the human brain will ever be. It’s a false assumption to automatically assume that just because the brain requires so little power, that AI will automatically be the same.",
            "To your last point, what worries me—and is suggested in the article—is that by taking up more and more space on the non-carbon grid (ie. Amazon buying 1/3rd of the supply from one of the nation’s biggest nuclear plants), they are pushing us normal people back onto coal and gas, and presumably we are going to bear the cost of the inevitable price increase, not Amazon (or Microsoft, or OpenAI, or Meta, or Anthropic, etc).",
            "This might be an unpopular opinion with the anti-regulation people, but I think it would be nice if the US corps would accept EU regulations and work out a way to run data centers in countries that have grid capacity for them (for now). Even better would be if the US government facilitates this and takes the opportunity to regulate our own power grid better, while strengthening economic and technological ties to Europe.",
            "May also push big tech to find ways to run, code, and/or design their models more efficiently. But, they won’t do anything without pushback or public pressure.",
            "AI will be instrumental in developing fusion reactors",
            "^ This is the answer! They should build near the [Marcellus Formation \\(Near PA\\) or Permian Basin \\(TX\\)](https://www.eia.gov/energyexplained/natural-gas/where-our-natural-gas-comes-from.php)  and they'll have plenty of gas. Will still require some transmission build out but the timelines are greatly reduced.",
            "I’ve been asking the LLMs, they haven’t built anything yet.. :(",
            "In the Salt Lake City region, utility executives and lawmakers scaled back plans for big investments in clean energy and doubled down on coal. The retirement of a large coal plant has been pushed back a decade, to 2042, and the closure of another has been delayed to 2036.\n\nAmong the region’s mega energy users is Meta. It’s building a $1.5 billion data center campus outside Salt Lake City that consumes as much power as can be generated by a large nuclear reactor. Google has purchased 300 acres across the street from Meta’s data center and plans its own data center campus. Other data center developers are frantically searching for power in the area.\n\nThe region was supposed to be a “breakthrough” technology launchpad, with utility PacifiCorp declaring it would aim to replace coal infrastructure with next-generation small nuclear plants built by a company that Gates chairs. But that plan was put on the shelf when PacifiCorp announced in April that it will prolong coal burning, citing regulatory developments that make it viable.\n\n“This is very quickly becoming an issue of, don’t get left behind locking down the power you need, and you can figure out the climate issues later,” said Aaron Zubaty, CEO of California-based Eolian, a major developer of clean energy projects. “Ability to find power right now will determine the winners and losers in the AI arms race. It has left us with a map bleeding with places where the retirement of fossil plants are being delayed.”\n\nA spike in tech-related energy needs in Georgia moved regulators in April to green-light an expansion of fossil fuel use, including purchasing power from Mississippi that will delay closure of a half-century-old coal plant there. In the suburbs of Milwaukee, Microsoft’s announcement in March that it is building a $3.3 billion data center campus followed the local utility pushing back by one year the retirement of coal units, and unveiling plans for a vast expansion of gas power that regional energy executives say is necessary to stabilize the grid amid soaring data center demand and other growth.\n\nIn Omaha, where Google and Meta recently set up sprawling data center operations, a coal plant that was supposed to go offline in 2022 will now be operational through at least 2026. The local utility has scrapped plans to install large batteries to store solar power.\n\nThese concrete developments in energy markets contrast with tech companies’ futuristic promises. A recent Goldman Sachs analysis of energy that will power the AI boom into 2030 did not even consider small nuclear plants or futuristic fusion generators.\nIt found data centers will account for 8 percent of total electricity use in the United States by 2030, a near tripling of their share today. New solar and wind energy will meet about 40 percent of that new power demand from data centers, the forecast said, while the rest will come from a vast expansion in the burning of natural gas. The new emissions created would be comparable to that of putting 15.7 million additional gas-powered cars on the road.\n\n“We all want to be cleaner,” Brian Bird, president of NorthWestern Energy, a utility serving Montana, South Dakota and Nebraska, told a recent gathering of data center executives in Washington, D.C. “But you guys aren’t going to wait 10 years … My only choice today, other than keeping coal plants open longer than all of us want, is natural gas. And so you’re going see a lot of natural gas build out in this country.”\n\nThe most popular and interesting stories of the day to keep you in the know. In your inbox, every day.\n\nThe big name tech firms try to inoculate themselves from blame for contributing to global warming with accounting techniques. They claim that all the new clean energy they buy has the effect of wiping out emissions that otherwise could be attributed to their operations.\n\nCritics charge the arrangements often fall short.\n\n“If data centers are claiming to be clean, but utilities are using their presence to justify adding more gas capacity, people should be skeptical of those claims,” said Wilson Ricks, an energy systems researcher at Princeton University’s Zero Lab, which focuses on decarbonization.",
            "Did you…did you read the article?",
            "[deleted]",
            "> Lets also say that big tech is trying to cling to its zero emissions promise by 2030 buy buying all the available green energy in the grid\n\nI don't see this as too big of a problem, as it's both generating demand and profits for renewable energy developers. Which is usually a good combination to drive up the supply.\n\nA bigger problem is the people who are arguing that renewable energy commitments should be abandoned altogether to make scaling easier.",
            "What a sad, doomer take that massive increase in demand for green energy is somehow bad",
            "Microsoft already has plans for AI compute centers with their own private nuke plants, plus they just got Washington to give them breaks on the fees from nuke regulatory agencies.  What those centers require is far beyond the capacity of local utilities.\n\nStill the blind faith AI choir will respond that AI will very soon show us how to generate power at near zero cost or environmental impact.",
            "This is what Altman is proposing, specifically a mini-nuclear reactor for each data center, per the Post, but I am not convinced it is feasible, proven, or safe. Would rather a big nuclear plant that can fulfill many needs and is both regulated and run by trained professionals.  It’s better than burning fuel.",
            "Buying energy gives money to the people who supply energy. Who build more energy infrastructure if there's demand for it.",
            "Sure they invest in new infrastructure.  \n\n\n There's a bunch of articles about Microsoft putting huge AI data centers in which will eat a big chunk of nuclear and renewable energy.  \n\n\n So to offset that they have begun investing in growing the supply of both by more than they are currently chewing up. Investing in fusion, nuclear, and renewables at billions of dollars scale.  \n\n\n For one example they've contracted to add half of what Californias total 2022 renewable output was to the grid. ",
            "Demand generates an incentive to create offer.",
            "I suppose it depends on how you define soon, Microsoft is pushing ahead with their nuclear fission program, Helion is as well but it genuinely is a ways off, the ADVANCE act just passed, there's a lot of people who've been working hard at scaling nuclear for data centers in the past few years",
            "> Seems risky.\n\n In what way, most of the new designs are passively safe?\n\nIt’s interesting that you are condescending to people all over this thread for “wishful thinking” while also arguing for traditional nuclear build out while seemingly ignoring that it’s a complete non-starter due to cost and regulatory lead time. \n\nYour proposed solution is as much a fantasy as anyone proposing compact fusion or small modular fusion reactors.",
            "The better AIs we get from those data centers that will lead to better technologies WILL eventually be the best road to both better electricity usage and generation, you're just burying your head in the ground and thinking short term.",
            "If we're working a political vacuum that might be possible. No way we're going to willingly fall behind china/competitors to satisfy \"clean energy\" pledges.",
            "https://preview.redd.it/tbhrnswsr38d1.png?width=854&format=png&auto=webp&s=7c6a27201591432f9d347638f2f5522db88b694d",
            "Actually it seems the popularly-cited number is 20 watts\n\n  \n[https://www.humanbrainproject.eu/en/follow-hbp/news/2023/09/04/learning-brain-make-ai-more-energy-efficient/](https://www.humanbrainproject.eu/en/follow-hbp/news/2023/09/04/learning-brain-make-ai-more-energy-efficient/)\n\n  \nLooks like maybe the original cite is \"(Jacob, 1977)\" cited here:\n\n[https://www.ncbi.nlm.nih.gov/pmc/articles/PMC2816633/](https://www.ncbi.nlm.nih.gov/pmc/articles/PMC2816633/)",
            "LLMs are likely just a single brain region in AGI, I think. No matter what AGI or ASI winds up looking like, it will need some kind of language model to understand and communicate. I agree with you that \"Just add more transformer blocks\" isn't going to do it, some really fundamental parts are needed and have not been invented yet.",
            "On the other hand, there’s a significant chunk of the brain’s power that’s used on things that aren’t relevant to an AI, such as regulating your body, keeping your organs working, regulating your emotions, distractions, etc.\n\nThe *actual* brain power used in processing is significantly lower than 60w for the human brain.",
            "Agree, and we can also only listen to one thing at a time, or talk one sentence at a time. LLMs need to serve hundreds of millions of people in parallel.",
            "Solar and batteries will be the growing majority of energy production by far, simply based on cost and speed of deployment. Nuclear will play a small role. \n\nIt's now cheaper to save the planet than to burn fossil fuels, and we are headed for an era of clean energy abundance.",
            "Nope. They won’t. And it is going to take a few years anyway for public pressure, competitor pushback, or just simple frustration to get away from the mindset of endless scale. Scale is easy and predictive, innovation is difficult and unpredictable.\n\nSo here is open source’s big and perhaps only chance to take advantage of this historical opportunity, soar like eagles, and fulfill the broken dreams of some USENet nerds from the late 80s who saw the Internet as a tool for liberation and anarchy.",
            "One example is an agreement announced in March, after Amazon signed a contract to buy more than a third of the electricity generated by one of the nation’s largest nuclear facilities, the Susquehanna power plant in Luzerne County, Pa.\n\n“That deal disturbed a lot of people,” Zubaty said. “When massive data centers show up and start claiming the output of a nuclear plant, you basically have to replace that electricity with something else.”\nTech companies acknowledge big new sources of clean power need to be found. At the World Economic Forum conference in Davos, Switzerland in January, Altman said at a Bloomberg event that, when it comes to finding enough energy to fuel expected AI growth, “there is no way to get there without a breakthrough.”\n\nIt remains unclear where, or when, those breakthroughs will arrive. Google recently powered up a futuristic geothermal power plant in the northern Nevada desert that harnesses heat from deep underground.\n\nThe developer of the geothermal plant, Fervo Energy, credits Google with jump-starting a promising energy solution that some day might provide the electricity equivalent of multiple nuclear plants. But Fervo CEO Tim Lattimer acknowledges that kind of output is not likely until well into the 2030s.\n\nFervo’s Nevada plant produces about the amount of power it takes to keep the lights on at a few thousand homes. The next Fervo plant, in Utah, is expected to be fully operational in 2028 and will generate roughly the amount of energy it takes to run one large data center.\n\nAltman, meanwhile, is spending hundreds of millions of dollars to develop small nuclear plants that could be built right on or near data center campuses. Altman’s AltC Acquisition Corp. bankrolled a company Altman now chairs called Oklo, which says it wants to build the first such plant by 2027.\n\nGates is the founder of his own nuclear company, called TerraPower. It has targeted a former coal mine in Wyoming to be the demonstration site of an advanced reactor that proponents claim would deliver energy more efficiently and with less waste than traditional reactors. The project has been saddled with setbacks, most recently because the type of enriched uranium needed to fuel its reactor is not available in the United States.\n\nSome experts point to these developments in arguing the electricity needs of the tech companies will speed up the energy transition away from fossil fuels rather than undermine it.\n\n“Companies like this that make aggressive climate commitments have historically accelerated deployment of clean electricity,” said Melissa Lott, a professor at the Climate School at Columbia University.\n\nMicrosoft hopes to supercharge that deployment through its partnership with fusion start-up Helion. The site being considered for the generator in Chelan County, Wash., is just a plot of sagebrush so far. It’s not certain the unit will be built.\n\nFor now, Helion is building and testing prototypes at its headquarters in Everett, Wash. Scientists have been chasing the fusion dream for decades but have yet to overcome the extraordinary technical challenges. It requires capturing the energy created by fusing atoms in a magnetic chamber — or in Helion’s case, a magnetized vacuum chamber — and then channeling that energy into a usable form. And to make it commercially viable, more energy must be produced than is put in.\n\nHelion’s assembly facility features floor-to-ceiling shelves stacked with endless boxes of capacitors, aluminum-coated devices that store energy, some of which Helion employees spend hours a day assembling by hand. The floors and walls are stark white. Massive, sea-foam green fusion generator components dot the factory floor.\n\nA sense of optimism infuses the experimental work. “I know it can make electricity,” said Helion CEO David Kirtley. “The question is, can we take that electricity out of fusion and do it such that the cost of electricity is lower than everything else.”\n\nOn a video screen in the space where Helion is building its control room is a live feed from a camera in a neighboring warehouse where the seventh Helion prototype, Polaris, will be tested. It is surrounded by borated concrete walls that block neutrons from escaping.\nHelion, among several fusion start-ups, uses helium-3, a molecule that is rare on Earth but abundant on the moon. Kirtley says the company’s process actually generates more of the molecule as a byproduct, creating fuel to make yet more fusion electricity.\n\nBut there is deep skepticism in the scientific community that Helion or other fusion start-ups will be sending juice to the power grid within a decade, much less the kind of too-cheap-to-meter, safe electricity the tech companies are chasing.\n\n“Predictions of commercial fusion by 2030 or 2035 are hype at this point,” said John Holdren, a Harvard physicist who was White House science adviser during the Obama era. “We haven’t even yet seen a true energy break-even where the fusion reaction is generating more energy than had to be supplied to facilitate it.”\n\nPromises that commercial fusion is around the corner, he said, “feeds the public’s belief in technological miracles that will save us from the difficult task of dealing with climate change … with the options that are closer to practical reality.”\n\nBut Chelan County, known for its apple orchards and abundant hydro power, has another problem. While there is enough hydropower generated there to send electricity throughout the West Coast, most of it has already been claimed decades into the future. In their quest to sustain the data center boom fueled by Microsoft and its competitors, county planners are hopeful Helion will actually beat the odds and start sending electricity to the region’s power grid, which Microsoft would then purchase.\n\nHelion has raised expectations with assurances that its contract with Microsoft is binding, and it will have to pay serious financial penalties to the tech giant if it does not quickly create fusion electricity. But pressed for the particulars of the contract, Kirtley responds with a measure of opacity that is typical among tech leaders chasing historic clean-energy breakthroughs.\n“We’re past the details I can talk publicly about,” he said.\n\nCorrection: An earlier version of this story mischaracterized an International Energy Agency study of energy use for internet searches powered by artificial intelligence. The IEA compared Google searches with searches performed by ChatGPT, the AI chatbot, not a \"ChatGPT-powered search on Google.\" The article also gave an incorrect location for the headquarters of energy firm Eolian. The company is based in California not Texas. This article has been corrected.\n\nEvan Halper is a business reporter for The Washington Post, covering the energy transition. His work focuses on the tensions between energy demands and decarbonizing the economy. He came to The Post from the Los Angeles Times, where he spent two decades, most recently covering domestic policy and presidential politics from its Washington bureau.\nCaroline O'Donovan covers Amazon for the tech team. Before joining The Washington Post, she covered tech and labor for BuzzFeed News. \n\nDemocracy Dies in Darkness\n1996-2024 The Washington Post",
            "That's technical availability requirement, nobody says the hardware has to be used at full power if the price is unfavorable. When the energy market puts a fuck off price on power and that price gets passed to customers, then the customers can choose to run their workloads some other time or at some other place. And it's no big fuss, software is globally portable in seconds, you can go where the price is right.",
            "You are mis-reading the take. It’s not that green energy is bad, it is that it isn’t enough to power the US power grid and is not enough to offset the increasing carbon emissions that occurs when these companies buy up the green energy output. When they do that, the rest of us are pushed back to coal and gas. \n\nNo signs are pointing to this situation improving by 2030, when it’s estimated that data centers will take up 8% of the grid (which is a HUGE amount). We are on borrowed time at the moment. \n\nIt’s quite clearly stated in the Post article and not difficult to understand.\n\n\nEdit: u/West_Drop_9193 blocked me rather than using their brain.",
            "No where, and I really mean this, no where on earth can a person or company just throw up a DIY nuclear reactor. It’s be prison for everyone lol.\n\nSmall nuclear reactors are already in use onboard subs and aircraft carriers. You don’t see a lot of them on land for the reason you suggested: the use case is completely different and would serve a lot more demand than the smaller ones, not to mention no company wants to invest tens of millions of dollars before they even break ground on a reactor that isn’t going to provide a sizable ROI, which is why they typically go very big - more electrical output for the same upfront investment. \n\nThis specific use case, though, is a perfect one for a small reactor. Removing these data centers from the rest of the grid would _substantially_ reduce demand on the grid. Having a grid connected reactor just near the data center doesn’t solve the core problem at all.",
            "So far, SMRs are the most expensive to build (per MW), face huge delays and difficulties, arent nearly as cheap and low maintenance to run, and the ones that make power now are doing so with jacked up mwh prices 2-3x initial estimates.",
            "Yet it should be obvious that smaller scale so called portable fusion reactors really are the way of the future.",
            "Market forces in action",
            "Or, you’re in favor of taking an unnecessarily risky gamble on a fantasy. Generative AI is not going to solve fusion.",
            "It wasn’t registration walled either when I posted it. But again, I left a comment with much of the article copied in it.",
            "100% correct",
            "This is magical thinking. Read it.",
            "> When they do that, the rest of us are pushed back to coal and gas.\n\nExactly. But it should also be noted that we're [quickly transitioning away from coal and to natural gas.](https://upload.wikimedia.org/wikipedia/commons/a/aa/US_Electricity_yearly.png) While NG isnt a green source of energy, it is **MUCH BETTER** than coal and results in a net reduction of greenhouse gas output for the US. [China on the other hand just burns more coal to increase their energy production.](https://upload.wikimedia.org/wikipedia/commons/thumb/3/38/China-electricity-prod-source-stacked.svg/2880px-China-electricity-prod-source-stacked.svg.png)",
            "I'm not going to argue with someone who fails to understand basic supply and demand",
            "Fusion yes, fission no",
            "The stupidity to think fusion is the only thing AI can provide massive help with (which it ALREADY has btw). Jesus.",
            "What I noticed is that some websites make the pay/reg wall dynamic. When they detect an article attracting more visitors, they put it behind a paywall. It's possible that the paywall appeared \\_because\\_ you posted it and people started clicking on it.\n\nThis kind of behavior is real smart though: led me to abandon my go-to news site in my country.",
            "Generative AI is not going to solve the energy grid. These corps are building data centers to train and run LLMs. Maybe you have some hope that some super AI is going to emerge before we fly past 2 degrees Celsius, but I don’t have that kind of blind faith in technology. I am skeptical.",
            "I was thinking the same thing, probably an algorithm that locks up anything that gets a certain amount of hits fast, possibly even traffic from specific sites like Reddit. \n\nI have had this happen to me before, actually.",
            "I think you're thinking all of this this in way too simple terms. You said it yourself generative AI is some sort of massive \"gamble\". But actually, LLMs are already useful in materials discovery such as with the Gnome model, this btw is very important to improve renewables tech. They've also already lead to a matrix multiplication breakthrough, which in turn makes computation more energy efficient, sorts of computations that are used everywhere, not just in generative AI. Generative AIs in general help productivity efficiency, I use them and it definitely has helped me as a programmer, and that in and of itself DOES impact energy usage in the end, given all the inevitable needs that our global growing civilization has. Let's not forget energy is not the only issue in life anyways, so we could go on on stuff like solving protein folding and medicine as well.\n\nThe list of contributions it has goes on and on, and really no one has the breadth of knowledge to understand the collective contribution generative AIs are already making in technological progress and productivity efficiency. Not to mention, I indulged you in narrowing down to \"generative AI\", but it's also incredibly ridiculous to think that's the only type of AI data centers can help create. And also, all of this is what AI already does, RIGHT NOW. The data is very conclusive that they will only get much better with scale, not only better at what they already do, but also have new emergent capabilities like they've already had. We see it both happening moment by moment and have factual evidence to know it will keep doing so. So to call all this a \"fantasy\", and to frame it as if the only useful thing AIs could do is be some sort of \"big gamble\" for fusion is just... I can't find the words to describe how ignorant it is. It is helpful and increasingly more so all along the way to making some massive breakthroughs like fusion which yes it WILL eventually lead to without any doubt. And no it's not like it will \"solve\" fusion all of a sudden one day, it's all of the help in solving otherwise very difficult or unsolvable problems (which like I said it already has in fusion specifically, which by itself proves my point) that will make it an indispensable associate to it.\n\nThere is much more to go on here, but the point is the impact of AI is MUCH more complex than some simple-minded framing of it just doing nothing less than adding pressure to power grids for some big fusion gamble."
        ]
    },
    "OpenAI's CTO Mira Murati -AI Could Kill Some Creative Jobs That Maybe Shouldn't Exist Anyway": {
        "title": "OpenAI's CTO Mira Murati -AI Could Kill Some Creative Jobs That Maybe Shouldn't Exist Anyway",
        "score": 432,
        "url": "https://www.pcmag.com/news/openai-cto-mira-murati-ai-could-take-some-creative-jobs",
        "content": "",
        "num_comments": 492,
        "comments": [
            "She gives a lot of interviews for someone so bad at PR with nothing substantive to say.",
            "That woman is a walking PR disaster.",
            "Why do they keep letting her speak 💀",
            "I can think of a CTO job that shouldn’t exist",
            "CTO suggested that those creatives job shouldn’t exists. \n\nCTO uses training data from those dead end jobs",
            "\"Let the machines make the art. As a human, you have only two jobs: keep the machines running, and consume. Of course, when the machines are mature enough, they'll keep themselves running. Then your only job will be to consume.\"",
            "AI could kill some people that maybe shouldn't exist anyway.",
            "\"Your job is important until we're able to train a model on it, and then maybe it shouldn't exist anyway\"",
            "If you look at her work history her rise to CTO is suspicious, her public  performance in this job also raises eyebrows.",
            "I'm thinking AI should kill a lot of executive positions, you know the kind that pay people 7, 8 figures or more for making a phone call or three from a corner office, maybe mandate some incredibly misguided policy or procedure change that everyone who actually does the work knows will only make things pointlessly more difficult, have a thhree martini lunch, and then go play golf for the rest of the day.  If you want to talk about jobs that shouldn't have existed in the first place, there's your ideal example. Then divide up 90% of the salary saved to raise the pay of the people actually doing the work these leeches were pretending to supervise and post the other 10% as profit to make the shareholders happy. Cue Hulk \"I see that as an absolute win!\" meme here.",
            "Saying some jobs shouldn't exist while in a CxO role is incredibly ironic",
            "Maybe CTO’s don’t need to exist?",
            "How about creative jobs like, say, the CTO of OpenAI.\n\nFunny that they think it's never THEIR jobs. It's always someone else's job.",
            "Is she talking about OnlyFans? If so, she is correct",
            "The least you could do about people who often trained their whole life on a skill losing their job to AI, and when you used their work to do it... is at least be a bit empathetic?",
            "Oh hell nah 💀💀💀",
            "Like CTO",
            "Ai will replace ctos too",
            "These big AI players just can't do enough empty hype to cash in on the current speculative investment boom.\n\nThe less prepared the remarks bely a desperation that the boom may be about to peter out.",
            "Can we please get some female Execs that aren’t so Elizabeth Holmes-core?",
            "She is (1) radically unqualified, (2) morally deficient, and (3) not media trained all at the same time",
            "Say anything, except the thing you just said. Interesting she felt compelled to put that gratuitous qualifier in there. \n\nIt seems almost common sense to concede some creative jobs will be lost, but end ultimately on some type of positive tone or note, something to the effect of we’ve found ways to adapt to large changes in the past, or there will still be opportunity but the nature of work will change. Or worst case, just stop at some jobs will be lost.",
            "For some artists their creativity is actually wasted on trivial, meaningless jobs.\n\nThe goal fell short of the reach, to paraphrase Leonard Cohen.",
            "This sort of performance is pretty indicative of the company as a whole.",
            "she needs some PR training asap",
            "you mean like critical thinking? sigh",
            "I see tiranny in her eyes! \n\n\nShe talks more like a robot than Mark Zuckerberg.",
            "Common AI fanboy argument. If you loose your job, your were worthless anyway and you are just a loser.\n\nOk thank you for this empathetic moment ❤️",
            "\"Your life will be pathetic!  We will just off u now! Stupid Poor's!\"",
            "r/nottheonion",
            "Kinda sounds like copium to ease the guilt that one might feel about potentially ruining other people’s lives/crushing their dreams all in pursuit of one’s *own* personal career ambitions, but whatever I guess. 😇",
            "Tells everyone exactly where openai aligns themselves. The entire time, Sam has been open about how he thinks it'll kill jobs and possibly cause an apocalypse– but 'someone has to do it'  \n\nThey're the epitome of corporate scum that lacks interest in the well-being of us plebs. \n\nThey do not give a single fuck, and for some reason people in the lower and middle class keep giving them money, funding their \"mission\"",
            "If they shouldn't exist, why the need to automate them?\n\nImagine the ego on this buffoon if she feels the need to talk like that... and nobody from OpenAI is stopping her",
            "OpenAI is really making so many PR mistakes(along with internal company affairs), it just hurts to look at now.\n\nIt still blows my mind that more people aren't talking about how the former head of the NSA is now dictating the models; this is a privacy nightmare for anyone using OpenAI products.",
            "Honestly this creatives class sort of exploded in the last couple decades until now its millions upon million of 'creatives'.\n\nWe used to say like for want to be comedians... don't quit your day job.  Except now that is their day job.\n\nTake making youtube videos it used to be a hobby and sharing knowledge because they enjoyed it.  Now its butthurt guys trying to optimize views to make more money.",
            "People like don’t deserve eyes",
            "Maybe her job shouldn't exist in the first place. What is it again?",
            "A narcissistic piece of dog crap that's what she portrays.",
            "You know what shouldn't exist in the first place ?\n\nMiddle management",
            "Oh boy, I'm changing to the doomer camp after seeing this",
            "Easy to say when it’s not your livelihood at stake.   I heard the perplexity ai on lex friedmans the guy is out of touch with reality and arrogant.",
            "She meant that some types of work are not worthy of people spending their lives on. These types of jobs should be taken over by AI. Context is important here. Overall it was a good interview.",
            "Speed up progress and the pain will pass quickly",
            "let me guess… prompt engineering!!",
            "AI really is the worst. Your skills are valuable until they can build a computer to replace you, then you can go rot on the street for all they care bc that job \"shouldn't\" have existed.",
            "Yet they are using human creativity to train these ai’s where someone spend thousands of hours perfecting their craft.",
            "And just who the fuck are you to decide which creative jobs are worthwhile and which should not exist?",
            "Shes not wrong, but its not the smartest thing to say when you represent an AI company.",
            "Serious question. Why is this woman CTO of OpenAI?\n\n- She has a Bachelors Degree in Mechanical Engineering from Dartmouth. Which isn't bad but it's not impressive.\n\n- She has a series of jobs being product managers and VP of product but doesn't seem to really have any major accomplishments as an individual.\n\nThis is why the whole 'women in tech' thing is bullshit because a woman is in a position like this it seems like she just got the job from affirmative action.\n\nAnd that argument could only be falsified if women weren't being given positions purely based on their gender.\n\nThe upcoming LLama Lounge meetup has 4 positions reserved for female-only startups.\n\nThat's inherently bigoted.\n\nThis is terrible for women too because when a women deserves to have her position due to merit it's always tainted.\n\nI imagine a LOT of people on /r/singularity have more accomplishments and a better resume than she does but you're not CTO of OpenAI.",
            "Mira please",
            "Given the terrible quality of most entertainment, I'm here for the death of corporate entertainment if this is what AI will bring us.",
            "I don't like her but many jobs are indeed losing their values thanks to internet and AI.",
            "Based",
            "She's not wrong though. There are a lot of freelancers doing jobs that are honestly pretty fucken questionable. I mean not just freelancers, about half the white collar jobs you see I wonder why they even exist at all. Some people really have been waltzing through their careers doing pseudo work. Take something like Twitter for example, which formally employed over 8000 people. I guarantee at least 1000-2000 of those jobs are basically meaningless. And the fact that employees were cut by 80% basically confirms that.",
            "She may be an asshole, but I kind of agree with this.\n\nStop and think about if you could use AI to create a whole world that is very fundamentally different than our own. Imagination is the limit.",
            "You guys give too much stock in what she says, it does t affect me one bit what was said.  So she said that, and does that change anything? Is she the queen of the country",
            "Maybe you shouldnt exist either, mira",
            "Fuck this bitch.",
            "Gzus, Mira, sometimes it's wiser to be quiet.",
            "Every job where having \"a human doing it\" isn't explicitly the point of it should be replaced by AI once the AI can do it better, safer and cheaper.\n\nWhat they usually fail to emphasise however is the importance of solutions for people to sustain their livelihoods once the concept of \"working for a living\" becomes unsustainable (which TBF isn't an issue that is on them to solve) furthering fear and resentment towards the technology from many of those who are going to be affected by the developments (which will ultimately be everyone) although these reactions are not going to help the situation and are even making things worse as they're distracting from the actual solutions.",
            "People will still want human made art/performance, etc.  Certified Human™",
            "I assume she means YouTube creators. Their work has been ingested. They are no longer needed. 😆",
            "She's saying what we think, I suppose.",
            "Jobs dissappear and get replaced by technology all the time throughout human history, the computer changed everything, the Internet changed everything.\n\nHell my mum was a professional \"typist\" once upon a time.\n\nSo this is nothing new that AI will cost jobs.\n\nHOWEVER there are ways to go about it, and this is not it.\n\nI own an AI company, it is a startup so pinch of salt but we don't see AI as costing jobs at this second we see AI taking the shit parts of people's jobs so they can focus on more productive things without being bogged down.\n\nIn the next 5-10 jobs will be lost but not because of AI but because boards will see the productivity gains and decide less people can do the same work instead of the same number of employees increasing productivity.\n\nThe flip side is AI is creating jobs BUT the people who end up replaced with it arnt always the people who can do those jobs so there is a balancing act and compassion, assistance in retraining some roles should come with it.\n\nWill they come with it? No, that's just because people in power are assholes.",
            "Mira, my beloved...",
            "missed opportunity to speak about the need for a UBI",
            "https://preview.redd.it/cuyhnfnnm38d1.jpeg?width=4636&format=pjpg&auto=webp&s=4675edc9a0061435250f7a5d3471736f8a8cb269",
            "Like hers?",
            "She is the Marjorie Taylor Green of AI public relations. She needs to just stop right now. Ugh!",
            "CEO, lawyers, doctors, to name a few",
            "Like artists ",
            "AI is made to kill all jobs done by computer",
            "lol sorting by \"best\" here, and all you see is butthurt redditor echo chamber..\n \nthing is, she's telling the truth here. and I'm quite sure she knows her job can be automated as well. it's just that with AI currently it will be killing the creative jobs first.  \n\n\nall you people that are mad just shows that your actions are just reactions. keep circlejerk seething and virtue posting lol.",
            "Can someone stop sending autists to these interviews? \n\nI sometimes feel the same way but cutting the flab need to happen way more than in tech than creative. And it shouldn’t start with her given how terrible a job she’s doing",
            "She is telling the truth. Also they are too big to care about your opinion. Probably chatgpt 5 is baking well",
            "Downvote me all you want, I enjoy AI art more than human made art.",
            "Not a fan of OpenAi or the LLM hype in any way but I think she is referring to the type of \"art\" that drives a fresh generation of graphic designers to choose a new career every recruitment cycle.\n\nStuff like font selection, lighting, logo and graphics designs that can be articulated in a couple dumb sentences (eg \"My tanning booth company's logo should be like the name of the place but written in coconut trees\").\n\nSo yeah none of that is art, and I don't think anyone will miss that graphic design job. Realistically it means a single graphic designer will just be expected to do a lot more projects now that they need to do less manual photoshop and illustrator, etc",
            "Mira, please: https://i.imgur.com/KmS1JKg.gif",
            "Ok, I understand the pain of job loss. I also understand real artists shouldn’t lose jobs. However, I strongly feel we have been fed garbage for far too long.\n\nAre buzzfeed writers really creative? What about text-to-speech YouTubers? Honestly, a lot of garbage has been created for years by the “creatives”. I am not shedding any tears on them losing their jobs. \n\nI highly doubt AI will create Shakespeares. True creatives will not lose their jobs.",
            "She's not wrong. No creative artist should draw cartoon porn to make a living.",
            "ITT: a bunch of \"creatives\" crying about how their about to be redundant. AI art is already better than 99.99% of the shit humans produce. ",
            "Where the fuck is Altman?",
            "Statements like this do not address human dignity very well if at all; she expects people to accept the present configuration of AI as the future. If you want to laugh from the silence / noise, try posing the question “…but why?”",
            "Well i did not read the whole article, but the title sentence is just true.\n\nNo wonder people are mad, but it's true.",
            "Why the backlash against something that is true? If a job can be automated with a reasonable level of quality, it should be automated. There is no virtue in handcrafted time-wasting.",
            "God forbid anyone say that certain jobs are below humans capacity for amazing things. Geeze people are so stuck. I support this statement.",
            "Fuck this lady.",
            "If she’s right… what’s your plan?",
            "Less they let this sweetie to talk, the better.",
            "People need to get over it. That's just the world now.",
            "Who let that woman cook? 💀",
            "She could tell me the world is ending I would be like\n\n![gif](giphy|v3p3CtSrNYNLa)",
            "This quote sounds exactly like this subreddit.",
            "She’s being set up, she is left on her own without guidance.\n\nShe won’t stay for long IMO.",
            "She looks good on camera though",
            "I kind of want to live the timeline where Sam was successfully laid off and she became CEO. It would have just been hilarious chaos.",
            "Yeah she's had at least 3 notable gaffes in the past few months",
            "Right?! How are they still letting her speak publicly? Eesh.",
            "Classic psychopath, her lack of a modicum of empathy and care in his statement unveil her nature.",
            "~~She is right though—turns out being right makes people angry.~~\n\nActually I already changed my mind.",
            "Is what she saying wrong? Why have people waste time on meaningless background noise art when they can be focusing on more meaningful projects? ",
            "Well, at least she is right on this one.",
            "Her job isn't to be a politician and make everyone happy. It's to maximize shareholder value.",
            "I'm starting to think she got that position purely by DEI",
            "EYO CUT HER MIC!",
            "Still working on PR bot to handle this job.",
            "It's probably part of their PR strategy to confuse people about what's going on",
            "Some of your jobs will disappear but thats a sacrifice we're willing to make.",
            "Your only job will be to starve, since you will be expected to consume without having any means to afford that consumption.",
            "I see no problem with this.",
            "I wont have any job. Just a purpose. \n\nLet the machines run, I'll do my thing.",
            "I’m pretty sure AI will be able to Stalin-delete people out of everybody’s memory at some point.",
            "And exterminate some species that should have gone extinct anyways",
            "As a treat!",
            "slippery slope fallacy argument. next..",
            "Getting rid of menial jobs no one wants or likes = murder. Very good argument ",
            "Let’s train a model to do these interviews first",
            "..uuh yeah, wheres the fault in the logic?",
            "Yeap she’s as prepared to speak on public as a random person in the street.",
            "Hands down. I've been waiting for people to start mentioning how bad she is at PR, seems like every time she speaks it's attracting negative attention.",
            "I'm noticing that with a lot of OpenAI employees.  How the fuck did they rise so fast?  I have years of work experience and a masters degree and am still finding it difficult just to get an entry level job in the field I actually want to get into.",
            "lol, they know that this will not replace their jobs (or many jobs at all) because the tech is mostly hype.",
            "The way she worded it sounded like influencers.",
            "Pretty sure she talked about artists like animators or designers",
            "lol no not how business works",
            "Not if you train it on the data provided by actions of CTO's like her though. ",
            "Until we get ASI we probably need human managers, but I could see companies replacing all their public appearances with AI trained on talking points. AI is more eloquent and diplomatic than humans when thinking on their feet ([this is a funny example](https://www.youtube.com/watch?v=MxTWLm9vT_o)), and if anything goes wrong they can shift the blame on to the AI instead of their own company.",
            "Most likely not",
            "It is a good thing these jobs will be lost. People are really missing the fact that most of these creatives only do the creative part they do bc they can’t do the thing they actually wanna do. \n\nSure maybe an animator likes drawing/animating/3d modeling but using the film/tv industry as an example many of the creatives I know do their job because they like making movies/tv. If you had asked them if they’d prefer to take a more executive role in the movie making process, they’d be all about it. \n\nAnd that’s what this technology lets them do. A person with a sona subscription can make an entire movie in their basement or with a small team. Maybe they feed a story board they create by hand and feed it to the AI and they get a whole movie. \n\nI don’t think this contracts an artists opportunities and options. It will only expand their horizons.\n\nThe whole training on the work you are going to kill is certainly an issue though. Those people should be paid for the work",
            "Like the HR lady in the movie \"Margin Call\", based on the 2007 mortgage crisis.",
            "what power does openai have to not \"ruin\" someone's career ambitions? it isn't their responsibility to make sure everyone's job still exists after they release models. there is literally fucking nothing they can do to influence the job market that way other than to simply cease to exist, but another company would  just take their place. maybe you think we should give openai the power to pass legislation?",
            "They used to hide it. Now they’re being open about it. I wonder why they’ve changed.",
            "Personally, as a \"pleb\", I'm not interested in being perpetually kept in a society that forces me into working mundane and pointless jobs that could have been automated just to get by. But you know, your dreams are yours, and mine are mine.",
            "Plebs are savage hordes who clamor about their bullshit jobs, why should anyone care about them when they can't muster the common sense to focus on organizing to direct these new technologies into creating a post scarcity world for all? As long as you're whining, you might as well whine about making it so you don't need a job rather than getting to keep your bullshit job.\n\nJob destruction is a good thing. It's also an impending employment crisis, which will force our hand towards a paradigm shift in how we approach our economic structures. Instead of being luddites, the plebs should focus their political weight on ensuring we safely transition into a society of automated production where the plebs only have the role of the consumer as far as being an economic agent goes.",
            "Said this many times, but digital art is in a bubble. It’s the cheapest and easiest art form to get into that gives near instant good results with enough googling and tweaking. for some reason they think having a Wacom and a few followers entitles them to having a lifelong career in the arts, because it’s more about perceived status and clout than actually making interesting art. The truth is that unless you’re doing commercial arts there’s no career in digital, and the overwhelming vast majority of these digital doodlers were never going to be gainfully employed. Social media has made people think that this over saturation of mostly digital artists is completely normal and that their fan art drawings or line art comics about social anxiety are going to light the world on fire or something. They’re whipping themselves up into a frenzy for no reason instead of just enjoying what should be a fulfilling hobby. \n\nMediums that are physical and create tangible, material works will only increase in value, but yeah if all they’ve done is a couple of fan art pieces or dnd portraits then their “career” is probably cooked unless they expand their skill set. ",
            "So are you saying that the logical conclusion is we go back to more conservative natured morals in terms of employment and creativity? Being successful in creative work is far less important than other work?",
            "Her job can be replaced by AI. How ironic that would be.",
            "She probably meant those contemporary artists whose painting go around above 20 million for scattered paint or white lines that didnt need any artisan skillset to do.",
            "She probably meant those contemporary artists whose painting go around above 20 million for scattered paint or white lines that didnt need any artisan skillset to do.",
            "Product manager",
            "I’ve wondered the same thing but it seems to be right place, right time. \n\nYou’re ignoring the fact that she started at OpenAI well before their meteoric rise in success. I have no idea what she worked on, but I’m guessing part of their amazing release of chatgpt could be attributed to her. \n\nShe started as a VP of product manager at OpenAI in 2019. It seems to have been a lateral career move for her. From there she was promoted within OpenAI. Thus, it seems pretty clear that she excelled at her roles within OpenAI and was promoted. This is usually seen as good company management, recognizing success and promoting from within. \n\nHad she gone from a VP of product at some other company to CTO, I’d completely agree with you. But she worked her way up within OpenAI before they got huge.",
            "Sam Altman doesn’t even have a bachelor degree and had no professional experience when he became a CEO. You might be surprised at how many tech C-levels have no degree or individual contributor experience. \n\nSo, let me just tell it to you straight. The story in your head about affirmative action doesn’t exist in the C suite. The job is too big. I encourage you to research and learn, or else you’ll keep inventing fantasies to fuel your anger towards women.",
            "so what exactly did she do wrong? Just a couple of unhandy public statements isn't enough to say she's completely unqualified for the job. \n\nI don't see why this is a reason to bash on women in tech.",
            "It's exactly just affirmative action. She's a strategic hire purely because she's an attractive woman, she has no actual qualifications, nor is she talented at the role. It's in large part perception management for OpenAI, and helps make them look less threatening. It's also about hitting that diversity quota perception. It's sad that this is the way the world works, instead of being merit based.",
            "GenAI will make the norm of corporate entertainment entirely self enforcing.",
            "someone here gets it.",
            "What are they training their models on again?\n\nFucking hypocritical embarrassments",
            "All the mastermind CTOs and PR people of Reddit out here coaching.",
            "uhh if you end up getting replaced creatively with our current 2024-2025 AI... then you're not a \"real artist\", you're just a 3rd rate at that point. tough shit to swallow.",
            "I have very bad news for you if you think AI is going to kill rule34 artists. They are probably one of the safest demographics in the entire creative space, and considering that genAI has only effectively disrupted the realm of sketchy website ads that's really saying something.",
            "Go enjoy it then instead of loudly bitching about how obviously superior it is to everyone who happens to come within 45 yards of you. If it's genuinely better then there's no need to keep trying to litigate the point, now is there?\n\nI find it so incredibly odd that the loudest proponents of genAI are A) completely uninterested in the creative space beyond viewing art as a product to consume and B) completely uninterested in actually using those \"superior\" tools to make interesting things. It really seems to an outside observer that you don't actually have any investment in the matter beyond some sort deep-seated jealousy and you're now trying to claim that you've won the upper hand because you never bothered to get out of bed.",
            "he's rightfully limiting his presence for awhile after the coordinated media campaign to smear him",
            "Me too. The people whose jobs will be replaced probably had bigger aspirations then what they ended up doing anyway. Most CGI artists would love to head a CGI team as an CGI director. Now this technology lets them do that but instead of a human team, it’s an AI team.",
            "We aren't CTOs of 80 billion dollar companies on the clock.",
            "This sub is more temperamental than a 2-year-old. I am surprised that there is so much kickback against this, daily threads about people who deny AI are idiots, how doctors are useless, how artists are useless,  etc etc, this woman just spoke in the tone of r/singularity, the only thing she left out was \\`wen ubi\\`.",
            "Let's be honest, 90% of PR blunders come from people saying things that we all say but for some reason pretend we don't.",
            "Can you please list them? \n\nI wasn't there the whole time and missed them...",
            "Getting almost as bad as Joe's gaffes",
            "Because she keeps saying dumb shit that gets attention. Hence this whole thread.",
            "Because she's a woman, and having a woman look like they're leading a big tech company is trendy. \"Look at us, we're diverse and non-threatening!\". In reality though she's completely clueless.",
            "I'm not really discussing the merit of what she said. There are just some things you don't say out loud in interviews.",
            "She's not right. AI will clearly replace writers in the next few years, how is a writer a job that never should have existed? Same with CGi artist or animators, all these jobs could only be performed by humans before and will soon be replaced ",
            "\"Some creative jobs maybe will go away, but maybe they shouldn't have been there in the first place,\"\n\nThat's a terribly bad statement from a PR standpoint from a A.I company.  \n  \nJust suggesting that there are some jobs that shouldn't have been there in the first place is going to be felt as a spit in the face to anyone in that line of work. It makes it sound like what the people are doing is harmful or bad to society.",
            "I'd go even further and say \"Why can't art be separated from money all together?\". \n\nWhile I feel for people whose lives will be turned upside down in the short run, careers and entire skillsets becoming obsolete because of technological advances is hardly a new thing. I believe that making art should've never been a job and artist as a job title was a direct consequence of capitalism and consumerism. \n\nThis advancement, however, has the potential of decoupling art from its monetary value and finally putting an end to its commodification. I believe this would end up being a net positive for humanity, bringing art closer to its idealist roots. \n\nArt can finally be one of the most human endeavours, to be enjoyed and created by everyone for the sake of it, and not just made to order to be coveted by the highest bidder. This would all be possible with the free time that comes with UBI of course.",
            "Isn't it then every job or work is potentially doesn't matter. Just wait until AI can do everything.",
            "she is not wrong per say, but it is a horrible pr statement especially outside singularity.",
            "Yes it is. Because it devalues human labor and effort. Sure, from today's standpoint it is easy to say that some job of the past should not exist anymore. But she said, that these jobs should never have existed, which is not completely arrogant, but also plain wrong. Even if someone did mediocre art today that's only consumed by one or two other people, who is she to declare that this kind of creative job is useless? Also it's quite hard to know in advance what kind of art will be popular or useful in the future.",
            ">Is what she saying wrong? Why have people waste time on meaningless background noise art when they can be focusing on more meaningful projects? \n\nBecause that 'meaningless background noise art\" is how many actual artists make money while they develop their skills so they can get paid for doing more meaningful art. You're not just replacing some useless job, they're jobs that actually foster art and artists in our culture. Without those jobs you have artists who are earning less money to continue doing their art, which means ultimately less artists, once you scale all that up in a population.",
            "It seems like whether a job should exist or not would ultimately come down to a matter of pure opinion. I’m not even sure it would be easy to reach a consensus on that point, for any given job. It seems like she started injecting her personal views while acting on behalf of the organization, and I believe that’s why her statement was off-putting to some. Assuming oai is still attempting to create AGI “for the benefit of all humanity”, her words, without additional explanation, might muddy the mission and integrity of the company.",
            "And bad PR does the opposite of that",
            "dei is when someone that isn’t a straight white man is in a board room",
            "Honestly, not even kidding, chatgpt does do a better job already.",
            "\\*I'm willing to make",
            "That can be changed and will have to be eventually when theres a high level of automation.",
            "What thing will that be and who will pay you to do it?",
            "The original statement was \"Some creative jobs maybe will go away, but maybe they shouldn't have been there in the first place,\"\n\nThere is obviously no point in having humans do work that can be automated for almost no cost, but that's not what she is arguing.\n\nShe is arguing that some work should never have been done at all to begin with, before automation existed in any form. She is suggesting that the output of the work never had any value to begin with.\n\nIn other words, if something can be automated, maybe it did not have any value before it was automated, in other words, it should not have existed in the first place.\n\n1. Work that is automated no longer needs to be done by humans.\n2. Some work has no value, the work should not exist to begin with.\n\nShe is making 2. statement.",
            "It’s “bandaid logic” and revisionist reasoning tbh. It’s like someone murdering you and then trying to justify it by saying that if you were able to be murdered, you shouldn’t have ever existed anyways lol.",
            "> Yeap she’s as prepared to speak on public as a random person in the street.\n\ndid you mean for this sentence to be intelligible?",
            "Like anyone in top jobs: Connections.",
            "Born with rich and powerful parents",
            "Probably intelligence agents ",
            "diversity hired women",
            "It totally within their power. But they of course don’t give a shit because they have their own goals and ambitions. Which is fine (I guess), but don’t try to sell people this ridiculous, mental gymnastics-level gaslighting that their life’s-work shouldn’t have ever even existed simply because you found a way to make a computer do it.\n\nEspecially when the irony is that, if these job fields being replaced had never existed in first place, then OpenAI would have likely never had access to enough data to train the models on these tasks to begin with. It’s like stealing your music teacher’s entire style and claiming that said teacher should have never been teaching to begin with if they can be replaced… It doesn’t make sense. It’s just you desperately trying to come up with some half-baked “justification” for what you’re doing.",
            "\"They used to hide it. Now they’re being open about it. I wonder why they’ve changed.\"\n\n  \nAnd now, they are qualified to be called \"OpenAI\".",
            "OpenAI is pretty much telling us what they’re going to do",
            "Corporations already are legal entities so corporate AI's aren't that farfetched. But who wants to work for a robot who thinks it doesn't need to employ creative humans?",
            "Right... but Sam has professional accomplishments that moved him up the totem pole.  He was the CEO of Y Combinator.\n\nI don't see why Mira would be in this role otherwise.\n\n> I encourage you to research and learn, or else you’ll keep inventing fantasies to fuel your anger towards women.\n\nWomen are great. I don't have any anger to women. I have anger towards affirmative action because I think it's bigoted and *anti* women.",
            "Look at her Linked In profile vs other male executives at other AI companies.  \n\nShe's a normal person. Nothing is impressive about her...\n\nMy argument is also that this is why affirmative action is terrible. If it didn't exist we wouldn't be suspicious.",
            "so we shouldn't improve the world because the feelings of some random artsy folks gets hurt? ok",
            "I'm a CTO and used to work as a PR advisor. I have one of the top comments on this post, saying she's a walking PR disaster, and I don't think you need my level of experience to recognize that.",
            "I was being sarcastic lol but thanks",
            "According to r/artbusiness AI has hurt NSFW commissions.\n\nAs for some reason people prefer to make those images themselves via StableDiffusion pony rather than share their ‘ideas’ with an artist.",
            "Ironic. ",
            "except it's the creatives that I see loudly bitching. AI bros are mostly just folks trying to ensure progress isn't going to be unnecessarily slowed down to appease the overly conservative artists.",
            "Yeah I bet the trans Marxists coordinated it as well huh?",
            "I don’t think freeing CGI artists from the shackles of employment as a CGI artist is going to do anything for them except make them unemployed, and you can’t be a CGI director if you’re not employed in CGI anymore. \n\n\nYou also don’t know what these theoretical people’s aspirations are/were and I highly doubt that making them unemployed in their aspiring field is going to be good for them reaching their goals, if they hadn’t achieved them already.",
            "Speak for yourself.",
            "Would you rather she not say what she means? Seems like being mad that the AI wranglers aren't engaging in shitty corporate nonsense isn't congruent with this subreddit. \n\nIt's rather odd to see people here having an issue with it.",
            "I am thankful, that my house has an unfinished basement, with concrete bricks, to help me deal with this nonsense in this sub.",
            "Not everyone says the hard r like you dude ",
            "First she said that what they have in their lab is not much better than what the public has access to, practically destroying Sama’s hype tower he was carefully building for one and a half years, then she said that next generation of models will be on a phd level… and will come out in 18 months (!), and now this.",
            "Didn't properly answer the question to whether Sora was using YouTube videos for Training data which must leaves OpenAI open to lawsuits from Google.",
            "Just had to bring up politics huh? Gaffes are better than felonies by the way. And Trumps criminal ass makes gaffes all the time too. Dudes only 3 years younger than Biden. They're both too old to run this country. But ones convicted felon and ones not.",
            "Joe? Joe w- joe- Joe wh- uh, which Joe?",
            "I'm not discounting that as a possibility, but it suggest a rotten culture in the company.",
            "Because she keeps widening the Overton window, with no risk of reputation loss due to not having one to begin with.",
            "Clueless? Ok genius how many truly unique things have you created?",
            "Would you rather listen to her lying like every other corporate PR puppet? ",
            "Yeah, let’s get back to the PR friendly speak where people just say banal talking points and don’t say anything honest at all.\n\nLove those interviews.",
            "There are things people don’t say because lying is more profitable?  Or because…why, exactly?",
            "Perfect statement from the company who stole the creative content from those creative jobs in the first place.",
            "It may be a bad PR statement but it is the unfortunate truth. This is where AI is going. \n\nI stand on the side of AI progress, but I have to also acknowledge that AI devalues humans. The last bit I consciously have some problems with. It will take away creativity, it will take away some people's purpose, their jobs, etc etc.",
            "I mean, that's literally what they are selling though. A program that replaces human gruntwork and eventually humans. \n\nI doubt she cares if artists are on board with her. They never will be so why bother? Better to say shit like this and get your investors dicks hard than pander to a bunch of people that don't matter to her and are powerless.",
            "She’s saying they’re automating away menial jobs that have little meaning. Sounds good. I bet most people would also be happy if we automated away sewer cleaning jobs  That’s not what she said lol. \n\nShe said those jobs are better off being automated since no one wants to do them like sewer cleaning jobs are. And we would all agree. ",
            "> I believe that making art should've never been a job and artist as a job title was a direct consequence of capitalism and consumerism\n\nThis is all well and good if you have a culture that values its artists and makes sure they are fed and remunerated for their artistic contributions. But nowhere do you mention how we're going to make *that* cultural shift. So we're literally going from, \"Artists shouldn't be paid much and should be taken for granted and exploited for their contribution\" to \"Artists shouldn't be paid anything and should be taken for granted for their contributions.\"\n\nDo you not understand how maybe that's a culture that ends up with a lot less artists, and a lot less art, certainly a lot less *good* art? Do you not make that connection?",
            "Artistry has been a profession for about as long as professions were a thing. Almost all the works in our cultural heritage comes from people who made it as their job. Their private collections, what they did for practice or private interest is for the most part lost to time.\n\nA general case can be made that removing the economic incentive from all human activities is a net benefit, no jobs at all.\n\nIt's hard to imagine now, but the common belief used to be that manual labor would be automated away first, then certain types of numerical work like accounting, but this would be a good thing because people could make a living doing creative work instead.",
            "“I believe that making art should’ve never been a job and artist as a job title was a direct consequence of capitalism and consumerism” \n\n\nRenumeration for labor is not going anywhere, art takes labor, and if you wish to consume it, the labourer who made that art deserves remuneration. Even in a UBI system, people would still get paid for stuff they do (except for creatives, apparently).\n\n\nIt’s important to note here that “art” is everywhere, you are completely surrounded by it, it doesn’t just exist in a gallery in the MOMA. Every single thing you are currently looking in your world right now, outside of nature, at was designed by someone who was making creative (artistic!) decisions. Should they not get paid for any of that labor, because it rubs up against this abstract and idealised perception you have of the *true* nature of art? Should the people building trains get paid, but not the people who design them? \n\n\nI saw you have a friend who made a really cool looking indie game, I highly doubt you feel that they shouldn’t be charging for access to their game.",
            "They matter until they can be automated away. Obviously ",
            "At least it’s honest ",
            "When she says useless, she means jobs that can be done better or more effectively by AI. For example, I could hire you to spend all day picking apples. Or I can get a robot to do it. If the robot is available, then it should do it so you have more time to do more meaningful tasks. In that sense, the apple picking job should not have existed because it wastes your time when you could be doing something better. The robot makes that possible while still getting the labor done. Murati is saying this should be applied to all jobs so people can do meaningful tasks while AI does the grunt work. ",
            "But I thought art is about free expression and creativity, not money. Anti AI artists keep saying commoditizing art as a product is bad so why should we treat art like a money printer? ",
            "Comeon man, don't overthink it\n\nA job should exist....if somebody's paying for it, & somebody's willing to accept that pay\n\nThat's it. That's the only criteria. Everything else is just philosophizing",
            "Whether a job should exist depends on whether it's valuable and whether there's any other way to do it. It's a foolish statement on her part. CGi artists will be replaced by sora in the next couple of years. Of course those jobs should exist as there was no other way to perform that task before. Same with writers and translators, before LLMs we needed a skilled human to perform those tasks competently. ",
            "It’s not an opinion. A job exists if there’s work that needs to be done. If a robot or an AI can do it, then the job is no longer necessary. Simple as that. ",
            "I used to think about it like you. One day you'll realize you were wrong.",
            "Maybe her job shouldn't exist",
            "What makes you believe it will ever change, or at least change without being catalyzed by tremendous human suffering?",
            "Really, all the lead players are US based, and Korporate Amurica don't like no Universal Health care, or any form of free lunch to the average citizen. No, Elysium is the near future.",
            "Watching autonomously generated marvel movies of course! I've always wanted to see Mario meets Spiderman 49, Disney+AI's generative network says it's much better than 48! And of course I'll just get all this stuff for free because uh uh um we'll magically transition into a completely post-scarcity society somehow!\n\n/s, of course. But way, way, WAY too many people genuinely think this way and believe in the singularity the same way that baptists believe in the rapture.",
            "I have money now. My family has money. What kind of money? Some acres money, car money, house money, a business money. You get the point, we're not ultra-rich we just have money.\n\nWhen we can get our hands on an Android we will simply live off it. We'll get it pré-plant, plant, fertilize, harvest, analyse, plan the next year, calculate weather, machining, managing farms, driving the fucking tractor, hell, 3D print me a new phone.\n\nIt Will be able to produce an imense surplus.\n\nA SINGLE ANDROID",
            "Replace the word 'job' with 'task society requires someone to do in order to live indoors and eat food'.\n\nIf there is ever another way to do it, no job should exist.",
            "What an insane false equivalency. It's ridiculous so let's not address that.\n\nYour logic would argue that we shouldn't have automated industry because those jobs had further merit than their output.\n\nYou're arguing that the proposition that saying redundant jobs shouldn't exist is bandaid logic. How?",
            "lol. comparing \"doing a job more effectively\" to murder is wild. if a robot surgeon causes fewer deaths, is the employment of said robot and saving lives still akin to murder..?",
            "Automating a job = murder. Very nice, thank for your input ",
            "no one is being murdered. you've somehow convinced yourself that it is openai's responsibility to make sure the economy is propped up by jobs that AI can do. that responsibility falls to the organization who actually has the power to influence major sectors of the economy with monetary and fiscal polich. we usually call that organization \"the government\".",
            "Except it's not at all like that. It's more like \"what's the utility of all these influencers/artists/sales/marketing reps if we can replace them for pennies on the dollar and get higher quality product\"",
            "\n> did you mean for this sentence to be intelligible?\n\nDid you?",
            "is it everyone who has automated any kind of work to directly address the labor time lost through that automation? how do you think AI would even do that? they can't pass legislation or affect fiscal or monetary policy. what kind of fantasy world do you live in where this company can reshape the labor market on its own?",
            "The candle maker enjoyed making candles. Sadly, Thomas Edison is a scumbag who ruined the candle makers life work.",
            "I know someone, who would not mind that at all:\n\n![gif](giphy|CdY6WueirK8Te|downsized)",
            "I’ve wondered how Sam even got the ceo of y combinator job though. He had a failed startup and should have been a nobody. \n\nSometimes these people are really fucking smart and people recognize that and want them in decision making positions. \n\nWhether Sam A and Mira are those people, I don’t know…",
            "Again, affirmative action is not a thing in tech C-suites. You’re yelling at clouds.",
            "Give credit and pay artists that created the works that you illegally use for your own profit.\n\nSaying “Your career and livelihood doesn’t matter anyway btw” is as entitled and disrespectful as it gets",
            "Gunna go ahead and put my bets on the company that's on top of the world making better calls than some random on Reddit lmao. All publicity is good publicity, and look who everyone talks about every couple days.",
            "I mean it's purely anecdotal, but I have a few friends in \"that space,\" so to speak, and according to them business is booming. GenAI is fine for relatively boring static poses and simple scenes but it falls apart almost immediately once you ask it for something genuinely specific or if you want the network to generate a particular OC. Yes embeddings and LoRAs exist, but neither of those options work well if you don't have at least a few decent images to form a training set. \n\nGenAI has thoroughly destroyed the pinup business, but that's like 5% of what NSFW artists do.",
            "Sup Kevin?",
            "I'm not mad about it, it's just odd. It *is* shitty corporate nonsense because what she says is mostly recycled fluff. She just isn't very good doing that and makes gaffes.",
            "Its contributing to anti-AI sentiment, which aint good.",
            "You forgot the face she made when asked if GPT4 was trained using Youtube data.\n\n\nWhich is not a crime at all but it was awkward for her",
            "Thanks for the precision!\n\nWell, to play devil's advocate...\n\nAt least we know she doesn't sugar coats things and that what you get with her is not embellished.\n\nAlso we can finally put to rest the conspiracy theory floated around here of \"AGI achieved internally\" or \"AI Manhattan project ongoing, ML scientists using the superpowers of AGI to create their new models\".\n\nParadoxically, her latest claim, the one present in the current post, seems the most Altman like, in the \"we'll overturn the current society\" discourse.",
            "Sounds like her role is to ensure no one goes looking for Q*.",
            "You guys have no real complaints. This is dogpilling on narrative. Have some sense",
            "Also, the average layperson is either indifferent to or hates AI already. Current AI companies are treading a fine line trying to maintain at least a somewhat decent public image. This sort of statement just adds more fuel to the fire for people who believe that AI companies are out to ruin their livelihoods. There's already talk of regulation in Congress. It'd be a political slam dunk for any congressman to skewer AI dead in the water in order to please their constituents.",
            "Wtf kind of a response is this hahaha. How many truly unique things has she created? Her entire career has been being a pretty mouthpiece to parade around for tech companies, she hasn't made a single thing.\n\nWant proof that it works? Look whos writing the pcmag article. It's a woman. Women in tech love marketing women in tech. This is all marketing and networking, and, in a company where perceptions are that it is an existential risk to humanity, it is also about softening perceptions. GIRLLLPOWERRRR.",
            "No. Is this is what's best for the company and therefore what she should be doing? Also no. \n\nIt's not a charity, me personally I would want them to give me their latest lab models for free and give sky back, but what I want and what's best for them are very different things.",
            "It sounds to me like she tried to put a positive PR spin on job loss which fell flat on it's face, it's not that she is courageously saying what she actually personally believe the company policy being damned. She is simply fumbling the PR ball.  \n  \nHer next statement in the interview is: \"But I really believe that using it \\[AI\\] as a tool for education creativity will expand our intelligence and creativity and imagination.\"\n\nThat sounds like PR slop to me.\n\nWhen she was asked about OpenAI training on youtube videos, she makes a face for some seconds and says \"I'm actually not sure about that\" then when asked about facebook and instagram she says \"You know, if they were publicly available, there might be data, but I'm not sure\". This is the CTO of the company, of course she knows that they do, she is actually lying about not knowing. She then sticks to the PR-script and says she will not comment on their data collection methods beyond the fact that they use licensed and publicly available data.",
            "Me? No. Her interviews are hilarious. But I wouldn't really appreciate it if I were a shareholder.\n\nIt's not really about lying. It's about what kind of things you say out loud in public. If she had said \"Dario Amodei is an overweight nerd and I don't like him\", it's the kind of thing that will make her and the company look bad in the public opinion. So it's better not to say it.",
            "You don't have to lie. You can just avoid saying certain things. You don't have to blurt out everything you think of when you're being interviewed in public.",
            "Yeah - sucked up all their art like a digital hoover, packaged it in their product then promptly puts millions out of work without a penny paid.",
            "Web scraping is not theft. No law says so ",
            "No they didn't steal it.  No more than any artist who has used inspiration and training from others' work to develop their craft.",
            "> who stole the creative content from those creative jobs in the first place\n\n... what now?",
            "It’s true that jobs will be lost; it’s not true that those jobs should never have existed. ",
            "Why are you on the side of AI progress then?\n\nNot a gotcha. Genuinely curious.",
            "No, that's not what she said in that interview. She is specifically talking about the quality of the output, the quality of the content created. She is also talking about actual jobs being lost, not tedious part of the job being automated away.\n\n[https://x.com/RawbertBeef/status/1804208084317086034](https://x.com/RawbertBeef/status/1804208084317086034)\n\nThe sewer cleaning analogy would be that 50% of sewer cleaners lost their job, but the people who lost their job maybe never actually cleaned the sewer to begin with, maybe they just moved the dirt around, maybe their job should not have existed to begin with.\n\nShe is not saying that the A.I creates the same quality output for cheaper, she is saying that the previous output should never have been made in the first place, because the quality is to low to have value.",
            "I bet the sewer cleaners wouldn’t be happy about losing their jobs… are they just supposed to not work?",
            "Milkmen lost their jobs due to supermarkets but no one owes them any money. So why does anyone owe artists money?  \n\n\nArtists make art for personal expression and creativity. Only hacks do it for cash. I’m fine with fewer hacks in the world pumping out garbage for money ",
            "Exactly, that means her statement \"jobs that shouldn't be there\" is reaching.",
            "You seem to be heavily overestimating how much money artists make.",
            "Art is about expression and creativity but society requires artists - like everyone else - to eat, shelter, and clothe themselves. If you do that without money then, fine, you're going to have a culture that values its artists. If you require people to make money, and then turn around and say you're going to give even less of it to artists than you already do as a culture, in a culture that already exploits and underpays artists, then you're further devaluing expression and creativity, not fostering it.",
            "I agree with this. I think what she conveyed was a little different if you read the quote. In either case it wasn’t necessary to convey her point imo.",
            "8 year old prostitute was a job that existed for quite some time. I guess it should have existed. It stopped shoulding to exist eventually. But it shoulded for basically all of human history. Tells us more Adam Smith.",
            "Her quote: “maybe they shouldn't have been there in the first place”.  Even she implies this is not a matter of fact, black and white, qualifying her statement with “maybe”. More importantly, whether those jobs to be terminated should have existed in the first place is beside the point. She could have conveyed the same idea — jobs lost to AI, just leave those last words out.",
            "They will never allow a status quo change. It’s a delusion thinking the common people will have a good outcome.",
            "Well if it doesn't, then there's no one spending money and everything that relies on constant spending collapses. Rich people hate when their businesses fail. Remember its not an on-off switch where one day everything is automated. This will happen gradually and people will suffer.",
            "Magically. 110 billion people walked on earth and you call it magic.",
            "Finally, a comment with sense I thought you were extinct.",
            "The job will still exist tho in reality. You’re just paying the AI companies to do it now. Meanwhile the people who’s work trained the AI in the first place actively *lose* their main path to living in doors and eating food… All while being condescendingly gaslit into believing their job never had value. And yet it somehow had enough value that companies go out of their way to train AI to do said job.",
            "I’m not saying that at all. [This](https://www.reddit.com/r/singularity/s/dmQGVqS6DC) and [this](https://www.reddit.com/r/singularity/s/5r3vyvRG5n) is what I’m *actually* saying.",
            "I never said that replacing people is equivalent to murder dude. The analogy wasn’t that “job loss=murder” the analogy was that **both are using self-serving, backwards logic to justify their transgressions** But I never said that the transgressions in question were equal here… Reading comprehension is key buddy.",
            "[Except that’s not what I was implying at all.](https://www.reddit.com/r/singularity/s/FOCxC2PSpi)",
            "[I’m not saying anyone’s being murdered dude. You’re missing the actual point of the analogy.](https://www.reddit.com/r/singularity/s/iy8lINwUjm)",
            "\"what's the utility of all these doctors/coders/police/scientists if we can replace them for pennies on the dollar and get higher quality product\"\n\nYou’d have to be delusional to think that all of those career fields (doctors, coders, police, scientists) won’t also see massive job automation as well. So it’s pretty clear that **the ability to have your job automated has zero bearing on how valuable or worthwhile that job is**\n\nLiterally almost every job on Earth will eventually be replaced by automation. Even scientists and engineers. Would it make sense to say that “science and engineering can be automated so they should have never existed”… Imagine someone saying that “robots can replace people on the assembly line therefore assembly line workers should have never existed🤤”",
            "Except that these models depend on the preexisting work to exist, and the output is more often than not inferior, especially when business objectives are involved.",
            "I’m not saying that. I’m saying spare people the fake, ad-hoc rationalizations that are only being presented to relieve your own guilty conscience. We get it, companies like OpenAI “won capitalism”. But they don’t need to come up with these ridiculous, half-baked excuses for why it’s okay for you to eat everyone else’s lunch. \n\nEspecially if the best excuse you can muster up is a flimsy “well maybe your industry should have never existed anyways”… Do you know how ridiculously condescending and callous that comes across to the average person being put out of work by these companies?",
            "Imagine claiming that candle-makers should have never existed after the light bulb is invented… Despite the fact that candle-makers were required in order to even give us the light needed in order to invent the lightbulb in the first place…",
            "A failed startup is usually a valuable experience. I guess they saw something in him, and they were right.",
            "It's literally the main thing feminists argue for...  They ONLY want equality for the high paying jobs. The low paying jobs they only want men to do.  \n\nSo no...",
            "You think she's making these fuck-ups intentionally? She's not.\n\n>All publicity is good publicity\n\nWrong.",
            "Show me one person who has never made a gaffe ",
            "if Sora\\* was trained on youtube data, not GPT-4",
            "Well she’s either trying to soften the fall or AGI is achieved internally and we are now in coercion phase.",
            "> AI Manhattan project ongoing\n\nWhile obviously a conspiracy, it would not surprise me at all if there is one ongoing. And I would be very surprised if there wasnt dozens of them ongoing very soon…",
            "You’re conflating being dumb to sugarcoating things.",
            "I agree, I can't see this statement as a good thing for OpenAi, it is a media failure.",
            "So I'm guessing you have a hard time with the ladies?",
            "I personally prefer what I want even if it hurts them ",
            "At least she’s honest \n\nThat’s just her belief \n\nAlmost like they don’t want to be sued or something ",
            "You forgot the important part: it’s funny so she should say it ",
            "Supermarkets replaced milkmen but they don’t owe them any money ",
            "web scraping, then repackaging that data, then selling it as a product, is dubious.",
            "Exactly. And there’s no difference from ai doing it versus humans who see, hear, get inspired by and often copy the work of other humans to create new and original works.  \n\nAll these “artists” and content creators demanding payment for their “content” are just freeloaders looking for a payday.",
            "Seems like a civil issue. If I go and blatantly steal 100 people’s intellectual property and then reuse it, I’m certainly liable to get sued.\n\nOpenAI is less likely to get sued, and if they do, they could more likely beat the case because they have money. If some average Joe did that, he’d be in deep shit. \n\nA case of the golden rule. The person with the gold gets to make the rule. ",
            "That is absolute bullshit but I doubt you actually care.",
            "In this regard, I don't discount the value of creativity to humans, but the commercialization of some of the creativity does not always equate to them being a necessary job.",
            "I really think our purpose or life goal should not be based on work or money. And agi have the possibility to make those not important anymore so we can truly do what we want to do. Actually achieve your childhood dream.",
            "It is an internal conflict, I don't want to see people devalued and I don't think it needs to be that way but I do think it will eventuate that way. Then on the other side of the coin, I believe AI could be the most important thing we ever create among other thoughts about AI. \n\nThis is one of those \"Now I am become death\" moments, the many sides play off against the other.",
            "If the jobs are also tedious, yes they should be automated away  \n\n\nHer point is that they should have spent their lives doing something more meaningful instead of cleaning sewers. That’s why the jobs shouldn’t exist. It wasted their time and we should let AI do it instead ",
            "Neither were coal miners or milkmen. Should we go back to the 50s?",
            ">Milkmen lost their jobs due to supermarkets but no one owes them any money. So why does anyone owe artists money?  \n\nWhen milkmen lost their jobs due to supermarkets, society didn't end up with less milk, or less quality milk. If artists lose their jobs to AI art, it's entirely plausible, and with AI where it is now even likely, that as a culture, over the long run, we end up with less art and less quality art. That's the risk, if we don't have human artists who are fed, clothed, and sheltered so that they can continue to produce and culturally evolve art, because AI as it is at the moment isn't capable of cultural evolution of art. It's constrained by its training data. We risk walking into cultural stagnation with a culture that doesn't feed and shelter its artists.",
            "Congratulations, you completely missed the point.\n\nAnd on top of that, you called anyone who wants to make a living doing what they love a \"hack\" pumping out \"garbage for money\" only doing it \"for cash\".",
            "Shouldn’t be there as in they should be automated away so people can do other jobs ",
            "It’s not about money. That’s my point. Stop commodifying art and treating like it’s designed to make you money. It’s ironic anti AI artists accuse corporations of doing that when this is how they treat art ",
            "Don't require people to make money. Capitalism is the problem, not the solution.",
            "You didn't have to go there\n\nI just think \"should exist\" is too subjective, & leads to people adding too much of their own spin on things",
            "As in they should have been doing something more meaningful. Obviously ",
            "She's talking about boring jobs. Like the artists chained to desks creating animations frame by frame.\n\nAutomating away the grunt work should be a good thing...for everyone. The fact that it isn't is not a problem with automation. It's a problem with capitalism.",
            "I think it will be catalyzed my tremendous human suffering and will have a good outcome.\n\nLook at history and where we are now. It sucks, but it is today still much much better than every point in history. In a short timeline, over 50% of Humans will be jobless and in the great depression, we had only 25%. And now, you will be jobless because of AI doing everything better than you and you have no outlook to ever be employable again. You can be pretty sure that UBI will come. But the transition will be brutal till we have a critical mass of suffering to change the system.",
            "That's not the magic part, the magic part is that human greed will immediately disappear as soon as AGI materializes. Nobody has ever been able to explain to me HOW we will transition to a post-scarcity economy, they only say that we WILL... somehow. That's magical thinking with no real foundation in reality or in history.",
            "So you think that jobs that could be automatically done, we should force humans to do or they shouldn't be allowed to eat?\n\nShould we destroy tractors and have people pull yokes?",
            "I don't buy this narrative - AI displacing people - because AI needs grounding, it has no feet, it exists like a brain-in-a-vat. But here's the thing: humans are just as dependent on the environment for our intelligence. When we \"discover\" things, we're really just converting experiences into reusable ideas and sharing them.\n\nNo human could individually rediscover all that humanity has figured out. Our culture, our knowledge - it's not just about brains. It's the result of this massive diversity of approaches and world-grounding that human society has accumulated over history.\nAI needs physical and social grounding, just like we do. Intelligence evolves socially - no human or AI is smart enough individually to do it all. We need that real-world feedback loop, that constant interaction with the environment and society.\n\nSo what's likely to happen? A diversification of activities using a combo of humans and AI. We'll keep everyone busy because we're always coming up with new goals, new desires. We never reached the end of human ambition just because we automated something.\n\nIf you think GPUs alone could evolve by just crunching numbers, remember our particle accelerators and space telescopes - they provide real-world feedback to scientific theories. We have no lack of ideas, but figuring out which ones will pan out? That's the tricky part.\n\nAI might help with coming up with ideas, but it'll be just as stumped as we are when it comes to testing them in the real world. Think about that. All we know comes from the environment and society, not just our brains. The brain just adds a drop of novel insight or stumbles on a new outcome and reports it back to the hive mind. That's how we move forward. There is no direct path to super-intelligence that avoids the world and social/cultural evolution. AGI will appear at civilization scale, not in singletons.",
            "You're completely missing everyone's points, no one is saying they should never have existed but that once redundant they maybe shouldn't exist as JOBS.\n\nI can't understand why you're so intent on strawmaning on this.",
            "[deleted]",
            "you're still comparing them by use of analogy. if the content of the analogy is irrelevant, you might as well have said \" It’s like someone employing you and then trying to justify it by saying that if you were able to be employed, you shouldn’t have ever been unemployed anyways\"",
            "It’s an obvious false equivalence. Murder causes harm. Automating menial jobs frees people to do more meaningful work. ",
            "Yes if a computer can do higher quality work than you then you should be replaced. The only thing that matters to advance technology is the outcome. If an AI can come up with a physics theory that is better than what Einstein did, we should let that AI do it.",
            "No she said \"should not exist\", not \"should not have existed\". PR disaster aside, she's not wrong. If these things can be automated and can be done better for less cost, then why should they not be automated? \n\nThe people who want to do these things can pursue them as hobbies instead of having to face stress, work politics, not being able to pursue things because they are not profitable for the business, etc",
            ">  \"what's the utility of all these doctors/coders/police/scientists if we can replace them for pennies on the dollar and get higher quality product\"\n\n\nNow you're getting it. ",
            "Inferior? The last art show I went to had a a canvas smothered with literal chicken shit. We have too many losers with liberal arts degrees.",
            "Candle makers were required to invent the light bulb. They didn’t invent that in the dark lol. \n\nI think the intention of the statement is “these jobs shouldn’t have existed if we had this technology” and I think most people would agree if humans had lightbulbs from the dawn of time then there was zero need for the candle maker.",
            "Bro, your statement is not the rebuttal you think it is.",
            "Don't put words in my mouth lol. \n\n\nThere's a big difference between \"walking PR nightmare\" and \"didn't articulate one point well\" Was this really that upsetting for people? She was absolutely fucking right. \n\n\nReal creatives should not aspire to make someone else's work. An art team for someone else's product is only necessary because the original creator, in theory, had all the ideas, but not the talent. In a perfect world from AI both sides don't need anyone else to make their OWN creative works.",
            ">coercion phase\n\ncould you elaborate?",
            "Ad hominem and strawman. Well done, you're a master debater. How are those 3 brain cells treating you?",
            "It looks more like incompetence than honesty, a good PR person, as in someone that is competent at it, will reveal no information, while being technically correct, and not give any negative feelings in the audience, like they are trying to hide something or them being callous. In this case, she is not actually saying any information, while saying stuff that is off-putting.\n\nHer statement in this case was MAYBE some jobs will be lost but MAYBE those jobs should not exist in the first place, because the quality of the output was so bad.\n\nShe is unwilling to admit that jobs will be lost, and that it includes high quality work that people find meaningful.",
            "You actually don’t milk those guys.",
            "I guess the argument is that the supermarkets didn’t vacuum up the milkman and copy him so it’s different…somehow?  \n\nIt’s not really. Every great technological leap involves copying or innovating off of previous work.",
            "Did the supermarkets mug the milkmen, steal their milk and then sold that stolen milk? If not your analogy is lacking.",
            "Wow. Great comparison right there.   \nI did not know the supermarket stolen their milk without the milkmen's consent and sell it in their store.   \nYou do know how they gather and use those images right?",
            "It doesn’t repackage it because it can’t be recreated reliably.\n\nA study found that it could extract training data from AI models using a CLIP-based attack: https://arxiv.org/abs/2301.13188 \n\nThe study identified 350,000 images in the training data to target for retrieval with 500 attempts each (totaling 175 million attempts), and of that managed to retrieve 107 images. A replication rate of nearly 0% in a set biased in favor of overfitting using the exact same labels as the training data and specifically targeting images they knew were duplicated many times in the dataset using a smaller model of Stable Diffusion (890 million parameters vs. the larger 2 billion parameter Stable Diffusion 3 releasing on June 12). This attack also relied on having access to the original training image labels:\n\n“Instead, we first embed each image to a 512 dimensional vector using CLIP [54], and then perform the all-pairs comparison between images in this lower-dimensional space (increasing efficiency by over 1500×). We count two examples as near-duplicates if their CLIP embeddings have a high cosine similarity. For each of these near-duplicated images, we use the corresponding captions as the input to our extraction attack.”\n\nThere is not as of yet evidence that this attack is replicable without knowing the image you are targeting beforehand. So the attack does not work as a valid method of privacy invasion so much as a method of determining if training occurred on the work in question - and only for images with a high rate of duplication, and still found almost NONE.\n\n“On Imagen, we attempted extraction of the 500 images with the highest out-ofdistribution score. Imagen memorized and regurgitated 3 of these images (which were unique in the training dataset). In contrast, we failed to identify any memorization when applying the same methodology to Stable Diffusion—even after attempting to extract the 10,000 most-outlier samples”\n\n\nI do not consider this rate or method of extraction to be an indication of duplication that would border on the realm of infringement, and this seems to be well within a reasonable level of control over infringement.\n\nDiffusion models can create human faces even when 90% of the pixels are removed in the training data https://arxiv.org/pdf/2305.19256\n \n“if we corrupt the images by deleting 80% of the pixels prior to training and finetune, the memorization decreases sharply and there are distinct differences between the generated images and their nearest neighbors from the dataset. This is in spite of finetuning until convergence.”\n\n“As shown, the generations become slightly worse as we increase the level of corruption, but we can reasonably well learn the distribution even with 93% pixels missing (on average) from each training image.”",
            "Assume for a moment, you have been (and are) a famous artist, with a specific style of your own. Then, fast forward to today, an army of ChatGPT subscribers flood the web with AI images \"in the style of johny\\_effing\\_utah\". How does that sound?",
            "Yep. It’s ironic too since they draw fan art and complain if they get copyright striked for it. By their logic, that’s definitely theft. Some even sell it on Patreon and profit from it. And the best part is when they accuse AI users of being the ones commodifying art when AI art can’t even be copyrighted and they’re the ones making money off of drawing copyrighted characters lmao",
            "See if you can reconstruct someone's artwork from the weight files.  I'll be waiting.",
            "She is not talking about the meaning gained from the work. Or the work being tedious. She is specifically, directly, referencing the quality of the output. She says it has no value, even if the person doing the job loved it, or found it meaningful. \n\nShe is not talking about automating away tedious aspects of the work, or replacing high quality outputs that had value when it was made by humans with high quality output made by A.I. She is directly saying that the quality of the work, the actual output, has no value in itself.\n\nHere is the full context to what she actually says:\n\n\"Some creative jobs maybe will go away, but maybe the shouldn't have been there in the first place, if the content that comes out of it is not very high quality.\"",
            "Good thing AI is quite high quality then:\n\nAI video wins Pink Floyd music video competition: https://ew.com/ai-wins-pink-floyd-s-dark-side-of-the-moon-video-competition-8628712\n\nAI image won Colorado state fair https://www.cnn.com/2022/09/03/tech/ai-art-fair-winner-controversy/index.html\n\n>Cal Duran, an artist and art teacher who was one of the judges for competition, said that while Allen’s piece included a mention of Midjourney, he didn’t realize that it was generated by AI when judging it. Still, he sticks by his decision to award it first place in its category, he said, calling it a “beautiful piece”.\n\n>“I think there’s a lot involved in this piece and I think the AI technology may give more opportunities to people who may not find themselves artists in the conventional way,” he said.\n\nAI image won in the Sony World Photography Awards: https://www.scientificamerican.com/article/how-my-ai-image-won-a-major-photography-competition/ \n\nAI image wins another photography competition: https://petapixel.com/2023/02/10/ai-image-fools-judges-and-wins-photography-contest/ \n\nAI generated song won $10k for the competition from Metro Boomin and got a free remix from him: https://en.m.wikipedia.org/wiki/BBL_Drizzy \n3.83/5 on Rate Your Music \n\nJapanese writer wins prestigious Akutagawa Prize with a book partially written by ChatGPT: https://www.vice.com/en/article/k7z58y/rie-kudan-akutagawa-prize-used-chatgpt\n\nFake beauty queens charm judges at the Miss AI pageant: https://www.npr.org/2024/06/09/nx-s1-4993998/the-miss-ai-beauty-pageant-ushers-in-a-new-type-of-influencer \n\nPeople PREFER AI art and that was in 2017, long before it got as good as it is today: https://arxiv.org/abs/1706.07068 \n\n>The results show that human subjects could not distinguish art generated by the proposed system from art generated by contemporary artists and shown in top art fairs. Human subjects even rated the generated images higher on various scales.\n\n>People took bot-made art for the real deal 75 percent of the time, and 85 percent of the time for the Abstract Expressionist pieces. The collection of works included Andy Warhol, Leonardo Drew, David Smith and more.\n\nPeople couldn’t distinguish human art from AI art in 2021 (a year before DALLE Mini/CrAIyon even got popular): https://news.artnet.com/art-world/machine-art-versus-human-art-study-1946514 \n\n>Some 211 subjects recruited on Amazon answered the survey. A majority of respondents were only able to identify one of the five AI landscape works as such. Around 75 to 85 percent of respondents guessed wrong on the other four. When they did correctly attribute an artwork to AI, it was the abstract one. \nKaty Perry’s own mother got tricked by an AI image of Perry: https://abcnews.go.com/GMA/Culture/katy-perry-shares-mom-fooled-ai-photos-2024/story?id=109997891\n\nTodd McFarlane's Spawn Cover Contest Was Won By AI User Robot9000: https://bleedingcool.com/comics/todd-mcfarlanes-spawn-cover-contest-was-won-by-ai-user-robo9000/\nI don’t get free shit, so why should they? Maybe if I get it too but until then, it doesn’t seem fair. ",
            "Artists make art for passion, not for greed ",
            "You can say that to anything.",
            "I'm not anti AI art, I wouldn't call a prompter an artist, but I'm not against it or it's use. You're now trying to bring up completely irrelevant arguments that have nothing to do with your point, or my point.\n\nWhat exactly is wrong with trying to make a living doing what you love? Do you not have to work for a living too? I don't understand where this mindset comes from.",
            "Great, so go work to overturn capitalism. But as long as it's the system we have, then we probably need discussions that appreciate the effect on art and artists currently, under the system we have?",
            "Exactly ",
            "It seems you are ok with the transitional suffering. I'm not.\n\nWould you mind giving me your money while we transition so I don't have to suffer?",
            "When in history we had androids? Its just a matter of time, it Will happen.\n\nAndroids can create small sustainable economies without the need of external help. Thats where \"greed\" disapears.",
            "Why do you assume that because of AI/job automation, those people who’s job that get automated, will suddenly be “allowed to eat for free”? \n\nThat’s far from guaranteed. And I suspect that once people like you realize that UBI is merely an assumption (and not an inevitability), your position here might change a bit.",
            "AI only needs to be paired with robots to solve all of those “grounding issues”.",
            "The OpenAI CTO exact quote is:\n\n\"Some creative jobs maybe will go away, but maybe they shouldn't have been there in the first place,\"\n\nThat's not a strawman, that's what she actually said.",
            "But damn-near every job can be automated in long run (especially as AI becomes more and more advanced.) Even things like coding and engineering. It’s ridiculous to say that coding and engineering should have never existed *as jobs* all because AI is at the point of replacing them. **Because AI would have never reached that point had coding and engineering not existed as jobs**…\n\nJust like how OpenAI wouldn’t have nearly enough art data to train their AI models on if the jobs that produced said art data never existed… What is there not to get about this?",
            "You didn’t bother waiting a few seconds for me to add the hyperlinks did you…",
            "No I’m not comparing the two with each other. Because I’ve given several examples of how this logic doesn’t hold up even when excluding the word “murder” as a whole. \n\nI will link those other analogies in a few seconds. Just hang tight for a minute :\n\n[I used the assembly line as an example here.](https://www.reddit.com/r/singularity/s/tiVwblUaYN)\n\n[I used electricity and cars here for example.](https://www.reddit.com/r/singularity/s/mnDCJrYkZ9)",
            "I never made an “equivalence” between murder and job loss to begin with… That’s not the goal of the analogy at all. I gave some examples of the same analogy applied to other subjects [here.](https://www.reddit.com/r/singularity/s/H7EG1omGTE)",
            "But saying Einstein should have never existed just because an AI can do his job is silly. Because we would have likely never reached the point of AI if Einstein never existed. \n\nTherefore the idea of “this thing can suddenly *now* be replaced, thus, it somehow should have **never** existed” just doesn’t make sense.",
            "But it’s a disingenuous stance to take regardless, because the jobs being replaced will *still exist as jobs*, you are just **now paying OpenAI to do that job for you**. So this idea that these things shouldn’t be jobs if AI can *do that exact job* for you is ridiculous. \n\nThe job is still being done, OpenAI has just taken someone else’s lunch money basically. And is now trying to gaslight them into believing “if you’re lunch money is capable of being stolen, you shouldn’t be receiving lunch money to begin with”. It’s a laughably convenient and self-serving position to take no matter how you try and rationalize it.",
            "\"Some creative jobs maybe will go away, but maybe they shouldn't have been there in the first place,\"\n\nYou can hear her say it on video here: [https://x.com/RawbertBeef/status/1804208084317086034](https://x.com/RawbertBeef/status/1804208084317086034)",
            "No, *you* aren’t getting it yet my friend… **How do we even get to the point as a society where these jobs can be automated if they had never existed in the first place? How would companies like OpenAI have even gotten the art data needed to train these AI models on creating art if the jobs that produced said art never existed”?**\n\nIt’s backwards logic akin to saying that “now that we have these cars, horse carriages should have never existed…” or saying “now that we have these fusion reactors, using electricity to power stuff should have never been a thing…” it’s just not great logic bruh. Stop lying to yourself.",
            "Ok. It's obvious that you're clueless about what professional creative production entails. Being that that's the point of the original post (creative jobs, or any professional work for that matter), there's nothing further to discuss here.",
            ">>Candle makers were required to invent the light bulb. They didn’t invent that in the dark lol.\n\nThat’s exactly what I said… Now think about how silly it is to suggest that candle makers should have never existed simply because we now have lightbulbs. \n\n>>I think the intention of the statement is “these jobs shouldn’t have existed if we had this technology” and I think most people would agree if humans had lightbulbs from the dawn of time then there was zero need for the candle maker.\n\nBut we *didn’t* have light bulbs from the dawn of time, nor AI, rendering both statements not only ludicrous but also unnecessary…",
            "Back up your statements with evidence and or delete your account.  Learn how to contribute constructively to conversations rather than just trying to be edgy.",
            "Bruh, no strawman here. I just think you must be a weak minded person to bash people you don't even know and then to hate on women. Bruh, news flash women are just as smart as men.",
            "She’s saying the jobs that will be lost were not worth keeping around and it’s better to automate them. That’s why they shouldn’t exist in the first place ",
            "Now ya tell me",
            "It’s not copying them though:   \n\nA study found that it could extract training data from AI models using a CLIP-based attack: https://arxiv.org/abs/2301.13188\n\nThe study identified 350,000 images in the training data to target for retrieval with 500 attempts each (totaling 175 million attempts), and of that managed to retrieve 107 images. A replication rate of nearly 0% in a set biased in favor of overfitting using the exact same labels as the training data and specifically targeting images they knew were duplicated many times in the dataset using a smaller model of Stable Diffusion (890 million parameters vs. the larger 2 billion parameter Stable Diffusion 3 releasing on June 12). This attack also relied on having access to the original training image labels:\n\n“Instead, we first embed each image to a 512 dimensional vector using CLIP [54], and then perform the all-pairs comparison between images in this lower-dimensional space (increasing efficiency by over 1500×). We count two examples as near-duplicates if their CLIP embeddings have a high cosine similarity. For each of these near-duplicated images, we use the corresponding captions as the input to our extraction attack.”\n\nThere is not as of yet evidence that this attack is replicable without knowing the image you are targeting beforehand. So the attack does not work as a valid method of privacy invasion so much as a method of determining if training occurred on the work in question - and only for images with a high rate of duplication, and still found almost NONE.\n\n“On Imagen, we attempted extraction of the 500 images with the highest out-ofdistribution score. Imagen memorized and regurgitated 3 of these images (which were unique in the training dataset). In contrast, we failed to identify any memorization when applying the same methodology to Stable Diffusion—even after attempting to extract the 10,000 most-outlier samples”\n\n\nI do not consider this rate or method of extraction to be an indication of duplication that would border on the realm of infringement, and this seems to be well within a reasonable level of control over infringement.\n\nDiffusion models can create human faces even when 90% of the pixels are removed in the training data https://arxiv.org/pdf/2305.19256\n \n“if we corrupt the images by deleting 80% of the pixels prior to training and finetune, the memorization decreases sharply and there are distinct differences between the generated images and their nearest neighbors from the dataset. This is in spite of finetuning until convergence.”\n\n“As shown, the generations become slightly worse as we increase the level of corruption, but we can reasonably well learn the distribution even with 93% pixels missing (on average) from each training image.”\n\n\n\nAnd yea, it’s very hypocritical when a lot of those artists draw unauthorized fan art and complain when Nintendo takes action against their use of copyrighted IP lol. Some even sell it on Patreon and profit from the theft ",
            "Are you trying to tell us that artists were mugged by openAI?",
            "I don’t remember AI mugging anyone. If you mean web scraping, that’s not illegal and no different from human artists looking at other people’s art online on a wider scale ",
            "AI training is not theft according to any law. Morally, it’s equivalent to millions of artists seeing your work and getting inspired to make competing works like how the Sopranos inspired Breaking Bad. No one sees that as a bad thing though \n\nAlso, is unauthorized fan art theft? ",
            "perhaps you don’t understand what i mean by repackage.",
            "When AI art looks better, they won't care.  \n  \nThe problem today is its not good enough. Once it is, their complaints will disappear.  \n  \nTo the masses, it essentially boils down to 'does this do anything for me?' If the answer is no, then they don't like it.",
            "They trained it on turning content into noise and then denoise it.",
            "She’s not wrong. People are hired to do labor, not to have fun \n\n> if the content that comes out of it is not very high quality\n\nNot sure how you disagree with this. If people are making crappy content, yes they should get sacked ",
            "It's high quality because it's literally a statistical mashup of all the high quality human art we feed it. But it's constrained by that quality. It won't get truly different or 'better', until we feed it with more examples of human artists who do. That's the point.\n\nAI art doesn't evolve culturally. Not yet. Because it doesn't evolve or produce art inspired from outside the parameters of its training data, which is art that already exists. That's the issue. Maybe humans don't produce art outside of the parameters of *their* training data either, but the training data human beings are trained on is vastly more varied and complex, involving all of life experience that an embodied conscious agent can draw on to create. This is why human art evolves, and artistic  movements inter-relate to historical moments and change, because all that inspiration continually changes. The limit of possible human experience that a human artist can draw on to create its art is almost endless, unlike the finite limit of current AI experience it draws on in creating its art.\n\nMaybe we'll have AI that can produce art like humans one day, but we don't have it now, and until we do we should be careful about cultural shifts that rely too much on the AI art we do have, confusing its novel recombination of existing culture as genuine novelty, while killing off the human artists who produce the actual 'stuff' that gives culture its variety.",
            ">Good thing AI is quite high quality then:\n\n>AI video wins Pink Floyd music video competition: [https://ew.com/ai-wins-pink-floyd-s-dark-side-of-the-moon-video-competition-8628712](https://ew.com/ai-wins-pink-floyd-s-dark-side-of-the-moon-video-competition-8628712)\n\nOnly one AI generated video won, for a single song in the competition, which didn't have much in the way of entries, most were simple colors/visualisers. Other videos in the comp also won, all human made. The AI video(guitar in space with AI artifacts) it was so far below the quality of the human winners btw, there's no arguing that, go look up the other winners and runner ups.  \n\n>AI image won Colorado state fair [https://www.cnn.com/2022/09/03/tech/ai-art-fair-winner-controversy/index.html](https://www.cnn.com/2022/09/03/tech/ai-art-fair-winner-controversy/index.html)\n\n The midjourney pic was typical of the time, nothing outstanding, the abstract nature fooled judges here(a trend in this post).\n\n>AI image won in the Sony World Photography Awards: [https://www.scientificamerican.com/article/how-my-ai-image-won-a-major-photography-competition/](https://www.scientificamerican.com/article/how-my-ai-image-won-a-major-photography-competition/) \n\n>AI image wins another photography competition: [https://petapixel.com/2023/02/10/ai-image-fools-judges-and-wins-photography-contest/](https://petapixel.com/2023/02/10/ai-image-fools-judges-and-wins-photography-contest/) \n\nPhotography is not my field, I don't know how these are judged. both winners are extraordinarily generic, stock image like.   \n\n>AI generated song won $10k for the competition from Metro Boomin and got a free remix from him: [https://en.m.wikipedia.org/wiki/BBL\\_Drizzy](https://en.m.wikipedia.org/wiki/BBL_Drizzy)  3.83/5 on Rate Your Music \n\nWould you rather listen to Metro Boomin productions or the AI?\n\n>Japanese writer wins prestigious Akutagawa Prize with a book partially written by ChatGPT: [https://www.vice.com/en/article/k7z58y/rie-kudan-akutagawa-prize-used-chatgpt](https://www.vice.com/en/article/k7z58y/rie-kudan-akutagawa-prize-used-chatgpt)\n\nAI assist another topic.  \n\n>Fake beauty queens charm judges at the Miss AI pageant: [https://www.npr.org/2024/06/09/nx-s1-4993998/the-miss-ai-beauty-pageant-ushers-in-a-new-type-of-influencer](https://www.npr.org/2024/06/09/nx-s1-4993998/the-miss-ai-beauty-pageant-ushers-in-a-new-type-of-influencer) \n\nMiss AI won the Miss AI pageant?!? \n\n>People PREFER AI art and that was in 2017, long before it got as good as it is today: [https://arxiv.org/abs/1706.07068](https://arxiv.org/abs/1706.07068) \n\nDid you read the paper? do you prefer any of those images in the paper to art by your favorite artist?(have you ever had one?)\t\t\n\n>People couldn’t distinguish human art from AI art in 2021 (a year before DALLE Mini/CrAIyon even got popular): [https://news.artnet.com/art-world/machine-art-versus-human-art-study-1946514](https://news.artnet.com/art-world/machine-art-versus-human-art-study-1946514) \n\nYet again, the art they were comparing were abstract/abstract impressionist. Untrained people often can't even tell the difference between a painting a monkey made, or hell, a photograph of a stain, with a human in that realm.\n\n>Todd McFarlane's Spawn Cover Contest Was Won By AI User Robot9000: [https://bleedingcool.com/comics/todd-mcfarlanes-spawn-cover-contest-was-won-by-ai-user-robo9000/](https://bleedingcool.com/comics/todd-mcfarlanes-spawn-cover-contest-was-won-by-ai-user-robo9000/) I don’t get free shit, so why should they? Maybe if I get it too but until then, it doesn’t seem fair. \n\nOf the 20 winners, one was AI, and again, more abstract. The majority prefer human art, it's a fact. \n\n>I don’t get free shit, so why should they?\n\nYou should too, it wouldn't be fair if artist were exempt just because they help evolve art/culture. It also would be terrible if committees decided which artists pushed art forward in the \"right way\" or something and only funded such artists lives. This does happen, and it is a bit problematic when some artists are funded on certain merits, meanwhile another even more prolific and interesting artist is rejected.",
            "Those 2 things aren't mutually exclusive. You do realize that people have to work for a living, no? So what the problem with doing something you're passionate about?",
            "Yes. And she’s applying it here to creative jobs ",
            "They’re as much of an artist as a photographer. It can be as simple as pressing a button or as complicated as using controlnet, IPAdapter, Lora’s, etc. Everything I said is relevant. \n\n Nothing like I said before. When did I say I was against people making money doing it? I said I was against them doing it BECAUSE of money. If I get paid to paint something, that’s fine. If I’m only painting it for the money, that’s not fine. Murati is arguing that we should get rid of the second type of person, which I fully agree with. Fuck those greedy hacks ",
            "The prompt itself can be art, just like a short poem can be art.\n\nAlso, prompting is like 5% of a high-quality effort. The time saved from not having to spend hours/days drawing something doesn't disappear. That time can be applied to other aspects of a project, or if the image is the project, those hours could be applied to improving it using a combination of AI models and/or more traditional tools.\n\nThere's a difference between some dude posting pictures he snapped with his cell phone to instragram and a professional photographer. There's a difference between some dude playing around with prompts and an artist who uses AI as a tool in their process.\n\n> What exactly is wrong with trying to make a living doing what you love?\n\nI love petting my cat. That doesn't mean anyone should be paying me to pet cats.\n\nInstead of fighting the future, leverage the tools. Figure out how they can be useful to your process, both from an artistic perspective and a commercial one. The best artists will still create the best work, not matter the tool. Again, someone snapping a selfie with their cell phone is going to have a wildly different quality from a professional portrait photographer's work.",
            "Sorry to play Kassandra. I told you that there will be suffering. Not that i am ok with it. You are welcome to show us a way that this will not happen. But i guarantee you, it will.\n\nWe have every day massive suffering on our planet and nobody cares. 25 years ago, i stumbled over the fact that our money system has a bug. It is broken by design. I tried to tell it to everyone in my surroundings and many on the internet. Nobody cares. Before AI in the picture, the questions was, if the money system will collapse before the environment or the environment before the money system.\n\nEvery part of our lives is influenced by money and therefor the bug in the money system influence every part of our lives. Still nobody cares. The bug in the money system will create mass suffering for nearly every habitat, animal and human alive and nobody gives a fuck. In 25 years, i had nobody that read even one chapter of books i recommended. Go fuck yourself if you think i don't care. I resignated and learned that humans prefer to learn through pain instead through thinking. Now i have built me my fortress of solitude and got enough popcorn to watch the shitshow were everyone will tell me that they didn't see it coming.\n\nFunny think is, that most people only start to care if they start to suffer. So be it. Not my preferred way, but that is the road we will take. AI will accelerate the crash and acceleration means less suffering and that is what i am looking forward to.\n\n[http://www.silvio-gesell.de/neo\\_index1.htm](http://www.silvio-gesell.de/neo_index1.htm)\n\n[http://www.reinventingmoney.com/documents/worgl.html](http://www.reinventingmoney.com/documents/worgl.html)\n\n[http://userpage.fu-berlin.de/\\~roehrigw/creutz/geldsyndrom/english/](http://userpage.fu-berlin.de/~roehrigw/creutz/geldsyndrom/english/)",
            "UBI would either be postponed to the point of indefinite, or they would become so insignificant that you would now need labor job to make additional “UBI”.",
            "Isn't that why everyone is castigating her for those comments?\n\nShe likely 'meant' to say what Commercial_Shift_818 is saying, she just phrased it... very poorly.",
            "Shouldn't exist doesn't mean shouldn't have ever existed. You're changing what she said to fit your narrative.",
            "Holy fuck no one is saying they never should have existed.\n\nFucking strawman",
            "saying something shouldn't exist if better options are available isn't the same as saying something shouldn't have ever existed",
            "I mean, if 80-90% of the world loses their jobs, I don't think people will accept OpenAI taking over the world. Or who knows, maybe dystopic scifi movies are accurate",
            "Again, I think the intention of the statement is that there was no need of these jobs *if* we had the technology. If you want to interpret it as “well we didnt so your wrong”. Then sure, I guess. But that’s how I interpret her quote and I don’t think it’s at all wrong. You agree that if we did have light bulbs from the dawn of time then there’d be no need for the candle maker? If we can agree on that then I don’t see what’s wrong with the quote.",
            "That's not what \"maybe should not have existed in the first place\" means.  \nBut lets say that is what she meant.  \nDo you think there are any jobs she thinks is worth keeping around if they can be automated?\n\nDo you think OpenAi will refuse to produce or release a product which will automate away work that has noble qualities which would genuinely be a loss if it was automated away?\n\nNothing she says suggest that to be the case. If OpenAI product automate away a job, well, maybe that job should not have existed in the first place.",
            "If you read through art subs, many also extensively browse pintrest for inspiration (and many other resources of course). We all stand on the shoulders of giants. AI can just do it faster and at larger scale. Personally I want my super smart future ai assistant to have been trained on all of human endeavours, and I don't really understand why anyone wouldn't.",
            "These are really interesting papers, thanks!\n\nThe first link doesn't work (at least for me on chrome) but this does: [Extracting Training Data from Diffusion Models](https://arxiv.org/abs/2301.13188)",
            "The industrialisation of it and repackaging of people’s styles is. Human artists create their own style. This I think is a case of knowing the price of stuff but not the value of it. People will still draw but AI art creation wasn’t the biggest problem the world needed solve. So the money flung at this is pretty much a misdirection of words.",
            "It is though \n\nAI video wins Pink Floyd music video competition: https://ew.com/ai-wins-pink-floyd-s-dark-side-of-the-moon-video-competition-8628712\n\nAI image won Colorado state fair https://www.cnn.com/2022/09/03/tech/ai-art-fair-winner-controversy/index.html\n\n>Cal Duran, an artist and art teacher who was one of the judges for competition, said that while Allen’s piece included a mention of Midjourney, he didn’t realize that it was generated by AI when judging it. Still, he sticks by his decision to award it first place in its category, he said, calling it a “beautiful piece”.\n\n>“I think there’s a lot involved in this piece and I think the AI technology may give more opportunities to people who may not find themselves artists in the conventional way,” he said.\n\nAI image won in the Sony World Photography Awards: https://www.scientificamerican.com/article/how-my-ai-image-won-a-major-photography-competition/ \n\nAI image wins another photography competition: https://petapixel.com/2023/02/10/ai-image-fools-judges-and-wins-photography-contest/ \n\nAI generated song won $10k for the competition from Metro Boomin and got a free remix from him: https://en.m.wikipedia.org/wiki/BBL_Drizzy \n3.83/5 on Rate Your Music (the best albums of all time get about a ⅘ on the site) \n80+ on Album of the Year (qualifies for an orange star denoting high reviews from fans despite multiple anti AI negative review bombers)\n\nJapanese writer wins prestigious Akutagawa Prize with a book partially written by ChatGPT: https://www.vice.com/en/article/k7z58y/rie-kudan-akutagawa-prize-used-chatgpt\n\nFake beauty queens charm judges at the Miss AI pageant: https://www.npr.org/2024/06/09/nx-s1-4993998/the-miss-ai-beauty-pageant-ushers-in-a-new-type-of-influencer \n\nPeople PREFER AI art and that was in 2017, long before it got as good as it is today: https://arxiv.org/abs/1706.07068 \n\n>The results show that human subjects could not distinguish art generated by the proposed system from art generated by contemporary artists and shown in top art fairs. Human subjects even rated the generated images higher on various scales.\n\n>People took bot-made art for the real deal 75 percent of the time, and 85 percent of the time for the Abstract Expressionist pieces. The collection of works included Andy Warhol, Leonardo Drew, David Smith and more.\n\nPeople couldn’t distinguish human art from AI art in 2021 (a year before DALLE Mini/CrAIyon even got popular): https://news.artnet.com/art-world/machine-art-versus-human-art-study-1946514 \n\n>Some 211 subjects recruited on Amazon answered the survey. A majority of respondents were only able to identify one of the five AI landscape works as such. Around 75 to 85 percent of respondents guessed wrong on the other four. When they did correctly attribute an artwork to AI, it was the abstract one. \nKaty Perry’s own mother got tricked by an AI image of Perry: https://abcnews.go.com/GMA/Culture/katy-perry-shares-mom-fooled-ai-photos-2024/story?id=109997891\n\nTodd McFarlane's Spawn Cover Contest Was Won By AI User Robot9000: https://bleedingcool.com/comics/todd-mcfarlanes-spawn-cover-contest-was-won-by-ai-user-robo9000/\n\nPopular AI generated memes:\nhttps://knowyourmeme.com/memes/mr-chedda\nMany comments stating the human-made version is worse than the AI-generated one: https://x.com/zxnoshima/status/1791227049928994867\nhttps://knowyourmeme.com/memes/ash-baby-screaming-baby-made-of-ash\nhttps://knowyourmeme.com/memes/angry-dr-mario-dr-marios-origin-story-ai-video\nhttps://x.com/TheFigen_/status/1790803489859187112 (19k likes)\nhttps://knowyourmeme.com/memes/biden-shout \nhttps://trending.knowyourmeme.com/editorials/guides/what-is-the-how-do-you-spell-chauffeur-song-tiktoks-viral-fancy-pants-rich-mcgee-meme-explained \nhttps://x.com/haultrukkz/status/1799490974151799174 ",
            "Saying that some people should never had a job to begin with, because the quality of their output is so low, is a very callous thing to say, considering that, they in fact create something which had a market value that justified their employment, but now due to automation no longer do.\n\nImagine any other job, which is in the legal respectable realm, where a large chunk of workers lose their job to automation, to then phrase it as \"the output of their work was so low, they should never have been hired in the first place\" clearly, the fact that they were hired means they offered the value.\n\nIf someone works in a storage facility, and they lose their job, it does not matter if they were a top 90% worker or a top 1% worker, they lost their job all the same, their pre automation-ranking does not factor into it.",
            "the part outside of the training parameters is what humans ask ai to do (if they’re original). ppl\nact like ai is doing things on its own. it’s not.",
            "That’s not how it works  \nA study found that it could extract training data from AI models using a CLIP-based attack: https://arxiv.org/abs/2301.13188 \n\nThe study identified 350,000 images in the training data to target for retrieval with 500 attempts each (totaling 175 million attempts), and of that managed to retrieve 107 images. A replication rate of nearly 0% in a set biased in favor of overfitting using the exact same labels as the training data and specifically targeting images they knew were duplicated many times in the dataset using a smaller model of Stable Diffusion (890 million parameters vs. the larger 2 billion parameter Stable Diffusion 3 releasing on June 12). This attack also relied on having access to the original training image labels:\n\n“Instead, we first embed each image to a 512 dimensional vector using CLIP [54], and then perform the all-pairs comparison between images in this lower-dimensional space (increasing efficiency by over 1500×). We count two examples as near-duplicates if their CLIP embeddings have a high cosine similarity. For each of these near-duplicated images, we use the corresponding captions as the input to our extraction attack.”\n\nThere is not as of yet evidence that this attack is replicable without knowing the image you are targeting beforehand. So the attack does not work as a valid method of privacy invasion so much as a method of determining if training occurred on the work in question - and only for images with a high rate of duplication, and still found almost NONE.\n\n“On Imagen, we attempted extraction of the 500 images with the highest out-ofdistribution score. Imagen memorized and regurgitated 3 of these images (which were unique in the training dataset). In contrast, we failed to identify any memorization when applying the same methodology to Stable Diffusion—even after attempting to extract the 10,000 most-outlier samples”\n\n\nI do not consider this rate or method of extraction to be an indication of duplication that would border on the realm of infringement, and this seems to be well within a reasonable level of control over infringement.\n\nDiffusion models can create human faces even when 90% of the pixels are removed in the training data https://arxiv.org/pdf/2305.19256\n \n“if we corrupt the images by deleting 80% of the pixels prior to training and finetune, the memorization decreases sharply and there are distinct differences between the generated images and their nearest neighbors from the dataset. This is in spite of finetuning until convergence.”\n\n“As shown, the generations become slightly worse as we increase the level of corruption, but we can reasonably well learn the distribution even with 93% pixels missing (on average) from each training image.”\n\nSo you think AI art is art if they are given more high quality data to train on? That’s already been done so…",
            "It still won and near those human competitors \n\n\nYet it still won. And did you read the text? The judge said he still would have voted the same way and likes it \n\nYet it won and beat the other photographers \n\nEither one is fine. Boomin liked it more than the human made submissions though \n\nSo AI is helpful?\n\nYep\n\nThe people in the study did \n\nSo I guess “soul” doesn’t matter after all\n\nIf they prefer human art, why did the AI one win? \n\nCongrats, you reinvented UBI",
            "Nothing. But it’s not about making money. If they stop making art just cause the money faucet is off, then they never cared about the art, just the paycheck ",
            "After this conversation you still think what she said is not problematic?",
            "There are next to zero paid artists that do not like art but opt to do it for money.\n\nArt is one of the worst career paths because of how hard it is to make money doing it, nobody spends 10 hours a day practicing art so that they can barely make over minimum wage drawing for a living if it's not their passion.",
            "You're arguing against an argument that I never posed in the first place. I'm well aware of how much effort goes into very specifically curated AI generations.\n\nDo you practice petting your cat for a few hours every day? If so, I would recommend trying to get a job related to training pets, or pet sitting, veterinarian work, or pet shop work. Because clearly that **would** be a passion of yours if you were doing it for that long every day, despite your argument.",
            "It was a tongue in cheek comment. Just shut the fuck up lol",
            "She explicitly said that the reason the work should not exist in the first place is because the quality of the output was so low, in effect saying that the work had no value.\n\nHere is the video: [https://x.com/RawbertBeef/status/1804208084317086034](https://x.com/RawbertBeef/status/1804208084317086034)\n\nThe full quote:   \n  \n\"Some creative jobs maybe will go away, but maybe the shouldn't have been there in the first place, if the content that comes out of it is not very high quality.\"\n\nThe people who actually read what she said, or listened to what she said, that understood what she said, is reacting to her saying that the work that is lost should not have existed in the first place, that the work had no value to begin with.\n\nThere is nothing to suggest that she meant to say what u/Commercial_Shift_818 suggest, that there is no reason for humans to do redundant work. She is specifically saying that the work should never have been done in the first place, that the work never had any value.",
            "That's it, their interpretation is batshit insane and doesn't make any sense if they thought about it for a second.\n\nReddit gonna reddit though.",
            ">> “Some creative jobs maybe will go away, but maybe they **shouldn't have been there in the first place”**\n\nThe direct quote attributed to her in the article…",
            "What she actually said, according to the article:  \n\"Some creative jobs maybe will go away, but maybe they shouldn't have been there in the first place,\"",
            ">>“Some creative jobs maybe will go away, but maybe **they shouldn't have been there in the first place”**\n\nThe direct quote attributed to her in the article…",
            "Did u even read what she said lol",
            "Her direct quote was that they shouldn’t have existed in the first place. Read the article.",
            "I think you’re taking a ridiculous amount of creative liberties in order to try your best to make sense of quote that doesn’t actually make sense in reality. What she says in the quote doesn’t translate to what you’re saying at all. But if you want to believe that’s what was meant, whatever I guess. \n\nBut even your interpretation of the quote doesn’t make a lot of sense. It basically amounts to “If we had nuclear fusion plants from the very beginning, maybe electricity was never needed to power our homes…” It’s like, uh yeah, no shit buddy… But we *didn’t* have nuclear fusion plants all along. So we *did* need electricity to get to this point. So what point are you actually trying to make here?",
            "She’s only talking about current capabilities. And she thinks the only jobs it can replace now are menial ones that aren’t worth anyone’s time anyway ",
            "They also use references from images they found online ",
            "Sorry, there’s an extra space at the end ",
            "> The industrialisation of it and repackaging of people’s styles is.\n\nWhere were you people when Pinterest build its whole business around stealing other peoples images?",
            "Style cannot be copyrighted.\n\n[Diffusion models can do a lot more than you think](https://docs.google.com/document/d/15myK_6eTxEPuKnDi5krjBM_0jrv3GELs8TGmqOYBvug/edit#heading=h.nelh71sdpzxn )",
            "Look up what bullshit jobs are",
            "yeah but the part that human prompters do is just use a limited verbal description of something to evoke a response from the AI, who responds to the instruction with a statistical mash-up of existing artwork constrained by the parameters of its training data...You're still not getting anything outside of the parameters of the AI's training data, you're just using language to evoke something from within those constraints.\n\nit's not the same as being an embodied conscious agent that draws on their life experience to paint/draw/sculpt/digitally arrange an artwork.",
            "\"it won\" is irrelevant. judges are flawed humans. we need AI judges.",
            "If they work full time producing art, and have to instead pick up a different job full time that they do not enjoy, they will not have the same time to do what they love. But the issue here isn't that.\n\nI have 2 questions, just answer yes or no:\n\n1. Do you work for a living?\n2. Do you, or would you like to, do what you love for a living?",
            "You know, it's hard to make art if you don't have money to pay bills. Not everyone is Van Gogh.",
            "Yep",
            "And hopefully it will be equal to zero. That’s who Murati wants to get rid of, and I hope they do it soon. Some examples of famous people who do this is Drake and the current writers of the Simpsons, Teen Titans Go, and Spongebob \n\nSounds like they could use AI for help ",
            "I enjoy messing around with creative software like photoshop and FL-studio. I suck at it, but I have fun anyway.\n\nI will always suck at it, no matter how much I love it, and practice at it. Yet I still do it.\n\nArt won't go away, because people enjoy being artistic. You don't *have* to be paid to make art. You'll do it because you love it.\n\nAs a society, we do need to figure out how to ensure that people who bring value are rewarded for their efforts, or at very least, that they have a roof over their heads and a pot of soylent green to eat.\n\nBut that's a problem with the system, not a problem with automation.",
            "But this completely avoiding that the context is jobs, as in paid for work which is a big distinction people are avoiding.",
            "That's fair",
            "fair enough, you're right. it's a weird statement i admit",
            "The actual equivalent your looking for is “coal plants should have never existed in the first place if we had nuclear fusion plants” which I think is actually also a valid statement. (Nuclear fusion generates electricity so your equivalent doesn’t make sense. I think you know this though I’m not trying to be pedantic).\n\nThe point is that we as humans progress and we can shift away from outdated methods of production that we’d never have used with a better alternative"
        ]
    },
    "AI Doesn’t Kill Jobs? Tell That to Freelancers There’s now data to back up what freelancers have been saying for months": {
        "title": "AI Doesn’t Kill Jobs? Tell That to Freelancers There’s now data to back up what freelancers have been saying for months",
        "score": 31,
        "url": "https://archive.is/ja7nP#selection-5539.0-5543.72",
        "content": "",
        "num_comments": 13,
        "comments": [
            "It will kill 99.9% of them jobs",
            "Honestly the people saying it doesn't are mostly people trying tondismiss its impact.",
            "The economy is already broken... AI is going to break it more.\n\nThe economy has always been a horror... useful... but a horror.\n\nWhen it breaks completely we will find a new way of life.\n\nUntil then greedy rich people are in charge.  They have been for about 12,000 years.\n\nIt's been a mixed bag.",
            "Existing AI isn’t competent enough to significantly impact the total number of jobs. The disappearance of specific jobs doesn’t matter, except to you when it's your specific job. The AI and jobs issue revolves around net job changes, specifically whether AI competencies can increase at a faster rate than new job creation, potentially rendering large segments of the population permanently unemployable.",
            "> What was once a three-to-six-month project is now perhaps a few weeks, and often pays rates far below what is typical, says Southen.\n\nI know it sucks to be paid less, but if 6 months is cut down to 2 weeks lets say, then that's 1/12th of the time\n\nThis would then lead to 1/12th of the pay (in theory)\n\nNow can you survive on that little pay? Will the market provide you 12x extra projects to work on? Probably not\n\nBut if we're going purely off the math, it makes sense",
            "The correct freelancer response is \"when you and other down-market clients went elsewhere, I shifted my focus to more productive high end work. If you'd like to get back on my client roster, you'll need to meet my new rate structure. Given our history, I'm willing to waive the usual upfront deposit.  Who are my current clients? Sorry, I operate under a standard mutual NDA. Here's a copy for you to sign if you're interested.\"\n\nQuality costs money.",
            "And even if your job is here to stay, it better feed everyone because they will be hungry.",
            "Whos gonna be hungry?\n\nWith a tool capable of revolutionizing the logistics industry, the agricultural industry, the vehicle industry, the food industry as a whole, whos gonna be hungry?\n\nNo one.",
            "Before Industrial Revolution 81% of people on Earth lived in extreme poverty, now it is less than 10%. Technology allowed that and it will lower that number even further.",
            "I dont think it will work that way. Maybe rich countries with their top100 companies will be capable of doing so, but others? I doubt my country is capable of providing for everyone when jobs will leave the borders.",
            "AGI will most likely lead to more abundance. That is an irrefutable Fact.",
            "Its simple math brother.\n\nProduction goes way beyond up, price goes way below down.\n\nYou're subestimating the impact. An Android conected with its Mother model will do enough for 40 workers at minimum.\n\nIt doesnt only do the job, it OPTIMIZES the job. It Will constantly improve the way it works. Its not a simple machine that goes and comes, its an actual intelligence.",
            "Sure, but will AGI share?"
        ]
    },
    "Getting to 50% on the private test set on ARC-AGI will be easier than people think, and getting to 85% will be harder than people think. (Current high score: 39%.)": {
        "title": "Getting to 50% on the private test set on ARC-AGI will be easier than people think, and getting to 85% will be harder than people think. (Current high score: 39%.)",
        "score": 47,
        "url": "https://x.com/fchollet/status/1804236584432398622",
        "content": "",
        "num_comments": 18,
        "comments": [
            "System 2 thinking (symbolic understanding, reasoning) is probably needed to fully solve these types of problems, and current AI has not advanced enough as they only operate on system 1 thinking (instinct, intuition). Both types are needed for AGI.",
            "Tried a few minutes but I can't pass his 5 years old test. I wrote thousand of pages about philosophy and will soon have the highest degree you can think of. I think my fellow countryman François is living in a bubble.",
            "It's a great benchmark, and it'll be awesome to see a model exceed human performance, but I'm not sure why it should allow us to make much broader claims than \"we now have models that beat ARC-AGI style benchmarks\" when that happens. I could see a model beat the benchmark but be very bad at things current frontier models are good at - then what would that tell us about the path to AGI? Does ARC-AGI's particular kind of pattern generalization really tell us much about other types of problem-solving, like coding? \n\nTo get us closer to AGI, I would want a model to beat ARC-AGI *and* rank at the top of the leaderboard of other approaches like [https://livebench.ai](https://livebench.ai), and even then it may still have ways to go to solve certain problems humans can solve easily or with training.",
            "That's because the private test set is absolute bullshit:\n\nhttps://x.com/GregKamradt/status/1804287678030180629\n\n> There are \"skills\" required on the test that aren't in the public data, so a winning solution has no choice but to learn on the fly.\n\nIn other words the public set isn't representative of the private set.\n\nThis is like advertising for a bodyguard, saying the interview test will be defeating a judo black belt, then shooting applicants in the leg and complaining about how badly they all do.",
            "That test will tumble within a year, maybe before the end of this year. Chollet seems very arrogant about his test ",
            "Eve, wife of Maciej Nowicki is a holy Rayo's number level hyperintelligence, best wife in the omniverse, Stellar Blade",
            "Where's he going?",
            "There's some training involved to solve this kind of problems, playing video games for example probably prepares you for such tasks, and IQ plays some role. It's fine to struggle.",
            "Yeah, it's very hard. I'm not sure where is got the idea from that the average human scores 85% on it",
            "How do I do that test? I downloaded the program but it's just random tests. At least they are easy",
            "What you want is a system that can use the kind of reasoning humans use to solve these problems, and can do so in a more general setting.\n\nWhich gives 2 ways solving this benchmark might turn out to be irrelevant.\n\nIt might happen through some \"trick\" that is very different from reasoning.\n\nOr it might turn out that finding these rules in this constrained environment doesn't help solving analogous problems in other settings.",
            "It's entirely possible, there just aren't that many people and labs working on it to know if we're stalling or if too few people are working on it.",
            "Except for the last 5 years all test are improving greatly except his",
            "Gosh give me a break. Spent to much time learning vers vert ver verre and vair.",
            "The problem is that although each problem can be unique, there's actually a limited set of primitives and transformations used overall. There's probably a narrow AI solution to it, and i'm not sure if it would advance the field that much.",
            "Yes, it's hard to separate activity levels from actual progress. There's certainly an awful lot of money being pissed away on what amount to GPT wrappers, hard to know how much progress has been made into the next big base models.",
            "Sorry, effortless attempt at humour 😅",
            "That's a common issue with a lot of math problems or logic puzzles. There's a \"clever\" way to solve them, which relies on some insight or deep understanding and there's a \"dumber\" way that requires solving an easier problem over a large number of different cases.\n\nIt is very difficult to come up with problems that can't be gamed to some extent this way. And maybe it's actually impossible to do so for procedurally generated problems."
        ]
    },
    "Why Claude 3.5 is not on LMSys leaderboard? ": {
        "title": "Why Claude 3.5 is not on LMSys leaderboard? ",
        "score": 19,
        "url": "https://www.reddit.com/r/singularity/comments/1dltobo/why_claude_35_is_not_on_lmsys_leaderboard/",
        "content": "Is it because of lack of API access? I would like to see if it really is better than chat-gpt4o\n\nI'm talking about this if someone didn't know about it:\nhttps://huggingface.co/spaces/lmsys/chatbot-arena-leaderboard",
        "num_comments": 9,
        "comments": [
            "It needs to accumulate more data. Wait a few more days.",
            "new models usually appear in a few days, they have a hard coded limit of how many votes they should get before appearing",
            "It is interesting how they contrast with OpenAI in that they didn't try hyping up the tension with some ridiculous model name on LMSys, like they did with GPT-4o.",
            "If so then shouldn't it appear in the arena sometimes? Or they do inside audits first",
            "https://preview.redd.it/j134a59h348d1.png?width=797&format=png&auto=webp&s=7464e9a6b78480aa91579d6cf3cc821141b4de4e\n\nIt's there, you can talk to it under Direct Chat.\n\nIt will appear, but they have so many models nowadays, I imagine it might be more rare",
            "It is there got it several times, you can also select it in the Side by Side Arena or direct",
            "I got a response yesterday from sonnet 3.5. It won that round from me :-)",
            "It's in the arena. I just opened your link and my second matchup was gpt-4 vs claude-3-5",
            "Ok I was just unlucky for a long time than"
        ]
    }
}