{
    "I farted in public and everyone heard. ": {
        "title": "I farted in public and everyone heard. ",
        "score": 102,
        "url": "https://www.reddit.com/r/socialskills/comments/1dlpo71/i_farted_in_public_and_everyone_heard/",
        "content": "Yup you heard it. I was at work social and and everyone was pretty much drunk. I had to pee really bad and I was pretty drunk. I noticed I fart but thought nothing. It was not until my 3 friends (1 im close with, 2 not really) started to discuss it outside of the stall that I realized what I had done. They all started to laugh uncontrollably. I was mortified. There was also a stranger in there who started to say it’s normal etc. AgainC everyone seemed pretty drunk but this quickly turned into the worst moment of my life. I was laughing with my bestie after but I still felt horrible. About 10 minutes later I still felt horrible and began to tear up and eventually cry in the social. My close friend tried to reassure me that it happens to everyone but I still felt horrible. On my way home I began to bawl my eyes out and started to think of other embarrassing moments in the past. Is there a better way to handle this situation? ",
        "num_comments": 57,
        "comments": [
            "You were in the bathroom. You’re SUPPOSED to do that in there. It’s all good. It’s not like you did it in the middle of dinner.",
            "Were you in the bathroom? That's literally the place you're supposed to fart in, and where anyone who enters expects to hear all the sounds of pissing, shitting, farting, vomiting, snorting. That's exactly what a bathroom is for.",
            "Nobody cares if you fart in a bathroom, especially when drunk",
            "I farted while laughing too hard. Twice. On separate days. At work.😭😭😭",
            "Yea better way to handle that is to fart even louder our pretend to with your hand against your lips , create even more outrageous sound and start laughing with them. Situation is awkward and stupid which makes it funny. Just double down on stupidity and roll with it.  When life gives you lemons situation. Just laught it off and dont take yourself too seriously, you are supposed to be stupid sometimes and make mistakes , its fun of life ",
            "I’ve pissed in someone else’s bed while drunk and they caught me sleeping in my own piss. Good times. You’re fine. Don’t trip my guy.",
            "They laughed because farts are funny bro. You're supposed to fart in the bathroom.\n\n\nSocial skills advice: that's a moment you laugh *with* them.",
            "Outside the stall? Like a bathroom? Thats what they are for. Sounds like you got drunk enough to cry.",
            "It’s the place to do it. When I go in the bathroom at work and the bases are loaded, it sounds like a symphony orchestra in there",
            "In situations like that, it's okay to feel embarrassed, but try to laugh it off if you can. Accept reassurance from friends, focus on enjoying the rest of your time, and remember that everyone has embarrassing moments. Be kind to yourself and move on from it as best as you can.",
            "Humans fart... especially in the bathroom.",
            "as you said you were drunk, that is a perfect excuse. I have seen people do worse when sober",
            "one time i was laying on the couch with a friend next to me and i coughed and farted directly in their direction loud as hell lmfao. at least yours was where you’re supposed to fart. all good, friend.",
            "Everyone farts and it's natural bodily function. It's to remove gasses created from the digestive processes. \n\nNow, if it stank to high heavens... Time to sort out your diet or see a doctor.",
            "We all Fart and that's The bottom line cuz Stone Cold said so",
            "Well done.  Hope you owned it.",
            "Yeah I never understood being embarrassed by farting. I mean people are proud Dallas cowboys fans so there are many things that are way more embarrassing than a fart.",
            "Farts are just funny. Not you. Just farts.",
            "what do you think other people do in the bathroom stall?",
            "Wait you was in a restroom stall when you farted? Literally one of the places you shouldn't get embarrassed over farting in.",
            "it's all good. everyone  farts.",
            "Haha you farted in public. Everyone! Point and laugh.",
            "I once farted on my trainer at the gym. She was holding my feet for sit-ups.. you think about it. She just laughed it off and said “keep going”. Please, even at work, people fart sometimes. The only ones who make an issue of it is the immature, and no one likes them anyway. Honestly, in my adult life, the only person who EVER had an issue is my neighbor-from-hell who, long story short, I caught spying (best way to put it without going into the full story) during my bathroom time. Basically, I called him out, called him a perv, and let him know I had proof of his spying and inappropriateness. Still an ass, but his assholish behavior has decreased significantly knowing I have him caught audio-video if him “spying” during bathroom time.",
            "This is really not a crisis. Holy hell.",
            "Let's start a national fart day.  Everyone should not suppress it but do it as loudly as possible.",
            "Everybody breathes, therefore everybody farts.",
            "I think that you are spiralling because of anxiety, and although I understand that can be difficult, you need to interrupt the negative thoughts. This is really not the worst thing that could have happened. It is totally normal in the bathroom. People should forget about it if you don’t draw attention to the issue. In fact, if they were to dwell on it, then they would be weird and it wouldn’t be a reflection on you. What happened isn’t the problem, but how much it is impacting you, consider treatment for anxiety and remember that alcohol is a depressant so try not to have too much in social settings, even though you might think it makes you feel more confident temporarily it could make you feel worse in the long run, like breaking down over something ultimately insignificant. I’m not being judgemental because these are things I’ve learned from experience. I hope you feel better soon.",
            "Everyone farts nothing to be ashamed of",
            "Anyone who farts in public is someone I wanna be friends with lol",
            "I have colleages who fart on purpose in our office. Youre good. Its gonna be alright.",
            "Bro, that's savage",
            "Relax, bro. Nobody will remember this a few days from now. Everyone goes through embarrassing  situations. It seems like you care too much about what the other people think of you. Farting is really not a big deal, everybody does it.",
            "they'll forget that eventually. When was the last time you remembered doing something embarassing?",
            "I'm ngl sometimes I fart loudly in public just because\n\nIt's really not that big of a deal. It's a normal bodily function",
            "Everyone farts, and loud ones are always funny, don't take it personally.",
            "I accidentally farted loudly in the hallway (which has a lot of echo btw) while walking past two of my coworkers. You’re good.",
            "Girl, you have not experienced embarrassment until you fart from your vagina (very long fart) just when the music stops and everyone can hear and know exactly where it’s coming from. Fart 💨 in the bathroom is easy peasy.",
            "wtf what the fuck lol",
            "I second this. Also, it’s not as bad as the girl I remember from my school who was at a school dance (on a cruise ship), snuck out to have sex with a boy, and let one rip with roar when she was riding him, which was so loud that people underneath heard. She was called Bree, the whoopie-sex-cusion after.",
            "Hell most people don’t care if you fart in general, just excuse yourself afterwards we all do it",
            "It would’ve been worse on the same day",
            "Since me and my boyfriend started dating, we made it a thing to rate the other person’s farts and burps on a scale of 1-10 to make it less awkward and more of a funny thing. I think it made us get comfortable with each other way faster. \n\nI have pretty bad anxiety and it’s my first relationship (plus I’ve not had many friends), so a lot of it were my ”firsts” which is hella anxiety inducing. It’s nice to be able to laugh about the gross stuff rather than feel shy and gross about it.\n\nAnd for OP: Try to make it into a joke instead of feeling (and showing) immediate shame. It’s okay to feel awkward about it ofc, but turning it lighthearted will make both you and the others feel better about the situation. They were laughing and I don’t know the tone of it, but join in! It’s not the end of the world to fart and no one will judge you for it, we all do it. :>",
            "Thank you so much. I really am learning to be more kind to myself.",
            "Thankfully no one complained about a smell!",
            "I laughed",
            "I think therefore I fart",
            "I’m not in involved at all and that’s hilarious!",
            "Or if it was because they were crying too hard"
        ]
    },
    "People don’t just hate me, they’re disturbed by me": {
        "title": "People don’t just hate me, they’re disturbed by me",
        "score": 65,
        "url": "https://www.reddit.com/r/socialskills/comments/1dlnzjc/people_dont_just_hate_me_theyre_disturbed_by_me/",
        "content": "I am a 26F. This has been an ongoing problem for a very long time. Everywhere I go, I disturb the people around me. If I speak, people hate me and are actually disturbed by me. No, it’s not just in my head. It has been confirmed by the people around me. They actually told me first before I noticed myself. I am pretty sure I am autistic to add on to this.\n\nI do not leave an event without causing disruption. I do not realize how obnoxious I am coming across. I have tried to become self aware of this but I continually fail at that. I get told about the way I acted after I left an event and I cannot believe what I have done. I do things that I hate to see other people doing. I am always in disbelief that I am acting the way I am.\n\nIn social situations, I do not know how to respond like an adult. I automatically respond like an 11 or 12 year old that is trying to hard to be funny and quirky. That is how I acted at that age, and I do not know how to not have that part come out of me. It’s extremely embarrassing and I do not want to act like that anymore.\n\nI also have been told that I come across as cocky and rude. I am always shocked to hear this. I don’t think I’m better than others but I apparently have a really cocky attitude. I also almost never mean to be rude to anybody. I do not know why it comes across this way.\n\nMy friend’s reputations have been ruined because of me. If I go with them anywhere, they all leave hated because of me. They told me they like me but sometimes they wish I wouldn’t go with them because they are guaranteed to be hated because of my actions. These horrible flaws are not only affecting me, but they affect others too.\n\nA lot of the time, I choose to not speak as much as possible because I know if I do, it will end horribly bad. It shouldn’t be this way. I shouldn’t be lacking this much self control at 26 years old.\n\nThis isn’t even all of my issues. But if anybody has advice on how to finally overcome this, please let me know. It has been years of trying to overcome these same issues and I have yet to fix any of them.\n\n",
        "num_comments": 36,
        "comments": [
            "These actions you do that get you and your friends hated by everyone, what are some of them?",
            "I think it's hard for anyone here to help. A specialist would be able to assist you.  I am having trouble understanding what is so off-putting about you. Lacking general social etiquette, or impulse control? You seem to understand that there is a problem with your behavior. Or do you not understand the actions that are causing people to distance themselves? I think if you can identify the problems then you can look for solutions. Good luck",
            "Try to find a therapist you can work with or talk to someone about maybe getting evaluated for autism. Once you know the your specific issue(s) you can start to implement better coping or known treatments. \n\nKnowing it’s an issue is a good first step. A lot of people stubbornly refuse to admit they have an issue, so they miss opportunities to fix it and just keep creating the same situations over and over.",
            "Since you have friends can you practice conversing with them as if you’re at a social event?\n\nI also think seeking a good therapist may help.",
            "Can your friends at least list what it is you’re doing that disturbs them so much? I’m the same age as you and have also been told this. Recently my sister stopped me from drinking at a party because I wanted to loosen up. When I tried to make a joke she told me to stop. I was confused because I wasn’t saying or doing anything vulgar and was ashamed because I had no idea what I was doing wrong.\n\nDon’t let these people keep you miserable. If they care about you they would have no problem itemising the behaviours you display that they deem rude or obnoxious. Just ask them",
            "I have an autistic friend who often gets into conflictual situations by giving unsollicited opinions/advise when people around her act in a way that doesnt make sense to her.\n\nIf you can relate to that, maybe one idea would be to accept most people are dumb, lack awareness and have a fragile ego. Unless asked, dont say anything no matter how true it is, that can make them feel even more stupid. When they expose an issue, most of the time they want to vent and are not looking for a solution.",
            "Don’t assume you have autism, you might have some other neurodivergent like adhd. If you get the chance, look up every neurodivergent and you’ll see some mimic each other. Maybe you have bad social anxiety and are so focused on other people that you lose self awareness. Either way, it’s best to seek out a psychiatrist and get evaluated. I really hope I was able to help.",
            "The issue here is learning when something is about to go off the rails *in real time.*\n\nIf your friends have told you specifically what went wrong afterwards and you have not been able to self correct, then you need a different approach.  Role play/social stories/scripting can be very useful, as everyone has mentioned. \n\n This is what would be involved:  Ask your (former) friends to describe the situation, how you responded, why it was weird, and what a more socially acceptable response would have been.  Or at least bring the situations you know about to a therapist \n\nHow do you learn best?  If visually, write it all down and study.  If aurally/orally, record the information and then repeat it back out loud.  \n\nThen the role play.  You ask a couple of folks to rehearse the situations with you.  Just like an actor in a play, or an improv troupe, you go over and over the material until it becomes second nature.\n\nIt may be hard work.  It may feel weirdly mechanical.  But because you want to succeed, you can do it.",
            "Sure, here are some brief steps:\n\n\n\n1. \\*\\*See a Therapist\\*\\*: Professional guidance can help manage your behavior.\n\n2. \\*\\*Social Skills Training\\*\\*: Join programs to practice and improve interactions.\n\n3. \\*\\*Get Feedback\\*\\*: Ask close friends for honest, constructive advice.\n\n4. \\*\\*Practice Mindfulness\\*\\*: Stay aware of your actions in the moment.\n\n5. \\*\\*Role-Play\\*\\*: Practice social scenarios with a friend or therapist.\n\n6. \\*\\*Watch Your Tone and Body Language\\*\\*: Focus on how you say things, not just what you say.\n\n\n\nProgress takes time, but these steps can help you improve your social interactions.",
            "I am a very quiet person because I feel I am obnoxious when I’m fully myself. It’s gotten better with time. The biggest thing for me is getting out of my head. Like, no thoughts. Just observing what is happening around me and then deciding what the best course of action is. Whether it is a polite comment to keep things going or simply allowing others to fill the space. When I am not in my head I cannot get nervous about what people think and therefore mess up less. Hope that helps a bit. If you need resources look into mindfulness practices",
            "It’s interesting that you mention age 11/12. You don’t have to answer, and it may trigger a trauma flashback, but did anything happen then? Like for me, I’m stuck at age 6. No therapist has been able to do anything. I kind of accept it. My grandfather died and I wasn’t allowed to see him just before nor go to the funeral. I basically dissociated from life at that point because he was the only male who loved me and was present. I make fun of situations like a six year old when I think people are stuck up about something.\n\nWhat I do to fix myself is a deep dive into the horoscope. That’s all I have to go by because the few friends I have have never said how blunt I am, and my family encouraged me to be blunt. Piece by piece have I made sense of why I act practically identically to how you describe yourself. It seems to be part aspergers, forced socialization, trying to fit in, not self-regulating quite the right way, and not getting the right feedback.\n\nIf you don’t believe in metaphysics I totally understand. But if you do, know that how each of us comes across is practically impossible to gauge from our own perspective. We need others to tell us. The horoscope can give us an idea.\n\nTell people that you can handle the feedback. Not everybody witnesses our behavior in every situation so something is going to be left out. It doesn’t have to be perfect. Maybe it’s much simpler than what you think. In my case (again), apparently I have a strong upper class accent is what I call it. Nobody told me until someone let it slip when I was 42 years old. No wonder kids at school treated me a certain way let alone everyone else later at work. They all thought I was somebody completely different. I never knew.",
            "I'm wondering if you have bipolar.\n\nIf you do, you're in good company.  Some of our most loved celebrities have this.  Demi Lovato, Selena Gomez, Mariah Carey and Stephen Fry, for example, are bipolar, out and proud lol.\n\nIf so, some medication can make the world of difference. And a good therapist, ofc but not everyone can afford that.",
            "Who got in your head lol . \nThey are acting like your the Tasmanian Devil off the looney tunes surely your not that bad .... Get better friends and get outta your own head. ",
            "You did it here.  A long long long story but no specifics.",
            "Do you have Netflix?\n\nI really enjoyed watching this show called \"Good doctor\", it felt really relatable. I think you'd feel the same. \n\nhttps://youtu.be/rpWeDASdL9w\n\nI'm not fully autistic, maybe like 10% but I've felt like how you feel. And watching Shawn's character growth on this show really was heartwarming and somewhat therapeutic.",
            "did she tell you why she didn’t want you to drink or stopped your joke?",
            "I don’t think this is helpful. Honestly, most people are aren’t dumb, lack awareness or have a fragile ego. If you have the attitude that they are, even if you aren’t actively showing it to people, then they will pick up on it and continue the issue of not liking you. People can be pretty amazing, it may just not match with you view as amazing. Treat them as such, and eventually you’ll find the ones for you.",
            "Being stuck at a certain age has a name. It's called \"arrested development\" and my sister suffers from it from trauma in her early teens.",
            "I’m wondering the same. You mentioned a lot of the symptoms. Search up DIGFAST bipolar",
            "Simply dumping your friends is horrible advice for someone who is trying to do better and work on themselves. This is doubly so for a person who's clearly having a lot of trouble interacting with strangers.",
            "If OP has autism like my friend and shares similar issues, my advise is helpful.\n\nThe fact you disagree with what my own experiences have taught me is a completely different subject.\n\nBut I can meet you halfway : some individuals are amazing and deserve the best I have to offer.\n\nThe rest only deserve a good social mask and no hostility.",
            "So you stay by people who don't value you ...  No \nGo where your celebrated not where your tolerated you deserve people who actually like you not. \nThis poor person getting bullshit pumped in to there head that they are hated ,cocky .disgusting... There opinions should be kept to themselves not voiced to this person ",
            "This depends entirely on whether or not they're actually doing something wrong.",
            "They're not doing anything wrong they're living life and have been met by pieces of human excrement who thinks it is fine to tell people \"we wish you wouldn't come cause people hate you and we don't want them hate us\" does that sound like a fostering environment somewhere you'd like to hang out, that sounds like insultive asshats who never had my back.",
            "I'm not sure why you are so certain of that. I asked OP about what some of these behaviors are and I'm waiting for a response.",
            "You could be right, but it definitely depends on what's being done, does it not?"
        ]
    },
    "Why do I have such a 'bullyable' personality?": {
        "title": "Why do I have such a 'bullyable' personality?",
        "score": 229,
        "url": "https://www.reddit.com/r/socialskills/comments/1dl8xdi/why_do_i_have_such_a_bullyable_personality/",
        "content": "\nI swear theres a least going to be 2-5 people in a given setting that when i initially meet them they seem fine but after getting to know them for a bit, i could feel that there's just something in me that ticked them off. Maybe it's my verbal speech, mannerisms, body language etc. I dont know. It will just trigger some sort of primal instict in them. \n\nThey'd start to be a bit passive agressive, even targeting me a bit but the degree that could be easily passed off 'playing' or 'a bit ot banter' to non sensitive people. But I could feel the vibe is off and i dont feel as safe. then they up the ante. In some cases things might escalate to full blown bullying but that is rare\n\nMost of the time i just let it go. But at times Id stand my ground, stop the friendly voice and adopt a more lower voice and curt response, and stare at them. I might snap at them if they dont get the message. But I realize doing this often would lead to me being disliked and avoided by most people. But many people do things that would lead me to this level in the first place and they have friends as well, so id end up being disliked by many people\n\nSo the ideal solution is just not be 'bullyable' in the first place. Don't have a personality that provokes people so I dont have to fight and be disliked by people. Throughout my life I have to choose between being weak or being dislike and avoided.\n\nWhat do you think of this? How do i fix this?\n\n",
        "num_comments": 58,
        "comments": [
            "I relate to this. It was honest painful to read. Best thing you can do is stand up for yourself and not hyperfixate on what others think about you. Easier said than done, but a lot of people can sense the insecurity which is why they bully.",
            "As someone that has been bullied when younger, and doesn't get bullied now, I'd say you're on the correct path in the \"not being bullyable\" path of thinking. What I gather is that bullying often comes from insecurity and make themselves feel better by pushing others down. And thus, my remedy has come in the form of making people feel better without them needing to put anyone down. \n\nThis can be done by building a stronger personality (wit, humour, interests, ... ) and listening skills (empathy, active listening, ... ), so that people enjoy being around you, without any subtle power hierarchies needing to be created. This is way harder and more comlicated than what can be summarized in a single Reddit comment, but \"How to win friends and influence people\" might be a solid read to help build these qualities.",
            "Most autistic people can relate to this. There's just something monstrous in a lot of people during social situations that doesn't come out until they realize someone is different than them. I don't know exactly what it is, but you're not alone.   \n  \nJust don't be a pushover or let people walk all over you. It sounds pessimistic, but most people really do suck and there's no point in trying to be friends with them. Just don't make your relationship any worse than it has to be if they're someone you have to be around a lot, like coworkers. For friendship, you just have to find people that like you for how you are. A lot of people just aren't accepting to people that don't exactly fit in with them or their friends or people like them.",
            "I can relate to a lot of what your saying and I’ve faced similar struggles in the past, although I feel I’m getting better. \n\nHonestly I think certain people will bully you if they sense you are insecure and not confident. People can pick up on weakness quite quickly which is why once they’ve sussed you out they start pushing your boundaries. \n\nThe best thing you can do is be try to be friendly and approachable, but also come across as confident and not an easy target. Even if you have to fake it, especially with body language. Bully’s will always pick on people they think won’t fight back. \n\nWould it be fair to say you’re not the most confident person? Are you socially awkward? \n\nTry to come across as confident and friendly and 99% of people will be fine with you. At least that’s my experience, as I can totally resonate with you when you said you either have to choose between being weak or disliked. But there is a middle ground you have to find, where your not a pushover, but your also not an asshole. \n\nAnyway I hope my comment helps, I wish you the best of luck.",
            "If you’re quiet and hard to read, maybe they feel insecure around you and they need to feel the need to put you down. At least that’s the read I get with the info at hand.",
            "Ask someone who knows you well what it might be, and ask them to be brutally honest with you.",
            "Hang around nicer people, and don't take bullying to heart, distance yourself from them. People like that are insecure. Fuck them and focus on your work. Inform authorities and have firm boundaries. Call them out on their behaviour.",
            "I'm 40 and it has gotten a little bit better with age for the most part I still have that problem too especially when I'm new at a job",
            "To start off with, you shouldn’t have to change yourself at all :c I am terribly sorry. \n\nIn improv, we did some work relating to social statuses. So a “high-status” person will have a more open body language - chest out, shoulders back, occupy more space. They may also talk with a specific cadence (that you’re trying to work on). So perhaps you can try this more? Explore what a “high-status” person is like in your opinion. \n\nAlso note, it is a spectrum depending on the situation. High status people can become “low-status” and one is NEVER better than the other. If anything one group are more considered to be assholes. ",
            "I feel the same! I have selective mutism and am more comfortable when I'm not talking but I do try to talk more but I never really know what to say in conversations so I mainly give out one sentence responses or don't really contribute as much and I think that's what turns people off. I've had people tell me they thought I was full of myself for not talking (nope, just selective mutism and social anxiety!)\n\nWhat I've also noticed is that some people think that because I keep to myself and don't really respond or react, that means they can say or do whatever they want with 0 consequences (like when you're a kid you're told to just ignore bullies because they just want a reaction out of you, it's weird seeing grown ass adults acting just like that).\n\nI usually just ignore them because if they wanna be immature, I'm not gonna stop them, but I also don't like people walking all over me (but from previous experiences, when I do stand up for myself I'm just told i'm overreacting or immature, so really I don't know what I'm supposed to do)",
            "Ultimately, what makes people bullyable is their reaction to it. You want to dodge learning to deal with the bullying by not being bullyable in the first place, but that's not really possible, because your reactivity to and inability to deal with the bullying is exactly what makes you bullyable in the first place. The ***only way*** to become unbullyable is by learning not to take it personally. There are a number of tactics to achieve this, such as laughing at yourself or grey rocking, but ultimately what is at the core of all of these strategies is that they are ways to not allow their comments to affect you.\n\nWhat people are doing when they bully you is asserting themselves as being above you in a social hierarchy. They seek to gain recognition that they are better than you-- that they are assertive and have social power. It is a dominance game. You probably feel that you don't want to play this game. You didn't sign up to be in a competition of egos. It is unwanted. But whether you like it or not, it is part of society. It is a bit of social jiu jitsu to show the bully that you do not care about their bullying. Being unaffected by it wins the battle for you, and gives you the clout that the bully was seeking. Every time you refute their efforts, you gain social standing, and eventually you will have enough that you will no longer be seen as an easy target. That is when the bullying stops.",
            "Its interesting that you can't pin point the exact reason for the shift. The majority of people are decent and level headed. If you're experiencing this often, you're going to have to be more introspective and observe what the most liked people in the groups are saying and doing. \n\nSocial interactions are tricky in group dynamics. Generally if someone bullies another, that just makes them a bully. But normal people can sometimes shun others subconsciously. Friend groups who have been friends for a while stay friends because they enjoy the overall vide from the group. You have to ask yourself if you \"fit in\" or if you're inserting yourself in a way that changes the desired vide. Usually the person that messes up the vide is a contrarian who doesnt understand the group dynamic. \n\nWith that said, you can actually remain true to yourself and be yourself. You just have to learn some tact and poise... which takes alot of practice.",
            "You may be interpreting people’s normal behavior as somehow your fault. Maybe they are just like that?",
            "I relate to this experience 100% in most areas of my life. It really sucks. But the people who are worth having around will not treat you any differently, just because you don’t fit the same norms that they are comfortable with. I’ve come to accept this, I stand my ground when I need to, I don’t kiss ass or try to convince anyone of my character. Ultimately, I consider the “bullying” to be a result of others’ discomfort with someone that doesn’t fit their ideal mold.",
            "I’m really sorry you’re feeling this way. It sounds incredibly tough, and I want you to know that you’re not alone. It’s important to remember that it’s not your fault when people react negatively. Everyone has their own issues, and sometimes they unfairly take it out on others. It’s great that you’re self-reflective, but please don’t be too hard on yourself. You deserve to be treated with respect and kindness.  \nTake care.",
            "I've always liked this quote: \"People fear what they don't understand and hate what they can't conquer.\" \n\nThis happens to me too. I've realized that if you don't fit into a specific box or you don't act accordingly with the version of you they've made in their heads, they will see you as a threat. They also subconsciously know if you see past their \"mask\", and feel vulnerable because most people are just a bunch of masks pretending to talk to other masks. Those people usually think they are being their authentic selves, so they don't understand why you aren't behaving like everyone else.\n\nThose who don't fit into society as a stereotype or character of a person will feel this way. Trauma can play a part too, and it takes a lot of integration/processing of that to be yourself regardless of how others view you.",
            "Best medication for bullies is bullying them back. If they get angry you say \"if you can't play, don't come to the playground\".\n\nI'm supposing you're an adult, of course.",
            "High pressure people flow into low pressure people.  If you can muster the courage to be increase your pressure at the right time, high pressure people may stop trying to release their pressure on you.  \n\nThe other side of this coin is stay low pressure and let it all go.  These people have more issues than you do, likely “pressuring” them to release onto others.  There’s nothing wrong with being calm and maybe even a little meek.",
            "I feel for you OP. It's tough when people don't have your back. Those friends who tag along with the jerks but don't do anything? They're probably not the best crowd to hang out with. If you want to fight fire with fire though, you can still try coming back with some clever comebacks. But you don't have to if that's not your thing. Just remember, you don't have to take their crap. Anyone who has a problem with that can just gtfo, ya know?",
            "I don’t have anything to help fix this but to here to show solidarity as I suffer the same problems too. \nI’m autistic and I read somewhere neurotypicals can smell an autistic person without knowing they’re diagnosed. But they can’t put their finger on it so the only thing that makes sense to them is that there’s something “off” about you.\nThat being said people are just shitty in general",
            "you probably look weak/small and/or have confidence issues. The reality is people can sense fear/doubt. We are actually animals, despite all the high-minded stuff about anti-bullying. You can look at apes and monkeys for how humans actually are programmed to behave. \n\nI really suggest you hit the gym/gain some muscle and start vigorously defending your boundaries. Also, if people are dicks, you be a dick right back to them. Pobody's nerfect.",
            "They smell blood in the water. Find where you're bleeding from and try to close/hide/heal the wound. Easier said than done, I know. There's a reason most if not all animals have an innate instinct to hide any injury as much as possible.",
            "You 100% nailed every single thing about this. I can’t stand it, and I’m wondering the same thing for myself. I’m not very bully-able physically. 5’10, football player build. I’m bi-racial, and have been told I look everything from Hispanic to Dominican to black. I grew up in an ok area and went to a pretty diverse school & did sports plus plays/musicals. \n\nHow I feel about it honestly? People may be intimidated by how I speak; I was an avid reader growing up and articulate well. Maybe sometimes they look at me & think I shouldn’t be as knowledgeable on a particular topic or whatever. Idk. As I’ve gotten older though and stopped being as overly critical of myself, I gave myself a little grace & (in my head) started a 3 strike rule; first shady comment is on the house. I’ll be a good sport. Might even chuckle. 2nd one is usually thrown back at em based on the overall vibe..if it was personal, we can go there too. Strike 3 I just laugh and ask if they’re good, then let them know I got some other stuff lined up but it was good to see em ✌🏼\n\nIt really sucks. My sister gets like this when she drinks dark liquor, and last night this happened while we were on FaceTime. After strike 3 though? “Hey my phone’s gonna die, I’ll talk to you later. I love you” *click*",
            "Be confident, and consider that maybe there is something about you that isn't socially toeing the line that throws people off.\n\n\nOr\n\n\nYou are in the wrong circle of friends or people you meet. Need to change the setting or consider where you are is toxic to you.",
            "I think it *can* be a dominance / testing thing, more than sometime actually disliking you, and I know at least back when I was a teenager some of my best friends ended up being the people I had gone through that sort of boundary-testing sniping with. So they might not really dislike you for pushing back as much as you're expecting.",
            "Too many possible reasons. Maybe the way you react to their bullying is adorable/funny, or maybe they feel like you're submissive. It could also be cultural differences.\n\nI've experienced this, and what I've done is I did not take their bullying to heart. I know my approach is different from others, but in the end, I realized that they really mean no harm/malice with what I previously perceived as bullying (it's just banter to them, and I've adjusted to it)\n\nMaybe try bantering back to them. if they perceived it negatively then that probably means they were 100% bullying you to show dominance.\n\nTake all of my words with a grain of salt though. There's a reason why I'm also in this subreddit lol",
            "I agree with another comment. There could be some level of autism that you aren't aware off. Lack of social awareness, lack of social cues, no eye contact, some quirkiness, no common sense, bad facial expressions, and even not using the right tone of voice can turn people off. Example if you keep laughing at things that aren't funny, trying to pass off \"charming\", it pisses off some people.\n\nAdd some \"people pleaser\" in the mix and people will bully you or put you down just so they could express their feelings towards you. If you defend yourself or stand your ground, you are immediately unlikeable and even hated. \n\nAnother comment is on the spot when they say you need to build yourself up. If you have a very good personality then people will naturally like you, gravitate towards you, make you part of the group. Like a main character.",
            "I used to experience that, when I would show my sweet and kind personality to all. You just have to develop a protective exterior (different for everyone, so I can't advise on what works for you) and work on your self-confidence. Additionally, when people try it on with you, learn to nip it in the bud - either tell them directly that what they are doing is wrong or escalate it.",
            "If only there was a way to remove your consciousness from current reality and observe from a third person perspective on your own interactions in the instance instead of retrospectively. \n\nMy advice would be to remove your active presence from the situation once you start noticing the typical signs of what is happening. Stand back and listen, analyse how you would normally respond or interject and see if it’s a personality clash over menial things like intellectual capacity or your own ignorance. \n\nSometimes people can react negatively towards being out-brained or if they notice your lack of solid experience in a subject matter, a lot of the time it can be a mere sentence you utter that can completely swing someone’s opinions of you.",
            "[deleted]",
            "Get thicker skin. People often loosen up after getting know people. If someone is joking or bantering with you, banter back. If someone is actually serious and being rude, have a spine and stand up for yourself. Don’t tolerate bullshit from people and don’t be a pushover but realize sometimes it’s not as deep as it seems.",
            "30 years in education.\n\nStudents with high character, work and study skills, and make others feel good about themselves are very rarely bullied. Happy groups of people doing their best and happy with each other. \n\nStudents that don’t put in their best effort, talks crap about others, makes others feel bad, self centered, end up getting bullied. Usually hang out with others like themselves and at some point get bullied.\n\nAttention seekers with very few redeeming personality traits (character like compassion, honesty, reliability, responsibility, respectful, morals, values, ability) get bullied all the time. \n\nBullying by school definition is as follows, power difference, over time. One comment or a few, not bullying. Equal power between the individuals, not bullying. \n\nOther people having a bad day or rude or low social skills is not bullying.\n\nMy best advice, make other people feel good about themselves when you’re around. Pick your battles. Don’t compromise on your boundaries. If people are crossing your boundaries, spend less time or no time around them or with them. Eventually everyone will see who is who and if you’re fine, you’ll be fine. If other people are shit, people will see it.",
            "It’s cuz people don’t respect you.\n\nBe a man. Don’t complain when things don’t go ur way. Don’t blame others for ur problems. If someone presses you press them back. Be physically and mentally prepared that a full on fight might come and stand ur ground. \n\nIf you can do all that people are forced to respect u and not pres you",
            "Everyday I wonder more and more if I on the spectrum. I’ve always felt like an outcast in every setting.",
            "Primitive wolf/herd mentality. Humans are no better than animals",
            "I remember when I was 15 and my class was in line because it was classphoto day, in line I was before a guy from my class and I stumbled and accidentally fell behind and touched with my back his shoulder, then before I gracefully stepped back to the front, he brutally pushed me forward. I felt really ashamed because I already felt super awkward and clumsy and then being so brutally pushed forward and not daring to stand up for myself. It all happened too quickly and I was shocked that I just walked on and acted as if nothing had happened.\n\nI found it and still find it weird that he pushed me. Was it because he perceived me as weak and that's why he probably he thought he could do that to me. At that time I felt really depressed and had very very low self esteem.",
            "So true 😥!",
            "I did. People mostly just say im overthinking. I think people who will understand will. People who didnt need to understand that is people not like me simply wont",
            "this is how school shooters are born tf"
        ]
    },
    "Getting called “tacky” for not wanting to split the bill evenly? ": {
        "title": "Getting called “tacky” for not wanting to split the bill evenly? ",
        "score": 70,
        "url": "https://www.reddit.com/r/socialskills/comments/1dlhx6o/getting_called_tacky_for_not_wanting_to_split_the/",
        "content": "I am on a large birthday trip with about 10 women including myself. For context, this trip was presented to us as “mindfully budgeted.” Turns out, a lot of the activities were not inclusive. A lot of the other girls agree the trip turned out to be more expensive than it was presented. This is not a milestone birthday, or has any specific significance. \n\nI understand conceptually that it’s easier to give the bill to 1 person in large parties when eating out. However, I believe it’s pretty normalized to just pay back that person for your specific dish/drinks/etc, not split the bill evenly between 10 people. To me, it’s not fair. If somebody orders an expensive entree, drinks, and apps, and I get a simple entree, why would I want to split the bill evenly? \n\nThis girl turned to me and said, “I CANNOT STAND DOLLAR FOR DOLLAR PEOPLE, IT’S SO TACKY.” \n\nI want to be clear, I’m not a “dollar for dollar” person unless it’s a significant difference Why is that tacky? Why would I want to pay for somebody else’s meal when they take advantage and run up the bill when others are trying to budget?\n\nNot to mention, the birthday girl over bought a ton of food in bulk for the air bnb that we’re expected to split evenly, and she’s taking home everything that wasn’t opened. To me, it just seems like she wants to buy things in excess and expect the rest of us to compensate because of the sole fact that it’s her birthday. \n\nI just want to understand why it’s “tacky” to not want to split things evenly when it’s clearly not even. I’m so turned off to wanting to do anything in large groups. ",
        "num_comments": 17,
        "comments": [
            "It’s not tacky she’s just broke and wants you all to make up for her poor financial decisions. That’s not a friend..not a friend at all.",
            "I was once buying a car and the salesman tried to shame me for negotiating with him. He said, do you nickel and dime everything? I told him if nickels and dimes weren’t important to him then he should just give me the price I wanted.",
            "I fully support going dollar for dollar, people that say otherwise are the tacky ones. They depend on people being shy of speaking about money or being soft on the boundary and getting their own pricy items comped. If they really had a problem with dollar for dollar they wouldn’t get expensive items, otherwise they’re just greedy people",
            "I “willfully ignore” around $7-$10, not sure why that’s the number for me but it is.\n\nAfter that then, I want itemized and I round up to the nearest dollar, I personally don’t care about $.63.",
            "I think it's tackier to expect ones friends to subsidize one's party.",
            "As someone whose food order is usually on the more expensive end in group purchases, I could never understand how people who spend more could feel comfortable asking to split evenly. That's literally equivalent to asking for a discount on your food at the expense of someone else. Crazy to me.",
            "I don't like people deciding what I should do with my money. Unless I am treating someone, I am only paying for what I eat/drink. \n\nI think it's super tacky to expect someone who only orders an appy and a coffee to subsidize their steak dinner and multiple drinks. It's a baffling expectation. \n\nIt is also super-duper tacky to voice that expectation in such a haughty and jerk-store way. I like to imagine that I would immediately tell her to get bent, but I likely would be to stunned in the moment by the shocking rudeness. Even if I was insane and agreed with her sentiment, I would NEVER say it to someone and try to make them feel small! JFC!\n\nShe is 100% the a$$hole OP!",
            "If you only ate and drank what you ordered then I don’t see a problem with only paying for that. However, I was in a similar situation with a group of girls at dinner. Each ordered a main and a drink. I ordered starters for the table, 2 mains and two drinks. I of course was the only one to drink the drinks I ordered but we shared all the starters and mains (it was an Asian place so lots of options to share) For clarity, when I say share, I mean all the food was in the middle of the table and everyone helped themselves. I offered to pay and have everyone transfer me their share But when it came time to them paying me, I only got the money for the plates of food they specifically ordered.  I didn’t realise until the next night when we went out for dinner again and noticed I didn’t have as much in my account as a I thought. I never would have skimped on paying knowing I ate a bit of everything. Turns out people don’t automatically show you the same respect you would show them.",
            "Most point of sale systems at restaurants these days track orders by your seat number at the table anyway. If you're a large party it is better to inform the waitstaff that you'll be doing separate checks and it's really no trouble for them. That way you can avoid all this awkwardness before the end of the meal.",
            "In my friend group, it's understood that we split evenly. But, this is something that we all mutually agree. In OP situation, this was something that isn't normal and suddenly  decided to split bill evenly without everyone's agreement. The friends are in the wrong in this case. Calling someone tacky is uncalled for.",
            "Who splits the bill evenly? Is this really a thing? It seems insane to not just pay for what you got yourself.",
            "Nah, people gotta' be mindful if it's expected to be split evenly. Ordering the $80 steak when everyone else bought a $30 entree while aware of the bill being split is a douchebag move. Moreso, pinning that greedy flaw on someone else as somehow their fault/problem is probably some shitty projection of their own \"dollar for dollar\" cheapness outside of that group situation.",
            "I find it astounding that one person could call another tacky for not wanting to subsidise their meal! \n\nThe cheap one is the person trying to get their food _for less_ than it actually cost. Mind boggling",
            "The moral of the story is don’t be the one who pays the bill. Get someone else to. It’s easier to owe someone else money (because you know you will pay them back) than chase people to pay or worse, chase for the shortfall of any payment"
        ]
    },
    "Should I use Reddit to find friends? ": {
        "title": "Should I use Reddit to find friends? ",
        "score": 12,
        "url": "https://www.reddit.com/r/socialskills/comments/1dlrrqp/should_i_use_reddit_to_find_friends/",
        "content": "Is it really as bad as it's made out to be? I know there's lots of friendship subs on here, and surely plenty of people feeling as lonely as I do.  \nI've given up trying to find friends in person.. ",
        "num_comments": 17,
        "comments": [
            "it takes a while to find your people but you do",
            "Yes & no personally, sometimes you find good people but it’s short lived and other times you find people who are just not a good vibe to be around with for a long period of time.",
            "You can use Reddit to find friends but I wouldn’t. What you can do is use Meetup to meet new people in your area based on similar interests.",
            "depends on your age and comfort level, if you’re looking for more casual friends id suggest joining discord servers relating to your interests, especially newer ones with an active community.    reddit isn’t the *best* place to find friends. ive met good friends via social media (mostly discord) or online games with a chat feature! id recommend you stay away from fps games though, i find them to be quite toxic imo.",
            "I think it depends on what you're looking for, but generally I think its a good way to make connections. I've been on these type of subreddits many times because I struggle with loneliness because of chronic illness. I've met a ton of people I cherish and would consider great friends, but if we didnt have a shared hobby we could do together, we would never have grown closer. Basically they started out as  casual gaming company, and then through time they developed into close friends. I've tried making friends where we only text each other, but they rarely work out.",
            "Damn guys whats the difference between loneliness and alone?Does loneliness has to do with no connections at all?",
            "I’ve heard of people using Reddit to find friends. https://www.reddit.com/r/MakeNewFriendsHere/ is a good subreddit for that. Meetup, sports leagues, and hobbies are a good place to start. ",
            "I feel like the point of this website is partial anonymity. There are a lot of evil people in here, so I'm not sure if I'd do it. There are a series of apps where you can make friends, also I'm sure you can do it personally after some therapy, maybe.",
            "You can use reddit to find communities for your hobbies and interests. You can join discord servers and PM people whose interests conveniently align with your own. However, when you go into it with the intent to make friends, it feels forced and doesn't work. It sucks if you're desperate, but the best way to make friends is to not focus on making friends and to do social things that you enjoy",
            "Why not?",
            "Hey mate sorry for that can you tell me whats the chronic illness or is it trauma feel free to tell me",
            "I would describe it as loneliness is when you are sad about being alone.\n\n\nIf you are alone and are a happy hermit then you are not lonely.",
            "I don't mind answering. It's called cfs- chronic fatigue syndrome",
            "Not true. I have friends and I am still lonely",
            "Thanks mate,how is it diagnosed?"
        ]
    }
}