{
    "OUR RULES ON POLITICS: 2024 EDITION": {
        "title": "OUR RULES ON POLITICS: 2024 EDITION",
        "score": 109,
        "url": "https://www.reddit.com/r/southpark/comments/1c0q9vt/our_rules_on_politics_2024_edition/",
        "content": " It's an election year (in the US)! You know what that means - another year of Giant Douche vs Turd Sandwich! \n\n# OUR RULES ON POLITICS\n\n# IF YOU DO NOT READ THIS POST YOU RUN THE RISK OF GETTING PERMANENTLY BANNED.\n\n**All political discussion must pertain to the world of South Park.**\n\nAgain: **All political discussion must pertain to the world of South Park.**\n\nOnce more for those in the back: **All political discussion must pertain to the world of South Park.**\n\nThis means real world politics are only to be discussed within the context of the show. If someone does not appear in the show, well they don't really belong on this sub. **Donald Trump does not appear on the show as President Trump - that is President Garrison.** \n\nDo you love and support the left? We don't care. Do you love and support the right? We don't care. Are you a Libertarian? We don't care. We are unpaid mods here to enjoy a tv show, not push agendas, get into political slapfights, or deal with a bunch of political shit. If you want to have a political discussion, go to [r/politics](https://www.reddit.com/r/politics/) or any of the numerous other political subs. We are a sub about the television South Park. We are not a sub about politics. \n\n**FAQ**\n\n**Why don't you allow real world politics?**\n\n>We decided that real world politics just aren't worth the shit show they bring. When someone mentions Biden or Trump, or one of the numerous wars going on, a lot of people from outside the subreddit come in to argue political points and push agendas. We are not here to moderate that type of discussion, and if you as a user want that discussion, you can find it basically anywhere else on reddit.\n\n**Why don't you change the rules?**\n\n>We are a subreddit about a TV show, and as such it wouldn't make sense for us to be a political subreddit. We know Southpark often times connects, mimics or otherwise makes note of current events and we'd love you to discuss that - just keep it within the context of the show.\n\n**But President Garrison is supposed to be Trump!**\n\n>That isn't a question, but we all know who he is supposed to be. You want to make some stupid meme? Use President Garrison, just leave Trump & his name out of it. (Seriously, even putting his name in a title brings out the politics.) You can use [the actual Donald Trump from the show.](https://southpark.fandom.com/wiki/Donald_Trump) He isn't president in the show, so it won't exactly make sense, but you do you. Southpark has not made mention of President Biden, nor is there a character who was \"transformed\" into him, so you'll have to leave him out.   \n>  \n>Simply put, **DO NOT USE REAL WORLD DEPICTIONS.**  \n>  \n>I am not kidding here, the mere mention or real world depiction of political figures brings out more idiots than just using their in show counterparts. People get passionate about politics, and while that is good, it is also really annoying.\n\n**I got banned for politics, what do I do?**\n\n>First off you should read this post. A link to this post may be included in your ban message. Once you have read this post, respond to the message and tell us you have read this post and are sorry for breaking the rules. So long as you aren't a dick about it, you will get unbanned. **Seriously, an apology will get you so far.**\n\n**I am trying to write a fan script about Southpark. Am I allowed to use political things that haven't appeared in the show?**\n\n>Simply put: no. We will still remove the post, because all this is going to do is fuel the fire and draw more political comments.\n\n**I have additional questions! What do I do?**\n\n>Send us a ModMail and we may add it to the Q&A!\n\nAnd don't forget: **All political discussion must pertain to the world of South Park.**\n\n\\~The [r/southpark](https://www.reddit.com/r/southpark/) mod team",
        "num_comments": 0,
        "comments": []
    },
    "We've updated our rules on videos": {
        "title": "We've updated our rules on videos",
        "score": 22,
        "url": "https://www.reddit.com/r/southpark/comments/1b0kmtg/weve_updated_our_rules_on_videos/",
        "content": "Hello, r/southpark go fuck yourself\n\nTLDR: We updated our rules on videos to allow videos during the off-season and added a rule prohibiting self promotion. Piracy remains prohibited. I'd suggest reading the Q&A below.\n\nFor a very long time, many of you have asked us to revisit and reevaluate our rule that prohibits videos. It's the single largest reason posts are removed, and we're often asked if we will reconsider the rule. To be honest with you, the rule existed before I became a moderator, and prior to now, I was never in a position to reevaluate the rule. As a result of your feedback, we will now allow videos to be posted to the subreddit during the shows off season with a few catches.\n\nFirst and foremost, piracy remains prohibited (inline with Reddits TOS), and posting links to watch full episodes will still land you in Reddit jail.\n\nSecondly, we are prohibiting self-promotion of your own channels. Have a huge YouTube follow? We don't care. Have a small YouTube following? Guess what, we still don't care.\n\nThirdly, we will prohibit videos the week a special airs (14-days from airdate) to help control spoilers.\n\nWe will continue to monitor the subreddit and videos can still be removed for violating any of our other rules, however we feel our reassessment will be a happy medium between allowing videos and controlling spam. See below for our Q&A, and if you read this far, we're looking for more moderators so go ahead and send us a ModMail if you want to apply!\n\n-----------------------------------------------------------------------------------------------------------------------------------------------------\n\n**Q&A**\n\n-----------------------------------------------------------------------------------------------------------------------------------------------------\n\n**Q: What's the new rule on videos?**\n\nA: Videos are allowed during the shows off-season. To control spoilers, videos will be disabled for the week of the premier of any special.\n\n**Q: I have a YouTube/Twitch Channel! Can I promote it?**\n\nA: No, we do not allow self-promotion of any kind\n\n**Q: Woah I found this channel that streams South Park episodes for free 24/7! Can I post it?**\n\nA: No, piracy remains a violation of our rules, and we continue to have a zero-tolerance policy.\n\n**Q: When does this rule change take effect?**\n\nA: It starts right now! All rules prohibiting videos should be removed, so go for it!\n\n**Q: When will we stop allowing videos to be posted?**\n\nA: The day of the first episode premier of any season, videos will be turned off, and won't be turned on until 1 week after the airing of the last episode of the season. Additionally, starting on the airdate of a special, videos will be turned off for 7-days.\n\n**Q: Hey! My video was removed but you said you allow videos now, what gives?!**\n\nA: We will continue to remove low-effort shit posts, so your video was probably a low-effort shit-post.\n\n**Q: I created a fan-made episode/fan-made content, can I post it?**\n\nA: Yes, however we retain the right to remove any fan-made content. When we're talking about fan-made content we're talking about basically the fan-art of videos, so content that isn't about or does not use existing South Park clips, discussions etc.\n\n**Q: I have more questions, what should I do?**\n\nA: You should send us a Mod Mail. This Q&A will continue to be updated if we get additional questions from the subreddit.",
        "num_comments": 2,
        "comments": [
            "Hi u/The_32 please make sure your post has been flaired correctly! Check [out our post about our flairs here] (https://www.reddit.com/r/southpark/comments/1bybrof/new_and_updated_post_flairs/) THIS POST HAS NOT BEEN REMOVED\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/southpark) if you have any questions or concerns.*"
        ]
    },
    "Name a more iconic duo": {
        "title": "Name a more iconic duo",
        "score": 723,
        "url": "https://i.redd.it/bu814eslq08d1.jpeg",
        "content": "Oh boy! Wudda we gonna do, boss?!",
        "num_comments": 159,
        "comments": [
            "The Hardly Boys, those young whipper snappers!",
            "![gif](giphy|3oEjIa65PDHY1Cgdzi)",
            "![gif](giphy|3o7TKyTdzayTandNzW)\n\nJimbo and Ned",
            "Either Fosse and Bill, or…\n\n![gif](giphy|3o85xHi4t2UsuIY9QA)",
            "Timmy and Jimmy\n\nI mean c'mon!",
            "![gif](giphy|26BRKsjilkQBG3tUk)",
            "![gif](giphy|ZfAbamorlofzvpASws)\n\nUnderrated duo!",
            "Tweek n Craig! 💛💙",
            "Scott malkinson and diabetes",
            "Whale and dolphin",
            "Timmy and Gobbles",
            "![gif](giphy|3o6ZtaAci85xd5uxck)",
            "https://i.redd.it/00vzs8w7p18d1.gif\n\nRandy and alcohol.",
            "Saddam and Satan",
            "![gif](giphy|jpQF2kyCX83kIxe2S2)",
            "Stan and Kyle.\n\n![gif](giphy|l41lXS5zVQYVwF3Xi)",
            "Mimsy and the shark.",
            "Haha that's gay, you're gay.",
            "Kenny and death",
            "https://i.redd.it/gib73ygbz28d1.gif",
            "![gif](giphy|xTiTnDX1ttOSVp31pm)",
            "Mike and ike",
            "![gif](giphy|Caq9T2TvGj78c)",
            "Me and your mom\n\n![gif](giphy|5mxfrCSIfXTNK)",
            "Timmy and Jimmy",
            "Timmy and Jimmy",
            "JIMBO AND NED‼️‼️🗣️",
            "Mordecai and rigby",
            "Cartman and Butters",
            "Lemmiwinks and Wikileaks (more iconic duo rivals)",
            "Mimsssseyy",
            "ICONIC, I TELL YA",
            "Terrence and Philip",
            "SHUT UP MIMSY",
            "Dick Dastardly and Muttley from Wacky Races",
            "![gif](giphy|l2Sqh87FkbbXr5th6)",
            "Mr Hankey and towlie would be such a good duo",
            "Stan and Kyle lol",
            "Butters and Kenny",
            "Butters and Kenny",
            "None",
            "Tweek and Craig",
            "Nathan and Classi",
            "Cartman and Antisemitism",
            "\"Oh, we're CLEARLY the best duo, boss!\"",
            "Jeffery Dhamer and his picnic basket.",
            "They are hilarious, we shouldn't comment other names. They are the most iconic duo",
            "jimmy and timmah",
            "towlie and weed",
            "What happened to the big one?",
            "Iconic or moronic?",
            "How is no one saying Chinese Cartman and Butters? They literally saved the USA from a Chinese Invasion.",
            "Satan and Saddam.",
            "Satan and Saddam.",
            "You can’t",
            "Beavis and Butthead, Batman and Robin, He-Man and skeletor, Lenny and Carl, Hank and Peggy Hill, Eminem and Dr. Dre",
            "![gif](giphy|yNFfrkbiacOGxPqj2c)",
            "Timmy and jimmy",
            "Shuddup Mimsyyyyy",
            "Coon and Cthulhu",
            "The queef sisters obviously",
            "We need more of these two.",
            "Those two were a direct ripoff of [Rocky & Mugsy](https://warnerbros.fandom.com/wiki/Rocky_and_Mugsy), by warner bros",
            "My family and I quote “shut up mimsy “ often lol",
            "What episode was this I can’t remember and I loved it",
            "Towlie and Randy marsh",
            "Trey Parker and Matt Stone.\n\n\\*Mic drop*",
            "\"SHUT UP MIMSY!!!!!\"💀💀💀",
            "Jimmy and Timmay!!",
            "Harrison Yates and Mitch Murphy. I wish Murphy was used in later seasons. They stopped for some reason.",
            "Considering how they're still married.....\n\n![gif](giphy|3oEdv7ZLKEaqVtjDEs)",
            "![gif](giphy|DKznWTry3u9Q4|downsized)",
            "![gif](giphy|d1FKZzgoq8BzwOM8)",
            "Terrance and Philip \n\n(I probably fucked the spelling on this)",
            "Bill and Fosse",
            "Stan and Kyle?? 😭\nGarrison and Mr. Hat/\nClyde and skibidi toilet",
            "Chocolate and peanut butter.",
            "god damn it mimzy!!!",
            "is that the guy selling prime on the right? forgot his name",
            "Cartman and KFC bucket",
            "Mecha-Streisand and Neil Diamond",
            "Shutup mimsy....",
            "![gif](giphy|rCb0UGxDdsXHIVb5wV)",
            "Towlie and keyboard cleaner",
            "Mr. Garrison and Mr. Hat\n\n\nMr. Garrison and Mr. Slave",
            "[removed]",
            "Worst episode ever.",
            "Wanna-be-dictator Simba and Jelly Nala",
            "https://i.redd.it/1v538spd518d1.gif",
            "I actually really fucking hate these two, they insight a weird rage in me",
            "You never watched looney toons? Lol these 2 are parodies of the 2 mobsters",
            "Superman and Batman.",
            "Hi u/thejesusbong please make sure your post has been flaired correctly! Check [out our post about our flairs here] (https://www.reddit.com/r/southpark/comments/1bybrof/new_and_updated_post_flairs/) THIS POST HAS NOT BEEN REMOVED\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/southpark) if you have any questions or concerns.*",
            "I’ve got a raging clue!",
            "Mr. Mackey: Oh no. Not the god damn…\n\n[music plays]",
            "With a knack for solving mysteries",
            "![gif](giphy|uP3dNjAx05Uoo)",
            "Blimey",
            "You win.",
            "Damn you definitely got me on chefs parents. Succubus is my favorite episode.",
            "I gave him a dollar.",
            "Oh lawd, they didn't bring a victim-child...",
            "They are... cool as a fool in a swimming p-p-p-p-ooool.",
            "I’ve always been more of a villain apologist, myself.",
            "![gif](giphy|tcu9i8MMAc800)",
            "Taco flavored keeses",
            "I highly appreciate that when stan and kyle ditch, kenny still goes along for the ride.",
            "![gif](giphy|Eype7ZuMACU0ZkhntL)",
            "Haha that's gay",
            "Nice dou",
            "\"I'm Scoth Malthinthon and I hath diabethes.\"",
            "Chicken and cow",
            "Fuck-a you wrale and dophrin!!!",
            "You win.",
            "I’m not your buddy, guy!",
            "Good one",
            "![gif](giphy|3oEdvbkvdrXKGTac3S)",
            "Tweek and Craig",
            "cartmans mom is everyone's",
            "*Slaps* SHUT UP MIMSY!",
            "Hi Fruittinglesinspace, your post has been removed for potentially containing political discussion. Please familiarize yourself with our rules on politics found [HERE](https://www.reddit.com/r/southpark/comments/1c0q9vt/our_rules_on_politics_2024_edition/). \n\nIf your post is not political, feel free to message us [HERE.](https://www.reddit.com/message/compose/?to=/r/southpark) \n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/southpark) if you have any questions or concerns.*",
            "The haters are wrong",
            "WHO THE FUCK DOWNVOTED YOU?!?! OP didn't say to name a more iconic South Park duo. By golly, I'd say that you're right, and these downvoting doofuses are just a bunch of nimrods! Charlie and Pim will forever be an amazing duo!",
            "Me too. Mine's pointing this way. ☝️",
            "SHE gave him a dollar",
            "he’s down like a clown, charlie brown.",
            "https://i.redd.it/4qq0i5eys08d1.gif",
            "What episode is this?",
            "Yeah ahaha heh we're gay",
            "Hey, don't make fun of my diabetes!",
            "I'm not your guy, friend!",
            "![gif](giphy|3oEdv0C3SggkiTLX1u)",
            "Ooh, your gonna make me shoot Clue Goo all over the place",
            "And I said “WOMAN DONT GIVE THE LOCHNESS MONSTER NO DOLLAR”",
            "![gif](giphy|xTiTnDX1ttOSVp31pm)\n\nThe yaoi shit kills me everytime. The fuckin song!",
            "I’m not your friend, buddy!",
            "Just some Japanese guy singing in a karaoke bar.",
            "The fractured but whole collectibles and their  ultimate 😍",
            "Tweaku craigu",
            "_The book of love has music in it_",
            "Im not your buddy, guy!",
            "We must hold Tweek and Craig to the HIGHEST HONOR\n\nGAMBARO IRASHAI",
            "I'm not your guy, friend!"
        ]
    },
    "Kenny cameo ": {
        "title": "Kenny cameo ",
        "score": 959,
        "url": "https://i.redd.it/9qejia8lzz7d1.jpeg",
        "content": "Y'all can't tell me that isn't Kenny. Pretty strange considering how much Matt and Trey hate Family Guy. ",
        "num_comments": 89,
        "comments": [
            "Turns out that Seth Macfarlene, creator of Family Guy, actually liked the episode and said he could take a joke, even if it was a whole two parter episode.",
            "Oh my goodness Brian!  Someone murdered Kenneth!",
            "“Hey Lois, remember the time Brian and Stewie were Victorian era detectives who had to solve Kenny McCormick’s murder?”",
            "![gif](giphy|WieqsBQwFzOy4)",
            "D'Oh",
            "Which episode?\n\nAlso I sort of see Seth as being the “they can hate me if they want, their shit is still funny though” sort of guy.",
            "Manetees at Fox \"London... Halloween Costumes... Kenny\" Skid: Remember the time when we found Kenny dead.",
            "You actually think it’s up for debate whether that’s Kenny not? Whose saying that isn’t Kenny lmao",
            "Must’ve found those new idea balls.",
            "Plot twist: THEY killed Kenny and they were trying to hide their crime by disguising as detectives and finding his course.\n\nThey did it as revenge on the kids for criticizing their rapid-fire gags.",
            "This is specifically from \"The Wacky Molestation Adventure\".\n\n&#x200B;\n\nhttps://i.redd.it/bdhpzioly28d1.gif",
            "Damn I love this.",
            "If that was Kenny there would be rats! This is an imposter, and I for one am glad he's dead!",
            "Why did Kenny agree to that?\n\nSouth Park hates Family Guy. Just saying...",
            "I guess one of the manatee balls said “Dead Kenny”",
            "Why would Matt and Trey hate Family Guy?",
            "just watched this episode for the first time a few days ago, funny seeing someone post about it here so soon after",
            "I thought Brian was supposed to be Hitler smh",
            "Hi u/Blood_Oleander please make sure your post has been flaired correctly! Check [out our post about our flairs here] (https://www.reddit.com/r/southpark/comments/1bybrof/new_and_updated_post_flairs/) THIS POST HAS NOT BEEN REMOVED\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/southpark) if you have any questions or concerns.*",
            "It's not Kenny",
            "that's not kenny",
            "Yeah, he was only a bit upset that they insulted his writing team, which you know, fair enough, nice to see a guy stand up for his crew.\n\nOther than that he was pretty cool, even supposedly had them cut out a cheap joke calling Matt and Trey gay.",
            "I mean, it’s pretty obvious he can take a joke. There’s multiple jokes in Family Guy about his other roles in movies",
            "At one point he said they could go to hell and said it was because they said his writing team didn't work hard enough.",
            "When? I remember seeing a clip of seth saying something along the lines of ”fuck those guys” when trey and matt were mentioned",
            "Those rapscallions!",
            "Those bastards!",
            "You Blaggards!",
            "“You think *that’s* bad? Remember the time some South Park kid’s corpse got teleported to our show?”",
            "That’s them alright…",
            "“I hate family guy!”",
            "Cartoon Wars pt. 1 & 2. It's banned bc of Muhammad but you can find it at https://www.southparkuncensored.com/",
            "Have you heard of the episodes Cartoon Wars Part l and Cartoon Wars Part ll?",
            "Definitely Kenny, lol",
            "How is it not lmao. Actually it is Kenny.",
            "Yeah it is.",
            "I'm confused. How did they insult the writing team? Did they remove some items out of their idea tank?",
            "Don’t forget in Ted when he says he doesn’t sound like Peter Griffin",
            "I get your point but making jokes about yourself is not the same as taking a joke. I had an ex friend a few years ago,  bigger guy, that would constantly make jokes about his weight. If you joked about it to him he would quickly get violent.",
            "Not sure how I never noticed that. I was just talking about those earlier today, too, because the second part is the episode that Pip perma-died in. \n\nThanks!!\n\nedit: disregard. I was confused. Not the same ep.",
            "Currently watching, and laughing.",
            "They aren’t cartman tho. Nobody’s supposed to be cartman. That’s the whole point of cartman being the dick he is. You might be able to say they think it’s distasteful because of kyle’s mutual dislike of it but that’s about it considering even kyle came around to give a speech about how important shows like family guy are and that jokes are jokes and should be allowed regardless of religion. \n\nYall make me question your media literacy with comments like these.",
            "Kenny's family is poor.  I would be willing to bet they got that jacket at Walmart or Kmart.  Do you realize how many other poor kids probably have that same exact jacket?  The odds of that being Kenny are extremely low. Not to mention Brian and Stewie live in Rhode Island.  Kenny lives in Colorado.  The odds of that being Kenny are now astronomical.",
            "Nope",
            "Nope.  Couldn't possibly be him",
            "nuh uh",
            "It's not just seth writing the show and matt and trey specifically insulted the writing",
            "Nah, that was 200 and 201. Different 2-parter.",
            "If you did even a little bit of research you’d find that they do, in fact, despise Family Guy. The best they’ve said about it is that they don’t want it to be taken off the air (also Kyle didn’t have a mutual dislike of it in the episode).",
            "Lol",
            "Holy fuck, talking about impossibilities in the cartoon? Are you serious? We're where you when south park was sending an orca to the moon?",
            "you’re so confidently wrong",
            "🤓",
            "Yeah, my bad. I was confused",
            "I mean feel free to throw those links in but the comment i replied to specifically used the cartoon wars pt 1 and 2 as evidence of the claim. It is not viable evidence. \n\nIt is not on me to support someone else’s claim via research. it’s on them to be verifiably correct when making such statements as fact. You came here with a rebuttal and zero evidence. Why?",
            "I'm just saying if you're going to be like Holmes and Watson there, you'd better do a proper investigation",
            "I guess you can't detect sarcasm",
            "Bro needs to touch grass",
            "If you insist \n\nhttps://youtu.be/lwSaVK1PvEg?si=yBM3Fb1u1BwWIRA3\n\nAs for Cartoon Wars being evidence, Cartman isn’t the only part of the episode that criticizes Family Guy. The whole Manatee bit obviously isn’t meant to be positive. Even still, what Cartman says about his humor compared to Family Guy’s is pretty on the nose. Cartman was likely used to represent them in this one instance due to him being the face of South Park.",
            "You do know this is the South Park subreddit, right? I don’t think many people here care about variably correct research here",
            "Lol",
            "I don't care lol",
            "I do?",
            "Absolutely not a touch of sunlight has ever been in contact with his skin",
            "I mean interpret how you want but actual words from them is what i asked for and you provided. I appreciate the link.",
            "That's an interesting listen, I like Family Guy but it's very much because it's \"turn your mind off a bit gag-filled humor\" that scratches a particular itch (and that certainly wouldn't work in SP or Simpsons).\n\nIf you go back and watch the earlier seasons, the density of well-executed pop culture references as part of that is actually somewhat impressive.\n\nHowever--I originally stopped watching Family Guy around 2011. Not because I stopped liking it...I just stopped watching. I've tried to watch the whole series from the beginning a few times on Hulu.\n\nEvery time, I just stop somewhere during seasons 10 to 12.  It somehow became something I wasn't interested in, and that's already past the phase where Seth MacFarlane has admitted he had burned out on writing the show.\n\nI've seen bits and pieces of later seasons in syndication. I like them well enough for the most part. I just don't go to the effort of watching them all. (EDIT: TBH, the same thing happened for me with The Simpsons)",
            "You equating the sub with your own lack of standards is* your own problem dude. What are you even saying? That the sub is too stupid to know fact from feeling? That’s a bold assumption. Probably not wrong, but damn if it ain’t bold.",
            "You're so confidently sure I'm being serious",
            "[Is this good enough for you?](https://youtu.be/lwSaVK1PvEg?si=80MX6_AkJnyY5SC1)",
            "My point since the beginning was that Matt and Trey aren’t fans of Family Guy and they’re not hiding it, mainly in Cartoon Wars l and Cartoon Wars ll and I’m pretty sure it’s not hard to see their thoughts on Family Guy in those episodes",
            "And again that one episode the displeasure with family guy came from cartman. Who is not their voice. If you have actual article where they can be quoted as saying so then feel free to share. As is, it’s a bad inference.",
            "[first 25 seconds, “we do hate family guy”](https://m.youtube.com/watch?v=lwSaVK1PvEg)",
            "you’re so weird dude lol why even keep responding"
        ]
    },
    "Poor guy doesn’t deserve it": {
        "title": "Poor guy doesn’t deserve it",
        "score": 851,
        "url": "https://i.redd.it/q97mwoh4mz7d1.jpeg",
        "content": "",
        "num_comments": 39,
        "comments": [
            "https://i.redd.it/ph5mo8zxyz7d1.gif",
            "\"Well yeah, and I'm sad, but at the same time I'm really happy that something could make me feel that sad. It's like, it makes me feel alive, you know? It makes me feel human. And the only way I could feel this sad now is if I felt somethin' really good before. So I have to take the bad with the good, so I guess what I'm feelin' is like a, beautiful sadness. I guess that sounds stupid.\"",
            "https://i.redd.it/5m3crgstb08d1.gif",
            "Butters deserves so much better imo",
            "He is **GROUNDED**, mister!!",
            "The episodes where it's just Cartman stringing Butters along for the whole thing are a bit tougher to watch than other episodes, not gonna lie.",
            "I mean, he does get the last laugh.  Everyone drank his cum ....",
            "Cartman: “Dont get any closer or I shoot butters” still has me dead",
            "Butters needs a proper villain arc",
            "Somehow Butters seems to be the most mentally stable of everyone on the show. He's the only one that never seems crazy to me.",
            "Good Times with Weapons is difficult for me to watch.",
            "![gif](giphy|ysxU8m9xfctGgVtoWo)",
            "I don't know, Ke'eki got pretty pissed about stupid Ben Affleck.",
            "They don’t need to bother…",
            "![gif](giphy|u252DbxcPsbfUEfO8k)",
            "Hi u/wmcs0880 please make sure your post has been flaired correctly! Check [out our post about our flairs here] (https://www.reddit.com/r/southpark/comments/1bybrof/new_and_updated_post_flairs/) THIS POST HAS NOT BEEN REMOVED\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/southpark) if you have any questions or concerns.*",
            "He totally deserves it, he's a terrible son.",
            "Nah fuck butters. His parents deserve to die slowly tho",
            "His dad had that coming",
            "Deserved.",
            "Great quote!",
            "I was in a deep depression after a break up and this aired not long after. This quote help pull me back up. For that I have a special appreciation for Butters.",
            "You cannot ground the UNGROUNDABLE!",
            "I'm still wondering how Randy recognized the taste of it",
            "Professor Chaos?",
            "Too bad it didn't happen in the The Ungroundable episode.\n\nHis dad flipping off about the Hamburger Helper warranted a good thrashing. I had never wanted to throw a punch thru the TV more than when watching that episode.\n\nhttps://i.redd.it/69zsnh53s28d1.gif",
            "It’s got a distinctive grapey, bleachy flavor",
            "And so quickly. Like it took nearly no thought.",
            "That was more of a cartoon villain. I was thinking more along the lines of a Cartman esque villain",
            "I'd say that butters dad deserves that kind of shit every episode",
            "That paints a very vivid picture",
            "I think he might've had prior experience",
            "It’s a quote from the episode lol",
            "Oh shit I completely forgot about that"
        ]
    }
}