{
    "Welcome to /r/sports!": {
        "title": "Welcome to /r/sports!",
        "score": 40,
        "url": "https://www.reddit.com/r/sports/comments/1bfpxfw/welcome_to_rsports/",
        "content": "[View Post](https://sh.reddit.com/r/sports/post-viewer/1bfpxfw)",
        "num_comments": 21,
        "comments": [
            "[removed]",
            "  ☹️🥳🤠🇧🇴🙂‍↕️",
            "[removed]"
        ]
    },
    "Oilers Beat Panthers to force a Game 7": {
        "title": "Oilers Beat Panthers to force a Game 7",
        "score": 2153,
        "url": "https://www.thescore.com/nhl/news/2929870",
        "content": "",
        "num_comments": 265,
        "comments": [
            "[**Join Our Discord Server!**](https://discord.gg/233aU5q)\n\n**Welcome to /r/sports**\n\nWe created a Discord server for our community and would like to invite all of you to join! You'll be able to discuss sports with users around the world and discuss events in real time!\n\nThere are separate channels for many sports you can opt in and out of, including;\n\nAmerican Football, Soccer, Baseball, Basketball, Aussie Rules Football, Rugby Union and League, Cricket, Motorsports, Fitness, and many more.\n\n[**Reddit Sports Discord Server**](https://discord.gg/233aU5q)",
            "This is going to be a generational choke if Edmonton pulls it off. Blowing a 3-0 lead in the finals will be clowned for decades",
            "This is all Greg's fault.",
            "Cant beleive Florida would throw 3 games in a row just to win it in 7 at home.",
            "So either the Oilers pull a Toronto and lose G7 after coming back, or they win and pull a Toronto since Toronto is the only team to come back from 0-3\n\nEdmonton is the new Toronto",
            "Oil Country is electric",
            "Canada might actually burn to the ground if Edmonton manages to win this",
            "Regardless of what happens at this point heartbreak is certain to happen",
            "McJesus becoming McGod.",
            "I'll be the first to say that 10 days ago, I thought this series was over. Edmonton has shown a lot of heart, and here we go......game 7!",
            "I’d be stunned if Edmonton lose Game 7. McDavid has reached Crosby levels of refusing to let his team lose. I fully expect a masterclass from him game 7.",
            "Oil me up daddy",
            "Boobs",
            "No way the Oiler’s lose now. Florida can’t recover from this, swing historical momentum back their way in one game. It’s fucking ovaaaa",
            "LFG Edmonton!",
            "Nothing will make me happier than the Oilers denying the Leafs the glory of being the team to bring the Cup back home to Canada.",
            "I am not even remotely a hockey fan and I am SO GOD DAMN EXCITED for game 7.",
            "Like wow the Zombie Oilers sucked the start of the season, made it into the playoffs, and are now 1 win away from Cup.",
            "Panthers turning into pussy cats.",
            "Hey man, Canada has not had the cup in over 30 years. I kind of hope they actually get the cup this time. It’s been painful to watch them lose in the semis and finals for decades.",
            "Every Calgary Flames fan in shambles (myself included)",
            "Wow, how often has the NHL's season ended after the NBA's?",
            "My Lightning are hoping they choke",
            "Man this would be big for Canada. I’m rooting for y’all!",
            "Doing what the Mavericks couldn't",
            "I’ll definitely miss the “Batman won’t let a Canadian team win the cup” memes, but I absolutely hate the cats and need them to lose",
            "Thanks Greg Cote",
            "Go back a couple decades and that headline would confuse a ton of NFL fans.",
            "As a Yankee fan who had to walk through this in the 2000’s I wish the Panthers luck.",
            "LETS GO OILERS",
            "Canada rising",
            "Daaaaaaaaaaaannnnnnn.\n\nThe oilers.\n\nAre back.",
            "Damb the Panthers are about to get Lebron’d",
            "Ladies and gentlemen we finally have a series",
            "Florida just not up to snuff precisely after that high Drasaitl hit on Barkov.  There is a before and after.",
            "Can't believe it! Game 7 is going to be epic! Go Oilers!",
            "Hate both teams but the Stanley Cup deserves to come home to Canada for once.",
            "Florida will be playing with a tight asshole.\n\nWhat a comeback by Edmonton…",
            "It’s a Greg and Dan’s fault",
            "Jesus Florida really shit the ice!",
            "And then the Oilers are going to turn around and sign their big three to contract extensions. They’re gonna eat at 40% of their salary cap. This isn’t the NBA you have the field an entire team.",
            "“Oilers Outlast Panthers”? 5-1 is a shellacking, a beating, a mauling, a blowout, a…",
            "Oil always rises to the top",
            "Now we just need overtime. Only happened 2 times in the SCF. both won by Detroit.",
            "As a [Bills](https://www.msn.com/en-us/sports/nhl/oilers-coach-trolls-buffalo-bills-teasing-historic-failures/ar-BB1nF2kF) fan who doesn't watch hockey, let's go Florida!\n\nAs a Bills fan, I now have to go throw up for rooting for Florida.",
            "A perfectly Florida outcome if ever I saw one.",
            "The only time it's been pulled off was in the 1942 cup. Leafs went down 3-0 and came back against the wings.",
            "Live by the hot goalie, die by the cold goalie. The rest of the team isn't helping him out though",
            "Has there ever been a choke like this in modern era of sports? I think of the 2004 Red Sox but I can’t think of anything else. Maybe the Falcons blowing the lead against Tom Brady?",
            "Multi-generational. A successful comeback from a 3-0 series deficit has only been achieved *five* times in major American sports history, and only *one* time on the grandest stage (league championship finals.) \n\nIf Edmonton pulls this off, it would be only the second time *ever* that a team has come back from 3-0 in a championship series and the first time doing so *since 1942* across all major American sports.\n \nThrow generations out. Based on history, it would literally be a once-in-a-lifetime event.",
            "It's the new 28-3.",
            "Go Canada",
            "Imagine if the heat would’ve blown the 3-0 last year to the Celtics. Kinda crazy already we have 2 Florida teams be taken to a game 7 after being up 3-0 in 2 separate sports but man back to back blown 3-0 series would’ve been absolutely insane",
            "I for one will howl with absolute pleasure if that happens. As a Bolts fan, I already conceded they won the cup after game 3. Sweep? Well, that was quick. In 5? Figures. In 6? At least Edmonton showed something. Now? There is no alternative.",
            "Especially against a Cory Perry team",
            "Phuck Phlorida \n\nI hope they are forever synonymous with choking",
            "the canucks did it in 2011. I Was at the game, and the riot that followed... havent watched hockey since, funny thing is now I live in Edmonton.",
            "The real jinx was Mike's disapproval and the hesitation to put up the billboard. We had them scared, and now we're scared. Mike's fault.",
            "He is getting flamed in his twitter account something fierce.",
            "Gotta feel bad for Roy in this.",
            "Florida ^^^gentle Mans sweep!",
            "More tickets sold, good for business.",
            "It sure seems like they did. Were they even wake for the first half of the game?",
            "Didn't the flyers do it to the bruins like 10 years ago?",
            "Me: Mom, can I have Toronto?\n\nMom: no, we have Toronto at home\n\nToronto at home: Edmonton",
            "As an oilers fans, this is the most cursed take.",
            "Edmonto?",
            "Well all I heard at the beginning of the season was that mcdavid was going to force a trade to Toronto so I guess the fan fics of Toronto fans came true",
            "Leafs wish they could make the finals",
            "Don't curse em like that",
            "They have to take the lead in game 7, blow it, and lose in OT to be like Toronto.",
            "Weren’t the leafs the only team to come back down three to win it all?",
            "I read this and thought.   Oh I wonder if they have oil in Edmonton’s and then i remembered the team was named the Oilers and felt pretty dumb haha.",
            "This is such a Simpsons headline hahah",
            "Or Edmonton will\nBurnt to the ground if they lose",
            "Meh, Florida will go about their lives af if nothing happened if they lose. There will be a rash of suicides if Edmonton loses. Bit different.",
            "If florida manages to finish the job, the 2017 Vancouver riot is going to look like a girl scout jamboree. ",
            "^[Sokka-Haiku](https://www.reddit.com/r/SokkaHaikuBot/comments/15kyv9r/what_is_a_sokka_haiku/) ^by ^WrongMomo:\n\n*Regardless of what*\n\n*Happens at this point heartbreak*\n\n*Is certain to happen*\n\n---\n^Remember ^that ^one ^time ^Sokka ^accidentally ^used ^an ^extra ^syllable ^in ^that ^Haiku ^Battle ^in ^Ba ^Sing ^Se? ^That ^was ^a ^Sokka ^Haiku ^and ^you ^just ^made ^one.",
            "It’s funny because he didn’t even get a shot or a point this game. Five depth guys got five goals. And the goalie got an assist",
            "McAllah, McBuddha, McDawkins.",
            "He died and rose again after three games.",
            "Imagine if he saved the thrashing for this game to break the points record? Crazy thing to even feel it is possible with McDavid.",
            "The full McHoly McTrinity",
            "I suppose this counts as rising from the dead",
            "He was quiet last night. Draisaitl made an appearance finally with a sic dime on the first goal (I think)",
            "So, since McGod just means son of God, McJesus is becoming… Jesus?",
            "McOverrated, and Ya Know It",
            "They do have the momentum of winning 3 games back to back",
            "Name checks out",
            "St Louis Blues type run",
            "Don't forget the crazy long win streak during the regular season",
            "The Panthers have never won a Stanley Cup.",
            "And in that span of course the Vegas Golden Knights have even won. \n\nLet’s not forget the Quebec Nordiques, who had never won the Cup going back to the ‘70s, pack it up in 1995 and move to Denver and *win the Stanley cup their first year outside Canada.*",
            "I just wanna see Corey Perry lose in the finals for the fourth time in five years.",
            "As a Red Sox fan.... Go Oilers!",
            "There was no season in 2003.",
            "Still til this day, it's like out of all the combination of teams that'll even have a 3-0 comeback like this, it still amazes me its the Red Sox beating the Yankees of all people in how it happened. Like you could not get hollywood to script something as rigged as that after all the storylines and build up behind that series.",
            "As another Yankee fan, no.",
            "Not if you were a Jets fan in the 80s. You never want to see Edmonton win another cup.",
            "So what , a championship is worth it",
            "Was 3-1 with two empty netters",
            "A fucking he'll of an outlasting",
            "Leafs fan here. Hold my beer",
            "This is the same state that brought you a dominant regular season Tampa Bay team getting swept in the first round by Columbus. Tampa made up for it in a big way but people don’t forget. I like to think this is the Panthers “hold my beer” moment to Tampa.",
            "to add to this, the last time a team in **any** of the major sports came back from being down 3-0 to 3-3 in the Finals were the '51 Knicks (they lost game 7 however).",
            "Seems like a great year to update that stat!",
            "Federer with 2 match points in the Wimbledon Final\n\n1999 Champions League Final with Bayern giving up 2 goals in extra time to lose. \n\nCouple of good contenders",
            "Pats over the Falcons in the super bowl\n\nCavs coming back 3-1 against arguably the best team ever in GSW. \n\nPats blowing their undefeated season against the giants?\n\nLiverpool over Barcelona in 2019 going down 3-0 in the first match.\n\nBarcelona over PSG (La Remontada). Gave up 3 goals in the dying minutes of the second match.\n\nedit: Drafting Penix at 8th?",
            "Not the finals, but the Bruins were up 3-0 on the Flyers in the 2010 playoffs and got reverse swept. If I remember correctly, they also took a 3-0 lead in game 7 before losing the game 4-3.",
            "To me  it is the Falcons SB choke . Also I think  football , soccer and basketball finals should be considered different because they involve a clock , while in baseball in each inning it is theoretically possible that a team could come back from any level of deficit.\n\nIt took a special amount of incompetence for Atlanta to blow that lead with the timing remaining in the game",
            "World cup Brazil vs Germany 7-1 was in 2014.",
            "Falcons “blowing the lead” - isn’t exactly how I remember it. More like TB12 and Company got pissed",
            "That’s what generational means",
            "The Leafs had home ice advantage in 1942. The Oilers do not.",
            "I’m a casual hockey fan but tbh this seems way more awful. Losing 4 straight games is so much worse than crumbling a lead against Tom “7 rings” Brady imo",
            "You can cuss on Reddit",
            "Huh?  The Canucks didn't have a 3-0 lead in the finals.  They did in the opening round and almost blew it, but won that.",
            "Not in the finals they didn't.",
            "I was working in a bar at Richards/Hasting showing the game when the riots happened in Vancouver, and live in downtown Edmonton now. Very much dreading every game’s outcome lately.",
            "Who?",
            "Marge Schott somewhere warm saying “now THIS is my kind of team”",
            "In the second round. Until tonight, only the Leafs (1942 vs Detroit) and Wings (1945 vs Toronto) have forced a seventh game after trailing 3-0 in the Final, and only the Leafs won the seventh game.",
            "Not in the cup final",
            "I think OP is meaning in the finals.",
            "Yeah, but it wasn't the finals.  They also won the Cup the next year and swept the Flyers to get there.  So that helps mask the pain.",
            "Bruins won the Cup in the next year and it also wasn't in the finals.",
            "Feeling lonely and suffering from cup paucity related ED? Ask your doctor about Nujarraxx from Edmonto today.",
            "The Italian part of Edmonton",
            "We haven’t won it all since McDonald’s opened its first store in canada",
            "By the Flames?",
            "*please Florida, hockey is all we have*",
            "Edmonton is dealing with house money after going down 3-0. They're fine.",
            "!goodbot",
            "Thats the real headline, if the Oilers won without [McJesus being McJesus](https://youtu.be/Vednj6iNVJU?feature=shared) then they are truly worthy of bringing the cup back to Canada.",
            "The slashing penalty he took saved an almost certain goal for the panthers.",
            "He’s clearly saving his best for game 7.",
            "In what a way? Do you have different stats than everyone else?",
            "I'm not a big hockey fan but from what I've seen they didn't just win back to back to back games they dominated back to back to back games",
            "16W in a row",
            "In all of their storied history???",
            "A Canadian team not winning in 30 years is a bigger deal.",
            "No team in a whole country, vs. one team for one state.",
            "No one cares",
            "Someone trace the MFs IP address!",
            "You know it might’ve just been my imagination.",
            "It really did push us into the evil timeline because Boston won a couple more championships and a Brady dynasty all of which Boston will never let us forget.",
            "Suck it Hawerchuck!  It was great if you were an Oilers fan in the 80s.",
            "You need to make it to the finals before it will be this serious.",
            "That request comes up a lot in Toronto",
            "The last hockey team to win the finals after starting 0-3 was the maple leafs in 1942!",
            "Buffalo Bills fans are, like, have you done that four times in a row? No? Call me when you do.",
            "I'm not at all a Tampa fan, but I'm pretty sure their back to back Stanley Cups and a 3rd straight finals appearance have caused the average fan to forget about the first round loss to Columbus 5 years ago lol.",
            "~We don’t have any words and we know you don’t want to hear them~",
            "of course we did",
            "In classic Knicks fashion",
            "2004 Red Sox would like a word ",
            "Celtics did it against the heat in the 2023 Eastern conference finals\n\nhttps://www.nba.com/playoffs/2023/east-final",
            "Hockey in Miami is an abomination. This would be be a course-correcting move",
            "Milan giving up 3 goals in the 2nd half to lose to Liverpool by penalties is also a big one.",
            "All good examples, but for me, it's the Falcons loss.  \nAs a Spurs fan also, They took the Cavs in 4.   \nI just like reminding people about that.",
            "Barca PSG was immediately what I thought of. Even crazier due to the away goals phenomenon at the time.",
            "Didn't the Panthers do that to the Bruins in the first round of the playoffs last year?\n\n*Edit:* Nope. Boston was up 3-1, with Florida winning the 2nd game. What made it so bad for Boston and almost as bad as being reverse swept is Boston set the NHL regular season wins record and won 8 straight going into the playoffs. Florida was a wild card team.",
            "Kyle Shanahan learned a lot that day, and then reapplied those mistakes two times he’s taken the Niners to the postseason.",
            "That wasn’t a choke, that was a determination to ignore modern soccer trends and tactics",
            "How was that a choke?",
            "I'd imagine most people use generational to be a unit of time between generations, typically 20 years, and a lifetime to be the unit of time for a typical living person, 80 or so years. Definitely not the same thing.",
            "Along the same lines, the Knicks nearly reverse swept the Rochester Royals in the 1951 NBA Finals, but dropped game 7 on the road. \n\nThe only reason I think Edmonton might not reverse sweep is because they’ll be on the road for game 7, and Florida has played much better at home (their only good road game was 3).",
            "Exactly, as a Pats fan I rightfully admit Brady couldn't do that same comeback again if he tried 5 more times. They got astonishingly lucky and needed to have a multitude of things in sequence go their way. Just one of those things go wrong and they lose that game. So letting Tom beat you when he's got a potion of luck is certainly not a great look, but not indicative of collapsing time and time again in a 7-game series.\n\nI do think the Yankees in the '04 ALCS still takes the cake even if the Panthers choke here. On paper that team was insanely stacked, and had the Red Sox down to their final out with the greatest closer of all time on the mound.",
            "Not when you could’ve run the ball 3 straight times and kicked a field goal",
            "Yeah I was managing Cinema on granville. We got everyone out. Locked the doors, then drank our sorrows away and watched the show go by. Edmonton has a way different layout... there arent going to be 100,000 people concentrated in one area like vancouver. ",
            "Greg Cote. Miami sports reporter and Dan Le Batard regular. He wrote an article criticizing Mcdavid and then doubled down on the Le Batard show. Angered most of Canada... Lol",
            "The 1945 Wings (and 1951 Knicks) both forced game 7s, but both failed to complete the reverse sweep by losing game 7 on the road. The 1942 Toronto team completed the reverse sweep at home.",
            "Olive Garden?",
            "The flames of mad oiler fans",
            "Florida might have 9 professional sports teams but hockey is all we have too.",
            "Don't think you've ever met an Oilers fan, but okay.",
            "Hooking",
            "That was such a good penalty to take.",
            "The Blues went on a franchise-record 11 game win streak shortly after being in last place in 2019. History checks out. St. Louis also rallied around a little girl with cancer. Now, every last place team that goes on to make the platlyoffs is going to have one.",
            "The Boston Bruins lost the Florida Panthers in the 2nd round. I doubt any Boston fan is rooting for the Florida Panthers now.",
            "bos fan here but the crazy thing to me about that ‘04 sox team is that… they weren’t really that good? i mean, they had some A-list players, but every player on the team performed way over expectations to make that come back happen. and then they had so much momentum they swept the Cards, who, on paper, were really really good. \n\nfelt kind of like a destiny thing. derek lowe turned into a greek god and johnny damon was odin to make that shit happen…. maybe schilling sold his soul to the devil and that’s why he turned into such a massive piece of shit",
            "Shit it took all the real people going to fight in WW2 for the leafs to win a cup?",
            "Boy I love losing Super Bowls.",
            "Yeah, it wasn't exactly a rough ride after that.",
            "In the finals — the Red Sox reverse swept the Yankees in the ALCS, but swept St. Louis in the World Series.",
            "Those aren’t the finals",
            "Red sox did it to the yankees in '04, but that wasnt the finals either",
            "This is a correct take.",
            "in expectations.",
            "I don't have children, but I'm pretty sure you just die when they're born... kinda like salmon.",
            "Yankees choking is way worse. At the time the yankees had made 6 world series appearances in 8 years winning 4 of them.",
            "nothing will ever beat the Falcons 28-3 Super Bowl Choke .. nothing\n\npay no attention to my username",
            "Thanks!",
            "That team won 98 games, led the majors in runs scored, batting average, slugging average, OPS, on-base percentage and total bases. Ortiz and Manny won silver sluggers and those two along with Schilling made the All Star game. That team was an offensive juggernaut. Curt won 21 games and Pedro 16.",
            "Might not be for Florida either but it was pretty rough for Tampa in the moment, that’s the moment Florida is in right now.",
            "Well ok good point, but that playoffs basically was the finals (seeing as St Louis got swept). ",
            "Hard to argue that isn't subjective (even if like me you disagree).",
            "No. He mentioned it is the east conference finals, which is exactly what was linked. Proving his statement.",
            "that one series washed away 100 years of boston fans' bitter tears. it was amazing how transformational it was.",
            "They made 5 WS appearances in that time but your point still stands.",
            "yeah you’re definitely right, i am under stating how talented they were. the line up was nuts and they had 2 A caliber starters like you’re saying. \n\ni think the circumstances of the ALCS just made them feel like the underdog, when they really weren’t — they just dug themselves a huge hole and were so talented they were able to steamroll out of it. \n\neither way, crazy run",
            "Not sure how you can compare 0-4 in FIRST round vs blowing a 3-0 lead in the FINALS but ok",
            "How is that possibly subjective? It's objectively not the final round",
            "But the original comment referenced \"the Finals\", which is referring to the last round of the playoffs. The conference finals are not the last round of any playoffs",
            "You aren’t wrong about them being underdogs. They won 98 games only to finish 3 back from the Yankees for the division crown. Rivera set the saves record that season too.",
            "You know what the opposing argument is. \n\nIf you want to continue to feign ignorance someone else can reply to you.",
            "i gained a lot of respect for Rivera the next year when during the ring ceremony, which they did when the Yankees were at Fenway, he laughed and played along when the crowd cheered for him sarcastically. i guess it’s easy to laugh it off when you’re that good and just had one outlier postseason though!",
            "Opposing argument to what? The definition of subjective?",
            "Sigh...one could consider a conference final, a final...duh. \n\nIt's so obvious that I am objectively retarded for dignifying you with a response."
        ]
    },
    "US Olympic and other teams will bring their own AC units to Paris, undercutting environmental plan": {
        "title": "US Olympic and other teams will bring their own AC units to Paris, undercutting environmental plan",
        "score": 4257,
        "url": "https://apnews.com/article/olympics-air-conditioning-paris-0f753df91956f3fe61ad4febaff0ebb9",
        "content": "",
        "num_comments": 641,
        "comments": [
            "[**Join Our Discord Server!**](https://discord.gg/233aU5q)\n\n**Welcome to /r/sports**\n\nWe created a Discord server for our community and would like to invite all of you to join! You'll be able to discuss sports with users around the world and discuss events in real time!\n\nThere are separate channels for many sports you can opt in and out of, including;\n\nAmerican Football, Soccer, Baseball, Basketball, Aussie Rules Football, Rugby Union and League, Cricket, Motorsports, Fitness, and many more.\n\n[**Reddit Sports Discord Server**](https://discord.gg/233aU5q)",
            "No A/C in the middle of August in France?",
            "the environmental plan is kind of pointless when you have thousands of people flying to Paris to either watch or participate in the games.",
            "Paris is hella hot in the Summer.\n\nGood plan.",
            "Checkmate, Frenchies!",
            "WELL I'M PROUD TO BE AN AMERICAN, WHERE AT LEAST I HAVE AC. AND I WON'T FORGET THE BRITS WHO DIED, IN THE HEATWAVE OF '03. AND I'LL GLADLY SIT DOWN IN MY ROOM, AND ENJOY THAT SWEET COLD AIR. THAT HOT HOT SEETHE AND EURO COPE GOD BLESS MY FRIGIDAIRE",
            "The CO2 equivalent of running a portable air conditioner all day every day for every athlete is like 1/20th the amount of CO2 of all the athletes just flying to the Olympics.\n\nIt’s such a small thing in comparison to all the other emissions it seems like the French are using it as an excuse to try and gain an advantage.",
            "I hope the US brings 220v units.",
            "They should bring their own beds too so they don't have deal with the cardboard nonsense. I'm 100% on board with doing what we can to protect the environment, but the plans that Paris is putting forth are just plain stupid.",
            "The air quality in the Seine valley is awful on most days, let alone in the middle of August. Even if you don't account for heat, this makes perfect sense due to the pollution alone.",
            "Some people can’t sleep when its warm. And sleep is very important.",
            "I mean, if Paris ain't providing them in the *heat of August* and they don't have a comparative alternative aside from, \"just deal with it lol\" then that's on Paris.",
            "Because flying hundreds of thousands of people from around the worlds is good for the environment",
            "Olympics are a massive waste of global resources anyway, and they say that AC is gonna be the straw that breaks the camel’s back? Nah, f that. I say set it at 65 degrees Freedom.",
            "> US Olympic and other teams will bring their own AC units to Paris, undercutting environmental plan\n\nWe have the technology to make ourselves not feel warm or hot.  We've had that technology for a very long time.  The refrigeration cycle is not a futuristic/science fiction invention.",
            "An environmental plan would be to say -“we built enough renewable energy things to make the event carbon neutral, and after the games we can keep using it! \n\nOf course the spiteful French could always limit the current draw to certain units with small diameter wiring and low amp fuses!",
            "The stupid thing is most hotels in Paris have AC. So it’s not really saving the environment when hotels are at 100% capacity and everyone is cranking them because it’s miserably hot out.",
            "I would love a high of 79F atm!",
            "Good for them. No athlete should have to suffer because Paris doesn't keep their facilities at reasonable temperatures.",
            "Does anyone know what kind of ACs one can bring on a flight? Asking for a friend…",
            "Isn’t france powered by nuclear energy? So this is just another example of greenwashing.",
            "They don’t have AC for the SUMMER olympics?",
            "I love France and Paris in general. Been there many times but when I took my family during August heatwave last year, all of a sudden all the Uber drivers stopped understanding my broken French asking to turn the air conditioning on. They still understand, can you go faster (vitesse elevee siou vou plait) love it though",
            "AC is a gateway drug to the orgies they’re planning.",
            "Van Gough never had an air conditioner and I bet it got hot in that yellow house.",
            "I’ve never understood European aversion to cold air and drinks, particularly in the summer when most humans seek respite from the heat lol",
            "If the Frenchies are going to whine Sacre Bleu over our AC units, what are they gonna say when we order Le Door Dash for Le Starbucks?",
            "Environment plan lol. There aren’t that many athletes, it’s not gonna put a dent in the ozone layer.  Let the worlds best athletes get a good fucking nights sleep before the biggest days of their lives smfh.  I’m all for undercutting this farce of an environment plan",
            "I didn’t read the article but I bet this is largely about sleeping at a comfortable temperature. Athletes need their rest and it isn’t easy if you’re up tossing and turning and sweaty.  Being able to get cooled down at night always helps me to sleep better.",
            "I really hate when environmental initiatives punish ordinary people that aren’t even remotely the real problem. \n\nLet’s focus on the major issues, this nitpicking of smaller issues just makes people give up entirely",
            "\"using a system of cooling pipes underneath the floors.\"\n\nWouldn't it work better if they installed the cold pipes in the ceiling? Cold air sinks doesn't it?",
            "In honor of this message I just lowered the temperature to 70 on my 4 ton ac",
            "The saddest thing is that poor countries will not be able to bring A/C with them; so they will roast and be less competitive. Thank you France, nice virtue signaling.",
            "Is the basketball team getting a cruise again",
            "Extremely misguided plan to help the environment",
            "Dated a guy who moved from the UK with family. Younger brother (16?-ish) discovered and fell in love with iced cold beverages. The rest of the family was not a fan. I bought him ice cube trays for his birthday. We made Arnold Palmers with fresh sun tea, lemonade, and ton of ice. His mom was a reluctant fan of that. You'd have issues, though, trying to serve her ice water at restaurants. She was so rude, but British polite getting her room temp shit.",
            "Lol",
            "This is how energy allowances and metering happens.  Only so much power per team, use it on AC, not hot water or lighting for you.",
            "Some will die on the track..should be about 46c during olympics",
            "Granted it’s been 30 years, but Paris in July was horrendous. It’s ridiculous to think this is going to be adequate.  I shudder to think how the venues will be cooled.",
            "They're worried about the AC but still can't get the literal shit out of the river.",
            "Portable units like from the Movie Congo?",
            "i hope they remember to bring the outlet adapters.",
            "france just announced that all olympic athletes will be required to walk to the games in Paris in order to further reduce carbon emissions.  and to help all the athletes appreciate how cool 79 degrees F really is.",
            "Every year I contemplate to buy an AC, but in the end I never do.",
            "They expected people to jeopardize their Olympic dreams for this.  So instead of installing a more efficient central ac system, they are going to get less efficient portable ones.  It’s like they haven’t even been living through their own heat waves.",
            "‚Environmental plan‘. \nDo fucking solar on the roofs of the olympic village and sport stations and you have the power for a/c.",
            "It's hilarious that they call it the organizers plan tp cut emissions. Sure bud $$$$",
            "\"Undercutting environmental plan\" is a hilarious way of saying they want to be comfortable.",
            "Hmm I could go to Paris and open up an ice store and become rich but where can I find a giant pick to lift up those giants blocks of ice?",
            "Fly those stars and bars in the cool breeze of freedom brother 🇺🇸🏈🦅",
            "I’d like to know where they’re going to get EU voltage portable AC units in the USA.",
            "You gotta have A/C. Fuck a bunch of carbon emissions.",
            "I remember calling the front desk of my Dublin hotel and apologizing profusely for bothering them as I just couldn't figure out how to cut on the AC in the room. Their response (it doesn't exist) broke my American brain a bit.",
            "It’s cheaper to bring your own AC than book a place with AC in paris especially during summer olympics",
            "Good. Bring some 1st world country utilities over for once",
            "I love the sentiment but Europe needs to be doing the opposite. Europe is heating faster than any continent. They need to be adding ac units to prevent heat deaths not taking them away",
            "Europe in general doesn’t seem to be big on cold air or beverages",
            "It's nuts that so little has been done to change this across Europe since the 2003 heatwave.  https://en.wikipedia.org/wiki/2003_European_heatwave",
            "There’s like no ACs in Paris anyways",
            "Northern Europe is built to keep heat *in*, these fuckoff 40°C+ summers are a new phenomenon.",
            "They are using geothermal heat pumps for the buildings rather than traditional compressor cooling. This is a bunch of click bait title gore for people to be mad over nothing but France is probably happy you are focusing on this instead of their water quality",
            "No need. Fans are enough.",
            "From the article:\n\n> Olympic organizers have touted plans to cool rooms in the Athletes Village, which will house more than 15,000 Olympians and sports officials over the course of the games, using a system of cooling pipes underneath the floors.",
            "They have a crazy amount of heat-related deaths throughout Europe because of the lack of AC",
            "Cold shower ?",
            "Dis you? https://www.lemonde.fr/en/france/article/2024/02/08/france-recorded-over-5-000-deaths-due-to-summer-2023-heat_6505713_7.html",
            "The typical high is 78F/26C in Paris in August",
            "it's not that hot. I mean, it's hot, it's hot for people who are used to sitting in AC while inside, but it's not that hot for people who spend a lot of time outdoors and whose bodies have acclimated. I live in the deep south and spent a number of weeks floating rivers in a boat and camping. About a week in, you get used to it a d the heat doesn't bother you all that much unless you're in 95+ with high humidity and full sun exposure for an extended period. That's the threshold where it's uncomfortable even after you get used to being outside",
            "These environmental plans by leagues to cut down on little things is always funny. Its also tone def. \n\n\"Let's travel less.\" Proceed to release the most travel schedule possible.",
            "It’s also France.  Home of nuclear energy (70%).  The co2 emissions from the a/c will be quite small ",
            "It’s not so much an environmental plan as “let’s cut costs and dress it up as something else” plan.",
            "But they will use bamboo disposable cutlery at venues",
            "Visited Paris for a week back in the summer of 2017 and literally just slowly roasted to death for 7 straight days ",
            "The average high in Paris during the month of August is 78°f or 25°C. Maybe it's just that I'm in Texas, but that seems objectively comfortable.",
            "Customs 🛃",
            "En passant!",
            "Merica",
            "Hell yeah brother",
            "god this comment makes me proud of my country",
            "🦅🦅🦅🦅🦅",
            "Based",
            "🫡 🇺🇲",
            "Me too, tittysprinkles112, me too.",
            "Fuck yeah",
            "This is like the John Candy prayer from Cool Runnings. On earth as it is in turn 7.",
            "You deserve way more upvotes and accolades for this.",
            "Totally forgot about that song but instantly read this to the tune",
            "🫡",
            "I love you",
            "I don’t know if it was ‘03 but we got a heatwave disaster in France too back in the day.",
            "🫡🇺🇸",
            "Doubt it has anything to do with an advantage, but everything to do with misguided political attempts of greenwashing \"Look, we totally care about the environment\".",
            "I'd bet you can find step-down transformers easily enough.",
            "I’m wondering if they get the armed services involved. The Army’s pros at making miserable places less miserable, they probably have that type of 220v equipment hanging around already.",
            "I looked for one recently and they don’t really make them that much anymore. All bad reviews.",
            "230v",
            "The point of doing these things that seem ridiculous is not to actually help the environment, but to promote the technology as viable. \n\nSource: I was in charge of designing shipping container housing for the Olympic village last time it was in the USA. They wanted to promote shipping containers as viable building materials, and a sister project we had was to design low cost containers housing for developing nations (who would have had their athletes living in the containers when they came here)",
            "Hi! I’ve been to the Olympics in Tokyo as an athlete. The beds were exactly the same, and they were really comfortable. I’m 6’3 and weight 90 kg tried to break it with a mate on the last day (we did it but I’m sure a normal bed would have broke too). \n\nThe only case where athletes would not be comfortable is for all the dudes that are 2m05 + or really big. Those guys are used to being in tiny bed while in camp. (Obviously I’m talking for amateur sport, not all the NBA super star who I’m sure all have special treatment wherever they go with their clubs)",
            "The cardboard beds are actually far from problematic. There’s a whole normal mattress on top of it.",
            "At least it isn't being hosted by a dictator. So they have that going for them.",
            "I went to Paris in August a few years ago. It was miserable. No a/c anywhere. The buildings are built to hold in heat. No such thing as ice water. Everyone is just drinking espresso, wine, or orangina. \n\nReally concentrated the piss smell too, which I assume is because everyone is wildly dehydrated and it comes out the color of coke.\n\nNever again.",
            "France and stupid decisions, name a better duo",
            "I thought France also had excess nuclear power capability given they are a net energy exporter in Europe.",
            "Are these guys staying in hotels?  I thought they put them in special olympics housing, which I understand can vary greatly in fanciness but most look like dorms.",
            "Inside your bedroom? Nah man, Its gotta be around 70 in there or I am not sleeping",
            "I live in what is the snowiest city in the US about 50% of the time and I would love 79 right now myself.  It has been freaking hot all week.",
            "Yeah, this heat dome can fuck right off. 92° with 40% humidity.",
            "I suspect the US team is chartering a plane and will bring the a/c units in the hold. Getting them through customs might be an issue though.",
            "They got hundreds of thousands of condoms ready so they aren’t scared of that. In fact I bet the welcome a ménage et trios  or two or trois",
            "You never understood? Maybe it's that ac would double our electricty spend? Or maybe it's that electricty costs 3 times as much as in the us? Furthermore people in usa make more money so it's even less for them to pay for that electricty.\n\n\nCold drinks? When I buy a drink every single drink is in a fridge. It's actually hard to buy warm can of coke.",
            "Texan in Europe here. Everyone smells like shit.",
            "RIGHT ARM, BORTHER1!!1!",
            "Oh yeah! Didn’t even think about the 50Hz thing.",
            "The greatest \"the fuck is this idiot talking about\" look I've ever received in my life was upon asking my hotel in Dublin where I could get ice ",
            "Visited Paris in December, and we still had this issue with the heat. They kept that heat cranked so high, and even trying to adjust the thermostat it wouldn’t bring it down comfortable. It just was an oven and stuffy. We were lucky that the hotel window was able to be cracked open so we could get a cool breeze to counter act the heat. Same thing happened a week later to us in Rome.",
            "Only 19% of Europe has AC supposedly: https://www.euronews.com/green/2024/06/18/air-conditioning-use-has-more-than-doubled-in-europe-since-1990",
            "I've heard that too, but that has not been my experience during my travels. I've been to Germany, Ireland, Italy, Iceland, and Czech Republic. I found nothing but icy cold beverages everywhere I went, even in the little old timey village pubs.",
            "Four of us were on a layover at Heathrow and we all had water or sodas. When we asked for ice, the server came back with a single ice cube.",
            "Yeah but the tradeoff was you weren’t expected to seriously work during the summer. Yes, police and doctors and bread bakers still had to work. Bread bakers are essential workers in France, I shit you not. But if you sold insurance or rebuilt diesel engines or did carpentry, nah… no you didn’t really work in the summer. \n\nYou went to the lake and had picnics and got back to the office/shop for realz when the weather cooled down in the fall. \n\nThe whole no AC thing worked fine when the culture followed the expectation that summer was time to relax and stay cool.",
            "It’s a form of climate change denial. I live in Germany and it used to be the case that the summers weren’t *that* hot and it didn’t make sense to install AC everywhere for one or two 80°F days a summer. The climate has changed and now 80°+ days are the norm yet they refuse to install AC anywhere, even in new buildings, because “It’s not that hot!” \n\nSomething like 40,000 people in Europe died from the heat last year and it’s only going to get worse. They don’t even have AC in hospitals.",
            "I think that G. Love and Special Sauce said it best. \n\nhttps://youtu.be/pk9-28HgxfE?si=VmfCvNQpeewIhvQC",
            "My cousin got married in Italy a few years ago and the whole trip asking for water seemed to be looked down upon. At the actual venue water was hard to come by and I ended up passing out lmao",
            "What is Europe to you? You're telling me in Greece, Italy, Spain, Portugal, Southern France etc we are not big on cold air or beverages? \n\nNot to mention this isn't even true for the rest of Europe",
            "Middle / Northern Europe simply doesn’t need AC except for 2 weeks of the year. \n\nAmericans settled a land with latitudes comparable to Sahara, Syria or Spain. A huge part of Europe is more northern than the US Canadian border.",
            "I was in Italy and my cousin offers me a beer and he takes it out of the cellar were it's maybe mid 60's all year.  It tastes so heavy.  And when he was, he curses out how we keep beer way too cold",
            "Vin or Biere? Water is non!",
            "Try going to China. If you ask for water in a restaurant they'll bring it hot.",
            "According to the article, Germany and Italy also said they’re bringing ACs",
            "Went to France, and freezers are called American fridges. We'll that's what my family over there called it.",
            "What is the mindset in depriving themselves of way better shit lol. Is it just environmental stuff?",
            "Happy Cake Day! 🎂",
            "Europeans drinking lukewarm ass water\n\ncouldn't be me",
            "Still?  I was there during a minor hot spell in the 90s and it was so miserable I went to the one place I could find that had aircon, a theater showing old westerns.  Sat through two just to get the heat out of my bones.",
            "Can confirm. Before I moved to Paris, I came for a job interview during summer. I was intent on sleeping well before the interview, so I booked a hotel that advertised having air conditioning. They kept it switched off, and when I asked reception why I couldn’t adjust the temp, they just said “we control it centrally. And if me make it colder for you then someone will say it’s too cold”. \n\nIn a way, this was a perfect introduction to french culture moving.",
            "Insulation works both ways you know?",
            "Keeping heat in is the same process as keeping heat out. Get a window unit.",
            "When the same line gets repeated every summer for 15 years, you lose the right to feign ignorance.",
            "I was working in the UK in the 90s. It was hot then too",
            ">new phenomenon\n\nIt's not Phenomenon, we know what's causing it.",
            "Their goal is too keep the rooms 73-79F (22-26C), if I were an athlete who prepared my life for the Olympics, I wouldn't risk getting a bad night sleep so an Olympic planner can make a statement. I don't think that's unbearable, but still.\n\nI also question the premise of geothermal heat pumps, the London Tube has proven that the ground can only absorb so much heat.\n\nAlso isn't Frances whole thing nuclear energy? Plugging in an air conditioner shouldn't be a big deal.",
            "John Oliver just did a small segment on the Seine water quality.\n\nApparently it still tests positive for fecal matter, but the President and the Mayor of Paris say it is fine and they are going to go for a swim. \n\nThe mayor even announced the date of her swim, so people are organizing a day to shit in the Seine to have it reach Paris on the right day.",
            "username checks out",
            "Typical doesn’t mean jack diddly when we’re breaking heat records every single summer. Those days are over and it’s time to adapt or die.",
            "There are going to be three days in the mid 80's F this upcoming week in Paris, _in June_.  \"Typical\" high is inconsequential, especially recently.  Yea it might be nice and temperate for 5/7 days in a week and then miserable the night before your event when you'd kill for some cool air so you can sleep properly.",
            "Buddy I’m from Florida and just spent a week in Europe.  It’s hot as balls.  I’d say it’s only slightly less hot than Florida, the only difference is with whatever weak ass AC they pretend to use you never get a break.  I’ve never sweat so much in my life and all I did was walk around.  I can’t imagine actually playing sports and then going home to just bathe in more of your own sweat.",
            "Falling asleep when it’s 77 is not easy. Especially if your an athlete that probably wants 9 hours before a huge event",
            "Also, I mean, let the athletes sleep well? That seems like a bad place to cut.",
            "It's just pandering/green washing.",
            "But they're paying someone not to cut down a forrest so it's cool!",
            "Giant plastic cup, small paper straw that doesn't hold up for the time it takes to drink the giant drink.",
            "Saving energy is not going to cut the nuclear energy production; it decreases the other 30%.",
            "The f? Nuclear energy is one of the best options we have right now.",
            "They push this in the UK too, locally the council stopped cutting verges and green areas saying that it will encourage the bees and wildlife and also reduce co2 emissions, nothing to do with cost cutting at all. \n\nAfter an outcry from everyone they started mowing the green areas again.",
            "French Fries",
            "I did the same. Were you there across Bastille Day?",
            "That's the same time I was there, it was fucking miserable. Probably the closest I have ever come to having actual health issues from heat, there was no escape anywhere. We did half our exploring at night where it was still like 85 degrees lol.",
            "Buildings in Texas are built for the heat. Buildings in Paris are decidedly not.",
            "The highest temperature ever recorded in Paris was 108.7°F (42.6°C) on July 25, 2019.       I would bring the AC just in case.",
            "I grew up in Houston and have been to France twice in the Summer.\n\nIt’s hot.",
            "Stone & concrete do a great job of absorbing heat and radiating it out past sunset. It may be just a high of 25C outdoors but it'll probably be 25C indoors when the suns already set.",
            "Yeah, I’m planning a trip to Paris and the way people talk about the weather vs. the historical weather data is making it *super* hard for me to figure out what clothes to pack!! I feel like I’m absolutely missing something here.\n\nEveryone says it’s going to be sweltering, hot, miserable… but 78F sounds like a relatively pleasant day to TX-living me. And the avg August low is 56F so does that mean the mornings and evenings are going to be chilly? Because 56F is *cold* cold to me. Idk what to believe.  Whatever happens, I’m gonna pack the wrong clothes I just know it.",
            "My office tonight hit 88.8.",
            "I was in France for that giant heatwave that killed a lot of people in 2003. Being from Texas, it was like a warm spring, but there was no fucking AC. Acclimation is a big deal; our bodies have learned how to handle it, and we have experience with it. We’re not bad with the cold, because it only lasts two weeks at a time. Places where it’s icy and snowy for half the year are also a different ballgame for us for the same reasons.",
            "Ehhh do yew have ze papiers for ze AC? \n\nPappy Airs? \n\nYes, ze papiers.\n\nOh, you mean papers?  \n\nZat's wut I've beeeen seying, you eediot.",
            "Hold on let me stand next to my flag sticker",
            "Not so good for the planet though",
            "Patrick?",
            "And a way of offloading environmental concerns onto the consumers as opposed to actually putting the corporations that are the REAL drivers of climate change in the hot seat.",
            "Ffs Is there anything Europe does in modern times that isn’t virtue signaling crap?\n\nEdit:  I dunno why I’m being downvoted - doing that nonsense to signal virtue on the environment while doing nothing real is crap.",
            "You can, but that’s just more stuff to deal with.",
            "I think this is proving those options are not viable",
            "Fair enough, but there's a big difference between using a shipping container as a structure and having athletes deal with excessive heat for no reason or sleep on cardboard beds that only hold 250lbs. So no sex for whatever stupid reason and larger athletes have to worry about collapsing them. Pretty hard to compete at the top of your ability when you're sleeping on uncomfortable garbage for no good reason. Kind of misses the entire point on the Olympics.",
            "Shipping containers for the winter Olympics sound miserable to me but that is probably because I hate winter and the cold haha.",
            "I’ve never really “got” the shipping container houses. They are completely uninsulated, so you will have to insulate either the inside or outside. This almost necessitates framing either the interior, exterior, or both.  And at that point, why not just frame up a rectangle house and take away the container element? A short google search and I can’t find anyone doing this model at scale at all, so I assume there is some inefficiency along those lines preventing these from happening.",
            "Yeah the athletes are staying in special housing which will be repurposed after the games. \n\nI just meant that all the visitors, media, support staff from other countries. Will be staying at regular hotels and running AC’s.",
            "Well I don't want you sleeping in my bedroom anyways.",
            "I can see you haven't been in many shitty situations, and I'm happy for you",
            "My ac is set to 79....its 100 outside. ",
            "Meant outside…95 atm and 79 sounds lovely!",
            "> 40% humidity.\n\nI mean that bad at all. I mean in the summer where I am at the temp would be 85+ with 75% humidity. Thanks corn.",
            "As a Texan, I’d love for it to be 92 instead of 100+ during the summer.",
            "Alternatively, just buy them locally to be delivered to the team in country.",
            "yeah, I don’t understand. Housing should have AC as a basic feature globally since people actually die without it even when the weather is not extreme. And blame your government for the high electricity prices because it shouldn’t cost so much, especially when Europe uses so many renewables which are cheaper energy sources",
            "The same thing happened to me in Germany.",
            "Ordered a water **at a bar** in London like 2 weeks ago and the woman scoffed at me and said \"you probably want ice in that, right?\" Like I already paid for a cola and a beer give me a break",
            "Go to Italy and ask for a big coffee and see what kind of looks they give you there.",
            "I stayed with my French cousin recently. He told me his dog throws up if she drinks too much water so I should only give her a little at a time. I said he should just give her ice cubes and he was like \"why the hell would I have ice?\"",
            "From Dublin. It would be unusual to get ice in a hotel here for sure, but in any bar if you order a drink that would normally have ice (soft drink, cider, rose etc) you will get ice by default.",
            "They don't use ice over there??",
            "I remember asking for a Pepsi on my hotel floor where there was a woman at a desk. She opened the fridge and handed me a warm Pepsi. It wasn’t plugged in. We were told not to drink the water because it might my give us the runs so warm Pepsi and Fanta it was for 10 days. This was 1987, in the USSR.",
            "Don't need ice if all you drink is whisky and Guinness",
            "In Ireland I asked for an Italian hoagie at a deli once and realized I’m such a tourist.",
            "We cool our beverages by putting them in the fridge….",
            "I got the same thing at a Russian cafe in Brighton Beach, Brooklyn, USA!",
            "Every hotel I've ever been to in Ireland have had ice machines on every floor and even if not you could go to the hotel bar or any bar in the country and ask for a pint glass full of ice for free",
            "I’m not surprised. Ice in water on a hot day. Fine. Ireland is not in the tropics. It’s Europe. Northern Europe with between 150-250 days of rain a year.  We just don’t do ice machines except in bars or bags of the stuff in supermarkets.",
            "Why do you need ice in a hotel room?",
            "Pretty much describes every experience I've had in Europe in the winter time.",
            "Thats how heating works in a lot of buildings in NYC. You get the radiated heat and control the temp by opening windows.  ",
            "That’s why a bunch of them die every summer",
            "Same thing happens with peas.",
            "Haha, that was entirely deliberate of them.",
            "Yup this is it. There's always been a sort of pride in Europe that AC is a \"wasteful american affectation\" \n\nAC has always been less energy than heating in the winter. A home in boston uses more energy than a home in texas to thermoregulate.\n\nEuropeans don't want to admit that they need to adapt and be like the dreaded weak americans who need AC to live in humid summers.",
            "Every place I've been to in Europe they usually ask you if you want sparkling or clear or with gas or without gas I've never heard of any place in Italy or France or Germany not having water available usually it's by the bottle.",
            "Freaking love that band lol",
            "I go to Italy multiple times a year for work, and never have trouble ordering water with a meal, but usually it’ll cost you like €3 for a 1L bottle. Bottled water is borderline free in grocery stores though… I’m talking like €0.25 for a 1L bottle",
            "Why do these people not drink water?!?",
            "Stayed in Zurich recently, in two nice and seemingly relatively new or at least recently fully renovated hotels, no ac at all. Only one window could be opened in the rooms and only could be opened maybe 10cm.\n\nI was fully nude with no sheet or blanket, sweating for a few hours before it cooled down enough to sleep.\n\nNow that I'm aware this is an issue I'll just make sure to get a hotel with ac if I'm there in the summer.",
            "Having been to Italy, Portugal, and Southern France already I can tell you for those places sure, you’re not as stringent on it as the UK, but no in all of those places you have your A/C WAY higher than we’re used to even when a building has it and ice in drinks while existent usually had to be asked for.",
            "Still.",
            "I had to wrap my phone in a wet towel in an AirBNB in Paris to cool it enough to be able to hold a charge for more than 5 seconds. Literally had to go to the shower to keep myself from overheating. It was a little absurd, granted it was a pretty major heat wave but the stubbornness around AC over there is ridiculous.",
            "I know. This is the stupidest myth. I heard it on NPR last year, they've lost a step.",
            "It does yes, but houses aren't completely insulated, one thing that changes the equation is windows.     \nLarger sun facing windows are great for cold climates, terrible for heat",
            "Windows are designed different in Europe so they wouldn't accept a window unit. What I did was drill two holes (6\" roughly) in the wall and put a unit on the inside which exchanges air through them. The alternative is to have a heat exchanger outside on the wall (if your building allows it) then route hose through to the rooms you want ACed and put in ventilation units there but my building wouldn't allow it.",
            "So as somebody that lives in Northern Europe (Ireland) there is no market at all here for air con in your house because it simply isn't required. So far in June we haven't been above 20 degrees yet. We are expected to tip over to 22 degrees in Dublin on Monday and then drop down again. At worst, we may get a week at 25 at some point in a summer, but we really do not have any need for air con here.",
            "> Also isn't Frances whole thing nuclear energy? Plugging in an air conditioner shouldn't be a big deal.\n\nAround 60-70% of it comes from France's 56 nuclear reactors, the most in Europe and the EU by far.  It is the second country in the world after the USA when it comes to civil  nuclear capabilities (capacity and generation of power).",
            "To be fair, I don’t think it’s to make a statement to the athletes.  Generally athletes villages are figure housing, and these units will likely become apartments or condos after the 2 weeks they’re used for the Olympics. So it’s a more long term plan to have them be geothermally regulated",
            "MS here, I guess it just affects people in different ways. I work outside in the summer here all the time and while it's very hot and very sweaty, I rarely feel actually miserable. My house AC stays on 75-77, so that helps keep me used to higher heat.",
            "again, if you acclimatize, it's not difficult and is quite comfortable.My thermostat is set to 77 right now, actually. It was 93F today. I sleep just fine. But again, I'm used to it. If an athlete has been sleeping in an AC room at 68 for a while and flies to France where it's 77 at night, then yeah, that's going to be unpleasant and I'd want an AC in my room too, to help me stay focused on my discipline and not worry about sleeping or comfort.",
            "And hydrate, we’ve got people running marathons and multi day events. They can’t be sweating night and day trying to replenish/load up on some fluids the days before and after competing.",
            "No idea why you’re downvoted",
            "It's humid, there's a lot of stone and asphalt, and you can't count on it being breezy.  Paris can be bloody miserable, which is why in summer all the Parisians who can go elsewhere.",
            "Sure, but im not talking about buildings. I'm saying 78 is a temperature that's pleasant enough to just be outside. Being in a building would just require opening a window for a breeze.",
            "And then I get a room on the 5th floor with no lift or air con during a heatwave.",
            "Ok that makes sense, I’m from Chicago with hot summers and cold winters. A high of 79 is not considered all that hot here. That’s ideal outside weather",
            "The Olympic village, purpose built to house the athletes, is built for the heat:\n\n\n> Olympic organizers have touted plans to cool rooms in the Athletes Village, which will house more than 15,000 Olympians and sports officials over the course of the games, using a system of cooling pipes underneath the floors.",
            "Oh, I thought they build them houses from wood and cardboard because they like it cheap; never thought that it could be to be more \"heat resistant\" than those lousy european oldschool buildings with 1 meter thick bricked walls",
            "I'm from California and went to Paris last month. Weather was high 60s. I brought a jacket and never used it once. The sun definitely feels hotter in Paris...",
            "Omg like are you Franch? 💁‍♀️",
            "\"Right here sir\"\n\n\"Zis iz a note-CAHRd zat says 'omelette hwit cheese-eh'. ....Wayt, hwere did zey go!?\"",
            "** fridge magnet",
            "Who do you think buys all the shit corporations produce? It’s the consumers. \n\nThey output co2 and pollute to meet consumer demand.\n\nI agree that tackling the issue is easier by having regulations on corporations rather than on consumers. \n\nBut let’s not kid ourselves, the consumers are the ones driving demand.",
            "So who’s responsible for emissions caused by AC? Is it the corporation that sold the unit? The corporation that provided the electricity to power the unit? Or is it the person who decided to use the unit?",
            "You are being down voted because by asking if there's anything Europeans do that isn't virtue signalling crap you are implying everything they do is virtue signalling crap.\n\nAnd that's just a false statement. They piss as well.",
            "There are political parties that try, but they don't get voted in. Because bullshit appeals to people (this is not limited to Europe).\n\nedit: I want to be a bit more fair to people. It's not just the appeal of bullshit, it's also that the elite owns medias and influence, and they have an interest in keeping things as they are (it makes money), and so they peddle the bullshit everywhere, and it works. They pretend to do good, and they don't, and enough people believe it anyway, same crap happening all over the world.",
            "Oh they had a full HVAC system, heating, electrical, and plumbing. They were just using the containers for the structural parts.",
            "Not to be hard-hearted but who cares about them?  It's the athletes who need a good night's sleep, and I find it hard to do so when I'm sweating.",
            "96 outside here.  AC is set to 70... can't keep up, 73 in here and rising for the next couple of hours.",
            "Depends on where you're at but 79 in Paris is not comfortable weather",
            "Oh yeah, I would love to see 79, but that's done until September here too",
            "It could be worse, Dubai was just under 135 F yesterday.",
            "How widely available are portable a/c units in France? (Genuine question).",
            "Exactly.",
            "Power in europe is more expensive partly by design - cheap power and fuel in the US, and fewer regulations about efficient appliances (such as ac) means you have twice the carbon footprint per person.",
            "Same. That’s where I learned to like sparkling water because it was the only thing I could find refrigerated.",
            "Hah. Same here. I ordered water, and what I got was room temperature sparkling water.",
            "That sounds miserable. Even in the middle of a cold winter day I need ice in my drink.",
            "The same thing happened to me at Denny’s.",
            "We stayed in. Holiday Inn in Germany last night and found an ice maker and were so amazed to see such a thing in all of our European travels in our life. Then we realized that this is the first time that we have stayed at a real “American” hotel chain which may be why. We are off to stay at a Hyatt, so it will be interesting to see how that is.",
            "It's so annoying getting looks when ordering water. Like dude I'm clean stop trying to pressure me",
            "The absolute biggest culture shock was when I went to a pub in London and got a room temperature ale. What. The. FUCK... Haven't had room temperature beer since college. And that was mostly out of desperation. The lady explained it's the local style of beer or whatever but... I've never had room temp beer after that and I plan to keep it that way. I made sure to order a lager afterwards. Had to ask which of the beers are kept cold. Jesus.",
            "Next time reply with \"did you lose the recipe?\"  ",
            "LIt would be a lot cooler if you did”",
            "HOW DARE YOU HYDRATE!",
            "me in the US here paying a premium for cask ale from london",
            "Or spaghetti and meatballs",
            "What if I ask for it with intense hand gestures",
            "Or a cappuccino after i think 10 or 11",
            "I spent a week recently in Barcelona for business travel and I had a great time. My one complaint is I just couldn’t get a normal cup of American coffee. The hotel had a machine in the breakfast buffet and I tried every option. One day I accidentally drank a jumbo espresso. That was a shaky morning, I tell you what.",
            "[I like your username](https://y.yarn.co/965d7ad8-210a-4d7c-a0f9-ce80c2818f9b_text.gif)",
            "Didn’t the Italians invent the Americano for this reason?",
            "In fairness if you ask it in an American accent they’ll just give you an Americano with pretty little issue. It’s admittedly not identical to coffee but functionally the same purpose and doesn’t taste that different.",
            "Spent a month in Ireland and got ice in every drink I ordered I think?",
            "It's typical to put ice in cider?",
            "Hello, I would like 10 glasses of ice water to go please. Hold the water.",
            "People hang out in their rooms with their friends, especially after hours at events. The ice is for drinks.\n\n\nEvery hotel room in the US, from the lowliest shitbag motel to a fancy five star hotel, will have an ice bucket and public access to an ice machine. It's just a given here.",
            "Ice water or cocktails.",
            "Right. And Rome is…a relatively temperate winter in December. So there isn’t a reason for it to be 80° in the hotel. VERY lucky to have crank out windows while we were there. In the US it’s rare to have a hotel room where you can actually crack the window.",
            "In the winter they’ll be blasting the heat when it’s like 50°F outside. But then refuse to use AC when it’s 90°F lol. “Just open a window!” It barely helps. And if you’re a tourist staying in a hotel, well most hotels these days lock the windows so you can’t open them more than a tiny crack, IF that.",
            "Yeah its crazy here in Slovenia and Austria atleast. Most people say you get used to it but idk not me im chilling under my ac.",
            "https://www.hhs.gov/climate-change-health-equity-environmental-justice/climate-change-health-equity/climate-health-outlook/extreme-heat/index.html#:~:text=Extreme%20summer%20heat%20is%20already,2022%2C%20and%202%2C302%20in%202023\n\n2300 Americans died from heat related deaths last year",
            "Wait until you ask them to show up with an aircraft carrier.  It's like: fuckers, we got 20.",
            "> There's always been a sort of pride in Europe that AC is a \"wasteful american affectation\" \n\nAnyone who feels this way should spend an AC-less summer in a city like Phoenix or Houston.",
            "It was weird how they sort of quietly had a moment where they blew up a bit in like the early 2000s, a decade after me and the boys were into them. idk if they were featured in a movie soundtrack or something, but good for them however that happened. \n\nVery cool band though.",
            "My wife is European and she's a fish. She must drink 3litres of sparkling water a day.",
            "No, Only alcoholic beverages. Europe is a continent of high functioning alcoholics. I've even been told that the French don't even give their infants milk, But instead a nice wine around 6% \n\n\nQuackin Crazy, Ain't it Jimbo?",
            "Honestly the largest factor here is ventilation. Houses in warm places are excellent at flowing air through during the night to cool it down.",
            "Maybe where you live, but it does seem that we've reached the annual June-August surprise heat wave season where Europeans across the internet complain about how hot it is all day.",
            "I’m in the Netherlands but I’m from Texas. It’s not that it doesn’t get hot here, but … like, I’m used to it being 30+ degrees for 6 months, and 35-40c for 2-3 months a year.\n\nHere, we’re above 25 for only 2-3 months, and we might top 30 just a small few days per year.",
            "I mean ok, but this is an annual complaint now in July/August from the UK/Ireland, at least the last several years. So I’d posit either that you do have a problem that requires fixing or people are whining about what you consider a minor inconvenience. I’m ok with either, but take your pick.",
            "They can still use the Olympic village as apartments, all they'd have to do is remove the AC units beforehand. \n\nI thought the point of switching to clean energy was reducing emissions without having to reduce energy usage. And France did that already.",
            "I think it’s because “the fuck nuclear is better” isn’t really a response to saying France has so much nuclear power that CO2 will be low.",
            "Because it’s reddit.",
            "All cities are terrible in the summer! Those concrete jungles cook you! Strange how they create frigid wind tunnels in the winter, but not a breeze to be found when you could use it in the summer.",
            "Live in a south eastern state. This Paris heat is a joke",
            "hell, i live in Minnesota, we can get above 90 for weeks on end in the dead of summer, id kill for something like 78 avg high. though this year we have been pretty mild, rainy and in the 70s. we will see in august",
            "Yeah that is not too bad at all for summer. ",
            "There city is made of stone and brick. Stone and brick absorb and radiate heat. It's hella packed tightly too. It'd be miserable if there was no breeze. Also, buildings in the US are built for heat and cold, Paris buildings are just built for cold.",
            "Heat in Europe just feels hotter somehow. Where I live I agree 78 would be pretty mild, but I swear when I visited Scotland last summer it was like 72 and it just felt hot, especially inside any of the buildings, even with the window open.",
            "Eh, for me, 5-10 degrees is comfortable and 25 is like, the upper limit. It depends on what you’re used to.",
            "It's much more humid than eastern Texas, it's about as humid as Miami gets except no AC and no wind around plus concrete everywhere....",
            "Right, there are days in February that are 78 here lol. It’s very mild, I’ve gone camping in the summer in Texas with highs of 100 and it was fine.",
            "I agree with everything you said and wanted to add 1 more point. \n\nIt's not the role of the consumers or corporations to regulate pollution, it's the government's.",
            "I think it’s fair to add, marketing campaigns from these same companies making products have made people “need” things they really don’t. Or at least feel bad for not buying them like others.",
            "It's not really the AC at all. It's the power infrastructure that's relying on fossil fuels to meet demand, and the other industries that need to clean up their processes to be less carbon intensive.\n\nhttps://www.epa.gov/ghgemissions/sources-greenhouse-gas-emissions\n\nHyperfocusing on things like A/Cs and ignoring the actual problem (the need for clean energy *generation and storage* rather than usage) is the exact problem they're talking about.",
            "😂 tbf reddit is filled with a tribal form of positive eurocentrism, which also explains the downvotes.",
            "it's 95 outside and I keep my house at 75 during the day. But at night? I crank all 3 a/c down to 68. I can't sleep above 72.",
            "From what I understand AC generally isn’t good for more than a delta of 20 degrees Fahrenheit. \n\nEDIT: This [article](https://hvacrschool.com/why-the-20-rule-is-driving-the-internet-crazy/) has a pretty informative discussion about the “20 degree rule”. TL;DR it’s more complicated than it sounds and varies by location and HVAC system design.",
            "Yeah, Celsius is brutal.",
            "Literally everywhere, amazon next day delivery or hardware store have them in stock.",
            "I'm guessing local shops already ordered extra stock haha.",
            "In Poland, found a restaurant that was on the side of the road in the middle of nowhere. Asked for ice for our drinks. Guy looked confused and brought us 1 cube on a plate.",
            "Me: \"Erm, StillesWasser bitte\"\n\nwaiter: \"stilles Wasser? Wie von der Toilette?\"",
            "The only thing grosser than sparkling water would be warm sparkling water.",
            "Makes me want them to even conceptualize a Slush Puppie",
            "Room temperature in the basement where the kegs are is just fine for ale.\n\n  \nA rule with no exceptions: If the commercials make a point of drinking the beer ice-cold it tastes like ass at any other temperature.",
            "Yeah I mean, you keep the cellar around 13c, don't want cold ale, you lose all the flavour. \n\nOn the other hand, if you're drinking Carling or something, make that shit as cold as possible specifically so you don't taste it...",
            "Well, their beers actually taste good. It’s fine cool. Doesn’t have to be ice cold",
            "Depends what you mean by warm but room temperature is wrong.  I wouldn't be drinking there again if I got served a warm pint.\n\n[https://heavywoollen.camra.org.uk/what](https://heavywoollen.camra.org.uk/what)\n\n12-14C (54-57F) is the correct temperature for real ale.  It can be a bit of a shock if you are expecting an ice cold beer like you would get with Lager but having real ale served at fridge temperature would ruin the taste.",
            "Flippy tap - cold\nPully tap - cellar temp",
            "Your loss",
            "Lol it's crazy that American beer lovers never know it was made to be served at room temp. It's like they love to drink 17 bud light at the end of the day but the day they find out Guinness cold is a cardinal sin is the day they order one from the brewery. Blows my mind this isn't common knowledge with how much drinking we do here.",
            "The shittier the beer, the colder you have to serve it to make it go down. Really good beer is preferably served at room temp. I'm American and even I know this.",
            ">a room temperature ale.\n\nCellar temperature.\n\nWhich is how it's meant to be kept.\n\nLike how red wine isn't chilled.\n\nChrist, imagine being this entitled.",
            "Exactly how you should be drinking ale. If you don't want it room temperature just order a beer.\n\nYou just learned that lesson",
            "Apparently beer used to be served room temperature. When some companies started making crappy beer, they also pushed the idea that beer is supposed to be cold. When something is cold, it makes it less flavorful. By making it cold, it's harder to tell that it sucks. Now, people have just gotten used to drinking their beer cold.",
            "\"I'll have spaghetti bolognese please\"\n\n\"no existo no spaghetti bolognese\"",
            "Polpette is a motherfucker to find, even in the middle of Rome lol",
            "Yeah I think that's a big shock to a lot of people visiting Italy, they don't serve coffee at all after around 10AM, and get mad if you insist.",
            "When in Rome…add water and make yourself an Americano.",
            "Don’t like Lattes? I like a little coffee with my milk. Yum!",
            "Yeah if you’re used to tall American style tall coffee it can be maddening. I also couldn’t get bacon and eggs for the life of me. If I wanted something hardy before 11AM it basically had to be some kind of pastry or donut.",
            "[This might be the reference.](https://www.youtube.com/watch?v=dFPLLARttwg)",
            "Yeah you will, barring stuff like Guinness, red wine or beer which you wouldn't have ice in anyway. If there's one thing that Ireland knows, it's how to serve refreshments.",
            "I imagine they're talking about getting ice for the room which seems to be a thing in the US but isn't here, at all.",
            "Depends on the girl.",
            "Not when it's on draught \n\nFrom a bottle it's common to have ice in the glass",
            "Depends on the style. I love a good dry cider over ice on a hot day.",
            "On a warm day, that's how certain types of macro cider would be drank here. But I know what you mean, when I was in San Sebastian recently, you wouldn't drink their cider with ice.",
            "These days most hotels don’t let you open the window more than a crack, if even that. And I’ve been various places in the world. A consistent thing in the hotels is barely being able to open the window.",
            "We went to Rome two Christmases ago (took the whole family.). It was cool, but not cold. I don't think I ever used my coat, just a nice looking Carhartt sweatshirt I have.  I typically go to the Berlin film festival every year for work--My wife and I make a mini vacation of it.  Some years I get by with a very thick sweatshirt. Other years I'm okay with just a puffer jacket.",
            "62,000 Europeans died in a single year. And we have regions that are considerably hotter than Europe and with a higher number of homeless people exposed to those temperatures. ",
            "You might notice that the overwhelming majority of those are in areas that are literal deserts. Most of Europe doesn't have 46 C and higher temperatures on the regular, and when they do you get pretty [wild outcomes.](https://e360.yale.edu/digest/severe-heat-deaths-europe-2022)",
            "I mean 11 actual carriers (10 Nimitz, 1 Ford) in service plus 7 Wasp LHDs plus 2 America LHAs.  So... 20 *kinda*.  11 plus 9 minis that can each deploy thousands of Marines to kill things more up close and personal.\n\nWasp and America classes typically has 6 F35s, but can carry up to 20-25.  A Nimitz class typically carries something like 64 FA18s, but can carry up to 130.  Ford class is supposed to support up to 90 aircraft.",
            "Surely it won't be much longer until some company realizes there's a market and makes bank off of selling window units and installing central air and heat systems?\n\nHell instead of central, someone could make a lot off of installing mini split systems.",
            "Yup, and Netherlands would run hotter on average than the other places I mentioned, throughout the summer. The hottest day on record in Ireland ever was 32.9 degrees and that was over 100 years ago. On an average summer, we never get anywhere close to 30 degrees on a single day, let alone days on end.",
            "I mean I live here, but please continue to tell me what Irish people need and complain about.",
            "Hot town, summer in the city  \nBack of my neck getting dirty and gritty",
            "I live in a south easter state.  The heat is not a problem until you don't have ac.",
            "Anything under 40 in a Texas summer would be considered beautiful",
            "Yeah, that's fair, where I'm at in Texas the average in August is about 36c. You're right definitely comes down to what you're used to.",
            "Eastern Texas is one of the most humid places in the western world lol. It’s at the horse latitudes (on average the most consistently hot region across the hemispheres in the summer) and right next to the Gulf of Mexico.",
            "That's fair, but from what I'm googlimg Paris and Austin have pretty similar humidity in August. Both being right around 64%.",
            "The problem is the govts have been captured by said businesses that require to populate co2 as their business.\n\nConsumers can be part of the solution along with business but yes it’s really govts who need to fix it long term",
            "Ding ding ding.\n\nThe guiding hand is supposed to guide. Not get in bed with where the money is.",
            "Using AC, especially during peak hours, increases the amount of power generation that is needed. They’re directly linked to each other.",
            "And here I am with my AC at 62 lol I just get hot in general so I need it nice and crisp.",
            "I should have mentioned it's technically a heat pump, but looking at the results your point tracks.\n\n73 is a hell of a lot better than 96 though... and our damn pool is 92 degrees.\n\nI know, first world problems.",
            "Your house needs better insulation.",
            "I think my grandpa used to tell a joke that went like this.",
            "This is funny",
            "Depending on the country I started ordering a glass of ice with whatever drink I ordered. Many times they would give me just a couple of cubes so I said screw it when I say I want ice I want ice so bring me a whole glass full.",
            "That is so weird! Do they drink warm soda???",
            "Then what tf do they do with it if they still have it in cube form? Lol",
            "Warum nichts Brawndo? Es hat das, wonach sich Pflanzen sehnen!",
            "I love how it is obvious what you were saying even to someone who doesn't speak German. Sick reference.",
            "Hey. Settle down. Some people like the taste of ass at any other temperature.",
            "Lager, and even light lager serve a purpose.\n\nFreezing cold, slightly alcoholic water is exactly what the doctor ordered when it is 95+ degrees and I am fishing.\n\nOtherwise, ofc, no.",
            "Fair but most places take that to mean \"We don't have AC in here so its 25c, that means its room temperature!\"",
            "In Spain they drink chilled red wine and I love it",
            "Hey, we like cold drinks in bald eagle land",
            "Tbf, there’s a difference between (real) ale and gnat’s piss.",
            "Idk...  in England in the winter, sure, I could buy that. In Phoenix, Arizona in the middle of July... I don't think it matters if the beer sucks or what the flavor is like, any cold drink is going to be miles better than a warm/room temp one (especially if the room is like 90F).",
            "Fun fact: Beer came before refrigeration AND human-made ice!",
            "for beers that dont suck i usually pop them in the microwave for a bit, really brings out the flavor",
            "\"You got any them 'la-sag-nas' then?\" - good ol boys, probably",
            " Bolognese is only with linguine 🤌",
            "In Rome they asked me after every meal if I wanted coffee",
            "Coffee (which basically means espresso for us) is served whenever you want it and usually after meals \n\nOther things like cappuccino are usually served at breakfast",
            "An Anericano doesn’t taste right either.",
            "This is just a list of people complaining other countries aren't the same as America.",
            "You are so right! Had the pleasure of drinking in the oldest pub in Ireland and the bartenders in there were awesome. One older fellow and one much younger, and when my wife ordered a Guinness the old man went on and on about the correct way to serve a Guinness. Certain glasses, certain temperatures, and way you pour it were all so important to him.\n\nYounger barkeep was like “yeah whatever old man” but we could tell it was all friendly. I certainly enjoyed hearing it from him",
            "I appreciate you",
            "10/10",
            "Bravo",
            "Interesting, I've never seen ice in cider in the US. I've only had a few glasses of cider in Europe.",
            "Our amphibs are the size of most countries' mains.  11+7+2 = pretty good for off the the top of me head.",
            "You're kind of nailing the question here and getting to the crux of understanding why they aren't really needed here in Ireland. Theres a decent level of money here, and people with the business accumen to make money if it was to be made. We all have gas or oil central heating, half the country has solar panels to help with electricity etc which will cost you upwards of 15k etc. We just simply do not get the extreme heat required. \n\nFor some of the other European countries for sure, but the likes of us, Norway, Denmark, Sweden, Northern England and Scotland etc, we just don't get the heat to ever require it. It would sit there unused for probably 95% of the year and even on the days you may turn it on, you'd easily get away without it.",
            "Window units are not a thing in europe because we have nice windows.",
            "Exactly. It’s like how my winter-hardened Midwest coworkers made fun of me initially in Texas during our freeze a few years back, but then they realized I was going without any form of heat for days and thus my apartment got colder every day and night.",
            "I remember in the fall going to get blankets as evening hit and it was getting chilly. As I went to the car, the bank clock showed 30 degrees Celcius and it was at that point I knew I had adjusted from living up North.",
            "Yeah but at least we get some reprieve with AC. You don’t get that consistently in a lot of places in Europe.",
            "Austin here. 95% humidity and 80 degrees at 7 AM then 102 degrees and 35% humidity at 3 PM. Averages mean nothing…",
            "Give me all the bacon and eggs you have. Wait, you heard “give me a lot of bacon and eggs.” What I said was “give me ALL the bacon and eggs you have.”",
            "In Italy I once asked for some ice with my coke at a restaurant, and one server had to go get another who spoke more English, and after some chit chat between them, the first server came back to the table with a small bucket full of ice… enough for 5 or 6 glasses full total 😂",
            "Is that how you say \"crave\" in german!?",
            "I had warm ass today.",
            "My husband does.",
            "Not they don't. Cellars in uk pubs are not reaching 25°c",
            "They do - that’s where I discovered it .. really nice.",
            "Try heating it in a pot and adding some hotdogs next time. Beer cocktail!",
            "Yeah, but it was the closest the American GI's could get in Italy during World War 2",
            "I can't speak for all of Europe but would be unusual not to get a glass of ice given to you in Dublin if you order a bottle of cider (or sparkling water) in a pub\n\nIt wouldn't be served on ice, but you'd get the glass of ice with the bottle and pour yourself",
            "In a thread full of ignorant comments this one has to be the worst.",
            "I'm also in the area. You can find the weather in Paris pretty easily online. Their humidity follows a similar pattern to ours. Humid in the morning down to the 30% - 40% range in the evening. Only difference is its highs in the 90's or 100s here.",
            "Yeah sehnen. Literally it's yearn, but in context it's crave.",
            "I actually do it at home a bit - the French and Italians would murder me if they knew",
            "Try getting a bucket and a mop next time.  Green eggs and ham!",
            "Ignorant = not agreeing with Americans.\n\nAC just isn't needed in a lot of Europe, especially northern.",
            "Yes, I just thought that would slot in perfectly with the rest.",
            "I bet you think *all* of Europe has \"better\" windows than *all* of America too and that's why you don't require AC despite tens of thousands of people dying there every summer because of the heat every year. \n\nIt's the windows and not the insane levels of death right? *That* is ignorance."
        ]
    },
    "Clark scores 16 and Fever beat Dream 91-79 in a front of a record-breaking 17,575 fans": {
        "title": "Clark scores 16 and Fever beat Dream 91-79 in a front of a record-breaking 17,575 fans",
        "score": 659,
        "url": "https://apnews.com/article/fever-dream-score-d8e9f20d62c076acbff987b705dd51a9",
        "content": "",
        "num_comments": 95,
        "comments": [
            "[**Join Our Discord Server!**](https://discord.gg/233aU5q)\n\n**Welcome to /r/sports**\n\nWe created a Discord server for our community and would like to invite all of you to join! You'll be able to discuss sports with users around the world and discuss events in real time!\n\nThere are separate channels for many sports you can opt in and out of, including;\n\nAmerican Football, Soccer, Baseball, Basketball, Aussie Rules Football, Rugby Union and League, Cricket, Motorsports, Fitness, and many more.\n\n[**Reddit Sports Discord Server**](https://discord.gg/233aU5q)",
            "She took one shot in the entire 4th quarter\n\nWhich I thought was strange",
            "Clark might be famous for her 3-point shooting, but so far she’s proving have an all around offensive game AND she rebounds! lol All of a sudden, she doesn’t even need to score a lot for the Fever to win.",
            "Angel Reese: People watch WNBA for me too, not just Caitlin Clark.",
            "Fever have been turning it on lately. Clark is being much more comfortable in the leaghe",
            "Happy to see it \n\nI’ve got several friends who’ve taken their daughters to Fever games in Indianapolis.",
            "The Fever used the Dreams double teaming of Clark against them. Smart team basketball.",
            "This seems like an insult hidden within a story.",
            "WNBA is ok",
            "Can we start looking at who's posting this shit? It's obviously a karma farm.",
            "Would be nice to see her score a little more I wanna see her dominate damnit.",
            "She's hitting shots and making quality assists now.  Her confidence is catching up.  As a PG she doesn't need to put up 30 to be valuable.   I'm hoping by end of the season that she starts to get the turnovers under control, and then we will be cooking with gas.",
            "They went into the 4th quarter with a 17 point lead, why do you think that's strange?\n\nDo you know how many minutes she played in the 4th quarter? I can't find it.",
            "I think they're trying to raise the overall confidence of the team for now. It makes sense. At some point CC will go off. Already starting to see some of that.",
            "The over was 17.5 on DraftKings.  Looked like a winner going into the fourth quarter.",
            "I think it’s more strange that 11 women scored more pts than her tonight in the W, and yet she’s the only one to have an article written about her.\n\nShe was the 3rd leading scorer on her own team… And if you watched the game, Wheeler actually had more to do with the run in the 2nd that broke the game open assist-wise. CC also had the most turnovers in the league tonight, and twice as many as everyone in 2nd place.\n\nI was all about her at Iowa and I want her to be great, but I gotta be honest, I’m starting to understand, if not sympathize, with all these older players that have been hating on her. The media push to make her a star is so wildly disproportionate to the results she’s bringing on the court that’s it’s getting hard not to find it frustrating.\n\nCan you imagine if the top story on an NFL Sunday was about the 3rd leading receiver on the 2nd worst team in the league?",
            "If you followed her the last two college seasons, you’d know she’s very much an all around player. She’s the only player, men or women, to have a 40-point triple double in the March Madness tournament.",
            "Never mind her scoring and 3s. She's 16th in the WNBA in blocks per game, 21st in rebounds per game and 24th in steals per game from her PG position. Oh, she's 4th in assists per game as Indy's starting floor general. And she's 14th in minutes per game (33.3 mpg) which is crazy because she hasn't had a break since Iowa's training camp. \n\nThis is a rookie with an all around game. Did anyone say all she did was chuck 3s?",
            "Pssssh, wait until you see Chennedy Carter’s stats! /s",
            "I tried watching her game to see if she’s being targeted by the media but nope she’s got an awkward, non existent post game and her rebounding prowess seems more from getting her own misses (exaggerating but that’s the impression). Angel Reece might be the exact reason I don’t watch WNBA",
            ">  Angel Reese: People watch WNBA for me too, not just Caitlin Clark.\n\n\n Angel Geese: people feed the ducks for me too, not just the ducks",
            "Who?",
            "Who the f is angel reese?",
            "Another example of seeing the only hate comments dissing angel Reese unprovoked, the hypocrisy is hilarious",
            "There was absolutely zero need for you to bring Angel up in this thread. You people are seriously sick. She obviously lives rent free in your head.",
            "She’s honestly sick with it. Have you seen her ball ? You wouldn’t understand",
            "A record-breaking crowd for a rising sport that's historically been ignored featuring a good performance from the most exciting and hyped up women's player in possibly history. Yeah definitely not worthy of a simple news article posted on Reddit /s",
            "Why would I care who posts something that I find interesting? And why would anyone care about karma points?",
            "I'm not arguing with you, but having watched most of CC's games it didn't seem like a confidence thing to me.  I think it was more the ability to get some rest and practice and get to know the team after their insane schedule in the first 1/4 of their season.",
            "I hope soon she’ll get confer-table enough to go back to hitting logo threes.",
            "No.  But putting up 30 would also certainly be valuable.",
            "She played for all but the final minute of the 4th\n\nSo, yeah, strange she only took 1 shot in that span",
            "Atlanta usually play in a 3500 seat arena.  They moved to the nba area and sold out the 17,585.  Because Caitlin Clark is already a star, not because the media is “trying to make her a star”.",
            "New player brings in boatload of new fans. New fans want to talk about new player. People confused why new player is being talked about alot. 🤷",
            "You are missing the entire point.  The Fever suck and no one cares.  CC comes along and they are winning in front of massive crowds.  Figure it out.",
            "Yeah, for the most part she was putting up 40 at Iowa because she had to for them to win, but there were plenty of games that I watched where she could've legitimately ended the game with 15-20 assists if her teammates could score. She's very much a complete player offensively and now she's coming into her own in the WNBA after a hectic start to the season.\n\nShe needs to work on turnovers still, but she'll be fine.",
            "She’s the only one to have a 30-point triple double. She just did it with 40 points.  ",
            "She shoots 50% at the rim and 38% from the field. I actually watch women's basketball at times and Angel Reese is unwatchable with a terrible attitude. There are a lot of other players other than Clark that people should see but Reese is not one of them. She's someone that really didn't develop their game and got by by being physically better than people in the lower levels.",
            "I’ve tried watching games to see if we’ve all been ignoring this beautiful game.  Lots of bad and or missed passes. Lots of turnovers.  3’s outside the line are kinda cool.",
            "Yeah I remember back in the day it was cool to see Rodman throw himself across the floor trying to get a rebound but at the end of the day I was watching to see Jordan.",
            "Can you translate…lol",
            "Woah. Look at who's posting. It has nothing to do with the content. I'm sure you're a real person as well. Holy shit.",
            "She takes logo threes every game. She hit one last night with ease.",
            "If you’re being double and triple covered, it’s probably best to dish it off to the open teammate, and let her score.",
            "I’m not trying to glaze CC because she gets enough of that, but this could be just being a good teammate. Lebron has spoken about the importance of getting your teammates involved, not just for the current game, but for the next game as well.",
            "Thanks for the info.  I didn't watch the game so have no idea what happened so I will just leave it at that. :)",
            "Yeah I've watched a bunch of WNBA and frankly it's like watching amateur sports. It's just a bunch of layups and poor shooting for the most part. I have no idea why the women are so against lowering the rim. I've heard their excuse that it would screw up the game, but that's just an adjustment that would need to be made. It is some of the most unwatchable sports I've ever seen. But on the other hand, I'm glad that they are getting a bigger audience and hopefully  make more money",
            "lol ironic because my favorite player as a kid was Rodman before I found out about the off court stuff. The full extension rebound is a poster I used to have on my wall",
            "What was hard for you to understand? He said she’s sick with it. Do you need to know the meaning of that? It’s slang..it means she’s good.. you good now?",
            "Yeah, sharing is caring. 😂",
            "I caught an Aces playoff game last year while I happened to be in Vegas for work. It was horrible to watch. Being there in person and the crowd having fun helped a bit, so I could only imagine trying to watch it in my living room. The league needs to figure something out, because CC mania won't last forever even if she only gets better.",
            "I idolized Rodman. Defensive ball doesn't get any love. Rebounds are important for a reason."
        ]
    },
    "Thunder GM says Josh Giddey didn't want to come off the bench and requested trade": {
        "title": "Thunder GM says Josh Giddey didn't want to come off the bench and requested trade",
        "score": 760,
        "url": "https://apnews.com/article/josh-giddey-trade-bulls-thunder-1d8e27bfa2732f9b6a2c1160f75367db",
        "content": "",
        "num_comments": 136,
        "comments": [
            "[**Join Our Discord Server!**](https://discord.gg/233aU5q)\n\n**Welcome to /r/sports**\n\nWe created a Discord server for our community and would like to invite all of you to join! You'll be able to discuss sports with users around the world and discuss events in real time!\n\nThere are separate channels for many sports you can opt in and out of, including;\n\nAmerican Football, Soccer, Baseball, Basketball, Aussie Rules Football, Rugby Union and League, Cricket, Motorsports, Fitness, and many more.\n\n[**Reddit Sports Discord Server**](https://discord.gg/233aU5q)",
            "Caruso will be great on OKC. Trade works for both teams and both players, the Bulls need to blow it up and start over. Caruso lands on a contender, and Giddey gets a fresh start on a team that could use his playmaking.",
            "If this is true the. thats pretty stupid of Giddey. All season when OKC would do interviews they would join Giddey, or have Giddey join them to isolate him from questions about the allegations with the minor. His team backed him up when, quite honestly, they really didn’t need to. Not only that but OKC is a contender. Kind of a stupid request for Giddey. ",
            "Giddey was unplayably shitty in the postseason so OKC is great with this. \n\n\nBulls continue to be incompetent, meanwhile",
            "He needs to stop playing like shit and disappearing during games.\n\nHow a guy that goddam tall can hide on a court is a fucking mystery.",
            "Gotta save his energy for banging those underage girls",
            "What's the age of consent in Chicago?",
            "They wanted him to play more than 18 minutes a game and he wasn’t down for that",
            "Lowkey feel bad for bro cus his reputation will forever be remembered as a ped0 even though it was the girl’s fault",
            "I neger liked this dudes face, made it hard to root for okc, also sga reminds me of prince a little",
            "Suuure",
            "If Chicago can find the next Michael Jordan, Giddey will be the one laughing.",
            "Yea I like this trade for both teams. Mfs in this sub are gassing Caruso up a little much.  Yes he’s a very good player but come on, giddey is a reasonable return for him.",
            "He’s on a contract year.  Makes a lot of sense for him to want be showcased.",
            "What’s stupid of wanting to play more minutes? Also, I’d imagine moving into a new location and seeking a fresh start helps with the whole minor fiasco.",
            "Lol what the fuck kind of take is this? Good on his team for having his back. Doesn’t mean he owes them being a bench player his entire career when he is clearly capable of being a starter and able to develop more on another team with more minutes. I’m sure his team still supports him and his decision. Foh.",
            "Why is it stupid? More playing time in another city, fresh start to get back into form, which could potentially get him a nice contract vs coming off the bench. He was a repetitive piece on OKC.",
            "No.  Working with the GM instead of taking to twitter is the best thing you can do when you are unhappy.",
            "Why the fuck would he want to ride the bench when he can get minutes and start somewhere else? He needs to play to get better.\n\nThis is perfectly reasonable. He should go where he is wanted and needed.\n\nPeople here using examples of role players is crazy. This guy is a 21 year old elite prospect. It’s a totally different situation from Naz Reid or Malik Monk or whoever. None of those guys is a early lottery 6’8” point guard. It’s a great swing-for-the-fences move for a team that has to rebuild anyway.\n\nAs for fit, fit with what? We don’t know anything about what the Bulls will look like long term. They’re shopping everyone but Colby White!\n\nThis is an elite prospect for elite role player trade which absolutely makes sense because one team is the first seed contender and the other one looks like it’s headed for a rebuild.",
            "He’s known for poor decision making to put it lightly.",
            "Real stupid. He had good form before the allegations so not hard to imagine a return to it to justify a starting 5 role, and like you said, his team had his back. \n\nAC works for them though if Giddey does become another Simmonds.",
            "Giddey was bad in the post season but it’s wild the Thunder wanted to move him to the bench when the team is so young. It was basically Chet’s rookie year. \n\nI like Caruso and think this trade is good for both teams but moving Giddey for him for what his potential is is kind of wild",
            "[removed]",
            "He heard 18+ and said naw",
            "Nobody with a triple digit IQ views him as a pedo. Or at least nobody who read about what actually happened. ",
            "Just in case no one has told you before, saying it’s the “girl’s fault” is not a good look for you, G.",
            "innocent until proven guilty is an important pillar of our legal system, but just because a case falls short of that standard doesn't mean \"it was the girl's fault.\"",
            "Isn't Giddey problematic both as a scorer and defender? That's not what you want from your PG",
            "Yeah I agree. Giddey is a lot younger and is a terrific ballhandler and playmaker with a shaky 3 and meh defense, but has size and could be an All NBA talent if he develops. Caruso is an All Defense wing with a good 3 ball and with Dort, SGA and J-Will forms a perimeter defense that could be almost as good (but obviously less consistent) as the Jays, White and Holiday in Boston.\n\nPresti's starting early this offseason. Next target, a big to back up (or play alongside) Chet.",
            "No way. AC is much better",
            "Also showcased or not, the Bulls will pay him now because they traded their best trade chip for him and it would be embarrassing to lose him in free agency after that. Dude is definitely getting the bag now even though he might even be in a worse basketball fit whether he starts or comes off the bench.\n\nThis is unequivocally good for Giddey's bank account.",
            "Exactly, guys wants his bag on the next contract",
            "Slightly more minutes to leave a contender that supported you during a pretty difficult situation? ",
            "It's not stupid at all, it is a very logical request lol.\n\nThe fit on OKC just wasn't there, and they get a useful addition back. It is a good result for all parties.",
            "He ain’t no “elite” prospect",
            "I knew like 2-300 dudes in college. I knew one college dude who dated a high schooler. It was weird AF, and I think he lives in jail now. \n\nA 19 year old dude who plays in the NBA getting it on with high school sophomore is really really weird. C’mon now.",
            "Naw no one is jealous, but go ahead and defend your pedo king",
            "Wtf man 🤨",
            "Same joke, I’m at 0 upvotes and you’re at 9.  Reddit is funny sometimes",
            "I'm not super familiar with what happened, but I thought she was pretending to be in a 21+ club?\n\nIf that's not the case what did happen",
            "the girl lied about her age when they met in a club, they went home together and she came out being underage, that’s her fault no?? Do guys have to check for id in a CLUB everytime they try to hit on women?",
            "In this case it clearly is. She lied about her age, lied to get into an age appropriate venue and Giddey was misled in this encounter. It's not a difficult concept to get your head around",
            "they met in a club where it’s over 21, so she’s lying about her age then they went home together then came out saying she’s 16 then bro got sued",
            "Giddey played pretty well his first few season, in the play in game he had a 30 point triple double. He was a bad fit with the OKC line up they went with last year. His strength is play making, passing, and driving but they made him be mostly a spot up shooter which he isn't good at. \n\nHe really just needed a different situation, but now it will be interesting to see what he can do there.",
            "Isn't he problematic in the relationship he had with an underage girl? Whatever happened with that?",
            "I don't think Giddey's ceiling is anywhere close to All-NBA. He can't shoot, particularly off the dribble, and has below-average athleticism. I don't see either of those improving enough to become one of the top 15-20 players in the league. He can be an average to slightly above average starter, but unless his weaknesses improve significantly he will remain a floor-raiser and not someone who can contribute to playoff success.",
            "Just grab another former Bull in Andre Drummond. He has been very solid as a role player.",
            "Bro I’ll give you $100 if Josh Giddey makes a single all NBA team. You don’t even have to bet me. That’s how I hard disagree.\n\nActually, fuck it, all star team. Neither are going to happen.",
            "He is a great passer but poor playmaker. He lacks scoring threat and so doesn't generate advantages",
            "You mean JDub",
            "Right now. Giddy is young and fits Chicagos timeline better.",
            "Bulls fan here. In my opinion he couldn't possibly be a better fit. Currently we have 3 iso scores with no one to distribute the ball. On this team he will always have the ball to get to those scorers. That said with Caruso gone we have zero dudes on the roster who can play defense. Should be fun to watch.",
            "Also there's absolutely nothing wrong with that either.",
            "Contract year overrides that. He just wants stats to get paid. I don’t think nearly as many NBA players care about winning as we want to think. If I was on my rookie contract I’d absolutely be playing for 💰above all else",
            "you told it worse buddy",
            "They tried to frame it as that being their only encounter, but the evidence was there they were seeing each other. Dude FaceTimed her brother, got a driving ticket in her neighbourhood, etc.",
            "It's been a nonstory from the start, she was a consenting party who has lied to him in an overage venue. \n\n\nPeople have jumped on him for absolutely nothing and it's disgusting.",
            "Whether or not you agree with it, our collective society has decided that a crime like this is a strict liability crime. That means if it happens, you’re guilty. It doesn’t matter what the circumstances are. Doesn’t matter what Giddey thought or what he was told. \n\nThat means that the girl involved is a victim of a crime. You’re quite literally victim blaming. I don’t think victim blaming is a good look. \n\nAs a comment above said, because he’s rich and famous, no formal charges, but he’s still guilty in the court of public opinion.",
            "He was the victim, his career and reputation got rekt from a chick who lied and a venue which has allowed for an underage person to enter the premise.",
            "Yeah can’t believe “Giddey has All-NBA potential” just got floated out there and it wasn’t downvoted to oblivion.",
            "Andre Drummond has the on-paper thing that OKC always gravitates to (length), but culture-wise I don’t know if I see the fit\n\nHe has a “my way or the highway” streak in him that OKC usually stays away from (Melo notwithstanding)",
            "He's a RFA after next season\n\nAs a Bulls fan, there is no timeline. It's perpetual mediocrity under Reinsdorf. 3rd biggest market, and they've only paid the luxury tax once",
            "Agreed, provided chicago commit and actually blow it up.\n\nA young core of White, Ayo, Giddey, PWill isn't a bad place to start a rebuild.",
            "You guys are screwed. No team in NBA history has ever won a title after losing Alex Caruso.",
            "The problem is that your other than LaVine, those guys aren't shooters. Giddey just lets you continue to clog the paint and the midrange.\n\n  \nLike I know the Bulls aren't going to be anything other than mediocre as long as Jerry Reinsdorf draws breath, because he is content for them to be the 8th seed and sell season tickets, but this is bafflingly bad value for them. Giddey is an okay regular season player who doesn't play defense or shoot and is only good and not elite an initiating offense.",
            "Being on a contender can help with that though.\n\nGot Bruce Brown his bag.",
            "Malik Monk got paid today, and he isn’t a starter and he is way better than Giddey. And Giddey had starting minutes last year. You don’t have to start to get paid. Naz Reid is going to have a massive contract next summer, and he doesn’t start. ",
            "Thank you for your feedback Ed the Taco Farmer.  I hope your erectile disfunction sorts itself out soon",
            "With these facts and details . Giddy knew . Didn’t expect to be caught or felt he was about the law . Having money got him out of it . Family settled for a bag . He wasn’t charged but he’s guilty . Period .",
            "You *can’t* consent if you’re under 18 is the point you’re missing.",
            "Joe Ingles with no shot potential.",
            "That team would never go anywhere though. That’s a start of nothing.\n\nYou can put MJ on that team and it’s still not championship contending.",
            "Sad face.",
            "Yep",
            "I think that’s true for an off ball player. On ball players like Giddey tend to do best when they just get increased usage. Spot up players that are big on hustle absolutely want to be near a LeBron or Jokic type superstar",
            "Bruce Brown isn’t a high lottery pick that is a highly rated prospect. It’s a completely different situation.\n\nThis guy could still be a star. Brown was never going to be more than a role player or 6th man.\n\nThis guy is a 6’8” point guard that has elite vision, and could still develop to handle the glaring holes in his game. He’s only 21.",
            "Giddey was absolute dogshit in the playoffs. No one will pay big money for that performance. He needs to prove himself on a different team because okc has little incentive to give him a bigger role",
            "Doesn’t matter, you have a better shot with more minutes. Plus more things to do in Chicago. Basketball is a job for 75% of the guys in the league.",
            "It’s not just starting, though. It’s minutes and wanting the ball in his hands. Lonzo’s likely gone and there’s a good chance Lavine is too. If his usage goes up he’ll have a better shot at securing a contract",
            "So two 17 year olds are sexually assaulting each other if they have sex.\n\nTwo parties, with birthdays _one day_ apart, are the perpetrator and victim of a sexual assault if they have sex on just one single arbitrary day, the 18 year olds birthday, since the other party is only 17 years and 364 days.\n\nThat is your argument if there is 0 nuance.",
            "Thinking most people can clearly identify the difference between someone who was a willing participant in interpersonal relations & sexual assault. \n\n\nPeople calling him a pedo typifies the lack of logic presented with a player that's not actively targeting or pursuing younger partners. \n\n\nThe amount of high horses ridden in relation to this story is unfathomable",
            "Joe didn’t deserve this stray",
            "The point isn't to contend now, as a lot of Bulls fans would tell you. It's hopeless trying to get this roster to contend.\n\nThe point is to rebuild and retool properly, instead of being a perpetual 8th seed like the Bulls have been for the better part of a decade.",
            "He's playing out of position isn't he.",
            "I can’t think of too many examples where you surround yourself with far less talent in a new system and get better. ",
            "He was. Shai is an Mvp candidate who 100% deserves the ball as much as possible. So that means Giddey plays offball. Issue is Giddey’s strong suit is his passing and his glaring weaknesses are his shooting and defense. He just makes it harder for Shai to play when they share the floor",
            "He has a better case of showcasing his stuff in the Bulls averaging 30 min as the primary ball handler than in okc averaging 20 as the 3rd ball handler. I still think he’ll be ass tho",
            "Harden comes to mind"
        ]
    }
}