{
    "Spotify Support/Complaint Megathread": {
        "title": "Spotify Support/Complaint Megathread",
        "score": 229,
        "url": "https://www.reddit.com/r/spotify/comments/184e989/spotify_supportcomplaint_megathread/",
        "content": "This  subreddit is mainly for sharing playlists. Please keep all complaints  and support questions within this thread. Posts concerning these  subjects may be deleted. This subreddit is not endorsed, sponsored,  moderated, or supported by Spotify.\n\nPopular topics include:\n\n* Shuffle  sucks, shuffle isn’t really random, shuffle keeps playing the same  songs, I have a huge playlist and Spotify only plays the same songs. \n* Spotify for android doesn’t work, Spotify desktop doesn’t work, Spotify iOS doesn’t work, Spotify app on different devices don’t work\n* Downloaded songs don’t stay downloaded\n* Sound quality on PS5 is terrible\n* I want to share a Spotify subscription with strangers across the world, will I get caught?\n* I want access to choose my own songs and create playlists, but I won’t pay for premium\n* Why is (artist name)’s music not available?\n* I want to make playlists longer than 10,000 songs\n* Podcasts:  suck, are great, have embedded ads, i do not like their existence, i pay for ad free music why am I getting podcast ads?\n* Spotify Wrapped: where is mine? when do they stop tracking, mine is not accurate, mine included songs i listen to while i sleep\n* The new UI is horrible. The new update is horrible. The new feature is horrible.\n* AI DJ is terrible, not available in my are. \n* Spotify's recommendations are terrible\n* Spotify stopped supporting Car Thing \n* Spotify made lyrics a premium feature, they aren’t accurate, how do I report them?\n* Spotify removed the hearts and I now can’t remember what songs I like",
        "num_comments": 2292,
        "comments": [
            "Just tossing in my dislike of them taking out the like/heart button and putting in this annoying af add button in it's place.",
            "I just wish they'd remove this useless smart shuffle so I can shuffle my playlists in peace again",
            "i'm a very organized person but spotify is not and it annoys me so much\n\nwhy are there identical versions of the same album created all the time? (i'm not talking about clean/unclean versions or deluxes). i hate going through artists pages and seeing i don't have their albums saved, when i really do but it's just another identical version that magically appeared on their profile. or looking at playlists and seeing that songs i do have saved don't appear with a like because it's a different version. PLEASE SPOTIFY is it really that hard to just not duplicate the same versions of songs and albums? or to recognize that it's the same product?",
            "Bro get the like button back on desktop. wtf is that shit... in a playlist, i have to hover on a song, click on the checkmark, scroll to find the Liked song \"playlist\", click on the check mark, then click done??? come on\n\nThe new the add to playlist when i can see everywhere the song is added is nice tho, just get the heart button back (maybe add another button for add to playlist)\n\nAlso, i'm still mad you combined the song and artist column years ago...",
            "This new layout is the absolute WORST incarnation that Spotify has ever put out. It is unbelievable that they would remove functionality like this.\n\nWhy the FUCK can i no longer view the songs/albums/artists in my library at the same time as viewing a list of my playlists????\n\nI can't drag and drop albums onto a playlist anymore without manually searching the album name? and it's not searching my library it's searching the overall spotify collection which means it's going to include songs i exluded from my library.\n\nWHO DESIGNED THIS??????????????????\n\nThey've actually lost me as a customer now. I've been paying for premium for 13 years. FUCK YOU SPOTIFY.",
            "I just want to say that all of Spotify’s UI devs should be fired and just don’t hire any more. You people are idiots who keep pushing out useless UI changes that nobody wants nor asked for that never fail worsen the experience each time. The existence of your jobs is to keep pushing out garbage UI updates. Just leave it as is so it doesn’t get any worse holy fuck",
            "I'm annoyed that clicking the album art (bottom-left on desktop) no longer takes me to the song in the playlist. This was very useful in long playlists. Now I have to scroll through potentially hundreds of songs.\n\nThere are TWO buttons to open the Now Playing panel (the album art, and the button next to the lyrics button), but NO button to take me to the song in the playlist. \n\nIt also no longer takes me back to the playlist if I've navigated away from that page. This was useful to quickly get back to the playlist. Navigating back to the playlist now requires multiple clicks, instead of the single-click it was previously.",
            "im so mad with this new desktop UI oh my god... everyday it gets WORSE! months ago i already accepted the fact that accesing my saved albums list is now a pain in the ass, since for whatever reason its now located in the same left section of the screen i used to check my playlists, fine. later i accepted the fact that the album artwork is now in the same right section i used to check the \"friends are listening to\" tab and i can't see them at the same time anymore, whatever. but now you're telling me THE DAMN QUEUE IS ALSO GETTING MOVED?? WHAT THE FUCK!! the middle section (which is supposed to be the main section) is a waste of space now since it has become useless, it was the perfect place to check my queue and albums and now they just shoved every useful menu in two tiny sections in my screen that already had their respective functions, not to mention the fact that when you make them bigger it looks completely awful. i'm downloading an older version of the app, i'm not doing this shit anymore lol",
            "How do I stop Spotify from playing liked songs playlist automatically in the car? As soon as I start the car and phone connects to my car via Bluetooth it plays the first song in my liked playlist, even when I had another song “pre loaded” from last time I used Spotify. It’s super annoying. Tried to google the answer but it only gives me the answers relating to auto play similar songs which is not what I’m after.\n\nEdit : I’m on an iPhone up to date version of Spotify",
            "Yup bring back the like/heart button. It was so much better for tracking songs, marking/tagging them etc. Binary yes/no. The new auto hiding playlist button is a lot worse.\n\nI would use the heart button to track how far down I had listened in a playlist. Songs I wanted to go back to etc. It was very good just as a visible tag, now there is no way to mark/categorize/comment/tag a song. Very sad.",
            "How the fuck do these fucking updates keep getting past QA at Spotify. Do they not have any form of QA at all? My queue is now at the far side of the window in a much smaller pane where I can't even press the delete button to delete songs from the queue. Literally for what reason is there to make this update? It makes my user experience worse and serves literally no benefit to me. Fucking unbelievable how they keep making the shittest UX changes known to man for seemingly absolutely no reason. \n\nLast time they removed the ability to have the art of the song be larger by adding the terrible now playing pane on the right. Now I can't even have that open if I'm in my queue. What is the point.\n\nJust have it so that when you access the lyrics of a song *and* the queue, the queue moves to the sidepane. Until then, let it stay as it was. Pointless and shit update.\n\nEven down to the basic stuff. Why is the order of buttons Now playing (1), lyrics (2), queue (3), when (1) and (3) affect the sidebar but (2) affects the main window. Put the shit that effect the same area of the screen next to each other. \n\nWho the hell is being paid to make this UX vomit",
            "Why the fuck is the queue now this shitty little menu to the right? Now I can't see/manage my queue while I have now playing on the right. Another braindead UI update",
            "My Spotify wrapped is full of songs I’ve never even heard of? There are a lot that I have listened too. But around 40% I’ve never seen before in my life. Any ideas?",
            "You haven't mentioned song duplicates. God Spotify sucks.",
            "let me block songs and artist from ever appearing again",
            "I know this sounds crazy, but maybe put \"This subreddit is mainly for sharing playlists. Please keep all complaints and support questions within this thread. Posts concerning these subjects may be deleted. \" IN YOUR SUBREDDITS RULES?!? You know that very convenient list of things you have to the right side of the screen?!?",
            "There’s just no easy way to tell what songs I’ve liked or not and it’s so frustrating. Please fix this Spotify, it’s the worst decision made since I’ve started using the service 5 years ago. I don’t need to know which songs I’ve added to any playlist I’ve ever made, just the songs I’ve liked. Please. I’m sure everyone agrees with me on this.\n\nEdit: I’ve seen a lot of people echoing the sentiment but I’ll refrain from deleting this to show how in consensus we are",
            "Constant crash on launch with the latest beta on Android. Any fix?\n\nTried wiping cache and storage, uninstalled and reinstalled, rebooted, nada. Old APKs aren't available because Spotify sucks and DMCAs them, so can't test multiple versions to isolate the issue.",
            "Every single one of my playlists has had a random song moved to the start of the playlist. I mostly make playlists of albums so this is very annoying. Any idea what could cause thus?",
            "[deleted]",
            "Why would I use this for complaints and feature request? It's a 3 month old megathread where new comments get buried... Perhaps that's the point though...",
            "Desktop app just updated and OOOOOOOOO it’s pissing me off BAD. The queue moved to the right-hand side where friends activity is, which wouldn’t be an issue except when you close the queue it ALSO closes the friends activity. WHY",
            "Please stop forcing a UI change every few months. Why cant I move the current playlist to the middle like it used to be, why are you forcing it to the side where the band info usually appears? I just dont understand why you keep making this app less user friendly with every update?!",
            "\\>I want access to choose my own songs and create playlists, but I won’t pay for premium\n\n&#x200B;\n\nI'm paying for premium, so why can't I listen to my computer files on my phone?",
            "Is anyone having issues with Spotify right now? I'm on a pixel 7 and Spotify is opening, but then a black overlay hits the app and I can't do anything. I've forced stop the app and restarted my phone. Any ideas?",
            "Has anyone figured out how to share a personalized Spotify wrapped story link? I’d like to share my whole Spotify wrapped story and see my friends but every link only shows an image of one of the stats and then uses a dynamic link that goes to the wrapped story for whoever clicks it. Do I really just have to screen record to share the whole thing?",
            "Worst app ever on android. Yikes",
            "Has anyone managed to get Local Files to actually work? I have a few albums and songs I've tried to add so many times but they break constantly, randomly getting removed, not playing, album art dissapearing, tracks doubling.",
            "I'm so genuinely upset with this app. Particularly the smart shuffle, i never use it because it works so poorly but now it randomly pops on and refuses to turn off. However the worse change is the stupid + button now doesn't let you add songs to playlists or liked songs if youre offline??? Wtf. You cannot make playlists or remove songs from playlists unless your are connected to the Internet. Also how the heck am I supposed to see what songs are in my liked playlist at a glance when looking through playlists..",
            "Is there a way to roll back all those horrible updates and get back a version of Spotify that has hearts and is capable of jumping to current spot in the playlist?   \nWith the way the updates progressively make user experience worse, I'm scared to think what features they will remove next.",
            "Okay. I spend $70 on Car Thing expecting my product to work and you’re just going to discontinue its operating capabilities? That’s unfair to such a high degree. I pay for the service monthly and I paid for your product. What the hell.",
            "How about you continue to support the PRODUCT YOU MADE. \n\nCar Thing deserved better.",
            "Some of my local files are deleting off my phone and when I redownload them, they delete again. I saw somewhere that it might be because of certain symbols in the file, but the post I saw that on was from 6 years ago and its never happened until now. I've had the files for almost a year now and they are just starting to do it. Does anyone know how to fix it?",
            "Anyone else having trouble with spotify pausing your music every few seconds?",
            "Anyone else’s iOS app keep crashing randomly in the middle of songs? I’m updated on the latest iOS version, and as far as I know the app is as well. Been happening for a week or two for me",
            "Why make CarThing non functioning when it’s perfectly fine. Wtf",
            "I can't play downloaded songs. I'm on Android on Pixel 6. I can play the same song through the search function. I can play non downloaded playlists. Just not downloaded songs.\n\nTried forcing the app to stop, clearing cache, restarting, reinstalling... Nothing.\n\nI made a long post on their support website, posted, but got a random error and lost the post...\n\nReally disappointed with this BS.",
            "When I click on play radio and it creates a playlist for my user it doesn’t include anything new or by people I’ve never heard or played. \nHow do I create a playlist of new material based on a song or album I like? Thanks",
            "My Spotify puts songs on repeat as a default setting - anyone know why this happens and how to stop it?\n\nHas been happening for ages and only on the iOS version.  I bought a cheap android when my phone broke but needed one for work and when I was using that I noticed it didn’t do it. \n\nI’ve looked in my settings for anything obvious but can’t find anything… anyone have any ideas?",
            "i updated my spotify app and now the layout keeps glitching in ways that it definitely didn't before the update",
            "My spotify wrapped is all messed up because my husband plays sea shanties on our alexa echo dot and it streams them from my spotify? Is there a way to make alexa connect to his spotify instead? We have a spotify family premium account and only 1 Amazon account. Thx",
            "How do you make it so spotify is giving you new music without me having to search specifically for it myself? \n\nHow do I make shuffle, like, SHUFFLE?",
            "The most recent app update for IOS is killing my phones battery, the app constantly crashes, and load times are horrible. Before (while phone is in airplane mode), I would listen to podcasts for about 9 hours a day at work and leave work with about 40% battery left on my phone. Now my phone only makes it about 4 hours in to the work day and its at 20% battery, while the app crashes and takes forever to load ANYTHING even offline downloaded stuff.\n\nSuch a shit fucking app, I didnt think it could get worse.",
            "The changes to liking songs is awful and makes the whole experience slower.",
            "Whatever I'm listening to will abruptly switch to a random song in my general liked songs library whenever I switch *how* I'm listening. For example, I was just in my sister's car and had my phone plugged into the aux. We were listening to a specific playlist and when she dropped me off at my car, my phone connected to the Bluetooth and the playlist suddenly switched to a random song in my liked songs. Despite picking a random song, shuffle will be turned off too. Sometimes it will happen as a song is playing too, as if it took a few seconds to remember \"oh yeah, I'm supposed to do this completely annoying and unnecessary thing for no reason!\" fwiw, I listen on iOS.\n\nI've also had it happen when I stop listening on my AirPods for a while and then start again hours later.\n\nHas anyone else been dealing with this? If so did you find a way to fix it?",
            "The biggest issue with the like button is that it removes the entire point of having a liked songs in which you can instantly add or remove songs you  like to a congregate, After 2k songs,  and a weak shuffle function there will be songs you constantly lose track of and simply want to cycle back to the top. playlists are curated, Not organized.  I'm not adding a song to a playlist after 1 listen, some music has poor replay value. \n\nAnd smart shuffle is cool but it's so poorly designed that it gets in the way of typical  toggling of regular shuffle.\n\nBoth of these issues could be fixed by a long press/hold feature.  And  would streamline the experience, for new users,  and experienced listeners.  but I didn't think it took a genius to understand this.",
            "I haven't been getting the lyrics to most songs i've listened to since around september/october. I'm on the windows app, it'll show me the mic button but it'll say \"we don't know the lyrics for this one\" even if the lyrics are on musixmatch. I've tried clearing cache, logging off and on, uninstalling and reinstalling. Any reason or does spotify just hate me?",
            "Every single song has “couldn’t load lyrics” and it’s so annoying",
            "Can you please make the default indicator in a playlist whether the song is liked or not, not whether its somewhere in ur libary of potentially a hundred playlists, again.  \nIs there perhaps some 3rd party client than does this ?",
            "I'm confused right now. If I like a song, why does it add it to my most recent playlist? I want it in Liked Songs, not that playlist. I don't want to add a black metal song to my 2000s Songs playlist just because I liked it. What the hell is this BS?",
            "Is there a way to add multiples of same song now? I cant seen to do it :(",
            "Make smart-shuffle hold to turn on. I often go from shuffle to not shuffle on the phone and often without good service it gets stuck trying to load smart shuffle",
            "Does anyone know a fix for local files becoming grayed out on mobile? My playlist had files from my computer and they all worked just fine yesterday.  Then when I went to leave for work this morning every single local file song was unavailable despite  having worked just fine for months before and even when i manage to get them to download again to my phone, like an hour or so later they'll all gray out again and its super annoying and nothing I've found online has fixed it.",
            "Can anyone direct me to a way to chat with spotify support? I lost access to my premium account because i cant access my facebook anymore and honestly im a couple of days from just cancelling and uploading my playlists while i still have desktop access...",
            "For the love of God just remove ambient noises from taste profiles and recommended playlists. Just don't make them appear ever!! No one wants a discover weekly or daylist of brown noise just because they listened to it while sleeping a few times. Ffs.",
            "For unknown reasons spotify decided to change the sequence of songs in my playlists. Not just one, but all of my created playlists.\n\nI really hate this. I know I mostly listen to them in shuffle or starting from the middle. But I don't like other party messing around with my playlists.\n\nI don't think that I shared them that made editing possible.\n\nThis and ads on spotify exclusive podcast are beginning to make me considering switching.",
            "Spotify app is crashing on my fire tablet (the one I use the least so that's why Spotify is on there) super frustrating. It's not just me though cus my friend's granddaughter has the same issue on her fire tablet",
            "Are they going to fix the first song on the playlist bug or what?",
            "A few weeks ago, the app started acting up, I’ll listen to something for a little bit and then all of a sudden the app just turns off, and I have to click on the icon again to get back in and start with you so again, sometimes from where I left off or in the very beginning of the song. It happens repeatedly I don’t know why. Sometimes it might be because I have two different Bluetooth items on the same time but I’ll turn one off and send you a podcast and it’ll stay on for a while and then sometimes it keeps going on and off repeatedly anyone have the same issue what the hell do you do. I’m also using an iPhone.",
            "Is anyone else having issues with Spotify not playing the next song in your queue/playlist after the current one is over? It's so annoying having to manually go into the list and choose the next song myself, especially when I'm trying to do something else while Spotify plays in the background.",
            "Edit: I rolled back to an older version (the Jan 24th update) and everything works as it should. Something about the Feb. 1st update broke something.\n\n&#x200B;\n\nI have some High Quality Rips that I like to listen to in between new artists I find on tiktok, friends, etc.\n\nNow my rips will NOT stay downloaded on my android app. I assume because I get them all from Youtube (cuz they're remixes), Spotify doesn't see them as legit and doesn't want to sync them to my phone anymore.\n\nJust SUDDENLY this was an issue on the 1st of the month. So needless to say, I'm quite annoyed.\n\n&#x200B;\n\n(Also, the smart shuffle unloads all Local Files, so when I shuffle and suddenly don't I just click the shuffle button and it goes to smart shuffle first, unloading my local files. this is such a pain.)",
            "Is there any way to customize the home screen? I've got zero interest in Episodes for you, Editor's Picks or Popular Radio. And on that note, is it possible to have a \"region-agnostic\" profile? I don't care about this region's local artists - I hear enough of them on the radio!",
            "At this point I would pay to opt out of Duo emails and pop ups. I live alone. Quite happily. My dog is not interested in music. Stop asking me to subscribe to a useless-to-me service multiple times per day.",
            "Did the queue page change for anyone else? Seems way worse now. It's small on the right of the Mac screen and you can't drag multiple songs at same time to change the queue like I did 3 days ago",
            "The 4+ year old issue where [podcasts randomly skip to another episode](https://www.reddit.com/r/spotify/s/xIvbdPsomT) is still ongoing, not fixed, and nobody at Spotify seems interested in doing so",
            "Fuck.\n\nAdvertisement.\n\nIn.\n\nPodcasts.\n\nJust delete the \"feature\".",
            "So uh, gatekeeping fucking LYRICS behind Premium is a thing now!\n\nwho with the mulched fucking brain at Spotify decided this seriously",
            "The windows desktop Spotify app keeps throwing up a \"spotify can't play this right now if you have the file on your computer you can import it\" whenever I click the repeat button on \"Wonderwall\" by Oasis. It does this AS it's playing the song lol....",
            "Whoever approved paywalling lyrics, I hope you get bed bugs tonight.",
            "Spotify on desktop just isn't working it gets stuck everyone and then doesn't let me pause aur skip lyrics or doesn't play idk what to do at this point",
            "Has Spotify has been glitching like crazy lately for anyone else? I've been getting major lag or \"network error\" messages when I try to pause and skip tracks. Sometimes it just doesn't work. I thought it was maybe just a problem with my desktop app so I switched to the web browser. The web browser isn't giving me any issues when pausing or skipping tracks but it has a whole other set of glitches, yay. It's very laggy when trying to add songs to a playlist or the queue and when searching. \n\nI don't know if something's been going down at the Spotify headquarters like they just layed off a bunch of employees or if people have been quitting en masse so everything's breaking because It's never been this glitchy before.",
            "Last update of this fucking deadbrain app finally made lyrics a premium feature.  \nDoes anyone know any other good music streaming apps?",
            "Spotify will not stop telling me about 30 Seconds To Mars' new release and I have zero interest in it. I have absolutely no idea why it keeps telling about their new release as I haven't listened to their music at all. I do not care for them and it's deeply aggravating that their shit keeps being recommended.\n\nI've clicked the \"do not recommend artist\" button on their profile but that appears to have done nothing.\n\nAm I going crazy? Has 30STM some how done a U2 and forced themselves upon my account?",
            "that new \"resuming playlist\" voice is so fucking annoying",
            "spotify locked lyrics behind the premium paywall within the last week or so.",
            "Yes, Spotify app, I understand that I can change the playback device here. I understood it 100 notifications ago. How is it that you only feel like telling me this when I need to touch something under your stupid, redundant tooltip? At least make it easy to dismiss this message or prevent ALL TIPS. I don't need help with how to use fucking Spotify! I've even used the feature before, so I obviously don't need to hear about your \"innovative\" new tool. Piss off",
            "Suddenly getting a narration voice when opening the app that then is followed by an ad. I have had premium for like ten years. I was listening to podcasts but have never once actually experienced an ad with them after hundreds of hours of listening. What’s the deal? I’ll cancel without a second thought if they’re introducing subscription tiers or something.",
            "apparently lyrics is now premium \"[feature](https://imgur.com/a/pFuva1C)\" as well.",
            "Who's excited for another inevitable price hike to pay for [content you don't want](https://variety.com/2024/streaming/news/spotify-stream-nebula-videos-1236023671/)?",
            "\"You can't join this plan - You can join someone elses premium plan every 12 months.\"\n\nJust purchased a family plan mainly for my kids, previously they we were on my wife's family plan which is now cancelled. \n\nWhat kind of rule is this? Makes no sense that I can't add my kids (who live with me) to a family plan. Tried to contact spotify support, but it doesn't seem to exist???\n\nSeems like a nasty policy designed to stop abuse without any consideration for genuine families... and there's no way to raise it with the company!",
            "Since a few days (I think since the latest update) Ctrl+A to select all songs in a playlist nor Ctrl+V spotify URIs from Excel to a playlist stopped working on the desktop app. Anyone now how to fix it, or have a link to an announcement that and why this feature was removed?",
            "Hello, i have a problem. With the new Spotify update i can't add all the tracks from one album to my liked tracks, now i have to manualy like every track from an album and i don't want to do that every time i want to add a new album to my liked tracks. Help me please !",
            "I don't listen to that many podcasts but I started listening to Dissect. I know there's ads in all podcasts & you can fast forward 15 secs through them (which is annoying in its own right) but what the hell are these unskippable ads on Premium?! I can forward through Apple & Volvo, but for whatever damn reason there's NO CONTROLS that show up during the Family Fare (grocery store) commercial?!?",
            "How does this app drain my battery so bad? I only play downloaded music and podcasts with my screen locked.",
            "Can't use Alt+Shift+4 anymore to see my library in full on desktop, this sucks.",
            "Anyone else’s Spotify iPhone app being really glitchy? Every time I press pause, play, skip etc it lags by about 5-10 seconds. Also issues with loading things (example: just clicked on an album, it loaded the track list but no artwork and no play button). I’m on the most up to date version of the app and have tried clearing my cache.",
            "Opening Spotify in my browser turns my left monitor off.",
            "It's getting really hard to LIKE you anymore, Spotify...\n\nFirst, you removed the heart visibility from mobile.  \nNow you've taken it away from the desktop version, too.  \nWhoever is in charge of your UI/UX needs to explain these terrible decisions to the community. These are basic yet crucial features that make finding favorite tracks in an album or playlist easy and painless.  \nMaybe it's time to take my heart (and my subscription) elsewhere...",
            "Has the Spotify website been buggy for anyone else the last couple days? Songs take \\*forever\\* to play when I click on them and lag for several seconds to minutes, assuming they even play at all, and the UI seems to be buggy too with the formatting of album and playlist texts looking weird. I've tried restarting my browser, restarting my laptop, and clearing cache multiple times to no avail. I just tried logging out to see if that would help anything, but that turned out to be a mistake because now whenever I click the login button, I'm met with a blank screen eternally loading and can't log back in. 😭💔 No other website or program on my laptop is acting like this, it's just an issue with Spotify. I don't know why; it was working just fine several days ago.",
            "On Android, how come swiping the widget away from the notification window doesn't make it go away? It always comes back. Instead I need to open the app, then kill it.",
            "Flumes song Rushing Back has been on my daily playlist for a long time, and for the past week, whenever it plays that song something super techno is playing and the album art has changed. It’s not that song AT ALL. How can I report this issue.",
            "Issue for me: Spotify's Error- \"Sorry, we can't play this song right now...\" (we played it about 2 seconds ago perfectly fine) \"...if you have the file you can import it.\"\n\nI have rebooted my device twice, relogged, and reloaded/disabled my ad blockers too many times to count. Nothing works. Can I get some help, please?",
            "I went to Joe Rogan’s page and selected “hide this artist,” so why are they still pushing his dumb fucking podcasts on me?\n\nI’m not supposed to see any shit from the “artists” I’ve hidden, why do these come through anyway?",
            "my spotify family plan has expired, now can I renew it and use the family plan again? It doesn't work when I do it. Can only the plan manager renew plans?",
            "Spotify deleted my account randomly then when I tried getting it back they told me they can’t cause I made it through Facebook 😔 years of stats and all my liked songs lost",
            "I am unable to pause podcasts on spotify android app. As soon as I pause podcast, a second later it resumes automatically. I have to close the app to stop listening. I tried reinstalling app but it did not work. Anyone faced any similar issue or has any solution to it?",
            "Ok, so I have a Spotify Duo account, and Amazon Alexa. I would like for my daughter to be able to listen to music on spotify on an Alexa device in one room, and me to listen to something else on Spotify on my phone (either broadcast to a room, or in the car, or headphones, etc). I can't seem to figure out the workaround. Since I have a family account and multiple people in my \"Amazon Household\", I feel like this should be possible, but googling has not gotten me a good answer, so I find myself here.",
            "In some of my playlists the songs get rearranged which is super annoying. It's mostly the first song. If I try to put it back another song takes the place or I can't see it in the arranging mode. And because of that I am unable to see or play it first song of my playlist, but it shows the cover on the overall playlist cover.\nDoes anyone else have this problem or knows how to fix it. (Already tried clearing cache, forced stops, and restaring my phone entirely)",
            "Anyone else been experiencing Spotify stopping when opening just about any other app? It’s never been an issue of mine until the last day or two. Reddit, IG, a couple games, even Safari, among others - opening any of those just kills the music",
            "I can't use the Windows app anymore - it's become completely unusable. The search page has been totally blank for a while now, it just shows recent searches and nothing else. Now I just can't get songs to play at all, I had to restart the app to get it to work. \n\nI've decided to switch to the web app, which seems to work fine and even has more features than the dedicated app (the queue showing on the right is a great idea!).\n\nThere's clearly some really good design ideas at Spotify, the mobile is pretty good in my experience. I just don't understand how their PC app has become so useless, worse than using the website!",
            "A little rant.\n\nSpotify still replaces the first song of every playlist with a random song from that playlist. The actual first song is somewhere in the middle. I can't change my playlist order at all. Changes are just not saving. So it's a 'known bug' that's still not fixed, and it's driving me crazy. I pay for Spotify, I expect to AT LEAST listen to songs in my own order.\n\nI post my issues as a review on the playstore, and the review gets blocked because it apparantly contains political or social commentary. Like, *what?*",
            "I have a lot of local files on playlists, every time Spotify changes my shuffle to smart shuffle, it temporarily \"removes\" local files from the playlist. Plus I feel like its playing 30 songs over and over on shuffle.\n\nI don't know if it's just me, but for 2 weeks I've been listening to a playlist on a regular shuffle, suddenly I hear a song that isn't in the playlist, I look at my phone and I have smart shuffle. And so sometimes it changes several times during a 2-hour session of listening to music.\n\nI'm seriously starting to consider changing the app",
            "does anyone know if that update Spotify implemented a while back, that added a notification tab for followers & playlist likes, is still available to users? I never got the notifications tab myself, but I know there were many that did and talked about it. \n\nit seems like everyone just stopped talking about it, so did Spotify get rid of it for everyone or is it still available for some users?",
            "is spotify removing songs from playlists for anyone else? please help i have a 3k song playlist and a bunch of songs are gone for it and i never noticed until the new update cause i had them all downloaded and used the download icon to see what was on there",
            "My toddler grabbed my phone the other day and was poking around for a minute or two. Since then, whenever I play my music, it will not stay on shuffle mode. If I stay in my liked music, which is where I play everything, it'll stay that way, but if I back out and go into podcasts or play a shared playlist with my wife, the shuffle settings reset. \n\nI have never had this happen before. Did my little one do this or is this the app itself?",
            "Only here to say every time the App updates I think it somehow gets worse.",
            "What the fuck is this new interface? Only the \"YouTube shorts\" interface, no recommended albums or playlist. If this doesn't change I might switch to Tidal completely.",
            "My Spotify app on my Android (Galaxy A13) phone randomly pauses the song I'm listening to without my input, making it impossible to listen to music. The issue persists on both Wifi and data, and songs I have downloaded (both on Spotify and local files on my actual phone). These are the things I've done so far to try to fix it:\r  \n\r  \n\\-Cleared cache & app data\r  \n\\-Listened on Wifi and data\r  \n\\-Logged in and out\r  \n\\-Uninstalled and reinstalled the Spotify app\r  \n\\-Restarted phone\r  \n\r  \nThe issue has not stopped after doing these things. If anyone has a solution let me know, I'm incredibly stumped",
            "Am I crazy or does it not stay on shuffle anymore? And queing up a song from my liked songs will then cause it to play anything else in that particular search.. super annoying, been happening for a couple weeks now. ",
            "Spotify has a recommendation section that is based not on your profile or tastes, but rather pushing whatever they think you should see, probably sponsored. \n\nI'm talking about that list reserved for playlists based on holidays, national events, stuff that is popular on your country, or other celebrations. And there is no way to hide them forever.\n\nThis is supposed to be just a music streaming platform and you're also a paid costumer, you should have the ability to choose what you want to see. If someone wants to listen to garbage, they can look it themselves.",
            "So, I'm having a... rather odd issue I think. I can only open the first song of an album? Any other song on an album gives me the \"Spotify can't play this right now\" error. I'm on desktop & premium. I've gone through all the troubleshooting steps I can find, from a fresh reinstall to disabling hardware acceleration",
            "Why aren't my downloaded songs playing in my liked songs anymore?",
            "Anyone else having issues? None of my downloaded song in liked songs were working. then no songs in bottom half of liked songs worked(unless i used search to get to them) I tried a reinstall and now if i try to open my liked songs i just get \"Somthing went wrong\" with \"Try again\" button which doesn't do anything when tapped.",
            "So I'm listening to one of the auto-generated 90s hip-hop playlists, and I notice that it's got like a full 15 second crossfade.\n\n\nI have crossfade turned off, so I'm looking online for why this is happening, and it turns out that some Spotify playlists have a playlist-specific crossfade, and you can't turn it off.\n\n\nI cannot stress enough how much this sucks. You should be able to turn off crossfade universally, or at least have the option of disabling it on specific playlists.\n\n\nIt's cutting off huge chunks of songs. It's not good crossfade anyway, you can barely hear the next song until the first one is over, so you'll just be thrust into a new song like halfway through the first verse.\n\n\nI don't even like *good* crossfade. The fact that this is a mandatory feature of this playlist really sucks.",
            "I have spotify premium the student plan and for whatever reason (Or I never noticed it), whenever I go on spotify on my phone, search, then pick a song and it plays through until the end; Nothing plays after the song ends, the song pauses and resets like it never played in the first place.\r  \nMy issue is that usually after the song ends it'll recommend me similar songs but now its not recommending me anything at all, I have autoplay turned on and this is happening both on my pc and my phone so I am unsure as to how to solve this issue.",
            "How can I fix my autoplay on spotify? I didnt have this issue for a good while, but back then I could fix it for a good few days by turning autoplay off and on. Now, nothing seems to work. I turn it off and on, nothing, I log out, I clear cache, I fully delete it, and just nothing seems to work!! It really is frustrating to have this issue and I can’t rely on any of my friends or relatives since they aren’t experiencing it!",
            "Hey y'all, I used to use Spotify, but I switched to Tidal after Spotify announced they were changing their royalty system that would screw over small artists streaming revenue. I received an email a few minutes ago that Tidal is going to combine their subscription plans into one, at the same price as the lower cost tier originally was, while giving everyone their most premium audio quality tier. I don't believe Tidal has a free plan yet, but if you already pay for Spotify, you can switch to Tidal, pay the same price per month as Spotify, and get music quality that is WAY higher than Spotify, as Tidal doesn't compress the crap out of their audio like Spotify does. Not to mention Tidal carries more music than Spotify, AND they pay their artists almost 4x as much as Spotify, which means you switching does way more to financially support the artists you listen to.   \n  \nThere are also third party websites that will automatically switch over your entire music library from one platform to another, including playlists you created.",
            "Does Spotify have bots writing reviews on playstore cause there is no way such a dogshit of an app gets 4,4 stars.",
            "Since iOS 17.4 I cant change the volume with Spotify connect",
            "Spotify keeps pausing on both my pc and phone as well as web player? I cleared the cashe, checked settings, logged out on all devices. Anyone know a fix?",
            "I continue to get playlist that feature songs from last week or songs ive clearled disliked in the past. CS has been of no help, where do i go from here and has anyone had luck with complaints and resolutions that actually work to make this worth fighting for or should i just move onto another app...",
            "Just launched Spotify on my phone after listening to this week's Release Radar on my computer all morning. The version from last week glitched into the current version and replaced all but 5 tracks with the old ones. I've removed all the old tracks, but it's now just the 5 new ones and I can't see any of the new music that was there. Tried to go back to my computer and the sync function updated that, too. I literally watched as all the new music just disappeared in a split second. 😭",
            "The AI DJ is unbelievably terrible.",
            "Travelling around South America so WiFi can be unreliable, it’s really annoying that if you’re offline and suddenly go online (or vice versa) Spotify sometimes shits the bed and won’t play the song/podcast until you go off and come back. \n\nIf I’ve downloaded something offline, just play the offline file. Stop trying to stream the online version!",
            "Spotify audiobook format changed and destroyed my progress.\n\nI’m listening to The Power Broker by Robert A. Caro (which has been an amazing listen), however it is 65hr long! Spotify broke this up into 600+ “parts” and since I usually listen on my commute to work, I am unsure about what part I usually am on. \n\nI had all of the book downloaded (auto download turned on), and noticed that today when I wanted to start listening, the book format changed to chapters which downloaded automatically and are all marked as finished. Now I have to go through manually and find where I was which will take time since I don’t usually look at the progress…\n\nAn annoying way to start the day for sure.",
            "The new Desktop UI is so bad that for the first time in my life I've considered sending hate mail.\n\nSeriously I've never seen a more universally hated and stupid change. \n\n\nCan anyone even give me a reason how this new layout is better in any way?",
            "ffs every update breaks even more things. can't delete from queue by pressing delete key. no longer able to go to the playlist, current track is playing from, by clicking on the album art image. can't even like a track without a dozen clicks. UI/UX team can A/B test deez nuts",
            "This new UI at the bottom of the application is getting more annoying with time.\n\nSee [this](https://imgur.com/a/C4rS0Bv) screenshot.\n\nHow am I supposed to drag the volume slider when everything is this crammed? At least give me the option to disable/hide certain buttons (I don't use \"Now playing view\", \"Lyrics\" and \"Open Miniplayer\").",
            "Is there a way to hide specific podcasts and playlists from my recommendations? I have some friends coming over to my place and I haven’t come out to them. I know we will be listening to music, and I don’t want them to see all the LGBTQ+ podcasts and playlists that I have been listening to that are in my recommendations and ‘continue where you left of’ place :(",
            "This morning on my drive to work I found if I pause music, switch out of the app, then reopen the app the track automatically starts replaying again accompanied with a robot voice that is like \"Resuming XXXXX playlist.\" How do I turn that off?",
            "I feel like I’m going crazy. I used to love the “radio” feature where if you found a song you like you could listen to a radio where it pulls similar music. In the last few weeks however, I have noticed it populates the radio with mostly songs I already listen to and have liked and/or music that’s unrelated to the song I chose to play a radio from. I’ve had a similar frustration with “discover weekly”. Has anyone else noticed this?",
            "It's super annoying and cringe when other people label their music with other artists just so their music appear on the other artist's page. Why is this even allowed in the first place? Many cheap uncreative people just make a track with the cover made by fucking AI and tag random artists just so other people would notice their stuff",
            "Downloaded songs not staying downloaded.  Pixel 7.  I see them in my files folder but for some reason, just a few of them stay available via spotify...then they redownload all again.  It looks like April 7th they all moved to the \"files\" audio folder for some reason but again, a few are still playable via spotify (seen as downloaded).\n\nThese are all files I uploaded to a playlist via my local PC, on the PC they have no issues.\n\nRedownloading is an issue because the playlist is about 75GB (long john digweed mixes mostly that spotify is hit or miss on allowing to play from the albums uploaded by the DJ himself).\n\nAny one know how to fix this?  Is it something with my file format?  It's not a huge deal except it burns through my home internet data (or happens when wifi isn't available).  I'm wondering if i'm not on my home PC network for too long (or my home PC is off for too long) perhaps that causes it?",
            "I hate the \"made for you\" spotify playlists. If I want to dip into a new genre or want to hear new stuff in a genre I want those playlists to not just have the same songs as others that have some shared qualities.",
            "I must have pressed something without knowing but why is spotify saying the name of my playlist when I start playing music.",
            "Every single person who works on the spotify ux should be old yeller'd. The design choices make 0 sense unless you're actively trying to cause the end user frustration.",
            "Can you please remove this ^#^€*@&* smart shuffle thing from Spotify? I don't want random %#%÷&* music in my playlists, and now when I manually play a song without smartshuffle I cannot go to the next song because it automatically enables smartshuffle and than Spotify stops working. (Samsung S23 Ultra)\n\n\nSmartshuffle is ^#^^$$¥!!!!",
            "Is there a better place to ask technical questions about Spotify? By lumping every technical question or comment on the Spotify app or browser page it's like throwing every comment into a hat as there are no subject or headings on any of them.",
            "When I try to use the filters feature on my likes songs playlist it just come up with “filters are hiding some results” or it only shows the most recent song in the given filter. How do I fix this? I really like this feature",
            "Why do my “niche” mixes all contain the same songs… :/\n\nCan’t swap to a new mix without hearing 60% of what I just heard on a different mix. \n\nA few are legitimately different, but damn a *ton* are virtually identical, even with different mix titles",
            "i don't know from where to start!!\n\n\\* Horrible support\n\n\\* Horrible UI \n\n\\* broke the apple watch app and Horrible support",
            "So in July last year they put the price up from £9.99 per month to £10.99 per month and now, less than 12 months later, they have announced another price increase! What the hell! £11.99 per month now? AAAARRRGGHH!!!",
            "In my (android) mobile app, NO artists have any \"similar artists\" (or is it called \"other Fans also like\" in english?) category anymore. I use spotify to go to my fav artists and look at what is similar and go from there to find new (to me) or obscure (to me) artists to listen to and today I had to see that possivility is gone as far as I can see (in my app, a friend of mine claims he still sees it).....",
            "Wow, putting lyrics behind a paywall?  \nIf I was on the fence on getting a subscription well, I definitely won't now.  \nYeah I'm petty like that, I pay for things that offer good services, not for things that arbitrarily take them away and add nothing else to the table.  \nIt's bad enough your ads have gotten even more obnoxious lately but really?  \nAs if it wasn't bad enough that this 'feature' as half implemented anyway",
            "As of today the \"now playing\" bar is gone on my android. Sounds exactly like this problem: [https://www.makeuseof.com/spotify-disappearing-now-playing-bar-bug-fix/](https://www.makeuseof.com/spotify-disappearing-now-playing-bar-bug-fix/)",
            "My discover weekly playlist is full of songs ive already liked. Whats the point of the playlist if I already know the songs? Im pretty sure it didnt used to be like this. Am I the only one? Did this change in the last 9 months?",
            "Does anyone know how to turn off concert recommendations? Clicking the wrong song because Spotify insists on telling me about a show 20 hours away 6 months from now is getting pretty old.",
            "STOP SPAMMING ME WITH CRAP SPONSORED BANDS ON MY APP",
            "Why is my android widget behaving differently? I use it explicitly to go to my recent play lists, I don't need you changing all the icons to drake or Taylor Swift. Happened twice today already. \n\nThese aren't even artists I like.  Let me listen to my shitty music fuck off with their shitty music.",
            "What brain-damaged developer or manager added the female robotic voice saying \"Resuming Discover Weekly\" and \"Resuming Liked Songs\" to the app?  Just play the fucking songs, are you insane?",
            "Hi. since a few weeks ago \"Fans also like\" was removed from my Spotify on Android app. I use it do discover new artists similar to the ones I listen to. Does anyone know it this is a permanent removal?",
            "daylists cant seem to stick to their own themes. ill get daylists titled '60s hippie sunday afternoon' then proceed to get songs from the 90s, the 80s, etc. and they don't even fit the theme! im talkin 'everything she wants' by wham. that is not hippie spotify. this is one example but whenever it gives me a daylist for a specific time period this happens. i think they should stick to vibes rather than eras.",
            "Several artists/bands that I used to listen to from time to time no longer have songs on Spotify. It really sucks, I hate it and I want them back! Also, my country, Norway, STILL doesn't have that damn AI DJ",
            "Does anybody faces this issue where the app doesn't show the player inside the app...I can clearly hear a song playing but I can't see it in the app.Please help me out in this",
            "Anyone notice the mass amount of songs that are just suddenly region locked or unavailable seemingly overnight?",
            "I wish we could block specific podcasts/ podcast hosts like how we can block singers/ bands. Because Spotify keeps suggesting me very specific podcasts, and podcasts that I’ve tapped ‘not interested in’ MULTIPLE TIMES for, and on multiple separate occasions. \n\nAlso- i despise how when I’m listening to a specific artist Spotify starts playing a random artist unprompted.",
            "The \"Smart Shuffle\" feature is really starting to grind my gears. It literally replays the same 3 songs, you can't mark some of the suggested songs as \"don't like\" if it's a song you're not really fond of. I miss the enhance feature as I thought that was somewhat better.",
            "I've got a couple of Spotify-related gripes, but the biggest one is that it doesn't play nicely with my Alexa/Echo system throughout the house. It used to work fine but lately it's been pooping the bed. \n\nAlso there's the stuff that the Spotify big man/cool guy said about how making music doesn't cost anything. That was gross. I wouldn't mind the price increase all that much if I thought anyone other than shareholders would benefit. I hate how addicted I am to you, Spotify... Lol",
            "After seeing lots of complaints about how repetitive Spotify suggestions are, I wanted to give some suggestions for a variety of tastes. I was in the same boat until I started exploring more on Spotify. Turns out, the issue wasn't the platform—it was my approach! Now, I’ve discovered a ton of amazing music and can't stop listening to these fresh playlists. If you're ready to spice up your music life, check these out:\n\n[my profile](https://open.spotify.com/user/31b2bcakqmfqhaq4g5hdp5zehnum?si=ca268c56b4964d4e)**:**\n\n1. [audiophile liquorist](https://open.spotify.com/playlist/4owM90kPr6QhNbUuNNT1Hu?si=407e71cef5e14915)**:** Perfect for unwinding after a long day. Accompanies on a road trip with soothing and fun melodies that help you relax and clear your mind. Rock, Darkwave, New-age\n2. [coffee wood-black](https://open.spotify.com/playlist/5WARG4iNNa5IgQXDE9Y5Oq?si=c3d8289f4ee64e15)**:** For those who love discovering new rock indie gems. This playlist is packed with up-and-coming artists and tracks that you won’t hear on mainstream radio.\n3. [sin² t + cos² t = 1 \\[love\\]](https://open.spotify.com/playlist/19qaZauZ7nkXPICq6ZcJEG?si=90e029e243e3426c)**:** love was not there until was told there is no way: turns out the love loves the impossible, like a recursive function, it keeps calling itself while it does not even know what itself is. wait for the brain to throw a stack overflow error and acknowledge the infinite loop.\n4. [extortionate cosmic research \\[ultimate\\]](https://open.spotify.com/playlist/1jnl4VHzQkCJk1qNNae2fG?si=27ad38e5db3448eb)**:** Unknown guitarish songs, discovery of `obscure music` by taste - full of extramundane and rapacious rhythyms, yet; interestingly intensified, extrametric psychedelic - progressive rock sounds.\n5. [primal \\[if\\]s](https://open.spotify.com/playlist/7xi44W5XG9PC8q8RIcpaa8?si=665991c7e4fe48e1)**:** In the wilds of possibility, the primal 'if' is the seed of our evolution, sprouting into the forests of our destinies.\n6. [whisky nocturne](https://open.spotify.com/playlist/3dr3leJn7t7SAaiMsv182p?si=7c700de1ed0d4c20)**:** Perfect for contemplative evenings; the sophistication and depth of a night accompanied by the timeless notes of classic tracks, much like savouring a fine whiskey under the moonlight.\n7. [getting ready & dressy](https://open.spotify.com/playlist/2HmueWBAeP1vCOSugttKLx?si=3eaeb65435714ece)**:** For my girlies!\n\n...and more you can see in my profile!\n\nGive them a listen and let me know what you think. What are your go-to playlists? Let's share and expand our musical horizons together!",
            "I've noticed the quality of playlists, including Spotify curated playlists, the On Repeat and the Daylist, are increasingly broken. I've really begun to notice it on my On Repeat playlist. There are multiple songs I have no recollection of listening to, or songs I listened to once land on my On Repeat. And just the other day I saw a Beatles song on a 2010s mix playlist. At first I thought maybe it was a remaster from the 2010s, but not only was the album listed as the correct year (sometime in the 70s) but the remaster was 2009. On June 1st, my Daylist was called \"April Fools Power Ballad Morning.\" Like wtf?!",
            "I hope someone sees this, but I’m having an issue where I can’t see other peoples playlists. I’ve tried searching for them and going to other profiles, but I cannot find any other playlists besides my own and ones made by spotify. is anyone else experiencing this?",
            "My playlists disappeared and when i tried recovering them, it said there was an error retrieving them.\n\nEdit: I can't even make new ones",
            "last night, on the website there had been an outage as im told but the options to even look at the playlist/album/artist only sections are just gone. what the hell??? it's not just playlist anymore, every option is gone and now the UI ive been avoiding because it's awful, unorganized and can't be fixed at all is forced upon me. hope this is either fixed soon or i get let known this is another awful update they decided on.",
            "Anyone else massively annoyed by the Spotify algorithm? It doesn’t matter what song or what artist I listen to, it’s followed by the same 5 songs after (close to you, good luck babe, feather, please please please, lunch). It’s so annoying, anyone know a fix?",
            "Sponsored recommendations… how do I stop them from being suggested? \n\nI’ve been a premium member since 2012. My subscription keeps getting more expensive and the keep finding ways to suggest content I don’t want to see. \n\nWhen I click on the little “info” button on these suggestions it says I can remove them but don’t see how in my settings. Do they just mean I can remove each one that they send me individually?? If that’s the case I might finally fuck off to Apple Music. This is ridiculous.",
            "Spotify wrapped is a horrendous presentation failure.\n\nNo way am I wasting like 10 minutes watching some dumb ass animations for some stats that might interest me, and then to view them again I have to watch some stupid animation again???? WTF????? I'd rather waste my time here complaining about it than actually look at the wrap up. And it seems you can't even actually look at those stats without forcing yourself through these shit reels???? why????????????\n\nAlso performance is abysmal. At times, it takes more than 10 seconds for spotify to recognize commands like Play or Go Next. My longest delay was over 20 seconds. Adjusting the volume usually comes with a significant delay of several seconds. App takes much longer to open than it used to.",
            "The new UI is genuinely so bad is there a way to make it just the heart button again",
            "Really upset with the whole lyrics change. Apparently now we have to pay to see lyrics.",
            "Putting lyrics behind a paywall is ableist and creates an accessibility hardship for members of the Deaf/HoH community.\n\nIf you look at lyrics as a form of captioning, putting lyrics behind a paywall is the equivalent of giving an entire community the middle finger.\n\nAs the husband of a DHH wife and father of a DHH daughter, this is a total jerk move. We already have to pay out the nose for equipment so they can function in hearing-abled society; there's nothing left to pay for what was and should still be a basic part of the service.",
            "It's just goofy to have a subreddit called r/spotify and then insist that it's \"mainly for sharing playlists\", and force all other matters into a single thread.",
            "For some reason my Spotify account says that my top artists include John legend who I’ve never listened to and my top songs are many John legend songs. There are also other artists who I don’t listen to there like Leonard cohen, Dave Matthew’s band, the milk carton kids and anika moa. Anyone know why?",
            "When I go to podcasts on the iPhone app, it shows me podcasts from last month (that I guess were popular) and also shows me podcasts/episodes that I don't even follow. How do I go back to sorting my podcasts by release date like it used to?",
            "I am curious if anyone has found a permanent solution to the algorithm playing the same fucking songs every time you hit shuffle. I am not exaggerating when I say at least 10 to 15 of my favorite songs have been absolutely ruined by this future. I do not build a 24+ hour long playlist to run while I’m working just to hear the same fucking songs every day. I have seen people suggest hitting shuffle again after every song, but I cannot do this while I’m actively working through a morning and lunch rush. I need to be able to hit shuffle and that be that. \n\n\nif anyone has solutions please let me know, if not maybe if any of y’all have used Apple Music could you tell me if the same thing happens there? Because if they’re algorithm is better I am willing to give up the yearly wrapped to not be terrorized by the same songs on a daily basis 😭",
            "I can’t log into spotify on my pc no matter what i do, I’ve tried to change my password but all i get is something went wrong and it doesn’t change anything. What is going on?",
            "My DJ is genuinely so broken. It is OBSESSED with literally just playing the \"[Hot Hits Aotearoa](https://open.spotify.com/playlist/37i9dQZF1DWY5Nosj13GLt?si=9ab5859c9f1f4e30)\" playlist. Every single time I queue the DJ that's what he wants to play. I will skip the section by mashing forward, he'll play some previous year's wrapped playlist, then straight back to Hot Hits Aotearoa. There's no explicit feedback button like Discover Weekly, so I can't get it through his stupid robot head that I don't want him to play it.\n\nPls help, I don't even live in New Zealand, and I really don't like that kind of pop music.",
            "I have been trying to make a collaboration playlist for a while, but every time i send a link for it after clicking \"invite collaborators\" the link goes through but noone can add songs to it. I even tried to test it with the mobile app and desktop app and yet i still cant add songs so I don't know why it won't work. Edit: I don't like deleting posts or comments so ima just edit it. I discovered it wasn't working because i was clicking copy link rather than the \"more\" button, and when using the \"more\" button it worked just fine lmao.",
            "Ads on Science Vs Podcast?  \n\n\nIsn't it a Spotify original? Is this the future? I.e Ad's even on Spotify podcasts?",
            "To propose a solution to the heart complaint, how about swiping to the left allows adding to multiple playlists at once like it is now, but instead of automatically putting something in your liked songs, you instead add to liked songs like you did before by pressing the heart. And the hearts show up again next to the song instead of the annoying plus sign. It keeps the usefulness of the old and new features. Please Spotify don’t make me switch to apple music",
            "Are the features that are removed from Spotify India in the free version in the recent update available for the rest of the countries for free? Or have they brought India to the same level as others?",
            "Am I an idiot or is \"New Episodes\" playlist for podcasts only available on mobile? I shouldn't have to open up my phone to queue an episode while listening on my laptop",
            "Why is it playing reccomended songs when I shuffle my playlist even when I don't have that feature on? It's so annoying getting interrupted by songs I don't like every other track",
            "Missing the ‘Create a Radio’ button for entire playlists. \nIt was much better for finding similar songs for a playlist than the smart shuffle. Plus I could listen to suggested songs by themself. \nI know it is essentially supposed to be just like the ‘recommendations’ at the bottom of playlists, but I found the suggestions here less unique than the ones that would be in the radio playlists. \nPlus, you have to constantly refresh it after it plays the recommended 6.",
            "Forced/Automatic \"Jam Session\" is a privacy breach.  I'm at a work conference, in a hotel with all of my colleagues.  This morning, a colleague mentioned he joined my \"jam session\" last night.  I had rain sounds going so I could sleep (jet-lagged).  Seems to be a privacy breach, just lucky enough it was a work buddy and not someone looking to exploit something private of mine.  \n\nI chatted with Spotify contact-chat.  They eventually found a way to disable per Bluetooth speaker, but it is a manual, specific process.  Seems their default is to share your private listening sessions for the sake of having a \"feature\" that no one actually uses I guess.  \n\nMy complaint is: Do not share my listening unless I opt-in to this feature.  \n\nDisgusting feature-pushing technique by Spotify here.",
            "OK when the fuck is this shuffle this going to be fixed?",
            "\"To protect your Spotify account, we've reset your password due to detected suspicious activity. You need to create a new password to log back in.\"\n\nSpotify is constantly forcing me to change my password. They don't let you reuse passwords either, every password I've ever used in the past decade is invalid. \n\nAll because I use a VPN. I never had an issue before but suddenly Spotify has problems with it. \n\nI listen to music all the time, including when I am using the internet, so toggling it whenever I want to use the app is not an option and not what I pay Premium subscription prices for. \n\nApart from literally giving up my cybersecurity, anyone know any way to make Spotify STOP forcing password changes on me and maybe suggest them instead? Or to just leave me alone? You'd think this was a banking app not a music streaming app. ",
            "Okay is anyone else having serious issues with Spotify? \n\nThere’s like a 60% chance that whenever I go into the Spotify app, my podcast or song is changed to some random one and what I was listening to is unplayable until I close out of the app. This keeps happening on my IPhone 15",
            "Need to be able to block things on any of the autoplay/autosuggest features.  Somehow, I finish a WSJ podcast and a suggested podcast starts.  The suggested podcast has somehow turned into a radically political podcast.  I guess because I listened to it a few minutes to give Spotfiy's suggestion a chance, it has moved firmly into the rotation of suggestions.  I want it to never... ever... play again.  Would wish it to be banned from the platform honstely, but to each their own.  \n\nBut.. can't stop it from playing.  Seems too easy (and obvious) to add to this to the algorithm.",
            "did spotify take away being able to see lyrics for songs? or is my phone just tripping. can’t see it for any song but idk why they would remove that. but who knows they may unnecessarily have gotten rid of it 🤷🏻‍♂️\n\ni have premium btw.",
            "Can someone please help me fix my Daily Drive routine? When I tell spotify to play Daily drive, instead of playing the daily drive playlist it does one of the following:\n\n1. Play a song called \"daily drive\" by some asshole who decided to name their song that way.  \n2. Play a podcast called \"daily drive\" that's totally unrelated too.\n\nI also tried to use other languages to see if it would find it, but it just complains that this content doesn't exist. If I block the artist that made the song, instead of finding the next result, it will tell me that this content is blocked, and suggest I open the app. I can't even block the podcast because Spotify doesn't provide such basic functionality.\n\nHow can I tell Spotify to open the correct podcast through API it so it plays my daily drive correctly?",
            "My recently played history is not working. I tried everything (log out and log in, reinstalling), but nothing works. What should I do?",
            "720 songs in my liked songs, and I just had the same song play twice in an eight song period. Had to go back and count cause I couldn't believe it. How is shuffle this shit? How hard can it be to not repeat a song until I either left the playlist and came back to it, or until I have gone through 719 other songs that I hadn't just heard.",
            "Every time i create a new playlist, Spotify ALWAYS suggests the same 2 songs. Is there a way to stop certain songs being suggested, im sick of seeing them",
            "I’ve been trying to listen to music I got from a local file. It’s able to played on my computer but when I try to play it on my phone it says that the song isn’t synced on my phone. I have been able to listen to other music but it seems that the files that I downloaded just don't want to work. Does anyone know what I can do to fix this?",
            "Damn the interface was never great. But they somehow manage to make it worse over time.  \nWe STILL don't have a way to get a proper  music library.  \nIt's not magic or something. If you can't come up with a good idea for a user interface just copy what has worked in the past.  \n  \nIt's mind blowing how a music player from the late 1990s has a better interface than spotify.    \nJust copy winamp or something smh",
            "Is anyone else’s home screen widget not working? I updated the app yesterday and since then my widget is just blacked out. Resetting my phone and the widget hasn’t fixed it.",
            "Everyday there's the same problem \"Spotify can't play this song\". It's ANNOYING!!! Can't you just do something to fix this. It's EVERYDAY!!!",
            "I have 48 gb of spotify downloads currently on my device, and according to the settings menu in spotify I still have 9 gb free on my device. However, when I attempt to download additional playlists, they are stuck forever in \"pending\" even when I am at wifi, when I refresh the download, etc. Is something wrong with my account or device, or have I perhaps reached the download cap? I haven't tried deleting all my downloads yet because I'm not done listening to them haha. But that will be the next thing I try",
            "Every fucking time I open Spotify it doesn't load shit. It says it's offline even if I'm on my data (which works for every other app). Everywhere else, even if I'm on my Wi-Fi, (which works for every other app), it'll take forever to fucking load so I have to close it and open it repeatedly, and sometimes it still doesn't work and I just give up. This happens every god damn day.\n\n\nThis shit is updated too. This has been going on for like over a month. I cannot believe I pay for premium and this shit is what happens. But does anybody relate ??",
            "I don't understand why they replaced the new releases section with their curated selection of what they \"new releases\" they think I would like. Give me back the ACTUAL newly released music list.",
            "The Release Radar playlist has really gone to shit, and I’m starting to think that AI is generating the actual music and artists that show up. There have been an increasing % of songs featuring an artist I’ve followed, but the artists i follow are not only not on the songs, the artists that “feature” them will only have 1 song on their profile. and the track photo is generic abstract artwork with the track title printed in Tahoma font. horseshit. what am i paying for?",
            "All of my echo devices have disappeared from Spotify mobile, and I can't seem to re-enable.  They're on the same network.",
            "Recently, on Spotify for iOS the playlist won't play, If I click on one it starts playing suggested songs.",
            "Has anyone else noticed the disappearance of the shuffle button?? I have premium but usually have it on but now when I press play it automatically plays the first song as there’s no shuffle on the main page of the album/playlist.",
            "Mobile bug on IOS:\n\n&#x200B;\n\nSometimes, not all the time, the X button to close the queue tab will disappear when I open the queue tab, and I have to restart the app to get off the queue tab. It's heaps annoying and the close button shouldn't just disappear, ey?\n\n&#x200B;\n\nhttps://imgur.com/a/msk1SaC\n\n\\^\\^ I've taken a SS of it, will update with another if and when I catch the fault and remember to SS.\n\nDevs please fix this.\n\n&#x200B;\n\nCheers.",
            "Smart shuffle is so utterly garbage and I dont know why they changed it! Being able to give GOOD recommendations while actually shuffling your playlists was a great feature that I would actively go outta my way to recommend my friends to enable back when it was called “enhance”.",
            "The last couple days when I start playing an album rather than play through the album Spotify only plays 2-3 songs in a loop. I’m not using shuffle just the loop at the end of the album option. This only seems to happen when I’ve closed the app and start playing the album I was listening to when I last closed it. Anyone else seeing this on IOS?",
            "spotify playbar doesn't show up for android, I've turned on permissions for notifs, tried resetting my phone's entire settings, deleted & reinstalled spotify, but it still doesn't show up",
            "UX experience is starting to really annoy me in my liked songs playlist. I want to listen in order (unshuffled, non repeating) but by default it switched back into shuffle every time I put my phone back into my pocket (pixel 6 pro)\n\nVery frustrating",
            "Adding my $0.02 on the shuffle.\n\nI feel like there has to be a middle ground of true random shuffle (that doesn't feel random) and whatever is happening now that isn't random at all. 400 songs in a playlist, a dozen from one band, and I keep hearing that one band over and over again.\n\nMy proposal: Make it truly random with one caveat. Before the algorithm puts a song in the queue, it makes sure it hasn't played in the last 10% of the playlist. So if there are 100 songs in a playlist, you shouldn't hear the same song twice until 10 other songs have played. \n\nThis could also be an option. So you can choose \"True shuffle\" (this), \"Party shuffle\" (algorithm tries to get your mood in the playlist). Ideally, smart shuffle would be a separate option that could be turned on or off for both shuffle options. But maybe that will just make the app too clunky. IDK, I just like having options to make apps do what I want them to do.",
            "Problem: Adjusting volume not work on phone when connected to google/PS\n\nHaving trouble with the Bluetooth connection when paired to google and PlayStation, I’m unable to adjust/control volume from my phone.\n\nIf tried deleting the app and resetting my devices but had no luck with it.",
            "The link in the \"confirm your account\" mail ends up nowhere. It points to [https://wl.spotify.com/](https://wl.spotify.com/) which is an unknown address.",
            "My premium expires in 3 days when I enter my code for another year via gift card it reads \"You can't apply this Premium code to your account. This is likely because you have an existing Premium subscription that cannot be combined with a Premium code.\". Does this mean I have to wait for my current premium to expire before I can apply this code?",
            "Hey, I have a Galaxy S10 5G and today out of the blue the \"Spotify Playing On This Phone\" thing seems to have stopped working for me. I don't know how but it just did and now whenever I pause it, it doesn't fully disappear when I swipe it away and still stays there, just invisible. But when I swipe back it appears again. I tried turning it off and on yet it still doesn't do anything. I'm not allowed to do anything, it just shows with the song, author name and a small pause button. I tried restarting and powering my phone down yet it still does not work. I even deleted the app and reinstalled yet the I can't even interact with the thing itself besides from being able to play it, despite the other buttons like skip being present. The only difference is that if I change to another song then the menu will be on that chosen song. What can I do to fix this? Is something wrong with my phone?\n\nEdit: the bar works but now whenever I select a different song it appears as the same one as I had before. Is there any answer or fix to this????",
            "Why does it not display \"student plan\" (when I even clicked the student link in my student email on PLAN (it says I'm on \"free\" with ads) and I have access to Hulu?! How do I access Hulu with Spotify?! Have I had it this entire time? Why can't I speak to a person about this? :(",
            "Playlist shows \"no items\" in android auto after latest update\n\n\nAll of my playlist with local files synced from computer don't load in android auto and displays \"no items\"\n\nHowever some spotify playlists are still available\n\nHave tried restarting the centre console, spotify, phone and nothing works so far",
            "[deleted]",
            "yes. spotify fucking blows lol",
            "Tecnical problem. Spotify makes my cellphone shut down itself when I play a song. Samsung A21 (Android).\n\nWhenever I play any song in spotify (Doesnt matter if I play it from an album, by touching the arrow, or I play it from the search suggestions), my cellphone turns its screen black, then activates some UI features, then goes black again. This continues for 30 seconds or so (with the song I wanted to play sounding) until one of the following scenarios:\n\n- The screen turns black and my cellphone restarts. Everything is normal then\n\n- Safe mode system UI is activated. When this happens I just restart my cell manually and everything its ok.\n\nThe day before this problem I changed my password (cus I forgot it) so I could link my account in another laptop (I have premium). \n\nI already unlinked my account from the laptop and cleared multiple times the spotifys data and caché with the samsung settings (This worked two or three times and I could listen to some music but now it doesnt work). I tried using another account and I even uninstalled the app. But the problem is still there.\n\nI come across the idea that this is a virus, so I ran an avast test, but it didnt show anything wrong.\n\nThis is only happening with spotify.\n\nI dont know if it is a Spotify problem or if there is something wrong with my cellphone. Please Help",
            "Spotify premium mini doesn't apply for PC anymore, but mobile still works, but back then before this happened, my premium mini applied even for PC, but now it doesn't, why?",
            "A few issues for me lately on my S21 / Model 3: \n\n1 - The drop down menu / home screen notification display is stuck showing one song, but the actual app is playing different music.  I skip a song, it stays the same.  I play the 'incorrect' song (the one being displayed) and then try to change it, nothing.\n\n2 - I am listening to an album in order, about halfway through an album it starts playing related artists / genres.  The autoplay seems to be starting earlier than intended.\n\n3 - playing from my phone then getting into my Tesla just screws everything up.  I have one thing playing on my phone at work, getting into my car after work that was playing something different from earlier in the day, the car resumes from my phone, keeps it playing on my phone, the app won't shut down in the background.  I get home and out of my car, the app shows it is playing something, but there is no audio and the timeline keeps moving.  Just all around funky.",
            "Please Spotify let me block or select do not play on Joe f\\*\\*king Rogan. The man is a cancer on your product and shoving him in my browsing at every opportunity makes me want to cancel more and more each time.  \n\n  \n\nAnyone found a way to do it? The triple dots dont give the option on him...",
            "why does it feel the need to play its own \"ai reccomended\" song 1/2 to 1/3 of the time? i chose the songs in my playlist, why does it feel like it'll be a great addition to the platform to just barge in? i'll genuinely start using yt music if they keep doing this shit. by far the worst update they've ever had.",
            "I keep getting the \"429 too many requests\" error on desktop. I'm using my work laptop and using Edge. I was able to pull up Spotify and listen only once and then when I tried to go back a few weeks later, I kept getting that error. I tried a private window and Chrome and still no luck. Any help?",
            "does anyone know if i can view comments i made in podcasts' comment sections? i made a comment on an episode and totally forgot which one. is there a way i can see my commenting activity?",
            "does anyone know how to make filter options in liked songs permanent? They change daily and it’s incredibly annoying because theres only 1 filter I use and it’s frequently not there..",
            "I only ever listen to metal and its adjacent genres, buti've been getting playlist suggestions and daily mixes full of unwanted shit like David Guetta, Lil Uzi Vert (whoever that is) and Lost Frequencies. On my front page there was a 'new releases' david guetta song. Why??!!",
            "Today I started getting adverts at the start and during listening of podcasts. It's weird because I pay for premium. Really annoying, what up with ads?",
            "version 1.2.5.1006.g22820f93 Spotify Desktop for Windows 7 - 8.1 not playing any songs on Windows 7 but will play on Windows 10 (same app version).  Anyone having this issue or found a workaround?  Support was a joke and would not help besides point to their articles for reinstalling app or upgrading OS.",
            "Can I appeal being removed from a family plan and having to wait 12 fucking months to go back on?",
            "So I use a Spotify podcast that's just 8 hours of white noise to fall asleep to every night (if it is pertinent to know, this one specifically https://open.spotify.com/episode/3PwFBqrPP0lKg24DzSnpr8?si=aEg8RFzFRFCsHJvU9nB1og), and I've been using the sleep timer to make sure my phone isn't going all night- however, for the past couple of weeks I've been waking up to see that my \"Recently Played\" tab is chock full of songs I don't recognize in the slightest, and my Liked Songs playlist has become absolutely flooded with these random unrecognizable songs. The amount of songs lines up with the idea that Spotify has been playing these impostor songs all night as I've been sleeping. Any chance I've just been straight up hacked or something? Again I'm using the Sleep Timer every time, so it's not an issue of forgetting to set it & spotify trailing off on recommendations",
            "I signed up for an individual premium account today and all my podcasts and saved episodes disappeared. I had full access on a free account but now that I pay I can't listen to or find podcasts at all. suggestions??",
            "Hey does anyone know why I'm having this issue. I'm connected on android auto and can listen to music but it won't show my song playing or allow pause or skip. It just says tap to open. Any info would help. Thank you!",
            "didn't the 'on repeat' playlist refresh every 3 days? mines been the same for 4 days now",
            "[Help Request]\nMy spotify account was hacked YEARS ago and the people who hacked it listened to a bunch of Middle Eastern music. Now, when I listen to DJ, he will occasionally play songs in that genre. Is there anyway to view my history from like 7 years ago and remove those songs from my history or otherwise block that kind of music?",
            "I returned to Spotify after a two year absence and I'm trying to figure out the shuffle stuff. \n\nSo if I'm listening to a large playlist and I want a specific song to play first and the rest of the playlist to shuffle after, is there a way to do this from the playlist search or do I have to find the song via an alphabetical listing and click on it to make this happen? It's kind of a pain to find stuff by scrolling through a playlist to make the shuffle work properly. \n\nOne thing I tried was clicking on the song via search and then adding the playlist to the queue, but when I do that it won't shuffle the playlist even with shuffle enabled. \n\nIt's super weird because I can't think of any other music player that won't just auto shuffle a playlist after selecting a song via a playlist search from it, so I feel like I'm missing some sort of trick to it.",
            "Leaving Spotify premium after many years. Now I’m listening to ads about ads in my podcasts. Enough is enough, I’m gone from here. This is not what I want to pay for. And don’t give me the crap about how they support podcasts. Spotify pay musicians, they can pay podcasters. Many of the ads are global, many local. So….., Can anyone suggest good fee podcast platforms where I would be more than happy to listen to the ads? Advice needed….",
            "Is the DJ broken? Every time I use it, it starts with giving my top songs of 2023, then the sets after that are all ones where it says they’ve got a certain vibe. It’s never been like this.",
            "I am SO FREAKING SICK of getting into bed, putting my earbuds in to sleep, and being BLASTED with Spotify autoplaying what I had on earlier in the day in the car as soon as the earbuds connect.\nI can't find a way to turn this off and make it STAY off. Everytime it happens it scares the shit out of me and I want to throw my phone at a wall.\nPremium customer for years and I'm moving to Amazon music if they don't stop this shit it is beyond aggravating!!",
            "this might not be the case for everyone, but it seems that the queue for me is stuck in the \"Now Playing section\" on the right and I can't seem to get rid of it or to change it back. I asked a friend and they didn't have the issue, so is this just like a me issue?",
            "The album Odyssey by Home is gone and I can’t find any explanation anywhere about this in recent times, but I see it’s not the first time.",
            "i just watched an ad to get as-free listening like 10 mins ago and got yet another ad",
            "My Spotify is broken for almost a year now. Some songs wont play at all, some songs only play with wifi connection some only with internet connection and only a rare few i can play when i have them downloaded. This also applies to podcasts.",
            "My shazam tracks playlist stopped updating by itself about a month ago, I tried everything, disconnected and reconnected, deleted and reinstalled, but none of those did the trick, Has anyone experienced this before too?",
            "Does anyone else have the glitch where when you’re listening to a song while you have a song in the queue but when you pause it skips the song you’re currently listening to the song in your queue?",
            "me and my friend are long distance and we listen together using the jam feature. when we listen to the same song, one of us will start 10-15 seconds farther ahead than the other person. is there a way to fix it so that we both start a song at the same time??",
            "Screen turns on and off whenever I play a music. Will need to clear cache and storage to fix. Anyone else having the same prob.",
            "how can I remove random songs playing even if they're not in the particular playlist I'm listening to?\nGot this little green square with stars underneath the song title.",
            "My friend recently released her first single, I am beyond proud and excited for her. I tried to listen to it on Spotify and battled with it for almost an hour. I put her song in a playlist I had used successfully last year. It has two other songs in it. I went to play the playlist, expecting to have to skip the other songs and maybe a few suggested songs. I was more than happy to listen to a few other songs and some ads first. But the page flitted around and suddenly the queue has a whole 47 auto-generated songs and not one of them was one from the damn playlist. Wtaf. (Yes I don't have premium, why would I pay for something that seems completely broken and buggy.) I knew people were complaining about it but it's literally unusable?",
            "I use a LOT their Apple Watch app without my phone (and for every bug I encounter I share it on their forums) but they seem to just acknowledge its existence, not because they care about it and it shows (no alphabetical ordering, it is slow, bugs here and there), it just seems that they don't test it properly before releasing a new update.",
            "Is there a way to keep Spotify open on my Android phone, so I am always able to use Spotify Connect from desktop to change the music to my phone (without opening Spotify manually on my phone and waiting)",
            "I check my stats on statsforspotify fairly frequently… I haven’t checked in a week or so and all of a sudden my top 50 of all time is completely fucked up and wild, with a song that came out last month being in my top 50 OF ALL TIME. I listen to a lot of music and I’ve had my Spotify since 2015. I have simply not listened to that playlist enough for that to be accurate. Wtf is going on?!",
            "Podcasts constantly stop mid play and a totally different one will start. Also likes to replay ones I’ve listened to.",
            "I love that I have audiobooks included in my premium account. But I’m about to throw my phone out my car window in frustration. I’m listening to The Power Broker for the 99 percent invisible book club (great book and podcast), and it’s a long-ass book. It’s 66 hours. I’m about halfway through it and Spotify first had it organized into chapters, then without notice switched to tracks. It didn’t place me where I was before at all-I just had to find my spot in the book by trial and error. Today, it randomly switched back to chapters. It was admittedly easier to find my spot because I knew what chapter I was in, but I don’t know why they can’t pick one format and just stick with it.",
            "Not sure where to put this,  but this is not Gomez. I don't know what this is but it ain't Gomez. \n\n*Warning contains autotune from the beginning* \n\nhttps://open.spotify.com/album/0o07tYNpjaB5KzowrPDJVS?si=DTey4TPETHyVw2LqpSNc5Q",
            "For some reason I suddenly can't play any of my downloaded songs offline? Everything worked normally for two years and now I can't even view an album that I want to play. I have Duo premium. The only time it works is when I listen to a song before going offline but other than that it asks me for a network connection??",
            "I can't log in on my desktop anymore, every time I get an error desktop_login_accounts:3 or when I press log in and it takes me to the website to continue then it gives me an error.\nAt this rate only my phone works or web version, premium is so useless at this point",
            "I don't understand why pressing the play button for a song I searched begins playing a completely different song.\nThe same goes for playlists. I make a playlist, then want to listen to it, and there are a bunch of random songs that I didn't add. Like wut.\nPlease tell me what I'm doing wrong, or explain these features. Thank you",
            "hi! im trying to switch from a spotify premium plan to another, and my adress verification is not working, saying it does not match when i complete it. however, it matgches exactly. what can i do?",
            "Has anyone had issues with playing Spotify on an Amazon Alexa show? It’s bizarre. It randomly stops showing up on my device for hours at times but my echo dot appears.",
            "I just bought Spotify premium over Pandora.....instant regret. All of the sudden, my playlists skip the first 4-5 songs, then once it does decide to play a song....It just stops all sounds after 15 seconds, but the timer keeps going....Please help! What is happening?",
            "They have the price increase there like 7 ads before you can get a other song that then turns into a crap song that you can’t skip",
            "Anybody elses Spotify Account just remove your payment method? I got a notification in the app that payment had failed and I need to add a method or my premium would expire. I checked my account and my card has gone, been deleted. Why is this?? Confused.",
            "Spotify is having some issues.",
            "I’ve hidden artists that also have songs in my ”liked” playlist but then the songs still play when I shuffle my liked playlist :/ what’s the point then :(",
            "Error code: desktop\\_login\\_accounts:3)  \nhow the fuck do i fix that, i cannot login onto the desktop app, mobile and web work fine",
            "Get rid of the dogshit PR bios that so many artists have. Or at least keep the Rovi ones below the artist-written bios.\n\nThe Rovi bios are so informative and well researched. I want to know about an artist's history, collaborations, achievements, and where they fit in the broader genre/scene. There's nothing useful about every artist/their team telling you they're the hardest working person in X genre. Some of those bios are frankly insulting to the listener's intelligence.",
            "Podcasts repeat when finished\n\nHave a strange issue with podcasts,\nHowever it only affects the short ones lesd than 10mins\n\nAfter finishing it will start from the beginning again, instead of moving onto the next one in the queue, \nThis only happens once per episode \n\nThis is happening on android",
            "Had an update for my mac desktop this morning and it's brought back the like button for me, but the new music button is gone and I JUST got used to the check mark playlist thing to some extent. I wish they'd just pick a lane and stay there.",
            "Why do certain songs on a playlist not download when I click the button to download the whole playlist? Thanks for any help",
            "for the pc versionthe search bar suddenly went from the side to the middle top of the page. from what ive heard the search bar has always been at the top before they switched it to the side, but im already used to having the search bar at the side, so is there any way to change it back?",
            "i thought it was pretty cool when spotify started generating read along transcripts for podcasts, but now it replaces the episode art for the podcast with the transcript, as well as having it below the “about the podcast section” like usual! does anyone know if there’s a way to disable this? i’ve dug through all the settings to no avail",
            "Spotify for artists is bugging on me.\n\nMade my first release a couple weeks ago. At that time I logged into Spotify for artists to view stats. A couple weeks later now, I am trying to log back in and am unable to. Password reset emails are apparently going but not arriving.\n\nI am looking through my email history and see a Spotify for Artists email the day I first logged in a couple weeks ago, so I know I am not imagining that I ever did this.\n\nHowever...on distrokid there is still the \"Get Access\" option/drop-down when I am looking at my release's Spotify distrokid page. Trying to make a new account and it tells  the music email I am trying to use is already tied to a Spotify account!\n\nSo what the hell?",
            "Spotify is not working without a VPN all of a sudden. I never used it with a VPN before but all of a sudden it isn't working. It just shows me as offline. I can't even access any Spotify website without a VPN. I'm on Android btw",
            "PLEASE switch from Musixmatch to genius or sth. . Musixmatch curators are dumb or dont care about the lyrics, because they´re mostly wrong, even if its just small mistakes. Make that easy to edit as a listener, like genius does with change suggestions. Its so annoying and bothers me hours after i got mad about them being incompetent in the first place. Thank you. I know its not spotifys fault for Muisxmatch being stupid.",
            "why am i getting opportunities for 10 minutes of uninterrupted listening instead of 30?",
            "I just want to say a huge thank you and a big hug to Spotify for getting Neil Young back. His absence was just too big a hole to ignore. \n  And a question about the audiobooks - if they don't have a lock on them how long do they stay in our library ? I scarfed up a whole ton of them yesterday. Do I have a week to listen to them before they evaporate or do I now have enough books to last me three lifetimes ?",
            "Saw that my app updated last night to the new version with the awful separate rows for Recently Released, Albums, and Singles/EPs, and also the return of the heart button. Booted it up today and all that stuff gone. The heck happened to the update??",
            "I receive message from spotify telling me I connected to my account which I didn't. I suppose I'm being hacked. What should I do.",
            "My app has gone all blurry on Mac: [https://imgur.com/nEKhXYj](https://imgur.com/nEKhXYj)\n\nI have reinstalled the app and it's still like this. Any ideas?",
            "One step forward and two steps back, Spotify!\n\nThanks to your new UI, I can barely move the Spotify application around when it's scaled small.",
            "I'm a jerk or whatever but spotify's support team is completely useless and beyond frustrating\n\n[https://imgur.com/T4LwsBt](https://imgur.com/T4LwsBt)",
            "Anyone got car mode working on an iPhone? Was working perfectly for me until around the turn of the year, but now never detects that it's attached to a car - even though the bluetooth symbol is a car!",
            "Spotify does not update my liked songs on desktop anymore (but it does on mobil) so my liked songs on mobile are 3.850 and on desktop 3.821. Ive had this issue before... but i forgot how to fix it. I will try a clean reinstall but if this resolves it then this solution is so annoying....",
            "Ever since the new UI update, the buttons on my Spotify (desktop app) are so delayed. For example, playing something or seeking takes a couple of seconds, same for the volume. It usually looks a bit glitchy when doing so as well. I've tried uninstalling and reinstalling, and I don't have this problem on the web version of Spotify, it's spot on and has no delays.\n\nAnyone have the same problem?",
            "Two questions:\n\n1. How do I make Spotify share the \"last played ... days/weeks ago\" information across devices? Is that only saved in cookies?\n\n2. How do I save a podcast without also following it and getting updates?",
            "ive decided to come to reddit for support im not sure if this is the right thread to be talking about this in but\n\nOn my Macbook Pro, I've been having a problem that's been going on for two straight days now. I've contacted multiple Spotify Advisors and they're all no help. Some of my playlists won't load and even if they seem loaded, when I click on the playlist, it just won't load. I've tried a clean reset, checking my firewall, deleting and redownloading Spotify, checking my other account on my  Macbook and deleting the Spotify app as well as removing the caches and checking the host files and deleting any Spotify related things. I've checked my WiFi and that's all fine too. \nOne of the advisors gave me a test account to log into in which it had the same problem as I did. I'm not sure if it's my laptop bugging or It's a problem with the Spotify app itself.\n\nThe app works fine on my iPhone and iPad, just not my laptop for some reason.\n(btw, my main account for my mac, it works fine as well. I'm not sure if It's just my 2nd account not working)\n\nNo matter what I do, nothing helps. \n\nWondering if Reddit had any answers?",
            "almost all of [these](https://cdn.discordapp.com/attachments/756264507546009702/1222486892193255455/IMG_1858.png?ex=661664a3&is=6603efa3&hm=af6f6aa0d841134b9e20bb09b39d981cab7a276864f9bd2212ea018cf5ae05ed&) song are local files, i downloaded them and they work fine on airplane mode without internet, but only 2 songs dont work for no reason, why only these 2 songs and how do i make them work?",
            "[Spotify Ad Blocker](https://www.spotifyadblocker.co/) is the ultimate solution that allows you to enjoy your favorite tunes without those disturbing ads interrupting your music streaming experience on Spotify, So it's time to say goodbye to those annoying ads that break the rhythm of your playlists.",
            "Whenever i try to play a song on my “liked” album it says “you have discovered a premium feature” is this a new update or a bug? Do i have to pay for premium to continue to listen to anything at all",
            "The new miniplayer on desktop is really great, but i think it would be perfect if you can enable the lyrics instead of the Cover on it",
            "Spotify embed not always having volume controls is a horrible design.",
            "Billing now shows up as P2A6704ED4.  A part of me thinks a PSA would save people headaches who like Spotify but it is still a complaint.\n\nNo name, no number, no web address, nothing to let you know this is a valid charge.  \n\nI never thought I would cancel Spotify due to changes in how they charge my credit card but guess they found new ways to lose customers.",
            "I have the Google Wifi, Google Home mini, and Google Nest mini and will have music playing on both mini's on Spotify. A few days ago the speakers started to constantly pause, if I say \"Hey Google...\" When it stops it will say it needs to connect to wifi, but I don't get any notifications that it dropped connection. I tried restarting the wifi and mini's, factory resetting, unplug/replug, uninstall/reinstall Spotify, but it keeps happening, and only with Spotify (tested YT Music).\nHas anyone else had this issue and resolved it?\nI live in an apartment, one of the mini's is on top of the Google Wifi and when I speed test, I get over 300mbps, with only a couple things actively using wifi so connection shouldn't be an issue, ISP isn't either.",
            "There should be an option to block certain podcasts you don't want to listen to so they don't show up in the recommendations",
            "Anyone know why i am unable to bypass admin permission to delete my Update folder? I am already the admin user account, so what's the deal?",
            "Aaaand another update that just takes features away. This new queue sucks.",
            "The like icon used to be a heart and now it's a plus, I liked the heart, what gives?",
            "We play music through Spotify at my work and lately we've noticed that older songs (70s, 80s, older) are noticeably quieter despite all settings being the same. Has anyone else experienced this?",
            "Not sure if anyone else has ran into this but, my spotify will randomly take my facebook profile picture and make it my spotify profile picture...? I deleted my facebook entirely almost 5 years ago, not deactivated - deleted it. I've double checked numerous times and even reached out to meta support and they say my profile does not exist anymore. But still, spotify puts my real profile picture from 2017 from facebook as my spotify picture? It doesn't do it immediately, and I can't pinpoint what causes it but it will fully override and delete whatever other picture I set, even if I \"remove picture\" and leave it blank it will revert at some point... if anyone has any advice I'd greatly appreciate it, this spotify account is nearing 12 years old and I'd rather not make a new one.",
            "They just changed the UI on pc app, and I've got to rant about it.\n\nThe Queue has moved to the small column on the right side which can either be Now Playing, Queue or Recently played.  The main window remains the playlist which doesn't scroll along with music played. \n\nWhat is the point of having two lists of the same playlist on the screen at once? I mean seriously - think about it. I really don't get the intended point of this change.\n\nAlso \n\nThe Library should be able to be removed to a single small icon and not a column of them. I mean if I want to go into the library and do stuff then I'll do it, I don't need ready on screen access to it at all times, like play-next-previous buttons. It just takes up screen space.\n\nSmart Shuffle needs to be a separate option you can enable or disable. Incorporating it into the shuffle button just means more clicks and annoying crap. \n\nThe Smart Shuffle additions are not smart. If I'm shuffling a playlist I've created, why would I want songs from the same artists that I chose not to include when creating the playlist in the first place?  There is a place for this type of random suggestion but it is definitely not constantly on.\n\nA smaller gripe is that fullscreen shows you a current photo of the artist, and the little web player shows you super low resolution album art. Each of these has its place but you don't get the choice. I want high res album art if possible. I understand it's difficult, and don't really care about this one. \n\nWhat I really want is a fullscreen up next queue scrolling along as each song is played. This used to be possible, not anymore. It doesn't seem too much to ask.",
            "Did they remove the ability to search for profiles? Swear I did that a few weeks ago but now it's...gone?",
            "Hey, I don't know how this happened, but almost every song in my favorite album has turned into Orinoco flow by Enya, video of it below.\n\n&#x200B;\n\nI am very confused  \n\n\n[https://youtu.be/4pfPykGG950](https://youtu.be/4pfPykGG950)",
            "Every single song radio is the same!!! I used to find new music by creating radios of songs I like but now every song radio I create always has the same Zach Bryan songs regardless of genre",
            "So exciting to know i’m not the only one who had the same thoughts like the sticky post. 😆",
            "I have been switching back and forth between Apple Music and Spotify for about a year now. I switched back to Spotify for what I thought would be the final time in December. However, I am so tired of the front page being a jumbled mess full of podcasts that I never listen to. So today I switched back to Apple Music. I’ve always been a defender of Spotify having podcasts integrated into the app, I actually like that. \n\nBut the fact that you can’t clear them… it’s so annoying. I could have listened to one episode or accidentally clicked on one and listened for a second and they will remain on my Home Screen forever.",
            "Anyone else unable to share songs and lyrics to Insta stories too?",
            "I generally really like Spotify premium, but it bugs me that every time I open the app, they are pushing me to get “Spotify Family” because “it’s time everyone gets their own account”, as if I’m breaking some kind of rule. I get that having playlists for my very young children is going to mess up my Wrapped.  But my kids love their playlists in the car.  And by the time they are old enough to have their own device and know how to use the app, Spotify won’t know to target us anymore because playlists won’t be kids songs.  So all they are doing by targeting this advertising (scolding?) at people that have mixtures of kid playlists and grownup playlists, is telling parents that Spotify cares way more about tidy data than the convenience being able to switch directly from Baby Shark to Macklemore after dropping off your kid, without juggling accounts. Just reinforces that we are still the product, even when we pay for premium.",
            "I attempted to use a Spotify premium code and it shows the message \"You can't apply this Premium code to your account. This is likely because you have an existing Premium subscription that cannot be combined with a Premium code.\" Does this mean I can't use this code? Should I cancel my premium subscription to use this code?",
            "Ok this is frustrating. No lyrics appearing in the options below the song for a major artist? For example for Lana del rey, all of the options are live shows merch etc but nothing for lyrics. It used to be there… for smaller artists the lyrics are there but for big artists there is so much spam and lyrics are not shown",
            "There used to be a function to be able to search for a song on Spotify and then right click > Show in Playlist. \n\nThis would take you to the playlist where you had saved the song. \n\nHas this function been removed?",
            "STOP UN-LIKING MY SONGS!!! I KNOW I HAVE 3000+ SONGS BUT THAT DOESN'T MEAN YOU CAN JUST UN-LIKE THEM!",
            "is there a way to make it so I can't see someone else's account? im tired of snooping on my exes playlists",
            "I have a question and I hope someone sees it, because I have searched Spotify's settings and FAQs as well as the internet at large and have found nothing even relating to this.\n\nSo without Spotify Premium, on mobile you effectively can't play whatever songs you want. You can shuffle play the song itself but you waste like all your skips just getting to it usually, so if you want to listen to several specific songs you're screwed. And that's fine, whatever. I use Spotify for longer, more random sessions of listening to music, just letting the algorithm pick what it wants from my massive liked songs playlist, and I know the algorithm is rigged or whatever but I think it works well enough for me to enjoy it.\n\nBut so if playing single songs on Spotify free is unviable and it's much better to listen to shuffled playlists, why the hell with certain specific songs does it start playing them from some random playlist? Please tell me there's some setting to turn this off because it's fucking annoying. It's always popular and/or new songs, but with songs I'm not super familiar with the context of, it's basically a gamble as to whether it will happen or not. But anyway, when I search and click on a song, it's so I can add it to a playlist, not because I want to listen to it in that exact moment shuffled with potentially other songs I've never heard of.\n\nIt's so annoying because I'm always in the middle of listening to a playlist, either paused or actively playing, and it overrides that and makes me have to go back to my playlist, hit play again, and if I wasn't actively listening and just had the playlist paused, I now have to either pause the playlist as soon as it starts since you can't rewind or fast forward at all without Premium (which is very difficult), live with it being paused a second into the song (which is sometimes inconsequential but other times the song just starts immediately), or just listen to the song to be able to pause at the start of the next one.\n\nI've flipped all the logical settings I could think of, tried getting Premium and letting it expire, and uninstalled and reinstalled the app (even though I knew that wouldn't do anything), and nothing worked. I know I've fixed this before in the past but I have no idea how since I've already tried all the things I thought I could have done. The only thing I can think of for that at this point is some bug was making it *not* happen and just wasn't patched, ever?\n\nPlease, someone, if you know how to circumvent this or know it can't be done, let me know.",
            "Can you remove playlists from your library without deleting them?",
            "So I just found something that annoys the absolute hell outta me. \n\nIn the \"liked songs\" playlist that is automatically created when you like a song, the song is added and sorted automatically. This sorting is by the date you added it. If you sort by Artist however this sorting is alphabetical by Artist and if you like more than one song from an artist, it is then further sorted alphabetically by the title of the song. Take Eminem for example, Say you like Phenomenal, Rap God, and Lose Yourself. Well, the liked songs playlist sorted by artist will sort it this way: Lose Yourself, Phenomenal, Rap God. I love this, its so nice.\n\nNow in a playlist you create this is very different. The default sorting is custom, which allows you to sort it however you want. However if you try to sort it by Artist like in the Liked Songs playlist, this is where it irks me something fierce. It sorts by Artist just fine. The trouble is multiple songs from that same artist. Any playlist you create and sort by Artist will go Artist and then Title of Album the song is from. And that's it. \n\nI wouldn't be as annoyed as I am if they then further sorted it by Title of song within that album, but Nooooo they couldnt be bothered with that and it fucking irks me. \n\nThis may just be a me thing, but I would rather have my playlist be sorted alphabetically by artist and then song title than artist then album title.",
            "Once again 'New Episodes' has disappeared.",
            "Please for the love of god spotify make 'liking' and 'unliking' a song a single button press again. Idk what intern you needed to keep busy but get someone to revert that code. Holy moly what a dumb UX decision",
            "Bro the lyrics\n\nfix it pls",
            "I have a specific Problem:   \nMy favourite songs are not shown fully in the desktop app. When I log in via browser or smartphone app the whole playlist is available.   \nWhat can I do to solve this?",
            "new desktop ui is god awful. back button is hidden underneath a hamburger menu (not IN the menu, literally underneath it. you can see them but can only click the forward one, the back one has exactly 1 clickable pixel) and the profile button is hidden behind the minimize button. every ui designer at spotify needs to be fired",
            "Im on iPhone 11 and this shit crashes all the time nowadays.",
            "Is there no way to shuffle all your songs besides putting them all in a playlist? It's incomprehensible to me that this doesn't seem to be an option.",
            "bro the new macbook desktop ui is so ugly",
            "Why do I get the \"30 minutes of uninterrupted listening\" every 10 minutes, sometimes multiple times in a row?",
            "I still miss likes :(",
            "why are they raising up spotify premium prices again? I get that they added audiobooks but I dont even listen to those, and I use family, and only the main person gets the benefit of that aswell so whats the point? I really hope they make just add ons to accounts and keep things the way they are because I do not want to be paying that much for music",
            "I noticed that my Apple CarPlay has, for some reason, started beginning from the bottom of my Spotify playlists when it’s not on shuffle and going up instead of starting at the top and going down, and when I try to skip tracks using the right button, it begins the song again rather than skip to the next track, but when I press the left skip button, it does skip to the next track down.\n\nHas anyone else had this issue? Or have a fix? It’s kind of annoying.",
            "Auto download \"My Episodes\" on Android Wear",
            "I originally signed up for the student plan to have Spotify and Hulu for $4.99. I just realized about a year ago, I started being charged $9.99 and now $10.99 for the individual plan but I still have access to Hulu. \nIdk how to broach this with customer support… am I currently stealing Hulu (lol) or just being overcharged? I just graduated college in January so idk if I’d even be able to go back to the student plan. I don’t remember ever being warned that my student plan needed to be renewed or anything.",
            "Hi Reddit! With some recent upd I noticed a weird behaviour with smart shuffle. When I am connected to my car and set the playlist shuffle all ok. Once leaving the car and continue the ride later, the app (iOS) forgets about shuffle was on and i have to reactivate the feature again. Anybody noticed that? Any ways to solve the issue?",
            "\"Liked\" songs no longer being marked as liked in other playlists so that they stand out. This has been  incredibly annoying when I want to find that specific song in a playlist. Instead of looking for the little hearts next to them, you now actually have to scroll and read a bunch of the titles until you find it, or type the name of the song into search. Not great while driving.\n\nI was hoping they would bring it back over the past year, but I'm now just looking for another streaming service that is more like \"old\" Spotify. Any suggestions?",
            "Clicking on the currently playing song no longer jumps to that song in the list. Instead it hides/shows about the artist on the right etc. Any chance we could get that back? Or maybe some other way to jump to the currently played song in the list. Also, shuffle still sucks!",
            "Is there a hum-to-search feature on Spotify that I'm not aware of?\n\nLast night, I was trying to lull my daughter to sleep, and started to hum/sing a mixture of Scarborough Fair by Simon & Garfunkel and Elizabeth, My Dear by Stone Roses. I used words from both songs.\n\nDuring this time my phone was locked and in my pocket. Once I put my daughter down a minute later, I unlocked my phone and was greeted with search results with Elizabeth my Dear at the top, and Scarborough Fair underneath. I wish I took a screenshot of it, but I was so taken aback by it I just quickly got rid of it. I haven't been able to replicate it since.\n\nI don't think I've ever searched for either of those songs, and even if I had it would have been months ago. I'm finding it really hard to come up with another explanation. Has anyone else had anything similar happen to them?",
            "Hey does anybody have a solution for this?  \n\n\nI don't use phones and haven't for a long, long time. I wanted to log in to my spotify account on the browser. No matter what I do it requires that I verify using an old phone I had. Even after verifying with my email address, or a code from my email even, still requires me to ALSO verify using a mobile device.  \n\n\nI'm barely in my twenties but I don't understand why 80% of the stuff I've been using on my pc for over a decade, is now all requiring me to have a phone.  \n\n\nIs there any way around this? I've found no support chat or number, nobody to email.   \nI recently had a similar issue with X where I needed to know my username to change the username that I didn't know.",
            "Why can't Spotify offer a genuine incognito mode?\n\nIs that _really_ too much to ask?",
            "Is anyone else having trouble with the widget?",
            "I have premium and I'm stuck listening to ads for certain podcasts. I'm tired of it, especially with the airforce and Trevor noah ads. I literally paid to not have them",
            "I really like the idea of DJ, but man, Soundgarden has more than “Spoonman” and Queen’s catalog goes beyond “Spread Your Wings.” \n\nIt’s like having a roommate who fixates on one song for an entire semester.",
            "How does Spotify keep getting worse?   \n\n\nIt worked perfectly years ago. No need for improvement.",
            "Why does Spotify region lock language to source country for how you are paying for the service? How hard would it be to just add a setting for language in the settings menu",
            "Does anyone else have the issue that the volume increases right before the next song starts? It only lasts for like half a second, but it's pretty annoying. For reference, my volume level setting is set to \"Normal\" and I don't use crossfade.",
            "24 hours and still no password reset mail. Friend of mine tried it as well with different mail provider and he got nothing as well.",
            "Why are some songs marked E and some songs aren't? For example: World Smallest Violin by AJR is not marked as E even though they swear multiple times throughout the song. But Burn The House Down also by AJR has one swear word and is marked as e",
            "Since the new update (that also removed the heart button) spotify keeps resetting to 100% volume and doesnt keep the window size I adjusted it to when closing the application. I'm on Desktop",
            "Hey was wondering how you change your spotify location without changing your payment method?\nMy Spotify is set to the wrong timezone despite me signing up in my local timezone. Also, I would like to be able to access more international content and a VPN has not worked.\nDoes anyone have a solution to this issue?",
            "How do i download songs i have spotify preium but i have a chromebook and i want to download songs to it for offline listening my phone broke so thats why im not using my phone.",
            "I'm still trying to figure out why they would deprecate the feature that lets us sync our local songs across our devices to make us do it manually.\n\nThat was one of their most useful features.",
            "Anyone run into this issue where you say; \"Hey Siri, play (artist)\", but she plays a band that isn't what you requested? I even try to speak as clearly as possible, but she'll pick something else that's somewhat close to the name. She'll get most of my requests correct, but wanted to see if anyone else had run into this issue.\n\nThanks!",
            "I thought this stopped being an issue but yay, it's back. No matter what I add to my queue or if I'm listening to a Playlist, Spotify just plays random shit from the accounts I follow. I have tried everything short if uninstalling and reinstalling since that didn't do anything last time I had this issue. \n\nIs there ANY solution to this? I'm on android 14 on a Pixel 7A",
            "While using the mobile app on Android, I get the same ad.  Every commercial break.  Once, I got the same ad three times in a row.  I'm not exaggerating.  I've disliked the ad, I started explaining it as \"I'm getting this ad too often,\" and now I select \"I find this ad offensive.\"  Actually, there are two different ads for the same pharmaceutical with the same voice over actors. It's not a condition I nor any loved ones have so it's not a targeted ad. I've cleared my cache.  Actually didn't receive the ad for maybe a week, but it's started over again.  It will let me skip it after 30 seconds but I'd really prefer to never have to hear it again.  I can tolerate ads for just about anything, but I'd really love to make this one go away permanently.",
            "Now tidal has dropped their hifi plan to £10.99 a month, Spotify is the only one (maybe not YTMusic?) without Atmos support. It’s embarrassing at this point.",
            "Help. I added a song to my spotify playlist and fsr it added 1 thousand of them. I tried selecting my whole playlist and deselecting my own songs to get rid of the 1000 copies and it just deleted all of my own songs so my 500 song playlist is now gone. Is there any way I can get them back?",
            "an odd problem im getting...\n\nother people can't find my spotify account. asked my brother to follow me on spotify but when he clicks on my profile, it says unable to load. i send him playlists off of my profile, they give the prompt unable to load as well or say it’s private or removed — which it’s not. he tried clicking others’ profiles and they worked, i tried sharing stuff with other people and it worked. his profile opened for me, but when i tried to follow it, it just kept removing me as a follower. like i’d press the button, it would go FOLLOW —> FOLLOWING (for a split second) —> FOLLOW again. help, what settings are messed up here?!\n\n  \nlater, i was able to follow him from my pc, he shows up in my friend activity and everything, but he still cannot see me as a follower. when i opened spotify today, i had once again automatically unfollowed him. what's going on?",
            "Spotify isn't letting some songs play past one second. It's acting as if the songs themselves are only a second long despite having played them just fine earlier. I have tried reloading the page, using different playlists, and opening it in a new tab and nothing's worked. Help?",
            "WHY won't some of the songs on my liked songs play list play???  I have tried several this morning and it is random which ones play GRRRRRRRRRR",
            "I’ve got an iPhone, and when I try to connect to my car radio via cable, I get a No Songs error, apparently because it’s trying to read from Apple Music. Anyone know how to get around this? Google hasn’t been helpful. The only solution seems to be to add at least one song to your iTunes library, but that doesn’t seem to be possible anymore without a subscription.",
            "Hi, my Spotify playlist appears to have shit itself.\nContext:\nI'm out of the country this free account was set in, last night it sped through so many songs before shitting itself closed. I left it for tomorrow me.\n\n\nI'm now tomorrow me. I've cleared the cache, the playlist still says \"time to add songs to this playlist\"\nAll other of my created playlists are the same. \n200+ songs are on it. \n\n\nCurrent hypothesis is Spotify's servers decided to fuck me over because it's not in the right country?\n\n\nI have blockify all the way back home. But other than that. I'm confused. Like. Very confused.",
            "Hello,\nvia Spotify Connect, selecting songs in the Spotify app is slower than when I play Spotify directly through the device I'm currently using. Is this normal?\n\nFor example, when I'm on my Mac or iPhone browsing through a Spotify playlist, the songs play or switch immediately without any delay.\n\nHowever, when I'm connected via Spotify Connect to a Sonos One or WiiM Amp, the app (on both Mac and iPhone) is not as responsive. It takes about 1-2 seconds for the clicked song in the playlist to be selected/highlighted and for playback to start.",
            "Is Spotify smart shuffle being dumber than usual? \n\nRecently it's been putting a lot of older music which I don't usually mind but if I'm headbanging to one song, I don't want the next one to be \"Big Poppa\"\n\nJust throws the rhythm off",
            "Is there anyway to turn on a SFW mode that doesn't show album art? The music itself is fine they can say whatever they want I'm listening to headphones but I don't want to open the app to pause or start music and see some album art that might get me in trouble at work.",
            "I actually want to talk about the password reset function. \"Please enter new and unique password\"??? Girl, you LITERALLY DO NOT LET ME IN WITH THE RIGHT PASSWORD and don't let me change it to some previous one which I WOULD DEFINITELY NOT FORGET. Too much honor for something which is merely a music player. Why other services would allow me to reset my password to previously used???? I am FURIOUS.",
            "Did Spotify change the music recommendation/mix algorithm? Literally the exact same songs in all of them and when I refresh it just switches between a set of 1 or 2 songs. I can't find anything new this way.",
            "Spotify on `fire tv stick 4k max' -- Songs always pauses for about 0.2 seconds before near the ends (when a timing next song inform pop-up)\n\nIs there any solution?",
            "I have ALWAYS had issues with spotify stopping a song in the middle, and having to completely restart the song. It has been an issue on my PS4, on my old phone, on my new phone, on my desktop, on my TV. It is a universal problem that I have.\n\nI hate registering to the beginning of a song, so I end up skipping which is irritating.  This issue is also getting progressively worse. It has gotten to the point where about 1 in 3 songs will stop. This happens whether I'm listening with earbuds, headphones, or on my phone speakers.\n\nSometimes I can't pull out my phone to fix the issue, I work in a clean room so pulling out my phone is not allowed.\n\nI am paying for this service! And it has gotten so bad! I wouldn't mind terribly if it was free, but I pay for a service that isn't working. And spotify's response to this issue always seems to be to delete the app and re-download. Hell no. I have hundreds of downloaded songs, I dont think their customer support answer should be 'inconvenience yourself because we don't want to fix this issue for you.'\n\n\nI'm sure I'm not alone in this issue but good fucking god it's annoying",
            "In addition to featuring the same songs for months on end, the Daily Drive playlist keeps feeding me dead podcasts. Every Saturday, like clockwork, I get Vice News' goodbye podcast, even though Vice News ended nearly a year ago. I pretty much have the damn thing memorized. Now, even though Shots of Science Vs has ended, I keep getting the same podcast on Ozempic. Is there a way to remove these? Does Spotify seriously have nothing else to replace them with? The whole Daily Drive playlist needs an overhaul in how it generates songs and podcasts.",
            "Sometimes when a song starts my volume on my phone starts like fluctuating like a I can see the bar move and uh it's been happening for like a year it feels now. \nDoesn't happen on my Xbox\nDoesn't happen on my iPad\nOnly happens on my Galaxy S20FE\nI'm using no equalizers or anything, volume normalization is off, uh I'm listening using my AirPods Pro 2s maybe it might be them but I'm not too sure I'll mess around with music on other apps to see but atm only Spotify so yeah and I have a vid of it happening if it at all matters\nEdit: Tried listening to music on SoundCloud and the issue did not occur plus music play louder there👍so I don't think it's the AirPods I'll try reinstalling in a bit",
            "I got this and am not sure what to do.\n\n    upstream connect error or disconnect/reset before headers. reset reason: overflow",
            "So HOW do I find lyrics of a song? I can't find such an option. Is lyrics only available in the paid option?\n\n\nSpotify website says: \n\n\n\nTap the Now playing bar at the bottom of the screen.\nNote: On tablet, tap the album artwork in the side menu.\nTap LYRICS.\n\n\nI don't even have such an option.",
            "I just got premium for the first time and I cant play songs on the PC at all. And I can't log into the app saying I'm not a premium user :(",
            "Has anyone else seen loads of music pulled from Spotify over the last few days? I follow a huge 600+ song playlist (mainly folk music) that I listen to every day, and over the last couple of days dozens and dozens of the songs have been greyed out and removed from Spotify. Clicking through to the profiles of affected artists I see that they all have two or three of their (usually older) albums removed. It's happened to so many artists who I listen to, and in such a short space of time, that I figured some major licensing dispute or snafu must be taking place, but I can't find anyone else mentioning or talking about it. Anyone else?",
            "There’s this like EDM label or something that’s putting out EP’s with twenty different variations of the same song and somehow getting them published under famous artists and celebrities names? They have this EP called “Revolutionaries Vol 2” that has Louis Farrakhan, Elijah Muhammad, and Langston Hughes. I don’t think Farrakhan or Muhammad made music, but Langston Hughes definitely did, and I can’t listen to his Spotify profile anymore without hearing these random EDM songs that he somehow published 60 years after his death? Like the fact that the same song is up 9 different times at least on there just totally fucks it up, I can’t listen to his profile anymore. Is there any way I can let Spotify know? It’s genuinely confusing, they’re not making money off it, or getting any fame, there’s no name or label attached from what I can see. Their other projects are EDM sets from “Barak Obama” and Rosa Parks?",
            "Just found this subreddit, I have several complaints, one new. I'm on a paid plan.\n\n  \nNew: Just in the last week or so when I connect my phone to my car and open spotify it plays a 3 second audio clip \"Resuming <playlist name>\" This is totally unnecessary as I only have the one playlist I ever listen too. My wife's spotify doesn't do this in her car, just mine. And I don't find a setting to turn this off, we're on the same version.\n\n\n\nThe rest are long term (as in a year or more):   \nShuffle sucks, it plays maybe the same 20 songs. If I start it again manually by picking a song I haven't heard, it seems to select 20 new songs then repeat those forever. My playlist is downloaded and has \\~800 songs in it.\n\n  \nBecause shuffle sucks I turned it off. When playback resumes in the car, it'll finish the one song it was paused during, then randomly jump to some other song in the playlist instead of going to the next song on the playlist, after that it'll do another. It's like it's shuffling even though I turned it off. Since I want to hear all my songs eventually and shuffle sucks, I figured I'd just listen to them in order. That is failing too.\n\n  \nHonestly every update to spotify pisses me off a little more. I'm paying for the service so I can listen to the songs I want when I want without ads. It's failing me. I'm about ready to drop it completely and go to one of the many competitor apps. These issues have happened across multiple android phones and when I've reached out to their support the only response I get is uninstall and reinstall the app. If that was the fix, a new phone shouldn't experience the issue.",
            "We canceled our premium spotify last month, they are still billing us. Can anyone here help? Any suggestions on how to get them to stop billing us?",
            "I don't think I can add a screenshot of my issue/question here in this megathread, so... I will attempt to describe what I'm seeing/experiencing.\n\nI'm on Android and really only use Spotify for podcasts, and really only for 1-2 that either aren't hosted on my favored podcast app or that act weird/glitchy on that app.\n\nI will usually only download the last 1-2 episodes of a podcast. They are downloaded. When I'm in the podcast episode, there is a green 'checkmark' icon under the name of the episode (and date and run-time), as well as a green 'dowload' icon (down arrow) between that and the 'Share' button.\n\nSo when I'm playing the downloaded episode, I see the green 'checkmark' icon to the right of the episode title (and right above the total run-time in the bottom-right corner).\n\nYet my playback will still freeze/spool.\n\nThere's a little green spinning circle that will play/animate while the podcast is stopped for 2-7 seconds, and then it will resume.\n\nIs this a bug, a known issue, something I can do anything about via settings, etc?\n\nThanks in advance.",
            "Who tf thought it was a good idea to take basic music player functions and hide then behind a paywall? Fuck you whoever did that. And they wonder why I have adblock.",
            "I also want separate playback contexts for podcasts/audiobooks and music. Add a switcher button near the volume/lyrics buttons. The different playbacks could slide/pop up above the current playback context environment.",
            "Does Spotify work for you ? It's been working very badly for a few hours now.",
            "Anyone else on iOS where the songs stop playing suddenly and it shows —:— instead of the time of the song? Only way to fix is to restart the app? It’s happening so much to me and it’s so frustrating !! Idk if it’s to do with bluetooth or something…",
            "why arent my podcast uploading on Spotify?\n\nand sometimes on mac my Spotify turns dark and i cant press anything, i always have to quit it",
            "Spotify Duo plan.\n\nSpotify adds 15 free hours if audio books to premium subscribers. But!... Only the plan manager gets access to the 15 free hours. The second person can't use them. There's no way to change the plan manager without cancelling the account and resigning up. \n\nW.t.f.",
            "When the AI say:  Lets go for a vibe. OMG!",
            "My VPN is blocked all the time. This has to stop.",
            "There was a guy having problems yesterday, someone connects to his Spotify,  his email got hacked, he didnt know how to get rid of that,  and today the moderators deleted his post.  I dont find how to ask them what happened, I wanna know",
            "Can someone please help me, everytime I shazamed a song, spotify would saved it in a new playlist called My Shazam Tracks with only that song, so I have many My Shazam Tracks playlists now instead of just one My Shazam Tracks with many songs in it like before. I don't know how to fix it, I chatted with the customer service but they were not very helpful, they told me to move the songs one by one manually to a single  playlist.",
            "all the individual songs from my recently played has disappeared? it's all albums/playlists/artists now?",
            "Pressing Play does nothing at the moment. Log out, log in, uninstall, reinstall, nothing works.",
            "Is there a way to check my Spotify history? I enjoyed a few songs that played from Spotify's recommendations and I would like to save them somewhere.",
            "Does anyone else experience no playback when opening Spotify occasionally?\n\n I can be listening all morning, no issues. I get to work, wait an hour and throw some in headphones. When I open Spotify, the area under the song that shows the time displays --:—. I have to close the app, re open for it to begin playing the same song. \n\nAny solutions to this??",
            "After a jam session my app mixes jam session music to the queue despite play a new playlist",
            "In collaborative playlists, songs that were added already by others do not show up as added to playlist already. \n\nSo i would mistakenly add the song and then to fix it when i do the remove from playlist. It removes the song completely including the one they added.  This is very kinda frustrating.\n\nAlso during playback it should indicate who added the song to the playlist similar to how songs are tagged if they were added via smart shuffle",
            "Is there something wrong with Spotify Playlists' Recommendations? I still use the \"Recommended Songs\" list under the Playlists I make and continuously hit Refresh to get some obscure songs. But lately, they keep giving me songs I already added to my Playlist. And when I click on those repeat pulls, it glitches out and they disappear in the recommended list. it's hard to explain, but I've got a [video](https://imgur.com/V2H52j2) I uploaded to Imgur here. it's really frustrating because I used to get in-depth with different obscure songs that would go on for like 100 refreshes sometimes, but now it's stuck on the same dozen songs, and never goes on. Does somebody know why it's doing this? Is it a problem with their servers?",
            "Can I get less podcast recommendations? And more music please! FFS!",
            "Driving mode has disappeared from my Spotify app on android. Is this happening to other people as well? I'm not finding anything about it, however I did only do a quick cursory search. Most recents are from 2023 and 2021",
            "Spotify UI is ridiculously slow…. Why does it take 20 seconds to add a song to a playlist.  Like it is so delayed when I click the button.",
            "I'm in the UK, can I buy a Premium gift card for my friend in Canada?",
            "Anyone know what the new update has fixed/introduced?",
            "Has anyone checked their settings recently on desktop? I checked mine looking for a way to access my profile, which for some reason is transparent and stuck behind the \"minimize\" key on my title bar.\n\nHowever, the point is that settings like audio quality were set to \"very low\", \"volume normalization\" was turned on, \"Auto Adjust Quality\" was turned on, and maybe one other setting that are all settings that I know I would never have, so I wanted to see if maybe an update reset all this stuff?\n\nI thought I was going crazy, thinking things sounded worse. Nope, just stupid settings to save Spotify bandwidth, if I had to guess.",
            "Spotify app on iPhone is horrible the last couple months\n\n1) I have a 2014 Honda Civic, never had a connection issue with it, suddenly I have to close and open spotify 2-3 times before the song will start playing. This makes no sense, but its even worse with podcasts?? I have turned off car mode and no change.\n\n2) Swiping to go to next/previous episode on podcasts changes direction randomly? For example, if i swipe right to go to next episode, close the app and open it, theres a chance that I will have to swipe LEFT now to go to the next episode? It seems completely random.\n\n3) Sometimes I will randomly get a spotify ad, despite paying for premium\n\n4) Even if I am in a playlist, sometimes it will randomly just auto play some random, completely unrelated song or podcast episode (for example not even from the same podcast) next?\n\n5) Random audible ads played?\n\n6) I hate the new \"resuming your \\_\\_\\_\\_\\_\" 5 second voice message that plays sometimes, this seems to be something that they're testing out because I never had it before, then updated, and now I get it, but not all the time.\n\n  \nWhat the fuck happened to this app over the last couple months?",
            "When I'm listening to foobar2000 and I open the Spotify window, it takes over audio and mutes foobar. How can I stop this behavior? I didn't see it in the settings.",
            "\\[FIX\\] Spotify stuck on stop/pause or no audio when connecting to car stereo via USB.\n\nNot really a full a solution, because the problem just comes back, but this gets the iOS app working for me every time:\n\n1. Park the car. Don't do this while driving down the road\n2. Unplug the USB cable\n3. Turn off Bluetooth on the phone\n4. Close the Spotify app, wait a few seconds, then open it again\n5. Connect the USB cable. Spotify should work normally\n6. Turn Bluetooth back on\n\nThis works for me on vehicles with Apple CarPlay as well as on basic aftermarket head units. It seems like when Spotify has auto-connected through Bluetooth, then gets a USB connection, it has problems shifting everything over to USB. The skip track button advances the title but doesn't play it, hitting play has no effect, and the display on the phone appears to be playing (the mock peak meter animation next to the track name appears).",
            "Yeah why the hell is simply liking a song like a three step process now? Why did they think that was a good idea? Absolutely baffling decision",
            "Absolute nonsense I can no longer click once to add a song to my liked playlist. Plus there's no way for me to know on playlists like Discover Weekly if I've already added the song to my likes.",
            "There is no \"liked songs\" anymore. Let me explain. I have a few playlists of \"stuff I want to hear later\" Now every single one of those songs shows up as check marked. Also I have collaborative playlists from friends and from a music Discord channel I'm in. I don't necessarily have every song liked in those lists.\n\nSo now I can't tell if a song is liked or in one of those other playlists, at least on phone. On desktop the songs still show as a heart.\n\nAlso, when I check mark a song on my phone it puts it in whatever the last playlist I added a song to. So if I liked a song but also added it to my Cover Song folder, then next song I click + will add it to my Covers Folder, not my liked songs.\n\nDoes anyone at Spotify actually USE Spotify?",
            "This is the exact complaint that I came here to make. I love the idea of an \"add to playlist\" button, but why does it have to replace the like button when there's enough space for both",
            "Since this update, I appear to have lost all my followed playlists as well. All the ones from my wife, my friends' mixes, even the yearly Spotify Top Songs playlist are all gone from my playlist folders. It's a huge bummer. Spotify appears to have forgotten that its core demo is music fans, first and foremost. The DJ sucks, the shuffling sucks, the Discover Weekly is filled with lowest-common-denom bedroom acts that paid for the privilege. It's the Amazonification of everything. Democratized slop and a horrible time using the thing. I honestly wish there were a cheaper subscription that just gives you access to the music library and the ability to make playlists. I don't need the cutesy bs. I'm sitting in my crappy car listening to my ancient iPod video on the auxiliary cord, and it finally feels right. I hate how the march of progress in app development always means entropically approaching clusterfuck design decisions by product managers who have no basic empathic understanding of how human beings wish to interface with software. I imagine that any notion of the aesthetic appreciation of music goes out the window.",
            "Right when they finally got rid of the terrible enhanced shuffle button they switch up the liked button to be the enhanced shuffle equivalent of adding songs. Why spotify? Why?",
            "I'm getting flash backs from when the pulled \"starred\" and I sat looking at a \"liked songs\" list with one track in it. They didn't even assume your \"starred\" should be ported to your \"liked\"!!",
            "Seriously. What are they thinking with this. And to make matters worse, albums you’ve liked in the past now do not show up in your liked songs.",
            "They are seriously taking the piss. They get too much money. The app was perfect some years ago, but they got to keep fucking it up.\n\nWhy is it a must to put a track into \"liked\" list if you want to put it into a playlist. Who thought that's a good idea?\n\nNo \"don't recommend me that\" button. I keep getting an annoying track playing constantly.",
            "You can literally just turn it off....",
            "This is one of my biggest pet peeves too, especially when it's a more recent album. I saved Ethel Cain's album to my library last summer and now whenever I search for it, an identical version that I *haven't* saved appears.",
            "I'm a big george harrison fan and it seems that they keep releasing new versions of \"All Things Must Pass\". I've got like 5 versions of each song now",
            "Tbf, this is likely on a publisher/record label level rather than a Spotify issue. If there are 3 different versions cause maybe slight differences in songs or different labels maybe have rights to publish certain songs and stuff. Also regions can affect it too. It’s all confusing and annoying music business stuff but likely not Spotify’s issue (for once)",
            "i agree with the core sentiment in this. they kept making the ui worse every year.",
            "amen brother",
            "Yes! This is super annoying. Please let me know if you find another way to get to the currently playing song in a playlist.",
            "This change drives me nuts. I create and listen to very large playlists and clicking the album art to navigate to the currently playing song is a vital feature for me. I've literally avoided switching to other services because of \"little\" features like this. Really hoping they change it back.",
            "yeah wtf why is the queued shoved in the corner and now it doesn't show the times of the songs or their albums asdk;jfas;dkfjas;lkjwe im MAD",
            "Seriously, why did they change the que thing. Hitting \"delete\" doesn't even delete songs from the que unless I highlight more than 1 now. Straight up worse in multiple ways....",
            "I’ve been looking for this too. Even if I just stop using the app and keep it running in the background, minutes later when I open it in my car it plays the same song from my liked playlist. Never used to have this issue. Super annoying is right",
            "I'm having this issue too and it's making me so mad. I'll be listening to a podcast in the car, make a stop, get back in, and when I go to play the podcast it launches me into my liked songs. It only does this with my car bluetooth. The bluetooth in my car is one of those FM transmitter ones you plug into the cigarette lighter so it can't be a \"car issue.\"",
            "literally!! oh my god i'm so mad. what is even the point of the middle \"main\" section of the screen anymore? do they think my main focus is scrolling endlessly through their awful algorithmic playlists?? why the fuck is every useful menu getting shoved into tiny sections on the left or right all on top of each other so you have to pick between seeing what the hell you're listening to or choosing what track is coming up next?",
            "Dud they made smart shuffle mandatory unless you have premium it's bullshit I don't get the updates at all I'm done useing this app",
            "your account may be hacked, change the password to be safe",
            "It's ridiculous they still haven't fixed this.",
            "Same here!! Drives me nuts...",
            "I am also upset by this, I thought it was just a bug they would fix fairly quickly but it's been at least a week now",
            "For Android, Windows, and Mac, you can download old versions of Spotify from here: https://en.uptodown.com/developer/spotify-ltd\n\nI recently used this site to roll back on Android due to Bluetooth issues with my car and haven't had any issues. You'd have to go back a ways to roll back some of the UI changes and there may be issues if you go back too far, but the only way to know is to try it out. \n\nI believe Apple doesn't let users sideload apps on iOS, so you're out of luck if you have an iPhone.",
            "This seems to be a change implemented in the last year and it frustrates me to no end.",
            "This is an issue I've been having! I used to discover so much new music through the artist/song radio stations, and now it tends to pick a lot of songs that \"fit\" whatever genre matches the song/artist I picked as a starting point for a radio station that are already in a lot of my playlists. No, Spotify, I want NEW music please.  \n\n\nAnd on top of that, the \"radio\" is no longer just a never ending playlist that keeps getting added to as you listen? It seems to now just set a playlist of maybe 50 songs, and then repeats that. I've been so disappointed with it lately.",
            "Is there? I can't make a post about it, have to comment here, but when I do comment here I don't see any answers. I don't know what to do?",
            "I came here to rage about this. Ive been playing my local files through my phone for months, and all of a sudden gone, greyed out. Please lmk if you find a fix and I'll do the same!",
            "This is a known bug that was reported to them a few days ago, just FYI",
            "Okay, after a bit of testing, I realized that the files ARE synced; if I pull up my local files on my phone, it's downloaded them properly. It just hasn't made the connection between the synced file and the song in my playlist. Hmm.",
            "It happened to me as well and I can't find a way to change it back",
            "I just discovered this, and it's infuriating",
            "its a joke, they should just stop serving podcasts at this point",
            "lol thats hilarious. first step is obviously to update your GPU drivers, otherwise:\n\nI would try switching your cords - sometimes DRM-protected content like spotify can cause HDCP handshake bugginess. \n\nApparently some people can also access hardware acceleration settings through the browser webapp - I would try turning that off too if you have it.",
            "This is an Android problem",
            "Agree. There is absolutely no way to hide these podcasts from showing up on the home screen!",
            "A lot of people are having this problem since Friday. It won't work on any device. PC, iPhone nor iPad. I've reinstalled and done literally every other thing they tell you to do to fix this. \n\nI was chatting with support yesterday and they said they are aware of the issue and are working on a fix. I don't know if that is BS or not.\n\nWeird thing is, I signed into a friends account and it worked fine. I told them this and they said they are working on it.\n\nIn the meantime I have found a work around. Go to an album that you like and play the last track. After the last track it starts autoplaying similar music.\n\nBut it is annoying as hell.",
            "I am also experiencing this. To the point where when I ask it to play a certain song, I know exactly what will be played next and in what order.\n\nEx. I'm living my best life in the shower. I ask my Google Assistant to slap on 'I Wanna Dance with Somebody Who Loves Me,' a most danceable hit by Miss Whitney Houston (RIP). Without fail, the algorithm in the sky will play 'Walking on Broken Glass' by Annie Lenox, also a banger to shower dance to.\n\nMy brain now associates the two songs in an almost Pavlovian fashion. I was with my gaggle of gays last weekend for a friend's annual Hanukkah party. Our dance kween DJ friend puts on 'I Wanna Dance with Somebody...,' because OBVIOUSLY, and my ass is like CONFUSED why I'm not hearin' Annie Lenox next. Granted, I was medium high then, but IT'S A BOTH AND, OK!?! \n\nI blame it on the algorithm",
            "A premium subscription is only for ad-free music. All podcasts on Spotify have either embedded or programmatic ads. That’s the only way the podcast creators or Spotify can earn money from them.",
            "You have smart shuffle turned on. Tap the shuffle button to turn it off.",
            "Wait, what are the three steps? I'm at a loss for how to Like songs now.\n\nwtf spotify.",
            "Literally was just complaining about this exact thing to my bf, it's literally the most nonsensical update I've ever seen on any app and I want to find whoever thought up this idea and beat them with a stick",
            "You don't need an add to playlist button. Just drag the song into your playlists on the left. This solution is literally less efficient at both liking songs and adding to playlists than what was already there lol.",
            "i have not yet found a way to entirely deactivate it. every time Smart Shuffle goes on or off, it messes with the Queued songs, sometimes, automatically skipping to the next one without my permission.",
            "Try turning it off on Android Auto lol. Smart shuffle takes so long to load that the button shows disabled, and then magically appears again and you never know if it's on or off or not until you've crashed because you're busy fucking about with the world's laggiest button",
            "It feels like every time I open it up, something is worse. It’s so irritating.",
            "I found a way, but it takes extra clicks. Open the Now Playing view (album art, or button next to lyrics), and click the name of the playlist at the top.\n\nIf you click the name of the playlist again, it will take you to the top. Clicking any more doesn't do anything. You have to navigate away to do it again.\n\nUnfortunately, this doesn't seem to work on Liked Songs.",
            "Ok so it's not just me",
            "Thanks",
            "a shame reddit can't agree with us on it being mildly infuriating",
            "Add to playlist, select liked songs, press done. Takes a simple button and turns it into an annoying process that regularly results in accidentally adding songs to playlists unintentionally because the Done button doesn't cover the entire bottom part of the screen. It's fucking stupid",
            "Is there any option or way to revert this?",
            "Thank you!\n\nI wonder why they keep moving stuff around without any obvious improvements.",
            "I play all my songs from liked, this is really pissing me off. Hope they change it some time.",
            "Thanks for the reply. I've decided to download an APK-installer to download an old version. So far it works. Fuck Spotify! I pay them enough to be allowed to see which songs I've liked when looking at a playlist.",
            "It defaults to “like.” You can push the add button once just like when it was the like button. There’s only multiple steps if you want to add it to playlists other than your liked songs.",
            "mental illness",
            "That's a recent fix. The first day or two that this update was live (when I posted this comment), it functioned the way I described\n\nEdit: Notably, with the fix, I actually like this update for the most part. I think there are still some kinks that need to be worked out, and I do think that having a separate like button in addition to the add to playlist button would be ideal, but overall I think it's a good idea"
        ]
    },
    "What are your favorite songs right now?": {
        "title": "What are your favorite songs right now?",
        "score": 89,
        "url": "https://www.reddit.com/r/spotify/comments/1dlcien/what_are_your_favorite_songs_right_now/",
        "content": "In a bit of a music discovery slump rn, I just wanna hear what all of your current faves are! Please put me onto something new! Will also link my profile below for people who want to see my own faves\n\n[my profile](https://open.spotify.com/user/fdkrwv5foqnxv7bn1921bblnw)",
        "num_comments": 147,
        "comments": [
            "Chappell Roan’s Good Luck, Babe!",
            "All time favorites:\n\nhttps://open.spotify.com/playlist/7oVlWoItX38OCeOLKr07AA?si=MgdiI2XuSV-xK5fYWEmL6Q&pi=u-w_xdr5BYTcev\n\nCurrent “new” rotation:\n\nhttps://open.spotify.com/playlist/32a5CKLozup2Ejj2JGzU5q?si=TnWiqOoITfK51DY3KyX-aw&pi=u-8z44A6rLQ96m",
            "The Spins - Mac Miller, Empire of the sun",
            "[Cha cha cha - Käärijä](https://open.spotify.com/track/5RX8T3EoTuXcybAxe6oPAw?si=RGjdaAMTSPSbFE4-SGZUfQ)\n\n[Everything is Alright - Motion City Soundtrack](https://open.spotify.com/track/6xyiHZgrmXw7sMyYXbXjPV?si=roqMZVk0Qp29a3Pnu9W93g&context=spotify%3Aplaylist%3A37i9dQZF1EpflaMEslprMH)\n\n[Who Do You Think You Are - Spice Girls](https://open.spotify.com/track/1jI1aLmm5HTwiMtvsbwDJw?si=7bpBd0T_RvmIR4rnLYoDVg&context=spotify%3Aplaylist%3A37i9dQZF1EpflaMEslprMH)\n\n[Kiss of Life - Sade](https://open.spotify.com/track/65krtHkaYLPr0mEbjL61UP?si=SYStnuBvTkSmuK40HG2OVQ&context=spotify%3Aplaylist%3A37i9dQZF1EpflaMEslprMH)",
            "- Vampire Weekend - Mary Boone\n- Beyoncé & Miley Cyrus  - II Most Wanted\n- The National - Laugh Track\n- Geese - 3D Country\n- Caroline Polachek - Welcome to my Island\n- Lana del Rey - Sweet",
            "you're bound to find something new in [THIS PLAYLIST](https://open.spotify.com/playlist/4gtQA1xRQkamoKRbNeQzqv?si=5347c594f1364ec0).",
            "Oddly, for me, the answer to this question is a 2005 song. I'm so late to the party.\n\n[The Fall of Troy - F.C.P.R.E.M.I.X.](https://open.spotify.com/track/4OsLDuaH0bWR6xM6nj66F8?si=ebf8cff73b2f40fb)",
            "Therapy? - Crooked Timber\n\n[https://open.spotify.com/track/2oBT5AKWxOkOe43Y2yGnqM](https://open.spotify.com/track/2oBT5AKWxOkOe43Y2yGnqM)\n\nMCR - Welcome to the Black Parade\n\n[https://open.spotify.com/track/5wQnmLuC1W7ATsArWACrgW](https://open.spotify.com/track/5wQnmLuC1W7ATsArWACrgW)\n\nRadiohead - Paranoid Android\n\n[https://open.spotify.com/track/6LgJvl0Xdtc73RJ1mmpotq](https://open.spotify.com/track/6LgJvl0Xdtc73RJ1mmpotq)",
            "All my favs are here\n\n[https://www.reddit.com/r/ProgressiveSoundscape/](https://www.reddit.com/r/ProgressiveSoundscape/)",
            "the wholeeeee brat album x charli xcx",
            "How I fall Apart - Currents \n\nDissipate - Polaris\n\nKeeping Secrets - Fit For A King\n\nThe Black - Imminence \n\nWhite as Snow - Haste The Day",
            "https://open.spotify.com/playlist/37i9dQZF1EpfD6F3EMhigT?si=Gc9dNFeZTR2e5Q8L3FD3-w&pi=yNzSPvKnToe6A\n\nThis should do it",
            "Change - Djo\n\nAgain - Still Woozy\n\nWhite Lie - Lenii \n\nVon Dutch - Charli xcx",
            "Kind of all over the place.. the below has been on repeat this week:\n\n*Hold the line -Toto\n\n*May I Have This Dance (Remix)  [feat. Chance the Rapper] -Francis and the Lights\n\n*Hey Mami -Sylvan Esso\n\n*Fidelity -Regina Spektor\n\n*Hanuman -Rodrigo y Gabriela",
            "Randy - Justice\n\n2014 à l'infini - Ateyaba\n\nGhost - Machine Girl\n\nIdiologie - Siriusmo",
            "- Linda Perhacs - Dolphin\n- Nujabes - Color of Autumn\n- Cotton Jones - I Am the Changer\n- Angelo de Augustine - Time\n- Lana Del Rey ft. Father John Misty - Let the Light In\n- The Rolling Stones - Moonlight Mile\n- Rebel Eye - divine dreams\n- Massive Attack - Weather Storm\n- Rebel Eye - time flies\n- Villagers - Everything I Am Is Yours\n- Michael Kiwanuka - Home Again\n- Enya - Anywhere Is\n- Solace - Life Can Be Beautiful\n- Tool - Parabola\n- Gojira - The Way of All Flesh\n- Paul Simon - Still Crazy After All These Years",
            "Harvey - Her’s",
            "i’ve currently been obsessed with Porter Robinsons “Nurture” album",
            "Chappell Roan - Hot To Go, Red Wine Supernova, Pink Pony Club, and of course Good Luck, Babe! have all been in regular rotation this week. \n\nSabrina Carpenter's Please, Please, Please is such an earworm for me. I love Espresso & Nonsense too. \n\nCharliXCX's newest album is great, I like 360 and Von dutch.",
            "Luna- Smashing Pumpkins\nNeedles And Pins- Deftones\nGas Drawls- MF Doom\n3 Libras- Perfect Circle\nPretty On The Inside- Hole\nStellar- Incubus\nJerry Was A Racecar Driver- Primus (yes i think Primus is genuinely good, even the South Park intro)\nFade Into You- Mazzy Star\n\nim sure you alr know these but you can always rediscover them. these are the ones im obsessed with rn.",
            "[Jonathan Brenner - Instagram Success](https://open.spotify.com/track/3RDRtMqpv26BQrPLLV5afI)",
            "Lighthouse Spaceship - Lickerish Quartet\n\nBluebirds Blues - Lickerish Quartet",
            "Dream to live\nAnd \nFilling these voids \nBoth by Bert Ciani",
            "Here's 3 I can't seem to stop listening to recently \n\n- [HEAD by Jeff Rosenstock ](https://open.spotify.com/track/63lsZSbzF0ftRZynkijeqf?si=zT3DwPivQG2TXpIE3kWfvg&context=spotify%3Aalbum%3A41Iw3adQnA88gtmJ0pjJjA)\n- [Funhouse Monday by Dead Bars](https://open.spotify.com/track/5BpoqmRJNcCKaSaVuUapPp?si=YntVC3eDQKyPrbcjS8rwGg&context=spotify%3Aplaylist%3A37i9dQZF1EproBXW3lBmsX)\n- [Hopeless by Screaming Females ](https://open.spotify.com/track/7KCumGAAwgkDRxE2ORS5s7?si=25vu8sZMTrCiOMUm1f99Yw)",
            "Chris Young-Getting you home",
            "* Painbirds - Sparklehorse\n* Suha - Xiu Xiu\n* Tables Have Turned - Linda Ronald\n* Ottessa - Crippling Alcoholism\n* To Flow Through Ashen Hearts - Ulcerate\n* Améthyste - Alcest\n* I'm Deranged - David Bowie\n* Duality - Defacement\n* Death's Meditative Trance - Grave Miasma",
            "All time favs:\n\nFar Away - Yebba ft A$AP Rocky\n\nWhat Do I Say - Landon Tewers\n\nMenace - Quality Control\n\nFRZZN - OZZIE\n\n\nCurrent favs:\n\n1,2,3 - Amel Bent\n\nSomething Was Real - Eli & Fur\n\nRhiannon - Fleetwood Mac\n\nPessimist - Lithe\n\nUNDA ARMOR - BEAM",
            "Imagine by Slchld ft.eaj",
            "[you're gonna love this.](https://open.spotify.com/playlist/5mAms7rrsUJX9FWTcDyypx)",
            "https://open.spotify.com/track/5eURoU1GtJypHBQJTXWTPN?si=3SvO6uZHT2a-mMfMCWlVlg\n\n\nI’ll be at work and it’s like I can hear the beat sample play from a far distance.",
            "Yabn El Eh - Elyanna",
            "[Deerhoof - I Will Spite Survive ](https://open.spotify.com/track/3OqwzCXB8eNr1a3RTNo095?si=HmuDPABNQ7i2UjJkn465pg&context=spotify%3Aalbum%3A52TuJKHdg65zeIQWgBJlYE)\n\n[Cocteau Twins - Frou-Frou Foxes in Midsummer Fires](https://open.spotify.com/track/6i18oi8cbvlv9Y2QVBSzkB?si=vpomFj4fTfuzymF4qiDybQ&context=spotify%3Aalbum%3A5lEphbceIgaK1XxWeSrC9E)\n\n[Charli XCX - Sympathy Is A Knife ](https://open.spotify.com/track/5c9tBmJKbTdn1vhzXHeAwW?si=HY4pSKYUQKas3OFgFKU4yQ)",
            "AyeeKevo - Old Camp\nAyeeKevo - Prada Bags",
            "Electric Callboy - Pump It\n\nI Prevail - Bow Down & Scars\n\nBabymetal - Metal Kingdom \n\nThomas Rhett - Beer Can’t Fix\n\nIDKHOW - New Invention\n\nAsking Alexandria- The Final Episode\n\nMorgan Wallen - Neon Star & Up Down & Sunrise",
            "The Future is a Foreign Land - Ghost",
            "I just found Peach Kelli Pop thanks to r(slash)ifyoulikeblank. They’re pretty fun.\n\nEdit: I just saw your profile. Check out Little Simz if you haven’t already.",
            "The IDK's - Something about you!",
            "Melissa Etheridge, start with, Angels would fall, and spread out from there.\n\nLong Black Train by Josh Turner.\n\nWinterborn by Cruxshadow.\n\nMal's song, about the captain on Firefly.\n\nI'd love to lay you down by Conway Twitty. The best love song ever. \n\nWhiskey Lullaby by Alyson Krause and Brad Paisley.\n\nUnforgiven song trilogy by Metallica. YouTube has two 21 minute videos of them. One is with the lyrics displayed the other is visual depictions of the songs.",
            "Soap - Entro",
            "Legend has it by Run The Jewels, Little foot, big foot by Childish Gambino, primera cita by Carin Leon",
            "Just visiting. Wookiefoot",
            "Twocolors, Roe Byrne - Stereo\n\nhttps://open.spotify.com/track/31PeeweG94mVQsqNOLcq4B?si=j_suHz2gT2KvfgAAnZk1BQ\n\nAlok, Mondello’G, CERES, Tribbs - LET’S GET FKD UP\n\nhttps://open.spotify.com/track/0iB5f04XdJ2tcfhoVkeLV8?si=vlHT3ZnDTA2YeanyL0-ZIg\n\nR3HAB, W&W - Million Places\n\nhttps://open.spotify.com/track/3rCuELlVNqzcG8JHDJh76m?si=sUg64WXWTIe1thYlXyoGQQ\n\nBrennan Heart, Blademasterz - Sound Of The Blade\n\nhttps://open.spotify.com/track/1baZhM2jNlihmXJEWSjdlG?si=wnRmYbOnR8GePIj5KjrcNA",
            "Rusted from the rain - billy talent\n\nLouder than the DJ -billy talent\n\nMurder one - metallica\n\nNew divide - Linkin park\n\nI disappear - Metallica",
            "[Brooklish LoLa.FM](https://open.spotify.com/album/6Fwi1YFZ4gbAcdTgxsMKOx?si=o3Sw-sp_S4KHkCEgUdvuVA)",
            "Frequently heard these days;\n\n\nAccessory - [Elektrik](https://open.spotify.com/track/2vxS5T8xSgvmlAl2idMF7k?si=mGzOqrjfRhahcgJuDldtlw)\n\nDemeter - [Dope](https://open.spotify.com/track/3ZNOHVQAzLv7FhPYxlL31d?si=ebsr2SybTTeK11xRF_84SA)\n\n(G)I-DLE - [Queencard](https://open.spotify.com/track/4uOBL4DDWWVx4RhYKlPbPC?si=M8P6KNfcRhauLvE5xzRjiA)\n\nLuude, Elliphant - [Pachamama](https://open.spotify.com/track/3lFNDaob5QhwE9oo7J0uNT?si=2UEvzG1eRMmBFFofjQnf_g)\n\nInto The Pale Abyss - [The Darkness Within](https://open.spotify.com/track/6uXrkP7c97ZRHSV1TU9qSF?si=wW0brx7KTh2Thvl3gF1l_w)",
            "Honestly, anything my favorite musician wrote or played on….",
            ". Espresso - sabrina carpenter \n. So high school - taylor Swift \n. Hold me back - Heize \n. End of beginning - Djo",
            "BAD Disbeliever [https://open.spotify.com/track/0NoLvqTpM2mr3fGwhBUwfc?si=HPYttimPRACqGvlUdRsc\\_g](https://open.spotify.com/track/0NoLvqTpM2mr3fGwhBUwfc?si=HPYttimPRACqGvlUdRsc_g)\n\nPretty Baby’s Crown of Thorns [https://open.spotify.com/track/7ddis7HBFNo1NKsXY5af5r?si=UBMw8oeyTlK7p1bcSA2gbw](https://open.spotify.com/track/7ddis7HBFNo1NKsXY5af5r?si=UBMw8oeyTlK7p1bcSA2gbw)\n\nBad Boyfriend [https://open.spotify.com/track/1QlIUu5Av0A5VfWu4vQhbp?si=dLcEBNl4TNiO0a5oO93oWg](https://open.spotify.com/track/1QlIUu5Av0A5VfWu4vQhbp?si=dLcEBNl4TNiO0a5oO93oWg)\n\nSend Me a Postcard [https://open.spotify.com/track/6EXOSA4BWBM1AUsXxKwYDT?si=BWxEqjfZTJqON9uG6Dn\\_fA](https://open.spotify.com/track/6EXOSA4BWBM1AUsXxKwYDT?si=BWxEqjfZTJqON9uG6Dn_fA)\n\nHouse of the Rising Sun [https://open.spotify.com/track/7BY005dacJkbO6EPiOh2wb?si=ed40f2ef53214fc8](https://open.spotify.com/track/7BY005dacJkbO6EPiOh2wb?si=ed40f2ef53214fc8)",
            "Humankind - David Kushner",
            "This is my summer playlist, plenty of great albums to listen to\n\nhttps://open.spotify.com/playlist/77c5Pz8LafNC3bDVSyweVl?si=96SsRuKUQ-KcmygyWZdL7Q&pi=u-cdGSwUF_QPaz",
            "Mine really run the gamut of genres:\n\nLos Days - Dusty Dreams / West Winds\n\nFlorrie - Personal / Never Far from Paradise\n\nHammock - Love In The Void / Universalis / Mysterium\n\nDelain - Dark Waters\n\nGhost - Impera / Prequelle",
            "WAM- A$AP Ferg \n\nCaptain America- Cal Scruby\n\nSilver Tooth- Armani White\n\nTear the Roof Off- Bliss N Eso",
            "[Dear Mama by RVSHVD](https://open.spotify.com/track/76xYzFH13Kobw09L1moout?si=RW1tMwieQfWh54VBa-Vjiw)",
            "The entire Sleep Token catalog has been on repeat for a while now. Every song is good!",
            "Docket by Blondshell ft. Bully",
            "West Coast by Lana Del Rey",
            "All time low by Jon Bellion",
            "Why by Shawn mendes",
            "Nero Ke Homa- Stavento, Melina Aslanidou\n\n\nPodolyanochka- Alyona Alyona, Jerry Heil\n\n\nIkimiz Bir Fidaniz- Kamuran Akkor\n\n\nDiese EM 2024- Lovely & Monty",
            "All Along The Pyrenees - Skymachine",
            "My friends and I all made a playlist based on the prompt, \n\n\"What 100 songs would you listen to, exclusively, for the rest of your life?\"\n\nSo [here's that playlist.](https://open.spotify.com/playlist/4r6jZxSW3eHAKZyMmkAKDL?si=t3WbFfPNRRil-2XkH3gzng&pi=u-ahy5YK-KTm-E) . It's pretty genre-diverse and will always give you something fresh.",
            "1 2 3 - After the Rain\n\nMelancholic - Kagamine Rin",
            "The Warning Automatic Sun",
            "[Ori Blackstar- UFO](https://open.spotify.com/track/1fC8dtLfMapYZHdILBgNv8?si=o6jLhHffT4u_fSvnFHFxVQ&context=spotify%3Aalbum%3A15orJaJmuNCCUBLFM6A2ez)",
            "French Dream by CloZee and LSDream",
            "it’s not your right- sky ferreria",
            "Mine right now are:\n\n- That's What I Get - Orange Dog Club\n- Cocoon - Dayglow\n- You Only Live Once - The Strokes",
            "Mis favoritos en esta etapa de mi vida es la música Soul",
            "anything by ~ \n\n•ag club ( lyrical upbeat rap) but esp. 1) memphis part 2/ 2) columbia 3) noho 4) a bitch curious \n\n•matty wood$ ( indie rap hop) but esp 1) sunday 2) kelso 3)drugs on me \n\n•free party (indie rap) esp DND\n\n•1999 write the future (indie new wave rap) but esp.\n1)light rails 2) avocado shake 3)mint chocolate \n\n•kota the friend (lyrical indie rap hop) but esp 1) chicago diner 2) colorado 3) tulum \n\n•leroyce (lyrical indie hip hop) but esp 1) sunny nights 2) therapy 3)forever",
            "Taxi Blurr - Jay Park ft Natty\nTantrums - Normani ft James Blake",
            "[sympathy is a knife](https://youtu.be/S9s4Ckt-aKo?si=bfPcsz6TvH4DnpP4)",
            "She Sells Sanctuary- The Cult\n\nYou've Lost Yourself- Myrath\n\nCissy Strut- The Meters\n\nCan't Stop This Feeling- First Principle\n\nMirrors- The Bluechips\n\nDevil's Pie- D'Angelo\n\nNever Freestyle- Coast Contra\n\nお先に失礼します (Pardon Me, I Have To Go Now) (English Translation) - Hanabie.\n\nRita Mae Young- The Record Company\n\nPaper Dreams- Jamie N Commons\n\nCobra- Mcbaise\n\nTempted- Squeeze\n\nCalm- Chimp Beams\n\nPlay 'Em Off- PrototypeRaptor\n\nCirrus- Bonobo\n\nTank!- Seatbelts\n\nCandy Gun- Melt Banana\n\nLady May- Tyler Childer\n\nTennessee Whiskey- Chris Stapleton\n\nGhost Walking- Lamb of God\n\nNutshell- Alice in Chains\n\nHold The Line- Toto\n\nLeave It- Yes\n\nSails of Charon- Scorpions\n\nThis is everything in my current heavy rotation, hope this gives you something new and exciting! Only recently been finding my love of music again myself.",
            "Made to Please (Spite)\n\nLes Lacs du Connemara (Michel Sardou)\n\nWar Music (Impending Doom)\n\nKid of Darkness (Slaughter to Prevail)\n\nUntil it Sleeps (Metallica)",
            "Only Time Will Tell - Dave Hause\n\nI’m a White Hot Blade - The Empty Page\n\nEvery Time We Touch - Electric Callboy\n\nNight Lines - The Middlenight Men\n\nScreaming for a Change - The Iron Roses",
            "I love the Black Keys' new album Ohio Players and my favorite song on it is Don't Let Me Go",
            "* Porter Robinson- Russian Roulette \n* knocked Loose feat poppy - suffocate \n* chromeo - bts\n* Heilung - traust (live)\n* Elysian - now we are free",
            "Digital Bath & Rocket Skates ~ Deftones\n\nNew Dawn Fades ~ Moby\n\nRoygbiv & Dayvan Cowboy ~ Boards of Canada",
            "[love it when you call the feeling](https://open.spotify.com/track/1jARFFwkrAcEfgdR8JFeae?si=EqceUEbuSBK4qgnD6-yzNw)",
            "It's a good time to be a Charli XCX fan.",
            "Moizefala - Los Tres\n\nhttps://open.spotify.com/track/1RawgF2MjsJpR7cRxvIaal?si=9RyCut48QP-cB44tNTWlDA&context=spotify%3Asearch%3Amoz",
            "Salvador - Lana Del Rey\n\nFly with Me - BIBI\n\nTree home - Tyler the Creator \n\nLove Between.. - Kali Uchis \n\nAll beautiful sounds I swear",
            "Currently on rotation: \n\nhttps://open.spotify.com/playlist/64f0Myhr5wiWiuZkLqFaeo?si=0vpENUx5SUixlqjlFOnz7Q&pt=13d7b399f6831ee0e588be7525f44a4d&pi=e-wnR2PXvVRw-e\n\nIf it has to be one song\n\nZaho de Sagazan - Tristesse",
            "Semi charmed life by third eye blind",
            "I had some help - Post Malone feat. Morgan Wallen \n\nThe boy is mine - Ariana Grande \n\nMiss Americana & the Heartbreak Prince - Taylor Swift",
            "Medicate me- rain city drive and dayseeker \n\nNumb- sleep theory \n\nNo place like you- thousand below \n\nCrooked soul- dayseeker \n\nDeath we seek- currents \n\nGet out- circa survive \n\nLiving in tragedy- currents",
            "Here are some of my current favourites\n\n[Morrissey - Speedway](https://open.spotify.com/track/2gafwwlKlMoBVzRu2qLRUa?si=YXbqmTvVQhCSfLJzMQQPRw)\n\n[The Smashing Pumpkins - Drown](https://open.spotify.com/track/3eMYc6FK9XvyauIaxcJtRS?si=OHsrGnZVSwKZJgod0-sE2g)\n\n[Stephen Malkmus - Ramp of Death](https://open.spotify.com/track/7KJ3AqzfNbepjugXGyR7SF?si=APMvP4yURcS9Viw6Pd5XFw)\n\n[Ty Segall - Orange Color Queen](https://open.spotify.com/track/1dwOGpLiZxi519AXLsIkTa?si=EhZfjnALTXS8s49nT1g80g)\n\n[Waxahatchee - Right Back to it](https://open.spotify.com/track/17Zzi8qsn8mdm0t0JTGeQo?si=kd7DUOd0QzyTYr1KfpsnGA)\n\n[Martha Reeves & The Vandellas - Heatwave](https://open.spotify.com/track/3Cbh1EJ6OYAPkkNRuTIz6T?si=92rdbX5SRMKTlRsTUP3Lkg)",
            "Any song by Federale.",
            "Faraway You, Point Breeze-Marah",
            "Probably not your cup of tea but this is my ultimate faves playlist at the moment\n\nhttps://open.spotify.com/playlist/4fxKwKyxB1gLVviazxI9VZ?si=Gg8OkDXYTMajLawDJ_J0XA&pi=HNqX9nmqRoylk",
            "[ufo](https://open.spotify.com/track/1UuoGLis0HTTjhpYVwqbw4?si=3wHFN9X7RmqQ878tPrnLvg)",
            "Queen - Play the Game \n\nIt's been floating in my head since seeing a concert movie a few months back. I keep hearing the lyrics.",
            "Recently found this artist Ablaye Cissoko and he makes really beautiful music: https://open.spotify.com/artist/7F6474dJ7eusD2MkXm2Lwx?si=IhTS0EmsQ52JnS6AY0RXgw",
            "Leather and Lace - The Six",
            "Big Special - Shithouse\n\n\n\n\nNever in a million fucking years\n\n\nDid I ever think I’d ever\n\n\nSee your fucking face again\n\n\nI’ll find you on the wall\n\n\nFind you in reflection\n\n...\n\n\n\nhttps://m.youtube.com/watch?v=OV5xTptjB1g",
            "Expresso by Sabrina carpenter",
            "[https://open.spotify.com/track/516v8wxdFgk8NB5VkvR6Aq?si=7ca5e3df0d814b26](https://open.spotify.com/track/516v8wxdFgk8NB5VkvR6Aq?si=7ca5e3df0d814b26)",
            "THEY NOT LIKE US",
            "Not Llke Us - Kendrick Lamar\n\nNot Llke Us - Kendrick Lamar\n\nNot Llke Us - Kendrick Lamar\n\nNot Llke Us - Kendrick Lamar\n\nNot Llke Us - Kendrick Lamar",
            "yeeess! also all of her songs in the midwest princess album are slept on, so highly recommend them as well!",
            "Followed. I like your playlists.",
            "The way this song actually makes me FEEL something",
            "Man, Everything is Alright was an anthem for me for like a year. Thank you for sharing this!",
            "Uy fellow geese listnener👌",
            "II most wanted is such a beautiful song, especially when driving",
            "I completely forgot this song existed!",
            "I used to love The Fall of Troy",
            "🫡🫡🫡🫡",
            "Gearing up for Warped Tour?",
            "Easily in top 5 albums. No bad songs. Japan exclusive track is also perfect.",
            "Love seeing Cal Scruby here! My fave by him \n is Faster",
            "And if I’m alone in the car this just goes on, the volume goes up, and the windows go down\n\n\nhttps://open.spotify.com/playlist/2dNpicQpYkvmKgn3TwooKY?si=TqnDmZ8jTLWa4f88zsWn-g&pi=e-WfoRjAhhSQ2K",
            "“Used to”?! Am I THAT late??",
            "Yeah buddy",
            "Really like that song as well! He's got a few I like, but the line \"put 3 dots on you like I ain't done typing...\" on Captain American makes me laugh every time",
            "No way! I just used to listen to that band a looottttt and got burnt out. But they’re pretty solid. And that song is pretty solid.",
            "He’s got some really clever word play. I love when him and Eazy Mac collab."
        ]
    },
    "Is there something wrong with spotify recommended?": {
        "title": "Is there something wrong with spotify recommended?",
        "score": 3,
        "url": "https://www.reddit.com/r/spotify/comments/1dlvh7a/is_there_something_wrong_with_spotify_recommended/",
        "content": "Whenever i play a song, the recommended queue therafter always ends up playing the same 3-4 songs. Dependent on genre too, like if im listening to any hip hop song the following songs will always be the same 4 hip hop songs every single time. ",
        "num_comments": 2,
        "comments": [
            "My radio is almost always the same songs",
            "Seems like repeating bug maybe. Have you considered sending a ticket explaining what may be considered a bug and not a feature?"
        ]
    },
    "What’s your least favorite album by your favorite artist/band?": {
        "title": "What’s your least favorite album by your favorite artist/band?",
        "score": 74,
        "url": "https://www.reddit.com/r/spotify/comments/1dlbsey/whats_your_least_favorite_album_by_your_favorite/",
        "content": "Just wondering 😄 My fav artist is Aaliyah and I  would say that even though it’s still a really good album, Age Ain’t Nothing But A Number is my least favorite. Some in part due to R. Kelly’s huge influence predatory influence but production and lyrics could have been better. \n\n",
        "num_comments": 154,
        "comments": [
            "Red Hot Chili Peppers are my favorite band…\n\n…but my least favorite album of theirs is probably The Getaway, their second album with Josh Klinghoffer filling in until John Frusciante returned",
            "Kill me, but I can’t stand Ummagumma. Those birds.",
            "All of their albums have plenty of bangers, but my least fave Gorillaz is Humans",
            "Metallica's my favorite band of all time and even I can't defend Lulu",
            "Florence and the Machine's High As Hope. It's not that it's a bad album, it's just a little whelming compared to the rest of their catalog.",
            "My favorite artist is Wallows, they only have 3 albums, but I think Model, their newest one is my least favorite? It might be Tell me that it's over?",
            "Pretty cold take but Pablo honey by radiohead",
            "Regional at Best - Twenty One Pilots",
            "Taylor Swift- TTPD and Midnights. Sorry not sorry. I prefer her old stuff (Fearless-reputation)",
            "Rin ring",
            "Father Of All... by Green Day",
            "weezer so like most of them",
            "Hot Space — Queen, and I hardly find people who enjoy that album.",
            "Fuzzy by Poppy",
            "Slipknot and BMTH \nleast fav album by Slipknot has to be - the end, so far\nby BMTH - music to listen to~dance to~ … \nno explanation needed there.",
            "1. Marilyn Manson - *Heaven Upside Down*\n\n2. NIИ - *Broken* \n\n3. Avenged Sevenfold - *City of Evil*\n\n4. Rammstein - *Sehnsucht*\n\n5. 3TƎETH - *<shutdown.ɘxe>*",
            "Meteora - Linkin Park \n\nHorizons - Parkway Drive \n\nHoly Hell - Architects\n\nEdit :- Sorry,I read fhe questions wrong, these are actually my top 3 favourites not least favourites",
            "Little Dark Age by MGMT. Its good, but it doesn't grab me as much as the other albums. Except a few songs like TSLAMP, One Thing Left to Try, and Little Dark Age.",
            "R.E.M. - Around The Sun",
            "Love Nine Inch Nails but not a fan of the Still album",
            "Green Day is my #1, and I have to say Father Of All Motherfuckers is, in my opinion, their worst album\n\nthe album itself sounds like scrappy pop to me and it doesn't really fit in with any of their other albums (as wholes)",
            "The Smiths is my favourite band but my least favourite album by them is Strangeways, here we come",
            "Guns and roses - Chinese democracy.",
            "Taylor swift- self titled \n\nDance Gavin dance-probably “whatever I say is royal ocean”",
            "Cut the Crap - The Clash",
            "The Clash is my FAVOURITE, but \"Cut The Crap\" was so terrible the band (which had already broken) feel apart",
            "Sonic Highways - Foo Fighters.        \n         \nI liked the concept of the series and found the history of the studios interesting.  But with 2 decent songs (Congregation, God as my witness) and the rest mediocre filler,  the album is somewhat disappointing and a step down from Wasting Light.",
            "The Beatles are my favorite band.My least favorite album of theirs is Beatles For Sale",
            "Madonna, my least favourite album is probably Madame X, although I don’t really like anything shes released since Hard Candy. ",
            "I think it's Stup Religion by Stupeflip (a french group), I really like this album but it's my least favorite",
            "Skinny Puppy - Mythmaker\nDEVO - Shout",
            "Therapy? - Shameless is objectively their worst album. It does have a few good songs though.",
            "Muse - The 2nd Law",
            "David Bowie's Let's Dance through Never Let Me Down period.",
            "The Runners Four by Deerhoof, too long and doesn't have the consistency of their other albums. Some great tracks though",
            "Collective Soul - The last 3 new albums. All the songs sound the same. I feel like Ed is in a creative slump.\n\nJars of Clay - The Shelter\n\nBT - Metaversal",
            "Look, BMTH's worst album, Count Your Blessings, is still like an 8/10. Same with Demi. Unbroken is still a 7/10.",
            "The Beatles - Let It Be",
            "Fear Inoculum - Tool",
            "On fail wings of vanity and wax by alesana\n\nI don’t hate it I just couldn’t rlly get into it",
            "Eagles- Eagles",
            "I love Orbital and but I can't stand their Blue Album. \n\n  \nDespite containing my two most favourite music (Pants and Bath Time), I don't like most of the songs in the album and they don't give that Orbital energy they had in their previous songs. The only album I'd be skipping songs.",
            "Proper Dose bu The Story So Far. Still a great album but my least favorite of of all of them including the new album that just came out",
            "Aerosmtih - Done with Mirrors.",
            "for tool probably fear inoculum, for opeth probably sorceress",
            "Cruel question, my favourite artist is Gregory Alan Isakov and I love every single of his songs. But if I had to choose my least favourite album it gotta be Songs for October, his first one.",
            "My favourite artist is The Beatles, With the Beatles would probably be my least favourite, if not that than Please Please Me.",
            "Portugal. the man - Woodstock",
            "kanye is good but jik missed",
            "My favorite artist is Tech N9ne and my least favorite album has to be \"strangeulation 2\"",
            "Save rock and roll - Fall out Boy",
            "Sweet 7 by Sugababes",
            "The Chainsmokers - Summertime Friends (EP)\n\nThe whole EP felt so low effort. The songs were short, the collabs were mid, the patters were repetitive. It kinda felt the label just forced them to make this album. Except the song \"Summertime Friends\" I think rest of them are pretty forgettable.",
            "Favorite band: Billy talent \n\nLeast favorite album of theirs: crisis of faith \n\nIt’s def a good album but is most definitely their weakest.",
            "EMs Encore. Not a bad album by any means I love everything he touches, some more than others",
            "I Am - Nas. \n\nIt was heavily bootlegged which resulted in a revamped track list and ruined the planned double album “I Am Nastradamus”.\n\nI Am didn’t age well. \n\nNastradamus wasn’t received well initially but has aged very well and is a better album than must give it credit for.",
            "Hurley by Weezer.",
            "For Pearl Jam, Gigaton. For Metallica, Lulu, and it’s not fucking close. You could argue about PJ’s worst (in your opinion), but Lulu is factually correct",
            "Entergalactic - kid cudi",
            "Queen by Nicki Minaj",
            "Eluveitie - Slania\n\nOnly have 1 or 2 songs on that album I really like. Also im not counting Eluveitie's folk albums of course.",
            "Simulation Theory - Muse",
            "Lana del rey\n\nI think Born To die, it was a before and after when I listened to video games for the first time.\n\nNorman F.. Rockwell was also like the end of a era for me",
            "Linkin Park, The Hunting Party\n\nTaylor Swift, Red",
            "Slipknot. They never really had a bad album, but so far the one I enjoyed the least is The Gray Chapter. Still a pretty good album, but it doesn't stand out as much as the other ones, and doesn't have that memorability",
            "Automata I by between the buried and me was just so boring, god knows how condemned to the gallows won a grammy… automata II however, is top 3 for me",
            "Revival - Eminem",
            "I'm a Queen fan, and my least favourite is Flash Gordon. It is a little bit of a cheat because it is a soundtrack, but they also did music for Highlander, and that is a top-tier set of songs on probably my favourite album by Queen.\n\nFlash is an OK song, but it is probably the peak of the album. Some fans hate on Hot Space, but there are at least four or five songs on that album that are great.",
            "Lana NFR",
            "Teenage Emotions by Lil Yachty",
            "happier than ever billie eilish",
            "The desperado undead by Set to Stun, phenomenal album and unjustly underrated",
            "Mitski is my fave, least favorite is Laurel Hell. Not a bad album by any means I do enjoy it, I just think it's the weakest relative with her other albums.",
            "the my chemical romance album after the black parade was terrible.\n\ni think it was the reason emo music died so quickly after 2008.",
            "Queen- Queen II (overrated in the fandom) and ANATO (overrated worldwide). I prefer late 70s albums and 80s albums (yeah, including Hot Space)",
            "[deleted]",
            "Deftones - gore\n\nOf Mice & Men - Cold World\n\n$uicideboy$ - Long Term Effects of Suffering\n\n21 Savage - the one with drake. boo.",
            "i love bastille an embarrassing amount but their most recent album, “give me the future,” is genuinely terrible",
            "I will say that I do listen to it more than I do The Final Cut…",
            "Yeah, sometimes a Gorillaz album can be a bit out there, but I def have fewer songs liked from that joint.",
            "My favorite is How big, How Blue, How Beautiful",
            "Wallows is also my favorite artist! I agree, their latest album was a little lackluster compared to their other work, but I still had fun with it. What were your favorite/least favorite songs from Model?",
            "agreed, i think it speaks a lot to how good Nothing Happens is, though",
            "Nothing happens?",
            "In rainbows",
            "Kitchen sink?? Trees?? Ode to sleep??",
            "nah that's horrible how dare you",
            "ABBA?",
            "👏",
            "Lowkey White Album is the best",
            "I was a huge Queen fan as a preteen back in the 80s.  Stopped buying their albums after picking up Hot Space.  Music was a huge investment back then, might take all your spare money for a week at that age just to get one album.  Wasn't willing to risk it with Queen after getting burned that hard.",
            "You must be a Gen x or Boomer. Queen fans of those generations don't like that album. Millenials and centenials usually love the album (like myself).",
            "Im so sad at where BMTH ended up. i get bands change and grow but i miss the old days.",
            "You don't like broken and Sehnsucht ????  I can't believe you! Last is a banger!",
            "Broken?? Damn lol",
            "How did you get the backwards N? And E",
            "Meteora is your least fav LP album? Wow. What your fav from them? I’ll give it a listen",
            "Meteora? I have not listened to every LP album in full but damn.",
            "No way these are your least favourites.",
            "Really Meteora? Can I ask why?",
            "Least 3 favourite \n\nHunting Party - Linkin Park \n\nDarker Still - Parkway Drive \n\nNightmares - Architects",
            "That album was literally the last one under a label, so they made the bare minimum to get ride of that contract. I love it bc of that and bc it made me company during the pandemics.",
            "So true.. the only tolerable songs are This is England and Three Card Trick",
            "I literally just had this conversation with my coworker because we both love Muse and he also ranked 2nd Law last.",
            "I more or less agree with you, but including Let’s Dance, is an interesting choice. It’s a pretty good album, albeit not as good as the likes of Ziggy or Low. Overrated though.\n\nI would say Tonight through to hours is his worst run, except Earthling which is a pretty great album.",
            "GOOOOLLLLDEEENNN SLUMBERS FILL YOUR EYEESSSSSS",
            "It sucks when they drop to a 9!",
            "I’ve tried so many times and I can’t get into anything past Encore. It’s just not good. I need drug fueled, angsty, fuck the world Eminem",
            "Emo music is still very alive, and MCR is pop punk, not emo. \nPop punk is also still going pretty strong.",
            "I'll come after you because you're posting offtopic. Nice to know (well, read it in a classic british manner) your opinion of Taylor, but it's got nothing with this OP.",
            "I adore that album, but it’s probably my least favorite out of all of them. Wild World is my fave",
            "My favorite was definitely Don’t You Think it’s Strange and my least favorite was Canada. I still think Model was amazing",
            "Ode to sleep and trees are better on vessel",
            "LOVELY??? Hello!!! I literally BOOTLEGGED A VINYL",
            "Least favorite and bad don't necessarily correlate",
            "Yes",
            "B side of Hot Space is more like \"the old\" Queen... idk. Just not buying an album for 3 or 4 songs that were \"disco\"? Bc these are literally 4 songs (Staying Power, Dancer, Back Chat, Body Language), is just the side A!",
            "Harsh. Yes, I am old, too.",
            "Nah their new album slaps",
            "I love *Sehnsucht*, just not as much as the rest of Rammstein’s discography.  \n\nI’m largely indifferent to *Broken.*  I love *Help Me, I Am In Hell* and I really like *Physical (You’re So)*, but that’s about it.",
            "It just doesn’t do much for me personally.",
            "I copied it from Google and pasted it into my Keyboard Text Replacements so that “nin” autocorrects to “NIИ” and “3t” autocorrects to “3TƎETH.”",
            "Man I'm such a fool, I read the question wrong, I read best 3 albums instead of least 3, sorry these aren't my least 3 favourite it's actually my top 3 albums 😭😭",
            "I included Let's Dance because it's the beginning of Bowie's creative slump and in my opinion, it's almost as weak songwriting-wise as Tonight. What keeps it from being as weak as the other two are Nile Rodgers' stellar production and SVR's guitar work. Both LD and Tonight are above NLMD because both records each have an incredible song in each, Cat People and Loving The Alien (which I consider the best Bowie song of the era).\n\nA lot of the weaker aspects in the other two records are here too: uninspired filler tracks (Ricochet, Without You, Shake It), covers which I personally consider to be inferior to the originals and don't really add anything (China Girl, Criminal World) and a re-recorded version of an older song (Cat People, but I do like this version a lot more).\n\nThis was the first instance in which a Bowie album was just the singles and offered little else in the album itself and without Rodgers and SVR, the charm faded away to leave these issues in full display. Even in the case of Space Oddity, which people just remember for the title track, the album itself offers absolute jewels of Bowie's discography such as Cygnet Committee, Wild Eyed Boy from Freecloud and Memory of a Free Festival.\n\nAnd yeah, 90's Bowie is very divisive. I personally love 1. Outside and Earthling and just a month ago Black Tie White Noise finally clicked with me. I should listen to hours again soon, haven't listened to it in like 10 years or so, but I do remember thinking \"meh\" afterwards.",
            "Yeah, I'm not a fan of Abbey Road either.  Definitely overrated.",
            "6 or 7 but hey it’s all personal preference",
            "they’re definitely emo and more post hardcore",
            "I share your opinions there. I think my least favorite was I Wouldn’t Mind. For me it didn’t flow with the rest of the album. But I may be too critical since it just came out 😂",
            "Oh yeah, true. For some reason I forgot they were remastered on there. Still RAB has its bangers",
            "yeah u right",
            "I was actively in the fandom for some years (even owning fanpages) and I had interacted with lots of queen fans of all ages, so I'm speaking from experience.",
            "Yea no hate on them at all love them to death, theyre just my main nostalgia band so i compare the old sound a lot w them.",
            "I understand, from broken my favorites are last, march of the pigs and physical, rammsteim... Sehnsucht and their first album I can listen to them full without skipping a song, the other albums are a work in progress lol nowadays I'm hooked to  ich tu dir weh 🤘🎶",
            "Wild. I think it's one of the best haha",
            "You like it even less than With Teeth?",
            "interesting, I'll have to figure this out",
            "Ohhh okay. That makes much more sense",
            "😡",
            "Honestly I love I Wouldn’t Mind, well I guess it’s just because Cole is my favorite.",
            "That’s cool. I thought I saw an earlier version of your comment that said “stfu.” Maybe I was mistaken.",
            "Yeah, I remember then That’s The Spirit dropped and said “this is way more poppy than anything they’ve ever done. The end is near” lol. What a great album, though. Haven’t cared for anything since.",
            "Yes.\n\n*[WITH_TEETH]* is a near-perfect album in my opinion.",
            "Well, that's where we diverge 🤣 I don't categorically hate it but a lot of it doesn't gel with me"
        ]
    },
    "Math themed playlist - need recommendations ": {
        "title": "Math themed playlist - need recommendations ",
        "score": 9,
        "url": "https://www.reddit.com/r/spotify/comments/1dloavd/math_themed_playlist_need_recommendations/",
        "content": "My partner is a high school senior math teacher and I’m trying to make a math-y playlist for him. I’d love some suggestions. Any genre is fine, swearing is fine. \n\nSo far, I only have two songs:\n\nMathematics - Mos Def\n\nPusha T & Kendrick Lamar - Nosetalgia \n\nThanks in advance!",
        "num_comments": 16,
        "comments": [
            "I know my calculus by 2gether",
            "One is the loneliest number that you'll ever see",
            "Lateralus - Tool\n\nThe title track relies on the [The Fibonacci Sequence](https://youtu.be/W9ReVCspSf0?si=dzgjWT1AP-ihyNTt)",
            "Tub Ring - Faster\n\n\nShellac - New Number Order",
            "Hives - Introducing the metric system in time\n\nAtom and his package - (Lord it’s hard to be happy when you’re not) Using the metric system\n\nFugazi - Long Division\n\nETA: Violent Femmes - Add it up\n\nModest Mouse - Neverending Math Equation\n\nThursday - Counting 5-4-3-2-1",
            "2 + 2 = 5 by radiohead\n\n4×4 by Miley Cyrus\n\n3, 6, 9 by Cat Power\n\n1, 2, 3, 4 by Plain White T's\n\n\n\n(i would say 34+35 by Ariana Grande but maybe not appropriate to send to a teacher)",
            "New Math by Bo Burnham.\n\nReally funny song by an unusual stand-up comedian.",
            "Academia by Sia",
            "Feel Like A Number - Bob Seger\n2-4-6-8 Motorway - Tom Robinson Band\nLove Potion Number 9 - The Searchers\nMore Than A Number - The Drifters\nMambo No. 5 - Lou Bega\nWonderful World - Sam Cooke\n54-46 Was My Number - Toots & The Maytals\nRikki Don't Lose That Number - Steely Dan\nSubtract You - Zebrahead\nMultiplication - Bobby Darin",
            "pi-psychedelic p crumpets",
            "Statistician Blues. - Todd Snider",
            "The number song by DJ Shadow",
            "Slices by e40",
            "Back At One - Brian McKnight",
            "Two can be as bad as one. It's the loneliest number since the number one"
        ]
    }
}