{
    "Post WWE SmackDown on FOX Discussion Thread - June 21st, 2024!": {
        "title": "Post WWE SmackDown on FOX Discussion Thread - June 21st, 2024!",
        "score": 135,
        "url": "https://www.reddit.com/r/SquaredCircle/comments/1dlkpl6/post_wwe_smackdown_on_fox_discussion_thread_june/",
        "content": "SmackDown Episode #1296\n\nVenue: Allstate Arena (Chicago, IL)\n\nAttendance: 14,698\n\n---\n\n#**Results of Tonight's Show**\n\nMatch|Stipulation|Winner\n---|---|---\n**Bianca Belair** vs. **Michin** vs. **Chelsea Green**|Money in the Bank Qualifying Match|**Chelsea Green**\n**Randy Orton** vs. **Tama Tonga** vs. **Carmelo Hayes**|Money in the Bank Qualifying Match|**Carmelo Hayes**\n**Kevin Owens** vs. **Andrade** vs. **Grayson Waller**|Money in the Bank Qualifying Match|**Andrade**\n**Cody Rhodes** vs. **Solo Sikoa**|Singles Match|DQ/No Contest\n\n\n\n\n\n#**IMPORTANT NOTES:**\n\n* We're opening tonight with CM Punk in his hometown. He recounts Drew kicking him while he was down, and he decided to go the Chicago route, he wouldn't stay down. Punk planned to bury his career 6 feet under -- he just didn't think it would be that easy. He was looking forward to doing more bad things to him, but Drew took his ball and went home. Paul Heyman interrupts, saying he's not here in disrespect, despite being the Wise Man to the tribal chief Roman Reigns - he's here in an urgent situation. Punk says, you don't look so good... and Heyman gives him a big, long hug. Paul says driving in he heard on sports radio that Chicago is CM Punk's town, and that really pissed off Solo Sikoa. Now that he's the Head of the Table, he wants every town to be his town, and he wants a favor & a favor back. He says once Punk is cleared, folks will be in the ring with the Best in the World, but they don't care right now, they'll come for him. Heyman reiterates that with love and respect, please get the hell out of here right now. Punk is incredulous that Solo & the Tongans would think to ambush him in Chicago.\n\n* Sikoa's music hits and Solo says, if he wants to be on his show, he's got two options -- either pay his respects to him and the Bloodline, or they'll make sure his ass never gets cleared. Punk asks Paul, what's the favor he wanted if he does this for him? Paul says, take me with you. CM Punk acknowledges... that he doesn't see the Bloodline standing in front of him, he sees a bunch of fake-ass usos and a cosplay tribal chief. The Bloodline enters the ring, and from behind Punk, Cody Rhodes enters the ring with two baseball bats. Cody says he fashions himself as the head of the table right? Well I've already beaten the head of the table. So why not leave the family backstage and we settle this tonight. \n\n* Corey Graves notes that security is increased tonight after the events on Monday Night Raw.\n\n* Jade Cargill talks to Bianca Belair backstage about getting their rematch for their tag team titles. But Bianca says tonight she has to focus on her Money in the Bank qualifying match.\n\n* Cody Rhodes vs. Solo Sikoa is set for later tonight; Randy Orton chats with Cody backstage and asks if he really wants to do this? But Cody says yeah, he's sure. Kevin Owens is also there and is concerned, but Cody says he has a plan.\n\n* Blair Davenport chats with Bayley who was watching the match backstage, asking her to relay to Naomi that she's really looking to face her in the MITB qualifying match next week. And she's really looking forward to cashing in on Bayley.\n\n* Paul Heyman is in the Bloodline dressing room with Solo Sikoa staring him down. Solo demands he tell the Tongans that KO and Randy are to be taken out. Paul asks, you want me to do it? Solo says, if I say I want you to do it, you'll do it. And when he comes back, the two of them need to talk.\n\n* Kayla Braxton talks with Grayson Waller backstage, noting his partner Austin Theory is at home injured tonight. Waller says he's going to win the MITB for the both of them. He's interrupted by Johnny Gargano calling him a fake friend… but they all get interrupted by the crash of a garage door opening. It's Drew McIntyre, with a beaten and bloodied CM Punk. Drew carries Punk over his shoulders into the arena where he drops him on the ramp. Drew steals a bracelet from Punk's wrist. Nick Aldis appears with security and Drew shoves him, with Nick shoving him back and words are exchanged. Drew just stares at the battered Punk as he slowly backs away. \n\n* After commercial, we see CM Punk getting placed in a neckbrace, on a gurney, and hauled off in an ambulance.\n\n* KO & Tonga Loa appear to affect the MITB Qualifying Match but only serve as a distraction as they take each other out.\n\n* We get a recap of the ending of Raw earlier this week where the Wyatt Sicks were unveiled. \n\n* LA Knight hits the ring, asking Logan Paul to get his goofy hair and US title down to the ring. He's said, he wants the championship, but Logan said no. He showed up at his house, and said no. He heard Logan was supposed to be in the ring tonight, but he no-showed Chicago. He doesn't want the triple threat match to qualify for MITB, but he'll beat him. Santos Escobar interrupts. Knight is mad, he asked for Logan Paul. Escobar says he must be delusional, chasing Paul like a desperate Chicago fanboy. But next week, he's dealing with Santos Escobar. Knight says he's looking past him, but Escobar interrupts him with a cheap shot. Knight turns the tables and says you can get beat up or you can get -- he's then hit from behind by Logan Paul!\n\n* As KO heads to the ring for his MITB qualifying match, he's attacked by the Tongans. However, he still makes his way to the match.\n\n* Michin is nursing her wounds backstage, and Tiffany Stratton shows up to offer her \"condolences.\" Michin says, at least she doesn't run to Nia Jax for protection. They spar for a moment before Nia shows up and takes out Michin. Tiffany laughs.\n\n* Next Friday, we have more MITB qualifier matches announced: Candice LaRae vs. Jade Cargill vs. Tiffany Stratton; Naomi vs. Blair Davenport vs. Indi Hartwell; and LA Knight vs. Logan Paul vs. Santos Escobar!\n\n* Kayla Braxton backstage addresses the CM Punk/Drew McIntyre situation, noting that Punk will be staying overnight at a local hospital for evaluation.\n\"\n* Paul Heyman says he's talked to everyone as he was told. But, per Roman Reigns, Solo is breaking commandments. He wasn't supposed to touch CM Punk, and he was only supposed to have Cody Rhodes in check so that when the Tribal Chief comes back… Solo interrupts him saying he hates to tell him this, but Roman isn't coming back. As Solo leaves for his match, Paul asks into the ether, \"how can that be?\"\n\n* The main event is nearly immediately crushed by interference. The Tongans, Kevin Owens & Randy Orton - with the Bloodline temporarily taken out. As Solo is cornered against the turnbuckle, he starts laughing maniacally, and from behind Jacob Fatu attacks! Fatu tosses Cody onto the announce table and leaps from the top rope to splash! Solo hugs him, and the Bloodline ends the night throwing up the 1s.\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n---\n\n**Additional Plugs**\n\n* Revisit the [live thread](https://www.reddit.com/r/SquaredCircle/comments/1dlh7jq/live_wwe_smackdown_on_fox_discussion_thread_june/)\n\n* Check out our [SquaredCircle Twitter account](https://www.twitter.com/wredditofficial) for all sorts of AMA announcements and interaction!\n\n* Join our [SquaredCircle Discord](https://discord.gg/squaredcircle) for live chat!\n\n* Be sure to follow [@WWE on Twitter](https://twitter.com/wwe) and [Like WWE on Facebook!](http://www.facebook.com/wwe)\n\n* Like other wrestling promotions? Perhaps you're looking for other subreddits related to wrestling? There's a sub for that! Check out /r/AEWOfficial, /r/luchaunderground, /r/njpw, /r/ImpactWrestling, /r/ROH, /r/indiewrestling, /r/Wrasslin and more!\n\n---\n\nNext week's Smackdown will be live from New York, NY.",
        "num_comments": 694,
        "comments": [
            "Monday on RAW - Wyatt Sicks\n\nTuesday on NXT - Joe Hendry\n\nFriday on Smackdown - Jacob Fatu\n\n\nGreatest week ever.",
            "Looks like Tongans didn’t know about Fatu they look scared at the end although it was subtle",
            "I'm glad Wyatt Sick6 didn't show up. It logically made sense with all the security. And also woulda belittled the debuting Bloodline member.\n\nEveryone was so focused on the Wyatts, that an unknown threat made their way in. \n\nNeat.",
            "The fact that so many people expected the Wyatts to break up Cody's match but hardly anyone is disappointed because we finally got Jacob Fatu is just proof that WWE is firing on all cylinders.\n\n10/10 show.",
            "A really really good episode of Smackdown tonight. \n\nPick your poison if you're signing with WWE. You got the mass murdering weirdos on RAW, or you got the Polynesian Hit Squad on Smackdown.",
            "https://preview.redd.it/vuk56qio618d1.png?width=640&format=png&auto=webp&s=e2ce57e822a78348f4e9b6018a1cec90d3b3a8d3\n\n  \nChelsea 4:69 says put that MITB briefcase on Green",
            "https://preview.redd.it/1oyzp55l518d1.png?width=1920&format=png&auto=webp&s=b4aed18a7967d9d97fc0311c29ba12b7d7ae2d29",
            "Awful lot of murder on WWE television this week",
            "Pretty top-tier SD. I have to say I love Chelsea Green winning the qualifier, and I *really* hope they give it to her - it'd be the funniest possible thing. \n\nAlso love the fact people actually have *friends* now, unlike when they'd be getting jumped and nobody would help.",
            "WWE casually dropping one of the best Smackdowns of the year out of nowhere lol",
            "Might be the strongest week of WWE programming all year.",
            "https://preview.redd.it/ey8j44qha18d1.png?width=2560&format=pjpg&auto=webp&s=15980a86ef36ec498081af5b813cb629f842ca18\n\nApollo lmaooo",
            "Roman returing to the Bloodline after SummerSlam\n\n![gif](giphy|zPOErRpLtHWbm)",
            "The new Bloodline is like the Monstars from Space Jam, and Solo’s the fat green guy.\n\nAlso them lying about the overrun to cover for the debut and not imply a squash or bs was going to happen was brilliant",
            "Wyatt 6 on Raw, Wolfpack Bloodline on SD, and TNA on NXT. WWE served up a gourmet 3 course meal this week y'all",
            "Drew vs Punk has feud of the year written all over it as long as the matches deliver. Integrating Punk into the Bloodline story (even if just for one night) was great. ",
            "Chelsea for Miss MITB. The entertainment value would be too good to pass up.  \n\nNot that I wasn't sold on her before but the moment she came running back to the ring at Clash in disguise playing it for absolute truth that it would work, I knew she had to be the next MITB winner.",
            "Watching Heyman ask Punk \"Take me with you.\" Is both heartbreaking and really fucking funny at the same time.",
            "You thought Solo was f'n crazy.....Jacob Fatu is bat shit crazy!!!\n\nBest Smack Dahn this year!!!",
            "I think this all leads to Solo getting in over his head. He’s playing Tribal Chief, but he truly can’t do it the way Roman did. He’s gonna keep making rash decisions until it burns him, one way or another. Likely it’s Roman that teaches him that lesson.",
            "Jacob Fatu debut was dope. He hit a fuckin crazy splash from the top rope to the commentary table.\n\nEdit- also he was just Jacob Fatu. No new name. Good stuff",
            "- LOVED that every one that got in to MITB tonight were newbies. Makes it fresh and fun...and I am rooting for Chelsea to win now. Cause just imagine her with the briefcase every week complaining to Pierce 😅\n\n- Jacob Fatu impressed in those closing moments faster then Solo in the time he has been on the main roster( and I am liking Solo more and more). What a bad mfer.\n\n- Drew vs Punk: no notes, just brilliant",
            "JESUS CHRIST, HOW MANY OF THESE EVIL SAMOANS ARE THERE?! Like the damn Wayans’s kids.",
            "So apparently Jacob Fatu was late because he was getting fucking jacked.",
            "so wtf was Cody's \"plan\"\n\n\"Actually yes please do help me\"?",
            "According to Wiki, Jacob Fatu has 7 children at age of 32.\n\nThis guy fucks… a lot. And by this rate we can see the bloodline have their own weekly show in 2050.",
            "Solo vs Cody at Summerslam: I sleep\n\nJacob Fatu vs Cody at Summerslam: Real shit.",
            "This entire week was generational for WWE.",
            "my matchguide for the samoan werewolf:\n\njacob fatu vs la parka MLW 02/11/19 NO DQ\n\njacob fatu vs alexander hammerstone 1 MLW 04/02/23\n\njacob fatu vs JONAH/Bronson Reed HOG 25/06/22\n\njacob fatu vs hammerstone vs mads krugger/KRULE MLW 31/03/22\n\njacob fatu vs speedball wcpw 18/08/22\n\njacob fatu vs bandido wcpw 15/04/22\n\nargue with yo momma bout no nwo b-team ginyu force fuck you jacob fatu is a goat",
            "Jacob looks like if Super Boo ended up eating and absorbing both the Usos, Solo and Roman combined !!",
            "“Sir another Samoan has hit Smackdown”\n\nhttps://preview.redd.it/mtdnv685r18d1.jpeg?width=1500&format=pjpg&auto=webp&s=5b0bdc71f8d3745ab8d43904f11e9f9eb473887b",
            "So I think it’s fair to say the post-Wrestlemania lull is over after this week",
            "Raw had the Wyatt sicks \n\nSmackdown had the bloodline stuff and Fatu debut\n\nWWE killing these show endings",
            "That heightened security did a great job tonight huh, too busy looking for Rob Zombie characters that they didn't notice the freakishly jacked Scotsman or the psychotic Samoan sneaking around the back",
            "https://preview.redd.it/mkpucit3938d1.png?width=1080&format=pjpg&auto=webp&s=a7e14ce58643671042a4f34973c620a643df4062\n\nThe most accurate statement about them",
            "So when Roman returns, he’s going to have to Jey Uso his way into Smackdown’s good graces. \n\nFuck it, tag team champs with Cody for a month.",
            "This episode was an all timer. The Melo win, the Santos promo, Jacob Fatu, Drew beating the soul out of Punk. Seriously, I haven't been that invested in a while. Literally, I don't think they missed a beat. To be a wrestling fan in 2024 is to be blessed.",
            "10/10 show. WWE is on another level rn",
            "That show fucking ROCKED. Fuck Cody vs Solo. Let’s get Cody vs Jacob.",
            "That shot of Drew standing over Punk + the rest of the camera work was so damn good! They've been feuding for 6 months without a one on one match yet they've already told one of the most compelling stories in wrestling. WWE is just operating on a different level rn",
            "This feels like a huge stain on Nick Aldis’s otherwise great record as Smackdown GM. How do you have all that security and still let Punk get beat half to death",
            "I can't lie, I was not expecting Chelsea and Carmelo getting the wins tonight and moving on.",
            "GUYS CM PUNK IS IN A LOCAL HOSPITAL GOOGLE TELLS ME THERES 110 IN THE AREA LETS GET TO CALLING THEM AND VISITING TO FIND HIM!",
            "They’re small details but I just love how connected the show feels. Drew carrying punk past Waller, DIY, Candice, and Indie to the ring really adds a lot",
            "Tonight's show was fucking PHENOMENAL",
            "Hopefully them having Jacob Fatu absolutely destroy 3 of the top stars on SmackDown including the face of the company in his debut means they're going to actually push him as a solo star and not just as the new Solo",
            "When was the last time RAW and Smackdown both had shows with this much going on in the same week?",
            "Got Gout and am not able to sleep so I was able to watch SmackDown tonight live,\nholy fuck was this an unreal show to catch live, almost made the gout worth it.\nTop to bottom unbelievable stuff",
            "Chelsea would be the perfect Miss Money in the Bank. Give us the summer of Chelsea you cowards!",
            "[Jacob's shirt already on WWE shop.](https://shop.wwe.com/en/mens-black-jacob-fatu-wolf-t-shirt/p-356601439092023302+z-96-2840630944?_ref=p-SRP:m-GRID:i-r0c0:po-0)",
            "This was an ELITE smackdown omg. 10/10",
            "This is genuinely the best era of wrestling.",
            "Legit question, how many more potential Bloodline members are there?\n\nAnd of the new additions, who’s the best?",
            "#CHELSEA WON!",
            "Was there live and holy shit it was loud. I lost my voice. Was a great time and my first event since 2010 night of champions. I felt so happy.",
            "God-tier episode, almost never a dull moment. Didn't think we'd get Jacob so soon, huge debut.\n\nAlso loved the tease for overrun just to end the show early, keeps you from guessing how it goes",
            "WWE played on our expectations; people who didnt get entrances (Andrade, Carmelo, and Chelsea) won tonight!",
            "Honestly no disrespect, but anyone else think Alicia taylor just isnt good? Its honestly so noticeable after hearing mike rome and samantha irvin do the main roster,  she was fine in nxt but honestly feels like such a step down and brings down the presentation",
            "There’s just like a portal in the arena that spawns Samoan wrestlers on the weekly shows",
            "https://preview.redd.it/ghirubk0618d1.jpeg?width=1051&format=pjpg&auto=webp&s=b88451ea96fa6b8cad828d1e119a122eac89b5e4",
            "So much happened this week, I forgot Seth Rollins came back.",
            "Jacob Fatu is OP, what the hell man lmao\n\n\n\n\n\nAnd again, good for Drew!!!! Ready to use my year and a half of law classes to defend him, he's done nothing wrong (except a little murder, but that's okay)",
            "For all the talk about how Adam Pearce isn’t doing enough to protect his wrestlers, we had CM Punk get murdered, and Paul Heyman as a hostage, and KO and Randy getting jumped twice, and Nia jump Michin backstage and then a rogue Samoan show up and destroy KO, Randy, AND Cody.\n\nAldis needs to get some control over his arenas.  Smackdown is looking like as unsafe of a working environment as Raw, or the NXT parking lot.",
            "Jacob vs Cody could be an even better take on Cena vs Umaga, but Solo has to be in the way.\n\nHappy for Chelsea.",
            "Solo's Bloodline is basically the Ginyu Force of the WWE.",
            "probably one of the best week for wwe in years. wyatt sick6, joe hendry, jacob fatu, cm punk in chicago. wew",
            "Awesome Smackdown. I really don't get why people in the IWC are negative on Solo. He's doing a perfect job.",
            "**Increased security due to the ending of RAW**\n\n*BANGING*\n\n\"Hmmm, I wonder what's out there. Let me casually open this door, Gable's murder be damned.\"",
            "What a Chaotic Cinema (in Chicago) this episode of SmackDown was. 👏🏽👏🏽",
            "I wish Jacob was on team Roman but what a debut",
            "Jacob fatu making me feel like a kid watching wrestling again! Dude legit feels like a monster like Umaga!",
            "crazy good week for wwe, nxt included. debuting jacob now is perfect because smackdown had definitely been feeling a bit blah, and im feeling more optimistic about new bloodline vs codyvengers",
            "I know its not going to happen anytime soon, but one day, I need a Jacob Fatu vs Bron Breakker match",
            "Free my brother Paul Heyman 😔",
            "Did they just trademark those name to troll the fans 💀",
            "So excited for Davenport to finally get in the ring next week!",
            "this show is cooking so far, jacob fatu has arrived and drew mcintyre got his revenge by attacking cm punk in his hometown of chicago after he screwed him at clash at the castle\ni see hartenblower as a security guard.",
            "Drew finally got his hands on Corporate Punk and put him in the hospital, right in front of Punk's hometown crowd. it is justice, divine justice.\n\ntonight proved Solo is no match for Cody in a straight up fight.  Solo has brought in Jacob Fatu, but it may well blowback on him, or whoever is pulling the strings Solo is not gonna end up at the position he thinks.\n\nSolo also claims Roman is never coming back.\n\nCarmelo, Chelsea, and Andrade getting into MITB are good results!\n\nTiffy Time is a lock to win next week!",
            "Tonga Loa looked afraid of Fatu for a minute.",
            "There are some good ass storylines going on right now. They literally make you eager for next week as the ending credit appears this week.",
            "Top to bottom, this is way up on the list of best Smackdowns of all time",
            "https://preview.redd.it/u4yg3rxn818d1.jpeg?width=2048&format=pjpg&auto=webp&s=e41731f86c5469ffdba2e74830b1223f332f70d1\n\nThe moment THIS happens... oooh, it's gonna hit like crack!",
            "I don’t know how Fatu is on the mic but if he’s better than Solo he should be leading this group. He just completely upstaged Solo.",
            "So we got Jacob Fatu on Smackdown, and the Wyatt Sicks on Raw? What a week to be a wrestling fan!",
            "Paul Heyman saying Roman said Punk is off limits\n\na Punk and Roman partnership with Paul Heyman accompanying them to the ring, inject that into my veins.",
            "11/10 weekly episode. This was the final week or two before WM quality shit. MITB and SummerSlam already look like can’t miss shows.",
            "Chicago really got blessed with the best Raw and Smackdown of the year so far",
            "We lost the scottish troll DM Hunk but we get Scottish psycopath back",
            "Can't get my brain to figure out the MITB card. So much potential after this show.",
            "https://preview.redd.it/8m8mjkett18d1.png?width=2560&format=png&auto=webp&s=8613bf38e8c7ced6a5a8c66569cdfcedda9c00ff\n\nohhhhhhh boyyyyyy",
            "Might just be me but I feel like we might be getting early seeds of a Bianca turn which I would love. I still love her character but she needs a refresh and heel turn would give her that edge that it seems she’s been missing for a bit.",
            "Fun little thing I noticed. All the winners of the MITB qualifying matches didn't get entrances on TV.",
            "Imma need people to take their rose-tinted glasses off and stop with the \"this reminded me of the Attitude Era\"... because when you do, you'll realize that HHH is going for the crown with his storytelling; he wants this to be the greatest era in the history of wrestling. And if this week's Raw and SmackDown didn't convince you, nothing will.",
            "All hail the King of Kings 👑\n\n![gif](giphy|3oFzmnY7Sikt6KjDj2)",
            "Its gotta be Chelsea or Tiffany for MITB",
            "Jacob Fatu is booked differently than the Tonga brothers. Even they are concerned looking at Fatu.\n\nAlso did they end the show 2 mins early?",
            "Saw people saying Smackdown hasn’t had much in terms of any story progression the past couple of weeks. Whelp this episode more than made up for that.",
            "Top 10 Smackdown of all time.",
            "Fatu is a monster. Give him something to do and he’ll be great. I’ve been watching him for years mainly in MLW",
            "Shows like this are why I’ve watched Smackdown more than any other Western wrestling show for years and years now. Incredibly strong top to bottom \n\nHave never seen him wrestle and I’m absolutely terrified of Jacob, goddman man",
            "Firing on all cylinders. Punk/Drew is an S-Tier feud. Jacob Fatu debut was great. Wyatts from Monday added some dark underlying tension to the show.",
            "Jacob Fatu made a damn good impression. I hope they can keep that momentum going because I feel like the Tongan Bros have sort of cooled down after that great entrance by Tama due to the booking which has led to the New Bloodline feeling kinda aimless.\n\nOverall, damn good show tonight.",
            "So what was Cody’s plan??",
            "please give Fatu a bigger role than bloodline thug #4. He will deliver. I know these things take time, and theres a story to be told, but the man can entertain",
            "Everytime I see the tongans now all I can think of is the time they were literally pulling each other off of Kevin Owens? to beat him up.",
            "How many samoans are there",
            "The liminal space shot of Drew standing over a bloodied CM punk was phenomenal. All that space and gray in the background contrasting with the dark colors of CM punk and Drew McIntyre's shirt so crisp",
            "This week has been so good for WWE. Raw with Seth Rollins returning, the gable storyline still cooking, the Drew Mcintyre quitting and ofcourse the Wyatt Sicks debut. NXT who just needed Joe Hendry to put itself in the history books. And this smackdown with three amazing MITB qualifier matches, all three picking the right winner (especially Chelsea getting that pop), the incredibly hot Drew-Punk angle, and ofcourse Jacob Fatu debuting.  \n  \nThere has been so much amazing stuff this week it is ridiculous.",
            "That pop when Roman comes back to save Paul heyman gonna be 1999 stone cold level shit",
            "https://preview.redd.it/gzqp8irr618d1.jpeg?width=1061&format=pjpg&auto=webp&s=2ff0ed41a11f766b3184aa317e68038f628bd7ef",
            "POV: CM Punk trying to make Drew's life a living hell just went a little too far🤏\n\nhttps://preview.redd.it/6d930ucoh18d1.jpeg?width=1280&format=pjpg&auto=webp&s=30b1df5358111f604028b9e69e39f3dc1f84eb50",
            "Just finished rewatching the Jacob Fatu demolition…what a great episode of Smackdown after a great episode of Raw with Joe Hendry and Kaz on NXT in-between!\n\nWWE is crushing it.",
            "cody said he had a plan....his plan was to get the shit beaten out him?",
            "I was hoping for more Wyatt’s stuff, but I get it. Can’t do too much too soon. Leave us wanting more",
            "I wonder what Cody's plan was tonight? Was it having Punk come out with him?",
            "I like how they had all that extra security and a big ass Samoan still made it to the ring.",
            "I rarely watch live but I'm glad I did for this one.",
            "Zilla, Hikuleo, and Lance are on the clock as the next bloodline draft picks lol ",
            "Good Smackdown tonight with a hot crowd! Best in a while really\n\n  \nLoved the Jacob Fatu debut, and also the Drew/Punk segment. That was awesome. Punk's opening with heyman, also good. \n\nHappy for Chelsea Green. \n\n  \nThe Wyatt sicks vignette was awesome. Can't wait for Monday.",
            "this was a great smackdown episode and so much better than previous few weeks, all the matches were great especially the women's mitb qualifier (yayy chelsea won)\n\nL 👈 A 🫵 KNIGHT 👉 YEAAAAHHH had a great segment with santos and logan, main event matchup was alright but holyshit jacob is here\n\nenjoyed the show, 2hrs flew by so soon. see yall monday oh and, fuck drew i hope he never wins the world title",
            "I cannot f’ing wait for the next few months of buildup and for Roman to return. This is going to be something. \nTriple H has the vision for this and I’m glad he’s at the helm of this company now.",
            "Quite easy to tell why they were worried with bringing Jacob in and considered debuting him in NXT with Hikuleo instead of the Bloodline. He needed just a couple minutes to show his explosive charisma and his physique, and more important the things he can do in-ring, and people were already way into him. I imagine they'll try to keep him from cutting promos in a while, because when that happens, it's true game over for Solo. As good of a wrestler Solo is, you still get overshadowed when they put you in a stable with someone who does everything you're supposed to, but even better, and who looks better too. It's not a question of if, it's a question of when.",
            "I LOVED that they had Fatu just destroy all of them on his own and had Solo watch. They could have just done a beatdown angle, but he pretty much destroyed Cody on his own.\n\nWonder where this goes for MITB. Do we get Bloodline vs Cody/RKO/Punk? Might be a decent way of easing Punk back into ring shape before SummerSlam.",
            "This has to be one of the best back to back RAW/Smackdown weeks in WWE history right?",
            "jacob fatu is a fucking star",
            "I’m excited for the Cody & Roman mega powers teamup to end Summerslam but curious how they explain why Roman isn’t interested in getting the belt back from Cody? I guess the head of table disrespect is a bigger deal in terms of Roman’s love for the legacy of the bloodline. Excited to see where it goes for sure.",
            "Every time Solo pops up I die laughing, dude just slides in with his titantron of two inverted pictures of himself, wearing a silk red T shirt and that ugly ass suit with the stupid gloves",
            "Clash, RAW, and Smackdown were all top tier! Best 7-day stretch in WWE history?",
            "All timer episode. Absolute bangers all around.",
            "Great episode! Glad to see the Chelsea in the Bank agenda goes on. Speaking of, some of it may have been the surprise-style pin, but it would have been hard even a year or two ago to imagine a crowd in 2024 going nuts for Chelsea Green winning a match over Bianca Belair.",
            "Is the implication that Jacob Fatu smoked Roman lmao",
            "Man Andrade is so good",
            "The fn superkicks man.\n\n![gif](giphy|l4Ki2obCyAQS5WhFe)",
            "I feel like Jacob Fatu is gonna make Solo's Bloodline work, guy looks like a complete maniac and can work on top of it. \n\nHim no selling KO's superkick was such a great \"oh shit\" moment. Can't wait to see more of him.\n\nThe Punk vs Drew and LA Knight vs Logan angles were also amazing, shout-out to the Punk and Heyman reunion. This might've been the best SD of the year so far.",
            "Cody needs to go after that ref. He told Jacob to go after Cody.",
            "Wow so many great moments, if I were to rank them: \n\n5. Punk’s return to Chicago\n\n4. Heyman-Punk nostalgic interaction\n\n3. Drew’s assault on Punk\n\n2. Jacob Fatu’s arrival\n\n1. Chelsea Green qualifies 😜",
            "WWE is on a tear this week",
            "Solo actually felt like a leader tonight. He is growing into the role.",
            "I know some people don't like it, but it's impressive that WWE has gotten HEAVY boos and quite a bit of shine for three different brand new to WWE (I'm not counting Camacho, sorry) guys off this story.",
            "Has Chicago hosted the best Raw and Smackdown of the year so far?",
            "Incredible show tonight! Jacob Fatu's splash onto Cody on the table looked brutal",
            "All's I got to say is Drew vs Punk better close out Summerslam",
            "Security was so preoccupied keeping the Wyatt6 out that they couldn't stop Jacob Fatu from getting in.",
            "That was honestly one of the best Smackdown episodes I've ever seen, hands down.",
            "The swerve with Cory saying we’re going to run over just to have a 10 minute beat down and still end early lol",
            "Triple h tonight\n\n![gif](giphy|rbMDQym45okqt3ZQg0)",
            "the Wyatt Sicks saw Drew McIntyre and Jacob Fatu hanging around and thought \"actually, Nick Aldis has enough on his plate tonight, let's stick to Raw\"",
            "Great week for WWE overall",
            "Probably the best Smackdown of the year.\n\nChicago is one lucky city, had maybe the best Raw of all time, and now another awesome show like 3 months later.\n\nEcstatic that Fatu has finally arrived.",
            "Jacob Fatu, baby!",
            "What was the significance of Drew taking the bracelet from Punk?",
            "Jacob fatu is gonna be fucking crazy I can’t wait to see more",
            "I like the storylines being set up here. Sucks that the women’s haven’t gotten much time but I like the Nia and Tiff stuff. \n\nSeeing Fatu is so much cooler than the other two’s debut. Bro’s a fucking beast. \n\nDrew and Punk’s feud has been legendary and when they actually throw down at Summerslam it’s going to pop so hard it’s crazy.",
            "Not sure if it was just the cable feed or what but right before the end logo popped up my screen went black and I worked myself into a shoot...",
            "Rlly enjoyed smackdown tonight, Jacob fatus debut was awesome",
            "The way commentary is selling how dangerous Jacob is and how risky he is makes me wonder.\n\nSolo is raising a dangerous enemy with his own hands. GoD were already dangerous enough, but Jacob too? Someone even GoD looked skeptical and scared of? Solo's surrounding himself with increasingly more dangerous people. He may not be out of their crosshairs forever.",
            "Punk and Orton are in side by side hospital beds",
            "CHELSEA GREEN!\n\nI’m so happy she’s in MITB. I really hope she wins. She’s my favorite.",
            "The Tongans looking at Jacob like he should be incarcerated is crazy good",
            "am i coping to say Paul’s gonna be on Raw monday to get away from the bloodline and finally make bron a Paul Heyman Guy?",
            "After seeing Drew murder Punk and Jacob Fatu doing what he did, Chad Gable is gonna send a giant fruit basket to the Wyatt Sicks for going easy on him.",
            "Solo should make Jacob, Heyman's keeper. Slaps him around when he's not following orders",
            "What a fucking smackdown",
            "And here I thought we are getting Cody/R-KO vs Bloodline at MITB. Then Randy finally turns on Cody the same night or the next for a Summerslam main event match.",
            "Genuine question as I’m so curious as to others take on this - now it’s been a couple months, how are you finding Cody as champion so far?",
            "What a great week to rediscover my love of getting blazed and watching wrestling. I haven’t really watched the product since Hangman won the title from Kenny.",
            "Master Gable has been medically cleared to compete on Monday. the wonders of medical science available to WWE.\n\nbut are things really over...or the same? :0\n\n[https://twitter.com/WWE/status/1804318437600006319](https://twitter.com/WWE/status/1804318437600006319)",
            "The camera effects of Solo's entrance were phenomenal. That blurred shot of him entering on a black background with green highlighting? Excellent",
            "About fucking time Chelsea Green gets some good exposure. Did everything over and above what was expected of her last year and the crowd went nuts when she won. \n\nJust a shame Bianca couldn't eat the pin as usual.",
            "both raw and smackdown were excellent this week. just good shit all around",
            "Man, listen... I'm an \"AEW sicko\" who has thought WWE has been good post-Mania. Good which has been kinda inflated by the goodwill and overall buzz the company has had.  \n\nBut THIS shit was great. A very exceptional episode. Hats OFF.",
            "thank you Drew\n\nthat is all",
            "A great smackdown in the middle of June. What a time to be a WWE fan",
            "REALLY good night for competitors \"ALREADY IN THE RING\".",
            "Bron Breakker Vs. Jacob Fatu is a possibility now. INJECT IT TO MY VEINS !!!!!",
            "I know a lot of people have been saying they were worried that Jacob Fatu would overshadow Solo, but I think WWE realized that, and it's why Solo's character has shifted so drastically. He's now more talkative, manipulative, and comes across as the brains of the operation. That lets Jacob take over as the powerhouse/monster of the group.\n\nReally great debut for Jacob. He got to immediately showcase what makes him so incredible: his insane physicality combined with bizarrely good aerial skills.",
            "The future is BRIGHT for WWE. Jacob Fatu The Wyatt 6 Dragonuv Bron Breakker Tiffany Stratton Carmelo Hayes… so many young stars!!!",
            "Clash at the castle \n\nRaw \n\nAnd now Smackdown \n\nThese WWE show endings are cooking 🧑‍🍳",
            "Very good show\n\nIf WWE does not yet plan to do the Cody vs Randy match, Jacob vs Cody should be the match for summerslam, he looked incredible tonight.\n\nCody was already about to beat Solo again tonight, I don't think that match should be done again at summerslam.",
            "That was great debut for Jakob fatu. He single-handedly took out the Smackdown uppper card babyfaces. Forget Heyman being scared, even the Tongans were scared.\n\n  \nAnd drew not saying a word is basically like the ‘time for talking is over.’ Just casually fireman’s carry cm punk across the arena.",
            "I liked punks promo, the Hayes match. Compared to last weeks smackdown this was awesome. MSG is gonna be good, but wouldn’t be surprised if it isn’t all that",
            "Jacob proved in 3 minutes he so much better than the current members of Bloodline",
            "The finish to KO v Waller v Andrade was clean",
            "I really do not like Alicia Taylor's ring announcing, it's not her voice, but her cadence that just sounds off.",
            "I was at the show and it was awesome seeing such an awesome episode live. I went alone but it was still amazing! The Jacob Fatu debut was so sick and the arena was insane for CM Punk. Really it was so hot the entire time. \n\nI need to find Chicago wrestling fan friends haha",
            "What a fucking episode. That was non-stop amazing. They intertwined so many main event level stories and made them all feel important in just two hours. \n\nPunk, Cody, Drew, Orton, KO, the Bloodline, Knight and Logan all on one show is insane. Add the looming threat of the Wyatt Sicks (I **loved** the added security) and this SmackDown was just perfect from start to finish. Cody and Punk standing there with the bats was such a cool image. \n\nAlso we got Tiffy Time **and** Chelsea qualified for MITB! I need one of them to win MITB so bad.",
            "I don’t know if it was the camera angle or Fatu’s athletic ability. But that was one of the most explosive and cleanest landing splashes through an announce table I’ve ever seen. Absolutely can’t wait for this man to get in the ring.",
            "That Punk - McIntyre feud is better than those belt storylines hahaha",
            "First time seeing Jacob Fatu he seems badass!!",
            "aldis put all the security ringside he forgot the parking lot is the most dangerous location in all of wrestling",
            "The spear to Ortan into the barricade looked nasty, Randy's scream sounded real",
            "I don’t think it’s likely since they seem to want to push Solo, but it would be interesting if Jacob kicks Solo out and takes the Bloodline from him. Solo made a Bloodline so reckless that it destroyed even him",
            "Literally turned off last week’s Smackdown vs. this one that fucking flew by. Good shit.",
            "This was a great episode. They're really cooking right now.",
            "Save us, Roman.",
            "I know half of Raw’s roster just died but the Bloodline is adding enough members to replace them.",
            "Top to bottom great episode",
            "past week have been attitude era-like endings & i’m here for all of it",
            "So what was Cody's plan?",
            "I want to see Jacob vs Roman",
            "Damn this week really kicked the stories to the next level. From Otis shoving Gable, to Seth Returning and the Wyatt Sick6 debuting. To tonight with Drew finally kicking Punks ass, Tension (?) maybe brewing between Jade and Bianca, to Jacob Fatu debuting and destroying the top 3 faces on Smackdown. Insanely good show that moved so much stuff forward for the summer months.",
            "I do wonder if they'll just have Roman return for MITB instead now to confront Solo. Given we just got Cody vs. Solo tonight, I wonder if they'll just run it back at MITB or just do the 6 man tag with Cody and RK.O against Solo and G.O.D.",
            "Solo had to bark at fatu to keep his arm up when throwing up the ones.\n\nAlso, who is this Joe Hendry guy? From the indies?",
            "Jacob did more in 5 minutes than the entire temu Bloodline did in two months, impressive",
            "That was a huge episode of smackdown and incredibly entertaining. WWE is on fire right now and I’m loving every second of it. From the punk promo, Paul Heyman’s acting being superb as always and when punk was attacked, to the women’s triple threat and both men’s triple threats having some excellent in ring work and finish it off with Jacob Fatu’s debut. Wrestling is the best!",
            "Security at a WWE event is as useful as Stormtroopers shooting at a distance ☠️",
            "All these big ass debuts holy shit",
            "Legendary episode tonight huh",
            "Very good I tuned in tonight. They picked the best options for the MITB with three banger triple threats. We’ve got Punk and Drew’s story furthered, and like I genuinely am excited to see where it goes. We know SummerSlam is basically a lock, but what happens after SummerSlam? I don’t know! And I can’t lie to y’all, I’m liking Solo Sikoa. I just wonder if it’ll be Solo vs Cody at MITB or SummerSlam.",
            "Melo is Money",
            "What if The Rock still oversees Bloodline 2.0 operations and will took over soon once Roman comes back with the original Bloodline?",
            "Chelsea got big pop! I mean she is Canadian so I kinda expected but still a surprise. I have all my bets on Tiffany tho as Ms Mitb. She is going to be great and after Nia beats Bailey, it will be a great storyline between both of them.",
            "dammit Solo has injected a lethal dose of poison into the WWE!",
            "Fatu is gonna take over and poor Solo is gonna get kicked out",
            "Fatu’s splash was fantastic!",
            "I want to like the new Bloodline but I feel like they're suffering from introducing too many new people all at once and they're under the paper-thin leadership of Solo of all people.\n\nTama Tonga, Tonga Loa, and Jacob Fatu might as well all be kind of the same person right now. There's nothing differentiating any of them other than the fact they're angry Samoan NPCs.",
            "Next week is MSG... if Chicago got Jacob Fatu, what is MSG gonna get? \n\nIt feels too soon to do it a week after Jacob comes in, but MSG would be the perfect spot for Roman to return.",
            "The bloodline is spawning like tribbles. A little less cuddly though imho.",
            "Anyone notice Punk fell on his bad arm?",
            "Papa H be cooking",
            "“I have extra security tonight because of what happened on Raw. Not on my watch….unless you’re a new member of the Bloodline. Then I’ll let you kill the talent.”—Nick Aldis",
            "I know Solo is getting a lot of hate but I think the Bloodline storyline is really good and following some very natural beats from other stories and even real life. The idea of this Roman leading this somoan dynasty for years then leaving Solo in charge who doesn't have the pedigree, the leadership, or even the talent so he turns to these lose cannon brutal henchmen the are already turning their back on the guidelines of the Bloodline is so realistic.",
            "so assuming we are heading towards full blown Bloodline civil war, and assuming some sides are probably picked already. \n\nRomans Bloodline is hugely outnumbered.\n\nRock/Solo/Tama/Loa/Fatu/Hikuleo\n\nRoman/Jey/Jimmy/Sami?\n\nI'm finding it hard to figure out anyone who would actually be willing to help Roman at this point. maybe... >!Roman finally forgives Seth after his anger for Seth cost him everything?!<",
            "Wasn’t that blonde guy in the front row who Punk walked by a dude from barstool?",
            "What inning is the Bloodline story?",
            "I have tickets for MSG next week. I am so excited for what that will be like.",
            "I think the theory that Rock took out Roman and gave his ula fala bead to Cody at Raw after WM is legit after Solo said Roman's not coming back.",
            "Top to bottom this was an *awesome* show. Great wrestling, great segments & promos, and furthered the builds & storylines all really well.",
            "I don't know much about Jacob Fatu but man has the build of someone who played a lot of contact sports growing up.",
            "This was a fantastic week for WWE. Banger episodes from Raw, NXT to Smackdown.",
            "I'm not sure if Roman Reigns will return so soon but I think it makes sense for him to come to Cody's aid at the end of Summerslam. However, I don't feel like Solo v Cody is a a Summerslam worthy program.",
            "Bianca had some weird strikes with michin outside of the ring. It looked like she was trying to punch her shoulder? Looked very odd. \n\nExcellent win by Chelsea Green! She's actually legitimately fantastic in the ring. \n\nThe Smackdown announcer put a different spin on Chelsea's name and I kinda dig it",
            "I saw a lot of hate for the idea of Cody/Solo at summerslam in a thread earlier and I really don’t get that. Is Solo as hot as Roman? Of course not, but he’s the top heel in the company right now and I think has been presented very well as an unhinged badass. \n\nWhere Roman was calculating and manipulative, Solo is just a straight up psychopath who has put together a bloodline designed to wreak havoc on the masses. \n\nI get Orton/Cody might feel “bigger” but Solo/Cody just makes so much sense, even if it is setting up Roman’s return.",
            "People hating the new bloodline, so you not realize they are being built to be the heel for face Roman to come back for? Who else could you instantly make Roman a face against returning? It’s all mechanism for Romans face turn.",
            "I can't help but wonder if the person who posted about Jacob Fatu's \"insane athletism\" half a day before his debut was a paid WWE employee.\n\nThe timing of that just seems..\n\nNot a hater. Just wondering",
            "Goddamn what a week\n\nGreat debuts on all shows\n\nThe Big Bads for the following season are established on the main roster & I can say I'm really excited",
            "What was Cody’s plan?",
            "https://preview.redd.it/qf44f5uxe18d1.jpeg?width=1920&format=pjpg&auto=webp&s=9086e8596d34387a14fb9ffbf07f2544cd089bfe",
            "move over solo",
            "Fatu has leaned the f out. Smackdown is officially on notice. A new monster is on the loose.",
            "So, how Hikuleo fit in to this story?\n\nDo they add another to the bloodline or do they make this interesting and have Brother vs Brothers?",
            "With how much the security was shown and mentioned i definitely expected something with them",
            "Which Uso is this, Judas Uso?",
            "God damn, this was an amazing week for WWE tv.",
            "Solo and Jacob are gonna 100% clash about who should be the head of the table in the near future before Roman's return.",
            "We are eating gold",
            "that was a sick smackdown. good matches, great stories. i thought for sure we were getting some more wyatt shenanigans but jacob fatu finally showed up",
            "No notes, good shit.",
            "It wasn't a matter of if.\n\nIt was a matter of when. The Bloodline only grow stronger, and Jacob Fatu is going to steamroll through the SmackDown roster.",
            "It’s time for Fatu to become the badass of the group (like Solo in OG Bloodline but better because he can talk) and let Solo be the dirtiest heel he can be, there’s definitely more to him than the tough act, like that smile he had on his face before Jacob’s debut, I’d love him to come in next week and just say that Roman will never come back again.",
            "wow i dont really follow jacob fatu in the indies much but it seemed like he went through a gunther-esque transformation and is looking lean",
            "There's been a lot of really good wrestling shows this week.",
            "We have a corrupt referee in WWE, he told Jacob Fatu to attack Cody lol.",
            "It says a lot that the weekly shows feel like they're on the level of PPVs at the moment.",
            "Hell of a week for WWE",
            "What a fucking great week of television this company threw at us this week.",
            "Absolutely INSANE Smackdown",
            "I was SO happy to hear “Jacob Fatu” and not “Caesar Sikoa”",
            "Was this an explicit full-on heel turn for Drew?",
            "Jacob Fatu in WWE. Fucking surreal! Also, this is somewhat a joke but imagine if Crews smiling in the background to Drew carrying Punk like a sack of potatoes was him on kayfabe picturing what he wants to do to Santos represented through Drew with Punk lol",
            "Jacob Fatu’s debut was done perfectly.  This guy is an absolute destroyer",
            "Jacob Fatu is going to be a world champ in no time.",
            "Anyone care to explain who exactly Jacob Fatu is and why is he so well-known?",
            "https://preview.redd.it/i2dadzo3c18d1.jpeg?width=1600&format=pjpg&auto=webp&s=4c2e39ca78a820b712aeedecf27e2efd5c8b67ec\n\n10/10",
            "How was the show tonight? The headlines make it look like it was really good.",
            "What a beautiful week of Raw and Smackdown.. at this point we gave out all the possible praises but they keep one-uping to the point where it’s fascinating. Usually this period of time within wrestling is a bit of a downer but they are firing on all cylinders. And the fact that history is acknowledged (like the Punk - Heyman segment) is a breath of fresh air.",
            "Holy shit what a night.\nThis could be best smackdonw of the decade",
            "We The Ones.\n\nGreat SmackDown as usual.",
            "That's a pretty good way of looking at it, even if I'm not sold on the Sicks due to Fiend/ghost Wyatt shenanigans from the past.",
            "This shit is so good. Solo is moving so reckless that he’s even confusing the one’s he already blunt forced into the group.",
            "Saw that. They looked reluctant to raise the one for a split second.",
            "Of course the Tongan:Samoan ratio has shifted.",
            "I think this all ends with (or at least leads to) a tribal civil wargames, and I think how they react to him factors in",
            "Didn't WWE just trademark a name for another Haku son a few weeks back, I forget his name.  I mean this won't happen but I wonder if that leads to something like Tongan Bloonline (Haku's 3 sons) vs New Bloodline (Solo, Jacob and they recruit Zilla).",
            "\"Security is here for the Wyatts, not the bloodline\" Heyman you genius.",
            "Also lends some credence to the supposed “they’re a creepy murder cult but not supernatural” reporting that they aren’t just porting around to every show.",
            "Looking back at how them putting the belt on Bray low-key contributed to derailing his character, I'm hoping one of the lessons they've learned when it comes to supernatural stuff is that less is more. ",
            "This whole week was fucking awesome from WWE, it’s telling when so much shit has happened i legit forgot about Seth returning (not that it’s a bad thing)",
            "Allegedly a Mafia type operation on NXT too ",
            "This is why NXT is the most wholesome, they have Chase U.",
            "Hold on I gotta get the voice for this\n\n*ahem*\n\n(Like Emma Stone from those SNL Poster Sketches)\n\nHeLL YeAh",
            "lmao at the dude behind solo with the middle finger up",
            "And Ricochet recently ",
            "All the top babyfaces celebrating Cody's Mania win definitely highlighted how much more connected the wrestlers and their relationships are. ",
            "I hope she wins in her native Canada :)",
            "Chelsea as a chicken-shit champ, hiding behind Piper would be great for a few months.  Give her MITB, and have her go over when one of the women's belts gets stale and needs a kick in the pants.",
            "Have a feeling she’ll be treated like LA Knight last year. Will get close and tease it a bunch to get the fans popping but ultimately someone else will win",
            "Feel like Tiffany might be winning",
            "After having one of the better Raws of the years too",
            "WWE dropping great Smackdowns the way Nintendo drops Metroid news",
            "Yeah for real, from front to back there was basically no filler tonight - just nonstop glory. And to top it all off, each of the MITB qualifying matches had the right winner (in my opinion). Fantastic episode.",
            "Wwe had an awesome week\n\nRollins return and Wyatt sicks on raw\n\nJoe hendry on nxt\n\nPunk and drew angle and Jacob Fatu on smackdown",
            "*all time",
            "Paul London vibes 😂",
            "Apollo London.",
            "Roman aint returning to the Bloodline. He’s returning to stop the bloodline",
            "More like\n\n![gif](giphy|l1J9yTco40EU5JzTW)",
            "It’s her or Tiffany.  \n\nThe thing is we just want to see Chelsea with the briefcase, she doesn’t even have to cash in successfully.",
            "That crowd is showing support/reactions towards Chelsea.  She has paid her dues.",
            "I love that Roman and Heyman basically had a \"hall pass\" for Punk. That's how much Roman respected the Wiseman.",
            "He certainly is making a lot of enemies.",
            "Well they did trademark Caesar Sikoa, I don't think anyone would be shocked to see Jacob Fatu play Brutus",
            "I remember seeing a comment that said the bloodline has gone from the Godfather to Goodfellas\n\n\nWe’re in the first half of the movie right now  lol",
            "The image of Roman and Jimmy (I feel like people have forgotten about him) returning is going to be so fucking cool. \n\nI really hope they don't use Roman to put Solo over. Let whatever happen in the Bloodline play out but Roman's redemption has to come from stopping Solo.",
            "it kinda felt like when they had Sabu show up and hit a legdrop off the top rope through the table on Cena the first night he was there, at least in the sense of telling the world \"here's what this maniac can do\"",
            "Walks out—looks at champion Nia Jax—just turns around. \n\nOr tries to cash in on Bayley and gets accidentally squashed by Nia (who doesn’t want interference) week after week.",
            "I agree. I don't think we need someone like Bianca going to the MITB match, because she can get a PLE match without it, which is not the same for Chelsea.",
            "u/Rommas had the best comment\n\n>Pick your poison if you're signing with WWE. You got the mass murdering weirdos on RAW, or you got the Polynesian Hit Squad on Smackdown.\n\nYou're pretty much fucked with either brand at the moment",
            "Jacob is a father of 7 at 31 yo",
            "Just wait until the return of Manu!",
            "Samoa must be the most dangerous place on earth.",
            "Think it was too recruit Punk but obviously Drew stopped that.",
            "I think he actually wants Randy and Kevin to focus on winning their qualifying match. He's a good friend.",
            "Look, as much as Cody is an babyface for the common man he also is a fucking idiot.",
            "This are rookie numbers. You gotta pump those numbers up in this racket\n\nAntonio Cromartie ",
            "All we know for sure is dude had sex 7 times",
            "Looks like Solo interfering in main events is back on the menu, boys!",
            "That brief brawl Cody and Jacob had made me want this match so bad",
            "![gif](emote|free_emotes_pack|joy)",
            "Gotta ramp up for hot WrestleMania",
            "I would love to see a stare down with Cody and then they both slowly turn their attention on solo/jacob or something like that",
            "The Samoan Nightmare Roman Raheem Rhodes",
            "He’s already loved since crowds have been chanting we want Roman since he left. Whenever he returns he’ll be cheered",
            "It’s pretty insane just how good this shit is, like there are just so many stories i’m invested in",
            "Imagine all the great stories we lost out on because Vince was out of touch for all those years.\n\nTell us a good story, we'll fucking watch",
            "They could close SummerSlam and I doubt many would call it out of place. ",
            "And then he let's Jacob Fatu destroy 3 of his top stars",
            "It was outside the building",
            "Melo can do a lot in a ladder match with his smaller stature and top tier agility.  He's going to be the \"Shelton\" of this match.  Won't win, but will have the most memorable spots.",
            "I picked Melo, but not Chelsea. Carmelo has already lost to multiple main event talents, so his push had to start soon. I still think Jey wins the briefcase, though. If his push is going to take, he actually has to win something in singles eventually.",
            "They’ve been doing this for a bit but it’s great, it legit makes the locker room feel alive. Under vince every story felt like they were on an island, now people’s actions can actively affect other wrestlers and have major consequences down the line. Take Jey for example, who had to earn a lot of people’s trust back, and still to this day did not earn Drew’s. It’s refreshing to have that character dynamic",
            "IL EST VRAIMENT IL EST VRAIMENT IL EST VRAIMENT PHÉNOMÉNAL LALALA",
            "AJ wasn’t there?",
            "The new Solo would mean him stepping up as tribal chief not too long from now though",
            "and nxt",
            "I know it sounds like an old wives tale, but get some tart cherry juice.\n\nIt works wonders for my gout.",
            "my brother in stuff that sucks, i hate those nights when you can't sleep with it.  i wish you all the ice and NSAIDs you need.  \n\ntruly, I understand and sympathize; I hope this flare passes quick for you.",
            "Agreed. She could be fun as Ms. MitB. I imagine she’ll be super hesitant to cash in and always complaining that the circumstances aren’t correct. She’s the correct choice to win IMO.",
            "The main two that could appear are Hikuleo, the brother of Tama Tonga & Tanga Loa, and Zilla Fatu, Umaga's son.Rumors are that Hikuleo will be joining WWE shortly. \n\nAs for Zilla, he's young and underdeveloped, so he'll likely stay on the indies for now. Still, there's no way WWE don't have their eyes on him, and I think he'll be offered an NXT contract at some point in the future. No time soon though, I'm guessing. He only started wrestling in 2023.",
            "Jacob by far.",
            "Zilla Fatu (Jacob's younger brother), Hikuelo (adopted brother of Tama and Tonga), and technically Lance Anoa’i (Roman's brother who was in the WWE, but I don't think he wrestles anymore). I think there was younger Uso brother who quit in training.",
            "Tama and Loa's younger brother Hikuleo is almost certainly joining at some point. I guess theoretically they could bring in their cousin Bad Luck Fale too but he's not very good.\n\nAs far as the Anoai's go, there's Lance Anoai, who I haven't seen much of, but he's worked for MLW and NOAH, there's Zilla Fatu (Umaga's son) who only started a couple years ago but seems promising, Journey Fatu (Jacob's brother) who is a death match wrestler, and Sean Maluta, who wrestled in the Cruiserweight Classic. I believe Usos/Solo's youngest brother also recently debuted on the indi circuit.",
            "What was the biggest pop of the night?",
            "They were the right winners as well, it freshens everything up when the top guys don’t win all the time",
            "Samantha is on another level, but i agree, i respect her but i wasn’t even a big fan of her in nxt, she’s just bland imo",
            "She has a different style, you either like it or you don’t pretty much. I will say that I think she fit NXT a lot better and Rome fit the main roster better. Watching both shows they both kind of just feel out of place. Romes voice belts out more and fits a bigger stadium, Alicia’s voice kind of fits a more intimate venue. I like both people I just feel like they were in their perfect roles before and now they’re a little miscast.",
            "We told them not to get Tama Tonga wet.",
            "There’s no footage of him attacking Punk. For all we know, he was trying to bring Punk in to get medical attention. After all, there will be more trained medical professionals in the SmackDown locker room than in the Allstate Arena parking lot!",
            "Cody vs Jacob in a last man standing would be incredible.",
            "Problem is you can't have Jacob lose this early but he definitely can't just walk in and become world champion. He's someone you have to let be undefeated for a while.",
            "Austin Theory for Jeice?",
            "All three shows have been must watch this week, it's been fantastic across the board",
            "Agreed all great shows.",
            "He’s supposed to look like a worse version of Roman. Cody put it best. No one is taking him seriously and if Jacob starts becoming more popular then it could become an interesting storyline there. \n\nPlus when Roman comes back it will be crazy",
            "I just like that he dresses like The Weeknd",
            "I think the IWC has a misunderstanding that’s he’s trying to imitate Roman in the sense of being both intimidating and calculating. \n\nHis job is to be the guy that runs the operation on the frontline but leaves it to Jacob to be the muscle and the Rock will probably be revealed to be the mastermind behind it all. \n\nPeople seriously thought they were going to give us Cody vs Solo at Summerslam lmfao.",
            "My pp",
            "Would honestly be iconic",
            "That was a great touch.",
            "Tama did too. Actually liked that the hybrid Tazmanian Devil/Gremlin was actually taken back.",
            "The Raw this week is not bad either, probably the best of the year",
            "With Sami as the 4th Bloodline member of course",
            "Heyman soloes",
            "He’s alright, got a lot of energy (loud and boisterous) but probably not what they’re going for right now (Roman and Solo basically act like mafia godfathers). I can see him take over later but they’re probably want to covey a more calculating type for the Samoan leaders right now.",
            "I saw him wrestle couple times before and he can go! He’s not bad on the mic either",
            "Damn I forgot that that Raw was in Chicago. I don't know if it was the best though, its tied with last Raw for me.",
            "Only problem is Jades not done cooking yet, where they gonna put her to get training",
            "Ratings and revenue already better than the Attitude era",
            "![gif](giphy|dLPoXFyPsyvblVMGdG|downsized)",
            "Chelsea has been incredibly over so far and Tiffany’s momentum has been completely killed by her lack of involvement with anything lately so I’m betting Chelsea wins. She could bring some fun as Ms. MitB",
            "Tongas need to chase tag team title and dominate smackdown tag team division to keep themselves relevant",
            "I think the going theory was Punk which I believed too. I did wonder if it was an olive branch to Jimmy though, like how he did with Jey.",
            "Hikuleo is still out there somewhere for the Tongans, as well as Zilla Fatu. We could have a massive Bloodline civil war if they bring in everyone.",
            "unlimited",
            "Dozens. Literally dozens.",
            "Search up kava and aphrodisiac. That’s all you need to know.",
            "If they do it right then Roman could become the #1 face. What a crazy turn of events.",
            "That’s how you debut somebody!",
            "For Cody's sake, i'm gonna assume the plan was to have Punk come out and help him, but then Drew fucked it up.\n\nAnd then after that he probably went back to Randy and KO for help, which is why they came out.",
            "With the way he was acting, it seemed like he had someone else to help him out since it seemed like Randy or KO had no idea what it was.",
            "Probably.",
            "I was thinking either that or he extended an olive branch to Jimmy just like he did Jey.",
            "Yeah he’s miles ahead of solo. Brightside is they seemed better equipped in booking/handling this than they have possibly ever. Hard to not just feel optimistic about it",
            "I think your family trying to kill you matters more than a title.",
            "You could add NXT to that list too.",
            "Yeah there were some bad ass Raws and Smackdowns leading up to WM40, but this has been the best 7 day stretch ever in my opinion.",
            "I wonder if its fatigue. You get a Bianca match and you dont really gotta tune in cuz of course she's gonna win 🙄 so its nice to see others get some wins too. I like Bianca but whenots so predictable it gets boring",
            "I remember when super kicks were rare and not in every match on every show",
            "I'm sure The Rock send that ref, smh what has the industry become.",
            "That referee was tryin to fuck on Cody!",
            "I'll always love Bianca but I popped like the rest of Chicago when Chelsea won.",
            "I thought it was a watch, mocking the “it’s clobbering time” bit",
            "think it has Punk’s wife and kid’s names",
            "I think he sees the civil war through first.",
            "He's been pretty good, his matches with AJ and Logan are all great.",
            "He’s done nothing poor nor captivating. The match with AJ was great, Logan good…but he needs a really good heel to go up against in a competitive feud. Gunther could be built. Drew after Punk? Maybe Orton after betraying KO?",
            "Loving every minute of it!",
            "Wasn’t aware of stem cell treatment is helping cure headshots. Nice thing to know!",
            "he should come back a zombie like what they did to the mountain on game of thrones",
            "Yeah but just because they have made changes doesn’t mean it’s working. Solo kinda feels like a joke cartoon villain.\n\nHe is the worst part about his own faction",
            "You just thought you could slide Wyatt sicks in there with the young folk, huh?",
            "THAT'S a fucking Summerslam main event",
            "Bro that Samoan drop was brutal af as well",
            "Looked like his shoulder didn't enjoy that spear at all",
            "they've gotten too used to running shows that just maintain the overarching story. have loved seeing them adding more beats like this.",
            "Don’t google his theme song (or his NXT) unless you want to be singing about believing him all day.",
            "They are paid to look out for the Wyatts, not a vengeful Scottish hunk.",
            "The main issue of all of this is Solo. All those 3 guys could smoke Solo if they wanted to, he doesn’t look like a leader at all.",
            "Nah, there’s the unhinged violent one who doesn’t say much\n\nAnd then there’s two more of them",
            "I think it’s working because you’re not SUPPOSED to like them. You’re supposed to want Roman and Jimmy and Jey to come back to kick their asses",
            "Still way too soon\nGotta keep building the heat",
            "Punk because of Paul, and Cody out of begrudging respect and to keep them from running things. ",
            "If I’m booking it, Solo’s the next one getting kicked from the group along w/ Heyman. \n\nSolo challenges Cody at MITB.\nSolo fails.\n\nThe car, the suits…he’s just pretending to be Tribal Chief. It doesn’t feel right. He’s gotten too big for his britches.\n\nHikuleo debuts. It’s a mutiny. The severe beat down of both Solo and Heyman brings back an avenging Roman. Paul Heyman is in a coma on life support. \n\nRoman’s outnumbered.\n\nSolo returns to save the man who brought him in to the Bloodline. They’re outnumbered.\n\nPaul Heyman, finally out of his coma, helps bring Jey and Jimmy back into the fold, evening the odds, 4 to 4.\nThe Rock returns.\nNew Bloodline cleans house.\nOG Bloodline needs a 5th for Survivor Series. Intro Sami Zayn.\n\nThat match is an all out war.\nThe factions continue to feud for a few months. Bloodline elders, Rikishi and Haku, are brought in to sanction and bless a match between Roman and The Rock at Wrestlemania for the true title of Tribal Chief, effectively putting an end to the Bloodline Civil War.\n\nThe end?",
            "Brother, the first pitch hasn’t even been thrown yet.",
            "![gif](giphy|yaYV8i5n1OjZe)",
            "Cody and the Rock have already said it was the watch Cody gave the Rock.",
            "Michin has a strong shoulder Belair trying to take it out is a good strategy.",
            "This is Golden",
            "Samoan referee maybe",
            "They may change his name later though. Don’t count it out.",
            "I feel like they are gonna flirt with it, and then send Drew to the brink to beat CM Punk",
            "Drew just attacked a guy who \n\nCost him the championship twice\n\nMade a fool of him in front of his hometown \n\nWore a Celtic jersey in the press conference \n\nAnd decided to dance on Drew's grave by not only showing up on a different brand but up in his hometown too\n\nWhere is this poor fella wrong...??",
            "He quit just to bait out CM Punk",
            "He set MLW and the indies on fire. Has a rare combo of size, dynamic in ring ability, agility and flat out charisma dude cuts intense promos. He has superstar written all over him",
            "Definitely best SD in a while.",
            "I was there in person and It was a certified banger. The people around me were doing hilarious commentary all night. The vibe was immaculate.",
            "Close but that’s reserved for Roman & Cody teaming up to begin a road to a survivor series payoff.",
            "The Sick6 are apparently not gonna be a supernatural group. I think the seemingly weapon-induced blood on RAW and the fact security was enough to keep them out tonight is a good sign they’re gonna be mostly violence and little “magic”",
            "He's the guy who tops a sundae by clearing the entire pantry. ",
            "They were not prepared for neither a vengeful Scotsman nor a rabid Samoan.",
            "Sounds to me like they’ll function similarly to the bad guys in The Strangers",
            "Woah, put on the brakes.\n\nIt’s a family. Nothing more. Nothing less. No need to throw around the “M” word.",
            "![gif](giphy|I2m7l4yZqRdgk)",
            "The mafia doesn’t exist. That’s anti Italian discrimination",
            "you forgot the D’Angelo family who already whacked pretty deadly and drew gulak",
            "So that’s why they blacked the screen",
            "he will bounce back",
            "*This*. I missed that from back in the day when a title win resulted in the faces coming out and celebrating, instead of just the guy who won it.",
            "imagine a O canada entrance theme for her as O Chelseada",
            "And after an NXT show that pounded their main competition. This was a fantastic week for them",
            "Gotta finish the long term booking of Sylux following Samus' ship. ",
            "I'm a big Tiffy Time fan but I'd say she doesn't need it. I see her as a potential Royal Rumble winner next year.",
            "Her consistency and willingness to make herself look like an absolute fool for our amusement deserves a reward.",
            "https://preview.redd.it/9etq7lyq818d1.jpeg?width=683&format=pjpg&auto=webp&s=087da9d6593ec46e4e880fe35c98f1ed3cc3d86e\n\nThis. This is how I feel rn but they are evil Samoan wrestlers who do nothing but superkick.",
            "> he also is a fucking idiot\n\nMuch like the common man. It's a perfect fit!",
            "He’s like surfer sting. God love the idiot. He needs a Ric flair to exploit his kind nature",
            "He’s like Goku’s level of idiot. Which makes sense for a baby face I guess lmao",
            "He’s the son of a son of a plumber. He never made any claims about education. Hell grandpa Rhodes probably at least had trade school or an apprenticeship I don’t think dusty or Cory have any kayfabe post secondary education ",
            "He does love Sting",
            "I can’t lie, SS is looking fantastic, especially with the Roman and Rhea returns on the horizon",
            "Yeah but Jimmy, Jey & Solo haven’t been attacking the crowd and costing them titles. \n\nIt’s the locker room he’s gonna need forgiveness from.",
            "The only one that’s not doing anything for me is LWO/Reys stuff. And that’s great to have only 1 story not work out of the dozen+ they have ongoing",
            "At this rate, they *should* close Summerslam. \n\nLike, I love a good title match as the main event, but Punk and Drew’s story is just so much more juicy than anything else they have going on. Which is saying a lot, because they have a lot of cool shit going on right now.",
            "LALALALA",
            "And the thing with Jacob is if he somehow ended up getting the ball he'll fucking run the hell with it\n\nHe definitely got the skills",
            "Thanks for the recommendation, just googled it and seems I can get it on Amazon or at Holland and Barrett so I’ll 100% be giving it a try",
            "Appreciate it mate, it’s my 1st time with this shit (only 25 which is young to have it apparently) so hopefully it clears soon. Every movement I make wakes me up from the pain but it is what it is",
            "Yeah exactly. He's supposed to look like a discount roman reigns who's too big for his britches and is cosplaying the leader's role until the real one comes back.",
            "Nobody is suppose to take him seriously, yeah.\n\npeople are like solo doesn’t look like he can lead the bloodline but that’s the point. He’s gonna crash and burn and the plot is who is he going to pull down with him, who’s gonna rise from the ashes, etc. when Roman comes back to slap him upside the head.\n\nTHEN the rock comes back as the mastermind all long to set up Roman vs Rock",
            "The Bloodline – Reigns, Usos, Sami, Punk (because of Heyman, maybe?)\n\nvs.\n\nSamoan Hit Squad - Sikoa, The Tongans, Jacob Fatu, Hikuleo\n\nWARGAMES!",
            "Yes but the got a lot of work to do in popularity. No one is touching prime Austin and rocks popularity",
            "Yeah I mean there are more people on Earth now than there were in 1999",
            "The Usos: Aw shit, here we go again",
            "they spawn from all corners of the ring",
            "He would eclipse Cody instantly.",
            "Probably Punk, but Drew had other ideas.",
            "I honestly thought it could be Joe Hendry :)",
            "Yeah I think solo will probably be fine for the sheer fact I dont think they’ll change course regardless, but I see everyone’s trepidation with Jacob joining the bloodline. He absolutely jumps off the page, no ways around it. And its even more evident in reality as it was in theory",
            "That's what happens when Hunter only books Bianca in matches without stories.",
            "Orton will be his big program for a bit, but they don’t want to rush it as that story can be told for a while",
            "The dude's been recruiting criminals and savages to his crew and has either been threatening or beating the shit out of babyfaces every week since he refreshed the group. Additionally, Heyman has done everything he possibly can to sell Solo as a power-hungry upstart who's much more willing to use force and violence to cement his authority than Roman ever was.\n\nIf all that isn't enough to make Solo come across as a genuine threat and top heel, then I'm afraid he's just never going to feel like that for you.",
            "I gotta disagree because at the moment Solo is the only identifiable member of the Bloodline. \n\nYou got 3 random henchmen who have been introduced in the past 3 months. As part of the IWC, we know that they're all a big deal on their own. But kayfabe, they're literally just NPC henchmen. We haven't had time to get to know any single member of the new bloodline because every time we start, a new one gets introduced.",
            "Yeah, you can’t say “Roman ain’t coming back”, only to have him come back the following week. Gotta get the people to actually believe that he isn’t coming back. Then when he does the pop will go insane. But you can’t wait too long because you’re gonna still need time to work his story out.",
            "The national anthem hasn’t even been sung yet",
            "Source?",
            "That’s why I’m asking if it’s a heel turn. I’m cheering Drew on but I’m not sure if I’m supposed to be. I will regardless.",
            "what they are saying, a big reason they delayed him because he is going to cast a long shadow over solo",
            "I said Allegedly! I'm just saying if I needed to make a jobber disappear I know some people in NXT ",
            "I was referring to Dempsey and his crew lol ",
            "Whoa nobody whacked anybody!",
            "Easily one of the best (if not THE best) weeks of WWE TV viewing I’ve ever seen (granted my viewing has basically been a bit after WM38 to now, plus a year or two back in the dark ages of 2011ish).",
            "What about the thirty year booking of Samus becoming a Metroid?",
            "And headbutt",
            "Orton absolutely should be in that role.\n\nI'd much rather have that feud going than Bloodline Part III right now.",
            "Its more like LWO/JD/Braun lol",
            "I don't know if it's gonna happen or not, but I currently want them to be the main event.",
            "That was some of the worst pain I had. Just existing was terrible. Once  I learned the triggers and signs, it was much easier to manage.\n\nI usually drink a bottle when I have an outbreak. There's a chemical or enzyme in cherries that breaks down the uric acid. The tart cherries have far more of whatever it is. \n\nThe science is limited, but shows at least some amount of positive reaction, though more research is needed.\n\nIt could well be psychoso...psycosy...in my head, but I certainly can see a difference.",
            "I had it young too.  Unfortunately it will come back periodically.  See if you can figure out your trigger foods.\n\nIf you get it twice in the same year. Get preventative meds.  Also i agree with the person who said drink tart cheery juice regularly.  Hydrate as well, try to pee once every 2-3 hours.  \n\nHopefully you were able to make it to the doctors and get meds.  They do work quickly.",
            "We still in the parking lot. ",
            " Cody:\n\nhttps://youtu.be/fbvfnWRrmKM?si=yKBo7D_mVvKXCZTO\n\nThe Rock: \n\nhttps://www.reddit.com/r/SquaredCircle/s/ZPyq5vJ2UY",
            "We do have to acknowledge that 2 Dimes is \"sleeping with the fishes\" after trying to usurp Tony D. So there's at least one murder, though Tony D could've just came across some others doing the deed.",
            "Cheers again for the recommendation, gonna order some right now off of Amazon and have a pop at it. First time with gout so if this works I’ll know for sure to stock up on the cherry juice for future attacks.",
            "Abner Doubleday is still at Ft Sumter.",
            "Good luck. Sleeping with it sucked.\n\nLots of water. Ibuprofen if you don't have gout meds. Tylenol helps with pain, ibuprofen with the inflammation. Alternate every few hours. Ice might help.\n\nNo aspirin.\n\nAvoid triggers: beer, shellfish, certain other fish, red meat.\n\nYou probably know all that, but if anyone else reading can avoid a flare from this info, it's worth it.",
            "The first human in 160,000 BC just threw a rock at a cheetah, missed, and thought \"I could turn this into a game\""
        ]
    },
    "Wreddit's Daily Pro-Wrestling Discussion Thread! What's on your mind today? (Spoilers for all shows) - June 22, 2024 Edition": {
        "title": "Wreddit's Daily Pro-Wrestling Discussion Thread! What's on your mind today? (Spoilers for all shows) - June 22, 2024 Edition",
        "score": 9,
        "url": "https://www.reddit.com/r/SquaredCircle/comments/1dlrfmo/wreddits_daily_prowrestling_discussion_thread/",
        "content": "Hi Wreddit! Welcome to /r/SquaredCircle's Daily Discussion Thread as presented by your favorite and *totally* sentient moderator.\n\n---\n\nDid you see a match yesterday that you really liked? Want a suggestion of a random PPV to watch on the network? Really love a local indie talent and want to shout them out? Are you out of the loop on a promotion and need to get caught up? Have questions about streaming services or your first time seeing wrestling live? Want to get something off your chest? Want to talk about something else entirely?\n\nThis is the thread for that and so much more. Free discussion here (all rules still apply).\n\n---\n\n[Please be sure to read the updated rules](https://www.reddit.com/r/SquaredCircle/wiki/rules)  | [Check out all of our previous AMA's](https://www.reddit.com/r/SquaredCircle/wiki/amas) \n\n---\n\nReminder, this thread **WILL contain spoilers**. We don't expect you to spoiler mark anything wrestling related in this thread, however we do ask if you reference something outside of wrestling that is a spoiler, you mark that.",
        "num_comments": 132,
        "comments": [
            "WWE is really unsafe working environment right now. It doesnt even matter if you are on NXT, Raw or Smackdown. Better have some good life insurance.",
            "Dawg I just met Rey Mysterio 30 mins ago.\n\n\nThought I recognized him (I was very f drunk) and I go \" excuse me, are you Mr. Rey?\" And he goes \"yessir Rey mysterio\" I f freaked out. Told him I been watching him since I was a kid, he offered me a pic twice but I declined and said I didn't wanna impose all that on him.\n\n\nWhat a crazy night I'm still hammered rn",
            "Queen’s Quest disbanding: I am not ok.\n\nhttps://preview.redd.it/a15i99osw38d1.jpeg?width=1528&format=pjpg&auto=webp&s=227b1f7d9d10dee1ae060919bc0df18125b8191e\n\nEdit: MIKA IWATA WON?? WTF",
            "Queens Quest is officially no more and I hate it.\n\n![gif](giphy|15ddqrBmBRwsg)",
            "'AEW's ratings would immediately improve if they just got rid of all of the storylines and performers that I personally dislike.'",
            "That was a pretty interesting day of discourse yesterday with AEW doom and gloom and MVP essentially calling triple H a racist. Let’s see how today shakes out",
            "I'm so happy Chelsea won that qualifier with a great crowd reaction, about time the people acknowledged the icon.\n\n\nHowever on the negative side, last night perfectly portrayed the problems with Bayley. After a PPV defense, she's just backstage watching MITB qualifiers and doing generic backstage stuff instead of setting up an interesting storyline. She feels so background despite being a Rumble winner who won the championship at Wrestlemania. \n\n\nI know this alliance is doomed to be over by years end, but I'm loving this Tiffany/Nia stuff and the way Michin doesn't take their shit backstage. Someone's gonna help her, I assume Tegan Nox (a face who isn't doing anything).",
            "I'm excited for people to see Jacob Fatu over the next few weeks and just be in awe over how good he is.\n\nAlso, I wanna recommend Krule vs Adam Priest from Action last night. Started slow, but they picked up the pace and had this just insane cage match. Last 10 minutes or so were crazy.",
            "I'm expecting Turkey vs Portugal be an exciting and fantastic game.",
            "The parking lot gate guy should be fired. He just opens it up whenever someone knocks? I mean, this time it was Drew, who only wanted to attack Punk, but in the future?\n\nAlso, did Drew take Punk's watch?\n\nALSO also, how good in the ring is Jacob Fatu?\n\nBetween Raw and SD, this was a damn good week of wrestling.",
            "It would be kool for NXT/WWE to dust off Worlds Collide in the next year considering the partnerships they now have. Hold it at MSG or Chicago",
            "Is there any niche peeves you have in wrestling? I'm not from America so I don't give a damn the educational background of the wrestler. It's just mildly lost and annoying for me, Level Up has a bad habit of that.",
            "Maika’s chest. That is all.\n\nXena’s chops really are loud and brutal.\n\nhttps://preview.redd.it/02uifj4ha48d1.jpeg?width=1920&format=pjpg&auto=webp&s=83588a5890d0c8081b757b537cbaf9e933d71675",
            "Guess this is unpopular but I still like Solo and how he's being portrayed rn. They stopped letting him be the silent guy and let him have a character of his own.",
            "At what point does Kevin Owen’s start a JBL style gimmick against Samoans? They’ve been terrorising the poor guy for years and he’s going to snap at any moment",
            "Someone pointed out that the video in the tweet from Pearce about Gable being cleared is AI and I think that would be a crazy way for the Wyatt Sicks to act out their business. You don't need to go too crazy with supernatural stuff \nbecause using AI like that is scary business in itself. It was also fit with the \"more grounded in reality\" reports that are going around about the group.",
            "We need to bring Kayfabe Sunday threads back. Talking about wrestling in a Kayfabe way is very fun.",
            "Damn Wakana really became a thirst trap on Threads.\n\n\nThe next AEW PPV has so many matches, I'll probably do like for NJPW and just handpick a couple matches depending on feedback. I hope the crowd stays hype for the whole thing.",
            "Damn never seen so many SD clips on the front page. Show was loaded tonight and totally delivered",
            "Since Wrestlemania where there were 37 different Wrestlers in matches on the card, each new PLE - despite PLEs being reduced to 5 matches - have had at least three new wrestlers on the card who hadn't had PLE matches at or since Wrestlemania (and these are all matches that clearly feature the talent rather than multi person shmozzes like the Rumble) :\n\nBacklash: Tiffany Stratton, Tama Tonga, Solo Sikoa.\n\nKAQOTR: Nia Jax, Lyra Valkria, Chad Gable, Bronson Reed.\n\nClash: Alba Fyre, Isla Dawn, Zoey Stark, Shayna Baszler, Piper Niven\n\nMITB has already confirmed Chelsea Green and Carmello Hayes and both Zelina Vega (v Liv) and Blair Davenport (MITB) seem likely.\n\nAnd this is before the PLE debuts of Bron Breakker, Ilja Dragunov and the Wyatt Sicks so this streak will seemingly continue for a while.\n\nHas there ever been this level of PLE performer turnover in WWE history?",
            "Okada managed to do it, Stardom has been big bro'ed and lost the second biggest belt to a promotion 1/5 their size. \n\nI dont even know what to say at this point",
            "WWE has really turned a corner every show is exciting. Wyatt Sicks on RAW, New Bloodline on SD, NXT still awesome.. starting to feel like another ruthless aggression type era",
            "It feels like the tag belts have been devalued a lot since Mania. They used to be a main event level belt, now they can’t even seem to get on a PLE card. I think giving both belts to comedy teams was a mistake, and at least one of them should be changing hands sooner rather than later",
            "chelsea green might be my favourite wrestler in general tbh",
            "MVP agrees with someone saying that HHH is \"emasculating Black men\" and it doesn't even make the thread title. Dynamite does a really shitty number and it gets thousands of comments.  It's depressing, embarrassing even.",
            "Is drew vs punk the best storyline while involved people are injured? I can't think of anything better, or anything at all really.",
            "CM punk vs Drew Mcintyre does need the belt. Why keep the WHC strapped to a lesser storyline?",
            "Welp, Momo Watanabe really is an evil woman after all. Damn, son. So that's it for AZM in QQ (and everyone but Kamitani). Wow",
            "Red shirt era Cena went through a lot.",
            "If the women’s MITB match does actually end up being Iyo/Lyra/Dakota/Naomi/Chelsea/Tiffany like it seems it’s going to be, I’m going be excited af but also sad that I probably won’t be able to go because of the ticket prices even though I’m close-ish. That match could be bonkers",
            "Everyone is mad at Taro Okada what happened to Queen's Quest and maybe Tanahashi is mad at Taro Okada too maybe Taro Okada & Tony Khan want EVIL as president of NJPW & STARDOM \"just maybe\"",
            "Man there was like twenty minutes left for the Main Event last night and we get 3 minutes of commercials, 4 minutes of Cody's intro, 3 more minutes of commercials, and then 1-2 more minutes of Cody's intro finishing up. Absolutely brutal viewing experience, especially for how predictable you know Solo Vs. Cody is going to end up being.",
            "Imagine still unironically saying Roman isnt coming back as a heel",
            "I don’t how if this’ll be unpopular or not but here goes: Seth Rollins is more valuable than wrestlers like Cody or Roman because he doesn’t require super strong booking (winning pretty much all of his matches) to maintain his aura. \n\nIf both Cody and Roman lost more, especially cleanly, as their current characters, neither guy would be as popular. Seth however, is not the same at all.",
            "The worst year WWE had roster and booking wise? 2020 and 2021 doesn't count, Pandemic Era is too easy.",
            "How come triple h doesn’t want to bring back the hurt business if the whole pride faction isn’t working?",
            "I don't think Cody is facing Solo at Summerslam. Cody's thing is that he defends the title every PLE all over the world. At first, it seemed Cody, Randy, KO vs Solo, Tama Tonga, Tanga Loa at MITB and then Cody vs Solo at Summerslam was possible. But a 3 vs 3 at MITB, with the debut of Jacob Fatu doesn't make sense. This makes me believe Cody vs Solo is happening at MITB. And I personally don't think Triple H is giving the rematch at Summerslam, my guess would still be Randy vs Cody, probably a face vs face match for then which will eventually turn into Randy turning heel.",
            "i have never seen a jacob fatu match but you just know that guy has a sick uranage",
            "Gave a buddy of mine (who isn't a wrestling fan) my Wrestling Mount Rushmore list and he told me all three wrestling fans he knows said it was unfathomable to not have The Undertaker on said list, and I can't really disagree. Longevity, central figure in several of the most iconic moments/matches/feuds in wrestling, star power, recognisability and probably the best gimmick in the history of wrestling. His post-streak career absolutely took some of the shine off his overall career and legacy in a lot of peoples eyes (including mine), but he should probably be at least in everyone's top 10 or 15.",
            "I know it's been \"pile on AEW day\", though I will say one thing that's been missing for me from AEW for a lot of 2024 is a hot top storyline. I thought that storyline could have been The Elite vs. AEW storyline, but it feels like very quickly that storyline became just like any other one in AEW.\n\n1st, the main claim to fame that the new Elite had was that they took out Tony Khan, something that hadn't been done before in AEW. A great moment. But then just a month later, Tony is back on TV. So the heat they had from taking him out felt like it fizzled out. And the big part of the storyline too where the Elite had power when Tony wasn't at the shows is also gone. I feel like Tony needed to be gone a lot longer for this to work as well as it could have.\n\n2nd, it doesn't feel like there's as much urgency about this storyline as there could be now. And again, Tony's back now so why should there be. But I remember that promo Dax cut after DON where Team AEW lost and he's like \"Bryan & Darby will be back, and when they are we're coming after you\". Well, Bryan was back next week on Dynamite in an 8 Man Tag, and then immediately announced his participation in the Owen tournament. Which, don't get me wrong, that's awesome. But it just creates a disconnect when you hear Dax say that and Bryan just comes back to TV and, other than a mention, isn't doing anything about the Elite after going to war with them.\n\nAnd 3rd, and this isn't AEW's fault, the injuries. Losing Eddie in the 1st place sucked. But then losing Dax, who was going to be one of the main babyface focal points of this, hurt even worse.\n\nThe story is just at the point now where The Elite, the heels, are challenging a team of AEW to Blood & Guts to essentially prove themselves. Not a group of faces fighting back against them and challenging them to the match, but they laid out the challenge. I don't know, it just seems backwards. And any potential it felt like this story had as a top story just feels like it's gone now.",
            "With Solo apparently being Cody’s Summerslam match Randy is definitely Cody’s Mania match then",
            "That “triple H is racist” mvp thread is the dumbest thing I’ve read on this subreddit.\n\nAnd I’ve read some dumb things",
            "WWE is the best it’s ever been since I’ve started watching and I’ve been watching since ~2008.",
            "Welp, Queen's Quest vs Oedo Tai about to start. Thank Stardom for putting the comic relief tag right before cause this one's gonna be dramatic AF one way or another.",
            "Since some people are not jacked about Cody's title run, this made me wonder, who had the most interesting first feud in their title run? Not counting transitional champs",
            "For all the criticism of AEW on Thursdays like these there isn’t much of it that’s constructive. What do people want to happen? If it’s a new booker, who? Scott D’Amore? Shane McMahon??\n\nIf there are talent who should be foregrounded and pushed more, who? What stories do people want that they’re not getting?",
            "It might be time for them to stage another walkout",
            "Rey hanging out with drunkards like you is exactly why he was such a deadbeat dad to Dominik smh",
            "That's awesome.",
            "We’ll always have ExV ![gif](emote|free_emotes_pack|trollface)\n\nI may be a Cosmic Angels fan today, but Queen’s Quest was my first Stardom love, and I feel less attached to the promotion today than I did yesterday.",
            ">After a PPV defense, she's just backstage watching MITB qualifiers and doing generic backstage stuff instead of setting up an interesting storyline.\n\nIf they can't figure out an interesting storyline for her, then I guess nothing can be done. It is honestly quite surprising that she hasn't been given something fascinating for a program.",
            "Bayley’s next feud is with Nia Jax so there is nothing really to build up for her until after MITB",
            "As a heel she lost a lot but remained a cocky shit talker.  \n\n\nAs a face, she's kind of boring. Telling Piper she's respected her since the Mae Young Classic had the audience hitting the snooze button.   ",
            "Wyatt Sicks shenanigans during VAR check?",
            "Drew took Punk's friendship bracelet thingie that had AJ and Larry's (their dog) names on it",
            "I absolutely despise the led ring post. Of all the bad things Vince has done for the industry this might be a top 5 of them. Every show I hope Triple H get it done for good, but it's only for international PLEs and when there's cage, chamber matches.",
            "Maybe my biggest pet peeve is when a wrestler debuts a new finisher, suddenly the old one has a 0% success rate. Can’t even put away lower midcard jabronis with it. Its way cooler when wrestlers have an arsenal of moves that can end the match, yeah there’s their main finisher but that’s not the only tool they have.\n\nThat leads in to a second peeve I have, when wrestlers do the shocked face like they’ve just seen a cartel beheading after someone kicks out of a move they’ve literally never won a match with. It didn’t work the first 300 times, why are you gobsmacked it didn’t work this time lol",
            "I think the Level Up show is featuring athletes from their NIL (next-in-line) program which recruits gifted collegiate amateur athletes, many of whom have fans who follow college sports. WIth the name changes, it's their way of signaling that \"Rex Brixton\" or \"Allysin Monroe\" are actually the college athlete with the unmarketable name you remember. (Although Thunder Keck would have ben a fine wrestling name.) If you're not following American college sports, I can see that it's not very useful.\n\nMy niche peeve is the tiny ladder in the ladder match. Every ladder included in a ladder match should allow the wrestlers to reach the item suspended above the ring. Any wrestler who grabs the tiny ladder is an idiot. (\"This tiny ladder won't help me win, but maybe I can use it in a spot that will get clipped on YouTube later...\")",
            "Romance angles, for the MOST part. There are some that have been done well (Savage and Elizabeth, Dom and Rhea) but the majority of them over the thirty years since I started watching have just been... I dunno, almost like they're written by people who don't understand a good romance arc but feel like they just HAVE to have one sometimes. And it doesn't help that most wrestlers are terrible dramatic actors. There's a LOT of \"I was using you all along\" in wrestling-romance history.",
            "I hate promos, i'd much rather watch wrestling where once a match ends, you go immediately into the next match",
            "It was such a great main event and Maika and Xena deserve props. They killed it.",
            "Xena is very overlooked. She came out of the unknown world of Australian indies, and is now in a promotion with a lot of very talented women. Stardom has historically had a reputation of bringing in relatively unknown foreign wrestlers, getting them over with domestic fans, but foreign fans treating them with suspicion (just look at how long it took for Mariah May to get over!) She debuted in a faction with a couple of other foreign wrestlers at the time who were part-time fill-ins, but today Xena is mostly excellent in her role within Stardom.",
            "For real\n\nIt is weird seeing the solo hate it is like people are not giving him a chance at all\n\nHe is not on roman reigns level but he is good that’s for sure",
            "That's we introduced it, unfortunately it became deader as the days went on with very less traction. So it was discontinued. \n\nI sound like a content creator when I say this lol, but If enough of the sub wants it back, we'll probably discuss it.",
            "Very good weak to bring it back, with Wyatt Sicks and AEW rating",
            "I hate the fact that you have certain joshi promotions doing all they can to get creeps out of the scene yet you have certain wrestlers who try and invite and encourage them to remain.",
            "I don't usually enjoy WWE that much but I've gotta admit, it was a great show. \n\nI loved how they revealed Drew with Punk's body in the middle of a DIY segment, I loved how they let people with jobber entrances win, and obviously you had the surprise at the end. It felt like a real break from the formula and was very exciting as a result.",
            "How many video packages for these people",
            "This is really impressive. I feel like that's why every PLE feels fresh and not being shoved down my throat like Vince was doing. \n\nRoster depth is probably the best it's been in years",
            "Okada's been a proven fraud since he made the boneheaded move to overturn Rossy and put Maika over Suzu for the red belt, Maika's nowhere good enough to be pushed as much as she is.",
            "They were more important when wrapped up in the Bloodline, then KO/Sami, then Judgement Day. All top acts on the show.\n\nNow they're all firmly on midcard talents and you see the lack of care HHH puts into them at the moment. His treatment of the Tag Titles, all 3 of them, has just reeked of laziness since Mania.\n\nI know people were clamoring for it, but honestly they'd probably be better if they hadn't split the Tag Titles again.",
            "I like her for all the same reasons I love Unagi Sayaka. Every promotion needs someone like her.",
            "SHE  is amazing in ring as well, what i mean by this is, she can give amazing matches too if booked that way\n\nnow she has a great character to play as well, double bingo",
            "MVP is wrong and Dynamite's record lowest number is huge. Hope this helps",
            "Someone thinking someone is racist without proof is an opinion while dynamites rating was a fact. I don’t see the correlation",
            "I mean if we get Seth/Gunther for the WHC, I'm not complaining lol",
            "Punk/Drew doesn't need the title at the time. It wouldn't elevate the feud.",
            "all the best usually these kind of multi wrestler matches are amazing in general\n\nthis might be a hot take here, but imo women's rumble, chamber and war games matches are more fun to watch for me, i pop more, like how green shocked everyone but everyone popped for her, these kinds of things are only possible and keep you interested and invested",
            "Roman is coming back as a face and that pop is going to be fucking huge",
            "They pretty much have to do a face turn. What more can you do with him as a heel?  I expect the Cody rematch where he loses and then Solo takes him out. But then he comes back to take down the Bloodline.",
            "I kinda agree, but would lean more to saying that people like Rollins, Owens, Asuka, Jericho etc are valuable in different ways to a Roman, Hogan, Austin. ",
            "95 probably.",
            "It's going to be a tossup between the early-mid 90s (say, 94-95) and the early 2000s after they lost most of the attitude era names when they were stacking the roster with all of Vince's muscle fetish wrestlers.\n\nThere's been periods with dumber individual decisions (like putting the title back on Hogan in 93) and times with weaker individual rosters (in the early attitude era they had basically nothing outside of the main event) but the combination of the two stands out.",
            "2011 or 2019",
            "There's a fair few matches of his on YouTube for free. Guy's a monster, really fun to watch.",
            "Go check out some of his work. He was a staple in MLW and had good matches against Alexander Hammerstone and Mads Krugger/Krule. Plus had some solid matches in GCW.",
            "What do you mean by your list? Just four, all plausible candidates in your eyes, something else?",
            "One thing I like about aew is that they try to make most if not all titles feel sought after. Do I think they succeed? Not always personally, but it’s subjective imo. \n\nBut I really think the group needs to be in the world title picture somehow. Is it Okada? A fifth member? Do they even have to win the world title? Idk I’m just a viewer but I do feel like someone from the group needs to be an adversary to swerve.",
            "Agreed. Tony should still be out & shouldn't have come back until near the end of the storyline, late this year or early next. Him already being back has completely taken the wind & heat out of the angle/story.\n\nAnd yeah, the way they set up Blood & Guts with the heels making the challenge was dumb. It doesn't help that i'm bored of the yearly AEW booking trend of booking two groups of talents into a feud so they can do Anarchy in the Arena at DON & Blood & Guts a month or two later. \n\nI'd rather see the Bucks defend the tag titles, Okada have big singles matches as a serious top heel like Gunther & Jack Perry be properly built as a Dominik Mysterio-esque character but instead Jack hasn't done anything & Okada's a comedy character.",
            "He's facing Rock bro",
            "\"Papa H\" is the most successful psy-op in wrestling history it seems",
            "I'm surprised so many actually think he's racist. It's mad.",
            "First to come mind is Austin feuding with Dude Love after his first win. ",
            "Get Jericho off the fucking screen. I don't know how anyone can justify whatever his boring ass, cringe gimmick is",
            "As an AEW fan that will call out TK, the issue is he is a backyard wrestling supershow booker, not a weekly episodic tv booker.\nThe PPVs 9/10 times are fantastic. Yes, some match placement is questionable, but you know out of their 9 match cards, 6/7 are going to be GREAT.\n\nThe issue is that on TV, these 6 matches end up all the same. They’re all back and forth spot fests where everyone gets their shit in and even though the outcome isn’t really in doubt, it has to be competitive. This means you end up seeing similar spots throughout the same show and it’s annoying.\n\nTV wrestling actually benefits when people can tell the wrestler hierarchy. Your guys with belts should feel important and when they’re showcased people are interested in it.\n\nThere’s some weeks I think AEW does this well, and others they don’t. They would rather give you a 2 hour wrestling show with a few segments and 6 great matches, but a tv audience needs a mix of some short matches, some segments, then a couple strong matches to hold them over",
            "If there's a new booker it doesn't have to be someone perfect cause TK has done okay and lowkey worse since his team was expanded to have TNA guys in it, but it *has* to be one of the guys that were stars in 00's ROH (Bryan, Joe etc.) They're the last ones to have been involved with a good, tight vision of wrestling that focuses on \"workrate\" without being an excuse for terrible stuntwork.\n\nI would like more tonal consistency and less dumb humor not in general but as a substitute for a personality. You can't have a show where the fans are screaming that the best parts are the characters that don't take themselves seriously. Like WWE has children's humor, AEW has humor for folks who still post template memes in facebook groups about Star Wars and the Good Place. \n\nDepush MJF, Ospreay, Jack Perry, the Young Bucks, Jericho, Malakai Black, Saraya \n\nPush Daniel Garcia, Hobbs, Takeshita, Strong, STP, Willow, the luchadors that aren't LB. \n\nI mean the push and depush stuff is wishful thinking that wouldn't resonate with a pretty sizeable part of the fanbase but I think they need to make the roster and their pecking orders a lot tighter than it has been. They've stretched themselves too much with this bloated roster and wins aren't valuable because even if on paper they have similar positions on the card, in praxis it's \"guy that we know has something going vs guy who definitely doesn't\".",
            ">If it’s a new booker, who? Scott D’Amore? Shane McMahon??\n\nI think people are saying that the booking is not working for them. But Scott D'Amore wouldn't be a bad idea for booker.",
            "Dawg I'm still tripping he dabbed me up ",
            "And somehow Gable is suddenly laying up against the advertising board, dead again",
            "Ah, that makes more sense.",
            "Kinda similar, I hate it when rookies have a finisher that doesn't finish anyone off for like 2 years until suddenly it works \\*cough Arisu Endo\\*",
            "I understand that, it's how Byron sells it. He always try to use to incorporate it to the wrestlers ring action, it doesn't sound natural. \"He's a neighborhood leader so he's leading his opponent to his meticiously plan\" or \"he has a degree with neurology, so he knows how to deprive the senses of the opponent\" in ring it doesn't even come close to what he's saying. He also speaks it like it's reading from a fact sheet, not telling a story.",
            "I lowkey feel salty when they say he's \"not convincing as an enforcer\" but at the same time I gotta understand people have opinions. Give him a chance to find his groove ffs",
            "I think this is genuinely an example of people hating him because they’re supposed to and not realising that they’re just invested in the story as intended",
            "Agreed.\n\nAnd, maybe he isn't on Roman's level, but that's more a testament to how good Roman is.",
            "I hear you about Maika, but I remember the conversation about this title change at the time being a case of Rossy's shiny new toy syndrome vs rewarding the overlooked veteran who put in the work. Not every champion rises to the title, but it's kind of refreshing to have some variety. Bad booking is bad booking, but they took a chance on someone who the domestic crowds were pulling for more strongly than I had seen them pull for a top contender in years.\n\nIt's probably the one major booking decision I think Okada got more or less not-wrong, even if Maika herself isn't in the sacred pantheon of great Stardom champions, at least not yet.",
            "The problem is that none of the tag teams ever got to compete for them.",
            "I really don't get why splitting them is the issue and not just the booking of them after the split. It's not like one set is being booked well.",
            "Tony Khan calling Shawn Michaels and HHH bald got a thousand+ comment thread",
            "It would elevate the belt, which is sorely needed.",
            "Post-'Mania 2019 was absolutely dreadful and made me stop watching the shows, but as roster is also included in the question (and 2019's was quite good) I think 2011 is the right answer. Completely bottled the CM Punk storyline, ran Cole vs. Lawler at WrestleMania WITH THE HEEL GETTING THE WIN IN THE END, and the roster was still full of no-hopers like David Otunga and Mason Ryan.",
            "You'd imagine that's gonna be Hangman",
            "Bro stole ROH’s homework for 4 years and then suddenly he could do no wrong",
            "WWE TV is still boring as shit by and large. 3 hours will always and forever be too long for a wrestling show, which handicaps Raw. The glacial pacing of all of Triple H's storylines doesn't help anything, either.",
            "I mean I haven't seen anyone act like he's going around burning crosses, but there's very clearly an issue with systemic racism within the WWE, especially at the Main Event level. Minority booking is absolutely atrocious. At a certain point how doesn't Triple H bear any responsibility there?",
            "Exactly. There’s a plethora of other reasons.\n\nBut no, let’s make the most outrageous claim first, even if it doesn’t actually make sense",
            "Absolutely. It's frustrating looking at the AEW reddit & see them just enable something that's only hurting the product. Jericho's needs to go.",
            "Depushing MJF and Ospreay would be insane. They're massively over with the audience. \n\nOne issue you didn't bring up that I feel is a huge issue is there are too many belts on AEW programming(though this is a widespread problem, pretty much in every major organization). There should be one world championship, one mid card championship, and one tag team championship, though keeping the 6 man tag belts to be different would be okay. It feels like damn near everyone you see on AEW TV has a belt, so they don't feel like valuable championships with auras. Just because they are props doesn't mean they have to feel like props, is basically what I'm getting at.",
            "More than he ever did for his own son!",
            "Yeah, I can see that would be annoying. I haven't kept up with Level Up since Je'Von Evans moved over to the NXT TV roster, but you're reminding me that I should be watching it.",
            "I think the reactions to him are over the top, he's good. \n\nThough I do not wanna see him vs Cody at Summerslam and that build for 6 weeks 😅",
            "I do think that happens from time to time.\n\nIt's as if some of the IWC are so *heels-are-passe-we-need-badass-tweeners pilled* that they don't realize you're not supposed to like heels. You're even supposed to enjoy not liking heels.  \n\nThere is a recurring criticism of Dominik Mysterio, for example, that people aren't \"really booing him\" because they \"want to/enjoy booing him.\" But that's the point! They want you to enjoy hating the bad guys! If people come to the show wanting to boo Dom, wanting to see him get his ass kicked, leave happy to have booed him, mission accomplished.",
            "And that's a fact.",
            "While true in the case of the title itself, the trade off is sacrificing Priest. Him dropping the title after only one defense would've hurt someone they're attempting to establish a main-event level player.",
            "Hey, I liked Otunga",
            "Yeah if crowds werent getting worked with Solo they wouldn't be screaming for Reigns and salivating at the idea that he's going to come in and destroy him. That's the heat there. He's meant to be Wish Reigns with aliexpress bloodline. Reigns face turn is going to work because people will respect his version of the bloodline compared to what Solo built.",
            "He had a good theme tbf."
        ]
    },
    "[Smackdown Spoilers] Another One!": {
        "title": "[Smackdown Spoilers] Another One!",
        "score": 1718,
        "url": "https://v.redd.it/an3it3uf518d1",
        "content": "",
        "num_comments": 417,
        "comments": [
            "\n**Help make SquaredCircle safer and more inclusive by using the report button to flag posts and comments for moderator review.** \n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/SquaredCircle) if you have any questions or concerns.*",
            "Love how Corey built him up as a legit psychopath",
            "Has Jacob lost weight or is it just the jump from indies to WWE makes everybody look shorter",
            "Whats more scary? The Wyatt Sicks or Jacob Fatu because I honestly don't know.",
            "“THIS GUY NEEDS TO BE LOCKED UP!” tell us how you really feel",
            "I absolutely love that when the Bloodline disappeared Solo Sikoa just decided he'll make his own family business with new Samoans to his cause instead of repeating the same mistake. Tama Tonga, Tanga Loa and now Jacob Fatu...\n\nManu WHEN ?!",
            "https://preview.redd.it/xwa5xfwi818d1.jpeg?width=624&format=pjpg&auto=webp&s=e68f7aa24941fe8a406ac17c021168f5edbaf1b9\n\nSolo tonight",
            "I knew when Solo begged like that, he was bluffing. Say what you want about him but Solo doesn't act like such a coward.",
            "Surely they can't have many more Samoan wrestler relatives left?\n\n![gif](giphy|3oEjHCWdU7F4hkcudy)",
            "Not another one. The best one, and they should have signed him years ago.",
            "just when i lose interest they bring me back in",
            "I thought wade was fantastic selling how seriously mental fatu is especially when he was attacking Cody.",
            "Thank god it was Jacob Fatu \n\nI've been expecting him before hikuleo and even tanga loa",
            "As someone that didn’t know anything about all these dudes (other than hearing their names now and then) before they joined wwe \n\nHe sure seems like a better signing than Tanga Loa lol",
            "“Sir, another Samoan has hit Smackdown”\n\nhttps://preview.redd.it/dn9ny8f0r18d1.jpeg?width=1500&format=pjpg&auto=webp&s=5df772bcbdaf1a6125d7bc0c47bc336b09e187e8",
            "![gif](giphy|DUO9dc3yDLXHO)\n\nY’all got anymore of those Samoans",
            "I believe there is at least one more too",
            "Reign gonna comes back with these\n\nhttps://preview.redd.it/bvrn1qeyu18d1.jpeg?width=736&format=pjpg&auto=webp&s=b7a6077bdf320aefecd4831d5ad262b5a1d77ed4",
            "I looked him up and this man has 7 children.\n\nWe're gonna be knee deep in Samoans for decades to come.",
            "There's something inherently funny about Solo just adding another unhinged Samoan or Tonga to the roster. This mfs just gonna debut all the islands at this point.",
            "So uh, what exactly was Cody's plan? Come back to KO and Randy an hour later and tell them he actually does need their help?",
            "No offense but what is Hikuleo going to do? The Werewolf just single-handedly took out three of WWE's top babyfaces.",
            "He's gonna steal Solo's shine so hard. Bro just debuted and already has 10x more aura than Solo",
            "https://preview.redd.it/tzeqsen9e18d1.jpeg?width=624&format=pjpg&auto=webp&s=3d0548f1131159bf5649eb3fcf865e21456d7926\n\n15 years has led to this long awaited revenge",
            "Now THAT'S a fucking wrestler bro",
            "I like it, it kind of mirrors IRL gangs.\n\n\nThe OGs were not good people but the next generation are a lot less disciplined.",
            "I swore it was hikuleo, but it was the Samoan werewolf",
            "Smackdown doesn’t miss. \n\nThis bloodline angle is getting better and better.",
            "KO sold that lariat like death. Instant credibility for Fatu.",
            "Yeah he's definitely outshining Solo lol",
            "Solo in his anger turned to a man he didn't fully understand.",
            "Man, triple h gets in charge and gangs of maniacs overrun both shows in the same week.",
            "Bro how many Fatu’s are there Christ Almighty try a condom already. This is getting out of hand, now there are four of them!",
            "The Samoan Werewolf has arrived",
            "Cornette has had several orgasms at this point. This is his boy",
            "I have never Jacob this slim before.",
            "Corny better hit the gym for a few months and get ready to cash a fat check.\nThey could even tie it in with when he managed another family member, Yokozuna 🤔",
            "Was there even a hint he would debut tonight? I know we all knew he was signed but it seemed like a genuine surprise. When the Tongans came out then Randy and KO I was checked out, felt like the story was spinning the wheels until Roman returned but then bang Big Jacob Fatu batters the shite out of three main eventers.",
            "I haven’t seen so many dudes from one family since the Villanos.",
            "We're actually going to a Bloodline triple split\n\nBloodline Classic: Roman Reigns and the Usos\n\nBloodline Hollywood: The Rock, Solo Sikoa, and Jacob Fatu\n\nBloodline New Japan: The Guerillas of Destiny and Hikuleo",
            "I almost didn’t recognize him, he’s in amazing shape.",
            "Next week is MSG... if Chicago got Jacob Fatu, what is MSG gonna get? \n\nIt feels too soon to do it a week after Jacob comes in, but MSG would be the perfect spot for Roman to return.",
            "Was out all night at dinner so couldn't watch but.....\n\n\n\nLETS FUCKING GOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOO",
            "Jacob Fatu is everything that we were told Solo was supposed to be lol.",
            "I completely understand them worrying about him outshining Solo. Tama is arguably already more interesting than him and now they add Jacob.",
            "Hasn't this been the exact character/storyline for Solo, Tama Tonga and now Jacob?\n\n\"OH MY GOD YOU THOUGHT THE OTHER SAMOANS WERE VIOLENT THIS GUY IS CRAAAAAAAAZY\"",
            "Man, Romans inevitable return and reunion with The Usos is going to hit like fucking crack. The Samoan Civil War is coming.",
            "Jacob Fatu in the inevitable WarGames watch is gonna be fucking insane.",
            "Don't let this distract you from the fact that they killed Jimmy and never faced justice. Where's Dijak when we need him?\n\nAlso, the hate on Solo is just weird tbh. He's great in his role.",
            "It’s going to be 2034, and WWE is only going to be made up of Samoans and Tongans.",
            "https://preview.redd.it/58fccoe8a18d1.jpeg?width=826&format=pjpg&auto=webp&s=464acb7c6c0831956dc4ecebdfca0007d51f04d8",
            "He’s finally here. THE SAMOAN WEREWOLF IS IN WWE!!!! ☝🏽🐺",
            "OHH SHIT",
            "[Only one man can even the odds!](https://prowrestling.fandom.com/wiki/Ted_DiBiase_Jr.)",
            "all they are missing is the tall Samoan and u got a war games match",
            "Heyman gonna have a nervous breakdown",
            "How many times does Cody have to be told? Don’t mess with Samoans because they’ll kill you and then their 97 cousins will get to work on you",
            "These wrestlers who are getting jacked within months are all going to the same fitness instructor who has like millions of followers on IG",
            "He's nuts. Does a nastyass splash on commentry table and just gets up starts walking.",
            "Is it me or does it look like Jacob's dropped about 25 pounds? Dude looked pretty good.",
            "Jacob Fatu is a better Solo than Solo.  This is interesting because they are running very close to having Solo overshadowed by him moving forward.",
            "This is getting out of hand. Now there are FOUR of them!",
            "With Fatu actually in, I’m so moist at the thought of a Bloodline civil war. \n\nFatu is an awesome pick up!",
            "What a lariato wtf",
            "Wrestling is fucking back",
            "His shirt is sick, I would absolutely buy that.",
            "Oh shit Jacob Fatu! Gotta start watching WWE again.",
            "I swear sometimes it feels like I see more superkicks than I do punches thrown",
            "Time for Jacob to outshine Solo",
            "This changes EVERYTHING for the Bloodline who desperately needed a good worker as Solo improves more. Hakus kids are who they are but the other two can now carry the load.",
            "Jacob just take out 3 main event talent and one of them is wwe champion.what a debut",
            "was wondering when they'd finally debut jacob,looking forward to seeing what he does in wwe.",
            "Unlimited supply of Polynesians",
            "the kayfabe reason that Roman never brought those guys in because they are too dangerous is so awesome ",
            "The real Tribal Chief",
            "Nice call back to the Headshinkers gear that Jacob Fatu was wearing.",
            "Have been a fan for years. We knew he was coming but still what a great and shocking debut. ",
            "Could’ve sworn Hikuleo was gonna come out when Solo started laughing. Can’t wait till he debuts. For those that don’t know, he’s the 6’8 little brother of the Tongans lol",
            "Roman Reigns return would be one of the GREATEST ever",
            "The problem now is that Solo still looks like a goof (he just ain't it, I'm sorry) but there's Jacob next to him looking like he should be the leader.",
            "Out of all moves of course he debuts with a fucking super kick.",
            "Big mistake making him on Solo's side IMO.\n\nSolo is gonna spend the rest of 2024 in Jacob's shadow.",
            "A new Samoan debuts goes straight to the typical samoan moveset template of weak superkicks and samoan drops. DO all of them just learn the same template ?",
            "Is there going to be a story with the Bloodline soon, or are we just booking debuts one after another?",
            "Bloodline have jumped the shark for me now.",
            "How long are Cody along with Kevin Owens and Randy going to feud with the bloodline though? Get them some new feuds and opponents man.",
            "Fuck I missed the end of the show of course.",
            "I’m excited for him in WWE going forward. He’s the better one of the bunch and definitely will outshine Solo going forward.",
            "FUCK YES",
            "Jacob put extra venom into that splash",
            "So much for Jacob joining Roman.",
            "I'm so excited for Jacob Fatu",
            "This man is absolutely YOLKED y'all lied to me!",
            "Yooooooooooo!!!!!!!",
            "Huh, they gonna bring zilla too?",
            "Samoan's don't die, they multiple.",
            "Jim Cornette is fully engorged…..",
            "I'll never forget when Jacob Fatu [mowed down a fan at a local PCW event](https://x.com/socaluncensored/status/1139779150745497601). Fucked him up REAL GOOD.",
            "God damn dude put in work and came out vicious as fuck.",
            "Dudes got like 11 kids. Get that paper son",
            "I'm curious how the casual fans feel about Fatu after this night?",
            "The most savage one",
            "He did an Irish whip into the barricade and the guy bounced back.",
            "Isn't Hikuleo coming soon? This new Bloodline is getting packed.",
            "the hair made me think of Jimmy. Where is Jimmy anyway??",
            "Hikuleo is gonna look absolutely massive when he debuts last, those who haven't seen him yet won't be prepared.",
            "The spear he hit Randy with was so good",
            "\"The video is no longer available\"",
            "Oh shit...",
            "Aura, something the bloodline has been a bit lacking in lately",
            "I really hope we get at least one full entrance with the complete Bloodline when Roman returns. I wouldn't be mad if we found a way to shoehorn Jey back in, honestly.",
            "The usos, Roman and Sami reuniting is going to be great television. This might be the most epic wrestling storyline ever. They can probably hold off on the rock being involved until after survivor series.",
            "solo rn 💅\n\n![gif](giphy|ulOYUlWnHu7A5PdD1v|downsized)",
            "After watching the whole segment I really want to see him face Bron. It would be a hard hitting match.",
            "Beast!",
            "Bullet club Samoa",
            "Solo is in over his head. He better up his game because Jacob has that Samoan aura I haven't felt since Umaga.",
            "![gif](giphy|3ofSBs4Q1f8Q4aRFkc|downsized)",
            "Good for him! He was great on the indies. I know a few people in this storyline are done when it’s done, but he deserves more.",
            "Instead of a Dusty Finish, we're getting Samoan Finishes now.",
            "another Samoan with leg slaps ... great",
            "https://preview.redd.it/ioq9qnmm648d1.jpeg?width=2052&format=pjpg&auto=webp&s=bb1e773fd206d2badf2ad36bf763d3401751ea73\n\nAnother one indeed.",
            "Maybe some Fantasy booking here, but I think this will stretch into Survivor Series War Games. Cody with his team, Randy, KO & Punk versus The Bloodline with Solo, G.O.D & Jacob Fatu. Bloodline wins. Roman finally returns after the match ala Punk last year. I feel like this iteration of the Bloodline could do with a few more months of absolute dominance especially now with Jacob debuting & Hikuleo on the way",
            "Who's this guy? Need a video package.",
            "holy fuck he kept his name. rip caesar",
            "FUCK YES",
            "He’s got that headshrinkers look. He’ll have a long time as a novelty act",
            "Post wrestlemania has been boring a.f",
            "Please not another super kick merchant",
            "WHOS THAT IS",
            "HAIL BLOODLINE! (For context Fatu on MLW was in a crew that was called CONTRA and their salute was HAIL CONTRA) Holy fucking shit! Jacob Fatu is in WWE! Good luck to anyone stopping this force of nature!",
            "What’s going on with the crowd noise? Piped noise to cover up a chant? They didn’t react at all.",
            "And KO honestly sold him even more with that crazy sell on the clothesline",
            "I’ve obviously heard of him but have only seen a clip or two. “Solo, what have you done?” did so much to put him over.",
            "Shit Tonga Loa did too. He like hesitantantly raised his finger like “look I know I’m nuts but this is too far”",
            "He sounded genuinely terrified!",
            "Corey has done a great job of hyping up all the new bloodline members. AEW commentators need to take notes from this about hyping up new arrivals properly.",
            "And the terror of wade barret.",
            "Looked like a real sicko out there",
            "He has that Haku aura of this is not the guy to be in front of when he's pissed off.",
            "He has 7 children. Confirmed psychopath.",
            "Solo managed to goto rank 4 in his own stable",
            "He has lost a lot of body fat and put on some muscle. \n\nI was surprised to see him shorter/almost the same size as Solo though.",
            "He does look like he lost weight",
            "He's lost a lot of weight",
            "jump from indies to wwe where wrestlers are taller. He did lose weight though.   \n\n\nIt should be fine if they let him loose, he’s crazy athletic, probably more so now that he’s lost weight, but isn’t reckless.",
            "probably a little bit of both",
            "Probably lost weight. \n\nWWE rings are huge, tho so who knows?",
            "He had an incredible transformation in the short time he was away. Just Google Jacob Fatu gcw and you can see just how much face gains he has had from recent pictures. You can't fake that",
            "Kevin Owens use to look huge in ROH but regular size in WWE",
            "I thought he looked small, he’s definitely lost weight and everyone he was in the ring with was over 6ft and 220lbs on the indies that’s a giant. They really have to pivot solo 180 now though because Jacob is going to be doing the savage gimmick and he does it better than solo.",
            "If he was 6’5 he would have been up north a long time ago brother",
            "Every time someone jumps reminds me that wwe is still land of giants",
            "The last time I saw him in person was at an Indy show in I think February 2023.  He has slimmed down.  Even in the indy show I went to, he really wasn't that tall, and he was shorter than some of the other indy wrestlers. \n\nHe lives in Sacramento, CA, so that's why i saw him at local indy shows.  He doesn't come off as a people person.  The show I went to had a battle royale at the end where all the wrestlers surrounded the ring before the match started.  While the rest of the roster either gave high fives or taunted the audience, Jacob just came in at the end after everyone else  and never really interacted with the audience.  He didn't have a meet and greet table and didn't walk around meeting the audience like the local indy wrestlers did.",
            "O-o-o-ozempic",
            "He actually lives across the street from me and he just moved out to Florida on Sunday. I know A LOT of stuff but he went to Wwe hq in CT and met with people but they told him that they don’t want Him to be “the big guy” so he lost hella weight",
            "I saw him a couple months ago and he definitely looks thinner and toned.",
            "The shape that he’s in now, def Fatu. He took out 3 main event guys.",
            "If Jacob was at RAW the Wyatt Sicks would’ve been the ones laid out. ☝🏽\n\nhttps://preview.redd.it/yu9wnou6q18d1.jpeg?width=600&format=pjpg&auto=webp&s=2ebafa4766c89faa3bc41e3aef52338189b8868e",
            "Maybe Fatu because he already feels like WWE's Baba Yaga",
            "Nahh y'all think they'll do the new Wyatt's vs the bloodline?",
            "I don’t know, Paul Hamen has sold this new Bloodline as walking death. His “take me with you” was heartbreaking.",
            "Wyatt Sicks, The Bloodline as a whole is definitely more of a known quantity right now",
            "I'm salivating at the potential war between both these teams tbh.",
            "I would pay STUPID money to see the Wyatt Sicks vs the Bloodline. Down the road of course. Let them dominate for awhile before crossing paths",
            "This is the Wrestlemania tag match for 2026.",
            "Man… when we look back, we forget how dark the Bloodline story was. It was super dark.",
            "It's definitely not the Diet Wyatts.",
            "Jacob Fatu.  The Wyatt Sicks already feels like a bunch of cosplayers, and it hasn't even been a week since the debuted. \n\nJacob Fatu is certainly more skilled in the ring than any of the Wyatt Sicks. Just his mouth hanging open like that has this angry Samoan aura to him.",
            "Well he does have a real criminal record so that probably what they’re referencing",
            "I wouldn't be mad if Nia Jax is the inaugural member of the Bloodline's female branch in case there's more women on the way",
            "Jacob is actually his cousin though, so the bloodline name actually makes sense now lol",
            "Manu and Lance should have been signed up for the Bloodline ages ago.  They could have been like the nWo B-team or maybe even PG-13 for the Nation of Domination",
            "Hikuleo next please",
            "He was begging because if he took all three of them out Jacob would have attacked him instead.\n\nOnce you unleash the beast only violence will sate it.",
            "That psychotic laughter from Solo when Jacob came to save him was terrifying lmao.",
            "There’s like 10 of them on the indies scene",
            "Well Hikuleo probably isn’t far off and Zilla is still hanging around in the indies",
            "According to Bubba Ray, the Usos have 900 cousins. So yeah...there will be more.",
            "Zilla Fatu is just starting to train.",
            "The Bloodline is a hydra. Strike one down and two more rise.\n\nCody wanted to be the Captain America to face this Hydra",
            "You must be new to Samoan Families lol.",
            "They could get to NWO number of members, and they would be all related.",
            "Hikuleo's going to raise out of the ocean like Godzilla.",
            "They are going to need to set up a fourth promotion just for the Bloodline Civil War",
            "They're wrestling's version of the Wayans brothers. To reference a Chappelle Show skit: \"There's more?\"",
            "There's another Tongan reportedly under contract",
            "There's a 7 feet tall one as well",
            "Honestly I'm surprised they ain't called in Lance again, or even Zilla.",
            "rumours are wwe also recently signed Tama Tonga’s half brother (Haku’s adopted son)",
            "I would agree with this even if the dude wasn’t in the best shape of his career, but the fact that he is is making me feel like he he should be leading the new Bloodine ",
            "He was under contract to MLW, so they weren't able to",
            "![gif](giphy|tTDlx5ZQQug2Ph218n|downsized)",
            "This is like a reoccuring theme of Bloodline story tbh. Sometimes it'd be in a filler arc where nothing really happens and it can be boring, but then they introduce new elements and the story gets to be so much more interesting.",
            "The Bloodline is on the precipice of an enormous crossroads.",
            "Wade and cory are a great team. I respect the guy but Kevin Patrick would’ve killed this debut",
            "Same here",
            "I was honestly expecting Hikuleo and when the camera cut and it wasn’t some 6’8 giant I honestly didn’t know who it was because Jacob had lost that much weight",
            "I almost ended up malfunctioning watching Backlash bc I expected him to show up in France but it was Tanga Loa instead, who I didn’t see any rumours about.",
            "Jacob Fatu is one of those true hidden gems of the non WWE world. He's been out there in GCW, MLW, Reality of Wrestling and more just crushing it.",
            "Jacob Fatu is actually a sick athlete. \n\nHe looks leaner than I’ve seen him on other shows so he might be even more athletic now. You should look forward to him in action he’s dope.",
            "I mean undoubtedly he is. I will say Tanga Loa has been much better than expected. He's earned his contract so far.",
            "Tanga Loa was likely to get Tama on-board. Together as GOD in NJPW they were legit and basically the Japanese Usos, but yea he’s never struck me as a good solo worker.",
            "His match with Riddle is unbelievable",
            "He's basically everything they pretend Solo to be.",
            "He’s a better signing than Solo. Let alone Tanga.",
            "There’s a plenty more don’t worry lol",
            "Hikuleo",
            "Lance ",
            "LOOK AT YOUR FAMILY NOW MAMA SIKOA",
            "Man is so savage and dominant that he's going to pull a Braun Strowman & Nicholas with his firstborn, except his kid gonna do a Samoan drop and get the pin",
            "We're going neck deep. We're already knee deep and they just keep fucking multiplying.",
            "Gonna have Max Holloway show up and start slipping punches and screaming he’s “the best boxer in the bloodline baby!”",
            "at this point i just want him to keep adding more and more Samoans and Tongans to Smackdown to the point it’s just them and he is confused about who to face",
            "WWE is gonna have to hold a PLE in Honolulu & the Kickoff will be hosted by the Bloodline at a family feast",
            "Add Dakota Kai then you get Samoa and NZ in 1",
            "There’s a ton of them in the NFL too",
            "Punk's was probably his Plan A, when Drew murdered Punk and ruin that plan, he need a Plan B which was probably KO and Orton.",
            "Facts didn’t think about it he had no ace up his sleeve.  He literally got his ass whooped by Jacob",
            "> what is Hikuleo going to do?\n\ntall.",
            "With his height he’ll be a great asset to the new Bloodline NBA team",
            "Honestly Hikuleo will need a run in NxT first too..",
            "It explains why they are transitioning Solo to be more of a “don” character and not the silent monster Umaga successor they were positioning him as before. Jacob is clearly going to be that guy, and so Solo needed to be his own thing.",
            "I think the best thing for Solo is Solo acts kind of like the director of his mob of Samoan and Tongan psychos, for example today after Jacob speared Randy the ref told him to go after Cody, what the ref did is a perfect role for Solo to do during Jacob’s stuff, like he tells Jacob do this do this and ect. it would double work as getting Jacob over as a psycho while not making him outshine Solo since he is still taking orders from him",
            "Jacob can be a perfect candidate for giving Solo his own trauma from betrayal or defecting. The way Seth and Sami did to Roman.\n\nEither Solo becomes jealous of Jacob getting over on his own and Jacob becomes face. Or Jacob usurps leadership and kicks Solo out.",
            "I dunno man, I think Solo actually has real good acting chops and will elevate to this role really well. He never ever breaks character like he’s a 10 year vet, and his facial expressions and growth as a performer over the past 2 years has been big. \n\nI wasn’t a solo fan at all until the recent turn with him as the head but I think he will really shine through. The company obviously have huge belief in him to put him in that position after Roman, so they must be seeing something too.",
            "Honestly, it works. They could play that up on TV. Jacob Fatu breaking away from The Bloodline is going to be huge.",
            "They'll keep him off the mic for most of the year.",
            "Poor Kevin owens was collateral damage",
            "With one old timer there still pining for the good old days",
            "When Roman's music finally hits its gonna blow the fuckin roof off.",
            "Everything WWE is doing is fantastic Raw, NXT, and Smackdown. I can't speak for Speed because I don't have twitter",
            "Lol technically speaking, Tama Tonga and Tonga Loa are not 'Fatu's'. Only Solo and Jacob are from these 4.",
            "I thought they were about to announce a 6 man tag for MITB. \n\nNow I think they’ve gotta get Jacob on that card.",
            "Something told me something big was happening because the emphasis on extra security for the Wyatt Sicks but they used the possibility of that to debut Jacob which was genius",
            "No offense to the Tongans, but that 3rd split feel like if they made a storyline around DX vs Shield vs 3MB",
            "We gonna get a Latino Bloodline too you think?",
            "I feel it's too early for Roman to come back, and you would want to bring him back at a LPE. I personally think he comes back at MITB, but I wouldn't be upset by SummerSlam",
            "Yes and it's been great because Jacob is the worst(by worst I mean best) of all of them.",
            "I can't find it but someone did an Onion style thing where it was announced \"WWE signs Samoa\"",
            "Yeah Fatu is gonna overshadow Solo really quickly.",
            "very much a David Finlay/Gabe Kidd situation (if you follow current NJPW) - though even Solo has more presence than Finlay lol",
            "I don't think it's just because he's solo tho, look at how this clip started in the first place. When solo debuted, did you ever expect him to routinely get run off, bested, or even beg for mercy? This solo isn't living up to the danger Heyman keeps mentioning. I like the character but don't understand his individual booking.",
            "There’s absolutely zero way for them to get the Bloodline Wolfpack over as a sadistic brutal faction without him.",
            "Jacob will be heels first. when roman come backs, he become baby face",
            "I think that’s the point. Jacob is the one who can actually fill the main event spot for the new Bloodline",
            "Roman ditches Solo and keeps Jacob maybe.",
            "The big mistake was making Solo in charge to begin with lol. They made him a silent enforcer under Roman and did so little to make us care about him.\n\nStoked for Jacob though, glad he got to use his name too.",
            "it's almost like they might train together\n\nDon't worry, Jacob has some real good moonsaults",
            "The storyline is that The Bloodline is taking over Smackdown. Soon when Roman and The Rock return, the next big step will occur. Plus we still need Hikuleo to debut.",
            "I think the story starts at SummerSlam, but I'm just done with the bloodline all together it's faux Roman and the bootleg Samoan swat team out there...ugh",
            "dead basically\n\nand can't no-sell it like Gable did",
            "YouTube it...you will NOT be disappointed. Absolute beast.",
            "Maybe a Caesar is someone else.  Maybe Jimmy gets invited back on the condition that he fully denies his twin by changing his name, and starts tagging with Solo as “The Sikoas”.  Solo and Caesar!  When I say Sik, y’all say Oa!",
            "What the the absolute fuck are you talking about?",
            "This also works because it’s similar to Hail Hydra and at this point every time you take down a Samoan, two more spring up in it’s place.\n\nAnd the Hail Hydra / Captain America dichotomy plays well with Cody’s character vis-a-vis the Bloodline",
            "Covers up things like 'Fuck you,\" \"bull shit\" and \"holy fuck.\"",
            "plus his instant death via Samoan Drop on steel steps",
            "The Rikishi clothesline bump.",
            "Him and Tama Tonga both had that what the fuck did we sign up for.",
            "Yeah that was beautiful 😙👌🏼 They all did a great job at selling him.",
            "It's the Butcher and the Blade! The Blade and the Butcher!",
            "100% AEW commentators are so bad at putting over the weight of angles. I used to think Excalibur was one of the best commentators around but these days he sounds so forced and weird when doing 'shocked' reactions.\n\nSometimes you hear Tony in the background trying to sell the importance of a spot for the storyline and he just gets steamrolled.",
            "He’s 6’1 last time I checked, but a lot of people thought he was the same size as Umaga when he’s a few inches shorter.",
            "He looks slightly taller than Kevin Owens, which I kind of expected, but he's so much leaner than he was last year. Dude put in the work in the gym.\n\nTama's speed and Tanga's power combined.",
            "If I signed with WWE and they told me to hang out for a while before debuting, I’d be spending my days in the gym.",
            "He actually lives across the street from me and he just moved out to Florida on Sunday. I know A LOT of stuff but he went to Wwe hq in CT and met with people but they told him that they don’t want Him to be “the big guy” so he lost hella weight",
            "I do know that Jacob has gotten heat before for no showing a meet and greet so it’s not shocking to learn he’s not super personable",
            "He lives in Antioch",
            "That man has some real aura around him",
            "Survivor Series is gonna be sick this year.",
            "![gif](giphy|AmZIbvnHypTHhqiJ22)",
            "That would be fucking sick as hell",
            "I can see it happening eventually. They're both basically attempting to control WWE, but through different means. Two very big factions of this size can't exist without clashing at least once, they have to cross paths at some point.",
            "Ooooh, Solo, Tama, Loa, Jacob vs Bo, Rowan, Gacy, Dex\n\nThe hype alone would have the crowd blowing the roof off the place (provided Sick6 continue to do well, which I am sure they will).",
            "SHIELD v Wyatts 2.0",
            "I like it because it works in pushing that Solo's Bloodline is an uncontrollable street gang compared to Roman's. You've got a violent criminal who spent time in jail, a guerrilla fighter and a former Mexican gang member/bicycle enthusiast.",
            "Add Naomi as a honorary Uso",
            "Why does there have to be a female branch?",
            "Honestly who I thought it would be when Solo started laughing and phones turned away from the action.",
            "I'm guessing it will soon enough",
            "Jacob Fatu is Mahoraga from JJK 😂",
            "And we thought WrestleMania was the Avengers Endgame of this storyline",
            "The Dudleys vs the Usos family. Which has the larger family tree?",
            "And for having less than 20 matches under his belt. He’s gonna be something. Saw him at a GCW show recently and was heavily impressed.",
            "I think it could be leading to that. I think the current endgame is Rock vs Roman but I can see Jacob taking over & kicking Solo out of the group, down the line. \n\nI am genuinely starting to think they might stretch this story out further than just Roman, considering Solo & Jacob are in their early 30s. \n\nPlus their could literally always be more on the way lol",
            "They probably even tried if the lawsuits were any indication of past behavior lol",
            "![gif](giphy|4H1xauOflBDHY4sUah)",
            "Caesar Sikoa.. whatever happened there",
            "When you think you're done with the Bloodline but another Samoan shows up:\n\n![gif](giphy|xlWk7dk6v20KY|downsized)",
            "Literally. There were two guys Cornette would cream himself over long before AEW got up and going. One was MJF, the other was Jacob Fatu.",
            "Not really hidden. This place hasn't shut up about him for over a year.",
            "[He's also a piece of shit.](https://www.f4wonline.com/news/other-wrestling/jacob-fatu-accused-of-no-showing-charity-event-not-returning-payment/)",
            "Jey and Jimmy inspired him to get in the business, and Jacob is already better in the ring, and on the stick, he has the potential to be the best Samoan to do it since the Rock, Roman too, as long as he can handle the success, and stay healthy with his insane style. He is more believable than any of them, I hope he gets the gas. I could see him taking the strap from Cody.",
            "Zilla",
            "Max Holloway in the WWE would be a trip. 💀",
            "Max during contract signings- \n\n\"We gon' see satuhde night!\"",
            "honestly there would be so many good names for the PLE like Maui Mayhem",
            "WWE Bash at the Beach: BLOODLINE",
            "And you can't teach that.",
            "Hikuleo and Zilla Fatu being the NXT branch of the bloodline could be cool",
            "Super smart take honestly",
            "You know that’s a good read and it works out for both guys not trying to be that 1 monster",
            "It seems like Solo is pretty a Sonny Corleone running a group of Luca Brasis",
            "Jacob is the muscle and Solo runs the operation. Roman was a combination of both so it works out really well.",
            "Jacob Fatu can talk bro, he should not be silent",
            "Yep they set that up instantly and have them saluting in those same positions even. I really think solo is going to be great in this role.",
            "What makes it funnier is Jacob is legit an amazing promo too",
            "That pop will be nothing compared to the moment the og Bloodline + Samy stand front to front against wolfpac bloodline in the ring. That shot will be WWE history forever.",
            "Is he rikishi's son?   I can't remember how he was related.",
            "Rey doesn't need more people turning on him.",
            "Only if they sign away Toa Liona (trained by Rikishi) AEW and hire Afa’s son-in-law Vertigo Rivera",
            "Yeah that's deffinitely a good point that the booking is not helping at all. Also, following Roman as the new leader while also really not being the leader because Roman technically is just taking a vacation etc.\n\nJust personal oppinion is that he is also lacking the talent necessary, both in and out of the ring, for such a role anyway.",
            "I would point out that Heyman's thing is the danger Solo is courting by bringing in people Roman wouldn't",
            "But he wasn't begging for mercy, that was clearly a cop out and a distraction for Jacob to wreck shit. I think Solo fits in his new role as the new Don who's brutal and showing he's more strategic than people believe.",
            "Perhaps. There is bound to be some faction hopping to extend interest in this. They’re going to pull out all the stops.",
            "WWE wants me to watch outside material? No thank you.",
            "it's ok to not like things and it's also ok to express your opinions even if it isn't shared by the majority of people here",
            "When a Samoan does it, shouldn't it just be called a Drop?",
            "Just wait til Hikuleo debut. Dude will be staring into space",
            "Is it bad if I can hear both Schiavone and Excalibur uttering this?",
            "One shit call from 5 years ago?",
            "Yeah according to the Ultimate Source Wikipedia Jacob is 6’2 vs Umaga at 6’4",
            "If wwe says he's 6'1 then hes around 5'11",
            "More like DX vs the Oddities 2.0",
            "Roman’s Bloodline was a family that happened to be a gang.\n\nSolo’s Bloodline is a gang that happens to be family.",
            "Roman's Bloodline is like the 1930s Mafia compared to Solo Bloodline's as Los Zetas",
            ">former Mexican gang member/bicycle enthusiast\n\n\nWho? ",
            "Bicycle enthusiast?!",
            "Bicycle enthusiast made me crack up lol, I can’t believe Loa is Camacho",
            "Truly a street champ.",
            "Shit, not a bicycle enthusiast!",
            "Whos a former Mexican gang member?",
            "Dont think Jimmy is gonna be happy with that.",
            "I want Heel Naomi sooooooooooo bad. Its also the only way I see her getting the womens title anytime soon.",
            "Same. When I saw something about a new member I thought it would be him. Fatu actually left my mind at that moment so it still somehow shocked me. Great debut otherwise, dude looks like a legit psycho.",
            "It was. They are just doing a much better job with Phase 4 than marvel",
            "Dude is crazy good already! And is willing to do some pretty crazy spots.",
            "WHATEVA HAPPENED THERE???",
            "That animal Fatu... I can't even say his name.",
            "To the victor goes the spoils",
            "Whatever happened there? I’ll tell you what fucking happened, this piece of shit’s Samoan put six super kicks in the kid without any provocation, whatsoever.",
            "All this from a slice of gabagool?",
            "He is beating Cody at Summerslam. I can sense it coming. \n\nGonna crown himself the damn emperor afterwards. \n\nWild timeline",
            "And Cornette has gone on record to say that the only guy he'd be willing to come back to manage is Jacob Fatu",
            "Zillas super new but they should sign him and train him up in NXT",
            "Unfortunately, the Rock would force them to use \"[A Hot Summer Night](https://en.m.wikipedia.org/wiki/A_Hot_Summer_Night)\" because of his grandmother.",
            "Lethal Luau",
            "Bloodline in NXT would have way more power over that roster with Ava as the GM",
            "Solo IMO works better in the role he’s in anyway, Jacob legit looks like the successor to Umaga",
            "I was just thinking about this. I think it's gonna happen at the War Games.",
            "When roman and sami hug, jesus man i’m going to tear up",
            "Jacob is the son of Sam Fatu...aka: The Tonga Kid\n\nJacob and Solo are cousins.\n\nSolo is Rikishi's son. As are Jimmy and Jey.\n\nAnd Tama and Tonga are sons of Haku.",
            "Jacobs father is Tonga Kid who is Rikishi’s brother and a tag team partner of Haku.",
            "Hunico is going to come back for his best friend Camacho",
            "I mean can you blame the people turning on him? He's a deadbeat dad.",
            "You're memeing but I do legitimately suggest checking out his MLW stuff if you aren't already familiar. He's fantastic.",
            "It’s only a Samoan Drop when someone from Samoa does it. \n\nOtherwise it’s just a sparkling throw.",
            "So Tongan drop in this case ?",
            "It was Excalibur. JR was next to him asking \"Who?\" and Excalibur just kept saying their names.",
            "Well we can't remember all of them, can we ?",
            "Umaga was 6'4\"?! Goddamn.",
            "Me on tinder",
            "That’s why they call him the Street Champ",
            "Mafia vs Street Gang",
            "Tanga Loa fka. Camacho",
            "Loa used to be in WWE where he was in Kayfabe a Mexican gangster who came out on a bike",
            "Craziest part is there isn’t any shortage of talented Latino wrestlers either to play that role",
            "Why wouldn't he?",
            "I thought it would’ve been interesting if they kept her with Bianca & Jade, keep those 2 as faces but have Naomi turn heel. \n\nI think the dynamic would’ve been interesting.",
            "lol you could have heyman’s bloodline vs cornette’s bloodline like a rehash of the midnights vs midnights feud",
            "At this point, I doubt Corny is coming back to manage anyone. He seems happy and he despises traveling.",
            "If only he wasnt a racist sexist transphobic asshat maybe id give a damn.",
            "No thanks. Stay in your racist podcast lane, Jim.",
            "Have him be Roman’s replacement Solo since both of them would be in NXT during The Bloodline if they went through with this",
            "Thanks.  I couldn't remember how tonga kid fit in. \n\nWasn't tonga sitting with rikishi snd Haku at the hof?  They gotta bring that up how the elders may have planned this.",
            "*sparkling splash",
            "No. He's Samoan.",
            "Yeah a lot of old WWF and WWE wrestlers official heights are crazy Rock is 6’5 the same as Randy Orton now\n\nThe Original NWO is crazy Hogan Hall were both 6’7 and Nash was 6’10",
            "Just wear lifts in your shoes",
            "He used to hang out with Hunico aka Sin Cara 2 currently known as Cinta Del Oro",
            "That's so funny that they had a Samoan presented as a Mexican",
            "Jimmy got kicked out of the bloodline, they beat his ass. Why would he want his wife to join them?",
            "There's never been a situation where I saw a spot for Cornette in WWE in the last 15 years I've been watching. But having him take over as the wiseman for Heyman actually sounds interesting.",
            "https://preview.redd.it/77jdmlv9p18d1.jpeg?width=640&format=pjpg&auto=webp&s=77bcdad432ec98a3c6c3269e901d7c4d30d8df80\n\nTwice in a lifetime!",
            "There's few people who can go toe to toe with Heyman on the stick. Corny is definitely one of them. And if you want somebody you can absolutely loathe, Corny can do that too.",
            "Oh yeah, it was just a hypothetical question that he answered.",
            ">transphobic\n\nIs that why he stuck up for Gisele Shaw when Rick Steiner was being an asshat lol",
            "Nobody asked",
            "Yeah as far as I know, Tonga Kid and Rikishi are twin brothers too?",
            "A splash is a body press, done from the top rope, run, or a jump. A Samoan Drop is a fireman’s carry throw.",
            "That reminds me, almost time for my daily energy drink infusion...",
            "Both not true lol. Hall was about 6ft 4",
            "Already disappointing with my size when i take my pants off may as well do the same with my shoes",
            "They also had a Samoan presented as a Japanese man.",
            "Going purely off of what would be shown on screen, I'm into it, but Cornette isn't a signing worth his baggage for any major entertainment company that have to worry about PR.",
            "Is he beating up Mr Incredible?",
            "Oh i bet he has a black friend too so he cant be racist either!\n\nJust because you stick up for one person doesnt take away from all the other shit theyve said.",
            "Who woulda thunk we'd get a mini islanders reunion in 2024.  Haku and tonga's sons teaming in the same stable.\n\nHide your bulldogs!",
            "Oh really?\n\nWow. That’s interesting.",
            "I’ll give them a pass for that just because Yokozuna’s presentation was fucking baller.",
            "When the Usos referred to him as “Uncle Yokozuna” I chuckled",
            "I doubt WWE would have any reservations in signing Corny. But given the amount of money he's making on his podcasts and memorabilia from the comfort of his own home, I doubt he'd even want to commit to a WWE schedule. Him saying he'd come back to manage Jacob Fatu is simply his way of saying \"Yeah, he's *that* good.\"",
            "Yeah it's awesome and I'm all for it",
            "It's not a throw.  It's a fireman's carry fall-away slam.",
            "I was a big islanders fan when I was a kid.  Them, paired with Bobby heenan, wsd awesome.",
            "There’s no such thing as a fireman’s carry fallaway slam. A fallaway slam by nature involves a powerslam which a Samoan drop is not.",
            "don't let this man distract you from the fact that in 1998, The Undertaker threw Mankind off Hell In A Cell, and plummeted 16 ft through an announcer's table."
        ]
    },
    "[Smackdown Spoilers] Tweet from tonight's attacker": {
        "title": "[Smackdown Spoilers] Tweet from tonight's attacker",
        "score": 1068,
        "url": "https://i.redd.it/eyrommas318d1.png",
        "content": "",
        "num_comments": 95,
        "comments": [
            "\n**Help make SquaredCircle safer and more inclusive by using the report button to flag posts and comments for moderator review.** \n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/SquaredCircle) if you have any questions or concerns.*",
            "Even better? Drew updated his profile pic\n\nhttps://preview.redd.it/2fmgvndad18d1.jpeg?width=582&format=pjpg&auto=webp&s=331a49386d8c52c137c8c17f14906962401cd08a",
            "Damn so Punk used to force Drew into an oven and turn the heat up?\n\nThat's kinda fucked up Punk",
            "Did Drew buy a Fudgie the whale at least?",
            "Drew that’s Cody’s gimmick! Gimmick infringement",
            "Why would Drew post a picture of Cody when he's currently feuding with CM Punk? /s",
            "Goddamnit Drew\n\nHow many times do we have to explain this to people...\n\nHomelander is the *bad guy*",
            "What did I ever do in this world to deserve an empty-headed fucking dumbfuck like \"Drewlander\" Drew McIntyre to go out on national television and fucking go into business for himself, for what? - CM Punk",
            "If only he had showed up with a whale cake",
            "Drew saw what the Wyatt Sicks did Monday and said “Aight bet, watch this”",
            "Looks like Hate-o-rade is back on the menu boys!",
            "Punk deserved it",
            "god I love this man",
            "https://preview.redd.it/oj45h5l5i18d1.jpeg?width=948&format=pjpg&auto=webp&s=c385b510ae21fabb30ff01974b02086de535825b",
            "Cody's roots are showing again",
            "Scottlander",
            "Those 3 days that Drew’s Twitter was deleted will be missed",
            "![gif](giphy|3o84sn067hNcquAPKg|downsized)",
            "[Drew whenever something bad happens to Punk](https://x.com/i/status/1803705775363158459)",
            "Long Live The King (of Haters)",
            "This fucking guy. I love this fucking guy.",
            "![gif](giphy|iF7CxHFcKXcMfEIWGN|downsized)",
            "[Link to tweet](https://x.com/DMcIntyreWWE/status/1804322787466543415)",
            "We've got Twitter Drew back, folks!",
            "Punk's idiot brain was getting fucked by stupid.",
            "You can't use Homelander Drew, that was supposed to be Cody gimmick when he turn heel",
            "drew is love drew is life",
            "This guy is absolutely fucking incredible",
            "Get in the oven Phil.",
            "Who called him squirt?!",
            "Did Drew bring a cake?",
            "Petition to put Punk in the Bad Room.",
            "I hope Drew doesn't make Punk beat the monkey live on TV",
            "He watched him rub one out too.",
            "Nah that will be next week. When people ask where's Punk,  Drew will just smile, act as if nothing happened and tell people to eat some cake before it melts.",
            "More like a Cookie Puss",
            "https://preview.redd.it/7pjmoa1pw18d1.jpeg?width=1242&format=pjpg&auto=webp&s=92b0003dc3bb7206f3aa9bacbb49c046dea9d0a6",
            "So is Drew.",
            "People on twitter about to start writing him essays about media literacy now.",
            "\"I'M ABOUT TO LASER PUNK'S DICK OFF WITH ME EYES\"",
            " The flavor of hate strawberry.",
            "Punk around and find out.",
            "That’s the funny part about this story imo. \n\nIf this were anyone other than CM Punk, they would be a heel.",
            "Am I correct with the segments we've seen tonight that it was the Tongans who attacked Punk? And then left him for Drew?",
            "How? Drew dared him to screw him, then CM Punk does, and wants to act surprised and angry. Didn't he start this feud in the first place?",
            "Punk did not deserve it. Only reason Punk kept going after Drew was because Drew said he “prayed for this to happen”, attacked Punk after he announced he was taking some time off to rehab his injury and continued to antagonize him for months. He would be World Champion right now if he hadn’t kept messing with Punk. Drew got what was coming to him at WrestleMania and Clash at the Castle.",
            "It's just a shame it probably wasn't Drew who did it. But then again, Drew rarely has a problem taking credit for the work of Samoans. 😉",
            "did anyone else have to remind themselves that this was just a tv show at this part?",
            "HIGHLANDER. There can be only one!",
            "So it was just deactivated? I don't know much about Twitter system",
            "He whispers in my ears: \"I prayed for this and it happened...\"",
            "\"Blow Cody\"",
            "John Laurinaitis",
            "Maybe Linda will be brought back and locked in with the door welded shut..",
            "Spit on it, Phil!",
            "IT’S STAAANG",
            "Sping",
            "*Is he?*",
            "He should just respond to them with the same image to make them seethe and froth even more.",
            "Aw claymore to the dick...",
            "Are we just ignoring Drew’s “I prayed for this and it happened” promo?\n\nThat’s not a babyface line at all",
            "How? Drew started all this. He isn't the victim here.",
            "They never got to him. Cody showed up to set up a match against Solo.",
            "Yeah, as long as you reactivate it within thirty days, everything's good.",
            "\"Racism is just a spectrum, right bro?\"",
            "“Cmon Squirt!”",
            "…you know, I’m not sure I’m missing anything I don’t care to see by not watching The Boys.",
            "Hawk tuah!",
            "Would a good guy beat someone bloody backstage and drop their limp body in front of his home crowd to see?",
            "If I was gonna KMS I'd be fucking awesome at it... shotgun to the dick baby!",
            "I feel like I’m taking crazy pills here in people thinking Drew is the face in this. Even one of my favorite wrestling podcasts said CM Punk is basically the heel..why? Punk is completely right here. \n\nDrew injured Punk. Even though he didnt try to intentionally according to him, dude said he prayed for it and it happened. Then he spent weeks taunting him. Then when he finally wins at WM against Rollins, he taunts CM Punk who if memory serves just gives McIntyre a quick sweep which took him off his feet so Priest could take advantage and cash in. Then Punk screws him out of the title after that, sure, but if anything Punk just gave Drew some of his own medicine.",
            "You're right. It isn't.\n\nBut someone praying on Punk's downfall isn't entirely without merit.",
            "Punks existence is enough of a trigger.",
            "But there were backstage segments with Solo and Heyman, Solo asking Heyman to get it sorted. \n\nAnd then before Solo entrance in main event, Heyman said he did what he asked. He said he told the Tongans to do what Solo ordered. \n\nTo me it's that they took out Punk and left him outside for Drew?",
            "Liv Morgan: *smiles*",
            "You get me?\n\nhttps://preview.redd.it/dly5237z448d1.jpeg?width=405&format=pjpg&auto=webp&s=faba9f6be294945fd7008d5000a69528d3c47cb3",
            "Obviously yes, because that's exactly what he just did.",
            "Would a good guy follow someone across the Atlantic and screw him over in a title match in his home country? They’re *both* the bad guys.",
            ">dude said he prayed for it and it happened  \n  \nWell, in kayfabe it also opened up a spot for Drew to compete for the World Title at Mania. It's still very crass and heelish - but its not only for the heck of it.\n\n>he taunts CM Punk who if memory serves just gives McIntyre a quick sweep which took him off his feet\n\n? Punk did a lot more than that, he beat Drew down after he was off his feet. Drew deserved it, but it wasn't just a quick sweep of the legs.",
            "Yeah, Punk’s been the face throughout the story except at Clash At The Castle, where obviously Drew was gonna get cheered no matter what.",
            "It was explained before the main event that their missions had been to stop RKO and Owens from winning their qualifying matches.",
            "Nah, why would Drew's hands be bloody if not to show he did it?",
            "Why would it be the Tongans though? Why would Solo order a hit on Punk? \n\nAlso, Drew's knuckles were bloody, so I really doubt it was a Bloodline hit. I'm just curious as to why you'd draw that conclusion?",
            ">Heyman said he did what he asked. He said he told the Tongans to do what Solo ordered.\n\nBelieve that had to do with Orton getting jumped before his qualifier + the appearance of Jacob after the ME.",
            "![gif](giphy|XepEEIO0SCFLMT6tUL|downsized)",
            "So then no he’s not a baby face lol",
            "Ah right, my mistake. Seems like I misinterpreted. \n\nI was confused cause in that promo before the main event Heyman said \"You're breaking several commandments. Roman agreed Punk was hands off\"",
            "Definitely seems like I misread it, my mistake.\n\nIn the promo before solo entrance Heyman said \"you're breaking several commandments. Roman agreed Punk was hands off\"\n\nhttps://youtu.be/Gxe3e5zMoe4?si=7NCQLG9QYuHGoUk3\n\nAnd I thought cause Solo ordered Punk to get out earlier and he didn't, he wasn't happy and that was one of the hits along with getting Randy and KO out of MITB. \n\nAnd then Drew attacks Punk after he's served on a platter. \n\nThat's how I came to that conclusion, my bad though, probably did misread it.",
            "Drew has been nothing but a morally upstanding citizen here. He hurt Punk in the course of a fair sportsing contest at the Rumble. Because Punk is a no good rotter who spent the last ten years pooping on WWE, he expressed happiness at doing so. \n\nAll good, pillar of the community stuff.\n\nAnd Punk responded by attacking Drew completely unprovoked when Drew's back was turned as he was enjoying the biggest moment of his career, costing him the title. And then Punk flew all the way to Scotland to an event he wasn't booked for, just to cost Drew the title again in a match that Drew had won fair and square. A match which Drew performed heroically in given that his wife only recently underwent emergency surgery.\n\nDrew quite reasonably sought revenge on Punk, and in doing so he doubtless inspired millions of men women and children who have suffered at the hands of a cowardly bully.\n\nWe should all aspire to be more like Drew. Hopefully once the Chicago natives have a chance to reflect in the cold light of day, they will realise how wrong they were to boo this modern day saint.",
            "Yeah cause they were going to attack Punk at the start of the show, but Cody came out and saved Punk. During the Punk/Drew segment, there's no Bloodline anywhere. Plus you see Drew's bloodied knuckles, indicating that he's responsible.",
            "Naw wait, I missed most of the show and only caught pieces here and there except the Drew/Punk segment, you might be onto something. After seeing that backstage Solo/Heyman scene you linked, I could totally see what you're saying.",
            "https://preview.redd.it/1ziypuufh38d1.jpeg?width=245&format=pjpg&auto=webp&s=1906900a8c28b88bca8a62b82615a4ec52ebf283",
            "Definitely seems like I misread it, my mistake.\n\nIn the promo before solo entrance Heyman said \"you're breaking several commandments. Roman agreed Punk was hands off\"\n\nhttps://youtu.be/Gxe3e5zMoe4?si=7NCQLG9QYuHGoUk3\n\nAnd I thought cause Solo ordered Punk to get out earlier and he didn't, he wasn't happy and that was one of the hits along with getting Randy and KO out of MITB. \n\nAnd then Drew attacks Punk after he's served on a platter. \n\nThat's how I came to that conclusion, my bad though, probably did misread it.",
            "The truest stories are often the coolest. I thank you, sir.",
            "You ain’t wrong and you’re welcome"
        ]
    },
    "[Smackdown Spoilers] Ending shot of Smackdown..": {
        "title": "[Smackdown Spoilers] Ending shot of Smackdown..",
        "score": 967,
        "url": "https://i.redd.it/6qiomrzo518d1.jpeg",
        "content": "",
        "num_comments": 242,
        "comments": [
            "\n**Help make SquaredCircle safer and more inclusive by using the report button to flag posts and comments for moderator review.** \n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/SquaredCircle) if you have any questions or concerns.*",
            "The hesitation that Tama Tonga and Tonga Loa had right before this was a cool detail\n\nThe story they're telling of Solo recruiting family members who are more and more dangerous is a nice jumping off point for when Roman comes back eventually",
            "Tama and Tonga very confused",
            "Solo having to tell Jacob to keep the one up lmao",
            "Tonga Loa looked a little apprehensive. Maybe even Jacob is a step too far for him.",
            "Jacob Fatu was on that Gunther diet. He lost a ton of weight.",
            "https://preview.redd.it/f5ngmc3pg18d1.jpeg?width=483&format=pjpg&auto=webp&s=335b33c624ed1b0dc81f6efe16271f56861027fa",
            "Oh, so the new Bloodline has been completed, I think. They are parallel to each of the old Bloodline:\n\nSolo - Roman\n\nJacob - Solo\n\nTama and Tanga - Jimmy and Jey",
            "Roman gonna have to apologise to Jey and to Sami cos otherwise he's fucked, right now it's Roman and Jimmy vs Solo, Tama, Tanga and Jacob with Rock also somewhere probably pulling the strings for Solo's side.",
            "Isn't there still at least one more... A 7 foot one from NJPW right",
            "So War Games' shaping up to be New Bloodline vs. Old in Roman, Usos and Sami?",
            "Jacob looks like he got in insane shape\n\nExcited that they finally debuted him, I was fully ready for him to come later on. This guys got the stuff and it was only a 5 minute spot",
            "jacob is literally the smallest one in the group. that's crazy",
            "It's been FOUR YEARS and this Bloodline story is still going strong. That is genuinely mindblowing.",
            "The tongans seemed to give an apprehensive look as they entered the ring before they threw up the \"ones\"",
            "Jacob spent his time off getting in shape like he really cut.",
            "Loved how hesitant Tonga Loa was. It really sold that Jacob is a level above him in the maniac scale. \n\nThe Tongans are like Hyenas, while he’s like I dunno some fucking maniac animal like a Hippo or something. Hippos are nutcases.",
            "I thought they'd debut Hikuleo first and Jacob would be Solo's answer to Roman when he comes back",
            "Corey and Wade did a GREAT job putting Jacob Fatu over. They might be the best commentary team in WWE right now.",
            "OG Bloodline (Roman Reigns/Jey Uso/Jimmy Uso) vs. Bloodline Wolfpac (The Rock, Solo, Jacob, MFT, Tanga)",
            "A pack of hyenas",
            "HOW DOES HE LOOK SCARIER FUCK",
            "Fatu impressed me more in five minutes than Solo has in two years",
            "Wait so does this mean when Roman returns for the inevitable he automatically gets custody of Paul back or is Bloodline: The Next Generation going to opt for some sort of, like, hostage situation?",
            "I really appreciate the evolution of the Bloodline.  In terms of actual gang/cartel progression, once the elder statesmen leave by murder or incarceration, the youth take over and are often far more violent, hot headed and lack the political finesse of the previous generation.  The patience, direction and general tiptoeing on the line that Roman brought no longer exist.  Chaos erupts  (refer to Summer of the Gun in virtually any North American city).",
            "Bloodline statues...back",
            "Bloodline 1: Roman, The Usos and Paul Heyman  \nBloodlike 2: Solo, Tama Tonga and Tanga Loa and Jacob Fatu\n\nThe One Who Watches While the Bloodline Destroys Itself: The Rock",
            "I think if Hikuleo does join this - they need to give him a mask or something and have him as the final lunatic. He literally seems too nice to join this now that Jacob came out as mini Umaga that even G.O.D is a lil confused by.",
            "Could have sworn I heard the ref outright yell at Fatu to go after Cody",
            "You got Jacob right there and Solo being the leader. Reverse this shit and you are cooking.",
            "Now we get another surprise debut in a month for \"Talla\" Tonga lmao",
            "The ref was telling Jacob to get Cody 😂😂",
            "Jacob is 30lbs heavier than Solo but Solo looks bigger. Has Jacob lost weight or was 279lbs his advertised weight in MLW because nobody would question it?",
            "Roman gonna have to come back to set these guys straight",
            "https://preview.redd.it/zkw5r8hab28d1.jpeg?width=1920&format=pjpg&auto=webp&s=dc5ce1d60d4483aee8c9c69aaddbb4ee3cdab110",
            "Jacob should keep his ring gear being barefooted it gives the appeal of him being a true savage.",
            "It’s almost too Samoan.",
            "Bloodline wolfpack vibes. This story could make a few dudes stars here easy but could always become bloated quickly.",
            "Fatu over Solo any day",
            "Wonder if they choose to have Roman get absolutely laid out by this group the night he returns",
            "The guy doing a middle finger on Jacob 🤣",
            "Solo fatu and the tongas vs rock roman and the usos for war games?",
            "B Team B Team GO GO GO !!",
            "How exactly is Hali’s lineage related to Rock and Roman??",
            "I don't know all the ages, but everybody in this segment, except for ko, probably knew each other as kids.  Haku and dusty crossed paths in wwe snd wcw, and rikishi and Haku tagged for a bit.  Plus obviously tonga tagged with Haku and is rikishi's brother.",
            "If what I'm hearing about Hikuleo joining the Bloodline is true.. this may be the best version yet.",
            "crazy how solo instantly got out-aura'd",
            "I enjoy the guy in the crowd behind Solo’s left shoulder throwing his middle one to the sky",
            "Jacob Fatu has lost a ton of weight, damn! Good for him!",
            "when dean ambrose's contract up? there needs to be a Roman and the Shield vs the neo-bloodline story!",
            "Surely this is leading up to old bloodline vs new bloodline in war games right? Roman, Sami and the Usos vs Tama, Tanga, Solo and Fatu. \n\nWho is the 5th members though!? If rock is available then rock could join up with the new and Cody with the old!",
            "AJ styles better be sticking around.",
            "Jacob Fatu is going to jump to the Michaels of this team so freaking fast. Dude is so good.",
            "Literally the cringiest group in the WWE.\n\nHow can someone look like a 12 year old with a beard and be taken seriously as the “enforcer”",
            "Probably an unpopular opinion but The Bloodline is getting old. It's time for something new. Every week it's the same old story of them getting in the middle of a match and jumping the opponent of the week.",
            "I love it! I'm glad I didn't look at spoilers 'cuz I was not 100% he was debuting tonight. Another oh shit moment where you're imagining how they might do it. And I think this is the juice they needed to really be a threat. (Although Solo is impressing me on the promo work to be honest)",
            "Why did people think his name was gonna be Ceasar Sikoa lol?",
            "I’m feeling lazy so can someone tell me where he fits in with Fatu family?  Another brother?  Cousin? Thanks in advance!",
            "What if at MITB, you have...\n\n  \nThe Bloodline vs Cody, KO, RKO, and a Mystery Partner.\n\n  \nThe Mystery Partner....Roman Reigns.",
            "When you order \"acknowledgement\" off wish.com",
            "Usos, rock and Roman vs them?",
            "all these dudes are talented workers but there is such a lack of aura from this picture 😭",
            "Bloodline keeps introducing NPCs and none of them have any character. Just feels like we're working in g out way through random henchmen. \n\nThis is honest awful booking. We don't even get the impact of a new savage Bloodline member before another debuts. And somehow Solo is in charge? \n\nThe 3 new Bloodline members are about to be completely lost in a sea of jobbers and lower card talent. \n\nWhat a fucking waste of some talented wrestlers",
            "Every family has that one guy nobody talks about.",
            ">The hesitation that Tama Tonga and Tonga Loa had right before this was a cool detail\n\nYes, I really liked that. The Guerrillas thought they came in and were crazy, but now here's a guy who's absolutely insane and too hardcore for even them.",
            "And with Heyman trying to communicate how each new member is completely unhinged and dangerous, they also planted the seeds where it could very much end up that Solo cannot control the new members, and they turn on him",
            "Is there anyone left to come in? A story of Rock with the Tongas, Roman with the Usos, and Solo with Jacob and someone would be cool.",
            "This wouldn't happen if Samoa Joe was still around",
            "Behold, the fully operational battle station…",
            "I just saw The Bikeriders and this is kind of similar lol",
            "Roman needs to come back at SS, but the cards are stacked against him and so he makes amends with Jimmy and Jey. 😙👌🏼",
            "I don't think it's confuses as much as scared. Tanga Loa looked pretty scared before he put his one up.",
            "Both?",
            "They could easily flip it into the storyline if he becomes the one the Bloodline truly can't control",
            "The ref also had to tell him to watch out for the camera and to go attack Cody. Plus Corey had to move one of the monitors off the announce table. Seemed weird he just missed so many small things right off the bat",
            "Looked like he was a bit off on that spear to Orton too.",
            "Tonga Loa has the most vicious strikes in the game. Go look at his match against Okada from earlier this year. No one is more vicious and as calculated as him with his striking.",
            "Yeah.  He kinda shot a look over to his brother before they put their \"ones\" up.",
            "Reminds me of when Tony Soprano got a legit Italian mob guy named Furio. [He didn't fuck around](https://www.youtube.com/watch?v=hmLJNf4AveM).",
            "Good to see him lose weight, it will definitely help him keep his moveset longer.",
            "For real. All the footage ppl post about how amazing he is seems old as hell because dude doesn’t look that big at all.",
            "PC magic, wrestlers who are often on the PC are usually on the best shape of their careers",
            "https://preview.redd.it/8cu5974k638d1.png?width=483&format=png&auto=webp&s=46163061cbd84d185b684efe5a19017bca03e129",
            "If this is leading to a Roman, Sami and Usos vs New Bloodline match at War Games, I’m totally here for it.",
            "Now they just need to adopt a stray white guy to be their Sami",
            "This continues to be probably the most impressive storyline/continuity in WWE history. What a perfect storm of related Samoans in their prime lmao this is amazing.",
            "Tama's Jey in this but yes.",
            "Hikuleo surely is joining Roman now",
            "He's *only* 6'8.",
            "Yeah",
            "That's what makes sense. How they get Sami in is the question, either Roman has to apologise to him or Sami sees Jey (who they've established is still friends with Sami) getting destroyed and he can't take it anymore so he still doesn't like Roman but does it to protect Jey.",
            "It doesn’t make sense for Jey or Sami to go back to Roman",
            "He was put over as a monster.",
            "Yeah.  He looks like he lost quite a bit of weight.  I didn't think it was him at first.",
            ">he’s like I dunno some fucking maniac animal like a Hippo or something. Hippos are nutcases.\n\nI like to think you somehow work your hatred of hippos into every post you make.",
            "How dare you leave out Sami Zayn",
            "I’ve honestly liked solo a lot more lately, he’s getting better in the role",
            "He needs this separation from Jimmy and Jey and Roman. He was sorta stuck being the Heavy in a team that doesn’t need one. Now he can be the stupid guy that got Made and now runs the city because there’s no one left. So what does an idiot do? Surround themselves with what they think it takes to run the gang.",
            "As much as Solo was trying to be Umaga, Fatu is the second coming of Umaga.",
            "Solo got moved up from NXT way too soon",
            "I think there's a potential that the Rock is whispering in Solo's ear.\n\nRoman couldn't get the job done against Cody, even with every advantage possible. Rock or the elders decides he needs to take over, but he can't do it overtly.",
            "Nah - Jacob isn’t the guy that should be calling the shots. He’s the one you want delivering the shots. He’s insane and looks like a straight killer while Tama and Tanga are the scrappy lackeys. \n\nSolo is the right guy to lead, it doesn’t have to be the best guy ability wise. Also story wise Roman labelled Solo as the next tribal chief ages back. It wouldn’t make sense for a guy with no prior story with Roman to just take charge when Solo is right there.",
            "About sick and tired of the marks slandering solo every 5 seconds. He’s done a strong job in his role why don’t ppl understand where not suppose to see him as the new Roman the entire point is he’s a complete opposite of Roman 🤦🏿‍♂️",
            "You're not getting it. Solo has transitioned from the silent heavy to the brains of the operation specifically so Jacob can operate as the unhinged monster that he excels at being. If Jacob's the leader, then Solo has to be the monster/heavy of the group. Jacob is too good in that role to be the leader instead. That's not even getting into the storyline reasons why what you're asking for is ill-advised.",
            "They're still cooking imo. Solo has done a fine job.",
            "Disagree. It’s half as Samoan as the previous incarnation of the Bloodline. It is more Tongan now though.",
            "Copyright was issued to wwe for that name",
            "Rikishi's nephew, cousin to Solo and the Usos",
            "Give it time",
            "[removed]",
            "We don't talk about Bruno",
            "He was strong as a bull, handsome like George Raft",
            "Hikuleo is the other relative of Tama and Loa (he’s 6 foot 8 because half brother genetics are wild) and Zilla Fatu is another option, he’s Umaga’s son and tagged with Jacob on the indies for a bit",
            "Hikuleo is the last rumoured Samoan/Tongan to come to the wwe. Idk much about him but he looks to be a scary mf due to his height and I think wwe will definitely build on that. He could easily fill in that last spot on team sikoa.\n\nEdit: thanks for fixing my error u/SandsShifter",
            "It’s like Bloodline versus Bloodline Wolfpack. Too sweet.",
            "If they wanted to, they could put Nia Jax in the  new bloodline with Naomi joining Roman and the Usos in the old bloodline down the road.",
            "Tama and Loa have another brother.",
            "i think at survivor series 2024 the war games should be solo jacob fatu tama tonga tanga loa and hikuleo vs roman the usos sami and kevin",
            "Been saying it for years.",
            "How long is his AEW contract?   lol  ",
            "You know shit is fucked when they're shook, & they've been stablemates with some bad mfs. Hell, even Haku would be a bit hesitant lol",
            "He looked absolutely amped lmao. He probably got way too hyped up and forgot some shit.",
            "This is why they still made well travelled indie veterans go to NXT",
            "It’s his first night, I’d cut him some slack.",
            "Jacob Fatu is a rookie at this level.  \n\nAll but **ONE** of his matches has been at what you might call \"Tier-3\" promotions, like MLW, Defy, GCW etc.\n\nHis lone \"Tier-2\" appearance was also his largest ever crowd he performed in front of, a 2,000 person show for NJPW Strong in a tag match.\n\nI'm not disparaging his wrestling skills, it's just a completely new game for him that'll im sure he'll get better at.\n\nJacob has never had to deal with a crowd of that size, commentary tables that intricate and tv production on that scale.  Literally Allstate arena has 8x as many people as his largest crowd.",
            "That looked painful",
            "Man you just know he’s gonna be taking pins eventually lol",
            "Best 619 in the game!",
            "Well it’s against Indy wrestlers. I mean people here were talking what a monster Matanza or Mil Muertes is and compared to all the luchadors and Indy wrestlers in lucha underground, they are. But Matanza would be like a smaller rhyno in wwe and mil muertes is shotter and lighter than John Cena.",
            "QUATTO wants you to OPEN YOUR MIND to the Bloodline",
            "Roman being the last to enter a War Games as a face.",
            "I can imagine some 97 War Games, Rock join forces with Roman and the Usos to take on the New Bloodline but then betrays Roman and along with the other members, they recreate the Ric Flair spot, Roman and the Usos get their head slammed with the cage door, writing them off until February.",
            "Joe Hendry lol",
            "Corbin",
            "Sami's syrian heritage in shambles.",
            "Nah, he'll join this Bloodline too.  5v5 at War Games.",
            "He's not coming back",
            "I think Hikuleo joins Solo and Roman reconciles with Cody, Jey, Jimmy, Sami... but wait there's the Rock too lol who knows",
            "Roman spologizing to the honorary uce will get a huge pop whwn the hug it out",
            "Jimmy is the key",
            "But that’s the thing, it’s not about Jey or even Sami going back to Roman. It’s about those two agreeing to help Roman for the greater good. \n\nThey can easily make the new Bloodline be such a big problem that Jey and Sami team up with Roman. \n\nAlso, I could see the Wyatt Sicks being such a problem for Jey (and maybe Sami) that they ask Roman for their help with their problem.",
            "Haha I actually think they are cool animals but they are more dangerous than most think",
            "I think his presence as a performer is improving - just in my opinion he doesn’t do it for me in the ring",
            "I think his character worked better in NXT I actually dig the loner street fighter, he doesn't have the aura and ambitions of a leader, so I hope he returns to that character after all this is over.",
            "The marks reveal themselves when Solo is involved. He's playing his part very well. We're not supposed to think he's a good replacement for Roman. We're supposed to think he's an ambitious former henchman who's way out of his depth and thinks he's bigger and badder than he really is. The less legitimate a replacement for Roman Solo appears to be, the bigger the pop will be when Roman returns.",
            "Folks only have one view of what a leader is for a stable lmfao.",
            "Lol it was? Who owns the name Ceasar?",
            "Thank you!",
            "BUT",
            "Madrigal or Sammartino?",
            "…except for when we sing an entire song about him!",
            "I thought birthwise he was a full brother to Tama, and a cousin to Loa? (Yes they are brothers, adopted siblngs are siblings, I'm talking about the coment on genetics.)",
            "There is also Sean Maluta and Lance Anoa’i, both wrestles on the independents.\n\nBoth of them would be perfect to eat pins or get sneaky wins and be the first line of defense in The Bloodline. Afa Jr. aka Manu is still wrestling.",
            "There is also Thamiko Fatu (real name Jeremiah) but he's doing a lot less than the rest.. saw it mentioned he began wrestling in the last year or so?",
            "Zilla Fatu is too young and too green for the big league. he need to build his experience few years more before ready for WWE",
            "What's funny is that, if you've seen him in NJPW, he doesn't come across as scary at all. He just seems like a laid back giant dude",
            "Hikuleo is Tongan.",
            "Meh",
            "\"Look, we're bad and dangerous and even we don't want to fuck with this motherfucker, that's how bad this guy is\"",
            "Then Haku would remember he himself bit a guy's nose off before and be like Jacob's not so bad.",
            "I don't know I feel like the pedestal for this a crazy motherfucker stops at Haku lol",
            "Leave him alone he was stimming",
            "Totally. WWE is a whole ass TV production, it's a behemoth of moving parts.",
            "Exactly. \n\nIf Okada would have went to NXT he would have learned the basics of how to work a control board and not messed up like he did the other night. \n\n\n\n/s",
            "Yep.\n\nFatu's largest crowd was 2,000 people for NJPW Strong, which is also his ONLY Tier 2 promotion appearance, 99% of his prior experience was on Tier 3 promotions like MLW, Defy, Reality of Wrestling etc.\n\nHe's never performed at a proper NJPW, ROH, NXT, TNA, CMLL or AAA show (minus 3 promotion event that had AAA that was attended by almost no one)",
            "You should talk more about these tiers.",
            "Matanza was Jeff Cobb. That dude's on a different level than a lot of wrestlers.",
            "he just lost a shit ton of weight homie that’s all",
            "And to start the reactor...",
            "Should be KO is the one booked, but they annihilate him before he can get into the cage and they go 3 vs 4.\n\nThen when the timer runs out the refs are confused and wonder if they should start war games.\n\nThen Romans music drops...",
            "Surprise returns for Wargames 2024 \n\n\n- Men's: Roman Reigns for storyline reasons \n\n\n- Women's: Becky Lynch so we can say it happened 3x in a row now",
            "I think I just filled the cup",
            "Nah Joe Hendry is better off as the 6th Wyatt",
            "Roman, Jimmy, Jey, and who?\n\nEdit: Forgot about Sami but still not sure who the 5th member would be",
            "Rock will be the 5th of bloodline 2.0",
            "\"Sorry\" - Solo said calmly",
            "High Chief Rock only coming out for Mania season",
            "That will 100% turn KO heal again",
            "Cutting your teeth on the indies does more for you as an in ring performer than NXT.  NXT is great for making you a \"WWE Superstar\" but every top tier in-ring performer you can think of who wrestled in NXT didn't LEARN to wrestle in NXT.",
            "Frankly I’m impressed with how well the Bloodline has been the top storyline or near the top all these years running. \n\nIt’s all so good.",
            "I kinda see his role similar to the unhinged & bumbling siblings (Dodd & Gargano) in Fargo S2 & S4 when their families started to go into chaos",
            "If we're not supposed to take him seriously like with Roman that's fine with me as long as they don't give him the main event of summerslam against the biggest and most popular babyface they have in Cody, let him send Jacob to do the dirty job and be his world champion, that Solo has Vince's position in the corporation and Jacob the Rock as the crown jewel of the group.",
            "Brutus.  He stabbed Julius in the back to get it.",
            "It's not about the \"Caesar\" name itself...it's about trademarking the full name 'Caesar Sikoa\". This way it belongs to the WWE and they can use it freely, while stopping others from using it for profit or any gain. It's pretty common practice.",
            "IT WAS MY WEDDING DAY",
            "Yes",
            "Sammartino Jr",
            "Okay you are right I misread Hikuleo’s Wikipedia page. I also didn’t mean to imply that that half brothers aren’t real brothers",
            "I can see a timeline where this goes full Attitude Era and Manu is revealed as the brains behind the bloodline for Legacy reasons",
            "Well there are like 50 Samoans I was just talking about the major people I can see joining",
            "Sean was in NXT for a while right? He can fit back right in.",
            "And Journey Fatu, brother of Jacob, son of Samu",
            "Hikuleo is the little brother of the Tongans\n\nBut he's always had a gentle giant vibe even as part of BC",
            "Graves was trying to get that point across on commentary, Jacob being the one family member who scares everyone else. So having both Tama and Tanga looking a bit off put was gold.",
            "Hey man he said he was sorry",
            "Okada performed at a national Tier-1 promotion for years.\n\nAll but ONE of Fatu's matches have been with Tier-3 indies like GCW, ROW, Defy, MLW etc.\n\nHis lone outlier is a single NJPW Strong appearance with 2,000 fans attending.",
            "Well yeah, he’s shredded now. Doesn’t change that he’s same height as solo and now looks about same weight",
            "Yeah i was thinking that, it would be fucking amazing for him to not be announced for the match somehow and be a surprise and was wondering how to do it without it being super obvious.",
            "And here I thought it was just me",
            "you wouldn't put that gorgeous mug behind a mask, would you?",
            "Say his name, and he a-fears",
            "https://preview.redd.it/zhci70nwl18d1.jpeg?width=622&format=pjpg&auto=webp&s=ff444fb12c676181394766ac346abfc431af390d\n\nYou know who",
            "Sami and KO. KO being the most interesting he's been the longest rival of the bloodline.",
            "Sami as one of them for sure.  The 5th member Heyman gears up",
            "Someone said it should be Seth if Roman is making amends in a post I made and I love that idea",
            "Sami and Jey would’ve been in every WarGames match lmao",
            "Seth and Roman making amends? Otherwise maybe KO?",
            "Sami and Cody",
            "it should be kevin i also would love to see cody vs gunther champion vs champion",
            "Seth. Reconciliation with his Shield brother at last.",
            "Seth? The story would be there. Roman realises what he built and now needs an old brother to take the new threat down. It could work",
            "Sami. Duh.",
            "I think Jacob ends up taking over and kicking Solo out. He joins back up with his brothers and you for the OG bloodline against Jacob and the 3 Tongan brothers\n\nSolo already looks like a #2 compared to Jacob. He’ll slide back into the OG BL and Jacob vs Roman is the next big feud in the civil war",
            "While I think The Rock will be revealed to be behind this iteration of The Bloodline, I'll be very surprised if he's participating in a WarGames match.  He might even be in the middle of shooting Moana at that point.  I don't expect him to do a match again until Mania.",
            "He'll go down the same route drew did in regards to jey.",
            "Chad Gable",
            "There wasn’t a cloud in the sky 🎶",
            "(it was our wedding day)",
            "Sean was used as enhancement talent in NXT & 205 Live, shortly after the CWC tourney",
            "Except when he was ending Jay's time in Japan.",
            "I loved the \"why the fuck did you bring this fucker in\" look, and the hesitancy of Loa to throw up the one while looking at Jacob.",
            "Really appreciating the little details he felt like a monster tonight",
            ":(\n\n:|\n\n:o Bitch.",
            "Say his name...",
            "Enemy of my enemy type shit",
            "Plus, that promo he and Heyman had in the ring a couple of weeks ago where Heyman told KO that Roman had respect for him. Very much enemy of my enemy is my friend deal. Them squashing their beef momentarily to take care of a more violent threat is one way they can take it.",
            "I'm thinking Cody & KO, especially not counting out the former's participation because of the chance Rock will appear at the end of/after WarGames",
            "It will be Cody not Ko. \n\nRoman Usos Sami and Cody.",
            "That would be really fun.",
            "i think roman is facing seth at 41 because i think cody is facing rock at 41 if not then is roman vs rock at 41 and roman vs seth at 42",
            "Definitely a good call, but I'd argue the exception that proves the rule.  He's an Olympian and a freak athlete.",
            "No clouds allowed in the sky!",
            "Essentially no selling the clothes line over the top rope, and then jump from the top rope onto Cody. Everything felt like a minor inconvenience to him, it was gold.",
            "Joe Hendry?",
            "Rock is filming Moana live action in the fall plus doing PR for Moana 2. It's not impossible he squeezes something in but I think it's probably likely we're not seeing him until January",
            "Cody has a target on his back being the world champ, now its AJ and bloodline but it will be Orton eventually",
            "Yeah, I'm leaning a bit towards rock vs roman, cuz they've wanted to make that match happen in the past as well... ko it is ig",
            "Bruno walks in with a mischievous grin....",
            "THUNDAHHHH",
            "Are you telling this story, or am I?"
        ]
    }
}