{
    "The JOJOLands - Chapter 16": {
        "title": "The JOJOLands - Chapter 16",
        "score": 835,
        "url": "https://www.reddit.com/r/StardustCrusaders/comments/1distwg/the_jojolands_chapter_16/",
        "content": "The JOJOLands is the ninth part of JoJo's Bizarre Adventure.\n\nChapter 16 is now out officially in Japan. Discuss the chapter here.\n\n* [Mangadex](https://mangadex.org/chapter/494bad68-08ab-4e22-be3d-e15707768e8b) ([Hi Wa Mata Noboru](https://hiwamatanoboru.com/))",
        "num_comments": 389,
        "comments": [
            "\"The unending pursuit begins\"\n\nJoJolion is so fucking back, baby",
            "Seems like Jodio mixing up three letter acronyms wasn't just a one off joke when he was talking about music with Charmingman",
            "I like the part where Jodio explains what the fuck an mri is",
            "Oh my god that last scene is incredible. They effectively got her killed as a mechanism to bring the land to them. I'm glad we are already setting up that using the rock means potential sacrifices being made, and that the gang will be willing to accept progressively worse consequenses to achieve it. This is the best chapter in a while.",
            "The Jodio pose on the cover page is insane. It's like he broke all of his limbs",
            "When they first showed the land registry woman in the hospital I thought it was Holly for a second lol",
            "Stand name discovered: Bags' Groove, a Miles Davis album.\n\nEDIT: Well, not sure whether we should go with song or album...\n\nEDIT THE SECOND: It was actually composed by Milt Jackson (it's jazz). Davis was the one behind its most famous rendition.",
            "Smooth operators shrunk to fit in Dragona's windpipe!! Stand shrinking is back!!!1!",
            "Jodio yelling \"There's a sequence Dragona!\" while Dragona is on the floor dying is so funny",
            "Seems like the greater the price (or harder to get in possession of) of the thing they’re trying to steal is the greater the price other people will have to pay to get it to them. Like the few dollars made it right to them with no worry, that 80k watch had the guy who bought it lose the money he spent and had his girl leave him, and this 50 billion dollar land got someone killed. \n\nI can see this over time leading to something like one of the main characters getting killed off for a extremely large some of cash and completely regretting it. Something like Jodio finally becomes filthy rich like he wanted but at the price of losing dragona, someone Jodio would probably consider to be priceless. Giving him the maximum reward for maximum price.\n\n\nGreat chapter. I know we’re already 16 chapters in but it still feels weird when new characters get introduced",
            "I’m really enjoying the pacing here. Jojo is usually infamous for taking its time to introduce new characters. \n\nBut Araki just dropped an entire folder of them on our asses.",
            "\"All you have to do is operate a computer!\"\n\nThere's never been a JoJo gang I've trusted to do this less.\n\nJodio: \"I pushed ICU not MRI.\"\n\nYup.",
            "I gotta say, November Rain's precision is insane. \n\nAlso really liking the design of the new villains. I like how Araki subverts the expectation by making us think the hat-wearing guy was the stand user, when it was in fact the girl.",
            "Insane chapter actually.\n\nHowler is looking more and more like the main villain group. To be expected from a King Crimson reference.",
            "Other note: The investigator accompanying the User of Bags' Groove, Bobby Jean, is named for a Bruce Springsteen song. (I was still too late to warn the comments section on YouTube...)",
            "Really into the suspicious crooked investigator and vaguely freakish little girl combo, and I LOVE that the girl is the stand user. The way Araki plays with expectations has always been one of my favorite things about his writing.\n\nEverything about JOJOLands has been so interesting to me, and I love how the threads are all compounding. The mysteries about Howler and the lava rock are really intriguing, and I get so excited every time we learn more. And as always, I’m obsessed with the crew’s dynamic. Meryl Mei’s little gang are wildly fun, and their interactions are some of my favorites for any cast in the series.\n\nEdit: Just wanted to add that I really really love how strong Jodio and Dragona’s relationship is. The fact that Jodio tends to come off pretty aloof and blasé, but very obviously loves his big sibling really gets me. Sure hope nothing bad ever happens to them.",
            "\"I need you Usagi.\"\n\nThe Usagi x Dragona fanbase stays winning.\n\nAlso Bags' Groove's user is probably part of the Howler family; seems like she's wealthy and influential. The man with her must be a high-ranking police officer being paid of by the Howlers. Seems like they have influence over the entire state.",
            "\"I can't take money, that isn't allowed\"\n\nmaybe I'm reaching with this but if the Milagro Man is back I will SCREAM\n\nalso there seems to be a recurring theme of three-letter acronyms? Charming Man will only listen to three-letter artists (SZA, HER, etc), and Jodio gets confused between ICU and MRI...",
            "I like Jodio noting the word \"absurd\" once again. Interesting how it keeps coming up; I wonder where it's going, as well.",
            "First arc's main villains are here, let's go!",
            "Will the rock human teases ever stop?",
            "i deadass thought that the daughter of the politician in the hospital was Holly Kira and almost shit my pants",
            "I love how the enemy stands are created, They feel like they are created for the team to fight instead of being cool facts araki learnt on Wikipedia",
            "I'm convinced every JoJolion fan had a feeling crawling on their back when the hospital was mentioned",
            "Looks like the situation's getting complicated, I like it, I'm curious to see where these new guys fit in. \nMy only worry is the amount of characters Araki is has introduced already in such a short time, I hope he can make all of them feel cohesive with one another.",
            "This feels like the kid's are going to regret doing what they just did. I'm not entirely sure why they did it but...",
            "Bobby Jean is a reference to the song “Bobby Jean” by Bruce Springsteen from the Born in the U.S.A album",
            "I instinctively read Bobby Jean's dialogue with a Texas accent",
            "This chapter was a great showing for Jodio. Their desperation in trying to save Dragona was sweet. But it also showed Jodio’s intelligence when he coordinated with Dragon to take out the enemy Stand.\n\nPlus, Jodio and Dragona made such a great sibling team once Dragona recovered. I definitely like this relationship being fleshed out as the story goes on.\n\nWe also finally see our Stand user. At first the chapter tried to depict the agent as the user, but it’s the young lady instead. The Stand name appears to be Bag’s Groove. Also, it seems like Araki knows people are trying to sniff out Rock Humans among the cast, because he is throwing in teases every so often. This time, with the lady talking like she’s not a human.",
            "So the entire end sequence was the Lava Rock guiding them toward the Land ? That's just so sick. This part is insane.\n\nThe entire chain reaction is kind of nuts. Jodio messing up a 3 letters acronyme, the girl dying, meaning the computer with the contract is now free to access. Just insane.",
            "I have a wacky prediction, the gang will somehow get implicated in the murder of Congressman's daughter putting the entire state of Hawaii on their ass. Again just a wacky thought with nothing backing it.",
            "The seizure of Howler's land is going to backfire big-time somehow. I'm not sure how it will, but it's going to have grave consequences, I'm sure of that.",
            "This has been a fantastic day for me. New Jojo Chapter, New Ippo Chapter, a 10/10 Nintendo Direct. \n\nI could not be happier :)",
            "That November Rain/Smooth Operators combo attack was sick",
            "Shohei Ohtani got mentioned in this chapter! Aside from that, this chapter has Araki's strongest writing in part 9 so far; the climax in the hospital is executed perfectly to convey the mechanism in action, as well as its increasingly large exchanges",
            "November rain may have what seems like a simple power, but it keeps showing new layers. it managed to hit the inside of Dragonas body with pinpoint precision. sure, it was really cool combination attack with smooth operators holding them down, but it was still an impressive feat. \n\nand we finally meet members of the villain group, and they are pretty interesting. it seems like the agent bobby Jean is a corrupt cop, since hes affiliated with the tiny girl whose stand is attacking them. I wonder if hes going to survive the stand users defeat and be a recurring villain, or if hell reveal a stand he uses to defend her",
            "Smooth Operators is quickly becoming one of my favorite stands, those little guys are awesome",
            "And just like that, Araki will create a new generation of jazz fans.         \nSmooth Operators is such a versatile Stand, one of the best in Jojo and one I would love to have in real life.          \nI think the girl is the daughter of the owner of Howler.         \nOne moment she was so cute and the next she went into serious mode.         \nKids in Jojo are another level.",
            "Jodio bout to throw hands with a child in a few chapters \n\nSeriously though: out of all the people I expected to be the enemy stand user, a little girl was not one of them. Also, a lot of characters too. I’m expecting that Bobby Jean guy to be a reoccurring character in the future",
            "Seems like the Howlers are going to be a sort of mashup between the Higashikata family & Passione, and guessing we've only just now met one of them of many to come. This translation at least also implies that she's some sort of Rock Human-like character (her references to \"humans\")?\n\nIt's been true throughout the series, but it continues to be funny that so many characters act like they & everyone else on their team just has an encyclopedic knowledge of Stands, despite most normal people not having any clue that they exist. Like, once you awaken your Stand, you gain access to Jojowiki. Jodio immediately starting to babble about \"long-range automatic pursuit-type\" Stands as if this was a concept & a system of classification that everybody around just knows about is just funny to me, and I doubt we'll ever get an in universe explanation for it (and I don't need one either, I just find it amusing).",
            "Not a soul in this world was expecting Bags' Grooves Araki really played us all",
            "JoJolands' story is starting in the place where JoJolion's ended.",
            "I really loved the part where Jodio screamed \" it's JoJolanding time\" and acquired the JoJolands.",
            "Fantastic chapter. Really liking our new villains. What happened to poor Sophie wasn't their intention or their fault, but still the way it went down was hella cold at the end.",
            "High af. But theories:\n\nHowler seems to be aware of the theft of the lava rock after the cats got killed. Higher ups call agent Bobby Jean, when he arrives they have him bring the girl to review footage of team jojo looking at rhe documents as her stand was activated. \n\nLittle girl is def a daughter of a higher up.",
            "\n\nHands down the best Chapter we've had in months (not that the others are bad, this was just the best one!) WOW! I for SURE thought Dragona was a goner, I was audibly saying \"NO NO NO\" as I was reading- fuck Jodio is REALLY stepping up. He is such a great JoJo.  \nAlso Bobby Jean? Nice with some Bruce Springsteen!!  \nThat Bobby Jean guy seems like he's going to be something more than just the \"next arcs villain\" , REALLY excited about that!!!\n\n Also Bag's Groove's user... I know we way this every four weeks but... the way she is dressed , and the way she speaks about humans... she doesn't seem quite \"Human\" herself... I KNOW we say this ALL the time guys but this time I PROMISE! I PROMISE IT'S A ROCK HUMA- \\*gets forcefully dragged off-stage by three security guards\\*",
            "Alright! Another unexpected and unique use of a stand assed to my list!\n\n. Dragona shrinks Smooth Operators to get a member of Bags' Groove captive, then Jodio uses November Rain to obliterate the mate with a raindrop",
            "Bags Groove. Interesting stand name.\n\nCan't wait to see the gang work an MRI machine.\n\nCrying for Sophie.",
            "I don’t want to make any hard judgments either way, but I feel like Jojolands is already leagues ahead of golden wind in terms of execution of a large evil corporation conspiracy type plot. The tension and action scenes that just weave into each other are really great, and the team fits nicely without seeming overly friendly (except the flirting lol). \n\n\nI hope it keeps this pace and direction moving forward and doesn’t fall back on the random SA scenes like the first few chapters.",
            "Damn that fake out on who the stand user was fooled me. I also like the part where Jodios November Rain snipes Bags Groove. That was insane.",
            "Lol spilling the ramen came back.  Nothing is a coincidence when the lava rock is involved",
            "Man every few chapters this part just reinvigorates me to keep reading. Loving the concept and design of the old guy and the girl. Feels fresh compared to the insane designs from previous parts. More down to earth but distinct. \n\nWhile I’d rather not have another automatic stand, I do like the user actually takes damage from direct attacks instead of being clueless of what’s going on. She’s going to be an active part of the pursuit as she’s looking for these random people who activated her Stand.\n\nHope this pacing keeps up and we don’t get the problem where characters panic and repeat themselves for several pages across chapters.",
            "So… that child is the stand user?",
            "\"Because all humans will someday meet with an accident or disease and die\"\n\nWe are so Wonder of Back",
            "wtf is up with that kid",
            "im surprised that it took 9 parts for a bruce springsteen reference and if bobby jean is the user's grandfather her name could definitely be Billie Jean also my theory on the stand being called Down with the Sickness has been disproven by the chapter",
            "I love seeing the Kirkland brand characters made by  The Matte Kudasai",
            "I love Bobby Jean's design",
            "Why did the girl's stand being damaged give her a nosebleed? Aren't automatic pursuit stands typically not linked to the user?",
            "SOPHIE reference ???🤔🤔🤔🤔",
            "NOVEMBER RAIN LITERALLY PISSES ON HIS ENEMIES. LITERALLY SQUEEZED OUT A DROP IN DRAGONA'S MOUTH",
            "Sooo much fuckin hype for whatever all of this is building up to",
            "It’s peak",
            "Arak is utilizing these stand abilities very creatively I like that a lot",
            "November Rain with the precision piss shots",
            "Did I miss something or did Charmingman just randomly get better lol",
            "usagis gonna die from radiation poisoning if the gang operate the MRI by themselves",
            "It's a while away, but I can see the anime of this playing out in my head lmao.",
            "The stands in this part are reminiscent of the ones in Part 4 & 5 in how useful they are when it comes to situations where you need to be agile.\n\nIn fact, with the likes of Smooth Operators, Matte kudasai & November Rain, they've shown to be more utility based.",
            "Here my dumbass believed that Usagi spilled the ramen on purpose for a big brain play but nah dude was just hungry",
            "so if the lava rock set up that whole situation with the woman dying, does that mean it also caused jodio to press the wrong button? lmao",
            "It really was an *endless calamity*!!",
            "I really liked that chapter! The stand complication is cool, the new villains are really good, I dig them a lot. And I love that they basically let that daughter die to get that land. It feels like the main story really starts to pull in. Generally the part has for my feeling a really fast pacing, much more than part 7 and 8. Feels really like a reinterpretation of part 5, which was also a quite fast paced one.",
            "Damn, what a riveting chapter! That security camera room scene was great, the interactions with the characters felt so natural! I wonder who that young girl could posssibly be...\n\nWe know that she's the enemy stand user, but there's a bit more to her character that meets the eye...",
            "Was usagi able to see the stand initially because of a stand user, like psychic perception within your body? or did he know about that stand already? either way this panel specifically caught my eye, how it's drawn with the perception of the stand then stated that he \"saw\" it, but something doesn't add up there.",
            "Ngl I don't quite understand what they did with the fingerprint at the end there, but I'm hyped for what's happening \n\n\nAlso of course Usagi spilling the ramen was plot relevant and came back to bite them in the ass. Because of fucking course it was lol",
            "You guys i lovs Jojolands already. These comments here as so funny😂. The girl who wanted the hulla hoop doll was so creepy",
            "Wait they’re talking about Shohei right when the congressman was talking about her daughter mentioning Ohtani?",
            "i'm so glad we actually got a butt load of new characters this chapter. nothing wrong with a small cast, but jojo's is infamous for being slow with introducing characters. so the fact we went from several chapters about one character to (at minimum, depending on who you find \"important\") three characters at once makes me so excited.",
            "watch her be like 33 years old",
            "I really like seeing Araki play with his main casts morality so much in the last 3 parts.",
            "Huh, a spherical attack that dug a perfect hole through an opponent for instant effect.\n\nThat the user could remote control to hit a specific target. . .\n\nWhere have I seen that before. . .",
            "The Hula Nyan Dancer got a suspicious amount of focus, and no information can be found about it online. It's going to be important later. My theory is there's a lava rock or other important item hidden inside.",
            "So the girl is a rock human stand user?",
            "I was really hoping the politician's name would be Phillips, a callback to part 3's Senator Philips who drove Dio's new car (he mentioned owning a villa in Hawaii)",
            "So now we have an investigator baby-sitting a cancer-inducing girl with an obsession for dancing cats. \n\nI love JOJOLands.",
            "Using November Rain that way was so freaking cool. I knew there was going to be a unique way he'd use it especially in such a tight space. Even if he technically did >!spit in his broster's mouth!<",
            " No, not Tooru reincarnated as a loli !\n\nWell, our newest Stand User isn’t 100% like Tooru, but she does seem to be in it for the long haul—all humans eventually die, but presumably she won’t? Long lived or immortal. Crap, maybe she’s Kars reincarnated into a loli. \n\nNice reminder that The Mattekudasai can only transform into one thing at a time, and the Smooth Operators/November Rain combo was awesome.",
            "The main villain is a child.\n\nIf that isn’t JoJo Bizarre idk what is",
            "We are back at a hospital too lol. All we need now is Tooru trying to get back together with Yasuho while Rai holds a conversation as he dies and it will be like part 8 never ended",
            "JoJolion has pursued us",
            "\"Somehow Toru returned.\"",
            "Unending pursuit of an endless calamity",
            "I hope beyond all that WOU will appear again",
            "I swore the guy looking at cameras was tooru for a second cause his back looked like the same clothes",
            "and then confuses it with ICU somehow",
            "Araki’s court mandated Wikipedia explanation strikes again",
            "I think Jodio is a fan of scrubs",
            "I was about to ask how does a 15 year old hoodrat know what an MRI is 😂",
            "Probably practiced the Scrubs dance before it was cool.",
            "Really good parallel with Part 5's \"resolve\", doing whatever it takes to get something done. Except instead of sacrificing themselves for a noble cause, unless something changes, uh... Things will get worse.",
            "Yeah compare this to Jotaro and Josuke who would just into action or vow to beat the crap outta the guy who did this to her. They take the opportunity to move that mechanism along",
            "I'm right in interpreting it that what happened is that they completed the document that meant that the land was seized by the state (it was the official's fingerprint smooth operators pulled over and pressed, right?) It's not theirs yet, but this is one obvious step in a chain of events that leading to them getting it (I think some folks in their first reactions assumed it was one of the gang's fingerprints they pulled onto the document verification thingie, thus transferring the land directly to them, but that doesn't make much sense, imo)",
            "There's something intriguing in the fact that the most proactive group of JoJo protagonists are also the most unscrupulous.",
            "I somewhat expect Sophie will survive, figure out what happened (with her Stand awakening around this time, with or without anti-Bags' Groove capabilities), and force Jodio's retinue to allow her to assist. An obverse Abbacchio? (i.e. both law and criminal, but more law-slanted during the part)\n\n(Assuming I recall things properly. And I wouldn't be surprised if Jodio et al. thought she was already dead.)",
            "That's some straight up gangster stuff and I LOVE IT. They're using Part 5's Resolve but for nefarious ends.",
            "Least deranged JoJo pose:",
            "Araki's monstrous anatomy is back BABYYY!!!",
            "the new style has really shown it's potential though in the last few chapters, like when they are jumping down the steps after getting the land deed it's really expressive, in just one image I can do the extra leg work to visualize what is being conveyed. Usagi as a character is drawn really animated like this.",
            "Knowing Araki, the pose is physically possible but incredibly painful to pull off.",
            "Reminds me of early My Hero Academia when Deku obliterates himself against the test robot.",
            "I thought it was Barbara-Ann",
            "Same, my heart actually dropped",
            "I thought the same last chapter when they were taking her to the hospital lol. Still hoping we'll get back to Holly and gappy",
            "With the way the hat guy was paneled while facing the security cams I was ready to shout \"ENDLESS CALAMITY!!!\" when they first showed her",
            "Thank you, give Mr. Bags his respect",
            "Fitting counter to what is essentially lovers 2",
            "Did it shrink? I though it just sent a single raindrop into his throat\n\nEDIT: OOPS MIXED ME STANDS UP",
            "SO is already really small so I think it fits without much issue",
            "\"THE SEQUENCE, DRAGONA, WHAT DOES IT MEAN?\"",
            "I'm imaging the \"Think, Mark, Think!\" Scene from Invincible 😭",
            "« Think Dragona, think! »",
            "And we got blessed with a few panel of Dragona thick thigh.",
            "This one is definitely turning into a meme in 20 years when it gets animated",
            "So Equivalent Exchange is back again...\n\nWonder if the Lava Rocks were ever host to the original Locacaca's roots.",
            "RemindMe! 5 years",
            ">  Something like Jodio finally becomes filthy rich like he wanted but at the price of losing dragona, someone Jodio would probably consider to be priceless\n\n\"This is the story of *one boy* becoming rich in the subtropical islands\"...\n\nWouldn't surprise me if we lost a load of people and had a part-5-esque scenario with side characters dropping like flies.",
            "honestly one death for 50 billions doesn't seem that bad",
            "Its only really 2 new characters no? Like the girl and investigator are obviously going to be important going forward but I doubt any of the others will show up again",
            "It really is a mirror to Golden Wind, which was essentially a long chase of fight after fight - which offset the slower more invesigation driven previous part (4/8)",
            "I think I'd trust them with computers more than the parts 1, 2 and 7 gangs, for... Obvious reasons",
            "They are so confident in their skills while being dumb as fuck, I love them",
            "If only they had a reliable girl on the team...",
            "But he's probably one too!",
            "Since the Rohan fight, I've been thinking that November Rain is basically just Star Platinum in rain form",
            "It’s highly possible they both are if the old man and the girl are both part of the group.",
            "Wait did we ever find out the deal with the stand cats?…",
            "I wouldn't be surprised if it's a whole crime family running the business which the little girl is part of",
            "HOOOOLY shit!!!! How did I NOT realise that!!! I'm a massive King Crimson fan and I'm only now getting what that's a reference to..\n\n\nMakes me think if Usagi could end up being a traitor, given he also has a King Crimson reference for his stand (and also makes me wonder when King Crimson is gonna show up)",
            "I was so sure it was just a slight change of Billie Jean",
            "Maybe he is also a stand user but his stand is more focused on close range combat",
            "Dragona is dying without a doubt.",
            "I love her weird-ass obsession with HulaNyan",
            "Usagona is gonna be Araki's redemption for ignoring Yasugap for most of part 8s run",
            "I swear to GOD if one dies I’m gonna lose it. I read this to escape the agony of JJK and Chainsaw Man and I can’t take it any more",
            "oh my goodness is this gonna be reverse jojolion?",
            "I'm wondering if that Howler Famlily is going to be the primary antagonist of this arc. Would be a nice contrast to Jojolion where the Higashikata family is primarly protagonists (aside from one or two) and in this one, a family is the main antagonist.",
            "*snorts coke*\n\nI BET HULANYAN IS A STAND USER RELATED TO THOSE CATS WITH THE WIRES",
            "I'd like to think he heard the legend of Milagro Man, and that he's making sure he doesn't get cursed by it",
            "So the final villain could be a 3 letter word. R.E.M. with the stand Losing My Religion? Or maybe just DIO",
            "WOU",
            "I still wonder if the JoDIO thing is intentional or not",
            "I would love a more offensive/defensive Milagro Man with a user",
            "In the final chapter of part 9 Jodio will look at the camera and say: \"Man, that was pretty absurd... Or maybe should I say Bizarre... JoJo's Bizarre Adventure by Hirohiko Araki!\"\n\nThe End",
            "I think the unintended consequences and sacrifices in the future for the lava rock will continue to get more and more ‘absurd’",
            "And the way the actual User of Bags' Groove speaks, I'll not be surprised to learn she's a Rock Human.",
            "No but seriously, SAME, for a split second I was like \"WHAT THE FUCK!? HOLLY!?\" and then I was immediately like \"No, no... I'm an idiot it's obviously that daughter from last chapter\" haha",
            "I hope we eventually find out what ends up happening with Holly",
            "Now he can have Jodio share cool facts about MRIs that Araki learned on Wikipedia",
            "I'm one of the 89 JJL fans, can confirm.",
            "We were in that hospital for years, I am not going back in, not again.",
            "I mean its only really 2 new characters that'll have any importance, I doubt we see the lawyers or security guard again.",
            "They're all grouped into either protagonists/antagonists/bystanders categories so it should be easy for us to follow on reread",
            "Probably a way to discover the land Howler's working with without tripping Bags' Groove again?",
            "To advance the Mechanism",
            "He does *look* rather Southern...",
            "Maybe Howler is only the first portion villains, like the Hitman Team, and the Lava Rocks and their font comprise the true villain???",
            "we do know that jodio specifically is going to come into immense wealth, and it was stated in this chapter that howler is using a front of conservatism so they could spin the perception in the way you are thinking. Though I don't think it'll be as out in the open you might be on to something, like they get double crossed (that is for sure in some way approaching)",
            "Company full of Stand Users will be wanting their land back.",
            "Imagine if the Mechanism goes through the whole part and they only get the land at the very end after a lot of people lost their lives because of it",
            "I'd forgotten what elation felt like and then I saw Jojo and Ippo both update this morning. (Worried about Mashiba though)",
            "Now you can have a shitty month",
            "The direct was honestly amazing, was just missing a certain pink puff to be perfect for me",
            "I love November Rain shooting a single drop of water lol",
            "Is the Lava Rock trying to turn Jodio into a king equivalent…? (Or for all we know, Dragona…)",
            "Maybe he’s a hol horse type that only likes to work as a duo and he’ll escape once she’s defeated. It could even mean her actual parent who might be part of Howler goes after him to mix things up.",
            "Jodio is going to finish what Johnny started and actually shoot a child",
            "I think she's a regular human with a trauma around someone close to her (like her mom) dying from a virus/sickness",
            "they are meta-gaming",
            "What do you mean?",
            "I cried when he said \"So this is it, these are the Lands- the JoJoLands\" and then Paco and Charmingman kissed as everyone else in the building clapped. Honestly, BEST Part!",
            "We still doing Morbius here?",
            "Jodio said, \"It's JoJolanding time\" and he actually, safely landed the JoJo plane. It only took 9 parts, but we got there.",
            "Bobby Jean is definitely going to be a long-term antagonist (not main maybe, but something long-term) I feel, he is giving off vibes that just screams \"BIG trouble\"\n\nWild Cat Size didn't actually get killed, btw- the chapter where Paco recognizes Charmingman as a good guy he states that he had seen that the \"cat heads\" in the bag were actually just potatoes that Charmingman used Big Mouth Strikes Again on to masquerade as cat heads. Charmingman did that to attempt to frighten the group so they'd give up the Lava Rock. For all we know they're still in that jungle.",
            "Cat Size were working for Charming Man though (and also didn't die)",
            "I think it's also leagues better than Jojolion since now they will be dealing with an entire company instead of a small (but powerful) gang ",
            "Goddamn it, Usagi...",
            "Humorously, nosebleeds can be caused by cancer complications. On-theme.\n\nIn any case, Sheer Heart Attack was automatic pursuit, and Echoes increasing its gravity *definitely* gave Yoshikage issues.\n\nEDIT: I’m having trouble corroborating, but I *think* Steely Dan got a nosebleed when Lovers was first wounded? If so, maybe we should check their discography for candidates for the User’s name.",
            "She mentioned specifically that \"one\" of hers was killed, so it seems to be a colony stand. Usually those are connected to the user, but one of them being destroyed is only minor damage to the user.",
            "Some are, some aren't. As everything, there are stands that break every rule.",
            "In the wise words of Viva Reverie:\n\n#(EXCEPT FOR WHEN THEY DON'T)",
            "Automatic Pursuit stands can be linked to the user, like with Sheer Heart Attack - Kira didn't ttake damage cause of how durable it is but Echoes using its ability on it affected him immediately. It just depends on the stand and user  - like Black Sabbath didn't affect Polpo presumably because its basically a shadow, but in this case the stand is clearly made of \"Stand meat\" so being hit hit the user\n\nIts also probably a colony stand which checks out with how it could hit multiple people at once",
            "Depends on the Stand. Jodio could be wrong, and it might just be an ordinary long-range colony Stand.\n\nOr Stand \"rules\" just don't matter.",
            "which panel was that?",
            "Dragona moved the fingerprint from somewhere else, too scan it and authorize the land confiscation.",
            "Fix your subreddit",
            "Probably not a Kars equivalent herself, and not because Touru already took that role. Bags' Groove just doesn't seem like Final Boss Stand material from here. If anything, her Stand seems redolent of Esidisi with his bloodvessel manipulation.",
            "There is no confirmation she's the main villain. Theres not even a huge indication she's anything more than the \"villain of the arc\" right now at the least or a powerful ally to Howler at most I'd say, if anything Bobby Jean is more suspicious on that front, and even him I doubt is the main baddy. They could DEFINITELY be important people, but main antagonist? The girl? Unlikely.",
            "I mean we can't tell if its the main villain or just a subordinate yet, it would be a bit weird to have a child incharge of a massive corporation",
            "Wait. The Congressman is 89 years old?\n\nI know I sound like a broken record, but... 89 years old?",
            "don't forget the 10 chapters of the main character sitting on a chair and being attacked by rock insects",
            "WOU appears and is even sassier than before.",
            "\"I'm bad with 3 letter acronyms. If it was 2 or 4 letter it'd be fine, but 3 is a bad number\"",
            "Not somehow, it was the rock.",
            "\"I wanna meet Scrubs \n\nOoh and I wanna meet black Scrubs!\"",
            "He watches Dr House clips on Youtube",
            "And how did a 17 highschool presumed drug addict know how to perform that \"whayever its name is\" procedure about putting a straw in the chest.",
            "like most other people, from watching TV hospital dramas",
            "Seeing Araki is taking inspiration from breaking bad it wouldn't surprise me to see our cast begin to decay",
            "Nah, it was congressman’s fingerprint.  Smooth Operators pulled one of his fingerprints from the edge of the device a moved it to the verification button.",
            "Sorry but I don't think her design is eccentric enough to be a main character",
            "She is already dead though. We see her heart monitor flatline.",
            "> Flashback to Josuke absolutely OBLITERATING his spine.",
            "The hat guys name is from a Bruce Springsteen song from 1984.",
            "MECHANISM",
            "OF COURSE! SEQUENCE IS PATTERN!",
            "MASON.  WHAT DO THE NUMBERS MEAN?",
            "Yeah it seems like Araki likes himself some equivalent exchange. Feels different enough though since the Lava rocks bends fate or whatever to ensure they get what they want instead of just a simple give and take the Locacaca had. \n\nI have a strong feeling this part will connect to part 8 unlike all the others parts so I could definitely see the lava rocks being used to explain the Locacaca plant like that",
            "Seeing as how the exchange phenomenon or the idea of good things going to one person and bad things going to another has been around in some form since the Corpse/Love Train in SBR I'm not surprised that something similar is returning in this part",
            "Well it is a rock - at some point in time it could've been a locacaca fossil that got melted and then spat out by the volcano\n\nActually wait, isnt Part 5 where we got the Stand Arrow asteroid thing as a justification for how they came about? I wonder if theres a connection. . .",
            "Lava Rocks just turn out to be this universe's Stand Arrow meteorite that actually came from space.",
            "Buried Saint’s Corpse parts created the Devil’s Palm, created the Wall Eyes, and maybe created these lava rocks and the original soil for the Locacaca too.",
            "It reminds me more of Hunter x Hunter too with Nanika",
            "We got like 4 name drops and new stand name. 2 characters from Howler and the congressman. I’m just surprised it all happened so soon.",
            "I could see Joseph getting it done by just pressing random buttons and it paying off.",
            "I mean, I feel like Jonathan could figure it out if the manual was nearby...",
            "Fair point.",
            "Joseph would manage it through the power of bullshit",
            "Yeah, his giant collar and weird target symbols on his hat make me think He's definitely one, too.",
            "November Rain feels like the culmination of close-range stands. Its main move is an AOE attack that destroys anything in a 3 meter radius from Jodio",
            "Instead of a barrage of close range fists it's a flurry of gravity raindrop things",
            "Family is a constant theme on Jojo and has taken different forms (the literal Jojo bloodline, how close knit every main group is, and the Jojolion huge emphasis on the Higashikata family), so a literal family being the main villain group here would be really dope!",
            "If King Crimson just never shows up and instead we get the SBR-verse version of fucking Rolling Stones or something i'll lose it",
            "{shoots a glance at Bobby Jean}",
            "it's understandable honestly. Beat is by far their most boring album to date, with only a few standout tracks.",
            "I have been wondering about that. Like, sure, it could be a coincidence, but it's an awfully weird coincidence, and Usagi just seems sorta... off. Like he's trying to play dumb and slipping up sometimes.",
            "Should we expect his Stand to be the same type as Charming Man’s? (I’ll wait to see who figures it out.)",
            "Imagine if they avoid copyright by renaming him Billie Jean with the plausible deniability that it's just a name that sounds similar to Bobby",
            "Same, would be a funny nod to how kenny G from Part 3 was localized into Billy Jean",
            "maybe he has a sister named billie jean",
            "Oh I’m *sure* he’s a stand user, no way peepaw is all dressed up for nothing.",
            "No, they're not! Don't put that juju on them!",
            "It is crazy how Yasugap was one of the highlights on JJL and one with tons of potential yet it ended up as one of its most underdeveloped aspects.",
            "He didn't ignore Yasugap. It just wasn't the #1 focus of the Part.\n\nBut it's still developed much more than a lot of the other *JoJo* MCs' relationships with their love interests.",
            "You read *Jojo's* to escape character deaths? I don't know what to say, man.",
            "Since it's Jojo I would be worried too but in part 8 the character deaths weren't as cruel, at least no protagonist died, so I hope Araki keeps that sentiment here",
            "I was genuinely worried for Dragona at the start there!",
            "good thinking! imo he's either already cursed, or like you say trying to avoid the curse by just not accepting money from people - or at the very least checking the serial numbers on the bills thoroughly before taking them.\n\nI feel like the cat figure itself has significance somehow too, but at this point I couldn't say _what_",
            "...Or it's just company policy.",
            "Welcome to GNN nightly news, DIO distributing AI automatas for use",
            "me too! I'd love if Dio was/is somehow involved in this story but I can't fathom how",
            "Jodio after becoming filthy rich and buying the island of Hawaii: I guess these truly are the JoJolands",
            "Jojo's Absurd Adventures",
            "Jojo's Absurd Journey by Rohan Kishibe.",
            "And Jodio might become increasingly more inclined to try and correct the \"absurdities\" that happen to ordinary people he might not necessarily know (like it looked like he felt almost prompted to upon seeing that Sophie lady in the hospital), consequences be damned, because he wants to act righteously (kinda like Buccellati) - a contrast to his initially more sociopathic behaviour.",
            "If we guess every new character is a rock human, we will be correct eventually.",
            "Assuming she actually is a kid and isn't a midget rock human, i wonder who her parents are?",
            "We know they exist, but we didn’t actually get a female character in JJL. Could be cool if females are set up as more ruthless than males and we get some in TJL.",
            "Either way, it's really important that we get those cool facts that Araki learned on Wikipedia.",
            "I'm sorry, 89?",
            "I'm talking about the cast as a whole, it's been 16 chapters and we already have five main characters and an entire organization of villians waiting to be introduced. \n\nIt's not that big of a deal, but it does break with the last two parts, where it seemed to me that Araki wanted to keep the core cast to a minimum.",
            "Maybe he is from *south* hawaii",
            "Last part the main villains were rock people named after mountains; it's only natural that this part's main villains will be actual rocks and mountains",
            "I think this is the most likely scenario",
            "Their on Hawaii, im sure the volcano will get involved somehow",
            "Yeah, it's possible, and since it's translated it's hard to read too much into the exact phrasing depending on the translator's choices/best interpretation.",
            "Pursuit and calamity. Also fishy stand users in hospitals",
            "Araki ain't pregnant but he keeps on delivering",
            "Why would we *stop* Morbing?",
            "I loved the part in r/StardustCrusaders when u/bluetoneamv said \"IT'S STILL DOING MORBIUS TIME!\" and still did Morbin' all over the JoJolands!",
            "In the end the real Lands were the JoJos we met along the way",
            "Maybe she's really ill and her stand keeps her alive by distributing her illnesses to victims that touch the pages",
            "Noted in another comment, but Jodio immediately spouting off about how \"automatic remote pursuit type stands\" work like a JoJo weeb was pretty funny, but also he's just guessing anyhow. Your guess sounds like it makes more sense, we definitely see that there are a multiple of these little guys.",
            "like page 7\n\n[usagi vision](https://imgur.com/gallery/XRiCblK)",
            "So it's still the politician's fingerprint, Smooth Operators just completed the signing process that was already going on?",
            "Itd be quite bizzare",
            "89 years of calamity. Calamity forever!",
            "49, maybe...\n\n...Knowing goroawase, it's going to be darkly humorous if he's 42.",
            "i'm so glad i didn't get into jojo until after jojolion was finished. all those chapters of buildup i can't imagine waiting for month by month 😭",
            "That was my favorite pokemon battle arc of jojolion",
            "It’s funny because in chapter 12 Charmingman also talks about how he gets 3 letter names mixed up",
            "Mistan't",
            "🔥🔥🔥✍️",
            "That's accurate to the average neurodivergent kid 😭 if idk where I'm going and I get lots of letters I get confused",
            "okay, that's actually a cool find",
            "Love the monkey paw ass situation it took to get to that, poor receptionist...",
            "Jodio, you've been hit by a stand that gives you an unknown disease, you need to receive mouse bites to cure the hygiene drug.",
            "i knew both of those at like 12, just from tv shows and shit",
            "To be fair, Usagi knows a lot of weird stuff! He has a real \"knows more than he lets on\" vibe",
            "I cant wait for chapters to open with breakfast cooking scenes. Pancakes",
            "That was my impression too! Plus it means there's going to be a bit of a three-sided conflict.",
            "Yeah, that's what I meant by \"the official\" (forgot if it was an actual Congressman). Some people's first impression was that it was one of the gang's fingerprints, thus signing the land over to them, but even in JoJo, that's not how things work. The guy with the authority to seize the land had to authenticate the document with his fingerprint, he basically had decided not to do it out of the fear of Howler... and then the gang went and completed the authorization for him (wonder how he'll try to explain that to Howler!)",
            "I thought the same of charming man and yet here we are",
            "She actually dresses really outlandish and serve when she’s not working",
            "Maybe she will get new clothes after leaving the hospital. Her dad is rich and powerful to afford her a new fit",
            "I missed that detail, although I don’t know if revitalization is possible within a short enough period of time. I also thought they meant Jodio et al. somehow called for her death, rather than the Lava Rock stealing her fortune ahead of schedule to open up access to Howler’s lands…",
            "This is Jojos Im sure if they get back to her before brain death sets in Araki will give her a clean bill of health. Plus their in a hospital, Im pretty sure they have equipment that can get her heart moving again",
            "SPEAK TO ME NOT OF THE DARKNESS.",
            "When the girl said \"all humans will die without exception\" it made me think she could be something non-human, ie a rock human. Doubt it, but it would be interesting if that's our first connection.",
            "We don't even know if they're from Howler. Bobby Jean is actively investigating against Howler, and the girl is still a complete mystery.",
            "Or simply using Hermit Purple to go inside it. I mean, he used it before to test if a video game console had been tampered with (despite apparently having never played a video game himself).",
            "Yeah since the groups already a five man unit right out of the gate it seems more likely to have some duos thrown at them even this early on",
            "exactly. Unless the theories about properties transference are true, this is all there is to NR. Which is fine really. I've realized by now that the novelty of JoJo's Stands is in how fast and precisely they can activate their abilities. Even a superpower as common as \"freezing\" becomes interesting when the user can create an invincible armor, freeze/unfreeze air to breathe and conjure perfectly placed ice shards to deflect bullets.",
            "\"You can't avoid the November Rain!\"",
            "Okay, but you know which Part 5 Stand returning would actually be a massive bombshell?\n\nPurple. Motherfucking. Haze.",
            "The lava rocks themselves honestly already feel like a different take on rolling stones. One fate rock kills you the other makes you filthy rich",
            "Alternate Universe Billy Jean (actual name Kenny G) strikes again with a illusion stand that gets beat in a few pages",
            "I may have not gotten the reference but that doesn’t mean I’m about to tolerate Beat slander",
            "No, it's the same type of Stand as Star Platinum.",
            "The moment you become a stand user you have to change all your sense of fashion",
            "I mean, if Part 9 is kinda similar to Part 5 with the morally mora than gray main cast and the JoJo referencing DIO and stuff, I feel like brining back 2-man teams works really well, we had a bunch of those in part 5.",
            "Did the other Jojo's even have canon love interests outside of the pairings that actually happened?",
            "Rai Mamezuku & Jobin Higashikata: Say sike right now.",
            "Cat figure is another stand user like the cats in the forest lmao",
            "Maybe Jodio's father is a descendant of Diego or one of his siblings",
            "My thought is that somehow their prior absurd situations were indirectly because of someone messing with the lava rock back when they were younger, and the primary mechanism is this concept of absurdity that is the cost of using the lava rocks",
            "I'm not sure about the agent she's with, though. I wouldn't be surprised if he's a Carbon Human. It would actually be interesting to see Howler be a knowing mix of Rock and Carbon.",
            "60% of the time, it works every time",
            "The mask, vampires, and the pillarmen were once key points that the series never returned too, so I am not sure why the fandom insists in them being a thing again. Specially since IMO they really don't add much to the series. Dunno if that is a hot take though.",
            "Probably a wasp or something",
            "...No way she'd know, but maybe the father's Poor Tom?",
            "without the context that you're talking about rock humans, this comment is very funny",
            "I know I sound like a broken record, but 89 years old?",
            "JoJolion introduced most of the Higashikatas almost all at once, but it took a while before each of them became relevant, especially Mitsuba who stayed as a background character.for years.",
            "Jojolion introduced most of the Higashikata family at once. Although in regards to just the main cast, part 9 is closer parts 3-6 with a larger main group than 7&8 which kinda just have the main duo (aside from Rai, but he only shows up late into the part)",
            "On one hand, I know you're joking, but on the other... what if the mountain IS alive?~",
            "Fair enough.",
            "SO TRUE. I can seriously feel Araki succeeding in making the true meaning and genius behind his stories come inside of me this Part deeper than other Parts!",
            "That bar goes hard",
            "Given that it can presumably stay inactive for quite some time, so long as no one not from Howler checks out the deed, I doubt that.\n\nI *did* have thoughts that she’s practically a Typhoid Mary, though, and is using a “core” Bags’ Groove to keep the diseases within her contained and harmless. The sub-Stands basically lie in wait on the deed to shuttle them to unauthorized readers.",
            "Yeah, he left before confirming it.\n\nSo they did it.",
            "What's 42 in goroawase?",
            "Man these guys are dumb as fuck.",
            "DIO foreshadowing going crazy",
            "I'm begining to think it's Araki who has trouble with acronyms",
            "This vexes me",
            "Seems like your profile pic gave that away instantly",
            "Charmingman was a stand user though and had some outlandish details especially with his face. Sophie is a background character that died.",
            "I also thought that, and their braids are kinda rock like so who knows!",
            "They most likely are cause why else would they set up their stand on the land deeds to attack the congressman who's going after Howler's daughter? And why investigate and want to kill people who only looked at the land deeds?\n\nI believe Bobby Lee is like a p.i or a police officer who's secretly hired by Howler to cover their tracks under the guise of investigating against them. Cause otherwise their actions make no sense.",
            "Beach Boy is just a very agile fishing rod.",
            "purple haze would be literally perfect here, given how much araki loves making people sick in the SBR verse as a representation of the greater concept of fate. literally since sbr we've had countless people get sick for the reason of gravity.\n\nimagine a purple haze that unlocked spin like killer queen did, to close the loop on \"fugo was meant to fight giorno.\"\n\nwe have the perfect setup here.",
            "dude Beat isn't BAD it's just weak compared to the rest of the Discipline-era records! ! ! and . . . the rest of all the records !",
            "I'm not sure Bobby Jean will be the Big Bad here. More likely Meryl (it would be too redolent of Diavolo, though; I see her as probably closer to Pericolo's role, even without suicide) or Charming Man's brother. (Or Jodio...)",
            "You can tell which video is The Matte Kudasai fake because the people in it look almost normal",
            "That's what happened with Abbacchio, Narancia, and Mista, after all.",
            "The pairings that actually happened are what I'm talking about. Part 1 had Jonathan & Erina; Part 2 had Joseph & Suzi Q; and Part 6 had Jolyne & Anasui.\n\nBut most of those pairings were arguably super last-minute (and, in Parts 1 and 2's cases, felt somewhat forced for the sake of giving us a new JoJo, instead of feeling like a natural union) or never given the amount of focus necessary for the audience to really care about them.\n\nIn contrast, Josuke and Yasuho actually *felt* like not only friends, but proper boyfriend and girlfriend - or, at least, friends who we could vividly see becoming a couple.\n\n**EDIT:** Heck, even Koichi and Yukako in Part 4 showed more chemistry than Joseph and Suzi Q!",
            "And Kei",
            "but both apparead a bit later into the part, and even tho I really like Jobin and was sad that he died (very sad that daddy higashitaka died too), I would've been devasted if Yasuho or Gappy died, wich is what I would feel if any our main group would die in Jojolands",
            "Or maybe its pointing to camera man being the cat user?",
            "I don't think Diego had any siblings or kids, but then again Araki could pull his classic \"this guy had a child who was born before the events of this part and either he had no idea or it was never mentioned\" move. like throw in a \"Diego had a fling with one of his fangirls and she kept the child a secret\" and boom secret lineage",
            "That's a plausible theory too.",
            "In the end it turns out, every character except for Jodio and Dragona are Rock humans",
            "Probably because the rock shadow biosphere was written to be always hiding in plain sight, to appear at anytime. The stone mask and pillar men were destroyed or functionally extinct by part 2's end",
            "So that's where all the Rock Women went, Poor Tom was rizzing them all up",
            "Or she's poor toms mom",
            "So sad we got no women in jojolion",
            "We had no women in Jojolion only queens",
            "And some of them basically *never* became relevant (e.g. both Daiya and Hato, who were only important for one arc respectively - the former being *very* early on - before fading into the background again).",
            "*what if all of hawaii is a stand??*",
            "Thank you!",
            "4 = shi\n\n2 = ni\n\nShini = to die",
            "Well, they are just kids!  \nAnd not really studious.  \nOne is a junkie.",
            "This is easily the least competent joestar group thus far and I love it.",
            "ironically i didnt watch house until fairly recently. due to memes",
            "they could have set the trap thinking someone from howler would be the next person to look at the land deed and trigger it. It just so happens that it was our crew who got to it first",
            "I'm kinda hoping the trap was set up for Howler, not to protect them. It would be quite new to JoJo's to have this threeway crime drama dynamic with two rival gangs and the police / detective trying to stop them both.",
            "Oh. Oh my, This HAS to happen. And it has to be a dramatic standoff on par with Part 7.",
            "Don't forget Anasui",
            "Joseph and Suzi Q IIRC was somewhat set up earlier, but I agree it wasn't given that much focus. Also does Jolyne and Anasui really count?",
            "Norisuke didn't die",
            "Daddy Higashikata didn't die, but Mummy Higashikata did.",
            "Diego did have other siblings, that's why his dad threw him in the river because they coulnd't feed another mouth",
            "No, Usagi's not\n\nA junkie, he's cool as fuck\n\nGive him some respect",
            "Somehow less competent than a dude that was born yesterday",
            "I like that it's a lot more realistic that way. The previous universe Joestar bloodline consisted full of tactical geniuses, physically competent martial artists, while this bloodline's just sociopathic dummies",
            "Same here haha",
            "But they show to not really care that they ensnared innocent people alongside the two chapters effectively confirming that Howler involved the daughter to make the Congressman suffer. It only makes sense these are Howler chars.",
            "Exactly what I'm thinking",
            "halfway point like kira and damo *mwah*",
            "Oh yeah, him too.\n\nIt's so funny seeing him wearing seemingly ordinary civilian clothes in the flashback to when he murdered his girlfriend, then cut back to the present and he looks like a San Francisco stripper.",
            "Jolyne and Anasui only counts because we saw a resolution of sorts (albeit pretty rushed and entirely one-sided on Anasui's part until the end) to their pairing in the form of \"Irene\" and \"Anakis\" in the world Emporio appears in after defeating Pucci.\n\nI personally don't like the pairing, and Anasui does *not* deserve her, but it still counts. We just don't know if they actually had a kid, is all.",
            "I don't see any mention of siblings in his backstory in the mamga or on the wiki or anything, where does it say he has siblings?? :0 the manga seems to imply that they couldn't afford any children at all, and could just have some further down the line when they were in a better situation",
            "Regarding high guy, \n\nI must side with Charmingman. \n\nBut I do like him!",
            "-trigger happy gunman\n-amnesiac idiot\n-psychopathic drugrunner",
            "Even Charming Man\n\nSaid that he may have been wrong.\n\nYou should learn from him.",
            "Though you make good points, \n\nJunkie is as junkie does. \n\nTrust will be betrayed."
        ]
    },
    "Which MILF do you prefer the most?!?!": {
        "title": "Which MILF do you prefer the most?!?!",
        "score": 253,
        "url": "https://i.redd.it/p8jgz072a28d1.jpeg",
        "content": "",
        "num_comments": 101,
        "comments": [
            "Where is bucciarati in this ?",
            "Lisa Lisa and Tomoko man",
            "Lisa Lisa",
            "call me crazy but holy’s where its at",
            "Shinobu honestly and I don’t even know why",
            "Suzi Q where?",
            "My ranking starts from Lisa Lisa and goes counterclockwise",
            "Shinobu",
            "Tomoko ![img](emote|t5_2tny5|49675)",
            "These are all very funny ways of drawing Speedwagon 4 times.",
            "Holly is pretty much the closest the Joestar bloodline ever got to another Jonathan in terms of pure kindness",
            "Shinobu in a heartbeat.",
            "I'm related to most of them-",
            "Tomoko my beloved",
            "Kakyoin is dying of an orgasm",
            "Oh dont make me choose… probably lisa lisa, but all of them are so good…",
            "Holy. I'll make up for the lost time her husband hasn't been here.",
            "Lisa Lisa could get me on my knees and barking",
            "Holy shito",
            "I think we all know where this is going so I'm just going to skip to the chase:\n\n#SPEEDWAGON",
            "Kaato Higashikata clears",
            "Joseph Joestar",
            "Jotaro’s mom",
            "Shinobu that’s who  I would pick personally",
            "Shinobu",
            "Lisa lisa, but i gotta stick with tomoko man",
            "Lisa lisa or shinobu",
            "Lisa Lisa >>>>",
            "Lisa Lisa",
            "Kaato tbh (i love all 4 of those presented in the post)",
            "Lisa Lisa of course",
            "Holly",
            "Lisa lisa",
            "Yes",
            "Speedwagon",
            "Lisa Lisa",
            "Lisa lisa and tequila joseph",
            "Speedwagon",
            "Yes",
            "Were Is speedwagon 😳😒",
            "Lisa Lisa and Tomoko",
            "Speedwagon",
            "Hayato’s mom (i fogor her name)",
            "Lisa Lisa and I will keep praying the franchise does more with her.",
            "I want Tomoko to crush my balls.",
            "Ain’t no Anime woman is prettier than Lisa Lisa ! Change my mind ☕️",
            "Enya",
            "Once again, I praise Araki for giving us so many MILFs 😮‍💨 Lisa Lisa’s number one but best MILF has to be Kaato (given that she’s like a MILFsquared, since she’s the only one with a grandchild during her part).",
            "None as they are drawings. They are lines and colour on a screen buddy. Pre weird buddy",
            "I prefer Bruno Bucciarti because he is best mom",
            "Hey you scared me! I almost thought I was following shitpostcrusaders",
            "I see no Speedwagon, Unacceptable",
            "Erina the GILF /j",
            "All milfs are good!",
            "Bucciarati",
            "Speedwagon.",
            "Tomoko’s the only right option. (I’m a simp)",
            "No speedwagon??during pride month??",
            "Lisa Lisa and Tomoko",
            "How many times do I have to say this! ******E R I N A******",
            "whats a milf",
            "I dont remember the red hair woman. Who is she agen?",
            "It would’ve been hard for people to choose! If I included him on the list🥲",
            "He may be Part 5's best Girl but he never gave birth to a JoJo.",
            "On skibidi🙏",
            "No no i agree. She's so adorable and obviously her son loves her very much so she must be a great mom.",
            "same, because sometimes, an average woman who wants a quiet life could be the most attractive person (also that she's just hot)",
            "shut up, joseph likes Lisa lisa",
            "That would be GILF",
            "Flair checks out (same)",
            "The only correct answer.",
            "There was this comic where Jonathan facepalms at all his descendants except holy and they get ice cream together",
            "Ironically enough it's probably from suzi q's side aswell",
            "Easy there, Kira.",
            "Oh hello there Josuke!",
            "Too soon...",
            "Mother\nI'd\nLike to\nFuck   (It's an acronym)",
            "A MILF Is a sexually attractive woman who has children or is in early middle age.",
            "Shinobu! Hayoto’s Mom",
            "Nah that would make it way easier",
            "![gif](emote|free_emotes_pack|facepalm)",
            "What the sigma?",
            "…",
            "facts brother",
            "Old Suzi Q 😎",
            "Realistically he’d still love all his descendants for still having a good heart in spite of their flaws, but he probably would get along with Holly more than most given she’s also very gentle and driven by kindness",
            "Makes sense, she was also a very kind hearted woman so it’s no wonder Holly turned out so well",
            "what the hell\n\nyall are weird",
            "attractive? i guess lisa lisa",
            "Ou.. the one who killed the cat!",
            "that would've made it easier, but c'mon man that would be too biased.\n\nwe want a fair competition here, if we add Bucciarati, we would also have to add Speedwagon to even things up, but then these 4 won't even stand a chance",
            "Way too easy ther way.",
            "Dear jojo fans...\n\nit's our duty to downvote this traitor's comment",
            "Yup! But I thought Kira was the one who killed the Cat??",
            "uhhhhh\n\nyoull never arrive at the -1 upvote mark\n\nthis is the power of requiemmmm",
            "Nope.  Kira just taked in the cat. The woman killed the cat.",
            "ha! i did my best with a racist comment in a lgbt community with -1203votes and got banned permanently",
            "Ohhh okay, I understand now.Its been a long ass time since I’ve last watched DIU so my memory isn’t that great!",
            "we both got downvoted lol",
            "I only remembered thet she killed the cat when you said who she is. I only wached DIU like a year ago. I just finished part 6 at the end of 2023 summer.",
            "lol"
        ]
    },
    "If Star platinum was still as strong and accurate/precise as part 3, then why can't he throw a particularly huge rock Ratt's location?": {
        "title": "If Star platinum was still as strong and accurate/precise as part 3, then why can't he throw a particularly huge rock Ratt's location?",
        "score": 242,
        "url": "https://i.redd.it/joe59147a28d1.png",
        "content": "It would only make sense that Jotaro already knew its position. Even if jotaro didn't know Ratt's precise location, he knew it was somewhere between those 2 identical looking rocks, and we've already seen jotaro defeat an enemy because of 2 oddly shaped looking rocks. So, couldn't he just have star platinum chuck a Boulder at its position like an artillery strike?",
        "num_comments": 39,
        "comments": [
            "Jotaro didn't know it's location tho. Why else would he be asking Josuke if he found it yet? You can't punch away Ratt's dart without poisoning yourself so bringing out your stand is just expanding your hit box.",
            "Because he was training josuke",
            "Because Araki instead wrote the fight around Josuke needing to deal the finishing blow instead of Jotaro. Besides a big boulder would make Jotaro incredibly vulnerable since Star Platinum is too busy lifting it to defend itself.",
            "If Jotaro did that, I guarantee you Araki would write it that the rat dodged it or something. If a bullet going at incredible speeds struggles to hit a rat, than I doubt a large boulder would fare better.",
            "because the two rocks Ratt was between would stop the boulder from landing directly on top of it duh",
            "Because that's not the point of the arc; it's not the story Araki wants to tell. Jotaro (and Araki) was giving Josuke his time to shine.\n\nIf JoJo was just about killing the enemy as quick as possible it wouldn't be nearly as good. You're missing the forest for the trees.",
            "More importantly, why didn't he bring something from house to use as improvised shield? Earlier Crazy Diamond blocked a shot from another rat with frying pan.",
            "Because then we wouldn't have Josuke's cool fucking homing projectile in the final battle)",
            "Actually, Jotaro could have dealt the finishing blow to Ratt even easier than Josuke, but he just let Josuke do it because he was trying to mentor him",
            "I think the point of the rat fight was jotaro training up josuke, making sure he was capable for future fights as much as possible. He could have just crushed the rat, but then the next time josuke was in a bind he'd have to come solve that one too, and so on and so on",
            "He could, but Jotaro had to teach Josuke for when he himself isn't around.",
            "This is slander, there were 2 rats",
            "... imagine me this: if a middle age person Fights a invisible sniper, who would win?",
            "T-two identical rocks you say?",
            "Jotaro was training Josuke, killing the rat immediately would make the whole thing pointless.\nHe wasn't expecting the rats to be as smart as they were.\nAfter the first one connected, he specifically let himself get hit because he trusted Josuke to deal with the rat and heal him.",
            "He wanted to prepare Josuke as Morioh's future protector.",
            "He was mentally preparing Josuke for any future danger as \"Stand Users attract Stand Users\"",
            "Real",
            "Star Platinum is the same stand that could look in the background details of a 140p photo and still perfectly see what was there",
            "He doesn't know it's precise location, but he could already pinpoint its general position because the clearly visible bullet trail. Also, what's stopping jotaro from throwing the rock while out of its range or in cover? He threw iggy through the desert so hard that it caused a huge trail behind iggy to appear. So, Maybe he does not need a huge Boulder. He just needs an iggy-sized one.",
            "But I feel like he's already proved himself when he defeated akira otoshi",
            "sniping's a good job, mate",
            "and it's totally accurate because rats are like cockroaches.... it has to be a realy big boulder",
            "True, but that wouldnt have helped since the rat is smart and it's bullets ricochet",
            "How TF is 30 middle aged?",
            "Kinda ironic considering your flair",
            "The only time they were out of range they didn't know where it was, hence why Jotaro was playing bait to begin with. At that point, there's nowhere to take cover.",
            "Its a small rat and they didn't want to risk it running away if the first shot missed it.",
            "Bullet trails not a thing, bullet direction however",
            "Yeah, but Jotaro wanted to make sure that Josuke wouldn't need to rely on timestop or star platinum since most villains who knew about Star platinum waited for Jotaro to be out of the scene so Jotaro needed to be sure Josuke could handle himself",
            "Challenging work. Outta doors.",
            "Happy cake day",
            "I mean, for jotaro it was middle age (because he dies like 12 years later)",
            "it's about the totally \"\"\"\"\"scrapped\"\"\"\"\" time travel theory",
            "The real question is why he didn't carry a Road Roller to that place in advance. Then chuck the Road Roller in the general area of the rat, thus killing it without knowing precise location.\n\nEquivalent of dropping a nuke in an area to take out Air Defences, whilst not knowing the exact location of the ADs to enable precision strikes. Law of Overkill. \n\nAnd no, I'm not being serious.",
            "I guarantee you wont go hungry",
            "Cuz at the end of the day, as long as there's two people left on the planet",
            "Someone is gonna want someone dead",
            "r/UnexpectedTF2"
        ]
    },
    "can someone please tell me what this is (from opening \"heaven's falling down\")": {
        "title": "can someone please tell me what this is (from opening \"heaven's falling down\")",
        "score": 1349,
        "url": "https://i.redd.it/10lduycq1z7d1.png",
        "content": "",
        "num_comments": 136,
        "comments": [
            "I guess this jsut explains that most people weren't in hospital to just guess what this can be.\n\nBasically, isnce Jotaro is not functional, yet his body still kinda functions. This tube connects to lower intestine to take all that his organs produce. Because otherwise he'd piss and shit himself.",
            "How about the ones that aren't even connected to anything lmao",
            "Cock protecter",
            "It's genuinely the stupidest panel in the whole series. They literally said Jotaro by that point could already understand ~~20~~ 30 words and shower by himself among other tasks.",
            "He need it to pee. \nAnd they just made it so it was exactly on his proper canon d*ck size because jojo needs to out-gay itself constantly to survive.",
            "Food tube",
            "THE MEGA CATHETER",
            "cock holder. it has to be that large to hold it. it's fucking gigantic",
            "An enemy stand with the ability to steal semen",
            "I swear this looks almost AI generated with how jank it appears.",
            "They also had to leave his hat on because it’s his hair",
            "Jotaro is the ultimate sigma chad male. As such he needs costant sexual stimmuli, the Speedwagon foundation vowed to take care of the Joestars in every way possible and they cannot allow the ultimate Joestar chad to lose his bodily functions especially such an important one to decay from a long period coma and that's what that device is for, especially designed for his gargantuan monster cock",
            "Bro thinks he's Mr house",
            "Ornamental cod piece.",
            "COCK PLATINUM!",
            "MONSTER catheder for his MAGNUM dong",
            "Dick support",
            "i goes behind him if you look closer so i probably think its just so he doesnt piss and shit himself",
            "Penis pump Jotaro",
            "Wondering when we'll get this post again",
            "i was literally thinking about this today",
            "Penis Vacuum",
            "Metal cock",
            "He was kind of in a coma at this point so obviously that is for him to piss",
            "It's basically so Jotaro can pee while he's unconscious, because otherwise you'll be seeing pee stain.",
            "I have no clue what it does but he has a massive shlong",
            "cock enlargment chamber",
            "most likely meant to either shuttle waste out of his body or to provide him with proper nutrients while in his coma\n\nbut cock protector is the funnier answer",
            "Jotaro’s packing an absolutely massive hawg, good lord",
            "Penis pump jotaro",
            "Jotaro Joestar (Penis Pump Varient)",
            "Chastity belt",
            "Why does he have a cock sucking machine",
            "Cock tube",
            "metal dick tube",
            "Ejaculator, the B plan for extending the blood line",
            "That's just his dick. It just looks like that.",
            "Big metal dick",
            "the more you look at this panel the funnier it gets",
            "Ita a penis pump\n\nJoestars need to girthmaxx at all times",
            "***SUCK***",
            "The more I look at this, the more it mess up with my mind",
            "Reminds me of \n\nhttps://i.imgur.com/95hkreY.jpeg",
            "Wasn't this panel after he could do so much 😭😭",
            "Days without someone asking what’s on Jotaro’s junk in Stone Ocean OP 2: 0",
            "They had to put his whole horse in a tube to keep him from boning the nurse",
            "Man whatever you say, Jotaro looks huge in that picture, looks even bigger than part 3 Jotaro to me, if you focus on his shoulders and neck",
            "Preparations to become a BIG SHOT",
            "The Gwak 200",
            "Bc his heaven's falling down",
            "S I L V E R  S T I F F I E",
            "evacuate poopoo",
            "It need to be cared since it is *Dady's-* I mean... ohm! I mean it is Jotaro's important part.",
            "it's in his abdomen, possibly to put food straight into the stomach.",
            "Cock tube",
            "Катетер",
            "Cock Platinum",
            "Shmeat unfortunately",
            "Well the look of it kinda makes me think it's a human waste bypass",
            "It’s the cum extractor",
            "Back again with our monthly jotaro cock tube question",
            "The cock sheathe",
            "It’s the auto suck machine",
            "Penis pump",
            "orgasm machine",
            "Let the Speedwagon foundation cook",
            "Protect his 15 inch cock",
            "It's to suck out his man juice so they can clone him if he ends up dying.",
            "without Star Platinum, his dick powers needs to be contained.",
            "Condom",
            "Tis but a mere demonstration of the mighty Joestar cock",
            "A blowjob device",
            "Milking machine",
            "Is this called an ostomy pouch or ostomy bag?",
            "Yeah I always thought it was like a piss tube or sum",
            "I dont understand how people cant realize this for themselves like its not hard",
            "As a brother to a nurse who works in the ICU, you are very, very wrong. No one is getting a tube that connects to their upper or lower intestine *unless* they have a very, very good reason for it. They would get a catheter, but that's in the wrong position for it. He wouldn't piss himself, but he would be shitting himself. And from what I hear, it's about the consistency of a thick gravy.",
            "Nah it’s just suckin his coc-",
            "Probably some vibrators",
            "Bro's medical equipment is AI generated.",
            "Watch it become a legit thing in the future and we are saying Araki called it.",
            "Those are actually electric signal transmitters which occasionally sends electrical signals to exercise Jotaro's body and keep him physically well during his coma",
            "bluetooth",
            "Getbout of my head",
            "Jotaro 🤝 Weather Report\n\nWearing cock protectors",
            "More like cocksucker",
            "Jotaro just is that guy, he's a chuck norris meme)",
            "Did they really state that?",
            "why does that make this scene stupid? Even if he can take a show and learn words, that doesn't mean he's relearned how to eat, it's even said he doesn't know how to use a knife and fork",
            "This just in, having a big penis is gay",
            "the thang hungry for more too🤑",
            "Like this is funny but this is also JoJos and if someone today told me this was an actual stand ability I wouldn’t even doubt it lol",
            "Literally me",
            "also he got mad when somebody took his hat",
            "after looking through the part 6 posts it appears to happen abt every 3 months",
            "Why is the chastity so damn big",
            "Colostomy* unless im stupid and they are two diffrent things",
            "Well, it doesn't look like the real thing tbh. Araki made it look like something out of a spacecraft for speedwagon points.",
            "I was about to say that",
            "I dont know what to THINK anymore man!",
            "Get outta my head man! Get outta my head! Get outta my head man!",
            "Yes they did",
            "The whole setup is just utter nonsense. Like the electrodes on his clothes too. Also there's much less invasive ways to administer nutrients, like a feeding tube or IV. To me it's more reasonable to conclude that Araki wasn't familliar with what he was drawing in this instance or invoked his artistic license instead of trying to force a canon explanation.",
            "Worst way to find out I’m straight",
            "*heavy British accent*\n\nFELLAS, is it gay to be a man??",
            "Just found out😔I’m brocken 💔",
            "I mean duh? Why are you, as a man, carrying around such a big dick? Do you like big dicks or soemthing? Kinda sus bro",
            "BBC …..news",
            "And so am I. I mean, it is Jotaro, can you blame me?",
            "Highway Star exists?",
            "a colostomy is a type of ostomy. the other two kinds are ileostomy and urostomy",
            "When is this said? Because iirc the only time they show Jotaro in the hospital after he gets his stand disk back he's unable to do anything aside from Star Platinum instinctively attacking anyone who comes close.",
            "to be fair, it's JoJo, I'd put this on the same level of stupid as Josuke's spine snap pose",
            "What's considered big?",
            "Underrated comment",
            "I read this in a Scottish accent",
            "I read this in Jonathan's voice, but can almost imagine Speedwagon saying this in defense of something Jonathan is doing that in-universe people don't understand.",
            "i meannnn..........",
            "Thx",
            "In the manga it's stated all over this chapter, same for the anime",
            "5+ inches",
            "5.17 inches erect",
            "it **does** take the life force out of you through feet",
            "Which chapter?",
            "Yes!\n\nWait. Hard or soft?",
            "very specific number you got there",
            "Guess my dick is big",
            "75",
            "Hard, clearly.",
            "Was curious so I googled it",
            "Doubt",
            "Phew",
            "6 inches",
            "Proof or it didn’t happen",
            " My name is Yoshikage Kira. I'm 33 years old. My house is in the northeast section of Morioh, where all the villas are, and I am not married. I work as an employee for the Kame Yu department stores, and I get home every day by 8 PM at the latest. I don't smoke, but I occasionally drink. I'm in bed by 11 PM, and make sure I get eight hours of sleep, no matter what. After having a glass of warm milk and doing about twenty minutes of stretches before going to bed, I usually have no problems sleeping until morning. Just like a baby, I wake up without any fatigue or stress in the morning. When fully erect, my penis is 6 inches long. I was told there were no issues at my last check-up. I'm trying to explain that I'm a person who wishes to live a very quiet life. I take care not to trouble myself with any enemies, like winning and losing, that would cause me to lose sleep at night. That is how I deal with society, and I know that is what brings me happiness. Although, if I were to fight I wouldn't lose to anyone."
        ]
    },
    "If you could make one thing canon in JoJo, what would it be?": {
        "title": "If you could make one thing canon in JoJo, what would it be?",
        "score": 1202,
        "url": "https://i.redd.it/akzwbmha1z7d1.jpeg",
        "content": "",
        "num_comments": 468,
        "comments": [
            "Giorno and Mista stopped at Disney World Orlando on their way to cape Canaveral and that’s why they don’t make it in time to stop Pucci.",
            "Crazy Diamond being unnable to heal Josuke is actually a phisicological limitation due to Josukes strong sense of self, refusing to change the way he is. And that once he accept change, crazy diamond will be able to use his reconstruct ability on him.",
            "Alessi making Joseph younger In part 3 inadvertently making him stronger. Even just for a moment. Would've been great.",
            "Emporio's cry scene at the end of Stone Ocean causes it to >!rain because he still has Weather Report's disc inside of him.!<",
            "Part 7 Spoilers: >!Hot Pants doesn't die. She just retreats to tend to her wounds and couldn't catch up with everyone because I am still salty about her death.!<",
            "Bucciarati being relative to zepelli’s cause I’m kinda mad that there isn’t even a mention to zepelli family in the part being set in Italy",
            "Chariot requiem was heading towards to Jotaro",
            ">!The In a Silent Way encounter was actually Sandman from another universe!<",
            "Just one thing? I guess I’d go with Purple Haze Feedback.",
            "Diavolos deaths are actually his soul being send to the body of his counterparts in other universes a moment before their natural deaths by fate would occur.",
            "The guy that saved baby Josuke was Kosaku Kawajiri",
            "Kakyoin lives. Nothing more, nothing less.",
            "FF also gets to live and be with the gang at the end of Part 6",
            "Joshu after becoming an adult stops being a bum, shaves his head, becomes a badass, and any second now he will appear in Jojolands.",
            "All of the abofe",
            "Hayato has a stand sometime in the future",
            "the anime's colour shifts are diegetic, and the side effect of being able to see stands",
            "F.F did in fact cross-over into the Ireneverse and simply became one of Irene's childhood friends",
            "Funny Funnier & And Funniest Valentine LoL ……..",
            "The speedwagon foundation takes in street thugs and turns their lives around by hiring them and giving them a steady job.",
            "DIO going to heaven and being beaten up by the ghosts of Danny and Jonathan until he falls to hell.",
            "Mista did, in fact, give Giorno a blowjob.",
            "Kars and Esidisi were banging",
            ">! The Head Doctor’s name is Kosaku Kawajiri!<",
            "Part 7 >!I want Soundman to be an Au version of Sandman!< I really like that theory so I’d be down for it to be canon.",
            "Ryoko Kakyoin exists regardless of the events of the spinoff being canon or not",
            "Diego x Hot pants",
            "Old man Joseph only pretends to be insanse, he uses hamon anti/aging technique when no one is looking to ~~cheat on Susie Q~~ to awesome and cool stuff",
            "Joestar stands are meant to be vine-based, but Dio’s insertion of himself into the bloodline influenced their stands to become humanoid like The World. \n\nThat’s why SP and The World are the same and why CD looks so similar to The World.",
            "Dead Man's Questions.",
            "Jojo's bizzare married life",
            "DIO is weak to garlic.",
            "That thing where alternate Jotaro still goes through stardust crusaders and DIU without a stand and still comes out on top",
            "Lisa Lisa is still alive by the end of Part 6 and looks exactly the same.",
            "Jonathan Joestar has a cannon. He doesn’t use it, he just has one",
            "A part where shizuka joestar is the jojo",
            "Me and Jotaro. \n\nAlso, Avdol didn’t die, he got transported in some awakened location. Polnareff got healed by Josuke.\n\nPucci got his ass whooped. Idc, idc Jolyne deserved to get her hands on that hoe.\n\nHayato and his mom heals from the Kira trauma",
            "Abbacchio and bucciarati kisses whenever they're offscreen.",
            "If it's a minor hc/doesn't change much if it's canon, I'd pick the theory that Silver Chariot Requiem was looking for Jotaro, it's canon in my heart \n\nBUT if I just wanna fuck about with canon for a bit: the wedding rings of death create emotional links. It could be part of why Joseph and Esidisi understand each other's plans when they fight, it could be part of why Wammu feels bad for Caesar, and it could be part of why Joseph and Wammu learned to understand and respect each other despite having such different outlooks on fighting",
            "Eyes of Heaven endings",
            "Fuck it, Metamorphosis's Josuke ending",
            "I personally think part five would be more interesting if Diavolo was also a child (or some sort of descendant) of Dio, and if they were just born into two different circumstances, to compare, and contrast each other.\n\nIt could fit that Michael versus Lucifer archetype that’s  barely seen, like Lucifer trying to become more stronger than God himself, and being cast down for it. Diavolo already has the pride for it, understandably since king crimson is on par comparable to the world in capability and in someways surpasses it in it’s own merits with epitaph.\n\nThen I think it would’ve been more interesting of course if Giorno ever got to see his other brothers from part six.",
            "Dio’s modern stand name is Holy Diver",
            "the guy that made polnareff younger uses his stand on joseph, and the whole gang gets to see how cool young joseph is",
            "Part 7 spoilers: >! Our Diego is actually still alive, and the one that died was from another world. Hot Pants is still alive, and our Diego tends to her wounds, and they both run off and live a nice happy long life with each other and grow a nice family!<",
            "Funny Valentine exists in the og universe, and that specific Valentine is one of the presidents we see being brought into the SBRverse",
            "Dio Over Heaven. Solely for powerscaling purposes",
            "Irene remembers what Jolyne experienced",
            "i made a small headcanon where Funny V kills off Sandman and replaces him with an alternate version who is loyal to him and fights Johnny and Gyro. it would be awesome if it was canon",
            "Polnareff land being built",
            "Just a scene of giorno josuke and Joseph reacting to the time speed up in part 6",
            "Gyro and Johnny get married",
            "Honestly, it's sorta implied enough. It changes nothing in canon. And I think it would be cool rep if it was ever confirmed.\n\nBeedly Bee, Biddly Bay! Speedwagon is now gay.",
            "Emporio finds a way to restore the memories of the gang",
            "Star Platinum is Jonathan’s reincarnation. Does it make sense? Fuck no. Goes hard though.",
            "Eye of Heaven's ending.",
            "~~Certain stands are now STDs~~\n\nIdk",
            "kakyoin is alive in part 4",
            "Jonny x gyro",
            "that avdol could have been much stonger like in the ova, but held back for the fight against dio",
            "Josuke, Jolyne and Giorno are best pals and they hangout all the time.",
            "Purple haze feedback",
            "Ik it’ll make people mad, but the idea that Jonathan was reincarnated as star platinum was a really interesting concept",
            "That in the Ireneverse, Passione found out about Ungalo, Rikiel, and Donatello soon after Giorno’s takeover, tracked them down, and gave them spots in the hierarchy. I mean, they no longer have reason to be pulled towards Pucci.\n\n>!also Kakyoin drinks cherry coke you can not tell me otherwise!<",
            "One of Diavolo's death in the loop was Fugo and Purple Haze infecting him and beating his ass up for Narancia and Bruno",
            "Jonathan stand is The World and DIO stand is The Passion",
            "Josuke being Joseph's plan B",
            "Whoever ends up becoming the mail villain of the current part was the cause of COVID",
            "A minor one, but just that all spinoff media is considered canon to the extent that across infinite timelines, anything is possible. I get that that’s pretty much how it already is, but I just wish there was more discussion on things like Jorge Joestar and Clamp in Wonderland without people immediately shooting it down because it goes against canon.",
            "jouta.",
            "Kakoyin drives Jolyne to school",
            "Eyes of heaven's ending",
            "They can draw dogs properly",
            "This is super random, but can Fugo have strawberry earrings 🍓",
            "The Jorge Joestar novel. Fuck it all the novels. They should all get animated too. Especially purple haze feedback. Fugo best boi",
            "Smokey having a Stand",
            "Diavolo was the gangster who Giorno saved",
            "The identity of flashback man",
            "Meryl mei qi is the child of obese funny valentine, and scarlet.",
            "kakyoin is in part 4 as an equally important character as jotaro is",
            "I couldn't choose so either hol horse joined the stardust crusaders or FF living",
            "the beetle arrow being the requiem arrow",
            "Stroheim was killed by a Russian stand user.",
            "Part 7 spoilers >! Soundman be an actual alternative version of Sandman and both were swapped,  this would explain the plot holes. And in the end, Sandman wins the steel ball run in the soundman universe !<",
            "I'd make 7th Stand User a canonical alternate universe, doing different \"mini manga\" for the various timelines",
            "Echoes act III can do way more than 3 freeze but koichi is bad at english",
            "Giorno in part 6",
            "Diavolo managed to escape GER however just at the moment Made in Heaven was acivated and died to that.",
            "Goku",
            "Kakoyin is alive and didnt die in the dio fight",
            "Josuke and Okuyasu really did fix that girl from 177013",
            "Alessi that de ages Joseph and the 17 y/o Joseph beats the living shit out of him",
            "Polnareff in the turtle asks Giorno to build Polnareffland and Giorno says yes",
            "Purple haze feedback",
            "Jonathen, at least to some extent, is Star Platinum.",
            "Joseph was faking being dumb/ old",
            "Narancia lived and went back to school",
            "Caesar and Joseph got married",
            "Jorge Joestar. I don't know how any of it would work but NYPD Blue deserves to be canon",
            "The Josuke ending of 177013",
            "PAART 8 SPOILER\nJohnny didn’t die and he help Josuke in. His fight with tooru",
            "Part 5 spoilers >!Polnareff and Avdol are eternally reading books together with Iggy on their laps in the afterlife!<",
            "... **everything is canon. As long ad Diavolo dies**\n\nAlso josuke and Okuyasu being gay for each-other",
            "Demonic Heartbreak manga.",
            "All Joestars subconsciously know Hamon and their stands reflect this: Star Platinum = Jotaro's resilience and the will that he inherited from Jonathan concretized by Hamon, Diamon Is Unbreakable = Hamon, when perfected to a degree can not only slow but reverse aging (Star Platinum: The World is a variant of this) and this doesn't only include living beings, Gold Experience = Jonathan's life giving powers (remember him giving life to plants and making the soil thrive during training?) 1000x more concentrated because Giorno is actually Jonathan's son not only in body but in spirit etc., Stone Free = Joseph's Hamon infused thread fuckery amplified and reflects Jolyne's rebellious nature",
            "The world made over heaven",
            "Girono knew what was happening with Made in Heaven. He just thought it best to leave it alone",
            "Stands are now an evolved form of Hamon",
            "Some spoilers here\nPart3:After dios blood got transfered to joseph the two consciousnesses are now alive in josephs body\nPart6:FF'S souls are with everyone in heaven\nPart7:hot pants didnot die just couldnot catch up with them because of her wondes\nPart7 again:deigo married hot pants",
            "Okuyasu becomes Josuke's dad by using ZA HAND on Tomoko",
            "me, or at least how I draw myself",
            "Naranchia survived the battle with Diavlo, no reason other than I really liked him :(",
            "Koichi stays with giorno and meets polnareff and calls jotaro and josuke heals polnareff",
            "EOH",
            "This is just a bid of headcanon I've had for a long time now. That the Pillar Men are the source of the Baoh parasite.\n\nThat the SPW conducted much research after the fight with the Pillar Men, discovering many microorganisms. Like that parasite.\n\nEventually, a group of ne'er do wells in the SPW split away, stealing much of the research away, including and especially the parasite. \n\nBT and Baoh are in the same universe, basically.\n\nAlso, maybe that Jonathan and Erina are happy in at least 1 timeline?",
            "Jotaro's Stand power was actually to give him a single wish (I mean, it's The Star!), and he just never used the ability until the fight with Dio, when he thought \"if we had the same powers it would be a fair fight\" so the Stand gave him The World\n\n\"oh it's just the same kind of Stand\" sounds so profoundly stupid to me",
            "Polnareffland",
            "i think stand deaths would be a cool and also tragic way to push the narrative and get into deeper emotional plot lines. like losing a piece of your soul/will to fight, and how that affects a person",
            "Milagro man is a spawn of the Sugar Mountain tree being taken down and made into bills!",
            "DOH or THE BEYOND",
            ">! Kakyoin lived !<",
            "The rain in Jojo's world sounds like a young Japanese man screaming and that's why Jotaro misheard Josukes screams.",
            "Eyes of Heaven verse. Jotaro gets SPTWOH and Jolyne is born with stone free so they can be together like all the time. Part 6 happens, but Jotaro stops time for longer and kills both Johngalli A. and Pucci in the first encounter. He then over heavens a happy ending for everyone in a separate alt jojo storyline\n\nJoseph secretly has a second mode for Hermit Purple called the Hermit which is a punchy stand with the ability to point out tools for Joseph to use as traps.",
            "Squalo and Tiziano",
            "\"Kakyoin did you lay this egg?\"",
            "half of the crusaders did'nt die in cairo incident",
            "That the new universe is connected to the old universe. Pucci will return in someway. I’m pretty sure theres probably some hints throughout the story but idk. I’m still at the beginning of SBR",
            "El Aleph and Jorge Joestar becoming canon would be a huge win in my book.",
            "The metal thing in Jotaro's crotch is an hydraulic dong.\n\n*\"Doitsu no kagaku wa sekai ichi\"*",
            "Jonathan meets Joseph in heaven during his near death experience at the end of part 3, they have just enough time for Jonathan to say how proud he is of both Joseph and Jotaro.",
            "Anime adaptations of parts 7,8, and 9",
            "Jonathan's disembodied talking head survives through some convoluted plot bullshit and hangs from Jotaro's belt to give him advice like Mimir from God of War",
            "The infinite punishments some of the main villains receive aren’t actually infinite, ie Diavalo dies eventually leaves the cycle and Kars eventually lands on a planet far far away. While they did some terrible things they caused very finite harm and I feel that an infinite punishment does not fit the crime.",
            "Johnny gets a happy ending/SBR ends with Funny Valentine as the final main fight. Diego coming back with The World felt like bad fanservice to me and completely took the wind out of what was a fantastic finale in the Valentine/Love Train fight.",
            "The World's ability is to copy Joestar Stand abilities and Star Platinum could always stop time. Dio just discovered it first.",
            "Everyone is a homosexual. They're not into eachother they just like other men/women",
            "Heres is a stupid one Johnatan body gave each jokester alive a stand tailored for the journey he activated Hermit Purple to find Dio made starplatuim to kill Dio and made a crazy diamond to fix the collateral on their way there. \n\nHolly stand was probably somthing just as over power maybe it made the joestars achive peak preformce or something maybe it can revive people",
            "Stroheim was killed by a Soviet stand user",
            "It's more of a Re write, but I'd love if Kira had insulted Josuke's Hair so he could go beserk mode, and I'd love if Josuke could beat Kira in front of Joseph",
            "STANDS",
            "jolyne and ermes kiss",
            "Transmasc anasui",
            "Rohan could've easily wrote \"I know the new identity of Yoshikage Kira\" in someone but he refused to do so because Josuke suggested it",
            "Jotaro was able to channel a pinch of hamon for his final punch on Dio",
            "Star platinum being Jonathan's spirit 🤭",
            "Purple Haze feeedback make it have a canon anime adaptation",
            "Anything you want as long as Diavolo dies at some point",
            "Dio wanted Jonathan’s body not because it was a “perfect vessel,” but because he was low key jealous of those big burly muscles on him. Oh and also Joseph was the one driving the Ambulance, he used hermit purple from a distance to run Kira over.",
            "Pucci gets his but beat by giorno and Josuke (btw no hate to pucci) and right after pucci is thrown in jail some how and goes on a redemption arc rethinking his life choices",
            "POLNAREFF LAND!!",
            "Speedwagon didn't marry simply so that he had one less thing to distract him from caring for Joseph and Erina.",
            "at least one of the part 5 gang is a zeppeli",
            "Hol horse being the only crusader alive",
            "Jotaro over heaven",
            "Eyes of Heaven.",
            "Abbachio didn’t become donut. Ez kill Diavolo and no one dead",
            "Polnareffland, no more explaining needed",
            "The SBRverse is the new universe made in the end of part 6 and everything that happened in part 1-6 acts as a loosely fitting prophecy for this new universe. Like how there must a Dio who is defeated by a JoJo or how there must a Josuke that will save Morioh from a murderer.",
            "Jonathan became a vampire the second before his head Got chopped off\n\n\nAnd has been on the bottom of the ocean since",
            "Jotaro surviving his \"death\" before universe reset and pucci dying, I just wanna see star platinum😭😭😭",
            "I'm one of those people who isn't a huge fan of Joseph cheating (wish it was actually explained though). But I love Josuke, so sometimes I imagine that he's Jotaro's little brother or cousin or something.\n\nAlso, Jotaro brings little Jolyne with him to Morioh. All the fan arts with her and uncle Josuke + the gang makes me just 😭",
            "everyone were actually normal heterosexual peapole and it was all a dream",
            "dio over heaven would be fun, cant wait for jotaro to get pissed and kill him again",
            "Dead Mans Questions like yoshikage kira in the after life as a good guy? Thats peak.",
            "Mamezuku rai being a zeppeli maybe even somehow Gyro’s descendant cuz we know gyro was slaying pussy back in italy",
            "Probably ANY character i like not FUCKING DYING",
            "over heaven cuz it made dio seem like less of a poopy head in some aspects",
            "Of course the stands",
            "Kakyoin lays an egg",
            "love live\n\ntbh it’s in the same universe anyway",
            "Eyes of Heaven's ending, I know it's kind of dumb but Jotaro bringing little Jolyne with him to Morioh just makes me so happy",
            "Everyone actually being gay",
            "Jorge Joestar unironically",
            "Dio groomed child polnaref and child polnaref was the actual main villain in part 2.",
            "Jonathan's body stand being Passion",
            "Part 7,8 and 9 is DIO's imagination while he was in the coffin .",
            "I guess I’d go with Jotaro’s wife being aware of what stands are(even if she can’t see them)and supporting Jotaro’s distance to protect them. Jotaro’s always been a family guy",
            "Star platinum was the ghost of Johnathan, and when he defeated dio, it's because he unknowingly used hamon for that last punch.\n\nTies togheter part 1 and 3 perfectly",
            "Kakyoin's arcade mode ending in Heritage for the Future",
            "Kakyoin poisoned the baby and it fucking dies a painful death, i never liked that baby",
            "Polnareff built Polnareff Land with the mafia money",
            "Jesus was a stand user. Star Platinum is Jonathan's phantom, and Stone Free is Kakoin's phantom. SCR was heading towards Jotaro.",
            "![img](emote|t5_2tny5|49674) Just felt like using this, nothing else",
            "Inside the turtle Polnareff made Polnareff land",
            "Part 3 jotaro slice of life high school harem spinoff",
            "Erinah saved Dio in the shipwreck and wanted him to turn his life around",
            "That the universe reset was caused by pucci",
            "The Jolyne goes to Morioh fan-manga for EOH, no explanation needed",
            "me and jolyne married happily ever after",
            "Purple Haze Feedback and the death of Pucci by G.E.R (Sorry Part 7-9 fans)",
            "Von Stroheim was killed by a stand user from the Red Army.",
            "Eyes of Heaven story. So dumb it’s good",
            "Jota kujo",
            "All the jojos meet and have a bizarre adventure if it’s possible [part 4 to 10(we know 10 will happen) it would be cool to have a xover.",
            "female characters have the same body build as male characters from first 3 parts",
            "Me with a Op stand",
            "Hol Horse participated in the steel ball run, and came second in disguise.",
            "Purple Haze Feedback",
            "Death man's question ova",
            "Anasui being a female character, just for fun.",
            "TW:OH or Kars having novel kars power when he go to space.",
            "Polnareff land exists in part 5, and is a real place in Italy.",
            "part 6 isn’t canon!!!",
            "An alternate part 3 where Jotaro’s dad joins the Crusaders. He’s a stand user with the stand Rat Pack.",
            "Dio ate Kakyoin's parents",
            "Kiraboss",
            "Mpreg. Araki was a coward for not including it tbh",
            "Flashback-man is Johnny's ghost trying to connect with Gappy (like the Holy Corpse did with him), and the reason that wasn't revealed is because Gappy isn't fully aware of the connection. Nor did he dig up Johnny's corpse.",
            "Diavolo obtains the stand arrow to create King Crimson Requiem, which enables him to vanish and traverse time itself. This would leave Giorno with the arrow and without Diavolo's presence.",
            "Everyone remembered emporio 😞",
            "The World Finger",
            "Josuke becomes a police officer 😭",
            "That the requiem arrow is unique and has a different effect to the basic arrows, (evidence the jobro is part four's mom didn't get a stand)",
            "Ireneverse and SBRverse are the same",
            "D+G and Viviano’s secret relationship. 🤔",
            "Star platinum is Jonathan",
            "Jonathan reincarnated as Star Platinum.",
            "For all the memes.......... make Jouta Kujo canon.....",
            "~~Me and Jolyne~~\n\n  \nBaki Hamma",
            "Giorno amd Mista get married after part 5 or changing the ending to part 6",
            "Jonathan being Star platinum would be peak fiction",
            "Diavolo get's a stand arrow and made a crimson Emperor  requiem and kill all of the team",
            "Jouta, male pregnancy is lit",
            "STAR PLATINUM IS JONATHAN JOESTAAAAAAAAAAAR PLEEEEEEEEEEASE",
            "Jorge Joestar, just all of it.\n\nIf not allowed, I'd canonize Kakyoin's egg",
            "golden heart golden ring IMMEDIATELY\n\nthe only jojo light novel that actually fits in with araki's vision",
            "Idk if this counts but I kind of want purple haze feedback canon",
            "I like the idea that Diavolo's stand is king crimson, and doppios is Epitaph.",
            "Narancia doesn’t die during the Diavolo fight, Mista did",
            "Fuck it, im making a cross between two anime\n\n Polarneff Land is real, and the One Piece is located there",
            "Jotaro carrying a glock as his stand",
            "Johnny not dying",
            "Me doing your mom and your dad",
            "Universe reset didn't happen. And somehow Pucci got killed (bonus points for Jolyne teamed up with Jotaro doing the deed)\nI got isekaied to Part 5 and stopped the gang's death.   \nBruabba canon 😤   \nGiorno meets the Joestar family and later helps Jolyne.",
            "Johnathan reincarnating into Star Platinum and Lisa Lisa reincarnating into Stone Free.",
            "Dio over heaven",
            "Polnareff eventually got a new body due to........... Crazy Diamond Requiem, I guess, and met Malèna again.\n\nAnd they got together this time.",
            "Polnareff was trying to convince Giorno to use his mafia money to buy Disneyland and make it polnareff world",
            "My head canon is the dolphin in the final battle was made and sent by Giorno",
            "Sick.",
            "I see your disney world orlando and I raise you four seasons orlando",
            "But isn't Crazy Diamond ability is to bring something back to its previous state? That sounds more like a refusal for change.",
            "I have to disagree on the basis how stands are explained/manifested. It's a reflection of his soul and nature, which to me means him not being selfish is reflected in his stand being unable to heal him. I'm saying it is not because he just doesn't want to, but that the reason his stand never could is because it would contradict his nature.",
            "it would be a selfish thing to do in his opinion",
            "This is the biggest missed opportunity of the entire franchise",
            "Would've been awesome to see",
            "The PS1 game does this with Young Joseph who’s a secret character, it starts with Alessi de aging him, then he just wrecks everyone’s shit.",
            "Bruh that’s the saddest headcannon I’ve ever heard. I love it so much! 😭",
            "I mean we never see him take away the disc so it could be possible that since pucci died the disc just fused with him",
            "That's bittersweet.",
            "100% agree. >! Straight up didn’t even know she was dead until I decided to look it up cuz we didn’t see her for the rest of the part after that. Her wounds don’t even seem like something she would die from, especially since characters have taken the most craziest wounds and still managed to live as if it was nothing. !<",
            "If only same could be said so about my >! boy Diego !<",
            "I feel you. I would love that to be true.",
            "If we say it enough it's true.",
            ">!Yeah it was silly. She literally had the ability to heal her wounds before they moved into her heart!<",
            "In all fairness, by that point the family hadn't been around for two parts. I personally would've really liked to see a Zeppeli in part 3 though, at least as a way to cap off the trilogy with both families.",
            "That gotta be the least cannon yet the most agreed upon thing in this fandom",
            "YES, YES, 1000 TIMES YES",
            "I saw so many but this is my favorite one and idk why, we have so many good options in this comment section but I think I like this one the best. Maybe it's because it's very likely this could be true without any changes but this one is my personal favorite",
            "Jotaro, this is my last arrow !",
            "I refuse to believe that this isn’t canon, Soundman’s ideals are far too different from Sandman’s for me to believe they’re one and the same",
            "I straight up wanted him to win so bad the first time I read part 7. Still hope he does even though I know better when I read it now lol. Definition of insanity blah blah blah",
            "Fuck it, throw in Crazy Diamond Demonic Heartbreak too",
            "thematically fits in with D4C, i like it",
            "Never heard about this but damn I want it now",
            "and Hayato later starts having same hairstyle as Josuke to honor the memory of the hero who saved him and his mom from Kira, making it a beautiful circle of passing on the dumbass haircut\n\n\nthat and Kosaku saving Josuke happens and I don't give a shit about the fact that nothing suggests it could be a possibility",
            "God damnit. Now I want that.",
            "Why? Like why tho",
            "Would that really make sense? Kosaku canonically has the personality of drywall. Would he *really* be the kind of man to dress like a delinquent, sport a pompadour, and get into fights? Math doesn't math here.",
            "She was the rain",
            "She actually the one who took picture in EoH ending. That why new Part 6 ending photo the main team posing.",
            "I like to think that she was either reincarnated as a pet that jotaro and Irene keep around (like a tank full of plankton that’s in jotaro’s office or something), or reincarnated into a body similar to atroe’s",
            "he died off covid(source: im Araki)",
            "epitaph tells me he is the main villain of part 9",
            "all of the below too",
            "Yep and he would name it something like crazy emerald i  honer of Josuke",
            "Colour shifts happen in Part 1 and 2 as well, so I'd say it's a side effect of having superpowers in general.",
            "i cant tell if im supposed to imagine irene’s childhood friend being a bowl of sea monkeys or the human vessel f.f. uses",
            "Comedy February, Comedic February, and Comedian February",
            "*The* Funniest",
            "Giorno",
            "YES! Danny was a good boy, he deserves it!",
            "I think Jonathan would totally forgive DIO even after everything. Dude's heart was too big for his own good.",
            "fym thats cannon",
            "Isnt it the other way around?",
            "Giorno did it to mista",
            "least horny jojo fan (2)",
            "Thats already canon",
            "They're married with two children ofc",
            "They had a loooong time being just 3 dudes and nothing else from an ancient civilization, of course they banged",
            "KARS AND ESIDISI WERE BANGING!",
            "they were tho?",
            "If rather it be Kars and wamu tbh",
            "DinoPants best ship",
            "100% a head canon I've always believed in. He got busted and started playing up the \"I'm a poor confused old man\" to get out of getting beat up by Susie Q. Nobody buys it though.",
            "After adopting Shizuka, Joseph try to fix his health condition using therapy and Hamon also. Shizuka also help fix his marriage. Since Hamon is life energy, it can be shared between spouse resulting to Suzie to be long living mother of Shizuka. Knowing that the chancee of danger in future, Joseph teach Shizuka how to use her Stand and Hamon.",
            "Why would he do that in part 4 when Red Hot Chili Pepper was gonna kill him ? Like this isn’t even a Joseph bluff or anything since part 3 Joseph really shat himself and panicked a lot of times",
            "could also explain Stone Free, because she was born after Dio died his influence on the Joestar stands fades a little and some of the vine-like powers return",
            "Makes sense actually ,like I am surprised YouTubers never talked about it",
            "Dead man’s question is considered canon by araki",
            "But...it is canon, it's made by Araki, doesn't contradict canon, and isn't just a Promotional thing",
            "Josuke X Ryoko",
            "This Is a based comment",
            "He can also only attack if you invite him into your home, hence why he always waits for the joestars to come into his home, so that he can attack them freely.",
            "Yes, it would probably still make sense considering the Alternate universe made by Pucci in part 5 shows Jotaro, looking a bit older than he usually does probably implying that Jotaro had no stand or just straight up a hamon user, and it would make sense considering if Jotaro wasn't using a stand for 10 years in DIU, then Hamon Jotaro would probably had to stop using his hamon in that same period of time, thus making him age normally and since he is goddamn 40+ years old in stone ocean that appearance should probably be normal lol",
            "I want this to be the case too but Hamon users still can't stay young forever. That's the whole reason behind the straiso X young Joseph fight",
            "He stole it from the Joestar mansion. Or he uses it to launch himself at a far away enemy for a dramatic anime pose/attack.",
            "seeing an adopted joestar would go hard (ik she doesnt fit the naming convention but neither does josuke for english speakers but english speaking jojo fans still like him)",
            "My head canon is that its connected with the hand and okuyasu keeps being a dumb ass and send advol rations so he'll survive\n\nAlso, if okuyasu ever removes part of hes body and josuke heals him than advol catching the part will be transferd out like joske tried to do againt enigma",
            "He did get he as woop tho",
            "Isn’t Polnareff still a turtle though?",
            "They said one thing not four(th part of Jojo’s is diamond is unbreakable)",
            "they’re married in heaven (araki told me in an interview!!1)",
            "just like how sukuna and gojo does!!!! (their voice actors are the same)",
            "they kissed on-screen and then the scene got deleted bc mr. david productions said no (source: i’m araki’s son and he told me when i said “dad why don’t bucciarati and abbacchio kiss??”)",
            "both of those are so sweet aww..",
            "It's a canon, no?",
            "Isn't this should be true ?Maybe not a president specifly but doesnt he need to exist",
            "Pucci : \n\n#REALITY ALTERING SHENANIGANS",
            "“Giorno please!”\n\n“No Polnareff! I am not using half of Passione’s budget to build a theme park!”",
            "I was so disappointed that they didn’t show that during that section. It would’ve been such a great way to remind the audience of the stakes.",
            "It really shows how much the ball was dropped in the anime that little moments of cohesion like that weren't added in, the way they had been during previous parts.",
            "Joseph's guess was right the whole time lmao",
            "I mean:\n\nNever marrying, never having children... that's textbook early 20th century gay man.",
            "It wouldn’t really be “restoring” their memories considering they’re literally entirely different people at the end",
            "I wouldn't want a full restore I think, but I do like to think they have weird deja vu every once in awhile and Emporio just smiles a little knowing they're in there somewhere still.",
            "I need this",
            "I prefer The World as Jonathan's soul. When they're alone he talks to DIO telling him how much he disapproves of his ungentlemanly behavior",
            "same here,but star platinum also looks a lot like bruford",
            "I like yours alot",
            "And became Jotaro's stepdad.",
            "My future for what he would do is become a fashion model and tours the stage/catwalk or whatever because of his looks/hair/potential feminine\\smaller frame. \n\nPotentially if he was in battle then he can use that possession trick again to get into kira's (new?) and end it quicker?\n\nThere's lots of things he could do if it is written well enough?maybe he even has a kid/sister named Tenmei? Could be a fun callback?",
            "Giorno learn his heritage from Speedwagon Foundation. Meet Jotaro. Help him track Pucci",
            "It is cannon ,if something includes Diavolo's death it is cannon .",
            "Well that doesn't make any sense. The passion/hermit purple is the stand of hamon",
            "But…why? It doesn’t fit the character if you swap them and The Passion is a stand for hamon users, you know, something that DIO would die from if he ever learned",
            "I luv your profile picture",
            "This one is a step too far",
            "Wouldnt it be cool if he can use Hierophant to turn his own body to tentacle like and secretly do that to minimise damage ?",
            "I like that this implies that these two take place in the same universe.\n\nIs the world only bizarre camp and fabulous for the jojos? or when ur gay? or a supermodel? or a gay supermodel? or just a stand user?\n\nis everyone else's life really drab and screwed up like saki's until they're in a jojo's vicinity?",
            "Well he would've been over 100 years old by 2011",
            "the josuyasu duo <3",
            "Agree on this",
            "Timeline where Mary instead of George raise Jonathan and adopt Dio ? Dio become good bro.",
            "fuck thats good",
            "or like Nick in Lollipop Chainsaw",
            "I always imagined him becoming a doctor but this works too considering his grandfather",
            "Whose mom got hit by a stand arrow?",
            "Or some how his will or soul goes into it",
            "...but...why? 😰",
            "Was literally going to comment the same thing haha.",
            "You were doing so good why would you ruin it",
            "It would’ve been really interesting if Diavolo had a strong ability but could only use it by manipulating Doppio.",
            "NO, MISTA IS MY BOY",
            "if it's something related to part 7 you just gave me a huge spoiler",
            "What are you on about",
            "YES![img](emote|t5_2tny5|49674)",
            "Omg I love that T.T",
            "New headcanon",
            "Crazy diamond ability is to modify the state of things. As show in Josuke first apearance when he changes the shape of his bullys nose. It can be used to return things to how they were but that on itself is not his ability but rather one of the aplications of it. The modification of state is made specialy clear by what Josuke did to Angelo. To explain it better, imagine crazy diamond power as the as you manipulating a piece of clay, suppose you make a figure out of this clay, you can modify its shape, you can mix things in the clay, change its collor, take of a piece, maybe even add more clay, you can also, if you choose, reshape that clay back to the figure you had at the begining, but even if you can reconstruct it back to what it was, doesnt mean its the only thing you can do.",
            "Probably to be honest. Araki definitely had thought of It while writing Stardust Crusaders.",
            "Yeah it does. Also cool that when there's a Alessi V Old Josep matchup in hftf Alessi's Sethan just turns Joseph into his battle tendency equivalence. Because both characters are in the game.",
            "I feel like you completely glossed over the fact that she was under love trains effect ? You know? the stand that can make a simple scratch from a fingernail travel to your brain and kill you ?",
            ">!Die/go unfortunately didn't get the same treatment!<",
            "In a way it makes sense there was no Zeppeli in part 3. The Joestar family feud was with Dio, but the Zeppeli was with the stone mask.\n\nIn part 5 would have been pretty cool doe, Italy and all that.",
            "This is the first time I'm hearing this, and I absolutely love it",
            "What actually contradicts this theory I'm wondering?",
            "fr, as much as I love In a Silent Way as a stand I really disliked HOW it appeared, Sandman's whole intro could had lead to such an intresting opponent without being an antagonist and pose the question of if it's fair for Gyro to win the race, and how Sandman has to play in the white men's rules to get back his ancestral land to his tribe that still hates him for trying to understand the same white men that drove them to that situation. Sandman is such an intresting character (or at least the idea for one) that could lead to genuine despiction of the history of colonialism and how at the end it's always the people like Valentine in power the ones that cause the misfortune to anyone that isn't them.\n\nBut he HAD>! to become a Valentine goon!<",
            "But their ideals perfectly match though ? Sandman deciding to work temporarly with Valentineand Diego  to achieve what he wanted is perfectly in line with his \"adapt yourself instead of saying true to your traditions\".",
            "If I could add one more thing, I put in Golden Heart, Golden Ring.",
            "What if Hayato in the finale of his shows says, “Yoshikage Kira, what a joke,” throws his hat away, and wears Josuke’s hair in his honor",
            "Because random act of kindness (kosaku saving Josuke) would later result in Josuke beating up Kira and taking revenge for Kosaku. Fits the theming of the part and the small-town vibe of morioh.",
            "Wasn't it mentioned that Shinobu's friends thought she was lucky when she ended up with him, and that in their younger years she was enamored too? Wouldn't be surprising if the guy kinda just settled down and became boring after a while",
            "I think it's fairly believable for a person to change over the course of growing up, especially as a teenager to an adult with a family.\n\nA long time passes between those events, I can buy someone being dramatically changed by life in that timeframe.",
            "Maybe Kosaku was a rebellious teenager on his high-school years, but that was a phase. Shinobu did want to marry him once upon a time, and she's into strong-willed, rebellious people, as shown when she falls for Kira-disguised-as-Kosaku.",
            "source: it came to me in a dream",
            "Woah, Joshu killed Covid? Common Joshu W",
            "I’d say it’s a side effect of being bizarre asf",
            "I prefer human vessel since F.F wanted to be human",
            "Can confirm, I was the 4th bullet of mista",
            "i confirm",
            "Kars, did you lay this egg?\n\n~~would esidisi be the mom? Probably shouldn't care~~",
            "no way bro he raised wamuu",
            "Wamuu is technically the adopted son of Kars and Esidisi",
            "shout out to joseph hate and recognising hes a flawed character instead of the bunch of headcannons i see saying a joestar cant be a bad person",
            "I was about to say that it could be that and the reason for stone frees 2 forms is that its in a process of healing. And with if jolyne beat pucci and had a kid and thst kid got a stand. It would be in a rope or vine like form",
            "source?",
            "Yeah I kinds added a dub stand I think called rosey kiss which is a vine that she can whip,grab or swing with",
            "Avdol in a desolate poket dimension is actually such a fun idea, probably doing some meditation to not go insane. Maybe competing for resources with other living things sent there",
            "That's actually fucking amazing",
            "Yes but if Josuke can fix things technically he could restore Polnareff’d body to its original state",
            "It is to me",
            "I don’t think it was in the manga either so it can’t really only be blamed on the anime",
            "Easy to forget he started the series as a street thug too. Despite the fact he had a respect for people with honor he first appeared as a criminal. It's possible he had a reputation that made it impossible to find honest work.",
            "Same soul different timeline. Or another way to say. Same people different experiences.\n\nAraki wrote a very clear epilogue",
            "oh my fucking god star platinum is blue as well",
            "Well yeah but this kinda proves more the Jonathan theory considering Jonathan's relation to Bruford",
            "Thanks",
            "Ryoko as ally in Part4. \n\nI dont think Killer Queen can deflect emerald splash",
            "Since when?",
            "I think spin would do the same effects as Hamon and make them age slower",
            "Also the role of the doctor suits him perfectly!",
            "The \"main character of part four\" got a stand, but his mom did not.",
            "I lack the need to filter my thoughts",
            "Well then who else is left?\nGiorno and Diavolo are necessary, Narancia is the victim, Bruno just can’t and Trish is the only girl, so yeah Mista must be the one",
            "Oh fucking definitely",
            "It ties into the ‘protagonist vs antagonist opposing forces’ angle.  Josuke is making, Kira is destroying.",
            "Damn that makes so much sense",
            "I thought restoring things in a messed up way like it did with the bully's nose only happened when he was really pissed off. Like his anger affected his powers' ability to work properly",
            "Yeah Probably. >! Ofc it makes much more sense now that the wounds she took would’ve definitely killed her, especially factoring in love train. I was referring to when I initially read it. !<\n\n>! Maybe it’s because I’m so used to character deaths being told directly to the audience by the narrator, caption, or their literal spirit that I didn’t realize that she could’ve died. !<",
            ">!exactly the reason why her death is fine!<",
            "Go/jo moment",
            "Same here",
            "absolutely nothing i don’t think! it would absolutely make sense in my mind, but in canon we don’t actually know why chariot requiem was walking, or where to.",
            "Whitesnakes's miscalculation 😏",
            "Hold on let me find that, sounds epic",
            "So like Kosaku in his teen years was basically Josuke",
            "But it would also mean that the random act of kindness is what led to his death.",
            "Holy shit keep cooking",
            "Yeah but I don’t think Josuke needs an additional reason to beat Kira like that. Like, he just wants to defend his town and his friends/family. Also, Kosaku wasn’t even a good husband so he might’ve just been a douchebag.",
            "see we gotta mole on the inside",
            "i would love to see Polnareff-Land",
            "Ofc Esidisi is the mom. He’s the only one that has a period (hence the sudden mood changes) and he lets out his boiling blood. Kars is the dad because he whips out is erect Boner Saw.",
            "Araki himself",
            "Bro is literally armless then what the hell man, I'd rather die if I didn't bleed out",
            "i think this would only work if polnareff's body was not yet truly dead, since he wasn't able to heal his grandfather (unless i am misunderstanding)",
            "He'd be able to fix his body, but he can't resurrect the dead. That was one of his limits shown with his grandfather, and Jotaro says that no stand can bring back the dead. There also wouldn't be a way to swap Polnareff's soul back to his body without Chariot Requiem.",
            "It's to everyone, oc included😔",
            "No, that's what I'm saying. Not that they cut something from the manga, but that in previous anime parts, they've added little details here and there that make the story more cohesive.",
            "yet people still think the first 5 parts are fucking gone now or something",
            "breaking discovery.get matpat on this",
            "I don't remember specifically but araki confirmed it quite a while ago. Also why else would they have the EXACT same stand?",
            "I didn't think about that, if it has the asspull powers to make him abled it could probably slow aging",
            "who cares if she's the only female, trish gets killed or no one dies in Narancia's place",
            "Similar to how Jonathan is essentially pure good, and Dio is essentially pure evil",
            "No, he can do it normaly, like him altering the name on the lotery ticket Shigechi found so the attendant would ask for the wrong name in the phone and they would be able to witdraw the money (their accounts got frozen tho). He just usualy doesnt do it because of his own principles that are basically \"you dont mess up with my hair and i dont reasamble you into a unsolved rubics cube\". Basically josuke usualy doesnt want to distort peoples and objects, doing so only when provocated, its not that his powers doesnt work properly when hes angry, its more like that he stops holding back when hes angry, crossing lines he usually doesnt because of his morals.",
            "NO ITS NOT!!!!!\n\n-hot pants simp",
            "I mean the reasoning behind it is solid but the presentation is way off since whenever it’s brought up loads of people say they didn’t understand that she actually died.",
            "I like to think it because it's last order from its user was to protect the arrow and the safest place would be with Jotaro",
            "I like the theory that Requiem stands just gain any ability imaginable to achieve the users goals",
            "We know that requiem follows the user wish, giorno was to have the power to beat diavolo and polnareff was to protect the arrow and keep it far from diavolo, you could argue that time stop would be a counter to time skip so pol could have thought it would be safer with jotaro rather than him because of his wheelchair state",
            "Nah they can keep that one",
            "The ages more or less fit too",
            "Kira's death, though. >!Kosaku was killed in the Cinderella Beauty Salon!<",
            "I mean, yeah, but being a bad husband doesn't mean he was an awful person and wouldn't save Josuke and his mom.",
            "source?",
            "The soul is still alive, so the body might be repaired or a return to the original type of thing. \n\nJosuke’s grandpa was dead, his soul was no longer",
            "Yes Kira's victim at the start of the first episode was not in the manga but they added it to the anime .",
            "Because that is something that can happen? The rats, D'arby brothers, Jotaro/Dio.",
            "Yes and since like spin is Hamon from the other verse and we saw that Hamon could slow aging that would make sanse",
            "Hmm, good point he did do that with the ticket. I always thought it was more like him \"fixing\" part of the ink back to it's original state and it flew back to a pen somewhere like with Tonio's food. But even though he was pissed off when he bookified Terunosuke he was thinking calmly, so maybe you're right.",
            "I've seen that head canon and the head canon of it just trying to go \"away\" \n\nBoth of which I like cause they just both make sense.",
            "100%, it's never directly stated how it works but I've always liked the idea that it just helps you achieve whatever you want most in the moment, though with a twist of course.\n\nI know Bites The Dust isn't a requiem stand technically, but that gives Kira a foolproof way to avoid getting exposed by Hayato or anyone else (except himself), Polnareff gets the arrow away from Diavolo and gets put into a non-damaged body (though the stand moves slowly and he's put into a turtle), and Giorno is able to counter King Crimson. His doesn't really have a twist to it, though you could argue him not being aware of how GER works is the twist.",
            "Maybe i want it",
            "Ok this is unrelated but that flair is hilarious to me for some reason",
            ">!Kosaku was killed by kira because josuke found out kiras identity. So by saving josuke, he caused a butterfly effect that led to his death (if this was cannon)!<",
            "Wasn't kosaku killed because Kira wanted to steal his identity to get away from Josuke?",
            "True I guess, but I feel like it’s just an overall pointless addition to the canon. Like I guess it’s poetic but it’s just tying two unrelated characters together for no reason.",
            "Not to mention the part where giorno >!fixes his own body (that was literally impaled enough for narancia to die) and goes back into it by transferring his soul back like it was nothing!<",
            "None of those are virtually the same stand the way The Passion and Hermit Purple are\n\n1. We barely got to see the other rat’s power do who’s to say it’s the same \n2. The D’Arby brothers stands are similar but use entirely different mediums to steal souls \n3. SP and The World just happen to share an ability, likely because of Jonathan’s warning",
            "To make it logical, spin energy lessens the waste of nutrients and proteins by giving the restored energy as a whole to the user. It also works for objects as in Gyro's Balls are probably a family heritage and didn't wear down one bit. Because of two things; one, they're STEEL. Two they spin continiously and restore spin power, so it cannot wear down.",
            "i think GER being the only true requiem stand means it has no twist. there really is no downside, i’d say giorno not knowing he’s infinitely torturing somebody is a plus lmao",
            "And more so that GER is sentient",
            "It's inspired by the flair \"Killer Queen by David Bowie\"",
            "\"We barely got to see the other rat's power do who's to say it's the same\" sure because we see a lot of Jonathan stand to say it's exactly the same as hermit purple",
            "We at least see The Passion do something, which just so happens to be spirit photography, you know: the same ability Hermit Purple has"
        ]
    }
}