{
    "Welcome to /r/StupidFood. Please read": {
        "title": "Welcome to /r/StupidFood. Please read",
        "score": 1190,
        "url": "https://www.reddit.com/r/StupidFood/comments/5x6ahd/welcome_to_rstupidfood_please_read/",
        "content": "---\n\n&nbsp;    \n\n###Introduction\n\nDear readers old and new, welcome to /r/StupidFood.\n\nPlease take the time to have a look around and get to know the place.\n\n**History** : We have been here since spring 2015, although our slightly younger friends over at /r/WeWantPlates have thoroughly outgrown us. What started as a silly idea has morphed into a decent small sub that has regular influxes of subscribers whenever we get namechecked on /r/food or elsewhere. It is the brainchild of /u/Clackpot.\n\n**Content** : Feel free to post your own Stupid Food without worrying too much about quality, if it isn't good enough it'll drop off the front page and we'll all move on. There is no shame in unsuccessful posts.\n\n**Behaviour** : This sub is explicitly both partial and prejudiced, but nevertheless tolerance and consideration are required. Don't get too carried away. Insults and flaming are acceptable as long as they are creative, funny, imaginative, or otherwise thoughtful; but being shallow, boring, unoriginal, or derivative are cardinal sins.\n\n&nbsp;    \n\n\n\n---\n\n&nbsp;    \n\n\n\n###Our philosophy, and the elusive sidebar\n\nFrom time to time there has been some confusion about what exactly this sub is for. The sidebar explains it all in some detail.\n\nRemember, **/r/StupidFood does NOT try to be fair or impartial** in its efforts to poke fun. We will ridicule and scoff at whatever targets we choose, without first asking whether it is justified.\n\nBut many of you will be reading on mobile clients, blissfully unaware of our sub's sidebar and how that describes its ethos. Some of you may even be reading on desktop, *still* blissfully unaware of the sidebar, despite it being just over there ---->\n\nSo, **read the bloody sidebar!** On mobile you may need to click an icon such as an 'i' in a circle. In particular, pay  attention to this comment tucked away under the 'YOUR RIGHT TO TAKE OFFENCE' heading :-\n\n> ###/r/StupidFood is intended to be a somewhat puerile place to poke fun at other people's creativity, ***without regard to whether they deserve it***.\n\nThis is important! Do not expect the court of /r/StupidFood to be a just one. It is here to vent spleens and spout prejudices. It is not meant to be true or fair. It will cheerfully ignore the facts in pursuit of a cheap gag.\n\n&nbsp;    \n\n---\n\n&nbsp;    \n\n###Regarding moderation\n\nThis sub has a light-touch approach, preferring that most moderation be performed by subscribers voting items onto or off the front page.\n\n**Removal:** Items may be removed if they are wholly irrelevant, spam, grossly rude or inflammatory, or for any other reason the mods don't like. Posts which are merely low quality will not be removed.\n\n**Subreddit rules**: [Rules](https://www.reddit.com/r/StupidFood/about/rules/) will be added and amended as and when required. Please look at them.\n\n**Bans and suspensions:** May be dispensed for anyone with no interest in the sub's welfare; for crap bots; and anyone else failing to be part of the community. Other contributors will have to try *really* hard to earn themselves a suspension or even permanent ban. /r/StupidFood does not subscribe to big stick policing.\n\n**Overturning decisions:** We're not perfect, we'll get it wrong from time to time. Please [message the moderators](https://www.reddit.com/message/compose?to=%2Fr%2FStupidFood) if you feel a decision is wrong or over the top and it will be reviewed.\n\n&nbsp;    \n\n---\n\n^(*/u/Clackpot*, last updated 30th October 2017)\n\n&nbsp;    \n\n\n",
        "num_comments": 95,
        "comments": [
            "PLEASE ban Rick Lax videos and others following his rage-bait formula! They very clearly fall under the \"spam\" category in the sub rules and I think it's pretty safe to say that everyone here is sick of that shit. \n\nIf you don't recognize the name Rick Lax, you will definitely recognize the formula. A model in yoga pants makes something gross, wasteful, and unsanitary in an LA mansion, while the person filming acts amazed and not at all disgusted. Remember that toilet ice cream cocktail video? That's the shit I'm talking about and it needs to stop.",
            "boner sex",
            "Don't know if this is the right place to ask but did the subreddit ban those over the top ChefClub videos? Feels like ages since I've seen one posted and it stopped around the time I saw people asking for it to be banned.",
            "Lately there’s been an influx of uninformed ppl submitting “stupid cooking” videos that turn out to have more cultural meaning than first glance. Can there be a way to tag those or something? A bit insulting to tag cultural cooking as stupid when OPs are just not informed.",
            "Can we revisit the Chefs Club topic? Perhaps if we are not open to banning the videos we could create a flair. It's oversaturating the sub and is intentionally making stupid food to gain traction.",
            "Thank",
            "Can we get rid of the creepy fetish stuff",
            "im surprised this only had 2 comments before me",
            "Okay so I'm new, but if I check out \"new\" it seems like most of the people posting here are r/lostredditors who should really be posting on r/shittyfoodporn.   Just because you made an anemic looking dish using processed ingredients doesn't mean your food is stupid, it's just bad.\n\nI'm cool with the hands-off approach to moderating (overmoderation ruins many humour subs), but wanted to check if this is the kind of thing that *technically* falls under the rule of \"missing the point\" of the sub, or just something that the sub is used to and decides to ignore since these posts will get downvoted anyways?  Basically, would reporting these just annoy people or should I be doing it when I see it?",
            "I have a suggestion (not sure if this is the right place): That posters be required to leave a \"starter comment\", in which they provide some context as to why their post belongs on \"Stupid Food\".\n\nI've noticed a lot of posts where the majority of comments are just people asking why something is stupid, with no cohesive answer, and I think holding OPs responsible for explaining why something is stupid would lead to higher quality posts and discussions.\n\nCheers!",
            "Ban rage bait",
            "This subreddit has been 90% ragebait food wasting videos lately, we're basically just providing consistent free advertising for these god awful people to keep the cycle going. It's not even interesting content, children's toyboxes are more organized than some of the shit these grown adults are throwing together. I know the mod team is generally relaxed but how is this not weighing on your conciousness as someone who's merely viewing them? \n\nIt's not stupid food, it's stupid, talentless people wasting good food for views.",
            "I'm not sure if this is the correct place to inquire, but were those over-the-top ChefClub videos banned from the subreddit? It's been a long time since I've seen one, and it ceased about the time I noticed individuals requesting that it be prohibited.",
            "Precious bit of writing, pleasure to read!",
            "I've seen many questionable and nsfw subreddits but dear God i can't take another minute of this horrifying content. Seriously. İt hurts , i can feel the pain and almost going to vomit.\n\nSure , some things are funny but as a person who had less to eat before and knows hunger, it makes me support the idea that some things should be illegal.",
            "The influx of “india dirty” videos is annoying and racist.",
            "Can we please ban rage bait crap, u/Clackpot ?\nSeriously, this sub is infested with over and over reposts of always the same stuff.",
            "I spent approximately 5 seconds looking for an answer to a question I have and did not find an answer that adequately addressed. I feel this was enough research on my part, so I will ask my question. The instructions said something about a sidebar, I am on mobile, I have not checked for the sidebar, last sentence I read was “u/Clackpot last updated 30th October 2017”.\n\nMy question is:\nWhat parameters are set around the word “stupid”? \n\nObviously, rage bait is an objectively stupid category of content, created by stupid people- and I’d be happy to point out some examples of blatant rage/click bait food videos. Seems like the only valid submission. \n\nA person acting in good faith that makes a meal that is terrible looking, or who has a bizarre preference for food combos, but legitimately enjoys what they made- well, “stupid” feels a little mean to me.",
            "Thank you !!! 🌝",
            "This sub has just devolved into being racist ranting about other cultures. Unsubbing",
            "Why does every post link to this thread?",
            "So I can't comment without joining ?",
            "So this is just Guy Fieri and Rachel Ray episodes right?",
            "among us",
            "Im new to this sub (im a big foodie)... I already hate the videos",
            ".",
            "?",
            "Seriously anyone thinking of doing this...DO NOT DO NOR EAT THIS.",
            "Please fuck off with this stupid msg everytime I try to click on something",
            "I’ve been here for too long to not see a single veggimite sandwich",
            "This is somehow an abomination against both pickles and hot dogs. And putting mayo on either one is just gross.",
            "WHY",
            "Are there rules against posting A.I generated art of stupid foods?",
            "Which sub is the opposite of this sub?",
            "Can you guys add some banners or something to flair up the look of the subreddit? It looks about as sad and pathetic as Salt bae’s customer base",
            "hey, can you ban comments about people hating fondant every single time a picture of fondant is on the subreddit. Every time people on reddit see fondant *LITERALLY* half the comments link to r/fondanthate and how much they can't eat it and how terrible that is that a cake isn't 100% yummy like they've never had a cake with a candle on it.",
            "Can we do something about people posting hand fetish videos where it's clearly not about the food?",
            "History: how have you been doing with that stuff lately",
            "Yo, StupidFood is the funniest shit on the internet.",
            "Combining dumb things for tiktok videos can only be entertaining for so long.",
            "i hope you're aware that every single piece of content you're linking here is made with one purpose only: to troll idiots. :-)",
            "Is there an opposite to stupid food. Like people making something innovative but its actually not completely stupid?",
            "At some point, the wasting of food in these ragebait and just stupid videos is really obscene. \nImagine those that are thankful to have a can of beans on hand.\nFor every one that produces a palatable result, there are 10 that are junk or inedible.\nDisgraceful waste of food.",
            "Hhb",
            "Is there something that may be able to be done about the videos with people force feeding live animals? I don’t know if there’s a way to have them flaired so I don’t have to see them? I really like this subreddit but unexpectedly seeing videos of someone graphically causing an animal unneeded pain for views isn’t my thing",
            "YES. For the love of god mods, please ban these videos. I understand the mods want to be more on the lenient side and I definitely respect that. But, there are OBVIOUS rage bait videos on here that can clearly be considered spam. These should be banned.",
            "I like those videos and would like a subreddit for them",
            "**Mod note:** No, we didn't ban them. But it does seem that the volumes have dipped off a bit, and also some individual examples got removed for various reasons IIRC.\n\nWhilst I loathe them as much as the next person, /r/StupidFood is not a vanity project for me or the wider mod team and we don't curate the sub or remove things that we personally find distasteful. Instead we leave submissions to live or die on their own merits, and the simple fact is that a lot of CC videos get a lot of attention and upvotes, so we leave them up.",
            "**Mod note:** The answer to this is quoted in the welcome message above, with much emphasis :-\n\n> ###/r/StupidFood is intended to be a somewhat puerile place to poke fun at other people's creativity, ***without regard to whether they deserve it***.\n\nThis has been our policy since day one, I don't really know how to express it more clearly.",
            "**Mod note:** We've been using a flair system for quite a number of months now, it isn't perfect but it's a great improvement over nothing at all. CC content is typically marked `ChefClub drivel`.\n\nI have no idea why you are not seeing flair, but I can assure that it is there.",
            "**Mod note:** Until very recently this thread was an archived post, meaning it was closed and you could neither vote nor comment on it. But then Reddit changed the rules and archived posts are open again.",
            "**Mod note:** The primary method of moderation at /r/StupidFood is users voting stuff onto and off of the front page, so if a post has zero upvotes by the time it gets reported then it is quite likely that I will leave it up unless it clearly doesn't belong, because having no karma effectively buries the post, whereas moderator removal actually makes it completely invisible unless you still have the original URL. \n\nGenerally we prefer to be tolerant and permissive so we don't actively go looking for things to remove, if they are harmless enough what's the point? And as it says right here in this post :-\n\n> Posts which are merely low quality will not be removed.\n\nHTH, and we always welcome the thoughts of our users.",
            "**Mod note:** Indeed it is, and it has not gone unnoticed. We are working on it but some of it still manages to seep through.",
            "Please, I barely see any non rage bait posts unless I go search for them. People / bots keep reposting the same rage bait clips and it's ruining the whole point of the subreddit.",
            "**Mod note:** Huh? Example please?",
            "**Mod note:** I don't see why not, we haven't restricted anything. Have you tried submitting a comment?",
            "I guess /r/shittyfoodporn. It was always the better subreddit anyways.",
            "Please god creat a space for those rage bait videos so they have somewhere to be posted. So many people hate them.",
            "Booooooooooooooo\n\nBad mod\n\nBad\n\nI think this sub should only co tain food that is unintentionally stupid therfore I demand you change your entire ethos in order to please me\n\nThank you for your cooperation",
            "I feel like this should be revisited… volumes are going up. This videos are just satirical and taking over the sub.",
            "If possible adding a rage bait flair would also help identify the things from like lily's page and other similar creators (they're still stupid and it's technically food, so it's not like it doesn't fit on here imo)",
            "Thanks!",
            "Every post I was clicking in this sub lead me here earlier. Just checked again and it's working now so probably some temporary technological problem beyond my understanding. \n\nThanks for checking in though!",
            "When I click to comment. It brings me here",
            "And let there be no food, or only their creations for their food supply.",
            "We're getting hundreds of comments per day so it's clearly working for lots of people. But there was [a similar report](https://www.reddit.com/r/StupidFood/comments/5x6ahd/welcome_to_rstupidfood_please_read/hri44ir/) in this very thread a couple of weeks ago saying much the same. On that occasion it just started working again after a short while. I'm afraid I have no idea what the problem might be but I would certainly try commenting from a different account, platform, or device to see if it cures it."
        ]
    },
    "Burger at a Mexican restaurant my friend ordered": {
        "title": "Burger at a Mexican restaurant my friend ordered",
        "score": 902,
        "url": "https://i.redd.it/yxoe0oac218d1.jpeg",
        "content": "",
        "num_comments": 174,
        "comments": [
            "Excuse me, waiter?  I think my burger just shit itself",
            "That's what he gets for ordering a burger at a Mexican restaurant",
            "I mean I’d eat the fuck outta that burger with a fork and knife",
            "Cheese and queso are the same… except on burgers, apparently…",
            "I was in Texas two months ago, and ordered a breakfast burger  for brunch at a Mexican place.  But it was like 10 miles from the border, every other restaurant is basically a Mexican restaurant with Mexican food options.  The burger was the best burger I have had out to eat in a long time.  There were only 4 or 5 options for brunch, so they must sell a lot of them.",
            "I would definitely eat that.",
            "Did he order it “wet?” 🤣",
            "first issue: ordering a burger at a mexican rest.   \nsecond: It threw up on itself.",
            "NGL I would eat this and enjoy every single delicious cheesey bite. ",
            "The Sloppy Jose",
            "While the disrespect for sandwiches/burgers already fucking sucks, that cheese goop staining the chips basket is r/mildlyinfuriating.",
            "I would tear that up! Eat the burger with a knife and fork and dip those fries!",
            "Now that’s stupid",
            "Would you like some burger with your cheese.",
            "\"Excuse me, waiter? Um, there's queso all over my cheese burger...\"\n\n\n\"K, so... eat it! Ha! Get it!? K, so... ques-- I'm sorry, man, i just work here...\"",
            "The burger returned from someone's stomach",
            "que(so)?",
            "Who puked on your burger?",
            "Yes, mexican....",
            "Your friend ordered a Mexican restaurant and they serve this burger there?",
            "Fries look good.\n\nBut I didn't order the cheesey special.",
            "I mean, this isn't that far off from a sandwich I've had at a Mexican restaurant before, the torta ahogada (think like a carnitas sandwich with a spicy chile sauce poured over it), so it doesn't sound as weird as it should, but the *presentation* on this thing is atrocious.",
            "A soggy cloggy. MMM!\n\n¡Qué rico!",
            "Did you ask them to hold the cheese? I barely see any",
            "Its probably really good but why not just put a cup with sause on the side, then you could also dip the fries.",
            "I wouldn't normally defend this kinda stuff. But if you eat a burger at a sit-down restaurant, there is knife and fork.... and also that sauce looks divine and I really wanna try this. \n\n\nBut yes this entirely defeats the purpose of a burger.",
            "Cheese in burger ❌️ burger in cheese ✅️",
            "Looks like a mess but I bet it tastes awesome!",
            "Even the fries are tired of the shit just look at em",
            "I cannot stand when buns get wet!",
            "You use the fries to eat all the extra queso. Then it’s a fork and knife burger. I know it’s ugly, but those smothered burgers are actually pretty good. Just don’t try to pick it up",
            "This looks amazing.",
            "Nope.",
            "S A U C E",
            "Sloppy burgers at Truffoni's. Big rare burger with queso dumped all over it, queso splashing around the table, makes the night SO MUCH more fun. After the club go to Truffoni's for sloppy burgers. They'd say; 'no sloppy burgers' but **they can't stop you from ordering a burger and a glass of queso**, Before you knew it we were dumping that queso on those burgers! The waiters were coming to try and snatch em up, we had to eat as fast as we could! OHHH I MISS THOSE NIGHTS, \n\nI was a piece of shit though.",
            "Urudo🤣 prrrtttt!",
            "suizo?",
            "Soggy ass bottom bun is gonna be nasty.",
            "Did people forget that buns are used to eat the burger easily ?",
            "Badass",
            "Welcome to Spooge Burger, home of the Spooge Burger™. Can I take your order?",
            "🩷",
            "They missed the fries",
            "Cut the burger in half. I have a feeling they trying to hide something with that baby vomit.",
            "O K, so...",
            "and it costs $20",
            "I think they order queso with a side of burger.",
            "I've been there",
            "What did your friend do to piss them off?",
            "Where's the burger?",
            "If you have to eat a burger with a fork...you're doing it wrong",
            "Mexican burger? Huh?",
            "I feel like it’s the restaurant trolling people for ordering a burger at a restaurant.",
            "Isn't this the trending burger where they pour melted cheese on top of the burger? It's mouth watering.",
            "I'd be kinda pissed ngl",
            "Fondue",
            "Who the fuck orders a burger at a Mexican restaurant?\n\nThere’s always one portion of the menu that has chicken nuggets and burgers for children.",
            "Makes sense if y’all already ordered a whole ass bottle of tequila 😂",
            "I have a hard time believing your friend would order something smothered in queso without knowing what they were getting.",
            "Extra cheese?",
            "Fork and knife",
            "That would just piss me off.  \nHell, I order my Chicken Fried Steak with the gravy on the side.",
            "I legit would just send it back",
            "The fuck are you supposed to do with this?  Just take photos?",
            "Cheesy AF",
            "Burgers are finger food. Making a burger that needs to be eaten with fork and knife should be punishable by law",
            "I'd still eat it",
            "Sir? How much cheese do you want on your cheese?",
            "Aaaaaaaaaand now it’s lasagna 🤓",
            "Mexican??",
            "You get what you deserve. Next time try the spaghetti",
            "I want to see their tacos.",
            "Queso con carne",
            "looks delicious but yeah",
            "Fukin wak",
            "There's a burger place where I live that no matter what you order, it will always be drenched in cheese just like that. Never thought of trying it.",
            "They bought the Mexican restaurant. Surely they can change the menu.",
            "I’ll get a side of burger for my queso please",
            "the buns should be very moist((",
            "“Can I get extra cheese with my burger please? Like, LOTS of cheese”",
            "Queso do you want some cheese on your burger?",
            "I don’t know where the hell yall are but basically no one anywhere here would eat nacho cheese on any kind of Mexican food. The taco shops and restaurants here don’t really make burgers most the time either. Are you in the Midwest?",
            "The best thing in this photo is the got damn tequila",
            "No Mexican restaurant owned by Mexicans would serve a meal with this Velveeta looking ass nacho cheese sauce...and especially wouldn't drown a burger with it",
            "Francesinha ?",
            "Stupid or not... I want that!",
            "Punishment for ordering a burger at a Mexican restaurant",
            "Somebody throw that burger a life buoy",
            "So…. This was presented as a menu option and they chose it?",
            "That's what he gets for ordering a burger at a Mexican restaurant.",
            "I got the queso burger from red Robin and it was like this. I would have preferred the queso on the side but it wasn't bad",
            "Mmmmm",
            "Give me that & go for another one.",
            "A burger covered in queso? I’d eat it.",
            "[deleted]",
            "Would",
            "Your friend got what they deserved.",
            "a gooey mess but also yes please all over me",
            "On behalf of my race, have a free Corona on the house. What shit.",
            "As a Mexican American this makes me cry lol",
            "I'd demolish that.",
            "I wouldn't even touch it or say anything. Just quietly leave as fast as possible.",
            "Mexicans try not to drown their food in oil, grease, or cheese. Challenge: impossible",
            "Foreshadowing",
            "Send it straight the F back. \n\nHand it out with a cup of cheese sauce: yes. \n\nSmother it like you had an accident in the kitchen and don't want to admit it: no!",
            "That’s vomit.",
            "Or it got shit on.",
            "The Kraft Dinner scalie just churned all over that burger.",
            "My buddy once ordered a burger at a local Mexican spot and it angered me so much.  That's until I had it and 🤯",
            "All these comments are going crazy over this  y'all need to check out the slopper from colorado 😂 basically a cheeseburger smothered in delicious pork green chile and cheese",
            "Mexican burgers are amazing, get some taste",
            "Why? Do they not like burgers in Mexico?",
            "Lol",
            "You're dumb as fuck, no authentic Mexican restaurant would serve this shit.",
            "And you can dip the fries. Perfect.",
            "This is almost always my response to stupid food: \"I'd have a bite.\"",
            "Me too.",
            "Oh yeah, I bet it is good as all hell. Looks like there’s some (likely spicy) peppers in the cheese sauce too. I’d tear it up.",
            "Authentically Mexican lava burgers are eaten with your bare hands.",
            "Don't eat things like this it isn't be healthy",
            "Tex-mex exists",
            "From my experience in North Denver a lot of mexican food places make tons of burgers (and smother them with green chile)",
            "I mean how do you know it's not a burger restaurant?",
            "You're worried about the restaurant plastic getting discolored? You have issues beyond the scope of this discussion.",
            "It’s so weird that people are a-ok with smothering a burrito, tortilla chips, fries, etc…but draw the line at smothering a hamburger.",
            "If that's what you're going for, fine.  Just leave off the bun and just pour the queso straight onto the burger.",
            "They could have just done a standard cowboy burger",
            "Go swimming",
            "You think queso looks like puke? Do you also dip your pizza in a ranch or mayonnaise?",
            "Sorry to bother you again, but my milkshake just came all over my face",
            "Foreshittowing",
            "That bottom bun is going to be so soggy 🤮",
            "\n>Send it straight the F back. \n\nDid it say it would be served like this in the menu?  Is so that on the dinner.  They received exactly what they were told they would.",
            "Yeah, I probably wouldn’t order a burger at a taco place, because that’s silly but if it’s somewhere that does mixed cuisine they can make some damn good burgers. I don’t know why people hate on Mexican burgers, they have a pretty long tradition of cattle ranchjng and bbq.",
            "Did someone at least clean the cheese from your head",
            "CHUBBY'S!!!!",
            "Yeah… this isn’t that.",
            "So just like American ones?",
            "Use a spoon 🥄 , you’ll get every drop.  Just like Campbell’s Chunky Soup!",
            "Same. So many posts here seem to be just incredibly messy, unhealthy foods that still look like they taste pretty good.",
            "Fr.",
            "And it's dog shit",
            "The title of post answers your question.",
            "No look at it again. Where the cheese touches the basket becomes rusted",
            "Que?",
            "I’m not a milkshake",
            "Excuse me, over here! My fajitas have paid off all my student loan dept and taxes!",
            "So are your thumbs, your cheeks, your nose, your shirt...",
            "I made the mistake of getting a hot beef sandwich in Chicago one time... Freaking bread was so soggy and so gross.",
            "I’d figure a place that is known for cooking a ton of ground beef every day could manage a burger.",
            "I fucking miss that place!! I can't find anything compared to them where I live! That spicy green chili fries served on a king soopers paper plate stapled together",
            "It looks pretty similar and it's like a regional thing. Oh I how I miss the green chile fries",
            "I hate that you called it chunky soup \n\nBut I also love stew so I'm conflicted",
            "How?",
            "I see that. It's hard to tell what's causing the discoloration. The basket does appearmetal at second glance. But that still doesn't mean the \"cheese goop\" is causing the discoloration of the [freedom fry] basket,\" as the other dude suggested.\n\n\nP.S.: Those aren't chips, and leftovers get wrapped up in aluminum (silent second 'i' is optional).",
            "Queso!",
            "Seriously. Even if you eat it with a fork and a knife that shit is getting everywhere 😬",
            "It was really good! To provide context,  my friend was a white guy and I'm Mexican, and I thought initially it was heresy.  But I just said fuck it,  I had tacos before at this location. Let me try something different.  Glad I did.",
            "Is this from the same region? Ok",
            "Campbell's makes a line of chunky soups though.",
            "Burger at a mexican rest.",
            "I've gotta agree that it isn't rusted. That's just cheese goo and flash.",
            "Ja ja ja",
            "My friend made a rule to order burgers at Mexican restaurants any time they had them because of how interesting and different the burgers were made.",
            "Idk I wouldn't doubt they do things like this in the Denver restaurants",
            "I remember when they used to come in a plastic ‘microwave safe’ tub to cook them in, but you’d get it out after the recommended time and the shape was all fucked and the dyes from it are in your soup 😀",
            "It could be a burger restaurant. I don't get it. Do they not have burger restaurants in Mexico?",
            "I am glad I don't remember that, or at least never experienced it!",
            "As a Mexican yes, we do have burger places. They tend to just add some ham on top of the patty. Idk why all the white people in here are acting like they know Mexican culture.",
            "Are you serious. This person didnt order a burger in mexico or a burger at a burger rest in mexico.\n\nThey ordered a burger at a mexican restaurant.",
            "It was horrific 😀 plastics in the early 2000’s were a fever dream",
            "I can tell from this comment you're from Texas. You're not Mexican, you're an American with Mexican heritage\n\nve a Juárez y diles que eres mexicano sin que se rían guey jajaja",
            "Yes. A restaurant in mexico... that's what \"mexican\" means.",
            "Soy de Tamaulipas, pero pos si estás así de pendejo ni para que discutir contigo 💀",
            "[Tamaulipas, Texas?](https://www.reddit.com/r/LoneStarGhetto/comments/1clr1bb/comment/l3261fz/?utm_source=share&utm_medium=web3x&utm_name=web3xcss&utm_term=1&utm_content=share_button)"
        ]
    },
    "$60 after tax and tip.": {
        "title": "$60 after tax and tip.",
        "score": 6797,
        "url": "https://i.redd.it/683v0f1w4y7d1.jpeg",
        "content": "",
        "num_comments": 1057,
        "comments": [
            "Private msg me OP I have these beans that are magic for a great price...",
            "Stupid food or stupid person?",
            "you literally went to erewhon\n\njust dont touch erewhon with a 6 foot pole",
            "Wtf is with the recent trend of “let’s give the most expensive store our money for posts”. I have never heard of this place in my life and in the last week I have seen it come up in about 10 videos where everyone just throws away like $200 on a bag of chips and some water",
            "OP... Are you ok? Is there a reason why you're acting this..\n\n\nLooked it up online and they are $22.. how can someone charge $22 for a smoothie and there's no money to pay the person making it. \n\n\nJFC",
            "Just looked at the menu. \n\nI think they are\n\n(Pink)\n\nHailey Bieber's Strawberry Glaze Skin Smoothie\n$19.00\n\nMalk almond milk, organic bananas, organic strawberries, organic avocado, organic dates, organic maple syrup, Vital Proteins vanilla collagen, vanilla stevia, sea moss, organic coconut creme, Driscoll's Organic Strawberry Glaze\n\n\n(Blue)\n\nCoconut Cloud Smoothie\n$18.00\n\nMalk organic almond milk, organic pineapple, organic banana, organic avocado, organic almond butter, organic vanilla collagen, vanilla stevia, blue majik, and organic coconut cream.\n\nIf anyone was wondering. I think this is $40 bucks before tip and after tax.",
            "Why the fuck would you have to tip? This place has $20 smoothies, they have the money to pay their workers a decent wage more than anyone!",
            "I mean it’s Erewhon, it’s known for being expensive.",
            "More like stupid OP tho",
            "More like /stupidcustomer",
            "Why? Why would anyone buy this?",
            "Unless they put literal cocaine and gold in those things, you're insane for paying that much",
            "OP.. You're an idiot why buy something so expensive and then complain about it on reddit???",
            "WTF? You got massively ripped off for some fruity, icy dyed water.",
            "Then don't buy it? The food/drink itself is fine, it's just expensive.",
            "It’s a smoothie what could it cost? Thirty dollars?",
            "I've had decent steak dinners for less than that.",
            "we should make a new sub called r/stupidConsumers about people who actually pay for stuff like this lol. Unless this was 5 dollars and they gave 55 dollars as a tip, because they are a gigachad.",
            "60 USD?????\n\nBro break up with your girl",
            "What's in them OP?",
            "And yet still using shitty plastic cups and the straws that I can’t believe are legal in LA?  For that price I expect a souvenir cup made of recycled glass",
            "Is this place like rita's?",
            "Well why'd you give a $50 tip for.",
            "Anyone paying this kind of a price for a smoothie is special kind of stupid.",
            "OP, are you interested in purchasing stocks as well? Something just came across my desk, OP. It is perhaps the best thing I’ve seen in the last 6 months. If you have just 60 seconds, I’d like to share the idea with you. You got a minute, OP? The name of the company is Aerotyne International…",
            "Soooo why are you posting it? You just made a terrible decision and now you are going to reddit to face it💀",
            "I have a bridge for sale if you're interested?",
            "I hope that shit is not Herbalife.",
            "da fuq????\n\n(It's made of people, isn't it!!!  ;/)",
            "Well... Blue *does* have the most antioxygens...",
            "Anyone buying that deserves it",
            "Is the food stupid for being overpriced or is it the customer for paying said stupid prices?",
            "It's not the food that's stupid",
            "Its one banana Michael how much can it cost, $10?\n\nAt Erewhon it does cost that much",
            "Go to 7-Eleven and get a slushy there and save yourself $55",
            "The food isn’t stupid, the person buying it is.",
            "Stupid food? More like stupid customers for willfully ordering while knowing what it cost.",
            "Bro paid $60 for reddit karma",
            "tell me you can't afford groceries this week without telling me...",
            "OP this is on you and not the store. You decided to give them your money\n\nWhy is gen z so terrible at financial decisions yet complain about this shit anyway? Like personal responsibility is so fucking dead",
            "congrats? They should have charged $70 if you're willing to pay $60",
            "Looking them up, looks like a bougie version of wholefoods that only wants rich clientele they can price gouge. I'm sure you get some nice products in there, but you can probably find the same elsewhere for cheaper if you know what you're looking for.",
            "celebrity and trust fund store",
            "So are there drugs in that? Otherwise that seems like a rip off",
            "I’m sorry you paid how much and stilled tipped??? Their employees cannot possibly be underpaid at that rate",
            "Lmao why would you tip for that",
            "And you still decided to buy them?",
            "All the more a fool for buying them then",
            "Do people not read prices before they order??? Enjoy ur cool drink",
            "Why won't op reply to anyone?",
            "I don't go out to eat anymore because it's all so gd expensive",
            "At that price they wouldn’t be getting a tip.",
            "Those better give me the ol' reach for that price!",
            "You think I could have a sip of that?\n\nI gotta know what a $30 smoothie tastes like",
            "What is it?",
            "That's more expensive than a whiskey in one of the highest end hotels in London. What the fuck?",
            "You make bad decisions often?",
            "You paid for it lol",
            "Well, at least the blue one is pretty to look at…",
            "They sell a lb of grapes for $20 lmao",
            "Why would you still buy it then ???",
            "Some people are just follower influenced by marketing and trends",
            "And they couldn't even spell \"Nowhere\" backwards correctly?",
            "no sympathy...it was a choice. Hope it was worth.",
            "A fool and their money are easily parted.",
            "My friend bought me a smoothie from there once, and it was so fucking mid. Yeah - there's add ins that are good (collagen etc) but there's zero point in consuming that one time. 😂 it would have almost zero benefit",
            "Then don't buy it? You're complaining about your own stupid decisions LMAO",
            "Was it worth it? The blue color is very off putting. Looks like it’s going to be cotton candy.",
            "🤡 drink.",
            "I see those are $20 each. So you paid $40 and tipped $20? Have you considered beach front property here in Arizona?",
            "OP I happen to be selling a bridge in Brooklyn if you’re interested",
            "I got a beach house in Idaho you’re going to *LOVE*",
            "That is truly stupid! Why?!?!?",
            "I have a private island for sale!",
            "I’m not sure it’s the food that’s stupid here.",
            "Dipshit",
            "Why tf would you tip someone to make that drink lmfao",
            "Sorry. Sorry. ***Erewhon makes you tip?***",
            "If you dont want to pay $30 a drink then don't order from a place that is known to be an expensive rip off for rich people. Don't feel bad at all for you",
            "Those MF'ers are not real. \n\nYou can pick what level you want to apply that comment.",
            "It's not stupid if idiots keep buying it.",
            "Imagine going to ERWHON then complaining about the prices.",
            "Hey, everyone, some dipshit paid $60 for two slushies!",
            "Wow. People are making stupid food purchasing choices& posting it under stupid food. Now that's just stupid & has nothing to do with food.",
            "Is there horse cum in it? Wtf¿?",
            "Why so expensive",
            "wth $60? That's crazy booboo.",
            "You still paid for it.  Who's the bigger fool: the fool, or the one who follows him?",
            "Are those blood and crip tears?",
            "Is it the food that's stupid, if you paid and tipped $60 for this?\n\nWtf is this, smoothies?",
            "What is that some type smoothie that cost a phone bill ?",
            "How? Like I have no doubt at all that some greedy MF would ask that much for 2 slushies but how are *you* like \"ok I'll do that, I'll give him $60 for two slushies\" ? \nLet's say I didn't know who I was dealing with, ordered 2 slushies and they are like \"That's $51.64\" . I would not feel the least bit of shame simply saying nevermind, you keep your $30 slushie.",
            "I've got a bridge to sell you.",
            "lol what is it ?and why  are they 30 bucks each",
            "If I'm paying $22 for a smoothie you aren't getting a tip. ",
            "Ahh, a self-own. Those are rare.",
            "Why the FUCK would you tip for them just handing you a drink??? U americans are MAD.",
            "OP getting roasted in the comments. Imagine being not only stupid enough to pay that. But then to post about it, good lord",
            "No it's not the food that's stupid...",
            "They're expensive because people like you are still dumb enough to buy them.",
            "Is this some sort of rich people thing I'm too poor to understand",
            "You are a member of r/handbags and r/hyte.\n\n\nYou're just a brainless consumer, corporate piggy bank.",
            "More like /stupidpeoplewhowastetheirmoney",
            "[Bullshit.](https://erewhon.com/browse/tonic)\n\nUnless you went out of your way to get the most expensive options possible.",
            "what the fuck? why?",
            "why the FUCK would you tip? actually, why the fuck would you buy 20$+ drinks? this is entirely self inflicted. zero sympathy. they sell overpriced shit like this because some moron will come along and actually *pay for it*.",
            "Ha! Nice try. [Erewhon’s smoothies….](https://erewhon.com/product/7784411000/coconut-cloud-smoothie?referral=search)",
            "This is why every company asks for a tip. Cause some idiot out there will actually do it",
            "Making the smoothies at home taste way better than the real thing \n\nStrawberry glaze I do this:\n\nBlend the following ;\nAlmond milk \nDates\nMaple syrup\nFrozen strawberries \nAvocado \nSea moss \nProtein powder \n\nFor the glass:\nCoconut cream layered with strawberry glaze\n(I make my own strawberry glaze by cooking strawberries w maple syrup and cool it)\n10/10 everytime.\n\nErewhons version was grainy, lacking flavor, and over priced",
            "Just looked this up and it costs $37 which is insane but $23 in tax and tip?",
            "The food is not stupid as it has been paid for. For the buyer I have some bad news, though.",
            "“Guys I went to the hyper expensive place and it was hyper expensive!”",
            "You bought erewhon, this is on you",
            "The brand is owned by Justin Bieber’s wife.",
            "If idiots buy shit for stupid amounts they'll keep selling it for stupid amounts.",
            "I’m sorry, what?",
            "So you saw the price, put it in your cart, you ordered those drinks, you see the total before you order and you order. \n\nThen post on this sub that these drinks are stupid. Mmmkay.",
            "I don't think the food is the one that's stupid",
            "It’s everywhere. I’m just done going out.",
            "It better have drugs in it!",
            "Do they at least have 4 shots of hard booze in each one?",
            "I swear people that live in LA love having their money trendily stolen from them.",
            "How dumb can people be to buy a smoothie for $30 each?what do they put into it that makes it worth so much",
            "I'm not sure the food is stupid if OP willingly paid so much for these.",
            "I don't believe you.\n\nEDIT: \n\n1x Hailey Bieber's Strawberry Glaze Skin Smoothie, $19\n1x Coconut Cloud Smoothie, $18\n\nThe prices are fucking stupid, but you also tipped the price of an entire third drink, plus whatever the sales tax was.",
            "Well of course!  Those are tumblers full of ethically sourced Yeti semen collected from the back and front penises of the Illinois Bigfoot.  That's a steal of a price if you ask me.",
            "You knew how much it was going to be when you ordered it. It’s not like pricing is hidden. The foods not stupid, you are.",
            "Hit me up OP, I’ve got a bridge to sell you.",
            "You went to LAs most expensive grocery store and decided to buy something then complain like you didnt see the price?",
            "Pro-tip: use the custom tip button or do no tip. Erewhon will be just fine with low tips or no tips.",
            "Congrats, you played yourself.",
            "Fool.",
            "Yeah… I went to Jamba Juice instead and got $1 smoothie today for National smoothie day. I think I’ll pass on erewhon",
            "30 dollars for a smoothie?! LMAO! 😂",
            "EREWHON",
            "Two slushis at a NFL game? Thats a good price!",
            "Stop ordering expensive door dash? Prices for those services have reached absurd levels.",
            "I can believe that. That store is expensive as fuck",
            "Was it good? please someone respond if these are good.",
            "Butttttt you could have not bought it????",
            "I like to think the name is Stewie from family guy saying \"Nohwere\", and they thought, \"I know let's reverse it to be cooler.\"\n\nThere's prolly some bullshit story about the founders journey to health, sourcing the most pure esoteric sparkles for a gut cleanse or something like that so they combined their middle names but I like mine better.",
            "Stupid person*",
            "What is it? Printer ink?",
            "Why did you tip $20 on $40 in shakes? That’s no one’s fault but yours. That’s an $8 tip if you hit the 20% button.\n\nSounds like OP was just trying to impress his date, or maybe the blond yoga-body half his age behind the counter.",
            "$45 Tip",
            "You bought 2 smoothies at $30 a piece. OP wtf are you smoking?",
            "Only one for gender reveal",
            "Look at this person, children. Now point and laugh. Yes, Timmy. They *are* very stupid.",
            "r/stupidpeople",
            "Haha I actually got the 19 dollar Hailey Bieber Strawberry Skin Glaze Smoothie before! \n\nI stopped by Erewhon on my way back from CicLAvia, an event where we cordon off big streets so only pedestrians and cyclists can use them, no cars. \n\nI had also listened to an LA podcast, How To LA, that talked about the history and design of Erewhon. Apparently it's a pretty old company that focused on bringing organic food from farmers to the people before it was cool, which was later bought out and turned into the mega-rich grocery store today. \n\nThe podcast host got the smoothie and said it was a 10/10, and after trying it myself, no tip (why tf would I do that), I gotta say it was one of the best smoothies I've ever had. Such a great flavor of strawberry and not too sweet. I actually talked to the host later that day about the smoothie at a book fair held at USC. \n\nAnd then I just walked around the store pretending I'm rich. It was interesting noting several details of the store gleaned from the podcast. There's like no signs above the aisles telling you what is where, so it feels in a way like a small treasure hunt at a thriftstore except you're finding 40 dollar ionized alkaline acidic organic crystal energy water. And also the aisles are really tall to block out the sound and envelop you almost, along with the beautiful arrangements of the fruit and vegetables. Also the checkout area has no conveyor belts and is quite open compared to the labyrinthine aisles behind, probably to reward the customer with human interaction afterwards. All of this is in the effort to make Erewhon an experience, not just a grocery store, which I guess appeals to the rich who want to feel special and shop somewhere with no proles. And by experience I mean psychological tricks like every grocery store does. \n\n\nNow, would I ever step foot in an erewhon again? FUCK NO, I'm a cheap ass in general, but I was in the area and I'll gladly spend money on LA experiences like these once in a while.",
            "Seems like the food itself might be pretty good, just the price that’s stupid",
            "The fuck is it??",
            "Hilarious, the expensive ones are branded by celebrities. One is some sort of Hailey Bieber skin smoothing thing, the $23 one is from Kendall Jenner. 🤨",
            "Why did you do that? 😭",
            "I'm fine with people who have \"fuck you money\" spending some of it on dumb shit.",
            "It's Erewhon, you can't complain about stuff being overpriced there",
            "You’re stupid erewhon is genius to get idiots to buy these",
            "What currency are we talking about? Just an amount doesn’t give me a sense of value.",
            "Why the purchase?",
            "For what!!!!!!",
            "This can't be USD or CAD, right?",
            "How much was the tax and tip???",
            "I just don’t believe this post.",
            "i own this bridge in brooklyn that i'd be willing to let go at an absolute bargain!",
            "Yeah It’s not the food that’s stupid.",
            "Never ever give that place money",
            "You have to at least say what it is",
            "Why did you buy it then?",
            "You got scammed dawg",
            "Are there drugs in em?",
            "I dont even know what these are but why are we tipping on anything other than table service and delivery?",
            "Why would you tip for someone blending something?",
            "Who would pay that? Better be 5 or 6 shots in each of those !!",
            "A fool and his money are easily parted",
            "Idk if this is the foods problem",
            "For $60 it better be mostly alcohol.",
            "What is in them?",
            "Are these the colostrum smoothies? Erewhon is something else",
            "so dumb",
            "Well, yeah. It's Erewhon.",
            "Why the fuck would you brag about this?",
            "You're a moron",
            "There really IS one born every minute!",
            "Ok, but why did you buy it?",
            "Is there alcohol in this",
            "OP, did you willingly get scammed? Or do these beverages give you a huge dong and the ability to see thru walls lol",
            "You purchasing these drinks just reaffirmed Erewhon into believing it's okay to sell things at this price",
            "How do you rob yourself?\n\nOP: Hold my whatever this drink is.",
            "Why did you tip.",
            "You stupid mfer",
            "I’m a cap equip med rep and used to take plastics to train in CA. One day they asked if I could pick up smoothies for the staff and dr’s at the training. 15 people, it was over $400 lol",
            "Did you give a $50 tip?",
            "I paid 7 dollars for a monster energy at the Chicago airport 30 mins ago.",
            "It’s like people forgot blenders exist to make your own ?",
            "If he hasn't got in touch, I might be interested in buying them.",
            "Wait, are you also the author of \" The Ultimate Guide to Throwing a Garden Party?\"\n\nIs this James Trickington?",
            "I have a bridge in Brooklyn OP might be interested in.",
            "Don't listen to them OP!  Talk to me about Invigaron: an opportunity as rare as the abani berries themselves",
            "You got magic beans?!",
            "Professor Copperfields miracle legumes?",
            "Magic beans?  I don't get out of bed for any less than a golden egg.",
            "Would you accept one prized bovine creature in exchange for the beans?",
            "I've got some oceanfront properties in Arizona he may be interested in.",
            "Yes",
            "Previous posts they don't leave the house. Probably got delivery and a heavy tip.",
            "It's not his fault. Op had to tip 50 bucks.",
            "One is enabling the other.",
            "I'm convinced Erewhon is a real world psychological experiment on human desires.",
            "Erewhon: where stupid food and stupid people meet.",
            "Someone has to support the nepobaby economy.",
            "i have no idea what erewhon is, but it sounds made up. like a place in a young adult fiction.",
            "What is that, like an Amazon brand smoothie? Is it going to change its name to \"Remelar\" next month when it gets enough bad reviews?",
            "From Wikipedia:\n\nThe name \"Erewhon\" is derived from the 1872 satirical novel [*Erewhon*](https://en.wikipedia.org/wiki/Erewhon) by [Samuel Butler](https://en.wikipedia.org/wiki/Samuel_Butler_(novelist)). In the novel, Erewhon, an [anagram](https://en.wikipedia.org/wiki/Anagram) of \"nowhere\", is a [utopia](https://en.wikipedia.org/wiki/Utopia) in which individuals are responsible for their own health and prosecuted for the crime of being ill.\n\nSounds spot on!",
            "Based on just the thumbnail I was coming here to make a joke like \"what, did you go to Erewhon!?\"and then I saw the full picture and, yep, they went to fuckin' Erewhon.",
            "The reason why you've never heard of it is because it's a luxury grocery store only in la. I also think there's like maybe 10 of them.\n\nRegardless op is incredibly stupid for not only buying them but also door dashing them. But fools and their money as they say.",
            "My favorites are the ones from Highway Service Plazas outside big cites where everything has been stupidly expensive for decades with titles like \"Bidens Economy\".",
            "My favorite part is this place is called erewon, but that’s who they’re pricing out",
            "On a related note, what the fuck is with Yeti products? I knew their coolers were ungodly expensive, but now they have a $300 folding lawn chair and their ice packs are $25 each while Igloo's are $4. And yet people go nuts over their stuff. Other manufacturers will notice and start raising all their price levels on basic goods, too, and before we know it, we'll all be unable to afford anything.",
            "This is easily double what a normal couple of smoothies there would cost. They must’ve added everything expensive they could.\n\nSource: live in LA and have been several times. It’s expensive, but really not that wild if you even vaguely pay attention lol",
            "I think I'm going to start selling stickers so people can put it on any cup for a buck.",
            " we wonder why the politicians tell us that our morning coffees are the reason we’re poor and then we provide them with ammunition like this…\n\nEdit for clarity: I wholeheartedly disagree with this argument and simply recognize that politicians will use anything and everything they can against their own citizens.",
            "The worst part is you'll see so many people defending it. Whether they claim it's the ingredients, or they just simply make an ignorant comment about people being broke, and if you don't like it, don't buy it.",
            "Well they be using a $20 ice pack for it.",
            "$22 A PIECE?! This is the Worst Timeline. ",
            "How did they go from a subtotal of $44 to $60 after tax and tip. Tax should be around $4 depending on where you’re from, so that brings us to $48. A $12 tip would be 27%. For a smoothie place I usually tip closer to 15%. Unless you’re tipping both a high percentage AND after tax, in which case you are a sucker.",
            "Bruh, that tip alone is more than I’d be willing to spend on two smoothies. \n\n“Did you just order a $5 shake?”",
            "Wow, that is insane for just some \"organic\" ingredients",
            "You forgot the organic ice cubes",
            "There’s not even any booze!?",
            "Both sound disgusting to me. Too many things and why add stevia when both look to have plenty of natural sugar? Ugh",
            "Organic Maple Syrup always gets me.  It comes from a tree in the woods…how much more “organic” is it??",
            "Missed opportunity on organic stevia",
            "Cracking my ass up rn. \"Organic avocado\"\n\"Organic banana\"\n\nI could walk outside and pick that from a tree and white people are spending $40 on a drink using it",
            "Jesus.  We get it.  The ingredients are organic.   Fuck.  \n\nHate menu listing like that.  You can’t just say strawberries?  Like some jerkoff is gonna come into your backwards-spelled-ass store and see $20 smoothies and be like “oh but the strawberries are organic too rig—“ oh that’s exactly what happens?   Damn, my bad.  Christ these people are the worst.",
            "I just looked it up and Glassdoor says $14-20 an hour IN LA. Which is insane. I live in the Midwest in a low cost of living city and that would be low here!",
            "Why tho",
            "Social media.",
            "Are there drugs in them?",
            "OP didn't get ripped off. OP chose to buy it.",
            "OP saw the price and choose to buy it. Nobody got ripped off.",
            "It looks good tbh. I just looked up the place on google bc I wanted to go try a smoothie. Unfortunately, they’re only in California apparently",
            "They are the girl...\n\nGo look at her posts. Hasn't left their house basically in a year, ~500 dollar purse pictures, a fairly ridiculous \"omg, my first PC build\" that looks stunning, $60 shake orders.\n\nThis person does not live like us.",
            "Lies!!",
            "Mostly water",
            "Not sure if this is sarcasm or not, but no, Erewhon is just a fancy organic grocery store in LA (and maybe elsewhere, idk I only know of the LA on from the internet) that sells $20 milk and obviously $22 dollar “celebrity” backed smoothies.. it’s all just stupidly expensive stuff for stupid expensive lifestyle people.",
            "Can’t even blame the stores at this point. If you’re buying it, you’re the problem. 100",
            "Very often you dont know the price until after, most places these days only have the menu with no price next to the items to avoid having to reprint the menus",
            "\"heavy metal detox smoothie\". $18.\n\nThis is a complete fucking scam.",
            "That blue one looks like it tastes like Playstation 2. I have to try it.",
            "I have some lovely property in Antarctica you might be interested in.",
            "Have you read my erotic novel “Jack and the Peenstalk? You’ll never guess where he puts the beans….",
            "Happy Cake Day!",
            "Happy cake day!",
            "Happy cake day!",
            "Happy Cake Day!",
            "Happy cake day!",
            "Please, I need this book but it's always sold out.",
            "I believe the intricacies of the indoor/outdoor luxury barbecue with finger buffet have been covered thoroughly by Hyacinth Bucket (Bouquet)",
            "There's only one copy! How did you get ahold of it?",
            "That would be Jackie Treehorn",
            "Damn, I just posted about a bridge in New York and then noticed yours. I deleted mine.\n\nMaybe you could help me make some stone soup.",
            "Dee, where does he put his feet?",
            "I concur.",
            "Amazing",
            "Nope, just buying incredibly overpriced smoothies:\n\nhttps://erewhon.com/category/2006/smoothies\n\nThe ones they bought are $18 and $19\n\nso $37\n\nplus tax makes it about $41\n\n\nNot sure why OP left a 50% tip tho, maybe that's an LA california thing. More like they just exaggerated for effect and the price was about $50. Still insane for 2 smoothies though.\n\n\nGoole says the deal with that place is celebrities go there.",
            "Ah, the missing context.",
            "Idk... the drinks look freshly blended. No melting in the bottom of the cup yet. Might have been at the store. But you do make a good point",
            "its a store chain in la that sells overly natural overpriced stuff. It has a weird cult",
            "Can’t spell erewhon without nowhere.\n\nOr en-whore, whatever.",
            "At first I thought I was on r/antimlm and that was some Herbalife nutrition front\n\nI never heard of Erewhon so I looked it up. Not an MLM but some fad overpriced grocery store chain in Los Angeles.",
            "It's a grocery store for Hollywood celebrities.",
            "It sounds like they tried to write \"nowhere\" backwards to be edgy but fucked it up.",
            "It's like a upscale grocery store, but for idiots who want to pay 2x for the same stuff. \n\nI personally buy a pasta brand that is sold at Erewon for $20/jar. I buy it for $8/jar, usually stock up at $6/jar on sale.",
            "Erewhon is the most prestigious and most high end grocery store in LA, all the rich people n celebs shop there",
            "We must travel to Erewhon to retrieve the Seed of Life and Death and bring it back to the Golden Capital of Atriax! That old man who is not my father but acts as a mentor and can do magic but doesn't like to because he says violence is not the way will tell us where to take the dragon egg so it may hatch and guide us to the Seed of Life and Death! Also the antagonist is my long lost brother I didn't know I had but shhhhh we don't know that yet",
            "A base in the Ghost Recon Breakpoint video game. I had no idea they sold smoothies. Oh wait...",
            "It's the main safe house in Ghost Recon",
            "That’s why it anagrams to nowhere.",
            "[Looks like those smoothies run $18 for a 20oz with no extra toppings](https://erewhon.com/browse/tonic)",
            "It’s the grocery store for the 0.1%",
            "Every time I see or hear ‘erewhon’ all I can think “erewhon in the club gettin tipsy”",
            "Even the Los Angeles subreddit makes fun of it. They sell $20 strawberries that some people claim are worth it and other people have brain cells left and know they aren't.",
            "imagine if whole foods collapsed in on itself. Thats erewhon.",
            "Ok that explains it. I could make anything cost $60 if I door dashed it. OP gets no sympathy from me",
            "Lol so it's not so much about what you're buying but the \"exclusive\" experience you get to have the right to flex on others. The attention it will bring you to boost your self-esteem and value based on what others think about you, and those who disagree are simply projecting their jealousy /s, but regardless you're still getting attention from others when you buy their goods (probably what some of these folks are thinking).",
            "I stopped by the one in Calabasas once when I was working near by for a bottle of water, $4 was the cheapest one, but it was tasty",
            "Gas station right by an airport: Biden’s economy",
            "You mean rich people tell other rich people that things are expensive at the expensive place and that proves a point about spending habits?\n\nI fully agree with you, but it's only the dumb who fall for it.",
            "I work at a place in LA that has client-comped lunches regularly, and people order these all the time.\n\nI've had the Haley Bieber one (the pink one) a few times because it was free. I don't think I would even pay $5 for it. It's really a pretty unremarkable smoothie.",
            ">make an ignorant comment about people being broke, and if you don't like it, don't buy it.\n\nThat's their go to move.",
            "This always makes me laugh because there was recently an article, somewhere I forgot, that said the average erewhon customer makes like 40k.",
            "It reminds me of Jenny Nicholson’s Galactic Starcruiser review. If Taco Bell nachos suddenly cost 20 dollars, you wouldn’t say they’re worth it if you like them and can afford it. They’re still only valued at 3 dollars. You’re just overpaying because of greed.",
            "I'll defend that corporations can charge whatever they want for luxury products. And customers are free to pay those prices. \n\nCan't imagine paying that myself though.",
            "Are they buying ice from the ER?",
            "It’s just erewhon pricing most smoothie places are under 10 bucks",
            "Right? $22 for TWO is still too much.",
            "Tipping at a smoothie place? You mean the same place where you stand in line and then wait like cattle for your order to be made. You are the sucker.",
            "18+19 (from their website, not 3rd party markup) for pickup would be 37USD, plus ~10% tax, for 40.70, roughly.\n\nI'm guessing they ordered 3rd party delivery, paid upcharge, paid delivery fee, paid tax. Only way they paid $60 is they handed over three twenties and told them to keep the change, at which point you paid a 50% tip",
            "Your tipping culture fucking baffles me. ",
            "I'm guessing there's a employee healthcare fee or county sales tax not being accounted for",
            "It was probably like $56 and then rounded up to $60 for the post to gain sympathy",
            "But it also has Malk, now with vitamin R.",
            "You can add herbs, coffee, \"superfoods\", and a bunch of other things but no booze.",
            "This the 2024 equivalent of the “$5 shake” in Pulp Fiction",
            "I don't understand because strawberries, pineapple and maple syrup are already naturally sweet. Dates are often to used to sweetened nut milk (hehe). I'm not sure what the fuck \"strawberry glaze\" is, but I'm assuming it's also sweet as hell",
            "Organic indicates pesticides/herbicide use. Not whether something is grown in a forest or not lol. Pesticides and herbicides can absolutely used on maple trees.",
            "Do you know what organic means?",
            "I also live in the Midwest, and I'm pretty sure every mcdonald's in my city pays at least $15 an hour. I also live in one of the cheapest costs of living states in the U.S., so yeah, those workers are definitely underpaid all things considered. \n\nI'm not super familiar with LA's housing/apartment costs, but I feel like there's no way they could afford to live in the city.",
            "The minimum wage in LA is $17, so that is outdated.",
            "Because it’s where celebrities go",
            "So to advertise that they’re dumb as a brick?",
            "Yep. They said their 13yo saw it on TikTok. \n\n TikTok brainrot.",
            "Imagine spending thousands of dollars on fucking purses when you don't even leave your house.",
            "It also sells $26.00 water",
            "Not /s. I thought it was an italian ice maker doing the same \"boutique style ridiculous price\" thing.",
            "I read another comment that says they DoorDash’d this, so they would know the price before agreeing to it",
            "Forget his antarctic property op...I'm a Nigerian prince and have been trying to honor my late father's last wish to no avail but after a recent 23 and me test it's come to light you are my long lost but not forgotten brother...😊😇🥰\n\nIkr what a fortuitous turn of events you my brother are a prince like me, but it is with great sadness in my heart though that I must inform you of our late father's demise, his estate is being settled as we speak and for a small pittance(to cover taxes of course) we can get you what is rightfully yours like our father so wished with his dying breath, simply wire me a small sum to be disclosed shortly and we can get you what is yours and forever free you from worries of monetary inadequacy in the capitalist hellscape in which you reside.",
            "That is very generous of you, but I think living there would leave me feeling a little ice-olated from the rest of the world.",
            "Is it a bridge by chance?",
            "Fucking this guy, I have a bridge on Mars to sell! Gonna make you trillions once Musk puts his base in there!",
            "I have some oceanfront property in Arizona you’d like.",
            "We’re selling 1/4 acre lots on the moon and Mars … of course you need to pay landing fees and parking fees … and taxes … and …",
            "The drive to the grocery store would kill me",
            "I have some property on a star I can sell you for a good price, top quality stars at low low prices",
            "I have a beautiful ocean front property in Idaho that I think you would love.",
            "How close is this property to the alien base? I may be interested.",
            "I’ve got some beachfront property in Nevada too",
            "F*ck Antarctica, I have massive lands on the moon that I'm willing to sell for very cheap.",
            "Ya well you just wait until Defiance becomes reality and you'll be rolling in it",
            "Ooh a bridge?",
            "Can't even grow bean plants there. What kinda scam you runnin?",
            "Lucky for you, I may have an inside man that may also work for a local paper company...",
            "OMFG, I love this show❤️❤️❤️🤨",
            "He treats objects like women.",
            "Wave of the future, dude.",
            "Thank you doctor.",
            "Doordash delivery fees.",
            "And I thought a  $5 milk shake was crazy",
            "I read that the people who buy food there, don’t actually shop there. They have enough money to pay others to do their shopping.",
            ">Not sure why OP left a 50% tip tho, maybe that's an LA california thing.\n\nCuz erewhon with a cup getting tipsy?",
            "Fucking lol $12.50/lb for chicken thighs. We get them for $2/lb here, ,or worst case like $6/lb for high end organic. A fool and their money...",
            "There's not a smoothie in the world that's worth $18-$19. Suckers are born every minute.",
            "I live pretty close to erewhon and have been in a few times. It’s for people who think whole foods is for commoners. I have a theory that there wouldn’t have been any anti vax celebs or elite athletes if there was a super expensive vax with rare minerals and exotic extracts. Wealthy people want exclusivity even if just hot air being blown up their ass. ",
            "I hate this company so much and am picturing the idea being pitched to shark tank and them loving it, it’s like capitalism in blended fruit.",
            "For people who that the Whole Foods pricing was a challenge.",
            "Overly natural? Like the carrots have dirt and bugs on them still?",
            "That’s so weird, there used to be a hiking gear company similar to REI called Erewhon in Chicago. I guess they went out of business, but I had no idea and I was so confused why they were selling overpriced drinks.",
            "The blue does not look… natural.",
            "Basically. I know people from work who go and love to spend an exorbitant amount of money on some dumb smoothie or a regular turkey sandwich and say they “got it from Erewhon” as some sort of flex. It’s seriously so dumb.",
            "It’s for people who literally wouldn’t blink an eye at this costing $60. When you make multi-millions, this doesn’t feel overpriced.  ",
            "It used to be a good store back in the day before new owners took it over and made it into what it is now.....I live in the Midwest and a place like that would fail",
            "Sounds like those “healthy” protein smoothie places that are really just a temporary front that someone opens up to sell off their supply of Herbalife. I’ve seen multiple of these shops open up in random buildings near me and then close within six months to a year.",
            "What is natural about that shade of blue?",
            "They have $95 trucker hats on their website. It's one of those stores for people with more money than sense.",
            "what the hell is 'overly natural'",
            "They have great food though. At the end of the day being expensive isn't that stupid because it's all about what you're willing to pay. And usually the people buying a $20 smoothie have no problem dropping $20 on a *smoothie*",
            "At least this post is keeping new cult members out",
            "whore ne",
            "\"....A novel (1872) by Samuel Butler about an imaginary place called Erewhon. It is an attack on British attitudes of the time towards religion, science, the law, etc., using satire. The word 'Erewhon' is made up of the letters of the word 'nowhere'.\"",
            "What's fucking me up is that like 20 years ago there was hiking and camping supply store called Erehwon I used for Boy Scout stuff. The name sort of made sense for that type of merchandise.  Seems they got bought out in 2018 by Camping World, must have sold the name or gave up the rights.",
            "Color me curious.",
            "Wild that their organic whatever 5oz salads are as much as the Walmart ones here. Technically cheaper, since USD not CAD\n\nSome of their other stuff is actually cheaper too. Yikes.",
            "Because they're out of touch goobers with money to burn",
            "thats going to be a no from me dawg. idk who hailey beiber is, but she can keep her smoothie.",
            "The strawberries were $30. They’re Harry’s Berries and you can get that at some Vons and Pavilions in season for like $15. A fresh batch is a nice once a year purchase because the berries are $15 good. Not $30 good though",
            "Imagine if Whole Foods collapsed in on itself and formed a black hole that swallowed Goop and every Kangen water scam MLM dealer on the planet and the prices increased logrithmically according to gravity gradient as you crossed over the event horizon.\n\nI haven't even been near one but I've seen enough posts and pictures about their totally insane prices. The basically charge something between like 3-4x Whole Foods prices to probably as much as 10x market prices. Like I saw one post for a box of pink Himalayan salt that was maybe $5 at Whole Foods but was like $40 at Erewhon.\n\nIt's absolutely unhinged pricing even by LA standards, like the living, breathing punchline to the \"I mean, it's one banana, Michael. What could it cost? 10 dollars?\" meme.",
            "Nah, their smoothies are like $15 normally and the two OP bought are $20 a pop as they are celebrity smoothies.\n\nReally the only reason you should ever go into an erewhon is to gawk at how expensive literally everything is and to make fun of it to your friends.",
            "That's so on brand for LA.",
            "Shit I paid $17 for four sodas the other day in an airport. Did it ten years ago too ain’t shit changed 💀",
            "Uber charges me $150 for a 20 minute ride from JFK. \"Biden s murica\"",
            "Full Service, in LA. Premium.",
            "Unfortunately it’s more like the rich people tell the poor people that we spend like rich people when in reality 99% of us would never spend our money on this crap. I pucker a bit when I splurge on an extra drink at the gas station in the morning, I’d physically be sick if I had to spend $60 on two smoothies.",
            "same as any other brand name thing - the point is to flaunt wealth. it's no shock this store has gained such public awareness as the cost of food/groceries has skyrocketed. Food was used as decoration at some celebrity award show - it's literally a sign of wealth these days.",
            "That would do it. Everything can and will be price hiked if its understood by the company that the end-user isnt the one footing the bill.\n\n\nIf I knew my employer was paying for my meal, shit Id order a 22 dollar smoothie as well.",
            "Hailey Bieber? Is that a person? Famous?",
            "That is nearly always said by someone who can not afford what they're buying.",
            "Nah that’s about normal these days. I see smoothies range $8-12 normally",
            "The real suckers are the ones going to smoothie places to begin with lol. I make smoothies at home.",
            "Interesting. Makes sense, being lazy is expensive.",
            "Forgot the service charge that's separate from delivery fee and usually a percentage with min charge, fuck those guys.",
            "It doesn’t make much sense to us either. But usually I go off the amount of effort they give. I’m not above leaving 5% or nothing if they really suck at their job.",
            "Servers love it and I don’t mind tipping them. Pretty much everyone else can get bent.",
            "Pesticides and herbicides absolutely can be used on organic foods.\n\nAlso plants don't eat organics just a fun fact.",
            "But I have never seen them used in maple syrup production.  A tree is a tree in the woods.  You tap it, boil the sap, and you have maple syrup.",
            "Celebrities don't shop at erewhon, only people with more money then sense and wanna be influencers shop at erewhon",
            "Because it's where erewhon wants to go\n\n*Ba dum tssss*",
            "Lmao! Nope just a ridiculous Grocery store that charges ridiculous prices and yet for some reason people still buy it and then complain about the price 😂",
            "Forget antarctic, I am alien from a galaxy far far away.  I have a an amazing opportunity to tell you about on lush rich planet filled with a rare mineral called impossiblegetium.  Much money to be made if we join forces to mine this material.  I will sell you a generous stake in this operation because I am a good guy.  DM me.",
            "The guys property is Arctic",
            "The grammar and spelling here are far too good for a 419 scammer. ",
            "Very nicely Arcticulated",
            "Happy cake day!!",
            "Icee what you mean you buffoon",
            "Yeah, it can be a bridge. Worth $200,000, but I'm a little tight right now. You can have it for $500.",
            "MASTER JAMES HALPERT!",
            "I remember watching it so much growing up lol good times.",
            "Why didnt I concur?!",
            "They said in another post it wasn't delivered.",
            "That's a pretty fuckin good milkshake.",
            "They don't put bourbon in it or nothin?",
            "That is the $5 milkshake in today's economy.",
            "Whole foods is like the dollar tree next to Erewhon",
            "This. When Whole Foods became too mainstream, this is now the trendy spot",
            "What’s funny is if you shop smart, Whole Foods has really good deals at times and can be cheaper than other grocery stores. Erewhon on the other hand is a make money of off stupid people store",
            "Like where you can buy 'raw milk' for $19.99 or 'sea moss gel'.",
            "You actually grow them yourself!",
            "They don't shave or own shoes because you can't feel mother earth's life force through rubber",
            "This made me laugh loudly and unexpectedly and made my vocal cords hurt. I hate you.",
            "I don’t believe there is anything even remotely natural about that color blue.",
            "Lol I'm not the only chicagoan that had this exact same thought",
            "Their ingredient list says it's \"E3Live Blue Majik.\"\n\n>Blue Majik is E3Live's proprietary nutraceutical grade phycocyanin blue pigment, extracted from organic Spirulina (Arthrospira platensis)... Blue Majik is completely chemical-free, ensuring the preservation of the vibrant blue pigment's unparalleled purity and potency.\n\nhttps://e3live.com/collections/all-products/products/blue-majik%C2%AE",
            "Blue Spirulina",
            "I’m just out whoreen.",
            "ho renew",
            "My ex, Whoreen",
            "Glad someone referred to the book. : ) I have a vague memory of one of the great pleasures of the people of in the book was scratching or itching.",
            "The same guy is the inspiration for the \"Butlerian jihad\" in Dune.",
            "I would say Montebello but it's $6 on their website. The other two listed pastas are the same price.\n\nRao's marinara is $13 but that's the closest thing I find to pasta + jar.",
            "I know. I have had Harry's berries explained to me enough for a lifetime lol",
            "what the hell is a 'celebrity smoothie?' Did Ariana Grande spit in it or??",
            "“celebrity smoothies” — the dumbest phrase in the history of the world.",
            "to be fair, it is by far the best grocery store in los angeles. go into any erewhon and compare it to whole foods, sprouts, gelsons, ralph's, vons etc. erewhon charge a premium. but they provide a premium product.\n\nof course i would never buy a hailey biever smoothie from them.",
            "Always accompanied by \n\nTrumps Economy: ‘May 2020, nowhere TX’",
            "Same here, and I live near one of these dumb stores. I've been in it once or twice, but there's literally nothing I would want there. I would feel ripped off if I be l bought anything. I know what goes into what they sell, it's very cheap, but they're told it's rare or whatever. Just a bunch of snake oil.",
            "Some brands legitimately have better products though. There is a hard upper threshold for food. There's only so much you can do with a bird's diet, or how much nutrients you put in the soil. Even with something like clothes, the price might be disproportional to the product, but it's still a noticeably better product. Mid chicken is indistinguishable from their $12/lb chicken once it's cooked.",
            "Yes, a model who is the daughter of Stephen Baldwin (niece of Alec) and wife of Justin Bieber",
            "Bruh even if i had fuck you money i wouldnt spend $60 on two shakes cuz come tf on.",
            "Who the fuck thinks it's a good idea to spend that much on a drink?\n\nNah bro, that's just stupid financial decisions 101. And people wonder why 75% of America is living paycheck to paycheck",
            "Hey don’t rip on smoothie places. Can they be overpriced? Yes, but I love my smoothie places.",
            "i got paid 3.25 an hour by Papa John's when i used to deliver for them in 2016",
            "I feel like every \"have you met a celebrity\" thread recently has a story about meeting someone at erewhon",
            "Forget the alien, I work at a school of witchcraft and wizardry of some renoun, and our recent telling of the cards has shown us that you could be quite successful in our program.  If you're interested, and you should be, simply fog up some glass with your breath and then write yes with your index finger.  We'll send you the details afterward, and all you'll need to do is hail a magic taxi from your backyard by popping a red balloon.",
            "Forget all of this.  I'm holding a super luxurious music festival with top of the line glamping.  Tons of artists will be there, and not some trash tents and sandwiches (this time), promise!\n\nYou can even have a private dinner with Taylor Swift (when we book her) for an extra $100,000.00. \n\nPromise.  I just need a slight down payment of $15,000 from you and two of your friends...",
            "what you mean by n-icely articulated?",
            "Do you accept bits of string?",
            "Frank would have concurred.",
            "Doesnt make sense then, how does it go from being $40 to suddenly $60?",
            "A recipe book I have has their interpretation of what that milkshake would have been. The secret ingredient is apparently tonka beans.\n\nI have no idea what those are or where to get them, so I can't tell you how they taste in a milkshake, but now I've shared my pointless little tidbit of trivia.",
            "Milkshakes start at $6-7 here in Hawaii and they all suck because theyve been shrinkflated as well.\n\nWant a good one? Go to the local shops for $10-12.\n\nFuck I'm.old",
            "A shot of Pappy van winkle 26 yr at those prices",
            "How are you pronouncing this word Erewhon",
            "Water and food coloring for 60 usd. OP must be at Disneyland",
            "Yeah these days Whole Foods is comparable to Safeway for usually higher quality. Still not usually worth it compared to an Aldis or something but they often have different ranges of products anyway. But Erewhon is never worth it",
            "Had to look up the latter; as I suspected it's carrageenan-thickened shelf-stable fruit smoothie.  It's a good thickener, but nothing overly special or superfood-y.",
            "Sea moss gel has a long history in actual natural food communities and is not nearly as expensive as Erewhon would have you believe",
            "There’s nothing wrong with sea moss gel. It’s very nutritious. I pay $27 a jar for it.",
            "How is something \"chemical free\" that's actually impossible. I hate mfs who throw the word chemical around as if it means it's a bad thing, don't these idiots know everything is a chemical?",
            "Nutraceutical 😂",
            "Damn, rich people will buy anything as long as the description is long and filled with complicated sciency sounding words",
            "Ok, the description is dumb as hell but Spirulina is so good and so pretty!",
            "Whoreen, whoreen, whoreen, whoreeeeeeen, I’m beggin of you, please don’t take my man",
            "\"Utopia\" in the original Greek meant \"nowhere\" (ou = \"not\", topos = \"place\") although it can also be a pun --    (eu = \"good\" and topos = \"place\") -- meaning \"Good Place\".",
            "Rao’s is honestly better than it has any right to be.",
            "It's Blueberry Beyonce Bathwater",
            "They’re smoothies that they get celebrities to promote.",
            "Honestly as someone who does by more produce then anything nah I have to fully disagree. Whole foods or sprouts are much cheaper and the produce is just as good, and the farmers markets are also cheaper and better quality.\n\nRegardless I'll still stick to going to Ralph's. \n\nBut hey, that's just my opinion and if you enjoy shopping at erewhon then power to you.",
            "The GOP has caused a big recession during every one of their terms since Eisenhower.   AND convinced their voters they are good with the economy because during those recessions the price of gas went down.\n\nThat are either very smart or their voters are very dumb.",
            "There used to be a good and cheap smoothie place near the dog groomers that I’d always hit up but most of the places are over priced and not that good",
            "I consider you a server and always tipped accordingly tbf. Same for all delivery. It's the places that just ring up my order and have a tip option that have given tipping a bad name.",
            "You also have just as good of a chance to see them at a Ralph's or Starbucks, it really just depends on which part of the city you're in and what tier of celebrity you're talking about.",
            "I’m just here to tell you about your cars extended warranty",
            "Ooh that's cold bro",
            "N-icely ARCTICulated… get it right /s",
            "Maybe OP picked the rage bait flair because he's the one posting fake rage bait.",
            "Using the link above, I turned a $19 smoothie into a $155.50 smoothie by using the option to customize it with additional ingredients.",
            "Nobody lies on reddit to exaggerate their stupid decisions, ever\n\nShocked this isn't /r/povertyfinance tbh",
            "Now I want a milkshake. But, like, from McDonald's or Arby's.",
            "Air-Juan",
            "Nowhere?",
            "TV show \"you\" has a similar store named \"Anarvin\"",
            "It's nowhere backwards with a letter switched. So clever eh?",
            "Nah, Disney food doesn’t cost this much unless you’re including admission to the park in the price calculation.",
            "I believe the color is from dehydrated blue algae or something like that. I saw a woman review it once, and she listed all the ingredients. None of them sounded bad, and she said it tasted very good. \n\n>!Please do not mistake this as an endorsement for 30 dollar smoothies.!<",
            "It’s naturally colored with strawberries and blue spirulina",
            "It grows where I live we call it sea moss. We just dry it, and then use it like you would gelatine. But steeped it makes a great drink with a can of condensed milk, ordinary milk, sweetener of some sort and nutmeg.  And sometimes (usually) rum.",
            "Apparently the food police types are mad at carageenan now too. It, like many foods and food products, has \"chemicals\" in it.",
            "Light is. \n\nTaste\nThe\nSun",
            "if you want your shits to be blue just pour blue razz koolaid into vodka like us poors do.",
            "Chapter 1, Page 1 of my high school chemistry textbook explained how literally everything we can touch and see is a chemical.",
            "I have the same issue with \"organic\". Organic chemistry is  related to carbon-containing compounds. Which is basically every food we eat apart from, I don't know, water and salt?\n\n\"Natural\", \"organic\", \"chemical free\" are just advertising slogans. And people are stupid enough to buy this shit.",
            "By being nutraceutical duuuh!",
            "It's easy to sell things to stupid people.\n\nMy local butcher advertises \"gluten-free\" turkeys at Thanksgiving.  I asked him about it, since all meat is gluten-free.\n\n\"*I know that and you know that but the people that don't know these things will buy anything with a buzzword.*\"\n\nAnd it's not like he's lying.  They are gluten-free.\n\nThat's what happens with these \"free of chemicals\" people.  They don't understand basic science and see the word chemical as scary.  So, say things are free from chemicals and they'll buy your chemicals.",
            "woof. Still trying to wrap my head around that one.",
            "This actually got me irl",
            "Probably, its like going into a Wendys, getting the $5 biggie bag, tipping $100, then posting it here saying how stupid it is that a biggie bag from Wendys is $105",
            "Yeah, I made an $8 smoothie into a $106 smoothie. That is crazy. Also, deer antlers? Ant essence?",
            "You cant make me.",
            "Get to stompin in my Air Force Juans",
            "Yea, I spent $60 *total* for my food & drinks when I visited in August 2022. Single most expensive item was a Dole whip float for like $12.",
            "Yup.  Also called Irish moss.  The one time I homebrewed beer, I used a bit of the powder as a clarifying agent.",
            "Light has physical weight",
            "Exactly, nothing wrong with some artificial blue and vodka",
            "Errone gonna make you AirJuan at hair one if you don't get 'er one",
            "Those Dole whip floats a fcking delicious, though. I also got one a couple years ago when I visited. We ended up getting grocery delivery so we could cook in our suite, and only ate at two restaurants the whole time we were there.",
            "It has momentum, but not mass. Anyway it’s not a chemical.",
            "Oops. I'm wrong."
        ]
    },
    "Judge for yourselves": {
        "title": "Judge for yourselves",
        "score": 477,
        "url": "https://v.redd.it/ahjs31x5b18d1",
        "content": "",
        "num_comments": 158,
        "comments": [
            "Isn't this basically just elotes with Doritos and pineapple sauce? Pineapple sauce might be too sweet. But, seems fine for street food.",
            "needs more chips for the amount of sauces and things i think 🤔",
            "I could do without the pineapple sauce. Maybe a squeeze of lime?",
            "Fact: Mexicans love corn,  cheese, msg, fruit sugar, and mayo.\n\nThe stupidest part of this video is the lack of hot cheetos.",
            "I'm okay with this.",
            "I'm going to continue to believe r/stupidfood is mostly people that lack culinary creativity...\n\nI wouldn't eat this because I hate mayo, but there's nothing stupid about this.",
            "I’d fuck that shit up.",
            "savory parfait",
            "Esquites from a street vendor in Mexico City is one of the best things ever . The least stupid food ever posted here.",
            "These are called elote cups. They sell shit like this at the food trucks in my town.  The only thing I can't handle is when it's 110 degrees and it's all that hot mayonnaise. You've really gotta be willing to get down with the mayo and not barf. Besides that this shit slaps.",
            "OP google esquites",
            "So an esquite",
            "Just Mexican street food.",
            "Would. \n\nIn fact, I may.",
            "He used Mayo De Noche! 😯",
            "Elote with some pineapple sauce and doritos. I'd maybe pick one or the other, but it's not the wildest thing ever.",
            "That’s the saddest cup of esquites I’ve ever seen.",
            "I’m really not fussy with any foods but this looks fucking disgusting",
            "Nah, Op got no taste. could use more chips and Corn, but this is just basically Mexican street corn without the corn. this shit would slap.",
            "Usually Insta reels creators make the most vile food to touch the face over the Earth, but I’d eat that",
            "it looks like a savory halohalo lmaooo",
            "Yeah dude, I’ll take one 🤙",
            "Not stupid just uncultured",
            "Not stupid. Next.",
            "Isn’t this just street corn in a different format",
            "Mm, nah. Nobody's going to make that expression while eating that. Don't get me wrong, it's not BAD looking. It's just an indulgent fatty snack food that's a little too basic to be \"chefs kiss\"ing at.\nStupid only because of the fuss the person is making over it.",
            "No mayo, and I'd smash",
            "Honestly this isn’t that stupid.",
            "tourists in tijuana will buy this for 8 dollars.",
            "That’s just an elote cup.  I’ve had many that are very similar to the one in the vid and they are amazing.  The bagged pineapple sauce was a but weird tho.  If you’ve never had one, they do look pretty weird but they are delicious.",
            "That's a no from me dawg",
            "That shirt is awesome.",
            "Spike it with crispy bacon and jalapenos, then call me back...",
            "I don't like mayo but this looks alright.",
            "Ok the way food YouTubers or social media people display ingredients like they're showing off their new born kid is crazy.",
            "Do all these people dont know how to cook and just smash ultra-processed stuff together?",
            "looks like acceptable prison food. something you'd save up comissary goods to have on your birthday. \\*\n\n\\* everything i know about prison comes from netflix and trashy memoirs",
            "The only reason why this is stupid is because if it is an mezquite or \"corn in a cup\" it should be at least 85-90% corn and the rest should be sauces and additional stuff.\n\nIf it were made as the original ones we have in Mexico, it's a really amazing snack, specially in winter.",
            "Nope",
            "Replace one of those chip layers with more corn, and that's a perfectly alright corn dip.",
            "Why do people try to put savoury things into a dessert container. I've seen mashed potato, gravy and chicken in something similar... like no bro, I don't want a half dinner on the go... or as a hot summer's treat",
            "Oh I’m judging",
            "Def more chips",
            "Does not belong here. Delicious.",
            "nah, too few chips and corn and too much of the rest. also the pineapple sauce...\n\n  \nI would eat it, but needs more corn and chips. and a saltier sauce, like peanut chili oil.",
            "Corn is a maybe for me but without it i’d eat it",
            "Nasty",
            "More like '@Sad.Eats'...",
            "All that mayo is a bit too spicy for me /s",
            "Dude I'd try it",
            "take out the cream cheese and replace with chips and i’d try",
            "Seems like a much worse and more fattening form of elote.",
            "Well he sure seemed to enjoy this monstrosity",
            "*WOULD.*",
            "You stupid bitch that's a Mexican street food, delicious and sweet, judge your mother",
            "Once he pulled the mayo out he lost me.",
            "Im not a huge fan of corn but fuck it im eating",
            "Idk would try",
            "Needs beef mince, avodaco (he even had them on his shirt) and losing the pineapple.",
            "I had pretty much this exact thing minus the chips at smorgasbord in nyc, now I kinda want it with chips the crunch would pair nice",
            "I like esquites and was on board with this till the pineapple and milk, nope.",
            "Ohh men! Respect Said!",
            "Love it without the mayo and pineapple sauce. Wayyyy too much mayo. Blaaaargh. So today I finally googled the difference between elotes and esquites, thanks OP.",
            "I'm good on the slop cup",
            "Mayonnaise and Doritos are not to be trifled with",
            "Not nearly as good as he is pretending it to be in the video. Or he needs to try better tasting foods.",
            "Seen worse, pineapple was weird tho",
            "Def not enough chips in there. You're basically just eating creamy corn.",
            "That looks delicious. Unfortunattely the pineapple sauce fcked it up.",
            "All I see is poor people food🫣",
            "I mean...id eat that, it seems perfectly lovely. Tenderrrrr cornnnn...\n\nThe only stupid thing is his look of beautific transcendence when he eats it. ITS BASICALLY POST PUB FOOD MATE NOT FOIE GRAS AND LARKS VOMIT FROM HESTON BLOOMENTHAL.\n\n...phew",
            "Not stupid, just wish it had no mayo. Also more doritos. \n\n\n\n\n\nAlso wish it were a huge ass bowl of it too but street food isn't made for fat asses like me lmao",
            "This looks genuinely good",
            "I've eaten a lot of good food, and I've still never done the exact head tilt + karate chop reaction that every single person I see eating food in a video does.",
            "mexican tiramisu?",
            "Not stoopid food.\nIndulgent street food in a hot climate / for a very stoned clientel.",
            "Love the unnecessary MAYO caption",
            "Lost me at the pineapple sauce",
            "Why is American mayo SO white? Where are do the egg yolks go? Huh",
            "I’ve seen far worse in here",
            "To be fair, he did eat it, so it's probably not THAT terrible.",
            "he is eating this shit like its hot, strainght out of oven",
            "I could 100% eat this if served on a flat plate",
            "What kind of mayo monstrosity is that bottle of mayo?",
            "What the fuck",
            "I like that avocado shirt 👀",
            "We have similar food here but only with Corn, Milk, and Cheese. It's really good",
            "I don’t care about the food!!!! \nI want the same shirt!!!",
            "When he put out the huge jar of mayo I thought he was going to completely fill the cup. Glad I was wrong.",
            "that Corn in a Cup needs more Corn lol  \n\nlooks good tho. \n\n#helotelife",
            "That sick fuck never heard of helmans?",
            "It's stupid af but I'd definitely eat it.",
            "/r/eatityoufuckingcoward in shambles",
            "Why not we try and see and judge after the experience?",
            "Needs a good hot sauce and some lime",
            "Elotes dorito parfait",
            "Lmao  the comments by people who don't know that this is just a regular food in other cultures.",
            "A vegetarian walking taco with extra cream",
            "the shirt looks better than the food",
            "Colombia loves their pineapple sauce",
            "I hate things built in a cup that seem like they should be built in a dip container. You have to eat it all in layers instead of together.",
            "Is this a cupped walking taco?\n\nLike a sailing taco?\n\nOr flying nacho? \n\nHelp a playa out here",
            "I’d eat it honestly, a little questionable especially with the pineapple sauce but I would eat it/try it",
            "It's pretty stupid, it's just dumbing down Mexican Elotes to this mess.",
            "Actually what's stupid about this. This seems genuinely like some good street food.",
            "0/10",
            "Why does this confuse me. Im legit stumped",
            "mayo is nasty. just get some beandip with sour cream",
            "Nah, that’s stupid!",
            "Seems a tad strange but plausibly delicious.\n\nHe didn’t go mad with the amount of mayonnaise which makes me think he’s taken this seriously.",
            "looks pretty good ngl",
            "He didn't make anything",
            "Hawk tuah. Spit in his eye.",
            "He was inspired by what came out of his ass in bathroom.  And didn't wash his hand after and made this.",
            "Looks dumb.",
            "Isn't this the same thing as the gross corn shit the Mexicans make?",
            "This is 100% r/stupidfood worthy. \nI miss Gordon Ramsay cooking shows. \nIs it only me or does tiktok makes  content average?",
            "It's delicious... pretty much exactly this sold all over the place where I am.",
            "A place near me has elotes with Takis or Hot Cheetos crumbled through it and they are fantastic. ",
            "You're right. If this sub doesn't recognize a type of food it gets posted here... This is a simpler way of making street corn, parfait style. It looks fine, I'd rather have it in a bowl, but this looks fine.",
            "It’s stupid cause the cup. Street corn is great. In the cup you can’t get all the layers at once. It’s weird they put cram cheese at the bottom. Just butter and tajin a corn with lime. I know they use mayo but I fuckin hate mayo.",
            "🤬🤬🤬🤬🤬 no !!!!!",
            "Indeed. I'd try this but I need more chips in there. Maybe some salsa too.",
            "Yeah WAYYY too much cream cheat. Otherwise I’d defo say I’d eat this",
            "Perhaps it should get the hell out of that plastic cup. How is chip to sauce ratio your only problem with this toddler concoction of random items.",
            "More corn and you're half way to just some elote in a cup.",
            "For real, the pineapple sauce looks like something that goes in a Michelada.",
            "besides, the tiny cup doesn't allows for enough chips",
            "Doritos >>>>> Hot Cheetos. \n\nI will die on that hill. \n\nHonestly, the Cheetos would just ruin the Doritos flavor.",
            "Or takis. That is also acceptable. But the Doritos one was made for a white person",
            "Yes, but we don't use that yellow corn to make esquites, it's disgusting.",
            "My only objection in this is that fairly heavy mayo layer that you'd have to mine through.\n\nI'm not opposed to mayo, but I don't want that much sitting in one place.",
            "Today I learned I may be mexican",
            "I just had hot cheetoes esquites last week lol",
            "There’s not enough corn, that’s my only complaint",
            "There’s definitely worse examples on here",
            "Seriously. Half the posts here are some variant of, \"why not make it the normal way?\" as though every food in history wasn't first invented by someone not doing something the way people used to do things.",
            "I doesn't seem appealing to me \n\nMostly because I grew up with just the corn, mayo, and Tajin (cottage cheese as well) as the ingredients for it. My parents never really deviated from the ingredients",
            "Yes this is actually just regular Esquites but badly made since there’s not enough corn. But is pretty normal.",
            "I think the content on here is often found somewhat appetizing to people from the americas. I’m not and cannot imagine this tasting like anything other than mayo and Doritos with chili flakes in it.\n\nIt’s probably not lack of creativity but an international sub is going to have a wide arrange of cultural taste palates or whatever you’d call it.",
            "I was coming to this comment section with similar sentiments, and as soon as I read yours, I forgot what I was going to type, because you managed to describe my feelings better than my own brain.\n\nI would indeed ***fuck that shit up.***",
            "They're called esquites. I'll fight you on this hill bro",
            "Yes. Mexicans make the best food",
            "Meh, this looks like it would taste okay but not that good, it's just doritos and corn and some sauces.",
            "Some meat also perhaps, bacon, some grilled chicken.",
            "Also just get a proper bowl. I hate grabbing a spoonful, and it only scrapes the top layer.",
            "If you think this is a \"toddler concoction of random items\" you would simply fall over and die if you went to a mexican streetfood place. Or a bar with bloody marys.",
            "They're actually called dorilocos here, and that's pretty damn popular. \n\nThere's a variant called doriesquites, where they prepare the esquites right in the bag.\n\nSo unless you think the majority of Mexico is white, you might be a bit wrong.",
            "I just don't see the appeal of Takis.  They taste like spicy old cardboard.   I love some Cheetos, even Flaming Hot and a bunch of other chips, but Takis are just disappointing.  I really wanted to like them too. They had so much hype.",
            "Gotta add cheese and Cilantro so you got elotes",
            "You can really eat this anywhere, and have probably eat something similar, you can just buy a bag of doritos, cream cheese and fruity sweet sauce, hot sauce any salty cheese and any mayo/mustard you fancy. Mix all of those (aside from the doritos) in a bowl and sit with your bag of doritos and you dip to watch a movie or series, you probably gonna love it.\n\nThis is exactly that, but in a cup, you may make an argument is too much dip but that is a preference thing.",
            "Bro I came here to comment this after seeing all the elote comments. I’m with you, comrade 🫡",
            "What, I frequent both and would like to know why they are going to kill me. \n\nI studied in Monterrey through the Erasmus program from Europe and granted, I tend to stay wary of street food when on another continent, the stuff I did see was very normal. \n\nI was never offered a mayo milkshake with crushed Doritos in it lol",
            "Ww have dorilocos up here in Texas too. So much better than takis lol.",
            "Shoot forgot the cheese part, but I've never had with cilantro 🤔",
            "It think you missed my point, people of different cultural upbringings will have very different taste buds. I know for a fact that I won’t like that since I don’t like the individual components. The only thing here that’s slightly used in our kitchens is the mayo, and that’s still sort of rare and only for consistency.\n\nYou could eat liver pâté anywhere, but a lot of people don’t despite some cultures loving it.",
            "You can't throw around your travel experience as if it makes you actually cultured if you actively avoid exploring your destinations to the degree that you avoid eating the street food that locals eat all the time. \n\nI've seen eloté almost exactly like this dozens of times, it's *often* made with very generous portions of mayo.",
            "Agreed! As far as I've seen though, Takis and whatever form of chips called \"fuego\" are mostly popular in the states, not so much south of the border. They taste too artificial and sweet with a kick for my liking. \n\nIf you want something good that'll get your taste buds sweating, try Chips Habanero. Those are good."
        ]
    },
    "It seems unnecessary ": {
        "title": "It seems unnecessary ",
        "score": 1798,
        "url": "https://v.redd.it/18pjs5o20z7d1",
        "content": "It’s always Instagram reels. ",
        "num_comments": 291,
        "comments": [
            "Lol the very curious person in the background.",
            "Stupid portion, but stupid delicious idea. Poor execution regardless.",
            "My digestive tract and toilet are shuddering from watching this",
            "The size of the burata is a bit to much for my liking but i’m sure it tastes great",
            "Off subject:\n\nI have this stupid theory that people's heads are getting physically larger. Is it just the camera lens? Both women in this video look like their heads are bigger. I'm noticing this in real life interactions and wondering if anyone else has this thought pattern?",
            "At the end, you could see her wondering if she could stomach all that cheese.",
            "#I was waiting for smoke to come out for some reason",
            "If that's real burrata on that pizza, that's a *very* expensive pie.",
            "Wtf kinda fungus looking puff ball did she just bisect and dip it's viscous insides?",
            "Her facial expressions! lol. like a commercial.",
            "It is very tasty though. Just too much for a single person. Hope they had friends to share it with and didn't throw it out.",
            "Nothing unnecessary about burrata",
            "The way she is eating seems weird",
            "She doesn’t like it😂",
            "\"99% of food products are unnecessary. Why would anyone ever eat anything but the bare minimum required for survival? Nobody should ever get something a bit over the top, extravagant, or silly.\" - People on this subreddit.",
            "Much as I love me some good mozzarella cheese this is tooo much",
            "What am I looking at",
            "I dunno, I’d love to eat it…just not all at once.",
            "\"where's the sauce ?\" \n   *It's under the cheese*....",
            "I love burrata to death but holy fuck that’s too much.",
            "Why is she bad acting like that?",
            "I would eat the whole thing goddam",
            "Unnecessarily delicious maybe",
            "I thought it was a poached dinosaur egg or something",
            "Idk why but her make up is driving me nuts and completely distracting me from that ridiculous burata",
            "That has to be an expensive \"pizza\"",
            "Not enough detail of what that is, but Naples has the most Michelin Stars of any other city. I'd definitely try that",
            "She used the pizza sauce as blush and that's why there's so little. :(",
            "Now that’s a lotta burrata",
            "Portion is too big but I love cheese",
            "You could of made 10 more pizzas with that, maybe more.",
            "What a fucking waste of good burrata.",
            "I don’t blame her",
            "Not necessarily “ a useless dish” but a diahrrea risk",
            "Ngl I would destroy this",
            "No, that is a restaurant that understands the correct amount of cheese.",
            "Looks like burrata, it’s probably actually delicious",
            "I want to throw up. Too much",
            "She can only eat a few bites and then she's done lol",
            "Whole lotta buratta!",
            "There's nothing wrong here.",
            "Looks delicious",
            "Is that a bowling ball sized buratta?",
            "Hell yeah I'd eat that!",
            "When you were partying, I was doing anal kegels.\n\nObviously in preparation for such a challenge. It might not have been enough... But I'll try",
            "no why, burratta is like the best shit ever. and seing the consistency of this one, its'a very good one.",
            "Looks yummy tho, the food too",
            "How many times do I have to tell you ... there can never be too much cheese ... imma still eat it 💀",
            "This chick doesn’t look like she eats mountains of cheese on bread lol",
            "You did not eat that!",
            "Burrata is so fucking good, but it's not **that** good wtf.",
            "Lady in the background the jeepers peepers. Why is she so curious 😂?",
            "Woman behimd her caught me with the 🤨",
            "This is either Italians trying to make a Chicago style pizza, or Chicago trying to make an authentic Italian pizza.",
            "My fat ass sitting here wondering how this super skinny girl could possibly eat all this cheese. Then realizing bulimia is a thing... I hope she is healthy and had help in eating all that burrata.",
            "That's burrata \n\nYes it tastes good",
            "It's a huge portion.\n\nHow should eat that much?\nSo it's foodwaste.",
            "I shouldnt be in this sub as hungry as i am",
            "My dumb ass will say it's not enough cheese.",
            "I'm not so sure about this one. I think that's going to be amazing, I believe that is a fresh blob of burrata on top that was probably handmade at whatever shop she bought this from. The bread also looks handmade and looks like it was cooked in a high heat oven, I think this is probably gonna be really tasty\n\nBreak out the lactase though, that's a lot of cheese",
            "This isn't that stupid. It's just cheese.",
            "how to guide on not shitting for a week straight",
            "I blame Brazil.",
            "😷no",
            "If that's just pizza bread with no sauce, cheese or toppings then this seems like a good shareable appetizer for people that love burrata",
            "I want to see her eat all that burrata. I think she can't.",
            "No that’s not it. You fail sorry",
            "Ma che cazzo?",
            "Bon apatite for what you love",
            "That's a newish chain that's opening more and more locations across Germany, there's a new one in my home town too. This seems like a marketing stunt though, they usually serve traditional Neapolitan pizza (i.e. with regular sized Burrata)",
            "when europe copies usa food... \n\nauthentic american cuisine 2.2 kilos of cheese on top, sorry 5 pounds...",
            "Creamy pizza. 70% burrata 30% pizza",
            "Were they running out of plates?",
            "what is she eating?",
            "How many pizzas could a ball of buratta that size make??",
            "The curious lady watching tourists be tourists.",
            "Visually dumb but I bet it fucking slaps to actually dig into at the table",
            "Is it burrata cheese? I've had it. It's a very soft cheese with very little flavor. To each their own but I'll take gorgonzola or bleue cheese over burrata any day.\n\nDough looks amazing though.",
            "Cut my fucking pizza",
            "So what the hell is it? \n\nIs that supposed to be pizza?",
            "….  :(",
            "This gave me heartburn. ",
            "BRO im hungry now 💀",
            "At first I thought it was fried dough with chocolate chips and a giant marshmallow. Which probably would be easier to eat tbh.",
            "Omg. Thought it was a giant bubble. That is way too much cheese. Even if it was the best cheese ever I'd yak trying to finish it.",
            "The oversized everything does not work",
            "It isnt unnecessary if you are as gluttonous as it gets",
            "Wow, a pie with a huge cum balloon on top.\n\nNah but really tf is that white stuff cus I've got no idea.",
            "I love cheese, but uh...I wouldn't eat this by myself",
            "This is why I don't eat in public.\n\nFk out of my plate!",
            "Yeah way too much cheese",
            "You're unnecessary",
            "“Where’s the sauce?”\n\n“It’s under the cheese”",
            "Reminds me of those \"puff mushrooms\" that used to grow in the woods by our house growing up.",
            "The look in her eyes after the bite screams disappointment",
            "Why does the person in the background move like she's AI generated?",
            "60 seconds to Napoli? \n\nThat sounds like my worst nightmare.\n\nAlso if anyone ever wants to order at a restaurant in Naple, you should always say “A Picchiacc e mammt” first",
            " Gonna need some olive oil and salt and pepper with that and another pizza, and a buddy with 2 bottles of wine.",
            "Just get a good [khachapuri](https://en.wikipedia.org/wiki/Khachapuri)",
            "Some people love cheese too much.",
            "Lol i love how they also put the obvious actor in frame in the background with the stupif curious face she makes every 2 seconds.",
            "Looks fun",
            "I thought that was marshmallow and a skillet cookie.",
            "That lady in the back wishes it was her",
            "I might be jealous.",
            "Burrata on pizza is great, but this is fucking dumb",
            "I feel like you can see in real time her realizing it's mid as fuck.",
            "The fuck is that?",
            "Italians call that The Pizza Cyst.",
            "What a waste of food. I know she's not going to eat more than a quarter of it.",
            "I'd eat it",
            "Wtf is that??",
            "Can see she’s disappointed in every way.",
            "Mmmm yes a side of “WTF IS THAT” with my “AAAAAHHHH”",
            "What was the point in cutting it if you just eat it with your hands?",
            "I thought it might be a giant marshmallow till I saw the disappointment in her face.",
            "“Why is there a pizza on my cheese?”",
            "I dunno, even as lactose intolerance as I am, I would love to try this",
            "I know it looks dumb and shouldn’t be ordered but I’d eat the shit out of that.",
            "insane burratta ratio",
            "Wow 😂",
            "I would swallow that ball or burrata whole",
            "I don't know what this is clearly some sort of pizza looks like a dessert pizza with strawberry and some sort of whipped topping if that's the case sign me up 😎",
            "Wait, what exactly is that?",
            "At this point, Burrata has become basically just the \"classy\" version of that thing where they put a ring mold full of melted cheese on a burger and then lift it up so it all spills out.",
            "Is that a puffball mushroom?",
            "I’d tap that",
            "If that's burrata id fuck this up ngl",
            "Needs a splash of pesto and some Cherry tomatoes cut off in half.\n\nOther than that, this is a brilliant and delicious idea.",
            "That's a giant burrata ball.",
            "Not sure what is more stupid. This food or this stupid fake ass video they made for it. Oooooo this food is so amazing everyone look at it, ooooooo.",
            "finally a video from my home town",
            "She almost stabbed her own hand with that knife.",
            "Belongs in the trash 🗑",
            "ah yes. gib me ples",
            "Is this a giant marshmallow cookie?\n\nThis is like speedrunning every health hazard ever conceived by mankind\n\nEven the ancient ones",
            "Also not that tasty. A small one goes a long way. This is like dumping a litre of clotted cream on your pizza, no thnx.",
            "The… wat…?",
            "totally necessary if you like cheese lol",
            "In a way it's cool that many in the developed world have access to the type of food that killed so many medieval nobles",
            "Now give me a spoon, or else how the f am I supposed to eat that",
            "Somewhere, an italian is committing sudoku with a melanzana.",
            "I can already feel all my muscles working over time with no pay to try to keep my butthole closed",
            "Click bait being pumped by bot engagement again?",
            "what is it?",
            "This…This is very StupidFood. She can’t even sell that she likes it.",
            "Ew it’s like a big fungus pod",
            "Is that marshmallow?",
            "Why is \"necessary\" a component of food? Lots of food we love is unnecessary.",
            "if a bird took a shit from above she'd likely not be able to tell the difference if it landed directly into whatever that is.\n\nalso what the hell even is that food? (O\\_O)",
            "Will need a biohazard team to clean the toilet after she's done with it",
            "That’s gross.",
            "Is she eating an alien baby",
            "looks sick. this sub is just hating on everything thats not completely standard for internet points these days",
            "I mean, if it’s a center plate, meant to be eaten by several people, then it’s not that stupid. Imagine seeing one person ordering a bucket of 60 wings or something like that.",
            "Sloppy. Pass.",
            "It's just one huge blob of burrata sitting on a pizza base. That wouldn't even be a satisfying meal",
            "Ahhh that’s some good indigestion and constipation right there…mm mmmmm.",
            "Mmmm cum",
            "Yayyyy…woohoo… like? what’s so special about this?😂",
            "What’s unnecessary about this? Or rather, what’s necessary about the culinary ARTs at all? This doesn’t fit in this sub.",
            "Would do her... I mean it",
            "Probably realizes that’s not a dish for one person",
            "You mean the planted person that is supposed to pretend they're not part of the group?",
            "Couldn't even pay attention to the ridiculousness in the foreground lol",
            "??? I’m baffled you think that’s a real person being curious",
            "She's gorgeous... most likely local",
            "I dunno... is it a stupid portion, or is this person eating something alone that's meant for the table?",
            "Yeah I feel like this would be unbelievably delicious but the ratio of burrata to pizza doesn’t make sense.",
            "I.....I DON'T KNOW IF I AM STRONG ENOUGH TO SAY NO",
            "A normal size burrata on the right pizza is amazing! Everything about this is perfect except the sheer size of that thing.",
            "What is the white stuff? I am confused. Marshmallow? Some weird cheese?",
            "Yeah this is a real thing done badly for instagram... like most things on this sub",
            "My stomach is bubbling 😩",
            "Get constipated just from looking at that much cheese.",
            "Mine are the opposite, floodgates open 100%...\n\n*(foghorn sound)*  🌫🚢⚓️",
            "But my tongue and my brain are dying to finish it.",
            "Shuddering",
            "Legend has it she still hasn’t pooped to this day",
            "Lotta burata",
            "I thought for sure there’d be a head smash.",
            "[deleted]",
            "Clothes are tighter and more form-fitting, lenses and angles that are in fashion distort more obviously than they did pre-smartphone, and influencers tend to be skinnier which makes the head look bigger.",
            "lol never noticed but now I won’t be able to ignore, thanks",
            "She is mostly thin, has little muscle on arms and fitted clothes.\n\nI work along men and women that physically operate sometimes stubborn older railway infrastructure and they all look more proportional than that due to having more mass on their arms.",
            "I don’t know why, but I’m dying at this comment lmao",
            "Focal length significantly alters face shape. Here’s an example: [see how this guy’s face changes?](https://www.danvojtech.cz/blog/2016/07/amazing-how-focal-length-affect-shape-of-the-face/)\n\nI assume that’s what you’re noticing!",
            "It’s all the kids from the George Lopez flash backs all grown up",
            "It depends on the filter too. Sometimes they edit their bodies and have these pinheads",
            "Have you recently had a baby?",
            "YouTube, iTunes, MySpace, FaceBook, \n\nPeople have big egos now. They need more space for it to fit",
            "We’re evolving",
            "Yeah women's heads are definitely getting bigger alright",
            "Yeah they’re filling up with shit",
            "That's not just cheese. The Burrata is a bubble of Mozzarella cheese stuffed with Stracciatella, which is basically shredded Mozzarella and heavy cream mixed togheter.\n\nAnd that is a family-gathering-sized portion, for South Italian standards. Eating that amount will make you destroy the toilet if you're lucky, or get you a heart attack in the worst case",
            "I am not entire sure you would call that a pizza. I think it's just a flat bread. You could argue that the burrata on top makes it a pizza, but then you would also have to argue that garlic bread is pizza because it's topped with garlic, butter and parmesan.",
            "It's burrata, very similar to mozzarella but creamier. With a much smaller ball this is a very typical appetizer, with a ball this size it's just nasty. They don't even taste good once they're larger than a softball",
            "Seems to be a burrata, a big one or a huge mozzarella (but shouldn't be like that inside).",
            "They’re distracting, what’s she doing? Just eat the burrata like a normal person and stop gurning.",
            "Welcome, influencers are just that ... breathing commercials",
            "But that’s enough for 6-8 people.",
            "Yeah, you can see it in her expression midway through for sure.",
            "That is an absurd amount of burrata though.",
            "A big burrata",
            "\"As an Italian...\" *it's from Chicago*",
            "It's a burrata pizza.",
            "Is it normal for there to be so much?",
            "Or she only eats a little bit .",
            "You can see an ungodly amount of red sauce pour out from the middle when she tears the pizza",
            "Because the world is ai generated, you are ai generated.",
            "I also thought it was a desert. Apparently it’s cheese!",
            "🤣",
            "A [burrata](https://en.m.wikipedia.org/wiki/Burrata) pizza, but the burrata is usually smaller",
            "It tastes like heaven tho",
            "You mean the perfectly framed, extremely expressive, \"influencer\" made up lady?",
            "???\n\nRead the room.",
            "Fucking creep.",
            "Yeah, I'm a homo and literally commenting on her beauty. The idiot in the front with the food is the least interesting thing in this vid.",
            "The main character is way hotter",
            "It feels like the pizza equivalent of these cheeseburgers with a metric fuckton of yellow plastic cheese sauce poured over. Pizzas with a normal, meaning fist-size ball of burrata are pretty common at Neapolitan pizza places.",
            "Too much cheese not enough bread",
            "I cant tell either.",
            "Nope, it's meant for public consumption.",
            "A bit of both. The proportion of buratta to bread (or is it pizza?) is definitely off, but at the same time a group of people could easily finish that off. Buratta is delicious even by itself.",
            "That looks like it would be 10,000 calories, so it better be a table of like 20 people. Honestly, it is absolutely a stupid portion.",
            "More like eating something meant for TikTok",
            "I didn’t even realize what it was at first. I just remember that weird Monty python skit where a giant blancmange was playing tennis",
            "believably delicious",
            "Burrata. It’s really good - especially on pizza - but that’s a ridiculous amount.\n\n[Read about Burrata here](https://g.co/kgs/cYj5nkfBurrata)",
            "Dang I feel so bad for people with lactose intolerance, I would demolish this lol",
            "That’s cheese? 😳",
            "Opposite for me, diarrhea waterfall",
            "L. O. L.",
            "Do you see other people in the video? The “bread” looks pretty suspicious like a pizza by the way.\n\nIf we assume that there’s another person if they know each other well i see no problem sharing this thing, of course no double dipping, unless it’s someone you know on an intimate level.",
            "Maybe not in this video, but I think filters are playing a role in the head embiggening phenomenon as well.",
            "Like moving hand thrown switches? Because yeah those can fucking suck.",
            "She takes one bite in the video.  Her boyfriend photographer is probably the one filming and will likely eat the majority of this.",
            "Bigger not always better … I’d be tossing 3/4 of the cheese on this",
            "Not sure what you're experience with burrata is but that's pretty much what I've experienced with it. I imagine this is probably an appetizer. It's stupid for one person, but for 3-4 people I can see it being good.",
            "Hakuna buttata",
            "It should be exactly like that on the inside",
            "It's a burrata due to the inside.",
            "I accept this challenge.",
            "I have never seen so much burrata on anything but I am also not complaining!!!!",
            "She only eats enough for the photo up.",
            "Oh nos! It's just like the Mae tricks! 😱😱😱 Save me Morbious!",
            "Oh....ouch\n\nMy heart is just squeezing at that thought",
            "That's not a character. That is a person.",
            "As a professional in this specific industry, buratta pizzas are fucking stupid.",
            "Probably has enough thermal mass to cool the whole pizza by the time it's served",
            "Oh shit. That was cheese? I thought it was a marshmallow. 😅",
            "No, really? I thought it was meant only to be eaten by those that had a permit, and only in private homes behind closed curtains and locked doors.",
            "Aww that’s one of my favorites!",
            "I thought it was whipped egg whites - I didn't understand the enthusiasm for dipping the bread in.",
            "I don’t, more burrata pizza monstrosity for the rest of us 🙌",
            "It's burrata. Mozzarella filled with clotted cream and shredded Mozzarella. It's really good, but that's a fucking massive ball of burrata.",
            "It is literally the ambrosia of a cheese. If you like mozzarella you will bust a nut while eating this",
            "Fresh mozzarella baby!",
            "I thought it was a huge soft boiled egg at first...",
            "Yeah, two stations I work on still has hand thrown leavers and machinery from almost two centuries prior that was just partially modernized over time in the past. \n\nModernization is underway in the whole region tho. so I will probably be the last 'generation' of railway workers that sees these in action instead of a museum.",
            "I love burrata and I got nothing against that, maybe it is too much for one person, but reasonable for 3/4 people",
            "That ball o' cheese probably weighs like 5 lbs. I don't think 3-4 people would be able to eat that without feeling like they're all going to die after.",
            "You have had bad burrata my friend. It’s supposed to be more spread-like.",
            "Or 10 non american",
            "Jeez thanks xD. My auto corrector decided to change it and didn't notice xD.",
            "Both the replies you got to this comment are so wild lol. Insane how hostile people get as soon as they see one minor thing they dislike",
            "Factually, you're right.\n\nBut without the pedantics, she's just another rehashed main character, a sheep, a lazy woman who can afford decent makeup being driven or blinded by the \"ThIs iS sUcCeSs\" insta/social mentality. A good for nothing (aside from thirst trapping), character.\n\nWho are you defending? And why? Her videos, like the rest. are only responsible for profiting off the distraction and teasing of the less fortunate/thirsty lonely. 🤙",
            "First time on the internet, or are you just stupid?",
            "Thank you.  As a very  dedicated amateur with a wife who adores burrata pizza I agree completely.  I have tried it so many ways and none of the seem good. The best I’ve done is Detroit style burrata pizza essentially slicing the burrata on top before baking.  It also involves try to remove as much moisture from the burrata as possible before baking.",
            "Yep. If that showed up in NJ I'd probably laugh and toss it lmao. Jersey sucks but our pizza is good ^_^",
            "With a napkin over your face, to hide your shame from God.",
            "Doesn’t the cheese remind you of the blancmange? 😂",
            "Ew, haha",
            "Damn that’s a good endorsement, now I gotta try some buratta!",
            "It's burratta.",
            "There's a baby in there, huh?",
            "🤣",
            "Worst I’ve seen is electric locks from the 40s. Two centuries ago is impressive. Is this in Europe?",
            "Challenge accepted",
            "Considering the size of appetizers at some restaurants here. That's pretty on point.",
            "lol, autocorrect changes to popular used words ....\n\nIn what context do you use buttata's",
            "Too much moisture. Hit the nail on the head. \n\nI work with neapolitan style. It's a nightmare.",
            "It does! I have a hard time with the texture of burrata, though. I think blancmange would be more like panna cotta maybe?\n\nBut YES.",
            "Oops, my bad",
            "Yes. In Poland.\n\nYears of constant maintenance and some improvised over the years fixes and upgrades did wonders to keep things running for so long.\n\nAnd now give headaches to engineers and workers that are trying to make the translation to new systems because nothing matches the supposed blueprints.",
            "Oh 100%. I love Neapolitan style. It’s very popular in the PNW. I used to travel there a lot and fell in love.  \nAfter many tries and much research the best thing i came up with was to basically mostly bake the crust with sauce on it and then take it out, place the burratta and slice and peel it open in the shape of the slices  add a little sauce and then basically put it back in the oven for a min or two.  It’s still a mess but the result is fairly tasty.  I don’t think it would be successful in a professional setting because it’s still quite wet and sloppy. But if you ever crack the code I’m all ears.  I’ve seen recipes where the burratta is mashed into a paste and drained but I could never make it work.  I don’t have a true pizza oven but I don’t know if that would help.  The Detroit style works because you can let it bake longer and evaporate the moisture",
            "Throwing in u/Outlander1119 too.\n\nAre you trying to cook burrata? Burrata pizza is a room temp ball put onto a cooked pizza. If you bake it, the moisture from the fresh mozzarella will separate. If you try and dry it out first, you've lost the point. \n\nJust a hunch as I've never tried... Consider making a burrata style filling with low moisture mozzarella and put that on the pizza. I think it'd be a combination of mozzarella, clotted or heavy cream, possibly some ricotta.",
            "I honestly have no idea what a blancmange is, I have only seen/heard of it from that sketch! Thanks for the commiseration, I wasn’t sure anyone else remembered 😁",
            "It's ok. I thought it was a whole zizzona (the \"z\"s are pronounced like \"t\"s. It is a big hand for Ed mozzarella wheel with a nipple for a handle. Zizzona means \"mothers breast\") on a pizza crust.",
            "Central European railways are fascinating. I’m a maintainer in the US, it’s cool to hear what it’s like over there.",
            "This ...  \nThe stupids are killing the idea of a burrata here!\n\nMake the pizza, preferably as natural as can be ( light tomato, some basil and rucola )  \nAnd serve the burrata AFTER it (the pizza) is cooked.\n\nThe oozing of the cheese makes it greater then America will ever be again /s"
        ]
    }
}