{
    "A man fights two sharks for a tuna.": {
        "title": "A man fights two sharks for a tuna.",
        "score": 560,
        "url": "https://v.redd.it/7yaifsc2738d1",
        "content": "",
        "num_comments": 124,
        "comments": [
            "dude fought sharks.",
            "This is pretty wild footage. Why did he risk his safety fighting for it rather than letting it go and getting the fuck out of there?",
            "Those sharks looked small in the water but at the surface 👀👀",
            "Big risk that the sharks get into the fishingline.",
            "This guy never watched jaws",
            "Does he know he can fish from the surface where the sharks are not?",
            "man i prefer dead silence over  that shitty 8 bit cd rip off music",
            "That was crazy as fuck. Really wanted that fish. S",
            "That's some hardcore stuff. Big brass balls",
            "Im so broke i fully understand fighting 2 sharks for a tuna on a primordial level, Like: fuck it, I'm eating today or die trying to have a belly full of food!",
            "This wins today's weirdness prize hands down. Probably monthly prize aswell.\n\n\nPlease shark fighter come out with details on this story.",
            "So sad he hurt the second shark 😭",
            "Fucking badass!",
            "One very busy busy Guy!!",
            "Put this man on wicked tuna.",
            "Best video on reddit",
            "I often feel like that tuna",
            "Fucking legend 👏",
            "My respects to homie. Daaaam!!!",
            "Ballz on him like \"fellas give it up or I'm making shark fin soup\"",
            "This is like someone coming into your house, stealing your food and hitting you. \n\nPoor sharks",
            "This might be bravest thing ever caught on cam looool a man literally fought two sharks for a tuna in the water thats wilder than anything i seen on land against a land animal. He might have earned masculine man of the year with this one loooool.",
            "One of the most bad ass things I've seen",
            "Bro they sell tuna at the supermarket",
            "Dave the diver, Dave Dave Dave the diver.",
            "Well, a predator fight",
            "Let the animals sort it out, and eat something else...",
            "> Oh man! Where did you get this gigantic tuna? I guess you paid a fortune to get it. 🙂  \n> It cost me about an arm and a leg. 😓",
            "Wild",
            "disappointing",
            "I'll stick with getting my tuna in cans and scaring off junkies trying to rob me on the way home thanks.",
            "r/HumansAreMetal",
            "This is so fuckin badass.",
            "They were clearly baby sharks, i know that not because i'm a science expert, but because my todler makes me listen to the music every day. If it was Daddy Shark then you should swim away, because he looks a lot angrier",
            "The guy has never heard the expression \"there's plenty of fish in the sea\".",
            "Bonk",
            "Do not unmute",
            "Anyone know the music?",
            "Bro has the most INSANE story to tell anyone ever",
            "Lets pull the bleeding fish the sharks are circling closer to me, great idea.",
            "\"no, sharky! This is my pot pie!\"",
            "The Spear Fisher And The Sea. New version of “The Old Man…”",
            "Where I am from you can simply acquire tune for a can",
            "He went full primal. The ooga booga energy is strong with this one.",
            "Thug Fish’n",
            "That music was absolutely atrocious",
            "Okay but imagine the story this guy got to tell his friends/family/kids",
            "When he finally jabbed them with the knife they seemed to take the hint.",
            "That Tuna better end world hunger!",
            "im eating my canned tuna watching this...",
            "This is the most badass thing I’ve seen all week",
            "It's a miracle he didn't sink to the bottom with balls that big",
            "This mans a badass, with little survival instinct but still a badass",
            "Very novice behavior, I guess it was the first tuna catch of that person.",
            "I miiiight be wrong but those look at little like nurse sharks. It's incredibly unlikely they would've bit him even if he didn't deflect them. Would've rammed tho and that would've sucked in its own ways. If I'm right and it's a pair of Greys Nurses, this is the equivalent of trying to make a Chicken Sammie while 2 cats have a complete meltdown at your feet/keep jumping on the table to try snatch the chicken.",
            "Make sure to watch muted so you don’t get stupid fucking TikTok music",
            "Are those pterodactyls flying? This clip must be old as fuckz",
            "Dude enticed sharks, almost got tagged bad, and panicked... fuck that guy!",
            "You obviously never had grilled tuna",
            "If you spearfish and are used to sharks these are not sharks you need to worry about. They are more of an annoyance with them eating everything you are trying to fish.",
            "This cat is rare species of a soldier and fights for his. In other words, he didn't give 3 daaaams!",
            "did you just watch the footage? he risked it because that’s a hell of a story to tell people, especially with proof to back it up.",
            "They're only little. They're more just annoying rather than dangerous.",
            "But the jaws watched this guy",
            "Nah he just knows what's real and what's not. \n\nIn fact the creators of Jaws regret making it because of all the irrational fear it created around sharks and how it led to so many sharks being killed, to the point that today some kinds of shark species are threatened because of fear of humans killing sharks.\n\n[https://www.popsci.com/environment/jaws-sharks-attack/](https://www.popsci.com/environment/jaws-sharks-attack/)",
            "They will eat it along the way and all you'll be left is like 10% of the tuna that you caught just barely stuck to that harpoon",
            "Or buy cans and cans of it at any supermarket, convenience store or Walmart on land???",
            "typing a sentence > pressing one icon\n200 iq redditors",
            "Idk, i liked it",
            "just mute it.",
            "Yeah but they're ridiculously tough, I very much doubt it did any real damage.",
            "Yes, he was too rough with those tender little fish that could have chopped off his legs or torn off an arm.... 😏",
            "How is it badass to stab two sharks when he could’ve just fished from the boat and not harm the sharks? The guy’s a clown.",
            "They'll be fine. Plenty of fish in the sea.",
            "Their \"house\" is bigger than our entire land, I think they will be okay",
            "the sharks did not go to the underwater grocery store and buy that tuna",
            "what",
            "Wrath by Freddie Dredd. Really cool artist!",
            "Baby Shark",
            "Should he have tried reasoning with them?",
            "Well, that’s a different take on the situation…",
            "And the story this guy is going to tell for the next 70years of his life that his grandsons won't believe it was true...",
            "especially if it is fresh like that. 🤤",
            "Seared not grilled, seared tuna.. with Ponzu sauce, omg.",
            "It’s sold in cans at your local grocery. He could definitely buy a can or two.",
            "Maybe so but they can still take a chunk out of you accidentally.  ",
            "Bro was fighting too hard for a small tuna when he could be cooking 2 sharks tonight",
            "Spam sucks dude. Any form of it.",
            "Just stop sharing bullshit videos you find",
            "I mean correct me if I'm wrong but didn't he stab both of them in the head with a blade.\n\nUpon a second watch only looks like an inch or so deep might be fine I wouldn't exactly say no real damage though.",
            "I mean he poked the first one fine - but the second stab was mean and undoubtedly hurt the fish  😭",
            "Well.. there certainly were when that saying was made. Not so much anymore.",
            "Happens all the time. It's just part of spearfishing",
            "Except unlike our grandparents he had a go pro and can prove it lol",
            "If he lives long enough to have grandsons",
            "You get used to them. But unless it’s a big tiger, blue or white shark I wouldn’t consider them dangerous if you know what you are doing. Lemon sharks are also a little nutty and unpredictable sometimes even though they are usually docile. The biggest thing is to dispatch the fish you have on the end of the line as quickly as possible. The struggling injured fish in the water is what really activates the sharks prey drive. Most sharks are just curious and will come up to you but if you push them away or give them a gentle poke with the end of your spear they will leave you alone. This has been my experience as saltwater fishing and free diving has been my primary hobby for the last 25 years.",
            "if sharks and crocodiles wouldnt taste like chewy wet chicken, the world would be a saver place :P",
            "you can just scroll if you don't want it. thanks.",
            "Yeah but they're made up mostly of cartilage, super tough, like being made out of rubber coated with sandpaper, in feeding frenzies they often bite each other etc - or when feeding among razor-sharp corals etc - this won't cause lasting damage.",
            "Yeah he did not seem very perturbed",
            "What’s up with the chunk out of the tuna where the spear went in?",
            "That's a lot of words for I don't like eating shark or crocodile.\nI love shark and crocodile! They are delicious!",
            "Yeah, I usually act more concerned when trying to prevent my bunny from stealing food off my plate",
            "A spear went in.",
            "It wasn’t the best spear shot. The perfect shot is the “stone shot” where you hit the brain or central nervous system and the fish dies instantly and doesn’t struggle. There is nothing worse than missing a fish and your spear tears out and the fish escape and you left a wounded fish there for no reason. It’s why if a shot doesn’t feel very good I won’t take it. In this video he made a good shot in terms of holding power but the spear went through a good chunk of meat damaging it. Tuna are incredibly powerful swimmers so this one started tearing its own flank apart trying to escape. This diver would have retrieved and dispatched this fish sooner but was also busy fending the sharks away so it’s understandable. You can see at the end of the video he tosses his dive knife on the deck. He probably had it pulled out to brain the fish once he had control of it.",
            "i mean its a blank canvas with not so great texture. they taste mainly like whatever you do with them. totally eatable but absolutely loses to e.g. salmon or steak IMO.",
            "I wasn’t asking you.",
            "So for the chunk to come out on what I assume is the entry side, is that just how fish flesh like that reacts to a spear gun? \n\nIf I shoot an animal it generally won’t take a chunk like that  out the entry side. \n\nOr is the spear pulling it out?",
            "You can see him stab the shark multiple times",
            "Actually towards the end of the video he stabs both sharks",
            "Have you ever had a pan-seared shark steak? It's sooo good!\n\nAnd smoked crocodile! Also very good!",
            "But, a spear went in",
            "It’s the tearing of the spear as the fish fights against the metal shaft. Basically think about stabbing a piece of rebar through a Mellon and then wagging the piece of metal back and forth; it’s going to wallow out and make a much larger entry hole than the initial spear diameter",
            "Yes, my point is he would have initially unsheathed it to brain his tuna",
            "And when you shoot an animal you don’t get a chunk taken out the entry like that, so neither of you have offered any insight. \n\nI was hoping for an actual explanation from someone that actually knows something.",
            "Yeah ok that’s makes sense, cheers for that, you’ve been much more helpful that these other dicks in the comments, that’s why I asked you in the first place as you seem to know what you’re talking about out. \n\nIt happened so quickly I thought it was from the impact itself.",
            "Spear is shifting back and forth in the flesh and has ripped open the wound. Stop acting like a cunt",
            "Spear goes in, stays in. Wriggle, wriggle, comes back out, goes back in, wriggle, wriggle, back out, back in … and the hole slowly expands. \n\nSounds familiar right?",
            "If you smell shit everywhere you go, make sure to look under your own shoe."
        ]
    },
    "Observing a rock avalanche": {
        "title": "Observing a rock avalanche",
        "score": 489,
        "url": "https://v.redd.it/ow99u5xn038d1",
        "content": "",
        "num_comments": 53,
        "comments": [
            "Cameraman, balls of steel staying on the bridge.",
            "I was waiting for the cameraman to zoom out from far away at the end",
            "Rock avalanche sounds way cooler than landslide. Thank you for this!",
            "That looks leathal as fck!",
            "![gif](giphy|55itGuoAJiZEEen9gg)",
            "Welome to Switzerland! This happened yesterday as there‘s tons of rain coming down…\n\n[https://www.20min.ch/video/mattervispa-geroelllawine-rauscht-walliser-fluss-hinunter-103132465](https://www.20min.ch/video/mattervispa-geroelllawine-rauscht-walliser-fluss-hinunter-103132465)",
            "Is the full video anywhere?  \nReally curious for the other side or an afterwards view.",
            "Darwin contender right there",
            "I'd run for my life.\n\nI'd think about who to contact to warn people down there.\n\nI'd regret not having taken such a breathtaking video.",
            "Seeing a river of rocks coming at you, must be terrifying. I would not be on that bridge.",
            "Levels of self preservation have plummeted with the advent of cell phones.",
            "Talk about cleaning the gutters...",
            "What's going on over the other side of the bridge? Infuriating.",
            "Well that waterway just got bigger!",
            "I was like 'just climb on the side as high as possible', then I saw, they're standing on a bridge, which would have been way easier to escape",
            "Looks like they are standing on solid ground next to where the actual bridge span starts. The avalanche turns away to follow the stream bed under the actual bridge. \n\nVideo cuts too soon.",
            "On the cover of the rolling stones",
            "Can someone explain the logistics behind this??\n\nIt is absolutely amazing that massive boulders can move that fast and fluid.",
            "Someone down below just became the owner of a quarry.",
            "That rocks",
            "The big rock 🪨 went with the Flo",
            "How many phones are buried alongside their Darwin Award winning owners?",
            "Camerawork nil points. Balls 10/10",
            "Amazing how it just scours every living thing out of the canyon",
            "Gravity always wins",
            "That was scary, glad they aren't as common as snowslides 😬",
            "Rock 'n' Roll",
            "This day and age I don't know what to call real and what AI anymore. I call this AI.",
            "That’s a meat grinder",
            "This is a \"Lahar\".",
            "Crazy how nature can go from such peacefulness to complete chaos in the drop of a dime",
            "The casual power of that is frightening",
            "That escalated quickly",
            "I watched the PRT (like a shitty monorail) get smashed by a slide like this a WVU. Fucked the poeple up inside. No infrastructure at all in West Virginia. Just coal and racism",
            "Hm, what would rock tumbled bones look like?\n\n-the camera guy, probably",
            "You mean \"landslide\" lol",
            "Also known as a landslide",
            "You mean land slide?",
            "we call that stupid",
            "From now on, I'm going to introduce myself as Avalanche, Rock Avalanche.",
            "I agree. The first thought that went through my mind when the rocks started tumbling down was how beautiful and mesmerising it looked.",
            "Rock avalanches and landslides are 2 different things. They both fall under the term of ‘mass waisting’. There are many more variations of mass waisting that id be happy to tell you about if you’re interested.",
            "I was fine, just a few bruises.",
            "Longer version here: [https://www.20min.ch/video/mattervispa-geroelllawine-rauscht-walliser-fluss-hinunter-103132465](https://www.20min.ch/video/mattervispa-geroelllawine-rauscht-walliser-fluss-hinunter-103132465)\n\nThe location is here: [https://www.google.com/maps/place/St.+Niklaus,+Schweiz/@46.1721267,7.7675127,13.01z/data=!4m6!3m5!1s0x478f3f4c5a3ac691:0x852cf60be0f7e1fe!8m2!3d46.1762332!4d7.8045917!16zL20vMGg2NG1u?entry=ttu](https://www.google.com/maps/place/St.+Niklaus,+Schweiz/@46.1721267,7.7675127,13.01z/data=!4m6!3m5!1s0x478f3f4c5a3ac691:0x852cf60be0f7e1fe!8m2!3d46.1762332!4d7.8045917!16zL20vMGg2NG1u?entry=ttu)",
            "Gotta get 'em views.",
            "And you thought geography took thousands of years to happen...",
            "No, he is cameraman - he will be immune from all damage.",
            "Nice word. Might use it later",
            "🤩",
            "When does your next movie come out?",
            "Only sands of time will tell"
        ]
    },
    "Bro got skills": {
        "title": "Bro got skills",
        "score": 2404,
        "url": "https://v.redd.it/acna6g0e1z7d1",
        "content": "",
        "num_comments": 103,
        "comments": [
            "There is a saying, that a bad electrician dies from electricity. A good electrician dies from alcohol.",
            "You can't be insulted, if you are insulated...",
            "The slight head turn away when he cuts the conductor lets you know this guy is a pro.",
            "Your momma so poor, you use high voltage lines for fireworks.",
            "Can someone explain what he’s doing?",
            "I was waiting for the pop and him to fly backwards in a puff of smoke",
            "I don't understand electricity. Why is the guy not catching on fire? Why is the thing sparking if it isn't connected to anything? I thought there needs to be a complete circuit for electricity to flow. This is why I'm afraid of electricity, I don't know how it works.",
            "At least he had his gloves on",
            "People are shocked when they learn I am a bad electrician.",
            "I've seen a lot of very nasty videos where the guys (it's always a guy) actually got 100% roasted by high voltage wires. And I don't mean metaphorically roasted. Literally roasted, in the former definition of \"literally,\" meaning literally.It is *not* pretty.",
            "This is how supervillains get created.",
            "And balls",
            "that’s his day job… pro at work i’d say",
            "Fuck lock out/tag out I guess",
            "Patrick Mahomes out there doing electrical work as a side hustle.",
            "Osha approved",
            "Only one mistake away from no more mistakes.",
            "Badass.",
            "He should get a tool belt",
            "That hardest game of keep away.",
            "Doesn't seem too crazy, just wear protection and keep the spicy end away from you.",
            "\"that was easy. on a normal day, they also shoot at me! and im attacked by squirrels!\"",
            "Bro got balls",
            "that's not really skill, that's \"he's lucky he didn't end up on r/ithadtobebrazil\"",
            "Is this in the Philippines?",
            "Fuck, and I can’t emphasise this enough, that.",
            "I kinda expected flip flops",
            "We need more women for this kind of work.",
            "The Patrick Mahomes of electricians",
            "That's a spicy noodle",
            "This is so f ing dangerous",
            "Very professional. Professional in dying from electric shock",
            "I’ve seen many of videos with people turning to fried chicken when they play with these wires. This guy at least won’t be a protagonist in a gore site. At least for this one job.",
            "We don’t know how many electricians it took to shoot this video",
            "What a high tension scene.",
            "Danny Trejo - Machete was nowhere near that day ?",
            "Waiting for more to happen and disappointed he didn’t spontaneously combust into flames.",
            "Skill?  \n\n\nwhat is he even doing here?",
            "Someone get that man a toolbelt",
            "I can't believe the Chiefs let him do this type of work in the off-season.",
            "as someone with NO skills, what did he do :D?",
            "Bro needs to be paid more. He's millimeters from certain death",
            "Is he stealing or fixing power ??",
            "This guy will find it's way to r/DarwinAwards soon enough.",
            "My old man was an electrician. He was also an alcoholic, and this statement is 100% accurate.",
            "and no offense this one might die from lung cancer. That shit hes inhaling, no bueno.",
            "But you can be assaulted, while insulated…",
            "Modified safety squint",
            "Comes with experience.",
            "Ive had a couple good arc flashes. Shit sucks haha",
            "Its like those football (soccer) players that kick without looking",
            "Cutting the individual wires inside the sheath at staggered lengths to prevent an arc. The wire was damaged down the line.",
            "Tampering with his life expectancy",
            "Look like the kid from Jurassic Park",
            "![gif](giphy|RkuDGO28GyyJiHtUax)",
            "At a high enough voltage, air becomes a conductor. Or at least, at a high enough voltage, the electrical field is strong enough to start pulling electrons off various atoms in the air, and the air becomes a plasma and electrical energy can suddenly flow. Also, releasing light energy.",
            "It's a combo cable with live and neutral wires inside. \n\nThe whole cable is cut in one place so that bare copper from the live and neutral are right next to each other, and that's close enough for them to be arcing.\n\nThis guy is cutting the individual cables inside the sheath at different lengths so the exposed copper isn't close enough for them to arc anymore.\n\nIt's also just mains voltage, so 220v ac, his gloves are enough insulation for that.",
            "A tool belt would’ve been a great idea given how much he seems to be supporting himself and his body weight with that cable, every time he needs to reach for a new tool",
            "It’s always a guy cause we’re 100% confident in a field we have no expertise in. I should know cause I’m 200% confident about this!",
            "I am an electrician and we have to watch these vids yearly. Its to remind us to be careful and to use all available saftey measures. By the way what that guy is doing would be close to impossible where I work.",
            "So like a first degree burn? /s",
            "Electro?",
            "But no brains",
            "Fuck out/Tag out",
            "Definitely looks like Mahomes",
            "The accent is from somewhere in South America, probably Colombia",
            "Maybe both... ? Fixing a tap that is stealing power.",
            "Im an electrician and im 28. Ive been sober for two years now. There is a reason",
            "Didn't know you could do this wow. Must be a veteran move.",
            "^ the only answer.",
            "Magic. Electricity is magic.",
            "That is true at high voltages, as you said. Seeing this is lating america, this is probably a distribution line running at 127V or 230V. Even though it's relatively high, it shouldn't be high enough to ionize the air. If that were the case, the high voltage arc would jump to the electrician, killing him instantly. You can hardly see it in the video, but my guess would be that the wire runs a bit further down off screen, potentially creating intermittent line-ground faults. To me these sparks look very similar to that.",
            "But like, why not through the man’s body?",
            "I would give more than one upvote if I could.",
            "Good shit brother. 👌",
            "Yes, it is great to be reminded. Have you seen the one of the guy sitting next to a electrical utility box, still alive, but with a huge hole through his gut? That one was my horror video, worse than all the others. Still makes me ill when I think on it.\n\nAnd, yeah, that's 3rd world electrician. Life's cheap there.",
            "No. More like a steak that you leave on a grill for 8 hours. Just absolutely blackened and ash.",
            "Just for your curiosity. They boil inside out. Body fluids are literally boiling when voltage is high enough.",
            "Nah, Electro fell into a vat of dentist eels.",
            "Idk why you’re being downvoted. Under what circumstances should anyone ever be working on a live high voltage power line?",
            "Good for you friend. Keep it up. Proud of you",
            "You're a bad electrician? /s",
            "Well one more wouldn’t kill ya",
            "~~Magnets~~ Electricity, how does it work?",
            "If it's part of the distribution network a phase to neutral fault even a phase to phase fault won't draw enough fault current to activate the fuse. I don't live in this country so I don't know for sure but where I live the distribution fuses are basically isolation only and will pretty much never blow from a fault. A fault like this they just keep going until there's enough of an air gap between the conductors. Not 100% but that's my guess as to what's happening here as an electrician on distribution network, seen this a few times from copper thieves and also from stuff ups.",
            "He’s only touching the insulated part of the cable. Also, I assume those are electrically insulated gloves. Bare wire part, if it touches his skin, can travel through body to a ground and electrocute the person.",
            "No shit. Nah I havent Seen that. We mostly get the indian guy on the train and we have a few „privat“ pics and vids when people tried to rob pur powerlines.",
            "With charred shoes still on the victim. Nearby.",
            "Poverty",
            "You're right, why bother potentially saving someone else's life. Fuck em.",
            "Thank you. Im in a great place in life. What was supposed to be a temporary thing has bwcome permanant. Ive gained to much to risk it. Youre kind words are appreciated. I hope you have a peaceful weekend",
            "I cant just leave seven by themselves...",
            "Well that is in bad taste.",
            "Electricity and magnets have a very very close relatjonship haha",
            "Yeah I would rather be a thief than do this.",
            "…What?",
            "You as well friend. :-) be safe always",
            "And a smart electrician uses rubber gloves",
            "Electricity is just gay magnetism.",
            "This is the interaction and support needed",
            "Lol",
            "If it's not from the core of the earth, then it's just sparkling magnetism."
        ]
    },
    "Heroic passerby jumped into a raging river to save an unconscious driver and his passenger trapped in a sinking car ": {
        "title": "Heroic passerby jumped into a raging river to save an unconscious driver and his passenger trapped in a sinking car ",
        "score": 2958,
        "url": "https://v.redd.it/lwyz684v7y7d1",
        "content": "The dramatic rescue took place in Chengdu, China. ",
        "num_comments": 100,
        "comments": [
            "Thats a fcking hero. Thats fast water",
            "anyone who’s ever been in fast moving water knows how brave those guys were. This is some heroic stuff",
            "Good thing there were swimming enthusiasts nearby",
            "Well done that water was moving quickly",
            "The best of us",
            "That's a hero!",
            "Incredible...",
            "He is so brave",
            "Can’t even imagine how difficult that was, dude is a hero",
            "There are good people in the world!!",
            "Did they also save the passenger? Seems there was two hero's and two people in the car yet only 3 dragged to shore",
            "Truly an amazing rescue",
            "Truly selfless heroism.",
            "Christ, your cars floating away AND you're in it unconscious, that's a bad day.",
            "In the video there’s nothing about the passenger, is this an OP’s mistake in the title, or they weren’t able to save the passenger?",
            "Shit like this get me pumped. Lfg!",
            "Just as I've lost all faith in humanity and ready for the asteroid, these mad lads show up. Truly the best of us.",
            "Dude in the blue shirt at the end using his foot for then to grab on to looked funny. Cool so see people working together though dude looked kind of comfy",
            "Humans are rly amazing sometimes.",
            "Dude this is so amazing. Everytime I see videos like this of humanity coming together just to save a fellow human and putting their own life at risk it gives me goosebumps",
            "This is super human stuff. What a hero!",
            "Whoever threw the rock needs some props, too. Fucking great stuff all around!",
            "-HEY WAKE UP!! YOU CAN'T PARK THERE!!",
            "Chinese people rock!!\n\n👇Space for that comment saying \"it's only propaganda\". Duh",
            "Thank goodness for “Swimming enthusiasts”",
            "So badass I love humans sometimes",
            "Amazing",
            "Chads.",
            "Zero chance anyone in America would ever even think about doing this",
            "It’s wild that that guy’s ENORMOUS balls didn’t weigh him down in the water",
            "Say what you want about China (if that's where this is?) but if this happened in America no one would jump in to help someone.",
            "The guide to Chengs you do in Chengdu",
            "So what happened to the passenger?",
            "come on guys, how is this +1000 votes only\n\nwe all got a bit to learn here",
            "If it were up to me, they’d be dead. No way I’m jumping in that water. Good thing there are brave and capable people out there.",
            "Fair play to them. Heroes❤️",
            "r/nextfuckinglevel",
            "Give that man every medal for heroism that exists everywhere that's unbelievable.",
            "Fucking epic",
            "With proper camera angles this could easily be in an action movie showing someone being a god damn hero. Think about that. His actions are genuinely heroic. He’s doing in real life what we see in movies - because he’s a real life hero.",
            "Mans jumped in the water and started screaming for rocks 😂",
            "The City Should Give Him A Medal!",
            "like the saying goes if youre looking for someone to help you migt have to take initative and start it off for them",
            "Hard core bravery",
            "Is this in China!? I have even more respect for those people for helping. China has a huge problem with the bystander effect. Nobody wants to help each other as they're too afraid of being wrongly accused of committing a crime and being forced to pay someone's medical bills for the rest of their lives. The CCP is sucking the empathy and compassion out of its people.",
            "+1000000 social credits",
            "Given the number of Chinese videos where the bystanders do nothing, it's nice to see some humanity prevail.",
            "Bit of faith in humanity restored, time for some Chinese food",
            "You wouldn’t see that in western nations you would see all these people with phone instead.",
            "She did a great job saving them.",
            "+100 citizen points",
            "It’s amazing to see people helping each other, especially in china 🤯",
            "The victim can now sue the 2 heroes and wins ......china is fcked up",
            "Achievement Unlocked:  \nSocial Credit Score Multiplier X2",
            "Yeah they are hero’s but bringing your self into danger to save someone else is just dumb. If this went wrong rescue teams had to search for 3 guys in a raging river instead of one",
            "Umm, this is crazy, not heroic.",
            "Can't believe they held onto the car in those rapids, that's rough man. That was an epic rescue for sure, I couldn't see the guy making it otherwise. Unconscious driver in sinking car ☠️",
            "When I saw him jump I gasped. That is maaaadddd dangerous. Easily, easily could have lost his life.  All kinds of fucky shit happens when urban areas flash flood like that. Mainly unknowable drainage/suction hazards.  Some storm drains will be plugged, some can be ferociously powerful.  You can just get sucked down and bye, bye.  Been nice knowing you.  Not to mention just the pace of the current and underwater hazards.  Insane courage and heroics and frankly a little bit of stupidity.  Can't say I'd have been brave enough to do that.  Be willing to bet you 9/10 firefighters would have deemed that too risky and would just causes another rescue mission.\n\nOn second glance it looks like a drainage canal so marginally safer but still crazy as fuck and very deadly.",
            "Real world super hero for real. I hate to say it but I wouldn’t be brave enough to do that. Truly amazing ",
            "This is the exact meaning",
            "Second that one",
            "Yeah that is fuckin wild. Absolutely could turned out worse, had they not acted quickly. Chinese Chads reporting for duty",
            "Very, very brave swimming enthusiasts!",
            "A lot of them too! Way more than most realize I suspect.",
            "https://www.sunnyskyz.com/good-news/5451/Heroes-Emerge-In-Chengdu-Brave-Duo-Rescues-Unconscious-Driver-From-Sinking-Car\n\n\nThere was only 1 person in the car. \n\nHero’s names are Jiao Dayin and Wang Yihui",
            "Yeah I’m worried someone died. ",
            "Watch the riverbank at the end:\n\nBlack shirt is unconscious driver, blue shirt is, I assume, the passenger, two shirtless guys are heroes.\n\nBlue shirt appears to be exhausted from escaping and is awkwardly being held on the riverbank by others but is probably too tired to get all the way up the bank. Black shirt is being pulled up and pushed up by others and heroes since he is unconscious and the higher priority.",
            "Did you not see the two dudes at the end?",
            "Last week my toddler got lost at a graduation commencement of thousands of people. I started getting desperate and stood on top of picnic tables literally screaming for help and asking people near me to help me find a staff member so they could make an announcement on the intercom. \nLiterally people just stared at me. Or they glanced at me as they continued their conversations. It was seriously wild to see how people reacted.",
            "I'm not even American and I know people would help others\n\nhttp://whio.com/news/local/water-rescue-underway-eastwood-metropark/IJYU4QCECVHW3MMVEC4OCW3RM4\n\nGet your \"America bad plz give me up votes!\" Ass outta here lol",
            "China passed a Good Samaritan law 10-15 years ago specifically because of that (erroneous) belief",
            "Clown",
            "Um...here you go...\n\nhttps://www.cbsnews.com/amp/minnesota/news/video-shows-good-samaritans-rescuing-driver-from-burning-car-in-st-paul/\n\nhttps://youtu.be/7X5z4fz9QdI?si=gHAAJjZV8IGEzZNo\n\nhttps://youtu.be/3BCzt17SyXo?si=d3znYrQnc4SehS17\n\n\nhttps://abcnews.go.com/amp/US/man-hailed-hero-saving-lives-men-overturned-car/story?id=68242624\n\nhttps://www.ktbs.com/news/good-samaritan-saves-elderly-man-from-burning-car/article_312cb7fc-2cf8-11ef-9d32-630310d51d96.html\n\nThat took a whole... 30 seconds of googling? There are heroes and villains in every nation and group of people. Wherever you are, look for the helpers.",
            "Nonsense. I posted this previously, happened in America, man saved from a burning car\n\nhttps://www.reddit.com/r/SweatyPalms/s/uIgRHRSfkY",
            "Original 👍🏿",
            "That social credit bullshit was trialled in one province. Not country wide.  Yet.",
            "Why would rescue teams even exist then? Since bringing yourself into danger to save someone else is just dumb?",
            "You’d be wrong about the firefighters. This is the kind of thing we train for and we would be chomping at the bit to get this guy out and safe. Sure, there are some guys who might not be overzealous, but by and far, this is the kind of thing most of us go to work for. Most younger firemen are adrenaline junkies who genuinely love helping when no one else can.",
            "Look for the helpers",
            "A coin has two sides. Just because you see one doesn't mean the other stops existing. Humanity has just as much good as bad.\n\nPeople forget that society works because almost everybody is good, almost all of the time. But you only need 1 car to ruin the day of 1000s of drivers.",
            "Its what all the division and hate pushed in media combined with economic hardship and a perception of scarcity has done to society.\n\nThat must have been terrifying!",
            "Is there no state recognition for those that commit selfless acts?\n\nIn the UK there are awards such as CBE, OBE etc \n- which on some level are questionable but still bestow a recognition on those carrying out good civic work & charity.",
            "Rescue teams are trained and have better equipment than a rock.",
            "If I wasn't a type 1 diabetic I was gonna be a fireman. I'm an adrenaline junkie and would have loooooooooooooooved to be that guy. As a kid I told adults I was gonna grow up and be a firetruck because I couldn't be a fireman.",
            "I should rephrase a little. I see where you are coming from.  I'm saying 9/10 firefighters would have just jumped in there, no life jacket, no real plan, nobody downstream to help you get out of a jam etc.  Am I wrong?",
            "Yes! Thank you Mr Roger’s!",
            "Yes, it was terrifying. I ordered air tag holders that you pin to their waistband after that. (Just for crowded places) \n\nIt truly felt like I was in some kind of simulation and no one knew how to be human. Thankfully a grandma found her and got her to a police officer. ♥️",
            "Uh huh and by the time they’re on the scene, everyone in that car drowned half an hour ago",
            "One of our Liutenants is type 1. Full blown, no pancreatic fiction. He wears a monitor and keeps his insulin pens in the refrigerator.",
            "It's possible you can still volunteer and help them :)  I hear about volunteering for fire departments in ads more than ever",
            "On call, we have ropes teams and gear specifically for this. If I saw it, not on shift? Yeah I’d have jumped, but I know how to get in easily and what windows to break. I always have a glass breaker in my pocket. Plan is get them out first, and get them and myself to shore ASAP.",
            "Better than having 3 drowned people",
            "So I've heard a few stories and I've asked did they get it while employed or did they come into the job with it? I've been told you can get grandfathered in but not enter with it.",
            "With no life preserver and that speed of water and no back up on hand? Man..... thats.. bold.",
            "In this case there were 0 drowned people thanks to these heroic actions\n\nIf they listened to you and refused to help, that car’s passenger is dead now",
            "As far as I know he was diagnosed when he was very young. His grandmother was also type 1. This is in the US, and I’ve never heard of this in my region, so it may vary based off locale and individual departments.  We do not have any regulations barring hiring type 1 or 2 where I work as long as fitness standards are met and kept up with on a yearly basis. It might be worth checking at other departments.",
            "Yeah, some stuff we do is often seen as wreckless or stupid. I’ll not deny it. I personally get the impulse that propelled the guy who saved him to jump in and try though. He pulled it off and saved him! Hats off to that brave guy.",
            "Yeah that why I said they are heroes in my original comment. But you never know how the river behaves, you could get sucked down for example. Just because they had luck in this cases, doesn’t change the fact that they could have died.\n\nWe had a flood here in Germany a few weeks ago and 2 firefighters died due to the current of the water. They knew the risk and were trained for those conditions and still they didn’t make it, so how likely is it going to be that some bystanders can save someone else without getting trapped in the current.",
            "Isn’t the risk to one’s own life what makes stuff like this heroic in the first place?"
        ]
    },
    "student pilot enters a spin as a trainings": {
        "title": "student pilot enters a spin as a trainings",
        "score": 324,
        "url": "https://v.redd.it/xpip61gqzy7d1",
        "content": "",
        "num_comments": 22,
        "comments": [
            "May the Lord bless me with this demeanor in similar situations. Amen",
            "That is one way to learn for sure",
            "This might sound crazy but this was the best part of my flight training. In my case this was done in an aerobatic aircraft that’s almost specifically designed to do stuff like this. We learn how to stall and recover from stalls from very early on, before we can go solo. \n\nThis Spin training is part of a module carried out much later on during training (in my case right at the end) called Upset Prevention and Recovery Training, or UPRT. \n\nBy the time I did spin training I’d flown loops, barrel rolls, and had the instructor demonstrate wingovers, and stall turns, as well as flown constant 2.5g turns. I’ve been on the biggest roller coasters in the world, not a brag, but just to demonstrate I’ve got a *fairly* decent stomach for this kind of thin, but given in a loop you’re using more than double the height of the tallest coaster in the world, it did still get to me. \n\nAnother thing that was great fun is the instructor would tell you to close your eyes, and then he’d deliberately confuse the balance sensors in your ears, put the plane into a crazy attitude, and then say “you have control” and you have to open your eyes and recover.",
            "Does the instructor have some sort of override in a plane like this so he can take over if the trainee has a melt-down?",
            "Salute to the instructor for being calm and able to teach the student without shouting",
            "My crazy cousin had his pilot’s license. He took my dad up one day and then said, “Want to see me get out of a dead spin?” And before my dad could answer, they were in that same state as in the video. Dad said he nearly crapped his pants.",
            "Still a great video!",
            "id love to do this but my god the nausea kicked in from here fuck",
            "Damn, that's some brass cojones. Steady voices too.",
            "Just started training to be a pilot, I hope I never have to worry about this",
            "Well now that’s been sorted off to the pub.",
            "Fahhkin hell is right.",
            "Man i so wanna do this. The ultimate rollercoaster",
            "This is one of those situations where the panic isnt in actual panicking. You know if you actually panicked youd just die. The panic is in trying to be the best possible student in the world in that moment.",
            "I want to see it done in an Airbus 380",
            "Great skills! He's the GOAT.\n\nIf you don't believe me listen to 0:13...",
            "I hate that fucking voice so much",
            "Power idle (don't want to hit the Earth faster)\n\nAilerons neutral (control surface is effectively useless)\n\nRudder full and opposite (stop the spinning)\n\nElevator forward (break the stall)\n\nPARE acronym was hammered into us for spin training! Fun stuff, not as disorienting as you'd think as you're mostly looking at your instrument panel.",
            "The flight school near where I lived had a bunch of planes with bad door latches and apparently the doors who blow open occasionally during spin recovery practice.  Apparently the combination of being strapped in and the centrifugal force pushing you into the seat meant the students were perfectly safe but I imagine the shock added a lot of the stress of learning.  I only heard about it second hand from a few students I was friends with.  No way I’d want to experience it first hand.",
            "In most planes then passenger seat is also equipped to fly as well",
            "No override per se, but there is controls on both sides. I said in another comment this kind of training is done very late on, so hopefully by this point there shouldn’t be the issue of the student freezing up, and also that by then the phrase “I have control” should be enough of a trigger to just let go of the controls. \n\nIf that doesn’t work then, genuinely, a swift whack to the students face will be enough to break them out of the meltdown. Sucks. But it’s better than dying.",
            "Haha yeah I imagine that would certainly add an extra dimension 😂. Thankfully like yourself I never experienced that first hand!!"
        ]
    }
}