{
    "Pride 2024 TM Voices": {
        "title": "Pride 2024 TM Voices",
        "score": 64,
        "url": "https://www.reddit.com/r/Target/comments/1d3ouav/pride_2024_tm_voices/",
        "content": "Good evening, my wonderful team members.\n\nAs we've discussed [here](https://www.reddit.com/r/Target/comments/1co136l/pride_2024/?utm_source=share&utm_medium=web3x&utm_name=web3xcss&utm_term=1&utm_content=share_button) among so many other threads, we know the Pride 2024 set is A: only making it to 50% of stores, and B: less than stellar, to be very mild. The point of Pride is not just buying rainbow stuff from a corporation, but sometimes that's all the representation someone gets to see. Representation matters, and our queer community matters to me *a lot.* I yell a lot about our lack of field representation, not to mention HQ having a shit system for getting feedback from the field for anything. \n\nLike I did last year, I wanted to make a place for you to share your reactions and feedback - communication restrictions into the field has been a major focus of my team and I on the Pride+ Employee Resource Group \"Inclusion Acumen\" team. (Formerly Team Member Advocacy). A big part of why I want to do this is because of how damaging poor communications can be, and how badly I am trying to force that message into the ears of the people who could do something about it. (Re: damage - last year, when we only found out about product being recalled ahead of set thanks to u/PrinceKido and a few folks. We have a whole ass chain reaction of events since that point, culminating in a fucking Equal ^(Ity) shirt design of all things.)\n\nWhat I did last year with your messages was post them in the Pride Plus Business Council Slack channel, so that all of the people across the enterprise could receive feedback from the field and understand how things were feeling. I anonymized the messages if there were identifying features, left in the cursing, and posted them into a thread with updates in the main channel every single time I put a new batch up. This is the goal again this year - even if we can't force them to suddenly make the collection for 2024 not suck, anything we do to shift the needle towards the right direction is real helpful. \n\nu/128Gigabytes u/JayUnderscore_ u/n1njaunic0rn u/SamNoche u/grumpyoldfartess u/BroIBelieveAtYou u/ElderEmoAdjacent ",
        "num_comments": 78,
        "comments": [
            "What I want to know is: does corporate really believe that pulling or watering down the collection is the only way to keep stores, TMs and profits safe? What has changed between \"we're keeping the bathrooms inclusive, go suck it\" and now? We handled angry, armed guests fighting over Purell and toilet paper in 2020... I can't understand why guidance couldn't have been issued like it was for Covid. Just let us set the merch and empower us to handle the idiots? \n\nI'm so extremely disappointed in not just the cave-in, but also the utter lack of meaningful discourse surrounding it. Not just for stores, but also for the artists/vendors, something I learned today on this sub. \n\nI've been an ally since the '80s AIDS protests, and I chose to work for Target in large part because of their track record of inclusivity. To watch, and inadvertently be a part of, this kind of spineless, greed-driven decision-making really, really bothers me. The protesters shouldn't be our target demographic, pun intended.\n\n(I need to change my flair. I came back last month after 4 years in another industry.)",
            "the pride collection this year feels so bland\n\nhalf the clothes coulda gone in a new day without batting an eye, and even the more overtly rainbowy things still just feel like they're hiding it, compare this years rainbow stripe lawn chair to last years full rainbow\n\nand there's not even bullseye it sounds like? no socks or flags!\n\ni'm glad my store has it but everyone i've talked to here has been shocked both by how.. meh the designs are and the fact its hidden away on the backside of an aisle with future collective, completely hidden from the entrance\n\ndoesn't feel out and proud at all, it feels like Target's pride is in the closet",
            "Just looked at it.  Super underwhelming.  They were starting to give ace recognition and they yanked it away.\n\n![gif](giphy|gfsQffBnuc6e096brx)",
            "I said it in the survey this year and I will say it again, it’s not just about Pride; the rest of the heritage collections sucked this year and weren’t promoted and they still haven’t done shit for AAPI heritage on a wider scale. If they don’t really want to do it, don’t do it.\n\nIt’s just the latest in a line of collabs and LTOs that don’t sell for crap. Who’s misreading the market that bad?\n\nWith that said, why did they contract outside designers for Pride 2024 and then cut the lines last minute? They could have just done basic in-house designs like they did pre-2022 and not burned all that goodwill, if any remained. Just pick a lane.\n\n(I’m in one of the stores that didn’t carry Pride before 2021, and never had the full run. I don’t know if we’re too tiny or too exurban.)",
            "I saw the collection online (and in store today) and... I was vastly underwhelmed. It appears to strive to be so inoffensive and bland that it's actually a joke. By my eye, it looked like more than half of the collection is... for pets. Whoever made the decisions for this year's curation clearly doesn't get what Pride means.\n\nI predict it won't sell and that will just give the higher-ups more ammunition to eliminate Pride from the sales floor.",
            "For me... I feel more endangered as an openly, proudly and loudly queer member of the team, than I did when hearing about bomb threats. \n\nThis choice of action gave power to the nastiest, cruelest voices imaginable. Why is that the group you want to appeal to? The folks with no human empathy or concern for human life and well being? That's the Target audience? We chose them above queer folk? Who have been pretty damn loyal to Target because once upon a time they stood for Pride and stood for inclusion, loudly and openly. \n\nI chose Target for how open and seemingly welcoming they once were when it came to the Pride community, now I can't help but feel a pretty strong sense of betrayal... but sadly not surprise. I don't know where we are headed but at this rate with these very clear and harmful moves, I don't think it'll be a good road we navigate along.",
            "It feels...shitty, to say the least.\n\nI kind of figured that they'd kowtow to the bigots, but it still takes the wind out of my sails.\n\nI'm not out, but I'm also open about it (more or less). I've never bought anything, but I've always looked and admired. Hell, the Drag Queen Bird was 🔥 last year, and if our store had any, I would have 100% bought it lol.\n\nIt always made me smile, seeing the display and the merch.\n\nA handful of years ago we had a really cool HR. She made Pride, Ally, Trans, and Equality Target pins and buttons. I've worn my (Pride) one every year, despite getting called the F Slur on a few occasions, it felt nice to do.\n\nLooking at me you'd never suspect in a million years that I was part of the community, but it always felt nice to show my Pride when and where I can, in my own way.\n\nI don't know how to describe it, really.\n\nThis year though...I feel it might be prudent *not* to wear it. Either because they're admonish me, or because of something a \"guest\" might do.\n\nhttps://preview.redd.it/yy0q1w643h3d1.jpeg?width=3024&format=pjpg&auto=webp&s=a12f479ca73807b6395cfd59d578a3ca73cd5ce3",
            "Great work!!\n\nI was reading the weekly update today and had a good laugh about how Target respects and supports its LGBT+ TMs. I sure as hell don’t feel respected by anything the decision makers have been doing. They rolled over last year like dogs. Shameful!",
            "this shit is ugly af and wont sell and corporate will say \"well its them wokies\" and pull it entirely. it sucks so much as an lgbt team member who routinely has to put up with \"she, him, *they\"* every time i go into work and then to see target not only capitulate last year to alt right nutjobs but then to HIDE pride (at least in my store) and then make it appeal to exactly one demo (parents and friends of lgbt ppl) feels like a slap in the face. target pride was the first time as a child i felt like it was okay to be lgbt and i ROUTINELY wear my first pride shirt ever to target. it sucks that target is less lgbt friendly now then they were in 2015.",
            "Nothing in this year's pride \"collection\" has me excited about potentially getting it, like it has in the past. And having it tucked in the middle of the women's floorpad instead of in the gateway (and featuring more fugly swimwear in gateway, meaning more stuff people will buy 3 sizes/styles of and then return half of it 2 days later) feels like it's an afterthought, and it's really a slap in the face to LGBTQ+ TMs who are seeking any kind of support in an increasingly unsupportive world.",
            "I want to see PROOF of these claims about safety and historical sales.\n\nIf the decisions to pull back on Pride are in fact purely motivated by concern over profits and safety, then there should be plenty of paperwork showing they consulted people in market research, security, etc., and the decisions made are backed up by evidence and qualified experts. Team members are stakeholders in the company (even if we don't get paid dividends), we should be entitled to transparency.\n\nOtherwise, I am going to continue to operate under the assumption that the executives who made these decisions are just going with their \"gut\", which indicates at best incompetence and arrogance, and at worst active agreement with the hateful ideology of those who made threats last year.",
            "My store has a section right in the front, it’s very small. But I can see almost everything from Guest Services. The first thing I saw was the “Movie Star Bird” and the only indication that it was a pride tag. I question a lot of things people buy when they return them, but who tf is going to buy this crap? And a silver car…I walked by it today and it was very underwhelming. The Prince set and DVF were decent, but this is sad. My store seems to have a lot of queer+ TM and Target has a chance to celebrate that. But, per usual, we’re either ignored or whatever this is…tolerated? I don’t know. There was a time when I wasn’t a TM and I always thought highly of this place. But it’s definitely lost its shine and I could feel that when I started November 2023.",
            "As an employee, proud is the last thing I'm feeling right now.",
            "As a member of the community, I personally don’t have an interest in pride month merch, but WOW, this year’s Pride line is disrespectfully small and bland. So low effort it’s hilarious.",
            "We cut Pride down like crazy this year. \n\nBut GAHDAMMIT if you and yours are Swingers? WE GOT SO MUCH PINEAPPLE SHIT FOR YOUR ASS!",
            "My initial reaction to reading the little pride communication they put out on myday was to be kind of pissed they didn't even acknowledge last year's bullshit, but upon further reflection I'm kind of glad they didn't because nothing they would realistically put in that would really be anything other than bullshit. None of the LGBT team members at my store I've spoken with believe target pulled pride last year for TM safety, and most are of the mind that it actually made us less safe because it emboldened people. Moreover... target just really doesn't give a shit about store level TMs, no matter what they say. Our benefits are worse than industry average, the safety culture in stores is nonexistent IME, hours are constantly cut but expectations are always on the rise. Hell, during peak covid, HQ got to work from home, district leads got to check in on us virtually while store and DC still had to show up every day with an unenforced mask policy and a cart wiper who got pulled to do other shit as soon as they clocked in.\n\nThere are  signup sheets in my store for volunteers for local pride events that are completely empty, and I imagine they'll probably stay that way. Nobody at my store wants to represent target at a pride event after last year.",
            "Gonna go ahead and sticky this so that everyone can see it.",
            "I used to be happy to talk about the steps Target was taking to be inclusive. Now i’m just so drained. \n\nIt’s incredibly disheartening to see how this is being handled. The set is smaller due to poor sales last year? Of course the sales were bad, everything was pulled and money was thrown away getting rid of perfectly harmless product. Target pulled product that wasn’t even involved in the hate campaign. We’re pulling due to safety concerns? How about do more to protect the employees. I don’t see other merchandise being pulled that puts employees and other guests in danger (stanley, the pokemon card fiasco).\n\nHistorically, giving in to these kinds of demands only fuels more of the same. That’s not an opinion that’s fact.\n\nI’m tired of empty promises.\n\nDo better by your employees, do better by your vendors, do better by the community.\n\nJust Do Better.",
            "I was genuinely, deeply disappointed. The collection is a whimper, a whisper in the back of a loud crowd. It barely counts as a collection at all - I felt like they had more for pets than people. If I can find better, more interesting pride designs at Old Navy of all places, Target has deeply failed. And deeply fail they did, with the 2024 collection.\n\nBut hey, at least bigots know that they can whine and wail and throw tantrums over their eyes being sullied by people who are not them existing and Target will knuckle under and show its belly.",
            "In addition to the pride collection being very lackluster and mostly feeling like repeat designs from years past, what hurt the most was the lack of communication about what stores were getting the set. VMs and Style TLs received no information about whether or not we were getting the set and can't redirect guests actually looking for it to nearby stores. It feels intentionally shady to not publicly post the store list or VMG on workbench unless you were on the store list. Communication from my SD was not given equally to all TLs, on a Wednesday when half of us were off, and refused to answer questions about it afterward.",
            "Obviously rainbow capitalism isn't the best, blah blah, but I remember being a younger teen and the only real representation I saw in my world was the Target Pride collection. I'm so disappointed that my store doesn't have it this year, and I'm disappointed in the collection in general. It is so good for kids to see this stuff and it makes me so angry that the homophobes are somehow winning. It feels representative of the general publica opinion on pride too... for fucks sake the first pride was a riot.",
            "I don’t know, this isn’t a single form to fill out to have my response shown to leadership at an undisclosed time. \n\nI wouldn’t want the C-Suite to think I wasn’t taking their attempts to communicate lightly. :(",
            "it’s super disappointing to see how small/boring the collection is this year plus the fact that they’re only offering sizing up to a 2X for the pride merch instead of their usual size range for plus size :(",
            "Man this really sucks. Public spaces in general have been feeling a lot more hostile towards LGBTQ+ people the last couple years and Target was one of the few places left that felt safe to shop at, especially for Trans folk. I just visited my local one a few minutes ago and all they have now is a bunch of super lame US flag clothing where the Pride stuff used to be. \n\nSo disappointing.",
            "Is the Pride Plus Business Council there to advocate for a more appealing product design, or to advocate for TMs? I'm confused.",
            "June Follow up: My store actually has some of the Pride items... but hasn't put any of it out on the floor, but is just leaving it to languish in the backroom. Rumor is that the SD or the district manager said \"don't bother.\" \n\nI'm curious how many other stores similarly haven't put out any either.",
            "My store didn't get the Pride collection. Only two stores in our district did.\n\nAnd there's something else I noticed. We don't have a Pride playlist playing this year. Target is really pulling back.",
            "I have been with target for 10 years in November, I have seen a lot of change and growth but after last year I lost a lot of respect for this company. I truly understand the fear of the threats, the violence, the harassment, that we must protect our team. But with the actions that were made it didn’t protect the community that Target was suppose to be supporting. It hurt me personally as a gay man to have to pull majority of last years collection, I cried while removing it from the floor while my peers tried to support me the best that they knew how. Target was an “ally”to so many of us but at the end of the day the share holders call the shots. When we lose ally’s the community is targeted more and we need the support more then ever. Target should have stood with the community and let all of the stores get the collection, My store unfortunately was one that did not receive the collection. I was officially told two weeks after the vmg was released, even though I already knew since the VM group had been posting about it. Why wasn’t there more communication?? It was hurtful and I’m sure I’m not the only LGBTQIA+ TM who was hurt this way. If target was a true Ally they would have backed the community, not pulled the collection last year, and actually celebrate Pride not diminish it. Very disappointing.",
            "[deleted]",
            "https://preview.redd.it/bfabwoqcd25d1.jpeg?width=3000&format=pjpg&auto=webp&s=6a5980dc290715220e069ed37325b9bdc3ca581b\n\nthis is the entire pride section at my store this year. sad, bland, hidden between the swimwear and the core womens clothes. i didn't even notice the first couple times i walked past. i did have a long talk with someone from investigations about the pride section and how the community felt; it was in relation to homophobia i experienced from a coworker. Hopefully my complaints didnt fall on a deaf ear.",
            "there's no binders or packing/tucking underwear, is there..? :( i know tomboyx isnt like the most awesome company but getting any of this stuff into in-person stores is an awesome step in the right direction and im sad to see it gone",
            "I was discriminated against for wearing a wig as a man, called to the office after telling me i cant cover the top of my head, later writen up for securities mistakes and scams going on I didnt even know. i loved my job snd still wish i had it back",
            "its a store where families shop, why is sexuality even brought up",
            "As someone whose job is physical security; my only hope is that the people in charge of our decision to not support Pride *didn’t* consult any of our security experts. \n\nThe amount of threats against our stores *dramatically* increased after we pulled the assortment last year. Our team members are objectively less safe than they’ve ever been and we’ve done nothing to provide any sort of secure environment.",
            "Target isn't getting any of my pride dollars this year.",
            "i remember being so excited to see stuff with the nonbinary flag/colors and its just all so lame now. everything has the same color scheme. it was a great way to introduce my coworkers to my identity and try to get them to use my pronouns but i've noticed the shift and it is super weird. our vm tl feels freer to spout homophobic nonsense (\"keep the gays away from children, because it's all about sex!\") and another tl told my friend \"oh? they/them? why does SHE have to be so difficult.\"",
            "Super duper fuckin felt, friend.",
            "I haven’t heard that acronym before. Is AAPI Asian-American/Pacific-Islander?",
            "i noticed they downsized latino heritage, aapi and black history, too! i was so confused doing apparel sort cos we got basically nothing for any of them",
            "You do bring up an excellent point. Worth thinking about for sure.",
            "Honestly whoever is making the Pride decisions doesn’t understand how *retail* works. \n\nLike I’m never going to assume any corporation cares about me, I’m not naive. But how can Target have absolutely no idea what our consumers want, or that burning bridges with brands eager to do our marketing *for us* is a bad idea?",
            "“We chose them above queer folk?” I love this bc yes, Target chose them. They did not do this out of concern for our safety or care for the queer community. They decided that enabling bigots is a good financial decision. And now that affects me at work because these bigots are now brazenly saying vile shit instead of just muttering it under their breaths or keeping quiet.",
            "it’s the group they want to appeal to because it’s the demographic that gives them the most profit. they are a money-driven cooperation, it makes sense- it’s a business that only stays afloat based on its customers. who are the main customers/demographic they get in and need to cater to? lower class right wingers that have the homophobic opinions they do that made the bomb threats, other threats and complaints, etc. Target sees majority of their sales from the typical stay-at-home mother shopping with their children, usually the same group of people that have been obsessed with Stanley’s, Starbucks, etc. thus they cater to the group where the majority of their support comes from which are these mothers that are more often than not, more traditional with their views, including homophobia, and chances are their husbands are in the same boat as them in terms of beliefs which gives more profit to Target when these parties see the company go against what they are too. while i don’t agree with it, i can make an understanding why they went about the shitty decisions they have. they don’t want to lose their main consumers, and if that means not supporting the minorities that need or could use the support, you bet Target is gonna look out for themselves on this one.",
            "[removed]",
            "I spent hundreds of dollars on pride merch at Target last year alone, and plenty more years before that. I didn’t see one piece in the whole collection that I just HAD to have. So disappointing.",
            "Yeah you absolutely won’t be seeing any of that.",
            "Wanna let the couples at the dog park know you and your spouse switch it up? Grab the pineapple dog toy. \n\nGotta light the path to the outdoor Phok fest in ya landscaped backyard? We got Pineapple Lawn Lights!\n\nNeed to stay hydrated at the shag n pass? Check out these Pineapple cups, you thirsty Slut!",
            "Everyone had to wear a mask at the DC.",
            "You're the best, thanks!",
            "The second one, first and foremost. \n\nThe BC has also historically been the ones doing the legwork on the merch, up until this year when it was formalized - it was buyers and other HQ folks saying \"this is what we want,\" partnering with vendors, etc, as volunteer work, and now it has its own buyer. \n\nThe merch is part of the whole thing though, since it's still really personal and a showcase of a lot of work and effort that has historically been put in by TMs showing up for each other and the community.",
            "That's fucking awesome, on your store leaders! \n\nI love that they showed up for y'all - that's about the extent that local leaders can do, and it compounds the issue if they don't. \n\nAlso, welcome to the big ol queer family!",
            "I doubt the later writeups were related to you wearing a wig but instead were based on you getting scammed and making security mistakes.",
            "![gif](giphy|tJbHV3uYmRdFANAZMe|downsized)",
            "Oh buddy, I have some bad news for you about where babies come from",
            "I don't know, maybe we should get rid of the baby section then too? Cus you can't make babies without sex. Stop shoving it in my face.",
            "target has no problem selling booze and vibrators- how are some rainbow tees and sunglasses somehow less family friendly? lol",
            "I did Security for Seven years before I found my way to Target. I ended my career with my last assignment lasting three years, and I served as Head of Security at a Medical Marijuana Dispensaryfor the nephew of Freeway Rick on the east side of OKC, OK. \n\nI tracked the Far Right this entire time and have been doing so ever since. It’s still a Hostile place for LGBT folx, America. It’ll continue to be this way until the masses leave their ignorance and accept others for who they are. \n\nI can say that I have effectively ZERO confidence in any of my Leadership at [REDACTED] to handle a mass shooting at our store or even a mass attack of some other sort by an individual or a group of individuals banded together as bad actors. I say that I have zero confidence because I’ve already been shown what our Leadership Culture is like. I’ve observed a coworker looking like SHIT like they’re about to pass out on the floor while HOLDING THE SHELVES TO KEEP THEMSELVES UPRIGHT and when I told my supervisor about this his response was, “They’re not one of mine, I’m not worried.” Meaning they weren’t working under my supervisor like I was. \n\nHow tf could I ever look to anyone else on that same Leadership team to take charge and control chaos in the event we’re at work and SHTF? \n\nThe culture between team members? It’s so inherently toxic that in the event of an attack in our store, I’d not give af about any of them. My focus would be on getting MYSELF out of the store before the cops even show up to respond. They try to catch each other up with Leadership, and they listen to everything you say just to twist your words and run tell a leader or something.\n\nTo help myself mitigate risk to my Life, I plan on carrying my own IFAKs in the store every day this next month. They’re loaded with Gauze, Tourniquets, Chest Seals, Decomp Needles, Etc. If I get hurt and I’m not dead yet, I can treat myself if my injuries haven’t killed me yet. Whoever makes it out of the store and into the parking lot after being injured/wounded? \n\nI can treat them as long as we’ve moved a far enough distance to get tf away from the threat. I would not begin care under fire while I myself have no arms by which to respond appropriately, or others around me returning fire to provide cover while we move to a better position away from the fight. \n\nI have ZERO inclination to stay inside a building and treat wounded during an active threat environment in which the only weapons I’m allowed to carry are the red/green PHC blades we are given or any item I can pick up off the shelf. \n\nHow much adequate Cover do people think is inside a Target store? Fun Fact: There is NO adequate Cover from incoming fire INSIDE the building. Rounds will pass through product and shelves and tumble into bodies. There sure is a lot of Concealment in the stores, but concealment doesn’t stop incoming rounds from passing through at all.\n\nI have also considered wearing soft armor (concealed\nKevlar) under my uniform all month long at work considering I still have it. \n\nI don’t even love that far away from where I work, but I’d not think it wise to keep my battle rattle in my vehicle to respond to mass violence in a sundown town while being a brown man. \n\nTarget keeps basic medical kit shit. They do not keep stomp bags of trauma gear for events of mass shootings or mass attacks inside theirs stores.\n\nTLDR: After doing Security for seven years in some rough shit, I’ll pick and choose what risks I take and for who I put my life on the line for.",
            "Yeah. In fact, there was a little... I wanna call it an \"advertisement bar\" on the MyDevice about it all this month.",
            ">how can Target have absolutely no idea what our consumers want\n\nThe Amish Sister-Wives collection a few years back is a great example of this.",
            "We’ve been buried under poor-selling style LTOs for the past 5 years. About the only people who get what our consumers want is whoever is buying for Bullseye’s Playground and even that doesn’t hit half the time.",
            "It makes sense if you jump through hoops and try to find the logic in a corporation making idiotic money moves. \n\nThe typical Target shopper is a millennial mom with a college degree hovering right around that $100k household range.  They’re significantly left leaning and like the *prototypical* “ally” who would rather buy into rainbow capitalism than support any of us. \n\nThe LGBTQ community at large is *widely* accepted by the majority of this country, and even with the absolute smear campaign by the GOP against the trans community, we still have the majority of the country’s support. \n\nThe assholes shouting out Pride don’t reflect the majority of anything. They’re just loud.",
            "Those people never stopped shopping at Target though. You can see it in all the surveys of them complaining endlessly of wokeness all year round... yet. Hm. They're still spending money to even get a chance to complete the survey to begin with!!\n\nMeanwhile Targer HAD been supporting Pride so boldly for a decade that so many TMs and leaders are lgbtqa, outloud. Alienating the people who are literally. Working your stores as well as shopping in them? What sense does that make?\n\nThe snowflakes screaming homophobia either don't work at the store or, crazy enough, stay QUIET about it instead of screaming bomb threats. You don't cave to the literal threat, it only empowers them.",
            "This post was automatically removed because your account is less than 1 day old. \n\nDon't panic though! If you have read our FAQ below as well our subreddit's rules, you may message our moderators about getting your comment restored.\n\nIn the meantime, check out our FAQ for Future/Potential Employees [here](https://www.reddit.com/r/Target/wiki/futureemployeefaq) and our FAQ for Current Team Members [here](https://www.reddit.com/r/Target/wiki/futureemployeefaq).    \n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Target) if you have any questions or concerns.*",
            "Oh, I know, because it doesn't exist. I just want them to ADMIT that they made such a sweeping decision without a shred of legitimate reason.\n\nPeople love chiming in with \"well Target only cares about money so of course they did this thing\". I want to establish that from even the most soulless, amoral corporate capitalist perspective, they made a recklessly stupid decision. One that's likely going to bite them in the ass and violate the \"fiduciary duty\" to their shareholders.\n\nOf course, I know that's not going to happen, either. They'll just continue with deflective statements and the most bland merch in the hopes that both the bigots and the queer people forget all about it and move on.",
            "TMs had to wear masks, they didn't enforce it for guests at all though.",
            "Interesting. At the risk of sounding hypercritical: it seems - from my very small seat at my very small table in my very small store - that the right hand and the left hand aren't talking, or even in the same room, or on the same floor, or in the same building. Generally speaking, in my HR role, it feels like Stores are thrown crumbs as an afterthought when it comes to any DEI&B initiatives and that the vast majority (if not all) of the DEI&B efforts are focused on HQ. \n\nI want to say that I understand and that it's more than an uphill battle to create cultural programming and provide tools to a company's entire frontline. And it is hard work, there's no doubt about it. But it is possible, and requires active, year-round advocacy, allyship and buy-in from C-suite executives. Those in roles of visibility need to more than just buy in to the cause, they need to walk the talk and be active allies, year-round.\n\nAnd, from my very small seat at my very small table in my very small store, it's hard to see that happening.\n\nThis isn't to undermine the importance of the work the Business Councils are doing. Your efforts are crucial, and I acknowledge that we wouldn't be where we are today without them. However, it's becoming increasingly challenging to link these efforts to tangible successes when TM's feel marginalized by decisions that seem to exclude their culture or subculture. This doesn't feel like a success. If it weren't for my Store Director (SD) proactively and independently countering this by involving us in volunteer opportunities and directly supporting LGBTQIA+ TMs and the community, several TMs who identify as LGBTQIA+ or are active allies had planned to resign in protest of how Target is handling this issue.",
            "I was never writen up just terminated without warning",
            "Ah, the ol' battle rattle. I occasionally wish I'd kept more of mine than I did.",
            "and i agree, these threats shouldn’t have been handled the way they did. the big boss claims it was for the safety of TMS and other guests but in reality they could’ve taken better action by tracking the root of the threats and either handling it with the proper forces (considering it is a bomb threat) or at the very least trespass the sick and twisty individuals who said them in the first place. instead they ran away from the issue with their tail between their legs and abandoned the minority groups, team members, and guests. as if customers didn’t know well already that if they bitch and moan enough they’ll get their way, now they know they can still get their way even when jeopardizing the safety and security of others.",
            "Correct",
            "Your very small seat speaks to stadiums of wisdom!  \n\n*Those in roles of visibility need to more than just buy in to the cause, they need to walk the talk and be active allies, year-round.*\n\n1000+ upvotes!",
            "Hey, I really appreciate the indepth reply! \n\nTo give a little context, I am *also* a stores TM. I'm the ONLY stores TM who holds a leadership position on the business council/ERG - because I'm a PML, I have slack and Yammer and email and can actually communicate with the HQ folks. \n\nI have been with the council for two years (since becoming a PML), and \"don't leave the stores behind, what the hell\" is my loudest ask for them, and is one of my driving goals being in a leadership position now. \n\nWe've made a few positive changes, but it's all systems and backend stuff - nothing to make the LGBTQIA+ TMs inside our stores feel seen and heard and like, on the day to day. Little things like identifying and fixing systems that deadname people, mostly.",
            "> Generally speaking, in my HR role, it feels like Stores are thrown crumbs as an afterthought when it comes to any DEI&B initiatives and that the vast majority (if not all) of the DEI&B efforts are focused on HQ.\n\n\nThis was my experience at a large retailer known for their loudly progressive press statements that disguised constant marginalization of the store level-employee.\n\n\nI ended up catching the ear of an Executive VP of HR (\\#2 in the company among HR) and talked with her on Zoom for an hour, traded some emails over the months. There was absolutely zero effort ever made to acknowledge the contributions of store employees to DEIA efforts or the inordinate impact of making those investments at the store level (disproportiontely Black, female, food insecure, etc according to all company level surveys).\n\n\nShortly after I left she became the head of HR for another \"Look how progressive we are!\" company with a similar track record for screwing over store employees. All these corporate types live in their own bubble of privilege. This one zoom called me from the beach in San Francisco so I could talk to her about how dangerous working through Covid was for part-time employees with no benefits...",
            "It’s not too late to get ANYTHING! \n\nI EDC most things aside from my pistol while at work. They give us weapons that can be used for one to three good forceful slices into a body before it breaks as well as used as a fist pack/blunt force weapon as a kubaton styled implement so I’m comfortable there. I train with knives so I feel confident enough in my capabilities carrying the PHC blades they give us. Imagine palming that entire thing into someone’s orbital socket. 😮‍💨\n\nAt Amazon they gave us the Yellow Single Piece Hooked Plastic Box Cutters. They could be used in much a similar fashion all around. \n\nSporting Goods has some viable weapons but a personal favorite from the summer seasonal is the gardening nib. Looks like some straight buddy the vampire slayer type shit. Depending on the state of the store’s floors and the environment immediately around me, I’d either try to get a kill or just dip tf out. \n\nI was homeless for a year and a half, and I was ready to die a long time before that. I suppose one could choose to either be brave and face an attacker or group, but the hope that I get to end a few people before I myself am killed in the process is always the highest of hopes. Personally.",
            "Full send on this. I love getting to show comments like these to the HQ folks, because a HUGE issue has been communication gaps - which means that even if they were walking the walk, no one in the stores would be able to see it.",
            "I think it bears to note that the Pride+ BC doesn't have any actual \"power\" in this situation. We have no control over what the Leadership Team does to make changes in store policy and merch inclusion. We can make recommendations, we can bring pressure, but at the end of the day, we have no actual power in the decisioning process. All of the anti-LGBTQIA+ progress decisions made last year and this year are entirely in the Leadership Team's court, and Pride+ can only watch in horror as it happens.\n\nThis also includes any avenues we might have to communicate with store TMs. There's a lot of content we would love to share with you, and a lot of feedback we would love to hear from you as well, but there doesn't appear to be a good avenue for this information to be transmitted in either direction through the company routes. \n\nOne thing I can note is last year's actions were NOT motivated by store safety or TM safety concerns (though we're always concerned, there were NO security-related incidents that spurred the actions of last year). It was purely about not losing big\\*t money. And I suspect that's this year too, that they don't want \"that sort of people\" being upset by a Pride collection \"in their faces\", and that Target would follow InBev (Bud Light) with losses in revenue for the year. \n\nGotta pay the stockholders, ya know :(",
            "I'm slowly learning that this may be the hard reality at Target. Without disclosing too much info, I have experience sitting on the inaugural board of one of MANY affinity groups while working at the world's largest \\_\\_\\_\\_\\_\\_\\_. Our DEI&B efforts mattered there. Cultural celebrations were a \"frontline first\" occasion that spanned every single location across the company. I am seeing that this is not the way everywhere, and it's really disappointing.\n\nThat won't stop me from trying everything within my power to make my store a place where every. last. employee. belongs and feels that sense of belonging and celebration. But I won't bark up the chain to make changes.",
            "Update: I was told yesterday I cannot have my bag on me on the floor or in the back while unloading trucks. I explained it’s a medical trauma bag to have in the event of an active shooter or mass stabbing in the store.\n\n“AP has medical kits.” \n\nMe: “Okay, but are they basic Medical Kits with band-aids and Neosporin or are they Trauma Kits? I don’t have band-aids or neosporin. I have chest seals, so in the event of someone getting shot or stabbed in the chest and they’re still alive with tension pneumothorax I can take that seal and keep ‘em good till they get to a trauma center. I have so much gauze that I can not only effectively PACK blown out/deep wounds but also wrap them for compression. I have OLAES Modular Compression bandages with Hemostatic Cups. I have tourniquets enough for three people to have one on each appendage with a backup for each of those tourniquets. (decomp needles I left at home because “sharps”) If an associate takes cover behind a glass panel and gets glass shards in their eye, are you gonna wrap one or both eyes? It’s both eyes. Always wrap both to restrict movement as much as possible to keep shards from cutting and digging further into your eye. How about a neck compression bandage? Someone gets shot or stabbed in the neck and they’re still alive but losing blood, do any of y’all know how to apply a compression to a neck wound safely???” \n\nManager: “That seems like a lot that we don’t really have equipment for.” \n\nMe: “Which is why I want my medical gear. Leadership has already shown they can’t be trusted.”\n\nI’ll put a call in to corporate to talk to HR Monday afternoon. For the meantime, I’ve got a fix for not being allowed my whole bag. \n\n*Tourniquets secured to my belt with rubber bands\n\n*Compression Bandages in cargo pocket\n\nI also carry a small bottle of Johnson and Johnson for decon after getting hit with OC Spray.",
            "Yeah, any and all of our power is fully granted to us by the LT, and can be stripped/throttled at their whims. Not ideal, but it's what we've got. \n\nAlso, hi! Welcome to my reddit existence.",
            "Update: Just got off the phone with corporate HR and they told me I can’t have either a bag or medical items on me in store while working. \n\nTo be clear, I was told we’re all on our own while on the clock. We’re not allowed to carry anything that can save our lives in the event of a shooting, stabbing, or attack in the store and we become a victim. \n\nThis further solidifies that I can’t trust anyone even at work, or the people for whom I’m working when it comes to matters of personal safety. \n\nI’ll still carry my tourniquets, but I’m not staying inside the building if shit pops off, and aim definitely not staying around to look after anyone either."
        ]
    },
    "HR put the pride flag upside down ": {
        "title": "HR put the pride flag upside down ",
        "score": 375,
        "url": "https://i.redd.it/fnvg52l5ly7d1.jpeg",
        "content": "I dont think she meant anything by it and tbf the gays at our store are in distress 🤣",
        "num_comments": 68,
        "comments": [
            "According to the U.S. flag code, this means that the gays are in distress lol",
            "the way it’s taped to the wall 😭😭😭",
            "My guy, EVERYONE at Target is in distress. Our sign is always upside-down, but it's a fucking circle, so no one will ever know.",
            "https://preview.redd.it/kcxpq8zhry7d1.jpeg?width=602&format=pjpg&auto=webp&s=a5809a6a9faecb737b63b87f9df7c1d15901b3da",
            "https://i.redd.it/tpau53lqb08d1.gif",
            "Looks backwards AND upside down. Yeesh.\n\nPlus, not to keep piling on this poor HRE, but surely they could've hung it with something better than tape thats visible from this far out.",
            "They a little confused",
            "As a lesbian with an intersex condition, I just have to say...\n\nDear God, the flag gets uglier ever year! What was wrong with the rainbow?!\n\nDon't get me wrong, I love the intent behind it. But I think we need to get together and elect someone who is a tiny bit better at designing pretty stuff, lol",
            "The tape too… lmaoooo your HRE is goin through it",
            "To be fair, I like living upside down.",
            "Just throw an Uno reverse on the table. It’ll fix.",
            "im now realizing my back room looked really well decorated when i see this LOL\n\nhttps://preview.redd.it/qurv7ctlr18d1.jpeg?width=4032&format=pjpg&auto=webp&s=04504aa4f51c0ea0a88adc57a88661a4afc8f42c",
            "![gif](giphy|9WXyFIDv2PyBq)",
            "So they used over 10 pieces of (shitilly placed) tape cause they didn’t have 2 pins…?",
            "Fix it",
            "they couldnt have requisitioned some thumbtacks? 💀",
            "Sometimes the effort counts, in this case not much was used.",
            "Hung up with freakin’ Scotch tape, too 💀\n\nThey seriously couldn’t run to C and grab some 3M hooks?",
            "Not the shitty tape job 😭 We have one that permanently hangs in the break room",
            "I would never known it was upside down …",
            "Lawd the way I would out myself and fix it with the most sass in the world. All we got were cliche rainbow bracelets and rainbow lollipops that say target circle members save more.",
            "The way it’s taped shows they really care",
            "I mean, we’re currently at war against bigots, and not to mention we’re protesting against the fact Target bent towards the conservatives barking.",
            "What state is this in?",
            "What a shame lol",
            "Sam Alito did it",
            "This what you get when the cishets are in charge",
            "I bet if it were a USA flag it'd have been hung up with a little more care 🤔\n\nSeems like one of those things that'd pay off to three quarter ass it, instead of... However many ass fractions this is.",
            "who the fuck cares",
            "they could have done nothing and it would've been more respectful 😭",
            "That makes me angry. But then I'd fix it. Because nobody needs that.",
            "So technically it’s backwards **and** upside down",
            "That’s pathetic",
            "Hopefully it wasn't a right wing nut job putting up the flag.\n\nEdit: I only said right wing nut job, cause they are the ones who put flags upside-down.",
            "Trust me, we are 😓😮‍💨 lol",
            "Someone call Lady Gaga, quickly!",
            "for real.",
            "Literally, lmao",
            "To be fair, being taped or tacked onto a wall with fold lines still visible is pretty much the way everyone displays it. I move that we make it the official way to display it, but upside down? Come on target hr, you can do better.",
            "🤣😂🤣",
            "That's the way they designed it.",
            "My store got a pride flag last year because I nailed one up in our clerical hallway, lol. Hasn't moved since.",
            "¡ʎɐפ",
            "Not even the nice clear gift wrap tape or even shipping tape, which is clearer than this, but regular cheap tape",
            "but they got the spirit",
            "there’s all sorts of variations on The pride flag (meaning the overall flag that represents the entire community). the one pictured in the OP actually isn’t the most common, it’s usually the progress flag.",
            "Glad someone else thinks that. There’s also no reason ppl of color should be represented in this flag",
            "Its all part of the plan \n\nhttps://www.instagram.com/reel/C7sQctGt59y/?igsh=bG54dmVmeXFpN3pr",
            "When you keep needing to include everyone, everyone gets their own color.",
            "The rainbow was supposed to include *everyone* but apparently the current lgbtqia+ doesn’t understand that",
            "Rainbow is ROYGBIV. So, red is on top; not the bottom.",
            "We didn't even get that!",
            "US flag has official rules and best practices for usage.  I don't think the queer flag does (I could be wrong but I don't think I am)",
            "I don’t think a right wing nut job would put up the flag at all.",
            "A right wing nut job would rip it down",
            "💀",
            "I choked on my water when I saw this 🙃🙃",
            "I was also drinking water when I read this lol and all I could think was, “same”",
            "BIPOC were added because racists refused to let them have a place in queer spaces for decades. Adding them in shows solidarity and and a commitment to be better than we have been and to not oppress them much the same way the LGBT+ community has been oppressed.",
            "It was supposed to, but plenty of other queer people didn't want to include everyone. Putting everyone on the flag symbolizes making space for them after decades of shunning.",
            "Oh finally I’m\nAlways afraid to say this I’m\nGlad I’m not the only one. The original flag was meant for us all.",
            "I think you'll offend a lot more people in the break room by mishandling a pride flag. That's my point.",
            "I'm sorry! I hope you're not in respiratory distress anymore! \n\nI love that y'all have the progress flag with the intersex symbol too, even if it is temporarily oopsie-doopsied.",
            "That’s ridiculous. Racists don’t get to decide whether or not someone is lgbt. The vast majority of lgbt ppl aren’t racists (at least to poc , a lot of them are to white ppl) so I don’t know where you’re getting from.",
            "does that flag have rules for handling?  I honestly don't know.  I never learned them if so.  The American flag has very well documented rules, so I can't see anyone getting super mad about what's in OP pic because there's not a commonly documented rule for handling.  Putting it up backwards or upside down might even add value to it for all I know.",
            "Queer people have been historically exclusionary, unfortunately. Read up some on the earlier LGBT movement, and how even getting the B and T to be accepted was a struggle. Everything on the inclusive flag was included for a reason, largely being that they were excluded in the past.",
            "Back when you weren’t able to just identify as something, those were the days. Though, I don’t see how that relates to people of color. \nI miss when the lgbt community was something to be proud of and not embarrassed of. Now literally any man can say he identifies as a woman and you’re forced to “accept” him or else you’re a bigot. I find a lot of the lgbt people I know who were whatever they are before 2016, are a lot more pleasant to be around that modern lgbt people."
        ]
    },
    "I’m convinced guests lose all brain cells in target (rant sort of) ": {
        "title": "I’m convinced guests lose all brain cells in target (rant sort of) ",
        "score": 71,
        "url": "https://www.reddit.com/r/Target/comments/1dlkm7c/im_convinced_guests_lose_all_brain_cells_in/",
        "content": "The amount of times in the past week I’ve had to put up with our guests lack of brain cells is insane ._. First off, when a product has a promotion such as buy 2 for $5 THAT MEANS YOU NEED TO BUY 2, don’t go saying “back there the sign said buy 2 for $5” like do you not hear yourself ??!??!? Second, does no one know how to use self checkout !?! Like I’ve seen you in here why are you tapping your card on the security camera and getting upset it’s not working ~_~ Third, again with self checkout, when it’s roped off with a sign saying “self checkout is currently closed” and the screens turned off why are you scanning each item then finger wagging me over when nothings happening 🧍🏻‍♀️ Fourth, why are we getting mad when coupons or promotions weren’t applied to a purchase when I asked you 3 times if you would put in your phone number associated with a target account or let me scan your barcode and you refuse to let me and then come back angry that you didn’t get your stupid $5 gift card when I know your a regular who knows how this works 😒 (there’s so many other stories but these were just the highlights) ",
        "num_comments": 10,
        "comments": [
            "I know I’m supposed to advocate for guests but when I see someone walk past huge signs that alert them self check is closed and proceed to bypass obviously roped off self check areas to try to scan their items at registers that are physically off, working their way down the line trying every one even though the screens are black…. I feel no desire to jump in and save them from their own stupidity.",
            "felt 😭",
            "What do you mean “lose brain cells”? They don’t have any brain cells, it’s why they act stupid and treat us like trash…",
            "I think the number one things guest do that annoy me is leaving carts or garbage. Carts is the worse because I know damn well you gotta leave the store at SOME point. You can’t put it away on your way out?",
            "My pet peeve is \"Where is the restroom?\" when my store in particular has a huge red sign hanging from the ceiling that reads \"restroom\"...",
            "Promotions like \"buy 2 for $5\" at some stores means you can \"buy one for $2.50\" if that's what you're getting at.  I know it's like that at Kroger at least",
            "Preach it!",
            "Imma be honest, if I saw “buy 2 for $5” I’d assume I can… you know, buy 2 for $5.",
            "I used to watch this happen because umm the sign is big as FUCK and when you look at the screen you can tell it’s not currently available for use. And I’ve had people see me watching them struggle and get mad at me like “why didn’t you tell me this isn’t working?!” Like I didn’t think I needed to when you walked past that big ass sign that says CLOSED💀. Then they’ll say “well I didn’t come to the store to read.”😂😂😂",
            "And Publix"
        ]
    },
    "Target in 1986": {
        "title": "Target in 1986",
        "score": 333,
        "url": "https://v.redd.it/uzg2x1laiy7d1",
        "content": "",
        "num_comments": 43,
        "comments": [
            "damn, the flatbed hasn't changed AT ALL in 38 years",
            "How is it that the whole basic structure of the store is practically the same? Was Target ahead of their time in terms of design or something?",
            "I wish the keyboards at the registers actually worked. I hate typing dpcis on a touch screen 😔",
            "A tie!   WOW!  Haven't seen a TM wear a tie in our store - ever LOL!",
            "Muh ancestors.",
            "Besides some tech. It looks all the same lol",
            "We don’t get a target where I live until 95. I only knew about target cuz of Career Opportunities.",
            "You want to see even more vintage Target....check out the movie Career Opportunities from 1991",
            "The more things change, the more they stay the same",
            "this one always gets me bc of the lady in the blue jacket carrying a shitload of stuff in her arms. i, too, always refuse to get a cart.",
            "i miss the target popcorn :(",
            "Not a smile in sight, and there's probably stores that haven't been remodeled since.\n\nYeah, that tracks.",
            "I wonder how the first week stocking/back stocking items for new workers was like in the 80’s",
            "This brings back childhood memories. My mom always got me a soft pretzel or popcorn when we went to Target.",
            "I remember when I started khakis only, crazy too think about now.",
            "[removed]",
            "Show toys…😩",
            "So peaceful and calm, unlike today’s insanity.",
            "I just showed this to my wife; it's amazing how different the shelves were back then. A seemingly total lack of technology other than cash registers",
            "These TMs seem far too happy",
            "First thing i noticed too. I wonder how often they get swapped",
            "If it ain't broke, don't fix it.",
            "Honestly, Target’s design is timeless. It was pretty minimalist back then and it still feels modern now.",
            "Ikr?  The ceiling was lower.  And that’s it.",
            "I used to be SO FAST on the numpad when the keyboards worked. The touchscreens are so inefficient since you can't type without looking at the screen.",
            "I just hate touchscreens in general as a part of everything.",
            "I'm glad to see other people miss buttons.",
            "I LOVED the register keyboards. They were my favorite.",
            "All the guys had to wear ties with their vests. Girls had smocks.",
            "They paved the way for us to be just as miserable as they were over 30 years ago ☝🏻🤓",
            "No thanks to the “new” carts lmao",
            "The only way I shop at Costco, can’t spend on things you don’t need if you only can carry so much at one time.",
            "I remember my first conscious memory of target and being taken to get popcorn. The food area had  would either be a counter behind the registers along side Pizza Hut and icees and popcorn or it’ll be an inset food area that would have a red rug with a ton of popcorn smudged in it lol. Memories 😆",
            "Nothing was located, the technology wasn't there yet. You just put stuff on the shelf, ideally in the correct aisle. When you needed something, you had to look up and down the aisle to see if you had it in stock.",
            "Backroom was manually logged. I remember doing that at Blockbuster. It took the whole shift.",
            "My ETL, who has been working at Target since the 80's, told me they didn't start locating items with technology until 1999.",
            "This post was automatically removed because your account is less than 1 day old. \n\nDon't panic though! If you have read our FAQ below as well our subreddit's rules, you may message our moderators about getting your comment restored.\n\nIn the meantime, check out our FAQ for Future/Potential Employees [here](https://www.reddit.com/r/Target/wiki/futureemployeefaq) and our FAQ for Current Team Members [here](https://www.reddit.com/r/Target/wiki/futureemployeefaq).    \n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Target) if you have any questions or concerns.*",
            "Honestly I bet not often, the design is pretty simple, a thick ass piece of wood, bolt some heavy duty casters to the bottom, bolt a handle bar to the back, and boom, you got a flatbed, at least in my store most of them look pretty old, well worn, but still work great\n\nAs long as they aren't left out in the elements for long periods of time, I bet the only thing pmls have to replace on them is the casters, and maybe some of the bolts, do correct me if I'm wrong if any pmls read this",
            "I agree, but this is target, their favorite thing to do is fix what isn't broken, so the fact they left the design of any of the vehicles alone for 38 years is pretty crazy",
            "Now that’s going down memory lane ✨",
            "I was 17 working Jewelry in my smock, the hot guy in Electronics with his tie, looking sooo smooth",
            "I used to get a soft pretzel and cheese at our target. Ah, the good old days!!",
            "Oh Blockbuster. Make sure you rewind you tapes before you return them"
        ]
    },
    "What is something you wish your Zebra device would do?": {
        "title": "What is something you wish your Zebra device would do?",
        "score": 81,
        "url": "https://www.reddit.com/r/Target/comments/1dlizfm/what_is_something_you_wish_your_zebra_device/",
        "content": "I work GM and during my pulls I wish I could select just the aisle I want to pull from in the stockroom. So many times there are other TMs pulling in aisles next to mine making mine inaccessible. Instead of skipping 40 items to get to the one aisle I can pull I wish I could just filter it to go to specific aisles only. ",
        "num_comments": 129,
        "comments": [
            "Shut the fuck up about me not being signed in, stop the random calls, actually work when I need it to, and to not log me out as I’m signing in.",
            "Honestly, having 2 people be able to do the same batch for OPU if we’re very crunched up on time 😩",
            "I wish they would work. I'm tired of randomly being signed out, randomly disconnecting from the internet, getting calls that don't pertain to my department, my scanner stops scanning, the occasional freezing. The Zebra device just needs to be completely redone",
            "Actually let me search things the way i can on the app",
            "for them to actually scan stuff",
            "I wish it would sign out of the phone app.\n\nThere should be a \"TAKE\" button on the backstock screen to make consolidation of items easier.  And after you scan the location in backstock, it should show how many of the item is currently located.  Just as a double-check so you can ensure accuracy.",
            "Honestly wish we could message eachother on there so we don’t have to keep using the walkie",
            "To stop getting those damn alerts about a guest needing assistance and no more phone calls would be nice to just switch off",
            "Built in RFID scanning. It’s a long shot but beats the hassle of trying to connect to a scanner during an OPU order.",
            "I've always wanted a function where you could make a list of bookmarked items in MyDay. Like if a guest needs multiple things pulled from the back or I'm filling an endcap from the home, I can save them and have that for reference.",
            "Work… More often than not they don’t.",
            "To have a dark mode for the Drive Up app and to have a brighter screen for super sunny days",
            "Dating Bakery/Meat for Market. I wish I could just scan the item, and it could then tell me what day it expires if I put it out on the floor. But noooooo, instead I have to consult these paper charts with tiny text and take forever",
            "For my ET40 to finally fucking have myday and origami risk on it, and for whoever decided the older MCOs use set screws instead of a normal ass cross-tip to lock in the verifone to fall apart at the ass.",
            "Super random. But I wish there was a map that could show little dots to represent where the devices are so I can know where a fellow tm is without having to walkie them. I’m just lazy lol",
            "Let me sign out of OPU/drive up notifications. I work in tech, I don't need to hear an alert every two minutes that someone is on the way (or more likely, they just arrived and are double-tapping).",
            "Damn call box notifications.  I'm in toys, I'm not going across the store to A block to unlock shit. And yes only toys is checked for my area.",
            "👏stop 👏calling 👏me",
            "You can filter by aisle for pull. Just make sure you when you hit filter that you hit aisle instead of department",
            "Magically delete My Day and reinstall My Work and all the other apps that MyDay cannibalised.",
            "I always wished they were walkies. Instead of having to carry both a walkie and a device you just have to carry one and then someone can't be like...oh i didnt have a walkie.",
            "When I search something extremely basic like bubble wrap, it needs to actually pull up products instead of saying no items found. Im tired of having to pull out my phone to look on the app for really basic items that I know we sell",
            "Work correctly",
            "I was expecting silly answers but most of these are simply asking for the device to work better or just work",
            "A modern updated version would be great",
            "link straight to myday when drive up orders are missing items",
            "1. Not annoy me if I forget to log in\n2. Not crash on me\n3. Actually scan things\n4. Play music\n5. Be more modern (and not outdated)\n6. CHAT GPT (so it can speed things up)\n7. Be fast and responsive (the zebras we have are slow ASF)",
            "Work.",
            " Not sign me out randomly or constantly switch from mytime to the grant admin permission app",
            "Not really something it would do, but I wish they’d have the capacity for better sound design. \n\nIf you think about things like video games or slot machines, they rely heavily on satisfying and rewarding sound design to make repetitive tasks more enjoyable and desirable to complete. \n\nInstead of that, you get BLAM BLAM for scanning something, and three blams for completing an OPU batch. I usually turn the volume down a little, since there’s no need to hear the blaring sounds every time I scan something, but I know just a little effort when it comes to the audio side would make a huge difference.",
            "work my pulls for me.\n\nActually, I just wish i could set the beepy scanning noise to a reasonable volume. It's either all the way on or all the way off. So annoying.\n\nAlso i need it to stop with the calls and the 600 million gazillion notifications about a guest being ready to pick up when i don't even work in pick up",
            "Actually show me the location of something!!! I can search the location of something as simple as tape but every single option says “out of stock”/“location not found” but then when I search it on the Target app on my phone it pulls up the location and says its in stock.😵‍💫😵‍💫😵‍💫",
            "Items that haven't been pre-tied, but list the pog when you click item details. Show the location in the pog for the item. Flexing out NOP for Dec home, dom, hw, that all has the same pic label info.\n\n\nWhen you search for an item by name or description, either sort the results, or allow filtering, for items with an active location and in stock. Having to scroll through tons of items with no active location and not currently carried is a time waste.",
            "Taser.",
            "teleport me home",
            "Idk if Thai applies but I would love to be able to scan more than 1 cart for OPUs - I know I can create a new cart and labels (which I do) but it would be so much easier when I stack orders",
            "work",
            "Monitor and control self checkouts without having to glaze at the payment screen and the items they scanned.",
            "I honestly wish the same thing. That would be so helpful",
            "So, OP, do you work in Grocery or Style?",
            "I would be tickled if the price matching thing worked, like, ever…",
            "I know it would be abused but I wish there was a way to edit salesfloor capacities/quantities from the pull screens  \n  \nOurs are somehow consistently fucked up and it’s a 50/50 chance that even priotities will not go out  \n  \nI’m so upset that they seemed to fix the bug(?) that let you see items that you’ve viewed in a pull, in the recently scanned list. Made my life so much easier 😑",
            "I wish I could adjust the floor quantity while doing pulls.\n\nIn Market at least half of the products are overstocked. It's just the way the morning team has to roll now. We have half of the hours we had this time last year.\n\nSo when I come in at 2:00 and start pulling and pushing, as I push I notice what is overstocked. Then later I'll be doing a pull and it will ask me to pull and item that I KNOW is already overstocked. \n\nI wish I did not have to back out of the pull to tell the floor that it's at capacity and to take it out of the pull.\n\nYeah, I KNOW THAT'S NOT HOW IT'S **SUPPOSED** TO WORK. I've tried and tried to remove the overstock and correct the counts, but it is a losing battle.\n\nSometimes I carry an extra Zebra to fix the floor count. But finding two working Zebras at 2pm is a challenge.",
            "Knows what shift Im working so I dont get drive-up updates every 30 seconds while stocking a shelf",
            "I don't currently work at target but I feel like they should add an option to have 2 people see the same batch if crunched for time or add INF batches. I'm not sure how INF batches would work but it would be nice to have a TL just dobble check to try and find an inf. Another good feature would be to allow a substitutions if the guest decides to allow it. I worked at another grocery store that allowed substitutions and customers seemed happier about it than at target.",
            "You can pull from specific back room isles. Say  you want back room aisle 30. What you do is select the floor isles that are backstocked down that aisle. Example…if floor aisles B20-B26 are housed down back room aisle 01A30, select floor aisles B20-B26 when starting your pulls. That will keep you pulling from one specific back room aisle.",
            "Sort search results by either  \nThings we have in stock  \nThings we actually carry in the store  \n  \n\"iPad 9th Gen\"  \nResults:  \n  \nRefurbished iPad Air Size A Color 1 Sold Out  \nRefurbished iPad Pro Size A Color 2 Sold Out  \nTen Commandments Left Tablet Sold Out  \niPad 9th Gen Cover we clearanced years ago Sold Out",
            "If your backroom is organized the way it should be, you can pull certain sections only.\n\nE.g. pulling the peanut butter & salad dressing POGs will result in only pulling from one aisle typically.",
            "When back stocking, a message that mentions to back stock product in another location bc the there are already 3 dcpis",
            "I work drive up. I wish the zebra could replicate the rfid key functionality for our side door when I’m on shift. We never have enough keys, so a digital key system attaching privileges to team members in their areas would be clutch!",
            "Work",
            "Work",
            "Last 10 minutes without messing up and requiring I restart whatever app I'm using.",
            "I wish you could scan a piece of clothing and it would show how it’s hung or folded on the floor. Helpful for GS and fitting room shifts.",
            "I wish the mydevices would stay connected to the Internet at all times and not disconnect every five minutes",
            "Actually be there. Stop taking the AP device if you're not AP.\n\nAlso if people would put them back in the correct spots lol",
            "you can pull by isle????? there's literally an option for it. when you do your gm pulls you can filter by isle",
            "You can… it’s just by floor aisles.",
            "I want to piggy back off that last one…. Don’t sign me out when I’m in the middle of delivering a drive up order 😭",
            "life hack for the calls: set your mydevice work area to AP - you’ll never receive any calls again",
            "There's a feature I thought they were piloting that would push INFs to TLs for help/approval. It would help so much",
            "Thissssssssssssss\n\nI can’t tell you the amount of times I’ve wished for this exact thing in the year and a half I’ve worked for Target.",
            "I agree! It would help so much. I can see where it might be hard to create the option but, it would be such a relief.",
            "Make sure you’re not checked into all departments. Sometimes it does so by default. Only check off your department in the myday app so you only get calls for that department",
            "I don't go to the work tab, fill and backstock, then to backstock, I just normal scan the item and hit backstock from there. If I need to relocate, I hit the back button from there, or just hit item details from the initial scan, and then hit take.\n\n\nAlso, instead of going to the work tab and hitting inventory audit and then having to back all the way out of that, if you normal scan the location, it'll list the current items, and if you scroll down it has inventory audit.",
            "Nah the typing on them is too painful",
            "Nah then people just be messaging each other all day and night",
            "Imagine getting a notification lmao\n\n“_____ is typing…”",
            "In what way would that be easier than walkies lol",
            "I actually agree with this. Or call from zebra to zebra!!!",
            "The thing already has phone capabilities, so adding a \"push to talk feature\" would be a simple matter of a software update. It'd be nice having one less thing to worry about.",
            "Yes!!!! I work at the service desk and don't need to be signed in to the phone on the device bc it will inevitably ring while I'm in the middle of prepping a huge no-notice drive-up order lol. Also idgaf that a guest needs help at furniture/tech/fitting room, I'm not stepping away from the desk to do it!",
            "I think the newer ones are capable of it but not target wise",
            "THIS!!!!!!!!!!!!",
            "You can scan the items. Then when you tap on the search bar I think there's like blue text in the top right that shows recently scanned items",
            "If you hit the search icon, you can hit recently scanned items. It's not exactly bookmark list, and It will reorder as you click on each one it will become the new most recent.\n\n\nAssuming the end cap is a lot and not store toes stuff, you can either scan the pog label or scan and item, item details, click the pog for the end cap, then click line listing or whatever it's called, and it'll list all the items that you can click on.",
            "Technically, you can create your own pull batch. Knowing what is needed, you ensure the system is missing some on the salesfloor - an example would be capacity 5, salesfloor 3, backroom 3. The system will then allow you to press the fill option and will then create a batch under that department in your name.\n\nIt's not the cleanest, but it works.",
            "And have enough of them.",
            "A non-reflective screen protector would do wonders!",
            "Literally why bakery is so fucking time consuming. That 95% of your product is open stock with low capacity due to table/shelving limits, and half this shit has a shelf life of less than a week? If you don't memorize the dates, pushing freight/ pulls that would normally take 20 mins anywhere else takes a goddamn hour in bakery.",
            "At least for bakery, the shelf life is on the shelf tag. But it would definitely help when we have people from other departments coming in and messing things up.",
            "this would be cool but also i can also see how it could be abused by micromanaging leaders",
            "Leaders can ping devices and see where they are so there’s that lol",
            "Tep agent, products, pickup, and then reinitialize or whichever wording it uses",
            "When I've called the store for a specific dept, or the leader extension, if nobody answers, it has been my experience that it will auto transfer to ring guest services.\n\n\nIf they can do that, why can't they make the service calls prioritize the zebra logged in with that area set before then alerting widespread.\n\n\nAlthough given the amount of service calls that take 2 or 2 times alerting and then a lead having to call it out, it wouldn't help much at my store.",
            "Yeah, I'm in Market. I don't give AF about Electronics. I don't care that a guest needs assistance over there because no way in hell am I a.) going to be any help to them and b.) I aint going over there for anything.",
            "Looking to filter the pulls by stockroom aisles - not sales floor aisles.",
            "I was going to say something similar. The search function is total butt. ",
            "Open TEP Agent and then reprocess the Pickup app, it’ll kill notifications until the next time it’s opened.",
            "You don’t just type in a nonexistent cart? Like “SHPXX”",
            "GM- most of the time Domestics, Storage, and Dec Home.",
            "You can turn off drive up notifications. Click TEP agent, scroll to “pick up”, click reprocess and just don’t open the pickup app.",
            "At my store, some people, I think maybe drive up and fulfillment, have a tendency of unhooking the tether from the holster. So the zebra number is in a holster of a diff number, which is then also in a charging slot of a number that doesn't match the holster or the zebra.\n\n\nAnd in the interest of being equal opportunity in this, GM can't put their boats and flats back on the line one the numbered spot that matches the number on their vehicle, front end can't get spider wraps wound before putting them in the bin creating a monster blob. And closers can't get their pulls done without unlocating items or leaving empty boxes and trash laying around.",
            "That’s *salesfloor* aisle; they want to filter by *backroom* aisle",
            "I have found a pull by aisle for the floor but I want to be able to pull by back stock aisles. \n\nFor example, most of the time I’m pulling from back stock aisles 4, 5, 12, 13, 18, 19, and bulk. However often times people are in the back stock aisles to the left or right of my aisles I need in. Therefore I have to skip through maybe all my aisle 4, 5, and 12 just so I can start pulls in aisle 13. It would be nice if I could just select my areas then filter that I want to go to aisle 13 in back stock only. Then once people finish their pulls in the adjacent aisles I can go back and finish mine.",
            "gonna try this out tomorrow, ty",
            "Just did it now. For everyone who wants to try it, it's the first option you see when clicking on your name in the top right and myDay app",
            "Or just don’t sign into any 🤓",
            "Yo, I would love to just pick \"potential INF\" batches. I actually enjoy going on the hunt for stuff.",
            "I do this, mostly so I don't feel overloaded by the sheer numbers on the home screen lol. But I still get calls for style, food, pharmacy, the whole nine yards even though I work in tech.",
            "Sure, those work.  But regardless of how you reach the screen that shows you where the item is and asks you to scan a location, it would be nice to have a one tap option to remove it from one of them.",
            "And leads would probably be seeing TMs messaging about non work stuff and have to go have conversations with them.",
            "I think some people just don't like talking to the whole store? \n\nI have to go on walkie so much that it stopped bothering me but ik lots of people who hate it",
            "Exactly I don’t have the keys o I can’t help anyways! I always hang up the phone call whenever I need to use my device which is often lol",
            "The new zebras do not have built in RFID at Target lol we have the new zebras and we wish we didn’t have to connect the shitty guns",
            "Not just leaders, anyone can log into MICKRA. No special permissions needed, and in theory you could do what OP wants even if it’s not exactly kosher lol.",
            "I’ve misplaced my device before (and then found it) but asked my leader if they were able to ping it and they said no. Maybe only some people know they can do this? I just wanted it to play a sound like you can do with a smartphone.",
            "'Reprocess'.",
            "First time it sends the call to everyone signed into that department, then when it times out or everyone declines it sends to the entire store except for leaders and AP, the third time it sends to leaders. It’s documented on workbench somewhere.",
            "Why the stockroom aisles don't match the floor... drives me fucking crazy.",
            "Sometimes yes - but it’s faster to scan. I also have carpal tunnel and typing on the device is triggering so if I can avoid that I do",
            "To be fair and recognize my own dumbassery...\n\n... I just realized your post literally starts with\n\n\" I work GM and...\"",
            "Correct!",
            "Or something similar to how fulfillment can go to a list of items in the batch. If the pulls would let you go to a list and select an item to where it would then continue from that point onward.",
            "thats not possible, you are signed into your area by default and are required to select at least one area when switching\n\nI always pick the doorbells",
            "I call the scavenger hunts and while they frustrate me. I also love it.",
            "When I came from Walmart I was surprised it wasn't a thing.  When an item was INF'd (a nil pick in Walmart lingo), it would drop into a batch for an exception picker.  It would auto approve an INF where the on hand is less than a case with no recent delivery or backroom movement, but anything else a second set of eyes would try to find it.",
            "That might just be that no one else is picking up, tbh.",
            "ya, what I end up having to do when removing items is set the inventory to 0, push what I need, and then re-enter the remaining inventory items again. too inconvenient",
            "Huh maybe so. I do have to talk on it a lot for my position so maybe I’m just used to it",
            "It makes a loud sound like a lost iphone lol i think only high leads can do it, we rarely ever have to/do",
            "Yeah, that's it, that's the word I was looking for.",
            "Long days are work…understandable!",
            "Oh is that new? (Haven’t worked at target for a few months now.) before I never signed in. Some yea, they’d automatically sign in but not all the zebras did so I never would sign in for any calls💀💀\nBut that’s smart to pick the doorbells Oml",
            "My stores leaders apparently have a hard time responding and we have to call out multiple times for them to even respond",
            "Even just to ping them",
            "Does it say \"Find Me\" or something like that on the person that is getting pinged?I had this happen the other day and no idea why. ",
            "I do this daily so I know it well 😂",
            "It used to let you sign out on the phone app and then they updated it so now random devices are always signed out so I try to get those ones 😭"
        ]
    }
}