{
    "r/tennis Discussion (Saturday, June 22, 2024)": {
        "title": "r/tennis Discussion (Saturday, June 22, 2024)",
        "score": 12,
        "url": "https://www.reddit.com/r/tennis/comments/1dlnxqi/rtennis_discussion_saturday_june_22_2024/",
        "content": "**Live discussion for ongoing professional tennis tournaments**\n\n|**CHAT**|[\\#reddit-tennis](https://web.libera.chat/?channels=#reddit-tennis), [/r/tennis Discord](https://discord.gg/tennis)|\n|:-|:-|\n|**SCORES**|[Protennislive](http://www.protennislive.com/LSHD/main.html?year=2019&wkno=99&eventid=&tour=2&lang=en&ref=http://tennis.reddit.com), [Flashscore](https://www.flashscore.com/tennis/)|\n\n&#x200B;\n\n|**Week of June 17**|**Links**|**Top Seeds**|\n|:-|:-|:-|\n|**WTA 500 ecotrans Ladies Open** (Berlin, DE)|[Order of Play](https://www.wtatennis.com/tournament/2012/berlin/2024/order-of-play), [Draws](https://www.wtatennis.com/tournament/1052/birmingham/2024/draws), [Scores](https://www.wtatennis.com/tournament/1052/birmingham/2024/scores)|Gauff, Sabalenka, Rybakina, Pegula|\n|**WTA 250 Rothesay Classic** (Birmingham, GB)|[Order of Play](https://www.wtatennis.com/tournament/1052/birmingham/2024/order-of-play), [Draws](https://www.wtatennis.com/tournament/1052/birmingham/2024/draws), [Scores](https://www.wtatennis.com/tournament/1052/birmingham/2024/scores)|Ostapenko, Krejcikova, Cirstea, Boulter|\n|**ATP 500 Cinch Championships** (London, GB)|[Order of Play](https://www.atptour.com/en/scores/current/london/311/daily-schedule), [Draws](https://www.atptour.com/en/scores/current/london/311/draws), [Scores](https://www.atptour.com/en/scores/current/london/311/results)|Alcaraz, de Minaur, Dimitrov, Fritz|\n|**ATP 500 Terra Wortmann Open** (Halle, DE)|[Order of Play](https://www.atptour.com/en/scores/current/halle/500/daily-schedule), [Draws](https://www.atptour.com/en/scores/current/halle/500/draws), [Scores](https://www.atptour.com/en/scores/current/halle/500/results)|Sinner, Zverev, Medvedev, Rublev|\n\n&#x200B;\n\nThis is the mod account shared by the whole r/tennis mod team.",
        "num_comments": 355,
        "comments": [
            "I’m on my way to Halle 😭 my first tournament ever after watching the pros on TV for 20+ years",
            "people already collapsing after watching half a hour of servebotting",
            "Hubi taking out the trash",
            "Hubert the BEAST, thank you for your service 🫡",
            "HUBI DOOBIE DOO!",
            "Ooooh… Ons retired!! Maaan what is happening in Germany?",
            "a polish guy beating a german guy just feels right",
            "HURKACZ BROKE WTF LETS GOOOOOOOOOOOOOOOOOO",
            "Hell yeah Hubi my man !",
            "Does Iga know something that we and the other players don't? Smart to skip Berlin lmao",
            "tuned in just in time to see hubi serve it out 😌",
            "Hubi beating Zverev, happy pride everyone.",
            "They should have start the match with a tiebreak, everyone saw it coming 🤷🏻‍♂️",
            "Hubi Sinner final! One more match, lets go Jannik",
            "Sinner:  I keep my glorious hair private\n\nZhang:  my extroverted hair are in full show",
            "berlin cursed tournament tbh",
            "I read a lot of comments talking about \"servebots\" but I personally think both Zverev and Hurkacz are playing very good level tennis (serving is tennis too).\n\nI enjoyed every ace from Hurkacz and I hope there will be many more in this second set.",
            "Hubi hubi hubi",
            "YES HUBI",
            "Gauff - Jabeur low key a banger",
            "Hurkacz is alcarazing Dverev right now with style",
            "Halle has the top 3 guys for % of service games won in the last 52 weeks in the semis:\n\nSinner 91.1%\n\nHubi 89.7%\n\nDVerev 88.7%",
            "Berlin is cursed",
            "Here comes the break 🇵🇱",
            "Let’s close it out Hubi!",
            "YAYYYYYYY!!! Go Hubiii!!!",
            "ZZZ is very pretty",
            "Love seeing disgusting servebot pusher Zverev get crushed by a bigger serving not arrogant guy",
            "That was a high quality tiebreaker .",
            "OMG Kalinskaya???\n\nWalkover wins over the reigning Wimbledon champ and AO champ (+Wimbledon SF), that's mother!",
            "Let’s go Hubi!!!",
            "Hurkacz serve is something man. After watching Raonic serving 47 aces people think players like him doesn’t exist anymore, but well, here is Hurkacz.",
            "Saba retired from the match!? Wow. Is this her first time doing that??",
            "Do you think Iga and Hubie will make a good doubles pair in the Olympics?",
            "Yeahhh Hubi!!!",
            "Dziekuje bardzo Hubi",
            "Coco and Ons match is lit 👌🏽👌🏽👌🏽",
            "Took her 8 set points but Coco gets it done 😀\nThe mind of a champion.",
            "Hubert to bagel Djokovic in Wimbledon, confirmed. /jk",
            "Dalej Hubi! (Is that right?)",
            "Berlin what the actual fuck",
            "Aryna has never retired from a match in her pro career. This must be serious. Hope everything goes alright with her.\n\nIn other news, Kalinskaya is having a great week before Wimbledon she gets some prize money and ranking points she really needed.",
            "Hubi ❤️🥹",
            "Some exquisite stuff from Ons Jabeur to save 6 straight set points.",
            "I want Ons to win Wimbledon",
            "What happened to Ons nooo the match was so good",
            "Just saw Rinky at Heathrow T5 check-in",
            "So sad Jabeur & Sabalenka had to retire",
            "woohoo",
            "I open the match and see Ons taking an MTO. What is going on in Berlin?",
            "Hubi! Hubi!",
            "Another 7-6 6-4 win for Hubi",
            "Is it confirmed hubi has the best serve among active players on tour?",
            "If Sinner gets past ZZZ, I want to see how he handles a servebot on grass. I hope Hurkacz is peaking his serve tomorrow.",
            "It’s sounds like ZZZ and Jannik are having a shoot out lmao",
            "Hubert Hurkacz, please make my day",
            "my body is ready for this 3 tiebreaks lavish feast of servebotting",
            "my god the sun is truly something in halle",
            "The 4 who i'd say are the favourites for Wimbledon all retired in Berlin: Vondrouosva, Rybakina, Jabeur, Sabalenka.",
            "Potapova with a one handed backhand passing winner lol now I've seen everything in Tennis haha",
            "Thompson winning Queens would be so random",
            "A Pole winning in Germany? Lewandowski could never",
            "Any thoughts on the upcoming Jannik and ZZZ match?",
            "Coco is playing great",
            "I call Tomljanovic to win Wimbledon at this point",
            "dawajjjj Hubiiiiiii",
            "Poland needs sum after being the first to be eliminated from the Euros",
            "Nice start by Musetti. Let’s go",
            "Zverev's father (?) talking in russian to Dverev feels so east germany lol",
            "It’s cute that Hubi’s box is mostly people in his kit…and Jamie Delgado 😂",
            "Coco’s def winning this tournament now",
            "People dropping like flies today. I wonder if it's the start and stop of basically only playing two matches in a week and only a few games a day",
            "oh no :( so many retirements",
            "Soo pegula when??",
            "Dverev sent a ball into orbit lmao",
            "The betting sites yesterday had Musetti as the least likely of the 4 to win this tournament.  Thinking they had that wrong.",
            "Surprised to learn this is only ZZZ's second tour semifinal in his career. Got smashed in his only previous one by Djere so has a (slim) chance to make new ground today.",
            "lorenzo...guess we win in 3",
            "Alja Tom is fully back",
            "Hubi’s merits for having such a huge serve are underrated, cause most people think he’s some sort of Isner-Karlovic height. He’s not. If you saw him in doubles with Jannik, you’d realise he’s not that much taller than him for instance.",
            "Something must be severely off with Saba for her to retire since she’s rarely ever retired I read something the other day about her never having retired before (might be exaggerated since I’m new to tennis minus Wimbledon)",
            "Hubi with 17 aces 😍",
            "It's 68 degrees in Halle. How have two different people had heat stroke?",
            "As a Pole I was excited for Hurkacz-Dverev March you know, a German player against a Polish one in Germany 🫡 \nBut man this game is so boring",
            "Hurkacz indon pride 🇮🇩",
            "Great swinging volley from HuHu.",
            "just tuned in to ons's match. what's happened to her?",
            "RIP cursed german events",
            "why does thompson's beard looks fake?",
            "Who’s excited for Wimbledon qualifying. Anyone know whether that’s streamed?",
            "Ranah Stoiber SHAMES Wimbledon as the world #678 comes through Q1 of Eastborne, knocking out Bucsa, #66.\n\nOutrageous. Absolutely outrageous that they snubbed Stoiber, McDonald and Rajecki (who had to fight for a QWC via play offs) who have all shown they can match the pros over the course of this grass season.",
            "Hubs!!!",
            "Finally a result in pegula/siniakova match, waiting for this match to finish for ages ffs",
            "Lets go tomljanovic \n\nHow on earth are you ranked 190",
            "5-2 is a cursed scoreline",
            "Anyone else have fun saying Zheng’s name ? \n\nIt just rolls of your tongue so well",
            "Google says it will rain in Berlin today until 12 noon.I really hope we get some tennis in the afternoon today",
            "Alright so here me out you mfers, Garcia, Osta, or Zheng win gold at the Olympics. Haddad Maia would be my preference but that’s my take.",
            "Hurkacz’s forehand is like Tsitsipas’s backhand",
            "I honestly can't wait for Queen's and other tournies still using line judges to be forced out of them next year. Will Wimbledon and Roland Garros literally be the last remaining men's tournaments using them next year?!",
            "Coco - whatever you can do I can do better - Gauff ladies and gentlemen!",
            "Why is Zverev so terrified of facing Sinner lmao",
            "Hurkacz vs Zverev? Funny enough in my view they’re the same kind of player, with Hurkacz having better serve but Zverev a bit better in every other aspect.",
            "HuHu’s coach rocking the Benoit Paire beard.",
            "Jabeur looking truly exhausted",
            "Ons 😖",
            "musetti baby looks so good so far",
            "Vintage Ajla throwing away set points :(",
            "When’s pegula resuming?",
            "I saw Thiem got WC for Mallorca next week. \nBut is he even playing Wimbledon, I can’t see his name on the entry list or the qualifying list ??",
            "Do coco JPEG play again today?",
            "Unexpected break, feels like musetti will half arse the rest of the set and focus on the 3rd",
            "Musetti please",
            "Wow. This run Tomljanovic is on seems like it came out of nowhere. Good for her",
            "Was that… a break point converted on his first chance?!",
            "great idea to bring a newborn to a tennis match. Congrats",
            "One would think that after watching Raonic put 47 aces, this Hurkacz Zverev match and the amount of points that are serve and done, serve + 1 and unable to get the ball back because the bounce is low or it bounced badly, you'd think people would realize why the grass season is not longer. It has the most boring tennis of the season by a good margin except for a couple of dives that players dare to as its softer to land on, but that's like 1 out of 200 points. \n\n\nIn some months people are going to complain about the grass Masters 1000 and having more weeks and once they get it and see Hurkacz, Eubanks, Opelka, Zverev and others servebotting their favourites in an upset they'll realize why Wimbledon plays slower.",
            "Kalinskaya is redlining against Sabalenka",
            "What is happening with Saba? My channel is only showing Gauff vs Jabeur",
            "Musetti does everything better than Thompson in this set",
            "Musetti please don't let your one day foreigner fans down lol",
            "Can see musetti playing another shit service game and losing the set 6-0",
            "This week I’ve found myself watching Queens a lot more than Halle - largely due to the camera angle",
            "This TB is crazy",
            "That dropper from Ons was… not her finest. Lost her the tiebreak.",
            "Hubi not taking advantage of these second serves at all",
            "Let's go Alja!",
            "Depressed feeling Aussies, some good news. James McCabe, 20, has upset #1 qualies seed at Eastbourne.",
            "Anyone else clocked that sorribes tormo and bouzkova are playing miyu kato in Birmingham??",
            "Searle justifying his MDWC into Wimbledon with a win over Kovacevic in Eastbourne qualies.",
            "lol. Vika about to retire this match too at this point.",
            "Another good win for 18yo Henry Searle in Eastbourne, taking out Kovacevic in 3. Another big serving leftie for Brits to get excited about",
            "i will burn incense for ZHANG\n\n\nmy king\n\n\nthe godlord of the hairrr\n\n\nthe only kswiss user in the modern age",
            "so i suppose not only iga isnt getting a lot of grass prep prior to wimbledon☠",
            "Go Musetti, make chinese and French fans happy(if Musetti beats Thompson, ZZZ will be seeded in Wimbledon, and Fils could be seeded too if Djokovic withdraws)",
            "Players pulling out left, right and center; hate that this happens to 250s every year before Wimbledon.",
            "Eastbourne draw just came out and Rybakina is in the draw.Mqybe she will withdraw",
            "Right, let’s see how this first set goes for Jannik. I’ll have to leave mid match to go to the wildlife photographer of the year exhibit then at the natural history museum on boyfriend’s duties.",
            "Thompson has Olympic circles tattooed on his arm. That's a commitment.\n\nEdit: so that’s how you spell it",
            "the boring servebots battle in atp, lucky we have Ons vs Coco",
            "I love grass but I would also love for Jannik to get at least one (1) non-big server on his path at Wimbledon. Like a single one, a random Coria or something thrown in there.",
            "Putintseva has jacked about 10kgs of muscle mass the past 2 seasons I swear",
            "Not surprised that Putintseva won again, just surprised that she lost four games. Bless whoever is against her in the finals.",
            "guarantee 3 sets for the servebot battle, either Dverev breaks Hubi or Hubi loses the next tiebreak(his winning rate of TB against top 10 is under 50%)",
            "I’m in investing ZZZ stocks rn I want Jannik to win but he def has a good future",
            "Who's the genius who put the Berlin semis at the same time?",
            "What makes Ons so good on grass?",
            "I took a break and it was 5-5 😕😕",
            "Thompson’s paint job interesting - wasn’t he playing with something that looked like a normal Aero before?\n\nEDIT - turns out it’s a special Drive paint job for Wimbledon.",
            "Lol Thompson easy break point opportunity on drop shot but delivers it right to musetti lol this match is over",
            "Musetti just so random looks like taking the set off and focusing for the third to trying to comeback and win it in 2",
            "Tomljanovic winning Birmingham and Thompson winning queens when demon got knocked out of queens in 1st round \n\nDefinitely would not have been on my tennis bingo card",
            "If Lu had a serve as good as Zhang’s back when he was a pro…",
            "Why is tomljanovic ranked 190th?",
            "Thompson not looking good",
            "smell of another tb lost",
            "Carrot boy breaks",
            "So Hurkacz has never beaten Zverev. I can see why.\n\nImo Zverev is just a better version of Hurkacz. Both have the killer serve but I think Z has way better groundies so when you look at it like that yeah it makes sense why Hurk has never beaten him",
            "kinda weird how the 4 semi finalists of halle would actually destroy 3-1 or 4-0 the semi finalists of queens.",
            "Yep this is the only way to beat Zverev. But he had like 5 BPs so he had chances",
            "ZZZ won! so clutch! always a solid contender. more power.",
            "Coco fell already. First point 😞",
            "Why is Potapova's \"grunt\" so aggressive wtf 😂",
            "Besides the serve there is literally nothing special about Hurkacz’s game ",
            "Zverev will regret not breaking here trust me",
            "I wonder if everyone realizes that Tsitsipas story is direct Jehovah's Witness doctrine. \n\n\nSerena Williams was recently baptized into that faith. Women are expected to always obey their husband. Women are forbidden from holding official positions within the church and only recently were permitted to wear pants. \n\n\nI don't say this to criticize Serena. She certainly isn't a weak or servile woman.",
            "How is Musetti so much better than Tsitsipas on grass? His FH and serve are way weaker",
            "disappointing, zhang should NOT have been broken there, he had sinners number so far, w/e",
            "[deleted]",
            "Yank here. Talking bout retirements. When is Andy's next match",
            "As good as hurk is on grass/ how likeable he is.\n\n\nI really hope he doesn't go deep at wimbledon.\n\nThe acefests are so boring to watch and I still have PTSD from 2018 with isner Andersen ruining the second semifinal",
            "Lmao, I went to do other things and Hubi breaks Dverev? \n\nRIP Hubi, you need to pray Dimitrov early exit in Wimbledon as you will definitely get him in R16 so you won't be the obstacle of privilege guys",
            "Zverev standing 2 meters behind a baseline and performing very poorly on grass is a testament to why servebotting doesn’t take you far on grass.",
            "[deleted]",
            "LETS GOOOOOOOOOOO Zhang, knock this guy outttt",
            "First time watching J Nadal and this guy makes Leo Borg look like a killer. Should never be anywhere near an ATP draw again",
            "Yes, breaka him!!! Don't choke",
            "pretty lame move to not even finish the set.",
            "Anyone asking why men's tennis is more popular... Well, this is the answer.",
            "Can Pegula finish Siniakova or choke her way again to L?",
            "Jabeur's level is shockingly bad. Gauff can't just play the SPs well.",
            "Man wanted to take musetti live but my book suspended the match and took all bets off the match, don't see anything sus happening ",
            "What a bunch of pussys tab, they will probably put back shitty odds after someone breaks final set ",
            "Yo wtf did Coco do to her hair\n\nIt’s different right? I ain’t tweaking? Since when bro",
            "Enjoy! Gerry Weber Stadion is amazing.",
            "Was spoilt growing up as a casual tennis fan having a 250 tournament in Hobart and going to Australia open several times, including seeing hingus and kournakova play doubles together.. hope you have a blast",
            "Have fun! \n\nThe only pro matches I ever got to watch was something local in Belgium. Did see Clijsters en Henin play before they were known tho. And Zizou Bergs a couple of years ago. But it was always such a vibe! \n\nRoland Garros is on my wishlist.",
            "Enjoy the matches",
            "Have a great time! My first tournament was only a few years ago - the experience in person is totally different, especially if you have really close seats.",
            "oh? that’s why play is suspended? someone down in the crowd?",
            "they're 2-2, but some of that goes way back. Should be interesting.",
            "hubis skills othet than serving are def underrated, he can be really good at the net too plus hes surprisingly athletic for someone of his height",
            "Someone on here yesterday called Zhang a servebot lol, it's become a meaningless phrase used by idiots to discredit anyone who has a good serve.",
            "Yes I’m all for it.",
            "If you told Sinner fans that stat 2 - 3 years ago it would feel absurd",
            "She had never retired or given a walkover in her career",
            "They’ve been good in most of their matches so far, and their playing styles fit each other. But Hubi isn’t as good on clay and could crack under the pressure.",
            "its almost guaranteed",
            "Is this a good or bad thing? Should i like it?",
            "Not anymore 😭",
            "Yes :) or ‚dawaj Hubi’ which means let’s goooo",
            "Im just jealous of her getting sponsored by Alo 🫡",
            "Grass sucks lmao",
            "and backing it up with THAT first point in the next game!",
            "Must be on his way to Mallorca",
            "What happened to Sabalenka? And was Jabeur just too gassed after that first set?",
            "Dont jinx it yet!!",
            "according to stats, yes",
            "yes, at least that’s what atp stats say",
            "Raonic would have given him a run for his money had he not get injured.",
            "Tell this Raonic",
            "Sinner has literally bageled Isner lol",
            "Wasn’t Struff a servebot",
            "He just beat a much more convincing servebot and overall player yesterday",
            "It'll be easy 7:6 7:6 for Sinner",
            "The shadows 🫠",
            "Precautionary. Wouldn’t be too worried",
            "Early here and just catching up. Ons and Saby both injured? What happened? So bummed seeing that. ",
            "I don't think he's finishing this match",
            "Zhizhen looks like the easiest opponent so far, but they never played so there's that factor in play",
            "unless zhang goes ultimate red-line mode while maintaining great serving and something close to mental impeccability, sinner will probably outclass\n\nzhang has the raw power but i doubt he can sustain it consistently, and i'm sure sinner will be well prepared to exploit zhang's linearity",
            "Sinner will have an easy match",
            "it should be 6-2, 6-1. But Janni will take it three sets through losing his serve or spraying UE in set 2. I'll end up with more gray hairs. He'll be amazing in set three, so something like 6-3, 5-7, 6-1",
            "forza vs. niu bi",
            "She has been having consistently good grass seasons",
            "thanks to the user teaching me dawaj btw!",
            "Not surprised, we are absolutely shit at football. Always been. People complain in Poland about colossal wages for footballers, yet they don’t represent anything unlike Volleyball players",
            "\"in bo 5 you'd win\" )",
            "Don’t underestimate Jessie Pegula",
            "Now",
            "Yeah he has been so clutch on the big points in all his matches",
            "Don't be so sure he'd be in the final. Thompson just broke him in the second set and he is a better grass court player...",
            "2 tour semifinals is the best record in chinese tennis history",
            "Exactly. He's shorter than Medvedev but his serve is 10x better.",
            "Doesn't his numbers always go up during grass season though",
            "That’s why he’s movement is decent",
            "Did she retire?",
            "We’d be wearing jackets here in southeast asia at 20c",
            "Every time I see someone using the Fahrenheit scale I ask myself \"why\".",
            "Because that's Celsius",
            "Lmfao I think so too",
            "Maybe it is fake!",
            "It’s on the BBC somewhere (either Red Button, website or iplayer) if you can access that.",
            "I don't know who any of those people are but I like your passion",
            "I like saying Triple Z",
            "Isn't Halle Westfalen really far from Berlin?",
            "Coco Gauff to win Gold",
            "Garcia is wild to even consider lol",
            "Warming up now so should be soon",
            "I would think so since they're so behind ",
            "Thompson seems injured now though",
            "Still love that it gives different players a chance to succeed. Tennis is a game of different styles and big serving is a legitimate style of play.",
            "100% this",
            "The grass season did become longer from 2015 on.",
            "So now Sabalenka just called the physio",
            "She just retired. \n\nKalinskaya was playing out of her mind, redlining,, Sabalenka called the physio - physio gave her a shoulder massage. Then Sabalenka played one more game and quit.",
            "She's got a bad case of yips.",
            "if u put expectations on musetti he will let you down.",
            "👀",
            "Isn't Norrie a K-Swiss 'ambassador'?",
            "Can’t forget the Italians though! I know Sinner is keeping em pretty happy but if Lorenzo could make something happen here it would be great, almost like a bonus for Italy! \n\nI mean imagine Musetti & Jannik winning Queen’s & Halle",
            "Grandpa needs to withdraw and stop wasting everyone’s time",
            "Any tournament the week before a major it’s the same deal…\n\nI’d prefer they withdraw before the tournament starts than to pull out during the tournament though - in one of the Adelaide tournaments before AO recently they had no SF as players withdrew from both halves. \n\nAt least pulling out before hand gives other players a chance to get some points etc rather than taking the spot and then giving a walkover after a match or two",
            "Are you talking about Berlin? It’s a 500",
            "For her sake…I hope she does.",
            "I’ve heard he’s not even playing the Olympics this year 😭\n\nIt must be from Rio I guess",
            "*A random Moutet appears and almost bagels him*",
            "Did you see his path last year ? \n\nHe’s the top seed so he should be safe for a while anyway",
            "it is Zhang not Shang, he is 28 not 19, the same age as Medvedev",
            "Based on the WTA website linked here one starts right after the other ends, the doubles semi will be on court one though. Quarters being on at the same time was unavoidable though due to rain delays (shame the most exciting matches are taking place simultaneously but makes sense as the other players who either played doubles or started their matches yesterday are left to rest based on the WTA rules)",
            "That will be difficult since they're scheduled to play on the same court. ",
            "I thought you were going to talk about his beard",
            "I thought he used a Pure Drive, or maybe it's a special edition paintjob",
            "Injuries, she's barely played this year and last year",
            "this is the best surface for HH to have chances against him",
            "They not nothing alike apart from having big first serves.",
            "I told you he will live to regret it lol",
            "Shocking that the best serve on tour in addition with good volleys and decent movement and groundshots gets you to the top 10 ",
            "They've been Jehovah's Witnesses since childhood.",
            "Musetti is a delicate flower. He blooms on the natural surfaces like clay and grass but can't do well on hard court",
            "Block return and slice are a huge part of it. He's also much smarter in how he plays.",
            "Way better bh slice and while i agree on fh in general Musetti cross court fh is a huge weapon",
            "Not even close. Hurkacz isn’t invincible in TB, whereas Nadal was nearly invincible at RG.",
            "in this conditions dimitrovs game will not matter that much, just shoot at him with 220kmh aces and don't do any rallies",
            "it does take you far on grass, Hurkacz is just serveboting even more, and at the same time he’s a better grass player overall",
            "tanked the match after playing a tiebreak that went 11-9? ok",
            "Tanked?! Hahah Ons was try harding the whole match dude!",
            "Ons fought tooth and nail. She looked exhausted between points then the point would start and she was 100%. Coco was fighting her hardest and Ons saved 7 break points.\n\nEdit: also the physio took her vitals and it appeared that they told her she needed to stop.",
            "Servebotting and tiebreaks are the worst example",
            "I rather watch one great set like the Ons and Coco than the boring 3 sets servebot battle",
            "But you also had men retiring lol like Djoko, Nadal, Sinner, Alcaraz… to name a few who had to retire this year due to injuries",
            "That Wimbledon QF match against Vondrousova😥",
            "Thompson is injured, are you watching?",
            "STFU and take your disgusting gambling out of here.",
            "Thanks 🙏🏼",
            "He's also not as tall as you think. He's listed at 6ft5 - shorter than Medvedev, same height as Korda and FAA, yet I remember Henman and McEnroe being asked last year what made his serve so good and they both just said \"height\".",
            "I always think he looks calm playing with Iga. He trusts her and knows she can hit any shot he needs from her.",
            "Lol it's thank you in Polish 😍",
            "It says ‚thank you very much’ with a minor spelling mistake. It’s Dziękuję :)",
            "I knoooooow! I was ready for the 2nd set after that amazing tiebreaker",
            "She's not exactly sponsored by them apparently. They give her kits and nothing else money wise. With her Evolve partnership and newfound visibility thanks to her boyfriend, she may get a proper kit sponsorship from somewhere.\n\nShe'll be teaming up with Vekic in doubles at Wimbledon, a sponsor darling, so she may get some more eyes on her in London.",
            "Yeah he has to be, just left him alone",
            ">Sabalenka\n\nShoulder injury \n\n>was Jabeur just too gassed after that first set?\n\nNo.She looked exhausted from the first point.She really tried to push herself & fight but her body gave up",
            "I believe it was her shoulder, not the first time that it’s been bothering her this year if I recall correctly.",
            "Everytime I see his name in a tournament, it almost always ends with retirement. He seems to be struggling with long injuries",
            "Not much information known as of yet - Ons supposedly has something to do with blood pressure so was advised by the medics to retire whilst Aryna shoulder injury related (looked like she was struggling a bit before she retired and apparently she was rubbing her shoulder before the match and took MTA, had a shoulder massage continued for a set and then retired). Probably precautionary and to not aggravate anything further since due to rain delays both quarters and semis are due to be played today so anyone who wins will have to play again in 2-3 hours.",
            "What does 'niu bi' mean?",
            "I mean she just came back and hasn’t played anyone of Gauff’s caliber. I like JPeg a lot but I don’t expect her to win Berlin ",
            "a very little time will tell. I actually agreed with them that Tommy Paul, being the last remaining seed, gets to decide if he is going to win it all or not.",
            "Meddy always catches stray bullet 🥲",
            "He's listed at 6'5 that's still in the area where you're expected to have a great serve",
            "Everyone’s serve numbers go up in the grass season. Hubi has been the second best at holding his serve in the last year across all surfaces, it’s not a grass thing him having a cannon as a serve",
            "Yes",
            "Because 100 degrees is \"a really hot day\" and 0 degrees is \"a really cold day.\" I don't care if the temperature is too hot or cold for water to be liquid...",
            "All up and coming talents. Aged 18, 19 and 22.\n\nRajecki (22) just came out of US college and has already beaten two top 100 players this week, and gave a top 50 player a run for her money. Then she had to quickly make her way to the Play Offs, in which she came through with relative ease to earn a QWC into Wimbledon. I hope she qualifies for the main draw and really embarrasses them.\n\nStoiber (19) was a solid junior, not been on the pro tour long. Came through qualifying for Ilkley this week and made it to R16 taking out players she would be playing in Wimbledon qualies if they gave her the fucking chance, and has now backed it up with a top 100 win.\n\nElla McDonald just won four back to back matches at Ilkley to get in the QF, again, taking out players in the #100-250 range that she'd have to compete against in qualies if she got the chance. She had to play two matches in one day so her QF loss was inevitable.\n\nThese are three women that have/had a real chance at coming through qualifying, yet they've been snubbed for players who have shown no such level...",
            "Yaah i mean Women's Tennis in Berlin",
            "Won doubles on clay, my favorite French player too but her mentality sucks",
            "Oof. Coco is lucky Ons retired then. That match was fixing to be 2.5 hours",
            "It is legtimate, it too is almost unwatchable and the reason Wimbledon slowed the courts was because the entertainment of watching to big servers play between 1 and 3 rally points 60% of the time was almost 0.",
            "They want even more, just see the threads they do through the year",
            "Etcheverry too. And a handful of top 50 women.",
            "A lot of ATP withdrawals from Eastbourne/Mallorca is what I was assuming…..as they’re 250’s next week + have had a lot of players pull out",
            "😂😂",
            "Yep just talking about this year, Halle has been brutal from 1st round till the hypothetical final. And there’s lots of unseeded big servers, so being #1 seed doesn’t mean you don’t get them 🙂",
            "Sabalenka is on Court 1\n\nEdit - my mistake. This is the quarters. Coco and Sabalenka playing at the same time.",
            "Sorry, you’re right - Drive, not Aero. Haven’t seen a black and white Babolat for a long time.",
            "having a convo with yourself?",
            "If only all that was true but yea sure, the serve is too OP on grass, once he gets into an actual rally he’s middling going baseline to baseline against other top players ",
            "But she only got baptized last year. ",
            "it is a mental game, like Dverev/Tsitsipas vs Medvedev",
            "Nope that’s just a myth. \n\nServe is just ONE thing you need on grass, you need so many other things besides that.",
            "Yes cry a river",
            "2 upvotes for you!!",
            "Still, I wouldn’t say no to free alo yoga stuff (:",
            "Hard to know if it'd make them happy or not, but he looked to be pretty smiley yesterday and in good spirits. He might have appreciated it as someone who might not get it a lot. \n\nI guess the big guys get it all the time but I was chatting to one of the security guys working at Queen's this morning when I was having breakfast in a cafe up the road. Said he had to follow Rinky doing autographs yesterday but it was funny start of week nobody knew who he was and I think most he got was someone who came up to him to ask him for directions not even realising he was a player 🤣",
            "How does she look for Wimby, any info on how severe it might be?",
            "Ofc just didn't know if you were surprised by it, it's what he always does. As for the height thing, I haven't seen him in person but I'm pretty sure bro is a legit 6'5.",
            "Yeah but 0°C is enough for there to be a frost and 25 is a hot day. That's not hard is it?",
            "These temperatures don't tell me anything. 0 degrees Celcius means it's cold enough for water to freeze or snow to remain, 100 degrees is boiling hot. You don't need a 100 degrees to describe the weather. The Celcius scale is easier to use and useful for more things.",
            "Looks like they are scheduled to play in a hour?",
            "So lucky.But i think she will be fine.She usually plays singles & doubles same day.",
            "When two big servers play one another I understand your point, but grass gives amazing matches too. Thompson-Musetti will be great fun for example.",
            "Just because it’s unwatchable for you doesn’t mean it’s for others as well. I love grass tennis because it gives an edge to naturally aggressive players and you need to have great hand skills and feel to succeed.\n\nZverev is actually a great example of huge serving is not = success on grass.",
            "Ah ok I’ve missed news about players pulling out",
            "Yeah….but Halle the entry cut off was around 50….Wimbledon is much higher - so those earlier rounds you’re very unlikely to get a big server - unless he gets Berrettini (I hope not, for Berrettini’s sake) or Raonic - but Raonic has to go through qualifying first and hasn’t been able to win 3 matches in a row for some time….\n\nForgot that Struff isn’t seeded anymore - that would be bad luck for him - but unsure of any other big servers that won’t be seeded at Wimbledon  ?\n\nAlso 32 seeds vs 8 seeds offers more protection in earlier rounds",
            "That's a quarterfinal match. ",
            "No just wanted to add a comment",
            "😂😂",
            "Same, it's so expensive but still great quality. 🙌🏼",
            "I think I would have said hi if he was on the counter right next to mine, but there were a few between us and he was with his girlfriend",
            "Thanks",
            "Wimbledon and the majority of their watchers actually happens to agree with me as they took the decision to make it slower, second, outside of Wimbledon which is slower Zverev has reached 2 Halle Finals, third he is showing with his improved serve (because before he had a lower serving percentage and second serve issues) that he can be pretty successful on grass, losing a tiebreak to Hurkacz doesn't take away from it.\n\n\nAnd yes, having a big serve is not a guarantee if you're such a poor returner on grass, but even players who don't serve as big start to get too many free service points. Plus a lot of rallies are basically mishits.",
            "Zverev has only gotten thus far because he is a superior player than 80% of the tour no matter what, and his first serve is so good that covers up for his poor ground game on grass.\n\nHe is by his standards relatively poor on grass as he is not very great as adapting his game like sinner or Alcaraz, and tries to implement clay tennis on grass."
        ]
    },
    "Halle Open: Semifinal - H. Hurkacz def. A. Zverev - 7-6(2), 6-4. ": {
        "title": "Halle Open: Semifinal - H. Hurkacz def. A. Zverev - 7-6(2), 6-4. ",
        "score": 434,
        "url": "https://i.redd.it/i25ohvd7d48d1.jpeg",
        "content": "",
        "num_comments": 82,
        "comments": [
            "Biggest concern for Wimbledon is what Hubi will do when he’s inevitably up 7-6 6-4 but he hasn’t planned the score for this far into the match yet",
            "HH undefeated after that lady umpire incident",
            "No one call Hubi tall and useless anymore, he's tall and useful.",
            "Spoiler for tomorrow:\n\n[5] Hubert Hurkacz def. [1] Jannik Sinner 7-6(5), 6-4",
            "Hurkacz popularity on /r/tennis to rise even more for denying Zverev a final spot.",
            "Things you absolutely love to see",
            "How do you return a 230 km/h serve",
            "Hubie gets this week’s Service to Humanity merit badge",
            "hurkacz just loves winning with a 7-6 6-4 scoreline, doesn't he?",
            "I hope Sinner beats ZZZ, because I'm extremely curious as to how a Hurkacz-Sinner match would go on grass, considering their current form",
            "let's go hubestie",
            "Love this weird tall man",
            "Hubi doin the lord's work",
            "FUCK DVEREV",
            "Shows how mental tennis is. Of all the folks to break Zverev's serve on grass, Hubi wasn't necessarily my top prospect. But he got it done with just 1 BP. \n\n\nZverev was 0-4 on Hubi's serve, and that probably got to him.",
            "Now Hubi has to hope that he doesn't run into Novak or Berrettini in Wimbledon.\n\nHe's literally one of the 4-5 best Active Grass court players imo, but he has such shit luck whenever he's been in a decent form.\n\nRan into Berrettini in 2021, lost to ADF in a shocker in 2022 and lost to Novak in 2023.\n\nIf Novak doesn't play, and Hubi is lucky and gets to be in Zverev or Medvedev quarters, he could legitimately go to SF or beyond here imo.",
            "Halle is good in the world now",
            "Hubert Hurkacz, you have ~~failed~~ not failed ~~this city~~ the ABZ",
            "Incredible Hurk defeats DVerev",
            "HUBI YOU MF\n\nI LOVE YOU",
            "And he didn't even have to overthrow an umpire",
            "First decent grass player he faces he gets smashed lmaoo. Zverev is such a massive pusher that his serve can only save him against choking journeyman haha",
            "Hubiiiii",
            "Great game from him. He could go far on Wimbledon.  \nBig serve and good volley - classic for grass.",
            "Thanks to his mate Hubi, Sinner’s world number 1 title is safe until after Wimbledon (unless Djokovic wins it all while Sinner loses before the QF, which is not impossible but not too likely either)",
            "Finally some revenge.",
            "The day is saved rejoice",
            "HuHu so good",
            "Today even those who dislike Hubi love him :p go Hubert!!",
            "I forgot about this match but LFG HUBI!!!",
            "Hey Z, do you wanna change your fate at Halle? - Hubi",
            "Hurkacz easily looks like the 3rd favourite for Wimbledon if we factor in Novak not playing.  I see only Alcaraz or Sinner being able to beat him on grass. ",
            "Cool shirt, what brand is that?",
            "Sasha do you wanna change the score here",
            "Oh I LOVE that",
            "Keep em cumming",
            "So glad Hubi got that monkey off his back after the United Cup match. \n\nHe’s look formidable and with a good draw in Wimbledon, well, you never know, lightning could strike.",
            "Lol sometime Hubi can serve like god. Today was that day",
            "Great win for Hubie. Dangerous on grass. Just wondering though how he could win 7 best of 5 against top players at Wimbledon. Possible but not betting on it. Could see him make a semi maybe.",
            "Hope his opponent serves better so they can play another tie break?",
            "That’s why he plays so many random 5 setters at Slams",
            "He will become powerful and respected enough to replace the lady or die trying.",
            "“incident”",
            "Post umpire lady Hurcacz? PULH",
            "Would love to see it",
            "even that weird umpire incident can't make a dent in Hubi's fanclub",
            "Jokes aside I’m surprised he’s so popular on here in general given how much big servers are disliked\n\nIn this particular matchup I think Zverev’s gamestyle on grass is just as bad with the serve reliance if not even worse (his game style post injury is very low percentile in entertainment as well) but in general people seem to really love  Hurkacz here even when he’s playing someone people don’t dislike",
            "[Step 1. Be Andy Murray](https://www.youtube.com/watch?v=8GYX4ZIPJsg&ab_channel=Wimbledon)",
            "The only way is to steal [Hubi's return tactic](https://www.reddit.com/r/tennis/comments/veqrcr/hurkaczs_funny_return_strategy_against_felix/)",
            "With a SABR (?)",
            "The only final they ever played was in Miami 2021 and Hubi won with a score of- wait for it... 7-6, 6-4",
            "Hurkacz-ZZZ Would end up 7-6(36), 6(0)-7, 7-6(3762)",
            "sinner would lose, I’m not willing to see this matchup😭",
            "I mean truth of it is there aren't many good grass courters right now . You guys can complain all you want about how the grass season wasn't long enough but it was just as long (even shorter technically ) with tsonga roddick berdych etc. players today are largely weak on grass \n\nThere is no tsonga berdych tier of guys who can really threaten on this surface even apart from the big 4. There is not roddick.\n\nWhat's there right now ? Djokovic may not play wimbledon. Alcaraz and sinner have shown enough /developed in sinners case where they are clearly the two favorites imo if Djokovic doesn't play. \n\nWho is left ? Hurk is up there I guess and....berrettini maybe? I wouldn't even pick med because I genuinely believe he had one of the easiest draws in the last 10 years of any major  to make the semifinals last year. Eubanks?\n\nWimbledon has the weakest field overall of the 4 majors. An unfortunately imbalanced draw ( say alcaraz hurk berrettini in one section on sinners half) / an early upset really does run the risk of making the event have a final that's majorly one sided ( think ruud Nadal RG 2022 or ruud Djokovic rg 2033)",
            "I feel like we always say this every year after Halle and then something like that ADF R1 loss happens. 🥲 Maybe this year we can finally be right.",
            "You forgot Shapo smh",
            "Fokina can beat him",
            "Yonex",
            "YY",
            "It’s what’s underneath the shirt that counts 🫦",
            "Me rn like “oh nice Hubi won” even though I had no intention to watch this servebot matchup lol",
            "My guess is it's because he seems like a nice guy + the meme-ability of his tiebreaks.",
            "He is pretty well-liked out here. He's pretty chill and has a nice smile. And he loves cars.",
            "It was a body serve too like 😭😭 how??",
            "Murray was such a goated returner",
            "Probably the best returner of actual servebot level serves ever\n\nNovak is the best returner of normal serves and Agassi the best returner of weak serves",
            "as it was written",
            "Yeah I feel like in the 2010s the big server types were just guys who you didn’t want to draw in early rounds, not arguably a tier 1B contender like Hurkacz is\n\nThere’s a limit to how many players actually feel comfortable rallying on the surface",
            "Tbf in 2019 and 2023 he lost to Novak in the 3R and 4R. Technically not unlucky because his seeding was low but yeah, not bad losses at all. 2022 was a weird one because that felt like a huge opportunity",
            "He had diarrhea that year I think",
            "Let's be honest Fokina will beat himself ",
            "U forgot Shapo",
            "I enjoy a good serve off every now and then and watched.  This one in particular really felt like something from a long time ago.\n\nBut it should be mandatory viewing for anyone who complains about surface homogenization.",
            "Not judging either way but it's interesting how much people care about personality/\"niceness\" on r/tennis compared to other tennis forums I've seen\n\nI also use Tennis Warehouse forums and people there barely mention personality at all and basically only dislike or like a player for their gamestyle\n\nFor example Zverev is also massively hated there despite his allegations barely even getting brought up because everyone (understandably) despises how he plays(servebot + pusher hybrid which are the two most hated styles) lol\n\nIf I had to guess the demographic on Reddit is definitely younger and more female than TTW so people here care about players on a more personal level",
            "I tried to imitate Murray vs big servers and do the \"EEEEHHHH\" higher pitched, long grunt. Didn't work. The secret must be something else",
            "Nah Rune clears them both easily",
            "Shit himself?",
            "It takes a special kind of personality to be a forum-goer.",
            "![gif](emote|free_emotes_pack|poop)"
        ]
    },
    "WTA 500 Berlin QF: Kalinskaya def. [2] Sabalenka 5-1 (ret, shoulder injury) - first retirement ever in Aryna's career": {
        "title": "WTA 500 Berlin QF: Kalinskaya def. [2] Sabalenka 5-1 (ret, shoulder injury) - first retirement ever in Aryna's career",
        "score": 119,
        "url": "https://www.reddit.com/r/tennis/comments/1dltecy/wta_500_berlin_qf_kalinskaya_def_2_sabalenka_51/",
        "content": "",
        "num_comments": 40,
        "comments": [
            "Uh oh. The injury must be pretty bad if Sabalenka retired, given how much she's shown to be unwilling to retire when feeling bad even just this year...",
            "Kalinskaya enjoying her own little FAA's in Madrid run.",
            "Sabalenka's health was sprinkled with marathons with Iga on clay. Already in Rome she had a back problem and was battling a cold, at RG she had a stomach illness and now the first retirement of her professional career. On top of that, she had already withdrawn from the OG because she knew her body couldn't handle it. \n\nTennis players' bodies due to the heavy strain are collapsing. This shows how difficult the tour is and tennis players need to be given more time to rest, instead of extending tournaments causing constant play. Iga played from BJKC until Paris for 8 weeks without a break.",
            "I've seen enough. Raducanu is winning Wimbledon by default because everybody else will be injured (she will play an exhibition match against Zendaya before the ceremony)",
            "Get well soon Aryna hopefully this retirement is precautionary and nothing serious is going on\n\nAlso Kalinskaya is I believe now 7:0 this year against top 10 players that's wild I'm not sure anyone other than Iga has as many top 10 wins this year",
            "Wow. Her first retirement ever? I hope shes able to heal for Wimbledon",
            "aryna, ons, elena all down within 24 hours omg WTA Hospital Berlin Open",
            "Kalinskaya strolling into the semis.",
            "Excuse me for asking, but where there always so many injury retirements on grass season or is this new? Cause I’ve seen too many posts about injured players",
            "Coco remains at #2 ranking spot which will make for an interesting seeding situation at Wimby. \n\nOf course assuming Sabalenka plays\n\n- Either Sabalenka or Rybakina guaranteed to be in Iga's half\n\n- Sabalenka and Rybakina cannot possibly meet until F",
            "Did the injury happen during the match?",
            "Vondrousova, Sabalenka, and Rybakina have illness / injury issues. Swiatek another of last years Wimbledon quarter-finalists has not played any grass warm-up matches. ~~At least Jabeur's knees look okay.~~\n\nJabeur as well 😭",
            "Whaaaaaat",
            "Anna and Jannik are both winning Wimbledon this year and then going to dance at the Wimbledon Ball :)",
            "Kalinskaya was playing out of her mind, redlining,, Sabalenka called the physio - physio gave her a shoulder massage. Then Sabalenka played one more game and quit.\n\nIt's a shame Sabalenka retired. Kalinskaya was about to pull off a major upset - just takes away from how well she was playing. Sabalenka wasn't playing bad although her serve percentage was low.",
            "Where was the injury? Her larynx?",
            "if she won her next match would be like 2 hours later. probably didn't want to push it.",
            "Shades of Djokovic at the 2016 USO. Got 2 retirements and a walkover iirc",
            "I think they should get rid of mandatory tournaments - most players will show up for the big ones anyway because they want the points etc. \n\nIt’s just becoming detrimental to players and fans at this point. \n\nWTA for some reason has more mandatory events than the ATP and the calendar is often a lot less logical too",
            "Rybakina and Sabalenka ded = Iga to win Wimbledon?",
            "Lmfao",
            "There are a lot of slips and bad falls, but Aryna's retirement (or Lena's yesterday) has nothing to do with the grass. They both have been struggling a lot recently, irrespective of the surface.",
            "Simplest answer is the surface… moving from hard to grass is easier than clay to grass",
            "the same way that aryna or rybakina guaranteed to be on coco's half\n\n\n LOL",
            "she was rubbing her arm since the beginning of the match",
            "Ons just retired from her match against Coco after the tiebreak too 😬",
            "Which means Jabeur will lose the Wimbledon final to...\n\n*spins a wheel*\n\nMarta Kostyuk?",
            "So you do think this wasn't an actual injury?",
            "Mandatory tournaments aren't the problem. What's bad is extended 1.5 week ATP/WTA1000 tournaments. The tours are on absolutely wrong path with that trend.",
            "The leap from 4 to 10 mandatory 1000s this year is insane I have to say.",
            "More by how much?",
            "It'll probably be some random winner like last year",
            "Iga hates grass and her preparations are aimed at the Olympic Games. It looks like Coco has improved her serve strongly since RG and is growing into a favorite",
            "And Coco has a positive H2H with both players so alas",
            "Oh….I hate those too - definitely think they’re not helping anyone, and don’t think fans enjoy them either for that matter",
            "But even when it was back when they only har 4 mandatories most top players played 8-9 1000s anayways. The only exception was Serena. Even Sharapova played 8 of them most of the time.",
            "But even when it was back when they only har 4 mandatories most top players played 8-9 1000s anayways. The only exception was Serena. Even Sharapova played 8 of them most of the time.",
            "I’ll need to check as I don’t know off the top of my head - but they have more 1000 events (although not all are mandatory….ATP only has 8 mandatory 1000 events for top players) - and then I believe they have to play 6 500 events, where for ATP top players it’s 4 500’s (but technically Monte Carlo can count as one so it’s as low as 3)"
        ]
    },
    "Roger Federer continuing his retirement sidequests era, now on set filming an upcoming ad campaign for ON with actress Zendaya": {
        "title": "Roger Federer continuing his retirement sidequests era, now on set filming an upcoming ad campaign for ON with actress Zendaya",
        "score": 374,
        "url": "https://v.redd.it/uyigzwedr18d1",
        "content": "",
        "num_comments": 70,
        "comments": [
            "2-handed backhand is a new main quest",
            "Did this man just 2hbh?",
            "zendaya milking her tennis bag",
            "CGI is cheaper than a can of balls apparently.",
            "Crazy how he was worried that he won’t have much to do after retirement. Man is in demand.",
            "What’s that court? Turbo pickelball?",
            "dude on the left needs to wait until they're done before getting his oversized autograph, the nerve of some people",
            "Must be weird to know that her character was literally based on his wife. 🙃",
            "Bro is too nice to give queues",
            "Some people in here crying that it cannot be Roger when it literally is. 😭 He’s not playing a slam final, just filming a commercial, doesn’t need to move like it’s an actual match. \n\n[here’s a picture where you can see that it’s him](https://x.com/cravemedia_/status/1803793092555993267?s=46)",
            "looks badass",
            "Roger is special.",
            "they really need to get zendaya, just when 1G4 is their endorser and rightfully the best wta player rn. 🥱🤦",
            "I’m getting somewhat tired of Zendaya’s campaign to become the face of tennis.\n\nWell really it’s more like I’m jealous that she gets to do all the things I wish I could do lol",
            "lmao wtf is he doing",
            "Zendaya",
            "Does not look or move like Roger?",
            "interesting - is the dude just money-obsessed?  or is it about keeping his \"brand\" alive, which ultimately boils down to his pr people advising him to keep doing these types of things to keep his brand strong so he can make more ridiculous sums of money.\n\nit just seems strange to me because one, he has more than enough money for basically anything and everything his family could ever need and two, he does all this tennis adjacent stuff but very rarely, or rather, never actually seriously picks up a racket anymore to hit in any public fashion.  I imagine this is also because, you know, the great and amazing federer shanking balls and losing every now and again on the senior tour hurts his BRAND.  the mysticism and awe surrounding the \"great federer\".\n\niunno man just seems a bit shite to me, this guy is great, but it kind of mirrors some of my thoughts towards his greatest weakness which is his hubris and lack of humility when it comes to being able to just be shite and fart every once in a while.  he is very personable off the court but this weird mentality he has around his tennis and by that extension his actual game to preserve this \"invincibility\" actually hurt him I think many times.  He doesn't have to \"prove\" anything, he is truly the greatest there ever was, when it comes to what someone can actually do with a tennis ball on the court.  An unihibited federer (mentally)?  Never seen anyone play the game like that.  But the \"great federer\" mentality and BRAND?  It definitely hurt his *results*.\n\nWhenever he \"got in his head\" about the whole thing, his game suffered and the other 2 big three members were able to evolve and get better mentally imo.\n\nAnyway, a lot of rambling, but I just find the way he goes about this media docket tennis-adjacent stuff very weird when he publicly at the same time never picks up the racket to hit in any serious capacity anymore.  Case in point, around the same time he and djokovic went to some UCLA tennis for appearances.  Federer did a photo shoot and shook hands, Novak actually went and hit with someone.  And guess what?  Nole lost some points.  Ya, he made some mistakes out there.  But who cares?  Well I know who does, Federer.  Very curious and interesting to me.",
            "While Rafa is busy opening academies in various countries with presumably quite a bit of initial investment, Roger just shows up play pretend with an international superstar and rakes in truckloads of money. There are ways of making a fortune and then there’s Federer.",
            "Damn, her technique looks clean!",
            "Not remotely Roger lol can we get serious plz",
            "It's for his imminent return to the tour, protected ranking into Wimbledon main draw and here we go. Totally gonna happen.",
            "Last two air shots are perfect impressions of Kyrgios grounstrokes, both on bh and on fh side",
            "Prob more like cos Zendaya has zero actual tennis skills to maintain a rally.",
            "Do you not see the position of the cameraman",
            "Federer : “man why are people so needy for me”",
            "Hang on what? When did this come to light? And who was the other player in their triangle?",
            "Zendaya has 190M instagram followers and Iga has less than 2M. It’s just business",
            "I think a lot of sports brands use actors in their adverts, and Zendaya recently did a tennis film so it makes sense",
            "yes it does he’s just being a bit casual and goofy. https://x.com/zendaya_updated/status/1803788112067506570?s=46&t=upAHZVZmMA6ebsfJplA4LA",
            "I don't think I've ever seen such level of overthinking in my life 😳",
            "Dude, this has to be a shitpost",
            "“case in point” LOLOL as if there was any sensical logic before or after you saying this",
            "The overthinking goes crazy",
            "You’re the only one thinking like this, it’s absolutely hilarious.",
            "I just watched Baby Reindeer on netflix and your energy is very similar to the serial stalker's.",
            "yeah rafa selling out to saudi arabia is so noble",
            "No lol",
            "more serious than shooting an ad campaign?\n\nhttps://x.com/zendaya_updated/status/1803788112067506570?t=upAHZVZmMA6ebsfJplA4LA",
            "*Plot twist: He comes back with 2 handed backhands on both sides.",
            "Olympic doubles with Hingis it is!",
            "Thats not true. I saw her playing. She's actually going to go pro but suffered an injury. Sad stuff",
            "Not based on. More like \"inspired by\"",
            ">Hang on what? When did this come to light?\n\nFrom an interview with the Director/Writer I think. Read about it [here.](https://www.tumblr.com/leclercari/749347547353645056/wimbledon-final-roger-federer-v-novak-djokovic?source=share)\n\nI haven't actually seen the movie though, so I don't know the general premise of her character but she was inspired to some extent by the missus.",
            "Is it just me or is her first backhand actually quite nice looking? Does she play?",
            "yeah and show her play tennis. so her 190M followers will buy that and play tennis.",
            "wow she’s not very popular for someone of her success",
            "i think that film is part of the On campaign too, and her watching iga play one time.\n\n\ni just dont get how she can get more On users by showing her play tennis. ofc those who will buy it are real tennis fans who appreciate iga and roger and not someone who does not know how to play tennis.",
            "My money is that person in the vid is not Roger but another substitute just for helping with the shot of Zendaya",
            "Wtf xd",
            "\\*rolls eyes\\*\n\nI assure you I am not half as obsessed as the average big 3 wanker in here.  I love the game of tennis and I've watched it for a long time but that's just my observations on Federer.  FWIW I don't give a damn about the big 3 at this moment I'm more interested in the future of tennis and I see the most exciting tennis I've ever seen being produced by Alcaraz and Sinner.",
            "For someone who (presumably) doesn’t play, I think so.",
            "🤮🤮🤮 WAKE ME UP FROM THIS NIGHTMARE",
            "And serving only from under",
            "You should direct horror movies tbf",
            "They are two very different things though. And who confirmed this? The movies director ?",
            "Lol, her character in Challengers was in love with 2 tennis players who were also best friends like boyfriend level. Imagine how this could be interpreted when you said 'based on' (not your fault since you haven't watched the movie). She said in the interview her character was 'inspired' by Fed's wife watching her all tense during one of Roger's matches. She thought it must be hard being a pro tennis player's wife.",
            "Doubt she plays much/at all, but for the tennis movie she was in, she learned tennis from some pros",
            "Agreed, that’s how getting more people into tennis works. Iga’s followers mostly already follow/play tennis",
            "Yeah kinda surprised Sabalenka has more followers than Iga and Coco",
            "True but I don't think it's necessarily supposed to be a snub against Iga. She's in a lot of On Running things but may not particularly like the idea of playing a whole role in a commercial, while with Zendaya that's literally her job so she'd be more comfortable with it",
            "Try again",
            "And a pinpoint serve stance.",
            "[The screenwriter ](https://www.thewrap.com/challengers-real-tennis-couple-roger-federer-mirka-serena-williams/)",
            "Thanks for giving context but cause it’s so important. People post on Reddit like it’s fact without any of this and then people go about spreading it. Which looks to be the case here. \n\nNieces and Roger look very happy in his latest doco, she has been so supportive. The character in Challengers was anything but. ",
            "Wawrinka and Federer are Eskimo brothers because of her, right?",
            "To be honest, sabalenkas instagram is pure entertainment.",
            "Just wait until you see how many Raducanu has",
            "aryna posts a lot of reels and trend-like stuff, its fun, coco and iga are a lot less active on insta so ig its a given that she has more followers than them\n\n i dont think it reflects on their actual popularity"
        ]
    },
    "WTA 500 Berlin QF: [1] Gauff def. [8] Jabeur 7-6(9) (ret.)": {
        "title": "WTA 500 Berlin QF: [1] Gauff def. [8] Jabeur 7-6(9) (ret.)",
        "score": 84,
        "url": "https://www.reddit.com/r/tennis/comments/1dltyur/wta_500_berlin_qf_1_gauff_def_8_jabeur_769_ret/",
        "content": "",
        "num_comments": 27,
        "comments": [
            "Berlin is just a cursed tournament this year at this point. Hope Ons will be okay for Wimbledon, she's been playing pretty well up to now",
            "What the actual fuck is going on with this tournament",
            "What’s wrong with this year’s grass season? Aside from the usual slippage, this is insane 😭",
            "Maybe Iga was wise for not participating in the tournament cause wtf",
            "The announcer mentioned during Sabalenka's match that she watched Sabalenka and Ons warming up before the match - didn't notice anything wrong with Sabalenka's shoulder.\nBut what did they do during that warmup?? Both had to retire from their matches.\n\nEdit - Coco looked GREAT. The forehand was firing, her serve was on, and her mental game was on point as usual. Ons saved 7 set points and Coco just stayed with it and got it done on the 8th.\n\nEdit2: The physios took Jabeur's vitals and it appeared that they advised her to quit based on her blood pressure reading.",
            "I was on stadium watching live and from 5-5 Ons looked very tired/dizzy :(",
            "Everyone's retiring what's going on? Last person standing wins Wimby?",
            "this feels like rome 2023. even in the final match, kalinina had to retire",
            "Oh no",
            "Wimbledon going to be something like Alexandrova v. Svitolina in the final, both of them beating Iga/Coco in their respective semis at this rate.",
            "Injury, sickness, what happened? Please add details to the post title, eg\n\nWTA 500 Berlin QF: Kalinskaya def. \\[2\\] Sabalenka 5-1 ***(ret, shoulder injury)***",
            "Coco has now won 3 in a row against Jabeur, each win coming from a different surface. Win at the WTA finals on hard, win at RG on clay, now a win at Berlin on grass, and improves her H2H to 6-2.",
            "Iga is going to win Wimbledon by default lol",
            "By wimbledon everyone is going to be injured. Except iga swiatek who herself has placed this curse upon the rest of her competition. This is how she wins (before anyone thinks I am serious… iga has been my favourite since 2020)",
            "All these injuries are getting out of hand.",
            "What is happening",
            "Is Brad Gilbert still coaching Coco?",
            "I’ve been screaming from the rooftops Grass needs to be stigmatised and ultimately banned from the ATP tour. Look how many careers it’s robbed Thiem, Rybakina, Potty, Vondrousova, Ons. It’s criminal it’s even a surface might aswell make them play on Olympic Ice",
            "they didnt want to be too exhausted for wimbledon",
            "Would you say her forehand is getting better?",
            "Whatever happen-ed happen-ed. Now we are here. We are in ~~Rome~~ Berlin",
            "Grass made Rybakina sick and gave Ons high blood pressure. What an asshole",
            "What happened to Thiem on grass?",
            "Let’s ban grass because it is sometimes slippy. Great idea.",
            "Well yes. Thank you for helping my point. It’s dangerous and has robbed us of Hall of fame careers. If a plane sometimes crashes because of an issue, you rectify the issue before another plane goes up. Same Logic applies. Going from the beautiful clay court season to this is bad for the sport"
        ]
    }
}