{
    "Kind reminder that political topics are not allowed here (Rule 4)": {
        "title": "Kind reminder that political topics are not allowed here (Rule 4)",
        "score": 144,
        "url": "https://www.reddit.com/r/TerrifyingAsFuck/comments/1afrtig/kind_reminder_that_political_topics_are_not/",
        "content": "Hi everyone, we would like remind everyone that this is not a political subreddit. r/TerrifyingAsFuck is not a place to discuss or argue about politics, spread your political views, blame or praise political parties or individual politicians, etc.\n\nWe understand that the US presidential elections are coming and that several other countries also have their elections this year. We also understand that some of you find actions or words of certain politicians or parties terrifying. However, this subreddit is not the place to talk about these topics. Please focus on terrifying people (not politicians), animals, natural disasters, true crimes, historical moments, military conflicts, etc. instead.\n\nFor political discussions, we recommend to visit some of the many subreddits dedicated to politics (like r/PoliticalDebate) or to individual countries (check their rules to see whether they allow political topics).\n\nThank you for understanding.",
        "num_comments": 0,
        "comments": []
    },
    "Hope he's OK...": {
        "title": "Hope he's OK...",
        "score": 1272,
        "url": "https://v.redd.it/hixyqi6v538d1",
        "content": "",
        "num_comments": 106,
        "comments": [
            "He's been discharged from hospital. Docs says he is good just dehydrated apparently. \n\n[Source](https://www.google.com/amp/s/www.dailymail.co.uk/sport/boxing/article-13556231/amp/Tramaine-Williams-discharged-hospital-tells-fans-good-boxer-suffered-seizure-midway-TCL-fight-v-Ryan-Allen.html)",
            "Yeah dehydration is so much scarier than most people realise. I’ve gone from completely fine to slumped on a chair unable to move for a few minutes before. \nSelf inflicted! Cycling in stupidly hot temperatures and not increasing my fluid intake. I lost 6kg of weight in 2 hours! All sweat.",
            "Hats off to the opponent who was genuinely concerned. A lot would have turned and threw their hands up in victory.",
            "good sportsmanship from the opponent",
            "He had a seizure, Doctors believe its cause of TCL",
            "Props to the other guy, he looked really concerned for him.",
            "😧. I'm old enough to remember what I consider both the greatest and the saddest boxing match of all time. \nRAY Boom Boom Mancini vs South Korean boxer Kim Duk-koo (1955-1982). One of those fights where neither gave an inch and refuse to lose. Breaks my heart right now thinking about it.",
            "Oh poor man😢",
            "Kudos to Allen for his sportsmanship.",
            "Absolute hats off to his opponent. So many fighters would have tagged him when he stopped defending himself. He obviously saw there was something very wrong and didn’t take the shot. \n\nWell played sah, well played. 🫡",
            "Well, I probably would never send my child to boxing. I'm ok with martial arts but in the boxing where you regularly have head jabs and punches and where concussions are routine it's not worth it",
            "I am glad to know that fighter is ok.  Dehydration is uncomfortable, weakening, and scary AF, both seeing it and having it.  You know what I also love?  The fact that his opponent was obviously worried about him.  The rivalry only extends to them as boxers, but not as people.",
            "Ping <900",
            "Respect for the other fighter for genuine concern. But i wonder how does it feel that you're the opponent and the guy actually died or had life changing injury.",
            "He had a seizure",
            " Dude need to drink some Brawndo it has electrolytes!",
            "I thought he was charging up for a big punch🫤",
            "Quite the opposite he is actually KO",
            "Clearly. He is not ok.",
            "Someone disconnected his controller....",
            "if i was his opponent my knees will weaken",
            "He is KO",
            "Jabby McJabJab",
            "\"now I do want you to go down in the fourth, and this time, I DO mean it\" \n\nHow he chooses to go down in the fourth. . .\n\n\"Your on thin ice my pedigree chums, now fuck off\"",
            "If i was ryan allen i would’ve start crying.",
            "What happened? They just punching each others brain, i dont understand?",
            "![gif](giphy|3gpfkdQIunv5C|downsized)",
            "I wonder if he took the vaccine??",
            "Deffo seizure. I've had them. Don't know what idiot said it was dehydration.",
            "Its just because of dehydration???  It cannot be that simple.",
            "I am drinking water right now",
            "You’re one T away from the perfect username for this comment",
            "Id be surprised if dehydration was the only factor in play here. However, it is absolutely disgusting that combat sports STILL don’t have mandatory hydration tests.",
            "Thanks for linking it. It’s such a dangerous sport. I love watching but I wonder if it’s something we should stop.",
            "It looks like you shared an AMP link. These should load faster, but AMP is controversial because of [concerns over privacy and the Open Web](https://www.reddit.com/r/AmputatorBot/comments/ehrq3z/why_did_i_build_amputatorbot). Fully cached AMP pages (like the one you shared), are [especially problematic](https://www.reddit.com/r/AmputatorBot/comments/ehrq3z/why_did_i_build_amputatorbot).\n\nMaybe check out **the canonical page** instead: **[https://www.dailymail.co.uk/sport/boxing/article-13556231/Tramaine-Williams-discharged-hospital-tells-fans-good-boxer-suffered-seizure-midway-TCL-fight-v-Ryan-Allen.html](https://www.dailymail.co.uk/sport/boxing/article-13556231/Tramaine-Williams-discharged-hospital-tells-fans-good-boxer-suffered-seizure-midway-TCL-fight-v-Ryan-Allen.html)**\n\n*****\n\n ^(I'm a bot | )[^(Why & About)](https://www.reddit.com/r/AmputatorBot/comments/ehrq3z/why_did_i_build_amputatorbot)^( | )[^(Summon: u/AmputatorBot)](https://www.reddit.com/r/AmputatorBot/comments/cchly3/you_can_now_summon_amputatorbot/)",
            "When my eldest son was 5 weeks old I passed out from dehydration. I had silent migraines at the time (was unaware) and was vomiting every 2 days.",
            "Had a moment like this when solo hiking in the woods.\n\n I was about an.hour and a half away from home.. got real scary when my feet just wouldn't move for two minutes",
            "I'm also impressed he didn't throw a punch when he began having the seizure and left himself wide open.",
            "It is mixed if a fighter has gotten in a solid blow, then it feels like an earned victory, but I think like 75% of pro fighters would see that opponent having a seizure like this as not a victory just merely a win by default. His opponent was honorable. \n\nI like that after the guy went down, he tried to get close and kneel to help. Then, I realized there are people who can help more. So he stopped kneeling, walked back far enough to not get in the way, and kneeled.",
            "True sportsmanship",
            "He was probably also thinking he caused some sort of damage to him, like brain trauma or something, and was feeling guilt on top of his concern. Must have been tough seeing that.",
            "definitely looks like a seizure",
            "What is TCL",
            "I fucking KNEW It. Not buying their TVs anymore.",
            "55-82? Did they have rematches",
            "Even soccer players get micro concussions from heading the ball",
            "[I don’t feel the least bit bad about it.](https://youtu.be/WO2q1iQX2UA?si=V_dvh7tuSDdnOKya)",
            "😅",
            "Looks like was a seizure caused by dehydration. \n\nhttps://preview.redd.it/ii6ka6m2f38d1.png?width=634&format=png&auto=webp&s=9bf9f43e3abedd7e0b936eead38183bc6f251cd2",
            "Can seizures not be cause through dehydration?  Serious question",
            "That idiot is the doctor, which the fighter posted on his socials, so they’re both idiots? https://www.dailymail.co.uk/sport/boxing/article-13556231/Tramaine-Williams-discharged-hospital-tells-fans-good-boxer-suffered-seizure-midway-TCL-fight-v-Ryan-Allen.html",
            "Fighters have to be within the limit of the weight category and a common tactic to maximise your advantage is to purposely dehydrate yourself down to the limit so you can carry more muscle weight.",
            "and yet it is. It's happened to me several times, and you can feel it coming on",
            "Dude dehydration can seriously fuck you up.",
            "I've had something similar happen from dehydration. Essentially I fainted kind of like a white out or the feeling you get with a headrush. You can't see anything but white so you kind of just stop moving around then you try to fight the head rush part which messes with your stability and then you eventually slowly drop trying to stabilize yourself and pass out. And all of the while nobody watching knows what the fuck is going on in your mind they just kind of see you do something like this.",
            "While this can be due to extreme dehydration (alone) dehydration greatly increases the chances of brain injury especially in sports where impact to the head is frequent.  I'm not claiming the fighter had a concussion but highlighting how dangerously impactful extreme dehydration is especially for fighters.",
            "There's a water weight loss thing, that can help you drop a ton of water weight over a few days, but if you don't hydrate/electrolyte properly after weigh in, it could cause extreme dehydration.",
            "When you sweat and or being dehydrated, you don't just lose water, you lose electrolytes too. Electrolytes that supports muscles functions, nerve functions, and etc.",
            "It sure can. I saw a guy pass out 2/3rds the way through his black belt exam; he had overdosed on re-hydration tablets to compensate for sweating in the heat.\n\nDude still earned his belt; he had the skill, the ability, and - as proven by literally fighting til he dropped - the tenacity.",
            "Docs ain’t shit man I’m telling you that’s the new line. Now. “Just go home your ok come back if you feel worse”",
            "I'm sure it's not JUST dehydration, given the context, but dehydration is no joke.  It will shut you down, and you don't have much say in the matter.",
            "We need Dr. House MD on the case.",
            "Actually had this happen to me once.  Out with mates at a park when suddenly, out of nowhere, I just lay on the ground and could not move my body at all, but was still 100% fully conscious.  It was very surreal feeling... had to time think \"whoa this is bad.  what the fuck I can't move...\" \n\nOne of my friends dragged me into the shade and gave me water, said it was dehydration and sunstroke from being out in the sun.  I had not drunk anything all day.",
            "Yes it can. Dehydration is a mother",
            "Paging u/hirsty19784t",
            "Good bot. What kind of idiot downvotes the bot that keeps Google away from shoehorning its proprietary shit onto the web?",
            "I had one time where I had gotten really sick, I was losing fluids out both ends, which rapidly drained me and sweating took what little I had left. I couldn't move ANYTHING, I could barely move a finger, much less roll over and get up. I drifted in and out of consciousness and I was certain that I was going to die from something preventable while people were in the next room. \n\nFinally on the third day my mom came to check on me, when she called out it took everything I had to groan loud enough for her to hear, so she got me soup and nursed me back to health. That shit was terrifying.",
            "Those gloves make immediate first help really difficult. Best to just stay out of the way.",
            "He’s also required to go to his corner, or else he defaults the fight. Not saying that’s what he was thinking in order to win, but I’m sure several people were telling him to go back to a corner and he simply complied.",
            "Yeah the way he brings his hands to his face at the end makes me think he was getting overwhelmed with guilt at that point",
            "They were an American girl group popular in the 90s",
            "a Chinese electronics brand.",
            "Television brand, used to be lower end but they’ve been making advances and have some of the higher rated sets now, at least among the consumer level tv’s.\n\nHope this helps!",
            "Which happens during the weigh-in, 24-48h before the event. Can your body really shutdown from dehydration 24h-48h after you've re-hydrated?",
            "That whole process needs to be changed. ",
            "Bro go drink water instead of being on reddit",
            "Didn't you feel something like thirstyness until you had that situation?",
            "Dehydrated to make weight??",
            "wow. What do you feel when it's coming? I wish you could find a way to not experience this anymore though, reading you've experienced it several times is concerning. Your kidneys are losing market value! (jk)",
            "Facts. I think he realized that. then was like fuck got to get out of the way.",
            "Rip Lisa left eye Lopez",
            "Go go Jason Waterfalls.",
            "All right. Then you guys do us proud. Cos I don’t want no scrubs",
            "was that not TLC?",
            "What type of advances?",
            "Yes. Dehydration causes reduction in brain volume that leads to neurological issues, reduced blood volume so your blood pressure drops and your muscles and organs don’t receive enough oxygen, kidney failure which leads to a whole host of toxins remaining in your system, and severe electrolyte imbalance. You can go into shock or a coma within 24 hours of being severely dehydrated, especially if you’re exerting yourself and sweating like a boxer would.",
            "Or just go visit r/hydrohomies to quench your thirst.",
            "I've been drinking so much water this week because of this heat dome.",
            "Sometimes you just get distracted or you're busy... Or in my case a really shit boss\nBut yes does happen",
            "As someone who has fainted before you definitely feel it coming on for sure, but like someone said either your busy/distracted, or most often you think it'll pass. Like having a tummy ache or something you assume it'll just pass like always.",
            "You literally feel like your body is powering down, you get complete body weakness, numbness, lightheaded, unable to speak, then your body shuts down and you fall unconscious temporarily if the person can be woke back up they can be administered fluids normally, but if not intravenous fluids work as well then the person is monitored for a time and often released from whatever medical facility they were taken to after being told to rest and keep hydrated",
            "The nerve cells work with this sort of switch using sodium. Where basically one side of the cell has sodium, and the other doesn't. It uses water to shuttle the sodium molecules back and forth to sort of act like a switch for on and off. As you're dehydrated the water on both sides is slowly reducing, to the point where there isn't enough water but it's working hard to transport water around to keep it evenly distributed... Until it can't. In which case, your literally entire primary movement nervous pathway can not I/O the switches any more and you kind of just shut off. \n\nIt's generally really brief as your body rapidly starts pulling in more water from the blood to turn you back on.",
            "Where does Kylie Minogue get her kebabs?\n\nJason's Donner Van",
            "It’s Sherbert Day",
            "No one says “creep creep” unless they’re referencing TLC!",
            "Well for starters they were one of the early early manufacturers to include Roku and ChromeOS on their sets instead of proprietary software like Samsung and LG, among others. They did this while still being a very low budget brand, which led to wide adoption of their sets among the elderly or not tech savvy, a lot of entry level easy to use stuff.\n\nI think once their sales skyrocketed, they really put all their digital eggs into the technology behind the tv panels, like local dimming vs edge lighting and refresh rates-\n\nIn fact, in 2021 they REALLY were one of the first to include VRR (variable refresh rates) on their mid-level sets which is needed for PS5/xbox whatever. The newest gen consoles. \n\nYeah your higher end Sony and Sammy sets had it, but TCL included the technology that rated just as good (or better!) than the much higher priced big brands.\n\nAnd, when it comes down to it, if you can get a tv that’s around 80% as good as a Samsung, but costs at least 50% less, why wouldn’t you? So many online reviewers are recommended them, because why pay $2500 for a Samsung TV with comparable quality to a TCL set that will cost you under $900?",
            "lmao broo what the hell, that sub is so weird.\n\nI love it!!",
            "I'm straight up telling this to a friend who had exactly this twice in the past few months and blamed it solely on standing up for too long. It might be a factor but as a friend I know she does not drink enough water. I didn't make the connection and will tell her about this. Thanks a lot!",
            "Electrolyte imbalance. The same thing happens when you drink *too much* water.",
            "Nothing weird about staying hydrated homie.",
            "No problem, other factors can affect this as well such as anemia and low iron in the blood, or working in hot conditions for too long, good things to keep in mind incase your friend ends up having to go to the er, knowing these factors will make treating her more accurate and help her get back on the road to recovery soon, or even possibly take preventative measures to avoid the er all together",
            "Unless its for like 35 hours straight, if you pass out from standing, then you should also probably go to the hospital",
            "If you lock your knees while standing for an extended period of time, even a healthy person can pass out."
        ]
    },
    "Sometimes helmets can't protect you, drive slowl be careful": {
        "title": "Sometimes helmets can't protect you, drive slowl be careful",
        "score": 473,
        "url": "https://v.redd.it/oct1zcjmh38d1",
        "content": "",
        "num_comments": 70,
        "comments": [
            "Dayum is that brains",
            "Am I looking at brain",
            "I was like wow that's not a legit helmet. It's supposed to use that foam like in football helmets that hardens into like a brick to protect under the plastic that is usually double flexible to allow for impact aborbson..... oh that's a lot of brain matter 😳",
            "This is also why to make sure your helmet is certified by the right authorities",
            "I hope he's ok",
            "I prefer not to drive bikes when it's raining outside",
            "Is he ok?",
            "Cheapy helmet",
            "Is that brain matter?🤮",
            "If the rider is alive, helmet saved his life.",
            "That will be one of those cheap Chinese helmets",
            "Never ride a bike. It feels safer than it actually is. ",
            "how it it happen, is the rider alive ?",
            "The quality of the helmet really matters too. Definitely not a place to skimp.",
            "Is the dude alright?",
            "Eww ffs",
            "Drive to the conditions, the weather was making the road conditions as highly dangerous so would require driving at far less than the speed limit.",
            "This is why I don’t drive a motorcycle. At least with a car I can get a airbag and a cage of metal around me that’s designed to help me survive a crash. A motorcycle is just a helmet and some leather padding away from a 55mph collision with a driver who doesn’t know what a motorcycle is.",
            "Do you require another license to drive slowl? Or can you do it with your regular license",
            "Shouldn't it be gray?",
            "Looks like it.",
            "Yes, unfortunately.",
            "Most probably",
            "3 things to keep in mind\n\n1. never compromise on the price and quality of a helmet. the cheaper the helmet the higher the chances of finding your actual brains on the road\n2. never drive light bikes. the lighter the bike, the more unstable it is and the easier it is to make it go flying. your bike should atleast be a royal enfield in terms of weight\n3. do not ride bikes in the rainy season (EDIT: i mean when it rains heavily outside or is extremely stormy)",
            "People who go cheap on helmets don't have extra brain matter to give.",
            "Oh yeah, it's just a minor scratch, he doesn't even feel any pain.",
            "![gif](giphy|Tim0q7zolF3fa)",
            "He’s fiiine.",
            "he survived, paramedics arrived, scooped the brain matter in the pavement. it took awhile but he recovered and wrote a book about this ordeal. he now lives in his farm, looking at the sunset along with his family.",
            "I prefer not to ride bikes.",
            "That license plate tells me that this is in Kerala in India. It’s how a majority of people get around. Roads too narrow for cars, and it rains most of the year out there so people got to get to school/work somehow. \n\nKerala’s notoriously bad for road safety though. Lots of winding hilly terrain up north, really fast and unsafe bus drivers, badly paved and narrow roads, constant rains is a recipe for disaster",
            "His brains are all in the road but other than that he's just fine. Drools a bit.",
            "That was my first thought... \n\nThe DOT course I did to get my license gave out 40% off coupons for helmets at the dealership who sponsored it so we could get Shoei's or Arai's. They also told us the DOT rating didn't mean shit, buy the most expensive one you can.",
            "Common misconception. It's similar to crumple zones on cars. You'd want your helmet to essentially crumple to absorb impact. Anything else and your brain gets rattled in its tiny hard shell.",
            "Sir... That pink stuff is his brain.",
            "The pink stuff on the ground are probably bits of brain.",
            "Nope, fresh brains looks like pink porridge. It’s surprisingly like Blancmange with veins. \n\nPreserved brains are grey.",
            "Wouldn't I want a higher chance of finding my brains? I don't want to be looking for that shit",
            "Why not rainy season?",
            ">never compromise on the price and quality of a helmet. the cheaper the helmet the higher the chances of finding your actual brains on the road\n\nJust wanted to say that from my own research, more expensive does not necessarily mean safer. I've read  tests where they performed various impact tests under lab conditions on a slew of helmets, and actually some of the affordable ones did just as well or better than the expensive name brand ones. It's because they all meet the same stricter certifications, like the European ones. Spending beyond that, you pay for features and comfort, not more safety. Now, I'd still recommend an Arai or Shoei, the features and comfort are worth it. \n\nAlso, remember that different helmets (different brands/models) fit different head shapes, and you should get a helmet that fits your shape head comfortably. The best helmet is one you don't hate wearing.",
            "Facts. You want good quality your willing to spend the money. If I really want something good I save for it instead of settling for cheap versions. When it comes to road safety you gotta be a special kind of stupid to think cheap instead of safe. Great points ✨️",
            "I used to have a Bell Helmet shirt that said \"If you have a $10 head, wear a $10 helmet\"",
            "Sad but too true",
            "I feel this. My mums ex partners 28 year old son died in a motorbike crash 3 months ago in England, left a wife and a 6 month old baby boy behind :(",
            "\"Ride\" sounds like gay",
            "Yes but a tin foil hat would crumple a bit too well and wouldn’t inspire you with confidence would it? It has to crumple enough to absorb as much impact force as possible while keeping the head-shaped hole in the middle intact and mostly stable. That helmet looked like hard plastic and polystyrene inside but whatever it was it didn’t work.",
            "Nope. Looks like foam from the helmet. If that was his brain, they wouldn't even be able to pull out his head from the helmet.",
            "Would they pair with fava beans and chianti?",
            "Found the serial killer",
            "because when roads are wet, it is hard to say where you ll slip and where you wont. The concrete sections are generally safe but side roads and old roads get slippery and you can easily end up dead",
            "I remember that campaign. Bell Star1. They were £49.99 at the time, and I had to save for months to get one.",
            "Very mature sir",
            "Looked this up on google. Happened last 2018. Apparently they fell from the road above this one. Both dead.\n\nEdit: Source: https://www.instagram.com/reel/C7-zUPLp_M1/\n\nGoogle Translated caption:\n08/06/2018 Two young men died after an unborn vehicle hit and fell from a bike on Kanchikode National Highway. Saiprasad (27), relative and neighbor Maya Anugra Vish (28) died at the Kanchikode Railway Station Road Water Tank Junction. The accident took place in front of FCRI at the well stop of the National Highway Service Road at ten pm on Saturday. Both of them were returning home after seeing their friend in Pudussery. Both of them fell from the overpass to the service road below after colliding with an unknown vehicle behind the bike. Kasaba police informed that since it rained, clarity regarding the accident needs to be provided and CCTV footage is being checked for this.",
            "Then why would the foam in the helmet be white, though..?",
            "Underrated comment",
            "Former neuroscientist but I understand that there may be an overlap between that and serial killer. \n\nFth fth fth.",
            "If you knew anything about statistics, you would know that it's exceedingly rare for rain to cause crashes. Very very rare. Because riders generally are very cautious when it's raining.",
            "Thanks for the background. Rear-ended and knocked over the side sounds like? Likely that no helmet could have saved them then, but it still looks like it failed badly. Looks more cracked than crumpled.",
            "Blood or it could be anything really. For the brain to get sliced up like that you'd see more skull fragments.\n\nEdit: And more blood on the exposed part of the helmet.",
            "You’re mixing up survivorship bias vs the actual risk.",
            "since you know the statistics better than me, why dont you share the numbers doofus",
            "The pink stuff in the road is brains and the puddle/pile of blood in the gutter is other stuff necessary to keep someone alive.",
            "Stop it.\n\nIt’s clearly brain matter. I’m not sure what kind of denial you are in but this is an unfortunate situation that happens often.",
            "No",
            "[Bam!](https://www.forbes.com/advisor/legal/motorcycle-accident-statistics/)\n\nRain is dangerous. People ride cautiously or avoid riding. Hence, rain rarely means motorcycle crashes.\n\nTake that, you overly confident doofus-calling poofus",
            "You sure said it!",
            "Ridiculously powerful comeback. How will OP recover?",
            "I sure did",
            "Bold move Cotton Lee's see how it plays out"
        ]
    },
    "Guy tries to touch telephone pole with rod.": {
        "title": "Guy tries to touch telephone pole with rod.",
        "score": 673,
        "url": "https://v.redd.it/eifblfaaf18d1",
        "content": "\n\n",
        "num_comments": 65,
        "comments": [
            "It's a lineman doing lineman things.",
            "That pole ain't got nothing to do with telephones",
            "This is an employee of the electric company closing a popped switch. Obviously there is a short circuit somewhere along the line that pulled too much amperage and blew the transformer. Happens all the time.",
            "I think he succeeded",
            "Not a telephone pole. Lol",
            "Maybe a lineman can chime in, but I this has something to do with having too much load on the distribution side. \n\nThis is dangerous shit. Stuff like this is the reason my electrician apprenticeship was only three years and I said \"fuck this!\" We did commercial hot work all the time, and I watched a journeyman blow a hole in his hand with 277 by grabbing a bx he thought was dead. I watched another journeyman burn his face off in a 480 panel because he was adjusting wires, and one got caught on a threaded screw coming through the back of the panel.\n\nThe last straw for me was working in a drop ceiling, and a hot stranded wire fell out of a red wire nut and hit an ac duct, and copper splattered on my face and burned into my glasses. I peaced out after that.\n\nEDIT: Gee, thanks for the enlightening comments about working unsafe. Also, it shows you know nothing about the industry. There are plenty of reasons you can't just shut everything down. You can't just shut down the lighting in a 24hr plant to change out light fixtures. That's just one example, so get off your stupid soap box. I was simply discussing my experience and expressing how dangerous it can be.\n\nAnd to the Europeans that made it illegal, that's great, but this is in the US.",
            "So what happed to the guy?",
            "OP pulling stuff out of his ass",
            "What do you mean \"try\"?",
            "Was the oil in the transformer supposed to blow?\nI recently learned those things are submerged in oil.",
            "Looks like he connected the wrong call.",
            "lol, “guy tries to touch telephone pole”",
            "That ain’t no telephone pole",
            "This is kinda normal. Something’s broke down the line.",
            "You and I have different meanings to tries.",
            "yea, telephone pole, with big as transformers on it.",
            "That's why they use a big plastic pole in case something like this happens.",
            "Looks like he succeeded",
            "Yeah not a telephone line 🤦🏽‍♂️",
            "Unless the worker was part feline, is say he was still in the same spot when that fire came a raining down.",
            "Anyone know if he survived this?",
            "Im no sparky but I think he succeeded",
            "Terrifying? Only for stupid people",
            "They call it a telegraph/telephone poles, but it's not the phone line you need to worry about. Can we as a civilisation change their name to FAFO Poles?",
            "Nah, he touched it.",
            "/r/playstupidgames",
            "Yep.. that pole let’s them put fuse back in line by transformer from the ground",
            "That pole is no more.",
            "Yeah, I work in telecom, and the vaaaaaaast majority of poles out there are power poles.  It's very common for the power poles to also have telecom lines on them, but they're still power poles.",
            "Huh. Like it’s ok?",
            "Still how could you not be about to shit yourself doing this haha.",
            "I know accidents happen but it seems like no one from your company taught you how to work safely with hot wires. However, they do call us sparky for a reason.",
            "What did you end up doing if you don’t mind me asking? I’m an apprentice electrician now",
            "Sounds like you worked for an extremely unsafe outfit.  \n\nBlew a hole in his hand on 277? Leather gloves are sufficient for that.\n\nWorking 480 live?  What branch circuit was so important downstream and wasn't an induction load, which could trip, fail to run, or burn up on loss of a phase that it couldn't be turned off? \n\nThose switches should be fused to protect that transformer from this.  I see the adjacent one is not fused either.\n\nThat blowout at the transformer indicates a short circuit.  In my opinion, appears the transformer or how it was wired up caused this.  I lean toward issue in the transformer due to the extremely fast pressure failure of the can and the oil on fire.",
            "It's illegal in Australia to work live or 'hot' as you yanks call it. No company or time constraints are worth your life.",
            "They didn’t get shocked, but hopefully they gtfo before being doused in burning oil from the transformer.",
            "I was going to say that that was more than an electricity pop.  There was fuel in them lines.",
            "The oil is meant for heat dissipation and insulation, it is *very* flammable considering what it's in but they're around basically everywhere and only blow up occasionally soooo.....",
            "Probably, if he was following safety rules and wearing PPE",
            "Pretty sure they wear crazy protective suits, and a guy is there ready to move him as a fail safe, but if your suit fails, and that happens you’re pretty much a crispy critter after that.",
            "Well, he will have to replace the transformer.",
            "[deleted]",
            "No the transformer died\n\n\nThe lineman is ok... Probably",
            "They definitely are.",
            "Why do you thinkntuey get paid so well lol",
            "Not the one you asked but rather than switch the whole job try to get one where you work with dead wires, like pulling cable. And even then, dont be a dumbass and check the wires youre working with for voltage",
            "Yea I just meant like was it supposed to blow when they threw the switch or was that an accident",
            "The insulated pole generally creates enough distance between the lineman and the switch for 40cal suits.  The worker was likely in 2cal long sleeve button up AF rated shirt or hoodie, leather gloves, safety glasses, cotton jeans or whatever pant, and leather work boots.  The 2 man setup you described is likely.  The catastrophic transformer failure would not have played into the ppe determination.  I hope they were light on their toes that day.  Due to the high incident energy on local distribution lines like this, lineman use distance as their best mitigation to arc flash.",
            "Idk why I read this as, \"if you're fur suit fails.\"\nLol",
            "And his pants",
            "and himself.",
            "ya' no say daddy me Snow me I go blame  \nA licky boom boom down",
            "I see. It seems very risky. I suppose they do it all the time, and it’s usually fine. Just not this time.",
            "I think you mean, \"don't be a dumb-ass, check the wires you're working with for voltage\".\n\nUnless of some reason you think its dumb to check wires for voltage.",
            "Yes that's how they remove the oil from the transformer. Standard procedure. Same as how mechanics remove oil from cars.",
            "lol 😆",
            "And my axe",
            "Wtf lol",
            " 'Tective man a say, say daddy me Snow me stab someone down the lane  \nA licky boom boom down",
            "Was.... that God's language?",
            "And my ass",
            "You need to surrender your posting license and submit to a remedial 8-hour 90s reference retraining course. Your posting licensure is hereby suspended until such time.",
            "So, bigger dem are they think dem have more power\nDe pon di phone me say dat one hour",
            "It's a song.....Informer by Snow",
            "I believe you, friend."
        ]
    },
    "student pilot enters a spin as a trainings": {
        "title": "student pilot enters a spin as a trainings",
        "score": 352,
        "url": "https://v.redd.it/xpip61gqzy7d1",
        "content": "",
        "num_comments": 25,
        "comments": [
            "Somebody had to figure this out. Geez. How Many times did that take.",
            "Hands on the dash was an incredibly good way to teach the importance of rudder to the student.  Bravo.  CFI kept a good calm demeanor and instructed the entire time.  Quality video and experience (from a major airline captain and CFI)",
            "What would be the equivalent of this in other vehicles? Car, Boat, ??",
            "Fucking Hell indeed.",
            "I would simply shit my pants.",
            "![gif](giphy|7wk6RQYXDDytXalsL4)",
            "*It's PARE.*",
            "my sympathetic autonomic nervous system is activated just by watching this. Absolutely crazy how cool, calm and collected they are!! Mad respect.",
            "this reminded me, I have a video of me doing a spin somewhere. for the life of me i cant find it.",
            "This also works in warthunder!\n\nTo my fellow wt players, use it... It works.",
            "It looks like, if they're spinning to the left as in the video, the right pedal should be pushed, which pushes the rudder tail to the right. This will make the aircraft want to yaw to the right, which should try cancel the effects of the spin.",
            "This was my favourite part of learning to fly.",
            "me: I want to be a pilot\n\nme (now): I want to be an accountant",
            "Im not ever riding w a student!!!",
            "At least 3 according to my calculations",
            "What does that do? Pushes the plane's direction internally?",
            "Spin training was the most fun part of flight school.",
            "This reminds me of taking a young driver to a big, empty, ice-slicked parking lot on a cold night, and having them repeatedly throw the car into a skid so they learn how to come out of it.",
            "Skidding out on ice and steering INTO the skid. Everyone tries to steer out.",
            "I'd assume in a car cutting the breaks for the driver but leaving them fully intact for the teacher - teach them how to properly go for the emergency break.",
            "As long as you hold the dash too.",
            "So many acronyms, but once committed to memory, it is just another checklist.\n\nPower\nAilerons\nRudder\nElevator",
            "The trainer put them in a spin to train the student lol",
            "r/TechincallyTheTruth",
            "That aligns the plane longitudinal axis with the airflow axis, ending enough of the dissymetry so that both wings can do there job, instead of one being shadowed while the order still peoduces lift."
        ]
    }
}