{
    "Weekly Questions Thread Jun 17, 2024": {
        "title": "Weekly Questions Thread Jun 17, 2024",
        "score": 5,
        "url": "https://www.reddit.com/r/Terraria/comments/1dhvcom/weekly_questions_thread_jun_17_2024/",
        "content": "Welcome to the Weekly Questions Thread! Feel free to ask questions such as help with the game, build advice, issues with the game, or whatever Terraria related questions you have. If you are able to help out your fellow Terrarians, feel free to lend your assistance! Please remember to include any relevant information when asking your questions.\n\nRemember to check the sidebar for general links! Additional game information available in the [wiki](https://terraria.wiki.gg/wiki/Terraria_Wiki).",
        "num_comments": 74,
        "comments": [
            "Hello, for the farm on this video:\n\nhttps://www.youtube.com/watch?v=ai7VL_5KqJc\n\nAre those measures internal? Meaning is not counting the blocks on the outside? So 101 from top to bottom counting the bricks i use?\n\nDoes it even matter if i do it a bit bigger?",
            "https://preview.redd.it/rur9dwd2ee7d1.jpeg?width=1280&format=pjpg&auto=webp&s=b8d4b950bbd665a0eb33f3026f2a550e61d48a60\n\nMy minimap isn’t showing up and the toggle in the menu is set to On but it’s dulled out, how do I fix this?",
            "why is this not a snow biome? it has more than 300 snow blocks so im confused.  \n[https://imgur.com/a/hnxQWM7](https://imgur.com/a/hnxQWM7)",
            "Why undead miners are not spawning? They spawned 2-3 times when I was digging first tunnel and now none. Skeletons are spawning but not the miners. I have killed like 850 bats now..\n\nhttps://preview.redd.it/e6z2gyx7387d1.jpeg?width=1920&format=pjpg&auto=webp&s=0a6357f3511fe55da9c258d73b62a0adaa4bd79c",
            "So this is minor suggestion, but I thought of it because I'm currently doing an underground build. We currently have the planked wall which is wooden slats over stone, it'd be cool to have a couple of variations of the planked wall with wood over say dirt, or sandstone, etc.",
            "can anyone either help me  cleanse or tell me how to find this last 1% of hallow in my world, i just want it all gone",
            "Ayo, I want to post something and am not sure if here is appropriate, or if I should in r/TerrariaMemes. The post in question is that I found a random Empress of Light sound effect inside an unrelated netflix show, and want to know where to post.",
            "I'm trying to make a texture pack that changes what Moon Lord looks like, but I can't find what the ID is for its body and arms. I tried looking on the wiki, but the closest thing I could find is the ID for core. Does anyone know or know where I could find out?",
            "Is the worm scarf worth it post Mech bosses? I read that it applies after buffs and defense, so now that im starting to stack both and have \"high\" defense numbers im wondering if i should change it.\n\nIm playing melee and while i avoid damage as much as i can in boss fights, i do get hit quite often.",
            "How do I open the equip menu in the mobile(phone) version? I have armor and extras equipped but I bought a vanity item from a traveling merchant that I want to wear over them. I have forgotten how to open it before and It may have changed. I can double tap to equip the vanity item but It takes away a non-vanity item because it's not placed in a vanity slot. How do I open the menu that shows me what I have equipped and my empty slots?",
            "Hi I'm new to the game how can i make hornets and man eater spawn less i went to a cave and there are endless amount of them",
            "Hello! Is there anything new about fishing on hardmode? Any new stuff from the Angler? I got pretty much all good stuff pre hm, so any reason to keep fishing besides getting the fish for potions?",
            "https://preview.redd.it/yc9gjy8k957d1.png?width=351&format=png&auto=webp&s=a55b9f67f367f38cbebe6e732ee188631963bf0c\n\nIm trying to get better at building, how do I get these small lines between the bricks",
            "https://preview.redd.it/8q1sigo2y77d1.png?width=1920&format=png&auto=webp&s=db28e45047bffc00592d938273097253a053efa5\n\ntrying to get all banners and no worms spawn, is it because I need more blocks down or is it something else?",
            "DOES THE MECHANIC RESPAWN BEFORE BEING SAVED PLEASE SOMEONE HELP ME",
            "https://preview.redd.it/lepnfluf3l7d1.png?width=3024&format=png&auto=webp&s=4968f2d9d789fe6ebad19374192872f6f6b356d0\n\nHow is it missing a wall?!",
            "I'm trying to spawn the lunar cultist,, the medallion thing has spawned but none of the cultists are there for me to get rid off. Is my game glitched?",
            "I've killed skeletron about 15 times but I still cant get skeletron Jr (pet). I am in master mode pre hardmode. How do I get it? It's supposed to be 25% to get it",
            "Does anyone know if enemies spawn where there is no walls? or i really need to place safe walls to block em?",
            "can anyone explain to me this joke pls ? [https://www.reddit.com/r/Terraria/comments/1djk5wo/comment/l9b8zmp/?utm\\_source=share&utm\\_medium=web3x&utm\\_name=web3xcss&utm\\_term=1&utm\\_content=share\\_button](https://www.reddit.com/r/Terraria/comments/1djk5wo/comment/l9b8zmp/?utm_source=share&utm_medium=web3x&utm_name=web3xcss&utm_term=1&utm_content=share_button)\n\nwhat is a supreme minion ? what is the meaning of the picture ?",
            "I cant beat destroyer or any mecha bosses,any advices or tips?\n\nI use Onyx Blaster and Mythril armor (range)",
            "Half of my items despawned including starfury after fighting skeletron and lost, is there a way of getting them back?",
            "is there any adventure time mods?",
            "Hello, I am quite new to the game, and I’ve been wondering about if there is still a chance for a corruption/crimson block to randomly spawn anywhere in the world. I know it was a thing, but I’m not sure if the recent updates have kept that in. \n\nI’ve completely quarantined the crimson in my world, yet I wonder if some random crimson block would spawn outside the borders and create a new problem. Is this still a thing now or have the updates changed something about it?",
            "https://preview.redd.it/m4vh5097nr7d1.png?width=1920&format=png&auto=webp&s=1d024db61484001bda299ee575bbf92dcfdd1ce5\n\nwhy isnt this artificial dungeon biome spawning monsters? the walls are cursed brick and its underground as well.",
            "I'm trying to do the mechanical bosses on Expert mode, I've already taken down the Twins but I can barely do a fifth of the Destroyer's health before getting killed. Is there any specific weapons I should use for it to make it a bit easier? Right now I'm using a Onyx Blaster with Cursed bullets",
            "how much water for an optimal fishing spot (300 vs 1001)?",
            "Is there any way to make the game not paused when I go to settings section while in a single player world? Every time I go to settings it pauses the whole game which is frustrating as this was a part of autopause, but I guess it got removed?",
            "The game doesn't launch at all for me; tried uninstalling and verifying game files and nothing worked. However, I eventually found a folder called \"Logs\" which seems to be logging the launch issues I've been encountering. This is one from earlier today: \n\n6/21/2024 2:54:28 PM: First-Chance Exception\n\nThread: 1 \\[Main Thread\\]\n\nCulture: en-US\n\nException: System.IO.FileNotFoundException: Could not load file or assembly 'Microsoft.Xna.Framework.Game, Version=4.0.0.0, Culture=neutral, PublicKeyToken=842cf8be1de50553' or one of its dependencies. The system cannot find the file specified.\n\nFile name: 'Microsoft.Xna.Framework.Game, Version=4.0.0.0, Culture=neutral, PublicKeyToken=(redacted bc I don't know if that's like a doxxable thing)'\n\n   at Terraria.Program.RunGame()\n\n   at Terraria.Program.LaunchGame(String\\[\\] args, Boolean monoArgs)\n\nAny ideas how to resolve this issue?",
            "Any updates on crossplay? around when will it be coming ?",
            "I'm new to the game; is it considered kinda \"cheating\" taking a player that has top gear and using it to play in a new world instead of creating another player and starting all over again? Sorry if the question is kinda stupid, I'm not familiar with the mechanic of having worlds and players divided",
            "New player here, sometimes when I relog an equipped pet will just not show up. No matter what I do it just stays gone. It's really annoying and lame. Any way to fix this?",
            "Is there a mod for tmodloader to stop people from bringing items from other accounts or like make their characters server sided? I was hoping this would work with just local hosting and not those dedicated server hosting services. Thanks",
            "Does anyone knows the name of the mod that gives you extra accessory slots but specific ones ?  \nLike one which can only hold baloons, another for boots, wings, scarf, etc.",
            "make an update where the cam is improved. and there are slides in a background which you can slide on. like that rockslide from deltarune.  oh btw like moving camera that like, wobbles to the players movement.",
            "I believe the measurements are internal. However it would make no difference if you made it larger since the purpose of the perimeter is to limit all available spawns to a single platform. A larger space would almost certainly land outside any possible spawning area, which would be a little safer but take more time.",
            "Check your controls, you probably pressed something to either hide the map or lower its transparency.",
            "It's 1,500 for for the switch. Same for desert.",
            "Undead Miners can be quite rare, but I believe they share the same spawning conditions as Skeletons. I'd make Battle Potions if you haven't already. If it helps you in your grinding, you can Shimmer the Mining armor set to switch between them, in case you end up with dupes.",
            "Alternatively, you could place layers of Wooden Platforms on top of any wall you'd like and actuate them. The color would darken, but it might achieve the effect you're looking for.",
            "In the Extra section  [Extra IDs - Official Terraria Wiki](https://terraria.wiki.gg/wiki/Extra_IDs)",
            "I mean if you find it helpful, of course you can still use it, but there is probably a better equipment piece which could replace the worm scarf as you are post mechs. But I can bet that using the worm scarf won't ruin the playthrough for you even if its post mechs lol",
            "Calming + stealth potion.",
            "Try a calming potion to reduce spawn rates or use a summon to take care of them for you",
            "There are no new fish, but Lava fishing is completely reworked. You can do it with any fishing rod now, you just need lava-proof bait. It can now yield Hell furniture, Shadow Chest loot, and even a Lava Charm. Also, you can get a generic Bobber accessory from the Angler, which can be stacked with the Angler Earring and be combined with any Glowing Moss for a brightened bobber.",
            "crate loot.\n\nin my corruption world, I'm always happy when I fish up heartreach potions, as the fish needed to craft it is a crimson world only thing.\n\nI also find when I do a lot of fishing for crates that I almost never need to craft an obsidian skin potion, since those show up in crates fairly often.",
            "Stone Accent Slab. Made in the Graveyard with a Heavy Workbench",
            "Finally figured it out, there wasn't much grass so I put much more. There's a ton more spawning now.",
            "yes the mechanic respawns dw",
            "Nvm I figured it out. The bottom walls were naturally generated, so it didn’t count.",
            "I think you're just experiencing a horrible case of RNG hell.",
            "Update: enemies also spawn where there is no walls.",
            "\"Supreme Helper Minion!\" is the achievement for doing 200 total fishing quests.  So that person's done about 800.",
            "Get good accessories and make a big arena. Also use wings or a triple jump as these help a lot. Buffs too.",
            "If they despawned, no, and if you got a memory loss the answer is probably still no.",
            "No matter what you do pre-hardmode, the V spawned by hardmode will contain that evil so it will cause it to spread then so you can never truly contain it until then",
            "Random blocks used to occur when you destroyed an altar, but that functionality was removed and doesn't happen anymore.",
            "Ignore if you bought the game.\n\nIf you pirated the game, what patch are you playing?",
            "In order for the game to recognize the player to be in a Dungeon, they need to be standing in front of Cursed Dungeon Walls underground and be close to at least 250 Dungeon Bricks.\nWhen in a Dungeon, enemies can only spawn on Dungeon Bricks that have any type of wall directly above it, even types that are not exclusive to the Dungeon such as natural cave walls.",
            "What's your arena look like?",
            "[https://youtu.be/2K8ARCf2EiA?si=7BlnGTZasFSze6Zp](https://youtu.be/2K8ARCf2EiA?si=7BlnGTZasFSze6Zp)",
            ">Lakes with fewer than 300 tiles (200 for honey) incur a Fishing Power penalty\n\n[https://terraria.wiki.gg/wiki/Fishing#Requirements](https://terraria.wiki.gg/wiki/Fishing#Requirements)\n\nYou need at least 1,000 tiles of Water at the edge of the map for an Ocean biome to exist.\n\n[https://terraria.wiki.gg/wiki/Biomes#Biome\\_existence\\_requirements](https://terraria.wiki.gg/wiki/Biomes#Biome_existence_requirements)\n\nUnless you're looking for ocean fish, 300 water tiles is enough (going over 300 tiles is ok).",
            "Install Microsoft XNA Framework. There is an installer that comes with Terraria. In the installation directory, run the `xnafx40_redist.msi` file.",
            "After 1.4.5",
            "Well it kinda ruins progression if you bring a character with the best gear into a new world. If you're looking for the sandbox experience look no further then Tmod loader. Though theres no one stopping you from bring you character with top gear into a new world.",
            "oh wait sorry this is an idea not a question sorry",
            "I feel that shimmer will be useful. Unfortunatelly this world was created before shimmer biome was added. Luckly I can craft the shimmer bucket.",
            "It definitely would for the empty tunnels, and I have been using a lot of actuated blocks, it's just unfortunate that I can't place anything there once I've put the platforms down.",
            "Thx",
            "Thank you. So its the crate loot that changes, not exactly new fishes for potions or new rewards from the angler?",
            "A few rows of platforms, each around 150 blocks long\n\nThere's campfires and heart lanterns there too, and a Bast Statue in the middle",
            "but if you want then pls reply",
            "[https://terraria.wiki.gg/wiki/Fishing#When\\_to\\_stop\\_fishing](https://terraria.wiki.gg/wiki/Fishing#When_to_stop_fishing)",
            "Are you using potions?"
        ]
    },
    "Terraria State of the Game - May 2024": {
        "title": "Terraria State of the Game - May 2024",
        "score": 49,
        "url": "https://forums.terraria.org/index.php?threads/terraria-state-of-the-game-may-2024.135770/",
        "content": "",
        "num_comments": 16,
        "comments": [
            "Rats, we're Rats, we're The Rats",
            "From dinosaurs,to bats and no Rats!",
            "Crazy? I was crazy once.",
            "Ummm are you guys going to make mages and Summoner Any better or? Cause i mean we can clearly see that melee and ranger are the most played by far and well the best to pay.. Just wanted to know",
            "RATS",
            "I AM THE GIANT RAT THAT MAKES ALL OF DA RULES",
            "Celebrate another one, a Birthday bash",
            "They locked me in a room.",
            "summoner is getting more whips so that'll probably help a lot\n\n\nMage just needs it's early game buffed, Gem staves are just weaker than their equivalent bows. Otherwise it's fine.",
            "Mage is well balanced as it is, just a little lacking in the very early game (when you aren't necessarily intended to be a single class anyway). Summoner is getting more whips which will be nice too. Consider that the four classes don't need to be equal in terms of skill. Mage is a good stepping off point for intermediate players who have gotten used to playing the easier classes of Melee and Ranger, requiring you to dodge more and play smarter but with the benefit of many healing weapon options, attack variety, and many more homing weapons. Summoner is better suited to multiplayer when other players can take the heat off of you, and gives you the advantage of getting to focus almost entirely on dodging and running at the cost of attacks hurting more.",
            "im the scout rat who scouts and muderders",
            "I'm the annoyed rat because I can't fish I peace for 1 second",
            "Better gern staves have piercing, though.",
            "So do unholy arrows."
        ]
    },
    "I got ripped off, now i'm one dirt block short on building a house because i got this \"\"pet\"\" instead": {
        "title": "I got ripped off, now i'm one dirt block short on building a house because i got this \"\"pet\"\" instead",
        "score": 2952,
        "url": "https://i.redd.it/vcj2lrdklz7d1.png",
        "content": "",
        "num_comments": 59,
        "comments": [
            "A similar thing happened to me as well, all I wanted was to farm essences for hallowed mimics, but everything those stupid elementals dropped was some stupid pink rods",
            "Reminds me of the time I was building an overworld surface mimic farm. A bunch slimes dropped this \"staff\" that did like 2 damage. I threw them in the trash. Smh my head",
            "When you realize the Dirtiest block is just 120% the dirt of a normal dirt block.",
            "🗿",
            "yeah same. looks like ass so I threw it in the trash",
            "Lol. Terraria luck amr?",
            "[removed]",
            "Reminds me of Sip’s dirt Factory from the yogscast, like dirt guy",
            "Sucks",
            "Give to me and I’ll trade a dirt block for it",
            "I got it during a playtrough with friends and I was super suited and they were like it's just a dirt block",
            "Me unironically on 360 Terraria trying to farm Ankh Shield materials, and getting loads of Hallowed Key Molds.",
            "What a scam. You should ask for a refund.",
            "build a dirt bomb",
            "COOL! 🎉 You found one of the rarest things in the game ",
            "That’s probably the rarest pet in Terraria.\n\nhttps://preview.redd.it/z1abdw9yl28d1.jpeg?width=634&format=pjpg&auto=webp&s=c0d46f5205cb21236fc0d26d5fb5d92a35e7fc7d",
            "How do you get it?",
            "Hate when that happens",
            "its okay i think you can buy dirt later",
            "https://preview.redd.it/sduvcd8hn08d1.jpeg?width=750&format=pjpg&auto=webp&s=e715dad9bd7ef6c676c777d0aa70e977ccc186fd",
            "[removed]",
            "shaking my head my head",
            "you can just buy the slime staff from the princess",
            "why is slime staff good anyway...?",
            "I actually got a slime staff drop and deleted it with that exact logic recently.......",
            "It has reached 120% of its potential",
            "Does no one test things or use the wiki😭",
            "r/lostredditors",
            "i dont think 20% dirtier block is rare",
            "It replaces 1 random dirt block in the world",
            "In a world around 3 dirt blocks are set to drop it, if you dig a lot of dirt eventually you'll stumble across one\n\nAlso it's a property of the block and the drop is not decided upon mining the dirt",
            "Teleporting to where her cursor points",
            "Whoa, don't shake it that much",
            "Combo with an accessory that has a chance to make creatures drop money when damaged.",
            "It's mostly just very rare. If you don't get it early on it isn't very useful",
            "It's a bit of a meme :P\n\nIt's only real use past very early game is when you need something doing lots of ticks of 1 damage, like in a Lucky Coin based farm. \n\nMay also be useful in wacky challenges",
            "If you combine it with the lucky coin each hit can produce money and since it deals low damage each enemy is plenty of chances to get money\n\nSo it makes afk farms generate even more money than before",
            "Must have recently landed a Black Flash",
            "Who's gonna tell him",
            "it’s all a joke, my lord",
            "r/woooosh",
            "https://preview.redd.it/cmgwohpvn28d1.jpeg?width=1920&format=pjpg&auto=webp&s=189069feededab3703756fe09916d7084a06e4da\n\nMISSED JOKE DETECTED: DEPLOYING r/woooosh",
            "A Few actually, but there’s like… 3 in small worlds",
            "Lucky Coin my beloved",
            "r/Jujutsufolk much?",
            "I’m not",
            "I don't get the joke, can you enlighten me?\n\n(I've played yakuza 3 and don't get how it's relevant)",
            "I don't get it either can someone explain",
            "It's a shitpost comment on a shitpost, pretty much. \n\n(I don't know either I just said woooosh to look cool)*",
            "https://preview.redd.it/mcwb9tjhr08d1.jpeg?width=1920&format=pjpg&auto=webp&s=f7a3e425f815e2ecca905dbd768221de75e5a753",
            "https://preview.redd.it/yx6n6ljyt08d1.jpeg?width=1920&format=pjpg&auto=webp&s=c023b69b2644b5b31681809c53468d36ce093baa",
            "Oh that makes so much sense now, thank you!",
            "This image is scarying me pls stop. 😰",
            "https://preview.redd.it/it1jwawbv08d1.png?width=406&format=pjpg&auto=webp&s=3d747761383825a8d1536b21d261f940ae13a66e",
            "https://preview.redd.it/sb5g0n1lx08d1.jpeg?width=1170&format=pjpg&auto=webp&s=f82b72a18526ee42616bff88df9daea358d9a73e",
            "https://preview.redd.it/b4ty4ykpx08d1.jpeg?width=1039&format=pjpg&auto=webp&s=f7dda22dc650901a2eae6ed2f368f84757f93469",
            "https://preview.redd.it/opuwsr3g228d1.jpeg?width=928&format=pjpg&auto=webp&s=dfae97ff2133b7247290d01f2e820cc6d2b96b05"
        ]
    },
    "The Vortex armor.": {
        "title": "The Vortex armor.",
        "score": 500,
        "url": "https://i.redd.it/bzfmg4kp318d1.png",
        "content": "Artwork by me.",
        "num_comments": 38,
        "comments": [
            "Autoturret summon goes hard",
            "War machine armor goes hard",
            "Honestly kinda reminds me of V1 ULTRAKILL.",
            "MACHINE",
            "The legs remind me of Optimus Prime.",
            "IS THAT V1 ULTRAKILL IN TERRARIA??!??????",
            "ultrakill?",
            "he looks like he visits hell to get fresh blood in it",
            "The little detail of the bullet casings being green is really nice.",
            "THIS LOOKS SO AWESOMEEEEEEEEEEEEEEEEEEEEEEEEEE",
            "Imagine if they made more hybrid weapons like whips as they are basically melee weapons that do summon damage. What if there were specific summons that did or could use other damage types? There is already a lot of ranged melee in boomerangs and spears so what about a melee weapon that does magic damage as a mage's backup plan?\n\nAmazing piece, dude! Really got my gears a-going.",
            "He's a man on a mission",
            "that actually looks badass. Keep it up, you’re cooking with the art",
            "Everyone here is like \"ultra kill\" while my brain instantly went to \"Rip and tear until it is done.\"",
            "Goes unspeakably hard",
            "Illustrate my stories! Good stuff. Thanks for sharing.",
            "It's the Gigashark, my concept of the last upgrade of the shark themed guns.",
            "Armor is hard.\n\nExcept for stardust armor. That thing soft as a green slime.",
            "Ngl I thought this was some fanart of like v1 and mindflayer fused",
            "TURN BACK, NOW.",
            "He's part of the influence, yeah. I repeatedly glanced at my Optimus Prime figure while drawing it.",
            "r/ultrakill btw",
            "Thanks.",
            "I'm very sorry, but I already am writing my very own Terraria story.",
            "Great, now you got to do the rest of the class gear. (Pretty please 🥺)",
            "https://preview.redd.it/76252e2qr18d1.png?width=600&format=png&auto=webp&s=ec76483069ca5ba4c6aca83386228044a56448e7\n\nthe pose looks like this",
            "Nah, I personally just don’t like Nebula Armor",
            "THE LAYERS OF THIS PALACE ARE NOT FOR YOUR KIND",
            "Don't be sorry. You're doing a good thing. Best of luck to you, friend.",
            "That sounds like a lot of work, but okay. See you in a decade!",
            "TURN BACK, OR YOU WILL BE CROSSING THE WILL OF \n\n# GOD. #",
            "Your choice is made.",
            "As the righteous hand of the father,",
            "I shall rend you apart",
            "And you will become inanimate, once more.",
            "BEHOLD, THE POWER OF AN ANGEL",
            "YOU DEFY THE LIGHT!"
        ]
    },
    "Day 0/30 - Top comment is added to the guide’s house ": {
        "title": "Day 0/30 - Top comment is added to the guide’s house ",
        "score": 1104,
        "url": "https://i.redd.it/qw9s6kjb7z7d1.jpeg",
        "content": "",
        "num_comments": 111,
        "comments": [
            "https://preview.redd.it/88ofmhjlqz7d1.png?width=800&format=png&auto=webp&s=929c878d03bec012dc47182383f1ae6cce3bdb80\n\nWe must do this. Cherry Blossom biome from Infernum.\n\nEdit: Hi there.\n\nEdit 2: How the hell did this get the top comment?",
            "put thhe cherrpy blossom from infurnuym\n\nhttps://preview.redd.it/ywb1qh2bbz7d1.jpeg?width=1080&format=pjpg&auto=webp&s=95d17818027ef15d004f194674eb5410abdcb1cd",
            "At this point just succumb to the blossom rot make the cherry blossom biome",
            "https://preview.redd.it/w1mobuyzd18d1.png?width=800&format=pjpg&auto=webp&s=a42c77ef4e907d3b7d209b19583110084b81abad",
            "Ebonwood Bathtub painted brown",
            "Terra toilet",
            "Voodoo doll suspended over lava",
            "Moon lord relic, have fun",
            "Any queer flag so the next 30 days are filled with incel cope.",
            "Terra Toilet",
            "Make a Statue of Frank Horrigan, GOD BLESS THE ENCLAVE",
            "It's supposed to be finished in one day guys, you really want to torture him day one with the Cherry Blossom biome?",
            "Medievale tower on the top of the house",
            "A bed",
            "Lava pit",
            "Yo re need to get the devs to add cherry blossoms",
            "Make the guide watch angler torture",
            "The Picasso Guide painting.",
            "#savetf2",
            "Huge statue of guide",
            "Waldo if you find him",
            "Goon cave",
            "A large white i in a blue circle, like an information sign.",
            "Bomb",
            "add a pressure plate outside the doors that is wired to some bombs above his house so that whenever he goes out he immediately dies",
            "Terratoilet",
            "A chamber filled with lava for the angler",
            "Shit blocks in the shape of a shit.",
            "Pyramid farm triangles with the lava on his roof",
            "A hole in the wall",
            "the dungeon spikes as the floor tile",
            "Make it into a tower",
            "Terra toilet",
            "you're gonna regret this one XDD",
            "Penis",
            "Engineer gaming",
            "Ebonwood bathtub painted brown",
            "A bomb",
            "Moon lord trophy",
            "Mannequins dressed like Monty Python's spanish inquisition",
            "His ex",
            "1 dynamite block on table",
            "Swap guide for angler and put it in hell",
            "Moon Lord",
            "https://preview.redd.it/e5fjl2xd708d1.png?width=1080&format=pjpg&auto=webp&s=a5aeb2a829085acb17d679a7141b78d458197307",
            "&#x200B;\n\nhttps://preview.redd.it/0vdruvj2yz7d1.jpeg?width=574&format=pjpg&auto=webp&s=5423c9225442de73b0e278ada80fd85ad1602a3e",
            "I KNEW IT ! 😂",
            "This shits everywhere bruh",
            "This truly was our blossom garden\n\nhttps://preview.redd.it/zmz8oms9718d1.png?width=1280&format=pjpg&auto=webp&s=b06e015922d9a0412a933951533a644e191e781c",
            "It’s the top comment because that is going to look really sick added to the house. I recommend adding it to the top!",
            "Oh no! How did it get there???",
            "What's the deal with this image I'm out of the loop",
            "can someone please explain this meme i dont get it",
            "https://preview.redd.it/n565ph5slz7d1.jpeg?width=828&format=pjpg&auto=webp&s=a4abd8459e8c80ada4a4360c4d6fbb4398a5f633",
            "Top 3 comments all suggesting the same thing lmao",
            "This is my favorite.",
            "r/ebonwoodbathtubpaintedbrown",
            "Favourite idea so far",
            "I demand it to be a trans or non-binary flag. Raises the most cope imo",
            "get cherry blossomed nerd",
            "Not disagreeing but do you even know what incel means?",
            "The Inclusive Pride flag makes the most sense. It has everything!",
            "Oh hell yeah amazing idea",
            "I'm doing my part by downvoting everyone else to keep this on top.",
            "average amazing vanilla update lol",
            "Would probably be good towards the end but harder to build upon and I want the build to get pretty big",
            "What if Terraria was called Freakaria and instead of the Moon Lord there was the Goon Lord",
            "Do you see angler here?",
            "https://preview.redd.it/db7ddbcjq28d1.jpeg?width=750&format=pjpg&auto=webp&s=c9148d42543d28903597ff3d1a76df60802a0035",
            "Can someone explain pls :3",
            "https://preview.redd.it/3449zuqv208d1.png?width=1080&format=pjpg&auto=webp&s=a671620b561761298459f18950fc05c3a0ecb764",
            "Tf is he doing here",
            "My brother in Christ, if I didn't do this, I would have the entire Calamity subreddit on my ass.",
            "It spawned in a snow biome soooooooo",
            "That's just how it Generates",
            "I cannot express the flashbacks I get from simply glancing at this image.",
            "Just go to r/CalamityMod and you'll find it eventually.",
            "the Blossom Garden from the Infernum addon for Calamity is supposed to spawn in the Underground Jungle, but is capable of spawning **nearly anywhere in the map** due to its spawning habits, leading to some very unfortunate world gen mishaps",
            "4*",
            "r/bathtubpaintedbrown",
            "Suspend the angler too",
            "But not top comment, lmao",
            "Someone downvoted you in the mere 2 mins since you posted, someone is already shitting their pants.",
            "What about both? Makes em even angrier.",
            "mods increase the cope",
            "?",
            "When you open Excel and are typing in a cell.\n\nWhen you are awaiting pretrial hearing in a cell.\n\nWhen you make a sale of your company's product to your own staff you in sell.",
            "Lol, there's always next time. o7",
            "Oh god, they've retaliated!\n\nWe're down by 80.\n\nA little chaos can be healthy for the soul :)",
            "Didn't know what to put lol, figured it'd be funny. What about Kirby our Lord and Savior pink boi instead?",
            "And instead of eyeballs he had tits",
            "HELP I CAN'T SHIT NO MORE",
            "TL;DR: in the Infernum mod, an add-on mod for the popular Calamity mod, there's a piece of terrain generation called Blossom Garden/Sakura Garden, which is currently the hot topic since it's spawn algorithm is a bit wonky (it's been spawning in weird places, like inside the Jungle Temple, in the Underground Tundra biome etc...) so we made it a meme, putting it in weirder and weirder places, like in Ultrakill, Geometry Dash, pre existing memes, tshirts,  etc....",
            "The brainrot is spreading",
            "lmao",
            "You fool, we were on your ass the entire time",
            "I've got one that's even worse.\n\nhttps://preview.redd.it/3a6nuaqz818d1.png?width=700&format=pjpg&auto=webp&s=62ced5cd80fc25879ffe797d0cc0cd6bd55b543f",
            "I wish I played it before knowing what happened. Still haven't played it to this day",
            "Just Monika",
            "Oh, right, I forgot",
            "Haha i lowkey aimed for that. Love to see some small drama.",
            "The infinity gauntlet but ever stone is a different flag",
            "What this guy said.",
            "5 gum: stimulate your ferrets",
            "Yayyyyy.",
            "We never got off",
            "Hold on, I am not a Calamity enjoyer like you guys but can I still get on his ass aswell?",
            "Oh. That one's fine.",
            "Explained it",
            "5 gun: stimulate your neighbors",
            "Not yet"
        ]
    }
}