{
    "Elon Musk: Both Tesla shareholder resolutions are currently passing by wide margins!": {
        "title": "Elon Musk: Both Tesla shareholder resolutions are currently passing by wide margins!",
        "score": 633,
        "url": "https://twitter.com/elonmusk/status/1801084780035154058",
        "content": "",
        "num_comments": 686,
        "comments": [
            "[First and foremost, please read r/TeslaMotors - A New Dawn](https://www.reddit.com/r/teslamotors/comments/1c49sv0/rteslamotors_a_new_dawn/)\n\n\nAs we are not a support sub, please make sure to use the proper resources if you have questions: [Official Tesla Support](https://www.tesla.com/support), [r/TeslaSupport](https://www.reddit.com/r/TeslaSupport/) | [r/TeslaLounge](https://www.reddit.com/r/TeslaLounge/) personal content | [Discord Live Chat](https://discord.gg/tesla) for anything.\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/teslamotors) if you have any questions or concerns.*",
            "Redditors find out  reddit is not real life",
            "But wait? All the comments on reddit indicated it was going to fail ?!?!?\n\nIts as if... the majority of detractors aren't actually shareholders???",
            "Ok now can we stop with the damn posts about it?",
            "Reality just took a giant cosmic dump on the Redditor collective 🤣",
            "[removed]",
            " what a circus show....So, when the goals were set, everyone laughed, then the company sold more model Ys than fucking Toyotas in 2023 under Elon's leadership. Then it went to court like it was lie and everyone was fooled to believe the goals were \"impossible\", but the company would clearly over deliver surpassing all expectations. Whining redditors that owns 0.0000001% of Tesla shares were opening their votes with such annoying virtue signaling tone against \"Elons tweets\". .The result is there, as expected, just a whining minority. 🤣",
            "Turns out shareholders like a return on their investment. Who knew??",
            "Passed",
            "I wonder how many millions were wasted trying to astroturf reddit (and other places).\n\n...and which 'bright minds' thought that it'd work.",
            "Thank god the majority of shareholders aren’t your average redditor. This site is a cesspool of terrible opinions",
            "great news.",
            "lol people with Elon Derangement Syndrome are in shambles.",
            "I voted against Texas because I'd rather it HQ in Nevada. Texas is oil controlled. Nevada is going to benefit from lithium extraction and outside of Reno and Henderson is a libertarian state. Guess who will be more friendly to an EV company?\n\n  \nI'm surprised anti-musk types didnt want the pay package.. If he fails to perform he's out billions. Without it he loses nothing other than time.",
            "Good. Reaffirms that all of the malcontents in this sewer of a subreddit are just the vocal (whining) minority.",
            "thank god.. this was the #1 thing on the horizon that I was worried about regarding the future of Tesla (and therefore my shares). I'm very happy to learn, once again, that reddit is a bizarro world.",
            "BahahahahahahahahahhahahahhahahahahahhahahahahahahahahahahahahahahahahahahahahahahahahahahahahahahahHahHAhhahahahahahahahhahHahahhHHahhHhh....(breathing)... Babababahahhahababababhahhahahahahahahahahahahahhahahahahahahhahahahahahahhahahahahahahhahaha",
            "Any person worthy of respect understands that a deal is a deal. Funny how the vocal minority on reddit can’t comprehend that",
            "Oh man what a treat. Lotta redditors just leaned back and had a mini mental crisis reading this. \n\n“.:. but … but … the hive mind said…!??”",
            "Oh no! Are u bots sad now? :(",
            "Anyone that has actual Tesla shares would not want Elon to leave Tesla.  \n\nRule of Acquisition 69. A deal is A deal",
            "Nice to see that Yahoo Finance poll was way wide of the mark. Turns out half a million 'people' CAN be wrong after all. [https://finance.yahoo.com/news/tesla-shareholders-vote-ceo-elon-musks-pay-package-proposal-171453223.html](https://finance.yahoo.com/news/tesla-shareholders-vote-ceo-elon-musks-pay-package-proposal-171453223.html)",
            "Great news",
            "[deleted]",
            "YES! WOOHOO! Congrats to everyone, justice prevails!",
            "![gif](giphy|mGK1g88HZRa2FlKGbz|downsized)",
            "Victory!",
            "Can't go back on a 6yr old promise that was based on nearly impossible performance numbers. If Elon goes down, Tesla does too. It's an angel stock based on his vision, regardless of how shitty of a person he can be.",
            "There are not many CEO's I would say deserve such massive compensation - but Elon is one of them.  Tesla wouldn't even exist without him.",
            "seee. we love tesla and elon. lets go",
            "[removed]",
            "Capitalism wins 😃",
            "What I love about this is the stock pumped as soon as he tweeted this. The market knows what's good for the stock!",
            "LETS GOOOOO",
            "Good!!! Let's get back to work and those gainz ![gif](emote|free_emotes_pack|money_face)",
            "I joined this sub back in 2017 or so when there were something like 500k subscribers.  It's a much different place here now.  Back then it was pretty much all Tesla bulls and enthusiasts.",
            "[deleted]",
            "Literally shaking right now. ",
            "In 14 years on Reddit, one of my most downvoted comments was on a r/technology thread when this first happened. Someone called it a bonus and I said it’s not a bonus but his pay package. While I’m not a fan of a lot of things Elon has done, I can respect the shit out of Tesla and what he’s done for the company.",
            "They will ignore it like anything else that doesn't fit their narrative.",
            "But Reddit told me only the Stop Oil / glue themselves to asphalt types are buying Teslas, and Elon has been alienating them. Tesla should be bankrupt right now, since apparently, only climate activists buy them.",
            "Space man bad!!! \nDid people on this sub really think it wasn't going to pass? Get real.\n\nThese are the same detractors on this sub btw that are shitting on Tesla products & Cybertruck. I would be shocked if even 10% of these people own any Tesla product.",
            "1000% this. I feel like a lot of these rabid negative posters are either terminally online, or they are bots.",
            "Lmaoooo ikr",
            "This happens *so* often these days lol",
            "People on here really act like this is it tho lol. Like Reddit is all. When in reality it’s somehow a overwhelming group of liberal cucks",
            "Most non leftists have been systematically purged from Reddit.",
            "About god damn time a proper backhanded sanity check was delivered.",
            "People still having an investment in Tesla do not have any relation to real life. All this is saying that the Tesla stock is now mostly held by diehard Elon fans. Which is a pretty good reason for institutional investors to jump ship ASAP. Lack of accountability this proves would mandate them to liquidate their investments or be sued by *their* owners.",
            "Just wait for the election. Reddit is going to lose it's mind.",
            "Reddit is a perfect reflection of the real world!",
            "This is what I’ve been saying. \nThe people who are hating on Musk probably aren’t investors.",
            "Maybe people actually learn from this situation. LOL in my dreams",
            "I got downvoted to shit when I suggested that the real people who put there hard earned in TLSA aren't the negative nancy's in that other thread, half of whom purported to own TLSA shares.",
            "Redditors last year also said Meta and Netflix would crash because only boomers use Facebook and subscription prices are too expensive that everyone will cancel Netflix.\n\nLMAO😂",
            "Yup, most trolls don’t own TSLA.",
            "I voted yes",
            "TIL: broke opinions ≠ shareholder votes.",
            "I would go farther and say the majority of people here don’t even own a Tesla.",
            "I think the comments mostly just said it shouldn't -- not that it wouldn't.\n\nEdit: for the downvoters, here are some recent threads about it on this sub. Please point me to the comments where Redditors insisted it won't pass (you can still downvote me, but maybe do it based on something real that I'm missing):\n\nhttps://www.reddit.com/r/teslamotors/comments/1d9r0xw/tesla_ceo_elon_musk_could_leave_if_56_billion_pay/\n\nhttps://www.reddit.com/r/teslamotors/comments/1cx5sw2/elon_musk_56_billion_pay_slammed_by_shareholder/\n\nhttps://www.reddit.com/r/teslamotors/comments/1csxugp/tesla_billionaire_investor_votes_against/\n\nhttps://www.reddit.com/r/teslamotors/comments/1d95gx3/stop_punishing_shareholders_for_erratic_execution/",
            "Yo can I get all my downvotes in support of this for the past few days flipped? Or how about just [this one](https://www.reddit.com/r/teslamotors/comments/1dcm852/comment/l7z1eri/) for funzies. That’d be greeeeaaaat",
            "It's more like the detractors don't hold the majority of shares, which is highlighted by  Must owning a large plurality.",
            "It won't stop until all of the current court cases about this vote are finished.",
            "It feels like astroturfing but is probably not.",
            "Nah, when they realized they might lose they started posting articles like \"why the fight over Elon Musk’s pay at Tesla won’t end with shareholder vote\". They don't know when to quit.",
            "People don't realize this sub has been taken over by TSLAQ groups. They are pushing their negative narrative and trying to hurt Tesla. Many posts you see here - even upvoted - do not represent reality. This has been confirmed by mods, not just a hunch.",
            "Yup, saw it coming from a million miles away. Anyway hope it's now over and we can go back to talking about cars.",
            "Watching the laughter turn to tears is glorious and I'm happy to be here for it",
            "I posted replies about how it is crucial to uphold the pay package and got down voted repeatedly. So many people just want to whine and aren't actual investors. Their mindset limits them.",
            "How is giving tens of billions of dollars to one person a return on investment?",
            "[deleted]",
            "This is without a doubt the most botted astroturfed censored shithole of a website that has ever existed. Look @ any sub with more than 200k people subscribed and there’s a massive chance the mods are corrupt, half the comments are fake, and any opposing opinions against the minorities narrative gets deleted.",
            "Honestly, they're building a lithium refinery in Texas. \n\nI think there's a case for Texas becoming an \"Energy state\", of sorts, where they shift from oil refining to lithium refining, thanks to Tesla.\n\nNot that I want their HQ in Texas either, but in theory, it's not all bad.  If anything, it might help Tesla set expectations and make changes.\n\nUnlikely, but sometimes you try to be the optimist about things.",
            "Reddit has turned into the vocal minority. It's gone to shit since they got rid of third party apps and showed they don't care about their real users.",
            "1000% this sub is full of insufferable weirdos that make hating Musk their whole personality",
            "Surprised that somehow a social media site that is filled with communists, socialists, porn addicts and internet addicts somehow doesn't represent the general public.  Strange!",
            "It was just a bunch of FUD bots trying to push a narrative. Same thing with mainstream media. Alot of powerful people don't like Elon Musk.",
            "None of them were shareholders anyways.",
            "[removed]",
            "Minority, yes. But not an insignificant number acording to those graphs.",
            "It wasn't just Reddit. The media was pushing an ouster of Elon pretty hard. Anyway as you say, the shareholder votes are what truly mattered.",
            "feeling the same",
            "+1 from me . hahahahahaha omg hahaha",
            "I'm just enjoying the show.\n\nThe people who act as they are paying those 50billions from their own pocket are funny.\n\nBut the people who act like they won because some billionaire got more rich are just... comedy gold LOL.",
            "Helllll yeaaaaaaahhhhhh. Where are all the whiney bois now?!?!",
            "Vocal minorities regardless if they are on Reddit or in real life are always the loudest.",
            "[removed]",
            "Ah yeah, just like he did over the past 5 years with those 1,130% gains",
            "Presumably market doesn't like when CEO is actively sabotaging and threatening his company, so its kinda expected that the end of this drama show is going to do that.",
            "Haven't the stocks been going down for the last 2 years or so?",
            "Now it’s bots and haters that probably shorted it",
            "We were a bunch of enthusiasts waiting for our Model 3. Now millions are produced, **we drive and enjoy our Teslas**, we don't have much time to spend in this sub. EDS have, I imagine them sitting in their multi-led gaming chair, furiously typing hate on their mechanical gamer keyboards.\n\nMillions of people are enjoying their Teslas daily and don't comment here (anymore).",
            "Haha well yeah, Elon has become a drastically different person in the public space during that time.",
            "100% spot on. Vibes here were different pre-2019 when I was day one Model 3 reservation holder.",
            "Tesla and Elon were much different back in 2017",
            "And Reddit decides it’s completely evil and unfair that someone was promised something for achieving a target, achieved the target, and got paid for it.",
            "Username checks out.",
            "[removed]",
            "So odd how /r/technology is basically an anti-Elon sub.",
            "I have unsubed r/technology.  For some reason every there is a luddite.",
            "I was at a major Midwestern hospital today and, in the parking lot, there were many Teslas. I would offer to \"redditors\" (astroturfers and not real people, if we're being honest) that it seems possible that more people than just activists are buying Teslas.",
            "Reddit must have missed when climate crazies literally cut power to the Berlin factory haha. ",
            "Shorts have lost $12billion+ on TSLA.  Wrap your head around that when you see the Tesla hate.",
            "I wanted a flame thrower but the universe thought otherwise.",
            "> Did people on this sub really think it wasn’t going to pass?\n\nBelieve it or not, YES!\n\nIf you understand that Reddit’s business model is selling copium, it will all make sense.",
            "I have a model 3. Am I allowed to shit on Elon now",
            "I like Tesla products and own a few. I don't care for Elon one way or the other. Is this club meant to discuss Tesla the company or defend Elon from online words?",
            "Hey! I bought a Tesla baseball cap...",
            "Same goes to Joe Rogan subreddit. People there don’t listen to podcast, they just express their opinion that they’ve read in some fake article online",
            "Nobody's being purged. However the big subs are not really inclusive spaces for any opinions that deviate from the hive mind. This pushes people away",
            "How could you hate him? He has created generational wealth for thousands of people. Only way you could hate him is if you DIDNT invest",
            "Careful, there's an army of print down vote your comment if you say you voted yes. My down vote was -49 on a post 10 days ago",
            "I figure that since he doesn't spend money on things, it'll end up getting re-invested in his companies.",
            "Me too!  It was very funny reading everyone comments says it would not pass.",
            "I do.  Best vehicle ever.",
            "[removed]",
            "Sorry, Delaware judge said you gotta keep them downvotes. ",
            "Musk abstained from the vote.",
            "You do realize Elon abstained from the vote, right?",
            "Astroturfing is practically vegan compared to what we are seeing.",
            "Yeah it's been a real downer trying to read anything on the subs without an \"Elon bad\" narrative. Good to know that the silent majority of people found it cathartic for this big W. However I imagine this is only the beginning of a very, very long and drawn out engagement.\n\nKeep fighting the good fight lads.",
            "They are on all Tesla and Elon subs. Anything with Elon they are on trying to hurt it.",
            "I swear they just turned the bots off on this sub. So much less noise",
            "[deleted]",
            "It’s chickened. If he provides half a trillion in value, he gets to have a couple billions for it.",
            "Tesla has done *very* well as a company; like all companies that are publicly traded they report to their shareholders, and have a feduciary responsibility to make a profitable return on their investment.",
            "[removed]",
            "[removed]",
            "I'm sorry.\n\nYou're implying we're corrupt how?  That we *want* negative news and shit?\n\nIt's important to try and maintain a balance of views on things and not just instantly ban people for being negative.\n\nPersonally I'm tired of hearing about Elon in the news all the time, but I also think he's a better choice for Tesla, at the moment, than the alternatives.\n\nIf you have issues with the comments you're seeing **then report them**.\n\nWe're volunteers man.  We've got day jobs, families, work/life balances that we're trying to maintain.\n\nBe the change that you want to see.\n\nIf you report shit comments, it goes to the modqueue, and we review them as they come in.\n\nDon't just complain about ineffectual moderators, because we're as effective as you help us to be.  If you're not helping by reporting comments, then we're not going to be as effective as you'd like us to be.",
            "Yea other than california, it's the most populus state I believe, so there's a lot of everything there, including renewables that the R's try not to talk that much about sometimes.",
            "Precisely 0 companies *care* about you. This talk track needs to die.\n\nIt's just hard to make money at an ever increasing rate **and** prioritize user needs at the same time. The money part is non-negotiable for publicly traded companies, but inevitably comes into conflict with the latter.\n\nReddit never cared about you. They went public. The enshittification is well under way.",
            "EDS, Elon derangement syndrome",
            "They also denounced Sandy Munro for supporting Elon Musk company decisions as if they know better than engineering experts when these redditors have only been building lego blocks from their parents basement.",
            "This! 🤣 I have met a couple of Tesla owners and shareholders on the real world, they don't sound like a some sociology undergrad wannabe activist.",
            "Bahahaha!",
            "I do often wonder about this. I'd \\*love\\* to actually know how many of these comments and up/downvotes that I see are psyop/bot related. Seeing the sentiment of the sub (and other subs at various times) turn on a dime is wild.",
            "Yep they aren’t paying for the fud bots anymore now that it’s passed loool",
            "Watching them lose the narrative one site at a time is beautiful. Maybe politics will follow.",
            "Yep.  At some point it became clear that most of the \"I used to be a real fan and bought lots of shares, but then blah blah blah.  I'm voting no,\" posts were from a combination of bots and angry kids.",
            "[removed]",
            "Same as 2018 resolution",
            "Actually, it shows that all the whining is a very insignificant minority. \n\n2018 yes vote 73%. 2024 yes vote 73%. \n\nAll the whining for the last 6 years means it didn't even move the needle. So a very loud yet insignificant minority are the ones posting on Reddit complaining about Elon.",
            "The vast minority",
            "Yall act like you’re the ones getting paid lmao. Some extremely rich guy is about to get extremely richer, it’s not like your favorite sports team won or something 💀",
            "[removed]",
            "[removed]",
            "lol- people somehow forget this",
            "All those gains are from 1 of the past 5 years. The stock has traded sideways for 4 years now.",
            "Reddit is horrible now",
            "They are haters but they still probably long lol",
            "The real people in my life think my model 3 is pretty cool. Redditors hate my fucking guts.",
            "RGB and Gamer stuff isn't just for internet tryhards! you take it back!",
            "I was a big Elon fan back in 2017 and before.",
            "> different person in the public space during that time\n\nFrom what I heard he’s basically the same all this time when outside the public eye.  What difference is seen now is that selectively amplified by mass media.",
            "Elon has never changed.  Your perception of him has, driven by other people.  Don't you see how that could be an issue, because you noe believe things about Elon that are simply false based on what other people claim?",
            "Just an fyi, the accusation was that the board was not acting in the best interest of the shareholders because most of them were installed by and have close ties to Elon. Since the compensation package was extreme compared to most other similiar packages a judge ruled the shareholders themselves should make the decision, not a bias towards Elon board. If the shareholders decide the package was fair that’s all good 👍🏼. \n\nThe judge didn’t say he shouldn’t have this package, just that the people who decided to give him this package weren’t objective enough to make that decision.",
            "Most of it, tbh, was \"elon bad\". Some people even posted that they were literally voting \"no\" because of recent performance of the stock... it's nuts.",
            "Because Elon is actually producing something valuable. Most people here produce nothing of value. \n\nPlus, Elon is rich, so that automatically makes him worse than Hitler according to Reddit.",
            "[removed]",
            "Just like any large enough subreddit it got politicized (and destroyed its main purpose - most posts are not even really technology).",
            "Aww man:/ kids love those!",
            "Yes!!! Because it’s perfectly fine to dislike someone because of their extreme political views or childish behavior on social media, while simultaneously acknowledging the cool things they’ve done. I like rockets and electric cars, and I 100% believe these things wouldn’t be where they are today without Elon, but at the same time I really want him to just STFU!!",
            "The problem is recognizing that people are like packages, you have to take them all in. People are not black or white, bit a shade of grey. And if I have to put the good that Elon has done against his bad, I would say that the good is orders of magnitude more than the bads.",
            "Just make sense and be sufficiently informed.",
            "Most of Reddit is Doreen the dog walker.",
            "You definitely can acknowledge that he has made tons of money while also acknowledging that he has controversial opinions.",
            "I hope he uses it to come up with 100 things and 99 of them fail.  Horribly fail, burn to the ground, with nothing to show for any effort within 3 years.  The stupidest fucking ideas burning cash day and night.  But the 1 thing that does not, is god damn amazing!",
            "Yep me too!  It was super easy to vote my Schwab shares too. First time I ever voted my shares.",
            "[deleted]",
            "Who is \"they\"? \n\nIt makes me completely avoid this sub 90% of the time. I come here to look at and discuss Tesla news, not read Anti Elon Circle Jerk. How can we stop this??",
            "The real question is: why? Apart from bots and paid shills there must be some with such a hate-boner...but what's the point? I can't really wrap my head around the sense in an 'ideology of hate'.",
            "It's actually incredible, like what the hell. The difference is incredible. What else isn't real on Reddit??",
            "I called it a few days ago (check my history if you want :) ).  If both pass, the bots and the TSLAQ bros and the FUDsters would all slink away again.",
            "I'm noticing a bit of that as well at the moment to be honest.",
            "Was that comp plan for the period back then (I'm not super familiar)? At some point it does get priced in after all.",
            "I am not talking specifically about this subreddit, generally the mods here are pretty good (compared to other subs tbqh). I was making a general statement about most other giant subreddits and the website as a whole that I have observed myself.",
            "The balance is long gone, this subreddit is infiltrated with political agendas, bots, and heavily manipulated votes. It’s easy to see that, the question is if mods will make hard decisions to clean this place up.",
            "But the bots are self-evidently everywhere here. No one is pointing fingers at any one mod specifically, but it’s very obvious that there are massive amounts of bad-faith people here who do nothing but shit-talk Tesla and Musk. And if you reply to them trying to be reasonable you get downvoted to hell. It’s like, why even come to this subreddit if you despise Tesla and Musk with every fiber of your being? The answer is you don’t, 99% are either paid to do so or are bots.",
            "Funny enough, I took a sociology class as an elective a few years back, around the time Elon was trying to buy Twitter and most of reddit had harshly turned on him. The topic of Elon came up in class discussion and almost everyone had nothing but good things to say about him and the companies. The class was very stereotypical blue haired progressive and yet were still more in touch than the reddit basement dwellers",
            "Reddit actually accidentally revealed this back in May, 2013. [link](https://web.archive.org/web/20160604042751/http://www.redditblog.com/2013/05/get-ready-for-global-reddit-meetup-day.html) Check out the biggest \"city\" over 100k. The posts you see on this website that do not seem rational - that do not seem like the opinions of real people - are, very likely, the product of propagandists.",
            "Comments like these had -30 or more scores in threads like this over the past few days by this point. It's actually eye opening to see the difference now",
            "🤣😂🤣",
            "That's quite impressive, in some stable democracies, 2/3 of votes, great majority, is needed to change the constitution or even fire a president. 73% on this pay package votting makes the against votes even laughable. Lol",
            "Elon did not vote, add the votes of the largest shareholder to the votes of Yes. I think his brother did the same.",
            "Because some of us feel like we are! I hold a lot of $TSLA shares. Musk leaving, in my estimation, would NOT have been a good thing the long-term potential of the company",
            "And we’re all diluted another 10% 🥳",
            "You should learn about the stock market, especially if you’re young",
            "It's not about getting paid now, it's about getting paid later, and that will happen as Elon continues his long-term leadership and continues to bring unparalleled value to Tesla.\n\nWe are voting for the good of the company even if that means that Elon gets a bigger controlling stake. Don't pretend that it's straight cash that Elon is getting either, he's getting the shareholder voting insurance for a mandate in his future plans for Tesla. This is absolutely a win for Tesla.",
            "Someone doesn’t understand long term investing",
            "Reddit *is* horrible now. \n\nI don't believe that it's mostly actual people.",
            "been horrible since 2019 or so lol",
            "I'm not a hater, I was long but sold it all because Elon has lost his goddamn mind",
            "I literally shed a tear when the first SpaceX rocket landed itself. It’s so sad that he has become (or always was) such a dark ugly person. He could so easily have been an American legend heralded worldwide.",
            "The tone of his tweets has definitely changed compared to a few years ago",
            "You're right, it's alllllll the media. It's not like he bought some kind of platform where you could see all kinds of dimbassery right from the horses mouth or something.",
            "Nonsense it migh be he hasnt changed but his public image has and mainly because he has acted different then before.",
            "No you can clearly see a change looking at just his personal statements. He went from tweeting optimistic stuff about space and electric cars to ones calling people pedos and rants about lgbtq people and other political things. He has definitely radicalized over time.",
            "That's not an accurate summation of the case, or events. Board appointments in any listed company require a shareholder vote. Even back in 2017, Musk only owned 13% of the company. He didn't have legal authority to unilaterally appoint board members. Inasmuch, all board members were voted into their position by majority shareholders. Judge Kathaleen [sic] McCormick believed that the board members were not sufficiently impartial. One of them, for example, was Musk's brother.\n\nIt's a fairly unusual ruling because it's essentially arguing that the shareholders were somehow negligent or incapable of making autonomous decisions. To be very blunt, she effectively called the shareholders morons. Everyone knew Kimbal Musk was Elon Musk's brother when they voted him onto the board. They chose to vote him in anyway. I think it's a dangerous precedent as it opens to the door to nullify all other shareholder decisions on the same \"moron\" basis.",
            "If they bought the shares before the agreement.  If they bought afterwards, then they went in knowing and implicitly agreeing to the deal.",
            "The share holders DID decide it was fair. They literally had to vote on it (I was one of them, and voted for it).\n\nThey knew what they were doing. That’s why it went the same way again.",
            "They are saying the board only gave them one option to vote on, they voted yes. They could have voted no and then a new one would of had to be sent out to vote. It's bullshit to blame the board when the fucking share holders approved it with 73% of the shares.  The fact a judge believed this based on some dumbass who bought like $200 worth of stock is assinine to me.",
            "[removed]",
            "Sir, we don't do nuance anymore. Love or hate, left or right, Drake or Kendrick. Pick a side already.",
            "Almost got a spit take out of me, friend. Nice.",
            "It was very very easy.  Very happy with their service.  Also voted yes.",
            ">but how much of that is the natural toxicity of Reddit leaking into popular subs?\n\nNo, its pure hate. The amount of ban evading accounts we have seen in the last few months is unreal. I have to run the report again but the number is in the hundreds. It is wild the stuff we are seeing.\n\n/u/Nakatomi2010 would you say it's 95% hate toward Elon and Tesla?",
            "Stay tuned. More change is coming again. Along with an update from the mods on what is happening.",
            "To add on to what /u/rcnfive said below\n\n> How can we stop this??\n\nAre you using the report button?  No?  Why not?\n\nPlease use the report button when you see bad actors.  Moderators can't be everywhere, all the time, all at once, we count on our users to bring things to our attention.  Not just in a broad way like you are here, but by using the damned report function.\n\nPlease, report stuff to us.",
            "Is there a browser addon maybe that removes or just distinguishes bot comments? Mark new accounts with one color, low karma with another, stuff like that. If someone only posts about one topic (a company, political stuff, China, Russia) mark that too.",
            "Well, thank you for this. Not used to getting any type prase.\n\nI do agree with you on the comment you made above.\n\nIf you have any feedback let us know.",
            "As /u/rcnfive says, it's being worked on.",
            "Then report the bad actors.\n\nWe cannot be everywhere all the time. \n\nReddit only works properly when users, like you, report the bad actors\n\nReports go straight to a modqueue, and we try to live in those.\n\nWe catch egregious issues, but the small stuff slips by, and we rely on users to use the report function",
            "Seriously, just look at my comments LOL",
            "I dunno the case here but its not 1 man = 1 vote. It's not analogous to democracy at all. A bank isn't a person. The board are major shareholders. \n\nIt's a reflection of majority shareholder interest, not individual. Someone else said it was closer to 50/50 by individual but I don't believe this has relevancy anyways.",
            "I voted for it. But most CEO pay packages are voted for at like >90% rates... but then again most CEO pay packages aren't actually good for shareholders like this one was.",
            "And it’s up over 10% on the day. Who gives a flying fuck?",
            "yep, i feel the same\n\ni'm glad that at least r/spacex kept being good",
            "He *is* an American legend heralded worldwide. Just because he doesn’t buy into far leftist nonsense doesn’t make him any less beloved out where people touch grass.",
            "Musk is the same. The problem is that your channel \"towards Musk\" is more dark.\n\nYou should doubt more everything you see or hear.\n\n100% for sure Musk is a bit crazy - but that was always the case. It's not just now - it's from day one in all his companies. I dont think he is any different.\n\nSecond, I have friends working in Tesla as well SpaceX - it's business as usual better then ever.\n\nFor example Tesla is now like 130.000+ people - you really think you cant find a worker that will not bitch about something?\n\nLong story short, there is huge propaganda wars now vs anything against Musk - and your are good example that this propaganda wars are successful. (or semi-successful).\n\nBtw, I have stocks since 2010-11-12-13-14-17 (Sold good amount, still have bunch). Seen all the shit and drama.",
            "He is the same person. Only thing that has changed is the media. They are pissed because he is replacing legacy media with X.",
            "being attacked constantly will do that to you.",
            "Moreover, either Elon nor Kimble are on the compensation committee and they can’t/didn’t vote on the compensation package with their shares.",
            "Green or purple. Death to those who choose wrong!  (Oops, wrong sub, but it fits here)",
            "When we started doing proactive bans based on participating in toxic subreddits we saw a **massive** uptick in ban evasions, which have died down a bit.\n\nWhat we're seeing now is a big uptick in users who are not regulars to the subreddit, triggering the \"Crowd Control\" feature, which largely trips when the users are new to the subreddits.  We're also seeing the hostility filters being tripped as well.\n\nA **very** large portion of *those* comments tend to be hostile towards Elon/Tesla.\n\nOften times we'll see things where we'll ban someone being hostile, and they'll fire back in modmail with \"I own three Teslas, and shares in the company.  *How dare you ban me!*.  These responses always amuse me because I *literally* don't care what your stake is in Tesla.  If you can't be respectful to other people, then you're banned.\n\nSome subreddits are made to be toxic from the start.  Rule 3 of the moderator code of conduct prevents us from calling them out, and permitting other folks to call them out.  I actually *just* banned someone from another subreddit for calling out a toxic subreddit.  Sucks, because they were probably a good user, but that's a **massive** liability to the subreddit, and it's not permitted.\n\n**Subreddits only turn toxic when the user base accepts that subreddits are toxic.**\n\nAs moderators, I perceive our function to be to ensure good, civil, discussions.  If you're going to be a douchebag to people, pro or anti Tesla, then your ass needs to go.\n\n*However*, we're only as effective as our userbase assists us to be.  We **cannot** be everywhere all at once, nor are we paid to be.  Once a subreddit accepts that subreddits \"just become toxic\", that's when things truly fall apart, because it means that the users are not using the report function that's built into Reddit.\n\n*Depending on the report function you use* things you report *always* hit the modqueue for us to act on.  Some of the options put it into the modqueue *and* send it to reddit proper for review.  *That's* where regular users can cause reddit wide suspensions for hostile users.\n\nBut if you're browsing, and using reddit all day long, and see hostile users and go \"Man, I wish someone would do something about all these assholes\", my man, **that person is you.**\n\nBut yes, the shit we're seeing is pretty wild.\n\n/u/jcfy (Since I'm responding to /u/rcnfive, but he's asking me to chime in to you)",
            "If you want somebody to help prune the anti stuff I'd be happy to help. I'll be increasing my user reports regardless, but am terminally online and would be happy to more actively assist.",
            "Guess I never bothered using it because I assumed it was constantly abused anyways and went into the ether. \n\n  \nRegardless how do you deal with just negative elon circle jerk? Is that really a bannable offense?",
            "Which addon is that?",
            "Now that we have GPT level models open source there is no hope for an extension to detect fake comments unfortunately. That's why they're so rampant. They are undetectable now. And they're using old groomed accounts that have been dormant / taken over for many years.",
            "Yep.  I was diving into the conversation even though it meant getting downvoted precisely so I could observe what happened.",
            "Most trackers suggest a significant drop in the use of  X.     The site is so full of bots and right wing extremists that it’s nearly unusable.   \n\nLegacy media does not need to worry about X.   \n\n\nBack in 2016, Musk was working his ass off to bring Tesla to the masses. Now he’s just another MAGA troll.",
            "The other thing that changed was that Elizabeth Warren and AOC, representatives of a party that he had always supported, suddenly decided to attack him, using his name in photo in ads on Facebook.\n\nI’m not quite sure why they did that, or what they expected him to do afterwards.",
            "Facts. People can’t get it right. So offense about absolutely everything.",
            "That may be an explanation, but not an excuse",
            "Thanks for the inside view from a mod. I didn't know it was that bad. I saved your post to bring it up when someone somewhere else dishes on this sub's mods.",
            "Please send in a modmail saying you would be happy to assist.",
            "The only people we've seen using the report button are the anti-Tesla folks.\n\nHell, this post was reported as \"Targeted harassment\", which is obviously bunk.\n\nIn terms of negative Elon stuff, the aubreddit has a rule to leave Elon at the door.\n\nSo, yes.  Ban.\n\nWe ask that folks wanting to talk about Elon Musk do so at /r/ElonMusk, which is a subreddit dedicated to that.\n\nAnd yes, bans work best.  Once a user is banned, we can leverage Reddit's ban evasion tools, which have been remarkably effective so far.\n\nIt sucks, and I hate it, because bans exclude people from the larger conversation, but if people won't follow the rules, and act hostile towards others, then ban",
            "Which is it?",
            "Reddit leftist copium",
            "I mean they weren’t wrong.   \n\nIf you’re the world’s richest person and not paying taxes, you’re by definition a “freeloader”.",
            "As long as that's *actually* what it's getting used for.\n\nWe also see an issue where the moderators try to open up with the community on the issues we're having, as exampled above, and then the oppositional/toxic subreddits take the post and run off to their subreddits with it, and use it for targeted harassment and such, lol.\n\nIt's pretty obvious to figure out when it happens, because the posts will perform poorly, or we'll start getting pinged by users in the other subreddits and such, and at that point we report those things, because it isn't permitted, and the user accounts will start to be deleted, suspended, etc, etc.\n\nThe post you're saving has actually already been raised in an oppositional/toxic subreddit, and I was pinged to it.  It's *easily* one of the dumbest things to do, because I'll just go report the post as being harassment, which makes the user pick up a black mark on reddit's servers, and then I report the post itself for violating Rule 3 of the Moderator Code of Conduct, which is \"Respect your neighbors\".  Moderators are *not* permitted to allow posts which sully other subreddits, as it essentially becomes community interference and such.  Reddit frowns in that kind of behavior.  Once the report goes in, the moderators will advise the moderators to shape up, or be removed.\n\nIt's actually funny, because it's gotten so bad that some of the toxic/oppositional subreddits have had to pin posts that say \"Hey, look, we get it, you were banned, if you post about being banned, we're going to ban you too\".\n\nPeople are in such a rush to earn their \"I got banned!\" badge, and then brag about it, that they don't realize that they're putting the subreddit that they're bragging in at risk of being shot down.\n\nI *do not* like to ban.  Initially when I became a moderator here I'd spend a fair chunk of time reasoning with folks to have them understand that \"Look, you can't act like that here\", and I used to have pretty good success with it, but over the last year or so, *particularly* after the 3rd party apps were shut down, things just went to shit.\n\nThe toxicity levels started to climb, so we've had to change tactics now and then to try and overcome the issues.  A lot of it is through aggressive banning, but what we were starting to see is that for every person that we'd talk into not being a douchebag, they often had an alt account that they'd use to act like a douchebag with.  In some cases they come back and brag about it.\n\nNow we're starting to see an amusing issue where people we banned *months* ago are all of a sudden concerned with getting unbanned.  Like, they were banned back in April and they're hitting us up today \"Why was I banned?\", which obviously raises *massive* red flags, because if you're a regular user, you're going to ask why you were banned pretty quick.  Near as we can figure, the people we assume to be bots, are not in fact bots, but rather individuals who cycle through various accounts, and then post using those accounts.  So, someone might post as \"Bob2334\" on Mondays, and \"Timmy4501\" on Tuesdays, etc, etc, then they'd circle back a month later to an earlier account.\n\nThe *largest* connection point has **always** been participation in an oppositional/toxic subreddit, which sucks, because those subreddits *do* technically provide value, and I've worked with the moderators in the past to sort out some low level issues, but these days it's just reached a point where I don't feel like those moderators have things under control.  The irony is that I could probably help run those subreddits in a more effective fashion, while still keeping their intents.  There's nothing \"wrong\" with hating a thing, however, there's absolutely something wrong in attacking a thing.\n\nI don't like football, but I'm not out there trying to get people to stop playing football, or going to football stadiums, and trying to get the NFL shut down.  If some people want to like football, good on them, and let them have their fun.\n\nBut that's where the disconnect is. While I'm fine with not liking football and wanting nothing to do with it, while other people go play their football, there's other people who don't like baseball, and they're taking the time to stand in front of the stadiums and spew their hate to people who just want to watch a baseball game, and talk to others about baseball.  They'll stop at *nothing* until the stadiums are empty, and baseball stops being a sport that people play.\n\n*Those* are the people we're having issues with.  The \"I don't like it, so you're not allowed to like it either\" people.  It's the equivalent to having a bunch of Westboro Baptist Church zealots showing up and protesting your barbecue when you're just trying to shoot the shit with your buddies.\n\nAll the moderators of the oppositional/toxic subreddits have to do is clamp down on bad behavior, and all this infighting should stop, and I'd be more than willing to help them with their automods to achieve that objective.\n\nBut, I don't see that happening because people are looking for a place to hate on things, and if you clamp down on bad behavior, then those users will go start/find another subreddit so they can continue there.  We've already seen it happen.  One oppositional/toxic subreddit got slapped by Reddit, and the users started making panicked posts with alternative subreddits that they'd just spun up so they could continue their hate/toxicity.\n\n[The solution, however, is very simple](https://www.youtube.com/watch?v=4d6W2AsinCs)",
            "I misread your statement.\n\nI thought you knew of one.\n\nI personally use the mod toolbox extension, which anyone can use, which lets me see a user's post history and breakdown and such.",
            "maybe they should review the rules they set up for taxation, and go after their donors when they take advantage of the same rules?",
            "Elon paid 11 billion in taxes.",
            "Thanks to AOC and Warren calling him out. He hadn’t paid taxes for years at the point."
        ]
    },
    "2024 Annual Stockholder Meeting - YouTube": {
        "title": "2024 Annual Stockholder Meeting - YouTube",
        "score": 91,
        "url": "https://youtu.be/remZ1KMR_Z4",
        "content": "",
        "num_comments": 91,
        "comments": [
            "\nAs we are not a support sub, please make sure to use the proper resources if you have questions: [Official Tesla Support](https://www.tesla.com/support), [r/TeslaSupport](https://www.reddit.com/r/TeslaSupport/) | [r/TeslaLounge](https://www.reddit.com/r/TeslaLounge/) personal content | [Discord Live Chat](https://discord.gg/tesla) for anything.\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/teslamotors) if you have any questions or concerns.*",
            "TLDW of things I thought were interesting\n\n* at some point Tesla will have remote operators for interventions when robotaxi-ing\n\n* Cybertruck leaves foundation series next quarter\n\n* it at least appears they aren't giving up on the roadster and have some other large commercial vehicle planned (a van?)\n\n* another quarter of FSD transfer",
            "Can they please just ask normal company related questions? Most of these people are.... interesting.",
            "What is this Q&A session even? So cringe",
            "This q&a is straight up terrible",
            "So board terms reduced to 1 year. That is interesting seeing entire board being voted annually.",
            "Any tldr(tldw) ?",
            "Q&A had someone ask about permanent FSD transfer.\n\nElon announced one more quarter of it, no mention of which quarter",
            "[deleted]",
            "Does Elon saying basically “we said version 12 would be fully hands off so we are keeping the version number as 12.x arbitrarily to fulfill that” violate anything?\n\nOther than that I didn’t listen to the whole thing but Elon is in his element here, really wish he would stay out of basically every other topic on earth and stick to being a CEO",
            "Non-Foundation CT next quarter. wow",
            "He's Osborning Tesla.\n\nHe says HW5 in 18 months, so the end of 2025 will be HW5.",
            "1 Hour 8 Minutes\n\nNew products under covers.  Cant wait to see what the \"van looking\" one is...",
            "Brain damage high? ....",
            "Thanks but no, not any more.  I'll just wait for Ryan and his  Ride the Lightning (the Tesla unofficial) podcast to give me the highlights.",
            "Admitting that they'll need remote operators is a pretty big deal. These remote operators are also supposed to connect and direct privately owned Teslas, when their owner has sent them out to make a few bucks. Looking more like Waymo all the time, and I don't see them making any money yet.",
            "I'm curious if it would be possible to have the shareholder proposals be presented in writing in the proxy materials vs trying to convince folks at the last minute during these meetings.",
            "Lol whats the point in a remote operator when you could just have a driver lmao.",
            "[deleted]",
            "One metric I was waiting for was how many miles now driven in FSD. Not a peep on that 🙁",
            "The fact that Elon *clearly* had never before contemplated, “Hmm, what will we do when a robo Tesla gets stuck?” tells you all you need to know re: Robotaxi being available anytime soon.",
            "About that last point. FSD transfer coming back???",
            "I don't think the roadster was there. One was clearly a large van, and the other two have to be the $20k car and the robotaxi. Unless the robotaxi and $20k car are the same external design, then I guess the other one could be the roadster. But I don't think that would make sense, a robotaxi should be SUV sized probably and the $20k car should be tiny.",
            "First time?",
            "didn't listen, but, can't be worse than the guy at the starship reveal several years ago that had just come from burning man, lol",
            "Always is",
            "[deleted]",
            "So painful... It's like Jesus to some of these people.",
            "The fact it ended with [some clearly wacko hermit dude](https://www.youtube.com/live/remZ1KMR_Z4?t=2h23m) explaining to Elon how to be successful with something FSD-related was _the perfect_ 🍒 on top of that shit soufflé of cringe groveling",
            "I have a story about and ideas my 4 year old told me while I was taking a shit yesturday.",
            "Elon got his pay package, they're moving to Texas, we're gonna get another one-time FSD transfer, robotaxis will be able to be remote controlled if they get stuck, HW5 by the end of 2025, and some guy was his six year old to tour the factory, so Elon is going to try to alter their tours to accommodate kids",
            "The person asked for perpetual transfers, and he agreed to a quarter.\n\nI think the beat we can hope for is an occasional \"Transfer when you upgrade\", but it's always a one time deal",
            "I think the intention is for v12 to be the \"end of the line\" for Hardware 3, which is what I've been suspecting.\n\nI've suspected that the push get FSD out of Beta was to fulfill the \"We did it!\" goal of getting FSD there.  I imagine we'll see v13 go to HW4, and that'll be the start of the bifurcation process.  Anyone with v12 will have HW3, anyone with a higher version than 12 will have HW4.\n\nThat's supposition on my part though.",
            "I bet they're nerfed foundations for a bit",
            "HW6 will come out after that. And then HW7. There will always be another new thing coming. Everyone knows a new iPhone will come out every fall, but people still buy them",
            "Not really. I bet 90% of people don’t know what HW version they have.",
            "Yeah hearing HW5 is that close makes me really reconsider purchasing a MY when the refresh comes. Perhaps the timing will lineup with HW5 and it’ll release with that, but if it doesn’t I feel like I’d be crazy to buy it with HW4.",
            "Hopefully a transit/ECV killer.",
            "Remote operators are going to be a thing for a while to be honest.\n\nNot even a concern on my radar.\n\nExpecting the solution to be perfect on release is unrealistic. \n\nYesla is making a car that won't crash, so at minimum, they won't have a robotaxi hit a phone pole on its own",
            "It would be dumb of them not to plan for this initially and aim to decrease manual interventions over time. Chasing the 9 and all...",
            "They are presented in writing…",
            "In addition to what the other guy says, if you have a million cars, you won’t need a million drivers.  You can have maybe 10,000 and keep reducing the number of drivers until you don’t need any.",
            "You can have one remote driver for every X amount of cars (depending on issue rate) versus a real driver is one to one. Eventually the goal would be to almost never use them and it's intended to be a stop gap.",
            "Because, eventually, you won't need the remote driver.\n\nRemote driver is only required if there's an issue the system can't handle.\n\nEventually, those issues will get pruned and solved.",
            "Because you don't have to pay them every ride, they're just there on the off chance you need them?",
            "Yea that was odd.\n\n Even though they could implement this fairly quickly, it was strange to not have actual details of what their plan is.",
            "What do you mean? He said someone will take over remotely, the exact same thing waymo does too. What else did you expect?",
            "My question is what do you do when someone vomits in the backseat after a night out? Who is cleaning the interiors? Do I pay for that if my car is on the network or does Tesla cover that kind of service? \n\nI've never heard them talk about this aspect of their Tesla Network ambitions but it's something that's going to be key to its success, if it ever becomes a reality",
            "This needs to be permanent and not some last minute ditch effort to boost quarterly sales.",
            "That’s what he said. At least for another quarter.",
            "Remember the level 2 super genius?",
            "Seeing people be THIS culty? Yep",
            "I knew he had fans but the way these people talk and hyperventilate is crazy",
            "im a new tesla owner, what is the one-time FSD transfer? is it like if you bought a car previously with FSD you dont have to buy it again?",
            "A guy in the audience literally just shouted \"one more quarter\" and Musk decided to accept",
            "Ugh I hope not but if so it makes a bit of sense. By v13, HW3 should be feature complete. Should be anyhow if the features from 12.5 and 12.6 get released",
            "Cybertruck has HW4 and it doesn’t even work let alone surpass HW3 any time soon after it starts working. Trust me when I tell you waiting to be first on a Tesla product is not something you should strive for. My HW 2.5 without FSD works so much smoother for me on the highway than my FSD car does I rarely drive the FSD car.",
            "I'm think Model Y refresh will align with HW5 release",
            "It’ll be a while before the roads accommodate AI. Then this will no longer be necessary.",
            "On the stream they had folks doing pitches for the proposals. At this point most votes are in so the pitches may be more about getting names etc in the lights.",
            "So they won't be paying attention or doing anything remotely.",
            "Tesla is never going to have self driving they aren't even close.",
            "Right — I have zero doubt Tesla can easily implement such a solution, but it was abundantly obvious Robotaxi isn’t something Elon’s been overly concerned with",
            "You act like this hasn’t already been solved. \n\nIf you puke in an Uber you get charged and then you get your car cleaned with the money. \n\nSame deal here.",
            "A lot of them are on another level but nerves can also do that to you. \n\nI’d be anxious as hell talking to essentially tens of thousands.",
            "At the opening of GF Berlin, there was a guy with a cardboard, life-sized version of Elon. He wanted to take a picture with Elon, the cardboard-Elon and himself.\n\nElon's face was \"This is interesting...\"",
            "If you are the original owner of an FSD enabled vehicle, then you can transfer that to a new car\n\nOnly that time, never again",
            "Correct.\n\nPeople who want a perpetual FSD license are, honestly, out of their damned minds.  If you want a perpetual license, just pay $100 a month.  Based on some statements Elon made, I think they're leaning in that direction anyways.\n\nFSD is going to be a thing that's continually developed, like Windows.  You can't just sell it once and never pay for it again, and continue to reap the benefits of having FSD on your car.\n\nThe *closest* thing Tesla could do is let you have a \"perpetual license\" to a specific version of FSD, in this case I'll say v12, because it's pretty capable.  Then if/when v13 comes out, you'd have to pay an \"upgrade fee\" to get the next version.\n\nAlternatively, you could pay an \"upgrade fee\" to transfer FSD to the next car, and frankly *that's* the option people should be pushing for.\n\nIf FSD was a perpetual license with free transfers, *everyone* would buy it, and it'd likely never get the funding they need for it, because people would buy it the one time, and at that point, why sell it, just bake it into the cost of the car.\n\nUpgrade fees make more sense because it encourages people to stay with FSD, because they'll be more likely to stay with Tesla if it means cheap self-driving.\n\nTesla's got a bunch of early adopters.  As more companies release their self-driving equivalents, they'll be able to undercut Tesla's price because Tesla's price is the one to beat, however, Tesla can encourage people to stay loyal to the brand by letting them upgrade FSD for less than whatever the competitors are selling theirs for.\n\nWhich is, essentially, the same thing Microsoft did with their upgrade versions of Windows",
            "I think v12 is going to be the upper limit of HW3 and v13 is being reserved for HW4.\n\nThis would also explain why Elon keeps telling people to ignore the 12 in v12 and focus on the .3, .4, .5, etc.",
            "RIP HW4 on my 24 M3",
            "I was thinking the same too. It would be a nice double upgrade to wait for.",
            "Sooner than you think. \n\nA lot of Teslas already have FSD on them Supervised as they may be its still AI driving, until a human takes over",
            "Are you implying that all roads will need to be changed in pursuit of autonomy?",
            "Not paying attention all time, only when needed / e.g. the car gets stuck, same way waymo does it.",
            "That's basically how Waymo does it right now",
            "Explain, if you can",
            "Then I guess they'll just be like everyone else",
            "Which is odd considering that he said that you should invest only if you believe in FSD. One would expect salesman to know what he is selling.",
            "Yes but if your car is part of the network like Elon envisions where you can put it on the network for a week or longer, how do you handle that? How are you made aware of the damage and how do you know who to go bill? \n\nWith Uber there is a driver in the car that monitors this and I assume Tesla could use the in cabin camera but the question is still who cleans the car while it's part of the network if, say, I let the car be part of the network while I'm away on holiday for the week?",
            "And after repeated vandalizing, which you may not even notice after it’s been driving around all day, who pays for that? What if someone pukes and the camera doesn’t catch it and the next person doesn’t notice?  Where to Tesla owned robotaxis go to get cleaned and charged?",
            "If you sold a car with FSD enabled would the new owner get to keep that capability?",
            "No, but the roads will also have to adapt. Ultimately, autonomy will work better when all cars are autonomous.",
            "looks like there is a market for valets at superchargers. Inspect, clean, and connect to a supercharger.",
            "Not if you transfer it off the car.\n\nOtherwise, yes."
        ]
    },
    "FSD v12.4.1 improves in quick decision-making (latency) as Chuck Cook tests it on his UPL": {
        "title": "FSD v12.4.1 improves in quick decision-making (latency) as Chuck Cook tests it on his UPL",
        "score": 120,
        "url": "https://www.teslaoracle.com/2024/06/21/chuck-cook-tests-tesla-fsd-v12-4-1-at-his-difficult-unprotected-left-turn-video/",
        "content": "",
        "num_comments": 31,
        "comments": [
            "\n#No shame Sunday on the 30th! \n\nIf you make Tesla/EV products or apps. This is your time to come to the sub and promote yourself. The way this works is you make a post and if it does not show up right away, reach out to modmail and a mod will approve it to make sure it shows up. We will keep automod turned on so the sub doesn't get hit with spam. Please keep in mind that this is only for 6/30/2024. On Monday we will go back to normal. Each post will have a flair as \"No shame Sunday\" for those that want to filter it out.\n\nIf you are a seller or app dev and want a flair next to your username please let us know via modmail.\n\nIf you are a 3rd party app dev and want your link in the top menu of the sub under \"3rd party apps\" please reach out to modmail.\n\n----------\n\nAs we are not a support sub, please make sure to use the proper resources if you have questions: [Official Tesla Support](https://www.tesla.com/support), [r/TeslaSupport](https://www.reddit.com/r/TeslaSupport/) | [r/TeslaLounge](https://www.reddit.com/r/TeslaLounge/) personal content | [Discord Live Chat](https://discord.gg/tesla) for anything.\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/teslamotors) if you have any questions or concerns.*",
            "Why link to a blog post when you can just link to the video directly:\n\nhttps://www.youtube.com/watch?v=PGp2sOxhgWw\n\nAnd shout out to Chuck Cook - u/chazman92 - for being generally awesome.",
            "It will be nice to have a mode where drivers can show how to drive a particular situation and use that data to train the FSD AI.",
            "Can we get an option to not try these kind of turns? I avoid making such turns myself. I’d rather take a couple extra minutes and take the easy right hand turn.",
            "How do you get this version now?    I currently have four strikes and rather not lose FSD for a week.",
            "If UPL is Unprotected Left Turn, what is Protected Left Turn? PL? Why not ULT and PLT?",
            "this is simply cameras & hardware-it's just the beginning fellas!",
            "Appreciate the support.",
            "Some of us (me haha) generally skip videos but will happily read an article/blog post. ",
            "Think it would be preferable to keep that info unknown lest it be subject to abuse.",
            "this is already being done though. FSD is run in shadow mode and when the driver does something different from what FSD would have done, it gets sent and used for review/training.",
            "You really want to trust the public with that amount of power?",
            "That would be a game changer",
            "Doesn’t Waymo also do this? Like didn’t they blacklist certain turns? I remember reading that somewhere.\n\nWhen they go unsupervised, that might end up being what happens who knows.",
            "I call these suicide turns. My one and only accident in 12 years of driving was at one. Now I always just turn right and make a Uturn somewhere safer.",
            "That seems like more legit AI intelligence necessary, that level of problem solving. Rather than building it up to Michael Schumacher levels of competence.",
            "Don’t move to LA lol. So many unprotected crossings, left turns etc.",
            "This how we keep the wannabees out of our club.",
            "Yep. They also can’t just let drivers control the training as some really push it safety wise.",
            "That was briefly claimed a few years ago, turns out it doesn’t actually work that way. Otherwise, every driver would see improvements at every regular disengagement.\n\nWhat they actually do is to see requests to the fleet for certain situations, and collect data back on that. Data is photos and radar images.  They do not actually collect how you drives through it though, that would be a massive amount of data (gigs per vehicle).",
            "Select public with a good score that Tesla already used for FSD beta.",
            "Yup, Waymo avoids highways, complex neighborhoods and left turns in general and will take the long way when at all possible."
        ]
    },
    "Elon Musk Unveils Tesla AI5: 10x Power by 2025": {
        "title": "Elon Musk Unveils Tesla AI5: 10x Power by 2025",
        "score": 266,
        "url": "https://teslacompleteupdate.beehiiv.com/p/ai5-tesla-s-next-supercomputer-is-announced",
        "content": "",
        "num_comments": 205,
        "comments": [
            "\n#No shame Sunday on the 30th! \n\nIf you make Tesla/EV products or apps. This is your time to come to the sub and promote yourself. The way this works is you make a post and if it does not show up right away, reach out to modmail and a mod will approve it to make sure it shows up. We will keep automod turned on so the sub doesn't get hit with spam. Please keep in mind that this is only for 6/30/2024. On Monday we will go back to normal. Each post will have a flair as \"No shame Sunday\" for those that want to filter it out.\n\nIf you are a seller or app dev and want a flair next to your username please let us know via modmail.\n\nIf you are a 3rd party app dev and want your link in the top menu of the sub under \"3rd party apps\" please reach out to modmail.\n\n----------\n\nAs we are not a support sub, please make sure to use the proper resources if you have questions: [Official Tesla Support](https://www.tesla.com/support), [r/TeslaSupport](https://www.reddit.com/r/TeslaSupport/) | [r/TeslaLounge](https://www.reddit.com/r/TeslaLounge/) personal content | [Discord Live Chat](https://discord.gg/tesla) for anything.\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/teslamotors) if you have any questions or concerns.*",
            "How much does compute power matter at this point vs improvements to sensor quality and positioning (ie cameras, I guess)?",
            "I'll believe it when I see it. I'm good on hw3. ",
            "None of the improvements in HW4 are even being used yet - HW4 is just running HW3 in emulation mode.\n\nI'm guessing HW5/AI5 will be running HW4 emulation for a while too, so likely 2026/2027 before its actually being used.\n\nI'm happy with HW3, glad I didnt wait and wait for HW4",
            "I think most people add *at least* 5-10 years whenever anything this immaterial is \"promised\".",
            "The implication of the bifurcation is going to be pretty big. Better sensors input means better output of the model. There will come a time that investing in HW3 will start having deminishing returns and leaving it behind is the only sensible thing to do.\n\nRobotaxi on HW3 and ‘appreciating asset’ is not happening when improvements can only materialize on newer hardware.\n\nAlso a 10x improvement in compute does not translate to the same improvement in model output. Just adding 5x the input pixels from new hardware requires at least that amount of compute to process it let alone do more/better with the input.",
            "Only he didn't say \"10x power\", he did say \"10x capability\".",
            "![gif](giphy|jeXiz1RAvzX44)",
            "Who at this point still believe Elon Musk and his promises?",
            "Always \"training\"... one day it might be a champ!\n\nTill then...",
            "Knowing his false promises it’s more like 2050",
            "By the time it really matters, I would have traded in my Tesla at that point.",
            "So 10x the power by 2030? Just like the cyber truck was supposed to be released in 2021….?",
            "Riiiiiiiiiiiiight!",
            "I just want rain sensors, fused radar and vision with USS.",
            "So speculative",
            "Does this imply Robotaxi's are coming when AI5 (HW5) is ready? I expect there will be some significant regressions to work through before AI5 is on parity with HW3.",
            "Awesome - I can't wait until it eventually arrives in 2030!",
            "Still waiting on that Roadster…. Promised since 2017!?",
            "But can it contemplate the wind?",
            "Right along with robotaxis and level 5 autonomy. He can't deliver shit.",
            "Sounds like the big draw here is that it will be computing while not self driving as well?",
            "Musk admits that current hardware is 10x too little for truly name something \"auto pilot\", or at least until the next hardware version after that again. Or maybe the next after that. ",
            "can someone explain this to me like I'm 5?",
            "???: Tesla will provide full self driving by end of next year (said 2016)",
            "Good news indeed full self driving is still compute limited.",
            "are they going to self consume this ?? or are they going to ship it to customers aswell ??",
            "The more powerful A15 is, the more likely all the millions of HW3 cars's FSD will become a dead end soon.",
            "\"Second half of next year\"  \nI wonder if the new tech will be included in the upcoming Model Y refresh.",
            "This was said at the shareholder meeting. This isn’t new.",
            "When was the last time Tesla hit a date Musk put out? Any more confidence he will hit this one?",
            "HW5 seems like it’ll bring huge changes.\n\nI’m enjoying HW4 on my M3 but I’ll definitely wait for HW5 before I purchase another Tesla.",
            "Should we start a subreddit called \"ElonSays\", like r/ChinaWarns?",
            "Bummer. Hoping we get a announcement on solid state batteries. Hw5 isn't a huge deal imo",
            "Been saying this forever. It's highly likely that all the old hardware won't be able to support FSD when it truly is finished and ready.\n\nAI and hardware are moving to fast, and it's highly unlikely hardware from years ago is going to cut it years into the future.",
            "Osborne says hi.",
            "Just got my new 2024 MYLR in January. I knew I shoulda leased!",
            "Finally catching up to waymo",
            "I guess they might use it for Grok's local inference, naming it \"AI\" clearly indicates the intention. However, this raises another question: Can HW4.0 effectively run Grok?\n\nSince humans can't communicate directly with FSD/AP, introducing a \"captain\" role to mediate between humans and the silent driver could be Grok's purpose.",
            "*drooling*\n\n\nHW5 might convince me to get a new Tesla. Of course, gonna wait and see before I go all in based on one Elon tweet haha, but, as they say, \"big if true\". ",
            "increasing the camera resolution will make the car see things further away. If that's not a problem now then no need to change the resolution. \n\nGetting cameras that are more light sensitive would make night driving better, but is this a problem now? \n\nMy impression is that camera placement, e.g. bumper cameras would matter more for improvement than camera quality. But probably decision making is on the top of that list, since the perception is pretty stable.",
            "Two issues, inclimate weather (especially rain/snow), and real time processing of what the stuff sees. No matter how much compute they throw at it, a single rain drop on the one and only backup camera takes the whole system down.",
            "Higher resolution cameras produce more pixels. More pixels means more data to process. More processing needs more processing power.",
            "You need more compute to process higher sensor quality",
            "If you could control the car yourself using on the cameras available now, but with the reaction speed of a computer, how well could you do?\n\nI think that is the line of thinking currently with Tesla. If a human could do it with those cameras then AI should be able to, eventually.\n\nBetter cameras will matter someday though, as a human with 20/30 vision is going to do better than the same human with 40/20 vision (or whatever current cameras provide).",
            "I'd expect the primary path to achieving unsupervised FSD is mostly one of compute power and not more or better sensing - but hopefully they continue to improve both. :)",
            "Maybe they can start adding thermal cameras and millimeter radar.",
            "One thing that is forgotten is the fact he runs a server of HW3 and soon or if not already HW4 in a server environment to run interference from the NN training vs. Feedback loop from the fleet. They do this to ensure fluidity of updates and take them to their goal of 99.99999999~ safety. \n\nThe car objectively can run fsd today even with HW3, but obviously there is no reason not to improve and add further hardware changes in the next 3-5 years. \n\nSo tldr of sorts is the better the hardware, the faster the training can happen, and the more concurrent patches and updates can happen to take the safety to the next level.",
            "I think it has to do with fast refresh led road signage and weird cases like partially dirt covered signs, spray painted signs, etc.",
            "Arguably the more important aspect about this point is training data. If FSD works 99% of the time, the only useful training data is that 1% of the time, and even then you'll probably need a lot of it for the AI to learn what to do about that 1% of the time. That ratio will continue to get worse as more and more edge cases are solved. Of course, more sensors will provide more vectors for the AI to learn and reduce the training time, so it's still silly not to include those.",
            "Depends on the situation. Starting from a stop (for example a right turn onto a road) against 45MPH/70KPH traffic, you need more resolution than current standard automobile cameras (and radars, and especially lidars) have. 5 seconds at that speed is 100 meters. If you want to detect debris or small objects at similar or higher speeds, you also need to have way more resolution. I’m not a sensor expert, but the cameras probably need bigger sensors and lenses. The radars might scale better, but radar might just be too noisy at ground level to be the main sensor.",
            "I’ll upgrade a generation after,  FSD is unsupervised and requires no user input.",
            "I'm still rocking HW2.5 and don't want hw 3 yet since it doesn't add any meaningful value",
            "Had an intel atom / HW3 car as a loaner and good lord is it awful compared to Ryzen / HW4. So laggy and slow. Crap cameras. ",
            "HW5 will be the first one worth upgrading to",
            "And for those of us who don’t have FSD, HW3 is just running AP2 in emulation mode…",
            "I have a feeling they will skip hw4 entirely. What's even the point in maintaining it?",
            "AI5 running HW3 in emulation mode? 😮",
            "I highly doubt that. The new data center is going to improve training speed exponentially from what it is today opening up the ability to train for multiple native platforms simultaneously.\n\nUpdate after downvote: Really you don’t think so?",
            "Man it sure is cool to be in the year 2022 where everybody is riding their self-driving EVs powered by electricity produced by nuclear fusion stored in graphene batteries and stopping to get clean meat burgers on their way to the space elevator.",
            "New levels of execution were always going to be allowed only on the newer hardware. It doesn’t mean HW3 won’t drive itself.",
            "HW3 is EOL soon.",
            "HW4 is more power hungry than HW3 so it is not backward compatible with earlier cars. If HW5 is more power efficient then they could make a version that could be used in older cars. It would not be a free upgrade though and the cameras would probably not be changed.",
            "Boy who cried wolf has to be right one of these days. Right? Right?",
            "Me. Shit doesn’t happen overnight. Look at all they have accomplished thus far.",
            "His timelines are optimistic.  But in the end, he usually delivers.",
            "I'd rather have a bunch of late promises than whatever the hell the other auto companies have been smoking for the last ten decades.",
            "If you bet on each one of them since 08 you'd be a billionaire. But here you are, doubting.",
            "I just want my FSD to back out for me",
            "From the context I've been reading with Elon interacting with other users, it looks like this will be the main driver of CyberCab's expansion",
            "Means it's extremely far away, and maybe it is. They haven't even started using HW4 yet. It's just emulating HW3.",
            "Many people don’t consider safety rating or safety is not high on priority when considering which vehicle to buy.  Some people will find HW3 FSD safe enough and not willing to pay more.  Some people would prefer to pay more to get a few extra 9s - 99.9999% safe instead of only 99.99%",
            "HW5 on Juniper will turn some heads.",
            "HW4 isn’t even being “used” yet. \n\nCars with HW4 are emulating HW3. HW4 cars should see a nice improvement when they actually start utilizing the hardware to its full ability.",
            "That's just silly. Waymo only works on geofenced areas with ludicrously high-definition maps pre-prepared, and requires a car covered all over in bulky, ugly after-market sensors.\n\nTesla's \"self driving\" (increasingly) works more or less anywhere there's a road, and requires nothing to be added to the car after purchase. \n\nThey're completely different systems with completely different use-cases, and each of them is significantly better than the other in different areas.",
            "Please don't be a sucker like me.  I got fooled TWICE with that \"just around the corner; this hardware update has FSD solved!\" nonsense.\n\nLet me be a warning to you.",
            "On very dark roads, my hw3 car sometimes puts up error messages thinking the camera is blocked. So I think more sensitive would help.",
            "It has difficulty properly reading signs (example speed limits vs highway markers) so resolution seems lacking. Also cameras do not have full 360 binocular coverage yet. Finally most cameras do not clean or heat so are not robust.",
            "I completely agree with this. Cameras currently already\"see\" better at night than humans. The resolution on the newest vehicles is good enough imo. Of course as camera just keep getting better and cheaper there will be no reason not to continuously upgrade them.\n\n\nThe camera placement and quantity, lack of redundancy, and lack of cleaning ability are the biggest issues I currently have with Teslas approach - all easily fixable imo.\n\n I think the front and rear facing cameras are probably fine, as is the rear fender facing camera. Id just say the rear 3 need some way to clean themselves. Also I really don't see the downside of like adding 2 more cameras at the rear corners (either in the taillights or in the rear window or something) as redundancy/emergency usage. For the front 3 cameras, I think they are fine, but as you said front facing camera or two in the grill or in the lights would be good. Or even better would be at the corner (probably bottom would be easiest) of the windshield, because that leads to by far biggest problem with Teslas camera placement.\n\nThe B pillar camera that is supposed to see cross traffic is imo by far the largest issue and it's not even close. I think the  placement further behind the driver's head is just bad. I think there needs to be two cameras at that angle further forward on the car. Those b pillar cameras can still be there for redundancy, but there should absolutely be cameras in the headlights or in the top or ideally bottom corner of the front windshield (in area where wipers cover/clean). This would 100% make me more confident in cross traffic scenarios.\n\nThe last minor and short term issue I have is interior camera. It just isn't a good placement for driver monitoring imo.\n\nOverall Id say if they JUST  added 2 more cameras in the front corners of the vehicle facing like 45 degrees out, id have very little issues.",
            "That’s going to be in 2019, right?",
            "The Infotainment computer has nothing to do with the Autopilot/FSD computer, they are separate. So the UI being slow in the car doesn't reflect anything on FSD performance.",
            "I have an intel HW3 and a Ryzen HW3, and the Ryzen one is so much better, so it really has nothing to do with the AI hardware.",
            "HW3 is also on Ryzen. HW2 is Atom",
            "How do you know",
            "What about HW4 without FSD ? emulating HW3, emulating AP2 ? So it's just emulation within emulation recursively :/",
            "sounds like Inception the movie",
            "Dumb questions:\n\nHow do I know what version of AP my car is using?\n\nIs AP updated often? Ever? I never hear boo about it. \n\nI have however noticed it changes. Recent examples include it being far more cautious about cars in the lanes next to me, and it being far more cautious over a particular bridge with a narrow lane. It started reading speed signs better last year. \n\nSo AP seems to get updated, often even, but I never hear anything about it.",
            "My dude HW5 is not even a material thing yet. His timeline is guaranteed to be completely off.",
            "In the share holder meeting last week, Elon said the data center that they are building on the south side of the TX gigafactory will be for HW4.",
            "Several million vehicles with HW4 compute?",
            "HW4 exists and is in cars. How would they skip it?",
            "Why not skip and go to hw6 which he's also said is in the works?",
            "Remember 2015 when everyone had an hoverboard, and hovering cars are a thing? Weather predictions to the closest second and self-drying jackets.",
            "It might be able to drive itself, but it’s never going to be a robotaxi. Big difference. ",
            "Sure, shit doesn't happen overnight.  Perhaps if Musk would stop saying it (FSD) was going to happen overnight, people wouldn't get upset when it doesn't.",
            "They took away USS, autopilot is worse than Ford Blue Cruise and supercharger network expansion is paused. Wipers still suck.",
            "Roadster 2? 500 mile cybertruck? East to west coast full self driving with no interven? \n\n\nThose are just a few of the things off the top of my head he's failed to deliver on so far. His timelines aren't simply optimistic, they're flat out false",
            "In the end \\*his employees\\* usually deliver.",
            "Unfortunately he is getting worse and worse.",
            "You're sleeping",
            "Reverse, Actually Smart Summon, and Banish still getting worked on, hopefully we get it before the end of summer.",
            "When it come to Robotaxi , there will be a \"safe enough\" level define by law not by what people think. Anything below that threshold will be obsolete so I don't think HW3 has a chance.",
            "I understand that, I was more so referring to the clearer dashcam footage, blind spot, etc? That would all be using proper HW4 correct?",
            "I appreciate the warning! (Not being sarcastic, I sincerely do.)\n\n\nI own a Model Y LR and I've used FSD. It's pretty amazing already. I can only imagine how good it will be with Tesla pushing AI/neural nets top to bottom, improved cameras/on-car compute, and, potentially, bumper cameras.\n\n\nI certainly won't go blast $50k+ into a new car without seeing what this offers, but I admit to being excited by the prospect. FSD has come a long way and I think it will only continue to improve!",
            "Tiny wiper blades on each camera.",
            "I get the same \"blocked\" messages and in years of FSD and Tesla subs. You're the first comment to also mention it.",
            "Mine does this if the sun is low and blinds a camera lol",
            "Same here. It's always, ALWAYS my front left repeater camera. I've had it replaced multiple times by Tesla Service to no effect and they eventually ghosted me on my email chain about it.",
            "Are your headlights working?",
            "It can classify signs incorrectly even with very high resolution. But it the pixels aren't there, then you're screwed.\n\nWill be interesting to see how they do the camera cleaning on the coming dedicated robotaxies. \n\nI'm pretty sure they don't plan on having stereo camera coverage 360. You get \"stereo\" by comparing past frames and knowing the ego car motion.",
            "The car doesn't have the logic to always understand the signs it reads. I highly doubt it's a resolution problem.",
            "Yep! All they have to do is flip a switch, and the entire network will be fully autonomous. \n\nShould be ready by 2017, honestly.",
            "Yeah people aren't understanding this. MCU really has nothing to do with FSD performance, literally only held back because of visualization rendering only at this point.",
            "I have an Intel + HW3. There are Intels with 2.5 & 3, Ryzens with 3 and 4 .",
            "No, HW3 also used Intel for a few years",
            "Yep, also emulating AP2.",
            "If you don’t have FSD then your car is running AP2, either natively on HW2 or via emulation on HW3. Unless you have an early Model S and then you have AP1",
            "It's also called \"AI\" which seems like a gaurantee in todays world for this to be largely hype.",
            "Man. Sure has been a wild ride since we were all living like The Jetsons in 2000.",
            "Yeah, but your car can fart.",
            "Worse than *Blue Cruise*!? From what I’ve seen that system is trash and is arguably actually dangerous to use. Unless they’ve improved it. \n\nSuper Cruise is really the sole good comparison imo, only downside to that one is geofencing. Waymo would be too if you didn’t have to be lucky enough to live in one of the few cities that have them.\n\nAlso, Supercharger expansion is not paused, that rumor has been squashed already.",
            "I'm probably in the minority but as someone with both USS and Vision. I no longer use USS and don't have any problems parking Vision only. However agreed the wiper logic still is awful.",
            "Musk also said the Cybertruck is supposed to have exoskeleton but failed to deliver. Also we’re supposed to be on Mars by now. His moon mission is canceled indefinitely. There is no Robotaxi like he claimed a few years ago. His Boring Company couldn’t deliver a single tunnel for public use. His Hyperloop research couldn’t get past the drawing board.",
            "Did Bill Gates literally code Windows himself? Did Steve Jobs literally assemble the first iPhone?",
            "Wow look at you, being pedantic and all.",
            "Remember that when things bomb.",
            "Do they do that in a vacuum?  No.",
            "In the future, AI will figure it out faster and deliver.",
            "Nope, it was about 2pm in the afternoon when you wrote that. I'm UTC time roughly.",
            "And if 4 nines is good last year, and Tesla achieves 5 nines, government will up the standard to 5 nines only.  the 4 nines needed to be shipped out of the country.",
            "Only the video you see, not the blind spot, parking assist, FSD etc",
            "The camera isn’t actually blocked though, just thinks it is because it can’t see in the dark. ",
            "I'd suggest either water jets using the wiper fluid or a jet of air. Tiny wiper blades would end up being more maintenance and/or something else that can be vandalized.",
            "I get it pretty consistently after dark. I didn't used to with autopilot, but the more recent versions and FSD in the last year or two started producing that message all the time. It makes it unusable due to the annoying warning beep every 30 seconds or so.",
            "I mean it has been a solved problem since 2016, hasn’t it? The people in the videos are just there for legal reasons.",
            "AP1 checking in! Love it.",
            "As long as were are going with bullshit technobabble, I would have called it \"blockchain AI.\"",
            "Probably because the car will also run some kind LLM and other models to interact with the user, not only the driving stack. With 10x the computer power is a big jump for something that not even use all HW4.\n\nThey will need more for TeslaBot anyway, bot will need a modem LLM.",
            "Blue cruise is hands free and can position the car within the lane now (if the car next to you is driving on the line, for example). My autopilot on the other hand slammed the emergency brake while driving over a puddle (cuz TeSlA vIsIOn has no sensors)",
            "Wipers still dry wipe but recently it hasn't failed to wipe in the rain. So half way there.",
            "> His moon mission is canceled indefinitely.\n\nThat was a trip someone paid for and then canceled. Nothing you can do about people deciding against doing something.\n\nSpace X doesn't \"do missions\", they get paid to get people there who do the mission. Now if Space X decided to replace NASA and be the ones to do missions, maybe you could talk about it. But so far they're the taxis for people who do missions.",
            "Lolz",
            "Only if they replace Elon with it",
            "I wonder if it would help if Tesla added IR cameras as a companion to the regular cameras?  They would get used at night when light isn't enough for the regular camera to see anything.",
            "On very dark roads, human eyes also can't see shit. That's why we try to light the roads with some form of lighting usually. Even cats and others who see better in the dark see nothing at all in complete darkness.",
            "Ok what about **really** tiny wiper blades?  /s",
            "Every car manufacturer that uses any logic chip, calls it a computer so it is all fair game.",
            "Blue Cruise was hands-free from the start, albeit it’s great that they’re still updating and making it better.\n\nIirc, base Autopilot is still running old AP2 code, Tesla really should just merge it with FSD’s logic at this point. \n\nPhantom braking was also an issue with radar, and has been fixed in FSD outside of edge cases. Which is another good reason to merge the code.",
            "> can position the car within the lane now (if the car next to you is driving on the line, for example). \n\nFSD has done this for a pretty long time.",
            "Ok and?",
            "This. The goal is supposed to be fsd being better than a human driver, that's the point."
        ]
    },
    "Tesla Cybertruck to Receive Charging Improvements in Upcoming Update | The improvements will allow up to 154 miles to be recovered in 15 minutes, which is approximately a 30% improvement to current charge rates.": {
        "title": "Tesla Cybertruck to Receive Charging Improvements in Upcoming Update | The improvements will allow up to 154 miles to be recovered in 15 minutes, which is approximately a 30% improvement to current charge rates.",
        "score": 401,
        "url": "https://www.notateslaapp.com/news/2086/tesla-cybertruck-to-receive-charging-improvements-in-upcoming-update",
        "content": "",
        "num_comments": 78,
        "comments": [
            "\n#No shame Sunday on the 30th! \n\nIf you make Tesla/EV products or apps. This is your time to come to the sub and promote yourself. The way this works is you make a post and if it does not show up right away, reach out to modmail and a mod will approve it to make sure it shows up. We will keep automod turned on so the sub doesn't get hit with spam. Please keep in mind that this is only for 6/30/2024. On Monday we will go back to normal. Each post will have a flair as \"No shame Sunday\" for those that want to filter it out.\n\nIf you are a seller or app dev and want a flair next to your username please let us know via modmail.\n\nIf you are a 3rd party app dev and want your link in the top menu of the sub under \"3rd party apps\" please reach out to modmail.\n\n----------\n\nAs we are not a support sub, please make sure to use the proper resources if you have questions: [Official Tesla Support](https://www.tesla.com/support), [r/TeslaSupport](https://www.reddit.com/r/TeslaSupport/) | [r/TeslaLounge](https://www.reddit.com/r/TeslaLounge/) personal content | [Discord Live Chat](https://discord.gg/tesla) for anything.\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/teslamotors) if you have any questions or concerns.*",
            "For reference, the Hummer EV which can charge at 350kW has a claimed [100 miles charged in 10 minutes.](https://www.gmc.com/electric/hummer-ev/insider/electric-vehicle-charging) Unsurprisingly GM makes the same claim for the Silverado EV.\n\nThe Cybertruck can't match that peak charging power being mainly limited by V3 Superchargers max output of 250kW but it is perhaps more efficient at converting electricity into roadway miles.",
            "Very curious if the Model Ys with the 4680s as mentioned in the article will see a similar improvement.",
            "Also reduced phantom drain hopefully?",
            "So did they roll the truck off the assembly line with real world battery validation needing to happen, seems like they are almost monitoring and slowly improving charging for this vehicle.",
            "\nH",
            "It often feels like the first owners of new Tesla models are essentially beta testers.\n\nI mean, it's fantastic that they were able to get that type of improvement, but it's a little difficult to understand why they couldn't get that type of thing straightened out prior to the start of production.",
            "So you mean 60 miles lol 😂 fake numbers",
            "It's NEEDS improvements, it way under delivered! 😳",
            "The cybertruck is literally over twice as efficient. It's in the MPGe numbers, or the battery size divided by the range. It's a ridiculous gap.",
            "What chargers are the hummers getting that rate at?",
            "Where can you actually charge a hummer or silverado ev at 350kw? Capability is one thing, but actually doing it is another.",
            "Not at 400v",
            "I noticed that got fixed in the latest update for me. was losing 3% per day, now car can sleep and its only losing 1-2mi per day.",
            "A service center acknowledged that it’s a known firmware issue. No timeline but at least a fix is being worked on.",
            "This seems bad on the model y too. I lost 2% parked for two hours. No sentry or temperature control.",
            "They do this for literally every vehicle in the fleet. There are always new optimizations being found and implemented.",
            "That’s how they’ve done it for every vehicle. Why do you sound surprised?",
            "Well pf cpurse they start conservatove. Otherwise alternatove is to do real time / acc aging which would postpone launch.",
            "As a Hummer EV, sure. The Silverado EV, with the same battery, is much closer (and thus has significantly better range than a Cybertruck.)",
            "Unfortunately I haven’t seen it listed on fuel economy.gov, it would be nice to know what the actual numbers are.",
            "EA has 350kW chargers, usually only one charging stall at a location supports that power level though so you have to get lucky and find it open when you arrive. Otherwise you are stuck at a 150kW stall.",
            "Same, since the most recent firmware about a week ago, I went from almost 5% a day to barely nothing, noting that in both cases was a garage with Sentry Mode off and no need for cabin overheat. It’s at least as good as our S and Y now.",
            "This is a firmware update so it’s a possibility it’s undocumented and in it, someone has to test",
            "That happening once and only over two hours could just be the battery settling from charging/use/temperature.\n\nDoes that happen frequently?",
            "Sounds odd, never have had that happen. I keep mine outside with heat protection activated with AC mode every day to keep the electronics inside the cab not dead.",
            "I just left my Y at the airport for 5 days and barely had any drain at all.",
            "Yep, S/X had it. 3 had it, Y as well. This is literally just how Tesla does it. Release the vehicle in base form. Gather data and do additional testing in the meantime, and roll out changes (charging gains, additional HP, etc.) via OTA later.",
            "Because negativity is required here nowadays.",
            "Im not surprised...I was just kind of stating the obvious in a question format because a lot of Tesla owners or possible future owners may not be aware of these things.",
            "The Silverado EV has a 205kWh battery pack. It has significantly better range than a cybertruck because the battery is nearly twice as large.\n\nThe Silverado posts 450 miles on a 205kWh battery, giving 2.19mi/kWh efficiency.\nThe Cybertruck has a 340 mile range on a 122kWh battery, for 2.78mi/kWh. That makes the cybertruck still 27% more efficient than the Silverado, which isn’t that close.\n\nPut another way, if the cybertruck had the same battery as the Silverado EV, it might get 550-570 miles of range.\n\nThe Silverado is still extremely power inefficient compared to the cybertruck, and considering the shape of the cybertruck for aero, that says a lot about GM’s powertrain inefficiency.",
            "[https://outofspecstudios.com/70-mph-range](https://outofspecstudios.com/70-mph-range)",
            "Almost all of EAs new stations are all 350kW units and they are retrofitting old sites with these new units.",
            "Today at Kennewick Wa, I was getting 155KW at Tesla. Walked over Rivian at EA to chat. He was moving to the Tesla charger since a Bolt was at the EA 350KW spot. 140 from EA, 200 with adapter.",
            "I had something similar happen yesterday. Lost about 3% from standby in the two hours I was in a meeting before going into work. Drove back to work and then when I got done my MY had a +2% from when I arrived to work.",
            "It was a hotter day and I haven’t noticed anything that extreme since then. Someone mentioned the AC has a mold prevention cycle that could have used energy.",
            "For me, it only happens when I *really* need the range....",
            "Happens sporadically with my Model 3.  Like maybe once every month or two I'll get into my car for lunch at work and find 8-10 miles of drain since parking in the morning for unknown reasons.",
            "3 didn’t even have Bluetooth enabled on release!",
            "Another example: I think I remember my 3 not having battery preconditioning for the first few months of ownership. Pretty sure it came as a software update in Fall of 2019.",
            "Not since the shill bots left in defeat after Elon’s pay package passed.",
            "Fair enough. Granted, I'm sure a lot of us had much higher expectations for the 4680 cell from the get-go, given it's Tesla's flagship battery.",
            "Silverado EV weighs just under 9000 lbs, to the Cybertruck's 6800 lbs. All of your math is an unfair comparison without including that context. Cybertruck would not get 550 - 570 miles of range with the same battery, because its weight would go up significantly from the additional cells plus likely structural reinforcement required. Probably it would get similar range to the Silverado EV.\n\nIf you scale Wh/mi by weight, Silverado EV takes about 4% less power per mile per lb. Silverado EV is more aerodyamic with a Cd of 0.331, vs 0.34 (published) or 0.384 (third-party tested) for the Cybertruck. Which roughly accounts for a similar 5%ish reduction in power consumption. So all in all, they probably have similar powertrain efficiency.\n\nEV trucks SHOULD have big, heavy, oversized batteries. Silverado EV can tow a load of several thousand pounds much further than a Cybertruck can before recharging.\n\nNow, casual drivers who don't haul heavy cargo and don't go off-road purchasing a truck at all, is an entirely different problem. Cybertruck having a smaller battery is fine for those drivers, Silverado EV is even more of a waste on them. But I'm talking about people who actually want a truck to do truck things, not just go to the grocery store.",
            "Which is cheaper though",
            "There is not a rage greater than seeing 3 working 150kw chargers available and a goddamn bolt plugged into the 350kw. I’m glad this will be a “back in my day” story.",
            "New stations? The 8 new stations that are actually functional?",
            "[No FM radio, either.](https://www.autoblog.com/2017/09/27/tesla-model-3-no-fm-radio-no-bluetooth-streaming/)",
            "Really? It didn't ship with a keyfob, how did you unlock the doors? Were the keycards mandatory?",
            "It's still not in its final form, they said on battery day it would take years to realize all the efficiencies and only if everything goes right.",
            "> Cybertruck would not get 550 - 570 miles of range with the same battery, because its weight would go up significantly from the additional cells plus likely structural reinforcement required.\n\nI know, and I account for this. If you didn’t account for the added mass, it would be 570 miles. I say “might be 550-570” because of the added mass from the massive battery.\n\n> If you scale Wh/mi by weight\n\nWhy would you? Weight isn’t a good thing. A vehicle that is heavier than it needs to be is poorly engineered.\n\n> EV trucks SHOULD have big, heavy, oversized batteries. Silverado EV can tow a load of several thousand pounds much further than a Cybertruck can before recharging.\n\nThis is actually a fair argument. My only counter would be that I think an oversized battery such as the Silverado’s will make it very difficult if not impossible to profitably produce the vehicle. To be frank, I don’t think we will see the Silverado EV, at least not in its current spec, around for very long or in much volume for exactly this reason.\n\n> Cybertruck having a smaller battery is fine for those drivers\n\nEven then it’s way too big of a battery for those drivers.",
            "Pretty much the same price. \n\nBase Silverado starts at $75k and premium trim is $100k\n\nCybertruck currently starts at $80k and premium trim is $100k. They also claim a $61k starting version next year.",
            "“You think you have it hard!? Back in my day we had to *manually drive* where we wanted to go, and stopped every few hours to charge!”",
            "This scales downwards too.  \n\n3x 100kW chargers and a 1x 50kW charger. \n\nFront of the line do I take the 50kW that just opened or wait for the 100kW?   \n\nI don't miss this kind of bullshit with Superchargers.",
            "It didn't have bluetooth audio. Bluetooth phone key still was being used.",
            "Yes, the phone and app were the only way initially, it got Bluetooth app and keyfob capability later after release",
            "It could seem like it didn’t go right based on Trucks low range and Roadster with 1000km range not materialising",
            "So Silvy is better?",
            "Uphill both ways, too, just wasting watts!",
            "Oh, THAT bluetooth. Makes sense now!",
            "The Cybertruck went from a double stacked battery design to a single stack, so it actually could get the range they originally hoped for, but it seems the volume of cell manufacturing isn't yet available with Tesla and other companies combined for it to make sense to build it with a huge battery. 4680 volume is split between Semi, Cybertruck, Model Y and possibly Robotaxi vehicle and Roadster and possibly all their upcoming vehicles. 1 double stacked Cybertruck battery pack would be enough batteries for 3.5 Model Ys, profit per cell would go way father with Model Y especially with the volume Model Y sells at. I'm surprised then didn't just delay one more year until they hit a proper volume."
        ]
    }
}