{
    "It's Time to STOP THE BOTS #FixTF2 June 3rd! ": {
        "title": "It's Time to STOP THE BOTS #FixTF2 June 3rd! ",
        "score": 13673,
        "url": "https://i.redd.it/apxnfk0ris2d1.png",
        "content": "",
        "num_comments": 1065,
        "comments": [
            "And remember everyone - do not fear bomb! **PUSH!**\n\nWe must all **PUSH!**",
            "THE #FIXTF2 CAMPAIGN IS OFFICIALLY LIVE.\n\nWe've made a shitload of changes from how the original #SaveTF2 iteration went, we hope to cause more of a fuss this time. Let's run it gentz!",
            "Will this be enough to get Valve to act? I’m not sure. However, it is absolutely worth going for and to call them out collectively for neglecting this game.\n\nLet’s do it.",
            "We got this lads 💪",
            "IF THE WEBSITE DOESN'T LOAD!\n\nJust give it a little bit, refresh, or check back later. There is a LOT of traffic right now. There are people behind the scenes doing their best to keep it running as smoothly as possible.\n\nIF YOU HAVEN'T RECEIVED A CONFIRMATION!\n\nAgain, give it some time, it is VERY backed up right now. An email will be sent to you soon, it will just take some time. (Make sure to check your spam folder as well!)\n\nIS THIS WEBSITE SAFE?\n\nI can reassure you that it is secure. This is the legit website put together by many community members over the last week. Your information is secure and no information is collected other than an email and whatever name you want to give us, only if you sign the petition.",
            "DON'T STOP AFTER A TWEET. DON'T STOP AFTER A WEEK. KEEP GOING AT WHAT WE SEEK.",
            "if this doesnt work out, we might as well resort to hunting down the bothosters and stealing their hardware",
            "#FIXTF2",
            "Gentlemen.",
            "Hopefully something happens. I really hope this game doesn’t die as it is so much fun. I mean I haven’t played in a few months because of the crisis.\n\n#FixTF2",
            "Enough is enough brothers",
            "# \\#FIXTF2!!!",
            "#FixTF2",
            "Surprised they didn't mention the CP. Bots using (or used to use I'm not sure) sexually explicit images of children as their sprays in game.\n\nThey aren't just making a video game less fun to play, they're straight up criminals",
            "# Standing near ze point does nussing, get on ze point, Dummkopf!",
            "[save.tf](http://save.tf) doesn't do anything/work at the moment",
            "You've made a whole campaign, but didnt propose any ideas for how to solve this.\n\nYou mentioned the game that they do care about CS2, and that it has cheating issues as well, so you realize it's a very difficult problem and not just their neglect.\n\nWith a campaign like this it's good to list some realistic bullet points, like\n\n* adding Trust Factor to TF2,\n* handing out some Valve servers moderation tools back to the community, let them govern servers like back in community servers days (moderation tools only, not administrative),\n* run a mass-ban swipe on idle bot accounts, cause why not they have a pretty recognizable pattern, then same for aimbots.",
            "LETS FIX TF2!",
            "For those who can't get into the site there's a PDF of it: https://drive.google.com/file/d/1goBP5DVr0we85Ohnc7IHukOtTS-uISEa/view",
            "I'm really impressed with the design and look of the save.tf site. It's clear a lot of care went into the presentation, and it could serve as a good brochure for people unfamiliar with the situation.\n\nWith that said, the writing could use some improvements. Beyond the grammatical errors, there are some key missteps in the approach.\n\nLet's take one example from near the bottom of the page:\n\n> TF2 doesn’t need new content updates, it doesn’t need new microtransactions, it doesn’t need new weapon additions. What TF2 needs is a solution to the bot crisis.\n\nFirst of all, this starts with a run-on sentence. More importantly though, it is simply not a good ask. If I walk into a pawn shop with an expensive piece of jewelry, I don't start off by telling the pawnbroker \"hey I know this watch is valuable, but it's not $10,000 or anything. I'm just looking to make a few grand.\" If you do that, you're already conceding that it's worth less, and choosing to negotiate from an inferior position. Who knows how much it's worth?\n\nSetting an upper limit like this automatically puts a ceiling on the goal. I know it's tempting to say \"Well, Valve didn't care when we did #SaveTF2, so they would just be even more apathetic or annoyed if we raised our demands. If we instead just lower our standards and ask for crumbs, then surely they will have a more open ear!\" Remember though, it's important to not cede ground trying to make it easier on Valve. They have billions of dollars. They can do a lot more than making TF2 simply 'not broken.'\n\nI would rephrase this to read something like:\n\n> Before considering new content updates, all developer attention should be focused on solving the ongoing bot crisis so that TF2 is in a playable state. From there, consistent communication from Valve to address other crucial issues with TF2 would be a necessary next step towards not only a functioning game, but one which is welcoming to new players.\n\nPerhaps in there would be a hyperlink to a list of similar articles describing other issues TF2 has (these are just off the top of my head):\n\n* the competitive matchmaking system is completely dead\n\n* casual matchmaking does not make an effort to put players in servers with similar skill, and most matches end up with 2 or 3 players stomping a server of noobs\n\n* F2P's still cannot use voice commands\n\n* the vast majority of the player count shown on Steam consists of bots (as we all know now per zesty's video https://www.youtube.com/watch?v=2stmQfv93oQ)\n\n* the Replay feature is busted (so I've heard)\n\n* the Training feature has remained unfinished since its conception\n\nHere's another seemingly small but important flaw:\n\n> On June 3rd, we’re all going to collectively group together [...]\n\nWhy *on* June 3rd? This is once again a concession. Say \"Starting on June 3rd\" so there's a contingency for low turnout on that day — maybe it really heats up on June 4th, who knows. Don't lock yourself in on one day regardless — it's not like we go silent a day later.\n\nIt would be nice as well if the site had some embedded videos in each section. Perhaps a very brief demonstration of what it's like for a player who just installed TF2 for the first time and decides to join a casual match, only to met with the titular problem.\n\nIt's exciting to see the community spearhead an effort like this with a go-to website that can be easily linked to anywhere. It's important that the execution is as flawless as possible, and I'd be happy to offer more editing suggestions.",
            "**If not us, Who? If not now, when?**  \nDo not live in the tides of doubt, swirling you around like a turd in the toilet bowl. Rise and act, so you may be seen and your voice be heard.   \nJames 2:15-16, it is not enough to simply \"care\", you must act, or nothing will change. Nihilism is a garbage cope, instead of whining about the pile of crap you are in, grab a shovel and start digging your way out.",
            "I hope they don’t forget to give f2ps their first amendment rights back",
            "Time to crack those bots wide open - YEAH, LET'S PARTY!",
            "There is so much hype for this that the site is effectively DDoSed",
            "Hell yeah irl mvm",
            "Genuine question: What do you expect Valve to do?\n\nValve can't ban the accounts, they just make new ones\n\nValve can't ban the IP, they just use a proxy/VPN\n\nValve can't ban the hardware identifier, they just emulate another one\n\nValve can't make all cheats detected, thats impossible, every game has cheaters\n\nIts not easy to fix this bot problem. Many games suffer from bot problems but they are just more hidden. Every single game you ever played that has a competitive mode has bots boosting players to higher ranks. \n\nSo what is the goal here? Attention from Valve isn't gonna change any of the above. Valve is not stupid, they know the bots exist and how annoying they are, if they could snap them out of existence they would.\n\nThe only long term solution is literally hiring a bunch of people to constantly look for cheaters and manually ban them, which is unreasonable.",
            "Oh boy! It’s getting started. Tbh, if there wasn’t any significant positive change to the game, I honestly have to completely move on from the game. I won’t stop loving the series but I won’t open the game enthusiastically ever again.",
            "We've got nothin' else to lose... but we have potentially everything to gain. So to this... I say, LET US FIGHT! #FixTF2 #SaveTF2",
            "Once more into the breach my brothers and sisters. This time, victory will be ours.",
            "Time to start posting.",
            "Do I have to put in my real name?",
            "Rodger that shork, thank you for posting here.",
            "It's about time someone addresses this issue!",
            "# FIXTF2",
            "FIXTF2!",
            "And this time, we do not stop after one tweet!\n\n#FixTF2",
            "I want my game. WE ALL WANT OUR FUCKING GAME BACK.\n\nWE ARE GETTING OUR GAME BACK NO MATTER WHAT #FIXTF2 !",
            "the fact the placeholder \"name\" section on the petition doesn't say Jane Doe is breaking my heart! It did take like, 3 captchas for me to access the site, though, so I.. guess we've taken the necessary precautions?",
            "The amount of traffic is crazy sight do t work for me lolz it might be a good sign since it shows the amount of ppl who care",
            "A small, curious criticism;  wouldn't it be slightly better to have signatures made by logging in through your Steam account?  It would be slightly less abusable with junk emails, less revealing of personal information to this website, and more valuable from Valve's POV since the signatures are confirmed customers.\n\n\nAnyway I hope this campaign makes a difference, though I find it difficult to believe Valve will lift a finger unless they can get a reliable, trustworthy team of developers willing to work for (nearly) free, even if they're only QA testing code suggestions submitted by the community.\n\n\nInterestingly, you can find many very straightforward solutions to bugs submitted by users on the TF2 GitHub page that have been ignored for years, so there's definitely a community desire to see this game in a better state.",
            "Either we try to fix it for a chance to save it. or do nothing and have it not saved at all.  \nWe can ONLY GAIN from this, 14 years and its still alive, I say we shoot for 15 MINIMUM",
            "I will charge trimp into Valve HQ and dropkick whoever is in charge.",
            "FIXTF2",
            "The gmail thing is really unfortunate, I think it will impact how many signatures can be achieved by quite a lot. I tried to sign yesterday, never got an email. Came back today to try again and still haven't gotten one. It says to use a different provider if you can but you can't really expect most people to make a new email just to sign this petition.\n\nAlso there's still a typo in the FAQ at the bottom. It says \"Cheating and abusive behavior affects more that TF2.\" the 'that' should be 'than'.\n\nEdit: I got my confirmation email finally! you may need to give it like a full day or more.",
            "DON’T GIVE UP!",
            "Soooooooo....\n\nDid anything actually come of this besides making TF2 mostly negative on the Steam store?",
            "Okay the profanity filter is kinda crazy I literally can't put my real name in 💀",
            "Heeeelll YEA",
            "fuck yeah",
            "Let's do this friends, we can do it!\n#FixTF2",
            "So it's the 26th now. \n\nWhats the plan? Were the videos from the community figureheads released? Is there any action to take? Or is it still just a hashtag?",
            "Heavy: Doctor, are you sure this will work?  \nMedic: Hahaha, I have no idea!  \n\\*Awesome fucking saxaphone music plays handcrafted and played by angels\\*",
            "Do not allow yourselves to be placated or distracted until the issue is fixed. Valve has barely allocated any resources to the unplayablilty of the game even while continuing to take people's money from in-game purchases. This has gone on for 5 years. ENOUGH.",
            "If we get rid of the bots, I can actually play with my friends without needing to instruct them to do 50 things in order for us to get a playable game",
            "Heavy: I “HATE” ROBOTS…..",
            "I am all in for this, but I think its not just about fixing the bot crisis but also in general, make valve care for this masterpiece once more!  \n\"TF2 doesn’t need new content updates, it doesn’t need new microtransactions, it doesn’t need new weapon additions. What TF2 needs is a solution to the bot crisis.\"  \nThe bot crisis is one part but once valve fixes the bot crisis there will be another abandonment crisis for the game, I still find absurd the ammount of recognition and monetary gain this game has made for valve earlier years and still to this day and they cant be bothered to do more than just release horrible lootboxes that dont fit the game, no content updates and like left us in a cliffhanger with the comics.  \nI mean dont get me wrong, am all for even the slightest love from valve to tf2, but we are aiming a bit short I feel, we shouldnt just show the bot crisis, but how abandoned the game is in general from valve, weapons that have been broken for years, broken maps and features, there is just so much unused potential and I feel it would be also worth pointing out in the [save.tf](http://save.tf) site.",
            "SCHNELL! RAUS, RAUS!\n\nLet's do this, for TF2! One last stand to show 'em how much we love this game and how unacceptable this is.\n\nWe don't want them to just \"hear us\" this time, we want them to look at us IN THE EYES and tell us they're fixing it. I want nothing less for the game that basically saved my life.",
            "#YOU WILL SIGN YOUR NAME ON THIS PETITION OR I WILL SIGN YOUR NAME ON THIS PETITION",
            "I'm sure a thousand people have said it before me and a thousand more will say it after, but **DO NOT STOP UNTIL IT IS FIXED.**\n\nA statement is not enough this time, keep it going until we get what we want, what we deserve, what is, quite frankly, THE BARE FUCKING MINIMUM of an online game that's still getting updates, still generating money, and still has thousands of people playing daily.",
            "[deleted]",
            "At least we have basically nothing to lose... If we want to take even a shot at this we would need to tug on valve's hair hard enough to actually see any physical change by them.",
            "This is a question from an outsider, why don't y'all do something more aggressive like what the Helldivers did?\n\nReview bomb the shit outta all of Valves other First party games till they're forced to do something?\nLarge chance is, most TF2 players probably own most of Valve's games so they wouldn't be a \"False\" review per say.\n\nCompanies only care if they loose Money, Players need to also vote with their wallet by completely stop buying stuff through Steam for TF2. And if people see a review score drop into the red, they'd be less likely to support other stuff.",
            "Enough is enough is true.",
            "June 3rd will be",
            "time to flood twitter",
            "Let’s #SaveTF2 and #FixTF2",
            "#FixTf2",
            "Thomas Edison once said “I didn't fail 1000 times. The light bulb was an invention with 1000 steps” basically means “Never Give Up”, and so do we!",
            "“PUSH YOU APPLE BLOSSOMS!”\n\n-Mr. Jane Doe",
            "I hate robots. Lets get em lads!",
            "TF2 will be fixed, DON'T GIVE UP",
            "Here we go! #FIXTF2",
            "Remember men, \"IV'E CRAPPED BIGGER LOSSES THAN THAT\" - Rick May",
            "*\"Godspeed you magnificent bastard.\"* - *Soldier (Jane Doe)*",
            "Bomb will not push self, TF2 will not fix self. WE MUST PUUUUUUUUUSH THE CART\n\nEr, hashtag",
            "WE MUST CAPTURE CONTROL OF OUR POINT THAT IS TF2",
            "WE CAN DO IT!",
            "if another my little pony bot out snipes me again im going to freak out",
            "Hope this works",
            "* Stand on the freakin' bot protection button, you Valvorons!",
            "**LEEEEET'S DO IIIIIIIIIIIIT!!!!!!!!!!**",
            "STAND ON THE POINT UNTIL THE POINT IS OURS!!",
            "STAND ON THE POINT, DAMN YOU!\n\nWE MUST STAND ON THE POINT UNTIL THE POINT IS OURS!",
            "Oh damn its on my birthday aswell lol",
            "For anyone who wants to help but doesn't know how here the [petition ](https://save.tf/) TheWhatShow made, after we finish this event TheWhatShow is gonna go to valve and show them all the people who voted, so if you can spare 5 minutes of your day to sign this petition it would be realy helpful",
            "This google doc right here is very important and people need to read it in order to understand how awful the bot crisis has really become: [https://drive.google.com/file/d/1goBP5DVr0we85Ohnc7IHukOtTS-uISEa/view](https://drive.google.com/file/d/1goBP5DVr0we85Ohnc7IHukOtTS-uISEa/view)",
            "I'm honestly surprised you guys think Valve cares enough about TF 2 to do something about it lol",
            "\"If fighting Is sure to result in victory you must FIGHT, sun Tzu said that and he knows a little more about fighting than you do pal\"",
            "i am tired about your movements.",
            "I found the secret #killtf2 server called \"The Ridge Inn\" everyone, we need to spam #fixtf2 on there!",
            "Its chargin' day bois, and as a great man once said; \n\n'If fighting is sure to result in victory than we MUST FIGHT'  \n- Sun Tzu, I think.",
            "PUSH MY BROTHERS.",
            "todays the day",
            "Valve dickriders are the worst subhumans on the internet\n\nimagine being grateful to company that treat you like a shit\n\nThey owe it to us if they still want to shovel cosmetics MADE BY THE COMMUNITY in our faces and profit off of peoples hard work. #FixTF2",
            "The petition won't do shit on it's own: We need to reviewbomb the steam page (similar to what happen with Helldivers 2) to REALLY show Valve we mean business this time around.",
            "We can do this my brothers! Push ze cart! Raus Raus! Schnell!",
            "2 weeks in, still nothing. The organizers have moved on as well.",
            "I appreciate the sentiment, but the reality is that nothing will be done again. The only action we can take that is most likely to yield results is to give negative reviews and stop playing the game. I am not doom posting with this.    \n\nI admit the fanbase of TF2 is undyingly loyal, and it is amazing. But if this was any other game, the players would immediately drop negative reviews and abandon the game. After that, it would rather take the Ubisoft approach where the devs would abandon the game and work on the new one or the Hello Games approach and actually work on to fix it.",
            "(In Demo's voice)\n\nLEEEEEEETS DO IT!!!!!",
            "I used to play this game a lot back when I was in middle school. Years later, I made my own Steam account and decided to play Tf2 again after so long.\n\nLiterally one of the first matches I get after waiting(I went to Selbyen), both teams were nothing but bots and I ended up getting kicked not long after I joined. Months later Scream Fortress came around, and I ended up having some rather fun matches.\n\nKeyword there being \"some\" as the rest of the time there were bots. There's probably more bot encounters that I'm forgetting, but regardless, I have barely played this game since then.\n\nThe fire needed to get Valve off of their asses **NEEDS** to be so big and so hot, that it would make Pyro proud. So let's grab whatever flammable materials we can get (screenshots and videos of bots, personal stories of bots, etc.) and just start chucking them into the inferno.\n\nMuch like what Plankton said in the Spongebob Movie, **DON'T LET THE FLAME DIE OUT!**",
            "Seen this one before.\n\nBoy, I sure am excited for more virtue signaling from a company that could hardly be more clear about not giving a shit about this game...",
            "Make history guys, make TF2 great again!",
            "Nowadays, we have a pathetic case of allowing toxic treatment of people. Individuals like Jake Paul and Andrew Tate are permitted to scam hundreds of thousands of people and face little to no repercussions until they eventually get in over their heads and take it too far. Major companies in all manners of media handing out hundreds of thousands if not millions of layoffs for the sake of profit from AI, and there's absolutely nothing anyone can do, until someone ends up taking it too far.\n\nValve is taking it too far. Nearly 6 years, and Valve refuses to show any care for this game, yet profit off of it. Not only that, but Valve chooses to try their hand at creating ANOTHER live service PVP game, which they will likely profit off of, will become overrun by cheaters, and will get neglected just like TF2.\n\nNo more; Valve must be held accountable for this.\n\nWe won't be silenced by one tweet. Make your voice heard, let EVERYONE know, not just Valve-- People who invest in Valve need to know how they will inevitably be treated for their support.\n\nEnough is enough, fix the bots, Valve. #FixTF2",
            "Oh hell yeah it's on my birthday",
            "do you know what the definition of insanity is?",
            "What can I do for it?",
            "LETS GO FUCK BOTS!",
            "the bot hosters took down the server we need to fix the server before we can fix tf2 \"EDIT: the issue was the immense server load not the bot hosters\"",
            "Ahhh its time Gentlemenn synchronize your death watches",
            "I've not played TF2 in over a year now because of this shit. Hell yea I'm gonna throw down and tell valve exactly what I think about them. (comment mainly for algorithem)",
            "#FIXTF2",
            "we will stand for justice",
            "I really hope this works!",
            " remember. No bots",
            "lets do this",
            "502 Bad Gateway",
            "ITS ABOUT DANM TIME",
            "hope we hit the target tihs time",
            "Push the cart",
            "FIX TF2!!! FIX TF2!!! THEY MUST FIX TF2!!!",
            "THE ONLY WAY TO SAVE TF2 IS TO RAID VALVE HQs \n\nWHO IS WITH ME?",
            "Heavens to climb, nothing to sacrifice. Im in. Lets knock out these bot hosters for good. #FixTF2",
            "The bot problem has been so bad, the only thing I've touched of TF2 in a few years now is, ironically, the mode where you only kill bots. FIX TF2!",
            "they already ddosed the [save.tf](http://save.tf) site lmao",
            "Litterally make a captcha for the bots at the connection of a match,and make it unpassable,make it litterally disconnect the user if it is not verified",
            "Yeah that'd be nice :)",
            "Cause the last 3 times didn't work, surely Valve will magically start caring now guys!!",
            "\\*PUSH\\* THE FREAKIN CART!",
            "Let's kick this into overdrive.",
            "I signed the petition and didnt get any email confirmation, not even on soam folder",
            "[https://drive.google.com/file/d/1goBP5DVr0we85Ohnc7IHukOtTS-uISEa/view?usp=sharing](https://drive.google.com/file/d/1goBP5DVr0we85Ohnc7IHukOtTS-uISEa/view?usp=sharing)\n\nfrom [https://www.youtube.com/watch?v=zNxjTciIwig](https://www.youtube.com/watch?v=zNxjTciIwig)",
            "awww so cute. what are you going to do? scream louder? putting a date on something isnt going to make it better.",
            "Can't stop won't stop for Fixtf2 , I'll conga all the way to Valve if I have too.",
            "Valve be like: \"who uses \"#\" in a statement anymore 🤓\"",
            "Listen, i fully agree to this idea, and im all in for it, you have my support. However:\n\nFor the love of god, we should NEVER repeat the same mistakes again. If Valve posts a single tweet saying \"We Hear You TF2 Fans!\" DONT BUY THAT SHIT. We should keep pushing this as far as we can, we wont stop UNTILL they ACTUALLY do something about the Bot Crisis. It didnt worked the first time, because the plan wasnt organized enough, and that we quickly stopped after a single twitter (or X) tweet, not expecting them to obviously LIE like most Big Companies do...\n\nsoo in order to succeed, we must keep PUSHING, PUSHING IT LIKE IF IT WAS THE PAYLOAD CART, untill they actually DO something about it, rather than TELL us about \"We Are Working To Improve THINGS.\" \n\nIts simple Valve, dont TELL US youre gonna do it, JUST ACTUALLY DO IT!",
            "Push cream puffs",
            "Could you imagine if that EXAXCT day, valve pushed out an update saying \"everyone, we fixed VAC\". I'm just cackle if that happened.",
            "I wish we had a decent objector image for this.",
            "This might work but its not guaranteed we need someone that cares about tf2 to work at valve or we try to another tf2(that is easier to work on so we dont reach the same problem we have with stock tf2)",
            "Men, Washington never lost. Patton never lost. JEASUS never lost! If winning is good enough for those war heros its dam well good enough for us.",
            "I know USA shouldn't be concerned about this, but they did chose an awful day to do this on mexico. Elections just happened so, at least in the country, this won't be noticed at all.",
            "why wasn't the Subreddit banner changed to FixTF2?  And the icon to a rusty metal sign falling apart?",
            "So aimbots are one problem but to be honest I suck enough that I don't notice.\n\n\nHowever I have noticed one thing - streaming nonsense. And I've noticed it manifesting in the same way - on CS2 there's constantly bots streaming some fire & brimstone religious sermon and the player's name is a YouTube link. On TF2 it's players who keep playing some bigoted \"unalive the gays we like Nazis\" song. In either case it does seem that valve has a secondary issue across multiple games of voice chat spam? \n\n\nObviously they haven't but I feel like it's not too computationally expensive to save a recording of everyone who gets multiple kick votes and if they notice the audio always has an identical sound then just blacklist that sound or something?",
            "If Valve does not take real action against the bot crisis NOW, then it's a certainty that they will take action never.",
            "Ok, so I signed the petition and changed my review to negative, but I can't help but think whether Valve can actually do something about it. Do bot hosters use the aimbots that are available on github or some other technique that is harder to detect?",
            "MEDIC!! Uber me so i can keep pushing the cart!!",
            "\\[I made a bandlab community to hopefully spread the word\\](https://www.bandlab.com/community/fixtf2)",
            "and how is it going?",
            "Idea, what if every time we run into a bot infested server we take a screenahot and make it public on steam? Just flood the tf2 steam community with bot infested server screenshots",
            "bit late to the party but\n\n\n\n\n\n  \nTHE GREAT TRIAL AWAITS",
            "let us fix it like an engineer",
            "sooo are you going to submit it any time soon",
            "So... what happens on June 3rd, exactly?  I'm not clicking any foreign links, but I'm not seeing much of a plan with these posts and propaganda either.",
            "No amount of awareness is going to make Valve pick up any sort of serious development effort again.\n\nUntil the community basically makes its own TF2 (blackjack and hookers optional) and proves that the game is still a viable product worth fixing, Valve can *and will* just keep sitting on their hands. Petitions are cute and all, but by this point it seems the corporate needs some hard data on the amount of money they're leaving on the table because of their inaction.\n\nPrivate servers made WoW Classic happen, as it showed that there really was a massive untapped market of would-be players for a version of the game that simply didn't officially exist at the time. Right now there's a version of TF2 that people want, but no one is providing.",
            "Valve on their way to not give a flying fuck",
            "cant wait for this to flop again",
            "I couldn't access the Save.tf website.",
            "Hey Valve, people might be reluctant to play your upcoming new game if they see how you've mishandled your other games. FixTF2 and bring our confidence back.",
            "Normal people would just move on from the game instead of being so unhealthy attached to it to the point of harassing the dev for indefinite support of a nearly 20 year old game",
            "No offense, but why not review bomb the game? It literally worked with Helldivers 2 and while I'm not saying the petition is entirely usless isn't this basically just a slightly more formal version of the first SaveTF2 but with an actual list instead of twittter posts? \n\nI want to FixTF2 but I don't think this plan is actually enough.",
            "I really feel like the easiest (baindaid) fix would be to not allow people who’ve been kicked (maybe 2 strikes for that poor outlier who suffered the random F1) to rejoin a server. Sure it’s not a major fix but it would probably be very easy to resolve things until a real fix is here",
            "Yeah right because it worked soooo well the first time",
            "average doomposting fan\n\n\naverage optimism enjoyer",
            "This won’t last a week lmao",
            "valve going to do nothing",
            "THEY PINNED IT\nLET'S GO!\n# #SAVETF2 #FIXTF2",
            "stop this corny ass shit and just accept the fact that it is what it is that nothing gonna change",
            "I’m so proud of you all\n#FIXTF2",
            "I like the hand of heavy on the poster, because he can survive a headshot, unlike other mercs.",
            "I still believe the best way to combat these bots is for Valve to unfuck community servers. Put them back on quick play so players can join servers with actual moderation and active anticheat. Hell if they did that I might bring back my little community.",
            "tf2 redditors on their way to scream at a brick wall once again",
            "Does op mean hackers?",
            "2030 : Rescue TF2  \n  \n2032 : Return TF2  \n  \n2036 : Heal TF2  \n  \n2036 : Revive TF2  \n  \n2038 : Remember TF2  \n  \nand so on and so on...",
            "It won’t work, Valve rather spend their time making things then getting board halfway through  and going to the next thing",
            "Honest question here, but what do yall even think will solve the bots? There isn't a single anticheat in the world that can't be circumvented within a couple of months, and Valve's generally neglectful behavior will just mean that this will happen all over again. We learned nothing from the LMAOBox crisis back around 2015.",
            "What happened recently? 2 months ago I posted a comment accosting Valve for their inaction and incompetence and got downvoted by some bootlicker imbeciles.\n\nGood to see tf2's true fans aren't just willing to lay down and take this shit. #SaveTF2",
            "I stopped playing a long time ago because of bots so can’t believe it’s still an issue and they really have done nothing. I was so happy when titanfall 2 got fixed, would be amazing if another tf2 got saved",
            "save.tf isn’t a valid URL.\n\n**Edit:** It is a valid URL. The website was just down when I posted this, likely due to too much traffic, but it’s back up now.",
            "Why don't we just stop buying crates and maybe stop playing the game for a week or so? In my opinion, a dent in their revenue or playerbase would be much more efficient than a petition.",
            "Hey it appears the email that was suppose to confirms my acceptance didn't come is there any way to fix this?",
            "If valve don't do it, we have to, the instant vaccinator medics, the spining aim snipers and soldiers, and more, we need to make them detectable don't matter what",
            "this is totally gonna work this time",
            "[deleted]",
            "saave us",
            "guys TheWhat Show made a petition for #fixtf2 in his new video.",
            "Do you think fixing the sniper bots (lol long shot, but fingers crossed) would affect the vote-calling bots? It almost definitely won't stop regular players from cheating, or doing cheese strats. But with enough attention, do you think the janitor & potted plant may also put out some kind of heavy update?",
            "I can't access [save.tf](https://save.tf), does anyone else have this issue? It gives me a connection timeout error",
            "Valve, enough is enough. You cannot just continue to add microtransactions and monetise a game that dosn't even ducking work! Get up and fix your game!",
            "# FixTF2",
            "We will send those bots back to hell!",
            "Rosees are Red,  \nViolets are Blu,  \nValvesoftware,  \n#FixTF2",
            "i remember playing on those minecraft server map when i was a kid, now it's a fucking ghost town filled with bots...  \n  \ni know i don't play TF2 anymore but makes me really sad to see the state of my best childhood game.  \n  \ni really hope valve move there ass and [#FixTF2](https://x.com/hashtag/FixTF2?src=hashtag_click) and [#SaveTF2](https://x.com/hashtag/SaveTF2?src=hashtag_click)",
            "I gave up on Valve with this issue. They just don't care.\n\nIf I made a product and it was popular and someone was ruining it and making money off it I'd be livid.\n\nValve are just chilling and playing with new tech and hardware.",
            "I hope this works out!",
            "FIX.TF2",
            "I hope for the best",
            "Does someone know on how many have already signed the petition?",
            "DELETE THOSE MOTHERFUCKING \nBOTS!!!",
            "ok",
            "Support.",
            "In South American TF2 is dead.",
            "I get a bad getaway on the host side when entering the website, enyone else has this problem?",
            "1 more try",
            "!remindme 7 day",
            "I was on a game with big weez aka weezy tf2",
            "Is it just me or is the website overloaded at the moment? I get an error 502",
            "someone go to valve office and start protesting like in saveTF2 (also does anybody have problem with visiting with the website?)",
            "this time they better act",
            "Sisyphus; so proud of ya all",
            "I fucking hope VALVE is gonna do something this time #FixTF2",
            "We must do this",
            "a pdf complaining about the state of things isnt gonna solve it m8",
            "i dont get it what will happen on june 3rd",
            "#fixtf2",
            "Is it just me or has save.tf been down for a while",
            "We have to try :)",
            "#savetf2",
            "I cant access the site; I get the message \"Web server is down, host error\" :(",
            "Friendly reminder to comment on the video so it gets better traction. Even for those who rarely comment, we may as well use the algorithm to our advandtage [#FixTF2](https://www.youtube.com/hashtag/fixtf2)",
            "PUSH PUSH PUSH",
            "Fighting is sure to result in victory, so we must fight!",
            "save.tf's server crashed lmao",
            "Don’t let Valve get away with this. This is more their fault than the bot hosters and it’s their negligence that has brought us here.",
            "Remember everyone it's about persistence! Whatever happens, don't get discouraged and keep pushing! We will do it so long as we keep trying!",
            "Aaaaaaaaaa",
            "IF FIGHTING IS SURE TO RESULT IN VICTORY, THEN YOU MUST FIGHT",
            "Guys we must do the most insane thing in video game history like the hell divers community did",
            "#savetf2 #FixTF2",
            "#FixTF2, please valve, just please fix the game (as in removing the fucking bots)",
            "#FixTF2",
            "YEEEE",
            "Not getting the emails to confirm my signature. I'll monitor my spam folders I guess.\n\nEdit: It came through after 3-4 hours.",
            "I can’t even sign the petition because the website thinks my surname is profanity",
            "#FixTF2",
            "### #FIXTF2",
            "At this point, Valve should just hire professional, extremely high echelon cybersecurity experts. I'm talking people who assist government and national security level of professional.",
            "why do you still play and invest time?",
            "**WHAT BETTER PLACE THAN HERE, WHAT BETTER TIME THAN NOW?**\n\n\nTHIS TRAIN STOPS FOR NO TWEET!",
            "#FixTF2",
            "Let's get this lads!",
            "It's time for round 2! Let's hit em harder!!",
            "YEAHHH!!!",
            "Bold to do it on the 3rd considering Valve’s aversion to the number 3.",
            "Our patience has it's limits...",
            "Hope for the best",
            "I love how I’ve tried using 2 separate emails to sign the petition, I haven’t received confirmation emails back for either (it’s been a few hrs ago), and now I cannot retry with those emails on the website anymore. “This email is already taken”.\n\nMovement has my support, but the petition being broken will kill the numbers. Valve ain’t gonna do sh*t 🤷",
            "I love this, but I think there needs to be a second run at #savetf2 for the release date of Deadlock. I really wanna shit in Valve's breakfast cereal.",
            "let us fight back Gentlemen",
            "#FIX TF2\n\nDo not stop from here now brothers! It’s now or never!",
            "Remember people, this time we have to be loud and we have to be concise with our words, do not let Valve get away with their negligence of the game \n\"GIVE EM HELL BOYS\"\nLiterally, give Valve employees a big ol' headache so that they have to fix the game.",
            "Do i gotta be 18 to sign it or nah ?",
            "I've tried to get into this game a bunch of times, couldn't stick with it because of the bots. If this works I'd fucking love to give it another go.",
            "LETS GET THIS BREAD",
            "#FIXTF2",
            "Goddamn we got a website dedicated to this?",
            "Feeecks eeeet.",
            "I just want to play my funny hat simulator. Here's hoping to this being fixed.",
            "Isn’t valve working on some tf2 successor. Good luck with your campaign guys. I never played tf2 but I know how influential it was. I’ll still signup lol to support you.",
            "Mush, you lazy bums!",
            "Yeehaw chucklefucks, its time to do it again.",
            "Please god help us save this beautiful game",
            "*meanwhile in the distance*: I SAID HEY YOU, FEED THE MACHINE!",
            "Comment for support. LETS GOOOOOOOOOOOOOOOOOOOOOOOOOO",
            "The only way to get any action from valve is to make a wave so big they can’t dodge it. And in order to do that we all have to participate. I’ll do my part.",
            "You better stick to that cart like glue MAGGOT! THAT IS AN ORDER!",
            "Gotta boost those interaction stats. Get this to the frontpage of reddit!",
            "Do not settle for a message, only settle for the game being fixed.",
            "we need to do this every year as long as the bots keep coming back",
            "\"I can\\`t hold\\`em off alone here!\"",
            "oh yeah",
            "Does tf2 still make money? That'll be the only determining factor.",
            "LET'S DO THIS",
            "Remember don’t stop on a simple Twitter post we need a proper confirm update that give us more developers to work on the game to give us our proper Major Update.",
            "THE CAHT' AIN'T MOOVIN'!!! GIT **PUSHING**",
            "Yeah, save Titanfall 2!",
            "Yo that's my birthday",
            "How Can I help",
            "wish for the best",
            "𝕺𝖓𝖑𝖞 𝖜𝖊, 𝖙𝖍𝖊 𝕿𝖊𝜶𝖒 𝕱𝖔𝖗𝖙𝖗𝖊𝖘𝖘 𝕿𝖜𝖔 𝖈𝖔𝖒𝖒𝖚𝖓𝖎𝖙𝖞 𝖈𝜶𝖓 𝖘𝖙𝖔𝖕 𝖙𝖍𝖊𝖘𝖊 𝖋𝖔𝖔𝖑𝖎𝖘𝖍 𝖕𝖊𝖔𝖕𝖑𝖊 𝜶𝖓𝖉 𝖙𝖍𝖊𝖎𝖗 𝖍𝖎𝖗𝖊𝖉 𝖇𝖔𝖙𝖘, 𝕴 𝖐𝖓𝖔𝖜 𝖜𝖍𝜶𝖙 𝖙𝖔 𝖉𝖔. 𝕴 𝖜𝖔𝖓’𝖙 𝖙𝖊𝖑𝖑, 𝕴’𝖑𝖑 𝖓𝖊𝖊𝖉 𝜶 𝖌𝖔𝖔𝖉 𝜶𝖒𝖔𝖚𝖓𝖙 𝖔𝖋 𝖈𝜶𝖘𝖍 𝖇𝖊𝖎𝖓𝖌 𝖕𝖚𝖙 𝖜𝖎𝖙𝖍𝖎𝖓 𝖒𝖞 𝖈𝖑𝖚𝖙𝖈𝖍, 𝖇𝖚𝖙 𝖋𝖔𝖗 𝖓𝖔𝖜, 𝖞𝖔𝖚’𝖗𝖊 𝖓𝖔𝖙 𝖌𝖊𝖙𝖙𝖎𝖓𝖌 𝜶 𝖙𝖍𝖎𝖓𝖌 𝖔𝖚𝖙 𝖔𝖋 𝖒𝖊…",
            "I quit the game because of it. Haven't played in I don't know how long.",
            "Lol the website says that traffic is high, so \"bare with us\". Reminds me of the naked TF2 skins I had once upon a time. Man, Scout was impressively endowed.",
            "What do I do to help?",
            "  \n#FixTF2",
            "\"Starting up, Dah Shields!\"",
            "I may not have Twitter, but I *do* know about the SoS server from when the phone service cut all of a sudden across the US",
            "That's my Birthday!, this is a great present",
            "They also left Artifact Foundry in a permanently unfinished state and didn’t hold the million-dollar tournament. #SaveArtifact",
            "+1",
            "FUCK YEAH",
            "PUB PUSH THIS.",
            "LETS DO THIS",
            "VIVA LA TEAM FORTRESS 2!!!!!!!!!!!!!!!",
            "TF2 is a unique experience. It would be an utter embarrassment for Valve to let this continue for even a second longer.",
            "I like this game. It’s is super",
            " FIGHT THE BOTS, TELL VALVE, WE WILL HAVE OUR RETRIBUTION, THIS GAME IS OUR LIFE, OUR CHILDHOOD. LETS FUCKING DO THIS #FixTF2",
            "do your part soldiers",
            "LETS DO THIS SHIT! FOR OUR BROTHERS!",
            "👍",
            "Gentlemen! We are back!",
            "I don't even play TF2 but seeing this would be cool I think",
            "Nice Job",
            "to all lovers of this beautiful home. Please,\n\n\n\n\n CAP THE FREAKIN POINT!",
            "We all want TF2 but at this moment, Valve is working on getting Deadlock ready to launch hopefully soon.",
            "#FixTF2",
            "As someone who stopped playing around 10 years ago this is very sad. Best of luck to you all.",
            "God I hope it works, this time.",
            "I dont play tf2 but we got this",
            "Don't give money to Valve nad don't play on their Broken matchmaking system",
            "I can't sign the petition because my real name has 'hell' in it, and the website says thats a \"Validation.profanity\".",
            "I'm so tired of these bots man, hope this goes well. (there's a typo in the FAQ section btw)",
            "For those who want to support the movement here is a link\n\nhttps://save.tf",
            "Didn't people try this already? Then Valve made it sound like they listened? Sounds like they lied. 😞\n\nHope it does something this time. Truly.",
            "Lame",
            "Love the game to death but it's ultimately why I haven't played in 3-4 years. So many actual bots that it got to the point where you can't do anything without being accused of cheating.",
            "HOLD THE LINE TF2 BROS!!!!! HOLD THE FUCKING LINE!!!!!",
            "I pre-order the Orange Box in '07. I introduced my sons to TF2 last year. We had fun playing for a while, but the bots made it a bad experience. I hope you guys get the change you deserve. \n\n-A fellow Primeval Warrior",
            "Let's hope Valve actually does something this time.",
            "Bullettrain said what protesters",
            "LEEEEETTTTTSSS DO ITTTTTTTTTTTT\n\n#fixtf2 #savetf2",
            "Bot activity kicked up heavily due to this again.",
            "Fix yes",
            "get on the point you wusses! (that's pyro's get on control point quote)",
            "\"BREAKING NEWS! BILLION DOLLAR COMPANY LOSES AGAINST KIDS IN A BASEMENT COPYING CODE FROM ONE ANOTHER!\"",
            "What happens if the outcome is Valve just shutting down all of TF2?",
            "Good job ya wankers",
            "what do you guys actually expect valve to do? they cant stop cheaters in their BIGGEST ips. \"a better anticheat\" isnt something they can just make.",
            "(Soldier) I am not trapped in a room filled with robots they are trapped in here with me",
            "It's time to start negatively reviewing tf2 on the steam store.",
            "Good luck!  \n#SaveTF2  \n#FixTF2",
            "DO IT AGAIN! DO IT AGAIN! \n\nP.S. Focus on the bots",
            "Can anyone tell me what I'm actually supposed to do?",
            "VE MUST POOSH TINY CART!!!",
            "Plant yourself on dat darn point, mister!!",
            "The cart is supposed to move Forward!!!!!",
            "SENTRY DOWN, PUSH PUSH",
            "The cart has bloodey stopped!",
            "COME ON MAN START PUSHING THE CART!",
            "THE FRICKIN CART STOPED",
            "Push you wankas!",
            "GET TO THE CART, MAGGOTS!",
            "Puuuuush! Push like you mean it!",
            "little men steal our cart!",
            "yo brotha we must move this cart",
            "ZE CART IS NOT MOOOOOVING",
            "This ain't a walkabout! Push that cart!!!",
            "Get to the cart, ya bloody idiots!",
            "Ze Cart is supposed move **FOOOORWAAAAAARD!!!!!**",
            "WHO STOP PUSH THIS CART?! I WANT NAMES!!!",
            "PUUUUUUUUSSSHH!!!!!!!",
            "yo who stopped pushin the freakin cart?",
            "Sir yes sir",
            "[https://www.reddit.com/r/tf2/comments/1d96gwl/push\\_the\\_cart\\_savetf2/?utm\\_source=share&utm\\_medium=web3x&utm\\_name=web3xcss&utm\\_term=1&utm\\_content=share\\_button](https://www.reddit.com/r/tf2/comments/1d96gwl/push_the_cart_savetf2/?utm_source=share&utm_medium=web3x&utm_name=web3xcss&utm_term=1&utm_content=share_button)\n\nKEEP PUSHING!",
            "Mmmhhhhhpp mmmnnnmmmm mmmmhpphhh",
            "if i want to use the petition, do i have to use an actual name or is my online username okay?",
            "Omagad weezy is that you",
            "holy fuck weezer",
            "YESS",
            "LESSFUUCKINGGOOOOOOO",
            "I've not gone around screaming it on these posts but I think the best way to get valve to notice would be to find a way to have our own alternative should nothing come to pass, ala what Nostalrius was to the WoW example everyone I think must be so familiar with by now.\n\nAs much as I wish for a success, publicity alone I fear would have us closer to the Warthunder protest than any other",
            "We have literally nothing to lose. We may as well try!",
            "there's nothing to lose anyway lmao",
            "I think doing thinks like not opening the game/buying tf2 items from valve would help",
            "Spoiler alert: it won't. The other hashtags didn't. The streamers jumping on the bandwagon didn't.",
            "Even if valve doesnt react we loose literally nothing",
            "No.",
            "We either sit on our rears and do nothing, or for once, take a stand for a spark of hope.",
            "💪 [I WILL NOT ABANDON MY POST](https://i.imgur.com/Fz2d5GJ.png)",
            "Bro I don't got shit, I can't even launch the game anymore, it just turns off all my monitors and makes me restart my PC to get them back on",
            "Shows there's more than we will expect",
            "Thank you! I was worried it might be getting intentionally DoS'd",
            "Love your gmod shorts!",
            "Hello alxium👋",
            "We could just do it anyways",
            "I don't want to encourage it, buut if someone would be determined enough it would not be long before their location is known to everyone",
            "Contact anonymous and 4chan we get it done in secoy",
            "Holy guacamole spy tf2",
            "Synchronize your #FixTF2 watches.",
            "Mentlegen",
            "No way is that the real sand eating zenith tf2",
            "Is that PyroTF2? (Real?)",
            "Don't bots mostly stick to public matchmaking servers where you can't see sprays anyway?",
            "Didn't the guy who was putting that stuff on his bots' objectors already get 20 years? Or is someone else also doing that?",
            "The website is dealing with pretty heavy loads right now, just refresh.",
            "There's just so many people in on it that it can't handle them all",
            "oh... the situation is more fucked up than I remembered... Gibus Christ...",
            "I gotta disagree on this one. It's literally one dollar and I did notice it making a difference.",
            "Another comment said that the site is just getting too much traffic.",
            "Does it ? I mean there is like 2000 people on it, don't know if it's that much tbh",
            "\\*Unreasonable\\* is a bit subjective. it would not be a huge hit to bank roll some guys to look over servers. They did have contractors polish the game after all. Whether that would actually work long term is. Debatable. It would certainly make specific servers playable again but as bot hosters increase so does the manpower needed to deal with them",
            "I just tried, the petition accepts aliases.",
            "use your online alias; that's what I did",
            "Genuinely, them moving onto Deadlock in earnest as TF2 remains a steady source of income with a solid fanbase without any real present efforts on their part is bewildering. Though, then again, they're a private company that does what they please, so they may very well please at this point to be complacent & let that income stream persist while just ignoring complaints.",
            "Time to start prerecording my sponsored “why fixtf2 failed” video so I can give valve a few grand for my unboxing and Mann up videos 🙏",
            "No one is saying that",
            "Its reviews currently are overwhelming negative so there’s a chance",
            "strongly agree, this savetf thing had already been attempted to no avail. any other game would already be \"overwhelmingly negative\" on steam with a much lower playerbase, which is more likely to get results",
            "What do you mean? They have a petition! Those historically always work.\n\nSeriously I'd love for the game to have new content but valve just do not care. There's a lot of issues and nuance to fixing a game like this that I and very few other people can understand fully and I really don't think something like this is going to change much. Hopefully I'm wrong but chances are it'll be another vague acknowledgement with no actual change.",
            "haha weird, wonder why someone downvoted you, thats quite sick actually, you gotta get a fixtf2 cake now",
            "The issue is too much legitimate traffic lol, goes to show how many people really care!",
            "Better to try than do nothing",
            "As long as they are making continues paid cosmetic updates we are well within our right to complain. You want my money? Fix your product.",
            "I dont think work review bomb because is a movement in the first time of the game(0-1 year life). Less sell of the game, less money to company.\n\nBut tf2 is a free to play, review bomb no have the same impact. \n\nMaybe if one day like protest all steam player dont trade any object and dont buy nothing in all games. Have impact for valve but that is very hard to work if the game have more of 10 years.",
            "You should watch Shounic's video about the potential bot solutions.\n\n\nLong and short of it is, it's not that simple.",
            "Nope. Bots.",
            "Seems it's down for whatever reason.. DDOS?\n\n---\n\nDomain Information\n\n    Name: save.tf\n    Registry Domain ID: DOM100979397-FRNIC\n    Domain Status:\n\n    active\n    Nameservers:\n\n    ximena.ns.cloudflare.com\n\n    clint.ns.cloudflare.com\n\nDates\n\n    Registry Expiration: 2025-04-01 11:15:18 UTC\n    Updated: 2024-05-17 10:24:16 UTC\n    Created: 2024-04-01 11:15:18 UTC",
            "Wdym instant vaccinators?",
            "This is the second time",
            "Yeah it's down for now.",
            "It does.",
            "WHO STOPPED PUSHING ZE CART? I WANT NAMES!!!",
            "MEDDIC!",
            "THAT BOMB AINT GONNA MOVE ITSELF!",
            "YO A LITTLE HELP HERE",
            "You failed BOOOOOO",
            "both are fine as long as the number goes up.",
            "I went ahead and used my steam name. Dragonsfurylover69 is desperately hoping to see some results with this movement because AFTER this movement, I still want a strange Dragon's Fury but that must be cast aside for now",
            "budy holy",
            "That'd probably just be TF2 Classic if anything",
            "That would make less revenue for them, and less of a reason for them to work on a game. Plus few people buy items from the Mann Co. store any more (and the ones that do are so new they aren't in the community), most of them are gained from trading with other players which doesn't pay Valve anything.",
            "I’d rather make an attempt than do nothing.\n\nFully prepared to dedicate my time towards other games though and not look back if needed.",
            "\"For once\" we've done this many time and got a tweet, maybe this time we'll get a pretty little image of spy if we're lucky enough. But always worth a try I guess, I'm just not expecting much",
            "#FixTF2\n\n#SaveTF2",
            "I AM MY PERIMETER, AND MY PERIMETER IS ME!",
            "Sounds like your graphics card is crashing, you could try these steps:\n\n# Do you have a PC or a laptop?\n## Laptop\nCheck if your laptop has multiple graphics cards, if it does, set the more powerful one as default and update drivers, if it doesn't, check if your graphics card is powerful enough for TF2 and try updating drivers.\n\n## PC\nIf you don't have an external graphics card, try updating drivers, if you do, check if your monitors are properly connected, check if the graphics card is getting enough power, check if your graphics card is powerful enough for TF2, update drivers",
            "The microsd that I use for steam is starting to act weird and sometimes stops reading. Decided to play it safe and not use it til I can get a ssd",
            "~~We could~~ **LETS** just do it anyways",
            "I do want to encourage it, I'll hire a balls stealer on the dark web and scissors their balls off cleanly",
            "At least if someone so determent they could send this info to police. Especially if it those DDoSing bastards.",
            "The chances of them helping us are slim. That could very easily backfire if they decide to side with the bots.",
            "4chan is not your personal army. And Anonymous is more of a “persona” for most. There isn’t actually an Anonymous IIRC.",
            "We have 192 hours to prepare. For most men, no time at all...",
            "Yes.",
            "I think this was either before that was the case or on some community servers that bots are able to get on\n\nhttps://www.reddit.com/r/tf2/comments/zyj59k/kyle_d_lugenbeal_otherwise_known_as_the_cheater/",
            "Just like my mom!",
            "Oh okay",
            "That's the thing. The bot hosters harass, dox and swat people. Hell, one bot hoster from a couple years ago was arrested for CP and using the spray feature to spread it in game.\n\nA 2007 video game less fun to play is really annoying, but it's the least significant problem honestly.",
            "It’s $5 usd to become p2p, and bots have ancient unbanned accounts that are years old, bot hosters are losers so they spend money so the bots can talk and mic spam",
            "That is what I said",
            "Okay ty",
            "as weezy said in his new video \"it's a great problem to have!\"",
            "Bots that change the vaccinator resistence instantly eepending of the weapon that they see you",
            "op deleted the comment but I'm assuming that what they've typed is not wrong. this is technically our 3rd time. our 2nd time was back in January in response to valve's takedowns and DMCA's, but it had no organization so it just kinda... dissipated",
            "Push da freakin’ caht!",
            "WE WILL PUSH UNTIL THERE IS NOTHING LEFT TO PUSH!",
            "*raises my hands feebly and immediately catches a stray crocket*",
            "Eh, TF2 Classic isn't really a great alternative. It's a fine game, and it's not quite as big a difference as, like, Fortress Forever, but it's not really what a lot of folks are looking for.",
            "Agreed",
            "It's very hard to prove that someone was DDoSing someone, because as the name suggests, it's an attack from multiple places at once\n\nBut yeah, DDoSing is very illegal iirc",
            "your average 4chan user will just think this is \"pointless reddit shit\" and probably call it's organizers a slur. Most of them think the bot hosts are also massive losers.\n\nI'm hoping this results in something, but I doubt it. I'm sure #repairTF2 in two years will be a smash hit, though",
            "Not your personal army.",
            "We are not most men. We are gamers! We have the resources. The will. To make these hours count!",
            "LETS FUCKIN’ GO!!",
            "I wouldn't say that. You need to spend over $5 on *Steam* so you dont have a limited account, you can spend any amount on TF2. It's a two part check.\n\n1. Has the person spent at least $5 on Steam for anything at any point.\n\n2. Has the person spent any amount of money in the Mann Co. Store.\n\nIf a gamer hasn't spent $5 on Steam at any point I do question if they actually play games.",
            "Oh i misread it. sorry!",
            "the cart ain't moving lads!",
            "WHY DOES CART NOT PUSH SELF?",
            "it's the closest you can get to it without it just being tf2 i feel and if you play on the vault f4 servers you almost exclusively play old maps and no one really uses the new weapons often",
            "I mean such orchestrated attack can't appear from thin air. Some kind of a signal need to trigger it. But okay, I know nothing about it but still contact the authorities would be helpful, IMHO.",
            "And I’m the real pyro tf2",
            "Huddah hudda!!",
            "The point I'm making is more, like, WoW Classic came about because there was a demand for a pre-modern WoW experience. The problem here is that people aren't clamoring for a pre-modern TF2 experience, they want a modern TF2 experience, just without the bots.",
            "Hi Pyro!",
            "Push like you mean it !!!",
            "Precisely. It's also tricky because people like their cosmetics and they like cosmetics in general. So what would happen if a bootleg version pops up? Are we all gonna have to rebuy our cosmetics from whatever person is hosting the server? I dunno about that.\n\nI don't think there's a real desire there for vanilla TF2 beyond satisfying a mild curiosity. I definitely don't want to go back to the basic version of every class.",
            "There are definitely some people out there who'd like to see a return to the pre-cosmetics era cause they aren't a fan of how hats and paints and unusual effects have changed the game's visual style over the years, which I can kinda understand even though I like cosmetics",
            "Hey Pyro!",
            "IS SOMEONE GONNA PUSH THE FREAKIN' CART!?",
            ">  Are we all gonna have to rebuy our cosmetics from whatever person is hosting the server? I dunno about that.\n\nWhat if they just made crates openable for free and people could just earn their cosmetics on this \"private server\" that way?",
            "realpyrofromtf2 meets pyrofromtf2real!",
            "Why is ze cart not moving?!",
            "mmph mmph mmmph!!",
            ":0",
            "The cart has stopped!",
            "We are a hive mind."
        ]
    },
    "PSA: Here is a list of common scams going around nowadays. Please use common sense when dealing with random strangers. Spread the word to any new players to the game.": {
        "title": "PSA: Here is a list of common scams going around nowadays. Please use common sense when dealing with random strangers. Spread the word to any new players to the game.",
        "score": 1319,
        "url": "https://www.reddit.com/r/tf2/comments/101y77k/psa_here_is_a_list_of_common_scams_going_around/",
        "content": "If you don't want to read through the whole post, just know this:\n\n#If it's too good to be true, it is.\n\nRandom people who add you out of the blue and immediately ask you for something is a red flag. They try to cast a wide net and add as many people as they can. You might be thinking, it's already bad enough we have to deal with aimbots in our games, but now we need to fight off scammers outside the game too? Sadly, yes. And if you're the type of person who has never seen these scam attempts before, maybe you should keep reading.\n\nThankfully, these scammers are not very creative. The vast majority of them have been using the same scams for years. And yet people still fall for them. Don't be the latest sob story on r/tf2. Here are the most common scams going around today:\n\n#1) Highlander/Tournament Scam [\\(see here for an example\\)](https://i.redd.it/74rxrwlmemk71.jpg)\n\nSomeone will randomly add you and ask you \"which class you prefer to play in Team Fortress 2\". No matter what you respond with, they will follow up that their team is missing a player for their tournament with a kickass prize pool. A variation of this is they will ask you to vote for their team. They might even try to stay topical by saying one of their teammates got covid and can't play. Either way, you will be led to a (fake) tournament site to either sign up or vote for this team.\n\n**How does the scam work?** The site they redirect you to is a fake tournament site, [which might look something like this](https://i.imgur.com/vzxqG3J.png). It exists only to steal your Steam login details. Once you find their team and try to join/vote, you will be redirected to a Steam login page. If you enter in your Steam name and password, your account will get stolen and your items taken.\n\n**How do you know this is a scam?** There are only a few legitimate comp leagues in TF2: UGC, RGL, ETF2L, ozFortress, and AsiaFortress. But even if you're unfamiliar with comp TF2, you should know there's something fishy about someone offering to share such a large prize pool with you with minimal participation. If we look even closer at the site, you'll notice a few things. Many of the \"players\" have profiles related to CS:GO and other real esports athletes, but none that are specific to TF2. You might even notice that many players share the exact same profile pictures. Too bad you can't click on any of their names to check their Steam pages because the site creator didn't think you'd notice.\n\nAnd if that didn't tip you off, take a look at the TF2 tournaments that are supposedly going on. Some players are registered on multiple teams at the same time. [The tournaments page says they are all free to enter, but there is also a monetary prize pool.](https://i.imgur.com/sRvdLkv.png) Where is this money coming from then? Perhaps from a certain bodily part where the sun don't shine.\n\n#2) Steam Admin/False Report Scam [\\(see here for an example\\)](https://blog.malwarebytes.com/scams/2021/03/steam-users-dont-fall-for-the-i-accidentally-reported-you-scam/)\n\nSomeone will randomly add you because they've accidentally reported your Steam account to Steam Support. It was all a mistake, they say, and you should add this \"steam admin\" to sort it out. Once you talk to this (fake) Steam admin, he will either get you to log out of your account and tell him your email address and the verification code sent to your email, or ask for your Steam  username and password. There is even a trading related variation of this scam where your account was reported for \"duped items\", and the fake Steam admin will ask you to send items to a phony trading bot to \"verify\" the items.\n\n**How does the scam work?** This one is pretty simple: once you send your Steam account details or your items to this scammer, they'll be lost. They'll be free to withdraw any items of value from your account and drain it dry.\n\n**How do you know this is a scam?** There is no such thing as a \"steam admin\". [Steam Support also clearly states that \"Steam Support representatives will never ask you for your password\".](https://help.steampowered.com/en/wizard/HelpWithAccountStolen#:~:text=Steam%20Support%20representatives%20will%20never%20ask%20you%20for%20your%20password.) \n\n#3) Gambling Site Promotion Scam [\\(see here for an example\\)](https://www.youtube.com/watch?v=zNdHdxOVXXo)\n\nBy now you probably know how this starts. Someone out of the blue will add you on Steam and start asking you something. In this case he will ask you to help him promote his site through Steam, and in return you will be paid. He will then explain how the payment works. He'll link a gambling site and say he can control who wins the jackpot.\n\n**How does the scam work?** He will pick out a random player on the site, or ask you to pick one out, and he'll make him win the jackpot. Seeing as how he introduced himself as the owner, it's likely that he does indeed have the ability to manipulate the results. However none of the players or roulettes are real. They are all made up and don't link to actual profiles. The scammer will then ask you to bet items of your own and guarantee a win for you. You do as he says and it seems like he made you a winner as well, but of course, you can't seem to get your items back. He might even be cheeky and ask you to do it again. But he has your items and likely will not give them back, even if you ask nicely.\n\n**How do you know this is a scam?** There are no legitimate gambling sites on TF2 today. [They were taken down years ago after Valve was involved in lawsuits about involvement with illegal gambling.](https://www.theverge.com/2016/7/14/12186584/valve-gambling-statement-counter-strike) Anyone trying to peddle a gambling site today is relying on the chance that you don't know this. You might also notice that the gambling sites don't have real players who link to real profile pages, or that the conversations in the chat feed make no sense.\n\n#4) Mannco.store Bot Scam [\\(see here for an example\\)](https://preview.redd.it/237wdqgy2k0a1.png?width=1848&format=png&auto=webp&s=57929f2df8b74d3160dde2f2d026529ec3ed5034)\n\nMannco.store is a legitimate trading site, but it also attracts a lot of scammers who pose as admins or reroute you to fake bot accounts. A trader will add you, usually offering you an incredibly generous deal for your items, but wants to be extra sure that your items are real and you're not scamming them. How ironic. Their reasons will be one of the following: to check the value of your items, to have your items go through a verification process, or to check that your items are \"100% marketable\". Another version of this scam is a phony trade offer posing as a \"deposit request\" from people who might even threaten to delete your items if you don't cooperate.\n \n**How does the scam work?** You will be asked to verify your items through mannco.store. They'll guide you through the steps of adding a mannco.store bot, then you'll receive a new trade offer from an account that appears to be a real bot. [The trade offer will ask for your expensive items with nothing to give you in return.](https://i.imgur.com/HqIPp31.png) They are supposedly going to give your items right back after they \"verify\" them, but they won't. This bot account is a fake. Accept their trade and your items go bye-bye.\n\n**How do you know this is a scam?** Mannco.store explicitly tells you that [their staff will never contact you outside of their own internal messaging system](https://i.imgur.com/4CQk4vc.png). Any invites on Steam or discord from \"admins\" will be scammers. If you're looking to deposit items into your mannco.store account, only accept the trade link generated through their site. And once you do trade with a mannco.store bot, make sure that it's one of the bots from [this list on their website](https://mannco.store/bots), and also that the account is part of the [\"Mannco.store | Bots\" steam group](https://steamcommunity.com/groups/MANNCOBOT). You might recognize a fake bot account because [he'll join the \"Mannco.trade\" Steam group](https://i.imgur.com/XN0cLHi.png) but not the official bot group.\n\n#5) Particle Mayhem Scam (\"Vote for my artwork\" Scam) [\\(see here for an example\\)](https://www.reddit.com/media?url=https%3A%2F%2Fpreview.redd.it%2Fpd7cle86n7lc1.png%3Fwidth%3D1703%26format%3Dpng%26auto%3Dwebp%26s%3Df6f0919e2b2d35b8106b9fcc8660490dbf3c7064)\n\nThis scam is pretty similar to scam #1, but it's becoming common enough that maybe people need to be warned about this one in particular. Be wary of ANYBODY who asks you to do them a favor in exchange for payment.\n\n**How does the scam work?** It works the same way as the highlander vote scam. You'll be asked to vote for a custom particle effect in exchange for keys as payment. Now how does he want you to vote for his submission? Why through a fake steam login site, of course. Again this is just the highlander vote scam with a fresh coat of paint. These scammers are already reusing old scam methods.\n\n**How do you know this is a scam?** [\"Particle Mayhem 2\"](https://particle-mayhem-2.tf2maps.net/) is a real community contest created by the TF2Maps.net mapping community. However the official site warns that no one will be asked to log in to vote for any submissions. They even point out that the \"Malibu Sunset\" effect is not one of their official entries. It seems these scammers couldn't be bothered to link an actual submission and instead keep sending out the same fake one every time. The contest is also over and the winners announced, so anyone still trying to get votes for their submissions are either obvious scammers or time travelers. \n\n#\"What do I do if I accidentally logged into a scammer's website?\"\n\nAssuming it's not too late and your account/items haven't been stolen yet, go through the following steps:\n\n1) Change your Steam password\n\n2) Go to http://store.steampowered.com/twofactor/manage and deauthorize all devices from logging in to your Steam account.\n\n3) Go to your [Steam API Key page](https://steamcommunity.com/dev/apikey) and click “Revoke My Steam Web API key”. This will turn your old API key obsolete and generate a new one. This way you make sure no one retrieves data through your Steam account’s API.\n\n4) Reset your [Steam Trade URL.](https://steamcommunity.com/my/tradeoffers/privacy#trade_offer_access_url) This will disallow scammers from sending you trade offers once you made sure they cannot access your account. Make sure to add your new Trade URL to accounts on websites that you trust so you can otherwise keep on trading as per usual.\n\nBut if all else fails, you might still have a chance of recovering your Steam account by contacting Steam Support.\n\n­ \n\nThose are the most common ones I see going around, but there are likely many more. To reiterate, don't trust any opportunity that seems too good to be true. Don't click on suspicious links from strangers. And immediately be very suspicious of random people adding you on Steam asking you for something. If you notice any of the telltale signs above, block the scammer and report their account on Steam. Steam two-factor authentication doesn't make your account bulletproof, especially if you are fooled into giving your Steam info away to strangers.",
        "num_comments": 115,
        "comments": [
            "Might want to post this on r/newtoTF2 just to be safe",
            "Imagine thinking you are good enough that someone wants to recruit you for tournaments. Can't relate.",
            "Helpful, informative post to help players avoid scams: 50 upvotes\n\nSome blurry screenshot of a t-posing character model: 4k upvotes\n\nWe live in a 2fort",
            "This isnt about tf2 but this one is common too: the giveaway site. They make a fake site which apperantly gives you free games but just steals your login info.",
            "It’s kinda funny to me that in the game were you can become the enemy team and stab someone in the back there are more scammers then any other game out there",
            "PSA: There are many scammers out there, many of them with trash throwaway accounts that have \"thousands of hours\" on their account.  There's generally an easy way to find out if the player is legit or not - UNLESS that account they are adding you with has been hacked (please be careful).  **Now for many scam accounts who're fake, you can easily tell by doing this:**\n\nFollow this path:\n\n**View Profile -> Games -> Find their TF2 game listed... and now for the fun part.**\n\n**Click that pretty little list button that says \"View Stats\".**\n\n**Click the (Username)'s Stats.**\n\nand Voila!  Legitimate players will always have hours under their name in many varying classes.  This is VERY hard to mimic, **many throwaway accounts will have 0 hours listed on** ***every*** **single class even if their \"game time\" is listed at 2k+.**\n\n***But please, even if there is a person with some varying hours it may still be a hacked account - please do be careful out there!***",
            "Worth noting is that you should not give up trying to regain access to your account even if it's been hijacked. Contact the *real* steam support and they can recover the account. No matter what the hijacker did. No promises about your items tho.",
            "Ayyyyyyy!\n\nThis thread is back! :)",
            "Hopefully this will make a dent in the million “i gOt ScAmEd” posts",
            "I fell for the first one - just trying to help out with a team vote & not even giving money away. I was suspicious, but the login page had Steam URL and everything. Luckily I caught on when I got a text telling me my Steam Guard was deactivated after \"logging in.\"\n\nI've never fallen for scams before that but the danger is real.",
            "the last one happened to me, my brother contacted Steam Support to ask for help, I haven’t received an answer yet, I’ll start playing TF2 when I get my items back, because I care about my cosmetics\n\nAlso, for some reason, the “admin” told me to buy 40 keys on Mannco.store to get my stuff back",
            "Interesting thing to see about the gambling sites, as I’ve seen one sponsor a YouTuber quite recently.  Can’t remember which creator or video, but it was still in my recommended.  Curious whether the site was legit or not.",
            "I just saw someone try to pull the steam admin scam on me. I checked here, realized it was a scam, removed them as a friend, and blocked them. Fortunately, they got none of my information.",
            "Don't forget about fake trade offers! If a person ask to go through a \"Moderater of trading\" it's BS. Your items will be gone forever.",
            "this is good list. On Reddit, this list should not be banned",
            "Thanks man this really helps out some new players, when I first got into Tf2 I got scammed out of my first strange and a few cosmetics. Thanks for letting other new players know how to look out for scams. :)",
            "Thanks! I did not get scammed!",
            "Thanks for the advice.",
            "Unfortunately, I fell for one of these scams when I was new to trading a long time ago, that being the Mannco store bot scammer. I lost over $150 in items, including an unusual. All because I didn’t do my research\n\nThankfully, these lessons only have to be learned once. \n\n*Most of the time…*",
            "I CAN'T BELIVE I JUST FOUND OUT THAT ALL OF THESE WERE METHODS USED ON ME BEFORE AND THEY SOMEHOW ALL WORKED, I AM SO STUPID FOR FALLING FOR ALL OF THIS. Thankfully, NOW I know.",
            "well shit i just got scammed",
            "There's a variant of the [mannco.store](https://mannco.store) scam (can be used with any legitimate TF2 money-trade website like [marketplace.tf](https://marketplace.tf)) where the scammer has already gained access to your account but cannot actually steal items due to the presence of two-factor mobile authentication; the way the scam works is the scammer will ask if you will sell items via this means, and if you agree, then let YOU attempt to deposit your items on the aforementioned websites.   \n\n\nThe scammer will then use his access to your Steam account to quickly CANCEL the legitimate trade offer with the legitimate bot and replace it with their own offer with a fraudulent, illegitimate trade bot. You then end up accepting this trade and get scammed of your items. This does involve already having been phished/hacked before though but it's worth looking out for.",
            "I got scamed 1 hour ago and i see this. Seriously ?",
            "I got scamed 1 hour ago and i see this. Seriously ?",
            "I got a new one a few days ago. opening line was \"do you dabble in the art of 3d art\" or smth like that. basicly the bot tells you that they have developed a new unusual effect and wants you to go to a website (which it will provide a link to) to go and vote for their unusual effect to be added or something. theyll also promise to \"give you a few keys for your troubles\". its an obvious scam. first off they have a bunch of different names on their profile, constantly on tf2 and ofcourse if you try to respond they just keep repeating the script",
            "is [https://skillplaying.fun/](https://skillplaying.fun/) also? its a fake [match.tf](http://match.tf) by the looks of it, and it seemed very suspicious. i was a dumba\\*\\* and actually put it my credidentials, so i changed my steam password right after.",
            "Lol",
            "Anyways anyone want to go to my gambling site called “thisisnotascam .scam”",
            "I heard [markeplace.tf](http://markeplace.tf) closed down. But I saw it around, is this link [https://marketplace.tf/?gad\\_source=1&gclid=CjwKCAiAxaCvBhBaEiwAvsLmWPhnq-5qV4PDQBhvCGTx3IW\\_V98BKrZQl2biP8IRbk0GjcO3AqBPRBoCis0QAvD\\_BwE](https://marketplace.tf/?gad_source=1&gclid=CjwKCAiAxaCvBhBaEiwAvsLmWPhnq-5qV4PDQBhvCGTx3IW_V98BKrZQl2biP8IRbk0GjcO3AqBPRBoCis0QAvD_BwE)  \nreal?  \nis it a scam?",
            "Thank you very much",
            "A common one I've seen is \"traders\" trying to pass off Festivized items as Festives, with Festives being the far more expensive version. Simply taking a close look at the items they offer you is a good way to combat this one.",
            "Can someone please help I just got scammed by someone pretending to be an admin and I lost a unusual I liked. I got wise before handing over any credentials but they still traded all my items is there any way to recover them?",
            "I JUST GIOT SCAMMED MY 5",
            "Also the rate my artwork unusual concept and e sports logo and that’s just the bear minimum of what I’ve gotten",
            "Legit wanted to buy someones unusual they unboxed, they instantly block me and sell it for half of my offer only to lose the account to a phisher a week or so later :(",
            "another one, friends with compromised accounts try to attack you as well",
            "why do people do this kinda thing anyway? Im sure they could make more money with a minimum wage job at Mcdonalds or something",
            "I never fell victim to any scams, only accumulated a debt from a stranger, but... thank you anyway, gentlemen.",
            "THANK YOU THANK YOU THANK YOU",
            "im new and this is very helpful thank you!",
            "Dude I wish I came across this sooner before I lost my account to the 2nd one. I was so dumb and believed it. I didn’t know at the time until it was late and they banned and deleted my account",
            "I get these messages all the time. Rather than just blocking them, I allow them to start the scam, wait just long enough for them to think I'm gullible, and then send goatse before blocking. Far more satisfying.",
            "It appears that I'm a victim of the Particle Mayhem Scam.",
            "The \"Tournament Scam\" as you call it, is not real. Maybe look up what a team drive is before you post ignorant and wrong information.",
            "A friend of mine just got hacked or something, because in the middle of a friend of mine talking to him about pizza tower he tried pulling the Highlander one, and then blocked me when he tried pulling it up, big sad :(",
            "i legit fell for the false report scam like a month ago. i lost my pyro drip, my favorite items, (the frying pan, disciplinary action, etc.) and my only australium i got as a birthday gift from my first ever steam friend. when i realized it was a scam i felt even more autistic than i already am.",
            "Thanks for this list.  I posted a link to 50 golf clubs available on FB marketplace. I have sold a few to random people I met in public places. Today a poser (not ready to call her a scammer yet) jerked me around on FB Marketplace asking about golf club details, price per club, do I have a pink golf bag, stuff like that. Then she agreed to meet.  I didn't want to transport all the clubs somewhere and wait, so I just gave her my home address.   After another delay, and asking for directions, she ghosted me.  Did not show up.  So what is the scam here? She has my home address and real name from FB messenger.  I have not noticed unusual activity.  What is the downside?",
            "uhhh I just traded with storebot from blackwonder a few days ago am I safe?",
            "did they just add a 10th class i dont remember a class named mcree",
            "Dont lose a australium medigun like me.",
            "I lost everything to the second one :(",
            "People actually fail for these?",
            "Oh fuck I just got scammed. The Tournament scam more specifically :| what should I do next?",
            "kinda comforting to see i'm not the only one who has fallen for these. please stay safe guys",
            "A new variation of the tournament scam recently popped up where they ask for your casual level instead of your main, and now use accounts that actually have played tf2 a lot.",
            "someone attempted to use the second one on me once lmao",
            "I fell victim to a mannco.store deposit scam, it sucked",
            "Another common scam is people sending you fake trade website links",
            "It's absolutely terrible that players even have to deal with these, really.  \nI guess it makes sense, though. Scams and scammers are everywhere...",
            "I want to cover a rare scam I encountered for the sake of everyone- and it got me, too.\n\nSometime ago some user was contacting me about crypto-related over Steam. I naturally told him to shove off and blocked him, I figured he might’ve been a friend or something that got hacked, I didn’t remember friending him.\n\nThen, from an account that definitely WASN’T my friend, I was contacted by ‘Victoria’, a Steam admin. They said they were investigating this guy and believed I could’ve perhaps done some trades or something with him of a crummy nature. If only I’d know Steam never contacts you via messages, only email.\n\nWhoever it was played it up to be really convincing- almost scarily so. By some maneuver not only were they talking to me despite me never friending them, but had managed to change my Steam profile picture and display name to reflect that my account was ‘under review’ (missing pfp and random numbers and letters for the name). Fearing this was an actual investigation, and considering the fact that I HAD been contacted by that guy, I complied.\n\nThey told me to trade my items not to THEM, but to another account or a friend’s. I thought that sounded safe, so I sent it through- though them giving me a 10 minute timer should’ve tipped me off. Or the fact that when I told them I was struggling to put all items into the trade box, they gave me an ‘extension’. But the fear paralyzed me.\n\nOnce I’d done the trade, I’d been duped. They stopped talking to me, and upon reviewing the trade I realized the worst- they had somehow made a DUPLICATE of the account I’d sent my items to (a friend’s) and redirected the trade to THEM, instead. It looked like my friend’s account but none of the added details were there. I couldn’t fathom how they’d done it unless my account was actually hacked, so I changed my password twice and saved the profile link for the ‘Steam admin’ and reported them… but the damage was already done.\n\nOver a thousand dollars of spent Steam funds, rare items like Halloween spelled-weapons, a Halloween spell cosmetic I traded for of limited existence, and even my prized unboxed unusual, a Green energy fat man’s field cap- gone, all gone.\n\nBe wise, peeps. And don’t let the fear get to you.",
            "I was scammed with 1-3 :( I lost an unusual and good items and steam won’t do shit in fact I asked multiple times and all the time they just say we won’t restore it if you trade it delete it or get hacked but aren’t those the 3 ways to lose your items wtf valve",
            "fell for Gambling Site Scam lost 5 keys. never again >:(((",
            "It's crazy because I got scam number 2, a long time ago, got some of my items stolen and he actually did manage to community ban my account somehow, but hey, managed to get his information and up address, the Out of shock fear he had when I told him I found his information, humored me",
            "Also, don't add steamates (Yeah, that's what I like to call them) who are just interested in trading or love sending links. 90% of the time they are scammers.",
            "RIP australium knife, got scammed with the second type on this list\n\nsecond time i got scammed, but the first one i was like 9? and it was some money in a random minecraft server i dont even remember which one, i just remember that all they said was \"give me your money\\[?\\] or i hack your pc\"",
            "I got the tournament scam once before. These guys even had a steam group with posts and everything. But I did not dare click on any links posted there. Needless to say I just blocked the dude cause there was no way I would not know of a TO that offered PRIZE MONEY to low tier teams xD",
            "I get these annoyingly often. I got an Aussie Tomislav a while back and ever since then it seems like once a week, a scammer makes an attempt. As soon as I see \"What class do you play in TF2?\", I send them goatse and block.",
            "OP IDK if you're still monitoring this but this is one I've seen a lot the past few weeks that might be worth adding to the thread:\n\n-Scammer peruses Steam Community Market for high-value listings\n\n-Scammer adds someone who has a high-value listing and says they want to buy something to resell it and don't want to wait out the 7-day trade hold, can they buy it for paypal or another 3rd-party cash payment method\n\n-Scammer, despite fashioning themself a high  rolling trader/reseller, will be mysteriously unable to trade keys or items for the item, only cash, and not SCM because they \"want to resell as soon as possible\"\n\nIn case it's not obvious, the 7-day trade hold on Community Market is to prevent payment fraud.  The scammer is trying to dodge the 7-day hold specifically so they can commit payment fraud, by revoking payment through paypal or whatever after they have your item.  If you say no initially, they will offer \"to go first\" which doesn't matter at all; if they pay you through paypal first then you trade them your item, they will still be able to revoke the paypal payment.\n\nI know this is an iteration on one of the oldest scams out there and is even addressed directly by steam with their \"is this a gift?\" trade warning, but I've seen it tranding a lot lately so figure it would be good to put out there in case anyone doesn't know that paypal fraud and card fraud are super easy to commit.",
            "I'm sorry that i put My comment here but i coulnd find the info to this \nHow can You a pose and hold a gun at the same time IN this Game?",
            "Today There was new one\n\nShortly a guy cotacted me and sent me a link to fake tf2 gamble website and asked me to put it to my description so they will pay me in tf2 items for advertising their site.\n\nSo they will either wait for me to enter my contacts to their site or scam me while \"paying\" for me to advertising their website",
            "steam gift cards that lead to communityz site",
            "Same I encountered multiple of these. Last time my friend got hijacked, I didn't knew about it so his hijacked account gave me the Tournament scam and thus got my account hijacked but luckily I was able to recover it.",
            "i just got the manncostore one and oh my god the guy didn't even bother creating a fake bot account. so pathetic",
            "i encountered number 3 today the scammer tried to drop my guard by asking me about my day i shut that shit down immediately i didn't even respond after they gave me their pitch just immediate block and unfriend",
            "can someone gift me a key or a premium status plz",
            "Also too \n\nSometimes they'll link you to ***\"steam gift cards\"*** which is absolute nonsense\n\nIt IS possible to gift cards to your buds but not through a simple steam DM",
            "yeah...",
            "that sub apparently got banned",
            "Imagine answering \"I main Hoovy\" and still getting the message, this is hilarious.",
            "I've felt that I am pretty decent, but I still didn't trust the tournament thing since I haven't played in a while and there was no logic as to where and why they reached out to me from. A quick google search found this thread, I'm not surprised. given the value of my bp I don't trust anyone.",
            "2fort is fun. So... I like it.",
            "2fort when the match is non-ending and most of them are trolls",
            "🆒",
            ":)\n\nJust thought I'd post an updated version with section 4 about Mannco.store scams since I see them pretty often",
            "There are \"trustworthy\" gambling sites in the sense that they do pay out what they promise and have verifiable RNG and probability distributions. However they have a rampant scammed money / items laundering problem, and perform predatory practices to lure children in.",
            "That's sort of covered in scam #4, where a trader will ask you to \"verify\" your items or deposit them through a fake mannco.store bot. There are a few different scam methods associated with mannco.store, but a lot of them revolve around phony trade offers involving people posing as representatives of the site.",
            "Heh welcome to the club. I just had someone posing as a steam admin drain my account of anything of value and block me. Kinda just wanted somewhere to vent so ye.",
            "I just got this scam, thankfully needing extra codes for 2FA tripped me up before I could go through with it. You say it is obvious but...it wasn't obvious to me at all. The website looked and was written to a professional grade - I first thought it was too good for a scam!",
            "Just got this exact one. Even though I'm a 3D creator and play TF2 regularly, it still looked fishy. Checked their account and the profile was from China, had barely anything in it. Reported immediately.",
            "Yes they are listing fake TF2 tournaments on their site. Clicking on them will prompt you to log into your steam account. They have a match.tf banner at the top of their site, but the site itself is not associated with match.tf. In fact, the [real match.tf site](https://match.tf/) has shut down and has a warning about scammers using their name. Interestingly enough, they have links to real TF2 leagues like RGL and ETF2L, but the rest of the site is fake and is only there to steal your info.",
            "I'm not seeing the full link because it redirects me to \n\nhttps://marketplace.tf/?gad_source=1\n\nWhich brings me to the main marketplace.tf page",
            "The fuck, is this a bot account",
            "Yes it was maxed out. (It was a gift) :(",
            "The last section gives you some pointers on what you should do if you accidentally log into a phishing website.",
            "That's just scam #3",
            "I believe they contact you based on the value of your backpack. They might search through the backpacks of players they've recently played with, since that can be found publicly.",
            "I thought it was funny that the example was \"McCree! He's really fun!\" I mean, to be honest an Overwatch character would probably be broken in tf2, what with their abilities and such, but it would still be a problem to be playing an Overwatch character in tf2.",
            "i answered \"i main spycrab\"",
            "Fun as a casual experience in a community server. But not so much if it's casual in casual and the contract is at stake.",
            "Some will also try through Steam trading. Had one who was interested in an unusual but wanted to use a Third party. Thankfully Steam itself says they never do this.",
            "yea the websites look real. but seriously? go tap one button and you get free keys? nah",
            "yep, i saw a steam notif that said someone in russia logged in to my account (im not from russia) and i changed my password right after. thanks for your confirmation",
            "is that link trustworthy? can i buy stuff there?",
            "Nah bastion would be 100% balanced in tf2 /s",
            "Yes, marketplace.tf is a trusted site. But it only takes cash and not TF2 items.",
            "I mean yeah he's the pinnacle of balance in OW2, how could he be OP in a different game?\n(If you can't tell I hate Bastion and his unique cooldowns which have the distinct ability to not let the enemy team have fun)",
            "My friend who actually plays OW2 actually preferred when bastion was gone lmao",
            "OW1 bastion at least had some counterplay. This OW2 bastion can die.",
            "I also actually play OW2, and I would prefer if Bastion went away again.",
            "Tried overwatch after not playing for years and yes bastion is still annoying despite all his changes",
            "Tried it for a few weeks and never liked him whatsoever throughout all of that. Cool character but he just isnt fun to play as or against"
        ]
    },
    "Me watching r/tf2 give bot hosters attention and fanart:": {
        "title": "Me watching r/tf2 give bot hosters attention and fanart:",
        "score": 1971,
        "url": "https://i.redd.it/bdylaa3a818d1.jpeg",
        "content": "",
        "num_comments": 110,
        "comments": [
            "\"TF2 community creates horny cult for a bot hoster's OC out of spite\" was absolutely not on my #SaveTF2 bingo card.",
            "Honestly seeing tf2 dying in a gay porn fueled schizo fit of rage is kinda funny, compared to other live service games shutting down and slowly fading away anyways.",
            "They literally will never go away because they are endlessly fed more attention by actual children.",
            "r/tf2 try not to be fucking morons challenge (impossible)",
            "The bot hoster themselve has commissioned Nsfw art of their bots, now tf2 people are doing it for free.",
            "People are only feeding attention to actual criminals what was even the point of this lmfao",
            "most of the people who are involved with it or upvoted it are just tired of the movement i'm ngl\n\nit's just becoming a bunch of nothing anyways",
            "I refuse to believe people can actually be so stupid, hopefully they at least got paid lol.",
            "I'd like to think of it more as hate art, you think they want to be associated with having smexual intercourse with the tf2 mercs?",
            "My guess redditors have some fucked up Stockholm syndrome",
            "There's literally no point and impossible to ignore Omegatronic's existence at this point. Even before this gay porn movement, Omegatronic and other bot hosters will still host bots no matter what since they're still making the game unplayable.\n\nAlso, tf2 fans when they notice people actually trying to do something different with the gay porn meme instead of reposting the same exact 5 images: 😡😡😡🤬😡🤬😡🤬😡🤬😡",
            "i think it’s because we’re starting to run out of ideas",
            "Is the strategy to keep bot hoster's right hands busy so the left might accidentally click the \"delete all bots\" button?",
            "Bot hosters: plague the game for the sake of attention\n\nr/tf2 retards: lets give bot hoster some attention ! Yay ! Le random so strange !",
            "Yeah like this is one of the things I don’t think will work against them cuz I mean didn’t they already post CP links in chats recently? If so this is the least of their worries",
            "At this point I think the fandom is desperate enough that if you say any shit with enough confidence people here will take it and run.\n\nSucks because things like this have been and are just gonna cover actual solutions.",
            "make it gay so they get arrested because lgbtq is illegal in russia",
            "\"does she know how to make a grilled cheese\" ahh pic💀",
            "Other games die in silence and a flatlining player count, TF2 dies in gay furry porn about bot hosters.",
            "I swear some people here are incredibly stupid, they couldn't achieve the BIG goal (which is getting rid of the bots and cheaters), so they start looking for / creating those small \"goals\", to convince themselves that they've done something great for the game and pat themselves on the back",
            "i swear nobody on this website has any semblance of critical thinking skills",
            "the thing is, some of these are paired with \"gay putin\" so there's a fair shot that it gets omegatronic jailed since they're stationed over there",
            "\"You're just giving them what they want!\"\n\nMy brother in Gaben, we've been ignoring their existence for the past 3-5 years, did it do anything? No, bot hosters WILL host bots anyway. \n\nThis is NOT an internet rage bait troll situation. We're not feeding them attention, we're bringing up the fact that bot hosters do exist and actively try to ruin the game and we have to do something about it. While the gay porn won't do much to stop Omegatronic and Co, it still might be demoralizing for the creator and gives him the reputation of the dude who's avatar was banged by oily men and not as the genius mastermind who destroyed tf2. Omegatronic DOES want attention, but we're giving him the kind of attention he doesn't want (unless he's as messed up as the art suggests)",
            "Does she know how to make a grilled cheese?",
            "So do they even hate that kind of art? What if they enjoy it? Even if they hate it they can just say they don't, what's the point of all this? Is anyone actually going through with it?",
            "Gay porn is everywhere now",
            "I want to go to r/tf for dunbny gameplay, tips and not gay  furry porn.",
            "What pure desperation looks like, I guess. But seriously, attention is ALL they want.",
            "They are already posting links and supporting child porn, I don't think a half-assed gay fanart made in paint gonna make there reputation mutch wurst. Bad publicity is still publicity",
            "It’s just like Hotline Miami…",
            "yeah literally all these bot hosters want is attention, literally all you're doing is giving them exactly what they want",
            "If there’s femboy porn I wont complain",
            "ngl, TF2 community is slowly making me lose the very little cares I had for the fixtf2 movement",
            "So why did yall start drawing porn of bothosters?",
            "the dude who suggested this is goona be zhorkin’ it for the next two lifetimes 💀💀💀",
            "I mean drawing them with a ton of disgusting fetishes might work but \n\n1. We aren’t even doing that and just drawing the computer guys slightly zesty\n\n2. The bot hosters might be into them",
            "bro blink if you're trapped in a hypocritical groundhog's day time loop",
            "Is it me or is it starting to become the point that we should let the bot hosters win?",
            "u/pixel-counter-bot",
            "bro I've only seen one drawing of Omegatronic in a maid outfit so I think its another case of redditors making a mountain out of a molehill and making more posts complaining about a trend of posts than there are actual posts of said trend.",
            "Tf2’s going out with a bang",
            "tf2 is gonna die anyway\n\nWhy not die in absolute madness and chaos lmao",
            "i think it's funny so I'm all for it",
            "it's really an act of defamation we're trying to do. trying to get it so that when you look up omegatronic, you dont get his shitty bot services, but instead a bunch of robot sex. it's more an act of mass trolling.",
            "💀 Bots are staying whatever the fuck we do\n\n\"Don't give them attention\" \"Don't feed the troll\" Shut the fuck up",
            "They are doing a whole lot more than valve did tho. It's also really entertaining and funny lol.",
            "GAY PORN FANART BOZO",
            "I've heard some people say Omegaymatronic is based in Russia, which isn't exactly the most tolerant place for LGBTQ+ stuff. So maybe that'd get him consequences? Idk, trying to apply a method to the madness is like trying to get someone on bathsalts to sit still",
            "By spamming their DMS with gay porn of their own character, they’ll be extremely disgusted, therefore they’ll eventually get sick of it and stop.\n\nThe alternative is sending some anonymous false tips to the FBI, we just gotta tell them that they created the cure for cancer",
            "But it's not any ordinary fanart, IT'S GAY R34!",
            "Terrible bingo card making skills",
            "r/brandnewsentence",
            "You know this might be the absolute best way to accept it's fate. Thank you for the laugh",
            "Going out the way we lived, I’d drink to that",
            "it's not really dying, com servers will still be there",
            "It's crazy how many of you on here don't even play the game.",
            "definitely a TF2 way to go out",
            "Goin out in a explosion of cum and robot parts",
            "They won't go away, even if we did ignore them. They still know that they're ruining games for other people and making them mad, even if no one's pointing it out.",
            "r/tf2 when they notice any ounce of fun:",
            "proof??",
            "To goof off.",
            "there’s so much annoying ass infighting between these creatures",
            "considering what bots have been doing lately, yeah",
            "they already have fetish porn with their characters, you don't out-degen the degens",
            "They crave attention, no matter what form it takes. I'm all for bringing attention to the bot crisis if it will get valve involved, but this does nothing except give the bot hosters the attention they crave. It saddens me that they are so mentally fucked up that they crave negative attention, but that’s just how they are. Probably stems from parental issues.",
            "The bot hosters want any attention, even negative attention, spending hours drawing their robots characters getting dicked down is still attention",
            "no matter what we do, no matter how much we try to ignore it, there will ALWAYS be someone in the community who will keep saying this like \"bot hoster virgin lmao\" thinking they are actually contributing to get rid of them\n\nalso the people who say \"you are just giving them what they want\" brother you have been \"ignoring\" them for 5 years NOTHING has changed, might as well just join them, this way omega will no longer be associated with \"evil bot hoster mastermind\" but breedable femboy, this time we will use the tf2 community's greatest ally, gay porn",
            "I don't think that's how that law works",
            "You heard it here first folks. Local r/tf2 usual equates being into gay porn as being messed up.\n\nLeast contrived moral justification for doing bullshit:",
            "What are you on",
            "The image in this post has 256,512(512×501) pixels!\n\n^(I am a bot. This action was performed automatically.)",
            "also if i inject enough of my weird fetishes people might get grossed out so i see that as a win",
            "you have the wrong organization for suppressing the cure for cancer",
            "Stop? Why? Because some fictional drawings are up their ass? Wooo look at me I'm gay porn robot👻👻👻👻 I'll bust a nut on ur computer if you don't stop woooo👻👻👻👻\n\nNo wonder why FixTF2 fell off. I got downvoted so many times after I said y'all's ideas are shit as hell and now this subreddit is doing gay porn art for a \"proper send-off\"💀",
            "But you (Demonman) drink Anyway!",
            "How can we? Casual is unplayable, and I can only have fun in 24-hour 2fort for so long. Yes, Uncletopia exists, but i hate the climate there.",
            "And now after another attempt to \"fix\" the game they get to be in the news while Valve continues to do nothing ;)",
            "Except if people just stopped playing tf2 they would go away",
            "my brother in Christ what \"fUn\" LMFAO. This is NOTHING but one of y'all's goofy ass coping mechanism knowing damn well FixTF2 will never achieve shit unless y'all actually do something effective.\n\nThis fanbase doing Omegatronic gay porn is just copium overdose symptom. Be fucking fr😭😭😭😭",
            "there's even tftubers with petty drama shit still going on, who's gonna stop us from infighting",
            "True, well in all honesty, I get your point. But at the end of the day at least this is a way that a lot of people can contribute.",
            "What about Vladimir Putin?",
            "We're also trying to make it gay / homosexual, plus antirussian. There have been cases where if someone gets popular and associated with gay shit, they get heavy sentences because russia is a hellscape, and unsuprisingly where the bot hosters are from.",
            "idrk russian law seems to absolutely hate that concept, who's to say",
            "Oh don’t get me wrong, it’s a horrible idea and I don’t endorse it, I just find it funny",
            "Skial has some really good casual servers that are usually active if you want a less sweaty environment than uncletopia",
            "The fact that tf2 fans would actually keep this gimmick going on for long enough to make it to the news would actually be kinda impressive.",
            "Nobody's going to stop playing tf2 just so a couple of people would stop ruining it.",
            "If we just walk away and let TF2 die, the bot hosters will have accomplished exactly what they were trying to do for the last few years. Single-handedly forcing the end of TF2 will make them feel unstoppable, and *that* will cause them to move all their resources into attempting to destroy another game in the same way; probably CS2, which is also a free-to-play VAC game but significantly more popular.",
            "What about him?",
            "Chat can we get a source (I’m curious)",
            "Any sort of, \"investigations,\" will easily point that the sad bastard isn't behind those images, yet I will imagine Russian Authorities have *better* things to do than to investigate silly cartoon porn that does the gay to Putin.\n\nI guess you can hope Russian Authorities will just skip the investigation, yet again; that's assuming if they'll even care enough to do anything.\n\nPerhaps a line too far there to see Putin getting railed, but I doubt it will amount to the dude going straight to gulag because of outside forces posting porn on western-centric websites they can't do anything about.",
            "The answer to if they would want to be associated with having smexual intercourse with the tf2 mercs was yes, so what about smexual intercourse with Vladimir Putin? I read someone in a reply suggesting that this art include Putin, because of Omegatronics potential Russian nationality",
            "I’m pretty sure omegatronic is based in Russia, so the goal is to associate him with gay porn, and to bring more attention and drama, add Putin in. LGBT+ stuff is illegal in russia",
            "There's a thread somewhere in this subreddit with all this scheming\n\nyou can also find the subreddit at r/OmegatronicNSFW",
            "Now you're thinking outside the box",
            "+ any LGBTQ+ related stuff can get you jailed in russia, so we can probably even get the dude behind bars somehow",
            "This sub gets a new post every 5 minutes, gotta be more specific than “somewhere”",
            "Here's a sneak peek of /r/OmegatronicNSFW **[NSFW]** using the [top posts](https://np.reddit.com/r/OmegatronicNSFW/top/?sort=top&t=all) of all time!\n\n\\#1: [It has begun.](https://i.redd.it/kpop42hpuz7d1.png) | [8 comments](https://np.reddit.com/r/OmegatronicNSFW/comments/1dlfcl2/it_has_begun/)  \n\\#2: [I'm the guy who made the comment. Here is my contribution.](https://i.redd.it/nznz98xl008d1.png) | [6 comments](https://np.reddit.com/r/OmegatronicNSFW/comments/1dlg3dz/im_the_guy_who_made_the_comment_here_is_my/)  \n\\#3: [The post](https://i.redd.it/kacxwtw0iz7d1.jpeg) | [14 comments](https://np.reddit.com/r/OmegatronicNSFW/comments/1dldpvz/the_post/)\n\n----\n^^I'm ^^a ^^bot, ^^beep ^^boop ^^| ^^Downvote ^^to ^^remove ^^| ^^[Contact](https://www.reddit.com/message/compose/?to=sneakpeekbot) ^^| ^^[Info](https://np.reddit.com/r/sneakpeekbot/) ^^| ^^[Opt-out](https://np.reddit.com/r/sneakpeekbot/comments/o8wk1r/blacklist_ix/) ^^| ^^[GitHub](https://github.com/ghnr/sneakpeekbot)",
            "untrue, as a comment from a russian guy explained in another post they don't enforce that law, they only do of you go in the streets and \"spread propaganda\", but no one cares what you do online. Don't be delusional.",
            "Yep",
            "Dude I neither have the time nor the effort (that's a lie I have so much free time) to dig through the posts and shite, Maybe ill give it a shot, is there a way to read view history?",
            "Yes there is, it’s just called history in the settings (at least for mobile)",
            "Well not settings but that side bar"
        ]
    },
    "why are we drawing porn of the omegatronic": {
        "title": "why are we drawing porn of the omegatronic",
        "score": 319,
        "url": "https://i.redd.it/hhbublnv938d1.jpeg",
        "content": "",
        "num_comments": 45,
        "comments": [
            "Apparently the guys that spam porn links with bots are meant to be intimidated by porn. Disregard the trolls behind the curtain, this is by no means a thinly veiled excuse to shit up the board and piss off everybody else.",
            "I think we all just goes crazy with every degree closer to our own body's temperature and more desperate with every day without any answer to our protest. We locked ourselves in this bubble of hate, hope and misery revolving around one game that older than some of us and dropped the key into a pitch black void. We looked into eyes of madness and blinked by itself just because we thought that the only vision that can find a solution. But it just shows our selves trapped in this inescapable situation but from outside perspective. And it's view makes us vomit an eyeballs from ears because bubble itself just reflecting the void from an inside. There no hope. No hate. No misery. Horror. *horror...*",
            "Yeah, i somewhat understand why porn of the omegatronics would be kinda funny. But by no means will this do ANYTHING to stop the bot crisis. \n\nFor one: they 100% dont identify with the robot icons. \n\nAnd secondly: Drawing porn of them seems more of a compliment than an insult.",
            "I think it is organized by an undercover bothoster\n\n#killBotHostersTF2",
            "Stockholm Syndrome",
            "I have no fucking clue man...I keep asking myself, how the fuck did this movement manage to go from asking Valve for an anticheat to making porn of fictional bots on a game.\n\nI think, and this is not hyperbole, that this is the most bat-shit insane, demented idea I have ever heard in my entire life, and I do not say shit like this kindly.",
            "i have no fucking idea",
            "Well, I'm seeing a lot of people doing it all wrong. I'm seeing stuff actually well-made solid art and having it be just that is doing nothing. It has to be weird, all of it. It has to be stuff that fills the bot hosters with disgust. That's how it becomes an effective war tactic. Internet wars are psychological wars, so that's the war we need to play. Regular porn is just regular porn. There's nothing much happening with that. So, take these words to heart and charge forward in the improved direction!",
            "Guy had an idea for us to draw so much of it to the point omega is known for that instead of bot hosting",
            "I don't know me to 😶",
            "Some one made a comment about it on here that we should",
            "Mf is asking the real questions",
            "I dont know man, the bot hosters likes gay porn so i dont know how this would affect them",
            "Is this how bored we are fellas?",
            "To make them mad, the guy is Russian and is most likely strongly against it.",
            "At this point I'm pretty sure that the guy who tried to turn ctf_turbine into an asylum for all the dumb shit this subreddit has come up with must have given up or gone insane or something",
            "i feel partly responsible considering ive been on their twitter askin to smash their ocs for like...a month now",
            "Porn good.",
            "Fight fire with worse fire.",
            "Real, I want my upvote back from the posts that started and spread the idea but they're all locked so I can't rescind it.",
            "to scare omegatronic into shuting down those bots by spaming the dms",
            "7 years and no update makes Jack a dull boy.",
            "Reject the Omegatronics.\n\nReturn to Medic porn.",
            "The hosters ARE minors this is just fucked up",
            "Trolling",
            "Revenge son",
            "Idk but i jerk off to it.",
            "He can get in trouble if everything he is associated with in google is porn, bc he is in russia",
            "elite war tactics",
            "The sanity of the average TF2 has reached new lows to the point that they employ gay furry porn as a last resort",
            "Because fuck them, literally.",
            "because we're horny 24/7",
            "we’ve BEEN drawing porn.",
            "To make him Pay for disrespecting death of Rick May",
            "Here's the actual reason: think of it as nothing more than the death throes of a community that's still trying to ignore the reality of FixTF2 being an utter failure.",
            "The latest stage of FixTF2 is pedophilia, which is ironic considering the previous stage was complaining about fake CP links...",
            "Because valve isn't gonna do anything about their game. I mean— drawing someone nude isn't illegal. And why would we counteract their illegal activities with more illegal activities? I mean—that's kinda illegal. \n\nTL;DR: We don't wanna get in trouble with the law, but we also wanna annoy/harass the botters",
            "The hoster supposedly lives in Russia, so if their character is associated with LGBTQ or being anti Putin it could take them off the internet.",
            "omegatronic is a minor btw. idk why but it feels kinda wrong to draw porn of a minor's character",
            "To be fair, it's kinda funny. We are already screaming at Valve as high as we can raise our voice, why not have a funny side project with a inprobable but desirable outcome?",
            "So, do we draw g*re porn of them?",
            "Never stoop down to their level, they’ll beat you with experience",
            "That sounds like blatant misinformation, no one knows omegatronic's identity",
            "It’s not, it makes us look like immature disgusting brats. You have to remember that people don’t see intent, they see action. So what they see is TF2 fans drawing porn for no reason.",
            "Yeah the only thing we know for sure is he’s stationed in the us"
        ]
    },
    "this movement has become a joke": {
        "title": "this movement has become a joke",
        "score": 534,
        "url": "https://www.reddit.com/r/tf2/comments/1dloozl/this_movement_has_become_a_joke/",
        "content": "Everyone is either going along with the stupid omegatronic NSFW plan, making stupid suggestions, or doing other dumb shit, all while there has been no real progress on the movement since it’s been started. I hope y’all can agree this is just stupid now.",
        "num_comments": 130,
        "comments": [
            "I genuinely don't know what's going on in this community anymore",
            "The gay porn bit isn't really SaveTF2. SaveTF2 is just the review bombing and signing the petition. There's nothing else we CAN do aside from just waiting some more for Valve. The stuff with the robot is related due to the bot hosters but not part of the SaveTF2 movement, it's just a weird in-joke.",
            "I agree with you, we need to keep pushing movement and not get hung up on bot hosters.",
            "We practically lost already, omega is getting what they wanted from the start, attention. They could care less about this whole porn shit. All they care about is making people mad.",
            "I just want to play this silly game to relax.",
            "The omegatronic thing isn't supported or indulced by the movement \"hosters\" like, the what show, weezy etc. It's something that just happend out of no where in this sub because yes",
            "It started off strong and after like 4 days it pretty much died",
            "I like that the whole idea was to centralise the movement, so that the community would know what to do, but now they listen to some random guy suggesting drawing porn as a solution.\n\nTF2 is dead and we fucking killed it.",
            "MOAAAARRR SIGGGNATURESSSS LADSSSS AAAAUUUUUUEEEEEEHHHH!!!1!",
            "Always was lmao. It didn't work last time, so let's change the name and do it again!",
            "I mean, might as well have fun I guess? The real movement already happened. We kinda did what most of us realistically can.",
            "People want something to do. Someone suggests a funny idea that is remotely related, and the hive follows. But really, what else can you do? Petition is kind of stagnating at the moment. Maybe not in numbers of people who signed, but in its effect, Valve is still yet to do something. Either we seek other ways to influence Valve, or we stay right where the first savetf2 movement was.",
            "Omegratronic won, they destroyed you from the inside.",
            "Who could've seen this coming!?",
            "I'd rather have us having fun with stupid trends rather than loom and wait for valve's response ngl. The gay porn trend isn't even about saving tf2, it's just making porn of omegatronic. I'd be impressed if gay porn is what saves tf2 ngl",
            "and people called me a doomer when i predicted shit like this would happen",
            "This community is just a bunch of highschoolers throwing shit at the wall, hoping sometihng sticks and valve gets to do something. A \"protest\" was never going to do anything, and it didn't.",
            "FixTF2 isn't a joke yet. It got all over major news outlets. Everyone and their grandma knows about it. Call me insane all you want, but we're playing the long game. If valve doesn't acknowledge the petition and the press, sales for their games in the future are going to tank. They didn't make an anticheat for a 15 year old game, what are the odds they're ever going to make one for any game? Everyone is aware of this possibility. People won't spend money on something they know will just be a bothosters playground a year after the game releases.",
            "unfortunately i cant help but feel the movement was bound to die out after two weeks, whether valve responded or not...",
            "It’s been a day, let it run its course then people will stop.",
            "be careful, or they might call you a doomer",
            "Whaat? 12 year olds can't think of a good plan to save tf2? How is this possible :((((((((((",
            "im fucking ashamed to be apart of this community",
            "as i said, no one cares anymore, that's why this is happening, getting played by tftubers for money twice is just peak tf2 community",
            "The what plan?",
            "Always has been.",
            "This movement was a joke from the start. Didn't even get a tweet this time. This game is dead and valve wants it finished off in time for deadlock. I hear Overwatch is nicer these days",
            "Now we’re literally killing our own movement",
            "You say that like omegatronic NSFW is meant to save tf2 or help it. It's not its meant to be a inside joke and to point and laugh at omegatronic. Looking at the subreddit for omegatronic nsfw I saw a single thing with the save tf2 hashtag. It's not a plan it's a joke. Started by a single comment. Don't act like the movement itself went down the drain because people think making pornography staring robots is funny. Is it kinda dumb? Yes but getting annoyed over it and claiming it's ruining the movement is also kinda dumb.",
            "Alright dude pls enlighten us on what we are supposed to do since you appear to have the answer.",
            "if you have a better idea, then do it",
            "What's your plan, then?",
            "Man, I have been feeling pretty doom and gloom for a while. Especially after people where trying to say that cs2 is like tf2 after the cs2 community had a meltdown on only getting a tweet for their 25 anniversary. You might ask whats wrong with that? Well the cs2 community has known that an update is coming, but they got upset because it didn't come on the 25th anniversary. Meanwhile tf2 players would be literally jumping for joy if we got some of the news and updates that cs2 players got.\n\n(for context on what cs2 will be getting: it was found in the files a while ago that a comic is going to be added, a cs weapon case is in the works for the next major update, along side that 4 maps pretty much confirmed in the update with assets suggesting another map as well, key chains to be added to the game for more customization options for guns. that is on top of weekly or bi weekly updates to try and fix bugs and other complained about areas with the most recent patch fixing some of the networking issues people with high ping had. and last month an estimated 24,414 VAC bans were given. 2 months ago was also the biggest vac ban wave since 2019. Sources: https://www.youtube.com/watch?v=MfWACaZchYA, https://leetify.com/bans, https://www.pcgamesn.com/counter-strike-2/new-ban-wave)",
            "I mean bro what else do you expect us to do. We tried with votes and posts, all we can do is wait",
            "who would’ve thunk",
            "What do we even do to keep pressuring valve? What can we do? I got no idea.",
            "It was always a joke, they just finally gave up on attempting to be \"serious\".",
            "Well we seem to have gotten a portion of the cs2 community on board.",
            "Speaking **facts** brother",
            "Not true! This movement was a joke from the start.",
            "it was pretty much a joke from the start, it just became a bigger joke now.\n\nThe bot hosters got attention and TFtubers got their clout. Just like in the first iteration of the movement.",
            "I’ll be honest, over here in Asia the bots are barely an issue. While bot filled servers do happen they are honestly more of a rare occurrence than a common sight unlike the message presented by the people running #FixTF2. In fact I feel like the bot crisis is being exaggerated by the spearheads of the #FixTF2 movement, where cherry-picked examples of bots making the game unplayable are used and spread around to gain attention, whether it be for clout or ulterior motives. Valve should maintain their anti-cheat so that we don’t have to deal with bots and cheaters, but the issues in casual are nowhere close to being as bad as how people have presented them.",
            "It's been a joke since the start.\n\nThe entire movement revolved around Valve not owning a fucking paper shredder or a single garbage can.\n\nThe TF2bers behind this joke of a movement should be ashamed of themselves for starting this shit all for a few extra views. Same with everyone who participated. Vandalism. Review bombing other games. Harassing other communities. Bot NSFW. There's not a single thing they've done that hasn't been bad optics for TF2.",
            "Both the movement and tf2 are dead. Get off the game and touch grass.",
            "We all know who to blame: Shork",
            "got a better idea?",
            "For starters, they got bored. Folks these days have to have something to do while waiting for Valve to speak up about the 300K petition.",
            "What's going on is that this community has a median age of like 14 now for some reason",
            "The 98% of the community that are children have had their attention span run out.",
            "The TF2 community has been completely brainbroken and is now creating fanart of characters that advertise CP.\n\nI'm starting to think Valve was absolutely justified in abandoning this hellhole.",
            "We can send more police reports about the cp bots even if that doesn't end the bots either valve or the police would have to step in and arrest them",
            "Happy Cake Day!",
            "that's the point. You don't.",
            "Happy Cake Day!",
            "either we draw gay porn or we sit around and do nothing!!",
            "I agree. There's no way that somebody who wants this game to have a future would start a movement THIS stupid. How tf is gay porn supposed to make Bot Hosters stop. If anything, this makes the community look worse giving Valve a further reason not to support this game anymore...",
            "You and me both.",
            "\"highschoolers\" is being generous",
            "How did youtubers make money out of it?",
            "Did somebody give them money? I don't see that anywhere",
            "Fym what are we supposed to do? How about literally anything BUT drawing gay porn for a bot hoster lmfao jesus christ",
            "Keep the hashtag up.",
            "yay you changed your profile picture back",
            "Sorry, but as a european player, the bot crisis is very much real and greatly reduces my ability to play normal matches on the official servers.",
            "I can not find a game that has no bots most of the days, 99% of the play time is server hopping.\n\nThere is a real problem, get the weird youtuber theories  out of here.",
            "The review bombing I can get behind, because let's face it, TF2 right now is not nearly in a playable state (well, the playability seems to be server-region dependent. I can tell from experience that the problem is present, but not as prominent, in Central Europe at least), and the negative reviews help make that abundantly clear to anyone wanting to pick the game up.\n\n\nBut bot porn? What in the actual fuck? Whose sick, demented mind shat this idea out, and then DECIDED TO GO THROUGH WITH IT?! And the TF2bers that created the movement seem to be completely gone for some reason, instead of putting a nail in the coffin of this God-forsaken idea.",
            "Agreed, if youre going to complain shout out your own ideas then please.",
            "yeah let’s draw gabe newell sucking off osama bin laden because he’s just as bad as this terrorist scum!!",
            "That is assuming valve will even look at that petition, let alone speak about it",
            "You're speaking like that wasn't the case for the past 10 years",
            "That's nothing new",
            "Even if a report is done to the FBI, what are they supposed to do about *Russian* hackers? And I doubt the Russian government would care about what goes on in a foreign-produced game.",
            "But they arent sending cp links, they are sending discord links, all of which dont contain said cp as claimed. If they did, they wouldve been nuked ages ago.",
            "Thank you!",
            "AAAAAAAAUUUUUUEEEEEGGHHHHHHHHHH!!!!",
            "Its irony poisoning. the same thing that causes them to go into a blind rage when seeing something like Mimi Sentry",
            "It was just a joke that went out of control.",
            "make trending topic, get tons of views, get a slight increase in revenue for the month\n\nnot really a conspiracy theory, just what Happens",
            "Post about trending topic = ez clicks. It's like, half of all YouTubers' business model.\n\nBonus points for literally igniting the spark that made the topic trend in the first place.\n\nEdit: Fun fact: The TF2bers you're fighting tooth and nail for don't care about you. They don't even know you exist. You're nothing to them but numbers.",
            "Money primarily comes from the videos they made - it's not necessarily a ton, but it's not little as well.\n\nI'm of the (possibly misguided) idea that the efforts of the various TF2bers that organized and spearheaded the movement were genuine at first, but their lack of subsequent updates or regulation - for a lack of a better word - of the movement makes me think that they were more in it for the money than I myself like to admit.",
            "As a european player I have barely any issues with bots, like yeah there is one or two but thay get kicked quickly and the game continues as normal",
            "as an european player, just leave the fucking match and requeue",
            "As someone from the Mediterranean, yeah the bot problem is not nearly as bad in Capture The Flag as in other places i've seen, but it's insane in Payload.",
            ">The review bombing I can get behind,\n\nThat's on me. I meant review bombing *other* games. I've added that now.\n\n>the TF2bers that created the movement seem to be completely gone for some reason\n\nThey're so popular that they just have to shut up for a while and people will forget they ever started this shit. They benefit from the added attention while everyone else suffers.",
            "why would they? their other 2 games have 7x that amount of players daily",
            "More like 16 years",
            "Even if the Russian government doesn't do anything a game being filled with cp as low as months old promoting cheaters is probably the worst possible look for valve they'd hopefully atleast do something",
            "The FBI doesnt just investigate stuff in the US.",
            "This whole community's a joke, let's be honest here.",
            "That isn't a scam tho. Also most of the videos actually are pretty informative",
            "I mean its still a serious issue regarding the game, I am glad I saw those videos. Talking about it as if those youtubers were scammers or something is kinda a pathetic black pill in my opinion",
            "Try playing in the evening/nightly hours. Shit gets unplayable after 9PM, and the longer you go the worse it gets as players start hopping off. Every other match it's either a bunch of bots or cheaters, and at this point I'm not sure which are worse.",
            "German player here, the last time I played was some months ago. It was really a 50/50 scenario for me. Every second or third game was either a huge amount of bots (kick one and one more bot joins) or it was an alright round with some bots.\n\nBut of the about 20 rounds or so I played, I only had like one or two rounds with no bots.",
            "Good for you.",
            "TF2 is unplayable in the morning wtf do you mean?",
            "Oh, that's fair. Yeah, review bombing other games is kinda shitty (well, I hear most Valve games have bot or cheater problems, but if they want their games fixed, it's them who have to do something about it. We cannot interfere in the matters of other communities).\n\n\nAbout the creators...yeah, probably that. I'm of the idea that the movement was genuine at the start, but then they noticed it didn't work and just left without a word. But that's just my opinion.\n\n\nP.S: I don't see why both of our other comments are getting downvoted. At the start, this movement at least united the community against a greater foe and, as I said previously, felt genuine.\n\n\nNow it has devolved into bot porn...I don't think I need to say anything else on the matter.",
            "Actually 10x (Dota 2) and 20x for CS2. It's why #FixTF2 people said over and over again to rub Valve's nose in the fact that they let their game get this way, because the amount of money they're making from us is negligible and the PR hit is the only way this works. The REAL problem is that CS2 ALSO has a rampant cheating problem, and if they're going to spend months-years working on a solution to a cheating problem, it's going to be for that game.",
            "> they'd hopefully atleast do something\n\nWe're thinking they'll suddenly put effort and resources into tackling the bot problem as a whole.\n\nThe easiest actual fix for this is disabling ALL text chat in Casual. Sure it has a catastrophic effect on the gameplay experience for real players, but it 100% solves the issue, gets the problem out of the headlines (if ever it's reported that far) and requires minimal effort. Seems pretty attractive...\n\nIf I went back to pre-bot crisis and said Valve would remove text chat from F2Ps I'd be labelled insane. Heck I'd do the same for anyone making that claim. There is *absolutely no circumstance* they would do that, yet here we are.\n\nI can see the end state of TF2 being totally locked down like that. On Casual anyway.",
            "Yeah and that something is shutting the game down. TF2 isn't valuable enough to risk their image and PR on something as serious as CP. They'll shut the game servers down, keep the item servers up so the economy doesn't go belly-up. Not that they give a shit about TF2's economy, they'd do it so that they don't scare Dota 2 or CS2's economy with fear of eventually losing all their skins.",
            "I'm aware, I'm just unsure if this would warrant starting an ivnestigation in russia.",
            "More like amalgamation of many-many jokes no matter of their initial quality and annoyance. This one goes to weird one category.",
            "They *are* scammers. \n\nAnyone who genuinely believed Valve was going to throw in the towel because of a few signatures on a stack of papers is stupid. And I'm done saying that nicely.\n\nIf there's one thing YouTubers aren't, it's stupid. You can't be successful on the platform if you're stupid.",
            ">I hear most Valve games have bot or cheater problems\n\nL4D2 doesn't, but I can't speak for any others.\n\n>I'm of the idea that the movement was genuine at the start\n\nI think they didn't expect it to blow up like this. They had a stupid idea and wanted to put it out there, and then people jumped on the FixTF2 train faster than expected, which didn't give the TF2bers enough time to fully plan it out. Instead of manning up and telling people to chill, they let it play out so they'd get views while also fading into the background.\n\n>I don't see why both of our other comments are getting downvoted.\n\nMost FixTF2ers are literally children and they do *not* like free speech. It's their way or the highway. It's been like this since the start, and only gotten worse over time.",
            "You still didn't explain how does any of that makes them scammers. They made a video, you watched, perhaps you singned a petition... Like where is the scam?",
            "If you really feel scammed over a few tweets and videos, I really think you need to get your priorities in order",
            "Alright. Then what are we supposed to do pls tell us.",
            "Huh, I had heard that most L4D2 servers get ddoxxed or otherwise tampered with...then again, what I wrote is based on hear-say, not necessarily personal experience.\n\n\nI think you may be onto something with the creators thing...otherwise, they probably would've made semi-constant content - videos, community posts, so on - to update the community on the movement...then again, we cannot know for certain what their intentions were, so I'm not gonna delve on those too much.\n\n\nWhat my brain still cannot comprehend, tho, is how this effort to convince Valve to at least give us a half-working anti cheat turned into...making fanart sexualising fictional robots and robot hosters...fuck, what's sending me into a frenzy is that people are actually on board with this! THEY MADE A FUCKING SUBREDDIT FOR THIS! AND ONE OF THE NEW POSTS ON HERE SUGGEST TO PUT THAT FANART ON CONSCIENTIOUS OBJECTORS! How the fuck are people this brain-rotten? Fuck, they're no better than the bot hosters they're trying to combat - at least it turns out the CP links were either discord links or phishing sites, we're making ACTUAL PORNOGRAPHIC MATERIAL about FUCKING FICTIONAL TF2 BOTS.\n\n\nP.S: People can do whatever they want with their free time, mind you. But this situation is getting out of hand REAL fucking fast.",
            "Scammer, noun: a person who commits fraud or participates in a dishonest scheme. Scam, noun: a dishonest scheme; a fraud. \n\nThey claimed FixTF2 was an attempt to make Valve get rid of bots. In reality, it was just a hoax for views. The proof is as simple as the fact that they've been silent on all the bad shit FixTF2ers have been doing, and the fact that they haven't actually done anything to support the movement.",
            "I bet this guy’s answer would just be \"give up\" or something similar",
            "I'm [glad](https://www.reddit.com/r/tf2/comments/1dam6u8/i_think_fixtf2_is_misguided_heres_my_idea_for_an/?utm_source=share&utm_medium=web3x&utm_name=web3xcss&utm_term=1&utm_content=share_button) you [asked](https://www.reddit.com/r/tf2/comments/1dg8ypx/i_am_once_again_requesting_fixtf2ers_stop_what/?utm_source=share&utm_medium=web3x&utm_name=web3xcss&utm_term=1&utm_content=share_button)!",
            ">I had heard that most L4D2 servers get ddoxxed or otherwise tampered with\n\nA couple months back, there were server crashing issues, constantly at 999 ping and crashing. That's since been rectified afaict. \n\n>What my brain still cannot comprehend, tho, is how this effort to convince Valve to at least give us a half-working anti cheat turned into...making fanart sexualising fictional robots and robot hosters...\n\nApparently, this movement has been very beneficial to the pedophiles who want to expose minors to porn... I've been getting downvoted just for suggesting maybe that's a b*ad* thing...",
            "Man, get your meds",
            "[No](https://www.reddit.com/r/tf2/comments/1dam6u8/i_think_fixtf2_is_misguided_heres_my_idea_for_an/?utm_source=share&utm_medium=web3x&utm_name=web3xcss&utm_term=1&utm_content=share_button)[pe](https://www.reddit.com/r/tf2/comments/1dg8ypx/i_am_once_again_requesting_fixtf2ers_stop_what/?utm_source=share&utm_medium=web3x&utm_name=web3xcss&utm_term=1&utm_content=share_button).",
            "ahahahah... no, you probably weren't playing the game during the pay2play era of tf2 before officialserver so let me break it down to you.:\n\n1. Ads before being able to choose a class, stupid html messages and chat being spammed with donation requests.\n2. Admins massive ego baning pretty much anyone they don't like.\n3. The game litteraly becoming a pay2play because of the privileges that giving money to the server owner gives you.\n4. Class restriction / random crits / random bullet spread, all of that being sometimes on sometimes off.\n5. TONS of unnecessary plugins and random bullshit that tanks tf2 performances\n6. Map rotation simply being the one that the server owner likes\n\nuncletopia is the exception not the rule, simply because it's ran by someone that actually doesn't have a massive ego and also haqss money to spare to open servers all around the globe and still he enforces a no random crit and no random bullet spread that i do not enjoy.\n\nBottom line, if you think valve doesn't care enough to put an anti cheat then i don't see how they would care enough to revamp the community server browser, and even then it would still be a shitshow.\n\nps/ calling tftubers scammers simply because they try to bring awarness to the problem, is a braindead take.",
            "That's right pal. Ask for proof and then go straight for the insults when the proof is provided. If you can't handle the truth, don't fucking ask for it.",
            "That’s actually a good solution and it’s clear you put effort and thought in it, you earned my respect and support",
            ">you probably weren't playing the game during the pay2play era of tf2 before officialserver\n\nInteresting. I could have sworn my Mercenary badge said 2010... Oops.\n\n>Ads before being able to choose a class, stupid html messages and chat being spammed with donation requests.\n\nSounds fine to me. Maybe not to the point of \"spam.\" But if there's a donation reminder every so often, and an ad when you join the server, so be it. That's the price you pay to keep Community alive.\n\n>Admins massive ego baning pretty much anyone they don't like.\n\nServers with bad admins won't last. People won't play them. That means no ad revenue. That means servers shut down. However, I totally agree that this could be an issue, and I'm going to make a note of that if I make (another) [revision ](https://www.reddit.com/r/tf2/comments/1dlt19f/clearing_up_my_alternate_idea_for_saving_tf2/?utm_source=share&utm_medium=web3x&utm_name=web3xcss&utm_term=1&utm_content=share_button)to my idea. Maybe some kind of rating system, like a Google Reviews or Yelp kind of thing for TF2 servers, visible from the improved Community browser or an external, official site.\n\n>The game litteraly becoming a pay2play because of the privileges that giving money to the server owner gives you.\n\nSame thing as the last one. Definitely agree with that being a potential problem. However, I'd like to know what you think of donator perks that are purely cosmetic, such as chat text colors, prefixes in chat, chat name colors, etc.\n\n>Class restriction / random crits / random bullet spread, all of that being sometimes on sometimes off.\n\nThat would be part of the tag system I mentioned in my original post. Search by RBS/RC on/off, for example. Maybe call that genre \"Uncletopia-like.\"\n\n>TONS of unnecessary plugins and random bullshit that tanks tf2 performances\n\nI personally never experienced this, so I can't say much about it.\n\n>Map rotation simply being the one that the server owner likes\n\nMap rotation is something I simply don't know much about. I mean, obviously I know it involves what maps are/can be played on the server. But as for how to implement it into my idea, I don't know. Maybe a toggle for \"default map rotation\" or something...\n\n>Bottom line, if you think valve doesn't care enough to put an anti cheat then i don't see how they would care enough to revamp the community server browser\n\nMy idea revolves around Valve's apathy being related to \"treadmill work\" like the anticheat. If that's not why they don't care, then my idea falls apart. I'm just praying they'll jump at the chance to stop working on TF2 *and* keep making money ***and*** stop the bad PR.",
            "Your proof was youtubers making videos lol that's kind of what youtubers do. If I say a plumber is a scammer because he fixed my plumbing, it aint truth, its me talking bullshit",
            "Then please spread the word.\n\nLook at the mess FixTF2 has become. We have to promote alternatives."
        ]
    }
}