{
    "Very unusual home video footage of a clearly inebriated Elizabeth Taylor forcing Michael Jackson to have his very first Christmas": {
        "title": "Very unusual home video footage of a clearly inebriated Elizabeth Taylor forcing Michael Jackson to have his very first Christmas",
        "score": 2286,
        "url": "https://v.redd.it/q139j8pjpy7d1",
        "content": "",
        "num_comments": 196,
        "comments": [
            "“I’m not easy to wake up”… we know why…",
            "The unnerving electronic Christmas music coming from various toys and decor serves more than an appropriate soundtrack for the people involved and the viewers of this video.",
            "This video is all kinds of fucked up",
            "I still remember an interview with Liz Taylor back then when she said MJ was the most normal person she knew. I wondered who the fuck she hangs out with.",
            "Drank her Xmas breakfast",
            "The music box noise is creepy as fuck",
            "This feels like a fever dream",
            "The statues of kids holding hands over the entrance to his bedroom doesn’t seem weird at all.",
            "The background music is straight out of a horror film. And that last line of the video, ffs. Good editing.",
            "Those last 5 seconds of the video get a little bit ominous.",
            "The tragedy of celebrity is so evident. \n\nMJ missing out on what should have been normal childhood experiences. Even if you don’t celebrate a certain way, you would see the way friends and neighbours live.\n\nAnd, ET is so beautiful without makeup. So many women are, but are so used to the mask or don’t feel “complete” without it. Such a tragedy and judgement on society.",
            "what a nightmare",
            "I feel some kind of sick seeing this ",
            "Why are all home videos from the super rich so fucking Cronenberg-ish? 😦",
            "As far as I know, Elizabeth was only able to maintain a relationship with Michael & one of her exes. Both men spent as much time away from her as possible. There's a reason in her later years her ex was only willing to meet with her at a restaurant. She was an unpredictable, overbearing, extremely emotionally needy, the unhealthiest type of spontaneous, & entirely self-centered. This relationship with Michael was so incredibly toxic. A fantasy world for both of them; filled with manufactured love they couldn't get anywhere else because that kind of life theater is insane.",
            "Dude got more super soakers in one christmas than I did my entire life.",
            "This is one of the saddest things I’ve ever seen. Jesus.",
            "Liz is giving off Ozzy vibes.",
            "The music is demented.",
            "The NASA Engineer who created the super soaker needs to see this shit.",
            "Just a secret mother and son enjoying time together while perfecting their disassociation from reality",
            "This could be a legit horror movie.",
            "\"I'm not easy to wake up\"....I mean....damn...",
            "Why do wealthy people have terrible taste?",
            "Pretty nice trip if you are drugged out of your mind.",
            "Do I get a star if I saw this on bunny ears in the early 90s?",
            "*\"I'm not easy to wake up...\"* \n\nHow's that for prophetic?",
            "This is like some kind of crazy ass fever dream, and I am uncomfortable.",
            "Such a shame he was forced to be a JW by his parents. He missed out on so many beautiful experiences because of it. I'm not even Christian and I feel bad for him. I wish he had the inner strength to escape, but sadly he never did.",
            "“I’m not easy to wake up” we know why now…",
            " Bro, I feel comfortable wearing my tinfoil hat here, that was strange. I like the upside down crosses and the statues outside his bedroom.",
            "Whomst ever added this music is dangerous",
            "is it me or does her earrings look like upside down crucifix?",
            "That was completely unnerving",
            "And that’s enough Internet for today",
            "This was awesome. Untainted footage. Yes. Real. Real Strange.",
            "Why is the music something out of a Christmas horror movie.",
            "“The two were best friends”",
            "Holy shit I just watched The Flintstones movie and that lady was easily the creepiest part of it all.",
            "She was probably on pills",
            "The further we get from his death the creepier he appears to me. \n\nCrazy that we just kept giving this pedophile money.",
            "This is sweet!  I don’t understand why OP thinks she’s drunk; she’s just trying to give her friend a fun time.",
            "How strange it must be for the rich to celebrate Christmas and birthdays. They have everything they could ever want.",
            "Think about how many drugs were coursing through them both.",
            "\"I'm not easy to wake up\"",
            "When Elizabeth Taylor passes out at Michael's place - *completely safe!*\n\nWhen a little boy passes out at Michael's place, however...",
            "Dear future historians: this is not Christmas.",
            "Eh fuck all of these people. This is a mockery of Christmas.",
            "TIL MJ was a JW",
            "The fuck did I just watch? Fuck it, I'm going back to rewatching the elephant stomp and eat a mans head video because that's less unnerving than whatever the fuck this is",
            "Oh Michael, tee hee...",
            "You guys it’s a super soaker!",
            "Liz rockin that 80’s hair",
            "honestly its weird as hell but michael was abused growing up, forced to be a performer, she may have overdone it but i like to believe its coming from love",
            "In addition to the abuse from the father MJ had to live with, him and his siblings also did not have celebrations or holidays.  The combination of the two is horrifically inhuman.",
            "All footage of Elizabeth Taylor is of a clearly inebriated Elizabeth Taylor.",
            "Later they had a water gun fight. Sadly Liz filled hers with gin. Drank most of it and burned Michaels eyes.",
            "Big Pharma approves this documentation.",
            "This is sad. He literally had to have other people become his family because his wasn't shit.",
            "She’s into Christmas and he’s into kids, clearly their lives were meant to intersect.",
            "His house was so dark inside 👀",
            "Drunk or not, she is more articulate than most people these days, ugh, umm, like, you know?",
            "What the actual fuck. I am 100% convinced he was a pedophile after seeing this video. The kid statues holding hands creating an archway for him to walkthrough. The way he was obsessed with “Super Soakers” and said he loved them so much because “if you come to Neverland you are bound to get wet”. I’m so disturbed.",
            "Does anyone find it strange that Michael Jackson is still generally publicly accepted even though he was a pedophile and molested kids?  No one else involved in sexual misconduct shared the same good fortune in the eyes of public opinion, yet his reputation wasn't irreparably destroyed.",
            "That Jackson is one creep",
            "I’m not sure how unusual this is, it struck me as quite sweet really.",
            "Very Charles Dickens A Christmas Carol vibes",
            "This might the most normal I have ever seen these two people be.  Take from that what you will.",
            "this shit just made ozzy look normal good god man",
            "I didn't know you liked to get wet",
            "Their faces plus the music plus the general awkwardness of MJ and the enthusiasm of Elizabeth Taylor makes me feel like after this video ended, she walked him into the dining room for his first Christmas lunch, and it was like a whole child trussed and roasted like a pig.",
            "Dude this video is creepy as hell for some reason.",
            "Was he asleep for a week?  \"She decorated the entire house!\"  Yep, a 61 year old tipsy woman decorated the house while you were asleep to surprise you.",
            "Christmas with a pedophile",
            "he was just a creep",
            "Smells like MK Ultra",
            "Had no idea that he was JW. That explains further why he was so strange.  Also, he was most likely a victim of pedophilia and why the allegations of him being a child abuser. Hurt people hurt people.",
            "Nothing insane about it. It's lovely and sad.",
            "If anyone would understand a stolen childhood and scrutinised life, it would be Elizabeth Taylor.\n\nThis is sweet of her to show him what the day is about for many.",
            "Just two adults doing their thing behind closed doors without violence or anything fucked up. Why judge?",
            "Seen it",
            "Wait till ya find out the truth behind Christmas. Crawl your way down that rabbit hole. Lol",
            "Michael let these Hollywood freaks (like Taylor) manipulate, control, and ultimately kill him. It's sad to see",
            "I know... so much of this footage was prescient...",
            "I came here to say the same!",
            "most of my knowledge of christmas comes from horror movies. is it supposed to be creepy as fuck?",
            "It sounds like glue sniffing in the 80s.",
            "Yeah, I picked the wrong time to watch this because it's freaking me out. The cacophony.",
            "I want to raid her medicine cabinet.",
            "Thank you good stranger, i was about to unmute.",
            "Makes me think of the Teddy Perkins episode in Atlanta.",
            "Search for Tara the Android",
            "Oh we are *all* viewers of this video now. Could be the best thing I’ve ever seen",
            "I'm high right now. Is this video even real? Is it ai?",
            "The video was removed. I’m about to be high, and really want to see it.",
            "C. Manson =)",
            "“…And a piece of toast.”",
            "I was half expecting their heads to turn as mj walked by",
            "Just be glad you didn't see what the kids in the bedroom were doing",
            "That freaked me out the most",
            "Holy shit I skipped to the end and it did not disappoint. What the actual fuck",
            "\"It's a rule...that you are bound. To. Get. Wet.\" He told the world to it's face and nobody listened.",
            "Bish you gonna get wet!",
            "He's one of the few people I feel is a genuine case for potentially being a pedophile but not a \"predator\" if that makes sense. He genuinely seemed mentally stuck as a child and the more you learn about him the more concrete his lack of mental development is. \n\nDude was so fucked up and surrounded by sycophants his whole life. The stories of his medical treatments over the years and cosmetic surgeries are so insane. Soon as the doctor ran out of money they'd be back to convince him he had some new issue. He was taking up to 40 xanax pills every night all the way back in 2005.",
            "I watched this without sound. Probably because I can’t hear well… \n\nThis video made me sad and happy. I’m sad because he never really had a Christmas… even the broke ass, poor as hell Christmas situations I grew up in. But, what I saw was genuine joy. I was sad because he never had it, but elated because he finally got it. \n\nI could never imagine walking a mile in his shoes… but I can feel the joy that he had in that moment.",
            "Agreed.  It was kinda nice to seem glimses of them being 'off'  Michael's voice change, genuine looks of delight.",
            "Agreed.  It was kinda nice to seem glimses of them being 'off'  Michael's voice change, genuine looks of delight.",
            "For real tho lmfaoooo I was watching this waiting for the head explosion",
            "I think their massive houses are kind of soulless - humans are happier in smaller, normal sized homes. And then the super rich are bored, and fill their giant homes with all sorts of shite making them strangely cluttered and discordant. Basically money can't buy taste.",
            "She lost her shit when Monty died.",
            "You get a star for getting your bunny ears to work at all",
            "I was raised a JW. \n\nI actually still am one, because leaving is… not easy. Unless you’re fine with losing everyone you’ve ever known. Then it’s easy. But I’m not fine with that.\n\nI’ve never celebrated Christmas. Halloween. Easter. Valentine’s Day. Thanksgiving. My birthday, or anyone’s birthday in fact. Father’s Day and Mother’s Day are off limits too. \n\nHomeschooled. Wasn’t allowed to play sports or hang out with the neighborhood kids, because they were “worldly”. JWs think everyone who isn’t a JW is “worldly” and a “bad influence” and “bad influences spoil useful habits”. \n\nIt’s was an… interesting childhood that has turned me into an… interesting person. I guess you could say.",
            "[deleted]",
            "Why?",
            "You like the statues of two kids making an arch with their hands knowing what Michael would do to kids in that bedroom?",
            "“Whomst”??",
            "Ongoing health problems produced an addiction to painkillers, they combined lethally with booze. And, living in Washington, married to a senator, she turned to liquor as an antidote to loneliness. During the 80s, she did two stints in the Betty Ford clinic, and briefly embraced AA.",
            "I don't really see it either.  Nor does it seem like she's forcing him.\n\nTitle is disingenuous.",
            "If you read the court documents he definitely was a predator. He had a lot of material known to be used to groom kids. There were kids pajamas found with blood in the crotch area. Its said he would spend months grooming the parents too (which is common in many pedo cases).\n\nHe had an alarm set up outside the bedroom in one of his properties when you walked through a set of doors, then a long corridor to another set of doors to enter the bedroom. It was do he'd have time to stop doing whatever he was doing before people got to the bedroom door.",
            "Nobody else accused of the things he was accused of has come remotely close in terms of enduring fame and popularity. There are millions and millions of people who simply refuse to accept the most obvious story is the most likely one, there are quite a lot in this thread as well.",
            "Allegations?\n\nIf you read the court documents he definitely was a predator. He had a lot of material known to be used to groom kids. And sooo much porn found with kids fingerprints as well as Michaels.\n\n There were kids pajamas found with blood in the crotch area. Its said he would spend months grooming the parents too (which is common in many pedo cases, so the parents feel safe letting their child sleep in a bed with a grown man).\n\nHe had an alarm set up outside the bedroom in one of his properties when you walked through a set of doors, then a long corridor to another set of doors to enter the bedroom. It was do he'd have time to stop doing whatever he was doing before people got to the bedroom door.",
            "If you think this video represents what christmas is about I feel sorry for your childhood.",
            "You’re as delusional as the two mega stars in this vid if you think anyone is off for judging MJ, or ET\n\nIf cringe were a person…it’d be one of these two.",
            "Or at least Santa and Reindeer piss.",
            "Sad to know what we know now. Wouldn’t have thought anything of it.",
            "Not remotely, but I guess it’s all perspective. If your first memories of Xmas has an association with horror movies, chances are you may always see it that way. Unless of course Liz Taylor came to decorate your house and your perspective either goes right or left…",
            "This…..this is not Christmas. This is certainly creepy as hell. I don’t think I wanted to know about this video and yet I couldn’t turn away. I’m repulsed and simultaneously feel sorry for everyone in this video. That’s some seriously disturbing, weird shit.",
            "If you do it right.",
            "MICHAEL STUFFING ALL THE KIDS UNDER THE BED BEFORE LIZ IS LET IN THE DOOR IS DISTURBING ENOUGH FOR ME.",
            "[Let's go to the old folks home!](https://www.youtube.com/watch?v=8Q0cp4b9pvg)",
            "As I said - appropriate.",
            "If AI stands for absolutely insane then yes, yes it is.",
            "No, it’s real, real creepy!",
            "I'm not high and I can't believe what I'm seeing",
            "I’m drunk from margaritas at dinner and I’m with you buddy. Can’t tell if this is real or if these margaritas were stronger than normal.",
            "Yeah it's real I remember seeing it in the late 90s maybe 95 idk but definitely before A.I",
            "Pretty wild how quickly you young pups just assume AI. Come on man.",
            "It's working for me right now.",
            "C Manson is waaaaaay less scary than M Jackson.",
            "Dead. I’m fucking dead.",
            "Totally can’t wait for this narrative to be kaput.",
            "who would make that association without context That's what they say to the people in the front rows of the blue man group too",
            "Alprazolam and Xanax are the same drug. Xanax is just a brand name.",
            "If you read the court documents he definitely was a predator. He had a lot of material known to be used to groom kids. There were kids pajamas found with blood in the crotch area. Its said he would spend months grooming the parents too (which is common in many pedo cases).\n\nHe had an alarm set up outside the bedroom in one of his properties when you walked through a set of doors, then a long corridor to another set of doors to enter the bedroom. It was do he'd have time to stop doing whatever he was doing before people got to the bedroom door.",
            "What the fuck? Dude is a legend. I love his talent and his music, and him quite frankly. But let’s make one thing very very clear; he was absolutely a predator and diddled children",
            "Zero chance MJ was a pedophile. He came out against Jews and they ruined his reputation for it. \n\nProof: Macaulay Culkin (sp?) - cutest kid in the world - slept in his bed and never felt uncomfortable. That’s flat out impossible with a pedophile.",
            "And his laugh. Real spontaneity.",
            "Very true. Humans are tribal by nature, too, and these folks end up isolated and unable to share even the most basic of interpersonal relationships because of the pedestal they're put up on. It's equally true of folks just born crazy wealthy. They're just as broken as the rest of us just in weirder and more out of touch ways.",
            "Yeah, it's a cult. I hope you escape it one day.",
            "If you're here on Reddit, you've one foot out the door.",
            "you are living in a prison. get out and experience the world before it's too late.",
            "I use to be a JW until I escaped last July, life doesn’t get any easier. I have lost almost everyone but I’m young and I still have time to build a new life. I really do feel for you man, I know how it is being stuck. Being raised and brainwashed by this cult from day one has been incredibly damaging mentally.",
            "I wish you the best of luck whether you leave or not I hope you find what makes you happy",
            "And the child sexual abuse that is rampant in JW communities. You wanna give some insight on that?",
            "He wasn't allowed to have a childhood so he spent every moment of his life trying to relive it as a child. That is some intense PTSD right there. Life in a  cult known to be as abusive as Jehovah's Witnesses can have that effect. But rather than break the cycle he just ended up perpetuating the abuse with unnecessary surgeries and multiple drug addictions. He was either utterly completely broken as a human being, or he never had the intrinsic strength to fight against it. Either way, he's a tragic figure more than anything.",
            "I dont think anyone was referring to any perfect childhood. It is about a normal childhood. You know family and celebrating Christmas or Eid or Diwali. Having friends. Relationships. Even arguments fights failures debate and disappointments are all part of the journey.",
            "He used propofol to get to sleep",
            "Lol. I definitely wasn’t being sarcastic. Note, I Was Not being Sarcastic /s :)",
            "Whomstest* ?",
            "she deff on pills lol",
            "Being with loved ones?\n\nDamn dude. The fuck is wrong with you.",
            "Eh I'm talking about the vid. You seem to be talking about external information and preconceptions (which may be valid, but the events in this video is just between 2 ppl that are not bothering or harming anybody and in fact just being nice to each other).",
            "She an alcoholic?",
            "[deleted]",
            "I feel the same way! Disturbing and sad",
            "I fucking love this video that shit stupid 💀thank you!! 🙏",
            "We agree. I agree with you. Absolutely no chance that soundtrack isn’t resurfacing in a pretty upsetting dream sequence sometime soon.\n\nSent it to a buddy— he immediately hit me back with the one word text\n\nDemented. \n\nIndeed it is. Glorious, demented, and whatever you call a never-ending super soaker gift exchange sequence, replete with quarrels and take-backs\n\nEnding is a *fucking problem*. Ridiculous edit",
            "I'm older than you. I was just being shot up, by a doctor at the time. The video looked so weird.",
            "I mean I don't think he was doing *that* but that might have been the only line.",
            "No vitriole, genuine question. Do you believe he was innocent?",
            "Never will be, sadly for us MJ fans :(",
            "Oops. There was another before the propofol he was taking crazy amounts of, I'll fix if I can find. \n\nThanks for pointing that out.",
            "This is the single most idiotic common defence of MJ there is. \n\n\"Your honour, this man couldn't possibly be a murderer - look at all the people he hasn't killed!\"",
            "If Macaulay Culkin was molested by Michael Jackson he would never admit it. What grown man wants to admit they were molested as a child. Especially a man who is an actor, he would never work again in Hollywood. It shouldn’t be that way but it’s true.",
            "[deleted]",
            "MJ had such severe CPTSD from what his dad did to him that he had to be drugged to get any sleep. That and all the stimulants he was on. He died from a drug overdose given to him by his personal \"physician.\"",
            "She was.  That was her limo driver in the video with them as well. she married that dude.  sweet ass mullet",
            "And I as a non practicing Catholic, I have no memories of a joyful Hanukkah; but from what I’ve learned from many of my Jewish friends, it’s all sorts of lovely - eight days worth!",
            "Let me come over and decorate your house this year so that you can praise ans cive thanks to our savior, the Lord Jesus Christ.\n\nAh, fuck that, I'm a hardcore atheist. Do it for the presents.",
            "Alright meow",
            "Yes, it’s probably the biggest hoax in modern pop culture history.",
            "Maybe, juuuusst maybe, he ought not have been a pedo? Ever ponder that little thought?",
            "They literally got matching tattoos together as adults",
            ">  Especially a man who is an actor, he would never work again in Hollywood. It shouldn’t be that way but it’s true.\n\nCorey Feldman.  \nHe's gone on a crusade against pedophiles in Hollywood and like you said, it has cost him his career. But he has never said anything damming against MJ, specifically that MJ never did anything unsavoury with him.  \nThe worst he has said is that he can't defend MJ but he won't judge him since there isn't enough evidence against him.",
            "This isn't a competition. Just a statement of fact.",
            "What exactly did his dad do to him? Like is there a definitive list out somewhere backed by facts I can see or something?",
            "Who amongst us can honestly say, that they have never slept with a 12 year old boy, after sharing some alcohol and pornography, in the company of a chimpanzee",
            "Trauma bonding is a thing, unfortunately.",
            "That still doesn’t mean anything",
            "It is extremely well documented. By the whole Jackson Family. If you know anything at all about them you know about their dad. \n\nAny simple search will pull up all kinds of information on it, but I'll help.\n\nhttps://www.theguardian.com/music/2018/jun/27/joe-jackson-one-of-the-most-monstrous-fathers-in-pop",
            "What a question to ask when actually all family members talk about it and the internet is full of testimonies. \n\nExcept if you want to be a smartass",
            "There's only 2 kinds of people in this world - those that have slept with drunk kids in front of a chimp.. and liars.",
            "He probably asked the question because he didn't know? Is ignorance actually that difficult of a concept?"
        ]
    },
    "Polar bear tries to eat small dog": {
        "title": "Polar bear tries to eat small dog",
        "score": 699,
        "url": "https://v.redd.it/kkrgwq07h08d1",
        "content": "",
        "num_comments": 91,
        "comments": [
            "That wasn't a \"small\" dog. That was a large dog that looked small because it was being eaten by a polar bear.",
            "The way the other dog rushed in to save his buddy ❤️❤️❤️",
            "Big bro coming in for the save!",
            "Does anyone know what happened to the dog? It looks like the bear went back after him, I hope the pup got somewhere safe 😔",
            "Polar bears look cute but they are fucking brutal. \n\nThey will eat you and the people you love.",
            "Welcome to Cosco. I love you",
            "Jesus was this filmed in Minecraft?",
            "Polar bears have no fear of nothing. They always the big kid on the playground. Your dog is a snack no matter how large. It's lucky the dog didn't suffer any vital wounds from what I saw. Skuff of his neck whipped around.",
            "Damn, Nature! You scary!",
            "Polar Bear is hungry, he got eat something.",
            "Look at how fast it moves - a human would have no chance!",
            "What’s for dinner hun? Bear stew",
            "It wasn't personal. He was just trying to take care of dinner...",
            "Damn, Cosco selling polar bears now...",
            "He'd eat the medium sized one too",
            "Poor bear...and the dog too.\n\nThe bear is probably desperate for food. Maybe their natural prey has dwindled so much that they have to search for other prey now. Or their habitat is smaller and closer to human settlements that they've started encroaching into human territory. It's actually the other way round though.",
            "This looks like Deadhorse Alaska. I am fascinated by that town.",
            "WHAAAAA",
            "Fast food is hard to come by in the Arctic",
            "Polar bear in Russia?",
            "Wait, is that a Cosco?",
            "Did the dog pass any off color remark to the bear??",
            "Thank god it wasnt a man",
            "Bear knew he had to keep chasing the injured dog. I wonder if the dog survived",
            "Coca Cola?",
            "I was in disbelief when i saw the dog get up and run away.",
            "I don't know... Seems like the bear probably succeeded after running for it.",
            "Blyat!",
            "That looked like a Tibetan Mastiff. From what I hear that's what you want to have on your side if you ever encounter a big snuggle struggle.",
            "Humans being where they should not be.",
            "This is nature. Why are we shocked? Global warming is making life rough",
            "I'm such a bad son of a bitch if you ever see me fighting a bear over my dog you better jump in and save the bear.",
            "I would jump on the bear to save my dog.",
            "Why tf is someone just filming this? Go save the fuckin dog!",
            "That's exactly what I came here to say lol",
            "[deleted]",
            "Yup totally selfless ready to at least do something against a foe. ",
            "Proving once again that dogs are not only man's best friend but dogs best friend and even dogs don't deserve dogs \n\nI rest my dog 👨‍⚖️🐕‍🦺",
            "In dogs we trust!",
            "Being dumb and brave worked out for once!\n\nAt least, I hope it did. I'm sure that dog is very injured.",
            "Other dogs got balls the size of a polar bears",
            "Eh..The bear had it by the neck pretty good. Thing was probably just running on adrenaline, keeled over off camera. Bear walked away with lunch.",
            "🙏🙏🙏",
            "Look at their situation.",
            "They're probably always very hungry.",
            "That’s why I don’t feel bad about them going extinct",
            "I didn't know that they have the Cosco membership stores in Russia.",
            "Were Cosco guys, of course we run from polar bears.",
            "What....do you not like the 2007 Youtube quaility?!\n\nUnbalanced audio channels and mixing?!",
            "Mmmmmm vitamin d",
            "I'd rather neither die. But if you killed the Polar Bear, you would be total POS. Not that this isn't an obvious joke.",
            "Yea it's just all around sucks",
            "Theyre speaking French, I assume it's Northern Quebec around Hudson Bay.",
            "Adding to the fact that polar bears only eat meat, they are only getting more brave to find and eat their next meal because who know when they’ll have their next meal",
            "How are you gonna save a dog against a polar bear? If you don't have a gun, good luck with that.\n\nIf it's brown, lie down. If it's black, fight back. If it's white? Goodnight.",
            "Lol this is like the “where’s the zookeeper?!” comment",
            "No you don’t, once you see a polar bear, just give up at this point, it’s not worth it.",
            "you could try talking to its manager!",
            "You must be like 400 lbs of straight testosterone to think you are fighting a polar bear.  You sir are a mad lad.",
            "Comments like these fucking gives me brain damage",
            "Obviously other doggo had it covered mate… No human is standing a chance with that polar bear.",
            "You can shoot a gun (not straight at the bear) but in the direction and scare it off. And even if you didn’t do that, it’s kinda gross to film it",
            "Average coyote weight is 15-45 lbs lol what",
            "You've never heard of small mammals?",
            "So they’re like sheep, cows, chickens, and other domesticated animals?\n\nWe should probably think of a special name for that type of animal.",
            "No, it IS not a small dog. Don't you know how big polar bears are? And apparently they are NOT *completely dependent* on people for their survival, because we just saw a *dog* rescue another dog, which seemed to be the same size like it, from a **big fucking bear**. And inbreeding is bad for dogs, but that didn't summon the **big bear** trying to eat them.  \n  \nWhat is your point?",
            "Agreed, breeding small dogs is animal abuse perpetuated by humans on the whole species.  Look at chihuahuas and tell me that is not just humans fucking with the whole species.",
            "Unlike the humans",
            "Dogspeed",
            "We truly do not deserve them.",
            "Nah, dog was moving fast. Def got somewhere away from the bear before adrenaline wore off.",
            "Ya that dog dead",
            "I guess we'll never know.",
            "I'm looking around me first if you don't mind. No bear for now.",
            "You literally had 0 interaction with polar bears. Fuck off. We're destroying their habitat and food sources, but you don't feel bad about them going extinct? This is human arrogance in its prime.",
            "Not Costco but Cosco…China Ocean Shipping Company. https://en.wikipedia.org/wiki/COSCO",
            "It's not french it's russian.",
            "Oh yeah, I totally watched this on mute at work. I should probably get more content before I post. 🤣",
            "Contrary to popular belief Polar Bears spend most of their time on land, not jumping from ice flow to ice flow.",
            "If you do have a gun good luck with that",
            "i could never get my head around that the way i was taught that didn't rhyme. it had \"goodnight\" replaced with \"you're fucked\". pa was using his usual creative license i see now",
            "\"Call a Park Ranger to give the polar bear a stern warning!\"",
            "Lol surprised you can type then",
            "They could have tried to shoot a gun in the direction to scare it off. Or at the very least, not filmed it. It’s one thing to be helpless but to pull out your phone to film your dog getting attacked? No thanks",
            "All dog and no dog makes dog a dog dog dog",
            "It's dogma",
            "[deleted]",
            "Nice. I thought they only had the warehouse stores. Now I find out they have a shipping company based in China. That surprised me, I must say.",
            "For fuckin real",
            "Humans kinda eat whatever whenever, even if they don't need it. Guess we ought to be destroyed then by that logic.\n\n\nMakes polar bears seem like saints for sure, hunting just for food."
        ]
    },
    "Man sacrifices drone to get shots from inside a volcano": {
        "title": "Man sacrifices drone to get shots from inside a volcano",
        "score": 2914,
        "url": "https://v.redd.it/thjvl18k1y7d1",
        "content": "**CREDIT: mcgee*",
        "num_comments": 105,
        "comments": [
            "Good on you for cutting the video short to fit your title. /s The drone didn't die, but it certainly came back a little melty. Here's the actual video:  \n[https://www.youtube.com/watch?v=YVKhcPm3T5A](https://www.youtube.com/watch?v=YVKhcPm3T5A)",
            "That’s cool.",
            "could've just flew higher and got just as good footage and saved your drone. they have a thing called \"zoom\" and it works well on high quality video sir",
            "Prayers up for Sméagol 🙏",
            "Bro should have followed the lava flow on the way to inside of volcano",
            "[Here is the missing last seconds of the video that got cut out](https://imgur.com/gallery/terminator-thumbs-up-88BO1)",
            "I don't think he planned that 🫠",
            "That loyal drone 🥺",
            "I thought it was going to dive, instead it got bird shot out of the sky",
            "From the looks of it it has a gopro strapped to it based on the first few frames of the video.\n\nIf the drone was lost, how did they get the footage off the gopro?\n\nI fly fpv drones and we do have digital High def(1080p/60) FPV now but it doesn't look THAT good. Woudl definitely have artifacting on a shot that detailed and dense...",
            "Would have been cooler if he just dive bombed the volcanoes.",
            "🫡 RIP Mr Drone",
            "God, praise the guy who had to wade through lava to get the drone footage....\n\n^^^/s",
            "Worth it",
            "man just littered the environment ! Drones are bad for Tourist destinations! Especially iceland! Not allowed but Tons of people dont give a Shit.",
            "What are you waiting for!? Cast it into the fire!",
            "In retrospect, kinda interesting how accurate the end of Revenge of the Sith looked",
            "Don't think he meant to sacrifice it though",
            "Shoudla hawk tuah'd on it",
            "Why tho? It wasn't even a good shot....",
            "So...I guess drones don't have zoom features anymore...or footage that can be edited into a zoom...or common sense handling?",
            "That was cool",
            "Liquid hot magma",
            "He made Pele angry",
            "That’s somewhere between “Planet Earth” and “Lord of the Rings” level footage.  Amazing!",
            "It went down into what looked like a gap around the edge. It was dark inside the gap it fell in",
            "Musta been a bitch to recover the memory card though..",
            "Must have been a bitch to get that SD card back.",
            "I thought he was going to dive into it, not get caught by splash",
            "But was it a virgin done?",
            "Meeeh",
            "u/auddbot",
            "Are we going to start polluting lava rivers now? Rocks still not infested with micro plastics 🤔",
            "Please like so I can show my 3 year old in the morning . ",
            "\\*from above\n\nI'm a little annoyed with drone pilots. Can't they just fly the fucking drone there and take a nice video of a nice volcano? No artistic maneuvers required, bro.",
            "I hate to be this guy but this is a really cool shot but why why do it when potentially the drone will end up inside the volcano and I don’t know a thing about volcanoes if adding contaminated objects into it would change how little or how lava flows in the off chance it speeds up the volume then what this could create the flood of people now flying drones into volcanoes",
            "Not quite “inside volcano”….",
            "I mean I would've flown around a little higher a bit more till the cell alarms started flashing 3.10v lol",
            "Hot AF!",
            "Maybe dumb question but how does he get the footage with the drone gone?",
            "Probably should’ve got a lot more footage first",
            "That's so hot 🥵",
            "Cost of doin business.",
            "Litli Hrutur eruption, the third eruption of Fagradalsfjall",
            "He probably didn't realize that all that heat thinned out the air so much that the propellers didn't have lift. People do that kind of thing around campfires all the time. They try to fly their drone straight through the fire real quick just to see what it looks like, but it always lands in the fire!",
            "I still cannot process that most of our planet is THAT.",
            "so worth it (to me)",
            "That drone served its purpose. RIP Mr. Drone.",
            "Nice. More fucking melted , er vaporized plastic. People suck",
            "100% you're replying to a bot account.",
            "Looks really hot, actually.",
            "It wouldn’t go as viral",
            "OP clipped the video. The drone never died, it just came back with a bit of damage.",
            "The difference between looking at a spray of lava from a distance and being inside the spray is significant, and kinda the whole point",
            "Its an FPV drone with a GoPro. That thing has no zoom. Also no gimbal.     \nAny drone with zoom and a gimbal is not able to do these maneuvers. I don't know why people upvote this.",
            "Well, he's going to sacrifice his drone so he can buy a drone with zoom...",
            "Beavers that [not](https://www.youtube.com/watch?v=YVKhcPm3T5A) what happened. Shitty misleading title with cut video",
            "Looking more like an “oh f__k moment,” rather than a decision to hike up to an active volcano just to get a few seconds of “I sacrificed my gear to bring you this award winning footage which proves what happens when you jump into a volcano.”",
            "ceramic blades",
            "flown",
            "Maybe dumb question but how does he get the footage with the drone gone?",
            "I like to think it was unintentional",
            "Why didn't Frodo just take a drone to Mordor? He could have just stuck the ring on it and flew it in and this whole mess would have been much simpler",
            "Agreed. Film now, caption later",
            "I just watched this last night, OP clipped the video. The drone obviously survived, just had some damage. I added a link to the real video in my comment.",
            "The hero we needed for 10 seconds of dopamine. His sacrifice will not be forgotten for the next 3 minutes. ",
            "The drone actually didn't crash. You can see the full video on youtube.",
            "[deleted]",
            "OP clipped the video. The drone was fine, if a little damaged.",
            "Poor volcano will never recover from this",
            "I think the volcano is going to be just fine",
            "He littered a whole environment?!",
            "Lava",
            "**Song Found!**\n\n[**levitation (feat. Felsmann + Tiley)** by Aaron Hibell](https://lis.tn/RJqjJ?t=68) (01:08; matched: `100%`)\n\n**Album**: Astral Projection. **Released on** 2024-03-09.\n\n*I am a bot and this action was performed automatically* | [GitHub](https://github.com/AudDMusic/RedditBot) [^(new issue)](https://github.com/AudDMusic/RedditBot/issues/new) | [Donate](https://github.com/AudDMusic/RedditBot/wiki/Please-consider-donating) ^(Please consider supporting me on Patreon. Music recognition costs a lot)",
            "Nothing gets into the volcano, only out. Also the volcano puts out dozens of tons of material per second. The drone would add grams of almost the same stuff.",
            "reddit is run by bots fuck this site",
            "☝️🤓",
            "#HAHAHAHAHAHAHA SUCH GOODTHINK!",
            "Did this go viral? I expected the drone to capture a super sick close range shot.of the lava pool... Instead it was just kinda meh?",
            "That makes sense. I was wondering how he would get the footage if the drone died...",
            "if you say so",
            "You can zoom in on the video file after its been recorded",
            "The drones not gone. The OP is just reposting someone elses video with a new clickbait title.\n\nFull video here. \nhttps://youtu.be/YVKhcPm3T5A?si=bOR8FFeh33ThUOt_",
            "Cool, thx.\n\nI was so confused...",
            "Toki Wartooth, not a bumblebee 🐝",
            "ive Seen drones live next to the vulcano Area and ive Seen tons of people getting on my nerves with their Ego drones that is ruining the Moment for every other human being and animal.that enjoys Nature and the Sound of Nature instead of listening to the electrix Motor spin Sound ..but Drone pilots are a different species they still fly even If its almost nowhere allowed in iceland... for what foe the Same shitty Areal Video that exsists already 10 000 Times on YouTube ?! clap clap",
            "pure luck while stupid flying... over and out",
            "IS your Last Name Ignorance?",
            "you will Not get the Point ... Not now Not then... plastic wasted battery waste laying around in a beautiful Nature... and you even ask about it ? lol dude",
            "does is say whole? lol another day another Reddit fool of argumentive nonsense...",
            "Name checks out",
            "Meh is my take as well. \nThe beginning was cool - but didn’t have to sacrifice no drone for it",
            "Yeah it was everywhere a couple of years ago, if this is indeed the exact one.",
            "Obviously main dude was hoping to get it back, otherwise they would have just flown it higher and then dive bombed right into the lava IMO for a truly epic shot. Instead he got this, which is obviously just  an \"oops, there goes my $____ drone\".",
            "Isn't it possible that everything the drone saw was being recorded to the cloud in real time? Which means that it recorded up to the point of breakage. Idk shit about drones obviously I'm actually asking a question here",
            "I've seen all your comments here; you are just a hater and also uneducated on this subject.",
            "And then you can't fly those nice looking maneuvers, because you suddenly need a waaay wider arc over the target which is not easily to achieve. Also loosing resolution.     \nHe risked his drone for a unique shot and it was worth it. Sometimes people do that.",
            "Yeah, my DJI mavic from around 10 years ago streams directly to my phone in 4k.",
            "Thought the same, but I assume that the connection is crap there, so I doubt",
            "*losing",
            "yeah that was real time, that drone is toast",
            "Nope\n\nhttps://youtu.be/YVKhcPm3T5A?si=bOR8FFeh33ThUOt_",
            "Yeah, aint no way a drone gets slapped by molten rock and just comes tooting back with a burnt out rotor.",
            "that made me lol"
        ]
    },
    "A cruise ship caught in huge waves and 120MPH (193 Km/h) winds. View from the third deck.": {
        "title": "A cruise ship caught in huge waves and 120MPH (193 Km/h) winds. View from the third deck.",
        "score": 64,
        "url": "https://v.redd.it/2adapk5g448d1",
        "content": "",
        "num_comments": 10,
        "comments": [
            "Super thankful for the safety standards and rigorous testing that allows you to enjoy looking at the wave smashing the fuck out of that third story window and not breaking it.",
            "I have a cruise booked in April 2025. Nightmare fuel.",
            "I'm about to puke",
            "Had the same but we were on deck 7 crossing the Bay of Biscay on P&O Oreana 17 years ago.",
            "Guess smooth sailing wasn't on the menu that day.",
            "Nope.",
            "Is there someone “in the know” that can tell me the chances of a cruise liner in those conditions not making it?",
            "I can't imagine how terrifying that must have been",
            "It's amazing what technology we have compared to a few hundred years ago..\n\nImagine being on a wooden ship in that 😳",
            "In modern ships? Not very."
        ]
    },
    "Gotta love NYC LMFAO": {
        "title": "Gotta love NYC LMFAO",
        "score": 206,
        "url": "https://v.redd.it/oat8od4yz18d1",
        "content": "Not my video kitty cats ☝️🤓",
        "num_comments": 22,
        "comments": [
            "Mary Poppins - crackhead edition",
            "A guy I used to know was diagnosed with schizophrenia in his early twenties. He became homeless and now  regularly posts videos on facebook of himself spinning in circles like this in random outdoor locations. It's really sad.",
            "What in the mental illness",
            "\"There are eight million stories in the naked city. This has been one of them.\"",
            "We live in a cartoon",
            "“Stop using cars! Use public transport!”\n\nPublic transport:",
            "If he can spin fast enough, he'll be able to flyyyyyyy!",
            "Weeeeeeeeeee",
            "Are these sort of things normal? If so I am excited to see these people when I go to NYC for the first time",
            "I’ll take “*Things we don’t see in Duluth*” for $200, Alex.",
            "Wow, a TikTok video of a TikTok victim. It’s becoming self-aware",
            "Making my way downtown..",
            "Recently I learnt that America doesn’t have free mental institutions where they help troubled people and those are just on the streets. Crazy.",
            "GLNYCLMFAOHD",
            "Guy’s been diagnosed with being my spirit animal.",
            "He's living the american dream.\n\nBest country in the world.",
            "This is cheaper than an institution for the insane.\n\nThe very rich people who write the laws don't use trains, so they don't care.",
            "At the pink pony club",
            "Methy Crackins",
            "I want to go to the naked city",
            "Bless your innocent heart.",
            "Just mething about"
        ]
    }
}