{
    "TIFU by finishing off my customers' leftover food off their plates and contracting Hepatitis.": {
        "title": "TIFU by finishing off my customers' leftover food off their plates and contracting Hepatitis.",
        "score": 1898,
        "url": "https://www.reddit.com/r/tifu/comments/1dlky5z/tifu_by_finishing_off_my_customers_leftover_food/",
        "content": "I work as a server in a small restaurant and I'm pretty sure everyone knows that whenever a customer doesn't finish their meal or ask for it to be boxed up, we obviously throw it away. But for the past few weeks or so instead of throwing the food away after my customes are done with their meal, I have been eating the leftovers remaining on their plates.\n\nWe are not allowed to do this so I just quickly scarfed it down when I returned the plates to the back and no one was looking. It was going okay until I suddenly got sick, turned out that I had Hepatitis A. It's been awful, I couldn't hold down food for days not to mention that I have been looking like a minion for a week now.\n\nI had no choice but to report it at work and I also decided that it was a good idea to come clean about how I probably got it which almost got me fired. I'm lucky that I got away with only a warning but l also can't work for the next two weeks. I guess it's the consequences of my own actions. At least I still have a job.\n\nTL:DR I ate customers leftovers, caught a contagious disease and almost got fired.\n\n\n",
        "num_comments": 288,
        "comments": [
            "What in the Dr. House plot is this post?",
            "Were you eating it out of necessity? Curiosity? A hatred of food waste? Just because? Why? ",
            "I highly recommend getting the hep a vaccine. Two shots, a year apart, will cover you for 10-20 years. In the US,  you can get them, w/o prescription, at drug stores.\n\nI don't necessarily think culinary professionals have a higher chance of contracting hep a, but if we do get it, the consequences can be extreme, exposing a large group of people to it -- and exposing the restaurant to a lawsuit.\n\nIf you've been exposed, and you know it, you have a short window to get the vaccine (48 hours, I think?) to keep you from getting the virus. (This happened to me).",
            "Sir... is there not dead food in the window? I was a restaurant manager for a decade. If one of my employees were hungry and couldn't afford to eat, I'd always give them my free meal.",
            "My brother in Christ... what ails thee?",
            "Being poor gets really expensive.",
            "Who knew Hepatitis was on the menu? Glad you're okay",
            "To get hepatitis A from someone else's food, the food would need to be contaminated with fecal matter. Either the customer who left the food didn't wash their hands, or one of your co-workers didn't, which is not super great for a restaurant.",
            "HolUp. Just you had to be off work? \n\nYou handled countless customer's food in between the time that you contracted Hep A and the time that you knew you were sick. Since we don't know when you actually got Hep A, we can't say for certain how many customers plates or drinks you touched. I hope you washed your hands. \n\nMy point of this post, the restaurant should have shut down and possibly tested other servers and cooks",
            "I’m so sorry, you must have been starving. I remember hunching over in the back of the kitchen scarfing down a bowl of the soup of the day whenever I could for every meal while I worked in kitchens because they’d let us have it if there was extra. What do you need so that you don’t have to be doing this? I can help you find resources in your area",
            "I’m not judging you. I am genuinely sad that we have got to this stage where people are forced to eat left overs from strangers plates to survive. I hope you have some form of health care so the costs for recovery are not too high",
            "What—and I cannot stress this enough—the actual fuck",
            "Yall hating on OP eating off peoples plates when you will make out with strangers and eat ass. It ain't that bad. Source: me.",
            "Had a coworker in a restaurant who ate binned food out of the same bin broken glass went into. Wonder sometimes if he's still alive.",
            "Being a AGM of a restaurant myself, I would rather comp your food than let you eat off a plate that touched a table. We give our employees free meals every shift they work. Or if they don’t want the free options we give them 50%. But I’ll let people have that burger for free more often than not. As a manager we are typically seen as heartless robots who bow to the man, but as long as my kindness isn’t being taken advantage of I’ll help out any one of my employees. Your managers need to keep a better eye on the well being of their people.",
            "Feel better, OP. I'm sorry you were put into this position in the first place.",
            "You didn't get sick from eating leftovers.  You get sick from hep a from using the utensils of someone with hep a that took a dump and didn't wash their hands.  Did you lick your fingers afterward or something?",
            "So I do case investigation for hep A. \n\nEither someone in your workplace is not washing their hands and has it, you're using under cooked shellfish or unwashed produce in your food or you got this somewhere else. Hep A spreads fecal orally, so unwashed hands or basically putting something contaminated by poop in your mouth. Or you couldve traveled somewhere where it's endemic (i.e Pakistan, India, Columbia etc)\n My point is, hep A has a notoriously long incubation period (the period where you get the disease to when you start symptoms), you must have gotten it somewhere else. \n\nDepending on where you're located...if you are in the states /europe or Canada, this would've been immediate public health involvement. You would've gotten a case investigation, along with an exclusion from work (Your work cannot fire you for this, but they have to give you time off until you come back negative for the virus) because of your infectiousness. There would've been a massive vaccination clinic put in place for all those who ate at your restaurant  in a time period before you started your jaundice symptoms.  Your place should've been inspected and your coworkers also tested for the virus if they were ill during a certain time period. \n\nPlus side- once you get hep A you're immune for life, however , people around you really need that hep A prophylaxis to be safe themselves.",
            ">I'm lucky I got away with only a warning\n\nI'm sorry you feel that way OP. An individual with a job should NEVER have been in that position in the first place and the fact that they did no react with empathy is alarming. Hope things get better for you.",
            "How do you know it was the customer who had hepatitis, and not that the food was contaminated, and you and the customer got it that night?",
            "Why not just claim you got Hep A from sex?",
            "At work yesterday a CNA brought a food tray out of a residence’s room and said “he took a few bites and didn’t want anything so I’m gonna eat this chicken” and she picked up the patty and ate it.  I was grossed out because he has dementia and puts his hands in all kinds of places and may have put it on that chicken patty.  The girl had brought lunch so I don’t get it.",
            "Back when I was a preteen, I had a friend who had a sizable family population with hepatitis.  There wasn’t an amount of money you could have paid me to eat or drink in that house, even though they said they were real careful about washing dishes and what not.  I viewed that as roughly as safe as when I lived in the meth lab.",
            "Almost no place I’ve ever served at has provided employees with food and we would get so hungry. We would take food off plates, stash it in our apron pocket, run to the bathroom and eat it really fast. It’s called pocket food and it’s a very common practice at restaurants. However, I’ve also never worked at a restaurant that hasn’t required hepatitis shots upon hiring.",
            "Are you frank reynolds ?",
            "Not to insult OP, but this sort of behavior is why COVID happened so bad.",
            "WOW I did this for months when I was a broke 18yo hostess. I feel fucking lucky.",
            "Don't. Back when I was a kitchen porter the waitresses would descend like seagulls on leftovers. Chips, Untouched bits of cheese,I could maybe understand. But they'd shovel in clumps of macaroni cheese, the pastry off edges of pie, the wafers from puddings... none of these girls were starving, they were fed. I was like \"can I just cook you a bowl of fresh chips? Please??\"\nIt was weird to see. I think the pandemic put an end to alot of that.\n\n\nI'm sorry you're in this situation op, might be worth befriending the kitchen. No chef is going to begrudge a good wait staff a bowl of chips.",
            "Probably the same way Pamela Anderson caught it. Don't put random strangers' things in your mouth",
            "I worked in food service for several years, decades ago, and all I can say regarding this is \"EWW!\"\n\nHope you feel better soon, but ugh, I just can't even imagine eating a customer's leftover food. Yikes.",
            "After 2020 people still do this?  Hello?!?!?!?",
            "This was an episode of a funny but short-run sitcom called “undecided”. You’d recognize the cast - most are major movie stars but this episode is literally the funniest of the lot. Sorry it happened to you OP (or you’re in a position that this was a means to an end).",
            "Wow… such a stupid move. Stop doing that.",
            "You're sharing meals with complete strangers that don't even have the chance to warn you that it's not a good idea.\n\nYeah, don't do that.",
            "Apparently users say you ate shit, not leftovers",
            "Don't eat strangers left overs. If you are hard up talk to your boss. We are all humans and need a hand from time to time.",
            "dude... dont ever eat someone elses food. You're lucky that Hep A is the worst thing you got.",
            "I worked at a casino buffet. I once saw a dishwasher do that. Scrap with his fingers the chocolate cake off the plate and eat it. I felt bad for the guy. I just walked the other way",
            "I literally warn people about this all of the time. Or when someone wants to recook food that's left the kitchen already. Absolutely disgusting.",
            "![gif](giphy|lrVfmPJ96cSJJ39bTh)",
            "Well, good news. Google says you can't get it again after you recover. So you can go back to eating peoples' leftovers worry free soon!",
            "Have you asked if your employer is able to provide you with a simple meal before you start your shifts?",
            "People in the same household don't just get HepA all of the sudden.\n\nSee if you have any other risk factor.",
            "As a young urchin I would finish leftover beers, until I heard a story of someone drinking vomit in a cup.",
            "some learn the hard way",
            "That's why you don't eat after ANYONE you don't know.  You learned this the hard way.",
            "Chris Pratt said he used to eat left overs when he worked as a server too. He didn’t mention your part in his interview so maybe he was lucky!",
            "and this is why rules exist... wtf dude",
            "Play stupid games, win stupid prizes",
            "Eating my 3 year olds left overs was the likely reason I got a nasty viral infection (CMV, adult mono) - fever over 101 and couldn't get out of bed for a week, out of work for 2 weeks. Felt tired and crappy for months. Now I don't share food with my kids.",
            "This is fucking weird.",
            "Sure that's where you got it",
            "Oh man, I used to have a dishie named Zombie that would get a basket of tots and an order.of nachos at the BEGINNING of his shift, eat it in the hundred degree hundred percent humidity dish pit, then spend the rest of his shift eating remotely anything edible left on any plate.  It was gnarly and gross, and I kinda respect the fuck out of him for it.",
            "Hey, it's not the easiest process, but I highly recommend looking into a government food assistance program if you have one (assuming you're in America, but unsure). It helped me out immensely when I couldn't afford food.",
            "You didn’t fuck up. You were unlucky because your employer forces you to essentially dumpster dive to survive.",
            "🤮 The idea that someone might scrape my leftovers is pretty revolting",
            "Why did you tell your employer how you got it? Presumably, Hep A can be acquired from any number of unknown avenues. Unless there's cameras, who's to say you didn't get it from a toilet seat or something?",
            "This is so insanely rare that you got extremely unlucky. I'm so sorry OP.\n\nWishing you a good recovery. On the bright side, you'll be immune to it for the rest of your life.\n\nThis is why you vaccinate for hep.",
            "So what did you eat?",
            "Okay, so, stop eating the leftovers the people have actually eaten off of. Is this some compulsion of yours or are you really hungry?",
            "Ewe",
            "yeah, you def brought that on yourself \n\neating strangers leftovers is psychopathic",
            "Not very bright are you. First for eating food off total strangers plates when you have no idea what the might have, and then been so dumb as to tell your boss how you think you caught it. Mind bogglingly stupid",
            "Bro…gross.",
            "OP just doesn't want to admit to eating dirty ass on every one night stand.",
            "Hppe you recover! I got hep a at jack in the box in the 60's, i was 15. Spent a week in the hospital isolated. And it affected my blood donoring ability all my life. And I still can't eat greasy food without feeling nauseous....especially chinese.",
            "Oh. That’s shit. Literally.",
            "I’m so sorry that happened to you. I hope you can find some local resources (food pantry, church food drive, SNAP, etc.) to help increase your access to food.",
            "I hope you feel better soon🩷",
            "This is beyond disgusting. I work in restaurants and my mind wouldn't even go there and I for one actually  cook the shit I won't touch. You don't know the shit those customers carry, and the second it leaves my kitchen, it doesn't get anywhere near my mouth. Disgusting. Yes you did f*ck up badly.\n\nBefriend your kitchen staff, I regularly cook and experiment for my servers. Ask and you'll get friends.",
            "Having worked in the food industry, this happens more often than customers might like to think (in my experience). Usually it’s front of house staff on the food, but I’ve seen chefs finishing off leftover drinks, too.",
            "Yeah, doing this kinda thing is a huge no no, it's the same ball park of sharing used needles or something similar, it sucks you had to learn the hard way but like, food safety standards are important! Your safety in general is! If ya don't wear a helmet on a motorcycle, cross a crosswalk without lookin, or not wear a seat belt while in a car you *might* be fine? Until your super not",
            "Aren’t health workers required to get hepatitis abc shots?",
            "My wife, daughter and I caught Hep A back in 2018. Unwashed produce was the likely culprit. Wife was sick for a week and a half, daughter for 4-5 days and I had to be hospitalized out of fear of liver failure. It is a seriously nasty sickness that hits worse the older you are, from extreme nausea, to covid-level lethargy to...strange bowel movements. \n\nI do remember being in the hospital and a young intern giving me an IV something called NAC. It was miraculously helpful. Keep a close eye eye on your symptoms OP, this stuff comes and goes.",
            "Honestly, you have no idea where you got it, it's nearly impossible to tell",
            "Where’s that GIF of Frank from Always Sunny working his restaurant job by cleaning the plates?",
            "Why would you eat food on another persons plate? Is there something wrong with you?",
            "I didn’t know that was even a possible way to get hepatitis",
            "> ask for it to be boxed up, we obviously throw it away\n\nWat?",
            "😬",
            "Don’t feel too bad, this was the norm back in the day. Waitered at a high end famous Italian restaurant in Hollywood that was owned and operated by old world Italian family, half didn’t even speak English. Everything was recycled, meat, bread for the meatballs, pasta (employee meals) big bowls of salad, 1 for Blue Cheese, 1 for Italian, tossed and back out to the customers. We drank anything we could get our hands on, bartenders would save up what spilled on the bar mat and cackled at the waiters lined up to do bar mat shooters. Those were the days.",
            "Why did you tell them 🤨",
            "Wow. Here’s a little anecdote to make you feel better: for 3 years I worked in Japanese fusion restaurant. The owner was kind of a piss baby and was still learning how to staff his restaurant. We have this guy in the dish pit who was a 19-year-old from Maine. Eventually, he’s trained as a cook at the place. But during his tenure in the dish pot one day he’s talking to his server friend about the edamame",
            "You disgusting animal.",
            "No family meal? Wtf",
            "I feel you man. We never got free meals when I worked in restaurants. ",
            "Why would you tell them about eating off finished plates. Not sure they were entitled to that disclosure, bit of a self-report.",
            "Why would you eat food off someone’s plate? Seriously bro, are you homeless, or just cosplaying? That’s fucking disgusting.",
            "https://preview.redd.it/k09gmqf7628d1.jpeg?width=574&format=pjpg&auto=webp&s=11021c268458f4b059aa4013a9ca068f7ad4ed84\n\nyou wouldn't have got hepatitis if you were this legend, L get rekt bozo",
            "This is one of the dumbest things Ive ever read someone doing.  Like, why would this be something that would come to mind?  \n\nI understand doing this if youre homeless or something but you have a job and if Im not mistaken most restaurants or food establishments usually have a free meal for their employees.  I really dont understand your thought process.",
            "Ew",
            "What kind of restaurant? Hep A should be super rare due to an easy vaccine but a restaurant that does poor country cuisine is more likely to have infected customers (international unvaccinated visitors).",
            "you deserve whatever happens to you",
            "Are you genuinely dumb? Holy hell.",
            "The S means this is a joke, right?",
            "My God, how dumb can someone be. I mean honestly lmao haven't your parents taught you better?\n\nEdit: I'm getting downvoted but it's never mentioned in the op they were doing this out of necessity. If that is the case, please go to a foodbank!",
            "It's not lupus, I'll tell you that",
            "We’re just waiting to hear about all the other persons at the restaurant with hepatitis A too since it’s really contagious and several of the guests got it too. Or maybe he’s in a low endemic country where most are vaccinated too, then you wonder how hepatitis A ended up on the plates.",
            "No clue. You happen to have a vicodin on you?",
            "![gif](giphy|98qNB9zZFJrm7xaqsq)",
            "I think we need to send Foreman to OP's apartment to figure out how they [*really* contracted Hepatitis A.](https://i.giphy.com/media/v1.Y2lkPTc5MGI3NjExaTE1eG5yZHkxOXNhN2gycnAwZHUxa2Nka3cyMzA0dGlobHd0dnZ1NyZlcD12MV9pbnRlcm5hbF9naWZfYnlfaWQmY3Q9Zw/yMm7AkV1NqQQU/giphy.gif)",
            "It's sarcoidosis.",
            "![gif](giphy|y1eljNRzOtOvYEpy6w)",
            "It was out of necessity, definitely not because I was curious lol",
            "Huge plot hole",
            "Better yet, get the combo hep A/B vaccine.",
            ">If you've been exposed, and you know it\n\nHow would one know?",
            ">don't necessarily think culinary professionals have a higher chance of contracting hep a,\n\nThis post smells fishy.",
            "not at all restaurants are like that, I can tell you that from experience",
            "Or eat untouched returns and wrong orders, many places consider those fair game.",
            "I’m no doctor, but I’m guessing Hepatitis A.",
            "Hunger and semi-institutionalised poverty it sounds like !",
            "Rice and beans are cheap. A days work would have easily provided weeks of rice and beans. Its a full protein and is delicious. \n\nGoogle says its 25¢ per pound. ",
            "Honestly I should have known better, thank you.",
            "Hep A's back on the menu boys!",
            "That's one hell of a plot twist",
            "We practice strict hygiene measures that includes washing hands all the time. That is why I had to report so that everyone gets checked.",
            "If this post was in the states or Canada, there would've been a public health investigation, and probably a mass vaccination clinic for post exposure because of this too",
            "Man, I remember my customer service jobs mainly by two low points: \n\n\n- smuggling oatmeal out of my hotel job's breakfast area hidden in coffee cups\n\n\n- having an actual crying breakdown when my manager (I'm pretty sure unintentionally but he was also a jerk) gave away dead food that was meant to feed myself and my partner for two days--we legitimately didn't have anything else\n\n\nIn the latter case, the cooks felt so bad seeing it that they all chipped in and intercepted me at the door the next morning with a carload of groceries. I hated upper management at that place but I would have died for that pack of maniacs.\n\n\nWe're doing much better these days, and my friends know that I'd never let someone go without, because I know how it feels. ",
            "This sounds like it happened in the United States, so most likely they don't have any health insurance",
            "Happy Cake Day! 🍰",
            "Germs aren’t real, right?",
            "\"Hepatitis A usually spreads when a person unknowingly ingests virus from objects, food, or drinks contaminated by small, undetected amounts of virus in the feces (stool) from an infected person. Even consuming microscopic (tiny) amounts of feces can spread hepatitis A virus.\"\n\nBro might as well have been eating ass",
            "When you offer to eat someone's ass, they'll generally let you know if they have a contagious disease that you might contract when doing so, if they know of course.\n\nOP didn't give them this chance.",
            "Be so fr 💀💀",
            "Some of us don't do any of those things.",
            "Op probably didn't get it from the plate. \n\nIt might be ass.",
            "Yeah, I was gonna say, most likely they got it from eating ass, not from eating off strangers' plates",
            "If the leftovers were handled by someone with Hep A who didn't wash their hands, you totally can get it. Fries and chips are a risk.",
            "Hep A is also caused by raw seafood and cross contamination with seafood, and with unwashed vegetables where the soil they were grown was infected. Also, contaminated water source used for washing vegetables.\n\nIn other words, it may not have been a customer’s food that caused OP’s infection, but the restaurant itself.",
            "The customer would have put their utensils and their hands on the food, thus contaminating it. ",
            "The way I was feverishly reading comments for clarity... I was like... how did I not know simply sharing food can spread this?! Makes more sense now!",
            "Good lawd!",
            "An individual without a job shouldn't be in that position either.",
            "Instructions unclear OP just claimed he got hep from having sex with a customers left over steak after dicking some mashed potatoes.\n\n\npost gets edited from almost fired to *fired*",
            "No... No it's not.",
            "Did you not tell them these were the Lord's cheeps?",
            "Undeclared",
            "Can confirm. Definitely won't be doing it again.",
            "Realistically, is there worse things to get from doing something like this? Of the top of my head I can't think of any, but now I got curious.",
            "I learned my lesson when the beer I thought was my beer was actually the community ash tray",
            "What is a basket of tots?",
            "So other people at the restaurant can be tested to stop the spread? The fuck kind of question is that",
            "I thought being honest would be helpful.",
            "If a customer doesnt \"finish or ask to box it up\".",
            "He’s telling his server friend he feels that probably the edamame is undercooked or something since it’s really tough.  Super chewy and fibrous.. then it comes out that he is in the dish pit snacking on the pods of the togarashi edamame that the customers have been putting in their mouth to pop the seeds out. He’d been standing back there for who knows how long snacking out of the waste cups where customers put their spitty edamame pods. Later, he became a cook and he served disgusting green scrubby broth for an entire shift. But that is a story for a different time.",
            "You would be surprised the things you would do when you are really desperate and we don't get free meals.",
            "You’re lucky not to understand this I think",
            "I've only worked at one restaurant that had staff meals and even then it wasn't daily.",
            "You made a bunch of baseless assumptions and you were dead wrong.",
            "be lucky you've never been in a position that required this kind of necessity. OP was hungry and their job doesn't provide free meals.",
            "It’s never lupus",
            "Start them on plasmapheresis STAT!",
            "Sarcoidosis, for sure",
            "It’s Cushings!",
            "[deleted]",
            "As a former social worker- in the event you are experiencing food insecurity, there are ways to address this that don’t put your health at risk. Where about are you located? Food pantries are a wonderful resource. I can help you locate a few. If you are in the US (as I am), you may qualify for food assistance programs (such as SNAP). Call your local health department and the nice people there can connect you up to someone who can help. \n\nSome are hesitant to use these resources because they don’t want to be seen as a burden or “taking advantage”. Know that you are a valuable human being who deserves food. Wouldn’t it be nice to save the energy you are spending on stressing over where your next meal is coming from and investing it in other areas that will help you become more food secure? Becoming more financially stable, leaving an abusive relationship, or caring for your physical/mental health are a few examples.",
            "i’m telling you… find a friend in the kitchen. someone would love to make somebody’s day with food, that’s the gratification you never get in a kitchen. we put 210% into staff food, just ask early not before close",
            "I'm so sorry to hear this. My husband is the chef of our restaurant, he'd never let one of the staff to hungry. We get staff meals, but if someone were ever just hungry and couldn't afford food (which wouldn't happen here, the BOH is paid well and the FOH does well, but still) he'd send them home with something. It sucks you got hep from it, but it sucks more that they don't make sure you're fed and getting by.",
            "Don’t y’all get a staff meal??",
            "Be nice to the chef, even if he's a dick.",
            "Every restaurant Ive ever worked in feeds the servers if they ask…",
            "Bruh, you can just outright steal food in a kitchen!  No need for leftovers.",
            "File a workers comp claim lol",
            "Fuck that sucks. I used to do this too when I worked at restaurants if I really needed to. It never occurred to me that this could happen, it seems obvious now though. \n\nI hope you are going to be okay",
            "Did the job know? Were they not paying you enough to survive, or is it part time?",
            "Do you get staff meals or family meals where you work. I've had times when I couldn't afford food and I just asked and no one had an issue with me taking food home. I would do it a couple days before my day off so I had something to eat.",
            "Yo, they didn't have this before I retired. Most excellent.",
            "Better yet, get eggs and canola oil in bulk from Costco. Or butter if budget allows, ideally along with some frozen veggies, multivitamins, salt, and pepper.",
            "Because you know the person you came in contact with has it.  Most of the time you're not gonna know.",
            "Why?",
            "I’ve never worked in a restaurant that doesn’t let you get food at a discount and have it deducted from your paycheck.",
            "The sad thing is that there is a vaccine, and many health departments have community programs to provide is for free",
            "I love this comment so much omg.",
            "holy jeesus that is hot!!!",
            "I wouldn't want to visit a place to eat where the people cooking or serving my dinner couldn't afford to feed themselves.",
            "yeah, it does sound like a tough situation. have you tried talking to your boss about maybe getting some staff meals or discounts? sometimes restaurants offer that as a perk.",
            "Just the way the republicans want things to be.  The bootstraps also double as hanging-straps 😭.",
            "\"It's actually easy; just eat like you're living in a famine\"",
            "I'm going to go out on a limb and say OP gamed out how practical it was to buy groceries before doing this.",
            "The restaurant owner may be being negligent. \n\nWho did you report it to? The owner or manager, or a regulatory authority? \n\nAs someone else responded to me, the restaurant now may have to take several steps, I'm not sure who has to arrange them, but several things should happen in the next few days such as: \n\n-Informing customers who ate at the restaurant that they may have been exposed to Hep A\n\n-Mass vaccination clinic \n\n-Testing of staff and patrons \n\nIn addition to that, the restaurant may have a responsibility to you i.e. it may be a workman's comp type issue. If you had tripped over something and broken your ankle at work would be one thing, but for a disease they may say you cannot prove absolutely that you got Hep A at work. Then they could contest it saying that you weren't supposed to eat leftover food at work. Was there an exact policy in place or were you trained or told not to do that? I'm not knocking you, I get it you were hungry, I'm just asking. Did you incur any medical expenses?",
            "Right that's exactly what happened, one time I got a letter in the mail, I forget who it was from but a restaurant I had eaten at had some of the staff test positive for hepatitis. They mailed me a check for a small amount of money and said there was a mass vaccination clinic, and I think I could have got tested, I forget. I never got sick or anything but they did it for anyone who ate at the restaurant in a certain time period",
            "Used to work at a restaurant. Poor 19 yrs old, 1 yr old kid, trying to finish college, one friday night I decide to smuggle some marinated fajitas out of restaurant I worked at. Mission accomplished except wrapping them up in Seran wrap left my crotch under wear area all soaked in fajita marinade juices by the time I got home!!! This post reminded me of that time!",
            "How can they be? You can't see them, therefore they don't exist",
            "Can we go back to miasma theory?",
            "Also why hepatitis is considered an occupational hazard in wastewater, just walking on the catwalks over the aeration basins can expose you to it.",
            "This is one of the many reasons why eating ass is fucking disgusting",
            "https://youtu.be/LBduNcf1eQc",
            "People offer to do it? My ex kinda just went straight for it and took me by surprise lol.",
            "Gotcha. Before eating someone else's food leftovers, ask them if they would be ok with you eating their ass first.",
            "true",
            "Correct!",
            "Find your local food bank, okay honeybun? You can get all kinds of food for free. Bread, peanut butter, veggies, canned goods, etc.",
            "Holy fuck a Hep A outbreak at a restaurant that downed staff would be disastrous. One that jumped to customers would be business-ending.",
            "If your local health department calls, please answer. It's possible your Hep A came from other sources (contaminated foods from suppliers that weren't washed properly, mishandled food from infected people, some place you aren't even thinking about)\n\nThey hook into bigger systems that can spot patterns and help to ensure your contracts get what they need.",
            "Ah okay, stupid me",
            "Well shit, I didn't even consider that. My bad if that's the case (it wasn't mentioned in the op). Op should have still used a foodbank in that case, though.",
            "Except for that one time it was lupus!",
            "It was always lupus and House was too lit off painkillers to see the epidemic explode in front of him",
            "Until it is….",
            "It’s never twins either.",
            "Nup I'm going with Vasculitis",
            "That was the first and only time I ever heard of Cushing’s… until I was diagnosed with it! 😂",
            "Did you do a Lumbar Puncture?",
            "Well, people who put hepA on food usually don’t know they’re doing it. That’s not the sketchy thing about this story.",
            "Thank you for your service.",
            "I'm a current social worker and I use findhelp.com to locate food and all types of resources for my clients. OP, check it out and you should be able to find resources local to you.",
            "True until the one of the servers gets a princess complex and starts asking for ridiculous custom orders",
            "Clearly this isn’t a restaurant where that happens. And they shouldn’t need to find a friend in the kitchen to be able to eat",
            "The one I last worked in didn't do staff food. Management argued that it incentivised people taking advantage of free food, and would lead to excessive staff consumption or even theft. They said it was a slippery slope, so no staff food, no staff drinks.\n\nIf you wanted a free coffee you could go sit in the office lunch room with the crappy coffee vending machine, but having one from FOH like most places? Pfft, nah, literally a near-fireable offence. So if you want food on shift, you're essentially either bringing in your own lunch, buying stuff from the office lunch room vending machine spending like £4.50/$6, or you can shell out £9/$12 to get something basic like a beefburger (no sides) with a Coke.",
            "My friend worked at a small town upper scale restaurant.  We got there for lunch and she orders the fancy BLT (fancy bun, maple bacon, blah, blah).  She gets burnt bacon, the end of the tomato and wilted lettuce.  Her boss is at the next table with our friends and she shows him.  He says \"well someone has to get it.  I am glad it was just you\" and turns his back to her.  So not every place gives fellow workers 210%.",
            "This 100%, work in a place where we have a cook (not a restaurant) and I made friends with them and generally shoot the shots with them. They send me home with food ever. Work. Day. Ever. They are a saint and love to cook for people, they’ll even have me try new recipes or different/new combinations of food",
            "You’ve clearly only worked for nice restaurants. The place I worked for limited you to a singular soda per shift.",
            "Unfortunately we don't ",
            "How about be nice to the servers because they’re sometimes starving? Don’t be nice to the person with power, be kind to the weak and vulnerable.",
            "I’m pretty sure they will just deny it if you were doing something that is not only against policy but also illegal (theft by conversion)",
            "Starting a comment with \"yo\" and ending with \"Most excellent\" is for sure my kind of vibe",
            "Better yet, don’t eat random food that’s strangers have half eaten",
            "Nope. I am retired, but worked for years in the industry.",
            "I've never worked at an eaterie that didn't make me immediately pay for any food items I was going to consume. ",
            "Better not go to a restaurant in the US then",
            "> just walking on the catwalks over the aeration basins can expose you to it.\n\nWait what",
            "Hey, we don't kink shame over here",
            "I mean at that point you kinda know what you're dealing with, not just a random. 😄",
            "I mean, if he was the only one who got it, then that's a good thing because most likely he didn't get it from eating off other people's plates but instead got it from eating ass",
            "I had the same pause and had to take a moment to parse that out, so dont feel bad lol",
            "maybe, but i don't even know of one of those in my city so i can't say, and i suppose getting food during a shift in that way would be difficult",
            "Loving the House knowledge on this thread!",
            "this joke actually hits for a lot of people that grew up listening to J Dilla.  \n\nhe died from Lupus and TTP.  both pretty rare to get.",
            "Catch all for everything.",
            "It’s always parasitic twins if it is twins. Think zebras, not horses",
            "Did you get insulted by the dr first, then surrounded by a well ethnically and sexually balanced group of extremely knowledgeable interns who proceeded to test you for everything, until the dr returned from getting high his office to declare Cushing’s was the last thing written on his whiteboard. I’m guessing he then stabbed you with a random syringe of stuff in the hallway, and that’s why you lived and are here today?",
            "My dog came down with Cushing's when he was about age 11..  That was my intro to it.",
            "[deleted]",
            "What are the qualifications for receiving food from a food pantry? What info do you need to provide?",
            "The chefs where I worked loved to do silly things, though. I didn't even ask them to. I'd put my employee meal in the system, and after getting the ticket, they'd scheme and try to do something to surprise me. One of the older guys was the best. He made my French toast with Nutella, banana, and strawberry to form an owl of sorts. It was an entertaining attempt but still just as delicious. If I was hungry during a shift, he'd slice a green pepper for me and put it in a bowl so I had something to munch on, just because I told him once that I really liked to eat raw green bell pepper. I never demanded anything. I just walked around with my dark humor and always thanked anyone for helping me or being kind, so they'd just wanna do it more I guess. It's been nearly a decade since then. Hope he's still doing well ❤️🥰",
            "Back when my family owned our own restaurant, one of the perks we had for our staff was we fed them on their shift. When I was a kid, I thought it was the norm, but as I got older and worked in the business while I was in high school and college, I learned it wasn't, which surprised me at first. I was an assistant manager during the last couple of years, so I knew what our costs were. We lost very little on employee meals, so it wasn't an issue. Not to mention unlimited access to the soda fountain and a laid-back family environment.\n\nThere's a reason \"corporate\" is a word used in a pejorative manner.",
            "Yeah and it was a off brand canned Dr Thunder that wasn't refrigerated. And we were lucky to get that!",
            "It's always so strange to me to read this about working hospitality outside of Australia. Every cafe, pub or restaurant I have ever worked for fed you on your break. \n\nSure, it was a practice I picked up early and then continued when I moved into management, but I never got complaints from owners. In bigger restaurants that I ran, the apprentices would try to outdo each other with the staff meal. \n\nI've always told staff not to eat food off plates. I just think it's gross and never heard of someone getting sick from it. I'm sorry OP did!",
            "I've worked places where even the postmix wasn't free.",
            "I got free food at every restaurant I worked at. A nice Mexican restaurant, 2 chain diners and 1 pizza place. Even the theater let us have popcorn and soda.",
            "Worked shitty restaurants and even then the chefs/owners were practically over feeding us with various experiments, or sometimes just because they were hungry for something",
            "Why can't we all just be nice to everyone?",
            "If the employee wasn’t properly trained on this it’s on the employer",
            "But with a \"retired\" in between!  (I was about to just write \"chef's kiss\" but the username is ChefKimberly and I don't know how that would come across, so ...)",
            "Welp, I checked Google. The CDC claims that \"food handlers are not at increased risk for hepatitis a due to their profession.\"\n\nNow, the drug use? That's a whole other story.",
            "Lots of places give you a free meal every shift. I’ve only worked at one that made us pay and they took it out of your check. It’s been a long time though.",
            "Fuck that, we need to bring back more shaming. You degenerates are walking bio weapons.",
            "Then I am surprised nobody has brought up the possibility that it could also be sarcoidosis. Amateurs.",
            "You could probably send me a screenshot of the patient and I could tell you the plot. ST:TNG too.",
            "shout to SV",
            "Man's out here putting up platinum achievements",
            "I also had a dog with Cushing’s 😢",
            "He reported it and can't work for 2 weeks. Nowhere does it say he went back to serving food while knowingly having this.",
            "they probably had a thing for you",
            "We do that too. It makes a huge difference for our employees. And I would never change that.\n\nBut I will also have to agree with some of the other comments here, there are some people who just abuse it if they can. \n\nWe had people taking food for the whole family. Which is ok once in a while - or always if it's leftover ingredients we can't use tomorrow - but you can't just take 4 Burgers and drinks all the time.",
            "I was actually surprised when my son started a food service job a couple of weeks ago and we found out he could get a meal during his shift even working part time. I seem to recall my friends as teens could only do that if they were working a full shift if they got to at all when working in the industry (I suffered through call centers rather than food service, so it wasn’t first hand info for me). It seems smarter to me to do it, though. Have the staff get familiar with the offerings so they can help the indecisive and cuts down on the likelihood of stuff like the OP.",
            "My mom was a restaurant manager for years. No matter what the official policy was, she always let staff eat for free if she could get away with it. Her reasoning was that they'd find ways to eat for free anyway, she'd rather just be upfront about it and keep her counts accurate. Plus employee morale is a thing.",
            "Uphill both ways!",
            "As another Australian who’s worked hospitality I’m equally horrified",
            "Hep A is fecal oral route. Hep B and C are blood / fluids. Hep A is commonly transmitted through food because someone who has it and doesn’t wash their hands will spread it if they serve the food.",
            "Why are you responding to yourself?",
            "Sounds like you need to eat more ass",
            "or better yet amyloidosis",
            "![gif](giphy|MPRFFJGuYrP21RSTga)",
            "I don't have the slightest idea what sarcoidosis is but from watching House I know that \n\n1. It fits any constellation of symptoms any patient has, and \n\n2. Nobody ever has sarcoidosis.",
            "Raise It Up is an under appreciated jam",
            "My bad I mis read. Apologies. I'll delete the comment.",
            "Was going to ask if they started as a host...",
            "Sometimes people are just nice.",
            "He wanted head in the walk in 🤣",
            "Yeah, that was a concern of ours, but we figured out a system around it. Our employees' meals were free only with their shift. If they wanted to take food home for their families, it was half off. And there were some things that were off-limits, like our lamb and salmon plates.",
            "It’s also great for morale as well. Someone with a full belly will perform their job much better / happier than someone who is starving and having to smell freshly cooked meals the customers are eating.",
            "So my replies stayed in order.",
            "Nah, I'm good with my sex life not involving fecal matter.",
            "Turns out… just a damn toothpick.",
            "Don't leave out paraneoplastic syndrome",
            "Everybody lies. Even illnesses",
            "cellulitis",
            "You sweet summer child",
            "That’s not how replies in Reddit work.  \n\nYou reply to each Redditor’s comment, not your own.",
            "Or the tick in the vagina.",
            "That episode curls my fuckin toes every time.  I usually skip it."
        ]
    },
    "TIFU by telling my boyfriend I think he has autism": {
        "title": "TIFU by telling my boyfriend I think he has autism",
        "score": 259,
        "url": "https://www.reddit.com/r/tifu/comments/1dlpm3d/tifu_by_telling_my_boyfriend_i_think_he_has_autism/",
        "content": "I want to preface this post by saying that I believe that there's nothing wrong with having autism and people with autism can be extremely smart and amazing individuals.\n\nMy 26M boyfriend of three years and I 23F have been going through a lot of issues. To start, our relationship has always been challenging, We dated for two years locally and now we are one year into long distance. We have been talking about becoming a more serious couple, starting a family and living together in the next few years.\n\nWe finally set a date that works best for me to move, this September. Previously we thought it would be sometime early next year but this works out better for his current lease and my current situation. This set him off as it's pretty close, his initial reaction to me moving in September was extremely worried. He's worried about having to change his current routines to fit me into his life and living situation. \n\nHe has several symptoms that I've noticed over the three years we've dated, a few of which have caused extreme problems in the relationship.\n\n* Introvert/ social anxiety when in unfamiliar settings to the point we have to leave\n* Lots of anxiety in general\n* Easily annoyed when disturbed from his routines (Everything is on his time)\n* Complete inability to express feelings and emotions and has a difficult time recognizing or understanding other's emotions\n*  Lack of affection and constantly needs to be asked to show affection\n*  Withdraws in any stressful conversation or situation\n*  Very rigid work/ food/ gym/ sleep routine. \n*  Extreme interest in a highly specific field of academia that he is highly successful in\n*  Struggles with 'common sense'\n\nYou may or may not agree with my conclusions based off of this list. I'm not a doctor, but I have been around him for years and truly think that he may be on the spectrum. We have struggled a lot with his communication and constantly shutting down conversations. \n\n**Here's where I fucked up,** I told him in the most caring and gentle way that I think he may have some symptoms of autism. He became extremely upset and started saying that I think he is a r\\*\\*\\*\\*\\*d. I tried to explain that I don't think that he is dumb and I actually think he is incredibly smart. I tried reassuring him and he said he doesn't want to talk and to leave him alone. I texted him and apologized, I told him it was never my intention to hurt his feelings and that I would love him regardless.  \n\nI don't know what to do about the situation, I know I fucked up. Honestly, I just didn't know how to bring it up.  Or if I was wrong for even thinking this. I feel like shit because I know he thinks I'm a jerk for suggesting it. \n\nAdvice is welcome.\n\nTL;DR: I noticed some symptoms of autism in my boyfriend and brought it up, now he hates me.",
        "num_comments": 135,
        "comments": [
            ">starting a family\n\n>He's worried about having to change his current routines to fit me into his life and living situation.\n\nOh boy is he gonna be in for a surprise\n\n![gif](giphy|26n6Gx9moCgs1pUuk)",
            "I wanna preface this comment by saying I’m not attacking you or meaning to be aggressive in any way shape or form, at the same time what I’m about to say might be hard to read. \n\nThe symptoms you’ve seen him exhibit don’t matter. Simply because, from what you’ve described in your post, he isn’t receptive to that kind of conversation. \n\nIf anyone that has been in a 3 year relationship can’t have these kind of difficult conversations with their partner, it’s a HUGE red flag and sharing a living space with one another shouldn’t be on  the table, let alone have a planned date. \n\nI understand wanting to be patient with him, but if you’re anything like me, you need to be asking yourself this, “am I looking for him to get a diagnosis for him or for me?” \n\nWhen I was going through a similar situation, I kept looking for explanations that would justify the way my partner at the time was treating me. He ended up being diagnosed with bipolar schizophrenia and I stayed with him for way too long because I told myself that the mistreatment was directly related to his diagnosis. \n\nRegardless of his diagnosis and all the logical explanations, I was miserable. On top of that, he became violent, I justified it as he was “different” mentally. Well, I was still miserable, and it wasn’t until he tried to kill me that I snapped out of it. \n\nI am now years later in a wonderful, healthy relationship with the most amazing person I have ever met. We are both able to have any and all conversations that we need, and every time we’ve shared a concern about one another, it’s been addressed in a way that we both feel comfortable with.\n\nI’m typing this to you as a person formally diagnosed with Autism, ADHD, and BPD. I know what it’s like to struggle but I would never excuse treating someone I love poorly because of my diagnoses. \n\nIf your partner can’t be realistic about conversations that matter, put yourself first and get the fuck out of that relationship.",
            "Based on that response, he already knew and got upset because you reminded him.    \n\nETA: As someone with two neurodevelopmental disorders, I genuinely don’t think it should be rude to ask someone else who is definitely exhibiting a few symptoms. You either have it or you don’t. If you don’t, congrats, you got the easier path. If you do, then that won’t change regardless of whether you pay it any mind.  \n\nIt’s internalized ableism, they don’t want something to be “wrong” with them. ",
            "Whether or not he has autism is actually kind of besides the point. He wants to delay you moving in together. He’s not showing you the affection you’ve repeatedly asked him for. He won’t partake in serious conversations with you. A diagnosis isn’t going to change any of that. It sounds like there are a lot of needs that he just isn’t meeting - or willing to try to meet.",
            "I’m diagnosed autistic, and I remember being called the r slur a lot at school. It was soul destroying- a way of marking out certain people as something less than human. Kids are also really good at noticing who’s different, even if you keep your diagnosis secret like I did; I swear they make better diagnosticians than a lot of doctors.\n\nWhat I’m trying to say here is that he probably had similar experiences and is traumatised. Autism is extremely stigmatised and regularly shamed. You didn’t fuck up at all, but society has fucked him up. \n\nPersonally, I think we do best in relationships with our own neurotype. That’s nothing personal, it’s just a fact. Think about whether you want to be with someone like him.",
            "Hey, your list is exactly how my relationship was too. If he’s not autistic, he might be avoidant. This makes a relationship hard if you can’t have serious conversations. I would really consider whether or not that’s something you can really deal with.\n\nGood luck with everything.",
            ">Hey Reddit, I want to spend the rest of my life with someone who won't change and can't communicate with me\n\n![gif](giphy|s239QJIh56sRW|downsized)",
            "I mean, I feel that's besides the point. OP, it just doesn't sound like you're that happy in the relationship. And whether he's autistic is completely irrelevant. \n\nLike, if he was diagnosed would the issues you described bother you less? Do you somehow think a diagnosis would change him? What if he's just afraid of commitment and not affectionate but neurotypical? \n\nI do think he's being a dick by just sulking rather than talking, but if I was in his place then yea... I might be annoyed a partner is armchair diagnosing me rather than discussing actual issues they have in our relationship. \n\nSo like, If you didn't, its worth having a conversation about the things that bother you rather than bringing up autism. But if you did and he reacted the same way then well, tbh time to evaluated whether moving in is a good idea bc it might just be a bad fit for the both of you.",
            "Yeah, offering a diagnosis of a psychiatric condition to someone who didn't ask your advice is almost always a bad idea. As you can see, it didn't help manage the issues at hand and just made him mad. You're also not a professional. I could have told you not to do this.",
            "Regarding his symptoms you described I would guess he is pretty awful as a partner.  You are sure you want to have a long term relationship and start a family with him?",
            "There is a stigma, particularly with males, around autism.\n\nRegardless of whether or not he “knows already”, or anything else, I can somewhat understand his response.\n\nIt can be, but shouldn’t be, seen as insulting. Regardless of your viewpoint.\n\nI’m not saying I agree, and I think you did the right thing, I’m just suggesting!",
            "Being in a committed relationship with someone means that their mental health and status affects you too. It’s understandable to want to know about this when you believe that there’s something there. People with undiagnosed conditions, especially people on the spectrum who are unaware of it, have such a harder time and get added mental stress because of their struggle simply because they don’t have the knowledge and ways to help them navigate life according to their needs and challenges. \nThat being said, if he doesn’t want to go see someone and look deeper into this then you should take a moment to decide if you are happy to be with him just as he is and with the anticipation of more challenging situations when there’s any change or increased stress in your lives.",
            "Yes you effed up.But it’s because you’re  realizing you two aren’t on the same page. He may not have the ability to be a parent. He can’t stand disruptions to his routine? Don’t have a baby with him. The problem is not his possible autism, it’s that you should be walking away to find what you want or choosing to be happy with him as a spectrumy person who may never be able to happily give you what you want. The name for his group of behaviors/symptoms doesn’t matter if he isn’t looking for it. I’m sure you’re both amazing people but this does happen and it’s heartbreaking.",
            "I am in a relationship like this, but successfully so. I am on the spectrum. I did not know this for a long time, but suspected it. After living with my girlfriend for many years, she has agreed with me.\n\nSo, from my perspective, it was sort of a self-discovery thing for me. But had she told me instead of me figuring it out, I would have been fine with that.\n\nWhat you have written is basically me. However, I have learned that when my routines break, it is usually because something unexpected happens. Social situations can be stressful, so I highly recommend not requiring him to do too many social situations. Family stuff -- definitely do those. If you all have some friends, no problem. But large parties or going to places with tons of people? That would require a lot of advanced notice.\n\nWhen I go on vacation, my partner finds links and videos of each thing we're going to do. Then I watch them and read through them so I know what to expect. It helps a lot, actually, with vacationing.\n\nI cannot generalize what will work with others with autism. But what I do know is if you can understand his needs a bit, and cater to them when reasonable, I think it is extremely fair for him to do the same for you. If you become part of his routine, that is important.\n\nThe affection part is difficult. Requiring anyone to be told to show affection can even make the affection seem forced. Forced hugs and kisses, for example, are also terrible. Reading that book on love languages can often help understand how a neurodivergent person expresses affection. I believe there is a neurodivergent love languages book, too.\n\nAnyway, in a relationship where someone has autism, their partner does have to do a bit more work to understand that person. It is difficult to ask someone to \"just be different.\" I know you have not asked that of him, but you get what I mean. But it is ENTIRELY REASONABLE for you to want to be part of his routines, because if you are not, then you will always be on the outside. You do not need to become part of every routine he has. But, for example, establish a few routines together, like watching shows before bed, going on a date once a week at the same time and day, etc...",
            "What is the point in being in a relationship with someone that won't express emotion or show you affection...?",
            "https://i.redd.it/g35ake4e648d1.gif",
            "Dude sounds like a complete r\\*\\*\\*\\*d.",
            "I think he knew, and he’s probably been worried about how you’d take it. Just be patient with him, I don’t think he actually hates you.",
            "Sounds like he's just a douchebag",
            "This is kind of a TIFU only because it seems a little weird to bring it up in that context. Like you might be 100% correct, but what would that information add to the situation? An autism diagnosis isn't going to make the coming changes any easier to navigate, it's not like they can prescribe pills for that (and if they can please give me some, since I'm also autistic and don't handle routine changes well at all). So it's not really a bad thing to bring up, but the timing is maybe a little questionable.\n\nHis reaction makes the TIFU more on his end that yours though. There's nothing wrong with being autistic, so getting upset and flinging slurs just because someone raised the possibility is kind of a red flag that he might actually be a bit ableist about it. As others are pointing out it could also be that he's worried you're ableist and going to treat him differently, but that's still not a great defense for the slur. \n\nSeems like an easy fight to recover from though, so hopefully you guys (mostly him) calm down and talk it out better. Not a particularly big fuck up and if it snowballs into one then that's probably just you dodging a bullet to be honest, this is nowhere near the kind of comment that should ruin a healthy relationship.",
            "So… you know, that he is anxious and has problems to express emotions, and expect him to be able to handle that you suggest that he is autistic? It’s not like there is a good way to react to such a statement. In the past I was just overwhelmed and confused if I got confronted by such statements as there is nothing I could „do“ following this discussion or information. I would just let it rest and adress the immediate topics.\n\nDid you live together already or would this be the first time moving together? For some people it needs some real time to adapt. Is his living situation giving you both space? Can you both still retreat and do your own stuff? Sounds to me like this could be an issue for him. So perhaps think about how it would not be this much of a change, but just you being around most of the time.",
            "That pretty much describes me in my 20s. It took me a while but I became aware of my failings and endeavoured to change them. I’m not that person anymore.\n\nI was always afraid in the back of my mind I was autistic or had Asperger’s. I think a diagnosis wouldn’t have helped me… in fact a label would have made me feel that this kind of behaviour was inescapable. Now I’m in my 30s I’m a normal well adjusted human being in a healthy relationship with my loving gf. \n\nWhat I’m getting at is maybe he knows but wishes he wasn’t… without a diagnosis he has some sort of hope and perhaps felt that bubble burst. Everyone’s different but it could be worth pursuing a middle ground of helping him become better adjusted without needing to bring autism into the picture.",
            "Long term anxiety can lead to the other behaviors you described. It might be better to encourage him to talk to someone about that. It could lead to him living a happier, longer life with less stress response.",
            "3 comments\n\n1. the term \"autism\" sounds horrible to many, reminiscent of institutionalised nonverbal individuals\n\nmany aren't familiar with very mild / extremely mild 'autism'\n\n\"asperger\" night be a more differentiated term\n\n2. it might be a super sensitive thing for him. so touching on the various open wounds unintentionally. \n\n3. IMHO most important point.\nmost with autism spectrum are continuously told to change this and that. this way and this way. \nit's crazy painful and annoying. \nit is hard for neurotypicals to understand how some of those tendencies are hard wired. ie change is incredibly hard. and many have tried and failed to change. \nof course, sometime change is possible and desirable. but God! \n\n\nyou might try the subs r/autism r/aspergers\n\njust my superficial thoughts. use your own thinking and judgement....",
            "Sounds like he should get evaluated. And sounds a looooot like some of the problems my autistic boyfriend has lol. He can practice, but you have to decide if it's okay for you to be with someone you have to remind to show affection and compliment you. It's not easy, so it depends on yours and his connection and willingness to work on yourselves and your relationship together. Because this behaviour won't go away, it can only improve. Best of luck to you two! 🤍",
            "> I want to preface this post by saying that I believe that there's nothing wrong with having autism and people with autism can be extremely smart and amazing individuals. \n\nWow thank you, I was afraid I was wrong for having autism and that I was a dumb and underwhelming individual.\n\nNo but seriously though, without reading the rest, a statement like that kinda stands out. Let me provide an analogy or two:\n\n> I want to preface this post by saying that I believe that there's nothing wrong with being gay and people with homosexuality can be extremely smart and amazing individuals. \n\n> I want to preface this post by saying that I believe that there's nothing wrong with being black and people with black skin can be extremely smart and amazing individuals. \n\nNo offense taken by the way, but it does stand out. I'm going to enjoy reading the rest now and hopefully the TIFU comes from the exact same lack of subtlety in being overbearingly politically correct.",
            "This is a FU. \n\nIt’s not your place to diagnose someone else’s conditions especially if he didn’t ask for it. \n\nDid he ask you to diagnose him? \n\nWhether he is on the spectrum or not, it’s his call if he wants to know or not. It’s his wellbeing, after all.\n\nSwitch it around and he “lovingly” tells you that he thinks that you’re bipolar then ticks off a list of symptoms. You’d probably feel betrayed and hurt. “Oh so you’ve been secretly judging me the whole time?”\n\nThe real trained specialists I know don’t offer a diagnosis if they’re not asked. I know a psychiatrist who’s a well respected doctor in her city and not even once did she tell me anything about my mental health even though I do have some trauma issues. \n\nWhat you should have done was offer to go with him to see a professional if he feels like he needed to see one but never to diagnose him. \n\nMaybe this is indeed something he really struggles with but could not bring himself to face the truth. With your approach, you just gave him a reason to build more walls to protect himself.",
            "https://youtu.be/w6oiH117FW8?si=tekQSD2NkGJGGauH\n\nYou should have done it in song.",
            "“I know I’m not in any way qualified honey, but I think you’re autistic” - ungood\n\n“I can see you struggle in some situations. Is that something I or someone else could help with?” - better, helpful, kinder.",
            "💀 this 98% sounds like me",
            "The thing is we're all on the spectrum. It's just a question of how much. Sounds more like he knows already, but is upset you're reminding him.",
            "Did you have this conversation in person? If not- I think you should consider asking him for a time to have a conversation in person.",
            "A diagnosis for him will not give you what you need from this relationship",
            "Dump him",
            "Those traits do seem to be consistent with autism, but it sounds like he doesn't really know what autism is, which is why he lashed out at you. That internalized ableism means he probably won't get tested or be open to going to therapy to help cope with some of these symptoms. Don't expect him to change for you-- make sure you are ok with being with him as he is.",
            "No, today you learned that you have no future with this man.  A partner is someone that you can talk to about just about any subject. \n\n\nMy brother is the same way, BTW, total denial about being so far down the spectrum with me, and many years on I don't think I am wrong.",
            "Are you his mum or girlfriend?",
            "I took it pretty hard when I was told.   Give him time and space to compute it.   He might start connecting the dots himself now that you brought it up",
            "Do not have children with this man.",
            "He just sounds like a whiny, irritating person. Why would you even want to date someone like that?",
            "I don’t think you f ed up. I think you brought up some thing that could actually be helpful to your boyfriend. There are way too many of us out there who are walking around not ever knowing what’s the problem or what’s different about us. You’ve set something in motion for him that could really be helpful. Try to think of the best for him. And understand as well that what you said, you said, out of love, caring, and concern.",
            "Not gonna lie this looks like a ticking time bomb of a relationship. You either need to discuss difficulties and how to get through them together or discuss a breakup.",
            "Yo! Don't get relationship advice on the internet. We don't know you, you don't know us. Follow your heart and turn to your support network not some Reddit community. What do your parents or friends have to say about this?",
            "As someone who discovered they have autism at 32, thank you! My autism has gotten me fired from 2 jobs, caused me to drop out of college, and nearly got me fired from another job. I wish someone had told me I have autism 10 years ago.",
            "Awww she has a little autist to play with.",
            "I agree with everyone else if he is rigid on changes then marriage is NOT going to work out for HIM or the two of you.",
            "Do you really want this relationship to be your life because that's what moving means. Are you ok with very little affection forever? Are you ok doing everything on his time? Again you might be fine but you can't change him so if not really think this through.",
            "> We finally set a date that works best for *me* moving [...] *His  initial* reaction [...] was extreme worried.\n\nThen there is a lot of talk about you discussing your needs with him.\n\nYou notice signs and sit down to discuss *his condition* with him. You don't try to inform you more on the subject you assume might apply and maybe see how you could help to meet his needs better?\n\nIf he's on the spectrum, this sounds like a big red flag for him and if he isn't, you still should try to meet him in the middle.\n\nI don't want to invalidate your needs and feelings, but this post explaining his difficulties has so little empathy for his side, that you both should figure out if you're what you need as partner. Yes, sitting down with him and telling him gently he is different doesn't sound gently to me. It still sounds like telling him, he's a problem.\n\nI have similar needs as your boyfriend, only a bit more relaxed in the daily routines, and this kind of talk was reason for two mutual breakups so far, because we thought it would work out, but it doesn't, if you expect to only work on him.",
            "Let him educate himself on what autism actually is. It seems that he has an extreme black and white view on it, purely caused by the general view people have of it. Autism doesn't have to be a bad thing. It's just a certain way your brain works. The R word is used because the most visible autistic people act oddly from \"normal\" people, mostly in social settings.",
            "Honestly no FU from you. You noticed things that make your relationship harder and youre giving him a reasonable explanation dare i say an \"excuse\" for these but he just goes through the roof?\nEither means youre right or that hes a red flag, i cant tell from here so i cant give any advice either.\n\nBest of luck to you two",
            "> Extreme interest in a highly specific field of academia that he is highly successful in\n\nThis can also be an indicator of Asperger's Syndrome. Which is common to be paired with someone on the spectrum",
            "He is 100% autistic, and has issues with how he views himself. Lack of confidence in many areas of himself. You can't fix a problem unless you both acknowledge it and want to fix it. If he doesn't want to fix it then he can't fix it. If he doesn't even have the capacity to admit he has a problem or multiple problems then he's completely lost.\n\nI also have an autistic friend who will sometimes fly off the handle and assumes I meant to hurt him over me sharing a meme that he somehow found offensive. Some people just put intent on others that was never there. At least my friend is willing to undo his response less than 1 minute later once his common sense returns.",
            "Think you kind of just overthought it lol",
            "I mean the symptoms you listed are traits that someone with autism could have, but the problem is ;\n\nAutism is a spectrum, so there's a wide range of symptoms and they all vary between each individual, some people have severe cases whereas others have lesser-cases and you wouldn't even know, hell there's some pretty big celebrities with autism.\n\nIn your boyfriends case, I'd say it's likely but its possible he's someone who just likes to keep life in a routine and isn't a social butterfly and prefers his own company. As for the inabiltiy to express emotion and understand others & lack of affection, that's something you kinda learn with time, so if you're not a social person and rather keep to yourself, you won't pick up on that.\n\nThere's a lot of belief and talk about anxiety being hereditary too, so ya never know.\n\nAs for him being bothered, yeah that's probably a sign he has it, but at the same time I guess it can come off as offensive for your significant other to genuinely ask if you've got some form of a mental disability that is looked down upon / used as an insult & joke by people.\n\nHis anxiety could be pretty severe though to the point where things like his routine and so fourth have to be strict and not too all-over-the-place\n\nI get being worried about starting a family, who wouldn't be? That's a big step lol, moving in aswell is probably quite worrying too, I mean at that point your partner lives with you everyday and it's fairly different to a family member, so it's something most people take time to adjust to, especially if it's the first time they've lived with a partner.",
            "My son had the same symptoms plus others and was diagnosed adhd. I say had bc he's on supplements now that has improved his symptoms drastically. I know alot of autistic and adhd symptoms overlap except for a few.",
            "It’s a spectrum.  We are all on it more or less.",
            "Sounds like a Narcissist, not Autist.\n\n-Withdraws in any stressful conversation or situation\n\nAutists withdraw from ANY conversation, not just the ones that annoy them.\n\n-Very rigid work/ food/ gym/ sleep routine.\n\nAutists often find it difficult to keep routines, and routines are to counteract that by offering the autist regularity. The routine isn't a symptom of autism, it's a treatment for it.\n\n-Extreme interest in a highly specific field of academia that he is highly successful in -Struggles with 'common sense'\n\nThese two cancel each other out. He isn't highly competent and then semi mentally impaired, he's just using weaponized incompetence to abuse your situation.\n\nSTOP making excuses for his behavior. As u/CalmlyChaotic93\n points out, the actual diagnosis means very little when compared to your quality of life. He treats you like crap, when he wants to, and you are walking on eggshells to make him understand your motives are out of love. That's because he's an jerk and his motives are just self serving. Autists care that they hurt your feelings, even if they struggle to understand how/why. Jerks only care about themselves.",
            "It does anger me that they call it a disability because your actually too smart. I think it is my superhero power.",
            "I am autistic and so is my brother",
            "We were diagnosed Asperger and they recently took that out of the medical books. I think they should have left it in there. Hormones also play a weird role in the spectrum. My brother has never had a girl or boyfriend. He's absolutely not interested in sex in general. I have had girl and boyfriends lol even an eex-husband.",
            "Most people use one side or the other of their brain. Autistic people use the entire brain. That sounds silly but it's true.",
            "We’re all on the autism spectrum somewhere.",
            "yup total headflip",
            "And OP mentioned starting a family..... But that changes nothing... they're just little people who are perfectly reasonable right /S The question is whether they're saving for a divorce lawyer or are going to have lots of extra bills. I knew someone neurologically normal who never had a roommate and couldn't adapt when the LDR became a wife. They were separated in months because she changed his routines. Duh. That's the point of marriage.",
            "Jump up at 2:30 am because the diaper changed at 1:30 am is overflowing. Go on the Cubscout campout. Take cat to the vet. Get to the airport on time with the baby, the toddler and the car seats. Read the story again!",
            "You mean he can't jerk off before going to sleep anymore? The horror.",
            "This needs to be the top comment.\n\nI think OP hopes with a diagnosis boyfriend will change and becomes the man she wants to have a family with. That won’t happen.",
            "Will agree; people with autism can be loving excellent partners, or abusive isolating manipulative dirt bags (like the rest of the population).  Ignore his symptoms you construe as autism (which he may or may not have, many are culturally taught behaviors for men), he's telling you a lot when he has a hard time picturing you working into the routine of his life...  I'm also disgusted by his response that being in the spectrum makes one \"r****d\". That's a pretty massive red flag that the guy is insensitive, conceited, and probably is involved in a pretty toxic social group.",
            "Well said.",
            "My friend is going through this with a buddy who hates and refuses to accept his autism diagnosis, and drops the R word repeatedly and talks about all ways autistic people are terrible. Ironically, absolutely not picking up on all the social queues my friend drops about how he's calling her and all their friends some really bad shit.",
            "God, if anything, knowing made it easier to cope with, for me. I have a reason why I'm like this, it's not me making no effort. I have a way to articulate to other people why I do a thing a certain way to produce the result that they want, when everyone else can just do it this other way. That yes I have this deficit compared to my peers but the reason I have it is also the reason I do this other thing way better than they can.",
            "150% agreed, as some also diagnosed with multiple Neuro developmental disorders, autism being one of them.",
            "Truth.",
            "Idk if it's internalized ableism to not really wanna hear untrained individuals diagnose you with shit. I'm not a professional either, so I keep my opinions to myself.\n\nMaybe instead of OP diagnosing him, they should have suggested he visits a behavioral professional - and that's only if he actually has a problem with how he is. If he's at peace with how he is and OP has a problem with it, then maybe they're just incompatible. What's so bad about that?\n\nBased on the rest of this post, I think a break up is an excellent decision. Diagnosis won't change all their current issues.",
            "Dunno... I'd not say this suggests that he necessarily knew; but I guess everyone reacts to the possiblity / reality of being on the spectrum differently. Personally I found a diagnosis explained a lot and gave some peace of mind. \n\nUnsurpringly ASD can fuck relationships right up; I can see a lot of the situations in the OP having played out in my last relationship.\n\nBottom line it sounds like the OP's BF needs to sort himself out one way or another; whether that's accepting the suggestion and getting an assessment, raw-dogging it and trying to improve his behavior himself, or fucking off. \n\nFWIW I don't think the OP fucked up; sounds like it needed to be said.",
            "That's the thing about spectrums, you can fit anyone and everyone on them it's not a black and white diagnosis.\n\n\nIntrusive thoughts, social interactions, inappropriateness, routines etc. are all things everyone deals with differently all the way from but of a sperg sometimes to full blown low functioning autism.\n\n\nIntelligence and sexuality are different spectrums too be it different types of smart or attraction.",
            "A diagnosis can be the first step to him accepting his situation. (Seems like he is still somewhat in denial, at least to his gf) After acceptance, he can start looking outwards for some help. A therapist or an autism coach can do wonders.",
            "Except when I directly asked he assures me he wants me to move there with him. He has had problems showing emotion/affection with all of his ex partners too. Trust me his behavior is confusing and makes me feel insecure all the time, but after three years I just have to take what he says at face value.",
            "If what OP says is true then high functioning autism is more likely than AvPD. The intense interest in one part of academia and rigid schedule fit the criteria better.",
            "I thought that too initially, but when he isn't avoiding, he has a really hard time explaining his emotions. Or even when he isn't avoiding, he has a hard time expressing affection. It says that is slips his mind to compliment me on how I look ect. He means well, at first I thought he was just an a**hole but he does care in his own way.",
            "I thought that if he didn't know already it could help us better deal with the challenges, because it could be recognized as autism and not cause as much arguments.",
            "They're a couple, not strangers...jesus",
            "We should be able to communicate our concerns with the people we love, especially when their behavior is damaging to the relationship.\n\nAn acquaintance gently suggested I may have ADHD. Such a pivotal moment that led to me getting a diagnosis and learning much more about myself and how I interact with the world.\n\nI struggle with life sometimes, and having this new understanding has allowed me to be more compassionate with myself. It’s also given me the chance to gain a very specific toolset that helps me not be hurtful to others when I deregulate.\n\nKnowledge is power!",
            "Youre ridiculous lmao. She didnt say you have Autism, she said i see some symptoms of Autism and it might be a good idea to get those looked at. If your PARTNER cant tell you they notice something about you, who the fuck can? \n\nLike. If you notice they arent their normal self and cleaning up or doing the things they care about for months, you might talk to them about looking into depression and seeing if thats something they need help with. In your situation, YES you should tell your partner if you have noticed legitimate symptoms of them being bipolar and not just trying to gaslight them into thinking they're crazy.\n\nShe didnt diagnose him. She told him she noticed things and that he should investigate and possibly GET diagnosed by real trained specialists. And if he doesnt want to, thats fine! Shes just offering her insight to her PARTNER of multiple years which is what someone should do in that situation. \n\nThe point of getting diagnosed is to get help because now you know what youre dealing with. As a partner, your goal should always be to help your partner even if that means talking to them about things they don't want to hear and giving them the option from there.",
            "This 100%, unless you're a trained professional and you get to diagnose people in your field you have no right nor the skill needed to do so.",
            "OK, so if you fell and hit your head and a couple of hours later you start to have headaches and vomit and your partner says that you may have internal bleeding , you would tell her not to diagnose you and you would feel betrayed? \nSHE did not provide a formal diagnosis, just shared with him her.suspicion.\n. If you live together with someone and they act outside of the spectrum of normal people, one option is just to accept that they are douche bags / or leave them. The other option is to understand that potentially they may be wired differently and simply don't recognize or respond to social clues the same way as others. \nif OPs later is indeed on the spectrum and they both accept it, it will be easier to handle specific situations for both of them. il\nOP did not offer a diagnosis, she simple shared that based on living with the guy for 3 years she suspects Thay he may be a bit different. \nHow is it a betrayal?\n\nThere are literally hundreds of famous people who are very successful and who have announced that they are.or the spectrum.  Just a short list. \n\n1. **Temple Grandin** - Renowned animal behavior expert and professor of animal science.\n2. **Dan Aykroyd** - Actor and comedian, known for his roles in \"Ghostbusters\" and \"The Blues Brothers.\"\n3. **Daryl Hannah** - Actress known for her roles in \"Splash\" and \"Kill Bill.\"\n4. **Anthony Hopkins** - Acclaimed actor known for his role as Hannibal Lecter in \"The Silence of the Lambs.\"\n5. **Susan Boyle** - Singer who gained fame on \"Britain's Got Talent.\"\n6. **Greta Thunberg** - Climate activist known for her work on raising awareness about climate change.\n7. **Satoshi Tajiri** - Creator of Pokémon.\n8. **Sir Isaac Newton** - Mathematician and physicist, often cited posthumously based on historical accounts.\n9. **Nikola Tesla** - Inventor and electrical engineer, also often cited posthumously based on historical accounts.\n10. **Tim Burton** - Director known for films like \"Beetlejuice\" and \"Edward Scissorhands.\"\n11. **Elon Musk** - Entrepreneur and CEO of companies like Tesla and SpaceX.",
            "That’s false and a harmful sentiment. You can’t be a little bit autistic, it’s a neurotype. You either are or you aren’t. Your symptoms will vary, and you may be deemed as having high or low support needs based on those, but it’s not a linear spectrum from “all to nothing” like people think.",
            "What the fuck kind of response is this.",
            "He sounds like a jerk... Honestly I've met a fair number of men that also don't pick up that specific social cue who are not on the spectrum. You can have autism and be a jerk, and also not have autism and be a jerk; I say ask this to say, I don't think missing this cue is 100 percent due to the diagnosis...",
            "Exactly how I handle my AD(h)D. It helps you deal with the challenges in a productive way instead of repeatedly banging my head into the wall hoping I don't get a headache this time.\n\nNot everyone understands, but such is life. In the end I'm taking strides changing my life for the better now, at almost half a century old, and I am proud of where I'm going.",
            "Even if not, it's obvious he has some weird hangups and misunderstandings about autism.",
            "The problem is that basically no one is out there diagnosing adults with autism unless you ask about it straightforwardly. I am quite obviously autistic (they had to put me in a social skills class as a child) but I had to ask for diagnostic tests myself at age 28.\n\n\nI've heard more than one autistic adult say that they saw a therapist for years on end and when they finally, themselves, considered the possibility and brought it up to the therapist, the therapist said \"Oh, I thought you already knew and just hadn't told me.\"",
            "What is the point of adult diagnosis? Is there now any drug or therapy which makes it easier for a person with high functioning autism (formerly called Asperger) to function as a spouse, parent or employee? Or is it thought that a diagnosis per se makes things better somehow? (“Don’t mind his sulking and rejection, it’s just his autism and nothing personal”) Or is it supposed to gain some ADA  provisions at work, or some disability income?",
            "What he did or didn't do with ex partners is irrelevant. You need to evaluate if your own needs are fulfilled enough RIGHT NOW, for you to be happy longterm if it continues exactly like it is now.\n\nPeople rarely change their behaviours. I just got out of a relationship myself, where my partner weren't showing me the affection I needed. I hoped it would change, but surprise, surprise it didn't. \n\nIt was nothing wrong with them, we just weren't a good match for eachother.",
            "So why exactly do you want to be with him?",
            "If what you suspect is true, then him feeling worried about you moving in is not the same as him not being ready for living with you.   \nIt just means that he has a routine and he is unable to understand how he can function when that routine is disturbed.",
            "He might want you to move in, but it won't make him a better partner.  He's still going to be the emotionally unavailable, rigid, affectionless guy he was for his exes.  After three years, what is amazing enough to put up with that?  Without emotional support and affection, what even makes this a romantic relationship? ",
            "Uh this doesn’t sound healthy. He makes you feel insecure? My partner and me have our things but he does not make me feel insecure. Because if he would do so, repeatedly…, I would leave.",
            "You are an adult. You can compartmentalize and rationalize the pain and heartache of him being different in terms of his way of showing affection and getting frustrated when his life is disturbed. You said you want a family. When you have a child with this man, and they see how other fathers behave with their children, and they ask you, \"Why doesn't daddy love me?\" what are you going to tell them?\n\nEdit: Or worse, he is autistic, which has genetic links, and your child is autistic. Is he going to reject your child for a being autistic?",
            "I wasn’t talking about the personality disorder though. I was just meaning that regardless of what he has, he has tendencies that cause him to withdraw on important topics.",
            "Being emotionally stunted isn't at all uncommon in neurotypical males. That particular aspect can exist on its own, and doesn't require an autism diagnosis, it requires a therapist.\n\nMaybe it's best to simply suggest a medical professional rather than prescribing your partner with a diagnosis. If he goes to the gym for his health, you have a very good case that you can make on his mental health without a diagnosis.",
            "That makes sense. Does that bother you? Can you live with that? He won’t be able to change who he is completely.",
            "Even if he isn't autistic he's still allowed to have boundaries or feel uncomfortable with big changes to his lifestyle. To an extent \"oh, it's the autism\" can help a bit with understanding \"why are they being so fucking difficult about this?\" situations, but at the end of the day you're both just people trying to compromise over navigating life together. Knowing why a disagreement is happening doesn't solve the disagreement, y'know?",
            "Maybe true, maybe not, but maybe he wanted a hug while you told him?",
            "Exactly this. \n\nI spent 30 years not knowing why life was so hard for me. I wish more than anything just one person had said, \"Hey, I think you may be autistic\", to my face, I could've got help sooner.",
            "But did he ask to be diagnosed? \n\nWhether she said that he has autism or has symptoms of autism is purely semantic. \n\nDoes this change the fact that she has zero expertise nor training on the condition?",
            "I’d be annoyed that my partner is trying to play Doctor with me, whatever the case may be.",
            "I wrote my comment based on research I read - albeit some years ago. Has the thinking changed? As far as I’m aware what I said is still the case but I’m happy to be educated as I’m genuinely interested.",
            "Yeah a lot of men are that elephant from the Simpsons",
            "That's reasonable, but I think thay decision is for the individual to make. Autism being on a spectrum means that everybody is somewhere on it, but for the vast majority of us, our place on it isn't the root cause of our issues.",
            "It all depends where the behaviour comes from. If the behaviour comes from core personality traits, then they won't change.\n\nWith the right therapy / coaching, people with certain types of autism, adhd, etcetera, can learn to mitigate behaviours that are holding them back from living more fullfilling lives.\n\nMy severe lack of object permanence can be hugely mitigated by religiously using lists, reminders, putting my things in fixed places. I don't always succeed, but it's now to a point where I am not constantly frustrated, and as a result get overwhelmed and give up before even trying.",
            "If OP is also on the spectrum, that would increase the genetic concerns. Has she seen a psychiatrist for screening?",
            "It would change things, because we could both recognize that there's a difference in our abilities to communicate/ express emotions. That way both of us could work on it instead of him getting mad and frustrated that he doesn't understand why his, \"brain just isnt wired that way\" - his words",
            "It does make it easier to deal with though … when you know someone is on the spectrum you can adjust your expectations.",
            "It definitely changes how each party feels about the disagreement and goes about resolving it though.",
            "I would have if I wasnt 1200 miles away from him.",
            "Definitely! And if anyone knows you and you should trust with telling you, its your partner. I swear the people saying he didnt ask to be diagnosed or shes wrong for saying anything dont understand communication in relationship. If theyd been dating a week and barely knew each other thats one thing, but when youve been together years, you know your partner (hopefully)",
            "If you notice traits in your partner that knowing what it is could help them in their life, you absolutely should tell them. Neurological things cant always BE noticed by the person who has them. People who are suffering with Bipolar or BPD might have always just been told theyre overly emotional. People who are on the spectrum might have just been told they're weird and they never looked into it more. Thats why someone like a partner who knows them intimately can be someone to trigger that path of getting a diagnosis because you dont always see those things about yourself.\n\nAnd this whole \"he didnt ask to be diagnosed\". Who ASKS to be diagnosed by someone not a professional? And she also DIDNT diagnose him. She said ive noticed these symptoms, you should go GET diagnosed if youre interested in that. \n\nYou dont need to have expertise or training on a condition to notice signs of something. If my partner had weeks where they were really happy and then weeks where they were really sad and high mood swings out of nowhere, id ask them if they noticed and had looked at being bipolar or if they felt manic.\n\nIt is NOT a bad thing to talk to your partner about things you notice about them. I dont get why you or anyone would think thats bad. Especially when its someone youve spent years with and plan to be together with for the long term. You shouldnt just go up to random people calling them autistic, but if you notice traits in your partner, then you can have a conversation with them!",
            "Yes, the thinking has changed, and I really don’t have the time to educate you other than what I explained, sorry. You’ll just have to take it from someone fully on the autistic spectrum. You can probably research it yourself with a few simple google searches if you’re interested.",
            "I have no problem with the notion that we're all on the spectrum neurologically but being so directly involved in creating inclusive policies in my work specifically for Autistic people I have found that mainly people from the Autistic community don't like this expression as it diminishes and downplays the challenges and barriers they face.\n\n\nLike I said, not my opinion but one I hear a lot",
            "Oh for sure. I am not saying he shouldn’t get evaluated. I’m asking more like does it bother you that he has a hard time showing you affection? Or having difficult conversations? Even if he gets a diagnosis, those things will likely continue to pop up long term.",
            "It shouldn't, unless we're concluding that non-autistic people should be forced out of their comfort zones or something. Maybe we're speaking too generally, some specific examples would probably help. Could you provide some where you'd treat someone differently based purely on their autism diagnosis?\n\nLike the people in my life bend over backwards to work around my issues and preferences, which has a massive impact on my lifestyle and theirs by extension (especially my wife for obvious reasons). However, I was only diagnosed a few years ago and they were already doing that beforehand, because the important part was the \"issues and preferences\" not the autism diagnosis. But everyone has issues and preferences, that's not a unique thing that only has to be respected when someone is on the spectrum.\n\nAnd to be clear it's also not a \"get your way all the time\" pass either. You need to be able to compromise sometimes, which also goes for autistic people. Just because I'd prefer something one way doesn't mean it can always be that way all of the time, it's still important to pick your battles and know when to back down just like anyone else.\n\nAll I'm saying is that you should care about what the other person wants and needs in a relationship, and they should care about your wants and needs. The specifics of how to balance those things is going to be unique for every combination of two people regardless of their autism power levels, so it just seems very weird to frame it as an autism issue (and for once seems almost ableist against allistics, like their preferences aren't as worthy of consideration).",
            "I doubt a lot of them have ever had a relationship, let alone a good one, to be fair.\n\nIt makes me wonder; what do they actually want in a partner? What do they talk about every day?",
            "I’ve just been doing that and as I understand it everyone has autistic traits but you’d need a high number that were affecting your life for diagnosis. \n\nI think you’d need to be qualified as a psychologist or something similar to know the answer.",
            "Not sure why you were downvoted. These are important questions that OP should ask themselves.",
            "Yes, you need to get down to why you guys have a hard time communicating with each other. Because a diagnosis is just going to confirm or deny your suspicions but it won’t change the fact that you communicate differently. For myself I struggle with someone who implies things in conversation and I take their word at face value and in return I say exactly what I mean outright and don’t imply anything. The problem is the person is asking what I mean by what I am saying and I say “exactly what I said” they will draw a different meaning. It was only recently we discovered the difference after multiple discussions, and we took the phrase  “Never attribute to malice what can be adequately explained by incompetence or stupidity” and we swap out incompetence and stupidity for misunderstanding. So whenever one of us is bothered by the other we will sit and think about what that person really means before reacting or let them know how it’s coming off to the other person and they can explain better what they mean. This might not be the same for you because your communication issues could be completely different but trying to figure out what the other person’s intention and what they’re trying to say is a good start.",
            ">Could you provide some where you’d treat someone differently based purely on their autism diagnoses? \n\nI didn’t say autistic people need special accommodations or treatment over anyone else for their relationships to work. I said being aware of a diagnoses would change how the involved parties might feel about a standard relationship issue (such as the timeline around moving in together) and what actions they might take together to resolve it.\n\nAnd while people *should* care about their partners, just about all of us have experienced the opposite at some point in time. The knowledge of that possibility definitely taints our gut reactions and intrusive thoughts in every scenario, even with new partners. *Knowing* that someone is too painfully literal to play games and loves you dearly, but just needs a lot of room and time for their model trains or whatever, takes the anxiety away from the neurotypical partner and makes it easier to explore alternative options about the timeline of living together. Similarly, *knowing* that a partner sees and loves you as you are, and isn’t just checking items off the life list with whoever is around and looks like they could be made to fit in that box, makes it easier on the neurodivergent partner to feel safe enough to explore those options as well. \n\nTo address the rest of your post, I’m also on the spectrum. There are certain things I just cannot do or tolerate. I’m aware of them because I’ve already tried and failed to change them so that I can be like everyone else, and as they are clearly not ‘preferences’, I don’t need a “get my way” pass - I’m just unable to compromise on these things, and that’s that. It’s not that I don’t think conflicting needs don’t matter or that it’s everyone else’s job to change, but the fact remains that a compatible partner will have to accept these things to be with me, much as they’d have to accept a pet allergy or dietary restriction. \n\nIt’s perfectly fair if a potential partner isn’t interested in that, but all I can do is make sure they’re making an informed decision. That’s where diagnoses and self-awareness is most helpful.",
            "Everyone has traits that could be construed as autistic, but yes it’s the intensity of those traits and the specific combination of them, along with a few specific traits that are exclusive to autism that neurotypical people just won’t have, that makes someone autistic.\n\nThat’s different than saying “everyone’s a little autistic.” That just diminishes the struggle autistic people go through.\n\nAnd I actually know more about autism than the clinical psychologist I see because I’ve researched it more than she has, she absolutely is willing to learn from me on the subject, I don’t see why you can’t as well. Have a good day!",
            "I’m sorry to have upset you. I made my comment in the spirit of an ally. The point I was clumsily trying to make is that it’s in everyone’s interests to treat people with autism with more compassion and understanding.\n\nYour politeness comes off as more patronising and insincere than genuine but maybe we can both agree to try to be a bit more open-minded and kinder. I was only asking my questions to try and learn a bit more."
        ]
    },
    "TIFU by getting pickpocketed in Paris and landing in jail": {
        "title": "TIFU by getting pickpocketed in Paris and landing in jail",
        "score": 75,
        "url": "https://www.reddit.com/r/tifu/comments/1dlomwp/tifu_by_getting_pickpocketed_in_paris_and_landing/",
        "content": "It was supposed to be a dreamy Parisian afternoon, meandering through Montmartre with visions of croissants and quaint cafes dancing in my head. Suddenly, reality snapped back with a jolt — my wallet was gone, swiped clean by a nimble-fingered thief.\n\nDriven by a surge of adrenaline and anger, I made a split-second decision that would haunt me. Ignoring all logic, I chased after the culprit through bustling streets, dodging pedestrians and ducking into narrow alleyways. Miraculously, I caught up to him and confronted him, demanding my wallet back.\n\nWhat followed was straight out of a cliché action movie — heated words in broken French, a scuffle, and yes, even a baguette swung in defense (though, sadly, not by me). In the chaos, I managed to wrestle my wallet back, but my victory was short-lived.\n\nBefore I could savor my triumph, the sound of police sirens shattered the scene. Turns out, vigilantism isn't exactly smiled upon in the heart of Paris. Amid confused explanations and awkward language barriers, I found myself in a cramped jail cell, surrounded by fellow tourists and disgruntled locals.\n\nHours later, after much bureaucratic ado and a crash course in French penal code, I was released with a warning about the perils of taking justice into my own hands. As for the pickpocket, well, he likely slipped away to pick another day.\n\nLesson learned the hard way: next time, I'll secure my belongings and leave crime-fighting to the professionals — or at least refrain from swinging baked goods in the pursuit of justice.\n\n\nTL;DR: Got pickpocketed in Paris, chased down the thief like a wannabe action hero, ended up in a French jail cell for my troubles. Lesson learned: let the professionals handle crime, and keep my baguette-swinging urges in check.",
        "num_comments": 42,
        "comments": [
            "Something similar happened to me in Barcelona (and I'm from Catalunya, I'm not a foreigner). A thief snatched my friend's purse and I ran on pursue. I was faster so I quickly catched him. Took the purse by force (I was way bigger) and the mfer tried to punch me. I didn't hesistate. I punched him back. Hard. 10 minutes later I was having a heated conversation with the Mossos d'Esquadra because the thief wanted to press charges for assault.\n\nAfter 1 hour and missing the appointment that made me go to Barcelona, I was able to walk free. But they told me that next time I should just let the thief go with our belongings. \n\nAnd the thief? They were apologizing to him and finally he left still shouting his indignation to the skies.\n\nThat was the day I lost all hope on my country.",
            "This isn't vigilantism. Getting your belongings back and defending yourself is a basic human right.",
            "I don't get it, what's the TIFU part? You handled the situation in the best way possible and you've managed to get your wallet back. The police did what they do best, which is being a nuisance. Compare the outcomes - a few hours in a cell, vs. days, if not weeks, of getting your documents and cards restored, not to mention lost cash. If I were you, my only regret would have been the un-broken fingers of a certain individual. Although then you'd have to contend with a likelihood of a much longer stay behind bars",
            "Always secure your stuff and make sure things are in pockets at all times.\n\nThe amount of times i’ve seen people casually have items leaking out of their pockets is insane, especially those whose phones are hanging from say, their back pocket, even I could reach in for that.",
            "Obvious creative writing exercise.",
            "AI-generated crap...",
            "The way those AI overuse \"shiny\" words and write in such a weird style, somehow made me cringe.",
            "Cool story.",
            "The F*ench 🤢",
            "Going to jail for actually doing the “professionals” job is wild.",
            "You got fingered by a smooth criminal..\n\nHee hee",
            "That’s illegal and they just get away? No wonder it’s such a thing",
            "F'>,^ tourist. Don't you know you're supposed to let yourself get robbed then ~~tell a teacher~~ call the police to report your crime. \n\nGetting your wallet back? Huh?",
            "Oh yeah the good old \"the thief has more right than you\".  We are embracing this philosophy now in Canada... with expected results...",
            "among rampant theft, shit and garbage in the streets... why do people still visit tourist traps? I am genuinely confused",
            "Have the professionals done their job properly? Still hearing pickpocket as common thing in Europe.",
            "Glad you got your wallet back, but jail time is a wild twist. Definitely best to leave crime-fighting to the pros and enjoy the croissants next time! Maybe take a self-defense baguette-wielding class for fun though ;)",
            "Next time, just eat the baguette and cut your losses",
            "Thanks for letting me know to never visit. What a shithole.",
            "Law is to protect criminals and super rich people, not us, average joe's.",
            "Yeah. Countries like this that treat criminals with respect and love. I can't stand those type of governments. I'm from Canada, it's becoming like this as well. Criminals are never to blame and it's always honest hard-working citizens fault.\n\nJudges especially are always looking out for the criminals and not for those who have been wronged.",
            "unfortunate. \n\n\"fools can be kings\"",
            "It's pronounced barthelona/s",
            "What do you think about Sanchez e Irene Montero?",
            "In the eyes of the law (USA, NY) once the criminal turns away to leave it is no longer self defense. You become the aggressor since the criminal is leaving and is no longer a threat to your life.",
            "Not ‘creative’ writing if it’s an AI prompt",
            "Shit is real in France believe me",
            "Yeah, and they specify that they weren’t the one that swung the baguette but then multiple times they reference keeping their “baguette-swinging urges” in check. So which is it, you swung the baguette or you didn’t? Story inconsistencies like that are really annoying too.",
            "If he left it to the pros he never wudve gotten his wallet back",
            "AI comment. Adding a smile is a scary new development though.",
            "Even if the above is true - which I don't doubt it is - are you seriously saying you're forming an opinion not to visit a whole destination of such cultural, historical and national significance solely based on this?",
            "Keep projecting",
            "Trying to make this a political issue?",
            "I don't like politicians in general and I try to never discuss politics.",
            "or assaulted an alleged pickpocket that he has no proof that he took his wallet...",
            "Based on robbery being commonplace and effectively legalized - literally arresting the victim for trying to keep their belongings while systematically freeing the perpetrators?  Yeah, a lot of people won't go to a place like that (I've been to Barcelona repeatedly but had multiple friends victimized there, it's gotten worse over time - no need to ever go back).",
            "Yes. A lot of people would.",
            "Criminality is *always* a political issue.",
            "Just an awful coincidence that the random victim happened to have OPs wallet",
            "I’m with you. There’s loads of places I will not go to, or go to again.",
            "That's ridiculous."
        ]
    },
    "TIFU by sleeping in a random person's house and then they called the police": {
        "title": "TIFU by sleeping in a random person's house and then they called the police",
        "score": 20,
        "url": "https://www.reddit.com/r/tifu/comments/1dlutq0/tifu_by_sleeping_in_a_random_persons_house_and/",
        "content": "This happened at like 4am today after i was out clubbing with some friends. Long story short we were all heavily drinking for a friend's 21st birthday and things got out of hand, we had someone planning to DD but they also started drinking so we had to take an uber home. There was a group of 6 of us but there were no options for a vehicle with enough seats so we had to get 2, it was me and a friend named chloe in one car then the rest in the other.\r  \n\r  \nThe part where I fucked up was putting in a completely different address and not double checking it with the host,  keep in mind all of us were supposed to go back to the same house. Finally he dropped us off at what i thought was the host's house.\r  \n\r  \nAt this point i don't remember much but apparently we walked right in and fell asleep on the couch, i don't even recall what the house looked like we just walked right in and went to sleep. Next thing i know i woke up to a woman screaming and telling us she's gonna call the cops. I was still blackout drunk and couldn't understand what was going but i remember her on the phone looking like he was talking with the police.\r  \n\r  \nIt took every ounce of focus to get my shit together and figure out what was going on, finally i realized we were in some random woman's house. I panicked and pulled chloe up then walked us both outside. Now we were in the middle of the street while she was still screaming at us from the house swearing. My phone was dead and chloe was half asleep. I someone got her to tell me the PIN to her phone and ordered another uber as fast as possible.\r  \n\r  \nWe got away just before the cops came and we ended up going to chloe's house because we still couldn't find their address. I'm freaking out because what if they have cameras and got our face. Ffs im never drinking again. \r  \n\r  \nTL;DR: Me and a friend got extremely drunk and ordered an uber to the wrong house. We walked right in and slept on the couch then woke up to the homeowner screaming at us and calling the police. We managed to leave before the cops showed up but i'm never doing some stupid shit like this again\r",
        "num_comments": 1,
        "comments": [
            " Well, that's one way to make new friends! Who knew crashing on a stranger's couch could lead to a run-in with the law?"
        ]
    },
    "TIFU by masterbating with a massage gun": {
        "title": "TIFU by masterbating with a massage gun",
        "score": 5615,
        "url": "https://www.reddit.com/r/tifu/comments/1dkxcs8/tifu_by_masterbating_with_a_massage_gun/",
        "content": "Early last month, I saw a video of a guy using a massage gun on his taint, and he seemed to enjoy it a lot, so I decided to try it for myself (I'm a guy too). I impulse bought a massage gun on Amazon and got it two days later. I opened that sucker up and gave it a go. It felt okay, but it was way better on my dick. I ended up using it again a couple more times over the next few days. \n\nAs the month went on, I noticed a strange feeling in my dick. It was a dull ache at the base of my penis, and it would come and go randomly. I thought nothing of it for a couple weeks, but then I started getting new sensations like shooting pain intermittently. When this month began, I felt the pain spread from my dick to my perineum, then to my glutes and down my right leg and foot. The sensations also became hot, tingly, cold, and even itchy. I knew something was definitely wrong at this point.\n\nWhat's worse is that the tingling sensations spread to my back, arms, neck, head, and even my lips. I promptly went to my doctor and learned I have pudendal neuralgia, which is irritation/damage to the pudendal nerve located in the pelvic and perineum region. I got referred to a PT and got some exercises to help increase my hip and leg flexibility which should help the nerve not be restricted by my muscles and heal faster, but the PT said it could take a full year before I'm better. They're also going to do an internal (read: rectal) check next time if I don't show much improvement to check that the damage wasn't affecting my sphincter muscles. So, while I'm anticipating that awkward exam, I gotta do multiple stretches every day while feeling like bugs are crawling on my skin and biting me, or like icy hot was applied to various parts of my body. I'm not religious, but I've been praying to God this past month cause I'm terrified this could be permanent.\n\nTL;DR: jerked off with a massage gun, got nerve damage and need PT to get better. 0/10, the orgasm was not fucking worth it.",
        "num_comments": 292,
        "comments": [
            "massage guns basically punch over and over, you really should've just gotten a vibrator or only used it on a prostate massager in the ass",
            "While I never had interest in doing something like that I now know not to do it. Thanks for cursed yet dick saving knowledge lol.",
            "thanks for the heads up",
            "![gif](giphy|fTHwjKggaFDirAEuST|downsized)",
            "You literally beat your dick and gave yourself nerve damage lol",
            "Those massage guns, in theory, could be used for ‘intimacy’, but buying a purpose built vibrator is much safer, as the force of these stronger massage units is too strong for genitals and sensitive areas. \n\nFWIW, I’m a penis owner, and I use a Doxy vibrating wand on my head and shaft sometimes, feels great for an alternative way to orgasm.",
            "LPT for everyone: just get a hitachi magic wand. They have so many attachments for all bodies, and probably won't cause your body to stop working.",
            "Tell that to /r/Massageguncum",
            "Homie you should just got a prostate massager; I wish you the best on your road to recovery",
            "Please be *very careful* to monitor your bladder, bowel, sexual function if they’re affected. The autonomic nerves are incredibly sensitive so be mindful if it’s getting better/worse/the same. Good luck 🤞🏽",
            "Please tell me you posted this review on Amazon",
            "I have a massage gun. In the beginning of your story you peeked my curiosity to try such a thing (even though I knew I was reading a tifu). By the end of your story, I appreciated the cautionary tale.",
            "As someone who may or may not have used one for the last four years….\n\nWtf how?",
            "Isn't this basically the same injury that cyclists sometimes get, where the bike seat beats the hell out of their taint, causing nerve problems?",
            "Okay that post just came in time because I as a girl was thinking to try a massage gun for that and now I definitely won’t roll the dice because I imagine my body is weaker than a man’s and that’s not worth the risk",
            "Hi OP.\nI'm really sorry about your ordeal. You're not the only male to tmdo stupid shiz to his dick. Without going into details, I suffered nerve damage too and it took almost three months to heal. Of course, you should follow medical instructions, but here is what I was put on to help heal me: cialis 5mg every two days, B1, B6, B12 supplement (helped to regenerate the nerves), and L-arginine",
            "The idea of repeatedly getting punched in the taint does not sound like a fun time.",
            "I’m certainly in no position to judge you but good lord man take it easy.",
            "Now you know to just get a prostate massager like civilized folk.",
            "And here I am using my magic wand vibrator on my fucked up shoulder 😂\n\nDon’t know if anyone else has mentioned this yet, but this reminds me of a sex in the city episode. Samantha is bummed because her favourite vibrator stopped working and decided to return it. At the customer service desk, she loudly demanded a replacement vibrator. \"Umm…ma’am, this is a massager\". Samantha, shocked, said \"this is my favourite vibrator\". \n\nAnyway, she got a replacement, offered to babysit Miranda’s baby, instructed to keep the baby in the vibrating chair or he’ll start screaming. The chair broke and Samantha brought out her vibrator and placed it into the baby’s chair, stopping the crying.",
            "![gif](giphy|dGCIsOZl2iUFyoLQ12|downsized)",
            "This is the first TIFU that actually might save me from making the same mistake. I used one of those massage guns for the first time a week ago at someone’s house on my lower back (worked wonderfully) so of course I had ideas but man I think ill pass",
            "Im sorry for you bro . I really am. At the same time. That is fucking hilarious",
            "He did it, guys. He actually did it. He beat his dick like it owed him money.\n\nFor real though, I hope you recover. That's scary. I didn't think those massage guns could cause permanent damage to anything. Which attachment did you use?",
            "I swear this would've been a great plot for a House episode. OP comes into the hospital saying that he has pains all throughout his lower groin area to his glutes and says he doesn't know how it happened, he tries to blame it on lack of vitamins/protien or whatever. \n\nThirteen and Foreman keep debating on whether the patient has an STD or some kind of skin cancer (even though no tumor was found), House sends them to go to OP's bedroom, and lo and behold... massage gun on the bed with traces of semen on the tip.\n\nHouse tells everyone how much of an idiot they are, and that once again, everyone lies. The diagnosis was a pudendal neuralgia as a result of the monkey being spanked a bit too much",
            "OMG thank you for this post, I was thinking of trying this out but I guess I'll just stick to my purpose-built toys then\n\nGodspeed and steady recovery to you",
            "Sir. Sir have you heard of this thing called a vibrator. SIR you should have posted on Reddit before doing this not after. We could have stopped you",
            "Jesus fuck, dude",
            "I misread the title as \"Masturbating with a **massive** gun\" and feared for where it was going to end up so I guess it could have been worse?",
            "You are only supposed to use those things for a couple minutes max. What exactly did you do? Just go to town on your gooch for hours?",
            "Use the fork/ U shaped attachment that most massage guns come with over your shaft!",
            "Goddamn bro, were you pounding yourself on the max setting or what? That’s your lil buddy, don’t turn him into a punching bag 😭",
            "Hey man, read the whole post in my head and said the word \"rectal\" out loud as instructed. Did I do good?",
            "Jesus.  \nHow hard were you hammering yourself with it to cause nerve damage?\n\n\nAre you even certain it was the massage gun?  \nThis almost sounds like spinal damage or a stroke for it to affect your entire body.",
            "Damn you took beating up your dick to a whole new level.",
            "Thank you Sir for taking one for the science.",
            "How hard were you blasting to feel it in your lips?",
            "God is probably laughing his ass off that you think he's gonna help you.",
            "Did the doctor specifically say that this nerve damage was caused by the massager or could it be from something else?  I have sciatic nerve pain and my big toe on one foot is perpetually numb/aching because of bulged discs in my back.  That injury is from years of improper lifting technique while working with heavy objects.  If your injury is something similar, then it probably wasn't the massager that did it.",
            "There are websites that sell sexual toys. But they’re recently new so you probably haven’t heard of them.",
            "You are clearly not yet a master-bater. Just a wanker.",
            "I'm not convinced this is the massage guns fault.",
            "My advice:  Don't pummel your pommel anymore.",
            "Just how hard did you do it and what head attachment? Because ive heard of it going wrong.",
            "How does pudendal neuralgia affect head and lips? Seems geographically distant from the taint.",
            "So I have to ask... \"Was it good for you?\"",
            "Oof\n\nMate\n\n\nTry a massage wand instead, you can also get sleeves that attach to the head and go over your dick, most blokes go into orbit when I use it on them",
            "Here is where the human ability to learn from the mistakes of others shows its true value.",
            "It doesn't sound like your symptoms are related.",
            "This is clearly a public service notice. I salute you sir for your sacrifice",
            "Sounds like sciatica my dude. I have sciatica, and when it flares up sometimes it does to the dick and balls as well as my back , butt , arms etc. The tingly cold itchy feeling is exactly what I experience. I always described it as ICED LIGHTING.",
            "This guy has given himself [Vibration White Penis](https://en.wikipedia.org/wiki/Vibration_white_finger). There but for the grace of god go us all.",
            "This has the potential to become one of the all time reddit greats. Right up there with some of the other cursed stories.",
            "It’s “masturbating.” With a “u.” 🙄",
            "I misread the title as \"machine\" gun lol. I did a double take",
            "What're the stretches you do? I didn't wack it with a massage gun, but I'm having similar (though not as intense [ i.e.no tingling in arms legs etc] feelings) issues as you ot sounds like, so I'm wondering if the stretches you're doing will help",
            "Funny enough this story just reminds me of every safety meeting talking about power tools and vibration effects. You definitely don't wanna overuse vibrating objects especially frequently and at high intensity lol.",
            "you should have bought one of these new licking devices at temu fam.",
            "That's terrible! I'm glad, though, you wrote about it! My situation is different, I had the nerve damage first (after cancer surgery and different treatments and probably a new tumor in my pelvic bones now) with numb skin in the area and impotence and absolutely no sexual feelings in my genitals from whatever stimulation. I also had a lot of pain in my pelvic area. I used that massage gun to try to force an orgasm (no chance). The pain shifted from the pelvic into my left thigh after I tried that massage gun for masturbation. Afterwards I tried treating that pain in the thigh with the massage gun, but from what I read from you, that might actually make it worse.\nGood luck for your recovery!",
            "Did you tell the doctors what you did? I feel like that could have an impact on your diagnosis and treatment.",
            "Not going to lie, my massage gun arrived yesterday and i thought about it lmao\n\nThanks for taking one for the team champ",
            "Sounds like you fucked up your sciatica. You better chill for a minute.",
            "The shocking thing here is that you aren't already having regular prostate exams. Get over the awkward.",
            "I learn something new everyday!",
            "I literally have a massage gun coming in the mail today. I got it for my legs and other muscles, but I've also been contemplating using it in some unintended ways. Thanks for doing the exploration so that I don't have to.",
            "Sir, thank you, you made this mistake so others didn’t have to, i hope you feel better soon and do find that nut that is worth it",
            "I was assuming you used a massage gun because that was what you had on hand. Not that you went and BOUGHT one for this activity when you could have bought a fucking vibrator that is actually made for this. Good luck, but that was so stupid.",
            "god DAMN the comments on this one are gold.",
            "After reading this thread I now need to make an appointment with my GP.\n\nAnd I'm gonna need to pay the cleaner more.",
            "Hm been using one for that for years now without problems. Honestly feels fantastic and vest is it's easy for when youre too lazy to jack off.\n\nI usually keep my pants on to have some dampening and then massage the tip or middle section",
            "Vibrators work just fine for this. You can even get the wands that have a similar shape to those massage guns. It'll do the same thing you're wanting sans the nerve damage lmao",
            "Shoulda just went with a normal sex toy",
            "You can get a similar effect with the shower head and not risk injury unless you have insane water pressure.",
            "Pelvic floor dysfunction is pure hell.",
            "Am I the only one who doesn't understand how op got nerve damage from a massage gun? Did I miss something?",
            "Sounds to me like you get a nice prostate massage, without a gun, next time",
            "Damn, I was planning to buy such a massage gun for the exact same purpose. \n\nWhile play-fighting with the wife, she punched me in the taint and it felt nice and she basically punched out a trickle of semen, which got me curious. Think I'll have to rethink the whole idea based on your experience.\n\nHow often/how long did you try?",
            "¡Mast U rbating, not mast E rbating, you illiterate twat!",
            "Curious why you're watching dudes massage their taints to begin with? Pretty gay bro",
            "Never skip leg day fellas.\n\nDo your hip mobility. \n\nDo your squats. \n\nDo your hip thrusts. \n\nDo your bench press.\n\nIf you aren't doing these things your going to die fat and unhealthy.\n\nIt'll improve your health. Sexual health. Mind and help you sleep.",
            "I work at a pelvic clinic, this is more common than you think",
            "What OP did was to give himself pudendal neuralgia. That condition can be very serious and lead to all sorts of bad outcomes. It can be treated by PT or more serious interventions that directly target the nerve (e.g., radio frequency ablation).  In most cases, the symptoms are not permanent. But this is not something anyone should mess with.",
            "The idea is to get off, not turn your prostate into an In and Out burger.",
            "massage guns basically punch over and over, you really should've just gotten a vibrator or only used it on a prostate massager in the ass",
            "I have a massage gun, haven't used it on my taint yet. Now I know not to.",
            "Thank you for sharing your story. TikTok and other video sites can be pretty irresponsible with their content.\n\nAs soon as people realize that what we see in videos isn't always real - the better. \n\nHope you recover soon man. that's rough.",
            "the TIL I didn't need or want to know about. get well soon brother",
            "drink some milk bro. my god…",
            "Fucking idiot",
            "A good example of don't believe/do everything you see in the Internet.",
            "Asphinctersayswot?",
            "You should always stretch before strenuous activity to avoid injury.",
            "Popping jo and uioiou",
            "some of my earliest wanks as a kid were with the magic wand or whatever it was called back then. the best place is between the frank and beans, right on top your balls where they meet your dong. i always loved it because i never got tired or sweaty : )",
            "idk.. maybe.. if you did blatant misuse then you probably did mess up.. if youve just happened to burn the motor up in it then you should maybe read the warranty contract the apparatus came with and see if have you have violated it in any way with whatever stunt you pulled with it... but idk.. glhf",
            "Eroscillator is 1000x better than any massage gun or vibrator. It doesn't leave things numb or overstimulated like a vibrator does. Oscillating toothbrushes with special attachments do not hold a candle to this.",
            "You can get a pudendal nerve block which will eliminate the pain. Heard it from a friend.",
            "Damn man. Hope u do well. Also, guys is it okay to use your iPhone as a vibrator on ur dick? Like the vibration gives a good feel",
            "Wow, that's a wild story! 🤣 Gotta admit, using a massage gun in that way is pretty out there. But hey, we all make questionable decisions sometimes. Hope everything turned out okay down there though. Maybe stick to more traditional methods next time?",
            "I first read the title as shot gun, and prepared myself for the most vile thing I’ve ever read.",
            "PT is magical. Stick to it and listen to medical professionals. If they say you can recover, believe them. People have done a lot worse things to get off",
            "https://preview.redd.it/fpcvq31w628d1.jpeg?width=574&format=pjpg&auto=webp&s=5b5045897dca4e422621e18eae856de4bce5b974\n\nsorry to hear :(",
            "What about a massage gun on your balls...? Asking for a friend. Lmao",
            "All I read was, there was still and orgasm.😎👉👉",
            "I knew this was headed to a bad place, and I got on anyway. Why do I punish myself like this?",
            "I hope you make a full recovery and learn something from this.",
            "What? Did a doctor tell you it was from the massage gun? I’m not seeing that anywhere in this post. You could have nerve damage or irritation from any number of things. I think you’re assuming causation unless this is just a really badly written piece.",
            "Y’all need a damn anatomy lesson? Proper Prostate stimulation will cause a nearly instantaneous ejaculation that may not feel orgasmic. Stimulating the “taint” (I hate that word) is basically stimulating an area inches away from the male prostate gland. Massacring it with a massage GUN (operative word) can ONLY cause damage. Similar to riding on a narrow bicycle seat on a bumpy trail too long. Nerves that aren’t severed will heal but do so SLOWLY (like 1” / month or 1 mm per day.) SO STOP DOING WHAT YOUR DOING IMMEDIATELY AND IN A FEW MONTHS YOU “SHOULD BE OK” unless you caused permanent nerve damage (ie. Severely damaged the nerve to the point that it can not repair itself.) You may want to try Vitamin B 12 to lessen the pain and Alpha lipoic acid, NAC, l-carnitine, selenium, and Vitamin C have all shown promise in supporting nerve health. Read this …\n\nhttps://www.ncbi.nlm.nih.gov/pmc/articles/PMC8303934/\n\n“… tailored dietary plan supplied to a patient following nerve injury could play a non-negotiable role in accelerating and promoting the process of nerve regeneration.”",
            "Do you feel the need to pee often ? I might not have damaged the nerve directly but instead gave yourself a very tight pelvic floor which can lead to nerve pinching.\n\nTry an exercise called REVERSE kgel and some pelvic floor stretches. Lots of info on the internet about both and I’m pretty sure it could help you.",
            "The orgasm is never worth it.",
            "weird how people buy those to help ease their nerve pain\n\nu did the opposite with it",
            "Well that's enough Internet for the rest of the year.",
            "I believe it is pronounced masturbating… this whole store sounds like a wank.",
            "I use a massage gun on my GF from time to time. She orgasms super fast.",
            "A cautionary tale for the rest of us. There should be a series of  Grimm Fairy tales for boys that warn against these kinds of dangers facing the sausage soldier.",
            "[obligatory master debater](https://youtu.be/5hwYz1lPN0g)\n\n\nAlso Thera-guns are misadvertized hammers to be used on healthy tissues",
            "F",
            "You're a dumbass",
            "How the f*** would a massage gun make you feel good as a dude? Do you have a vagina? What a weird thing to spend your money on",
            "Well what about women with all the stuff they use sometimes?  They are just built better for that kind of pounding abuse in the nether regions?",
            "Maybe it will get better with time idk. Usually using smtg that powerful many times on the same spot will make you numb and with time it will gain sensation back but idk to what extent and for how long it will take  but its possible. Just don't use it anymore for that purpose and be careful.",
            "How did the doctor diagnose that?",
            "*mastUrbating, for fuck's sake.",
            "1 Corinthians 6:18.",
            "What means 'masterbating?'  What means 'massage gun?'",
            "🤭...😅😂🤣😅😹😅😂🤣🤣😅😆😂! Boys are so stupid. Nobody made you do this, and now you're effed for life bc you tried to eff yourself. Mission accomplished.",
            "Go see a chiropractor and get your sacrum adjusted",
            "Hitachi wand on the frenulum.  Trust me.  🍆💥💦",
            ">or only used it on a prostate massager in the ass\n\n...wow",
            "Quit hitting yourself!",
            "So, you got the massage loud and clear?",
            "Heres another one to avoid. I stuck my dick into a jar of epsom salts one time.  I have no idea why other than I was hard and it was there.  Whether or not you had been thinking about it, I advise against it",
            "r/TIFU or r/LPT ?",
            "More upvotes than op",
            "How did you know not to do it?",
            "Certainly something I'll keep an eye on",
            "his head was up all along",
            "^[Sokka-Haiku](https://www.reddit.com/r/SokkaHaikuBot/comments/15kyv9r/what_is_a_sokka_haiku/) ^by ^Viper1089:\n\n*You literally*\n\n*Beat your dick and gave yourself*\n\n*Nerve damage lol*\n\n---\n^Remember ^that ^one ^time ^Sokka ^accidentally ^used ^an ^extra ^syllable ^in ^that ^Haiku ^Battle ^in ^Ba ^Sing ^Se? ^That ^was ^a ^Sokka ^Haiku ^and ^you ^just ^made ^one.",
            "Beat that dick like it owed him money",
            "I agree the wife uses her wand on my definitely a good feeling!!!",
            "Don’t understand why more men don’t experiment with vibrators! Who doesn’t love the feeling?!",
            "As much as I like the wand, it doesn't do enough on the taint.",
            "No thanks, I can get off just fine without power tools.  Plus I don't want ass-nerve damage",
            "Good lord I thought you were kidding",
            "i don’t even know why i clicked",
            "I have the same massage gun as one of those gifs with that attachment already on it. This is like a sign to punch my dick off.",
            "Damn they have slow motion cumshots",
            "I was REALLY hoping Reddit was going to ask if I wanted to create a subreddit 😭",
            "This whole sub is guys doing the same exact thing OP did. Maybe some of them are placing it more at the base.",
            "Bahahaha. The slow motion. Funniest NSFW subReddit I’ve encountered.",
            "Bonus life points for reading the whole thing.",
            "🎶This is a cautionary taaaaale🎶",
            "Do you use it on your dick?",
            "For real, I have possibly been using one for quite some time and like jeez. Made me a little nervous thinking it could happen to me now.",
            "Sounds like that to me.",
            "Just be a normal person and get a phone controlled buttplug.",
            "I’ve tried it and even on its lowest setting, I need to have multiple layers between you and the gun. The magic wand vibrator is better and can be used as a general body massager",
            "I mean I wouldn’t recommend you to try it, but to dispute that, your body can tolerate giving birth and period pains. So it’s actually stronger than a man’s in that region.",
            "Lovense is your friend.",
            "Use the massage gun on the base of your fingers and let your fingertips go gangbusters on the love button.",
            "No pain, no gain",
            "Honestly, try a little bullet vibe! A lot of them are pretty powerful for being so small. Some vibrators are just way too strong.",
            "> because I imagine my body is weaker than a man’s\n\nI don't think this is necessarily true. However, I agree it's not worth risking. Though I imagine using a massage gun on your Inner thighs would be safe and the resulting vibration may do something for you\n\n\nGood luck with your endeavors lol",
            "If your using it with a partner they can hold it in the palm of their hand and use their fingers. Not sure if you could pull that off alone though.",
            "They make attachments for massage guns for that purpose for women. The attachment is just basically a dildo that attaches to the gun. I bought one for my gf recently but we haven’t had the chance to try it yet.",
            "Well \"LustyForPotato\", have you tried your namesake?  Seems safer than a massage gun",
            "Do you seriously not have a vibrator? They sell those at Target these days. And they're perfectly safe. \n\nMaybe you have an extreme low sex drive, but most women I know would die without a vibrator. Kind of shocked that some people go without it, they must be angry all the time, lol",
            "What did you do? So we can avoid what happened to you. I promise you'll be saving at least one guys manhood by sharing the lesson you learned the hard way",
            "What position are you in? I'm guessing he was laying on his back, but then again he never mentioned it.",
            "I am not a Sex in the City watcher but I remember an episode where the older one helps women choose a vibrator from the massager section and the line \"This one may actually be a massager\" line stuck in my head",
            "You should still try we need more results to confirm or deny the rate of damage from punching your prostrate with a massage gun",
            "That seems unlikely. I get all my bad ideas from Reddit. 😂",
            "Still should use something else given the intensity of those massage guns. Using it on the shaft could give someone Peyronies Disease which is not evident until weeks, months, or even years later. Just buy and use a vibrator.",
            "There's a nerve that runs from the brain all the way to the taint. One single nerve. That I know at least - neurology isn't my strong point",
            "My name is Ben Dover and I approve this message.",
            "And thank you for using “literally” correctly. Most redditors have a hard time with this. \n\nNever thought I’d see grammar, taints, and massage guns all in the same thread.",
            "U ever came so hard you laid back to rest only to wake up 15 minutes later and have to piece your evening together like that movie momento?",
            "A massage gun and a vibrator are not really the same",
            "Sorry i didnt read your whole post. But yeah. That sounds bad but hopefully u will heal and be alright with time as you wrote.",
            "As a guy, I support this whole heartedly. First time the wife did it to me, all I could think was now I know why they enjoy it so much",
            "never [bring out the flugenheimer!!!!](https://www.youtube.com/watch?v=Z8XLFV7dUUo)",
            "It's great but up to medium speed. At maximum speed causes me severe shock/pain, like, not in a bad way, but a very strange feeling that I just can't continue. It's good and bad at same time. Science says that pleasure and pain are held by same part in the brain anyway.",
            "Hitachi wand anywhere tbh that's some sexy hardware",
            "Wish I had one of those. The frenulum that is. God damnit.",
            "I second this guy. Trust it. It is like ascending into another plane of existence, and the only thing that exists in it, is pleasure",
            "Excuse me while I jot this down to use on future partners... (I'm a woman)",
            "Unless you're circumcised and don't have one/have little to no feeling in that area.",
            "[deleted]",
            "Any cheaper alternative ? Don’t see where to buy",
            "This is the way.",
            "That’s not specific enough, we have quite a few frenulums. You’re going to get someone hurt! 😂",
            "While this is a great feeling be careful. Over doing it will desensitize the nerves. Which will make it more difficult to climax without it.",
            " Basically the male equivalent of a clitoral orgasm. It's fucking insane. Now I know why women carry on like morons when they cum",
            "I mean that's usually where they go :p",
            "Is that sentence really strange for you? Are new on Reddit or...?",
            "I don't know... It's more of a constant buzzing.",
            "What happened?",
            "Why?? Why would you do this 😭",
            "Omg I barely got a little bit of this eucalyptus/spearmint infused scrub oil stuff into a small cut in my hand yesterday. I can only imagine how much that must’ve hurt you 😳",
            "Ratio’d!",
            "oh my god, bot",
            "Best bot ever",
            "good bot",
            "Oh the bot is treating lol as an initialism (saying the letters like ATM or FBI), not an acronym (saying it as a word like PIN or LEO)",
            "Savage",
            "best bot",
            "Jesus Fuck",
            "*sigh* ….poetry…",
            "Good bot",
            "This is a haiku. I just wanted to summon the cool haiku bot.",
            "This has the energy of \"I thlammed my penith in the car door\" lmao ",
            "Have you thought about using a massage gun? I heard it feels good down there",
            "Go tell your mom that",
            "I just opened this on a plane ☠️",
            "Ya why are we like this",
            "I don’t think I’ve used it anywhere else even once.",
            "Yeah I've been giving my taint a regular beating over the last half a year or so. Enough to get a bit sore but not surprisingly. I'm going to reconsider that habit.",
            "Way ahead of you but I ain’t bring it on trips without raising eyebrows",
            "What a time to be alive.",
            "Fair but these are at least worthwhile endeavors lol",
            "Good point, I think it's common knowledge that women have steel like pudendal nerves. The OP was weak and I'm sure they could handle the same message gun right on their pudendal nerve without causing nerve damage.\n\n I mean worst case scenario is you end up with  pudendal neuralgia and pregnancy complications and worse period pains. ¯⁠\\⁠_⁠(⁠ツ⁠)⁠_⁠/⁠¯",
            "That's ah amazing idea thank you",
            "Let me know if she lives",
            "Do not want to die. Loading up an absolutely blasphemous website, extracting credit card. Phew, did not die.",
            "Kinda hard to explain to my family",
            "You ruined it",
            "I also used to only watch it for the occasional boob during my teens. There was one episode where Miranda goes into a sex shop and looks lost. A guy goes “it’s a butt plug. Some guys like they way they feel in their ass”. That’s when I learned what a butt plug is. Then, 20 years later I found out I’m one of those guys too.",
            "Though I have a pretty analytical and scientific brain, I don't think I'd like to become a statistic for such a thing lmao",
            "💯my favorite way",
            "I will never get tired of that movie!",
            "What in the flying ***fuck*** did I just watch?!?!",
            "Big disagree. As a certified circumcision haver, I can happily report very much frenulum stimulum",
            "Not sure how you think circumcision works, but they don’t remove the frenulum. 😂",
            "Nope.  Frenulum my dude.",
            "They mean frenulum.",
            "You can find several 'massage wands' that are crazy good for $20. \n\nHitachi is just on a whole other level and is a beloved device by most who have used it. \n\nTry a $20 version before deciding on the bigger expense.",
            "Just get the good one. It will last.",
            "It was more the combination of prostate massager + massage gun that I found alarming 😂",
            "I’m gonna guess that they’re just shocked at the thought of something that ‘basically punch over and over’ and caused the OP nerve damage, being used on the prostate. Not ass play",
            "Or sex",
            "Let me hit you with it again and again very quickly",
            "\"To shreds, you say?\"",
            "Lost the top layer of skin presumably to the coarseness/dryness of the salt.  It wasn't an immediate regret kind of thing, it peeled like a sunburn over a couple days",
            "Could it be just counting vowels and thinking that \"nerve\" has two syllables and \"damage\" has three?",
            "That's one too many syllables, bub",
            "I actually have one on my Amazon \"buy later\" list, but I am reconsidering due to some guy who seemingly nuked a couple important nerves, or so I heard.",
            "What for?  That's none of her business.",
            "Bold move",
            "Everyone else on the plane…\n\nhttps://preview.redd.it/3g5k2q7isx7d1.jpeg?width=585&format=pjpg&auto=webp&s=f08bc63e65eb42442ee7660d14b25d9a52810120",
            "What did the co-Pilot say 😂",
            "What speed is this",
            "r/brandnewsentence",
            "I'm guessing you got called out for bringing potatoes and am looking for alternatives? ;D",
            "That’s fine I guess you just don’t give a fuck about science /s",
            "My safety word is meatloaf. Because I won’t do that .",
            "The scene is from the movie Eurotrip.\nGreatly recommended :)",
            "Me too! Circumcised Frenulum Stimulators FTW!",
            "You're one of the lucky ones I guess, I got no feeling around that area at all.",
            "It depends.\n\nIf you get a traditional Jewish-style “just the tip” circumcision? Sure, you’re all good.\n\nBut an American “high and tight”, particularly those done shortly after birth?  Nah, they scrape it clean.  \n\nTrust me.",
            "Punch them guts",
            "It'll take ya to pound town.",
            "I'm assuming they meant put the prostate massager in your ass, and then press the massage gun against the part that sticks out",
            "Hammer that knowledge home.",
            "That's why it's a Sokka haiku.",
            "Yes. Six. A \"Sokka Haiku\".",
            "What for? She’s your mom, she listen to whatever you say. We won’t. Next time save it. If you read the thread you’d know that your reply to that comment is incorrect.",
            "Let's see how it works out for him cotton",
            "Surely, you can't be serious?",
            "Start 1. Apply pressure at the base so it isn’t just punching back and forth. Ramp up as needed lol",
            "Boil em, mash em, stick em up your chute",
            "They sprout at some point sadly",
            "Oh boy, meat loaf and  assed potatoes for dinner again.",
            "Sorry to hear that, brother. I hate that we were both mutilated without the ability to consent. Fuckin sucks",
            "I'm American and had it done shortly after I was born and mine is not how you describe",
            "Hawk tuah! \n\nSorry couldn't resist haha",
            "Or maybe they are the PROSTATE, and the massage gun are the friends we’ve made along the way?",
            "Punching the prostate massager into the prostate... isn't sounding any better as an idea.  Perhaps worse, catch a bad angle and lever that sucker (fucker?) the wrong way and.... Yeah I'll pass thanks.",
            "Heh yep that's the one 😂",
            "Wow you must be a bot or just a dumbass because that's complete nonsense.",
            "Well, did he cum or what?!",
            "Extra bumpy for your pleasure? ;D",
            "i want my foreskin back!",
            "What consent can a baby have. Parents make the decisions. Just like parents decided to have a baby. There is no consent for babies. Grow up. We all start off with our parents making decisions for us since we can’t. Deal with it.",
            "\"the orgasm was not fucking worth it\" -OP\nSure sounds like it",
            "Jesus Christ! There’s just some things you don’t talk about it public!",
            "King David has spares! He took (at least) 200 from the Philistines.",
            "I rarely see anyone being an asshole purely for the sake of being an asshole, but I’ll be damned if you didn’t just tick that box.\n\nGet help.",
            "Nice opinion. It would look better if you shoved it all the way up your ass though.",
            "Bravo 👏🏽 masterful response",
            "Absolutely flawless comment 😮‍💨"
        ]
    }
}