{
    "While we are a community all about allowing people to ask questions in a relatively free and open way, disingenuous posting that is only being done to drive OF content or “look at my profile ;)” posts will be removed and the OP banned under rule 3.": {
        "title": "While we are a community all about allowing people to ask questions in a relatively free and open way, disingenuous posting that is only being done to drive OF content or “look at my profile ;)” posts will be removed and the OP banned under rule 3.",
        "score": 1190,
        "url": "https://www.reddit.com/r/TooAfraidToAsk/comments/14qcjv9/while_we_are_a_community_all_about_allowing/",
        "content": "Taking a hard stance of the recent uptick of OF spam and content-driving. There’s enough horny posting as it is without attracting this sort of spam that’s affecting quite a few other subs.",
        "num_comments": 69,
        "comments": [
            "Awesome! Wish more subs would do it. Hot girls posting “am I ugly” or a super revealing outfit “is this ok to wear to my friends wedding”. GTFO",
            "This is the move",
            "fully support this rule",
            "Great decision!",
            "Good. I get absolutely spammed by OF people to the point where my bio specifically says not interested (which is still ignored).",
            "Thank you mods",
            "Yayy next is the obvious rage or engagement bait posts like, seen some that are just what aita became",
            "Can someone tell me what kind of posts were made that lead to OF accounts? What kind of posts are they making lol.",
            "I fully expected to see OF promotions on your profile after this post 😂",
            "Mod appreciation",
            "While I respect the concept...you allow anonymous content and need to deal with those results.  You will NEVER find a way to filter human behavior.  Want people to be more 'real'?  Stop using the internet.",
            "Left so many of my favorites because it makes me uncomfortable. Thank you.",
            "Well done!",
            "Most Redditors will support the mods on this decision.",
            "But... but....  How good looking ***am*** I?\n\nj/k",
            "This is the way",
            "Thank you",
            "Finally",
            "Good. Thank you.",
            "Hell yeah, fuck these halfway prostitutes, go to the NSFW subs.",
            "Thank you, how do we apply to this to most of the other horny-adjacent subs?",
            "So I can't link to my collection of oily falafel pics?",
            "I remember that one person that was like \"maybe you should look at people profiles lol\" it was so desperate and obvious",
            "FINALLY WTF",
            "Of course, but I find it extremely hypocritical of you saying that this is a free and open environment to ask questions. I literally posted an unpopular opinion about the latest Disney Princess movies being boring and I offered an explanation. I was extremely respectful, tactful not to talk about politics or anything like that, and it still got deleted. You know why? Because Reddit is a leftist totalitarian app that only allows ideas that are either leftist or neutral. Anything remotely traditional is cutt off not because it's disrespectful or wrong but because the moderators just don't like it. Funny how this is still a \"free\" and \"open\" environment. All it took is for me to state the FACT that tomboy princess movies have all flopped except Mulan, which isn't even a recent movie, and that's because the audience that likes princesses are girly girls and trying to make a tomboy princess is the same as making a girly Spiderman. Wow, I guess the leftist moderators were already shaking by such statements to be public!",
            "My brain somehow brought me to the question: is this an autocratic management style of the sub, limiting free speach,, or just enforcing the law with good intentions. I think I ll chose and hope for the later.",
            "This is an issue?",
            "What is ‘of’?",
            "![gif](giphy|9gISqB3tncMmY)",
            "8y",
            "There are multiple DIS-ingenuous REPEATED clone questions flooding queue on black people that have been answered multiple times. Weekly if not daily, you guys allow racists to ask de-humanizing questions seeking to tarnish black people , finding clever ways to complain about black people, or pretend black people are somehow in some sort of power to get favors over other people. Numerous repeat clone questions of various topics OBSESSING over black people are being allowed on here when they are clearly not asked in good intention. Losers need to be encouraged to find the answers they supposedly desperately need in the older questions that have already been asked nearly word for word",
            "I don't know if this is the right place to post this. But I have been taking medication to control my BPD and NPD. My overall outlook is very laid back but I have zero motivation to get out and do anything. I would rather sleep all day so I don't have to deal with anything. Can anyone give me advice or tasks that would get me out of bed and be motivated to stay active?",
            "New to this, I apologize for asking but how do I leave a question and make sure it’s anonymous? I’m not too good with technology and I’ve never posted on this subreddit before (that I can recall, anyway).",
            "I’m getting bombarded with these subs for no reason and it’s blatant. 90% have an onlyfans. I feel like a lot of social media rn is going through this wave of onlyfans marketing or porn. The amount of porn Iv seen on Facebook the past two weeks is mind boggling.",
            "Ugh, same thots ruining r roastme. Like we get it, you have an OF and some botched surgeries, fuck off.",
            "Maybe it's okay to wear that to your friend's wedding. Maybe there's nothing wrong with that, right? It's also your choice what you want to wear.",
            "Just disable people being able to follow you, go to User Settings > Profile > Allow people to follow you",
            "Might be bots.  Are they “following” your profile?",
            "asking explicitly sexual questions and then usually describing themselves in a very sexually appealing manner, just so maybe some people will click on their profile and see their porn and donate. for example, posts about sex from a woman where she says things like “i am very curvaceous and thick, do men like this body type?” or “i love showing my tits to strangers, is that weird of me?” just things that are obvious bait or could get someone interested.",
            "“Why do I get wet when I take photos for my OF?”",
            "OMG, you just made me laugh so hard! Thank you! I totally needed a good laugh.",
            "You didn't post it here, so I don't understand your point.",
            "IKR - it’s literally like 1984.\n\n\n*I’ve always wanted to use that meme!*",
            "There’s no law for this (as far as I’m aware) but the mods have control over the sub - if speech is truly free it should also be able to controlled. True free speech is chaos and no one being able to get along. Would you rather harmony or war?\n\n*edit* this is an opinion not fact.",
            "I had to google it, and I believe it's short for \"only fans\" on Tik Tok. I am not on Tik Tok so I can only guess that it is an account set up that only \"fans\" can view and I am thinking it is for profit-making. Please, someone correct me if I am wrong. I really am not sure what an OF really is, how it works, or what the purpose is.",
            "Report them / send them in our DMs and we're happy to look at them.",
            "I'll say that dating is impacted by it too. Scrolling through any dating app, you'll find a lot of people advertising and also only matching with you to advertise. It's a plague",
            "But if you say shit, you get reported for hate speech and get hit with a ban hammer. I mean that’s what happened to me when I kept talking shit to obvious scammers on Los Angeles Marketplace Facebook group.\n\nFwiw, I told em to go fuck their mothers and get a real job. But I’m the bad guy for calling out scammers preying on people.",
            "Are you sure of what you are saying? In fact, you will find a lot of porn sites everywhere on social media.",
            "No, you can't wear a butt plug and nipple tassels to your friends wedding.",
            "Actually yes. Damn, I thought I was just interesting.",
            "\"I like it when you click my profile and check out my nudes and maybe give me some money, _am I normal?_\"",
            "Fair. I legit don't see a lot of posts like that.",
            "How am I going to post it here if my comment has nothing to do with the subject? Point is, reddit is extremely totalitarian and controlling and extremely leftist in its political views, attempting against freedom of speech. This was not so before. And this is a big problem.",
            "Dang I didn’t even think of that, thankfully I’m not on dating apps but that’s gotta be frustrating to deal with.",
            "Right! Maybe that will just become a plague in the society by chance. I don't think that's a good idea.",
            "You even see them in prequelmemes nowadays (a Star Wars meme sub), \"geeking out\" with \"fellow nerds\" as they say. They're everywhere. It's only going to get worse, as more women (and even a few men now) begin to turn to easy mode, the industry becomes over-saturated and they become more competitive and \"innovative\". They're literally just spam bots for the post-2020 era - wait until the AI starts doing it.",
            "There’s a difference between seeing people market towards their onlyfans or whatever and straight up just porn on my home page of Facebook in a group about cars or something. Pretty sure Facebook is one of those that’s pretty against porn at least try to be.",
            "You ARE interesting. To bots though...",
            "You called me a hypocrite for saying *my* community is open and inviting, and provided an example of how your speech has been limited but your example has nothing to do with this community, as your post did not happen in this community, a removal did not happen in this community, and no one has made any effort to stifle your speech in this community. This is particularly relevant because I only moderate here, would love to hear how mod actions that originate and terminate here, that have not affected you, are relevant to your point.",
            "Being an introvert that still wants a relationship has it's downsides",
            "I mean, in this economy, that's a clear advantage :D",
            "[removed]",
            "You’ll find someone don’t worry! Perfect things take time!",
            "Your submission was removed because it violates Rule 3 - Be Genuine. \n\nPlease feel free to review our rules. If you feel your submission has been removed unfairly, you can message the moderators. Please remember, we are people, doing our best.",
            "Coming back to say you were right, cause I've been in a super healthy relationship for 3 months now. Thanks for your kind words back then <3",
            "It’s been that long already? Time is flying. Happy to hear about that! Communication is key, it will save you a lot of time and head aches. Congrats!"
        ]
    },
    "Megathread for Israel-Palestine situation": {
        "title": "Megathread for Israel-Palestine situation",
        "score": 23,
        "url": "https://www.reddit.com/r/TooAfraidToAsk/comments/1ci6wz9/megathread_for_israelpalestine_situation/",
        "content": "It's been 6 months since the start, so the original thread auto-archived itself. Here's part 2.\n\nYou can find the original [here](https://www.reddit.com/r/TooAfraidToAsk/comments/174177f/megathread_for_israelpalestine_situation/)\n\nThe same rules apply:\n\nWe've getting a lot of questions related to the tensions between Israel/Palestine over the past few days so we've set up a megathread to hopefully be a resource for those asking about issues related to it. This thread will serve as the thread for ALL questions and answers related to this. Any questions are welcome! Given the topic, lets start with a reminder on Rule 1:\n\nRule 1 - Be Kind:\n\n**No advocating harm against others. No hateful, degrading, malicious, or bigoted speech against any person or group. No personal insults.**\n\nYou're free to disagree on who is in the right, who is in the wrong, what's a human rights abuse, what's a proportional response etc. Avoid stuff like \"x country should be genocided\" or insulting other users because they disagree with you.\n\nThe other sidebar rules still apply, as well.",
        "num_comments": 247,
        "comments": [
            "What should Israel actually do?  All I hear is \"Israel is committing genocide\".  So, you're Israel.  Hamas' specific goal is to kill all Jewish people and completely destroy you.  And they hide in the  civilian population.  Then they actively plot to kill you, but are hidden in their civilian population.  What is your solution?",
            "I've seen a lot of deserved criticism around Israel's treatment of Palestinians, but why does no one discuss Hamas's treatment of Palestinians?\n\nIsrael are bombing civilian areas because Hamas are hiding in civilian areas. Israel are bombing aid trucks because Hamas are smuggling weapons in aid trucks. The war is ongoing because Hamas started and continue to consent to the most recent war.\n\nYou can say that this doesn't justify Israel's actions, but 1. it complicates them legally at the very least, and 2. the fact remains the behaviour of the two arr inextricably linked. If you wanna ask why a civilian was bombed, \"there was a Hamas leader right next to them who organised crimes against humanity on Oct 7th and poses a continued threat to Israel's national security\" is pretty CRUCIAL context.\n\nI don't want to tolerate what Israel are doing. I don't want what's happening to ever be okay. Regardless of anything, they are at least 50% at fault which is deplorable in its own right. But this feels like a huge elephant in the room which everyone refuses to acknowledge is there. I don't understand how I can trust activists and a movement, if they choose to ignore reality by acting as if Israel are just targeting civilians for fun/cruelty.",
            "My question: for the people who support ending the state of Israel, where would the 9 million citizens of Israel go in such an event?",
            "As someone who knows nothing about this conflict, is it controversial to simply say that I want both countries to live in peace? You wouldn't think that would be a controversial opinion but people get so mad on the internet and like I said, I know nothing about this conflict",
            "I have a question.\n\nI’ve seen many LGBTQIA+ groups that support Hamas but do they not see what Hamas does to gay people? ",
            "what exactly is the solution? im pro palestine and dont think its realistic for the entirety of israel to get wiped off the map regardless of how much i bet some people want it. is it a two state solution?",
            "Is it possible to criticize Israel without being antisemetic? The US state department currently defines antisemitism as \"a certain perception of Jews, which may be expressed as hatred towards Jews.\" I see many college kids today protesting Israeli actions in Gaza and then being labeled as antisemitic. It seems to be that one should be free to criticize a government separately from a race of people, but maybe I'm missing something?",
            "Can someone explain the pro Palestine side to me? Didn’t they start the war? Aren’t they run by the HAMAs which is generally viewed as a terrorist group? I haven’t been keeping up.",
            "How are universities supposedly complicit in genocide?",
            "Why are people so angry at Jewish people in America?",
            "Is it ok to fully stay out of the argument if you just aren’t sure if you should support either side? Like, the only people I support in this are the Israeli and Palestinian civilians that just seem to be being used as pawns and meat shields for a petty fight about land rights. Honestly, I just kinda wish we could put the militants from both sides somewhere else to duke it out and let the civilians recover. However, if I just come out and say this, I feel like I’ll be called a lot of things that I’m not and it would just be better to not say anything at all. How should I feel on this? I just don’t know if I can trust any statement of numbers coming from either side without a reputable or unbiased source, but everything seems incredibly biased. Please help.",
            "Why do left wing support palestine?\n\nBefore i start I dont support israel but i also dont support palestine and ussually im an extreme left wing (for my country)\n\nLeftists support palestine VERY agressively even tho palestine and probably more then %95 of their people are extremely conservative i mean half the people who support them would have been either executed or tortured if they lived there as themself \n\nLets take lgbt+ for example they support palestine to death but if any of them went there from west they would be killed  any of them that has born there was killed with torture or forced to live a life of lies \n\nLitteraly if tomorrow ur country decided to \"we are gonna execute the lgbt community\"  they would celebrate i dont get it why and how you support them \n\nThey are against everything you are for from women rights to freedom of anything and if u wanted them to change u would have to start a war which would again be another bloodbath \n\nSo whats the deal are you gonna stop israel from attacking them and then attack them for another cause? Will u just let them kill any leftist afterwards and not have a reaction? \n\nSorry if it was long \nThanks in advance",
            "This is a GREAT post! One question...is there a \"right\" side and a \"wrong side\"? Genuine inquiry",
            "Hey guys, I'm Jewish and also biracial (birth father is Jamaican- I'm adopted) and I'm honestly tired of all the shit going around about choosing sides and that if I'm for Plestinian liberation then I'm not a \"real Jew\" and if I'm against antisemetism then I ca't support Palestinian liberation. My views on this are that obviously I just want peace. I hate that people are bombing innocent civilians and I hate that there's been a rise in antisemetism, but I don't actually know the proper history of Palestine and Israel (like very loosely and that the British were involved), and I'd like to know more if that's possible.",
            "Why are people protesting local city governments here in the US? What are they expecting their city government officials to do in regard to a ceasefire? What CAN the local government truly do in this regard? As far as I know, our local city governments are not directly involved with things like the federal government sending money to Israel, etc. so I don’t understand the voracious local protesting.",
            "Both the Israeli military and Hamas are doing some pretty objectively terrible things. Why would anyone  support either side in this?",
            "Remember not too long ago when the whole 'Jewish people control Hollywood' thing was going around and at best it was a very stupid conversation and at worst it was blatant antisemitism.\n\nYet today, governments around the western world are silencing anti-war protestors, making radical social media changes to quell the spread of free information about Gaza, and weaponising anti-semitism to defend against anyone who criticises Israel?\n\nThis feels like the 'straight white man' situation, yeah it's definitely not all Jewish people, in fact it's Zionists specifically, but it seems like the elites of that group might in fact have an insane level of control.\n\nShoutout to all the outspoken Jewish people standing against Zionist war mongering.",
            "I know it’s not 100% related, but why are LGBT people so defensive of Islam?\n\nAs a member of the community, I never understood this sort of alliance LGBT people have with Islam.\n\nIslam as a religion is quite homophobic and practically every country with Islamic rule persecutes and imprisons gays.\n\nThe Quran also calls for stoning gay men: https://quran.com/en/4:16/tafsirs/en-tafsir-maarif-ul-quran\n\nHalf of Muslims in the UK, a develop country also support criminalizing homosexuality: https://amp.theguardian.com/uk-news/2016/apr/11/british-muslims-strong-sense-of-belonging-poll-homosexuality-sharia-law\n\nYet a lot of LGBT people act like Islam and homosexuality are not at all paradoxical.\n\nAn LGBT news site even had an interview with a person who called Islam “affirmative to their identity“\n\nhttps://www.instagram.com/reel/C5o44rOvZnz/?igsh=M2Vqd3A2c29oNW93\n\nI just think it’s weird how there is so much bile towards Christianity in the LGBT community while Islam is so easily let off the hook.",
            "Can someone enlighten me as to why all those rich oil Arab countries like Saudi don’t help Palestine ? Where is all the support from fellow Muslim Arab countries?",
            "Is a queer person in Gaza more likely to be bombed by the IDF or chucked off a rooftop by Hamas?",
            "I am very fearful to ask this question. A lot of news media outlets only talk about only what Israel is doing to Palestinians. But why is no one talking about Palestinians killing Israel hostages and sending the dead to Israel? This hostage situation is what started everything. \nI see a small article in every US news outlet and very less to no coverage on this. And this trend is resonating with other media outlets in the world.\nDoes anybody know why?",
            "Can someone explain Palestine debate?\n\n1 - how does “queers for Palestine” work, if even the West Bank is outright homophobic to the point of a public hanging of a queer person?\n\n2 - who has Israel oppressed?\nwhy do Gazans work in Israel if they’re oppressed?\n\n3 - how are the chants not antisemitic, if they call for wiping out Jews? And why is it still being allowed if it is?\n\n4 - why are uni students protesting?\n\n5 - what does Palestine need freeing from? I thought Palestine was more than just Gaza anyway?\n\n6 - if hamas are terrorists, why are they allowed to control a country? \n\n7 - why is there going to be a ceasefire with hostages still on both sides? Surely previous deaths do not justify withholding future lives?",
            "Right now it seems likely Trump is going to win the election since Biden has pretty much lost his voter base due to how he’s continually funded Israel’s genocide in Palestine, banning TikTok since it’s been fighting mainstream media propaganda, and treating anyone who protests the genocide as terrorists. He basically lost the young voters at this point, and none of them will help out with the electoral ballots after everything that’s happened after October 7 either.\n\nPersonally, I think Biden’s been a monster and an idiot through this whole ordeal and I don’t want to vote for him, but what are we supposed to do to stop Project 2025 from happening now? None of the third party candidates seem like they have a chance of winning, the electoral college won’t help either way, and the only viable option at this point seems to either be moving to another country to escape Project 2025. I don’t want to sound like I’m getting on a high horse because again, I don’t want to vote for Biden myself, and many people are rightfully feeling like we’re living in authoritarian state because of how much the government is treating anyone who sides with Palestine, and whatever does happen here is still nothing compared to what the Palestinians are going through. However, I’m still terrified about Project 2025 and so far no one is mentioning another way to stop it from happening besides voting for Biden, so what are we supposed to do?\n\nAlso, sorry if this is the wrong place to ask. I originally had my own post but the Moderator boy told me to move the post to this thread",
            "Why are pro-palestinians all anti-israel, and pro-israelis all anti-palestinian?\n\nWouldnt the ethical thing to do is support both people? Majority on both sides are civilian including millions of kids, and all of em were born there and live there whether they wanted to or not. So why vilify a side? Why not support both sides?",
            "When did Israel replace the UK as the US's greatest ally? \n\nI hope this question isn't against the rules but as long as I can remember the US and the UK have mutually claimed the other as their greatest ally. \n\nThis kinda makes sense because the US was a British colony and has as its foundational origins culturally, politically and linguistically in Britain. Yes, the US also has significant influence from, and ties to other nations, such as Germany, Italy, and Ireland, etc. And the US and UK did stand with each other through two world wars and the subsequent cold war. \n\nBut recently I have heard it said more and more that it is Israel that is America's greatest ally and not just the greatest ally _in the Middle East_. For example here.\n\nhttps://www.gop.gov/news/documentsingle.aspx?DocumentID=794\n\nAnd this is coming not just from Republicans but also Democrats. \n\nSo, when did that replacement happen? Or am I just way out of touch?",
            "**Does no one find it even a tiny bit suspicious that just a month after Iran fires hundreds of drones at Isreal, the President of Iran and the Iranian Foreign Minister die in a mysterious helicopter crash?**\n\nTo be clear, I am not suggesting that Isreal actually was behind this. Iran’s own government isn’t even claiming as such and the weather conditions they were flying in were very poor. \n\nHowever, last year, when Russia's most powerful mercenary, Yevgeny Prigozhin, led a mutiny against the Russian military, he mysteriously died in a plane crash two months later. The Kremlin denied they were behind the crash and the world had little to no proof, yet most people believe that the crash was really a KGB plot to assassinate Prigozhin as retaliation for his actions against the Russian state. \n\nWhy then is it so unthinkable that the death of Iran’s president under similar circumstances might also be suspicious? \n\nAgain, I’m not saying I think Isreal was behind the crash - I couldn’t possibly say that as I have no idea what caused the crash and nor does anyone. Rather, I simply find it a bit odd than no one seems to be willing to connect those dots and even speculate about the idea that the crash could have been an act of revenge.",
            "Why is there such a huge campaign for Palestine state, but not others, such as Kurds or Yezidis etc?",
            "What's the point/goal of people going on the streets to protest *in western countries that have absolutely nothing to do with the conflict*? What are they trying to achieve by protesting somewhere where Israel and Palestine won't notice any of it?\n\nLike in my country some universities got vandalized by protesters even though those universities and my country have nothing to do with the conflict, what's the point? \n\nPlease only real answers, no guesses or \"people are just stupid\".",
            "What happens if Hamas was reborn?\n\nWhat if this ideology was reborn and multiplied after they finished the operation? And what if like they said we will see lots of 911s here because of the billions of funds and weapons we sent?",
            "i m too afraid to ask in most subreddits because of fear of getting banned, but i am genuinely ignorant and curious, why is the western governments so prone in to supporting Israel? i know most people are with palestine, my question is why are these governement supporting israel do they have some strategic interest because of their position?, economic interest?, some rare resoueces? because there is some kind of illuminati like group that controls most of the west? i really don't know sorry if it sounds dumb i just want to be more informed.",
            "Are Muslims allowed to protest with people who wear LGBTQ symbols? Is it uncomfortable?",
            " Will they restart the military draft in the US for WWIII with Russia and China? I'm 35 almost 36, do I have anything to worry about?",
            "How are the protests and arrests of people protesting against Israel's invasion of Palestine different from protests and arrests of people protesting against the Chinese government's interference with Hong Kong?",
            "What is the releationship between Hamas and Palastina?\n\nThis question has been on my mind sinds the start of the war, I am trying to understand how Hamas got this big and start the war with Israël. Now it is hurting Palestina because Israël is trying to end Hamas. \n\nDoes Palestina support Hamas?\nWhy did Palestina allow Hamas to start the invasion if they support it?",
            "Trump was impeached once for withholding aid to Ukraine that was approved by Congress. Could Biden be impeached for doing the same to Israel?",
            "One thing I’ve wondered is why does the opinion of the far left on Israel bother Israel and its supporters to the degree it does? \n\nWhy do they care that a minority of people across the world don’t think they should exist, or even that they should exist today but were the clear villains in 48? While Israel is probably the most criticized country today, I also think that their and their supporters’ efforts in the PR war and demonization of those that disagree are well beyond the pale of what most nations and their supporters would do.",
            "[deleted]",
            "[deleted]",
            "if mossad is meant to be one of the best undercover agencies in the world, why doesnt israel use them to find hamas rather than blanket bombing gaza and killing tens of thousands of civilians",
            "Parents from cultural/ethnical minorities (asians, native americans, middle easterners, desi, africans, etc): if your child tells you that they dont feel connection to your culture and wants to be fully occidentalized/europeanized/americanized... what would you do or tell them?",
            "**Is our foreign policy(I'm from the United States) contradictory, especially when it comes to the foreign aid?**\n\nNow US has been involved into 2 regional conflicts and one potential conflict, by which I mean Russian-Ukraine, Israel-Palestine and China-Taiwan(I don't use the word \"war\" or \"invasion\" to respect different stances). But our foreign policy seems contradictory. Before discussing the question, we have to admit the fact that now our congress is in two parties' control. But either Democrats or Republicans, at least most of its members, shows the subtle attitude to foreign policy. For instance, Dem supports the aids to Ukraine while against aids to Israel, and Rep against supporting aids to Ukraine while firmly back with Israel. Is it contradictory within the party? And if the conflict between China and Taiwan exploded, we probably will face another contradictory scenario. What attitude will Dem and Rep hold respectively? Will their attitude be different from those towards Russian-Ukraine and Israel-Palestine?",
            "[deleted]",
            "What happened to the casualty count? \n\nBack at the beginning of the conflict, there was all this arguing about whether people could or couldn't trust the numbers from the Gaza ministry of health. It seems that most international organizations and governments (and even the IDF) basically landed on \"the GHM numbers are *mostly* accurate, but not exact.\"\n\nThat was months ago. [In February, the death toll passed 30,000](https://www.npr.org/2024/02/29/1234159514/gaza-death-toll-30000-palestinians-israel-hamas-war). I've seen that number continue to be repeated throughout discussions, but considering that the conflict remains ongoing, I assume that the number must have climbed significantly since then. \n\nDoes any source have a more accurate count as of late May?",
            "Q: Are these boycotts about results or principle? \n\nObviously this is revolving around the horrid genocide in Palestine currently. I hate that I have to disclose this but obviously **I am no supporter of senseless murder and genocide, I am just confused by what I see online.** \n\nBasically online people will see someone drinking a coke or having a mcdouble and the comments are flooded with people saying \"don't support genocide\" which is fine, but when people ask if it makes a difference or say \"it doesn't matter if they drink a coke or don't\" they are literally slaughtered? I feel like people are picking and choosing what to pay attention too. I just feel like you can boycott and support who you want without assuming everyone with a junior chicken is a supporter of genocide.\n\nBut among all the name calling and swearing is always someone saying \"its about the priciple\" but principle isn't stopping the war? No sane person supports or wants to fund the attrocities occuring in Palestine, but the gov't takes taxes and does whatever they want with it so why are we pretending we don't know that? \n\nMaybe I'm wrong but I want an actual answer not yelling and spewing whatever *sounds* like the correct thing to say.",
            "Are the Pro Palestine \"Protesters\" not afraid of consequences? \n\nAre they not afraid of what will happen to their daily file, their personal, professional, academic life once all this is over? Or will they be allowed to continue on free of consequences?\n\nAs far as I have read, some very prestigious university students are participating in these activities, I don't think they lack the critical thinking required to deduce that this will spell doom for their professional, personal and academic life.",
            "I'm confused why my post got removed immediately and was prompted to direct my post here, when my post is about China and nothing to do with this war.",
            "Q: Why does Israel Control the US like what some posts on Twitter claim? is it because they are the safest bet to The Middle East's 1/3 Fossil Fuel Supply and Leverage that Fact?\n\nQ: Can the Reputation of the ENTIRE Western World EVER Heal from their At best Apathy or at worst SUPPORT of Israel?\n\nPersonal Q: HOW can I recover ANY Faith In Humanity, because the Thought that the world just WATCHED as THOUSANDS of Kids are Killed, and the knowledge that we are just going to keep letting this repeat is fueling my belief that regardless of how many GOOD people there are, Humanity will only deserve EXTINCTION. especially considering how we are just going to exploit the Environment and wiping out Species just to ensure that we DO Keep Repeating this",
            "My 2 cents ....\n\n1) The Palestinian ppl voted in Hamas ='s terrorist supporters.\n\n2) Hamas poked the bear, the bear is teaching them a lesson!  \n\nAll in all, you reap what you sow = life lesson learned or to be repeated due to stupidity.",
            "This is a really great and important question.  Much of the protests aren't about pushing or advocating for policies that will actually create a long term peace or address the core issues.\n\nSince we're discussing this on Reddit, we'll skip over the long history of Israel and Palestine.  But there are a few points that we should review.  First, Hamas is a puppet government of Iran and Gaza is not a democracy.  Second, Israel has repeatedly tried a \"light touch\" when dealing with Hamas in the past and that has never lead to a lasting peace or a fruitful relationship.  Finally, no Islamic, Arab, Persian, or Turkic nation actively wants to help the Palestinian cause or give the Palestinians land because every time that has happened in the past it has only spelled disaster for the host country.\n\nWhat options does that leave us?  Realistically, the only options left open are one that no one will support and one that only the Israeli's support.\n\nA two-state solution *could* be possible but the ugly truth is that anyone that supports Hamas cannot be part of it.  Hamas is a governing entity that openly has a policy position of exterminating all Jews from the face of the Earth.  That is not tenable for two-state solution.  To make a two-state solution work Israel would need to:\n\n1. Imprison every male currently living in Gaza between the ages of 10 and 80.\n\n2. Relocate every woman and remaining male out of Gaza and into the West Bank.  This could be done by ceding territory roughly the size of Gaza to the West Bank enclave (governed by the PLA) in exchange for Israel taking direct control of the land of Gaza.  A land swap would be needed to house the Gazan refugees.\n\n3. Grant statehood to the Palestinians in the West Bank and allow a council of Arab states to be security guarantors of the new Palestinian homeland.  Normalized relations or trade deals could be used to incentivize this.\n\nYou can easily see how no one involved would sign off on any of this.  There will be no two-state solution.\n\nThe most likely end of this war is a 3-4 year campaign to destroy Hamas by leveling every major town and city in Gaza until the Gazans themselves opt for surrender.  The IDF will be an occupying force in the region for several years as they continue to destroy Hamas infrastructure and top leadership.\n\n*If* Israel had fully normalized relations with Saudi Arabia and other Arab states before October 2023, a two state solution would have been possible.  But Iran wanted to make sure that normalization will not happen.  In that they have succeeded.  And it will be the Gazans who pay the heaviest price for Iran's victory.",
            "What you are pointing is a thing but when Israël is telling a population to move from point a to point b because they are going to destroy that area and then you attack point B.\n\nAlso it's not only about Hamas, Israel leaders are saiying (and you can find that easily) that it's about Isaïe prophecy, getting back their land, that palestinians are humans animals, that they're evil, that it's about good against evil and that what they're doing is for our good, that what they're doing is fair and similar to WW2 D Day.\n\nThe ICC consider that as a genocide because of the destruction of willing conditions and Netanyahou has a international arrest warrant.",
            "[removed]",
            "The answer depends on who you ask, but I think it would be good to create a new state that includes everyone who lives in the Israel-Palestine area",
            "Of course it is not controversial to want peace.  All normal, well adjusted adults want peace.  Everyone's lives benefit with less conflict.\n\nWhat is controversial are how you answer the two questions that follow: 1. How do we get to peace? 2. What does peace look like in the long term?\n\nIt's an incredibly complicated situation and no sustainable answer is going to make either side very happy.  But it's not controversial to want peace.",
            "They are not pro hamas, they're pro civilians and anti genocide, which is a huge difference.\n\nI could be totally against far right ideology and will still defend them if those people were suffering injustice, mass bombing...\n\nIt's called being human.",
            "Idk, similar thinking to supporting the literal “free Palestine” movement isn’t antisemitic despite the movement being started by a guy that calls Jews “human pieces of filth” and “dregs of European garbage”, I suppose.",
            "They think that support for a marginalized group shouldn't be contingent on the political beliefs of said group. Like how I ideologically disagree with a good chunk of Floridian Republicans, but I don't want them to like, get squashed by an asteroid or something.",
            "Cognitive dissonance is a very powerful defense mechanism.",
            "Something like the partition plan - a state for Palestine, a state for Israel, some international community recognition of the status of Jerusalem",
            "Two state solution will never happen, a binational one state solution will never happen.  Israel is not going go wiped off the map.  The solution is status quo",
            "Yes, absolutely.  But you have to be specific that you're criticizing Israel, its government, or its military.\n\nMany people are cloaking their antisemitism in catch-all terms that that sound nice but dog whistle to other antisemites.  It's perfectly fair to criticize policies of the Netanyahu government or the actions of the IDF.  But you have to be careful because the government on the other side of this conflict has the expressed policy goal of seeing all Jewish people wiped from the face of the Earth.  All criticisms against Israel have to be couched in this context.\n\nIf you're spouting Hamas propaganda or slogans, waving their flags or denying Jewish people access to public places or inhibiting their freedom of movement then that would be antisemitic.\n\nGreat question!",
            "Yes. Conflating zionism with Judaism is a fallacy. They are not the same. Especially when you consider the fact that so many Zionists are not even Jewish, but are right-wing fundamentalist Christians, it simply doesn't make sense. It's a diversionary tactic designed to occupy our attention over the genocide. ",
            "People are siding with civilians which are for the most part not part of the hamas. Yet those innocent civilians (mostly children) die every single day from bombing.\n\nPeople are just human and when you see man, woman children and babies die in horrible manners, people starving, not having access to food, water, electricity, healthcare...\nYou just want the whole thing to stop.",
            "When Hamas attacked, Israel was already sieging Palestine. And Israel's response kills far more civilians than Hamas'",
            "Palestine (or in this specific case, Hamas) did not start the war in Oct 7th. This is the message being pushed by the pro Israeli / Zionist movement to justify their actions. Hamas' Oct 7th attack is a response to a history of violence towards Palestinians that goes back decades, but Even just in the year 2023 you can find time of incidents if violence by the IDF and settlers towards gazans\n\n\nOh, lastly I'll mention that Israel has thousands of Palestinian hostages, but they don't refer to them as hostages, they call them prisoners. Reality is they are held without trial or explanation indefinitely and many are tortured. So when you hear the argument it's about the hostages, that's not only untrue, but Israel has way more hostages than Palestine does",
            "What the other commentor missed in their answer is that most major universities have an endowment which is basically an investment portfolio that they have built from donations from alumni and other groups. One major demand of student protestors is that universities divest their endowments from companies that are involved in the Israel-Gaza war. Basically, they want the universities to sell off their investments in companies like Lockheed Martin or Raytheon which manufacture weapons that are sent to Israel",
            "If you're asking about how they are complicit in the genocide of Gazans, the view is that the universities take donations from Israel and pro-Israel organizations.  In exchange, the universities hire teachers that teach pro-Israel points of view and encourage students to vote for candidates that are pro-Israel.\n\nIf you're asking about how they are complicit in the genocide of the Jewish people, the view is that the universities take donations from Iran, Qatar, and pro-Hamas organizations.  In exchange, the universities hire teachers that teach anti-Israel (or anti-Jewish) points of view and encourage students to vote for candidates that are anti-Israel.\n\nUltimately, both positions are true and both are wrong.  Most major universities *do* get donations from pro- and anti-Israel governments and organizations.  That's why they're not caving to student demands to reveal their donor lists.  Doing so would make everyone outraged.",
            "> Why are people so angry at Jewish people in America?\n\nGenerally speaking, they're not. Look at the House of Representatives—overwhelmingly they're concerned about antisemitism, but they still deny that anti-Arab prejudice even exists. Or worse, they use it as a means to pander to their constituents.\n\nMany Americans *are* angry at *Zionism*, a collection of ideologies which fuel several complicated political trends in the Middle East, Europe, North America, Australia, and other places around the world. For example, [Zionism instills the idea in Israeli settlers](https://www.newyorker.com/news/q-and-a/the-extreme-ambitions-of-west-bank-settlers) that they have a right to simply kill Palestinians and take their homes. (You will note from that article that in fact, settlers' notion of Zion includes other countries which they expect to eventually belong to Israel—e.g., Syria, Iraq, Jordan, Lebanon, etc. No wonder Israel's neighbors are always so concerned.) Zionism also informed the [Likud charter](https://www.theguardian.com/world/2023/oct/31/from-the-river-to-the-sea-where-does-the-slogan-come-from-and-what-does-it-mean-israel-palestine) (Likud is the party of Netanyahu) which asserts “Between the sea and the river there will only be Israeli sovereignty” (echoing West Bank settlers' refusal to allow non-Jewish people the right to vote). If you look at the Likud charter, by the way, you'll notice that they explicitly characterized Palestinian resistance as malicious—something which the US government did to Native Americans repeatedly from the beginning.\n\nI hope it's clear from the above that there are legitimate reasons for people (whether they're American or not) to be upset about at least *some* of the ideologies that Zionism comprises. But on top of that, it has impelled what critics of the military industrial complex call *forever war*. The invasion of Iraq, for example, was based on \"ambiguous\" intelligence (now known to have been lies) for its justification to the public. Many of those lies were laundered through mainstream media, exemplifying what is called [*securitization discourse*](https://en.wikipedia.org/wiki/Securitization_(international_relations). Actually, *all* US involvement in the Middle East has been accompanied by expansive public relations campaigns conducted by Israel-aligned media figures such as Bush speechwriter David Frum, hawkish Israel-first PACs like AIPAC, and Israel-first think tanks like the Foundation for Defense of Democracies. Without the PR, the US public (like any public) naturally resists war.\n\nUnfortunately, securitization discourse tends to stoke right-wing political movements such as those which have risen globally since the 2000s. The wars, the government rhetoric, and the right wing politics, therefore, are all bound up in the situation between Israel and Israel's neighbors.\n\nSo:\n\n* (Some) Zionisms cause ongoing conflict between Israel and its neighbors.\n  * There is history here, and it's important; nonetheless, what stands in the way of a peace process today is the mindset of Israeli politics, which *is* fueled by Zionism in the style of Likud. We know this because *stopping the peace process* was literally Likud's purpose in the 2005 Disengagement Plan; PM Sharon's own government said so. They could replace Netanyahu tomorrow and his successor would likely have the same right-wing expansionist beliefs, predicated upon the kind of Zionism professed in the Likud charter. The Hamas attack isn't the root cause of all this. It's been going on since the beginning of Israel in the mid-20th century.\n* Because Israel depends upon the US for weapons and other aid, Israelis lobby the US government via the Israel lobby (which includes PACs like AIPAC).\n* US politicians receive money from AIPAC etc., and in exchange, they do several things:\n * write legislation that benefits Israeli citizens and Israeli businesses;\n * give Israel material support (not even required to be offset in the budget, as is normally done for domestic spending—America goes into debt to give material support to Israel);\n * build support for military spending and military action to suit Israel's interests.\n* The conventional wisdom in Washington is that none of these is *necessarily* wrong or even controversial *in theory*. (I think quite a lot of people would disagree, if they were asked.)\n* In practice however, there is always more to consider.\n * The US effectively gives taxpayers' money to Israel. Israeli citizens have the right to public healthcare, education, and other benefits which have been systematically *stripped* from citizens in the US over the last several decades. (The warhawks have their own rationalizations for this—all of them fairly tenuous arguments about US interests and how Israeli citizens serve them—but again, quite a lot of people would disagree with those rationalizations if they were asked. Do US citizens not serve US interests?)\n * This state of affairs causes resentment on its own, for obvious reasons.\n * But also, when people don't have healthcare and education, their society suffers. Believe it or not, illiteracy and innumeracy kill. Political extremism and casual violence grow when people don't know history, geography, science, etc., and when people are subject to increasing *austerity*. (People have less time to worry about their communities and the needs of others, including their children, when they need to work several jobs just to afford lifesaving medicine, pediatric care, etc.)\n * The right-wing character of Israeli politics means that Israel's effect on American politics has been, largely, to push them rightward.\n * In both Israel and the US, securitization discourse has profoundly altered the attitudes of the public toward concepts like human rights, war, international cooperation, religion, history, education, climate change and the environment, financial regulation, the immorality and harms of colonialism, even the usefulness of democracy itself—the list goes on and on. Securitization discourse produces right-wing fervor and leads to a loss of democracy normally *anyway*; but this situation is *exacerbated* by what I mentioned before (the destruction of public education, etc. austerity measures).\n\nEzra Klein can blather on about polarization and tribalism all he wants. At the end of the day, though, what makes people nervous about *today* isn't *polarization itself*; polarization has always existed in the US (because of its political system and its economy, *not* just because of innate \"tribalism\"). It's the expanded realm of \"scary ideas discussed as acceptable\" promoted by US media and officials. And these things are only treated as \"acceptable\" by Washington and New York because of the pressures of Israel's situation, on the one hand (which is again, caused in the first place by Zionism); and the slate of giant war corporations which blend eerily with the US military in their own separate feedback loop. And these scary ideas are the reason the US parties have torn up democratic processes every decade since WWII ended. (Which is why, for example, **three successive presidential elections** have been between candidates whom most of the country did not want).\n\n***\n\nI should mention this: not all Zionisms are the same. And then there are post-Zionisms, non-Zionisms, anti-Zionisms—none of them is homogeneous. But one thing which all Zionisms have in common is the belief that Jews (however we define \"Jews\") have the right (whatever \"right\" means) to live in Israel (whatever we think \"Israel\" is). \n\nBut you asked why people are angry—they're not angry at Jewish people *as such*; they're angry at the kind of Zionism practiced by the current Israeli government and promoted by most American Zionist organizations. I believe I covered several reason above. One more deserving mention is that **Zionism is giving cover to the genocide in Gaza**. That bothers people who believe in human rights.\n\nWhat's the point in living in a world where it's perfectly acceptable to destroy *universities*, *libraries*, *playgrounds*, and *innocent people*—and where your government privatizes your kid's high school, imprisons kids in privately-owned for-profit prisons where they're made to work like slaves, conducts mass surveillance, criminalizes protest, takes a cut of your wages and then gives it to the extremist government of another country where it's used to give education to the children of extremists, imprison Palestinians for years without trial, support apartheid in Gaza, build surveillance technology used to [ruin the lives of American students in their own country](https://truthout.org/articles/israel-has-formed-a-task-force-to-carry-out-covert-campaigns-at-us-universities/), [conduct psy-ops on Gazan civilians](https://euromedmonitor.org/en/article/4758/Punishing-journalists:-Israel-extorts-Palestinian-journalists,-bans-them-from-traveling---new-report), and [intimidate internationial courts](https://www.theguardian.com/world/article/2024/may/28/spying-hacking-intimidation-israel-war-icc-exposed)?\n\nWe have here not just one, but several governments implicated in massive human rights abuses across the world, including sustained attempts to undermine international organizations whose foundational principle, in the wake of two catastrophically violent world wars, is to adjudicate when individual governments backslide in their obligations to their human subjects. Altogether that represents a threat to the value of life itself. People *should* be angry. *Not angry at Jews*—angry at ideologies that impel violence, *including* settler colonial orientations toward the concept of \"homeland\" when they demand the removal of living populations.",
            "You can try to actually interact with both sides. The Palestinian civilians despite being the more brutalized the past 100 years want peace, while the Israeli civilians enjoy watching videos of Palestinians being tortured and killed ik telegram groups, make TikTok dehumanizing and mocking them etc",
            "It's an overcorrection for right-wing islamophobia.\n\nRight-wingers in the USA and Europe have been known to be horribly bigoted to regular Muslim citizens who haven't done anything wrong. Left-wingers don't like that, and sometimes they wind up overlooking stuff that Palestinians do, because they're afraid that criticism will spark more islamophobia.",
            "are you aware that the only reason homosexuality is illegal in gaza is because when the british took over they implemented british law there ??? once the british legalised homosexuality in their own country, it remained illegal over in gaza and the palestinians had bigger things to worry about than legalising it too like uh idk maybe massacres, bombing, occupation, starvation … the list goes on. (source: https://www.humandignitytrust.org/country-profile/palestine/)\n\nmany palestinians are actually supportive of the LGBTQ+ community and are in the community themselves. yes, the majority of people in gaza are muslim and islam condemns homosexual relations but you won’t get killed or tortured there LMFAO 💀 \n\nnot to mention that there hasn’t been an election in gaza since 2006 so it’s not exactly like the people could overturn the british legislation themselves. \n\nsecondly, us left-wing people support palestine because we disagree with ANY form of occupation and apartheid. sure, there’s homophobes in palestine, but there are homophobes everywhere. also literally almost half of gaza’s population is under the age of 14, and that’s arguably too young to even fully comprehend what the LGBTQ+ community is let alone form logical reasoning for why they’d hypothetically be against it.",
            "cognitive dissonance is the only real answer here",
            "No.  There is almost never a \"right\" side and \"wrong\" side in any conflict.",
            "It is perhaps the most complicated conflict in the world, so there’s not some objective answer to this that everyone agrees on.\n\nIn general, if you view problems and conflicts through power dynamics with the general perspective that richer entities somewhat definitionally have the burden to fix, Israel is the bad side.\n\nIf you view things through a more consistent lens where people should be judged by their actions and outcomes the same, regardless of their circumstances - then Israel is the good side.",
            "Let's see, shall we?\n\nWe have on one side:\n\nStarving men, women, and children getting bombed with no home, medical care, human rights, or anything at all really. Taken out of their original home, then taken out of another home.\n\nAnd on the other side we have:\n\n\"Soldiers\" who shoot-to-kill said men, women, and children, even babies.. I just wonder who the wrong side is? They're not really \"defending their land\" as it is not their land to begin with. It's like Russia invading Ukraine, marking Ukrainian territories as Russian and killing all Ukrainian men, women, and children. It's not their land, it's the Ukrainians. The Russians aren't defending their land from Ukrainians now as it is not theirs.. Same for the so-called \"Israelis\". How do you defend a land not yours? You don't. Ah well, I guess when you're a child-murdering-colonial-nation that is backed by the US, it's totally fine to commit a little bit of genocide and occupation on the side, hm?",
            "The UK promised the Zionists Palestine before the end of WWI (before they actually had the land to promise them basically). After WWI, tons of Zionists started moving into Palestine and the Palestinians were like whoa what are you doing here?! And then the zionists were like “well Britain said this was our land now” and the Palestinians were like “ok but no one even asked us about that?” And then the Zionists started pushing the Palestinians into Gaza and the West Bank and the Palestinians fought back for their right to stay and live where they had been living forever. But the Zionists had the power of the British on their side and had stronger more powerful weapons. It’s always been imperialism.",
            "I don’t know the proper history either but I think we’ve been fighting since the time of the Prophets, which I find.. horrifying.",
            "They are hoping that the Biden administration will listen and stop sending weapons to Israel.\n\nIf tomorrow, countries like The USA, France stop sending weapons to Israel and stop supporting what they're doing, the whole thing stop.",
            "Hamas is an entity that is not necessarily representative of all Gazans and definitely not all Palestinians (they're not even in the West Bank). You can be for Palestinean liberation while still acknowledging terrible things Hamas has done.",
            "Because they believe that if \"their side\" stops fighting, then the \"other side\" will do things that are even worse, because there is no longer anyone trying to stop them.",
            "Hamas, right or wrong is a resistance movement. They may not be the ideal resistance force, but they are what Gaza has. As a people fighting for their very survival, living in an apartheid state as second class citizens, they have a legal right to rebel and fight their oppressors.  In the same way you wouldn't punish a slave for rebeling against his master, you can't be overly critical of the actions of the resistance force and have to remember they only exist to resist oppression, which is the crime of the state of Israel",
            "tbh from my prespective the israeli military is invading so is obviously while hamas is simply defending. do i agree with or think hamas is using the most ethical methods? no",
            "How are you defining the term Zionist?  Who fits into that group?",
            "You're so close to self reflection on this, maybe think about why you've been led to believe that",
            "I'm a bisexual atheist leftist, and occasionally speak in the defense of Islam, and perhaps I can shed a little light, if you don't mind a late reply.\n\nFirst, it is a popular idea on the left that all oppression is interlinked. Fighting against, say, racism, is part of fighting for LGBT rights. Solidarity is the idea, solidarity among all oppressed groups. Second, attacks on Islam are often proxies for racism, pitting \"our\" religion, Christianity, against \"their\" religion, and lending an air of religious righteousness to racism and far-right thought, sometimes very obliquely. Third, it's about fighting collective punishment in general. You hopefully acknowledge that at least *some* Muslims are progressive and pro-LGBT (and LGBT themselves, for that matter)? Then this comes in part down to not causing trouble for that minority of believers for what other believers, even if they are a majority, do. For the thread we're in, you might see parallels with \"every Palestinian in Gaza is Hamas\". A lot of us on the left see these parallels a lot of places, and want the pattern of thought gone.\n\nIdeally I would prefer religion to die out, as I think most religions are drivers of bigotry and oppression, along with a lot of other social ills. But if religion is here to stay, as it seems, I would much rather have the progressive and accepting parts of each religion than the far-right parts that use the religion for hate. This fight is not over for either Christianity or Islam, though I'll tentatively agree it is further along in Christianity, despite setbacks. Today most Christians are probably in favor of women teaching or being in positions of authority. And even if we can eventually eliminate religious thought, it seems much more likely that we can achieve this through first making religions more open-minded. Treating Islam as categorically anti-LGBT gives power to the anti-LGBT parts of Islamic thought. There *are* dissenting voices, though oppressed and diminished, and by acting like they don't exist, or are incompatible with the religion, we would be contributing to their erasure and silencing within the faith.\n\n*No* thought is incompatible with *any* religion, because religion is not consistent and every believer, no matter how orthodox they claim to be, is eclectic to some degree.",
            "why are you bringing islam into a discussion about countries? none of this means to sit back and be okay with CHILDREN being starved and bombed",
            "Imagine your cousin gets released from his fourth stint in prison.  He calls you and asks if he can stay with you until he gets back on his feet.  You look at your kids, think about how much trouble he caused his parents after his last release and then you politely decline.\n\nThe Palestinians *have* been offered land in other Arab countries and the host countries always regret it.\n\nThe Jordanians call their experience Black September.  The Lebanese call it their civil war.  The Kuwaitis call their experience the Gulf War.\n\nNone of the other Middle Eastern countries want the Palestinians because decades of betrayal and fomenting wars has made them wary letting them into their countries or giving them land.\n\nExcellent question!",
            "These rich Arab countries have ties to the US, and some with Israel itself. It would lead to more problems.",
            "It is ironic in that they are in a similar situation as Jews were during WW2. They are essentially the Jews of the arab world.",
            "At least they're working together finally against a common enemy",
            "I don't feel this question is being asked in good faith, but since it's a common one I want to reply.\n\n\n The IDF is clearly the immediate threat.\n\n\nhttps://www.yesmagazine.org/social-justice/2024/02/05/israel-palestine-gaza-genocide-queer\n\n\nPlease refer to this article ",
            "It's hard to get info about the hostages.  The location of many of them isn't known, and the only publicly available updates are generally coming from videos made by their captors with limited pieces of relevant info.\n\nSomething like the Israeli military bombing a location in the Gaza Strip with thousands of witnesses nearby is a lot easier to collect info on.  Additionally, Israel's actions in Gaza recently have resulted in a huge amount of death and destruction, making it very newsworthy.",
            "the genocide started before october 7th, i’d suggest you do your research on how it began. the hostage situation is NOT what “started everything” 😭😭 it’s what sparked media attention.",
            "Because the media pushes a narrative. This doesn't just apply to the Israel conflict, but literally everything. I can tell you only watch left wing news outlets because Fox and other right wing outlets absolutely report on what Hamas and other Palestinians are doing to Israelis.",
            ">the hostage situation is what started everything \n\nThis started literally before Christ (but some believe it started when *modern* Israel was created). \n\nBut I ask myself the same question you asked, and basically, antisemitism (which is now rebranded as antizionism) is a strong reason why. Israel and Jews are seen as the “oppressor” and Palestinians as the oppressed. News sources are not highlighting the suffering of Jews because overall, people don’t side with Jews and that narrative. \n\nNews and media still need views and clicks to make money, at the end of the day they are a business.",
            "please do some research. palestinians are experiencing genocide and forced starvation, israelis are not going through anything",
            "Sorry to be the bearer of bad news but voting is the only thing that you can do (unless your a billionaire).\n\nWhich of the candidates do you think would be worse for the Palestinians; Biden or Trump?  Do you think there would only be a small difference in their policies or would they be orders of magnitude different?\n\nIf you are opposed to US support for Israel then Biden should absolutely be your vote.  Trump has promised unwavering support for Israel if he wins a second term.  You may not like President Biden's support for Israel but imagine what would happen to the Palestinians if the US ratcheted up its support for Israel 4 or 5 times what it is now, if it gave the go ahead to every action Netanyahu wanted to take, if it gave more money, material, and intelligence to the IDF.  That is what Mr. Trump is pledging if he wins reelection.  And you not voting in November is precisely what Netanyahu wants because he's sick and tired of the minimal demands and scoldings Mr. Biden has given him.  He *wants* a second Trump administration.\n\nYou're angry now?  If Mr. Trump wins reelection, you'll be on extra strength anti-depressants come February 2025.",
            "What’s Project 2025?",
            "> Why not support both sides?\n\nWhy would you support a side that has an espoused policy goal of wiping all Jews from the face of the Earth?\n\nThat isn't to say that Israel's hand are spotless or clean in all this but one side has the literal stated goal of wiping all Jews from the face of the Earth.  Why would you support them?",
            "This is the same argument that the \"All Lives Matter\" people use. I'll use the \"burning houses\" analogy that has seemed to clarify things for all of those peeps that I've interacted with in the past: let's say we're talking about houses instead of people. For the last 70 or so years, one particular neighborhood of houses has been constantly on fire. Why would we sit there and yell at the authorities that all houses matter when clearly the houses that are *on fire* need specific and immediate attention? That's just nonsensical. Obviously, there are civilians on both sides who are innocent, just as there are evil people on both sides. However, currently, only the Palestinians are being systemically killed and need international attention immediately. It is quite literally life or death for them. \n\nThere is no way to sugarcoat what the Isreal government is doing to the Palestinian people. It is a genocide. \n\nI also just want to point out that I have yet to encounter anyone on the pro-Palestine side that completely vilifies any Israeli civilians because we understand that most people have little to no control over what their government does, unfortunately. But of course, there will always be extremists on either side.",
            "It's a talking point.  Israel is important but not the greatest.\n\nSince it's a general election year both parties want to court as many votes as possible.  The claim that Israel is the US's greatest ally is a cynical attempt to grab the Jewish vote.  Jewish people make up about 2.4% of the US population while Arabs make up ~0.5%.\n\nWhile it is an important ally and certainly the greatest in the region, it is not greater or more important than the UK.  The Brits are one of the US's top 5 trading partners and are key in the US global foreign policy strategies.  Israel does not make it into the top 5 and only affects Middle East strategy.\n\nYou don't need to be confused.  Just learn to recognize jaded and cynical political tactics.",
            "Sure but every coincidence seems suspicious.\n\nThe helicopter was 45 years old, the Iranians don't use GPS (at all), the crash happened in the mountains, and it was foggy.  I'd put my money on those factors alone for the cause of the crash.\n\nBoth Iran and Israel weren't actually attempting to cause harm to each other in the aftermath of the Israeli strike on the Iranian consulate in Syria.  Killing Iran's president would be a break from that pattern.  The missile & drone strike Iran launched against Israel and the Israeli retaliation were both meant to be ineffective and impotent.  Both countries were trying to walk back from a full scale conflict.\n\nKilling Iran's president would be a direct provocation and escalation and neither Iran nor Israel wants war with the other.\n\nI think we can settle for Occam's razor on this one.",
            "If it wasn't a helicopter, I'd be more concerned, but those things are held together with vibes and duct tape",
            "The ripple effect.\n\nPeople *hope* that protests will eventually ripple out until they reach *someone* who has some influence on the matter.",
            "I'll take the edgy (but sadly probably true) answer here and say, \"because their professors told them to\"\n\n  \nthe average protestor knows very little about israel or palestine or their history. But it's the cool thing to do on campus so they just go and yell whatever other people are. I wouldn't say \"people are stupid\" but they are impressionable, especially at a certain age, and want to fit in. It's only natural.",
            "1) because it motivates political leaders to do something about it - ESPECIALLY political leaders that are personally involved (*cough* biden). groups that organise protests are known as “pressure groups”, there’s many different types but the gist of them is that they put so much pressure on a government that it forces them to take action eg. in london, a ton of our public transport staff were going on strikes for weeks because they were underpaid. it genuinely wreaked havoc, especially in the busiest areas of what’s already the most densely populated city in the uk. this forced the government into finally offering them a pay rise.\n\n2) because it raises awareness. it’s kinda hard to ignore the fact that there’s a genocide going on when there’s 250,000 - 1,000,000 people marching on the streets demanding that governments take action. it gets people thinking - take action about what ?? and then they do their research. maybe they even join the next protest in their area. \n\nseeing as you’ve universities being vandalised, in the uk we’ve had protests in oxford, london (specifically outside birkbeck uni), and i think cambridge? but i might be wrong because they actually ARE complicit, it’s just covert. the universities won’t be advertising that they support zionism, but they might be funding organisations that supply weapons to israel, they might invest in israeli companies, or they might even be funded themselves by zionist organisations. \n\nlastly, the people in the gaza strip ARE actually noticing it. eg. the murder of a 6 year old girl in palestine inspired macklemore, an american rapper, to release a song called “hind’s hall”, and not long after there was a video posted online of these young boys in the gaza strip listening to his song and expressing how grateful they were for the solidarity people are showing.",
            "Hamas was financed by Israel, the whole point was to make peace agreements and a two-state solution failed.\n\nThey don't really care if they still exist or if there are remnants when the goal is to get back their whole land.",
            "For America, at least, Israel represents sort of a 'foothold' in the Middle East, where a lot of them (varying levels of justified) aren't big fans of the US. They provide us with intelligence on their neighbors, so to speak. There's also the fundamentalist Christian contingent, but I don't know how much they actually account for.",
            "Israel is the only democracy in the Middle East, the “closest” to the west in politics and (all) human rights and freedoms. That’s pretty much why there is support. It gives ties and intel to other “western” countries. You are not dumb, you got the reason exactly - it’s very strategic.",
            "Short answer, yes.\n\n\nLonger answer, also yes. \n\nIf you are genuinely interested in knowing more about LGBTQ in Islam, my sincere advice would be to look to a local mosque if you can talk to their resident Imam about the subject.",
            "I was see it the other way around considering Sheria Law",
            "Unlikely. The USA doesn't want another expensive war, and the draft can upset the economy quite a bit.",
            "When you say *Palastina*, are you referring to the Palestinian people?",
            "Palestine is in actuality divided into two entities: the West Bank controlled by the Palestinian Authority and the Gaza Strip controlled by Hamas. Hamas was formed in the late 80s as an offshoot the Muslim Brotherhood that believed in armed and more violent resistance against Israel than what other governing Palestinian parties believed at the time. It's true that part of Hamas original charter stated its goal was the complete annihilation and destruction of Israel. The government of the Palestinian Authority was increasingly seen as inept and corrupt by Gazans as their ability to properly govern the strip and support it from the West Bank was hampered by their geographic division. Seeing this distaste towards the PA, Hamas ran as an official party in the 2006 elections and won governing control of the Gaza Strip. Hamas and its political rivals fought a short civil war in 2007 where Hamas managed to expel the PA and has since ruled Gaza with an authoritarian style. It's also important to note though that there is a lot of evidence that Israel was purposely sabotaging more progressive groups in the Palestinian government which created openings for Hamas to fill, so it's not like Hamas rose independently of Israel. While Gazans have supported Hamas in the past, Hamas has long since become an authoritarian government in the strip and acts with impunity regardless of what civilian Gazans may think",
            "That's not why Trump received his 2019 impeachment.\n\nHe was impeached for trying to get Ukraine to announce an investigation into his (likely) political rival in the 2020 election.  The first article of impeachment reads:\n\n>Using the powers of his high office, President Trump solicited the interference of a foreign government, Ukraine, in the 2020 United States Presidential election. He did so through a scheme or course of conduct that included soliciting the Government of Ukraine\nto publicly announce investigations that would benefit his reelection, harm the election prospects of a political opponent, and influence the 2020 United States Presidential election to his advantage. President Trump also sought to pressure the Government of Ukraine to take these steps by conditioning official United States Government acts of significant value to Ukraine on its public announcement of the investigations.\n\nThe withholding of aid was evidence used to support the charge that then-President Trump was trying to get Ukraine to play ball.  It wasn't the charge on which he was impeached.\n\nYou can read the [full document](https://www.congress.gov/116/bills/hres755/BILLS-116hres755enr.pdf) on the official web site of Congress.  But the charge was attempting to conspire with a foreign government to interfere with a US election.\n\nOn the question of Biden and Israel, the answer is no.  It's hard to see what charges the House could draw up. This is a foreign policy decision that is well within the authority of the office and the scope of his job.",
            "Who do you think Netanyahu would like to see in the White House next year?\n\nThe far left supporters of Hamas/Gaza have succeeded in showing President Biden that he is vulnerable without them and since this is an election year, he has to make some concessions to them on this issue.  Israel, of course, knows this and realizes that they will not be getting full throated support from the US while the presidential campaign is in progress.\n\nMr. Netanyahu also knows that a second term for Mr. Trump *would* yield full throated support for Israel.  As a result, Mr. Netanyahu will be prosecuting the war in a way that riles up the pro-Hamas/Gaza wing of the far left to keep them from supporting President Biden's bid for re-election.\n\nWhy does of the opinion of the far left on Israel bother Israel and its supporters to the degree it does?  Because it slows down aid to Israel and those people have become a political tool by those that want a wider, more violent war.\n\nGreat question!",
            "If you want to strawman their argument, is because Palestine is the Current Thing to be mad about.  There's always something to be mad about. \n\n\nIf you want to steelman their argument, the US provides direct support to Israel.  A lot of the bombs falling in Gaza right now were made in America.  That makes us complicit in a way that we're not in Congo, Myanmar, etc al. ",
            "I think asking them is the proper response. \n\nSay \"what kind of reaction are you expecting me to have to this\" or \"what do you think the proper response to this outrage should be\"",
            "They can't deploy Mossad into an active war zone.  That's not how Mossad works.",
            "How do you find Hamas when Hamas is everywhere and everyone?\n\nThe Gazans voted Hamas into power twenty years ago and then never held another election.  Over the intervening decades Hamas completely infested every facet of Gaza (like the Baathists did in Iraq).  It isn't just top military leaders in Gaza that are Hamas, it's the board of ed, the dog catcher, hospital administration, etc.\n\nIf Israel sends Mossad into Gaza to find Hamas, who are they looking for?  Just Sinwar?  Or are they looking for the trash collector that knows where the tunnel entrances are because he empties the trash cans outside them?  The school administrator that let the fighters train in the field for their raid in October of last year? The hospital administrator that has Hamas fighters sheltered in his medical building?\n\nIsrael can't send Mossad into Gaza with so broad a mandate because Hamas is everywhere throughout Gazan society.",
            "There is a lot to unpack here in this post.  You ask a lot of great questions but they cover a lot of topics.  Let's break it down topic by topic.\n\n**2 Regional Conflicts:**  The US is involved in more than just two regional conflicts.  Just to double your number I'll point out that the US is involved in the conflict with the Houthis in the Red Sea and it is still involved in the ongoing Syrian Civil War.\n\n**China:**  A conflict with China would likely see wide spread support from both parties.  Anti-China sentiment has been growing on both sides of the aisle for about a decade and a half.  There are several reasons for this but the largest ones are related to economic and public health.\n\nChina's foreign policy has an outsized impact on the US economy and we've seen many sectors of the US economy hurt because of Chinese policy.  And most Americans blame the Chinese for the COVID pandemic.  No matter which party controls the White House and Congress, if China attempts to capture Taiwan, the US will go to war.\n\n**Contradictory Foreign Policy:**  I want to bundle the remaining few questions into one group since they can be answered by looking at US foreign policy over the past 30 years.\n\nSince this is a Reddit post, I'll forgo the past 70 years of history and focus on the last 30.  Beginning with  the end of the Cold War the US has become less and less interested in foreign policy and maintaining the global order.  \n\nOnce the existential threat of the Soviet Union was gone, Americans got bored with everything outside of their borders.  The US has allowed all the institutions that support the global order to ossify; many Americans even pushing to abandon them.  The US has been shrinking their military footprint abroad; the current foreign deployment of US troops is at its lowest levels since before World War 2.  And since the fall of the USSR in each presidential race, the American people have voted for the Presidential candidate that was the most disinterested or incompetent when it came to foreign policy.  Until President Biden was elected; though he was elected because the American people thought he could handle a domestic issue (COVID) better than his rival.\n\nWhat little interest in foreign affairs remains in the American people depends on what interests the party represents.  Where each party stands on specific foreign policy issues completely depends on the loudest special interest groups of their constituents.\n\nAs a result, the party's positions on each specific conflict depend on how many votes they can get by adopting position XYZ on conflict ABC.\n\nThese were a lot of great questions that you asked.  Let me know if there's something I missed or should expand upon.",
            "It's bigger.\n\nNone of the other conflicts between Hamas and Israel have had anywhere near as many deaths.",
            "10/7 was the third-deadliest terrorist attack **ever** since data collection began in 1970. AND the largest attack in Israel history, AND the  deadliest attack on Jews since the **Holocaust.**\n\nMaybe that puts it into perspective a little. \n\nThe responses have been huge from both Israel and Hamas, people are feeling it.",
            "I think the social media footage and exposure to the conflict beyond what the mainstream media shows is unparalleled. It feels more real this time around to people",
            "The current death toll (according to the GHM) is 36,224.",
            "Some of them realize that suspension/expulsion can be financially devastating - not only to the student, but to their family.  But when you're young and insulated in an elite institution, the consequences may not be in the front of their mind or seem too remote.\n\nBut worse, the arrested students will face professional repercussions that they do not yet even imagine. For example, some of the protesters, no doubt, would continue their education beyond Columbia at an American law school and later seek admission to a state bar to practice (this being a common route that persons who seek the tools to effect justice through the courts follow). But those arrests will have to be disclosed to the law school and, more importantly, the state bar examiners - and the legal profession has a very different view of trespassing than humanities professors. This wasn't \"I was in a bar and a fight broke out and I ended up arrested\", which would still be a hassle to explain to the bar examiners. This was \"I knew what I did was illegal, was given multiple opportunities to not do the illegal thing and multiple warnings as to the consequences - and I broke the law anyway\". That is a person who does not possess the relevant character and fitness to practice law, and I think the protesters that seek such a career will be shocked by how tyrannical that process is (i.e., nothing like dealing with the Columbia administration).\n\nThe protesters rely on the presumption that they are the vanguard of history, that in time everyone will consider them heroes - just like their professors who participated in protests in 1968. But that is an immature view only possible on a college campus; the reality is that there are hundreds of millions of people who support Israel and will not be changing their minds on that issue for various reasons. And for some professions (e.g., law), the decision of whether to let someone in with an arrest record ultimately comes down to state supreme courts that are only interested in factual questions (did the applicant break the law? Was the law constitutional? How did the applicant reform themselves and demonstrate appropriate character and fitness after the arrest?). There isn't going to be a moment when the world suddenly agrees to forgive all of the protesters, even if their colleges ultimately do. The protesters who got arrested closed a lot of doors for themselves. They were betrayed by a faculty bent on using them as pawns for their own designs, a faculty that did absolutely nothing to protect them from consequences of their acts that essentially every professor on that campus knows will follow from an arrest.",
            "Hi! I’m one of those people, but behind the scenes because I’m disabled and can’t participate safely.\n\nIt’s not that we aren’t afraid of the consequences, it’s that we think it’s worth it. We’re taking notes from the Vietnam anti-war protests. By “taking notes” I mean we’re talking with the old timers that were at our universities during those protests, and learning what they did, how they did it, and what the long term effects were. \n\nWe know it can get bad. But we’ve also seen results. UCR had ALL of their demands met. We don’t care about being “heroes”. It’s a way for us to make some inkling of a difference in this horrible world around us.\n\nWe understand the consequences. We are aware of them, and we do fear them, but it’s worth it. Not to be heroes, but to have a clear conscience. To do SOMETHING.\n\nHundreds of thousands of people were pro-war during the Vietnam protests. Those protesters were arrested, beaten, called out on TV, called t3rrorists, etc (source: the old timers I’ve spoke to). They did it anyway, and so will we. \n\nCall it immature if you like, but it’s effective. These private Ivy League universities (I personally attend a public university) rely on student money to run. Students should have a say in where it goes. Meetings are already happening with university officials — it’s just not publicized because our demands have yet to be met. It’s a waiting game right now.\n\nEDIT: I will note — at least at my university, the majority of arrested students don’t actually have any charges against them. They are detained and then released in a few hours — not even a misdemeanor.",
            "Posts mentioning genocide get removed due to the assumption that they are somehow related to Palestine and Israel",
            "This thread is for questions. This is not a question.",
            "Yes, it will.  The whole thing sucks.  But I don't think bought blindly taking either side accomplishes much, and that seems to be what MANY other are doing.  And thanks for answering!  I was worried this would get buried.",
            "Reading through this. Thanks for the answer. It seems to me that people are upset Israel is responding with such force. But it doesn’t seem like they have many realistic options",
            "So first off, genocide is not a charge on the ICC arrest warrants. He's rightfully being arrested for collective punishment and the bombing of civilians, but not genocide just yet.\n\nSecond, I acknowledge that this has happened (bombing designated \"safe\" zones), and have seen Palestinians cry in the height of emotion that this must be deliberate targeting. And I see how from their perspective it would appear that way. But this isn't happening systematically. Most of the time, safe zones are safe and they are evacuating civilians effectively (the death toll would be far higher if they weren't, considering how much of Gaza has been destroyed). It just seems to be occasional instances where miscommunication or disorganisation has happened. Which is tragic, but probably also unavoidable.\n\nThe \"Israel are deliberately tricking civilians\" interpretation also neglects the possibility/fact that Hamas will run into safe zones after conducting bombings. File a missile at the Israeli army then run into a refugee camp for shelter. And over the course of the war they have followed their civilians, which is why they have now CHOSE to fight in Rafah despite it being so densely populated there.\n\nAs for the Israeli ministers, this is again very angering, but you also tend to find that in a parliamentary democracy there will be 1. a contingent of far right activists who say inflammatory and downright evil things, and 2. controls in place to limit their influence. Not sure how Israel works but in the UK it really doesn't matter what an MP says as long as they're not in the cabinet. And even under our deplorable, right wing government, they can't actually do anything illegal due to the house of Lords, supreme court, etc. Netanyahu is far right and I do not trust him as far as I can throw him, and the growing influence of far right extremism in Israeli politics is deeply converning, but this doesn't automatically mean that their controls within the army (a separate institution to govt) to adhere to the Geneva convention and other international law have failed. It's not a dictatorship where the army can just start breaking the law because a minister has told them to.",
            "People who were forcibly and violently removed from their homes didn't need \"a guy\" to \"start\" a movement.",
            "The Palestinians have rejected more than one partition plan.  How could they be sold on a new one?  What is the consequence if they do not accept it again?",
            "Pretty much this is the situation.",
            "Can you expand on who is covered by the term *zionist*?  It just refers to Jews and fundamentalist Christians?  Or is there a specific policy/position that earns someone the title?",
            "I agree I want the whole thing to stop. But is that really pro-Palestine? That sort of just feels like a pro-peace situation no? \nAlso, correct me if I’m wrong. Aren’t the hamas hiding amongst the civilians and the civilians are hesitant to point them out? \nI’m just trying to ask my questions, looking for answers.",
            "Are the only sources for this TikTok and telegram, because those aren’t trustworthy sources unless verified by another outside source. If this is also the case, can you link them. Because as is, it just sounds like you are demonizing a people for the actions of their government. Unless there is actual proof outside of what is essentially he-said-she-said TikToks and group chats, it’s kind of scummy to fuck over an entire country of civilians who are also being bombed. I don’t honestly think that children deserve this kind of treatment being forced upon them by governments that treat them like human shields against the other. Please link me sources so others may use them too. Credible sources (not biased news sites and not social media platforms) are the only method of gaining accurate information.",
            "So it isn't worthy to talk to the 4 million israelis + all the Jews who live in the diaspora? You're generalizing.",
            "That is a horrible and untrue generalization. Of course there are radical people on either side. But generally, Israelis also want peace. Israeli citizens are trying to live their lives, and so are Palestinian citizens. \n\nBut unfortunately,  on Oct 7, there was a video going around of Palestinians celebrating in the streets. As innocent people from the Nova Music Festival were being manhandled and carted through the streets by members of Hamas.",
            "Why do Pro Palestine people always lie?",
            "I'd say they're doing a good enough job sparking islamophobia themselves, no?",
            "I think it would be more intellectually honest to say that you support Palestine in spite of the fact that they are mostly anti-LGBT and hope that they change their views in the future given self-determination or something in that vein.\n\nLet's not play pretend that they are allies in secret in order to better cognitively deal with the problem.",
            "You really don't think you'd get killed for being gay in Palestine? I mean, you know there's like, hundreds of videos of it, right?",
            "You are incrediably naive about Gaza’s view of homosexuality, like shockingly so. Remember Tik Tok isn’t a source and Islam is violently homophobic so no the British did not cause Gazans to murder gays.",
            "Disagree - Nazis. USSR. Russia-Ukraine. Rwanda genocide. ISIS. \n\nThere are plenty of modern conflicts where there is a right and wrong side. Now, you could play the sophist and say, well, the Treaty of Versailles was wrong so... Nazis, but Nazis were still wrong. Older wars like WW1 or even the Napoleonic wars were perhaps less binary. \n\nRe I/P. I think this is less complex - Israel-Hamas is obvious. Israel is right after the Hamas attack. You could argue \n\n- years of oppression\n\n- Israeli covert support for Hamas to divide Palestinians \n\nBut this still does not make the attack right. Did israel react proportionately? I would argue - relatively - yes. Apart from Hamas including their fighters in the figures, the Israeli response is probably less bloody than the US in Iraq. Does that mean I'm happy with it? No. I think it is an epic tragedy caused by a confluence of factors springing intially from European anti-semitism and the formation of Zionism. Israel was subsequently created. Does this make Israel 'wrong'? No - there were/ have been huge population movements in history and the world adapts. The fact that Israel's neighbours refused to do so, is as much their fault as the Israelis and they are therefore equally to blame. So as I said, it's complicated.",
            "Lying isn’t going to help the Palestinians",
            "It definitely makes me feel helpless- this IS a genocide and it is breaking my heart. Our government doesn’t care about what its constituents want and it never has.",
            "I do wish that we (America) weren't involved here but I imagine Israel has their own weaponry by now.",
            "Totally fair. Just as people can support Jews or Israel while not condoning the the IDF or Netanyahu's government.  Both sides do seem to have majority support or at least tolerance of their respective populations, so I'm not sure how far that argument really goes. \n\nBut notice that's not really my question. Not supporting Hamas seems wholly understandable. I know that supporting Palestine isn't the same as supporting Hamas. And yet there are plenty of people who openly support Hamas.",
            "More reasonable than some approaches here. But this isn't a question of why people think Hamas or Israel should keep fighting, I'm asking why they even have a side at all? Why would anyone pick either side in this fight?   Why would Israel/Hamas be \"their side\" in the first place?",
            "> but they are what Gaza has\n\nWell yeah, after Hamas murdered Fatah, their political rivals in Gaza and they haven't let Palestinians ever vote again.\n\n>living in an apartment state as second class citizens, they have a legal right to rebel and fight their oppressors. \n\nI'd honestly agree.  Surely Israel knows they're breeding terrorists with their oppression and this ridiculous setup of kinda sorta claiming ownership of it all.     This is really a civil war with the 2nd-class citizens rising up and one of the reasons that Israel isn't the good guy in this fight.   \n\nBut terrorism? Murdering children? It's just not the way and I'm more than fine with criticizing the organization that attacks easy soft targets.\n\n\"they have a legal right\"  \"you can't be overly critical\".   ....Do you actually support Hamas? You're dancing around that using so many weasel words I'm surprised you don't have hairballs.",
            "what a talking point filled post.",
            "> while hamas is simply defending.\n\nWhat did Hamas do on [October 7th](https://en.wikipedia.org/wiki/2023_Hamas-led_attack_on_Israel)?  Holding hostages. Attacking 2 music festivals. Hundreds dead.  Taking aid from Palastinians rather than distributing it. Up until 2017 their charter had \"death to the jews\".  They're islamic fundementalists and would behead all the queers in America.   They're officially a terrorist organization as seen by the USA. Probably from their involvement with the 2011 Alexandria bombing, the August 2012 Sinai attack, and the December 2013 Mansoura bombings.  All those rocket attacks.   How about that one kid whom they chopped her arms off and left her to bleed out.  All of that can't be fake. Not with all the footage with the corpses.\n\nWhile I think their push for a 2 state solution is reasonable, their refusal to have any further elections the moment they got elected and then killed a few hundred of the  Fatah opposition makes any state run by Hamas sound like a bad idea. \n\nAnd Israel isn't really looking like the good guys either.",
            "Zionists are a group of Jewish people who work towards the goal of creating and now preserving a Jewish nation in Palestine based on a claim on the region as the ancient Jewish homeland.\n\nSounds ok maybe, but it turns out that when your goal is entirely centred around the dispossession of another peoples land for your own agenda, you might not have the most robust sense of moral responsibility.\n\nIsrael isn't going anywhere, I think we all know and accept that, but it does not need to be taking the reprehensible actions it is currently taking under the guise of 'defence'.",
            "Thanks for the lesson on past arab conflicts …reading about the black September right now …wow …",
            "Yea, but not all",
            "Israel was founded legally, the info is lit available online lol.\n\n  \nThere was never an  independent state of Palestine, ironically Romans came up w the name just to  erase  Jews from the land but  yall not ready for that talk",
            "This was my intended research",
            "Not going through anything because the IDF is pretty good at defending borders, otherwise, they too would be facing genocide and starvation. This is because UN troops are shit and cant protect either Palestine OR Israel",
            "Yeah just the thousands of rockets and terrorists attacks, those don’t exist apparently…",
            "I k ow all that, but I’m freaking out because so many people are saying they aren’t going to vote for Biden because of how he’s supporting Israel & it seems like a guarantee that Trump’s going to win at this point I also know why the people who aren’t voting for Biden are upset, so I’m stuck in the middle on what the right thing to do is.",
            "It’s basically the GOP’s plan to dismantle various branches of government like the FBI, the DOJ, & the Department of Education and reshape the country into a Christian Nationalist authoritarian state https://apnews.com/article/election-2024-conservatives-trump-heritage-857eb794e505f1c6710eb03fd5b58981",
            "I don't mean support the leadership. I mean humans in general. less wars and more peace-making",
            "This is a pretty bad generalization. Most people of that side just want to live free in their own country and home which was taken from them. Before you say \"But there ARE some people who-\" yeah, sure. But that's not the most here. Most of them are fighting Israel not the jews. Which is why, if you couldn't tell by my comment, I support Palestinians.",
            "Israelis want to live peacefully too. Israelis aren't their government just like Palestinians aren't Hamas.",
            "> It is a genocide. \n\nThere's a difference between ethnic cleansing and genocide.  Israel's goal is not to wipe out the Palestinian people.  If that were the goal, they could have accomplished that over the past 70 years.  And if it were only recently their goal, shouldn't they be taking action in the West Bank and southern Lebanon?\n\nWhat Israel is doing in Gaza is better described as ethnic cleansing (wiping out the government, wiping out civilian infrastructure) since the goal is to eradicate the culture and governing structure of a group in a limited geographic area; not to wipe the Palestinians from the face of the Earth.",
            "Oh, I can see most of that but they are literally saying now. As in the link I sent. They are saying America's greatest ally. Not _in that region_, not _in the Middle East_. \n\nYes, it is an election year but rhetorical semantics do mean something. \n\nI am a veteran and also served overseas in Europe, especially the UK, so have experience with the militaries of other allied nations not to mention their social and cultural aspects. \n\nI don't deny Israel is an ally of the US I can't help thinking that this alliance is petty much one sided. And they say that Israel gives the US a \"foothold\" in a hostile region but the US doesn't have any military bases in Israel. During Gulf Wars I and II our bases were mostly in Saudi Arabia and Turkey (a NATO member). \n\nAlso, I wonder why that region is so hostile in the first place if it were not for Israel. I mean most, if not all, the US's problems there seems ultimately tied to Israel and its behavior since its inception. \n\nI was raised to believe that the US was the world's good guy because we championed freedom, justice, and fairplay for all. I haven't believe that for a while.\n\nAlso this reminds me of a passage in Orwell's _1984_, during one of the Two Minutes of Hate scenes where there was some big problem caused by terrorists or traitors and that Oceania wasn't at war with Eurasia but was really at war with Eastasia. Or something like that. \n\nI just don't like the blatant claim that replaces UK as our greatest ally.",
            "How would that conversation go, hypothetically?",
            "yeah but it wouldnt be an active war zone if israel wasnt bombing it",
            "thank you i actually didnt know this",
            "Thanks for your patient reply. I've learned a lot from it. ![gif](emote|free_emotes_pack|give_upvote)![gif](emote|free_emotes_pack|give_upvote)",
            "[https://www.bbc.com/news/world-middle-east-69014893](https://www.bbc.com/news/world-middle-east-69014893)",
            "Have any other universities divested?",
            "This particular movement of “free Palestine” as recognized internationally recognized group led by a “guy” that has named “Jews” as the issue, not “Israeli’s” as the problem- and has done so since 2003. The great grandchild of an immigrant is not to blame for their ancestry and birth place. The Jews themselves are not a fault for the fight of their government. \n\nThe pro-Palestinian movement, organized by the “Palestinian solidarity campaign” to fight against the onslaught of Israeli violence is separate from the desires of Hamas and the “free Palestine” movement, and should be recognized and respected as such.",
            "I think there’s a big difference between what the PA wants, and what’s actually good for the Palestinian people. You’re right that the PA has rejected many attempts at peace. And certainly Hamas isn’t going to have the best interests of Palestinians in mind either. But those are the leaders that Palestine has…",
            "Zionism is a political ideological movement. A zionist is anyone who believes that the Jewish people have a \"divine\" claim/right to the territory that is Israel. ",
            "Most people who say that they're pro palestinians are pro peace and want a two state solution. Nobody (or a bunch of degenerate morons) are pro hamas.\n\nHow would you want civilians to act ? Trying to find out who is a hamas member and who's not, trying to find where they're hiding and then reaching to the Mossad to tell them where they're are ?\n\nWhen you have no access to food, water, electricity, that you could die at any given time and that you risk getting killed by Hamas itself, it would probably be at the bottom of my priority if i was a civilian under those circumstances.\n\nMy only priority would be to survive and to protect my family and run from that hell.",
            "i’m not pretending that they’re allies, i know that the majority of palestinians aren’t, but most understand that us queer people are human beings just like them and disagree with us being killed or imprisoned (unlike what the person i replied to had said). there’s been several studies across islamic countries and in some most people are opposed to the criminalisation of homosexuality despite being against it as a whole. \n\nyes, i support palestine in spite of most palestinians not supporting the LGBTQ+ community, but i also support it in union with the thousands of queer palestinians that exist and the innocent babies and children who likely won’t have even formed an opinion on the queer community, let alone want queer people to be executed.",
            "I said \"almost\" for a reason.  WWII isn't a great counterexample though, since most of the fighting was USSR vs Nazi Germany.",
            ">  Did israel react proportionately? I would argue - relatively - yes. \n\nNo. Outright no.\n\n> the Israeli response is probably less bloody than the US in Iraq.\n\nAn illegal war which nobody but the Israel-first crowd approved of—great idea, bring that up as an argument.",
            "LMFAOOO. ok bud",
            "We are never really listened, we are here to give them our votes, our taxes but listening to what we want error 411.\n\nIt's sad that we learn about history, that we preach about peace, about tolerance... but that those things are never really applied when it comes to our politic leaders.\n\nAll we can do is voice our concerns but if they don't give a fuck (and it seems like it's the case), things won't change.",
            "80% of the Palestinians support Hamas. During the massacre, there were thousands of civilliance that killed, raped, tortoured.\n\nYou saw how hundreds of Gazans cheered seeing pickup truck with dying Israeli bodies. spitting and hitting the bodies . Shortly after the massacre people in Gaza aired footage from 7th and the crowd celebrated to the sight of murdered burned mulitated fammilies with children, babies, elders and even the family's dogs.\n\nIn Israel we have dumb a$$ people that I wouldn't mind if they stop breeding, but at least they arent as beasts as 80% of the Palestinians are.",
            "Maybe we should just turn the whole region to glass and take some time to self reflect?",
            "I've been wondering about this a lot, too, but haven't seen much back up for this line of thinking at all when I've seen people talk about this war. TBH it's a relief to me just to see your post right now.\n\n\n\nExtrapolating from how people handle other current events (ex. anytime the US has 2 undesirable frontrunners for office), when there's a lose-lose situation, people are prone to pick the \"least bad option\" and try to ignore the faults of that choice because they don't want the baggage that goes with it. In this case, there's also a linking of civilians to their respective \"representative\" gov/military presence (that IMO really fuels the fire and gets people broadly dehumanizing one another really quickly - but people really seem to hate it when I say that) and the apparent feeling that you need to justify everything the IDF or Hamas does in order to support the people they claim to represent. I'm sure there are people supporting either side fighting purely based on the geopolitical results they want from the conflict, too, and just turn their backs to how those ends are achieved.",
            "I support a Palestinian resistance to the apartheid state. I could ask if you support Israeli's occupation of Palestine and the crimes the IDF / settlers commit on civilians.\n\nCalling me weasely doesn't really make me want to engage with you though, so I'm done\n\n\nedit: it's not about thin skin, it's about not wasting time when people are having bad faith arguments and simply looking to pick fights. What does discussion even accomplish?",
            "i think hamas in and of itself was made to be a resistance group; do i think thats how its going? not entirely. also, the “they kill queers in palestine” argument has always been so stupid to me. its not like israel is sparing the queers lol",
            "What did Israel do in the 75 years preceding October 7 after the Nakba? Are we going to act like those never existed. They attacked Gaza countless times and committed several massacres before Hamas even existed.",
            "Are those who are not Jewish but support Israeli and policy and action in this conflict Zionists?",
            "The native population were legally removed. By force.\n\n  \nCool.",
            "We're still 6 months out from the election and that might as well be an eternity in terms of an electoral cycle.\n\nBetween now and then the polls will swing back and forth.  Come October, most people will actually start paying attention to the issues and candidates.  But for the next 6 months, both candidates are walking on a knife's edge as the struggle to keep their bases energized and also hide the signs that they're very old men.  One serious age related gaffe will ruin their candidacies.  And they're both equally likely to have that happen.\n\nAssuming neither one pulls a Mitch McConnell, it's probably going to be very close; like it was in '16 and '20.  Although the war itself probably won't impact people's vote (foreign policy usually doesn't), the optics from the Democratic Convention likely will affect the vote.  The convention this August will probably look like the '68 convention and the Republicans will be able to spin the news footage to make themselves appear to be the party of law and order.  And crime *is* an issue on which people vote.\n\nSo, if you live in a state that isn't ruby red or Neptune blue you better get out and vote and encourage everybody you know to vote.  'Cause if Trump wins this election, there will be nothing that stops Israel from becoming an actual apartheid state.",
            "The issue in this conflict is that the populace and the leadership are so intertwined they're almost indistinguishable.\n\nHamas was voted into power 20 years ago and then never held another election.  At this point Hamas is every institution, every facet of life in Gaza.  From the principle at the school to the administration at the local hospital, to the garbageman that picks up trash.\n\nYou can think of it like the Baathists in Iraq.  Wanting peace is a noble goal but how do you make peace with a group of people that openly support the extermination of your ethnicity?",
            "> Most people of that side just want to live free in their own country and home\n\nThe men who engaged in the October attacks on Israeli civilians last year had the full and complete support of the citizenry of Gaza.  Sure, maybe there were some kids too young and old people too demented to realize what was happening.  But the people of Gaza knew this attack was coming, knew what kind of people were going to be targeted (civilians), knew what would happen to them and did nothing.\n\nHamas telegraphed the training and targets of this attack to the people of Gaza via [social media](https://apnews.com/article/israel-palestinian-war-hamas-attack-border-wall-aa0b0f5f3613b6c6882cf37168e8e8ed).  They practiced in view of the [public even within view of a UN aid center](https://www.bbc.com/news/world-middle-east-67480680).\n\nIf I saw people build a replica of your house and repeatedly practice storming it and taking hostages, what should be my response?  Can I reasonably defend the decision to do nothing as \"just wanting to live free\"?\n\nHamas's position on wiping out all Jews from the face of the Earth isn't just a government policy position, it's something that has been indoctrinated into the culture for the twenty years that Hamas has been in power.",
            "You're justifying genocide. It's genocide. Is Israel targeting the government and wiping out civilian infrastructure? Yeah, they are. But are they also fucking murdering and bombing Palestinian babies, killing Palestinian women and men, and calling all Palestians hamas? Yes they fucking are. If this were to happen to Ukraine with Russia it'd not be taken lightly as \"ethnic cleansing\". How fucking dehumanized of basic sympathy can one be to not acknowledge that what is going on in Gaza and Occuiped-Palestine is nothing but genocide? The fuck?",
            "As I said, it's a cynical rhetorical ploy.  But you're right, this kind of thing does have consequences.\n\nOn the question of the value that Israel provides to the US, you're correct that we don't have any bases in its borders but there are other ways that the US benefits from the alliance.  For example, the US collaborates on intelligence matters in the region and having intel from Mossad is very valuable.  We also benefit from collaboration in developing military technologies; technologies that wouldn't see field testing otherwise.  Most of the aid money sent to Israel is spent at US weapons manufacturers, which keeps US workers employed.\n\nYou rightly observe that the US problems in the region are largely tied to its support for Israel.  But the US wasn't extending its global hegemony into the region until around the same time that Israel came into existence.  If we look back at the hegemonic powers were involved in the region, we see that it was equally challenging for them: the Brits, the French, the Ottomans, the Byzantines all were despised and saw no end of trouble for being involved.  Israel certainly complicates matters but it certainly isn't the start of troubles in the region.\n\nBut looking at the options for geopolitics, who was you rather the US was in bed with?  Israel or Saudi Arabia?  Israel or Turkey?  Israel or Iran?  The list of stable partners that don't actively try to destabilize the US is pretty short.\n\nIn the long term, I wouldn't sweat it.  Regardless of who the Republicans or Democrats *say* is the US's greatest ally, it won't change the US relationship with the UK.  Regardless of who the US supports in the Middle East, it won't change the outcome of Israel's war with Hamas.\n\nIf it does bug you, then use that to inform your voting this fall.",
            "It would likely begin with some context into our rights over our bodies. The \"my body, my choice\" conversation gets a little muddied when you believe that your earthly body does not belong to you, it is God's creation, and He has certain rights over it. \n\nIt couldn't be a short discussion though, it would require a lot of back and forth, which is why I don't think trying to explain it in a Reddit post would work, would lead to way too much hostility in the absence of a measured and sincere conversation.",
            "I’m not sure. I believe so — I know many were in the negotiating / talking stage as of Wednesday, but I’m taking a break from it all because I’m in the hospital at the moment and have limited screen time.",
            "There isn't an internationally recognized group led by some guy. The broad community of people who support Palestinian liberation *is* separate from the desires of Hamas, yes.",
            "Would you support an enforced two state solution on the Palestinians?  Like if a league of Arab countries signed off on it and set up an interim government for the new Palestinian state?",
            "That is not true. Zionism is simply a movement for jewish self determination, it is not specifically about the palestine area as they thought about having the jewish state in places like Uganda, Argentina, Mozambique and many more. In fact, Zionism was actually mostly secular.",
            "Would someone supporting Israel as a matter of realpolitik be a Zionist?",
            "Gotcha. Thank you for this side of an explanation. I agree my only actions would be to survive and run like hell.\nIt is a lose-lose for the innocent civilians. It’s just such a hard situation. As people always say: war is never simple. Thanks again for your responses!",
            "In these kinds of matters, I think it's important to be as objective as possible. I think it creates anti-Palestine sentiment when people that are too left-wing also try to clean up their image too hard and make them into people that they are not, you know?\n\nYour initial comment read like that, that you were trying too hard to think of reasons for them to be supportive of the LGBT community, when they aren't in reality. You were blaming the British very hard.\n\nFor example, it is important to discuss openly how can they become a non-extremist Muslim state in a 2-state solution, because the truth is that most of their citizens share those beliefs at the moment. It is complicated, because their living conditions also led that to that, it didn't happen in a vacuum, but their population is extremist and it can't be swept under the rug.\n\nPersonally, I lean towards the center. I can see the good and the bad on both sides, I don't see the world in black and white like at did at 18.",
            "> 80% of the Palestinians support Hamas\n\nI can somewhat better understand why people living under Hamas's rule would support Hamas, or at least say they do.  My question really was geared towards English speakers and the West in general. \n\n> but at least they arent as beasts as \n\nFrom a native speaker to a Hebrew speaker, you need an apostrophe to show that \"aren't\" is a contraction, and a \"-ly\" to denote a word as an adjective such as \"beastly\".  \n\n\nSo. Do you support the Israeli military and what they're doing?",
            "Less than a fair take. Why be involved in the clusterfuck at all?  We SUCK as the world police and are obviously not up to the task. Genociding the whole region, while within our capability, doesn't seem very productive.",
            "I support an end to the apartheid state.   A two state solution is likely the best. \n\nI think it's fucking nuts that you'd support terrorism.   Especially out of someone with thin enough skin you'd fleeing the moment someone disagrees with you.\n\nEDIT: So weaselly you edit posts rather than reply. I am NOTHING if not full of good faith here. Both these assholes horrifically suck and I can prove it. I'm trying to understand why anyone would support either one of them.   So far only people supporting Hamas have stepped up, but they've had some shitty arguments and flee or back off when actually pressed. At least they can admit Hamas is not the best.",
            ">  its not like israel is sparing the queers lol\n\n[WTF man!?](https://www.pbs.org/newshour/world/thousands-march-in-jerusalem-pride-parade-under-israels-far-right-government), yes they most CERTAINLY DO!  The conservatives and ultra-orthodox jews probably don't approve, but they at least tolerate it.",
            "This is pinkwashing, some zionists use it as justification for Israel’s actions as if their bombs aren’t killing any of the LGBTQ people",
            "They did some horrible shit and Israel are not the good guys here.   Regardless, their atrocities do not excuse the atrocities of Hamas. Nor do Hamas atrocities excuse Israel suppression and genocide of their second class citizens.\n\nThat's my point though, they both act horrifically. Why support either side?",
            "I guess it depends why they support Israel, but yes I'd be more inclined to say they are Zionist than not.",
            "'legally removed by force' the partition plan was offered to the Arabs and they chose to go to war rather then accept an easy solution to their troubles ",
            "The problem is that Biden completely lost the entirety of the young voters. I used to tell people that Trump would be worse if he became president too, but every time I try to point out how Biden is th better option he does something stupid to prove me wrong. Between fully funding the genocide in Gaza, calling anyone who protests against it antisemetic and allowing police to brutally attack them, and banning TikTok since it counters mainstream media propaganda, everyone I’ve seen is absolutely refusing to vote for him at this point. One person even said that the only viable compromise to vote Biden after everything he’s done is to unalive your children to make up for all the children who were murdered in Gaza  \n\nSo many people are fed up with both politicians in general and feel that the way Biden’s handling things now is no different than what Trump would’ve done if he was president. The fact that Congress created a bill that would deport all of the student protestors to Gaza for “community service” is enough proof.",
            "> Sure, maybe there were some kids too young and old people too demented to realize what was happening. But the people of Gaza knew this attack was coming, knew what kind of people were going to be targeted (civilians), knew what would happen to them and did nothing.\n\nWhat were they supposed to do? \"Oh no Hamas don't do that\" those people have no say in anything. You're delusional if you think there was something they could have done.\n\n>If I saw people build a replica of your house and repeatedly practice storming it and taking hostages, what should be my response? Can I reasonably defend the decision to do nothing as \"just wanting to live free\"?\n\n  \nIt's a house I stole; therefore not really my house. They'd be practicing stealing back their house from burglars and taking some other burglars hostages.",
            "Being passionate about something doesn't change definitions.  I get that you're angry about civilian casualties but that happens in war.  That doesn't make it genocide.\n\nAnd this *is* already happening in Ukraine with Russian troops kidnapping Ukrainian children, targeting civilian infrastructure.  But that's not genocide, it's ethnic cleansing.\n\nWas Dresden or Hiroshima genocide?  No, of course not.  Civilian casualties are a part of war.  War isn't some sanitary thing where only bad guy soldiers die, it's not some kid-glove police action.  Unless you're making the claim that all war is genocide then you need to reassess your position.\n\nScreaming and swearing that it's genocide doesn't make it genocide.  Take a deep breath and think about the implications of what you're saying.  If civilian casualties=genocide then the Allied victory over the Axis powers was immoral and shouldn't have been allowed to happen.",
            "Voting in the fall! Lol\n\nI don't think this issue will change much for me because honestly I don't like any of the \"choices\" that are being given to us. I'm not an isolationist but I do think that what happens within our borders must come first and then deal with everyone else according. Yes, have allies but also don't actively make enemies.",
            "There is literally a separate group from Hamas that is the “Free Palestine Movement”. It’s the first link on Google- pasted what I was referencing for you though. \n\n[Free Palestine Movement](https://en.m.wikipedia.org/wiki/Free_Palestine_Movement)\n\n“The Free Palestine Movement was founded by Yasser Qashlaq, a Syria-born Palestinian businessman of considerable wealth who heads several organizations including the Lebanese Institute of International Studies, the Syrian-Palestinian Investment House, the Palestinian Businessmen's Club, and also owns a small Lebanese newspaper.Furthermore, Yasser is known for his antisemitic views, having repeatedly called Jews \"dregs of European garbage\", a \"gang of criminal murderers\",and \"human pieces of filth\"that should be deported to Europe.He has also stated that there is \"no reason for coexistence\" between Israelis and Palestinians, as the latter would reclaim their lands and \"hunt [the Israelis] down to the end of the world, and prosecute them for their massacres\".Though close to the Syrian government, Yasser has denied any links with Hezbollah.”\n\nMaybe I misinterpreting that “founded by” and had himself stated he still leading it means that… he leads it?\n\nAgain, I’m not saying the free Palestine movement people identify with is a disingenuous movement, but there has to be some appreciation for the religious motives behind the leaders…. So essentially “free Palestine”≠ sovereign Palestine w/o war, but “liberate Palestine” = peaceful sovereignty \n\nAnd I also am confused you are trying to argue that the sovereignty movement (the not inherently antisemitic movement ) didn’t have individuals taking leadership to respond to issues the Palestinians faced? Like to plan out protests, movements, and retaliations- these aren’t just random and group chatted, people spend hours doing this so I’m confused I guess",
            "Hmm. It may not be exclusively about the territory of Palestine. But according to what I've read of Theodore Herzl and the early writings on zionism, it has the specific objective of a divine right to a Jewish state. 'Self-determination' is a pretty ambiguous term by itself.",
            "It depends. Specify \"supporting Israel\" ",
            "Peak example of pinkwashing, a pride parade in Jerusalem doesn’t have any bearing on the lives of gay and queer Palestinians in Gaza.",
            "i mean out if the palestinians theyre killing, they dont save the gays",
            "Because one side has been under occupation for 75 years and is actively being ethnically cleansed. October 7th was a tragedy and inexcusable but it’s a drop in the bucket compared to what Israel has put Palestinians through for the last 75 years and is continuing to do so. Hamas is not representative of Palestinians as a whole and it is not a military or governmental organization, they are fighting a “war” against an international superpower backed by western countries. Israel claims to want to free the hostages and stop Hamas but continually have declined ceasefire proposals that would free hostages. We don’t even know how many Hamas members they have killed the majority are civilians and women and children. People think that wanting a free Palestine means supporting Hamas, those of us (myself included) who say free Palestine want the occupation to end. Yes Hamas needs to go but there are certainly better ways to do so than repeatedly bombing large residential areas and refugee camps",
            "Let's assume its realpolitik or support for Israel aligns with their foreign policy views of the Middle East.  Would they be Zionists?",
            "> the way Biden’s handling things now is no different than what Trump would’ve done if he was president.\n\nThey are very wrong about that.",
            ">Screaming and swearing that it's genocide doesn't make it genocide. Take a deep breath and think about the implications of what you're saying. If civilian casualties=genocide then the Allied victory over the Axis powers was immoral and shouldn't have been allowed to happen.\n\nTo be fair the way you worded it was a teeny tiny bit infuriating.\n\nAnd according to Google, genocide is:\n\n\"the [deliberate](https://www.google.com/search?sca_esv=e29bad09a751d822&sxsrf=ADLYWIIZztkPyMtdi0Hyk3V38muB1Vv5Yw:1716325058758&q=deliberate&si=ACC90nyOnVY18Aw7zUtkWPYo5mTnhb6wYh48OtosbYr2IyCIgGc0UjhjzUwuk9QJzVmGA_2dPpx9CjuZh5X1dKas8s2lxs6Blqyq5h_aa4oOck3JjnCLmF0%3D&expnd=1&sa=X&ved=2ahUKEwjB2MiL0Z-GAxW_V6QEHaVRDmkQyecJegQIDxAO) killing of a large number of people from a particular nation or ethnic group with the aim of [destroying](https://www.google.com/search?sca_esv=e29bad09a751d822&sxsrf=ADLYWIIZztkPyMtdi0Hyk3V38muB1Vv5Yw:1716325058758&q=destroying&si=ACC90nyOnVY18Aw7zUtkWPYo5mTnAKV6yoBDWYO8d-eeHddzGdxfKJkNuvnMVqEq1wDhm-Ab5k3XtF9aZg1EBmFnV1pi5ZcZMYST7qXOZ-Vv--vj79WdDzw%3D&expnd=1&sa=X&ved=2ahUKEwjB2MiL0Z-GAxW_V6QEHaVRDmkQyecJegQIDxAP) that nation or group.\"\n\nThey deliberately kill a large number of people from a particular nation (Palestine) and their aim is very obviously destroying that nation or group because otherwise why bomb babies?\n\nAlso, would you say all of this if you were in their place? \n\n(Reuploaded comment because I edited it too much)",
            "The more people that vote in an election, the fewer crazies and extremists get into office.  It's a gradual thing, to be sure.  But we have to start with where we are.   Keep voting for the less crazy option and encourage your friends and family to vote.\n\nThere's more candidates on your ballot than the president!",
            "You said\n\n>similar thinking to supporting the literal “free Palestine” movement isn’t antisemitic despite the movement being started by a guy that calls Jews “human pieces of filth” and “dregs of European garbage”\n\nI'm saying that the *hundreds of thousands of people worldwide* supporting Palestinians right now are not part of or necessarily supportive of a specific \"Palestinian Syrian armed movement and community organization that is led by the businessman Yasser Qashlaq and supports the Ba'athist government of Syria.\" and that it's really silly to imply otherwise.",
            "Self-determination is just the right of the Jewish people to govern themselves, establish their own state. Also you can say what you want about the jewish having religous motivations but I think the fact that they established themselves in tel aviv when they were immigrating rather than trying to quickly establish themselves in the west bank and buy all the land there(When they were doing the land purchases, a majority of them were not in judean samaria which is where all the religous places are like Jerusalem, Hebron, Jericho but where rather purchases around the coasts of israel).  As you can see from a modern map of israel and the west bank, most holy sites are not in israel. They probably chose israel because of the british mandate and how empty it was rather than because of the religous reasons. It is probable that they used the fact it was a factor they used to help motivate people to immigrate because many jews didn't want to due to how rough the lands where. The movement was absoloutly dominated by secular zionists though.\n\nMap of Land Purchases: [https://en.wikipedia.org/wiki/Jewish\\_land\\_purchase\\_in\\_Palestine](https://en.wikipedia.org/wiki/Jewish_land_purchase_in_Palestine)",
            "Calling/writing their member of Congress or Parliament to urge them to continue sending aid to Israel.  Calling/writing to their member of Congress or Parliament to urge them to vocally support the actions of the IDF in Gaza.  Writing letters to the editor of their local papers or making posts on Reddit urging people to support Israel in its war with Hamas.\n\nAlthough, I'm not sure the \"how\" matters.  Wasn't the definition of Zionism about the \"who\"?",
            "It does show their respective stance on how they treat their own citizens.   \n\nIsrael doesn't really police Gaza other than mowing down people with tanks. Of course Israel doesn't do anything to the queers in Gaza. But if they did make their way to Israel proper, they would not be executed for being queer.\n\nI believe the way forward is with a 2 state solution. So Gaza and/or the West bank would be their own nation. They effectively are already. But Israel kinda sorta pretending they own the land is just nuts.\n\nIt'd be a bad day for queers in Gaza though.",
            "Nations are composed of land and people.  Sometimes nations are conquered by other nations.  The conquered people are conquered because they are fundamentally weaker in some aspect: technological being the prime reason. What happens to the conquered? They were typically enslaved or absorbed into the fabric of the conquering nation. That is the choice laid out before \"Palestinians\".  They have no more claim to the area they reside in than Israel. If they did what millions have done in the past and just learn to deal with it and move on they would be doing great right now.  Instead, they are like infants who plead with the world community to aid them in exterminating the whole of Israel. Once everyone admits that is an absolutely ludicrous proposal, we can finally have peace. The loser & technologically inferior group must acquiese. They are gambling by not doing so, because once some other global issue takes precedence and all the protestors move on to the new issue, Israel will not be kind. To put it succintly - Life is Brutal.",
            "> with the aim of destroying that nation or group\n\nIs the aim of Israel in this war to destroy the Palestinian people or to destroy Hamas?",
            "Oh, I most certainly am voting I'm just very unlikely to vote for either of the big two. \n\nI would really like to see a real push for a third (or more) party.The Ds and the Rs are way too comfortable in bed with each other. The last three times I voted was for an other candidate.",
            "As it relates to OP’s comment! You are literally arguing my point right now. People don’t recognize that the group they “support” as in, again, the literal “free Palestine” has other motives. If people want to support other groups then go ahead- but you can’t use the literal movement that was started and is currently led by a vocal antisemite and try to argue it’s not antisemitic at its core.\n\nI imagine this is how a conversation would play out where someone asks you what your favorite candy is: \n\nYou: “ I like hersheys” \n\nThem: “ooof, doo you know the CEO is racist, maybe you should try a different brand?” \n\nYou: “well actually I don’t really like the brand Hersheys, it’s really about chocolate” \n\nThem: “then why not say chocolate, why say Hersheys?” \n\nYou: “because if all these people around me like the Hersheys, then there obviously can’t be a race issue, so i just like saying Hersheys because that’s what everyone else is saying, but really I mean chocolate.” \n\nLike my post was in essence: are you a part of the “free Palestine” movement or the “pro-Palestine” movement” because the difference is quite stark and people’s ignorance to what they say/post does not invalidate Yasser’s voice and power among Syrians and Hamas sympathizers when he sees all these westerners supporting him and his political antisemitic views…. But ooops that’s not what *hundreds of thousands* of people are trying to do… Well intention doesn’t really translate through screens and across oceans hun",
            "And just how many queers have Hamas executed? Is there some sort of statistic? Israel’s bombs don’t discriminate and they kill everyone regardless of their sexual orientation. We can agree that the land doesn’t belong to Israel.",
            "Both. Very clearly so. Because if not the Palestinian people too, then why shoot women and literal babies? Do they suspect they might be Hamas? Is that 9 year old girl supplying Hamas with food and ammo or something?\n\n\nI might reply to you next time tomorrow because I'm off for now.",
            "Well... [Their own commander](https://www.newsweek.com/prominent-hamas-commander-was-executed-after-accusations-gay-sex-432343)\n\nA reporter that looked into it in 2019 said \"coming out is a death sentence\".  \n\nAnd if you're an activist there on the subject [they will behead you](https://apnews.com/article/middle-east-israel-immigration-west-bank-gay-rights-ce95f6903faf461502cc0800b272b159). \n\nSo... From a quick surface check. At least 2.      This is what I was talking about when I said \"Israel most certainly does spares the queers\".   If you go to Israel they probably won't behead you just for being queer. \n\n>they kill everyone regardless of their sexual orientation. \n\nOMG, you still think this matters somehow. \n\nBut at least you can say \"Yes Hamas needs to go\", which means, really, you could have simply started this whole thing with \"No I don't support Hamas\".  Which is a legit stance."
        ]
    },
    "My wife realised she hadn’t shaved her armpits prior to us going out and it impacted on the day. Who can relate ? ": {
        "title": "My wife realised she hadn’t shaved her armpits prior to us going out and it impacted on the day. Who can relate ? ",
        "score": 198,
        "url": "https://www.reddit.com/r/TooAfraidToAsk/comments/1dlr3ju/my_wife_realised_she_hadnt_shaved_her_armpits/",
        "content": "We went out the other day to a theme park, my wife had a white vest top on. She all of a sudden realised she forgot to shave her underarms and had a little stubble showing so only went on things where arm’s could be kept down if that makes sense. \n\nIt really impacted on the day and got me thinking, is this a thing? Are women embarrassed by this ? I don’t mind it at all, I’m not a fan of full hair but when it’s just growing back it doesn’t bother me. ",
        "num_comments": 96,
        "comments": [
            "I could see this being embarrassing as a young person but as I’ve gotten older I’ve realized that no one is paying attention to me, and even if they are, they won’t likely remember for very long. \n\nLeg stubble under jeans is another story bc that shit can be painful.",
            "When I was younger I absolutely would’ve been embarrassed by this, I wouldn’t even go out in my own garden without shaving my legs so being in public with stubbly underarms would’ve been way too much for me. \n\nNowadays I don’t care particularly much, I hate having body hair but not because of societal pressure, just because I firmly believe we should’ve evolved out of it by now haha",
            "It's a thing. When I was first told I needed to start shaving I thought it was stupid to pretend to be hairless, a hassle, a waste of time. So I didn't do it. Ramdom people would walk up to me I the street and tell me I'm disgusting. A need to not show any sign of hair became ingrained. ",
            "It's almost like people shaming body hair on women and bullying women who do not remove it has an effect.",
            "Honestly a theme park is probably the worst place for this lmao I can't think of anywhere else you'd have your arms in the air so often",
            "I have actually posted about this on here. It’s very much a thing and I know exactly how she must have felt that day. It bothers the hell out of me. Give her your jumper next time so she can enjoy the day!",
            "It took a long time and lots of encouragement but my wife no longer shaves her legs. We've gotten her over that particular social stigma.",
            "Women can be embarrassed, but far less people notice than she probably thinks, especially a little stubble. If it was fully grown out it’s pretty obvious, but no one is getting close enough to notice stubble, especially while on a moving ride.\n\nLife is so much more enjoyable when you don’t care what people think, especially people you will never see again.",
            "Because we've been getting shamed if we don't have shaved our whole body. It's not like it's just in our head. Women get harrassed.",
            "It's very sensitive (using this word in a positive sense) of you to ask this question, to learn more of what she was feeling so that you could better understand her position. It shows that you care a lot for your wife's feelings and have a great deal consideration for her. \n\nSometimes it's a good idea to reflect on what you could have done differently. Trying to problem solve in the moment may have made the day better. Some solutions I can think of are:\n\n- Focus doing other things instead of rides, such as playing games, seeing if there are any shows, dining, etc.\n- Go to a gift shop. They may have a lot of items there that may help. I would've purchased a t-shirt with sleeves that are long enough to conceal her underarm. They may even have toiletries, like razors, that could help. \n- If you're not too far from home, ask if she'd like to head home to address her concern.\n\nWhen you're in the moment, try to think short term and say to yourself, \"What can I do *now* to make this situation better.\" They don't need to be permanent long term solution, but things that you can do in the moment to get through the day.",
            "Yes, it's a thing. I would have reacted the same way.",
            "I don't shave my armpits so really wouldn't care about this at all",
            "I have it all groen out now. But I used to feel this way. Socialized to believe it's gross. Now I like it lol",
            "Yes. Women will get embarrassed if you point out their body hair because we get told EVERY TIME how off putting it is. That opinion is also often shared publicly and being told an unflattering opinion about yourself in front of other people is embarrassing to anyone. Men also get this as well for things like neck hair, chests, etc. In the long run, if it’s not something a person can change in the next 6 seconds, then it’s a good idea to keep your opinion unsaid.",
            "When I was younger I was def self conscious about armpit hair. By mid 30s I stopped giving any shit bc I realized nobody actually cares at this age and if they do that's a problem with them, not me. Hope your wife can start seeing it this way bc it sure feels good to not gaf about silly things anymore, but I do know how she's feeling and not trying to judge her for it. Just wishing her more happiness :)",
            "I wouldn’t love it, but I also wouldn’t avoid rides because of it. Who can see under anyone’s arms during a roller coaster ride!? This seems a bit extreme.",
            "Women have been shamed, usually from birth, in multiple ways about their appearance and behavior. It is pervasive throughout our culture, the media, etc. There is relentless focus on women’s appearance- positive or negative- often over the smallest details. Consider how Condaleza Rice or Hillary Clinton were talked about (literally newspaper reports on Condaleza’s dress size). Consider the picking apart of women celebrities weight changes. The inescapable advertising for hair color, shampoo, cosmetics, wrinkle treatments, hair removal, odor, etc etc. Consider the scrutiny that Taylor Swift or Megan Markel faces. It impacts not just them - the underlying message is you can never ever get it right. \n\nIt is *constant* that there is something inherently disgusting and malfunctioning about the natural state of women’s bodies. You cannot avoid the message and it is a brain worm for many women that deeply effects their self-esteem and confidence. \n\nSo yes, it is a thing.",
            "Yeah\n\nWomen are shamed their entire lives about being \"unhygienic\" if they don't shave, unfortunately. It's a social and beauty standard, that of course, only applies to women. \n\nI used to be embarrassed about it but I stopped giving a fuck years ago. But that's just me. I know not everyone can",
            "I mean listen to yourself. You're \"not a fan of full hair\" either. Do you think that's a preference you just happen to have naturally? Culturally, women are supposed to shave to be acceptable (because you are only acceptable if you're \"pretty\" and that's a part of being \"pretty\") and hair is something to be ashamed of. And you are actively a part of the problem. If you feel bad for your wife, maybe look at your own biases first. Honestly. They CAN be unlearned. I used to have this silly \"preference\" too because I grew up in the same culture you and your partner did. I don't shave anymore and actively prefer the look of having hair. I feel free. It's so sad that you don't even recognise you are a part of why your partner feels this way.\n\nEdit: Sorry if I sounded harsh. You clearly do care about your partner's distress and genuinely don't understand, but have a willingness to learn, about an experience that women have every day. Just know your learned preferences matter too and you should work to unlearn them for her. Think of how unfair it is that for her this is such a big deal that causes a lot of distress. I've been where she is now and it is not nice. Your partner agreeing that hair on you is undesirable (even if it's just \"full hair\") does not help at all.",
            "I feel her. I would react the same. Going just now on a date. Today it’s just checking out because I didn’t shave properly.",
            "The older I get, the less I care!!  Shaved one armpit and forgot the other, that was a jolly good time, literally laughed about it all day!  We gotta make light out of stuff like this, not let it get us down, it’s a great practice!",
            "I don’t give a damn what other people do with their body hair and people need to learn to do the same. You can have your own preferences but telling other people how they should have theirs is messed up. I do shave my armpits but I would never even dream of being angry at someone else for having anything. I’m sorry what should have been a fun day for you wasn’t, hopefully your wife can eventually learn to not give a fuck about what people will think, and if someone says something about it, learn to instead of feeling bad or guilty etc, tell the weirdo who is caring so much about her armpits where to shove their opinions.",
            "I used to be embarrassed by things like this. I would shave my arms and legs and refused to go out unless I looked absolutely perfect. \n\nNow, I take great pleasure in annoying my son (10) with my stubbly legs. He hates it, so naturally I embrace it and find excuses to cuddle on the couch with him when I’m a few days post leg shave. \n\nI’ll never forget the lightbulb moment my now-husband had when we were dating. He said something along the lines of “thanks for shaving for me” and I just laughed at him and told him that I would never shave for him. I shaved for myself.",
            "I asked my wife how she'd feel about it and she said it would be the equivalent for men of going to an outdoor social function in the middle of summer right after hitting the gym and forgetting to wear deodorant. So especially for someone with social anxiety even small things like that are going to hit disproportionately hard.\n\nWe've gotten old enough not to care too much either way, but we do both have 'emergency' toiletries in the survivors bags in both our cars after suffering social mishaps like these one too many times.",
            "So how many centimeters of growth is she allowed to have before she gets to “full hair,” which you don’t approve of?",
            "Two moves here:\n\n1) traditional guy move- immediately go to gift store, buy a t shirt and move on.\n\n2) more present guy move- “I recognize how uncomfortable this is for you. How would you like to proceed? I’m cool if you want to go home”",
            "I once got into a minor motorcycle accident. \nUnfortunately I was planning on doing the full shave down and body tlc the next day. \nThe bike crushed my left leg and they had to cut the leg of my jeans (brand new, first day wearing them for the weekend). Not only was I very hairy on my legs, but my toenails needed cutting too 🤢 \nI had to sit in the hospital in a wheelchair with my hairy leg up and nasty ass toe nails out. I apologised to every member of staff that dealt with me. \nMy poor dad must have wondered what sort of troll daughter he raised.\n\n\nEdit: typo",
            "I once wore heels to a double date when everybody else were wearing casual outfits. Ruined my whole mood because I felt too overdressed. It didn't matter to the others at all.",
            "I’m a 50yo male who has never ever been able to grow any underarm hair. I feel kinda jealous of all of you.",
            "Nobody would have noticed.  People notice things on themselves that nobody else pays attention to.",
            "Unfortunately, yes. It is a thing. I’m 37 years old and would feel the same.",
            "I asked my girlfriend to stop shaving her armpits.  she looks like a European model and I think it’s hot.",
            "This seems incredibly excessive to me and even as a woman I'm very surprised so many others can relate. I was over here like holy crap I'd never ruin somebody else's fun over something so stupid and vapid. It's such a shame so many have been conditioned to feel like this. Nobody deserves to be that concerned over a teeny little bit of hair poking out of a place we all get hair on our bodies. People suck. :(",
            "Other women say that all females should be completely hairless. If you have hair, you are dirty. A small number of men think that as well.\n\nYour wife needs to know that she is perfect  as she is, and I'm sure you tell her that often 🙂",
            "Hair under the arms used to disgust me, not stubble just full blown hair. I remember a time I went to a thrift store and the person working the counter had more armpit hair than I did and it grossed me out. Then I felt bad for feeling that way and started to thin, the only reason it bothered me is because I wasn’t used to it. \n\nI asked my wife if she would just not shave as frequently to see how I would feel about it. Since then I found I love armpit hair. It’s so freaking sexy when a woman is comfortable and can go out without worrying about stuff like this.",
            "Personally I don't care about the body hair I have. But my mom on the other hand says its unhygienic and gross and will get surprisingly mad over me not wanting to shave, so apparently it is a thing. Even if you think it's bad looking, a tiny stubble will barely be visible, hell it wasnt even visible to your wife at first and its on her own body lol\nI used to have some anxiety about how I looked but when I realized no one actually cared(think about how many people you pass and how many you remember) I stopped getting anxious about it, might help with the hair stuff for some people.",
            "I'd say it depends. \n\nI was later than my peers to start using deodorant/antiperspirant and I was bullied for it. Now I'm extra sensitive and concerned about if I smell. Despite showering regularly and good hygiene, if I even remotely think I've forgotten to put on deodorant/antiperspirant I'll actually buy some while I'm out and put some on.\n\nMaybe she had incidents in her early life that make her extra sensitive to that?",
            "10 years in the military as a woman has made me shameless of my body hair, facial hair, and bare face. Not because I wanted to look like a wolly mammoth but if I'm sitting in a desert op for weeks at a time, that hair is doing it's job of protecting my skin. And coming home after all of that and finally taking the time to shave everything, you wouldn't believe how nice it felt having truly healthy happy skin! The best my completion has ever looked is after a couple weeks outside! We have hair for a reason, ya know? \n\nAlso, literally no one can truly see it unless they are super close and personal and if they are, most people do not care.",
            "I personally haven't shaved my armpits in 6 months. But it took YEARS to get over the anxiety of going out in public in a sleeveless shirt like this.\n\nThe conditioning women are subjected to is insane honestly. Even logically knowing there was zero difference between my armpits and a man's I could not for the life of me shake the idea that mine were \"gross\" and \"unsightly\".\n\nIf your wife is interested in it I do think it's something worth unpacking. After I worked through that and a couple other beauty related anxieties my life has been much more peaceful. However I'm imagining myself before I did all that work and absolutely yeah something like this would have ruined my day. The social anxiety from things like this was intense. There's a thin line to walk here because you want to validate her feelings without actually supporting the idea that women need to shave to be presentable.",
            "Once I made a dress with a really intricate pattern on the front and I posted it, modeling it because I felt cute and proud. Every single comment was on how I needed to shave my underarm haor, which had only been like 2 days growing. I'm pale with dark hair so it was noticeable but not horrid? I have never worn that dress out of the house and all of my tops have sleeves. I wear a jacket if I have a tank top or something around anyone who isnt my immediate family. \n\nI'd like to say I would have been able to ignore it but I likely would have been just as self conscious. There's no winning lol",
            "It's a big deal and has happened to me before but luckily not with a tank top.  When I was younger,  I cared, and now I don't, but a quick solution would have been to buy a disposable razor and shave in a public bathroom.   Option two, buy a t-shirt and change. \n\nTheme parks aren't exactly fashion shows, and moms especially dress comfortably, but if your wife has self-esteem issues,  I can see how it would have ruined her day.",
            "As a teenager, this would’ve been really embarrassing but as an adult, if somebody else doesn’t like my armpits, they can go fuck themselves. \n\nI do shave the majority of the time but if I don’t, it’s no one’s business but my own. \n\nHonestly, nobody of importance will actually care about this. Some 15 year old is gonna giggle from the sideline? Some guy whispering “ew, pit hair”? She’s not fucking him.\n\nThis is so far down on the totem pole of things that actually matter. Really.",
            "Wife has these types of hangups. I used to think convincing her that I was fine with minor imperfections would help, but I realized it's deeper than my influence.\n\nShe's already predisposed to feeling self-conscious about these things. My approach now is twofold: refrain from triggering her insecurities and celebrate moments when she feels relaxed, even if she's unkempt.",
            "I prefer the shaved look but usually don't give it much thought unless I am getting a mammogram or something.  My husband actually encourages me not to shave as he thinks it's hot.",
            "Depends on the person, also very few will focus on armpits and who do are pretty weird especially strangers armpits",
            "It bothered me at 13 or 14, but now I really don't care, because I know no-one is looking at me or would care. It's a case of 'you don't need to care about what people think of you, because they seldom actually do'. \n\nI'm sad, that as a married, fully grown woman your wife still feels this way.",
            "In the beginning but after years of calling something stupid people tend to think worrying about it is useless. But I dislike excessive body hair on both male and female",
            "Maybe I should have been more understanding then. I was like “who cares, let’s just enjoy the day” 🙈",
            "God but we're so self conscious when we're kids. I would lose my mind if my parents made me go out without having taken a shower and my hair brushed. Because you never know when someone might see a little fat kid with bed head and think poorly of him.",
            "Thanks. People on here have made me realise it’s a thing now and I will think differently next time and try to come up with a solution. It spoilt her day and I didn’t understand why at the time.",
            "Wow. People are cruel and it’s hair that naturally grows on many parts of the body",
            "That's horrible.. I stopped shaving my legs three years ago and no one has said anything to me. But I live in a very non-confrontational part of the world.",
            "[deleted]",
            "All these comments are really making me understand that situation better now. Thanks. I didn’t even consider what you said about it’s possibly the worst place we could have gone in that situation",
            "Gym",
            "Social stigma or not, I hate the way my legs look when they’re hairy. It’s a personal choice. I’d hate if my husband badgered me to stop.",
            "Especially after Covid. I know a good number of women (mostly millennials and younger GenX, probably a gen Z coworker sprinkled in there too) who stopped shaving during lockdown, and just...never started back up again. Pits, legs, and any combo thereof - or some switched to trimming, but no more shaving.  Because of this, they also no longer judge when they see other unshaved women out and about - and in my experience, even the women who choose to still shave, are more used to seeing other women with hairy legs and armpits now, so they are less likely to judge than 5 years ago as well. I personally don't even register if another woman near me has shaved legs or not, even in summer shorts. I have no desire to be checking out random ladies armpits, and if I do see hair, that fact is gone from my mind just as fast as her T-shirt colour or what kind of sunglasses she is wearing.",
            "It’s clearly a thing then having read all these comments.",
            "Thanks very much for the comment",
            "Thanks. It’s time for me to be more considerate and understanding then 😊",
            "Thanks for your comment. I a now seeing this from so many different angles ans that’s what compelled me to write this post. She is not alone with her feelings. I will respond differently in future and be more supportive.",
            "Hi, thanks for the reply. It was things like actually getting on a roller coaster and a young man said “arms up while the bar comes down” while stood right in front of her, then he clipped a seatbelt thing in when that bar had come down. It really affected her day and I should have been more supportive.",
            "Thanks for this response",
            "No offence taken bad I made this post for that very reason, so I can learn and fully understand that it wasn’t an insignificant thing to her. I will do more to respect her feelings in future and maybe think of a solution rather than sulking all day cause it changed what we did and didn’t do.",
            "I love it 😆",
            "So many great responses here today, yours being one of them. First time I’ve ever discussed this, and because it affected that day so much I thought I would see how much of an issue it can be for people. To me it was insignificant, but to my wife it was almost humiliating for her I would say.",
            "I can understand this yes.",
            "I’ve not really thought about it too much but my opinion and only my opinion is that I am not a fan of bushy armpits but as it begins to return, I am cool with that. \n\nI know there is no right or wrong and just my opinion.",
            "3.   honestly no one is going to be looking at your armpits.  are you looking at other peoples armpits? no she is not.  not on a normal day. women don’t need to shave their pits anymore.  it’s 2024.",
            "Wow, thanks for the response. I have learnt a lot here today. I will be more supportive going forwards for sure.",
            "Agreed. I have some things about me I hate but probably wouldn’t even register with others",
            "All these comments today have made me think totally differently. In future I will do more to help rather than the way I handled it",
            "It’s surprised me too just how much of a thing it actually is. It’s opened my eyes now and I will be much more considerate next time",
            "Thanks for the response, I think I said this to someone else but a little stubble I actually find quite alright on my wife. She has a nice figure, sporty I would say, and i am fine with it but she could not relax at all that day.",
            "Does she have social anxiety? It can feel like everyone is looking at you and thinking bad thoughts about you. Can by paralyzing and can take the fun out of a normally fun situation.",
            "As a ginger, I could not shave for a month and the wispy faint hair would only be noticeable by me. What's the story with your wife? Does she have hair that contrasts greatly with her skin? Would it be instantly noticeable? \n\nIf she's always shaved before going out, she would feel more self conscious. \n\nAsking, \" who cares?\" isn't really helpful as she obviously cares.",
            "Yeah and that was done to me as a teenager. A really sensitive age. I'm at an age now where people care less about policing my body and I could better stand up for myself, but the anxiety is still there. ",
            "But shaming women - even young girls - for having underarm hair (or body hair in general) is _very_ common. \n\nYou'll see inbred chronically online dweebs posting puke emojis under pictures of women who have anything but smooth underarms. \n\nIRL, I've spoken to a few men who were grossed out by underarm hair on women and called it 'unhygienic' - none of those guys shaved their underarms either. Like I get having a preference, but it's hypocritical to act like it's 'dirty' if a woman doesn't shave if you don't.\n\nThis shit has been ingrained for ages. So yeah, I can understand her feeling very self-conscious.",
            "I feel like it may be an age thing too. People feel very entitled to policing teenaged girls, less likely to get harassed as an adult. ",
            "It's disingenuous to pretend like people don't care just because *some* women chose to defy this beauty standard or just don't care to remove their hair. Also the fact that you describe them as feminists already says something about how you view women with body hair (as in it has to be some \"statement\" instead of just a personal choice like it would be for men).",
            "By her own admission, she hated doing it, she hated how it felt as hair re-grew, and she didn't like the occasional cut or razor burn she got. I only encouraged something she already wanted to do, but was uncomfortable stopping due to social and family pressure. No one was \"badgered\", thanks.",
            "That's sort of the point of a social sigma. Hard to know if you would be bothered by leg hair at all if we didn't live in a society where you have been taught to find it unattractive and ugly and to be ashamed of it.",
            "She must be a good woman to land such a good guy. I wish I could get a guy who cares and listens like this, haha. I think you guys will be alright.",
            "This is the exact reason I asked on here. To hear others point of view. Yes she has always cared what people think about her. The smallest things, insignificant things to me really bother her.",
            "Very true and I should not have had that attitude, and I fully realise that now. Her skin is light and very dark hair so it’s a oval dark shadow seen, then when close up it’s rough like my stubble on my face when it returns",
            "Yes, that's a good point.",
            "[deleted]",
            "You’re welcome. And I’m glad you encouraged her to do something that she already wanted to do! That’s a good supportive husband right there. :)",
            "I don’t like the way my hair looks uncombed. So I comb it. \n\nI don’t like having crumbs on my mouth after eating. So I wipe it off.",
            "Just keep being there for her and aware of her potential headspace. Hopefully after enough time receiving unconditional love from you, she may start having unconditional love for herself, and with that comes the big revelation of “I don’t care what anyone else thinks.”",
            ">it doesn't matter if you choose to follow a beauty standard or not, it doesn't affect your life in any way outside of romantic relationships.\n\nSo shaming and bullying for not removing body hair does not happen according to you?",
            "maybe they hate women and also love armpit hair",
            "Thanks 😊",
            "[deleted]",
            "So it does happen. And since OP wrote this post we can also see that it does have an effect on women's lives (to some extend).",
            "There will always be people criticizing you no matter how you look. Healthy people don't care how other people want their body to look.",
            "you’re not making much sense. it’s either still prevalent in society or it’s not. it’s either worth calling out, to inspire a CHANGE, or it’s not. most people acknowledge that, yes, this silly cultural standard for women still exists and, at the very least, should be recognized🙄pretending that it doesn’t exist is strange.",
            "> Healthy people don't care how other people want their body to look.\n\nAnd what about the \"unhealthy\" people who *do* care? Just fuck them, I guess? Their feelings aren't a concern?",
            "[deleted]"
        ]
    },
    "Why are (many) black Americans identifiable as black by their accent?": {
        "title": "Why are (many) black Americans identifiable as black by their accent?",
        "score": 225,
        "url": "https://www.reddit.com/r/TooAfraidToAsk/comments/1dlkacf/why_are_many_black_americans_identifiable_as/",
        "content": "There seems to be a specific accent that identifies black Americans as black. But black people from other countries generally sound like the majority accent from that country. Listening to a sports announcer or news reporter from England, France, Scotland, Canada, Australia, or Mexico (for example), one wouldn’t know the ethnicity from the accent alone. What is it about the U.S. that distinguishes this accent? Similarly, I’ve seen/read about blacks making fun of other blacks who sound “too white.” Why is that? Is this just a thing in the U.S.?",
        "num_comments": 109,
        "comments": [
            "It’s not just accent though. There are frequencies of voice that (without any slang, accent, or vernacular) you can pretty easily tell the person is likely black. That’s not to say it’s 100% accurate but it’s not just an accent it’s like vocal chords or something.",
            "In the past, when I mentioned I could tell someone was black during a phone call, I was called racist. I'm glad people can have an intelligent informative discussion about it, without having a knee jerk reaction.",
            "My no-ideology take:\n\nBlack people developed an accent from being from the South (as slaves). When they moved North in large numbers after the Civil War, they lived in ethnic enclaves where they retained an accent that was distinct from the area they lived in. Due to the fact that black people will oftern interact with black people more often than they do white people, due to social, geographic, and economic factors, they maintain their own accent.\n\nBut this isn't universally true at all in the slightest. Many, maybe even most, black people have accents that are typical of their geographic region rather than their ethnic demographic.",
            "\nAfrican-American Vernacular English (AAVE), also known as Black English, is a distinct dialect of American English spoken by many African Americans. It has unique phonological, grammatical, and vocabulary features that differentiate it from Standard American English. AAVE developed historically from the linguistic environment of African Americans, influenced by the segregation and social conditions they experienced. This dialect exhibits strong regional variations, meaning that accents can differ significantly between areas like New York, New Orleans, and Chicago[2][4]. The distinctiveness of AAVE can make speakers identifiable as African American by their accent.\n\nCitations:\n[1] Why do Black people in America have a unique accent when other ... https://www.reddit.com/r/NoStupidQuestions/comments/sxtyod/why_do_black_people_in_america_have_a_unique/\n[2] A LOOK AT REGIONAL VARIATION IN AFRICAN AMERICAN ... https://www.languagejones.com/blog-1/2021/3/9/a-look-at-regional-variation-in-african-american-english-accents\n[3] Sources of variation in the speech of African Americans - NCBI https://www.ncbi.nlm.nih.gov/pmc/articles/PMC9286383/\n[4] The United States Of Accents: African American Vernacular English https://www.babbel.com/en/magazine/african-american-vernacular-english\n[5] What is AAL and who speaks it? https://oraal.uoregon.edu/AAL/What-is-AAL",
            "Ehm I really hear a \"black\" tone in English, French or Dutch black people. And I am not talking about accents here that would give away a certain ethnicity. Just the tone alone.",
            "When I was a kid, we got a phone call to our house. I picked up and a man said, “hello, is <my father’s name> there? He and I work together.” I said no, and the man said he’d call back later. \n\nWhen I told my dad about the call, he asked, “oh, was he black?” And I immediately knew the answer was yes. I told him, yes he was. And my dad was like, “Oh, ok that was just my boss.”\n\nNothing in my short phone call had any particular AAVE dialect or slang, it was entirely the pitch of his voice.",
            "Scotts become Southerners, sound like hicks compared to the English in the North, teach their slaves their redneck English, slaves put their own spin on it through insulation and cultural influences.\n\nAAVE is black redneck, which is why they share so many commonalities like \"fiddin to\", and \"you sho is\", and \"I been done that\" or \"I'mma do that later\"\n\nGo to Mississippi and you'll get all that and more and you won't be able to tell black from white without looking.",
            "[The accents is highly regional and has influences from other languages the accents actually dates back over 100 years ago to the slaves.](https://www.loc.gov/collections/voices-remembering-slavery/about-this-collection/) You can literally the the different regional accents from each recording. The accent is apart of African American heritage it is weird for people to suddenly change how they speak to fit no matter the situation.",
            "I've heard black people switch that accent depending on who they're talking to. Sometimes you can't even tell. Other times absolutely. \n\nI heard it's a part of a cultural identity and if it's not done, others will criticize them for not being \"black\" enough. \n\nIf I'm wrong, I got zero issue with it just lmk.",
            "I can tell on the phone if someone is white or black",
            "Are we pretending that someone wouldn't know a white male in his 60s from Texas just by hearing him speak? You telling me you don't know that Bill Burr is white American just by hearing him speak? \n\nThis isn't even close to being a black thing. It's literally the human experience.",
            "you haven't traveled much and been in community with many black people in the US, I assume. As a NE black person who's ethnically originally not from the US, black people sound extremely different depending on the part of the country you're in. Southern black americans sound completely different than western black americans, who sound completely different than northern black americans. black people in other countries also do not just sound like they are of that country. black brits have a completely different accent than the rest of the country. black germans also speak in a completely different tone. even in majority black countries like jamaica, black jamaicans sound different than non black jamaicans. \n\n  \nthere are, of course, black americans who have the standard american accent, but that can go for anyone. the whole sounding, \"too white,\" thing is a little too complex and nuanced for a simple reddit comment, but i'll just leave it at it goes deeper than simple tonality. \n\n  \nhopefully in the future you're able to experience the different communities around you!",
            "Almost all black people can trace their family back to Dixie within four generations, mostly the Deep South. It wasn’t until WW2 that you ended up with large black communities in the dozen largest cities. War work.\n\nThen they came to the cities and got put in ghettos, like ghettos by the literal meaning of the word, an enforced ethnic enclaves, for, y’know, another forty years. Which is one reason why the distinctly southern aspects remain so strong.",
            "IDK, why don’t you axe them?",
            "I’d say AAVE is more recognized and distinctive, but there also Black accents in the UK and Canada (eg MTE/Toronto mans) though with more of a Caribbean influence. It’s not totally uniquely American.",
            "Indeed, what we're discussing here is the phenomenon of sociolinguistic differentiation, where language and its variations emerge as a result of social factors like community, history, and identity. The accent spoken by many African Americans - sometimes referred to as AAVE or Ebonics - is not simply an artifact of history; it's a living, evolving dialect that's as regionally diverse as it is culturally significant. Just as American English is marked by a plethora of regional accents, AAVE has its own internal variety depending on where it's spoken. Moreover, social mobility, education, and integration have blended these accents further, creating a complex linguistic mosaic.\n\n\n\nEducation - or rather, historical lack thereof - certainly played a role in how AAVE developed, as institutional barriers kept African Americans from accessing the same linguistic resources as other groups. But this isn't just about access to education; it's about a community creating and maintaining a linguistic identity that's both distinct and legitimate.\n\n\n\nWhat's fascinating is the current trend of convergence and divergence within AAVE. Young African Americans in urban centers are shaping and reshaping the dialect in real-time, creating sub-dialects that are influenced by their immediate peers while still retaining overarching features of AAVE. On the flip side, in more integrated communities, you might find African Americans whose speech aligns more closely with standard or regional American English with subtle nuances of AAVE.\n\n\n\nTo your last point, while it might sometimes be possible to distinguish someone's racial or ethnic background by their accent within the same region, this isn't always the case, and cross-cultural and cross-racial influence can make such distinctions less clear. As America's cultural tapestry grows ever more complex, we can expect these linguistic boundaries to blur even further, challenging our preconceptions about language and identity.",
            "Yes, this is a cultural thing in the US. Known in my lifetime variously as \"ebonics\", \"thug\", \"urban\", and a few others, most recently they've tried to make it fancy, and call it African American Vernacular English (AAVE), presumably to try to dissociate it with its connotations of stupidity and violence.",
            "Isn't this the case for other races? \n\nActually America in general,no? I can tell the difference between someone speaking that's from Mississippi vs Texas",
            "If you are really interested, maybe consider the documentary Talking Black in America. It’s on YouTube and explains it way better than I can",
            "Because most have been segregated from birth and the linguistic tradition comes from West African languages",
            "It’s an obvious exaggeration and generalisation from me, but as a singer I envy the black guys so much. It’s like, when you’re white, you have to spend years to make your voice sound good, and when you’re black, you instantly sound amazing due to that deep underlayer in your voice tone",
            "The same reason many White Americans are identifiable by their accent or cadence.",
            "As a black American: the difference is how our words just roll off the tongue and to an extent: how fast we speak.\n\nI don't use alot of slang (never have) and I've always been a slow talker, but I'm one of the ones who got made fun of in school for \"talking white\" when I thought I was just talking normally. It wasn't until I got a little older that I realized they were making fun of me for not using slang and my words rolling off my tongue much slower than theirs.\n\nAlot of black folk use slang and speak very fast, so our words roll off the tongue quickly in such a way that can be distinguished from a white person. Even over the phone I can tell if somebody I'm speaking to is white, black or Hispanic. Our dialects are just different.",
            "It’s called ebonics",
            "It's not something I noticed in the UK, most 'black' people who were born in the UK sound like anyone else, it's only those that have been immigrants where you can tell",
            "Hmmmmm, just thought it was Ebonics",
            "[Welcome to the racist history of redlining.](https://a816-dohbesp.nyc.gov/IndicatorPublic/data-stories/redlining/) Basically cities mapped out areas that they considered dangerous so they were systemically denied things like loans and other services. This lead to their communities being more poor and getting a less than standard education. Their worsened education results in the accent.",
            "segregation, slavery, redlining, etc. \n\nit's called AAVE, it's one of many varied dialects of english. for a long time, Black folks weren't allowed to get an education the way white folks were, and had to have their own schools, which were wildly underfunded. as such, the language evolved in the way it did, as all dialects do.",
            "SEGREGATION.",
            "Because the US is still heavily racially segregated, it just isn't enforced like it used to be, and people speak similarly to those around them. If you get a black American who grew up in a predominantly white, suburban, wealthy neighborhood, they wouldn't sound \"black\".",
            "![gif](giphy|dtIGTEaGLRvdODtdQe|downsized)\n\nIf you can hear this gif, you know",
            "This question AGAIN...",
            "The first time I met my now-wife she told me later on that she was surprised that I was Black.  She told me that I sounded \"racially neutral\" when I spoke to her on the phone. I'd answered her Yahoo Personals ad (this was over 20 years ago.) and she had a picture on her profile but I didn't.\n\nI remembered years ago that a white friend told me that I spoke differently, not necessarily black-ish, but differently when speaking to Black people as opposed to white people, him for example.  None of my black friends have ever said anything like this to me, although I was called an 'Uncle Tom' a few times back in high school because I had white friends.\n\nMy wife and I were discussing this years later, talking about our first date and the 'racially neutral' thing.  I think that we came to the conclusion that most people speak accordingly based on to whom they are speaking to.  I speak differently if I'm speaking to friends, than I do with my boss, than I do talking about comic books with my comic book reading friends, than I do with my family who I grew up with.\n\nBut *no one* has ever told me that they knew that I was black upon meeting me in person after only speaking to me on the phone.  I've found this thread to be very interesting in the fact that *not one* poster in this thread talked about this in other than it's a forgone conclusion that you can tell someone is African American simply by hearing their voice.\n\n*Not one* person indicated that they've ever been surprised by someone's race after only hearing their voices.  A lot of examples were given to prove this theory: links to articles, examples, \"...I work on the phones and I can always tell when the caller is Black...\" and \"...someone called my dad one time and I could tell that he was Black...\", \"...all Blacks came from the South after slavery and they carried their 'Black-cent' with them to the North...\", \"...frequencies of their voices...\", even ...\"they do it to sound 'tougher...' and \"...their other black friends will make fun of them if they sound too white...\".\n\nBut not one person gave an example of a time when, for example, they spoke to a customer on the phone and when they came into the shop, \"...I was surprised he/she was Black...\"  \n\nBut just to clarify, I am **NOT** saying this thread, or any poster in it, is racist.  Hell, I don't know what race *any* of you are.  Black, White, Asian, hell some of you could be Martians for all that I know.  I was just surprised while reading the thread that there were no dissenting opinions or examples of why this is not universally true, only examples of why it is.\n\nAlso, I can only speak to the posts that are here *at the time that I posted this*.  If an opposing opinion post comes up after this one, Cheers, more power to them!",
            "I think its called Ebonics",
            "Are you suggesting that white Americans aren't instantly identifiable as white by their accent?\n\n  \n*Because they are.*",
            "because they want to segregate themselves",
            "I've heard it called a Blaccent.",
            "Cultural dialects\n\nSometimes it's an unconscious need to sound tougher so nobody fcks with them. \n\nIt's just ingrained culture voice and pronunciation mimicking",
            "It’s not just regional. Look at Snoop Dog, a native Californian with a prominent “southern accent “",
            "interesting to hear non-black people discuss black people.",
            "Somewhere around 2008 or so, I used to voice chat with a guy in a game. I thought he was black, because his voice sounded like a cross between DMX and James Earl Jones. The guy was white as could be, when his gf showed me some pics of him.  I also learned his heritage was Italian, but he lived in the states. That further cemented how much you can’t identify race by voice.",
            "Why are you so caught up on race? It does not matter. We're all humans.",
            "chicken wing",
            "Mans discovered culture today.",
            "https://www.dictionary.com/e/united-states-diversity-african-american-vernacular-english-aave/#",
            "I think this aspect is underrated. Just like you can *see* white vs black skin, there exist some vocal qualities that you can *hear* that just come down to subtle physical differences.",
            "Right! Every time I’m on the phone with a customer I can tell they’re black even if they talk “white” lol. I remember telling my brother that someone who was clearly black didn’t “sound” black and he thought I was being ignorant. I couldn’t point it out at the time but I think it was the pitch?",
            "Case in point: James Earl Jones",
            "\"What had happened was...\"",
            "Yup.\n\nThis is what I noticed with ChatGPT’s Sky (rip) and Juniper.\n\nNothing specifically *says* “I’m black” and “I’m white” \nBut you can just tell from the voices alone.",
            "To me it seems a resonance in Nasal passages. But I don't know I'm no expert and I probably don't have the vocabulary to express this idea properly.",
            "Yes and also no, there are plenty of black people in America that develop accents that are the same as the typical one of the area but also common on the east coast especially but I’m sure elsewhere is Black Americans developing their own versions of the typical accent for their area. AAVE can differentiate based on area in the states, it’s not exactly the same between them. It’s a really fascinating development linguistically.",
            "I can easily tell if the random person I’m speaking to in the phone is black and I don’t know where in the US they are. It’s not their accent though its their voice, sometimes its their accent but mostly its their voice I think, sounds deeper with more bass or something ",
            "It’s not an accent. It has been debated as either a creole or a dialect with a good majority leaning towards dialect. \n\nTheres strong evidence for both arguments. The enslaved people were an amalgamation of Enslaved people from many parts of Africa, Black Europeans who would become slaves, and indigenous Americans. \n\nThe buzz phrase “Gen Z Language” = B.A.E appropriation but it removes the Black American and sanitizes it. \n\n\nChatGPT:  \n\nChat gpt: \nThe classification of African American Vernacular English (AAVE) as either a creole or a dialect is a subject of ongoing debate among linguists. The \"Creole Hypothesis\" suggests that AAVE developed from a creole language formed by the contact between African languages and English during slavery. This theory posits that enslaved Africans created a pidgin, which evolved into a creole and then decreolized over time. However, the \"English Origins Hypothesis\" argues that AAVE developed directly from early forms of English spoken by settlers and was influenced by African languages without forming a full-fledged creole. More recently, the \"Substrate Hypothesis\" offers a middle ground, suggesting that AAVE retained persistent influences from African languages within an English framework [oai_citation:1,A Provocation of The Modes of Black Indigeneity | Ethnic Studies Review | University of California Press](https://online.ucpress.edu/esr/article/44/2/41/118429/A-Provocation-of-The-Modes-of-Black) [oai_citation:2,How did AAL develop? | Online Resources for African American Language](https://oraal.uoregon.edu/AAL/Development).\n\nThe linguistic history of African Americans includes influences from many sources, reflecting the diverse origins of enslaved people, who came from various parts of Africa, and interactions with Black Europeans and Indigenous Americans. This complex mix contributed to the development of AAVE and other creole languages within African American communities [oai_citation:3,Black-Indian Relations | Encyclopedia.com](https://www.encyclopedia.com/history/encyclopedias-almanacs-transcripts-and-maps/black-indian-relations) [oai_citation:4,Black Native Americans: Facts About Afro-Indigenous Peoples](https://www.powwows.com/black-native-americans-what-to-know-about-afro-indigenous-peoples/).\n\nRegarding the term \"Gen Z language\" being associated with AAVE, it's important to recognize that many elements of contemporary slang and internet speech have roots in AAVE. However, this appropriation often strips away the cultural and racial context, leading to what some describe as a sanitized version that overlooks its Black American origins. This process of cultural appropriation can dilute the significance and contributions of AAVE to broader American culture [oai_citation:5,A Provocation of The Modes of Black Indigeneity | Ethnic Studies Review | University of California Press](https://online.ucpress.edu/esr/article/44/2/41/118429/A-Provocation-of-The-Modes-of-Black).",
            "It’s also known as Ebonics (and before that, Jive). \n\nNot all of us speak it, but we can if we need to or want to.",
            "[language jones](https://www.languagejones.com/) is such a great guy, i love reading his work",
            "There have been studies on it - it could definitely have been a pitch thing.\n\n[https://pubs.aip.org/asa/jasa/article/152/5/2617/2839512/Variation-in-global-and-intonational-pitch](https://pubs.aip.org/asa/jasa/article/152/5/2617/2839512/Variation-in-global-and-intonational-pitch)",
            "this is the answer. 90% of black americans lived in the south before the Great Migration in the 1910s, when white southerners essentially drove them out. They carried their accent with them.",
            "While a bit weird sometimes, I think everyone changes the way they speak, given the context, to a certain extent. I do notice this shift most prominently in AAVE speakers. When conversing with me, it’s common for someone to switch to a standard American dialect, and then drastically switch back when again conversing with other AAVE speakers. It’s less noticeable in other people, just because they naturally speak in a standard accent, so code switching is less common. But everyone does it to a certain extent.",
            "Thanks so much for including that link. Those interviews are phenomenal",
            "> I've heard black people switch that accent depending on who they're talking to\n\nThere's a movie about this starring Danny Glover and Don Glover I think working at some kind of call center.",
            "Code switching",
            "I think OP's point is s/he is saying it can often be distinguished if it's a black person speaking in addition to their regional accent. For example, s/he's saying you could tell a white Texan from a black Texan from a white Mississippian from a black Mississippian by their speaking voice.",
            "What segregated? People born 20 -30 years ago in MA or NY are segregated from birth? And what “linguistic tradition” are you talking about?",
            "> Their worsened education results in the accent.\n\nThe redlining helped keep it intact on accident, but the quality of the education doesn't affect the accent.  You get your accent largely from your peers as you grow up, the education system has little influence on it in most cases - except in the sense of picking who the other students are.",
            "Understood. What is the reasoning for valuing/prioritizing the effects of this racist behavior? Why would I want my child/brother/bff to demonstrate they were subject to/victims of this behavior rather than demonstrating their ability to overcome it and exhibit the same skills as those not victim of it? I’m curious why, based on this explanation, many blacks in the northern US have the same accent as those from the Jim Crow deep south rather than those of, say, Windsor, Canada.",
            "Don’t know why you’re getting downvoted. Apparently, plenty of people still want to deny that segregation and racism still exist.",
            "\"I was just surprised while reading the thread that there were no dissenting opinions or examples of why this is not universally true, only examples of why it is.\"\n\nI think this is probably mostly because it's not generally a thing that sticks out?  Like, most phone calls with an unknown person, even if you think you can guess a race based on voice or speech patterns, you're never going to get confirmation that it's accurate.\n\nBut here's one for you:  I don't much follow celeb culture, but I was shocked to find out Iggy Azalea wasn't black, just based on the few songs I'd heard.",
            "TIL, accent = self-imposed segregation",
            "Snoop dogg does not have a southern accent. He sounds like he’s from LA. That’s how some of them sound.",
            "It’s one of the reasons I adore older 60s 70s black singers. There is something really special about their literal voices too that is uniquely black.",
            "I’ve noticed it in different countries and across languages as well",
            "Is this for real though? Like is there sources for it? Because I think we all assume things and it isn't always because of slang or accent and I wonder if there is a reason for that.",
            "Is not every time. It's only the times you can tell. All of the times you couldn't tell, you never knew about and are still unaware that they happened.",
            "I always assumed it was simply indoctrinated. Anytime black people I knew didn’t sound “black” enough, other black people chastised them. Especially at a family function where everyone is black. Seemed easier to adjust the way you speak then feel like you don’t belong to your own race. Maybe it’s just my family and others in the state.",
            "Unless that customer is Rick Ashley or Michael Bolton",
            "I had no idea Darth Vader was black until I was an adult.",
            "Mom says voices like that tend to come from hot Black men or super huge white guys, no in between.",
            "I’m not sure I see where you’re coming from. Why are these things mutually exclusive? I speak American English, which is a dialect of English, and I also speak with an American accent. Everyone has an accent. If a black American speaks “proper” (Queen’s?) English and you can still hear their accent, you can’t say that they were just speaking a creole. \n\nIn the same vein, slang popularized by gen z (and alpha) has co-opted a ton from AAVE, but they’re not 1:1 identical. Of course it’s wrong to mis-identify elements of gen z slang that are lifted from AAVE as gen z slang, but we still need a word for that category of words and grammar. For example, the word finna is from AAVE but is undeniably a part of common gen z slang. But there are also words like skibidi that are just gen z slang, not AAVE, and we need a way to describe them. \n\nAlso, are you aware that ChatGPT is a chatbot and not a research tool? It was good of you to include links to its citations, but please keep in mind that even if it cites its sources, ChatGPT was created with the purpose of simulating fluid conversations, NOT doing research and answering questions accurately. Sometimes it will give a good answer but it’s more like posing your question to an actor and telling them to answer however they want but deliver it confidently enough to convince you. I’m not saying this because I disagree with your conclusion or have a point to prove, I just really hate to see people getting burned by trusting ChatGPT with tasks that are not its job. Unless you combed through those sources yourself (in which case, what did you need ChatGPT for?), it’s just not a good tool to use to answer questions. If you have the expertise to properly vet its responses and make sure it’s answering correctly, you’re going to be better off just answering the question yourself.",
            "Oh stewardess, I speak Jive.",
            "True, leaving it up to this guy to explain ^.",
            "In NYC, [yeah they are](https://nymag.com/intelligencer/article/why-are-new-york-city-schools-still-so-segregated.html) and yes [aave has roots in west African languages](https://academic.oup.com/edited-volume/28056/chapter-abstract/212002865?redirectedFrom=fulltext) because that’s where they were from",
            "As a New Yorker, I can tell you as a fact that most Blacks and many Latinos still live in separate neighborhoods from Whites.",
            "What part of northern US have you been?",
            "When these laws were written white people wanted to keep black people segregated and in different schools. By not allowing wealthier blacks to move into wealthier mostly white neighborhoods they kept them out and kept them as second class citizens. The difference in education left the universal Jim Crow south accent compared to the regional ones you’d see in their white counterparts",
            "Because language isn't just education, it's culture. African American Vernacular English (AAVE) is a perfectly coherent language with its own consistent rules no better or worse than standard American English or any other dialect, even despite not being taught formally. A good example of this would be double negatives, \"I didn't do nothing to nobody never\" would have the dictionary nerds at Cambridge reaching for their calculators, but AAVE would only consider one negative and with each additional negative adding more emphasis the same as more positive words add emphasis rather than inverting.\n\nPeople are often proud of their accents and dialects and the history and culture they carry, even when certain situations require them to \"code switch\" into a more institutionally respected dialect. Plus it's not like they're recent immigrants who've intentionally moved and want to fit in, you'd be asking an entire swathe of the population as American as anyone else to admit their culture is worse and to follow yours.\n\nSame applies anywhere else, in the UK we have some very strong regional dialects and some regional languages that have historically been seen as signs of poor education and suppressed, but we're finally starting to see how important those are and learning to appreciate and to preserve them.",
            "Gee really? I lived in LA. That’s not how people just sound",
            "Then occasionally the gods throw us wildcards like Bobby Caldwell & Michael McDonald 😮‍💨",
            "I totally get what y[ure saying!!",
            "exactly, there is something unique and spoecial  to their voices",
            "Code-switching. Many black people grew up doing it, especially if they went to school around mostly white people or work in a white collar job. But, “speaking like a black person” is getting seen as unprofessional less and less as time goes on, so not many have to do it anymore.",
            "Is that when you magically regained your ability to see?",
            "I typed out a very long response to you and Reddit refreshed after I gathered supporting links.  😢\n\nI’m going to condense the argument to its main points. \n\n1. You’re misunderstanding the distinctions between linguistic concepts of language, dialect, and accent as they are all different attributes. A good majority of black Americans also code switch from AAVE to Standard American English. An accent isn’t a dialect. BAE is basically a dialect that has heavy creole attributes. AAVE features different accents depending on the region but it’s often-times the same syntax and language rules being applied. Linguistic variation accents, dialects, and languages, although they are interconnected they are distinct from one another conceptually. \n\n2. Your argument basically misunderstands appropriation. The media attributes an entire manner of speaking as “Gen Z slang” because it includes terms originating from AAVE as well as unique creations from Gen Z culture. We are talking about language structure + syntax not just words. It’s a cleverly formatted phrase because it quite literally demeans erases and attributes AAVE as just slang words used by Gen Z instead of asking why does Gen Z use AAVE. Do you think acknowledging the differentiating origins to appreciate the cultural contributions of various groups accurately? Your argument downplays abd oversimplifies a complex issue of cultural appropriation by suggesting it is merely a misidentification. Cultural appropriation involves taking elements from a culture, sanitizing or stripping away the original context. There are words created strictly by Gen Zers which includes black peoples and are in the spirit of the times but the structure and language of AAVE is falsely attributed as Gen z slang when it’s just European American kids using AAVE and new slang words. \n\n3. Lol that’s simply an appeal to authority disguised as an argument",
            "Thank you for sharing…",
            "Michigan & the entire Midwest. What brought the question to mind was watching the Stanley Cup Finals. The intermission analysts all sound similarly Canadian, whereas Ernie & the TNT NBA analysts sound distinctly different.",
            "“People” sound or White people sound?",
            "Bobby had us all fooled lol. May the legend rest in peace 🙏🏻",
            "There might be a little coffee in that cream",
            "Teena Marie. Though I think it was just the vibe not voice so much",
            "I think people said the same thing about Leo Sayer when he broke out in the US. There was a lot of confusion from Americans who would swear up and down he was black based on his voice, then they'd see this skinny afro'd white dude lol.",
            "OMG yes! The white guys that sound like Black men with the honeyed voices. Those are confusing AF. The first time I heard them I thought it was blasphemous that they weren't black. 🤣",
            "My son was stunned to learn that the guys who sang Stayin' Alive (The Bee Gees) are white.",
            "When I first got on Reddit I typed how I talked… got out of that habit fast 😂.",
            "![gif](giphy|26n6Gx9moCgs1pUuk)",
            "Lol",
            "Wow. They sound so white to me!"
        ]
    },
    "Am I racist?": {
        "title": "Am I racist?",
        "score": 532,
        "url": "https://www.reddit.com/r/TooAfraidToAsk/comments/1dldca5/am_i_racist/",
        "content": "I work at a grocery store and was designated the task of hosting a taco party in our break room. My manager gave me a couple specific items to buy and left the rest to me. She wanted it fiesta themed so that’s what I did. I covered the room in brightly colored fans, ceiling toppers, banners, and table wear. I worked with some of my Spanish coworkers to find a decent playlist on Spotify to fit the fiesta vibe, brought maracas and sombreros, and we let our workers wear the sombreros on the clock. My manager had asked me to buy sombrero coolers and a cactus wearing sunglasses and a sombrero as well. I didn’t think ANYTHING of it. Just thought it was cute decor and wanted to bring the joy and camaraderie of Latin culture to our store. Our workers loved it! They danced and wore the sombreros and told customers all about it, posted it on social media and everything. I was so excited and proud of my work. However, one of our workers came in and was very visibly upset by the whole display. They kept quiet and to themselves for most the day, and then asked to speak to me in private. I went with them and we talked for around 20 minutes. The associate asked me to talk to them privately and said that there should not have been sombreros and Latin music. They were extremely offended and said there was nothing that related a taco party to sombreros or Latin culture at all. They said if they want a taco, they’ll go to Taco Bell. Not any Latin specific place. They said a couple other people agreed, and that some others called it racist. They said if they were to put it up on social media it would go viral. They said it was nothing against me and that I’m really nice and do hard work, but they just were very offended by the sombreros, music, some decor, and the cactus in particular as well. They ragged on some of our Spanish coworkers, saying they weren’t born in Latin America so they like me didn’t understand how awful it was. I told them I would talk to our store manager and keep it between us because I understood it didn’t need to turn into any drama but I don’t want to do anything offensive in the future. They agreed and we left it at that. But then I was told by other associates that he was telling the whole store, talked to a bunch of managers, and was letting everyone know. I just want someone to tell me point blank should I have known better? Did I do something wrong? I feel terrible. My place in this world is to help people and make them happy and I’m terrified I did the exact opposite and I’m trying to figure out how to apologize and make up for it and correct my actions. ",
        "num_comments": 282,
        "comments": [
            "That person sounds like a pendejo to me.",
            "Mexican here. I would've been cool with you doing that. Tacos are delicious and there's literally a cactus on the Mexican flag. As long as you're not behaving like a jerk towards Mexicans or saying bad things about them it's not racist.",
            "I'm Mexican, and have lived in Mexico my whole life. It is not racist at all. Mexicans take pride in people representing our culture. Anything that is \"mexican\" is welcome. Even that cactus Pokemon is appreciated. Your taco party was great.",
            "Some folks open a can of alphabet soup and see insults spelled out. If your looking for a reason to get offended you will find one. Even where no offense exists.",
            "Doesn’t fit the definition of racism at all. \n\nLame, people get so worked up. If it was an Italy themed party, people would get stereotypical Italian stuff.\n\nAnd the list of countries goes on. ",
            "That sounds more like performative outrage. The “I’ll just go to Taco Bell” bit destroyed any credit I would have afforded that person, those literally aren’t even tacos",
            "Funny that the Hispanics weren't the ones complaining. This guy sounds like a jerk. And, he's probably the racist one.",
            "Latin american here. You did great. Fuck that guy.",
            "Out of all cultures - Mexicans are the ones hardest to offend when throwing a party theme. We all love others getting a taste of us!\nJust as an example, people tried to cancel Speedy Gonzalez as being racist. Guess who got outraged? We did. And the League of United Latin American Citizens. \n\nWear sombreros, listen to music, eat food, drink, and be merry with us",
            "Fuck that oversensitive twat. Since when is he the spokesperson of latin America? You guys had a good time and did nothing wrong. It just happened in a day and age where someone is going to be offended. Waaahhh waaaahh tell the crybaby next time to grow a spine.",
            "You literally did what the manager asked, so you’re blameless. I’m half Mexican, and I think it sounds fun! The person complaining sounds like a hater, who just wants to stir things up! ",
            "Don't let self-appointed arbiters of 'That's Racist!\"' poop in your sombrero.",
            "That sounds like that is a personal problem for them. If you are themeing a Mexican party, you did just fine. If you have any doubt, visit an authentic Mexican restaurant near the border or visit  Olvera Steet in LA. I can see how someone from El Salvador or another country might take offense, but it wasn't based on their heritage now, was it. It is unfortunate that this individual has or probably has killed any future themed parties since corporations don't like the liability that comes with people like that. Clearly, he feels it is about him rather than what it actually was. I find people like that don't last long at jobs as people don't want to work with them. Anyway,  not racist and doesn't sound like it should be your problem.",
            "Going to a Texmex place for tacos is a mistake. Best taco place in my town is a hole in the wall ran by Mexicans. My Mexican grandma makes amazing tacos. Lingua tacos are really good.",
            "Lol nah don't sweat it I'm Latino and tbh I'd just be happy my culture is celebrated and the employees had a great time. This person sounds like a second-generation immigrant being a idiot.",
            "If it helps any, this Mexican-American thinks your cactus and sombers are rad :D I would have loved that party! Tacos and cute plants!",
            "I mean if other latin american coworkers are fine with it why not?",
            "Did you ever say it represented all Latin America? Nope! Sounds like Tex-Mex to me.",
            "I’m not sure how people like this get through life. They must be upset by everything all of the time.",
            "Saying they will goto taco Bell is all you need to know",
            "i’m mexican and genuienly could care less. it’s not a very harmful stereotype and there’s a lot worse things said about us",
            "Sounds like some hardcore virtue signaling going on. And the fact they they are running around telling everybody how they are sooo offended only reinforces that",
            "Every party has a buzz killington",
            "not spacing your post in paragraphs, is offensive",
            "This is how every Mexican restaurant I've ever been in is decorated.  Appreciating good food and good culture is not racist.  Dude complains because he is miserable.",
            "Ask a Mexican and or Latin American. You will find that they love that shit. Their culture being spread anywhere is a win to them. And why not?!. They’re fucking awesome.",
            "If you have to ask I would instantly asume you are not. Racists and other bigots usually don't have a lot of self awareness to ask a question like that.",
            "as a mexican i can strongly say that we love when anyone brings tacos or sombreros anywhere.  We dont get all bent out of shape about that stuff.  Its people of other races that usually do on our behalf for some reason.",
            "NTR \n\nI’m Latina and I would be excited people enjoying parts of our culture. It is very clear your heart is in the right place and you’re curious and excited to share a fun moment with your coworkers!",
            ">They said a couple other people agreed, and that some others called it racist.\n\n5 bucks says they never asked anyone else, and were lying to make themselves sound more legit",
            ">*I work at a grocery store and was designated the task of hosting a taco party... I worked with some of my Spanish coworkers to find a decent playlist*\n\nWell first of all, as a Mexican, I'm insulted you think tacos are Spanish lol.\n\n>*They were extremely offended and said there was nothing that related a taco party to sombreros or Latin culture at all. They said if they want a taco, they’ll go to Taco Bell.*\n\nAgain, as a Mexican, the taco guy is a staple at family gatherings. We have taco parties. Taco Bell is not representative of Hispanic culture, so your coworker is an idiot. I'm willing to bet they aren't even Hispanic, just one of those people who are perpetually-offended by everything.\n\nAll in all, you guys were having fun. Most Central and South Americans dont care if you're having fun and representing their culture. You didn't do anything wrong! 😄",
            "I think that your co-worker is racist actually. A racist person would look at tacos and sombreros and think oh well, that's a bad thing to do. Why are we doing that? A non-racist person would think oh I like Mexican food. I like Mexican culture. I like Mexicans. I'll bring a sombrero and nice food from their culture and recipes that they've given us from their culture and really enjoy it. Your coworker is a curmudgeon. They're racist. Killjoys.",
            "You’re never going to be able to make everyone happy. There’s a line between cultural appropriation and cultural appreciation, and some will disagree about where that line falls. I personally don’t think you did anything wrong, but your employees have a right to feel how they feel and I’m glad they communicated it to you in a respectful way.",
            "Fuck that dude. You sound like a blast",
            "They seriously tried saying that there's nothing that relates tacos and sombreros....other than they both originate from the same place and it's a fucking fiesta themed party.\n\nTell this person I said they can go fuck themselves. Respectfully.",
            "Dude fuck the people who had an issue with it! Hispanic here and although I was not born in Mexico, I know damn well all your Latin coworkers would be there simply for the tacos and laugh at anything else. Taco Bell are not tacos, these are the same type of people that started the whole LatinX shit. You did nothing wrong, continue doing what you do",
            "The coworker sounds  like what a white person in their 20s would say",
            "The correct term for your co-worker is “pinche vato mamón”",
            "You can’t please all the people all the time. You can only please some of the people some of the time . \nSome people just look to piss on other people’s parade. What a shame",
            "I absolutely 1000% do NOT agree with the comment that you are racist or that the party theme,  decorations, music,  etc. were racist. I'm sorry that they felt that way,  but absolutely NOT!!! You did what your boss asked you to. Period. It's hard trying to please everyone.  I can understand how this would make you feel,  but imo, you did great!",
            "A good general rule is that if you have the self awareness to question whether or not you’re racist, you probably aren’t.\n\nAnd no, what you did isn’t racist, either. Celebration and appreciation of other cultures, even retail quality, is a strong positive.",
            "What were the nationalities or backgrounds of the associates with problems? \n\nI would need to know more before casting judgement but why did it an office party need to be themed in the first place? The table cloth and streamers are one thing but it starts getting cringe at costumes.",
            "NTA and these Karens are overly sensitive.",
            "NTA! \n\nseems like that guy just searched for a reason to be offended!",
            "Fuck them. \n\nThey’re a toxic narcissist",
            "Eeeeverything is racist, evvvverything is sexist, eeeeverything is homophobic and you have to point it all out",
            "Just one slight pet peeve— unless your co-workers are from Spain, they aren’t Spanish. If they are from any Spanish speaking country, they can be referred to as Hispanic or if they are from Latin America they are Latino (or Latinx)",
            "No, You're not racist, you have one coworker that is an asshole.",
            "Some people are cunts and now you know who to stay away from.",
            "Its not",
            "Shared this with my family who has dual citizenship (here and Mexico)\n\nMy niece is responsible for the company parties.\n\nShe only had one question. Did you use a taco truck?\n\nThe question is out of curiosity only.\n\nWe all think you did a *great* job. F them.\n\nEdit a word",
            "Nope, not racist. Go to Mexico, I’ve been to fiestas like that quite a few times down there. Would the little fragile coworker get their feelings hurt at a party in MX? Don’t worry about it, some people will always look for something to whine about.",
            "You didn’t know, they did, and they declined the opportunity to help out with the planning and the setup.  If they have a problem with the party, they are more to blame than you are.\n\nHow authentic were they expecting the decor to be?  A naked body covered in blood and hanging from an overpass in homage to the cartels?  Old people sitting on the floor in the aisles begging customers for spare change?  When they have a Quince for their daughters, to they go “authentic Latino” decor?  Or is it the celebration that it is supposed to be.",
            "No mames, racistas mis huevos.\n\nLet me guess, that associate was a young white lady with nothing to do?\n\nIf a Mexican had said something to you, maaaaaybe you could feel a little bad, but it's not racist at all. Unless you were using it to degrade the whole mexican race, because, let's face it, Tacos are mexican, not latin. Period. \n\nY que se chingue tu asociado, a chingar a su madre por culero.",
            "This sounds so off the wall to me.  I’m what they used to call an SJW and I can see why people might have some awkwardness around the sombreros and whatnot, due to stereotypes, but saying that tacos aren’t Latino food?  Like, American tacos are kind of different but tacos are definitely Mexican food.  \n\nThis sounds really off to me.",
            "Is the person who’s making a fuss Latino themselves? If not, then they need to sit the fuck down themselves. I think it would be far more racist to tell someone of Latin descent that they don’t know what they’re talking about as far as their own culture. Sure they may not have been born there, but do they really think they didn’t pick up anything from their parents or grandparents?",
            "The tacos are taco bell are not traditional tacos. Like, what? Have they ever been to Tijuana at night?",
            "Stop caring what others think",
            "Chupa vecho to that one employee",
            "“If they want a taco, they’ll go to Taco Bell” that should’ve been your first hint that they got too sensitive. Taco Bell is American. I’m Mexican American parents are both Mexican. We’ve been to places like this party and had no issues. This party sounds fun. Even the other Latin workers had no problem and the person saying because they weren’t born in Latin America so  they don’t see a problem is the same kind of thinking that made Latinex a thing. Whatever the person name who is giving you grief is dumb. And should always be ignored.",
            "Bro is talking about an improper Latin themed parties but says he'll go to taco bell for a taco? Dude deserves a horrible punishment for being such a dumbass POS",
            "Ah yes, someone taking offence on behalf of a group…. When said group are actually completely cool with it. Ignore them",
            "What a dumbass as a latin american immigrant i would have enjoyed myself so much, and who says i would rather go to taco bell wtf? You did nothing wrong my friend i would have been putting on a sombrero and eating a taco and playing with a maraca. Also isn’t this more of a mexican thing than a latin american thing? i wouldn’t care either way free food is free food.",
            "There's nothing that relates tacos to latino culture and sombreros?  If they wanted a taco they would go to taco bell but not a latin specific place?\n\n  \nI live in Texas, my sister is mexican (different dads) and this person is a fucking idiot.",
            "I mean, personally, I wouldn’t have felt comfortable doing it myself, but I wouldn’t assume it’s going to be offensive either. Most likely it would end up just getting laughed at. Anyone who felt offended should definitely have the right to speak out/go to HR, though. I don’t want to put words in anyone’s mouths, but also don’t want to silence anyone.",
            "Why is it that’s lot of stories pointing out racist things are just white people assuming it’s offensive on behalf of the should-be-offended party? Or am I misinterpreting this one?…",
            "*Maybe* I could see someone objecting that sombreros are stereotyping. But if someone is also objecting to the music, they’re the racist ones.",
            "No, you just gotta understand that some people just like to feel offended so they will find any reason to be.",
            "Honestly, try writing in paragraphs….",
            "If that were true every culturally themed restaurant (Chinese, Thai, Mexican, Italian, German, etc) would be racist. Granted some can be but most are run by people who want others to celebrate the food their culture created even if not 100% authentic to how it’d be done at home or in their country. As long as you aren’t putting on a fake accent or speaking in broken sounds to make up Spanish if you don’t know it, or hating on actual Latinos you are good. Who doesn’t love a yummy taco or carne asada, etc?\n\nAlmost all the Latino people I know would love it and no that doesn’t mean they don’t understand their own culture. It’s for fun and from the sound you didn’t do anything harmful.",
            "The solution is not to have any event for the staff in future. Problem solved.",
            "> They said if they want a taco, they’ll go to Taco Bell\n\nLMAO",
            "I actually went and checked if a taco was one of those \"it was invented in the US but they played it off like it was traditional\", like with some Asian cuisines in the US and the UK, and other examples. Nope. Taco is traditional.\n\nThat was the only thing I could think of that might make them take offense. I don't get this reaction at all. But, then, I rarely get it when people *celebrate* someone else's culture, and people take offense to it. It's a different story with, say, Saint Patrick's day in the US, where people all say \"top o' the mornin'\" like it's an actual Irish thing, and make it seem like Irish people only drink and wear green and talk about leprechauns. Being annoyed by that, I get. 2/3 just doesn't cut it.\n\n:Edit: Maybe the type of taco being served was one of those US-market ones that doesn't even exist in, say, Mexico?",
            "You should have a comment box and an anonymous survey for your co-workers to fill out. Just a few simple questions:\n“Do you enjoy culturally themed parties? Do you find anything about them offensive? Would you like to see more of them in the future? Would you prefer they be discontinued? Please add your own thoughts and comments. Thank you. “\nI bet the only negative one will be from that one employee. Maybe you should have an identical party and tell him he can’t eat there but you can present him a $10 gift card to Taco Bell!",
            "What is that guy talking about… also Taco Bell is not actual tacos. Disgusting \n\nHe has a stick up his ass",
            "It’s the fact that Hispanic and Latino aren’t the same thing. It IS racially insensitive to just take a bunch of generic items to create a party city version of culture. It’s appropriation. Should have left out the maracas and sombreros. Stay away from Turing peoples culture into a costume or decor. And on top of which, doing a LATIN theme party with Mexican decorations and food. I’m sure you didn’t mean to be offensive but you need to educate yourself and you and your company and colleagues should refrain from any more “cultural” themed parties. Don’t look to Reddit to absolve yourself of the guilt of how wrong you got this. Go do some research on why this was offensive from people who aren’t equally ignorant",
            "The person that said these things is a fucking cabron.",
            ">I worked with some of my Spanish coworkers to find a decent playlist on Spotify to fit the fiesta vibe\n\nSee this here above. one person being all butt hurty over something like that is a them problem. Most cultures like the idea of others embracing their culture and heritage so long as it's not degrading nor hurtful when done.",
            "> They said if they want a taco, they’ll go to Taco Bell. Not any Latin specific place\n\nThey're full of complete, unadulterated, pure, fresh from the mountain stream, bullshit.\n\nIs there a rule that a fiesta cannot have white people tacos at it? Ask him for the Official Rules Of Authentic Fiesta next time.\n\nAnyway, you know all those workers that were having a great time? Make sure they talk to the manager too.",
            "Was this one person who was upset, non - Mexican?",
            "Was the person bringing this up latina/latino? Why didn't you ask them as well before doing this party? \n\nMaybe it's their trauma speaking, but maybe you could have included him/her as well and ask for opinions. I don't think there was nothing inherently wrong with your execution perhaps, but it would be interesting to know more of the employee's background and what might have led to this.",
            "I bet the offended people are white people lolll My Mexican friend said he’d love a party like that",
            "If they want a taco they'll go to Taco Bell????? Who in the actual fuck prefers Taco Bell to actual tacos? Let me tell you a dumb mother fucker that's who. I assume this person is white",
            "People get so sensitive about the dumbest shit. You didn't do anything wrong, some people can't be happy unless they have things to complain about.",
            "Who was made uncomfortable? Were they actually Latino, or were they your standard white SJWs? One of these holds a little more weight lol",
            "Was the coworker who complained Mexican?",
            "Sounds mostly okay, though the sombreros were probably a little tone-deaf.",
            "Am I the only one who thinks it's kind of weird to put in this much effort building a party theme around tacos in a grocery-store break room?   \n\nI mean, they're *tacos*.  It's a very 'everyday' food.  Do y'all not have tacos where you're from? Seems very over-the-top for tacos. \n\nAlso, at the most basic work level, it just seems very manipulative and contrived of the management to task someone with this.",
            "Unfortunately, it does seem that DEI means that culture is celebrated in one-on-one interactions and any group activities like this are an excuse for some to feel offended.",
            "That person is just a racist. They've bought into the idea that Jim Crow is perfectly fine as long as it doesn't target a minority. This mindset is much of the reason why traditional minority directed racism is gaining adherents in recent history.\n\nTacos are ubiquitous, and were undeniably introduced to the US by Latin America, for which I thank them profusely. While it may not be their most important contribution, it is undoubtedly one of the tastiest.",
            "Regardless of your intentions, treating an entire group or culture of people as a meme and a costume is generally a bad idea and something privileged people do, free from any of the realities that exist for those people. Instead of worrying about how you look, why don't you try and assimilate it to those cultures and earn it?",
            "[deleted]",
            "Calling a Latino person \"Spanish\" would be like me calling a white person \"English\" or \"French\" or \"Russian.\"\n\nSpanish people come from the country of Spain. Mexican people come from Mexico, Cuban people from Cuba, etc. mexican people can come from the US too. It depends on where they were born. \n\nMexico was long ago invaded by Spain and the Spanish people who came there destroyed the culture of the mestizo people and made them speak Spanish. They did a bunch of bad stuff. \n\nSeptember 17, 1810 is known as Mexican independence day. It was the day that Mexico gained their independence from the rule of Spain. \n\nThat doesn't make you racist, but it means that you don't probably know very much about different cultures.",
            "Si",
            "Except they would spell it pendejx",
            "Next time you see them just say “Ya para con tus pendejadas!”",
            "I concur",
            "Let me tell you something Pendejo",
            "As far as I’m aware, no one was making any comments. The only conversation about Mexicans that came up was us asking our Latin coworkers about their heritage and experiences growing up and the culture itself",
            "I'm not Mexican: but lol at tacos only being a Taco Bell thing according to this guy",
            "Thank god. I truly mean no harm and I’m glad it wasn’t offensive. I appreciate you so much!",
            "This comment offends me.",
            "That’s a great way to put it!! I actually really love that. Thank you!",
            "That’s what I hoped. (It’s funny that you mention Italian bc we literally had an Italian themed party and this associate loved it. Crazy how that works)",
            "It's also usually the younger generation who are guilty of this. I'm a black Jamaican & to my daughter, I'm appropriating African culture by wearing an African-styled dress to a Historically Black College! Bitch I'm the Motherland's sister!!!! Hahaha. \n\nI'm also very much a lover of Asian art, Mexican food, Greek mythology & Italian gestures. I tell her I'm the opposite of racist I'm an equal-opportunity culture thief.",
            "I've seen people dress up like Elvis and cowboys in Japan to celebrate America. That does not make them racist lol",
            "Just don't go and have a Canadian party. We'll be super offended that you only served poutine, maple syrup and ketchup chips.",
            "Using white people as an example kinda shows that you've no intention to learn or listen to the actual people for whom these realities exist.",
            "THATS👏🏼WHAT👏🏼IM👏🏼SAYING👏🏼 if Taco Bell has one hater it’s me",
            "They lost me at \"if they want a taco, they'll go to taco bell, not a Latin restaurant.\" Like what? That's a little racist and shows a shit taste in food.",
            "He was born in Latin America, but yeah he was (as far as I’m made aware) the only upset one. A couple people think he’s racist, and people are telling me he’s a jerk at work anyways. I’m being torn in so many directions lol! I appreciate your comment and advice! It helps a lot",
            "Weird so many people didn't see the part where they said the coworker didn't think others would understand because they weren't born in Latin America",
            "and an imbecile.",
            "I appreciate you sm 😭 I got so freaked out but I’m glad I didn’t offend your culture. I want to celebrate it not mock it!",
            "Arriba, arriba, andale, andale! 🤣🤣",
            "Literally every piece of Speedy Gonzales merch I have ever seen in the wild was owned by Mexicans",
            "I so appreciate you!!!! I love Mexican culture. You love fiercely and are merry and joyous!! I’m excited to learn more and join in!",
            "I appreciate you sm 😭",
            "I sure tried 😭 I really didn’t understand why he came to me and not a manager but I tried to help all the same!",
            "Trying not to!",
            "I appreciate that. I really did try to make it realistic to the culture. I researched fiestas and tried to replicate it exactly. I’m hoping they didn’t kill our chances to appreciate diversity, but management hasn’t shared anything with me yet.",
            "I've dined at a restaurant on Olvera Street, just last year, and it was actually almost in a way slightly disappointing how much it was like nearly any other West Coast (proper) Mexican restaurant I've been to, right down to the menu. So, point being, if that's the metric, OP did fine.",
            "That's how you know it's good. Some no frills family run place in an unassuming spot.",
            "Oh no, lingua, tripa, and cabeza are all on my No Go list. I may have grown up the only whiteboy in a Mexican neighborhood but I know what those words mean and its a nope for me. BUT... My own abuelita (in-law) makes the best al pastor anywhere. Love that little lady.",
            "It does help!!! I so appreciate you :,) next fiesta I host you’re invited",
            "That’s what I thought!!! But I’m a big over thinker so I wanted to come to the masses and double check and see if anyone had any ideas for apologies",
            "That’s what my coworker said!! She loved it",
            "According to what some coworkers are telling me he is 💀",
            "LMAO fr I was so confused as to why he brought that up. Like what does Taco Bell have to do with this",
            "I can't get over that. It's still just not settled in my brain.",
            "Understood!! Ty for sharing I really appreciate it. I don’t wanna offend anyone or do something inappropriate",
            "Especially after they asked be to keep it between us. I was like absolutely there does not need to be any drama aaaaaaand now there’s drama",
            "Understood 🫡",
            "I sure tried to replicate it well!! I felt bad that he didn’t like it :(. But I appreciate you understanding",
            "Agreed!!! We need more spotlight shared on them bc the community is AMAZING",
            "*me immediately going through every time I’ve ever said anything to anyone and being terrified I said something offensive or racist* okay awesome lol! I definitely actively try to be the OPPOSITE. Was raised with a racist dad and I do my best to correct him every day",
            "Understood!! Ty! 🫶🏼",
            "Tysm!! I’m definitely trying. I just want to shed light on yall and your endless joy 💗",
            "So far no one else in our store agrees. So I’m thinking the same.",
            "I don’t think tacos are Spanish lol no worries!! However the worker was a 39 male born from Latin America :)",
            "No, but plenty of Mexicans do also enjoy Spanish music in addition to Mexican and other Latin American music. My Mexican wife has introduced me to a number of great bands on all three continents.",
            "He was definitely nicer than he could have been! I was very appreciative of him letting me know it wasn’t against me. I just feel bad that I offended him either way",
            "I’ll sob you’re so sweet. I appreciate you",
            "I got so confused 😭😭 like did I miss a memo or something??? I’ll tell them (respectfully) 🫡",
            "Bro the Taco Bell comment was CRAZY it threw me for a loop. I appreciate you!! And as far as I’m aware, our Latin workers besides him enjoyed it. I’m trying to focus on them as well as this situation:)",
            "I appreciate that!!! I really wanna draw light to diversity anyway I can. America is a melting pot! Let’s bring culture around more!",
            "The only associate who had a problem was the one who came up to me, and they had a Latin background. As for theme, I couldn’t tell you but my higher ups asked me to and so I did. I’m with you on the cringe, but when I tell your our workers eat it up every time I mean it. It’s insane. Superhero capes and masks, Italy wash on tattoos, if they can wear it on the sales floor they will. Sometimes our customers get in on it too. I’m one that stays out of it, I don’t like dressing up. But everyone else does so I let them have at it.",
            "Funnily enough apparently a good amount of the store I work at agrees",
            "Learning this!!! I do have a couple Spanish coworkers like the ones who helped me pick the music, but I’m practicing separating and making sure I know what origins come from where. Tysm for pointing it out!! Learning is important.",
            "No taco truck. Homemade at our store by our workers in every department. Everyone helped out! I appreciate you and your family 😭 it means a lot",
            "I so appreciate you!!!",
            "I appreciate you so much. I really don’t understand what they wanted me to do 😭",
            "The associate was a 39 year old male from Latin America. Hence my fear and understanding of the severity. I so appreciate what you said though. I absolutely did not use the situation to hurt or mock ANY part of this culture. I used it as a way to shed light specifically on our Hispanic workers and let them share their stories and hearts. Some of our workers learned so much!!",
            "Yeah I wasn’t sure what to do or make of the whole thing and no one in my store was giving me any straight answers so I was like welp time to turn to Reddit and see lol",
            "They’re from Latin America!! But I definitely didn’t like that they told me other Spanish coworkers weren’t born in Latin America and therefore were as ignorant as I was. You can understand cultures without being in them!!! You may never understand how they felt going through the hardships they’ve faced, but you can understand how awful it was that they went through it and that we should work to stop it.",
            "I was so thrown off by the Taco Bell comment too. What does it have to do with anything 😭",
            "Man if only I had thought of that",
            "I agree!!! I told them once they had shared their piece that I would go to our head manager and talk to them about it to ensure no one is offended again. Everyone’s feelings are completely valid",
            "The coworker who came up to me was born in Latin America so he’s definitely not a just white. I appreciate you asking if you were misinterpreting!! I’ll add any info necessary:)",
            "Will do 🫡 my apologies I’m an annoying one huge portion writer. I’ll work on it",
            "We definitely didn’t put on accents or hate on anyone. I tried to use it as a good spotlight for our Spanish workers and we did the opposite of hate and listened to their stories and heritage. Everyone deserves love and appreciation. I wanted our Latin workers to feel the love they give so generously!!",
            "That might be what my managers choose. Which if they do, obviously more power to them! But it does bring down morale a HEFTY amount.",
            "Understood!! Duly noted 🫡",
            "I agree!! I just wasn’t aware I was treating the culture as a meme. I completely understand that the whole situation is what it is *regardless* of what I intended to do. I posted this because no one would tell me if what I did was wrong. They all just told me “you’re fine.” I wanted to hear from the masses if what I did was ignorant and racist *so* I could rightfully apologize, learn from my mistakes, and do better and teach others better who were in the same position as I was. I needed a definite answer lol!",
            "Trying to decide if this is a double negative or not.",
            "I’m sure trying not to be!!!",
            "Understood and agreed! The two Spanish coworkers I referred to were from Spain decent, so they were indeed Spanish. I’m practicing categorizing them correctly tho because I do think I made some mistakes in the comments!!! Learning a lot.",
            "Sorry but its actually, \"pinche pendejo!\"",
            "That's fair. Either way, I don't think you were insensitive.",
            "So here's where I'm a bit lost. This one guy was upset because he's Latino and was complaining the other workers weren't? So who were all these other Latinos?\n\nIt's a fair point to make that tacos are not universally Latin, but are Mexican -- and also fair to point out that what white folks call tacos aren't what Mexicans call tacos. But... it wasn't a fucking history class, it was a party, and it doesn't seem like anyone was wrongly portrayed.. you invted them to educate you in fact.\n\n(I can bet this guy probably said your Spanish (i.e. from Spain) music wasn't truly Latin. That may as well be, but I know a number of Mexicans, and even an owner of a Mexican restaurant, and they enjoy quite a bit of Spanish music alongside Mexican music, much like white Americans also enjoy British music. Hombre probably only likes banda or something.)",
            "Yea I question his choice of what makes a 'real' taco. Dude don't know real tacos if they bit him on the nuts.  I don't work with that clown and I want to get him fired just for that alone.....",
            "That was pretty damn funny. I did lol at that",
            "Wisconsinites offend me",
            "What is annoying is the chance that because one person was offended, now there may no longer be themed parties off nationalities anymore lol. \n\nThat’s how stuff works these days sadly, in most situations. Cater to the extreme minority. ",
            "This notion of getting offended on behalf of another group seems to be a pretty American thing.",
            "The irony of modern ethnic discourse... everybody's fine with every *other* group being treated wrong, just not *theirs.* And they all jockey for attention over each other.",
            "In the 90s the popular notion was that that was pretty much the preferred dress at HBCUs. Thanks, A Different World.",
            "So what do you mean exactly? The way I understand it is basically that no white person Would ever be offended, but any race that isn’t white may be?  And what realities? Stereotypical aspects of their culture? So latinas stereotype is a reality but Italian stereotypes aren’t a reality?  I think very few Americans would be offended if they were on another country and they had an American themed party with hot dogs and cheeseburgers and American flags lol\n\nLastly, while I’m half white, I’m half not white and my half not white side doesn’t agree much with your perspective lol",
            "Exactly. That’s as if I would say if I want real pizza I would go to Domino’s not to my nonna’s house!",
            "I would assume Taco Bell taking business from taquerias is a better example of problematic cultural appropriation than a non-commercial taco party.",
            "No fr I said HUH",
            "Hey don't shit on Taco Bell :( sometimes I need a $3 burrito on the highway",
            "It's even more racist to call Taco Bell equal to actual tacos",
            "Imagine a Latin American saying that. Bro. My Mexican wife will not eat at Taco Bell except as a joke.",
            "Im mexican. Tell that guy from my part that he is a reverendo pendejo and to stop gatekeeping this shit.",
            "I think the issue is that your other coworkers that enjoyed it are MEXICAN and the one who did not is from LATIN AMERICA. I think the LATIN AMERICAN coworker just has a bug up his butt because he's probably spent his whole life (at least the part in the USA) being grouped in with MEXICANS who he doesn't have anything in common with except a root language.\n\nIt's a bit like if you had a Japanese themed party with Sushi and thought a SOUTH KOREAN would enjoy it. Most likely they would not, because they are not JAPANESE, and worse, would have spent most of their life (if in the USA) being confused/associated with JAPANESE and constantly having to explain they are not ASIAN, but not JAPANESE.\n\nThe way to fix it probably would have been to say something like 'I know Tacos don't have anything to do with LATIN AMERICA, this is a MEXICAN themed party. I'm hoping to do a LATIN AMERICA themed party in the future with paella and I hope you'll offer some suggestions as to what we could include.'",
            "Seems like someone who likes to yuck other ppl’s yums.",
            "Don’t feel bad- you did nothing wrong! They should be happy to work with you, you sound like a really nice person ☺️",
            "Family run food is so superior I’m right there with you",
            "Yeah it’s not to discredit their taking offense but at the end of the day their individual opinion isn’t the only one.",
            "Curious what’s your generation and the generation of the person who complained?",
            "I’m right there with you. I’m still looking at this puzzle confused.",
            "Sounds like that dude won't enjoy anything. Geez how can you not like a party like that? I'd feel sorry for that miserable douche if he wasn't also trying to make others miserable.\n\nSounds like you did a good job. There's just no pleasing some people.",
            "Sir you are considerate and thoughtful person and you don't have to worry even if you make a mistake. At the end of the day, honesty and good intentions are all that matters. Keep correcting your dad, I hope you can change his mind. Sending regards from Croatia!",
            "Oh my mistake! I just felt like that deserved a playful tease lol.\n\nLike someone else said, he's just a pendejo then. You didn't do anything offensive IMO👍",
            "I understand (as an empathetic person) that offending someone, especially when it comes to race and culture, is guilt inducing and upsetting. I think you hearing them out is important, but also remember that lots of people just want to be angry. You did not intend for this party to be offensive. \n\nIf I may ask, were the only employees that were upset also Latino? I think if it was a situation where the Latinos were upset and the non Latinos were having fun, I would wonder if the disgruntled employee saw the situation as more of a mockery than cultural appreciation.\n\nEdit- just saw your other comments. I’d say the employee just wants to be upset and nothing wrong was done",
            "It’s all mindset. Focus on the positives of the party. What can you be grateful about the party? Focus on that.",
            "You clearly aren’t racist. You have a great attitude, and even if you accidentally make mistakes (which I don’t think you did) then that’s ok!",
            "That's so wonderful!! 💕 😍",
            "Huh, wild thing for a dude from these here parts to be upset about that. I'm sure he wasn't Mexican though; do you by any chance hace any idea what his nationality actually is?",
            "I would maybe try to talk to them more.  I don’t think you got it, especially with the whole “if I want tacos I’ll go to Taco Bell” thing.  That just doesn’t sound right.",
            "Sounds like you threw a great get together that was full of fun and had a few wet blankets. It’s a shame they made you think that because the blurriness makes it hard at times to see someone actually doing things wrong.",
            "Me now freaking out on if I sounded like I wanted to be racist LMAO. Jic everyone I meant I am trying hard NOT to be racist :p",
            "That is interesting. I was raised in a fairly backwater place in the US. It was frequent that people would refer to Mexican people as Spanish because they conflated the language they spoke with their race. Was such a regular occurrence that I rarelu mentioned it. \n\nSo I am surprised at myself for jumping to conclusions.  Not considering that you might have asked European Spanish people about the appropriateness of a Mexican food themed event rather than that you had asked mexica",
            "Ackshuaallyyy, it's \"pinche culero\"",
            "Lol",
            "lol true.",
            "I appreciate that so much, really",
            "That’s what I’m wondering. He said others were really upset, but everyone who is coming up to me is saying they really liked it. So I’m confused as to who all I offended.",
            "This man doesn't deserve the love of carnitas.",
            "I'm about as white as a person can get and a Canadian, and even I knew that was bullshit lol.  I enjoy taco bell sometimes but I know it isn't close to authentic tacos.",
            "Only the Wisconsinites that drink beer or are Packers fans offend me.",
            "Yeah, well, that's just common sense\n\n*currently in WI",
            "cope",
            "That’s what a few of our workers are scared of too. One of our Spanish workers is so upset he said something bc they felt at home at the party and now are scared we won’t have anymore culture parties. I feel so bad and so torn",
            "A minority of people, but the second one person is upset, companies, schools, ect often completely cater to the one upset person and the extreme vast majority of the time it’s ridiculous and a lot of people are getting real tired of it all lol",
            "*petty American\n\n\nI don’t claim this person.",
            "AMEN ITALIAN BESTIE OVER HERE AND DO NOT START ME ON DOMINOS LMAO",
            "Getting pizza at nickys in the strip mall is racist to Italians! Pizza hut has the pizza everyone else should eat.",
            "\"If'n ah wants a real grilled Murican Grade A chuck ground beef burger, I mosey on down to Mickey D's\" said no Texan ever",
            "I live in New york, so for $12 bucks you can get a bag of stuff from taco bell, or a of legit tacos. That's a real easy choice for me. And don't get me wrong, I love me a cheesy gordita crunch, but conflating the two is blasphemy.",
            "Valid bestie get your burrito",
            "On it (respectfully) 🫡",
            "Preach it!",
            "See that’s what I thought!!! But he was like you’ve never been born in Latin America and neither has *insert other workers* so you have no clue what it’s like and I was like well fuck I definitely don’t but did I mix them up that bad?",
            "You’re so sweet! I appreciate you. I definitely work hard to be every day",
            "I’m born 2002 so I believe Gen Z if I’m correct and this worker was millennial age 40",
            "I so appreciate you!!!! Ty for your encouragement. Sending love right back from Florida!",
            "I love playfulness usually. But I’m TERRIFIED here LOL! No worries. No mistakes. You’re fine :) I need to relax lmao. I appreciate you!!",
            "I appreciate you understanding. A lot of my coworkers have just been telling me not to care but that’s easier said than done. You absolutely may ask!!! From what I understand, the other Latin workers loved it. One of our workers said it reminded her of home and she loved that I tried to bring culture to our store instead of just grill outs for every event. But I haven’t talked or heard from every single Latin worker here, so there could be someone else who didn’t like it",
            "I so appreciate you. I’m definitely still learning! But it’s nice to know I’m doing okay",
            "No I don’t unfortunately. I’ve tried to talk to him in the past, and I say hi every time he passes me by. But he’s very reserved to himself except for a few other coworkers.",
            "I wanted to but they weren’t at work today. I really didn’t understand that comment, especially because later he said he was excited to eat tacos today and was upset later when he saw the decor. So I ended up thinking he was fine with the tacos but not the decor since that’s what he said he was upset about, from what I gathered he was saying that tacos didn’t have to be specific to Latin culture, i.e. Taco Bell. He wanted a taco party, not a fiesta. He kept asking me what related a taco party to Latin culture.",
            "No man, it’s Cool Arrow",
            "I thought it was pinche m\n\noh wait, scratch that",
            "You were not insensitive at all! You were mindful and respectful and anyone would be lucky enough to attend and partake in the deliciousness! That guy sounds seriously unhinged. I'm sorry, but \"taco bell\" to him is 'real tacos'?  when you and co workers are obviously making a fantastic feast? him making that statement about 'taco bell' really gives off 'mentally unstable' vibes. One of those 'easily offended looking for a soapbox' types who shouldn't be taking that stuff to work with him in the first place.  I'd tell HR that as well because he might have a pattern of that behavior.  Just wait till Oktoberfest he's going to go ape shit over the German theme and declare \"I can go to Wienerschnitzel if I want German food!!\"  What a nutjob.\n\nYou did fantastic!  Anyone would be lucky to work with you because you took the time to make it wonderful!",
            "Well, that narrows it down! While on the topic, pigeons offend me.",
            "F\n\nI just moved away due to work but I will always consider it home. I will also always shit talk it 😁 I do miss Kwik Trip though...",
            "Nope, not at all\n\nIf there is Indian theme party *without* Butter chicken and funky bollywood music I will be offended because that is Racists",
            "Hey just want to point out that Spanish people are from Spain, but Hispanic or Latin American/Latino etc. is probably what you’re talking about? \n\nAlso you definitely weren’t racist that person is just looking for attention or something",
            "I gotta ask, when you refer to this Spanish worker, are they actually Spanish or are you implying everyone south of the border is Spanish? \n\nBecause a Spanish person in no way would feel at home at a Mexican themed party. Our cultures are vastly different from the Spanish.",
            "Perfectly acceptable party, just a huge overreaction by someone who doesn't really understand the problems of racism etc.  But one thing you might want to check yourself on is using the term Spanish to define anything other than the language or a person from Spain.",
            "Out of curiosity, what nationality was the complainer?",
            "Tell them to tell the manager that.",
            "This is why I still practice social distancing....",
            "I LOVE Pizza Hut. I’m racist to my dad.",
            "You can’t get the same bag at a taqueria for $10?\n\n(I was actually agreeing with you ftr)",
            "Make sure you use usted",
            "Yeah... Mexican and Latin America have about as much in common as South Korea and Japan.\n\nI certainly wouldn't accuse you of racism like they did, unless you said something like 'All you Latin people look alike, I thought you were all the same.' Simply not recognizing the differences between Mexicans, Cubans, Latin Americans, etc. isn't racist -- it's just being American/human. Schools don't really teach about other cultures, so we're left to learn on our own through life. Most Americans wind up with 'Speak Spanish = Mexican' as the extent of their understanding.\n\nIt was an honest mistake, you didn't mean to cause harm. In the future, in the highly unlikely event you ever have a 'Latin themed' event again, you know now to just call it 'Mexican themed' OR to include some of the other Latin subgroups (Cubans, Latin America, etc) besides Mexicans and include their foods, etc.\n\nIt's a weird thing... I'm sure you picked the term Latin over Mexican because you wanted it to 'seem more inclusive' of more co-workers (the one who took offense), but you'd probably have been better off with a more EXCLUSIVE term like Mexican.\n\nJust don't ever have an ASIAN themed party... those sub-groups REALLY hate each other :) Make sure you do JAPANESE and have Sushi, etc.",
            "Holup\n\nHe said Mexico wasn't Latin America?\n\nI'm about to put down money that bro is puertorriqueno, which is only Latin American by culture, but not by political geography.",
            "No problem! You seem like a gem of a person OP. Keep being yourself 😄",
            "Oh that’s so sweet of your other coworker! If that’s the case then I’d say you pulled it off perfectly :) navigating life is hard, you can’t make everyone happy all the time, but the fact that you even made this post and are worried about it tells me you’re a good egg. Try not to let it get you down. Focus instead on the fact that you threw a party with a cultural theme that made your employees of that culture joyful. That is lovely.",
            "I’ll sob!!! You’re so sweet. I definitely tried to put my heart and soul into that party. Also yeaaaahhh I said brother Taco Bell seriously? Lol",
            "> Wienerschnitzel\n\n> German food\n\n*Austrian food",
            "Spotted Cow FTW",
            "Duly noted 🫡 Tysm!",
            "I mean, I can't guarantee the butter chicken, but the bollywood music is a no brainer.\n\nI can probably swing some naan and maybe even some palak paneer from a heat-and-serve bag.\n\n(Incidentally, I can't help but imagine that if one were to play Bollywood music, that someone from a non-primarily-Hindi-speaking state would be upset you didn't play any Kollywood music, or Tollywood music, or Punjabi music, etc. etc.)",
            "Correct!! He was not Spanish from Spain. He was Latin American born in Latin America (I don’t know where in Latin America specifically)",
            "They have a Spanish coworker and a Latin coworker. One is actually from Spain and the other was born in Latin-America.",
            "Teeeeeeeeeeeeechnically hispanic includes people from Spain.\n\nBut yes Latin (Latino) means Mexico and the wide majority of Central and South America.",
            "I’m definitely not implying everyone south is Spanish!!! The Spanish worker is Spanish decent. Raised here in America. They haven’t been able to travel to Spain due to money but loads of their family has come down here and they’ve had parties and have generational kind of idea of Spain. I in no way am implying anything about them!! Just what they’ve shared to me.",
            "Correct!! I’m learning so much from this comment section lol. Working on memorizing the differences between all groups (Spanish, Mexican, Latin, etc.) and facts that separate them! One of my coworkers is extremely on the nose on this, she can always guess where someone is from. She’s my bestie, so I’m texting her and we’re talking about it. Shes gonna help me with it too",
            "Born in Latin America:)",
            "No, that's exactly what I'm saying lol. $10 bucks for fast food sodium bomb or $10 bucks for legit tacos that (probably) won't give you heart palpitations. Who knows though. Maybe ops friend lives somewhere completely void of Mexicans or any central American people and \"Latin\" places are serving crap.",
            "Lmao",
            "That’s the thing! We literally didn’t even name it or categorize it to any specific culture!! I was going for a Mexican likeness since it was tacos, but we just called it a fiesta. I didn’t tell anyone it was related to anything. I appreciate you and I’m definitely using this time to do even more research and try to memorize the differences. I don’t wanna make any more mistakes!",
            "That’s what he described tbh!!! So maybe that’s it",
            "I so appreciate this. I’m really trying to. America is supposed to be a melting pot. A place to accept, appreciate, and encourage all races, cultures, diversities. And celebrate them!!! That’s all I want to do",
            "i’m curious, was the person who got offended hispanic?",
            "So yes on the music it is possible that if it was happening in India, people from south or north might get offended but abroad everyone is fine as far as I know. \n\nBeing a north Indian I would be dancing my heart off if Nattu Nattu (the oscar wining) song plays or any other as well",
            "Oh yeah that's why I asked if that worker was actually Spanish!  Chill dude, I'm not judging you at all, what you did was pretty wholesome, too bad one old dude is ruining it for you guys",
            "Oh you had a lil typo and I got lost. We are in agreement! xx",
            "They were born in Latin America :) idk how long they lived there but yea",
            "I’m chill no worries! Sorry I’m an exclamation point kinda gal I use them too much. :)",
            "From the sound of it, your arrangement wasn't racist at all and seeing as how the same coworker had a good time when it was Italian themed, makes me think he doesn't mind a little cultural appropriation, as long as it's not his culture. \n\nBut I'm curious, if the place is throwing a Latin-themed party and there's latin people working there, did anyone think about having one of them set it up? It would still provide a culturally themed party, but give each person an opportunity to present their culture authentically - while also avoiding any sort of risk that any one would end up offended.",
            "Same here! And sorry for calling you dude lol hope things get better with that dude, don't let him bully you and make you think you did anything wrong. You didn't.\n\nHave a great day!!",
            "I’m usually the go-to party planner. As far as I’m aware, they reached out to a couple of our Puerto Rican co workers, but they were too busy to take on the whole party. They helped me with odds and ends and little things, but that was all. I so agree with you though. One of my coworkers would have been PERFECT for the job had my store been willing to back the event up a couple days.",
            "Lmao girls can be dudes!!! No apologies needed. I appreciate you a lot!!! I hope you have a great day too!! 🫶🏼"
        ]
    }
}