{
    "Weekly Question and Answer Thread - /r/TotalWar": {
        "title": "Weekly Question and Answer Thread - /r/TotalWar",
        "score": 17,
        "url": "https://www.reddit.com/r/totalwar/comments/1dhss7s/weekly_question_and_answer_thread_rtotalwar/",
        "content": "Welcome to our weekly Q&A thread.  Feel free to ask any of your Total War related questions here,  especially the ones that may not warrant their own thread. There are no  stupid questions so don't hesitate to post.\n\n**-Useful Resources-**\n\n[Official Discord](https://discord.gg/totalwarreddit) \\- Our Discord Community may be able to help if you don't get a solid answer in this thread.\n\n[Total War Wiki](http://wiki.totalwar.com/w/Main_Page) \\- The official TW Wiki is a great compilation of stats, updates, and news.\n\n[KamachoThunderbus' Spell Stat Cheat Sheet](https://drive.google.com/file/d/0B-_Swyh0Ifo8cTI4ZUxoVGtmVVk/view) \\- An excellent piece of documentation that thoroughly explains the ins and outs of the Total War: Warhammer 2 magic system.\n\n[A guide to buildings and economy in Three Kingdoms](https://old.reddit.com/r/totalwar/comments/bwepxi/a_guide_to_buildings_and_economy_in_three_kingdoms/)\\- Wonderful guide by Armond436. Having trouble getting your 3k economy up and running? Look no further!",
        "num_comments": 81,
        "comments": [
            "If I want to run a pure gunpowder/arty army with Nuln, assuming an Engineer Lord, what's the ideal amount of Engineer heroes I should be stacking in the army?",
            "Warhammer battle LoS is a bit odd. I just came from an Atilla campaign and a couple MP game where I was able to hide my troops behind hills but I found it was far harder in WH3 even if enemy has no flying unit. Did they change something or did they make it harder to hide naturally?",
            "What are some good WH3 multiplayer streamers that don't do domination mode as much? I love Turin content but I'm really meh about the new multiplayer mode and want more \"classic\" content.",
            "Aside from Channeling stance, is there another way of generate more winds of magic? I’m doing an Ostankya ROC campaign and the magic situation in the Chaos Wastes is absolutely awful. I’ve got all these cool new spells but don’t have enough magic to use them. Is it all RNG?",
            "Does the Huntsmarshal's Expedition have any specific doomstacks; or is usual empire stuff the way to go?",
            "115 turns into Boris campaign. Can confirm it's hard as shit. \n\nWhat's the consensus best way to play his start? The only thing I know for sure is that the way I've been doing it (whack-a-mole with every evil faction east of Malus and north of Kislev) is not it.",
            "Please can someone recommend a chilled-out RoC campaign. Considering buying the latest DLC but want to re-try the game first.",
            "(I'm playing warhammer btw)\n\nWhen do you guys fire up a new army? I have a consistent play pattern that I'd like to break - that play pattern being, I only use one army until maybe i reach my T5 buildings, then any subsequent armies are my endgame setups. I find I do this because in the beginning hero slots tend to be in short supply, and it takes time to build up buildings. I also find it more entertaining to stick with my initial army since they'll have the better units and my lord to make battles more interesting.\n\nHowever, I know other people will have multiple armies really quickly. Any tips on breaking this pattern? When do ya'll spin up a new army? Do you just take small settlements with your weaker armies until they're able to stand on their own?",
            "Can we still report bugs/glitches?\n\n\nFound out during my Beastmen campaign that you can't increase the Research Rate anymore apparently. ",
            "This is a silly question probably already answered a thousand different ways but hey uh I'm new to playing Total Warhammer 3 and I'm bad at it. How do I get good at it?\n\nSpecifically battles. I can read unit stats and get a broad idea of how they function in an army but I have no idea on tactics beyond the extreme basics like \"protect vulnerable units\", \"use cavalry to hit squishy ranged guys\". I often hear that auto-resolve is going to give you a worse result than playing it out yourself but there's nobody better than me at pulling a pyrrhic victory from the clutches of a close one. \n\nAll my battles end up being a big blob of units smashing into one another and then eventually one side wins. \n\nAre there any good resources you recommend for learning battle strategy? Warriors of Chaos are what I like to play but ideally I'm looking for broad tactics that can be applied to any army.",
            "Is recruiting Chorf units subject to any unit cap?",
            "I’ve not played TW3 WH for a while but thinking of picking it up again. There’s obviously been a lot of changes and new DLC recently, any recommendations on what’s good?",
            "I can't tell if having Flaming attacks on Throgg is doing anything (defeated Kostaltyn). His Frostbite still works, but I'm not seeing anything that indicates the flaming attacks are applying anything.",
            "I haven't played Warhammer 3 in years. Decided to come back and do a mortal empires campaign as Nakai since I love lizardmen but never played as Nakai. 100+ turns later I got the dwarf crisis and I am getting absolutely rolled by three dwarf factions that feel like they always have 8 armies at any point. Any tips? I'm holding them in the mountains where Greasus starts but I'm not able to make progress west.",
            "I seem to be having an issue with the Malakai campaign I started this week. My adventure quests aren't completing like they're supposed to. I started the Chaos Dwarfs one, have fought Astragoth enough times that I have multiple lords with his defeat trait, but it's still showing as 0/5 Chaos Dwarf fights. Likewise, I signed a trade agreement with Miao Ying which should have completed the \"sign a trade agreement with Cathay or Kislev\" quest (yes I signed it after starting the adventure) and no dice.\n\nIs this a known issue? Is there a fix?",
            "was there some change to the way budget is done in 5.0? still going bankrupt even though the negative income is well below the balance and it never runs to 0 at any point before the next turn. thought it was a bug but i guess that's giving them too much credit",
            "Should I heal units at the end of the battle? Or I should heal only heroes and lords?",
            "(WH3) Does anyone have or know of a good list that details each skaven unit (not meaning in-game stats), whether they're generally good or bad, and the best way to play with them? I can't find much myself and I'd like to know if x is better than y, if z is even worth using, and how best to use units a and b, so on.",
            "WH3, is Anvil of Doom still bugged? I thought it was supposed to be fixed, but sure doesn't look like it in this fight I'm in. I can't even use Master Rune of Flight with my runelord.",
            "tww3 has been stuttering and tearing since i started this run where it was fine about in month ago. there are some moments when it runs perfectly smooth with no appreciable change to quality (really, not cope) but then it goes back. is there some hidden setting to change or is my graphics card just giving out",
            "A question; can multiple endgame scenarios still activate with ultimate crisis turned off?. if so, how does that exactly work in one campaign? ",
            "Pls help, my reliability is plummeting so hard and I do not understand why?!? Currently playing N‘Kari in TW3, and my reliability is now just dropping for no reason at all! \n\nSure, I’m somewhat unpopular among my allies, vassals and trade partner, simply because they are diverse and do not like each other, and yes I had deserved drops in reliability before. But now, after slowly climbing back up to High it’s just going back down to Medium and now Low. All that’s happened is, that others ended trade agreements with me, and I told some people to fuck off my lawn.\n\nBut these shouldn’t lower MY reliability, right?",
            "(TW:WH3) Is there a mod that'll show line of sight or, more importantly, outline the section in trees where units will be hidden? I hate trying to move units around in all sorts of positions to see if I can get them hidden and not have a promise I'll even be able to.",
            "What's the best way to make use of Devastating Flanker for Tretch's army? I like making thematic armies for my LLs so I want to see how far I can get with good ol' line infantry and flanking maneuvers. But Skaven don't have proper cavalry and the stupid no-furs don't want to share theirs.\n\nI tried Rat Ogres and Brood Horrors since I'm playing Moulder, but their rear charges have been rather lackluster. Are there better options? Doom Flayers/Doomwheels? Death Runners? Censer Bearers?",
            "Is there a workshop mod that lowers the graphics for the campaign map only?\n\nIf not, anyone know which global graphics settings has the most effect on the campaign map?",
            "Well depends on the units, but generally you can math it out such that each engineer gives +12% damage from their skill line but removes 1 unit from your army. So for example 19 units, 4 engineers, 1 lord means 15 units shooting with +60% damage. Something around there. Baseline I think probably 3-4 heros would be right for maxing dmg but ultimately up to you to find the balance.\n\nFor example in practice I did an ironblaster doomstack here and figured they would do the most possible DPS with 1 lord, 8 hunters and 10 cannons + healer in the army because any more heroes started to reduced my dps by more than the remaining cannons gained. [https://www.youtube.com/watch?v=shbA87tGX0o](https://www.youtube.com/watch?v=shbA87tGX0o)\n\nObviously a lot of other factors like the engineers having good guns themselves and army comp but that's at least a way to math out how much 'value' in terms of firepower each extra engineer is giving you.",
            "I can't contrast it with Attila, but line of sight works fine for me in my WH3 games. Is it possible they've got some units with stalk or predatory senses that are spotting you? The AI also does a better job now of searching for hidden units and I could see how they might be able to optimally peep over the landscape to spot you from far away.",
            "I remember Rome 2 being fairly sensitive to los but in wh3 I honestly forget it’s in the game most of the time. Definitely a difference particularly noticeable in sieges where you really shouldnt be able to see  behind walls and buildings but it’s still there. Mostly just useful when putting large units behind big hills can’t trust much else to hide appropriately",
            "Humanboyyesyes, tequilasunset, tactical lich and dahvplays are all good land battle channels. Humanboy's discord also has a community videos channel if you want to find more through there.",
            "There are some niche options available to certain factions, like Tzeentch has a post-battle option to gain WoM instead of replenishment or currency.  Some factions have research or hero abilities that grant WoM each turn, and so on.    \n  \nBut generally no.  The Winds situation in each province is random, and changes occasionally.  Sometimes you get bad luck.  Tzeentch is the only faction that can deliberately influence the strength of the Winds in any province, everyone else is just at the mercy of the weather.",
            "Wulfhart specifically favors Huntsman, everyone else can run whatever. \n\nBy the end of my campaign with him, [this is what I had his stack looking like](https://i.imgur.com/7RmFJMe.jpg). I'd probably change some things around if I knew I was going to fight a ton of high armor SEMs but that did fine against everything I fought at that point.",
            "Migrating to Kislev, and taking Praag is a viable solution if you don't want to stay in the Wastes, and fight Chaos non-stop.",
            "Either Cathay faction is pretty chill, or if you have any other DLC those are all fairly strong. Festus would be my recommendation if you like that style.",
            "Any of the RoC DLC is chill because you're own your own timeframe for the most part.\n\nOf the original LLs, Skrag is probably the overall easiest because of the map position and lack of any real competition. His Gorger stack got nerfed but there's still other tools to use.",
            "I immediately recruit another Lord the moment the game starts and have them accompany the LL to leech XP. (And for Bretonnians this is good practice, you want 2 Lords accompanying every real stack to get vows done safely early.)\n\nI split them off (read: leave them behind) when I reach a border I don't want to advance further and have them start recruiting a few units to act as a border guard while recruiting another freshmeat Lord to walk around with the LL. Or if I reach say 5k+ surplus they'll also just start recruiting to let me push in another direction with a real army.",
            "I usually do it when I see the opportunity for expansion and I have a way to pay for it. Like if I'm about to hit a crossroads I'll check if I've got enough income to sustain another stack so I can go down both routes. Usually like 3k or so per turn for an early army of peasants, marauders, basic archers, etc. \n\nYou're welcome to play however you enjoy the game of course.",
            "As soon as your economy allows.\n\nYou try to make your army comp around more \"economically efficient\" units. Some faction tier 1 units stay strong throughout mid and maybe late game (ie- dark shards) so you try to build your armies around those units instead of doomstacking expensive T5 units.",
            "Varies by tech and race  Something like Dwarf that is strong in auto resolve I'll just dump in T2 units and let it roll solo for a long time then when my econ hits double my army cost I can look at another army.\n\nBut cheap races, a lot of the time I'll start the second army as soon as the first one is done.  Skaven early game comes to mind.  The moment my LL crosses provinces I start a second army as close to the border as possible.  With them from like turn 2-3 onwards its going to be rolling 2 armies deep (but the units are trash) until I've rebuilt my main settlement and go back to get a real army.\n\nBasically the crappier the units the earlier you do it, and having a second half stack follow your main stack to slam auto resolve is a solid tactic if your econ can fund it.\n\nIf I had to come up with a TLDR I'd say when your turn economy doubles the cost of your most expensive army you're safe to make a new one.",
            "Yeah CA have an official website, forum, and Discord.",
            "I'll keep it to my 2 main pieces of advice I give here. If you have any specific follow-up questions, feel free to ask! \n\n1) It's not save scumming, it's practicing. The best way to learn anything is to do it multiple times. On the campaign map, if you find yourself in a position where you don't fully understand what's going to happen, ctrl + S is quicksave and ctrl+L is quick load. In WH3, battles have a rematch button at the end, and in WH2 there's a quicksave button on the pre-battle screen. Especially if you really think a fight is winnable, try it a few times and test out different strategies. I'll add here that there's no shame at all in pausing to catch your breath or just playing a battle mostly in slow motion. The time manipulation is there for a reason. \n\nAlso, practice is deliberate. Pay attention to what you're changing and what is helping. Try to critically identify which units are performing really well and why. You might win a battle, but if you don't know why then you're likely to lose the next one. \n\n2) Have a plan. Winning a battle starts when you're building the army on a campaign map. To win, you need to deal more damage than you receive, so what are your damage dealers? What are theirs? Are you going to win with ranged superiority? Then you'll need a lot of ranged units and your frontline needs to be optimized for defense. How do you plan on dealing with cavalry that try to flank? What about a dragon? A siege? How will you form up? My usual mid-game dwarf army is 6 dwarf warriors/longbeards as a frontline, 2 slayers in reserve to catch flankers, 2 artillery pieces, and 6 quarrelers and 2 thunderers for damage (non-AP and AP). If I find my frontline is getting out of battles unscathed, I'll cut one or two to pack more ranged units in there. I find a good defensive spot and the artillery makes them come to me, making sure to pick off their ranged units with mine first. The main thing though is that each unit has a role that directly contributes to winning the battle. If I'm playing Archaon, I know my Chaos Warriors/Chosen are slow but unstoppable in melee, so I make sure to have good cavalry support so their ranged units and artillery don't tear me to shreds. \n\nAs a last thing, don't play on easy battle difficulty. Play on Hard and set the AI stat bonus slider to be in your favor. The auto resolve is actually way too generous when set to easy or even normal, so that's why you see close and then fight it out for a pyrrhic. I consider myself a veteran player and if the auto resolve says \"close defeat\" on Very Hard I can usually fight that out to at least a pyrrhic victory.  If I move the battle difficulty down to Easy on that same battle, it will auto resolve a close victory - better than I could do. It's purely psychological, but it sounds like it can help you.",
            "Youtube is going to be the resource I recommend in most scenarios but a few tips.\n\n1) Skirmish mode- By default many ranged units have this turned on and basically once a melee unit runs into range of them they'll run away.  Unless you know you want it on, you should always select all your units and turn off Skirmish mode.  Nothing ruins a fight faster than your damage fleeing formation right when the real fight starts.\n\n2) Control groups-Select unit(s) hold control press number.  Number now controls that set of units. When you have an elaborate tank and gun line and you need to make it move, you can click the little lock in the top right hand corner (of the number tab) and it will attempt to move that group with that relative spacing and positioning.\n\n3)Guard mode- something enters and leaves gun range and you've targeted it while it was in range but you don't want your ranged to chase them.\n\n4) Archers/Artillery vs Gunline-Simple note here. Gunline needs line of sight (up on hill or an opening in the melee frontline to fire through)  Archers and artillery fire in an arc so you can close the frontline in front of them.\n\n5) Run at them vs Defensive line.  I haven't played Chaos but it sounds like mostly a run at them army.  I apologize for the first 4 lines being about units you probably don't use but the combat style varies greatly if your army is full of melee brutes and cavalry vs ranged heavy damage. From the start of the fight you want to organize your army based on what tactics you'll be using into the battle.  You'll generally know based on what you've recruited.  If you're running Grimgor and 19 cards of Black Orcs, congratulations you're running at them.  16 cards of Lotheran Seaguard? line em up and await the charge.\n\n6)Run at them. It'll end up kinda blobby no matter what. S et your formation to have the tanky units hit  the front line and then try to get your damage-dealy ones into the back.  Cavalry you'll want to be in one or a few control groups.  You can send them out first to try to provoke the army to get out of formation, or you may need to send them far around and wait for the clash then bring them in onto the back line.  While lines clash you really need to watch for the ranged in the back that will shred your guys and work to get at them.  A ranged unit that gets collapsed on by melee will be devastated and stop being a problem real fast.\n\n7) Defensive Ranged lines-  You need spacing for guns protection on the front for all of it and a plan for enemy cavalry.  Artillery you need to check the enemy's range vs yours.  If your artillery outranges and out damages the enemy's then you'll force them to come in or get blasted for 1000 years.  Common practices for these armies is to find a corner of the map so that you can't be flanked.  If you set your line in the middle and the enemy has cavalry, they will absolutely seek to flank you and you need to have a formation/plan for it.  A few cavalry goes a long way in these lineups since in order to run at your defensive line the enemy has to travel quite a bit.  Artillery is slow and if you can get behind them you can shred cannons/catapults with your cavalry.\n\n8)Pause button and time slow.  They exist, use them often.  Managing cavalry alone is a lot of micro and on top of all the rest of your army you may need to pause and adjust.\n\nThere's like a lot of stuff, too much to really go into.  I usually build to auto resolve hard, but if I see a fight I'm gonna for sure win, but lose important units, I might fight it anyway to save them.  Those are good fights to learn (really any fight you opt into is) and practice tactics.\n\nAlso I'm a Normie gamer take all this advice for the casual advice that it is.",
            "You can watch some youtube videos of people playing the game on legendary difficulty, and how they fight their battles. There are also a lot of videos on formations and tips for battles etc.",
            "The chorf units are, yes. The hobgoblin units, no.\n\nChorf caps are increased by paying \"armaments,\" which are a resource you can create from a specific building chain. They require \"raw materials,\" which is a separate resource from a separate building chain. The raw material buildings require laborers which are gained from battles or raiding.",
            "Thrones of Decay is very good. Any of them.",
            "You can generally only have one contact effect active.",
            "Crisis isn't what I would call a balanced end game.  It just  spawns 4ish stacks in each area (It might also increase their cap so that those stacks keep getting made, not sure)and leaves you to deal with them.  Ambush, or some really good manual resolves to preserve units, maybe kill multiple armies by rolling up reinforcement points.\n\nMake a big force and punch in. sometimes in crisis you can't protect everything and you just gotta be okay losing some stuff. But pick whatever faction is closest/smallest and when you blow through the offensive just do your best to take out any single one of them.  But crisis is just like that, you go from kicking down everyone's doors to massive fights with multiple armies a whole lot till you crush them out.",
            "Crisis armies are no pushovers, you can't just use your generic stacks to roll over them or take on 2+ stacks with your 1. If it's dwarves, you're going to need lots of armor-piercing and ways to take out their flying units and artillery. Their torpedo units will also be a major problem. For Nakai, this means you need ripperdactyl/coatl units to get on them fast and late game dinos to jump on their dangerous missile units. Magic can be a huge help to you as well.  \n\nIf you've got armies still out there conquering new territory, put a pause on that and focus on stacking up 2 or 3 armies yourself and building up a counter-army to take them on. If they're bringing 4 stacks to every battle, you're simply not going to be able to win against that much force with 2 or 3 of your own.",
            "It's an old bug they fixed and now it is back.",
            "You receive the money right as your next turn starts. So over the end-turn, if you lose a city or some other source of income (like a global bonus from some event or something), then you will run even more negative than predicted and you can get a surprise bankruptcy. \n\nThere's also a bug that used to be in the game where it wouldn't update your income in some circumstances. \n\nIf your bankrupt turn has you starting with zero, then it's one of the above.",
            "Heal units only if you're doing Nehek or something that can actually raise dead entities. Otherwise heal only single entities.",
            "You should heal up single-entity units like your lords, heroes, and giants/dragons/etc. Anything with multiple entities restores all entities to full health between battles. Doesn't matter if you've got like 4 chariots in a unit and the unit is at 10% HP, as long as all 4 chariots are still alive they're back to full once the battle's over.",
            "not actually fixed [https://community.creative-assembly.com/total-war/total-war-warhammer/forums/7-patch-notes-amp-announcements/threads/5532-total-war-warhammer-iii-hotfix-5-0-4](https://community.creative-assembly.com/total-war/total-war-warhammer/forums/7-patch-notes-amp-announcements/threads/5532-total-war-warhammer-iii-hotfix-5-0-4)\n\n***UPDATE 04/06/24 @ 14:35 BST:***  \n*We're aware that the fix to Anvil of Doom melee attacks seems to have slipped through during the hotfix deployment, and are investigating. Thanks for your reports and patience while we look into it, and sorry for any confusion caused!*",
            "Regarding the tearing, have you enabled V-sync? And ensured your GPU settings don't override the game settings?",
            "No.\n\n\nIf ultimate crisis is off then the game will pick 1 endgame scenario at random from the ones you ticked at the beginning of the game.\n\n\nIf ultimate crisis is on it will simultaneously run all the scenarios you ticked at the beginning of the game, but not the ones left unticked. \n\n\nAny scenario unticked should not fire under any circumstances. ",
            "Did you threaten anyone recently?",
            "Death Runners and Plague Monks (and Censer Bearers) are all competent damage dealers even if the roster as a whole doesn't really work with them because the Skaven anvil is underwhelming. You just can't let them get shot and they're among the top arrow priority after maybe Warpfire Throwers on the Skaven roster for the AI to shoot at when it gets its own archers into range.\n\nRat Ogre rear charges suck because they have the usual issue of getting surrounded and destroyed if you aren't shielding them with infantry.",
            "I was more taking about elevation. I had a harder time hiding troops in valleys or behind hills. I was thinking they might’ve nerfed a tiny bit that kind of hiding so they can make more use out of stalk? Or maybe models got taller line of sight.\n\nOr maybe map differences…",
            "Understandable. It really sucks though. It’s making the campaign even more difficult than it already is. There’s no fun allowed in the Chaos wastes.",
            "I think all you'd need to do is use a metal mage there. Plague of rust and final transmutation are great answers to that sort of thing.",
            "ta mate",
            "I kind of backed into that after \\~70 turns of pain in the wastelands, haha. Thanks for the wisdom!",
            "I have that DLC but can't remember if I ever tried Festus so will give that a go. I appreciate the suggestion.",
            "Thats an interesting idea! I do like the 'thought of leeching xp to boost lords and heroes up quicker. I'll have to try that.",
            "hmmm thats probably a lot of my issue. i try and go for the 'best' units asap and make my armies just out of them. I think I have a fear that i'll make my armies too weak to compete if i keep a mix of economic units. (I usually play on hard/hard).",
            "This makes sense. Something like the skaven almost begs to have armies of crapstacks just hanging around. Are there any factions that reward you for focusing on just one army? maybe a horde faction like Taurox?",
            "Sorry, i forgot to put ally recruitment is what i meant",
            "Except flaming attack isn't an actual contact effect so both work.",
            "i had like 5600+ on the next turn and it wasn't added after the turn ended i.e. there was some in the bank the whole time. i just got tired of guessing and added extra money by console command before ending the turn",
            "Thank you pal!",
            "Thank you very much!",
            "in the nvidia control panel only some settings have a use application setting option and those are checked. i don't know what to do about the rest. it is a 3080 laptop btw",
            "No, no diplomacy at all, which is why I don’t get the decline… :(",
            "I mean that if they have a stalking unit that spots you, you won't be able to tell how they did it and it can look like a bug. There's just a bunch of weird stuff like that that I don't usually trust hills to keep me hidden, so we ultimately are agreeing here.",
            "more of a death mage guy; but thanks for tip",
            "It also lets you manipulate the AI immediately by pulling their stacks out of cities. You leave the solo Lord alone right around the edge of the enemy's movement range, then put your main stack in Ambush right in front. The AI will usually take the bait and go after your solo because it looks like an easy kill. At that point you can win the field battle, then get an easy cleanup fight against the garrison separately.",
            "No, even the hordes really want to spawn new hordes as soon as practical to get them started growth wise.\n\nIf you're committed to a single army only for some particular reason, maybe Noctilus and go sail around the world doing pirate shit. The other VCoast can do it but their home territories are much easier to be threatened so you'll need something at home. Even then you're kind of losing out.",
            "Sadly my race puddle leaves my knowledge on this subject quite low.  Though I would say any faction starting with t2 recruiting is at a much higher likelyhood of being the case.  Ironically Skaven has one such faction, Eshins, that starts with T2 slingers.  The recruit and upkeep cost is so high that you basically can't field more than a stack and a half before you're just out of money.  I know Ikit gets props for one of the strongest factions in the game but Eshins has the easiest start IMO of the skaven since turn one he can can just start recruiting decent (by rat standards) units turn one. \n\nAnd yeah I played Taurox once and he felt like he can just roll around doing whatever.  Malakai plays like a horde faction and he's able to \"tech\" up so quickly that he's basically an unstoppable monster before anyone can touch him.",
            "But have you enabled v-sync? ",
            "i tried it both on and off but i realized it's not tearing per se."
        ]
    },
    "Anybody know why the weapon damage modifiers for some things are so low? For instance, +10 in the picture is really nothing and this isn't the only time you see this in the game.": {
        "title": "Anybody know why the weapon damage modifiers for some things are so low? For instance, +10 in the picture is really nothing and this isn't the only time you see this in the game.",
        "score": 465,
        "url": "https://i.redd.it/9q9zdv31m18d1.png",
        "content": "",
        "num_comments": 95,
        "comments": [
            "The real crime is that the Amulet of Pha-stah doesn't give a bonus to speed.",
            "Well 16% ward save is nothing to sneeze at",
            "Pasta Amulet",
            "Most likely because it's one of the items that weren't overhauled in WH2 when someone decided to monstrously buff all +damage effects from items. That one patch that gave us stuff like +100 ap or more from some random drop weapons, which was a debatable idea. \n\nIt's not the only one like this, so it's just one of the many balance issues that specifically make items a complete cointoss in terms of effectiveness.",
            "just use the \"item and followeres rebalanced\" mod. ca has many many many item effects that make no sense and they dont bother to ever do anything about that so u must use a mod.",
            "A lot of stuff are carried over from Wh1 and WH2 to WH3 with barely any changes at all. There's some Common(White)/Uncommon(green)/Rare(Blue) items that are much better than purple items and much more useful.\n\nLike for Example Tormentors Sword that's common or Helm of Discord that's Uncommon. \n\nAnyhow, I think the real benefit of this Amulet is that Ward Save. Honestly CA should focus one update to check every item there is and update them if needed be.",
            "I mean, its an amulet. They primarily provide defensive benefits, such as the ward save. The 10 AP damage is just a bonus.",
            "Why are there so many people in the replies talking about the fucking ward save\n\nDid they only read the first sentence in the title? It has nothing to do with that part. It's about the part makes just barely difference. You could remove the +10AP and you wouldnt notice because how how small of an impact it is.\n\n\"its just a bonus\" lol",
            "Yea. Items are just not given a good amount of thought imo",
            "Well some lords can have multiple items that give flat damage and % damage. All which stack with skill tree buffs. Having a few +10 +20 flat can scale quite well with % damage. If they made it higher like +50 etc it would become insane. This item also gives 16% ward save. Small numbers can count for more than you think.",
            "Powercreep",
            "You can quite easily stack damage on a character.\n\nAnd with all the chariot heroes on TK, the 10 AP damage might actually do a lot of damage when you are cycle charging and dealing collision damage.",
            "Powercreep and inconsistency. Like killing hellebron gives like 50+ ap, but tomb kings were first dlc for tww2",
            "The flat ap damage changes the ap to regular damage ratio making all percent buffs to weapon strength better. On top of 16% ward save this is pretty great item depending on who you can equip it to.",
            "Is 10 a lot?\n\nDepends on context, single entity damage no, unit damage yes!\n\nMy guess is the designers just forgot this is an item for single entities.\n\nBut as others have said, you judge this on its ward save.",
            "Because back then CA's balance guy l, before his stroke, knew how to balance things. This WAS meaningful, this is a very good item. But now that things like dawi throw up 3 runes on themselves for extra million armor etc. design choices were made, yes, things got left behind.",
            "but its an amulet bro 💀",
            "Just some inconsistent design philosophy I'd say. They make some effects super weak and some super strong, which reflects an unresolved tension between wanting characters to be powerhouses or the equals of other units",
            "Lots of items like this chaos has a whole bunch of terrible blue items with single abilities that are usually worse than sword of anti heroes ability. And that has magic attacks too. I have used that item as my base. So been adding enable magic attacks and something like plus 6 melee defense if say it's the rapier of ecstasy. Try to keep it loreful and balanced so for that amulet I would make it like +25 AP damage to make it noticeable. ",
            "Amulet of Hawk Tuah!",
            "Feel like whoever coded this forgot to add the “%”",
            "10AP on a talisman slot is nothing to scoff at, it’s pretty rare to get any WS on that item slot. You are  getting a ward of preservation with some extra AP it’s nice.",
            "Items that give a large chunk of weapon damage are weapons. If it gives bonus weapon damage, it is going to be significantly smaller on non-weapon items.\nGranted I could be wrong so please provide examples saying otherwise.\nI know there is an item to craft by Dwarves that replaces base damage with armor piercing damage. But it is just that, a replacement not a flat gain.",
            "Tbh, that +10AP is still a 6.25% AP bonus for TKs. That's like half a skill point into +WS.\n\n  \nEDIT:\n\nThe highest AP dmg for tombkings has settra, with 330 AP. After that are tomb princes with 260AP, Khalida with 180AP and arkhan/generic tomb kinks with 160AP.",
            "Because it's amulet and not a weapon.",
            "I assume the items are designed with the knowledge you could potentially have certain technologies, other items , augmenting characters, skills and various global buffs active. I dunno, but I’d assume a designer says whats the max potential power you could equip, and tries to balance items accordingly. Just a guess.",
            "If you look at the weapons tab, you will find weapons with +AP dmg. So it makes sense considering the rest of the itemisation.",
            "10 AP on a Taurox charge that impacts 25 (armor > 10) people is more damage than most starting spells. It's all relative.",
            "Because it has a 16% ward save.  Every item doesn't have to be elite in every respect.",
            "16 ward? yes plz\nthe 10 damage isn’t even bad. It’s even AP\n\nthat’s a good 7-13% damage boost against an enemy without armour. Wayyyy higher against an enemy with high armour \n\nand an ability?? (I have 300 hours in this game, but I don’t recognize it) \n\nthat is pretty damn good\n\nagain, around 7-13% damage boost against non armored opponents for a pretty good melee character is good. that could easily turn into a pretty massive boost for a non AP lord against a high armored opponent\n\nedit: or is it? I don’t memorize damage numbers, what *is* the damage of melee lords? I thought it was 100-200 but that seems off\n\nisn’t it like 700? \n\nIf that’s the case, it might still be useful for certain damage thresholds (killing a chariot 1 hit and barely any overkill, v killing a chariot with 2 hits and a lot of wasted damage) but overall… yeah idk\n\nthe other things are probably worth it by themselves. Ward save is amazing",
            "You pronounce the P. It's the amulet of pasta.",
            "Came here to say this",
            "Talk about false advertising",
            "Well I mean for sure, the item itself isn't underpowered or anything, it's just that in the game they have weapon damage modifiers that are so small that they are negligible. It's just odd to even bother including them so I was wondering if they serve some hidden purpose that I'm not realizing.",
            "So if you destroy the item in front of two estalian, they will answer in video?",
            "Helm of Discord is BiS for any Lord meant to play as a meatgrinder.",
            "You don’t have to use any mods actually. You choose to because you don’t understand game design",
            "The amulet is just an example, there are other cases of a flat weapon strength modifier being EXTREMELY small in skills, techs, and other items. I was just curious if I was missing some hidden mechanic or something involving weapon strength or something.\n\nIt should be mentioned though, that CA has been updating some of them to be bigger bonuses like with the Slaanesh tech that gives Keepers of Secrets more weapon strength. It used to be tiny but I’m pretty sure they changed it.\n\nEdit* nvm the wiki says the tech in question, Pained Feaster gives only 15 armor piercing to the Keepers of Secrets, in addition to other effects that are pretty good. But the question remains… why keep the value so small?",
            "Because that's the type of people that frequent this sub. Take that into consideration any time the subreddit, happens to have a sane, sensible take on something. It's not because they are smart, it's because they are a broken clock.",
            "It’s not just items. There are skills and techs that also do/did this as well. I haven’t checked on them in a while though.",
            "% buffs only affect base stats, nkt boosted stats.\n\n\nOnly very rarely does an effect boost the base stat and that will affect the multipliers. ",
            "> Having a few +10 +20 flat can scale quite well with % damage.\n\nI'm getting Path of Exile flashbacks all of a sudden...",
            "Considering that most heroes/lords have around 400 dmg. The added 10 AR really does nothing for the ratio",
            "Depends, spells usually buff base dmg so it shouldn't affect that.",
            "I mean realtive to Tuarox's weapon damage it's 2% of his base damage (500).\n\nEven ignoring that this is a Tomb kings exclusive item, it's kinda weird that the item includes such a tiny weapon damage buff when it's main purpose is defense.",
            "Splash damage is _split_ between targets. If you hit 10 entities with 10AP damage, they'll all take 1 damage. It doesn't matter who you put this amulet on or what you target, it'll never contribute more than 10 more damage per hit.",
            "Nobody said the item was bad, just that the 10 damage is near pointless.\n\nWhy even include the damage instead of giving the item something more interesting? Now it is just about the same as the normal watd save amulet.",
            "Depends, I'd typically think of +-500 weapon strength for a generic lord or hero.\n\nI don't really think +10 AP is worth defending, if it was for a unit of many entities it's a different story then it's good.",
            "Is that why it makes you hit like a wet noodle?",
            "Just a minor added benefit. Not like it's not ap damage so its 10 damage every hit.",
            "That is actually a really good item, 16% ward save is really good, that means you take 16% less damage from every type of attack, so ten AP is just kinda a bone compared to the ward save.",
            "If you think how AP works it is indeed a 10% increase of the amount of damage that ignores the enemy’s armour. It is a remarkable percentage I think.",
            "More like Tileans, Estalians are fantasy Spaniards.",
            "Tormentor Sword. \n\n\nGrey item that stuns everyone in a 50m diameter and gives -25 ma",
            "Bait used to be believeable.",
            "Guess mods that fixes the bugs in 3K aren't valid since \"we don't understand game design\"",
            "I personally don't like mods too and always prefer vanilla gameplay, but this particular situation not in favorite for CA. They really have done awful work with items rebalance that make no sense in most cases. I mean, we have 20% spell resistance common item and blue version that give 15%? or smthng, in the same slot. Numbers may be off, but point is. that we have useless item and somehow more useless item but rarer. I don't understand game design, either some people in CA office, apparently.",
            "![gif](giphy|iSxPmDWr97248)",
            "ahahahahhhahahahahqhq i cant. i really cant. if u ever bothered to take one look at the total imbalance in item effects in this game, u would agree that they are imbalanced with often blue or purple items being worse than generic green or grey ones. u either didnt play the game or are an ca apologist. eitherwise i wont waste by time \"discussing\" further with u.",
            "I'm curious did the people who made mods for features, bug fixes, and UI designs that were later incorporated into the game also misunderstand game design?",
            "Good to know, thanks.",
            "Some caster type heros/lords actually have very weak AP, so this would be a fairly decent buff to them against armoured enemies. \nBut since you don’t generally want those heros in melee anyway, it’s still a waste.\n\nEdit: might be somewhat useful on someone like a chaos sorcerer lord. They only have 120 AP damage so this would be roughly a 8% buff, like a line in a skill tree would give you. And they aren’t horrible in melee\n(I know this is a tomb kings item, just an example from my head)",
            "I was just giving a scale of damage. It's the same order of magnitude as a low level ability. \n\nWhatever the weapon damage, this gets a little bit more past armor. Against armored units of high model count, you can rack up to some small free noticeable damage. Several pieces of gear add 5-10 armor. This covers those gear pieces up nicely. It's not anything potent but it makes sense.",
            "oh, in that case then yeah, actually worthless lmao",
            "Depending on enemy resistances",
            "I believe that was just the point, why is it 10? It's absolutely meaningless. Why can't it be something like 30?",
            "WOW really!!! I bet OP had no idea about that and was totally confused as to what the item did!! It's not like he laid everything out in the title, including the point being near useless modifiers like +10 AP being on items IN GENERAL, the item on the image only being there to serve as an example, and not be the only god damn item he is referring to. Well done for missing 80% of two sentences and completely derailing the discussion!",
            "Thats not at all how this works wtf lol",
            "Far from the only one to be really good, especially in combination.\n\nIf you run an army with at least 2-3 heros+ your lord there is a ton of grey/green item (butcher clever, resplendant armor,..) with zone effect that are excellent.",
            "You can’t even put a coherent sentence together and you think you are in the right. That says enough to be honest.",
            "It is just a side bonus, it looks like there is a spell attached also, but ten ap still helps.",
            "You could also ask why it is there. Ward save alone is good enough, great even. It's a secondary benefit. And it's not like items come with hundreds of ap damage... it's minor for sure, but not meaningless.",
            "10 seems meaningless when thinking about lord on lord or hero on hero combat, but think about the individual hp of a model in a unit of 100 or 120. For example say and entity has 70 hp per model and your hero is smacking them for 33 dmg per attack it will take 3 hits to kill a model but with the added 10 ap your hero is now hitting 36 dmg per her so it’s now killing models in 2 hits. Making it kill a unit much faster\nAnd before you say “well my hero does 400 dmg which is already more then a models health (idk the exact details) but that 400 is getting split up between every model it hits on top of an individual dice roll per individual model. It’s how Grimgor with 800 weapon strength can run into goblins and smack 12 of them, killing 6 right off the bat, sending 3 of them flying and only partially dmging 3 more",
            "Because it already gives a lot of another stat lol. Why are people confused by this?",
            "Do effects stack? I've been assuming auras don't stack, you just get to spread it out across your forces",
            "No, it's not. I really don't understand why are you so stubborn about this. This will probably result in something like 200 dmg through out the whole fight. \n\nThere is a common weapon that adds 45 AP. This is just outdated/poorly designed.",
            "He is not saying you should use one item on all your characters but different ones. Different auras and effects stack, ones from the same item do not.",
            "Would it make you feel better if the 10 ap dmg was just removed? Then it could just be a talisman or preservation with a bound spell.",
            "It’s +10 damage on an item slot that normally doesn’t give any damage. If the item never had that +10 you wouldn’t be complaining about it lmao",
            "Items can be defensive too, why only offense?  16% damage resistance means you can fight for 16% longer.",
            "> There is a common weapon that adds 45 AP. \n\nAnd *this is not a weapon*. Amulets typically don't give AP damage at all.",
            "The point is that 16% ward save is great, the spell is great and the damage bonus is just gravy. It's not a lot, but it's already an incredible item.",
            "But it's not a weapon slot, so any damage is just pure icing on its main purpose. Also it scales with %dmg effects, so an additional 10 can be extremely noticeable depending on how you utilise it.",
            "No, it would make me feel better if there weren't pointless stats on unique items",
            "Yes, I know how items work...\n\nThe point was that one part of this item is useless. It's a legendary item. Why one part of that legendary item is useless?\n\nThere is a blue amulet that gives you 16% WS. A common weapon that gives you 45 AP. The blue variant of that weapon gives you something like 120 or 150 AP. Do you see the point?\n\nHalf the unique items in this game are worst that blue items. Why is this the case?",
            "And you think that the 10ap dmg is pointless, therefore you would actually feel better if it was removed.",
            "It's probably a nice little bonus to use with the 22 second hex  that is -30 armour and -45 missile parry, throw a character into the opposition's best unit and spray with arrows, they'd get melted...\n\nSo yeah +10 melee isn't entirely nothing when combined with the rest of the items ability. To compare a single line blue with a unique weapon is a crazy man, This item combined with most of the spells from the lore of Nehekhara goes crazy my guy...\n\nP.s specifically Usekph's Incantation of Desiccation",
            "Fair point, and that is a question for the devs.",
            "Jesus Christ, Reddit intellectuals never seize to amaze..."
        ]
    },
    "If grimgor can field 4 stacks at turn 15, then Tamurkhan can crush those. Epic battle 10/10.": {
        "title": "If grimgor can field 4 stacks at turn 15, then Tamurkhan can crush those. Epic battle 10/10.",
        "score": 59,
        "url": "https://i.redd.it/ttdzx9mqk38d1.jpeg",
        "content": "",
        "num_comments": 10,
        "comments": [
            "before\n\nhttps://imgur.com/a/3pleWGG\n\nafter\n\nhttps://imgur.com/a/wVxE4NM\n\nmax difficulty settings\n\nOne may say powercreep but considering it was close af personally it felt balanced to me\n\n**Edit:** yes, I agree that Maggot Host is among the strongest factions\n\nMy point is: if 1 faction can field 3 full stacks doubled by waaagh at turn 15 (killed grimgor stack the turn before this fight) then other factions should have some chance at standing ground against it",
            "You lost a unit? Defknit6be reloading that one and trying again ![gif](emote|free_emotes_pack|joy)",
            "always fun when you have the rare moment you actually use your whole army and win narrowly but this is just disappointing how imbalanced the game is becoming. so early in the campaign a half army shouldn't be beating 4 full stacks..",
            "Good job at winning that clusterfuck of course, but lvl 17 lord with 11 units total clapping 4 full stacks is pretty damn powercreepy.",
            "Cute that you think it’s balanced",
            "Should have sent this to Legend mb",
            "If he had a full stack it might be balanced, considering how crap greenskin infantry is, but considering that his whole army consists of some heroes, about 40 chaos warriors, a chariot, rot knights and a beast of nurgle, being able to defeat 4 stacks of virtually anything at level 17 is absurd.",
            "1 LL, 1 generic lord, 1 caster lord, 5 heroes, all decently leveled due to constant fighting, geared with few decent green items and bunch of filler grey crap\n\nThat's half a stack of elite single entities in a faction which relies heavily on those\n\nIf those were dwarf lords and heroes with decent eq I bet it would be even easier\n\nand dearfves unlike nurgle have a lot easier time fielding stacks and leveling provinces",
            "Mortis engine on tamurkhan or not? Ai always throws stuff into a mortis engine AOE that won't actually deal damage",
            "Yeah, mortis on Tamu and second on Chaos Chieftain\n\nAlthough I couldn't rely purely on those due to decent number of ranged infantry they had"
        ]
    },
    "The dwarven Air Force is amazing. ": {
        "title": "The dwarven Air Force is amazing. ",
        "score": 123,
        "url": "https://www.reddit.com/r/totalwar/comments/1dlogrz/the_dwarven_air_force_is_amazing/",
        "content": "Just a quick story that opened my eyes to the powered of gyros. Playing as Malakai, Astragoth launches an invasion with a full 20 stack against a completely unprepared border (already in wars in numerous fronts). Well, I ceded a few settlements to fall back so I could recruit the basics. Got a thane, 3 dwarven warriors, 2 miners (blasting charges) 2 quarrelers, and some grudge settlers (quarreler, slayer, grudge throwers). The last turn before he reached me, I also managed to recruit 2 gyrocopters and the skybomber RoR. His army consisted of a Frontline of tier 1-3 units, mostly t2. His back line was a mass of goblin archers. Auto resolve told me it would be a close defeat but it normally fares better than I do so I didn't feel great but wanted to try.\n\nThe battle starts and the first big swing in my favor was the terrain. I started on top of a hill at the perfect range for my grudge thrower to get some hits in. I focus down his tier 3 units pretty well before they reach my Frontline.\n\nThe second big swing was baiting his lord on a flying mount in range of my quarreler using the gyros. He charged straight after them and then got baited into combat way to early. He had died before our lines were fully engaged.\n\nThe deciding moments came at the line clash however. I didn't want to expose my copters to missile fire so I held them in reserve until the lines were engaged and the missile infantry had started exchanging fire with mine. Fortunately, they deployed their missiles in pretty much a straight line. I took the bomber, lined it up and dropped all 5 bombs on one pass of his missile line. 3/6 instantly routed. 2 of the others were wavering. I then took my missile troops to focus down their last and used the bomber and 2 gyros to fire straight into the backs of their Frontline, which was superior in both numbers and quality to mine.. Ended up being a heroic victory! Probably one of the most fun battles in recent memory. I will now be pausing all offensives to retool every army to include at least one bomber and two copters. Lol ",
        "num_comments": 19,
        "comments": [
            "Gyrocopters were always a cool concept, just borderline unplayable before Thrones of Decay. Gyrocopters used to have 4 instead of 12 models, bombers used to be just 1 instead of 4. CA also nearly doubled their ammo and increased armour piercing damage. \n\n\nAll in all these are my favourite unit changes so far. took two meme units and turned them into serious damage dealers. \n\n\nafter years of avoiding them like the plague it was a very pleasant surprise to see that they finally became useful. ",
            "Gyrocopters are game changers! Never underestimate the power of dwarven air support again!",
            "Well done! That had to feel awesome. Nice job baiting in the enemy lord.\n\nI do think that gyrocopters may work better firing from the side along the length of the enemy's line, if you want to experiment. Dragon breath and other abilities work similarly.",
            "Yeah, while the empire can now essentially play ww1/2 while going up against medieval peasants, the dwarves can now crank up CCR while napalming athel Loren.",
            "The changes they made to Gyrocopters/Gyrobombers were perfect honestly, I always keep 1 bomber(its more than enough, but can go 2 if a battle needs it) in all armies with 2 Gyrocopters(sometimes i use the trollhammer torpedoes one from the Grudge) and honestly they delete stuff easily as long as you distract the enemy units.\n\nThey are very strong but at the same time very weak if they get focused.",
            "Unpopular opinion:\n\nWhile I absolutely enjoy the Gyro changes (increased ammo, entities, engineers buffing them like crazy), I believe CA went a little too far and they are overpowered from a balancing perspective.\n\nYou get them super easily on T2, as well as Engineers who buff them to an insane level (speed, weapon strength, ammo, ammo restocks). In a Malakai campaign especially, you can have a doomstack with 3 Engineers and filled up with Gyros by turn 10, absolutely unstoppable for the AI on any difficulty, because AI can‘t counter them. Malakai‘s campaign ofc also makes this more exponential through the adventure mechanic and giving him additional recruit capacity for engineers in skill tree + an engineer as quest battle reward + gyro buffs through the first adventure you can run.\n\nIf you want easy mode campaign, there is almost no reason to recruit anything else for Dwarfs, I‘m sure its the same for all dwarf campaigns wven if Malakai‘s is „most broken“.",
            "*Warbling Flight of the Valkyries intensifies because the dwarf trumpeters are hung over and on a blimp*",
            "Nothing like flying over enemy frontline with 15 gyrocopters and then bombing shit out of them.\n\nThey are great, saved my ass from Skarbrand raids many times.",
            "Dwarven airforce single handedly saved my ass against the College of Pyrotechnics when they spawned and attacked me a second time. (first time I beat them by reinforcing behind them and using Slayers). Turns out Hellstorms struggle to hit helicopters, grenade launcher cavalry have the \"can't hit air\" trait, and Steam tanks can (eventually) be killed.",
            "I haven't used them since ToD, but I did try gyrocopters in a few campaigns well before the dlc and my god, they were awful. I'm glad they got buffed. =)",
            "Yup, they should always fire from the side because their attack is a straight line one so firing from the side is the perfect way to deal maximum damage to the enemy units.\n\nIt's the same way you use Dragon Breath as you said.",
            "Good to know! I will make sure to do that going forward!",
            "> I believe CA went a little too far and they are overpowered from a balancing perspective\n\nYeah, same here. \n\nWhile i started a Malakai campaign, i thought \"damn, these gyros are crazy good, lemme spam them before the inevitable point where i see why that's a bad idea.\" Except that moment never came. \n\nThey are simply great units that the AI has no idea how to handle or straight up has no solution (chaos factions with poor ranged options).",
            "problem is people confuse overpowered content with good content. when CA releases power creep it makes everything else in the game worse. the new dlc feels good because everyone you fight is just weaker and has less capabilities so why play anything but the overpowered content\n\nI'm sure there will be more fun dlc but the game is cooked from a balance perspective and I doubt ca is going to update every race to get them on the level",
            "I will say I was surprised at how good they were for a tier 2, 1 turn recruitment unit. I avoid doomstacking so I can enjoy their op status without going overboard!",
            "Who gives a shit about balance in SP. I hate it so much when people say balance when it comes to AI ... ",
            "Once I had a good economy, I’d use them to kamikaze melee enemy artillery.  They’d lose but they’d tie up the arty.  That’s how useless I found them - “go die to give me a minute of artillery free fighting”",
            "When a race is unbalanced people without the dlc still have to fight them. Make a throgg campaign brutal.",
            "*watches this guy ride off to Easymodeland*"
        ]
    },
    "A small but sincere hope for the Ogre Rework!": {
        "title": "A small but sincere hope for the Ogre Rework!",
        "score": 987,
        "url": "https://i.redd.it/jxgc4p3mmy7d1.png",
        "content": "",
        "num_comments": 47,
        "comments": [
            "I want our Mournfang boys to look fly! And be safe...",
            "They ate their helmets clearly",
            "I can accept pillaging and slaughter in the name of the Great Maw but I draw the line at wanton contempt for Imperial cavalry-safety laws 😡",
            "I have a lot of hopes for the Ogre Rework. I’m adding this to the pile.",
            "I think there are some mods but they haven't been updated",
            "Take my upvote and let the CA gods view this post",
            "*channels Sgt. Maj. Sixta*\n\n\"WHERE THE FUCK ARE YA HELMETS?\"",
            "What precisely is the helmet protecting on an ogre?",
            "I scrolled past, but then I got joke. Amazing",
            "If this problem applied only to ogres...\n\nJust look at dwarven units. Or Chaos Warriors. Just absolutely stupid. Oh wow full plate armour... with no helmet! Great design /s.",
            "It's the same as helmets for bicycles.  They're uncool, and they'd rather be dead instead of uncool.",
            "Can't eat with the helmet on. Not going to be wearing them. Can't make me.",
            "But then they won't look as cool on their meat motorcycles.",
            "That's the beauty of Ogre helmets, both wearable *and* edible",
            "I really feel like the ironguts are under-dressed. I was expecting Ironguts to look more like how tyrants currently look.",
            "Ogres in general should wear more armor. Everyone is naked and doesn’t make sense",
            "I should check if Dryrain covered this in his skin pack.",
            "They ate them",
            "I just use a mod that adds thier armor to them.doesn’t change stats but it definitely makes me happy to see moutnfang looking proper\n[https://steamcommunity.com/sharedfiles/filedetails/?id=2790094314&searchtext=Mournfang+appearance+fox](https://steamcommunity.com/sharedfiles/filedetails/?id=2790094314&searchtext=Mournfang+appearance+fox) this is the mod",
            "His head was in great condition, it just wasn't attached to his body.\n\nIt's good to have a flat head in The Mountains of Mourn.",
            "It's not just helmets. The card art depicts Ironguts as the riders, but in-game, only Crushers are ridden by them, the Mournfangs are ridden by Ogre Bulls.\n\nIf you changed them to Ironguts, then you'd have to up their stats and the cavalry would jump a tier in cost. Cause you can't have Ironguts model with Bull stats, it'd be a nightmare for visual clarity",
            "Eh, i feel like one or two sure but... i feel like ogres are kinda dumb so them not wearing helmets is perfectly fine, just a bit annoying with the cards",
            "> And be safe...\n\nhttps://www.youtube.com/watch?v=pD-f45TbvEw",
            "So, you want Mournfang cavalry to be upgraded to have Ironguts riders, with the stats increase to match ?",
            "The Imperial cavalry-safety laws are there to protect you",
            "You can accept pillaging and slaughter in the name of the Great Maw?😰😰",
            "Storeslem's Ogre Reskin works, currently playing an Ogre campaign and I'd recommend it.\n\nMost reskin mods work fine post-patch.",
            "the implication is that they are getting a rework in the next dlc.",
            "POH-LEASE THAT CHIN STRAP",
            "Their heads.",
            "My dad refuses to wear a helmet when skiing because in his own words, he hasnt died in all those years he didnt wear one and if he has an accident now he had a good run. Think the ogers have the same mindset",
            "Ironguts eat with helmets on just fine or, hear me out, they have invented taking the helmets off before eating",
            "That's a valid point.  Looks like CA thought that through after all.",
            "They’re relying on organic ablative armor",
            "I think you are drawing lines that don't actually exist. Mournfang/Rhinox Riders are they're own unit. They aren't Bulls or Ironguts. In the Table top the models even had some different armor and other odds and ends. CA has simply the reused assets here. The main difference between Mournfang cav and Rhinox cav is not their riders  but thier mounts. I think the mounts themselves are visual distinct enough for clarity, but hey on that note I'd welcome some white furred mournfang too!",
            "Yes they could",
            "No... I just want them to wear helmets because I think it would look cool. It's a visual choice! I own mournfang models from the table top, they come with helmet heads as options. No stats change needed.",
            "Mournfang cavalry has the third highest armor of an “ogre” ogre unit after Crusher cavalry and Ironguts. They’re only 10 armor behind ironguts, which is easily explained by the unarmored mount itself.",
            "Who said all that",
            "I use all of their faction reskin mods",
            "... nah that's too complex for them, definitely the former",
            "If I recall, Rhinox Rider models were just pretty much Bulls on Rhinoxen, oddly. The champion had a helmet though. Strange, as I think they did count as having heavy armour somehow anyway!",
            "I dunno, maybe I get stuck on that bit, but no matter how it was on TT, CA decided to use Ironguts to represent higher tier cav, and the unit cards art isn't just helmeted Ogres, it's pretty clearly Ironguts !\n\nNow, yes, CA could make a unique helmet Ogre model just for Mournfangs, but that seems like a stretch. Fact is, right now, the only helmeted Ogre model is Ironguts !",
            "Yes, they could. They could also use Flagellants models for Reiksknights, but why would they ?\n\nCA use a clear, simple visual guide for units tier. Ironguts > Bulls, then Ironguts cavalry > Bull cavalry. The point is, the only Ogre models with those helmets are Ironguts, and they are armored to match, both visually and stats-wise.\n\nSo if you pop them on Mournfangs, then you need to give the unit Ironguts stats.",
            "Yeah, ogres were one of the factions where the model did a bad job showing their armour value back in TT. \n\nI guess the Rhinox Cavalry being older models also had to do with it too since it predates 8th edition armybook by a few years.",
            "Ok fine what about just helmets"
        ]
    }
}