{
    "Come smoke with your fellow ents on TreesRadio.com Share your new favorite song, or kick back and find some new tracks. Click this link to join us!": {
        "title": "Come smoke with your fellow ents on TreesRadio.com Share your new favorite song, or kick back and find some new tracks. Click this link to join us!",
        "score": 301,
        "url": "https://treesradio.com",
        "content": "",
        "num_comments": 32,
        "comments": [
            "[deleted]",
            "Damn, y'all are still going? Nice! Used to hang out in the old plug.dj room before that site died. Good on y'all for keeping going :)",
            "I'm probably missing something due to my current goldfish memory, but how do I suggest a song? \"Join waitlist\" doesn't do anything, and it won't let create a playlist 🤷",
            "This is awesome! Streaming it now",
            "How do i chat?",
            "ooo i like this",
            "It stills on?",
            "[removed]",
            "i found a box like this in the street, the usb stick seems clean and filled with syrup.  my guess is some high schooler walking thru dropped it - should i try it?\n\nhttps://www.dogstarorganix.com/product/kic-delta-8-high-potency-disposable-assorted-flavors/?attribute_pa_flavors=orange-creamsicle",
            "[removed]",
            "So you’ll play my songs phor phree?!",
            "Great but on the 2nd song I got video unavailable and can't do anything to switch it, it's just stuck there even if I refresh. This is while not logged in.",
            "[removed]",
            "well i dont know who runs this or what they will do with my email address... so yeah, not going to sign up for some random website. reddit doesnt require an email address, which is why people came here at first. a long long time ago.\n\nso ill just add my request here\nhttps://www.youtube.com/watch?v=j9Dy95C7pPU\n\nbut yeah there are some nice tracks so far! keep it up!\n\nEdit: also after every song the player turns the volume down to 0, so have to babysit it and turn it back up, makes it somewhat unusable unless i am right at the computer. in chrome.",
            "Hopefully this helps :)\n\nhttps://youtu.be/84qIWSRRZM8",
            "Youll have to make an account first, the registration is at the top of the site. You can also watch this video for a [tutorial](https://youtu.be/84qIWSRRZM8) on how to use treesradio",
            "Should be. If nothings playing it might mean noone is in queue atm",
            "Accounts must be over three days old and must have **both** positive comment & post karma before they are allowed to post or comment in /r/trees. Please do not ask the moderators to approve your comment or post, as there are no exceptions to this rule. To learn more about karma and how reddit works, visit https://www.reddit.com/wiki/faq.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/trees) if you have any questions or concerns.*",
            "no thts sketch",
            "Accounts must be over three days old and must have **both** positive comment & post karma before they are allowed to post or comment in /r/trees. Please do not ask the moderators to approve your comment or post, as there are no exceptions to this rule. To learn more about karma and how reddit works, visit https://www.reddit.com/wiki/faq.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/trees) if you have any questions or concerns.*",
            "You are allowed to play your own music but you can’t play only your own music.",
            "Accounts must be over three days old and must have **both** positive comment & post karma before they are allowed to post or comment in /r/trees. Please do not ask the moderators to approve your comment or post, as there are no exceptions to this rule. To learn more about karma and how reddit works, visit https://www.reddit.com/wiki/faq.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/trees) if you have any questions or concerns.*",
            "We don't do anything with anyones emails or data. You dont have to use the site though, or make an account, or use your real email address. It's just how we made the site, 7-8 years ago. It also helps since it slows down trolls a bit. I use chrome too and ive never had that happen or heard of this happening to anyone, are you on windows?",
            "Yeah.. why not discord?",
            "So I could play a few of my songs and then play songs from other artists that I follow on a couple rap apps that I use?",
            "like i understand but here we are... one love!",
            "Discord doesnt have the capabilities [treesradio](https://treesradio.com) has, and we created this site 7-8 years ago before Discord was popular. If you wanna join the discord theres one for the subreddit too https://discord.gg/3WY4ttc",
            "Also, my songs are only on SoundCloud and other audio only apps. It’s a necessity to have a YouTube video for your song, correct?"
        ]
    },
    "You peole are crazy....": {
        "title": "You peole are crazy....",
        "score": 467,
        "url": "https://www.reddit.com/gallery/1dln65z",
        "content": "Visiting vancouver and bought a pre roll  Smoked barely the tip and ended up in my bath listening to the entirety of The Wall blasting on my headphones.\n\nTwice.....\n\nThis shit is weapons grade now.",
        "num_comments": 87,
        "comments": [
            "What is this? A joint for ants?",
            "lol, a CBD joint with 3% total THC. Please be super careful if you end up smoking type one weed. We’ll continue with the weapons-grade metaphor. If the weed one would usually get at a dispensary is a nuke, what you’ve got there is some brass knuckles.",
            "![gif](giphy|6mRA7NS04xSZG|downsized)",
            "![gif](giphy|13VSAbTVuYJfLa)",
            "Finally someone with as small a tolerance as me!\n\nIll take a 5-8 second hit of my vape n be bearly able to move...*i took less than a second a moment ago n its so mich harder to read*. think thats a dyslexia thing, dont think most people get more and more illiterte while high...",
            "Now try dabs. They'll have you fucked up all night. Went to WWE Raw after smoking one and it was a nice, but interesting trip.",
            "I smoked half of a hybrid blend pre-roll. It was 1/4 g worth, and that joint got me so high that I was laughing at myself while I was taking a shower. For no reason. I thought it was weak at first, until my ex walked into the bathroom because I was laughing, to tell me, \"Yeah, you're high as f*ck\" and walk out. 🤣 \n\nI was laughing so hard, I could barely even dry myself off with my towel.",
            "Homie’s out here getting stoned off CBD 🤣",
            "Small, but packs a puncha! Just the “tip”, huh? 🤣",
            "My roomates came back from visiting Vancouver and they can also attest to the quality of BC weed,  don't get me wrong we have good stuff in Alberta but BC weed? Hope you had a good time!",
            "Brother, the last time I was in Toronto I got a .5g pre roll and smoked half of it. I thought I was a person in The Sims.",
            "The wall album is such a fucking amazing listen while high. Especially with headphones that have some sort of spacial audio to them or surround sound stereo",
            "I’m staying in Massachusetts for 2 weeks, bought a pre-roll 4 days ago & I’m almost done haha…",
            "My man gets stoned off cbd",
            "How much did you payed for it? I might try it, but I usually buy the pack with 10 pre rolls",
            "[removed]",
            "IM NIT CRAZY YOURE CRAZY",
            "Jealous",
            "Start low and go slow. The highs are not going to be that good forever so savour it.",
            "I love it 🤤",
            "Man I need a T break reading your post",
            "The math on those millies ain't mathing.",
            "are these the joints for gnomes everyone here seems to be rolling?",
            "Dont listen to these guys.\n\nImagine paying 10x more for a THC strain Just to get same buzz as a guy with no tolerance 🤣👌",
            "Seen these from Michigan before. Not the same brand though. Usually the .5 are the more potent ones in my experiences with them. The 1.2 g infused pre rolls are pretty good too.",
            "lol my wake up",
            "First time I ever listened to the wall was while playing Super Mario Galaxy. Twas dope.",
            "Helluva lotta plastic.",
            "A fantastic driving album",
            "The size comparison of the blunt compared to the tube is crazy",
            "That's a cbd joint. Lol",
            "you're joking right? like you wont actually feel anything from a 2% thc joint this size",
            "They have joints this small?",
            "When u got a meeting in 0,5 seconds",
            "It needs to be at least.... 3 times bigger than this!!",
            "![gif](giphy|OCMGLUo7d5jJ6)",
            "This shit had me chucking to myself for a good 10 seconds 😭",
            "Ha!! Then it's gonna be a wild summer.",
            "I'm old school (like Mexican brick weed,  $80/oz in '98 old school) \n\nI avoid the next gen of 12-22% because... Fax stated. But if some 3/4/5% or a buddy's homegrown (at 7%.. thank you DJ... does the job) comes by... It's nice to be able to do a whole joint with my pretty lady. \n\nJust saying. \n\nProps for the little man.",
            "Idk the entourage effect should never be underestimated. \nI've felt the 'stoned' feeling many more times off what would be considered 'lower potency' about the same amount of times that I've also been disappointed by the effects of some high potency concentrates such as high THC-A crystalline concentrates.\n\nI've actually noticed I feel way more of the typical, happy, hungry, sleepy, just all around 'stoned' feeling with full spectrum live rosins rather than some of the even higher end diamonds that are supposed to be high THC in general, something like 980mg THCA with the rest being straight D9. No traceable CBD. 99% THC pretty much.\n\nBut I digress from my rant with saying that, overall, the joint OP has is way better for him. High THC has the effect of just giving users an undesirable high I've noticed especially cannabinoid naïve people",
            "It's pretty close to being a 1 to 1 so if anything it's a type 2 and not a type 3 CBD strain.",
            "And here’s my ass that’ll take blinker after blinker while smoking a pre roll lol",
            "yeah enjoy it because it wont be like that forever😞",
            "if i take more than a 1 second pull on my vape, and don't blow it out immediately I get RIPPED.  I just started back to using weed a month ago after a 3 year break",
            "I go the other way. I'm a full on idiot until I smoke. Then all I want is to play a puzzle game or do a crossword.",
            "you want to kill this man lol",
            "I remember when we were still a medical state and had ‘indoor cannabis farmers markets’ (RIP god damn). At one I used to go to, these guys would sell me all sorts of wax and stuff at a discount because they knew my dad. They also let me try their stuff, so I’d just sit there dabbing for like up to an hour. I don’t know how I ever walked out of there on two legs lol. ",
            "The super stoned newbie with a tolerance of a toddler...you love to see it.\n\nEdit not calling you a newbie now, I'm referring to what likely went through your roommates head",
            "Does Canada do everything better?",
            "B&O H8's.\n\nI've listened to that album for twenty years and those cans showed me notes and highlights I've never heard before. \n\nStairway to heaven was pretty balling as well.",
            "Accounts **must** meet all these requirements before they are allowed to post or comment in /r/trees.  1) be over three months old; 2) have **both** positive comment & post karma: 3) have over 420 combined karma; 4) Have a verified email address / phone number. Please do not ask the moderators to approve your comment or post, as there are no exceptions to this rule. To learn more about karma and how reddit works, visit https://www.reddit.com/wiki/faq.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/trees) if you have any questions or concerns.*",
            "Irony is that as a youngling I used to haul back the sticky icky, but I'm old and weak now. \n\nAlso I live in very prohibitive country so my tolerance is basement level. \n\nGonna work it back up this summer, one pinner at a time.",
            "No f'n kidding dude! Seems like such a wasteful way to package it.",
            "Tolerance is individual. Most of the herb I smoked between ages 15-20 was ultra low grade brick weed. According to this link, the average THC content of herb in 1995 was around 4%. We still got baked. \n\n https://www.sciencedirect.com/science/article/abs/pii/S0006322316000457",
            "They probably are joking, but some of us are actually really sensitive to THC so that we'd get baked off a joint like this.",
            "sounds like you're capped out on tolerance lmao, maybe t-break sometime",
            "Jeeters are my favorite, mini joints covered in kief.",
            "Mild Summer",
            "Enjoy!",
            "I'm old school too Jonny. I also got all my kicks from bricks for many, many years, and the stuff I smoke nowadays would hit OP like a ten strip out of Bob Weir's personal stash :P\n\n I've always needed it medically though, and the higher the cannabinoids (thx auto spell!), and terps etc the more medicinal it is so, I kept up with the times out of necessity. If you guys like to trip, get a little gram or a preroll of some 30+ % and you'll see what I mean lol. Alternatively, there's stuff like Rick Simpson Oil which keeps the THC relatively low but has plenty of the good Rx stuff if you and the mrs ever need it down the road. It's fairly easy to make at home too (I make it for my senior mother and with how bad her RA is she can't get around w/o it), so if it's legal where you are that's always an option too and I have to tell ya, after so many years of \"pitch n ditch\" being the only thing we could grow, it's awfully nice coming home from work and smelling those babies legally growing at home, and with all the love i want/ can afford to give them. It's a fun hobby if not for anything else, even if they look more like little shrubs than the big ol 7' seedy monsters we used to grow in the woods back in the day that'd be half eaten by the deer come harvest time. These shrubs pack way more of a punch too :D",
            "Then there’s me taking 4 bong rips a session topping it off with a moon rock joint",
            "not w/ that attitude, T-BREAKKKKK",
            "In my defense I went off a long t break and right into trying dabs for my first time, and was okayish. Depending on how it goes he might be okay. lmao",
            "See I think if I smoked that much right off the bat I would've had the worst trip. Just one .4 gram dab got me stoned as HELL.",
            "It was funny because back in those days I was consuming cannabis quite often compared to now! I was using concentrates, carts, flower, edibles, everything I could experiment with! That pre-roll had a blend of various strains of flower I hadn't tried before, and usually I never get giggly. It was a lot of fun! :)",
            "Joints covered in kieff waste of money and product",
            "Oh god please don’t smoke jeeters lol",
            "Cruel Summer",
            "I'm definitely too broke for all that, but I do smoke 3 blunts a night now and the addiction makes me roll another after I smoke the first one cause I feel dissatisfied and as if it didn't count 💀 and after all that, bong hits. And still nothing. LIKE WHYYY.",
            "He'll be OK... ish.",
            "Other than coughing til I almost puked, I don’t remember the first two times I did dabs at all and I had a decent tolerance at the time. Maybe you’re built different cuz I feel like that shit should absolutely send you on zero tolerance lol",
            "Challenge acceptable.",
            "Dude that's fucking awesome! I only experimented with dabs twice: once when I had my first dab (thca) at said dab bar. Then 2 days later at the same dab bar where I bought a gram of thca dab and consumed it all in about 6 hours. It freaked them out.",
            "That's a valid opinion. Just like the people who enjoy them have.",
            "Why?",
            "Any time I'm out west I'm grabbing the baby jeeters all day. The infused .5g prerolls are such a good smoke, flavor and high. Have yet to have anything bad from them, yet I hear often not to buy their products. So what's the reason? I've heard bad lab results on batches(seems like that would happen occasionally when working large scale though) I've heard flavors are added(tastes great, isn't harsh, added to foods and drinks already as well) and just to not support them cuz they're so big (facepalm), so what's a good reason to not smoke them?",
            "It’s a cruel cruel summer",
            "Cool for the Summer",
            "r/stonedswifties",
            "everything in this coment asks for a pause\n\nIf \"fighting addiction\" can't motivate you, then maybe try it \"to give weed its magic back\"\n\n(& idk how much nicotine is in a bluntwrap but for me this substance was one of the key components to lose control back then, the other one was the boredom in the first sober evenings)",
            "he'll have a panic attack but he'll be okay. he's just high.",
            "You probably had friends like mine that forced you to rip them red hot and a quarter gram at a time because “why not?”. Such a waste",
            "They were fun but a pack of five for over 25$ each was too much for me here in AZ. You get them at a better deal where you are from? Our prices can be a bit steep.",
            "I am curious too.  My friend often gives me leftover stash when she wants to take a break.  She gave me a container with what I assume are these \"jeeters\" because I wondered why/how it had keif on the outside (not ideal to christen those joints I learned).",
            "leavin' me here really stoned",
            "I was probably hitting them too hot for sure but really any size dab gets me pretty good"
        ]
    },
    "Where can i order a bong like this?": {
        "title": "Where can i order a bong like this?",
        "score": 728,
        "url": "https://i.redd.it/1x7exu26ez7d1.jpeg",
        "content": "",
        "num_comments": 82,
        "comments": [
            "pretty sure this is AI",
            "No where, this is ai",
            "Smoking like 0.2grams lol",
            "There's not even a place to put your mouth bro😅",
            "You could ask a small business to custom make you something like that. I couldn’t find any Jake bongs though",
            "in your imagination\n\nthe bowl is the size of a pea and there’s no reasonable spot to smoke out of lol",
            "What do you mean a bong like this? This is an AI image of Finn smoking a Jake bong. There is not bong in the picture that a human could operate with.",
            "MATHEMATICAL!",
            "Check the Cartoon Network website :)",
            "He looks like he’s sucking his head wang",
            "This is canon",
            "Jesus Murphy! he killed him and turned him into a fucking Bong?!",
            "lol both of them getting high at the same time. \n\nThat’s the cutest thing I’ve ever seen.",
            "All I can think is that's gonna be tricky to clean",
            "Impracticalpieces.com\n\nCan you even imagine trying to clean that thing?",
            "That’s beyond cute, but it’s definitely AI and not real.",
            "this is very obviously ai generated",
            "Dude just buy a normal bong and smoke like an adult. Seriously what do you want next a fucking rugrats bong??",
            "it is fucking awesome regardless",
            "https://hitimes.ca/products/bose-oner-glass-8-adventure-time-rig-free-banger",
            "Oof",
            "If you watch Erick khan he gets a lot of daily high club boxes and they do have little pieces like this",
            "https://hitimes.ca/products/bose-oner-glass-8-adventure-time-rig-free-banger close enough right?",
            "That or someone's blender creation",
            "Either that, or it's an incense burner. I don't see any of the obvious mistakes AI tends to make in images like this. I say that because I don't see an obvious place to inhale from, unless it's that little spot in front. But that looks very awkward. (But maybe that's the mistake that was made.)\n\nThough when I search for this exact image on Google, the only exact match is this post. So maybe OP is just fucking with us.",
            "This is my first time looking at AI without a mistake I didn't know that was a thing",
            "For some things I can't tell anymore.",
            "It would work really well as an incense burner",
            "But it's possible.",
            "So that means nobody can make it?",
            "lol there’s no way it’s even that big. A Dynavap holds .1g and this bowl looks *tiny*.",
            "Back of his head?",
            "Jake is a shapeshifter so this is actually kinda sick",
            "I mean yeah a Reptar Bong would be pretty cool",
            "That artists made a few adventure time pieces",
            "https://dailyhighclub.com/collections/silipipes",
            "Lmao fucking nightmare fuel",
            "That one scares me tho",
            "Honestly horrifying in comparison lmao",
            "The scariest thing about ts is the price 😭😭",
            "thats like the trend of making the ugliest cake possible for your kids birthday party",
            "https://hitimes.ca/products/bose-oner-glass-6-5-adventure-time-rig-jake-the-dog-design",
            "What the actual fuck",
            "looks like a horrible mouth piece",
            "Lmao holy shit",
            "I figured it was soft glass or something like that.",
            "We have that bong at home",
            "Probably blender. Usually with AI generated images there's *something* wrong or at least a little off if you look long enough, but I can't spot anything.",
            "Where would you even hit it bruh??? Go ahead and make your bong without an inhaling part",
            "No? An AI made it",
            "*Or*, it could be life-sized and it's a HUGE bowl!",
            "![gif](giphy|ukZQTluNqSNPbRhUIM|downsized)",
            "\"\"\"\"\"\"artist\"\"\"\"\"\"\n\nFin looks like he's on something a lot stronger than weed in that piece 🤣",
            "That price is nightmare fuel",
            "Oh, they crazy crazy",
            "Yeah for this money you could get some nice ass pieces",
            "But wowee a free banger!",
            "You'd be surprised, its more advanced every day and prompt designers can craft some almost flawless shit now given enough attempts. Depending on the model, of course.",
            " Bro u acting like they can’t just put a hole at the top of fins head lol",
            "I don’t suppose it could be on the back of Finn’s head or the backpack, but go off.",
            "I just figured they meant a Jake the Dog bong. Jake the Bong, if you will.",
            "Damn bro, doesn't mean he's not an artist. Glass blowing isn't exactly easy.",
            "Wtf lol",
            "Or Finn can just be a holder/stand",
            "Right? Like, we made pipes out of fruit or literally anything else, and he's wondering where to smoke this 🤣",
            "That's just like saying art is subjective. Yes, you're right, but there is objectively bad art. If I wanted to buy a custom adventure time piece presumably for a good chunk of change, I wouldn't want the main character in the center of the piece looking like a demon from my nightmares.\n\nYeah, I couldn't do it, doesn't make it good.",
            "What if I told you art IS subjective?",
            "If there is something objective about art, then it's not subjective, is it? \n\nOr are you saying art is subjectively subjective? Or is it objectively subjective? Subjectively objective?",
            "What if you read the rest of my comment? Like maybe even the next sentence?",
            "It's subjectively objectively subjective \n\n..ly objective.\n\nI hope this clears everything up.",
            "I don't agree with it. \n\nYou would be upset if you received this piece after ordering it custom without seeing the design first. \n\nClearly, other people would pay a lot of money for it, judging by the price. \n\nI don't like it either, but it's not BAD, it's a piece of art I don't like. \n\nEither way, someone who makes \"bad\" art (even if I agreed it's objective) is still an artist, they would just be a \"bad\" artist.",
            "No. Art is subjective either way. \n\nOpinions can be wrong, though. I’ll die on this hill.",
            ">Clearly, other people would pay a lot of money for it, judging by the price. \n\nThis only applies once it's sold, anyone can list a custom piece for any price they want.\n\nI'll restate what I'm trying to say. This art piece is trying to depict characters from adventure time, I believe that objectively it does so poorly for the main character in the center of the piece. Is it still art? Sure.\n\nI wasn't being literal when putting quotations around artist, of course they are still an artist, anyone who makes anything can be considered one.",
            "Okay, how about this. This particular art piece is attempting to depict characters from adventure time. It does so objectively poorly for the main character in the center of the piece. Whether or not it is still 'good art\" remains up to you.",
            "No. You can clearly tell who the characters are, or at least I can. It looks like it’s *supposed* to be a nightmarish interpretation of the characters. Just a different art style. \n\nTo the quality of the glass itself, it looks fairly well made, and easily smokable. Personally I like clear glass pieces myself, but a lot of people out there like their colored/artsy/cartoonish glass and this is something an Adventure Time pot head would have in their collection. \n\nLooking at their other pieces, they look very pricey but also pretty well made so it isn’t like it’s from a bad glass blower. Maybe they just wanted to try their hand at making a cartoon character piece or trying to learn new techniques/styles."
        ]
    },
    "In Japan, the government is currently taking public comments for a proposed THC cap of 0.001% for CBD products, in addition to a potential 7 year prison sentence for having THC in your system.": {
        "title": "In Japan, the government is currently taking public comments for a proposed THC cap of 0.001% for CBD products, in addition to a potential 7 year prison sentence for having THC in your system.",
        "score": 566,
        "url": "https://www.cannabisindustrydata.com/what-is-the-thc-limit-for-cbd-products-in-japan/",
        "content": "",
        "num_comments": 74,
        "comments": [
            "That’s not just strict it’s oppressive",
            "I’m Japanese and I can tell you that if you write to Japanese institutions (like the embassy, tourism department, etc.) with really innocent questions just expressing genuine concern about all this because you are considering traveling to Japan for holiday next year, it will greatly increase the chances of Japan reversing all of these draconian decisions.",
            "What's wrong with just fuckin legalizing it?",
            "I’m sorry, prison sentence for a failed piss test for a substance that stays in your system for anywhere between 1-5 weeks? What if I travel over there and consume no weed while there, but I use it at home in my own country?",
            "Why stop at 1mg might as well ban 1 nanogram or picogram. In fact why don't they just arrest you if you had a thought about THC while using your CBD. Seems reasonable. /s\n\nJapan needs to get out of the dark ages and embrace cannabis. They have a massively over stressed population that has no outlet other than booze.",
            "Whoa..",
            "anyone else just waiting for all these geezers to keel over so we can implement much needed changes to our daily lives? sheeez",
            "Japan just digging their own grave",
            "But why?",
            "That will solve their population problem.",
            "They need that productivity 😆",
            "Japan did not want my tourist dollars",
            "This is the same country where business workers sleep in small cubes and are extremely drunk half the time all while working crazy hours. But go after a plant. Weird priorities.",
            "wow, fuck japan",
            "Conservatives doing conservative shit. People in JP seriously need to start go voting. The conservative minority is destroying the whole country.",
            "I’ve always believed if they legalized it their product would be considered supreme. I can’t imagine the quality of their legal bud if they ever go that route.",
            "under what circumstances would your blood be tested, outside of like a job application or something?",
            "One of the only things I hate about Japan is their outdated stance on weed",
            "Some years ago they also stated that buying some stuff in legal dispo maight be cause to attest of japanese nationals when they got back.",
            "Live in Japan for 16 years, leaving soon (US expat)\nJapan does this 1 step forward, 10 steps back for EVERYTHING.\n\nGG tourism.",
            "But it’s totally fine to drink yourself to death and worship alcohol, weird ass mentality gen x and boomer Japanese have…",
            "What a stupid law. What happens if someone Is from a country where THC is legal, uses It, and after he travels to Japan?",
            "Wow, not even for consuming THC in Japan. So they could test you at customs and arrest travelers?",
            "Damn just having THC in your system could lead to 7 years in prison?\n\n*sad Canadian noises*",
            "Japan is leaning super heavily into tourism post COVID right?",
            "Just because you said that, I sent a message to them about weed. I’m only motivated to do things for weed.",
            "If they will even be this strict with any THC in your system, I'm not sure I'll ever be safe to travel to Japan although I really want to visit some day. I'll probably need to abstain at least a month with some heavy exercise or even longer, because THC stays detectable a long ass time...",
            "My partner and I have been tentatively planning a trip to Japan even though it may not be the most LGBT friendly… this might take Japan completely off our list entirely despite it being a life-long dream of mine to visit. Is there a way I can phrase a letter of my concerns in a respectful way so they’re more likely to be receptive?",
            "Asia has a bad history with recreational drugs.",
            "alcohol industry supremacy that’s why",
            "The likely hood of getting tested as a tourist is slim, if that started happening no one would travel to japan.",
            "It can stay in your system much longer. Especially when you are more leaning into the fat side of body weight.\nTHC is stored in your fat cells and can get back into your blood even months after consuming when you burn that fat.",
            "Dude do you actually think they’re stopping travelers to check for THC levels in their body? Like with expensive and time consuming blood or urine tests? Or they have some kind of advanced THC body scanner at Narita that all foreigners have to pass through?… They don’t. \n\nIt’s like any other international destination. Don’t bring drugs in and out of the country and you’re fine. And if you manage to pick up ($30.00/gram 😂) while there, just be discreet about it. Most Japanese people have no idea what it even smells like.\n\nBeen to Japan twice. Through multiple cities, airports and trains. Weed in your system is a total non-issue. Be more worried about wether you’re traveling during typhoon season.",
            "Damn. Wouldn't be the first time.",
            "Bro I think Japan will be just fine without weed, damn lol",
            "SE Asia just hates “drugs”. Anything classified that way, and is found on you, makes you fucked. Paul McCartney showed up in the 80s with like 8 lbs of weed and they detained him for about a week",
            "I've seen Japanese weed in 70s High Times magazines, it's always been a dream of mine to smoke some lol. This article from Heads Magazine in 2006 is really good - https://daveostory.com/writing-fiction-essays/hemp-cannabis/zen-rambling-in-japan/ I have this magazine in storage, with a couple hundred others from around then.",
            "It won’t be. People espousing their concern probably don’t even own a passport and have never traveled internationally. Getting tested for weed in Japan as a tourist is a total non-issue.",
            "They aren't going to randomly test tourists. Don't apply for a job there and don't bring any weed with you and you're fine",
            "Yes, also because their economy has been stagnant because of population decline. They basically need foreigners to come in and spend money.",
            "Who’s upvoting this? You can travel, just don’t actually bring weed. They’re not fucking giving you a piss test at the airport checkpoint.",
            "Dude do you actually think they’re stopping travelers to check for THC levels in their body? Like with expensive and time consuming blood or urine tests? Or they have some kind of advanced THC body scanner at Narita that all foreigners have to pass through?… They don’t. \n\nIt’s like any other international destination. Don’t bring drugs in and out of the country and you’re fine. And if you manage to pick up ($30.00/gram 😂) while there, just be discreet about it. Most Japanese people have no idea what it even smells like.\n\nBeen to Japan twice. Through multiple cities, airports and trains. Weed in your system is a total non-issue. Be more worried about wether you’re traveling during typhoon season.",
            "Lol you think you have to take a piss test to get in the country?",
            "Reading about the Duterte regime right now. Crazy how he remained popular despite having death squads kicking in doors and murdering children.",
            "Except Thailand. They legalized weed a year ago.",
            "Which is crazy. People of East Asian descent are much more likely to have an alcohol allergy than those from most other areas.",
            "[deleted]",
            "I’m going to travel there next year for important personal reasons. So this has me a little worried ngl",
            "Historically their next move will be to deny it ever happened.",
            "No bro, if they aren’t exactly the same as America they’re gonna die",
            "Japan is East Asia...",
            ">SE Asia just hates “drugs\n\nWell I know that, my point is why so harsh for weed",
            "it’s wild, the birth to death rate off the top of my head is like 6.5 to 12 or some crazy shit",
            "Economy has been stagnant but it’s a mixture of reasons not just population decline. But they don’t “basically need foreigners to come and spend money”. \n\nIncreased tourism efforts were made because when COVID happened it obviously significantly cut tourism revenue. So efforts to bring it back up pre-Covid were made but now that in addition to the weak yen influx of tourist came and Japan is not making it an emphasis as before. Because they leave trash everywhere, disturb geishas, or just vandalized, streets and shit are getting blocked off and menus and admission being charged higher for non-Japanese residents. \n\nEven then tourism was only about 1% of Japan GDP. America has about double that",
            "I live in the Philippines (American btw) and it's crazy how popular he was and still is. Most people dont view him as oppressive. They really support how strict he was against drugs. Most criticism towards him goes against how friendly he was with China.",
            "Well he probably didn't murder the ones who liked him",
            "Yeah but aren’t they reversing that now?",
            "as a us citizen they really can do that?",
            "Dude do you actually think they’re stopping travelers to check for THC levels in their body? Like with expensive and time consuming blood or urine tests? Or they have some kind of advanced THC body scanner at Narita that all foreigners have to pass through?… They don’t. \n\nIt’s like any other international destination. Don’t bring drugs in and out of the country and you’re fine. And if you manage to pick up ($30.00/gram 😂) while there, just be discreet about it. Most Japanese people have no idea what it even smells like.\n\nBeen to Japan twice. Through multiple cities, airports and trains. Weed in your system is a total non-issue. Be more worried about wether you’re traveling during typhoon season.",
            "You’re willing to spend thousands of dollars to go but not stop smoking weed for a month?",
            "Digging their own grave 🤣",
            "Who cares lol",
            "Yes, are you a guest in their country \n\nYou think the Us government is going to get a helicopter and bust ya out like mission impossible \n\nIf you go to jail, you better have family members help With lawyers and law in a foreign country\n\nSo many news in the last 10 years have this example Off being stuck in foreign prison",
            "Yes you can be arrested in other countries. See Russia and North Korea.",
            "I don’t understand how dumb people can be. And you’re even getting downvoted to hell. Nobody testing for weed. You’ll all be fine. You can travel. Just do t fucking carry any weed and they have no reason to suspect you. For the love of god people chill.",
            "As you’re willing to make assumptions without knowing any context. Calm down responsibility constable",
            "I didn’t say I wouldn’t be willing to. This issue wasn’t even something I was aware until I saw this post.",
            "I've quit for a month and still tested negative.",
            "There are countless stories here about people testing positive months after quitting weed.",
            "Yea but they are generally not friendly to America anyway. It might go differently in an allied nation like Japan",
            "“Responsibility constable” is my favorite"
        ]
    },
    "Just a big ol box of purple nugs": {
        "title": "Just a big ol box of purple nugs",
        "score": 200,
        "url": "https://i.redd.it/ybwqwb3wv08d1.jpeg",
        "content": "Latest harvest of red poison by sweet seeds after first wet trim, in the drying tent now and then a month cure! ",
        "num_comments": 28,
        "comments": [
            "purple bud is beautiful.",
            "Purple is my favorite color",
            "Damn near looks fake, I’ve never enjoyed many purps because I found they are either force purps or just dyes. Not saying that’s what this is just saying.",
            "Thought it was a box of lavender lol",
            "what strain?\n\nI am excited to see what granddaddy purple does this year… I hope it looks like the flower you have in your post!",
            "I can smell this picture",
            "Ngl I thought it was lavender",
            "It's so purple it should be asking where's Ronald",
            "wtf is that real??? I have never seen photos of cannabis that purple before 🤯",
            "![gif](giphy|3ofT5ySFXZ01oJ7aoM|downsized)",
            "💜",
            "Ooo how long did that beauty take to grow? That’s such a vibrant and deep purple colour coming out holy moly",
            "Whenever I see images of these I look for some colour changes and there never is any and then I'm reminded how fucking beautiful these plants can be.",
            "sometimes you forget that its a flower and beautiful shit like this reminds you. looks gorgeous!",
            "Looks great is it purple Haze ?",
            "Prettiest bud ive ever seen. r/weedporn",
            "Imagine receiving this bouquet",
            "That's the box of flowers I want to recieve.",
            "Same",
            "This strain has always been insanely purple for me, honestly I like growing the darkest purple strains I can find since it makes trimming easier 😂",
            "Same here xD that shit is beautiful",
            "This is red poison from sweet seeds",
            "Yep check out red poison strain it’s amazingly purple my favorite one to grow",
            "Don’t get me wrong, I’d definitely blaze one with ya! Hope it turns out dank for you! Happy growing !",
            "Wait, why does it make trimming easier?",
            "The picture was good enough already, but with the name, it's even better!\n\nRed poison… It's on my list now",
            "Wow… I just read your post… You name the strain and I didn't even notice… I guess the flower I have is pretty good too! How is the red poison? Is it Indica or sativa dominant?",
            "cut green, keep purple"
        ]
    }
}