{
    "TresslessGPT is now available for free!": {
        "title": "TresslessGPT is now available for free!",
        "score": 15,
        "url": "https://community.tressless.com/t/tresslessgpt-is-now-available-for-free/293",
        "content": "",
        "num_comments": 1,
        "comments": [
            "Details here:\n\nhttps://community.tressless.com/t/tresslessgpt-is-now-available-for-free/293"
        ]
    },
    "June '24 selfies: post hairline photos here for opinions on 'Am I balding?' 'How bad is it?' and 'What should I do?'": {
        "title": "June '24 selfies: post hairline photos here for opinions on 'Am I balding?' 'How bad is it?' and 'What should I do?'",
        "score": 13,
        "url": "https://www.reddit.com/r/tressless/comments/1d5ebrh/june_24_selfies_post_hairline_photos_here_for/",
        "content": "If the date in this post's title seems old, [look for the newest thread here](https://tressless.com/selfie-thread).\n\nUse this thread for **general advice** and to ask Tressless members what they think of your hairline photos and treatment options.\n\nRemember, **If you want good advice, post good photos**: high resolution, multiple angles, good lighting, both wet and dry.\n\n**Mention what changes you've seen**. Some people have naturally thin hair.\n\nIt's vital to take identical photos every few months. Remember that [consistent lighting is extremely important](/r/tressless/comments/fxb0xn).\n\nAge and family history are worth mentioning.\n\nMake sure to:\n\n* check out the site: [tressless.com](https://tressless.com)\n* read the [\"learn\" section](https://tressless.com/learn)\n* read the [beginner's guide](https://tressless.com/learn/beginners-guide)\n* [use search](https://tressless.com/search) *before* asking any treatment questions.\n* ChatGPT Plus users can [chat with the TresslessGPT bot](https://tressless.com/chat) to ask any questions about treatment or their hairline.\n\nYou might not get an answer if your question is too basic or common, because treatment is the same for almost everyone. Nobody can predict if a treatment will work for you.\n\nThis is a community, and you can help out fellow members by commenting under their photos and upvoting people that leave you comments. We're all in this together!",
        "num_comments": 977,
        "comments": [
            "## In addition to the above, if you do decide to start treatment:\n\n### Product finder\n\nLook for products in your area on the [product finder](https://tressless.com/products)\n\n### Progress picture journal\n\nStart tracking your treatment in your own progress picture journal on [community.tressless.com](https://tressless.com/start-journal)",
            "[deleted]",
            "https://preview.redd.it/mmankuhp1w3d1.jpeg?width=1702&format=pjpg&auto=webp&s=e2c10bd165d64ddeec9381fb7cc087f1a5be0a6d\n\nThis is from today, May 31st, 2024. I am 25 years old.\n\nI have been taking the Hims chew 1.1mg Finasteride 3mg Minoxidil 2.5mg Biotin 10mg Vitamin B5 2mg Vitamin B6 100mg Vitamin C tablet since about February 20th of this year.\n\nI also apply a nightly hair mask of Mielle Rosemary Oil.\n\nI buzzed my hair on March 19th 2024, and saw a considerable amount of concerning thinning.\n\nI’ll include the March 19th photo in the sub-comment.\n\nGenuinely preparing for a hair transplant to treat diffuse thinning by the age of 30.\n\nUsed to have incredibly long luscious hair at 22, and now I feel like I won’t have security in my hair until I get a transplant.\n\nWill I see this remaining thinning fill in over the next few months of treatment?",
            "Is my hairline receding? 23M\n\nhttps://preview.redd.it/ha50wld6bx3d1.jpeg?width=1576&format=pjpg&auto=webp&s=a967a4fae6310e15c186d17e137e0d9da127fade",
            "https://preview.redd.it/tgk6tjr27a7d1.jpeg?width=2208&format=pjpg&auto=webp&s=5241eeab154b951359cd1b4f604f55581db81501\n\nwhat should in do?",
            "https://preview.redd.it/a7rdbg4s1b7d1.png?width=720&format=pjpg&auto=webp&s=54777b937352331e6bc17475a7a1bbeda35510de\n\nI am on min 2.5 mg and my chest pain",
            "https://preview.redd.it/1bwttkq0bw3d1.jpeg?width=3024&format=pjpg&auto=webp&s=fa58fc03ed63b7156ee34c64d079039442d2e60f\n\n36. What is my weird balding pattern?  Balding below the whirl.  Doc thinks possible traction alopecia from lying on back too much (had a back injury), but I stopped and hasn't improved.  Is this just MPB in a non typical pattern?  Seems like it'll really screw my chances at a good donor area for transplant.",
            "[deleted]",
            "What is this? Any opinion ?\n\nhttps://preview.redd.it/74idrxg02x3d1.jpeg?width=2556&format=pjpg&auto=webp&s=ed48d56254779ff7060028c0181c648c560d571a",
            "https://preview.redd.it/wtbz9jvb7x3d1.jpeg?width=2448&format=pjpg&auto=webp&s=a298e9ffc6be8a8a45bc6f4f18d45f16a80bce12\n\nBeen on oral 1 mg finasteride and 2 mg minoxidil daily since January. Started microneedling <0.5 2x a week and >0.5 1x a week. Rosemary oil daily, handmade coffee shampoo 2x week and ketoconazol 1x week.",
            "https://preview.redd.it/4imp77t6jx3d1.jpeg?width=2316&format=pjpg&auto=webp&s=e7038c58f399c7641480c7bd6ab511d3cc26c82a\n\nSeparation or thining/balding ? Am I cooked ?",
            "https://preview.redd.it/nwrk9ujy6z3d1.jpeg?width=1863&format=pjpg&auto=webp&s=1081c0f3299ef713a3cea265bb525724aad06668\n\nI am 26M, i felt my hair was thinning when i was 17. I did use min5% and vitamin supplements and keto shampoo when i was 19-22 but wasn’t consistent as there was more shedding.\n\nI wasn’t on any treatment for past 3 years. I will add my fore-head photo in comments.\n\nIs there something i can do to improve now, or is it too late? If there is what are the best treatments to start with?",
            "For context I had seborrheic dermatitis for a few years before I started fin.\nI’ve been on fin for 6 months. On my third month on fin hairfall was almost gone. But a month later it started again and my sebhorreic dermatitis got worse, it didn’t use to itch much but now it does (not all the time).\n\nThree months later hairfall is somewhat slowing down again, but my sebhorreic dermatatis is still going strong. I’ve tried many products, but they dont seem to do much.\n\nI must also note that while my hairfall is slowing down since i’ve started my treatment, the temples are looking a bit worse than before. And some of the hairs that fall in the shower are shedding from the back of my head. \n\nHas anyone here had a similar problem and managed to get rid of seb derm?\nAlso, could the hairfall be part of a shed or could it be related to something else like an increase in testosterone?? ",
            "What's the point of a hair transplant if I need to take finesteride after? is it just a more full proof method? why not just the the meds?",
            "[deleted]",
            "[deleted]",
            "Anybody have an advice for what to try next when min/fin don't work? \n\nI've been using min and fin for roughly a year (.75 mg fin daily and min 1x per day) and while I felt like I saw some progress initially I am still losing hair and not seeing progress overall. Hairline continues to recede and the top continues to thin.\n\nI've come to you to ask if anyone has had a similar experience and found a way to kickstart regrowth by changing their routine in some way. Open to any/all suggestions. Thanks in advance!",
            "Hello,\n\nI’m a 26 y/o male, Indian.\n\nI recently visited a dermatologist as I noticed hair thinning on top.\n\nThe doctor diagnosed me as an early stage diffuse thinner. \nI was recommended PRP over minoxidil/finasteride as a treatment option because as per the doctors they say I’ll have good results based on the stage I’m at without having to play around with my hormones. \n\nI visited another clinic for a second opinion and was again recommended PRP for the same reasons. \n\nAfter a bit of research it seems like PRP has a low success rate.\n\nPRP is not as expensive as it is in the west. \n\nMy question is, what’s the best way forward? Is it worth giving a shot and spending a few weeks over PRP? \n\nAny help is appreciated. Thanks",
            "Anyone got an estimate on how many grafts it would take to give me back visual density? Hair length should be somewhere around 1cm (0.4 inches). Bonus points if you can just point me to a similar case.\n\nhttps://preview.redd.it/b9hc5jtap67d1.png?width=2072&format=png&auto=webp&s=377cd1a51829fecaf5f8282305ab78d62e0b982a",
            "I have previously used Finasteride and few years ago. At that time I was consistently taking 1mg daily for a period of over 12 months. I had come off due to reading excessive anecdotes of side effects on various forums despite not suffering any adverse side effects myself. At this point I need to resume my prescription for Finasteride. I did notice when I was on initially a definite improvement in density but the crown was still thin. I'm also supplementing Vitamin D daily at this time. From what I can tell I don't actually have any bald spots but I do suffer from diffuse thinning. At this stage of hair loss should I consider starting Minoxidil or just resume Finasteride?\n\nhttps://preview.redd.it/ziihl5yyx87d1.jpeg?width=2316&format=pjpg&auto=webp&s=8ea5a8c6321a770eb91f3b72c0005d9221a93e28",
            "17M here, don't really have any other signs of hair loss but I'm a bit worried about my temples. I'm not really sure if I'm thinning or not so I thought I'd check with y'all before i bring it up with my parents.\n\nalso I've always had a bit of a larger forehead btw\n\nhttps://preview.redd.it/5jp0pjf27g7d1.jpeg?width=2448&format=pjpg&auto=webp&s=b55d0c9593157945e3ee08efbc53e34bb75ac20b",
            "https://preview.redd.it/nweexwqwsh7d1.jpeg?width=2544&format=pjpg&auto=webp&s=a0a8a627b1844694d9be97723f4e5fd96778068f\n\n* \n\nThinking I need a reality check, 20m. Pretty sure it's gotten worse over the last year or so",
            "https://preview.redd.it/2vglhhxbbz7d1.jpeg?width=1242&format=pjpg&auto=webp&s=cc7af52dcb544e073c756369dbfa265991f5536a\n\nIs this a natural crown or am I balding?",
            "30M. Noticing some recession of my hairline but overall density seems ok? Maybe fin only? I've been considering it for the past year.\n\nhttps://preview.redd.it/h165ec9wew3d1.jpeg?width=1808&format=pjpg&auto=webp&s=97e1a750181c34941466fd00b846b38f59f23d34",
            "https://preview.redd.it/ch7b6nqk4w3d1.jpeg?width=2316&format=pjpg&auto=webp&s=9c36431100c974c90db15dc4af7d5daa78d9ffca\n\nShould I do something about this? 21 years old. Currently on a boatload of psych meds and not looking forward to having to add hair loss meds. But whatever if it prevents me from receding even more. Older brother (22) also says his hair is thinning and he takes Nutrafol but I don’t think that does anything from what I’ve read.",
            "[](https://www.reddit.com/r/tressless/?f=flair_name%3A%22What%20should%20I%20do%3F%22)\n\n8 months in, fin + min everyday, no visible result. It may even have gotten worse, actually.\n\nGot the initial shedding, I even have much more hair on my face, but nothing on the scalp.\n\nShould I keep going or just suck it up now?",
            "is it possible to make ru58841 solution using pg and ethanol 70% or 50% (my country doesn’t have 95-99 percocet ethanol)",
            "https://preview.redd.it/v40b85us8y3d1.jpeg?width=3024&format=pjpg&auto=webp&s=30ce6d021b6cdd85e78cd964570578421e0cd99a\n\nI’m trying to figure out what’s going wrong with my crown. I’ve been on fin 1 MG daily for 14 months. I dermastamp once weekly at 1.5.  I use Rogaine foam once nightly. I use ketoconzole 1% on a weekly basis.\n\nMy hair is doing great everywhere except the crown. I’ve made huge gains on my temple and the hair is thick everywhere except directly in the middle, as you can see. Really not sure if I need to see a dermatologist or if I need to upgrade to dutasteride, or if I need to stay the course.\n\nUnfortunately don’t have before photos due to losing old pictures.",
            "https://preview.redd.it/man93ef2wy3d1.jpeg?width=1179&format=pjpg&auto=webp&s=b78777fe31e18365c07dfdbbab3ca8fea819f37c\n\nMy friend said my hair was thinning out when he was standing above me under some light , my other friend said he was capping, to me it looks good, I’ve been worried about my hair loss for 2 years and nothings changed, ironically now somebody pointed it out\n\nI’m actually already on minoxidil and plan to get on fin once I stop growing as prevention but is it really that bad",
            "**Very dry and lifeless hair on dutasteride - help!**\n\nSince I started using dutasteride, my hair has become very dry, dull, lifeless, and maybe even thinner, with a weak and brittle appearance. I've tried different conditioners, hydration masks, and even stopped using ketoconazole because it makes my hair even more dry after dut. Nothing seems to work. It feels like I'm using Accutane (I've used it once before).\n\nSure, dutasteride has a stronger suppression of DHT on one hand, but on the other, if my hair continues like this, it won't last long either. I'm considering going back to finasteride, but I'm not sure. Do you think this could adjust over time? My skin is also drier, but that doesn't bother me.\n\nThoughts?",
            "https://preview.redd.it/6opdk8zhjz3d1.jpeg?width=2316&format=pjpg&auto=webp&s=475a9dfe981fc4a01d7777fd0fa6e9c913fa288a\n\nhow bad is it?",
            "https://preview.redd.it/90zucuajrz3d1.jpeg?width=2384&format=pjpg&auto=webp&s=dde99bb9b6b3805e1bdfd6ab8921e790e055fb49\n\nI’m 24, lost some hair around 19-21 and hasn’t changed much in the past 3 years or so. I have some relatives who lost hair early but also take a bunch of meds and used to take more so that might have something to do with it too. Is it too late to regrow hair with minoxidil/finasteride?",
            "https://preview.redd.it/msn7rjiitz3d1.jpeg?width=2316&format=pjpg&auto=webp&s=81bfc279ced09cacd7ed88a558b8873131a18978\n\nIs it too late to start taking medication? I think it’s like a Norwood 3/4. I’m 23 and been rocking the buzz for a while but miss having hair",
            "https://preview.redd.it/4vvw8f7auz3d1.jpeg?width=1576&format=pjpg&auto=webp&s=3faaba94e95f853954e6108497f5b66a54a06b3a\n\nRight side seems to be receding a lot? Still in that phase of only I notice and my friends tell me I’m crazy. Tell me I’m not crazy???",
            "https://preview.redd.it/en6y79a3g04d1.jpeg?width=2316&format=pjpg&auto=webp&s=d3b2bcf82feffcaf68e3b0367b0002c3e51c8b67\n\n18M been shedding a lot of hair these last months and the area kinda hurts sometimes. also to mention many of my male relatives are bald/thinning hair. should i start hopping on some kind of med or oil to stop/reverse while im in time? what about the dosage? Thank you in advance and much appreciated",
            "Paranoia is kicking in. Has the parting widened, or stayed the same? Thoughts?\n\n[https://imgur.com/wPrZThh](https://imgur.com/wPrZThh)\n\nNovember\n\n[https://imgur.com/DHowt1u](https://imgur.com/DHowt1u)\n\nJanuary\n\n[https://imgur.com/GfaGNGT](https://imgur.com/GfaGNGT)\n\nMay",
            "[deleted]",
            "https://preview.redd.it/l83zu5ay824d1.jpeg?width=1242&format=pjpg&auto=webp&s=bb4dd24ae06d6b8d159bf1422209e6f1ef4b1894\n\nFirst time growing hair out. Is it thin or is that a normal part? M26",
            "[deleted]",
            "https://preview.redd.it/fos32lt4o44d1.jpeg?width=1242&format=pjpg&auto=webp&s=3be327cdd59b28ad13fcc5af6fcdcd5ae834866d\n\n19 years old how cooked am I? What can I do? Hairs especially bad when wet(first picture)",
            "Help please! What kind of thinning is this, and how bad is it. Am I late for treatment, I just turned 22.\n\nhttps://preview.redd.it/xnuuzqcig64d1.jpeg?width=1242&format=pjpg&auto=webp&s=73143ddb781a8006bf97ed63d77f29cf6c3adc9f",
            "Help! Annoying red spot not leaving my crown. Currently have been taking topical fin(0.3), min (6) and weekly dermarolling 1.5 since March 24.\n\nhttps://preview.redd.it/8sw081crm64d1.jpeg?width=2844&format=pjpg&auto=webp&s=d5cfe3486c90ace09345fe69114952a8eb78eeba\n\nCurious to also see, is this spot exaggerating my crown, or is it thinning. It’s been there since taking prevention. Any help is appreciated!!",
            "Nothing worked so far and it's getting really thin in the front... So I edited some pictures in Photoshop (with a bald cap on), to see what I'd look like bald. My face is really narrow and I fear that going bald would make me look too much like a skeleton... But I think it's kind of okay, though I got some negative feedback from friends.\n\nWhat do you all think, should I shave?\n\nhttps://preview.redd.it/c7b8smian64d1.jpeg?width=4000&format=pjpg&auto=webp&s=5fa8fa38292fe9dc2d513a6b58ad5c29f04471ea",
            "[deleted]",
            "Am I done? 20M and never grew hair in this region\n\nhttps://preview.redd.it/b1olz5jsy64d1.jpeg?width=1385&format=pjpg&auto=webp&s=139e73ab5a5aa364075b810046e61efcbb870515\n\nOiled my hair and seeing this just made me mentally worse. I have never grown hair on these spots ever and I wonder will things get worse from here? What can I do to get my hairline normal like other 20yos, his has hit my confidence seriously, please give some permanent solutions or suggestions, worse, I have never taken any care cosmetically of myself, no pills, 10 creams nothing on my hair ever orher than coconut oil sometimes",
            "Cause and possible treatments?\n\nI have thinning right above my forehead. I’m also thinner midline down the crown but much more so in front. Seems to run in the family. Anyone know the cause or have found success with hair growth in this area? Topical 5% minoxidil w/dermarolling does not seem to help\n\nhttps://preview.redd.it/qosxw3yf474d1.jpeg?width=1179&format=pjpg&auto=webp&s=68c9d6a5c3cb2bed6f2d548fc2f0a74f2f37a98a",
            "Am I done? 20M and never grew hair in this region\n\nhttps://preview.redd.it/a3g9zkojl74d1.jpeg?width=1385&format=pjpg&auto=webp&s=711c6b57ce24464c17a4250e2b05129d9bc21779\n\nOiled my hair and seeing this just made me mentally worse. I have never grown hair on these spots ever and I wonder will things get worse from here? What can I do to get my hairline normal like other 20yos, his has hit my confidence seriously, please give some permanent solutions or suggestions, worse, I have never taken any care cosmetically of myself, no pills, 10 creams nothing on my hair ever orher than coconut oil sometimes",
            "Minoxidil isn't helping I guess?\n\nSo, This is kind of long journey., \n\nI have been facing hairfall issue for over a decade now, since I was 15. That's when I started noticing hairs here and there, hairs coming out everytime I put my hands through them. That time I didn't have much of a money or knowledge to deal it, So, I looked for what not to do, so, i stopped putting oil on my scalp frequently or washing my hairs sometimes covering them out.\n\nNow after a decade, still I don't have a bald patch but I can see that I have lost reasonable amount of hairs.. and for other people to notice it, that will happen, if I wet my hairs.\n\nNow, during the COVID times i realised that my hairloss is mainly because of pollution and dust that's causing me different allergy and dandruff on my scalp.\n\nSo, fast forward to this year i talked with the dermatologist about it,  and they suggested a anti dandruff lotion and ketoconozole shampoo for a month, so that they can clean up my scalp before starting with further treatment and advise me to wash hairs twice a week, which i usually did( once atleast and twice most. ) now after a month I was genuinely surprised that the dandruff was all gone. So i mentioned this to them and they told me let's start with minoxidil.\n\nNow, I have read some good reviews and stuff about minoxidil and i know that, if your hairs respond to the treatment well you'll see the results on your hairline in around 6 months, and again when you start with minoxidil at beginning you will encounter some hairfall\nBut this is too much, I mean for first 2_3 weeks i thought okay my scalp is responding to the treatment and I'm loosing my weak hairs, but now after a month of using it, i don't see it stopping, further more I see I have more hairloss than I had since the beginning of this treatment.\n\n I was thinking about using only shampoo and lotion for sometime now( a month maybe) and see how it goes... Only issue is I have curly hair, and when they're dry after shower they'll be all dry and look pretty bad and not well maintained, so that's not a good condition either.\n\nI'm not sure about minoxidil, I was using it 1-2 ml before bed, every night till Friday. Any advice for situation?",
            "https://preview.redd.it/y9rrhsurv74d1.jpeg?width=1245&format=pjpg&auto=webp&s=53554c40c197d443a4eaea85b1e864a99ff2f361\n\nHello all this is the current state of my hair. In the past I tried taking about 1.25 mg of fin (a pill of 5mg cut in 4) but was starting to get sexual sides I didn't want to have to deal with. Have been scared to resume taking it so far. I recently started oral minox but not sure if it started working yet. I am exploring a transplant as I hope it'll produce greater results if I get the transplant and keep taking minox. What are you guys' recommendations? Do any of you know approximately how many grafts would restore my hair and possibly lower hairline a bit? Do any of you have a similar situation with fin and switched to lower doses and the sides disappeared ? Do I need to see a dermatologist before transplant or to get further help? How helpful are dermatologists? Any guidance and/or recommendations would be greatly appreciated.",
            "[deleted]",
            "[deleted]",
            "Is my hairline receding at 29?\n\nhttps://preview.redd.it/0aa9r4eng94d1.png?width=1685&format=png&auto=webp&s=dfea9ea1462b1a618874f6f8a150b24e379105b1",
            "Topical Min+Fin combo 2024?\n\nHey everyone,\n\nI'm currently on Minoxidil 5% topical and Finasteride 1 mg oral. When I used this combo last two years, my hairfall was mostly stopped. I stopped for a while and now I'm continuing. I feel like I'm catching up with finasteride's side effects. So, I'm planning to go for the topical Min + Finasterdie solution. The question is, which one should I get? Morr F 5%, Mintop Gain+5, Tugain Men?\n\nMy previous Min 5% was a bit sticky but it dries pretty fast. Also it had nice smell. I heard Morr F smelled horrible. Which one would you suggest guys?",
            "Could I grow these corners back? (22M)\n\nhttps://imgur.com/a/AY80vrS \n\nI started fin 0.5 on may 22nd along with a derma pen once weekly and minoxidil off and on because of skin irritation. Opinions are welcome 😊",
            "https://preview.redd.it/yevol30gka4d1.jpeg?width=2408&format=pjpg&auto=webp&s=c638fa8cfb970352e6e90e8760dc718de3d85c98\n\n19M, am i cooked? Rlly trying to stay away from fin until my mid 20’s but any suggestions what to do from here? I dont rlly have any stress and my father is bald, this has been a gradual hair loss over the last 4-5 years sadly but i’ve finally accepted reality and realized i need to do something about it. The hairline is also receding slowly and just the overall hair density all around has been declicing over the years. Thanks guys",
            "Was prescribed topical foam minoxidil and advised to \"use after shower, sleep with it in and wash it out in the morning\" despite describing strong reactions to all shampoo I've tried as well as constant irritation and dermatitis (which they pointed out to me). \n\n  \nI've had unexplained hair thinning for a while now and the dermatologists cut everything I had down to stress and despite all of the irritations I described as well as the dandruff and flaky areas they just told me to use topical minoxidil which apparently doesn't work well with inflamed or irritated scalps. \n\n  \nShould I try minoxidil out despite this or wait until my next appointment with them in 20 days to tell them this?",
            "does using minoxidil every evening is enough or I have to use twice a day? (haven't started with mino yet, I'm slightly balding in crown and back compared to other sides)\nOr is there any way to avoid greasy hair (since my hair is thin already and it makes it look even more bad)",
            "https://preview.redd.it/91c0tp1s4b4d1.jpeg?width=2316&format=pjpg&auto=webp&s=59cd31689caddf5a10a5f7d338475334c7d77e9a\n\nWhat stage am I, also should I hop on fin + min? I’m 18M. I’ll post a few more pictures",
            "What should be my step to fix this?\n\nhttps://preview.redd.it/dlf8lzaoye4d1.jpeg?width=1698&format=pjpg&auto=webp&s=65b8859361a51453217a2349c86f33f0b831a6b4\n\nMy hairline has declined rapidly, this is after a fre... cut. Barber pushed the line and revealed the right corner that has been fading. My father is bald and so are his brothers, so l get the inevitable, but my mom has full hair, and both my sisters have full curly hair. Just got stuck with my dads genes. Please help, read so many different things and just stressed about",
            "31 male/225 lbs\n\nJust took these pictures. My head is extremely red from derma stamping a little bit ago.\n\nI'm balding/thinning badly on the front/ top, back, and sides I'm odd patterns. It's progressively gotten worse over the last few years.\n\nCurrently have a 3-year supply of 1 mg finasteride and minoxidil foam. Been using both off and on for some months but am discouraged because of no results or it seems worse.\n\nShould I continue using them consistently?\n\nCould this be some type of vitamin deficiency? My vitamin D levels are always low (Recently 11). Also took a gene test that stated my body doesn't absorb folic acid.\n\nCould this be Telogen effluvium? Or caused by medication use (opiates). Had major back surgery exactly  1 year ago (Trans lumbar interbody fusion, Disectomy/laminectomy, facetectomy, and foraminotomy). Delt with severe pain and neurological issues for 2.5 years before surgery, this is when my hair started to fall out and thin. Don't know if it's a coincidence or not.\n\nIs there anything I should be adding to my routine or should I just accept that I'm balding all over my head?\n\nhttps://preview.redd.it/4frhc4f46f4d1.jpeg?width=1440&format=pjpg&auto=webp&s=f837767fa21b22c5dc68144ea1490b7815a52133",
            "I feel like I’m beyond saving at this point. Is it time to give up?\n\nI started minoxidil in August ‘23, and finally added topical 0.025% finasteride in March. I haven’t seen much results.\n\nI also recently saw myself in a [picture](https://imgur.com/a/MF266f3) and was horrified. Maybe it’s due to the rain, but it just looks horrific.\n\nShould I switch to oral finasteride instead? Is there any hope at this point? \n\nHairline in August before I started minoxidil:\n\nhttps://imgur.com/a/fcTnlqO\n\nHairline as of recent:\n\nhttps://imgur.com/a/tb3um4I\n\nWhat it looks like cut short:\n\nhttps://imgur.com/a/jhxieeu",
            "[deleted]",
            "Anything that can be done to stop this at 16? I have had temporal recession since the age of 15 but since about the end of march I have noticed thinning in the front\n\nhttps://preview.redd.it/h98b4ilrjf4d1.jpeg?width=2544&format=pjpg&auto=webp&s=de5dd491ecd54186e097eb511bde9520a4c07bb3",
            "[deleted]",
            "[deleted]",
            "Should I start dermastamping for this hair miniaturization? Fin and min not working\n\nI’ve been on topical fin and min for about 4 years now. I’ve seen the efficacy of both drop over the past 2 years and it’s a little worrisome. I started using Prozac a few months ago which caused a huge shed, I stopped a month in, and haven’t seen those hairs regrow (though it’s only been 2 months so there’s still time)\n\nRegardless I’ve been thinking about microneedling as an added measure, not sure if it’ll help with the miniaturization, any thoughts?\n\nhttps://preview.redd.it/w7l2nak5xh4d1.jpeg?width=2314&format=pjpg&auto=webp&s=a21335ff6d431daa5922798f21caa7261f5c65d9",
            "Is my crown thinning or is this normal?\n\n29M\nhttps://imgur.com/a/6g8yJ8A",
            "https://preview.redd.it/0psvgzt0hl4d1.png?width=1515&format=png&auto=webp&s=67bb98c80c853b775a029864ad212fcec944f151\n\nBalding at 21 as you can see I’ve lost a lot of hair possibly from stress if that helps? Anyway I can grow my hair back thicker and fuller?",
            "https://preview.redd.it/yxx4qr9kql4d1.jpeg?width=1008&format=pjpg&auto=webp&s=1db57841a37325dc722f71ee75a28e2826442496\n\nAm I balding 18m",
            "[deleted]",
            "[deleted]",
            "[deleted]",
            "  Getting really nervous. Am I balding? Just found out I have vitamin d deficiency of 18l my moms family is bald (uncles) but my dad and his side have a full head of hair. My oldest brother is bald but my sister and my second older brother have a full head of hair, they’re in their 40’s too. Except my second oldest brother who’s 49 just started balding in his crown but his hairline is ok. What can I do? I’m not open to minoxidil and fin.",
            "Any point to dermastamp if im on oral minoxodil?",
            "Can I expect regrowth where those little baby hair are? I don't know if I had them before starting treatment, it's been two weeks (micro+fin1mg+min5%)\n\nhttps://preview.redd.it/919g86c0aq4d1.jpeg?width=2592&format=pjpg&auto=webp&s=2443db0e77966822b136c48f559ffff8377e32c1",
            "So I'm gonna turn 19 next month and have been monitoring my hair for 6 months. I've done a lot of research on balding in the meantime and I've realised that there are 3 main areas where baldness strikes ; 1. Hairline, Scalp (diffuse thinning), and 3. Crown\n\nI somehow have hairloss on all 3 fronts. I visited a general practitioner and she gave me vitamin d saches after a blood test and told me to keep taking it and everything will be fine. Ofcourse that was bull\\*\\*\\*\\* so I'm scheduling an appointment with a dermat very soon.\n\nI'm just curious if anyone else has faced thinning in all spots at the same time, cos most posts I see here are people with early stage hairloss in only one area of their scalp. The ones who are bald everywhere are at really advanced stages of baldness. I'm currently at the \"looks fine when not under light stage\". Maybe I'm just trying to cope lol, but I've never heard of this in all of my researching\n\nhttps://preview.redd.it/700d801gar4d1.jpeg?width=3000&format=pjpg&auto=webp&s=078996b016ac4a9a6b9dbecddde86bea2c5b577a",
            "Is it too late to start the fin + min combo?\n\nhttps://preview.redd.it/wf9wim1q1s4d1.png?width=2316&format=png&auto=webp&s=386c667d108468cfb582181f61f2a3eb28fccc1a",
            "[deleted]",
            "Am I balding? I’ve been a sort of norwood 2 by default, and I want to know if I’m really cooked or if there’s something i could do\n\nhttps://preview.redd.it/guwblmwmjs4d1.jpeg?width=2320&format=pjpg&auto=webp&s=026bf4e4b4836173af36fd684dbb971bc15db021",
            "(M27) Hey guys, I needed some advice on what are my best options,  I am on a norwood scale 1, and I am diffuse thinning at the top. My hairline has been on a Norwood scale 1 for many years , it's just the top which is gradually thinning over time. ( I have long hair so it's more visible ) I felt like now is the best time to deal with it. I have attached pictures of my scalp with bright lights and low lights. I am not sure where to start, should I just start with finasteride only ? Or should I add minoxidil with finasteride too ? I don't think I could deal with the daily routine of topical minoxidil considering I have long hair, it would be a pain to keep up overtime. I feel like oral finasteride could be my best option. But I am open to advices , also I live in the UK, would you recemmond visiting a dermatologist who deals with hair first? Or should I just order finasteride online , which websites are good for Finasteride in the UK ?  I do know they would ask for a prescription , but after getting that cleared, which brand of finasteride is good. Same for minoxidil. I do know about hims , but they mix Finasteride and minoxidil together, and I rather not have them mixed , but rather see which works out best.\n\nAny help advice would be greatly appreciated\n\nhttps://preview.redd.it/5mzmaf7bos4d1.jpeg?width=3464&format=pjpg&auto=webp&s=9f3484a00f55cbd6c804e0463bc40dcb350c4660",
            "https://preview.redd.it/bs8rfq8c4t4d1.jpeg?width=2160&format=pjpg&auto=webp&s=c8807413c77a32f61f27b995a6043bc1ed578ea4\n\n(Can take/ post better photos if this gets any responses) I’ve never really had a great hairline and have always had pretty thin hair, just like both of my parents.\n\nDad went bald in late 20s. Mom has auto immune baldness (frontal fibrosing Alopecia). Always thought i would probably go bald.\n\nfor last 2 maybe 3 years i wore my hair pretty long and down in my forehead. Started wearing it shorter again about 6 months ago and in these recent months i quickly realized how much my hair seems to have thinned or receded in the front compared to how it used to be.\n\nI feel like my style does a decent job hiding it but i could be wrong.\n\nMade a derm appointment for Sep to see any options but figured i’d come here and ask what you all think might be good for me treatment wise as i’m uneducated on the matter and all i really know is i should get ahead of it before it gets worse for me, as i’m sure it will only continue to get worse.\n\nIf i’m posting in wrong thread i apologize, first time. Any advice/ comments/ honesty is appreciated!",
            "Been experiencing a little crown thinning and hairline corners receding at 22, and have heard that the sooner I get started the better. I’ve seen some stories about shedding happening for up to 9 months, while I have a cousin who uses just Rogaine and has been regrowing hair after 2 months. Just wanted to ask around and see what everyone’s experience is like here.",
            "https://preview.redd.it/06zab9qrbu4d1.jpeg?width=2316&format=pjpg&auto=webp&s=2e2ef91e178f0d5ebd48007000a5b9378e54d89c\n\nThis photo is from a couple days ago. I am 32 and have noticed hair loss for about two years. I’m at a loss of where to start. I tried minoxidil foam but hated how it made my hair feel.",
            "Further photos in the sub comments.\n\nMale, 25 and 1/2 years old. Been taking the Hims 1mgMinoxidil3mgFinasteride daily chew since February 20th 2024.\n\nCurrently overweight by 60\\~some pounds and working on losing weight, since obesity causes excess DHT.\n\nIs my hairline cooked? I’m saving for a transplant sometime next year honestly.\n\nI have slight pattern diffuse thinning on my crown, it’s thinner right now from a rosemary oil hair mask I put on nightly.\n\nhttps://preview.redd.it/ozcakykfdw4d1.jpeg?width=728&format=pjpg&auto=webp&s=3147701cf196dff5779aedd487d8660cf2b086c8",
            "[deleted]",
            "Is this a thinning crown or a normal cowlick?\n\nhttps://preview.redd.it/j0vqxpwzmw4d1.jpeg?width=828&format=pjpg&auto=webp&s=8f077a21873fdc1a382a7e12005747c517174420",
            "Switch from top. Fin to Oral Fin. I started 5 months ago wirh crushing 21 pills (1mg Fin) into mi 5% Min liduid. My crowns seem to only got worse:\n\nhttps://preview.redd.it/c04cpugnbx4d1.jpeg?width=1179&format=pjpg&auto=webp&s=8772d5822e658c218455be95887f30a9b76946be\n\nPic from today",
            "[deleted]",
            "Any men here experienced extremely low ferritin? Trying to differentiate MPB from iron deficiency.\n\nM38, with shoulder length long hair, in the last 3 years diffused thinning got progressively worse, scalp is now very visible under lights and it's badly thinned out (long hair disguised how bad it was). Hard to tell but looks like mostly losing hair at the top, but no major hairline recession and crown seems fine. 1 year ago I pressured my doctor to get ferritin levels checked and sure enough it was super low (9 ng/ml) for likely \\~15 years. He eventually prescribed an infusion, which got ferritin back to 67 ng/ml a month ago.\n\nI was sure I found the culprit and expected improvement, but after 1 month my hair still hasn't grown back, still shedding like crazy (heaps of hair all over the place falling at the smallest touch, looking awful). Question is - if it's MPB, shouldn't the hair falling out grow back miniaturized? Large parts of my upper scalp are barren, hairs didn't grow back there, only I don't know if that's any indication. I don't want to hop on Fin without cause, but then again if it's MPB I'm losing ground by not starting fin.\n\nI know it sounds like I shouldn't complain about balding at my age when there's 20 year olds ITT at norwood 4, but it still feels helpless and frustrating at any age.\n\nhttps://preview.redd.it/8u0o820w5y4d1.jpeg?width=816&format=pjpg&auto=webp&s=bdf054e35521623947dc6482d0ea7ec9b1082625",
            "https://preview.redd.it/llebdnotby4d1.png?width=3000&format=png&auto=webp&s=650e007b03722475dd4f8b0735cf44bfb0f63b50\n\n  \n\n\n30yo, photo against light, minoxidil only for 3 years without much gains even with microneedling weekly... too afraid to use finasteride, but thinking about giving the topical finasteride a try... but without it, how much time do I have left?",
            "Am I balding or just widows peak/bad hairline? 22yr old male no family history of balding, no vitamin deficiencies.\n\nhttps://preview.redd.it/mbfmhj9sfy4d1.jpeg?width=2316&format=pjpg&auto=webp&s=d9047cd81c81ff8389f97bfcff2952d34b8a2fcf",
            "https://preview.redd.it/lae18l6sgz4d1.jpeg?width=2316&format=pjpg&auto=webp&s=b7f5a130f685e5d0223a832722621642eddf962b\n\nBeen ongoing for a handful of years but seems to have slowed down or stopped. Can it be saved? Looking at different options to try and get it back and wanting opinions. Thanks.",
            "[removed]",
            "https://preview.redd.it/wl95kmtja05d1.jpeg?width=2316&format=pjpg&auto=webp&s=b740b06ffdc612b9e03f8bfa74a55654ce644dad\n\nM24 - I’ve not noticed any shedding, but I do worry that my hairline might be receding. Should I hop on Fin and/or Min? Not really sure if it’s warranted yet.",
            "[deleted]",
            "[deleted]",
            "5 months of Finasteride and Minoxidil\n\nI’ve been on 1 mg of finasteride and 2.5 mg of minoxidil for about 5 months now. I don’t know where my crown was at before since I had longer hair. However, I recently buzzed it and feel I still am not where I want to be. I’m 22 years old and feel I’m the only one out of my friends whose hair is thinning. I know it may not be as bad as others but, I know my hair and know it’s not as thick and full as it used to be. I just wanted to ask you guys what else you do to help make sure you fight hair loss and keep healthy hair (Shampoo, diet, habits).\n\nhttps://preview.redd.it/ha5ctkudk15d1.jpeg?width=1553&format=pjpg&auto=webp&s=e0c17d10035cb759b88c8549bb15571fbe0337a3",
            "https://preview.redd.it/h7h1t8w5c25d1.png?width=2146&format=png&auto=webp&s=9598b04cdbbe2119ee37ae6ca4b54fb582167228\n\nM30, one year on fin, no visual difference. Been a NW3 since my late 10s. I'd like to regain some density that I've lost years before fin, as my hairline, while similarly shaped years ago, was denser at the edges than in the photos. Heck, I'd love to jump down to a NW2 as that would fit my face well. Not interested in becoming a NW1. What would be best to add on top of fin, min or transplant? I'd like to know which one would be, in the long run, a more effective option.\n\nCheaper would be a bonus. While min, preferably oral, might give me more density like it did with my mom, I'm afraid it might not \"unrecede\" my hairline even just a bit. Has anyone had an unreceding hairline on min? As for transplant, I find it annoying that Turkey is the best option, given how much I hate the hassle of travel, and how expensive transplants are elsewhere. I know I could do both, but one step at a time.\n\nNo side effects from fin asides initial brain fog for a month, a shed in December-February, and slightly lower libido, which wasn't astronomical to begin with. Sorry for the last picture, it came out rotated.",
            "https://preview.redd.it/7l6wig7mf55d1.jpeg?width=4896&format=pjpg&auto=webp&s=e5e53491c3e20776853eb636cb4d2c149e74d96d\n\nI had cut my dreadlocks due to the tension on the front of my scalp and it looks like it has thinned out quite a bit and one side of my hair is now receding.\n\nI have been using minoxodil for a few weeks but decided to visit GP today and he has told me I don't need minoxodil and it should grow back. He has suggested rosemary oil.\n\nI am considering derma stamp and oil, what do you think? Appreciate any info related to this :) I'm 28 and my hair is healthy and thick everywhere else",
            "https://preview.redd.it/jda47coio55d1.png?width=2084&format=pjpg&auto=webp&s=9981d556bc8a794c7fc0ec82630d221c7a3d35b1\n\nHair loss or hair whorl please tell me do i need fin and min or is this normal",
            "[deleted]",
            "20M, I could use some help with finding alternatives to Fagron's \"taylor made\" medications\n\nWhile I'm technically NH type 2, my hairline is completely fine, but I have been experiencing substantial thinning over my entire scalp since turning 18. Though it is long and curly, the thinning is getting worryingly noticeable. Now I have tried some anti hair loss shampoos and minoxidil, but it had almost 0 effect. And after taking Fagron's TrichoTest on a doctors recommendation it was confirmed that it isn't very effective on me. But the Fagron proprietary stuff is. Especially their anti-DHT stuff, which almost completely stops hair loss after a few days. The problem is that it costs an arm and a leg to buy their whole package.\n\nI've seen the beginners guides posted here but could use some more personal advice. I could also post the test results and my scalp if need be.",
            "https://preview.redd.it/3mzavncjj65d1.jpeg?width=2316&format=pjpg&auto=webp&s=d8ff09df6446e335e77bd06d6caa03946a2568cf\n\n25 years old. Hopped on Fin a bit over a month ago because my temples have receded considerably in the last few years, and I was worried my hairline in general was going further back. What Norwood would this be considered?",
            "https://preview.redd.it/sdnlzlcqr65d1.jpeg?width=3024&format=pjpg&auto=webp&s=2fe9b79afcbaac6a6a315c0368daa32bccdbf03f\n\nWould minox+tretinoin fill these 1inch wide patches on my otherwise full beard?\n\nI don’t see many hair follicles where the patch is?\n\nAlso, I can’t seem to use more than a couple drops of minox on this patch since its so small. Would this be enough minox?",
            "https://preview.redd.it/wvzrzo6ou65d1.jpeg?width=2316&format=pjpg&auto=webp&s=53ec9b325531ab7fc7466f3a063514b5c8c70b34\n\nHi all - (25M) what are we thinking? Not doing anything currently but I’m open to trying fin and/or min if I actually have MPB. Can’t tell if this is a normal amount of thinning at the crown. I’ll post a pic of my hairline in the replies",
            "https://preview.redd.it/1vzztxl8375d1.jpeg?width=2316&format=pjpg&auto=webp&s=1f5e4c4e3141828c60fc51751129a9b3a2c19fea\n\nI’m done for right? Would rogaine even fix this? This is the front of my head btw, the rest of my skull is still thick and full of hair",
            "I know I'm balding(diffuse thinning; my hairline is perfect), but why is my bald spot line so long, squiggly, and weirdly shaped? Is that normal? \n\nhttps://preview.redd.it/722hxbcak75d1.jpeg?width=2316&format=pjpg&auto=webp&s=6ad93f8ad1bde774d89a0ee53f4627c8deab7fdb",
            "https://preview.redd.it/8sxmmgqdn75d1.jpeg?width=1883&format=pjpg&auto=webp&s=37f85abad07596fd6cd2c55d956b9459184ffa6f\n\nAm I balding?",
            "[deleted]",
            "https://preview.redd.it/avpur84qh85d1.jpeg?width=3024&format=pjpg&auto=webp&s=e86bf19aea1f045ecc496f0945de68c4ca5537ad\n\nHi, I started fin 15 days ago and I was’nt thining like that before, what should I do ? ☹️",
            "I've been taking Finastride for 6 years now and my hair started drying out since I started. Is it because of alopecia or Finastride? What can I do to make them smooth and manageable?\n\nhttps://preview.redd.it/k3s7zbaly85d1.jpeg?width=1631&format=pjpg&auto=webp&s=fee686978b9af082c650620e036aba3099c64e2a",
            "https://preview.redd.it/voflq73wh95d1.jpeg?width=4624&format=pjpg&auto=webp&s=36f8572c1e02cd06a6b319720175003f33d05896\n\ncowlick or hairloss please help.",
            "Best topical Finasteride/Minoxidil solution in Europe?\n\nIm thinking about starting topical finasteride, but in Europe we only have sth called „Fynzur“ which  is way too concentrated (2.275mg/ml). My plan is to do a 0.025% topical Fin, is there an option without having to crack the oral pills to do the topical? Supposing, i used this fynzur to do the 0.025% Fin, could someone pls check my calculations?\n\nAs far as i know, Fynzur contains 9ml (0.05ml/spray burst —> 180 spray bursts in total)\n\nEach burst contains 0.114mg Finasteride, therefore in total 20.52 mg of Fin in 9ml solution. \n\nMy solvent would be 5% minoxidil ( 50mg/ml, in total 60ml in 1 bottle)\n\nSo I take out 6.7ml of the minoxidil and fill in 6.7ml of Fynzur, which would make a Fin concentration of 6.7 * 2.275mg = 15.2425mg/60ml = ~0.254mg/ml (which is approximately the desired 0.25mg/ml.)\n\n\nWith the 6.7ml of minoxidil missing, its concentration would now only be 44.41mg/ml (compared to 50mg/ml before). Does this difference matter in regard to minoxidil‘s effect on hair?\n\n\nThanks for your help!",
            "Hey, 23M here with originally a Norwood 5. \n\nSo I had a hair transplant 14 months ago, good results but I’m still balding so my plan is to stop my hairloss with fin and go for a second HT (for the crown and a lower hairline). \n\nI started taking finasteride 1mg daily 25 days ago. \n\nAfter a huge peak of libido from day 1 to 10, I no longer get 100% hard and I’m no longer horny during the day like I used to.\nEven during sex with different sexfriends, I couldn’t get it totally hard like I used to (maybe 90%) and I was not horny like a was used to. \n\nDoes this side effect go away after some time ? \n\nAlso if i can’t use finasteride is it worth it to go for a second HT ? I still have A LOT of hair falling daily. Maybe embracing my bald destiny is the way. \n\nThanks for reading",
            "https://preview.redd.it/ty1ab6mpqb5d1.jpeg?width=3000&format=pjpg&auto=webp&s=35b077d44d40e6bb51ae1b696cab0d266eb99136\n\nIs it hairloss or just lighting?",
            "How bad is it\n\nhttps://preview.redd.it/pql10wnzzb5d1.jpeg?width=978&format=pjpg&auto=webp&s=4db6c509ad73807d109a50cb5def9c2a81648ad2",
            "https://preview.redd.it/7hh2ez0hkc5d1.jpeg?width=2208&format=pjpg&auto=webp&s=d2fbee8d50ea570bc476c1161bd6f032b997e822\n\nIs my crown thinning?\n\nThanks!",
            "[deleted]",
            "Am I receding , and if so what’s my Norwood grade?\n\nhttps://preview.redd.it/c4x4wjutfe5d1.png?width=1677&format=png&auto=webp&s=ce5c734a5d7641a46b2c5bfdf5708ec2a8324bfd",
            "[deleted]",
            "https://preview.redd.it/6tfrj5npgf5d1.jpeg?width=2448&format=pjpg&auto=webp&s=eff9a0d29c5287c25fdf03093fd70907ec725308\n\nHow bad is it?",
            "https://preview.redd.it/53sp6tdohg5d1.jpeg?width=1576&format=pjpg&auto=webp&s=6b5767076690f600fef8e44e01dff47d773ee4ac\n\nstarted noticing some receding i think??? its very early on and im trying to get ahead of it if i can. would love some opinions and wondering if i should hop on fin/min. lol at the pitstains from stressing abt it 😭😭😭",
            "Early hair loss. \n\nTaking oral minoxidil (1.5 months in) and getting PRP (3 months in), wearing red light mask/cap (2 months in). \n\nShould I also order Hims fin+min spray? I was considering it.\n\nhttps://preview.redd.it/p3gtnqjbch5d1.jpeg?width=2316&format=pjpg&auto=webp&s=effa9a88100716e4aec022a2ffb46b3497228597\n\nNorwood I or II? Thinning upfront.",
            "https://preview.redd.it/n163o1nvth5d1.png?width=1080&format=pjpg&auto=webp&s=8afcf1462ce9d86bfff9000d0d9e94d5bc348864\n\nIs my(18M) hairline receding? I've noticed my hair fall a lot when I shower. My hair growth in general is very quick and they grow thick and curly. But I'm really concerned about my receding hairline because I really don't wanna lose my hair. If it's receding, what should I try? I will start applying onion oil from today if it works.",
            "[deleted]",
            "[deleted]",
            "Is it time for finasteride?\n\nhttps://preview.redd.it/0lus2r15bk5d1.jpeg?width=1242&format=pjpg&auto=webp&s=26958df7d7309bd248bf49e43dee1470bf2c4801",
            "https://preview.redd.it/afp7qwooyk5d1.jpeg?width=1284&format=pjpg&auto=webp&s=c03404db3d262786ae095f8dd935669bfa391057\n\nShould I hop on fin? 20 years old and not sure if just a mature hairline.",
            "https://preview.redd.it/e5sf6qx9il5d1.jpeg?width=1576&format=pjpg&auto=webp&s=b0716a0aa22cf3306df1296e5c5254186efaaa57\n\nI did a full on buzzcut of my hair for the summer. What Norwood is this?",
            "https://preview.redd.it/nrplzujuml5d1.jpeg?width=3072&format=pjpg&auto=webp&s=6dbba021e44a30962bf02926c66709ac639117d9\n\nSome one help, am i really getting bald?",
            "When I was 19, I was prescribed an appetite suppressant called Qsymia, which is a combination of phentermine and topiramate. The last time I've taken Qsymia was in February 2022, and I stopped it at the time due to RAPID shedding. My hair fell out in clumps. During this time, I was taking minoxidil to hopefully help. After seeing a dermatologist, who told me it should come back, I stopped minoxidil to see if my hair would come back naturally. Which it actually did, partially. Today, my hair density on the top of my head is still 50% less than normal. I called VIVUS and they basically told me that at the 7.5 dose, 3% of the sample size who took Qsymia experienced alopecia. They also told me to go to a doctor and go away. They couldn't do anything about it. This affects me greatly, and I wish I knew what I could do. The first picture was of my hair before all this happened; the second was taken in December 2021; and the third one was taken just today. My widow's peak is natural, and I didn't experience any receding. What should I do? Please let me know if this post would fit better elsewhere, thank you. [pictures](https://imgur.com/a/fnVTGH1)",
            "https://preview.redd.it/mnaxqklfql5d1.png?width=1080&format=pjpg&auto=webp&s=ad0a6789c0903adc241867386d6a633263146c32\n\nSome one help, am i really getting bald?",
            "Evening,\n\nI wanted to have this sub's advice on where I should buy my hair loss prescription.\n\nI [30M] noticed my[ hair thinning](https://imgur.com/a/nQyWot1) about a year ago but not until recently did I decide to go to the dermatologist to see what was happening.\n\nHis diagnosis was androgenetic alopecia and prescribed two things for a period of 6 months:\n\n5mg of minoxidil and 0.5mg of dutasteride in pill form, once a day.\n5% minoxidil and 0.05% dutasteride in spray form, twice a day.\nI live in South America and both of these prescriptions are not covered by my insurance and would cost me around $500 dollars.\n\nI'm travelling to the US for about a month in the near future and I was wondering if it would cost me less getting a consult and prescription than in my local pharmacies.\n\nAny input is appreciated, thanks.",
            "https://preview.redd.it/poem6jhtkm5d1.jpeg?width=1170&format=pjpg&auto=webp&s=022b5369b8dbe182982c76a1c0894140d9dbb145\n\nSo I (25M) have been on finasteride 1mg for about 1 year and 6 months and on oral minoxidil for the last 10 months. 2.5mg for the first 8 months and on 5mg for the past 2 months. Balding has halted but regrowth on temples has been minimal with vellus hairs visible in a certain light. My question is would I potentially see more regrowth switching to topical minoxidil and adding dermarolling perhaps? Would switching forms change/halt/reverse the growth that has occurred ?",
            "https://preview.redd.it/3hw1kcqqqm5d1.jpeg?width=1980&format=pjpg&auto=webp&s=ae45a57ce87c375e2992788d834daa142b465d2c\n\nAm i starting to bald? ):  M19",
            "https://preview.redd.it/cxob6fo3vm5d1.jpeg?width=3024&format=pjpg&auto=webp&s=907c9759d95b443e4c9a6ed5cfe3a8a560156af6\n\n18m my right corner was always receding a bit but I have noticed more prominent receding this past year. Is the hairline maturing or balding? What should I do 😭?",
            "[deleted]",
            "# Shaved my head completely. What can I do to improve my hair for the future?\n\nM20. My hair is pretty thin, and before shaving I could see a good amount of scalp through my middle part. What can I do to make sure that when my hair grows back, its thicker and less of my scalp is visible? I previously tried dermarolling + minoxidil (not long enough for results) and these methods were both somewhat troublesome due to my hair length, but now I can easily do both. What else should I add to my regimen?\n\nAlso, should I use minoxodil + dermaroll on my entire head or just in the middle part / crown area where I was seeing scalp w/ my previous hairstyle?\n\nThanks.\n\nhttps://preview.redd.it/scinwfj5io5d1.jpeg?width=750&format=pjpg&auto=webp&s=7d3e81880ae99d84a88d415faa105db3abcd44b2",
            "Can someone please take a look at those pics and tell me if my hair is receeding?\n\nhttps://preview.redd.it/dmycurjiop5d1.jpeg?width=1512&format=pjpg&auto=webp&s=d58560f6621708bd33d43b969ddce8708e637263",
            "Two months on topical fin 1mg 3 days per week, 5% minx2 per day, 2xper week ketoconazole, microneedling 1mm once per week. Do you see a difference?\n\nhttps://preview.redd.it/ln2q2b611q5d1.jpeg?width=1600&format=pjpg&auto=webp&s=30c59cee14d6ce401eb70e5988469887d4ee872b",
            "Got a male hormone blood test done last week as I'm about to start finasteride and want to see my baseline Testosterone and Estrogen levels. I had my blood taken at 14:30, not being aware that it should be done in the morning. Is this still okay for my baseline reference? Cheers.",
            "https://preview.redd.it/ld7tbp9ruq5d1.jpeg?width=1200&format=pjpg&auto=webp&s=1f01ee6331b4557f15922420699c78794a808806\n\nHair thinning around the crown. Doctor recommended Min 5% topical twice a day. Started it 15 days back. He also gave me 3 tests CBC, LFTs, and Vit D test. And asked me to come after 2 months, so he may prescribe another med, maybe fin?   \nShould i just go to my Dr now and ask him to prescribe finasteride, without wasting any more time?",
            "https://preview.redd.it/52bzdrx2nr5d1.jpeg?width=2316&format=pjpg&auto=webp&s=8979a4ada651f884cfeba1694629c6713a7341a2\n\n[What Norwood Level am I? 26M)](https://www.reddit.com/r/tressless/s/M2kcjvE7V4)",
            "[deleted]",
            "https://preview.redd.it/h56gnowz9s5d1.jpeg?width=1242&format=pjpg&auto=webp&s=d2439731e63c8e3ef2507eab5cf852018e2ed8ec\n\n26 years old- can’t really tell if I just have a big forehead or if I have recession. My hair looks so healthy but my forehead is large.\n\nI’ve been growing my hair out for a while and it’s reached new lengths so not sure if it’s an optical illusion or if my hairline is actually moving back suuuuper slow. I’ll post more pics in my replies to myself.",
            "[deleted]",
            "I've been on finasteride for nearly 3 years and up until recently it has worked a dream on me. About 3 months ago I had to change where I got my finasteride from due to being abroad for work.\n\nAlmost instantly after making the switch, I noticed my hair was falling out more than usual. And so, after about 8 weeks of being on my new finasteride I switched back to my original finasteride as soon as I got home.\n\nIt has now been another 4 weeks since then, and I have been regularly taking my original 1mg of finasteride daily. Yet, I am still noticing a lot of hair fall (although, notably no signs of thinning just yet). The rate at which I shed in the shower or just combing my hands through my hair is worryingly reminiscent of how bad it got when I was thinning pre-finasteride.\n\nI have heard about a synchronised shedding cycle occurring after 2-5 years and about how switching between generic and branded finasteride can cause a loss of effectiveness. But I'm also wondering, has finasteride just stopped working on me?\n\nWould love some advice on my unique situation. If it is a shed cycle or the generic/brand thing, how long should I wait to see if the situation fixes? Thanks!",
            "Hair treatment suggestions? 27\n\nHonestly was in denial for a while couple months back went to dermatologist and told me to get on minoxidil… I tried topical but my ADHD ass struggles to do it twice a day and makes my hair feel gross after.\nWhat would y’all suggest I go on? \nI get worried about side effects of other medications like fin cause my hair already makes me depressed 😂… but now seriously considering something like fin cause fall out each day is crazy… also I’ve done my own research and feel I have seb derm and experience the most fall out when my scalp feels inflamed/itchy and flaky\n\nAnything y’all have done that has worked would be helpful… thought about going on copper peptides… using tea tree oil, rose Mary oil. Exc…. But don’t know where to truly start",
            "Should I start minoxidil or wait for finasteride to take effect?\n\n\nHello everyone, I am a 22M, and in November 2023, I began experiencing a period of Telogen Effluvium following a health problem. From November to February, I was losing hundreds of hairs a day, including from the sides and back of my head, as well as eyelashes, eyebrows, and body hair. Starting in March, this drastically reduced, and by the end of April, the hair on the sides, back, and top of my scalp had regrown even thicker than before. During these months, I had blood tests done and treated deficiencies like Vitamin D and increased my protein intake.\n\n\nNow, the problem is that since the end of May, I have noticed a new increase in hair loss concentrated in the crown area. Yes, it had thickened but never returned to pre-TE levels, in normal daylight it doesn't look like it's thinning. Similarly, the corners of my hairline, especially the left one, never recovered and looks like a thinning Norwood 1, while the right one had improved a bit but is at least a thinning Norwood 0.5 (I consider Norwood 0 to be the hairline I had before November 2023, which hadn't changed since I was a child). That being said, I am almost certain that the TE episode has unmasked male pattern baldness, which I would have noticed much later.\n\n\nIn a couple of days, I have an appointment with a dermatologist/trichologist during which I would like to ask for a prescription for finasteride. Do you think it is enough to stop the hair loss and perhaps thicken both temples to almost pre-TE levels, as well as the crown? Or should I also start using minoxidil at the same time? I would prefer not to, as I have three dogs who mean more to me than my hair.",
            "Noticed my hair falling out should I get on hims topical spray or something else. What do yall think? Last picture is towel dry.\n\nhttps://preview.redd.it/413cpll5nu5d1.jpeg?width=3024&format=pjpg&auto=webp&s=2e00a61e1a43456b2a0b2d4f7718217cf583420e",
            "My hairline has always been bad In the temples but ngl from the front is mainly fine,  but my crown is crazy bad. (23m) Been on finasteride before 2022-3 but discontinued due to financial reasons. Been on fin again for a month or so now, my question is, am I cooked ? XD\n\nhttps://preview.redd.it/z9wlwneftu5d1.png?width=1080&format=pjpg&auto=webp&s=afd46813cae169e147f513dfd00adb85bccf5dac",
            "Am I cooked? Left side might be starting (22M)\n\nhttps://preview.redd.it/85vawmhsbv5d1.jpeg?width=1242&format=pjpg&auto=webp&s=0618c431b4e6006254f1cb8d30257ed2bb39f038",
            "I took the Hims Min+Fin (.3% Fin, 6% Min) spray for a week at recommended dosage (4 sprays) and developed breast pain and nipple sensitivity as well as an ache in my right testicle. I stopped and the sides ceased after two days. Now I'm debating whether I should dilute the spray and try again or just go with only Minoxidil instead. I'm 23 with a Norwood 3 hairline and very little crown thinning which looks like a normal whorl.",
            "Is ketoconazole enough to stop diffuse thinning caused by dandruff? That’s what my derm says, but I feel too far gone.\n\nhttps://preview.redd.it/1hae5gpapv5d1.png?width=1849&format=png&auto=webp&s=e08f55036cf33286060c7ea12b507a5d13fe3adb",
            "[deleted]",
            "Hi all, just looking for some advice. \n\nContext: I'm a norwood 3 and just recently started on only 5% minoxidil. I usually only apply it on the receeding sides as those are the only areas that seem to be thinning/receeding. Whole I've heard a lot of success stories with minoxidil, I just can't see myself applying it every day for years to come (I'm 23). Moreover, no one in my (big) family has history of balding, just thinning and nw3 recession. \n\nThis brings me to these two questions: \n- if I decide to continue, is the way I've been appllying min correct? \n- if I decide to stop, will hairloss be accelerated because I started on min already? \nThank you in advance!",
            "[removed]",
            "[deleted]",
            "[deleted]",
            "So I’m starting oral minoxidil in 2 weeks to help my beard connect. If it doesn’t work within a year, I’m going to get a beard transplant. Roughly how many grafts do y’all think I’ll need to fill it in? (Same type of gap on both sides)\n\nhttps://preview.redd.it/k7w9x9ikxx5d1.png?width=718&format=png&auto=webp&s=91719d2a6c85258cd50389bd829c9b0b5cdad1c1",
            "https://preview.redd.it/kt4es3ehey5d1.jpeg?width=2316&format=pjpg&auto=webp&s=572f562d9553587198d3911b97eeb7baadbb239b\n\nhey guys, i’m on minox since January, is this regrowth? I don’t have before pics of the hairline since my focus was the crown",
            "https://preview.redd.it/gba76sxzyy5d1.jpeg?width=3840&format=pjpg&auto=webp&s=db6f9b2eba3abea15b724c3c674f703dbf61581c\n\n21M My hair is such a confidence factor for me, and I've noticed at the back of my head which I think is balding and I don't know what to do. What products or what should I be doing? I also noticed my hair is thinning out",
            "https://preview.redd.it/d79nndvy7z5d1.jpeg?width=2316&format=pjpg&auto=webp&s=4242c3ed67aa25bf789a21fd03890cbb0b22b166\n\nHow cooked am I? Seeing a dermatologist next week.",
            "https://preview.redd.it/vbydozdx9z5d1.jpeg?width=691&format=pjpg&auto=webp&s=c60dbf9d947668788b4729e546915a84a839598a\n\nCan I be saved? 😫",
            "https://preview.redd.it/mxdlfk7caz5d1.jpeg?width=3024&format=pjpg&auto=webp&s=1eb79762d1b4a61b987a61a99907bd97107d2b4f\n\nCan I be saved? 😫",
            "Hey everyone I need some advice.\n\nI think I am going to start going on min and fin however I have a problem relating to whether should I start now if I am going to a wedding next month. I have heard minoxidil causes shedding of the hair and obviously, I don't want to go to a wedding and get photos taken while in the deepest part of the shedding phase so what are you'll guys' thoughts or suggestions should I jump on it now or wait until after the wedding to start treatment?",
            "https://preview.redd.it/2k85t8ejmz5d1.jpeg?width=2316&format=pjpg&auto=webp&s=ef97e325434c8964216a6fe3de3a1aab82f28580\n\n23M noticed hairline receding/balding near crown at 21. Went on Rogan foam for 2 years. Switched to 2.5 mg minoxidil pills daily and added 1 mg finasteride in addition to biotin pills every morning. Also started using 2% ketaconazole shampoo daily (which I heard may be too much) and derma-rolling .5 mm near hairline a couple times a week. Any advice?",
            "Hey guys, I need your advice on if finasteride alone would be enough for me. Have been slowly losing hair now for about 2 and a half years mostly on my right side. I'm now at that stage where I wanna try to do something about it. It's bothering me alot so i buzzed it shorter. My hair length is currently about 1.5 mm so the recession is a little harder to see but it's more on my right side. I'm also only 21 so if that would have any effect for better recovery.\n\nThanks!\n\nhttps://preview.redd.it/3rc84pgxqz5d1.jpeg?width=3456&format=pjpg&auto=webp&s=75cb0fd2b77a125242e44cfdb4085e72992501c4",
            "I don't want to take fin because of the side effects. Can I still make good progress without it and if so what would be the stack?\n\nI'm not willing to risk any sexual or, worse, psychological side effects. I know it's a small fraction of the people who get fin that experience those. But I went to see my doctor, and since I have a history of severe depression and suicide attempts, he said fin wasn't an option because it's too dangerous. So I have a medical point of view which forbids me to take fin. \n\nSo my question is, is there a stack I can still use to have results or should I give up?",
            "[deleted]",
            "https://preview.redd.it/a1qkqvnem26d1.jpeg?width=2316&format=pjpg&auto=webp&s=4d169931bca6968c6dd0415d76d6adbb49e38e34\n\nI oiled my hair and this is what it looks like standing under a light… is this a sign of concern?",
            "https://preview.redd.it/zc4gm8sfq26d1.jpeg?width=1200&format=pjpg&auto=webp&s=838c42547369f611ebf179d29c164aadaf6ff4a5\n\nWhat even is this dude....",
            "https://preview.redd.it/etj98qfco46d1.jpeg?width=1836&format=pjpg&auto=webp&s=824ea6f832c0fc420cad28d124e1645706a21fce\n\nHey M29 from EU,\n\nI know, it is not that bad (yet). But over the last two years my hairline started receiding. It does not bother me to the point that I considered starting any treatment, but still, as I always had really thick hair, it is not great either. It does not look that bad from the front, but from the side you can really see the hair falling out. I am considering a Buzz Cut and full beard. Or do you think just cutting the sides shorter would help too, as I still have a lot of hair on the top? Or is there another hairstyle that could suit me?\n\nPeace",
            "https://preview.redd.it/nzq1j7ht356d1.jpeg?width=4032&format=pjpg&auto=webp&s=7bf8c165d500a9238e1ff389809525bbab4aa9ec\n\nCombing after 4 days, curly hair , shoulder length. Is this normal ???",
            "Question... when should one use, fin vs minox or even dut? \n\nI see some say fin is good to stop hair loss and regrow where hair loss happened, but minox is good for regrowth too. \n\nIs minox good for regrowth in new areas or the same area? What's the difference?\n\nWhat's best for regrowing OR maintaining the hairline, corners, vertical bars and c cups (edges)?",
            "https://preview.redd.it/pm8xnjc8066d1.jpeg?width=1674&format=pjpg&auto=webp&s=31a0f53e3cba9519d31fb46a635bfecf3f392918\n\nWhere would you categorise this on Norwood scale ? 2 or 2.5? How can I counter this? (27M)",
            "Any success stories/pics of people reversing a NW3?",
            "https://preview.redd.it/h95rgi6dq66d1.jpeg?width=2316&format=pjpg&auto=webp&s=18562ef52539696414b0c6bcdcee4ce6e0e6c423\n\nis this an example of hair miniaturization? Notice the thin wispy hairs hanging down on my forehead (i separated them out for visibility).\n\n25M started noticing hairline receding and thinning this year",
            "https://preview.redd.it/r7wxs57iy66d1.jpeg?width=1170&format=pjpg&auto=webp&s=97943188a2b76f016838cfd0a8df8d7e3289afd1\n\nBeen on 1mg fin ed for 6 months, 5mg oral min ed for 1.5 months. I’ve been shedding after starting oral min but I believe the peak is over. This area has recently receded , it was a straight line before. Is it the shed or is the balding continuing. I’ve been thinking about switching to dut a lot these days.",
            "https://preview.redd.it/ovjumc8jy66d1.jpeg?width=1645&format=pjpg&auto=webp&s=c023112a6b06b269f8ebd3ca017988fe833ecc2f\n\nJust turned 31. Have had pretty thin/fine hair my whole life and just now starting to notice some thinning. Advice? Or is it all over?",
            "33m. Just started .5mg Ed fin a week ago. Came into this giving it a fair shot and not stress about sides. But I can’t ignore the fact that I feel a sort of numbness at the tip of my junk. It’s freaking me out a bit. Should I keep taking it or bail?",
            "Dermatologist made me choose between Min or Fin\n\nHello everyone, as the title says, my dermatologist made me choose between starting Finasteride or Minoxidil.\nToday was my first visit to the dermatologist for hair loss issues and the diagnosis was male pattern baldness \"unmasked\" by Telogen Effluvium I had a few months ago.\nAs a solution, she suggested Minoxidil, at which point I asked what she thought of Finasteride. After explaining the side effects and prescribing it, I asked what happened to the Minoxidil prescription, and she told me it's either one or the other.\n\nI am a 22-year-old male with thinning Norwood 1/1.5 in the temple area (I consider Norwood 1 as a juvenile hairline) and very slight thinning at the crown (noticeable only under intense light). I chose Fin anyway.\nWhat do you think?",
            "https://preview.redd.it/s2q3hxweb76d1.jpeg?width=2316&format=pjpg&auto=webp&s=0ab63aba90e24912c97ee68b90114795647242c0\n\n\\[20m\\] What should I do? I'm very insecure about my hariline. I think I supassed my dad's receding hariline. I used to have naturally receded hariline but now I think I look bad with short hari. Should I start with Minoxidil or Finasteride? Is there anything to save at least? Will my hairline regrow a little? More images in comments",
            "https://preview.redd.it/xpxozoce686d1.jpeg?width=2315&format=pjpg&auto=webp&s=63ce91ff4bb2f4f54649bb76a952ed1384e29337\n\nHi! So I'm 22 and within the last six months I realized I was shedding much more than I ever had after I started using shampoo (herbal essence) for the first time in years. I was also more stressed than I've ever been as I was coming up on the end of college so l attributed it to those two factors. I swapped to a hair loss shampoo and conditioner however I realized that due to the reduced volume caused by the conditioner the thinness was more obvious so about a month ago I went back to not using any products anymore. I showed the loss to my doctor and he said it certainly could've had something to do with the shampoo and stress and that my follicles look totally healthy they're just don't have hair. He didn't recommend anything just made that observation and encouraged me to switch to baby shampoo which was kind of a moot point since I was done with products. My hair is a big part of me and l've been very self conscious about it and I'm wondering if I should do something or if I'm freaking out over nothing. Thanks!",
            "Do I use topical min on my hairline if I’m not receding?",
            "https://preview.redd.it/2npyvdwc396d1.jpeg?width=1576&format=pjpg&auto=webp&s=78c52f599983c1daf0827ef02c41c815ddb1587a\n\nJust turned 21 and started noticing receding… what should I do?",
            "https://preview.redd.it/3hxftcad496d1.png?width=1313&format=png&auto=webp&s=17f677cdcf983e698999b49c76058025d6ae82d8\n\nIs this receding? If so how bad. I have one year until I can take fin . Tap on the photo to full screen",
            "Has anybody ever developed side effects from Finasteride after the 6+ month mark? What did you do?\n\nBeen on Finasteride 1mg a day for around 6 or 7 months now. I tapered on very slowly and had no side effects until I think recently. I say I think because I know the placebo effect is a very real phenomena.\n\nMonths 0 to month 2 I noticed nothing, just less itchy scalp. \n\nMonths 2 to month 6 my libido shot through the roof (I assume because of increased Testosterone?)\n\nMonth 6 to present day. Libido seems lower, erections seems weaker (they still work but the past 4 months they've been exceptionally strong) and orgasms slightly duller. No other issues to report. \n\nI don't want to quit, my hair has started looking really really great from re-growth and no scalp itching is a god send. \n\nDo I power through, could all be mental placebo? Lower the dose to 0.5mg M-W-F? Quit entirely? \n\nWhat would you do/what have you done?\n\nNot looking to get into a lengthy discussion about PFS - just your experience and if this is the body still needing time to adjust.",
            "Been on topical min 5% with 0.1% fin for 1.5+ years now. Unfortunately i don't have any before pictures but i don't see much of a difference. Should i up my dosage of fin to 0.25%? Should i buzz it?\n\nhttps://preview.redd.it/gdxor3j3ua6d1.jpeg?width=2448&format=pjpg&auto=webp&s=13e35573589b246872575535071411841ddd9638",
            "Does anyone know if only fin is available in liquid form over the counter or by prescription? When retrieving from the pharmacist as a Rx can you request they make it as a liquid rather than a tablet at .025%  per 1ml?",
            "https://preview.redd.it/pzb2c6l1xb6d1.jpeg?width=864&format=pjpg&auto=webp&s=b6f25007add17cc7caad6d420b0c2978d4aaaf32\n\n19M Has the gene kicked in (2021)",
            "https://preview.redd.it/2keu05ew0c6d1.jpeg?width=1576&format=pjpg&auto=webp&s=782fe2f7263f0fa1efe04e5c1c8c724c5c035aa4\n\nWhat do I do?",
            "[deleted]",
            "28 - how bad is it? Started fin 2 weeks ago, can it be saved?\n\nhttps://preview.redd.it/11j2p3r1qd6d1.jpeg?width=1170&format=pjpg&auto=webp&s=302c2464816ead605bc69bdeecbaf74719cbfcfc",
            "https://preview.redd.it/6s5voz1cbe6d1.jpeg?width=2352&format=pjpg&auto=webp&s=2660509f9482fbaf1ffbb5903dd95ee0ebe45ff9\n\nHey yall this is my hairline as of right now what can i do to better my situation when i was 15-16 my corners were absolutely fine now that im 19 im struggle with my corners and it really weighs down on my confidence would minoxidil or finanstride or anything aid my situation",
            "Hey y'all. So i have a question, recently i went to my local pharmacy and i asked for 5% liquid minoxidil, which they did give me and it is like dirt cheap, it's like 6 dollars for a good amount of it.\nNow what i want to know, is it safe to use it for hair and beard? Does it even have an effect like branded ones do?\nThe solution smells kinda similar to alcohol. Can i use it and expect results or do i have to pay more for branded ones?",
            "Should i quit minoxidil?\n\nIve been on it for 9 months including fin and have seen no visible gains. (Check my post history for pics) I'm also reconsidering it because im getting tired of applying it every day. I want to go fin only from now on.\n\nMy only fear is that my hair that ive maintained has become dependent on the minoxidil and that I'd end up even worse than before...",
            "What norwood am I? I know I am balding but wanted to know where am I on the NW scale\n(https://imgur.com/a/elKPCyo)",
            "I am 19 years old and had very girlie hairline when I was 13-14 but now my hairline has recessed and my forehead has also gone big and temples recedes as well as u can see in the photos . My father(45) and grand fathe(65)  both have good hairs till now .but some uncles on my mothers side are bald but they didn't go bald that early. Need suggestions is it receding or just maturing hairline. And if it's receding what should I do can't afford a dermatologist.\n\nhttps://preview.redd.it/162vqd7r2h6d1.png?width=1080&format=pjpg&auto=webp&s=b815376038f50957659e5e763f13c06c087695ee",
            "https://preview.redd.it/6twztyk57h6d1.jpeg?width=1065&format=pjpg&auto=webp&s=211957ab51319621e4b19b4634ca646e2b73c633\n\nHey everyone! I saw a lot of you guys make some great progress on here and I have been noticing a lot of hair shedding when l've been showing for the past month or so\n\nI'm not taking anything right now but will do so if needed! And if so, can someone point me in the direction of a 1mg fin pills I can buy and take daily? I see that works well for a lot of people\n\nI've always been self conscious about my hairline and big forehead I feel like it might be getting worse?\n\nLet me know what you think, and any help is much appreciated!\n\nPictures are taken a year and a half apart btw.",
            "https://preview.redd.it/qc10cyebjj6d1.jpeg?width=1498&format=pjpg&auto=webp&s=68b53a71817175dfdab41ec1ebeae3599934c1d8\n\nHair now after the last post around 4 months ago, topical min and 1mg fin. Feeling pretty hopeless and consenting dropping fin to try dutasteride.",
            "https://preview.redd.it/kk8u9794dk6d1.png?width=3024&format=png&auto=webp&s=e26506706d3086962a73510b12421464eba32316\n\nDoctor wants to switch me from Fin to Min.\n\nIm a M32, and been taking pill Fin for 2.5 years as well as topical Rogaine foam. Around 5 years ago I noticed my frontal sides starting to receded as well as multiple hairs between my fingers every time I showered. Finally 2 years ago I decided to consult a dermatologist and he’s since put me on fin. Since going on fin I noticed less hair coming out in the shower but nonetheless still losing hair. I used to count around 20 hairs daily in the shower and now it’s around 10 daily.\n\nAfter my recent visit I learned from my doctor that I shouldn’t be losing ANY hairs and that he wants me to switch to pill min or take both min and fin by pill. Idk, I feel like my hair isn’t falling out as much anymore and I definitely have noticed some side effects sexually. Im not familiar with min and don’t want additional side effects. I also don’t want to take more and more pills. I’ve read fin messes with prostate cancer PSA tests and my family has a history with prostate cancer so I’ve accepted that I’ll have to give up fin eventually. Looking for advice on what to do, others experiences, and min and its side effects. Pics attached.",
            "https://preview.redd.it/a7wejai6dl6d1.jpeg?width=1090&format=pjpg&auto=webp&s=b7c28ddef5bb03878f8e8290081fc5b65806efb5\n\nDo you think its getting better? if i keep using finasteride + minoxidil do i have chances to recover my hairline?",
            "Hi,\n\nI have been diagnosed with mbp N 1.5. Looking at pics here I think I am rather 2.5. What do you think?\n\nI take fin for 4 months and topical M for 2 months. I have got an impression that it actually gets worse. Is it possible?\n\nWhat kind of haircut you think I should go for with rather round/square face? I am still in ‚Inhave got lots of hair, so will go messy’ and after doing that I have got that crappy, ridiculous peninsula screaming ‚look! I still have some hair’.\n\nThank you!\n\nhttps://preview.redd.it/zefi3b72tl6d1.jpeg?width=3717&format=pjpg&auto=webp&s=0dc013602358b2b224e725352a4a32023b13b2cd",
            "https://preview.redd.it/mshjky6zkm6d1.jpeg?width=2316&format=pjpg&auto=webp&s=12796a01d079939556adf1139dcc9d165d99f552\n\nWill fin only suffice? I just recently turned 19 and I am kind of hesitant starting.",
            "24m - trans guy worrying it's joever :(\n\nhey folks, i've been lurking for a while and figure i should probably post for opinions. i apologize if this is lengthy! i want to provide as much context as possible. \n\ni'm a 24 year old trans guy who's been on testosterone for 6 years. i've gotten all the changes i've needed out of it, and take (pretty consistent) weekly injections. \n\ni have thick hair that i really love. i wash and condition when i shower every other day, and i use a spray leave-in conditioner on my ends.\ni haven't dyed my hair in a few months, the first time in a few years--and i haven't bleached it at all since i was 17-18. i started growing my hair out about 5 years ago, and i love having it long since i haven't grown it out since i was a kid. i started to worry about hairline thinness a couple years back, but i'm definitely more concerned about it now, especially after a hairdresser pointed out \"receeding areas\" in may. \n\ni figure part of this may be, of course, stress and hormones and genetics; i think it could also be eczema/psoriasis, though i've only recently developed a tiny half-inch patch of rough skin on my forehead. i haven't noticed any itchiness or roughness on my scalp (it gets itchy when i need to wash it though), and my eczema is mostly concentrated on my forearm and ankle. my psoriasis is on my inner thighs and results in lesions from too much movement or scratching.\nweirdly enough, i developed a red line on my forehead a few years ago, but there's no symptoms with it.\n\ni'd really like to keep my hair, since i think it's one of my main charm points and something i'm very proud of. i'm open to starting hair treatments or changing my routine, i'm just not sure where to get started.\n\nany opinions on this are appreciated, thanks!\n\n[photos](https://drive.google.com/file/d/1C4dP4MmHO_QOsxDqSn0XdciAtXTJ4rWs/view?usp=drivesdk)\n(excuse my painty hands and clothes, i work at a studio!)",
            "Shaved my head completely. What can I do to improve my hair for the future?\n\nM20. My hair is pretty thin, and before shaving I could see a good amount of scalp through my middle part. What can I do to make sure that when my hair grows back, its thicker and less of my scalp is visible? I previously tried dermarolling + minoxidil (not long enough for results) and these methods were both somewhat troublesome due to my hair length, but now I can easily do both. What else should I add to my regimen?\n\nAlso, should I use minoxodil + dermaroll on my entire head or just in the middle part / crown area where I was seeing scalp w/ my previous hairstyle?\n\nThanks.\n\n￼​",
            "Hello I've been noticing the center area of my hairline quite thin lately. I'm quite knowledgeable with the Norwood scale and haven't seen any Norwood scale that involves progressive thinning at the center. Can Y'all give some feedback regarding whether this is still a process in the maturing hairline phase or if I'm straight up going bald, transitioning to Norwood 3 territory.\n\nhttps://preview.redd.it/97vuanhzon6d1.png?width=720&format=pjpg&auto=webp&s=75928db593c07328687439d2562102979e1c4a88",
            "https://preview.redd.it/umlfs3d50q6d1.jpeg?width=2988&format=pjpg&auto=webp&s=7b2c130216b827846357222c12611eb2a30c1f75",
            "https://preview.redd.it/k3no2lyydq6d1.png?width=2316&format=png&auto=webp&s=fb181664ebb249552a3afbc5556035dfba98db9f\n\nWhat would y’all’s advice be",
            "Just picked up my Rx for fin to add to my oral min. Will see how it goes.",
            "https://preview.redd.it/2o1saci3pr6d1.jpeg?width=2316&format=pjpg&auto=webp&s=7dcccc39f3003d2476f9728ee6ae862d7f4f665c\n\nI’m 33, can’t tell",
            "https://preview.redd.it/nzgcpg971s6d1.png?width=1080&format=pjpg&auto=webp&s=2bd72524ceeb4e3ee7f6efedd4b13f49255b29e3\n\nMarch 24",
            "Hairloss current situation pictures taken today/yesterday. - already taking 1.25 finasteride & 2.5mg oral minoxidil. Been taking them both for 2 & a half years consistently no major regrowth but I do think it would be worse if I didn’t take anything. Is 2.5 oral minoxidil enough to see regrowth?\n\n[hair update]\n\n(https://imgur.com/a/zXMb6aL)",
            "Am I balding?\n\nhttps://preview.redd.it/x6cuoc969w6d1.jpeg?width=1080&format=pjpg&auto=webp&s=0e699f994bba22e5fcf9e6f3680fa93550759047",
            "https://preview.redd.it/fhmmlqhvdw6d1.jpeg?width=3024&format=pjpg&auto=webp&s=a31d4a8861d283e1cbbb7c5ad3c94094a55c2092\n\nCurrently 4 months of using the finasteride minoxidil Hims daily chew. I took this photo about 3 feet away from the camera. What do you think of the crown? 26 M",
            "https://preview.redd.it/ccetgl1hjw6d1.jpeg?width=943&format=pjpg&auto=webp&s=b714070eb9b1ec9167fbf0a3e221fd4e40dfea46\n\ncould I rock a buzz?",
            "Hi 21m, I've been having severe hairfall from past 3 or so years. I've been on Finasteride since atleast 6 months (1mg) daily. But sometimes I do miss like a few days a month. And Ive been applying topical minoxidil for about 9 months or so. Though I will admit I had a lot of breaks in between like sometimes a 2 weeks or so due to exams and hectic University stuff. But I try to keep consistency. I've been consistent since the past 3 months but I'm not experiencing any pronounced effects.\n\nI want to move to oral minoxidil but I don't know if it will be a good decision. For the most part I think I'm a diffuse thinner. I live in India and I have the typical Indian diet. You can find some pictures on my profile. \n\nShould I go for oral minoxidil? So should I use Topical with 10%?",
            "https://preview.redd.it/jtigth02sw6d1.png?width=1080&format=pjpg&auto=webp&s=3f99cbe4ba30fed8621a723948bf46446b2d2ec9\n\n20M . have diffuse thinning so buzzed my hair off. So should i start with finasteride first then take minoxidil or start both at the same time. Hairline and sides are fine",
            "Hi everyone. I have been using oral finasteride for 2 years and have great results. However, I had side effects that affected my libido. So, I recently decided to switch to topical finasteride. The topical finasteride I am prescribed with is 0.3%. I took a 1mg pill 3 times a week, I’m wondering how much topical finasteride should be applied a week that is equivalent to the oral finasteride dosage I was taking. ",
            "Hey, everyone. I've been on the standard dutasteride dose of 0.5 mg every day; it's only been a little over a month and I am already seeing bits of regrowth. The thing with me is that I have naturally curly hair and diffuse thinning (I'd say I am in between a NW1 and NW2), and I am really considering taking a dose higher than the recommended one to speed up results. I suspect I might experience a shed though, and I don't want to do anything unnecessarily, so I'm wondering if anyone could offer any advice regarding this. Thanks.",
            "I went to my dermatologist mid-April. After examination, she prescribed me Finasteride 1 mg: one pill **each 3 days**. On this community, many, if not all, use 1 mg **per day**.\n\nI'm worried (username checks out) about this. To be honest, after 2 months, I experienced the famous Fin shedding (since, let's say 1.5 month). So, I don't know.\n\nI'm also using Min 2.5% at night. I used to only take Min 5% two times a day (since 2018), but I reduced since my appointment.\n\nAlso, another concern, she said, after saying me to use Fin, that \"I can stop\" Min. People here seems to use both products.\n\nI'm super confused.\n\nP.S. I want to stop Min too because it dries my hair so bad.",
            "https://preview.redd.it/1gfshkkndz6d1.jpeg?width=2316&format=pjpg&auto=webp&s=28e2f37a726b4be7cd43762d38c5ded5c4feb7fb\n\nI have been on Min for \\~2 years. My Temples have receded and, after shaving my head yesterday, i noticed a lot of thinning on the top. Will Finasteride fix this? I already went ahead and got a prescription online.",
            "About 1 month ago I posted on this forum, they told me it's fine, but today I shook my hair and a lot of hair came out, I'm starting to get dandruff, I also noticed that the back of my hair is a little more receding, if someone confirms me I would be very grateful, also what I could start using.\n\nPd: I'm using an anti-dandruff shampoo since I was told that it could have an influence\n\nhttps://preview.redd.it/0wzzhfiljz6d1.jpeg?width=2448&format=pjpg&auto=webp&s=bac1db94051e20e0e955de39be0112961e051a6b",
            "https://preview.redd.it/nmbqcz0bh07d1.jpeg?width=2577&format=pjpg&auto=webp&s=1e7f6e59ad4d8ec7b5da1794fd4478d345e3fb3e\n\n17m. Advice ?",
            "After being absolutely happy with a hair transplant I went through a year ago, last winter my hair started falling again due to seborrheic dermatitis. After two months using anti dandruff generic shampoo and a mont using ketoconazol 2%, I only got rid off eczema but redness and a bit of itch remain. I even saw some red spots (left picture) I had before transplant. I’m happy with the results of my transplant but having seen my hair dense and now seeing how it starts to thin again has me anxious. I use keto three times a week and baby shampoo for the days in between. I did a PRP last month. What can I do?\n\nEdit: I use avidart and minoxidil daily.\n\nhttps://preview.redd.it/lqxpiqg7r07d1.jpeg?width=1285&format=pjpg&auto=webp&s=3e4a0adca8d4355d33d13fe68b60daa50496dafe",
            "[deleted]",
            "Need help can anyone suggest me what should I start with min. Or fin. OR both, I would really appreciate it\n\nhttps://preview.redd.it/8lg10cdc817d1.jpeg?width=960&format=pjpg&auto=webp&s=fdb59cacd69051679c97f2ca8f14d92959c25861",
            "https://preview.redd.it/bqt8r0h0e17d1.png?width=1080&format=pjpg&auto=webp&s=5dec50c507009b65027bb4cbfa6cd2b472a527d6",
            "Does anyone have suggestions on how to talk to a partner who seems to be in hardcore denial? I could pull up high school photos but that seems incredibly mean. I will obviously still love him regardless, but the refusing to acknowledge anything is different is making me feel insane.",
            "https://preview.redd.it/ql5ts7xto27d1.jpeg?width=2316&format=pjpg&auto=webp&s=991762f431e89bb3332b6b30df89f83ce6e31bae\n\n16M. I have a middle part/messy hairstyle. But once you see from uptop, the scalp is very visible. Do I have hairloss around the crown and middle part section? And should I seek a dermatologist for medicine? Is there any other way to promote hair growth in those area? Please let me know 🙏🙏",
            "Am I doing too much finasteride? \n\nI was prescribed 2.5mg of minoxidil to take take orally twice a day, as well as 0.05% fluocinonide for my receding hair line. That has been my treatment for a little over a year and it has helped with thinning hair on my scalp but my receding hairline has only stopped in its tracks. I haven't seen any noticable progress at my hairline. I want to see more regrowth at the hairline, so I was additionally prescribed 1mg of oral finasteride to take twice daily. Is 1mg fin twice a day too much? I have only been taking it for three days and I've already noticed a huge decrease in my libido and diminished orgasms. Could reducing the amount I take mitigate these side effects? I've been reading that others take 1mg fin either once a day or three times a week and still see positive results; should I try doing that? Should I even bother starting finasteride after a year of decent results with minoxidil?",
            "[deleted]",
            "Hi so for a month I have using derma rollers, coconut oil and rosemary oil for my hair growth. I used 1mm derma roller twice in a month. After the 2nd time use I have been seeing hair fall like crazy. I'm not using fin or min right now. Right now the problem is my bald spots ar growing and I see hair thinning on the front side. Everytime I apply oil, I see this problem most. This has been going for around 10-12 day and I am scared to use the derma roller again I used my derma roller in some bald spots and spots where hair is thinning slightly. Now my question is:\n\n1. Am I using the wrong method?\n\n2. Should I start using min and fin?\n\n3. Is this hair fall or shading?\n\nI look forward to this wonderful community to help me. Thank you",
            "Does this look like MPB or diffuse? Am 25 and haven't been keeping track of my iron intake for the past years but i know it's been less than 100% daily value so it might be a deficiency but I'm unsure. It's been slowly falling out for months but became much more rapid recently. If I start fin and it's not pattern what happens if I stop it? \n\nhttps://preview.redd.it/ap760sib957d1.jpeg?width=2208&format=pjpg&auto=webp&s=4d8b0952baafe2b43f5e57801ce8ff607d2097c0",
            "I’ve been using Hims topical Fin+Min for about 7 months now and my hairline literally hasn’t changed. I’m wondering if I do the pill or stick it out for longer. Below is a few days ago.\n\nhttps://preview.redd.it/9u2ivik5gb7d1.jpeg?width=1242&format=pjpg&auto=webp&s=0ac26b9ab14bda3c023a2dd3cdc0dae5f624c920",
            "https://preview.redd.it/codhkfaupb7d1.jpeg?width=2316&format=pjpg&auto=webp&s=131de024fde047f03c0a3ac49dfac9e6b57e42b7\n\nM17. Unsure if its just the parting or not but I’m just a little worried and secondary opinions would really be helpful. Thank you! Sorry if the pictures are bad",
            "Hi everyone,\n\nI’m currently using topical finasteride (0.025%) + minoxidil (5%) once a day. Before this, I used only minoxidil for 8 months with no results (actually, it made things worse). Since switching to my current regimen, I’ve regrown a lot of hair over the past 6 months, but I’m still not back to where I started. The mix is quite expensive, so I’m thinking of switching to regular oral finasteride and continuing with topical minoxidil.\n\nHere are my questions:\n1. How much oral finasteride should I take?\n2. Should I use minoxidil once a day?\n3. How should I transition smoothly?",
            "I started topical Finasteride 5 months ago (fin/min combo dropper), and after 5 weeks I started to shed HEAVILY so it's been almost 4 months of continuous shed. I don't know what to do. I have been applying Minoxidil for almost 10 years though.",
            "[deleted]",
            "https://preview.redd.it/rrq9s7rvyf7d1.jpeg?width=1170&format=pjpg&auto=webp&s=25f4062e160cdf2098818a49155ab370a0c7bac1\n\n(21M) Am I cooked? Never really paid attention to my hair but over the last year I have significantly grown my hair out and have noticed more hair in the shower. Don’t have a before picture of my hairline just searching for opinions! Thanks!",
            "https://preview.redd.it/0i2iccarcg7d1.jpeg?width=2316&format=pjpg&auto=webp&s=82bedc677560ef3940dca147157cbe0f5df00dcb\n\nM19, I think I have thinning/recession on my temples. Is this indicative of MPB or could it be say… telogen effluvium? Would love a second opinion, thanks in advance (Edit: spelling)",
            "27M. Just need some advice or insight! Temples thinning or bad haircut?\n\nBasically some parts of my temple area are less dense, the hair follicles are there but not wanting to grow? Why is that? Any insight? Longer hair pics were taken a day before haircut and the short hair pics are 4 days after haircut!\n\nhttps://preview.redd.it/jfsn1rcrig7d1.jpeg?width=1170&format=pjpg&auto=webp&s=0e5626f5f9350f0930a0bb479f880282afd17549",
            "https://preview.redd.it/wjey4p00lg7d1.png?width=1080&format=pjpg&auto=webp&s=f7159aff2e91173f7863edcb0984f40828b8fb45\n\nHey guys i am scared af what is this i just noticed this like 2 days ago and i am about to kms",
            "https://preview.redd.it/ysnp1ocbph7d1.png?width=1080&format=pjpg&auto=webp&s=f7553b84c99bc1a26b8f03a5eb483e6636dd136c\n\nIs this reversible please tell",
            "Hi, for some context I have been using anabolic steroids for 4 years and never had any hair thinning (28yo male). About 4 months ago, I added in a compound called “primo” with my low test dose. This has kept my oestregen unknowingly very low (no libido during this time also). Lately have been very stressed from uni, and had a couple very heavy (party drug) holidays.\n\nIt was around 3-4 months ago I noticed shedding in the bath, and only just this week have I noticed I can see my scalp in some areas etc!\n\nSo please, what type of shedding is this? Will my hair return if I manage to control external streas and stop using the anabolic steroids? Is there anything I can do in the near future to help stop the shedding and promote new hair growth?\n\nIs it even possible to regrow hair?\n\nhttps://preview.redd.it/fpkkc1hw7i7d1.jpeg?width=1125&format=pjpg&auto=webp&s=b6dedc5146f4f42d89a394fb5243902aa5144337",
            "**Shedding and easily pulling hair out**  \n  \nHi, right now im on minoxidil 5% solution (applying only at night) and taking 0.5 mg fin for 6 months and also dermarolling once a week.\n\nAnd last 4 weeks i noticed maybe a shed? I noticed my hair more and more. On the table, on the pillow in the sink. What is weird to me that im also shedding the new short hair that i grew (i have longer hair normally). Thanks to this bigger loss of hair i switch to 1mg per day and it didnt stop. I find it little scary and it makes me stress and think about it everytime i see my strand of hair on the table. When i took finasteride and minoxidil I didnt experience any shed or at least i didnt notice. Its scary to me.\n\nMore helpful info: I notice shed begun shortly after i start taking new batch of fin (im taking fin Recur even at the start i was taking it) and i also at that time stop taking isotretinoin (i was taking the smallest dosage for acne issues 20mg). Week ago i decreased my nicotine intake by 90% (Im vaper not smoker). My diet is better a lot but that is already for 3 months. Im working out consistenly for two years almost.\n\nI didnt find any noticable differencies in my hair but im worried that its just question of time. My progress was really great honestly. I got from thin nw 2.5 maybe to 1.5 nw?\n\nIm worried. Should i just stay consistent and dont stress about it? Start taking isotretinoin again? Switch to different brand of fin? Or should i hop on dunasteride?\n\nThank you everyone for feedback!!!\n\n(I dont have any side effects)",
            "Guys i think i am receding. please help me. i need to know if i will bald.\n\nhttps://preview.redd.it/hyl3a6t05j7d1.png?width=565&format=png&auto=webp&s=a166057663e7a4342a4d0cd920f77f309e6b172d",
            "Hello, I hope I'm writing in the right place.\n\nFor 3 months I used minoxidil, the one you buy in barbershops, the blue label, as time went by I started to feel anxiety and an irregular heartbeat, I had to stop and the situation returned to normal. Anyone else in the same situation or has the same thing happened?\n\nAt the moment I'm experiencing severe hair loss, I bought a \"trioxidil\" shampoo, but an hour after using it, I started feeling anxious again and the irregular heartbeat, what the hell???",
            "Hey guys, I can't really tell if I'm losing ground or making progress on finasteride + minoxidil for over a year now. It's difficult to compare because the surrounding hair length + angle + lighting are a bit different. I have 2 photos, one recently and one from 7 months ago. Which one looks like in a better state, 1st or second? Here's 1\n\nhttps://preview.redd.it/f86md6au2l7d1.png?width=1034&format=png&auto=webp&s=83c1942b31bfa61786934ea3c0e8ad90a19dadb0",
            "Hey guys, I would like some options on my situation. 30M, and didn't realize this on my crown until fairly recently. My hairline is still very good, so this was kind of a shock when I found out lol.\n\nI tried Minoxidil without any effect (started about half a year ago). Should I start with finasteride?\n\nThanks 🙏\n\nhttps://preview.redd.it/2a814ashcl7d1.png?width=1080&format=pjpg&auto=webp&s=1e69cbb579fe6b3189a7a389c00ee4e2a480bc3a",
            "[deleted]",
            "Hey guys looking for some advice regarding stopping finasteride but continuing minoxidil!\n\n22m currently taking both finasteride and minoxidil for around 3 months, originally faced some sides from finasteride however they have all but passed expect but the most recent one which is unfortunately gyno! I am a healthy guy who trains 6 days a week and knows his own body so can tell that it is most likely gyno development and not just excess fat or muscle gain. \n\nMy question is: should i drop finasteride for the time being whilst taking some dim/zinc supplements to assist with lowering the gyno whilst also continuing minoxidil/derma roller and hair oils usage and then picking up finasteride again when the gyno dies down? \n\nAny recommendations would be appreciated especially if this is something you’ve dealt with previously!",
            "https://preview.redd.it/s3pj8dy17m7d1.jpeg?width=717&format=pjpg&auto=webp&s=6ea839f23af0a2af9111fd980e07b92bbd7e5427\n\nThis is my hair one month after starting Fin 1mg and minoxidil 2ML a day.",
            "https://preview.redd.it/wlfcg6bshm7d1.jpeg?width=2316&format=pjpg&auto=webp&s=0ec2c096f0f6c8fa80e3fb09ce46d91e56c9e562\n\nAm I cooked? How can I try to fix this? Hims?? It’s gotten worse",
            "Not sure if it's balding or not. A side note, my hair have been thin all my life, just like my father (he's not bald even in his 60's). If yes, what should I do? I want to keep medications as the last resort \n\nhttps://preview.redd.it/w1y3wwsljm7d1.jpeg?width=1600&format=pjpg&auto=webp&s=5d21ab797ad5f7b3b3160059dcef450927812dd1",
            "[deleted]",
            "Hey guys, I noticed a couple of months ago my hairline has been receding badly and it's left me quite devastated, I'm not really attractive as it is but this has been such a punch in the gut, and I have a big head and wouldnt suit bald either i dont think.\n\nSo do you guys think I can do something to fix this, and if so could you guys help me get a routine written up, I looked into fin and min a bit but was not sure of the specifics like percentages and how to use it. I've heard about derma rolling too but I don't really understand it.\n\nI'm clutching at straws but I don't know what else to do, thanks for any advice you guys can give. Also I'm in the UK so if you have any advice on where to get the product as well that would be much appreciated\n\nhttps://preview.redd.it/vythfs3elo7d1.jpeg?width=3120&format=pjpg&auto=webp&s=b1fcefc2530aac5510d6de0f145291bb8770ed80",
            "Concern about my hairline receeding\n\nAge: 23.\n\nRecently I’ve noticed that my hairline doesn’t look the same as it used to. It’s a growing concern and I made this thread in search of tips and advice on how to move forward.\n\nThese are pictures from 3 years ago of how my hairline looked.\n\n[Picture 1](https://i.postimg.cc/pTRXYzTN/2-A1-AB116-1-A0-F-4737-82-A1-7760-B53-B7-B17.jpg)\n\n[Picture 2](https://i.postimg.cc/kG5JLCKf/516807-CB-8-E08-4718-80-C8-5-BA9-E275-EEBE.jpg) \n\n[Picture 3](https://i.postimg.cc/B6pZhbLj/521-EBBC9-D67-F-437-B-AE4-F-705760-E49-DD1.jpg)\n\n[Picture 4](https://i.postimg.cc/MGypQdzb/7-F306-C6-F-13-A1-4-E0-A-A214-735156-F1-CA85.jpg)\n\nThese are pictures on how it looks now.\n\n[Picture 5](https://i.postimg.cc/Fs7FZ99K/IMG-2481.jpg)\n\n[Picture 6](https://i.postimg.cc/sgWVkwGd/IMG-2495.jpg)\n\n[Picture 7](https://i.postimg.cc/SK7msRGg/IMG-34880-A4-B-68-B2-4-A6-E-8801-44-D77652-EB49.jpg)\n\n[Picture 8](https://i.postimg.cc/SKpykCcX/IMG-E199-C20-E-AEED-42-A1-919-B-FDCD1-B314-EB0.jpg)\n\nAs you can see there’s a significant difference, enough to warrant a concern. \n\nI always used to change barbers a lot and I do remember one time where this particular barber was realllly rough with the clippers and when I looked in the mirror my hairline was definitely not how it used to look. \n\nI also used to wear a lot of protective styles a lot like box braids and 2 strand twist. \n\nI don’t know if either of those are the cause or it’s the fact that it’s genetics at hand. My dad has a good hairline but he’s balding in the middle of his head at the age of 60 something and my mom’s hair looked the same since she was in her early twenties, she’s now in her 40’s.\n\nI was thinking I wanted to grow my hair back out to when I had braids but now with my new found receded hairline I’m wondering if that’s not the best idea anymore. I used to have baby hairs around my hairline and now they’re gone. Do I start grieving and let go?\n\nI’m wondering if there’s anyway to save my hairline and get it back to how it was looking from before? Or do I have to cut my losses and start to embrace it from now on and let go what was once was?",
            "Hey fellow men, I’m a 25M and slowly I’ve started noticing some intense hair loss or that’s what I’d like to call it. Till the age of 23-24 I had one of the best hair in between my peers and now they keep asking me if I’ve cut my hair or what happened to my hair! That’s kind of disturbing me and I’m scared and stressing about it now!\n\nMy hairline definitely is going back, I take a shower and I’m definitely losing around 50 strands of hair, when I wake up in the morning my pillow has atleast 10-15 strands of hair.\n\nI used to have pretty straight thick hair overall, now its curling up on the top area and my side are still straight! (But thinning) Losing hair in my crown area as well!\n\nFamily History:- My dad has hair but it’s not much, its barely anything and he had curly hair, my mum in the other hand has brilliant hair, touchwood! My dads side of the family has shitty hair genes and the opposite applies for my mums side of the family!\n\nDoctors advice :- Use proanagen serum, but that didn’t help at all, using all kinds of hair oils to try and fix it naturally but that doesn’t help either, I thought it could be due to my vitamin D deficiency but I don’t think that’s the case either\n\nhttps://preview.redd.it/00dc5cbhcr7d1.jpeg?width=2316&format=pjpg&auto=webp&s=09f43ba00d7256be77cf7fbb03bb7f409a921fea\n\nPlease advice me as in what to do before its too late!\n\nAttaching pictures below for reference",
            "I went to the dermatologist today who recommended topical Min Amongst along with vitamins shampoo etc. He said since I’m only 27 Fin isn’t recommended for me. Laughed when I mentioned I’d read about starting with fin. Told me to use min 3 months and then see if there’s no progress for next options. What should I do",
            "Quick question about blood donation. I want to start fin but I am a registered blood donor. I know I can only donate blood after I quit the medication for one month. Will this timeframe of 1 month affect my hair?",
            "Hello everyone, I have been taking Min 10% and fin 2mg for like 1 and a half years and there's been few irregularities in between. I had some good progress in the middle but recently I am facing severe hair loss, so much that it became way worse than how it was before I started the treatment. Hairline receded and there's a huge patch in the crown. \n\nIs it just the usual shedding or am I fucked? \nShould I continue the treatment or do I have to make any changes?",
            "https://preview.redd.it/s7vezcn0ms7d1.jpeg?width=1242&format=pjpg&auto=webp&s=25b6bef809b98af6ae225907d5b38c1ff2a4ec4d\n\n35 M. Worried forehead is looking a little too big? Does this look like MPB? I love my hair haha",
            "https://preview.redd.it/giwz665w2t7d1.jpeg?width=3019&format=pjpg&auto=webp&s=a8038123fd87928517bacb8d6e03759d01db79a1\n\nJust turned 20, too broke for a transplant, can’t take min cause I get horrible sides. I’m too young to take fin. I have a full beard. What can I do guys. This is severely damaging my social life",
            "I had some hair growing on my forehead from minoxidil connecting eyebrows to hairline. It wasn't that bad and they're really small, I'd only been using minoxidil for like 3 weeks. I've since them stopped. How long does it take for those haris to go away? I plan on going back on minoxidil after they've gone away.",
            "Post HT micro needling advice needed. \n\nGot a HT in America in late April. Had a post-op PRP session which has included with the HT about a month after. My surgeon also micro-needled my scalp using a .25 dermaroller. He said that I should use a dermaroller any larger than .25, and that I should only do it once per month or so.\nAny of you guys have thoughts on this? Also, for those who have had an HT, what are your thoughts/ experiences with micro needling during recovery?\n\nShould I wait until I'm fully healed to use the derma roller on my crafted areas? Also, what link do you all recommend for derma rolling?",
            "https://preview.redd.it/ekjfipsk4u7d1.jpeg?width=2044&format=pjpg&auto=webp&s=d805574e34875a1109a73fceadbd2d397d8745ae\n\n41. Always had a high forehead but now seeing thinning and loss at temples. Derm told me to try min before prescribing fin. Likely will start min foam this weekend.. Should I buy fin online? Don't want to lose ground. Noticed thinning \\~8 months ago",
            "https://preview.redd.it/bd7ucimo5u7d1.jpeg?width=2316&format=pjpg&auto=webp&s=72aa03dc2168b998e7833e34b3304134027d6e8d\n\nRest of the hair is fine it’s just the crown part that seems thin but I can’t tell if it is a weird cowlick? I am 3 months on finasteride and have been experiencing shedding as well. What do you guys think?",
            "[deleted]",
            "https://preview.redd.it/oy4ri1m7vu7d1.jpeg?width=2316&format=pjpg&auto=webp&s=a43a766e9d5065d3b885214ed3f08386819cdc50\n\nIs my hairline bad enough to need treatment?",
            "https://preview.redd.it/evgt0auq9w7d1.jpeg?width=2316&format=pjpg&auto=webp&s=ed1ef86ff53ccf34b831218fc8bf7947156cf13b\n\nHiii :)\n\nI‘ve been struggling with hair loss for a bit and have been taking finasteride and minoxidil for more than a year now and as you can see in the pictures it hasn‘t really brought a satisfying result. So I‘ve been strongly thinking about getting a hair transplant recently. My problem is I‘m very scared to because I‘m only 22 and not sure how much worse it might get and whether I‘m better off waiting. The state of my hair has really been affecting my mental health though so I was hoping some of you could give me some advice on what to do :)\n\nThank you so much for any comment <3",
            "I use a 1.5MM derma roller twice a week and apply minoxidil twice a day.  I also take finasteride once a day and collagen tablets every day.  Been doing this for about 5 months.  Honestly I can;t see any difference at all. I'm a Norwood 3 vertex.  Maybe as I'm in my 50's I'm too old for this to work?  I'm not sure I can do much more to get some hair growth!",
            "https://preview.redd.it/hip2sosbpx7d1.jpeg?width=1430&format=pjpg&auto=webp&s=85d3d16329afa2118e681f214535b5f4806558c4\n\nDo the hairs along the hairline seem like regrowth hairs? Or further miniaturisation",
            "[deleted]",
            "[deleted]",
            "[deleted]",
            "https://preview.redd.it/dle2f7k78z7d1.jpeg?width=1242&format=pjpg&auto=webp&s=920f389df64b2b9592f62580e6931449bb01df60\n\nI am 16M. Currently microneedling, using nizoral, scalp massaging, rosemary oil. I plan to start minox within the next few days (rogaine foam melted down to reduce the look of dandruff) What else can i do? What results can i expect to achieve?",
            "https://imgur.com/a/AwtUr8T\n\n26 yo M. First three pics are from 2017. Last three from today. No treatment whatsoever in between. Was fully convinced I would be bald by 2018 back then but I guess this is what a mature hairline is? Biggest question is should I start fin sometime soon as a preventative measure? My dad went diffusely bald around 28 and I’m getting close to there. Brother is already on fin at 21 so it definitely runs in my family.",
            "https://preview.redd.it/t8zawqb5s08d1.jpeg?width=1242&format=pjpg&auto=webp&s=88972f6d64c14fbe9a48ce7148786014949df8b8\n\nmaturing or balding?",
            "Should I start a hair loss treatment now, or wait and see?\n\nI’m 30 years old. Definitely noticed some thinning and some receded sides. I’m a little hesitant to make the leap as I there could be potential down sides to taking the medications I’ve heard. With that being said, am I just better to consider it now, or wait and see how my hair holds up over the next decade?\n\nThanks friends.\n\nhttps://preview.redd.it/cy6wthi2818d1.jpeg?width=2316&format=pjpg&auto=webp&s=46c82928ae5ac2a3d6f60de1bffa51e2efff8d0d",
            "https://preview.redd.it/jq3dwga7c18d1.jpeg?width=1576&format=pjpg&auto=webp&s=2d9cbfee85749a1badbcb36f77db7e87648c4f69\n\nAt 13 what’s going on 😭 just wanna know if it will ever get better",
            "https://preview.redd.it/6lfowr1yq18d1.jpeg?width=1439&format=pjpg&auto=webp&s=66e9870f16c4f4525cc94e5164f1f203d8757621\n\nWhat do I even do? I also have a big bald spot at my crown which shows through. I've been on Dutasteride for 10 months, and Finasteride for 2.5 years before switching to Dut. It seems futile... can Dut lead to regrowth even after 10 months? I'm still shedding like 100-200 hairs per shower. I think it's kind of working but the shedding ain't great, and that bald spot is barely budging. I started Nizoral a week ago too trying anything I can. Also been on topical foam Minoxidil for 10 months\n\n21M for reference. What type of baldness would this be too?",
            "https://preview.redd.it/54c8lssxe28d1.jpeg?width=2160&format=pjpg&auto=webp&s=101c613d2b5ece7ce3f9dfaf63a33c7ba0b0f2ff\n\nRecently buzzed my hair and have been seeing irregular growth patterns everywhere and I'm not sure what's happening",
            "https://preview.redd.it/l7u6bhfze28d1.png?width=2316&format=png&auto=webp&s=3d21768710eebea5fc2997a88d3cb9043a984daf\n\nAm I balding?",
            "I’m 26 year old man. Always had a defined windows peak but have noticed in past couple years bad recession and thinning in my corners. Wondering what my options are or if it’s easier to cut it all off. Cheers\n\nhttps://preview.redd.it/9kmgrxwax28d1.jpeg?width=1576&format=pjpg&auto=webp&s=bf782859591bf84ca27eb1ce1885623b91a05c9e",
            "Is that balding or telongum effluvium? Hair got like this since COVID.  \n\n\nhttps://preview.redd.it/1s1fw2f2x38d1.jpeg?width=2598&format=pjpg&auto=webp&s=5d4eaa9b94df4870ca4c7dc77e306da630a5bbdf",
            "Posted in male hair advice but figured better of posting here since you guys are better at spotting this stuff. As mentioned in the post I linked, almost every male on both my mom and dad’s side was NW3 or NW4 by the time they were 30. Currently 35 and doing okay but not sure if I’m starting to see loss in the temples or just a maturing hairline. Thoughts?\n\n https://www.reddit.com/r/malehairadvice/s/LHWrUADnAH",
            "Looks like Norwood 2 to me. You’d do well with a proper side fade though. As a fellow 25 year old, we have respectable hair for our age",
            "https://preview.redd.it/w6ctg9pe2w3d1.jpeg?width=1755&format=pjpg&auto=webp&s=7c85668924be2bcfbc3209fa42c2879df1934bd7\n\nThis is the fresh buzz on March 19th 2024, for reference.",
            "https://preview.redd.it/55uq5kqbbx3d1.jpeg?width=3024&format=pjpg&auto=webp&s=81c8a4ac607971fbc1fa27b50f67ce1c1ab6495a",
            "https://preview.redd.it/nc8tigdobx3d1.jpeg?width=2316&format=pjpg&auto=webp&s=8ccd6ecadff2e597c8f928860401541e3f673b1e",
            "https://preview.redd.it/wvi4cs867a7d1.png?width=1080&format=pjpg&auto=webp&s=05a37d8ec5b27a51e1aea945ff62e3df4c56e23d",
            " Can you lower the dosage?",
            "Sorry bro it looks like you're going to have to look hard for someone very specialized. Afaik \"traction alopecia\" is kind of a noob diagnosis whenever a patient presents with an unusual type of hair loss (unless patient is a ballerina or gymnast that wears tight buns, then probably correct diagnosis)",
            "Post one where it isn’t wet. Wet hair can be deceiving",
            "I had hair like this before I started the fin/min tablet prescription from Hims. Rosemary oil and derma-rolling should help too",
            "Inflammation. Talk with to derm about that",
            "https://preview.redd.it/io0dmsny7x3d1.jpeg?width=3468&format=pjpg&auto=webp&s=97789d786a9d8b222dad01feab5be29ede7b30a7\n\nThis is me in February. I know the angle and lighting are not the same (also not same haircut), but I can't do it any better 😭",
            "Crown looks normal, always gonna have slightly less dense appearance from the “whirl”. Please respond with your age, and front/side profiles with no hand, can censor your face too. Looks good though from what I can tell.",
            "https://preview.redd.it/8qi4fch08z3d1.jpeg?width=1637&format=pjpg&auto=webp&s=b1ce0e1f9f1d8aba0796834c063522a68a20ad0c",
            "wat percent min are  u using ?",
            "2500-3000👍🏽",
            "back on finasteride 👍🏽👍🏽👍🏽 if u hadn't stopped , your midscalp would have filled in by now loll",
            "Bro it's a fairly advanced recession. You'll lose all if you do nothing.",
            "Balding",
            "View from the top without pulling my hair back.\n\nhttps://preview.redd.it/opvfwe3xfw3d1.jpeg?width=1808&format=pjpg&auto=webp&s=29ca436d8cc51e07ee43d1228405385963ef42cf",
            "Keep going, add microneedling",
            "You usually won’t see anymore improvements past the 1 year mark with finasteride. Get on DUT and reassess after another year. If all hope is loss it’s better to just shave and stop being a drug mule (I mean the hair loss meds)",
            "https://preview.redd.it/fzwrzk6vwy3d1.jpeg?width=1179&format=pjpg&auto=webp&s=c1955973767a21aba9119120c25821e67723e717\n\nHere’s the back where he said it looked “very thin” jfl",
            "Stick with it and if it doesn’t improve within a year then stop because you won’t see improvements past that point. I use shea moisturizer leave in conditioners it helped with my hair",
            "lol it was probly the keto shampoo , causing most of it, just stick to the dut 💪🏽",
            "It’s normal to have hair loss like this, but if you want to stop it hop on Finasteride. For regrowth look into minoxidil.",
            "it's not bad at all , start finasteride , that will do👍🏽",
            "https://preview.redd.it/yjdzj8youz3d1.jpeg?width=2316&format=pjpg&auto=webp&s=b51d2c5427a86c82c083d51ceecb089825c8abac",
            "never too late ,give the meds a try 💪🏽",
            "https://preview.redd.it/hlih55qotz3d1.jpeg?width=1576&format=pjpg&auto=webp&s=bcb6c892aed997069ce96f82061802af08e3c5e1",
            "Not too late def jump on it, fin at least and it’ll save what you have, which is quite a bit",
            "dutasteride and oral minox /topical , give it 6 months 👍🏽",
            "https://preview.redd.it/h1tnxafguz3d1.jpeg?width=1576&format=pjpg&auto=webp&s=ea91dbe198ce0a8bc9dee99148d916d9f232301a",
            "finasteride , before it really begins to show 👍🏽",
            "It is not necessary to overpay for Hims’ services. Go get a prescription for a generic, and get Kirkland minoxidil or something like Rogaine.",
            "You def need Hims Finasteride/Minoxidil.",
            "finasteride fella , and use selsun blue shampoo ( red label) 🧴 that will help ease the pain ( inflammation)",
            "its the same",
            "u need to start finasteride",
            "that's normal part",
            "[deleted]",
            "https://preview.redd.it/7x7m1bmdo44d1.jpeg?width=612&format=pjpg&auto=webp&s=f849a3073ad74732a26655ca1956a211abab4f7a",
            "This could be DUPA, I’d recommend seeing a derm and get their feedback. If diagnosed with AGA get on finasteride",
            "Diffuse. Finasteride would work wonders rn",
            "https://preview.redd.it/bj65m7tjg64d1.jpeg?width=1242&format=pjpg&auto=webp&s=28e1e302354f9dbbd2a90887af8d3bedad589b42",
            "https://preview.redd.it/y7i8qyrum64d1.jpeg?width=4025&format=pjpg&auto=webp&s=5e68b150a8e28a3286019d65496e80a823dbc2c3",
            "https://preview.redd.it/f16znkqsn64d1.jpeg?width=4624&format=pjpg&auto=webp&s=928b20a6ab20a064db76766aaeae5ceac8a1cf2e",
            "Brutal pic can’t tell",
            "Do you do topical minox?",
            "Finasteride",
            "fella use minoxidil in them areas , and start finasteride",
            ">I'm not sure about minoxidil, I was using it 1-2 ml before bed, every night till Friday. Any advice for situation?\n\nShedding is normal. Like you said, it takes around 6 months to see results. It might suck that you're shedding, but long term your hair will look better. The only case where I would recommend stopping, is if you think it's causing an allergic reaction or your getting irritation from it.\n\n>So, fast forward to this year i talked with the dermatologist about it, and they suggested a anti dandruff lotion and ketoconozole shampoo for a month\n\nDid they make sure you don't have androgenetic alopecia(male pattern baldness)? Minoxidil is for regrowth, but if you have another issue like this, then the hair loss will keep progressing overtime. In this case, you would need Finasteride to slow/halt the hairloss.",
            "> Do any of you have a similar situation with fin and switched to lower doses and the sides disappeared ?\n\nHow long were you on fin? it's possible for sides to be temporary and go away in the first few weeks. \n\nAlso, fin is effective at doses as low as 0.25mg. I wouldn't recommend getting a transplant until you try fin again and find a stable routine.",
            "Not at all",
            "Are you on Finasteride?\n\nIf you have male pattern baldness, the priority should be getting on Fin.\n\nFinasteride slows/halts the hairloss\n\nMinoxidil is for regrowth\n\nSo if you're only on minoxidil, then even if you get regrowth your hair will still be thinning and receding. So long term you'll still lose ground.",
            "Yes I’d say so",
            "Might need a transplant. Seems like dead zones to me imo",
            ">Rlly trying to stay away from fin until my mid 20’s\n\nWith Finasteride, the earlier you start the better the results. Trying to hold out isn't going to work, since it's hard to regain once you lost ground.\n\nYou probably already know this, but you need fin to slow/halt the hairloss. It takes around 6 months to see results. You could also use minoxidil for regrowth.\n\nI would recommend making a decision soon if you want to take fin or not. Because it's really the most important thing when it comes to male pattern baldness.",
            "use it evening/nights , wash out in morning , simple 👍🏽",
            ">does using minoxidil every evening is enough or I have to use twice a day?\n\nOnce a day is perfectly fine. Two times a day would be the most effective, but it's not like it would be twice as effective or anything crazy.\n\nYou can just do once a day if that's more convenient for you.",
            "https://preview.redd.it/hope3u3x4b4d1.jpeg?width=1754&format=pjpg&auto=webp&s=4b52b8bf8dfcc4706f9a819ea64e2f9bed2c8c19",
            ">What should be my step to fix this?\n\nIf you have male pattern baldness, the priority should be getting on Finasteride. \n\nFinasteride slows/halts the hairloss. It takes about 6 months to see results, and you could get some regrowth from it too. \n\nYou could also add Minoxidil for regrowth.\n\nAll other oils and \"natural\" treatments don't really work.",
            ">Currently have a 3-year supply of 1 mg finasteride and minoxidil foam. Been using both off and on for some months but am discouraged because of no results or it seems worse.\n\nYou need at least 6 months of consistent use to see results. Also, when using finasteride and minoxidil it is normal to shed. This is only temporary but might make the hair appear worse, but long term your hair will be better.\n\n>Should I continue using them consistently?\n\nYes\n\n>Could this be some type of vitamin deficiency?\n\nVitamin deficiencies could cause hair loss, but this is very rare. Usually, it's male pattern baldness.\n\n>Could this be Telogen effluvium? Or caused by medication use (opiates). Had major back surgery exactly 1 year ago (Trans lumbar interbody fusion, Disectomy/laminectomy, facetectomy, and foraminotomy). Delt with severe pain and neurological issues for 2.5 years before surgery, this is when my hair started to fall out and thin. Don't know if it's a coincidence or not.\n\nTelogen effluvium usually goes away in 6-12 months. You said the thinning started 2.5 years ago, so it's unlikely. \n\n>Is there anything I should be adding to my routine\n\nJust consistently use Finasteride and minoxidil, you have to stop taking breaks and stick with it. If you don't get the results you want after a year of Finasteride then switch to Dutasteride. Also, try to get your vitamin stuff sorted out in the meantime.\n\n>or should I just accept that I'm balding all over my head?\n\nIt is likely that you are balding, you should stick to treatment and get your health figured out. If you don't want to bother and it's causing you too much stress, then you should just shave it.",
            ">I started minoxidil in August ‘23, and finally added topical 0.025% finasteride in March. I haven’t seen much results.\n\nFinasteride slows/halts the hairloss\n\nMinoxidil is for regrowth\n\nSo if you were only on minoxidil, then even if you get regrowth your hair would still be thinning and receding long term. So you didn't actually slow/halt the process of male pattern baldness until March. It takes around 6 months to see results. So it's too early to tell how effective Finasteride is yet.\n\n>Should I switch to oral finasteride instead?\n\nOral would probably be more effective then topical, but it's up to you. If you find topical more convenient, then I wouldn't change.\n\n>Is there any hope at this point?\n\nThat's for you to decide, it depends how much you value your hair. \n\nI would stay on Finasteride for at least a year(as well as keep using the minoxidil), then reassess.\n\n\nIf you still aren't getting the results you want after a year, then you could switch from Finasteride to Dutasteride. You could even look into a hair transplant later on too. This is all down the line though if you really want to keep your hair and pursue everything, if not that's fine too, the decision is yours to make.",
            ">I'm debating putting off min for another 12 months til i move out of my current spot because my roommate has cats and im nervous about the toxic to cats aspect, and taking oral min seems risky\nIs that crazy?\n\nThat's very reasonable to me. Oral min shouldn't be too bad if you and your doctor are keeping up on things, but topical is definitely safer if you don't want to take any risk. \n\n>Should i derma stamp in the mean time?\n\nOne of the main benefits of dermstamping is supposed to be increased absorption of topicals like min. \n\nAlso, it's not as important as fin or min, so it's not really necessary. You could just stick to fin for now and add min down the line like you planned, and you'll be fine.",
            "If it's male pattern baldness, then your best bet would be getting on minoxidil for now. Then once your 18 get on Finasteride as well.\n\nYou could try seeing a derm about it too.",
            "https://preview.redd.it/k27no1hujf4d1.jpeg?width=2544&format=pjpg&auto=webp&s=ad199ed4a0576a651663c4629786d679096d0939",
            "looks like normal parting to me",
            "https://preview.redd.it/mradser6xh4d1.jpeg?width=2437&format=pjpg&auto=webp&s=dae6cee5001da4ffb0b2122df956dc43e608f27a",
            ">I’ve been on topical fin and min for about 4 years now. I’ve seen the efficacy of both drop over the past 2 years and it’s a little worrisome. I started using Prozac a few months ago which caused a huge shed, I stopped a month in, and haven’t seen those hairs regrow (though it’s only been 2 months so there’s still time)\n\nMaybe consider dutasteride? Microneedling helps a bit, but I don't believe it would make a major difference. If you noticed fin hasn't been enough over the years and you're still receding or thinning, then switching to dut makes the most sense imo.",
            ">Balding at 21 as you can see I’ve lost a lot of hair possibly from stress if that helps? Anyway I can grow my hair back thicker and fuller?\n\nIf it's actually hair loss from stress, it would recover in about 6-12 months after the stressful period. But this is pretty rare, especially since it looks like you have significant hair loss.\n\nYou have to consider that it's Androgenetic alopecia. If this is the case, then you would need to get on Finasteride (or Dutasteride) and minoxidil.\n\nIf you are not sure, then you should see a dermatologist.",
            "It looks like your hairline is receding, which could possibly be male pattern baldness. But it's hard to tell if you're balding from one picture. \n\nAreas to check are the hairline, temples, and crown. Also, try to compare to old pictures and see if you notice thinning and receding.\n\nIf you think you have male pattern baldness, then the priority should be getting on Finasteride to slow/halt the hair loss.",
            ">What stage is this on the Norwood scale?\n\nFrom those pictures, it looks likes its between 2 - 3, so like a 2.5\n\n> Is this beyond a “mature hairline?”\n\nProbably a bit, not terrible or anything though. If you're not on Finasteride, I would consider it before it progresses further.",
            ">receeding? 20 y/o\n\nProbably, another area you should pay attention to is the crown and also check if you're hair is thinning overall. \n\nIf it is male pattern baldness, then you would want to get on finasteride to slow/halt the hairloss.",
            "[deleted]",
            "https://preview.redd.it/cctwgcp9kn4d1.jpeg?width=960&format=pjpg&auto=webp&s=0b91d0f626a570b51667d88fb51b3199790a3d1e",
            ">Getting really nervous. Am I balding?\n\nYes, it looks like it. \n\n>Just found out I have vitamin d deficiency of 18l my moms family is bald (uncles) but my dad and his side have a full head of hair. My oldest brother is bald but my sister and my second older brother have a full head of hair, they’re in their 40’s too. Except my second oldest brother who’s 49 just started balding in his crown but his hairline is ok. What can I do? I’m not open to minoxidil and fin.\n\nIt's possible that vitamin d deficiency can impact hair, so getting up to normal levels might help.\n\nBesides that, it's possible that you have male pattern baldness. From the pictures shown, that's what it looks like. In this case, there would be nothing you can do if you don't want to use Finasteride or Minoxidil.",
            ">Any point to dermastamp if im on oral minoxodil?\n\nThere's possibly some benefit you can still get out of it, but I don't think it would be much.\n\nFin and min are way more important. As long as your on Finasteride as well, I don't think it's necessary.",
            ">Can I expect regrowth where those little baby hair are?\n\nUnfortunately, only time will tell, but it is a promising sign. \n\nAs long as you stick to treatment you will see results, it's too early to tell much yet. It takes around 6 months to start seeing substantial results.",
            "https://preview.redd.it/htuy82qhar4d1.jpeg?width=3000&format=pjpg&auto=webp&s=50395dc193d8f9dad8a8aa1cb60db10bf436a128",
            "https://preview.redd.it/s0piy3mjar4d1.jpeg?width=3136&format=pjpg&auto=webp&s=f808f78402dcae21bd405da5a2f72e348bfae4a8",
            "Yo bro can you check if I am balding I will send you a photo",
            ">I somehow have hairloss on all 3 fronts. I visited a general practitioner and she gave me vitamin d saches after a blood test and told me to keep taking it and everything will be fine. Ofcourse that was bull**** so I'm scheduling an appointment with a dermat very soon.\n\nTo my knowledge, Vitamin D could impact hair and cause thinning all over if you're severely deficient, but this is pretty rare. It also doesn't cause a receding hairline. \n\n>I'm just curious if anyone else has faced thinning in all spots at the same time, cos most posts I see here are people with early stage hairloss in only one area of their scalp. The ones who are bald everywhere are at really advanced stages of baldness\n\nThinning in more than one area isn't that uncommon. Though, If you are balding everywhere, then that might mean your AGA is more aggressive, since factors like severity vary from person to person.\n\nIf you think your case is on the severe side, maybe consider going straight to dutasteride.",
            ">Is it too late to start the fin + min combo?\n\nNo, It's not too late.\n\nMight as well take the leap and try. If you stick to that routine and be patient, you should get some good results.",
            "https://preview.redd.it/oivljofr1s4d1.jpeg?width=2316&format=pjpg&auto=webp&s=13681f45b9dd9fbd5637913689724d097b289739",
            ">Not sure how long my hair has been like this or if the finasteride caused it (which I doubt).\n\nOne thing to keep in mind, is that finasteride could cause shedding. This is no big deal and long term your hair will be better off. But this might freak some people out and make them think the Finasteride is permanently making their hair worse or something. \n\n> However, I recently noticed that I might have retrograde alopecia or DUPA. Not sure how long my hair has been like this or if the finasteride caused it (which I doubt). Should I stop taking finasteride?\n\nWhether you have standard male pattern baldness, DUPA, or retrograde, if you stop finasteride then your hair will continue to get worse. I would only stop if you were very confident that you're hair loss has nothing to do with any of those.\n\n> Neither of my grandfathers are bald and my dad has a full head of hair.\n\nGenetics can be complicated. Even in your case were the likelihood is lower since both sides of the family seem to have good hair, it is still possible to have male pattern baldness. \n\n> Should I stop taking finasteride?\n\nSince you said you aren't experiencing any side effects, I think you should stick to it for now. Have a doctor help you figure out what the hair loss is from specifically before making the decision to stay on it or not.",
            ">Am I balding?\n\nBased on that picture, it looks like it. Some important areas to pay attention to are the hairline, temples, and crown. Also, try and compare to old photos to see if you've been thinning or receding. \n\n> and I want to know if I’m really cooked or if there’s something i could do\n\nIf it's male pattern baldness, then the priority should be getting on Finasteride.",
            ">I am not sure where to start, should I just start with finasteride only ? Or should I add minoxidil with finasteride too ? I don't think I could deal with the daily routine of topical minoxidil considering I have long hair, it would be a pain to keep up overtime. I feel like oral finasteride could be my best option.\n\nIf you have male pattern baldness, then the priority should be getting on Finasteride to slow/halt the hair loss. \n\nYou could start with just oral Finasteride, and later down the line you could add minoxidil to your routine if you ever wanted/needed to, but it's not required.\n\n>would you recemmond visiting a dermatologist who deals with hair first?\n\nIf you're unsure what the hair loss could be from, then that's probably the safest bet. Then if they say you have male pattern baldness, get a prescription and start with the oral fin.\n\n>but after getting that cleared, which brand of finasteride is good. Same for minoxidil.\n\nBrands don't matter for both finasteride and minoxidil, they all work the same.",
            ">Made a derm appointment for Sep to see any options but figured i’d come here and ask what you all think might be good for me treatment wise as i’m uneducated on the matter and all i really know is i should get ahead of it before it gets worse for me, as i’m sure it will only continue to get worse.\n\nIt seems like you probably have male pattern baldness, in this case the priority should be getting on Finasteride, which slows/halts the hair loss. You can also get a bit of regrowth from it too. \n\nYou could also add minoxidil to the routine if you wanted to, which is primarily for regrowth.\n\nGood job on being proactive about things, If you are unsure about the cause of the hair loss, then the derm should be helpful in diagnosing you.\n\nIf you are more certain that it's male pattern baldness, then there are many telehealth services you can use to get diagnosed and prescribed finasteride faster.",
            ">I have a cousin who uses just Rogaine and has been regrowing hair after 2 months. Just wanted to ask around and see what everyone’s experience is like here.\n\nIf you have male pattern baldness, then the priority should be getting on Finasteride.\n\nFinasteride slows/halts the hairloss\n\nMinoxidil is for regrowth\n\nSo if you were only on minoxidil (Rogaine is just the brand name of minoxidil), then even if you get regrowth your hair would still be thinning and receding long term.\n\n>I’ve seen some stories about shedding happening for up to 9 months\n\nIt usually lasts around 3 - 6 months, but how long it lasts varies from person to person.\n\nShedding is completely normal, not everyone sheds but it's common. No matter what, Finasteride and Minoxdil can't make you're hair worse, so long term you will benefit if you stick through a shed.",
            ">I’m at a loss of where to start.\n\nIf you have male pattern baldness (which it looks like you do), then the priority should be getting on Finasteride.\n\nFinasteride slows/halts the hairloss\n\nMinoxidil is for regrowth\n\nSo if you were only on minoxidil, then even if you got regrowth your hair would still be thinning and receding long term.\n\n>I tried minoxidil foam but hated how it made my hair feel.\n\nIf you want to add minoxidil again, you could try a different form of it. Besides foam, their is a liquid version and a prescription oral form as well. \n\nBased on the picture you provided, you should have a routine of both Finasteride and Minoxidil for the best results.",
            "try finasteride /dutasteride pick one loll,, n if you can get hold of oral minox , bingo 💯💯",
            "https://preview.redd.it/3xbxhlljdw4d1.jpeg?width=689&format=pjpg&auto=webp&s=a91f1fabd755491ed8dfe6d31d2056160a3206eb",
            "[deleted]",
            "cowlick",
            "Pic 5 Months ago (darker light):\n\nhttps://preview.redd.it/zqif86tpbx4d1.jpeg?width=1179&format=pjpg&auto=webp&s=82e0d973aafc64aabbdae11f9eceb8348654af27",
            "finasteride , should help fill it back in , Ur in early stages , so no need for minox",
            "https://preview.redd.it/yvsxyyv66y4d1.jpeg?width=760&format=pjpg&auto=webp&s=1e169cc827f17c9a6ef5f050d0e8f6db096c0a2f\n\nWas hard to find a picture with wet hair, but when it's a bit oily it's easy to see how thin it got (this is the crown and back of the scalp as well, the shedding is very diffused). It doesn't look like any pattern I've ever seen, but again the long hair is masking the extent of the problem.",
            "give it 4 to 6 months , keep them iron levels up in the meantime",
            "try adding saw Palmetto , or just try micro dosing finasteride 👌🏽",
            "https://preview.redd.it/p27043uwfy4d1.jpeg?width=2316&format=pjpg&auto=webp&s=e928579416486aae0355e49001ab85a81b5dfe44",
            "u need to start finasteride asap to stop further loss , apply minox to your temple areas , will help fill them back in",
            "oral dutasteride 💯💯💯",
            "[removed]",
            ">Also, opinions on rosemary oil?\n\nIf you have male pattern baldness, then the priority should be getting on Finasteride.\n\nFinasteride slows/halts the hairloss\n\nMinoxidil is for regrowth\n\nSo if you were only on minoxidil, then even if you get regrowth your hair would still be thinning and receding long term.\n\nIf you don't want to go on Finasteride that's perfectly fine, but long term you will go bald. Rosemary oil isn't effective in stopping male pattern baldness.\n\nThe only other alternatives would be if your hair loss was caused by something else, which is on the rarer side but possible. Like very low levels of certain vitamins, you can try seeing a doctor about it and getting your blood work done, if you haven't already.",
            "https://preview.redd.it/3ww3e75ua05d1.jpeg?width=1242&format=pjpg&auto=webp&s=94eb6a9edf18d16c48b1f8e22d796299bf78eea8\n\nFor reference this was my hair 5 years ago (although not pulled back like the first pick)",
            "> Should I hop on Fin and/or Min?\n\nFinasteride is what slows/halts the hairloss, so you can start with just that. Later down the line you could add minoxidil to your routine if you ever wanted/needed to, but it's not required.\n\n> Not really sure if it’s warranted yet.\n\nIf it's male pattern baldness, the sooner you start the better. This is because it's harder to regain lost ground then to prevent it from progressing in the first place. So you don't want to wait until it's really bad.",
            "dude u should already be on fin/minox 👍🏽, u have a deep m shape going on , save it now 👍🏽",
            "https://preview.redd.it/8az293c1e05d1.jpeg?width=3456&format=pjpg&auto=webp&s=a16e7765aa8682d5e164e6afbe20fe47c7badb5b\n\nanother angle",
            ">would Finasteride do anything for me at this stage, would risking the side effect be worth it.\n\nFinasteride side effects are temporary. So if you get them, they should go away in a few weeks after stopping the meds. Some people even get side effects in the first few weeks that just go away on there own, while they're still on the medication. \n\nIf you want to go all in, then you could start finasteride + minoxidil, then after 6 - 12 months (or longer) look into getting a hair transplant.\n\nYou'll never know exactly how effective it's going to be until you try, but you should see improvement for sure.\n\nWhether you want to do all of this or not, is up to you.",
            "https://preview.redd.it/ld4xfiogk15d1.jpeg?width=1477&format=pjpg&auto=webp&s=29a03b44064ffbb271a205a1f930fc096f96e98e\n\nClose up of my crown.",
            "Ur hair looks great 💯💯💯 keep doing wat Ur doing 👍🏽",
            "https://preview.redd.it/cbcg0e48d25d1.png?width=1752&format=png&auto=webp&s=4958636210aaf6a70983ec72c9a2b0432da89b98\n\nHere's a view from the right temple. Yes, I got white spots.",
            "I'm sure oral minox will help fill in Ur temple areas , give it a try ,, not sure why you waited all this time on fin , u needed to start both really 👍🏽 you just didn't catch it early enough unfortunately,else fin would have been enough",
            "whorl , don't worry 👍🏽",
            "[deleted]",
            "up Ur dose of oral minox 2.5mg , do not change anything else",
            "Seems thinning",
            "Not bad at all. I’d keep an eye on it for a year or 2 as it does seem like your corners want to recede.. if it does then yk the protocol . Finasteride",
            "microdose fin for protection , will help keep it intact for years to come 💪🏽",
            "A S A P",
            "I don’t notice any receding but I notice your hair thinning on the left side. I’d recommend getting on finasteride",
            "u need to get on finasteride asap , not onion juice 😉",
            "give the minox some time to work it's magic ,, at least 3/4th months , changes should be noticeable by then , and yep hop on fin wen you hit 18 ,, gud luck 🤞🏽🤞🏽",
            "Hop on fin, minor thinning in the front with the beginning of some temporal recession",
            "Super super minor temporal recession bro. Don’t think it’s even close to the threshold of being considered balding, but take fin if it bothers you!",
            "100% but you’ve got time",
            "500 is outrageous just wait til you move to the u.s",
            "dude , all you need is finasteride or dutasteride in pill form , that's slight crown thinning ,, you do NOT  need minox or any other sprays ,, look for cheap generic versions of fin or dut  , buy from your local pharmacy or online websites , or Costco  ,, Ur getting ripped off bad 🤤",
            "Yea",
            "Balding get on fin",
            "You can microneedle with minoxidil to grow a beard, I've seen very successful results starting with less than you",
            "keep taking the fin ,, buy a  dim supplement , will help balance out Ur hormones ,👍🏽👍🏽",
            "apply minoxidil to temple areas , that will straighten up Ur edges 💯💯💯",
            "2 heading into 2.5, finasteride asap",
            "Sometimes fin takes longer, I’d say wait for another 3-4 months before deciding",
            "heading into Norwood 2 territory lol, Lev the top as in , fade the sides , low zero 💯💯",
            "gud luck 🤞🏽🤞🏽",
            "looks like normal hair",
            "100% cooked without meds.",
            "https://preview.redd.it/ja79iatxcg7d1.jpeg?width=2316&format=pjpg&auto=webp&s=7eaf80e3017172cd11390822c3edceaee8cde670",
            "100% MPB. It started exactly like this for me at 31. Don't wait.",
            "not sure but 90% sure it's balding.",
            "yes. go for finasteride everyday 1mg",
            "It's not unusual to have a start of shedding around 30. I myself receded for the first time at 31. I think it started because of insomnia, but I would have balded sooner or later due to the trash hormone DHT.\n\nMy advice is this :\n\n* stop roids\n* go for dutasteride 0.5mg / day\n* minoxidil\n\nYou'll be fine but don't wait.",
            "if you have full beard, just get ride of it you will look handsome. don't worry",
            "Infrequent 0.25 mm is a good / cautious approach to avoid messing up the grafts while they heal. Longer needles (like 1.5 mm) can help with hair growth and absorbing topicals better, but they're best used once your scalp is fully healed. You can probably go deeper after 3-6 months. Starting too early could mess up your grafts.",
            "it's thinning fella , good you started finasteride 👍🏽👍🏽 push through the shed for now , gud luck 🤞🏽🤞🏽",
            "u could try saw Palmetto natural supplements, see if that helps ,, but defo need to push through the fear and get on finasteride the very least 👍🏽",
            "improve your diet (vegetables and fruits to guarantee vitamins) and physical activity (improves circulation, regulates hormones and anti-inflammatory effect). when you turn 18, go to a dermatologist to have fin or dut evaluated. your hair looks good, minoxidil should do a good job by then.",
            "fin Nd minox asap 💯",
            "I think u and me are on the same boat.I have been on both finasteride and minoxidil from the new year and till now no such great improvement or regrowth and only a heavy shedding and loss of density i have seen  but yes i will surely give it a full year as people say generally you can see improvement after 6 or 12 months.",
            "it looks like you’ve got a Norwood 2 hairline. I don’t know what your natural line was 2 years ago in comparison. You would benefit from medication, imo.",
            "these gaps between hairs are quiet evenly distributed all over my head",
            "I talked before, they gave me keto shampoo and it didn't work at all . I'm gonna change my DERM but the wait list is long",
            "We are in the same boat regarding diffuse thinning. If you check my comment, just gotta stick to the routine of medication and be patient for a few more months to pass if not the rest of this year. Visible improvement! Nice!",
            "You've definitely made progress! Continue to do what you're doing, consistently, for another year.",
            "Sorry for the lack of information.\n\nI’m 26yo and yeah I’m balding in front (diffuse balding), so yeah that’s why I’m asking for the crown)\n\nI’m on fin/min right now\n\nhttps://preview.redd.it/6i5s8he5lx3d1.jpeg?width=1008&format=pjpg&auto=webp&s=cc1c69027528bd6b1242f1d728eb5ef0eb2c19c4",
            "5%",
            "I use Hims, which is a daily tablet of 1mg fin 3mg minoxidil with some vitamins.\n\nThey say that preservation is important with regrowth.\n\nYour hair looks pretty healthy for 30 years.\n\nThe consultation with Hims is free. Probably worth hopping on medication to keep the mane into your 50's",
            "No",
            "Meds asap",
            "Will do thanks",
            "Thank you. I’ll try that out and let you know how it comes out.",
            "Ty mate u have put my mind at rest",
            "Thanks i purchased minoxidil a couple days ago its said to be coming in today",
            "Thanks bro, I really do be hyper-analyzing my hair because I’m 25 and a half, I feel old.",
            "thank you buddy",
            "That's the conclusion I reached after some more reading for sure. I'm also 60 pounds overweight, so it's a matter of patience for hair growth and effort towards exercise and diet! Let's go bro!",
            "Hi, thanks for the reply. What medication would you recommend? I’m kind of on the edge of trying fin just from what I’ve heard in terms of side effects.",
            "gud luck fella 🤞🏽🤞🏽🤞🏽",
            "Bro one more thing i will suggest you to give a dedicated full year on the trusted med and i believe after that you really don’t need any ht .All the best brother 🫂",
            "Totally fair. I was worried about my heart health from minoxidil and my package fertility from finasteride. \n\nI haven't experienced any trouble health wise with my medication.\n\nI use the Hims chewable daily tablet. It has 1mg finasteride and 3mg minoxidil, with other vitamins and biotin to help hair health. It costs 200$ for a 5 month supply.\n\nI also started using Mielle Rosemary Oil from Amazon as a nightly hair oil mask to accelerate my growth. I've been doing nicely.\n\n  \nMy dad had major diffuse thinning around his late 20's. I'm starting to see some of that happen for myself at the age of 25, so im working on preserving what i got.\n\nIf you click on my profile and look at my comments, you'll see the comparison of what my hair was in March when I buzzed it, versus what it looks like literally today.\n\n  \nI'm sure you can recover. The hair does not look AWFUL by anymeans. Just looks a little more like 28 versus 23 years old. Hope this helped!"
        ]
    },
    "12 Months Hair Transplant Progress / 3500 Grafts (1 YEAR)": {
        "title": "12 Months Hair Transplant Progress / 3500 Grafts (1 YEAR)",
        "score": 594,
        "url": "https://www.reddit.com/gallery/1dl8d1h",
        "content": "",
        "num_comments": 71,
        "comments": [
            "Bro went from 50 to 20, you look great!",
            "You look great! tell me where did you go? And are you required or do you also still do minoxidil/finasteride or just the transplant?",
            "What a glow up. You look great and easly 10 years younger. Happy for you.",
            "Great result there. I am curious why hair transplants are on black men always seem to look super natural",
            "I noticed at the 5 month mark when it was coming in, thats when you decided to put your earrings in. You feeling yourself 😂🔥",
            "Nice dude.  Best HT I've seen on here. :)",
            "My man went from looking 50 to looking 25 in one year. How much was it tho?",
            "Great success\n\n![gif](giphy|a0h7sAqON67nO)",
            "Congrats, that looks damn good!!",
            "W",
            "Wow looks great 👍",
            "If you don't take finasteride, you are guaranteed to lose your hair again just fyi",
            "Looks great, congrats. I'd be over the moon for the rest of my life with results like these.",
            "Looks amazing!!!",
            "Damn they did you right my boy, you look 20 years younger.",
            "Looking good!",
            "Ten years younger bro. Happy for you ☺️",
            "You look happy and that is kinda heart warming won’t lie",
            "oh wow very nice job they did. look great",
            "Holy shit. Congrats man. That's some jpegmafia hairline recovery level",
            "I would be helpful if we knew your age",
            "How long had you been losing hair?",
            "🤯 wow man!  Congrats!",
            "Not only your hair, but your smile grew as time passed.",
            "Wow this is very impressive! You look great",
            "Jpegmafia looking ahh",
            "bro went from ganondorf to goku",
            "The thing is, even though you’re just as well groomed beard wise in both pics, having a full head of scalp hair really makes the beard pop and contrast in a more appealing way. Looks great 👌🏻",
            "From homeless to never hoeless🤝",
            "You look like a new man. 👏👏👏👍",
            "Yes. I've had to cut down to 0.5 oral Fin as 1mg exacerbated my depression. Idk why ppl whom  have no sides reckons everyone else is overexagrerating or dismissive re nocebo effect",
            "Shaved off years",
            "look like a final fantasy character, chicks love that, stay on those treatments! what doctor if you mind me askin?",
            "Hey, bro where were the grafts from?",
            "Man the US doctors never look this good or maybe people here just don’t go to them",
            "Fucking fantastic",
            "Cost?",
            "You don't even have to look on the hairline ... the face itself tells you all about the success :-)",
            "Wow, looks great congrats. What a transformation",
            "Damna. Black don't crack",
            "The amount of people that get transplants before understanding why they need finasteride is staggering. It’s a shame to see all these nice HT’s go to waste.",
            "Not even an exaggeration. OP looking great!",
            "Why does he have to be a brother?",
            "thank you! i went to Heva Clinic in istanbul. i never took minoxidil or finasteride for the transplant. i just got it done and let the hair do it’s thing.\n\nAnd to those who are going to fin-splain me on the importance of fin: I am fully knowledgble about Fin, Min, DHT, all of that. It was my conscious choice to get a HT and not go on medication that i'm uncomfortable with, and keep track of any further hair loss if I do need to cross that bridge someday.",
            "Kinky/afro hair has a lot of volume so hair looks dense even without many follicles, plus the kinkiness makes the hairline look more natural, i.e. you don't end up with the unnaturally straight hairline you often see with transplants on people with straight hair.",
            "X",
            "Yep, 3, 500 grafts gone already. Less than 2K left when the rest goes.....will it be enough? It is irrational to negate meds, unless one experiences overwhelming complications. There are a number of different routes, topicals, etc that may assist with complications......",
            "From crackhead to crack dealer",
            "I am fully knowledgble about Fin, Min, DHT, all of that. It was my conscious choice to get a HT and not go on medication that i'm uncomfortable with, and keep track of any further hair loss if I do need to cross that bridge.",
            "So a FYI for others......the visual and physical density loss will not be apparent until your remaining natural hair reaches an approx 50% loss ratio. Due to this, then hitting the meds may have minimal effect, stabilising what is left, maybe? As at this point, the androgen steamroller has been left up and running for some time and has momentum that one will be attempting to stop.....best of luck.....",
            "Totally agree with you! And in reality, causes me distress how others entertain ignorance at the expense of verified (volumes of) evidence, that is now common knowledge......As great as this guys results appear it does look like from (initial before photo) he's off to a NW5/6.....try reeling that in with meds once aware, and/or getting HT'd to fill in.......",
            "Bro went from sexual harassment to stealing your girl",
            "Just incase the doctor who did your procedure didn't elucidate this to you, androgenic alopecia will likely continue to wreak havoc on the rest of your scalp hairs (provided you have aga).  \n\n\nThe results of your HT are really impressive, your hair looks amazing. It'd just be a damn shame if you end up with continued miniaturisation of the rest of your scalp hair by not being on a 5ar inhibitor.",
            "Thanks. I’ve been finding doing the minoxidil and finasteride routine for life to be a big pain. I’ve been thinking about just getting a transplant and seeing what happens I only have frontal loss.",
            "Get on fin asap homie",
            "I am in the same boat my man and it’s refreshing to see this comment didn’t get downvoted.",
            "Fin-splain? Lmao bro it’s literally a scientific fact that you will relapse without them. Why not try them and then cross the side-effect bridge if you need to some day",
            "I totally get it man\n\nI put off taking fin for almost a year. Flew around the country saw hair transplant docs, contacted a dozen compounding pharmacies, looked into topicals, researched the risks of NAFLD and impotence etc etc\n\nMinoxidil was even worse for me. I was terrified to take that shit\n\nEventually just said fuck it and started using Xyons topical hair loss formula which is absolutely insane at 2.5% \n\nI still keep super low dose minoxidil usage at 2% because again I'm cautious \n\nI haven't noticed anything. Been on it 4 months now.",
            "You obviously know this from what you have noted in your comments (?) So a FYI for others......the visual and physical density loss will not be apparent until your remaining natural hair reaches an approx 50% loss ratio. So you will have lost half of you native hair density before you actually realise it.  Due to this, then hitting the meds may have minimal effect, stabilising what is left, maybe? As at this point, the androgen steamroller has been left up and running for some time and has momentum that one will be ***attempting*** to stop.....best of luck.....",
            "because women are either sexually harassed or stolen",
            "I second this.  You don't want the rest of your natural hairs to be impacted by androgen activated hairloss.  It's worth at the least taking Finasteride.",
            "The doctor does mention it, she personally told me I’ll probably need another HT in the future",
            "If you don't take fin/dut then you will continue to lose hair while your transplant hairs remain. It will look pretty funk at some point.",
            "You're providing an informed rational example of how to proceed, top stuff! Somehow though, downvoters from the 1300's have managed to infiltrate all these posts.......",
            "Not at all, some people the sides are simply not worth it, for example I have a minor heart condition, taking Fin has a high chance to exacerbate the issue. Not worth it. Could be similar for others",
            "I think Min is not advised for people with any heart conditions.",
            "Didnt a study came out a couple of months ago proving the exact opposite thing",
            "Are you sure about that? [https://www.medicalnewstoday.com/articles/hair-loss-drug-finasteride-may-also-reduce-heart-disease-risk](https://www.medicalnewstoday.com/articles/hair-loss-drug-finasteride-may-also-reduce-heart-disease-risk)",
            "Yeah, see my link in this thread......some BS abounding with the initiator of this thread........and being d/voted for the link.....wasters."
        ]
    },
    "Some more realistic 15 months fin+min results. No loss, but also basically no growth. HT unfortunately seems like the only option left at this point :/": {
        "title": "Some more realistic 15 months fin+min results. No loss, but also basically no growth. HT unfortunately seems like the only option left at this point :/",
        "score": 21,
        "url": "https://i.redd.it/x74c797od38d1.jpeg",
        "content": "",
        "num_comments": 30,
        "comments": [
            "It looks like this is a **progress pictures** post.\n\nThis post should contain before and after photos at least one month apart. Make sure to list all the treatments you're on, including the dose and frequency.\n\nTressless now has a dedicated website to keep a long term progress picture journal, which you can try here without waiting for moderation: [https://tressless.com/start-journal](https://tressless.com/start-journal)\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/tressless) if you have any questions or concerns.*",
            "unfortunately bro you started too late... Good luck",
            "It's time to fly to Turkey.",
            "Could be the lighting but it looks like you gained a good deal of density",
            "Trying to be as objective as possible but aside from perhaps stronger medication a hair transplant or two seem to be the only options yet. But I do think it can be filled in very nicely by a competent clinic.",
            "My hair is similar to yours, how is your donor area?",
            "Try dutasteride and oral minoxidil",
            "u definitely have growth loll , side temple areas (corners near the eyebrow ) mid scalp area 😉 it's just not enough , if you could try get hold of dutasteride 👌🏽👌🏽 else stick to sed treatment and up the oral minox drops 👌🏽👌🏽",
            "Sorry",
            "This is the more typical results. Started too late like most guys do.\n\nThe good news is the fin is working. There's no loss.\n\nGet a transplant. Stay on fin.",
            "I think considering your starting point was almost bald, you've gained a decent bit of density. If you use the large mole as a reference point you can see how much it's filled in. However you have unfortunately started too late. Seems like your options are HT (perhaps multiple) or hair system, or bald",
            "You need leg training and cold shower ASAP - [https://www.reddit.com/user/MagicBold/comments/1cv2bog/brief\\_explanation\\_of\\_the\\_physiometabolic/](https://www.reddit.com/user/MagicBold/comments/1cv2bog/brief_explanation_of_the_physiometabolic/)",
            "Maybe a tiny bit, like hair that was thinning then is now healthier and thicker but I'm pretty sure the actual hair count is basically the same. Trust me I have taken a LOT of photos since I started",
            "^[Sokka-Haiku](https://www.reddit.com/r/SokkaHaikuBot/comments/15kyv9r/what_is_a_sokka_haiku/) ^by ^DelewareTrails:\n\n*Could be the lighting*\n\n*But it looks like you gained a*\n\n*Good deal of density*\n\n---\n^Remember ^that ^one ^time ^Sokka ^accidentally ^used ^an ^extra ^syllable ^in ^that ^Haiku ^Battle ^in ^Ba ^Sing ^Se? ^That ^was ^a ^Sokka ^Haiku ^and ^you ^just ^made ^one.",
            "How so? The lighting is more favorable in the second picture, and even then you can look all the way back into the crown.",
            "It seems... Fine I think? But I doubt I'll be able to afford a proper transplant for the next few years anyway so for now that's pretty much out of the question :/",
            "Have you seen his eyebrows? Dude is definitely on oral minoxidil.",
            "Pretty much can't get Dut here in Europe and I'm already on oral min (well technically I \"drink\" topical min cause I can't get real oral min either but same thing)",
            "How much are you looking to get back to be satisfied?",
            "In the first pic you can see the entirety of the scalp(and curve of the left side of his head) everywhere he has hair, much less so in the second pic - the front tuft of hair reveals way less scalp especially. He also has baby hairs coming in that close the distance between his hairline and that mole - where before that area was slick bald. I’m not arguing that he doesn’t need a HT to accomplish his goals, just that I see gains.",
            "Why cant you? In the Netherlands is it possible",
            "You drink it? Can you explain this lol.  Also I think you gained a bit of density. You should try dermarolling too",
            "At this point not being so diffuse that I look like a NW6 under the sun would be nice...",
            "I don't know where OP is from, but at least in Finland it's pretty hard to convince any doc to prescribe meds for cosmetic issues.",
            "Well when I asked my doc he didn't even know what Dut was lol. He said that it would be off label use which would be risky for him to prescribe if not illegal? I suppose fin can slide cause it's way more popular and the safety/efficacy is proven at this point. Didn't want to give me oral min either cause it could cause lower blood pressure and it would be \"merely\" for cosmetic purposes which he didn't think had a higher priority over safety. I could always see other doctors but then again I'd have to pay 40 bucks most likely just to be told the same thing",
            "Right on, admirable goal! Obviously you could get a HT if you have the money. I’ve seen people here get few results until the 2 year mark and their progress began to rapidly advance, so definitely continue treatment! From seeing results on this sub and also from me personally experience I would reallly recommend you give microneedling a go. It’s not a major commitment and has been a total game changer for many.",
            "I am fighting to get dut/fin here in Romania after I moved from Poland. Even as I was prescribed the doctors are just going „oh, it’s okay to be bald, there is so many bald men” or „I am not going to prescribe something that will make you infertile!” \n\nSpend good portion of cash only to hear shit like that. Or doctors luring me for „make blood tests first” and when I give them recent ones „oh there is nothing I can do, sorry”",
            "Try telemedicine",
            "Yep. And if you manage to get prescribed, it's the expensive brand or there is no generics, or the generics cost almost as much brand name meds. I can only watch in awe when people write how they spend something absurd like 10 dollars/three months supply of fin. I pay 160 euros for the same stuff.",
            "What the fuck."
        ]
    },
    "Shedding at 7 months finesteride ": {
        "title": "Shedding at 7 months finesteride ",
        "score": 10,
        "url": "https://www.reddit.com/gallery/1dlu09e",
        "content": "Shedding since the last month's and had significantly lost some hair is it. Is it not normal to shed this much at this point",
        "num_comments": 2,
        "comments": [
            "It looks like this is a **progress pictures** post.\n\nThis post should contain before and after photos at least one month apart. Make sure to list all the treatments you're on, including the dose and frequency.\n\nTressless now has a dedicated website to keep a long term progress picture journal, which you can try here without waiting for moderation: [https://tressless.com/start-journal](https://tressless.com/start-journal)\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/tressless) if you have any questions or concerns.*",
            "keep it up bro i am on sixth month i was shedding like crazy since april and mine just stopped but i lost a lot of density on my corners that i previus had  idk if i recover it i will keep going"
        ]
    }
}