{
    "Elden Ring: Shadow of the Erdtree Release and Spoilers Mega-Thread": {
        "title": "Elden Ring: Shadow of the Erdtree Release and Spoilers Mega-Thread",
        "score": 49,
        "url": "https://www.reddit.com/r/TwoBestFriendsPlay/comments/1dkf7ar/elden_ring_shadow_of_the_erdtree_release_and/",
        "content": "Since Shadow of the Erdtree is one of the biggest releases of the year and people are going to have a lot to say about it, we’ve decided to create this mega-thread as a discussion hub for you all. Please try to keep the talk about it confined to here, whether it be speculation or spoilers (gameplay talk is fine, but tag spoilers on major bosses, lore reveals, things not in the trailer, etc.). Once it’s fully released, we’ll be keeping an eye out for untagged spoilers, so be sure to tag them properly since we’ll be handing out temporary bans based on severity otherwise.\n\nOther than that, have fun, and pour one out for Glaive Master Hodir!\n\nEDIT: Some users suggested that I add in the group passwords for CSB fans to use when playing online, so please enter the following passwords if you’re interested:\n\n- Koopy\n\n- EVILLAK",
        "num_comments": 187,
        "comments": [
            "I can't believe the mini-boss in that little tomb near the start is >!just Guts. Here's a dude with an auto-crossbow and a greatsword. Who drops Guts's armour set.!<",
            "It's not out in my timezone so I'm just gonna use my third eye to see into the future and say that the new superboss is Dread Wyrm Thregordiax, a 0-headed dragon that uses the new status effect \"Deathblight 2\" and exclusively attacks with backflips.",
            "Just started up the game and realized I’ve completely forgotten how to play it well in the 8 months or so I haven’t played it. Guess I’m going to spend a week or two relearning all that muscle memory before I buy the DLC.",
            "So I just got to >!Belurat Gaol!<. All I have to say is what the actual fuck. >!Everything about the jars is so much more morbid now, I audibly shouted holy shit when I saw the first naked jar thing!<",
            "\"It is about the size of Limgrave.\", Miyazaki lied as easily as he breathed",
            "have any of yall fought >!Boc-shaped Vergil!<",
            "Wow, I can't believe Messmer walk up and Messmerized all over those people.",
            "Castle Ensis boss spoiler: >!Rellana is a fucking bitch but she's so cool. That arena spanning magic sword is the raddest shit!<",
            "I fucking beat Malenia in under 15 attempts, solo. I feel SOOOO FUCKING GOOD.",
            "Taking bets on Ulcerated Tree Spirit round 17.",
            "Just a heads up to people on Steam, I had to restart Steam before the DLC would download. Might be obvious to some, but figured I'd share. Have fun everyone!\n\n\n Update after day 1: CURSE YOU >!BAYLE!<!!! I HEREBY VOW YOU SHALL RUE THIS DAY!!!",
            "Shoutouts to the game immediately reminding me how hard enemies input read by dodging my spells as they're being cast",
            "PSA: if you wanna get your hands on the sick Backhand Blades you've seen in previews, go to the Northeast corner of the first chunk of land you enter into the Shadowlands, past the flaming wickerman giant. Look for a lone stone gazebo guarded by some enemy groups; it's just sitting there. The moveset is sick as fuck.",
            "I miss putting hats on the messengers in bloodborne. I imagine they're like birds and giving one a cool hat makes them powerful in Messenger Society",
            "I'm a IDIOT and a FOOL who decided a couple months ago that I wanted to go into SOTE on a new save despite being an adult with a job, now it's launch day I'm still nowhere close to Mohg. Time for me to go dark, it's been real guys, peace. ✌️",
            "Damn they nerfed Taker's Flames, my strategy is completely dead, guess I'll have to actually play the game.",
            "Not 2 hours in and I find a poison swamp >!with A FUCKING ULCERATED TREE SPIRIT IN IT MIYAZAKI YOU HACK!<\n\nOtherwise, DLC good.",
            "The >!Divine Beast Lion Dancer!< boss is so fucking cool oh my god I just did it 10 minutes ago",
            "For those that are interested, (gameplay spoiler) >!dragon transformation is back!<",
            "Downloaded the DLC, went to spooky shadow land, walked around a bit and got mauled to death by a naked man.\n\nHell yeah baby, Elden Ring is back!",
            "Without reading the thread to avoid spoilers, I'm just going to leave this here:\n\nI'm loving the DLC but I'm absolutely fucking livid that they brought back >!Ulcerated Tree Spirits.!<\n\nI've only run into one so far but you know there's gonna be like 9 others in the game.",
            "Finally an fp regen talisman that doesn't have a condition! Sure it's 0.5 fp per second but that's more than enough time to use the good regen spells and get back to full, as well as \"meh I dont wanna pop a flask while I'm riding away\" situations \n\n\nIt's technically pretty close to the entrance, too, but you do need to take the long way around to get up there. \n\n\nEdit: now that I have passive fp regen the mind goblins are allowing me to use dragonbreaths casually, and it turns out the weird man-flies heal from scarlet rot so use something else",
            "I beat the fucking hippo",
            "Yeah! The Blessed Blue Dew Talisman! They did it! ",
            "I have somehow bumbled my way to the highest and lowest points around the southeastern corner of the map, I think. Ahem.\n\nHighest: >!Bayle!< is so fucking crazy in terms of design and difficulty, even for this DLC. >!A roided dragon with literally only one intact limb that can obliterate you in a second!< is so far beyond what I'm capable of handling at my current level, but I love it all the same.\n\nLowest: What the FUCK is the >!FINGER RUINS OF RHIA!< WHY IS IT >!A MAP-SIZED FINGERPRINT WITH GIANT FINGERS GROWING OUT THAT HAVE FINGERPRINTS ON THEM!<",
            "(major lore spoilers) >!The DLC having fucking incestual near pedophilia relationship with Radahn and Miquella and it being partially responsible for Caelid's existence is... interesting lmfao.!<",
            "Well after two days of almost no sleep I beat the DLC and I gotta say, major spoiler btw >!We owe Mohg a big big apology!<",
            "u/induman forgot that he made his completed save ng+ and didn't go any further than Godrick.\n\nMaking him tonight's biggest loser!",
            "I know kung fu...",
            "I can't believe the final boss was >!Leonard!< coming back for Round 2",
            "**Belurat Dungeon boss spoilers:**\n\n\n>!I have had it up to *here* with this fucking Dancing Lion Bullshit Bastard.!<\n\n>!The way it twists and turns during attacks and how it’s big ass robes cover it’s body in such a way that I can’t even tell what fucking direction it’s gonna attack me in is horseshit.!<\n\n>!Yeah yeah, “git gud”. I don’t think my eyes got the memo, because most attacks this boss does are just a blur. I literally cannot tell where it’s head is at half the time with the way it’s twists it’s body around during its attacks.!<",
            "I cannot wait for there to be like three or four consecutive reveals which recontextualize half the game. At least one of which is going to also double back over what we assumed was foundational knowledge. ",
            "Meticulously planned for DLC, got killed by the first enemy while I was taking in the splendor.\n\nAw yes, we are so back.",
            "After playing a full game only using the morning star cause I love heavy bleed. \nI have finally found a replacement \n>!Thank you heavy dragon katana!<",
            "I've been playing the DLC for about 5 hours now and this shit is ridiculous, it just keeps going and going and going in every direction, i haven't even entered the first legacy dungeon, im still exploring the starting area.\n\nHell, even the mini dungeons seem enormous, i just beat a catacomb that had 2 stakes of Marika in a row.",
            "I didn't expect the very first weapon I picked up to immediately replace my current ones, but holy hell the >!backhand blades are soo good!<\n\nPeople are gonna fucking *complain* about those",
            "Man the bosses so far have been kind of frustrating with how much health they have for how fast they are.",
            "Ok, so I’ve been dealing with >!Rellana!< at Castle Ensis for a couple of minutes now.\n\nJesus Christ, this fucking boss. I was gonna compare her to Malenia for how stupidly aggressive and hard-hitting she is, but I realized there’s an even more apt comparison: she’s >!a beefed-up version of that stupid banished knight in Castle Sol. Y’know, that one that teleports behind you with the 10-string combo? Rellana is THAT, but in boss form. And it is not any goddamn fun.!<\n\nI FINALLY BEAT HER! FUCKING CHEESED HER WITH SCARLET AEONIA, BUT IT IS OVER! SCREW THIS BOSS!",
            "Still got a bit to go until the dlc is unlocked, but after updating and getting the option to toggle most recently used items and mark newly acquired items is gonna be helpful on this journey. Also>!Mohg's arena is now a noncombat zone !<Take that as you will.",
            ">!Rellana!< is so far a contender for my favourite boss in the game, got her in 9 attempts with no summons :). The Pontiff comparisons are the obvious ones but honestly I found fighting her felt more like fighting Maria, which is good because Maria is my favourite boss in the series.",
            "The damage output on these bosses is insane. I got 13 stacks, medium armor, 50 vigor and defense talismans and I'm still getting shredded. And the aggression, at least Malenia had the decency to let us walk in the door (aside from the first time).",
            "I've gotta be honest, some of the story parts of this DLC left me really disappointed. Even if it wasn't all done by him >!all those story plots about Miquella absolutely *reek* of GRRM. They literally made the little bastard Griffith. I wanted to see Miquella end up being on of those people that has powers incompatible with their goals for a better world. Or that using his powers to make things better in the Lands Between had drastic consequences that made other parts of the world worse. Maybe even have him be one of those \"I've done too much to deviate from my current path\" kinda anti-villains. Hell, even delving into how too much pragmatism in wanting to achieve your goals is sometimes the wrong thing to do. Not that he was just some fuckin' yandere that went too far.!< \n\n>!Then there's that whole thing with the Mother of Fingers and the Greater Will being not involved at all that really fucks with poor Goldmask's ending. What was originally was a nice secondary \"good\" ending/perspective now becomes completely worthless, as the Golden Order never had any legitimacy to begin with. Him fixing the broken code of the GO to be more fair is all for nothing because the whole *concept* is meaningless.!<\n\nRather a bit of a wet fart for me, while also messing with several other characters' motivations in a rather disappointing way.\n\nGotta admit though, this new context makes a quote I saw on reddit during the leaks *funny as fuck*: >!\"Looks like Mohg **is** beating those allegations!\"!<",
            "The fact that they added a gameplay spoilers >!Sekiro-like deflect crystal tear!< has made me real excited. Doesn't look quite as effective as the equivalent ability in mods like Elden Ring Reforged, though.",
            "Can confirm, shit is BIG",
            "Messed around a bit but haven’t touched the dungeons yet. So far I’ve found a great hammer for str builds following the path east from the first grace, have to go down a little bit, it also has a unique guard counter. Just north of the first grace got attacked by the>!weird dancer thing from the trailer that dropped some backhand blades!< . Beat the >!Wickerman!< >!the trick is it takes like 80% of its hp in a critical attack, beating it gets a rare craft material and the physic drop that lets you parry guard.!< Just east of that is the backhand blades. Also fought the >!Knight of Solitude (Guts) in the mausoleum west of the first grace to get all his gear minus the crossbow.!< Major tip for that >!guy is that he’s real easy to punish after his crossbow shot and you can just circle run to dodge it, hits like a truck though.!<Nothing else insane yet, area is real cool. Still looking for the hand to hand fighting stuff.",
            ">!Relanna is a fuck!<",
            ">!ALL YE SPURRNED BY GRACE  \nKNEEEL YE FOREVERMORE  \nBEFORE THE FLAME OF MESMER!<",
            "Oh man watching woolie go out of his way to eat every crossbow bolt from the blackgaol knight, even when he was completely safe, has been something special.",
            "perfume talisman makes your perfume weapons do 50% more dmg this is disgusting lmao i love it",
            "Anyone get to Messmer yet?",
            "I've found maybe like three incantations and two-ish spells >!not counting the funny spell vendor!<  \nI wanna find more cool shit to throw. I want more than a grand total of two messmer incantations",
            "I spent fucking 3, maybe even 4 hours fighting female Pontiff Sulyvahn at Castle Ensis, from like 5 AM to 9 AM now, oh my fucking God. Just Helphen Steeple, tear to make sfancs breaks easier, no summons or spells (not like I'd have any fucking time to cast any).\n\n\n\n\nI don't even think it'd right comparing sulyvahn to her, he fucking oks like he's in slow motion to me now after that entire session.",
            "anyone else noticed they really haven't promoted GRRM's connection to the game at all in the dlc or game marketing in general lately? Seems like they'd have capitalized on that with House of the Dragon returning in the same window. Not a big deal to me, just odd. I do wonder if he had any input with the additional Marika or Messmer lore, as in, did he conceptualize anything in SOTE during his initial consultation.",
            "Rellana twin knight is some cheap rubbish.\n\nAlso sick and tired of the constant \" unable to summon error \"",
            "I would honestly 100% rather fight the Godskin Barbershop Quartet than a single NPC with high poise and big damage.\n\nElden Ring's NPC fights suck dick and essentially starting the DLC with one is an all-time bad decision. I _wanted_ to have fun today...",
            "About 10 hours in and I think my biggest complaint so far is that this map could’ve still been way smaller and not much would’ve been lost. It feels like they overcorrected from the complaints about the boss reuse/mini dungeons and just left a lot of empty space. \n\nFrom a visual standpoint they’re using the scale very well, but I thought I was going insane in the >!Finger Ruins!< in the south because there’s this massive space and not a boss to be found.",
            "I'm just waiting to learn if any of the new Weapons are Firearms. I'm a big supporter of Firearms in Fantasy Games, you see.",
            "Loving it so far. My character is pretty OP, playing on a file where I cleared the base game, never went NG+, but my character is level 253. You will def do yourself a lot of favors by collecting scadutree buffs, but i think a lot of the reviews complaining about the heightened difficulty overblew it. Some of the normal enemies have a higher damage scaling, but that's about it. Some of the secret bosses tho, YO. Idk if i'm winning those fights lmao. One fun little thing about the lion dancer: >!if you go back to the storeroom and talk to the grandam after the fight, she won't talk to you, but if you put the dancer head on she has extra dialogue!<",
            "If anyone's curious I saw leaked gameplay footage a few days back and within the first 15 minutes they had come across a fast travel coffin",
            "Got a question for people who know. Just a yes or no, please. \n\nDoes the DLC include any new whip weapons, or any new ashes of war that can be used with whips?",
            "Does anyone know if you get a new ending from beating the dlc and then fighting elden beast or if you can do the beat elden beast first and be fine. I got a save specifically with only the final boss left and wanna know if I should do that first or last",
            "I like how I spent the past few weeks grabbing every weapon, every armor set, talisman, etc. and even respecced into a Quality build to use as many of the new toys as possible.... only to walk into the DLC and immediately respec back into my Arcane/Faith dragon build and start spamming breath attacks.  Do have a question though >!for anyone else playing... is there any new dragon incantations?  Don't need a where, just a yes or no.!<",
            "Leaving this comment since I likely won’t be able to start it until Saturday or Sunday, but can anyone confirm if there are snakes in the dlc? I have a phobia and FROM loves put them in their games. I know one of the main guys has a snake motif but I don’t know to the what extent (like if its just more or less part of his outfit or if it can attack). I hate that I have to check this stuff before playing but it’s genuinely difficult for me to do content involving them without freezing up. ",
            "[deleted]",
            "I spent an hour about on what I was sure was a jumping puzzle at one of the churches. It wasn't. Still fuckin got up there, though. Should have left a message to screw with the next person who thought the same as me.\n\nAlso, it is really sorta jarring coming to this game from DS3. In that game, the Manual Attack Aim option works properly, which lets you angle the attacks of certain larger weapon classes while locked onto an enemy. You have to stop holding inputs whenever you perform an attack, to prevent any unintentional angling of it, but as a consequence you're able to much better respond to people trying to run around you. If you want to remotely have a chance in PvP with ultras, and just make them feel a lot better in general, you want to be using this option.\n\nIn this game, it's in the options menu but does literally shit all. Like I think I remember asking someone & apparently it's on a tiny handful of attacks. So I've been finding myself locking on & then using attacks that I keep thinking will hit if I input the right direction. Except since I locked on, the game's not gonna let me influence the direction of the attack. So there's been a lot of unlocked camera gaming going down, since you can still properly input directions when unlocked. Which really makes me think this has to be a bug that they somehow haven't noticed, despite people reporting it.",
            "So anyone whose played far enough to know, whats the NPC quest situation like? Are they straight forward or are there some Milicent situations/obtuseness to deal with?\n\nI only just entered the DLC and beelined the Gaol Knight for his sick ass drip(beat him first try by almost literally the skin of my teeth, this DLC FUCKS).",
            "I haven't really found a good place to ask this without being exposed to spoilers, I just have one question: Did they change how powerstancing maces and axes work? Those tend to be the worst power stance moveset cause of how slow the start of the chain is. I knew about the Torrent change to the final boss fight in base game so I thought maybe they adjusted that as well too.",
            "Currently badly lost in the DLC, have successfully defeated two major bosses but still can't handle the fucking Blackgaol Knight. Game's great.\n\nOne thing I dislike: I'm at rune level 166-170, all of the bosses only give half enough runes for a level, so I find myself 'porting over to the Albinauric cliff every time to farm the remainder. It's screwing up the flow. Yes it's my own fault but I'm not about to lose that many runes.\n\nOne thing I really love: no DLC trophies equals no pressure to 100%. I can play and explore the world the way I like. It's a nice change of pace for PS5.",
            "anyone else semi/fairly finished with the expansion? I know a lot of people are having trouble with >!Rellana!< but I didn't really have a lot of trouble with the main bosses, I thought the absolute worst things were the >!Putrescent Knight, fuck that guy because who on earth is playing a FAITH/HOLY build, the entire specimen storehouse, which wasn't bad just incredibly annoying enemy placement, and then like 90% of Enir-Ilim, the lion mask guys SHOULD NOT be able to respawn, holy shit that was infuriating and made exploration impossible.!<",
            "[Man this DLC is brutal.](https://x.com/jwulen/status/1804168255264755817?s=46&t=c6de8KiYeeQRYBcZ7UoWTQ)",
            "Wonder if we will ever get fun original boss ideas from From Software again at this rate. I miss Demon's Souls. I'm both having a great time and an awful time. Wish they would stop with bosses so big that they are mostly see-through.",
            "I somehow accidentally beelined it through the MSQ and reached the final boss at almost exactly 12 hours.\n\nI'm missing like 2/5ths of the map and I think I've only seen like half of the remembrance bosses. I don't know what's going on in the story and I'm scared. Help.",
            "FUCK. COMMANDER. GAIUS!\n\nI hope he rots in the deepest parts of hell, I hope his boar becomes meat to serve at an Outback, I hope he accidentally levitates himself outside the stratosphere and suffocates, I hope his lance is shoved up his ass, I hope someone shits in his armor in the morning and he puts it on without noticing, I hope his boar gets covid.",
            "This DLC makes me hate myself.",
            "[deleted]",
            "Messmer boss. From is garbage. I can't believe people try to justify this awful game design. \n\nGames should have a balance between fun and challenge. From's design philosophy is absolutely moronic. This DLC is objectively awful. Bosses almost one shot you with insane tracking with a shit ton of health. \n\nIt's constant anxiety and frustration mixed with tedium. Not once was I having fun. \n\nTerrible. From needs to go back to Bloodborne difficulty. That is when they peaked. \n\nFuck this dlc.",
            "Ok From, fuck off with >!Rellana!<\n\n>!Pontiff from DS3 was rough because he did near constant, long ass combos and had few openings. But his damage wasn’t unreasonable, and his poise wasn’t too high and his attacks weren’t lightning quick.!<\n\n>!Thanks for making a boss that does the same thing, but they have more health, *more* Magic projectiles and AOE interspersed between combos, *and* each of their super fast hits takes off half my 60 Vigor and 5 Scardutree buffed healthbar.!<\n\nSo far in my experience, this DLC has such a drastic difference in quality/enjoyment between its two main draws, it’s insane:\n\nThe new environments and Dungeons are beautiful and intricate, absolutely peak exploration and world design.\n\nOn the other end of the scale, the 2 Main Bosses I’ve fought so far have been completely unfun to fight. The first one had me battling the camera more than the boss, and this second one has zero openings and does half my HP (with +5 Scardutree buff thing, that shit makes barely any difference) per hit in its infinite combos.\n\nDark Souls 3 remains the peak of FromSoft’s dodge-based combat games, bosses and all.",
            "I did the ragequit spoiler tone every little thing I'm so fucking done with this game I don't even care that I payed money just tell me what the fuck has happened in the femboy's egg, where he is and why his minions hate Marika's tits",
            "There is a thought that has been bubbling in my gut since last year and I must expel it:\n\nGame of Thrones, its terrible ending and the discourse surrounding it has poisoned the Dark Fantasy genre and the perception of it.\n\nDespite, say, Final Fantasy XVI doing what GOT *should have done*, >!it is said to have abandoned the \"GOT vibes\". This is in spite of how the thing with the Blight (Winter) and the Akashic (White Walkers) become among the main threats after the political nonsense falls apart because the people in charge were irresponsible and short sighted *just like the GOT people*. But no. Cersei and Dany facing off is the final boss fight. Not the Night King. Not the existential threat that is an allegory for the climate crisis. Something GRRM wrote to be something everyone needed to put aside to fight.!<\n\nalso, despite the marketing, XVI is more Berserk than GOT.\n\nBut it. It angers me. >!Partly because people spoke about how XVI \"abandons its politics\" (but it doesn't really) and how I consider that a big spoiler to even discuss vaguely that people happily talked about, but how XVI clearly looked at GOT and thought \"Well, this is how it's gonna go, surely.\" Like, XVI is only good because it's about petty nobles arguing and warring when they're ignoring the real problems and I'm just going in circles here cause I'm ranting. Only thing that it doesn't really do is that the final boss fight is just Clive vs Ultima, but even then, symbolically, his friends are helping him, and doing the side quests you see people do come together. Put aside their differences to fight bigger problems. Make new allegiances. Hope for a future now that the political war mongers are vanquished. Because the game makes it clear defeating the Big Bad Ultima won't save the world. Just give it a chance. Like if killing the Night King didn't stop Winter, just stopped the White Walkers. Even if it was Jon Snow or Arya or whomever dealing the final blow, that the real battle would be people fighting the winter, struggling together to survive.!<\n\nI mourn for the next Dark Fantasy that tries to do a good version of Game of Thrones.",
            "Oh good you’re right.",
            "You sure it's guts and not that shitty knight that sicked 100 dudes on him?",
            "My brain went to >!DS2, he feels like a Dark Souls 2 invader NPC!<, but yeah yours makes more sense.\n\nI felt further vindicated in my assumption when I went the other direction and got >!ambushed by [an escaped \"Bloodborne on PC\" developer](https://www.youtube.com/watch?v=X0mWx8oFMlI).!<",
            "Sorry, but I think you accidentally made a Monster Hunter Wilds prediction",
            "I legit recommend going to a NG, pick a starter class with a weapon or build closest to what you want, then re-training your reflexes on Tree Sentinel and Margit at base level and only 3-4 flasks.\n\n\n\nReacquaint with Elden Ring boss design. Margit requires not panic rolling, strafing/re-poisitoning to bait out certain attacks, avoid certain attacks, or be in the right place to pull off a charged attacks,  and maintaining aggression to prevent his stance from recovering so you can break it and get a crit off.\n\n\n\n\nTree Sentinel has the same philosophy, but also the importance of jumping as in his second phase, he has a jumping shield bash that slams on the ground in an AOE that's easier to avoid by jumping instead of rolling.",
            "Kind of the same, but also my build was a basic bitch greatsword build so short learning curve \n\nCan I unga bunga? No, then block until I can unga bunga. Is blocking not working, then roll before wakeup unga bunga.",
            "It was genuinely the most nasty shot I've seen fromsoft do in any of their games, at least since the cursed fetuses from demons souls",
            "Yup yup yup yup.  \nThis was the last thing I did last night before going to sleep and it was absolutely nightmare material. So fucking startling the first time you see one!!",
            "It seems like the Scadutree traditions with living jars are a bit different from how they occur under the Erdtree, so that may not apply to the jars we're familiar with from the base game, they might just be freaks like that.",
            "I lions clawed that thing the second it fucking moves",
            "That dude was just fucking >!YODA-ING!< fucking everywhere. >!Onze took all the power of the demihumans for himself.!<",
            "Yep, and I got the sword he uses from another miniboss fight.\n\nIt’s so good on an INT/DEX build like mine, I love it. The Weapon Art is fucking nutty.",
            "He got me twice third time he went down pretty easy to stagger and deal a crit",
            "Not one of them was ready for 18 inches of Messmer.",
            "yo when she did the wind up for the >!double moon!< I was like, \"how bad could this be, i'll just get out of the-AAAAAAAAAAH\". >!Kind of disappointed she didn't get a cutscene or dialogue tho!<",
            ">!I thought Carian Knight Moongrum was bad but JFC Carian Knight Moonrithyll is a beast. Has a real neat Colossal Sword I'm using on my INT/STR build now, but damn.!<",
            ">!I literally just fought one in a poison swamp.!<\n\n>!It dropped a poison resist +2 talisman, so I can only assume there will be more!<",
            ">!there's one in the first dungeon!<",
            "This sub will always have love for a screamlord.",
            ">!That dude is the best in Bayle's fight as he just shit talks the dragon!<",
            "It was sub 1MB a second for me and was gonna take 5 or so hours (Manchester servers). I've changed my region in settings to a different country and now I am getting 15MB a second. So if anyone else is frustrated with slow downloads on Steam, give this a go.",
            "There's a reason my full caster character just has several spells they can't dodge properly on the hotbar, like Night Comet and Honed Bolt.",
            "Never forget: Your cast button is also the enemies' dodge button.",
            "Same a$$ predicament bruh lol i havent even beaten shade godfrey yet smh",
            "I can't believe it took them this long honestly, lmao.\n\n\n\n\nMassive damage, heals substantially and can be stacked, knockdown, extremely spam marble after recovery. Like I'm fine with how broken it is in repeat playthroughs or characters, but for a first time picking it up? It's absurd.",
            "Maybe give Vacuum Slice or Corpse-Wax Cutter a shot and see if they have knock-down.",
            "2 hours in and I've found endless empty spaces. So as the base game. Looks like bare MMO. Welp, who couldn've thought.",
            "I've seen 2 so far and in the starting zone and I think there's more",
            "On one hand, holy shit I'm so tired of fighting them.\n\nOn the other hand, I laughed *so* damn hard while shouting \"MIYAZAKI YOU FUCK\" when I found not only my first poison swamp, but an >!Ulcerated Tree Spirit!< inside of it.",
            "Easily my most despised enemy in Elden Ring",
            ">!Radahn: \"I'm not gay Miquella\"!<\n\n>!Miquella: \"Bet.\" *Gets his sister to nuke Caelid* !<",
            "Haven’t played the DLC yet but the wording of the Radahn fight calling him the “Promised Consort” to me implicates a one-sided relationship and the fight in Caelid could have happened because Radahn didn’t want to be involved with an Empyrean and it was more what Miquella wanted",
            "On the plus side, shouldn't take THAT long to rush through NG+ for the kills you need.  Someone in a group chat I'm in decided to rush NG+ like an hour before the DLC released and got all the way to Castle Sol from the start.",
            "Wolverine lives in the woods. You can get the right to Bear Arms. It's great",
            "Got the kung fu grip in my left hand and a bear claw in my right we fighting DIRTY today",
            "I feel like more than ever this DLC is designed with spirit ashes in mind, not only because of big healthbars but because they can help make the camera not be filled with a boss' taint.\n\nThat is, if the GODDAMN AI WOULD ACTUALLY FOCUS ON THE SUMMON AND NOT JUST GO AFTER ME DESPITE ATTACKING LIKE ONCE IN THE PAST 30 SECONDS GRRRRAAAAAHHHHH",
            "Yeah, i really feel the same. I dont think he's the worst boss ever or anything. I took him down in 7-ish tries at RL150/Scud+3, but... *Holy crap*.\n\n>!I legitimately started to get **motion sick** at one point, because he backed me into a corner and did like 4 different flip moves in a row. His grab can also hit underneath him, and anywhere in-front of his butt despite the fact it's a \"bite move\" that should only hit directly in front of him. So if you're too close and your camera starts wigging out, you've just gotta guess which direction to roll and hope it's not in the same direction as the grab.!<\n\nI honestly think he could be a fun boss, but.. it was just too much visually. There are times it feels *miserable* because all you can do is try to guess which move is coming out. It's a great design when *the camera is behaving*. But if you're anywhere close to him you can >!literally be forced to look up the skirt of 3 dudes in a trench coat, and you cant even tell which direction you're facing anymore half the time.!<",
            "Ngl, I'm not a fan of Elden Ring's boss design. With each game they've upped the difficulty and given bosses more and more complex movesets and I think I've hit a breaking point.\n\nI'm kind of yearning for Dark Souls 1 where most of the bosses were big dudes that hit you with a hammer and you just had to know when to block or dodge. It made it stand out more when you fought someone like Artorias who'd throw in a couple of somersaults. \n\nIn Elden Ring, even the early bosses can have anime-style moves where they do three flips, hang in the air for a second and then launch themselves at you. It would be more fun if we could knock them out of these elaborate combos, since they have no trouble doing the same to us.",
            "The flips making the camera fuck up + the absurd framerate drop that kicked in on entering made it a huge test in motion sickness tbh",
            "[removed]",
            "Some of her second phase attack patterns reminded me of the dancer too",
            "I'm impressed, I sucked so hard I was at it for at least an hour and 30 minutes lol.",
            "I marked out hard when the big phase 2 attack happened.",
            ">Gotta admit though, this new context makes a quote I saw on reddit during the leaks funny as fuck >!\"Looks like Mohg is beating those allegations!\"!<\n\nNow I wouldn't go *that* far. Thus far it seems more like >!he was a slime ball that Miquella ended up using to his advantage after he was kidnapped!<",
            "Yeah uh.\n\n\n\nI get maybe the slower build up and Context doesn't make it as truly atrocious and dogs hit as the leaks made it out to be.\n\n\n\nBut.\n\n\nUhhh.\n\n\n\nThis is pretty objectively the worst additional lore From ever cooked up in a DLC. By a country mile.\n\n\n\nEverything else surrounding the lore of the Land of Shadow, Messmer, and Marika were great for me. I still love ER's the most when it comes to worldbuilding. But holy shit, >!the direction they took with Miquella and Radahn and unfortunately even Malenia in this new lore is still awful. By every measure. The implications that the base lore provided told a much better, much more tragic, but much more fitting story than... whatever the fuck this is. \"Sure, I'll fuck your brother Malenia, but let's have a war in Caelid first to satisfy my Godfrey fanboyism.\"!<",
            "Do you need to get that from the DLC proper? It would be nice if you could have that in NG, though I guess it's not bad to unlock it as a DLC and NG+ tool.",
            "IIRC from the interviews, the word is that this DLC is based on stuff that was in the original lore documents. So it could all be still pretty close to what he came up with (I have seen a couple lore spoilers that are extremely GRRM) or they might have had to make up a ton of new material.\n\nRegardless, we know he didn't give any new input, which explains some hesitancy in trotting him out for marketing purposes IMO.",
            "In my experience, the secret to any of the Elden Ring NPC fights is just finding whatever tools your character can use that best cheese them.  There's some spells that they won't auto-dodge so you can rack up ranged damage, there's some where you can just get a terrain advantage and cheese them from above, there's some where their AI tends to leave pretty specific openings if you're ready for them (heavy weapon swings timed right when they try for a jump attack often sends them flying), and worst comes to worst there's probably a few Ashes of War that you can shove on almost any weapon and break them with.\n\nOr even Spirit Ashes, if you want, quite a few NPC enemies are in areas where you can summon, and that AI goes straight to the gutter against two opponents because they're busy aimbot dodging one and not the other.  Don't force yourself to be limited to \"No Summons Gotta Solo\" if you're genuinely not having fun, just slap down a Tiche or Mimic Tear or something and go to town.\n\nYou're not wrong that they can totally suck ass though, reminds me of DS2 invaders where they waltz in with 5 times the HP cap and rip off huge chunks of your health bar per hit.",
            "The Jar Cannon and One-Eyed Shield are firearms, but I agree. I want those shitty 1500's gunpowder firearms in this game, since ER's equivalent time period to ours is around the 1400-1500's.",
            "I bet people are playing with the soreseal on. I was getting 2-3 shot with 50 vigor. Took it off and it takes 5+. Watched pat's stream and he was taking 10+ hits to die.",
            "whips yes, not sure about ashes yet.",
            "I've found at least one Ash that can be used with all melee weapons, it's >!a yell that buffs you based on missing HP!<",
            "Miyazaki said in an interview that there are no new endings for the base game.\n\nI think it is pretty safe to assume that the original content of Elden Ring is entirely untouched besides the minor Patch stuff.",
            "There are more dragon hearts to collect, so I have to assume",
            "Just to give you a heads up, you'll need 53 arcane to use one of the new dragon incantations",
            "Yep! Keep going",
            "Yes",
            "**Spoiler answer** if it's really important to you for comfort: >!Messmer's second phase has him free-transforming into a huge snake, and one of the big ultimate attacks is throwing several at you. There's also a snake-like enemy around the Finger Ruins that are fairly easy to outrun and ignore.!<",
            "I haven't come across any yet but there was a downright assault on people with arachnophobia in it.",
            "I am in the same boat and for that boss, .... boi get some adult diapers",
            "Idk how to do spoiler tags on mobile so I'll try to be as vague as possible and say that the guy you are talking about is going to be a problem for you.",
            "How incredibly boring and completely out of nowhere this entire part of the lore is.",
            "They’re all pretty straightforward, unless you’re a dumbass like me and accidentally move the MSQ forward to a point that breaks all of them.",
            "Fucking thank you. Finally someone else shares my pain.",
            "I can absolutely confirm that their poise is easy to break, just do jump attacks and counters.",
            "Jesse, what the fuck are you talking about?",
            "??? Sir, this is the elden ring containment thread. If you wanna talk about GoT and its bad adaptations that were still super popular and how that ended up creating new and bad assumptions on how \"dark\" fantasy needs to use it's tropes, by comparing it to ff16 (which you feel didnt get the acclaim it deserved), you should make a new post for that.  ",
            "That’s probably the best way to do it, but it would also take a lot of time so I’m just gonna jump back in with my mid game character and hope going through leyndell and moghwin palace gets me back in the groove of things.",
            "As far as I know, most of what the base game has to say about jars is they're stuffed with corpses, tend to collect more corpses, and I think something about making a new one by taking some from an older one.",
            "First thing I thought as well. ROTS Yoda flying everywhere and perfect blocking me.",
            "Where is Eddie Brock when you need him?",
            "She made up for the lackluster presentation by fucking me with her two sword for 4 hours",
            "So glad I brought my +25 Magic Tower Shield. I doubt I'd have ever made it a quarter past the second phase without it.",
            ">!Fought one in the river as well, so we're at least up to two in the DLC. Dropped one of those FP-costing spell items.!<",
            "Magic Glintblade and Greatblade Phalanx my beloved",
            "I did Malenia on my first try with it (And Dung Eater Summon) and just breezed through the end game",
            "I did have the Corpse-Wax Cutter Gargoyle weapon in case I needed Holy Backup but was mostly joking.",
            ">!The remembrance makes it sound like Miquella's crush.!<",
            "And like. A shabriri mimic tear thing still requires enough time between summon and fight that you can unequip the talisman",
            "FromSoft Boss design peaked in DS3 (and also in Sekiro, but that was a different combat system and thus a different design approach, but I digress), and i will die on this hill.",
            "Eh, >!Rellana is a humanoid enemy!< so that fight, no matter how difficult, won’t make me nearly as mad, since I won’t be fighting the camera half the time like I am against the Lion.\n\nI’d much rather die to attacks that are hard to doge because they’re long combos, or complex, or whatever, rather than attacks that I can’t dodge because I can’t fucking tell what the boss is even doing.\n\nEDIT: I was wrong. I was so, so wrong. >!Rellana!< is infuriating.",
            ">>!\"Sure, I'll fuck your brother Malenia, but let's have a war in Caelid first to satisfy my Godfrey fanboyism.\"!<\n\nI'm pretty sure it's more that >!he declined, so Miquella sent Milenna to kill Radahn so Miquella could remake him. It feels very much like Miquella, for any sort of good intentions in the end, was also skeevy as all fuck!<",
            "DLC only it seems, but can make NG+ completely fresh optimizing to do a >!deflecting build!< and learning the timings of every boss again. I think k the effect as a tear only lasts 3 minutes unfortunately.",
            "Miyazaki has made it clear across a lot of interviews Martin wrote the history, world building, and family of Marika, with lots of back and forth, and Fromsoft took it from there to make a campaign based off GRRM's lore.",
            "Carian Piercer spam to pancake them to death was my solution.",
            "I eventually got it with a mix of powerstanced GS jump attacks and DMGS blade beams, but man. That fight just sucks. Excited to move on from it, at least.\n\nYou can't summon for this fight (Blackgaol Knight) otherwise I would have. It's optional, but I'm the type where once I see and try a boss I can't move on until I've finished it, yknow?",
            "Huh, the the soreseal debuff really should not be making anything close to *that* much of a difference. It is only a 15% damage increase, at most it should *maybe* cause you to die one swing earlier then you would without it. I wonder if the way the dlc upgrade system works “under the hood” is when in a dlc area you are actually given a hidden debuff to take more damage and each stack of blessing reduces it. Then that dlc debuff is stacking with the sore seal debuff in a weird way that causes the soreseal to make you take way more extra damage than the 15% it is supposed to.",
            "Thank you",
            "That's neat!\n\n>!I wonder how it interacts with the Roar medallion, and if that's a good fit for use alongside the Exultation talismans for self-damage!<",
            "*Eyes his 60 Arcane*  Thanks for the heads up.",
            "Appreciate it. By chance, do you know what the enemy in the ruins is called?",
            "As one of those people, >!so fucking glad that scorpions don’t bother me nearly as much as spiders. I just gotta focus my eyes on the stinger and my brain is calm enough to put up with the everything else!<",
            "I'll give that area one thing, made my choice to slap Radagon's Rings of Light on my magic bar early on plenty of fun.  \"Oh, you're surrounding me with like 20 enemies at once?  Cool everything in a ten foot radius is now dead\".",
            ">!Two more in the Shadow Keep Church District! I got!< >!a sorcery and an Iris.!<",
            "Rock throw and invisible comets also my beloved",
            "So does this now make Malenia Chris Redfield?",
            "3 minutes is a long time in a boss fight if you have the damage to close it out. So I think that could work.",
            "Ah, fair on the summoning, I fought him yesterday right at the start of the DLC and just kinda blasted him with Night Comets until he went down so didn't really remember if you could or not, it's always a toss-up for basement bosses like that.\n\nAlso, DMGS's unite, that thing's been putting in some *good* work for me over the course of the DLC, with a little side of Lightning Spear and Black Flame when I need damage type variety.",
            "I've got like 7-8 scadru tree stacks now and my attack power and defense are well above what they are outside of the dlc. So yeah for 0-2 it's prolly stacked on top of eachother so much it hits lethal range.",
            "I fought a lamprey with arms. It looks like a skinny elektross. Kind of snake like but not actually a snake. So ymmv. It was in >!finger ruins!<",
            "I don't even have a phobia and I had the mother of all nopes on that one",
            ">!Malenia: CONTINUE OUR BLOODLINE, RADAHN!<\n\n>!Radahn: He and I are both men! How the fuck is that even going to work!? There's no hole for a baby to even come out of!!<\n\n>!Malenia: THEN I'LL SPEAR A HOLE IN YOU SO MY BROTHER WILL HAVE A BOY PUSSY TO FUCK!!<",
            "Honestly, >!considering the two tap kill move Miquella has where he leaves you \"Heart Stolen\",!< it's probably more that she's >!just as brainwashed as any schmuck you use a Bewitch Branch on, maybe worse since it's been her whole life.!<\n\nMalenia never really stood a fucking chance in life, it seems",
            "It's nice that DMGS is actually worth using again after all the Moonveil nerfs and GS buffs. I'm an Int/Str character but I don't use any spells really, except Adulas for groups and Rancor against the bosses that it actually hits. The Faith damaging spells really just seem better overall than anything Int has, and I didn't want to go into faith at all.",
            "When it's a week or more, we have to make Maleniaposting now",
            "Honestly >!with the lore those two have, I don't think miquella really needed to do any brainwashing since he was the only one that actively tried to find ways to halt the scarlet rot for her.!<",
            "Can confirm as an \"All The Spells\" Int/Fth character that Faith spells really ended up being much more my bread and butter in most situations, yeah.  There's a few unique or interesting sorceries, don't get me wrong, and I think overall Int is the better choice for raw damage and efficiency, but like 90% of sorceries feel as if they boil down to \"shoot blue pellet\" \"shoot big blue pellet\" \"shoot many blue pellet\".\n\nMeanwhile, faith I can chuck charged lightning bolts or have it rain lightning from the sky or just sweep a massive lightning glaive in front of me, I can chuck a fireball or make fire erupt at all angles or wave my hands for a massive wave of fire for groups, I can shoot Freakin' Yellow Laser Beams out of my eyes at long distances... oh and just top it off with Faith having a dozen buffs for every situation.",
            ">!And the one thing we kept being told about her personality is that she's a stubborn maniac who won't back down at huge costs, so her behaviour seeming excessive isn't a problem.!<",
            "What's your build/level? I messed around a little with a Rellana's Twin Blade build using the Staff of the Great Beyond and found it a bit underwhelming so maybe I was doing it wrong.",
            "My first playthrough of the game I did a proper \"melee and magic\" Int character and by the end of the game I found the only spells I ever used were dark full moon and Comet Azur. And Comet Azur was overpowered, inconsistent, and incredibly boring after the novelty wore off. So I only did another Int run to use the various Int greatswords I missed my first time."
        ]
    },
    "Free Talk Friday - June 21, 2024": {
        "title": "Free Talk Friday - June 21, 2024",
        "score": 10,
        "url": "https://www.reddit.com/r/TwoBestFriendsPlay/comments/1dkuyk8/free_talk_friday_june_21_2024/",
        "content": "Welcome to the Free Talk Friday post. This is a place where you can talk about dumb off-topic (or on-topic) bullshit with other Zaibatsu fans.\n\nThere's going to be a new post every week, and the newest one will be pinned in the announcement bar for quick access. So feel free to visit these posts during the rest of the week.\n\n[Here's a list of all Free Talk Friday posts](https://www.reddit.com/r/TwoBestFriendsPlay/search?q=flair%3Aftf&restrict_sr=on&sort=new&t=all)",
        "num_comments": 83,
        "comments": [
            "Thursday, the 20th was my dad's birthday! And Sunday the 23rd will be mine. As usual I don't exactly look forward to the vague passage of time, but I can't really deny it's approach all the same. I am wondering if I should get something really dumb and expensive, though. Like, I saw an airsoft lever-action rifle that you put the BB into a cartridge and it'll cycle through and spit them out like a real thing. I don't need it, but... C'mon.\n\nReally, our family's not been much of birthday celebratin' people beyond getting a nice dinner. So instead of a present, I'd love it more if you checked out my novel [The Demon in Shadow.](https://docs.google.com/document/d/1FmMdrhiW56K291gS1V3EdQ8Oe5SIVM0dgbtbpbCTTRs/edit?usp=sharing) you can even use this [PDF link and read it on the go.](https://www.dropbox.com/scl/fi/fw8brtve5pdezq9vl8lmp/TheDemonInShadowBWInserts.pdf?rlkey=qpz48504fh6u7jweomm1modez&e=1&st=7c5shz6h&dl=0) I did that last week when I was travelling for work! And really other than some bad syntax and formatting mistakes I don't hate it. This story is about humans and demons, the latter who are relatively recent additions to the world of Milesain. Human Max and Demon Ayun cross paths and find themselves linked together in a larger journey that will confront their pasts and possibly topple a larger threat to demonkind. There's amazing artwork tucked away in certain spots of the chapters as well as in the back for character profiles and other shenanigans. Actually, speaking of shenanigans [I made my own dumb little four-panel comic](https://i.imgur.com/5ZnY9vW.png) with Ayun, Max and his sister Monika. The joke probably lands better when you read the book. Please!\n\nAnd if you can't get enough of those two or the world, then consider this preview of the sequel, [The Demons of Blood & Bone.](https://docs.google.com/document/d/12EY1Olrc8eOw8y6eCTxvuYpb-w1L-ckcDhRkQEZaYSk/edit?usp=sharing) While Max and Ayun continue growing closer, they face a new group of demons that are linked to a mysteriously wicked weapon. It's also got some art, right now just characters, in the back.\n\nI'm glad that I had this guy already shot before I took a trip because I've been barely alive all week thanks to post-trade show mess. It's the [Gyan Revive!](https://imgur.com/a/Y1xkY6n) An interesting kit because despite it being from 2016, was just a few kits shy of dual language. Not that it matters greatly, because this kit transcends language. It's a good suit. Though I'll say maybe it's the rounded shoulders or the coloring, but this feels like a buff suit. I just kept wanting to pose it in Armstrong-esque poses. Gachimuchi aside, there's not much going on though to be fair there wasn't much going on for the Gyan. It's got a saber, it's got a shield that shoots stuff. Not even a gun or a way to cheese a Zaku's rifle in there. They did add a hand with a special wrist to make more stabby motions. Could've used that on the Rune Gods. I still think it's great, and I think it was a tidy 20 bucks or something at my local shop. And it's always good to have more Zeon kits.\n\nHajime No Ippo is on Netflix. I've read it, but I've never actually watched the series proper. And it starts out strong. The animation is really good, although I can see the shortcuts like watching Miyata duck and weave four times or so. There's also an English dub and... It's not too bad. Steve Staley is Ippo (for you Gundam nerds, Banagher from Unicorn and Shiro of 08th) and he does good work at being meek and serious. Everybody else is just fine, nothing standout but also nothing truly vile. They don't give you English CC so the subtitles are translated and the major deviation seems to be tied to lip lock. And maybe it feels like they're trying to tone it down? They swear some in the subtitles but I'm not heard as much as a damn in English. Maybe it was an attempt to get it to air for something like Toonami. Which probably is immediately countered by the dick jokes.",
            "Hot week, busy week, weird internal vibes week. One of those weeks. The east coast's been lighting up and everyone is miserable about it except me, who thrives in the heat to such a degree that I didn't notice my AC malfunctioning during a particularly high spike. I've done a lot this week in terms of actionable things -- making great progress on my novel, for instance -- but not a lot in terms of variety, so this one's gonna be a short one.\n\nFirst off, [I finished streaming](https://www.twitch.tv/kkterthelt) **Crow Country** (and you can see the whole stream series [here](https://www.youtube.com/playlist?list=PLRPzT1i2o8S4BKj8EPvDKNO9q_G3C-uQi))! Fucking *immaculate* little game. If not for *Signalis* being maybe my favorite game of all time, this would be my favorite survival horror game in years -- and I would say it even does a few things better than *Signalis*, like raw scare factor. It's a compact experience that does exactly what it needs to do, and tells a story that kept me guessing the entire way and paid off like a lightning strike to my brain by the end. >!I had vague inklings in my brain that the Pool might be a portal to somewhere, but the misdirections about the Roots and the gold scam were so effective that I never even scratched at the core truth. It's such a refreshing twist for a horror game, and such a horrifying series of actions from Edward Crow, no matter how contrite he is about it all in the present. And even though I figured out Mara's identity very early, I was still gobsmacked by the health meter reveal and everything that came with it, which they managed to spin into a genuinely emotional and bittersweet hook for the ending even with how nihilistic the big answers were.!<\n\n9/10 game with a 10/10 finish. Some of the puzzles sucked (that mushroom room is truly baffling), but when that's the worst I can level at your game, you knocked it out of the park. Will be keeping an eye on these devs with great interest.\n\nSecond, and the vast majority of the week: my **Elden Ring** prep! I have so many ongoing and new games that I desperately want to get back on, but I couldn't *not* mainline this to clear the impact zone. In the space of the week, I've gotten all the way from Liurnia to the Mountaintops of the Giants, and have gotten a nice reminder of how amazing this game is in the process. I'm torn between leveling up Eleonora's Poleblade to +10 again or continuing with one of my newfound favorites, the Nox Flowing Hammer, which I'm barely specced at all to make great use of but which is so damn fun to smack things around with that I don't care. Once I get through most of Mountaintops and grab the last Bell-Bearings I'm planning on having, I should be good to go for SOTE.\n\nAnd lastly, u/CookieSlut, u/The_Draigg, and I finally finished **Mobile Suit Gundam 00 S2**. Overall, I'd say the first season was a better story, but I enjoyed myself a lot more consistently through this one, even if I was mostly annoyed by the main villain. 00 as a whole struggled to keep my attention consistently the way the UC Gundams did, but the parts that worked were great, and I'm sufficiently hooked for the movie. >!As with the first season, we ended with what looked like a giant cast massacre, only for most of the main characters to be alive with little explanation. At least Tiera's stuck, and I don't have to be annoyed about my favorite character being shot by my least favorite villain because they're a moon computer now. Graham *should* have died last season, because Mr. Bushido was a complete narrative dead end, and he didn't even have the guts to kill himself right so I'll probably be dealing with him in the movie too. And, uh... ALIENS MENTIONED. LET'S GO ALIENS.!<",
            "Somehow managed to get sick again. Could be wildly inaccurate, but it is really starting to feel that June is just a terrible month for me. Hell, I even have the anniversary of my dad's passing coming in a few days.\n\nThat aside, it was interesting seeing the [wide variety of jobs that people on this sub have]1(https://www.reddit.com/r/TwoBestFriendsPlay/s/EVUMYYfll8). As for me, apparently, higher education is notorious for taking a while. And that is without it being summertime. \n\nI guess me getting an interview so quickly may have been a supreme stroke of luck, or they tried to push to get at least a few interviews through before people took vacations. What I do know is that the HR department seemed to be a skeleton crew since two of my calls went to voicemail since nobody was around, and another call had the person try to rush me off. \n\nI do customer service, so I had the impression that the person was either swamped or did not have access to anything for one reason or another. Still, they did finally take the listing down from LinkedIn and the site (not that LinkedIn had many applicants in the first place), and my application is still pending. Still praying I get it since I feel I have a decent chance, and I think there are multiple openings.",
            "[Last Week's Post](https://www.reddit.com/r/TwoBestFriendsPlay/s/xlySonSoN1)\n\nWeek 16 of hospital. Not much to report in terms of recovery on that front; incremental increases with no major changes. On the other hand, rather excited by a number of reveals from the Nintendo Direct. Also my brother and I started planning for our mother's birthday next month.",
            "[Current Mood](https://www.youtube.com/watch?v=eGfyzSM0XSs)\n\nEven on the Northwest coast we're still getting a brief blast of that summer heatwave and *hoo boy* am I feeling it. That and seasonal allergies actually ended with me having to leave work early during one shift due to the heat+pollen combo overwhelming my meds. Guess its back to the masks again *juuuuuuuust* to be safe. At least its payday this week.\n\n**Exalted Essence** made its grand return with what was mainly a very Social session. We ended up escorting our dipshit Dynast kinda-sorta friend back to his wife and then things sorta... *socially escalated* during a sit-down with the two. As it turns out, our God-Blooded/Exigent PC's >!father was also the wife's father, making the two half-siblings and making the PC *way* more involved in Dynastic bullshit than anybody realized!!<, which also sent the wife into Limit Break due to connecting the dots that >!her father probably had been trying to keep her close so she wouldn't accidentally run into her bastard half-sibling!<. Also to cap off the session the Necromancer PC and my PC sent a message to our Lunar friend essentially going \"Hey we got some intel on your Solar friend, *for the love of god do not find us, we will come to you*\" because theres a lot of implication that Solar we (and the >!Infernal!<) are looking for may or may not >!be the Dynast couple's kid!< on top of all the other shit stack on top of that particular task. Shits getting *interesting*.\n\nFinished Season 3 of **Star Trek: Deep Space Nine**! *Holy shit* the back half of this season. After \"Life Support\" I'm all in on the \"*FUCK KAI WINN*\" camp, the B-plot of \"Heart Of Stone\" hit like a fucking truck when >!Nog explained why he wants to join Starfleet!<, the \"Improbable Cause\"/\"The Die Is Cast\" two-parter was basically \"Hey remember The Battle Of Wolf 359? Wanna >!see that happen to the two big antagonist organizations in the show this time?!<\" and *boy oh boy* that Season Finale. \"The Adversary\" was just peak \"oh yeah this is why the Changelings are so fucking dangerous\" wrapped up in a perfect The Thing homage package. Can't wait to continue to see where this all goes.\n\nFinished **LISA The Pointless** with a friend over this week. Not as thorough as I wanted it to be (Didn't get all of Lester's bounties), but for an unmodded non-SOTWS/Infinity Unfolds run, I still think I did pretty good at showing it off. Managed to get the >!high bond \"Joel actually tires shooting the bullet\"!< ending bit at least so I'm satisfied with that. Next up on the docket is **LISA The Hopeful!**. Not sure if I'll do >!all 4 character routes!< for that one, but I'll figure it out once I reach S P O R T S.\n\nSo..... against my better judgement I redownloaded **Borderlands 2**. I have no idea what gripped me to return to Greaseman Randy's Shooty Pit beyond a \"hey there was weird graphics stuff tied to the PC version. Lets see how that looks on the new rig\" and then whoops, I've spent most of the week playing it. Still not really sure how to feel about the franchise nowadays with all the retroactive debate and general.... well, [*gestures at the tire fire that is Gearbox and [Randy Pitchford's reputation](https://www.youtube.com/watch?v=VHesnoobl_I) nowadays*]. The game itself is still decently fun and I'll admit theres still some jokes in there I still laugh at. Just a shame that the franchise has been offhand tainted by the assholes within the studio that made it.\n\nMade some more **Assassins Creed 3** progress, by which I mean the >!awkward Father-Son bonding time between Haytham and Connor has come to it's entertaining end!<. Short but definitely an interesting section of the game since >!Connor and Haytham constantly are arguing amongst each other about their organization's philosophies!<. 3 more Sequences (give or take the last few Homestead missions) to go! I'm almost home free!\n\nNew Patch for **Honkai Star Rail** hit and just *really* rubbing it in that I'm not pulling for >!Firefly/Sam!< thanks to last patch's... *horseshoe* luck when it came to the ticket stockpile. I can wait for her rerun in the mean time. Speaking of mean and time (ha), priority right now is Relic/Trace grinding for >!Harmony Trailblazer!< since they just gave us that one free and I've heard they are *super* broken with certain characters like my resident Yee Haw boy (whos also starting to hit viablity once I've leveled his relics a tiny bit more). *I wanna make the numbers funnier*.",
            "**Boops Life:**  Got drunk for the first time and apparently that made me really fun to be around.  Now I've started taking edibles or drinking quite a bit whenever I'm at social gatherings, which probably isn't the healthiest relationship to have.  Maybe I'm just overthinking things, summer tends to bum me out a lot.\n\nAround a month ago, I took up running, but because I hate running when it's warm and because my sister has a +1 membership, I started going to a gym.  I've been going at least 3 times a week, and man, I hate it every time.  I thought I'd feel good eventually about it because people like to tout exercise as a fix all, but it's probably not for me in that sense.\n\nMan, that Direct was pretty good, huh?  Mario and Luigi, MvC, a new Mario Party that'll hopefully be good, Dragon Quest, etc.  Lots of things to be excited for.\n\n**Movies:**  Project Almanac.  I'm a sucker for time travel movies, so I checked this out even though I've heard middling thigs, but yeah, it wasn't very good.  It takes like 40 minutes for any time travel stuff to happen, and while some of it is fun, like going back to win the lottery or acing a quiz, most of it is spent at a concert.  Stuff happens at the end that feels like it was there just to add tension, even if it didn't make much sense.\n\nThe Venture Bros. Movie.  I've been putting this off for a while because it's the last Venture Bros content we'll get and that bums me out, but I finally decided to watch it.  While I thought it was enjoyable, it does very much feel like a season that was edited down to a movie.  There's a lot of things that I wanted to know more about, like the dude that was arching Jonas, but I get they likely didn't have the time they wanted for all of it.  There were characters I wanted to see more of, but again, limited time.\n\n**Games:**  Hi-Fi Rush.  What can I say, it's great and it bums me out we won't get a sequel.  If I had one complaint, it would be the lack of a lock on.  There were quite a few times I ended up grappling an enemy I didn't want to, but it wasn't a huge problem.  I also may have developed a small crush on Korsica.",
            "Well the only big event in my life atm if you can call it that is I won employee of the month at my restaurant job. Apparently all our leadership chefs collectively voted for me cuz these past few weeks have been pretty rough with a lot of changes to the menu and people quitting or getting fired and an entirely new staff that needs training. So between me working a double shift at one point and coming in on my days off and training/supporting new staff pretty much every sous chef ended up getting direct support from me at some point so they all nominated me this month. Our head chef even informed me I'm on her list of getting a raise so that's a plus too.\n\nOther than that I've been watching the latest season of demon slayer. Pretty fun overall. Lots of slow character moments and mainly comedy bits. Mushoku tensei traumatizing you with a very cruel >!episode releasing exactly on Father's day with some traumatic father related content in it!< Like it's been a long time since I've seen an anime episode that legit left me feeling so saddened inside. One of those just turn the TV off and stare at a wall and reflect silently over what just happened moments. Oh and mysterious disappearances is also ok. A little underwhelming if we're being honest tho. I kinda thought the mystery elements would be a bigger focus like anime Scooby Doo investigating mysteries and haunted locations and what not. It's more arc structured so like 2 or 3 episodes revolve around a single supernatural entity. Not bad necessarily but it just makes me wish the show was a little more focused so we could explore more supernatural occurrences.\n\nNothing really new game wise aside from trying to make time with a friend to co op resident evil 5 since she's never played it. She has a huge crush on Chris after playing her first RE game in village so I suggested 5 since it's co op and she can play as him again lol",
            "Well work was fucking tiring today and the month is almost out and still no anti depressants hahaha fuck… on a bit of a brighter note probably gonna play shadow of the erdtree this weekend so there’s that I guess",
            "This week has been a weird one. I feel like I’ve missed a day. Might be the ramune I’ve been drinking causing this but I dunno. Anyhow!\n\n**Video Games:**\n\nAs such, it has been a weird week for games. I’ve done some **Warframe** and **Monster Hunter: Rise**. I also tried out **Slug Gear**, **Into the Emberlands**, **Angeline Era** and **Elden Ring: Shadow of the Erdtree**.\n\nSo. Warframe has dropped Jade Shadows. A whole quest around the favourite Dread giving Stalker. And uh. >!Guess who is now a father. Yeah. Stalker. It’s a pretty good quest because it’s such a weird one. The idea that Sorren (His actual name) would have a love is neat, but the fact that she is also a Warframe is just interesting. Because it means that he needs the help of the Tenno. Plus the fact the later end of it is just played with Sorren cradling his child is somewhat hilarious. Kicking ass with the Hate whilst keeping his kid safe in the other. And yes. Canonical pregnant warframe. de pls.!<\n\nSo. Whilst I’ve barely done much of Rise, just a single hunt where Fluff, Dizzy and I killed five monsters in rather insane fashion. The major thing is that Fluff has experienced her first interaction with a very special monster. [Khezu](https://i.imgur.com/9ZHuy9I.gif). And lets say that her reactions to it were brilliant. Not helped by [myself](https://i.imgur.com/l5YvH2u.png) going just a little [mad](https://i.imgur.com/KmMJXZX.png) because of it.\n\nIt’s not often that I find a demo just fine. Then the side thing of the dev just showing off stuff being the thing that makes me go “Yeah, I’m wishlisting this.” But god damn. I seriously recommend going to play Slug Gear. It’s a pretty basic metroidvania but the combo room? That’s where it showcases its hand.\n\nSo. Into the Emberlands is pretty weird. Because it’s a game about effectively strategising movement and the like. With some minor resource management. But with a cute edge and with rebuilding a town in an almost post-apocalyptic place. It’s weird but neat. I can’t really explain it well but I just find it fun and enjoyable.\n\nAnd if you’ve seen Iron Pineapple’s recent Souls-Like video, you’ve most likely seen this. Which is how I got recommended this and wanted to try it. And is it good? I mean yeah. It’s pretty interesting but a little frustrating on Steam Deck. Mainly because of my sight but one of the main issues, is just readability of some of the stuff.\n\nSo. Shadow of the Erdtree is looking fantastic but uh. So far my time with it has been a weirdly mixed. Some of it my own fault but also just some weird stuff been happening. >!I got stuck on a boss that was in a higher level zone that was effectively accessible in the first zone, has a grab that basically heals them to full using your own health. Plus the damage you deal is like insanely low.!< Plus I also suffered my first blue screen in ages! How? Rolling into some boxes.\n\n**Other Stuff:**\n\nI don’t often read physical manga, mainly as a lot of the stuff I own is stuff I read digitally then purchase after. But when I was out getting my piercings, I managed to get Goodbye, Eri. And well. It’s brilliant. If you haven’t read it, it’s a great read. Trying to really explain it in any sort of my style would spoil a bunch of it. >!But an entire story about recording life and death is interesting and Eri herself is an interesting character. And just... A pinch of fantasy.!<\n\nAnd yeah, I’m now up to 11 piercings now. [Spiderbites](https://i.imgur.com/lXGWGRC.jpg) are currently suffering a bit of swelling but that’s kinda expected.\n\nI’m also suffering a weird thing. Where the fuck do people get casual clothing these days. So, I’ve got like 5 dresses I normally use that are in a more goth/witch sense. But I’m thinking I need more actual like. Casual goth/witch stuff. But I legitimately have no idea where to get them because my usual sites don’t really have the best selection for anything on that nature.\n\nMusic this week is from Shinra-Bansho, [Bye Bye, Rain](https://youtu.be/T5gN7zVSOgY?si=5aSHscTMwmkSdgSM).",
            "Hello! \n\nI finished Live A Live! \nThat was a legendary experience. \n\nI’m also post covid snd back at work, but I still have sinus issues. \n\nAnd that’s it really. Have a nice week!",
            "Tensei shitara Dainana Ouji Datta node, Kimama ni Majutsu wo Kiwamemasu \n>(I Was Reincarnated as the 7th Prince so Now I Can Take My Time Perfecting My Magical Ability)\n\nThe first season just ended and it was such a great weekly thing to watch.  \nIt still seems to be stuck gaining any traction though because the main character has such questionable traits...   \n\nI really hope this new studio gets other things, they seem really good.   \nThe craziest thing is how it was animated in Unreal Engine.",
            "Sitting here malding because i forgot to download the vod from my first Paradise Killer stream, so now that shit is just lost to the twitch void.\n\nLike no one watched it, and no one was going to watch it, but it was my favorite stream series so im kinda annoyed that the archive is forever incomplete. Its 100% my own fault, but still.",
            "I've not much to talk about. My rent went up by $100, that sucks. Work is fine. Fuck this heat. My left shoulder vlade has been a fucking pain for the past 2 weeks, got an appointment tomorrow/today to check it out. \n\nWaiting for the Elden Ring DLC to download so I can snipe the sickest armor I've seen so far thats right in the beginning area before I hit the hay.",
            "Sick of being broke.\n\nAlso sick of not having a job.\n\nBut I know that if I get a job I'll either quit or be fired in a couple months.\n\nah, life.",
            "Not a lot's happened this week. My constant tiredness seems to be mostly over though, so that's nice. Being able to stay awake from morning to evening without feeling like complete shit is definitely an improvement over last week, anyway.\n\nWent through Ace Combat Zero a couple more times, finishing all three paths and unlocking all the planes. I'm gonna need to do a bit more grinding to actually buy them all though.\n\nI finally replayed Devil May Cry 5's story mode. I've played the game a lot in Bloody Palace, and I decided it was time to go back to the story and see if I could get a better rank in some missions, and maybe find a couple of the secret missions I missed. It went surprisingly well, and now I've A-ranked every mission on the normal difficulty and S-ranked about half of them. I might do a run or two on a higher difficulty soon, but I don't feel quite ready for it just yet. There's some bosses I'm still not great at and King Cerberus in particular still gives me a lot of trouble for some reason.\n\nLastly, I've been rewatching the old Dark Souls 2 LP, also known as the adventures of Mild-Mannered Pat and Woolsworth the second, and it's very informative. I'm learning a lot, especially that you should drop your shield. You know what I mean? Seriously, it's crazy how often Pat says it. I remembered it being somewhat common but he doesn't just say it almost every episode, he often says it multiple times in a single episode.",
            "So this week has been mostly awful.\n\nOn Sunday, I came in to find that most of the leftover stuff from last week hadn’t been done because my boss called out on Friday and Saturday. So I tried to get some things out of the way and figured that she would feel better by Monday, but then she called the department during my shift. \n\nShe had a stroke last Thursday and has lost all feeling in one arm and one leg. And yesterday, I learned that she will be out of commission until September, meaning that it’s just me and my incompetent coworker (so it’s mostly just me).\n\nSo I’ve been kinda cursing everyone this week. Cursing myself for getting complacent with this job and not doing anything regarding my capstone for a year and a half, cursing my boss for wanting the lead position when she needs to take a sick day every month due to her poor health, cursing Fred Meyer/Kroger for cutting our hours and potentially preventing us from getting a fourth person so that these types of situations aren’t as stressful, cursing the graduation shoppers who all came on Monday wanting 3-5 fucking bouquets wrapped while I was working the freight all on my own, etc. etc….\n\nAt the very least, I got to go to my cousin’s high school graduation on Tuesday and see some family I haven’t seen in a while. Got to meet my aunt’s fiancé, and he suggested I send him my resume and cover letter since he has some connections at Microsoft. So even though I don’t have any personal projects on there, I think I’m just gonna tidy up my resume, write a cover letter, and send them in, because I’m absolutely fucking done with this shitty ass job and I want to start working on my career.",
            "This week and I have a thing in common: We're a couple of tired ol bitches.\n\n- Used all my paycheck to help with bills \n\n- I've been on kitchen duty pulling together entire meals out my ass every day this week\n\n- Did some side work so we have food in the house and used 90% of that.\n\n- Standing up in the kitchen for 2-4 hours after work as soon as I get off work is really frustrating \n\nBesides all that, being tired and frustrated, I'm looking forward to just being lazy Friday. I don't wanna do shit. I just wanna relax for a while.\n\nAs a way to treat myself, I used $5  + change I had in my steam wallet I had left to buy 2 games for myself. Cheap as hell but god bless steam sales. I got **Sid Meier’s Civilization® VI** and **Buckshot Roulette** for 5.98. Because I NEED to do something nice for myself. I wanted to get Elden Ring's DLC for my PS4 but that certainty ain't happening for a long while. \n\nKnow what I'm gonna do when I get paid? Go to one of my favorite gas station, buy 4 drinks (2 big coke-a-colas, a gatorade and a cranberry juice) order a BIG ASS clamshell container of mac-n-cheese, 2 pork chops and 2 chicken wings + several hot sauce packs and head home. I had it during my last one and I loved it. Less than $10 bucks total.\n\nBesides the frustrations, here's the good:\n\nI did some good funny tweets through the week that got attention. Biggest got 100 likes and that was some nice serotonin! Even got some replies from the artists I like which was super cool.\n\nIn **Goddess of Victory: Nikke**, I got very lucky again and got [Clay](https://nikke.gg/wp-content/uploads/image-807-1024x544.png) in only 30 pulls! She's not that good but god damn it, sometimes you just want the cute character cause they're cute. Still excited and ready for the BIG Summer Event!\n\nWas lucky enough to get a gifted sub on twitch to [Vexoria: The Sun Eater](https://vtubernewsdrop.com/content/images/2023/06/vex-smiling.jpg), whom I enjoy watching every now and then.\n\nI got paid for some side work! Thank god to, saved us from not having any food. \n\nRelationship status: >!partner has been incredible sweet and comforting to me through the hard week. Got to message partner number 2 and they're doing okay! They're on vacation and at Disney Land! I can't stress how god damn happy I am to even have 1 in my life that likes me, let alone 2 who really enjoy me!!<\n\nIf I have to say anything else, ya'll enjoy Elden Ring's DLC for me please. I know I'm not gonna get a chance to play it anytime in the future so I want ya'll to have fun and savor every second of it!\n\nMusical choice of tonight: [Kingdom Hearts Chain of Memories - (2004) Dearly Beloved [GBA OST - HQ]](https://www.youtube.com/watch?v=ZOPyE-Nt_94)",
            "I'm feeling devalued at the charity shop I volunteer at... again... \n\nI go through a lot of effort making Facebook Posts about our stock and what we need more donations of, trying to make them creative or not look cheap, and week after week I am told I'm doing it wrong, get my hard work replaced with stock images I am certain aren't CC0, and get told to do better. Oh, and this was just two posts out of seven that I make in one day for an entire week. \n\nI then get told to look at other charity shops Facebook pages for inspiration. You know what the examples the manager gave me have? Pictures of their own stock, or do not have a Facebook Page at all! You know, just things I was told not to do! And they haven't updated their Facebook since the Queen died! \n\nI know when I brought this up last time you lot said that The Manager is just trying to motivate me to improve, but it genuinely feels like they want us to be Boutique rather than what we are, a fucking charity shop who sells cheap clothes and utter tat.",
            "Hello today...\n \n**Weight Check-in: [198.8](https://media4.giphy.com/media/gCANwADwdazG8/giphy.gif?cid=6c09b952dzyfxzx8zf8gtnxcrfhdu6p8r2fvg4334u3zp2jf&ep=v1_gifs_search&rid=giphy.gif&ct=g)** End of June Goal: 197\n \nOI WTF?! I was 197.5 last week?!! And like 196 at some point this week too?! I went to the gym 3 times since then, had 2 take out this whole week (shawarma warps) AND only ate like 2 sandwiches yesterday?! I'm gonna blame it all on water weight cuz it's been fucking HOT and HUMID here and I've been chugging water and going to the pool. But this is nuts. Egh.\n \n**Warehouse 13** is nearly done... And... Eh. I'm not excited about it as Eureka still. I heard Haven is good, but I think I need something different to switch gears to watch next. I also dislike how for 4 seasons we had really good friendly peers as MCs... And now the whole final season is \"BUT YOU LOVE HER THOOOOO\". Also one of the funniest simplest resolutions to a cancer scare ever - \"nah is good now\". In the end, I don't regret my time with it... But eh. /u/SamuraiDDD - KNUCKLES THIS WEEKEND? :D\n \n**Dread Delusion** is still good. I'm still catching up to where I was in the EA game, but I really like it. It also feels like it became way easier then the EA build... Either way, the game has VIBES. \n \n**Burnhouse Lane** was... p'good. I feel like if I found time to play it last year when my gma passed away it would have more impact, but it was good. I still think Lorelai is my favourite of their games, and this one needed more songs, BUT, [there is a really cool cameo](https://youtu.be/9vWyFuvJ3YU?si=dA_7uUHPfN3LQSPu&t=244) and I got the golden ending on my first try (I had to reload the final sequence 1-2 but that doesn't count). Game good. Wish there was more songs. Can't wait for new one.\n \n**Warframe Quest** was real good and an awesome timing since I get to grind while I'm killing time for...\n \n**ZZZ NEWS BABYYYYYY** [SHIT IS HAPPENING](https://www.reddit.com/media?url=https%3A%2F%2Fi.redd.it%2Fzj0ik2nemu7d1.jpeg)! [OOOOOOOOOO](https://www.youtube.com/watch?v=jrUX45zwTI8)!!!!",
            "Week Air Conditioning. My home’s AC got fixed this week! Good thing too, since sleeping in the heat was a pain in the ass. And it couldn’t have been better timed either, since it’s looking to be like 107 degrees Fahrenheit this weekend. I’d hate to have to have that heat in my house. At least now it should be cooler.\n\nAnyways, for games I’ve played this week, I’ve nearly beaten Warhammer 40k: Boltgun! I’ve just got one level left! So far, the third episode is pretty good and challenging, but I did encounter something that kind of sapped my will to finish it completely this week: I encountered a hard crash bug that I could recreate. Long story short, I completed all the conditions to open the way to grab an ammo refill secret in the middle of a boss fight, but every time I actually touched it, it made the game crash hard to desktop. And while I did play past that level, the amount of time I wasted because of that bug did just bring down my mood enough to make me pretty frustrated with the game as a whole this week. And I figure that if I take another day or two for a breather to clear my head over that annoying bug, I’ll be able to beat it easily. I’ll report in to you all here once it’s finished and beaten!\n\nAlso this week, I’ve started watching The Expanse season 3! Only a few episodes in, but so far, it’s pretty good. >!Farewell Rocinante, and hello Pinus Contorta! Up in the Belt, straight up piloting it. And by it, well, let’s just say my Pinus Contorta!<. Joking aside though, we’ve already got some really good ship on ship action to start out the season, and I’m all for that. Also, man it’s weird that >!Jules-Pierre Mao is somehow the sanest person in the room for 5 minutes, since he said that they should destroy the Hybrids due to the Protomolecule being uncontrollable. A shame that he got convinced otherwise, but I guess Dr. Strickland is just that convincing with his research. I’m feeling that’s a bit of a developing pattern for J.P. now, where he feels utterly horrified at what his company has done, only to the double down on all the evil shit again. Come on buddy, actually stuck with your morals for once already!<. In any case, I’m certainly looking forward to watching more of the season!\n\nAnd finally, in my regular mecha talk season here, /u/Terthelt, /u/CookieSlut, and myself have finished watching all of the Gundam 00 series episodes! Took a while, but both seasons have been completed. Although to be honest, I still prefer season 1 to season 2, if just because it feels more focused and gritty. Not that season 2 is bad, it’s still pretty good, but I liked how the first season was willing to do more different stuff than your traditional Gundam tropes than the second season. That, and I do think the first season handled the characters a bit better. But I will say that the second season has the hyper fight moments and some pretty wild twists in it, so at least it also has some stuff in its favor too. Again not bad, but I feel that it didn’t hit the same peaks as before. Regardless, all we have left to watch now is A Wakening of the Trailblazer to wrap up Gundam 00 completely. The childhood of mankind has ended!",
            "---\n[Last week’s post](https://www.reddit.com/r/TwoBestFriendsPlay/comments/1dfhymz/comment/l8jbjv8/?utm_source=reddit&utm_medium=web2x&context=3)\n\nNothing particular happened, but I’d like to share that I went out to get the “[wolf cut](https://www.tiktok.com/@coolmadsgames/video/6919654706415406341)” hairstyle last week, which I personally consider to look cool and stylish, as well as something that I wanted to have for quite some time now. So, I went to a local hairdresser, discussed a bit and shared pictures, and I received a haircut.\n\nUnfortunately, the result was a different hairstyle. Now to preface this, the hairdresser did a fine job. She’s experienced in her craft and I understand that not everyone knows something popular (hence the “sharing pictures” part), with the overall experience being pleasant and enjoyable even. It really helped to alleviate my worries as someone dabbling into the unknown that is trying a new look, besides the occasional trim for my previous, longer hair. There’s always a risk to it, right? The hairstyle that I now have is fine even and some folks can rock it, but it’s just not the one I wanted and it didn’t instill a proud sense of confidence that one may hope for.\n\nI consider myself to have fumbled this. Perhaps I could have showed videos or more pictures. In fact, I also misjudged how short the ends on the back of my hair should be when I was asked about the trimming. Something that I hadn’t fully realized once I went home and spent some time examining everything. Perhaps I experienced a brief “honeymoon phase” as I was fairly happy with the result at first, but dang, it was a fairly mild hit to my confidence. During the first three days, a sense of awkwardness crept into my being at times, along with mild disappointment as I looked at the hair length from the back. However, I did find it amusing to be vaguely reminded of Dante from Devil May Cry 3 while looking at the new hair. Not quite the same as we have different-looking bangs, but still, there’s nothing wrong with taking a calculated risk even if it turned out that one is bad at math.\n\nAll that being said, it’s been a curious development of emotions for me since then. I mentioned being happy initially, followed by the mixture of uneasiness and disappointment that loomed over my thoughts, but now? I feel all right with it. My hair is still fairly long and such length can be versatile, and what I did was simply experiment with it. Even style it to look like my previous hairstyle and I found myself liking how it looks. And with shorter hair comes with easier management and combing, which I appreciated.\n\nThat being said, I’m hoping that within the next few months, I can have another attempt at getting a proper wolf cut. Perhaps it’s one of those things that require time to adjust to, but at the very least, I can see my hair reaching the perfect length for [this hairstyle](https://www.tiktok.com/@coolmadsgames/video/7120697193064844550) by then. It’s the same person from the previous link (Coolmadsgames), and I must say, her hair is inspiring to look at.\n\n---\n\n**Sharing Art**\n\nStarting from 49 months [ago](https://www.reddit.com/r/TwoBestFriendsPlay/comments/gfmtco/free_talk_friday_may_08_2020/fpv00zb/), I'd like to share drawings of great artists whose works I like or I find inspiring. Some that I follow and some that I don’t, and as usual, clicking their names will lead to another profile where they post their art, and usually another drawing of theirs as a bonus.\n\n1. [**Wanderjegson**](https://twitter.com/wanderjegson/status/1798784832643756160): [B. Jenet from King of Fighters & Fatal Fury](https://twitter.com/wanderjegson/status/1799457118745202850)\n\n---\n\n**Sharing Music**\n\nStarting from 48 months [ago](https://www.reddit.com/r/TwoBestFriendsPlay/comments/hbukcz/free_talk_friday_june_19_2020/fvbmfsz/), I'd also like to start sharing music that I've listened to before or recently.\n\n1. [Sabrina Carpenter - Espresso (Official Audio)](https://www.youtube.com/watch?v=51zjlMhdSTE)\n>A catchy song with soft-spoken lyrics. Now I’m not good with describing music, but in the words of some of the comments, it brings to mind of summer and the 80’s.",
            "**Konosuba season 3** ended this week. When a series I like has long gaps between seasons, I find myself thinking \"what was so great about this again?\" Well, in this case I remembered in like the first five minutes of the first episode - it's hilarious in a way few other anime are. I already miss it, hopefully we won't have to wait as long for the next season this time around.\n\nAlso **Hololive** announced a new English generation. 3 days in advance. At this rate the next generation will be revealed the minute the debuts start.",
            "Hey everyone, hope you had a nice week. I played about 13 hours of **Shin Megami Tensei V: Vengeance** and, surprise, the game that was already good is now even better. I really like the new story and character moments they've put into the new route, and almost all the gameplay changes just make the game feel even better to mess around with. The only gameplay change I'm kinda iffy on is getting rid of the map distortion the abscesses emitted. They designed the original areas around you getting rid of them so you could clear up your map, so they feel pretty hollow now. And I guess *maybe* the reduced level scaling made things a bit too easy on normal mode, but I'll have to finish the game to say for sure. \n\n  \nI also finally started up the Kyokutei Bakin event on **Fate/Grand Order** yesterday, it's pretty neat so far. I'm gonna finish it in these last few days it's up. Shadow of the Erdtree is out now though, so I'm gonna play that for a bit.",
            "I fucking beat Malenia this morning in less than 15 attempts; solo, a bit overleveled, but no cheese strats. I feel like the biggest man with the biggest dick.\n\n5 hours into Shadow of the Erdtree. Liking it so far.\n\nHad Raising Cane's for dinner; fried chicken tastes good.\n\nThat's all I got. Oh, and I've been re-watching the soulsborne LPs for funsies.",
            "Started Hearts of Iron 4, pretty good strategy game, even though most of the time I have no idea what I’m doing. Still don’t understand how to use navy and air units.\n\nSaw some cicadas the other day, was quite surprised at how big cicadas actually are.",
            "Between Bocchi the Rock and Girls Band Cry, I have discovered I have deep love for girl band anime. Check out GBC if you haven't best CG anime ever and potentially anime of the year. \n\nI should probably watch Jellyfish then.",
            "Didnt manage to pass my exam on the first try. Im told its rare but you always hope maybe you managed to beat the odds. They are gonna send me some results in the next couple days that shows where I was weak so I can study. I also remember what the questions mostly focused on so should be easier the second time. Mostly bummed about having to pay full price to attempt it again. They asked some really specific questions that were basically impossible without first hand experience or knowing they are gonna be on the test. I dont wanna be conspiratorial but the fact you pay so much for the exam makes me think they make it like that so they can charge you twice for the exam. It didn't seem hard more so you have to specifically know certain things about how WLCs work. Probably not gonna have news on this for a couple weeks need to wait for next paycheck to try again.\n\nElden ring! About to go play the dlc so gonna keep it short. Iron pineapples preview of the game looked really good excited to see for myself",
            "Week of just playing the BOAT ARC of Honkai Star Rail 2.3\n\n- Contemplating on getting new characters: Do I get Firefly for a fire Break DPS who can implant weaknesses, do I get Ruan Mei to create a Break Team out of Xueyi, or do I wait for Jiaoqiu in 2.4 >!Because he can recharge Acheron’s ult super fast!< ?\n\n- Story: There’s a lot of goofy stuff here on the BOAT, ranging from >!Sparkle’s masked fool shenanigans, an outsider’s view of the trailblazer doing side quests, Trazilblazer contemplating on cutting Pom-Pom’s tail off, and Dr Ratio casually leaving the group chat during a serious situation!<\n\n- Apocalyptic Shadow: I can casually beat Cocolia but then spent a long time fighting Argenti…maybe I do need to get Firefly after all. \n\n- Divergent Universe: the buffs and the level upscaling are great, but I’m just casually eating debuffs (low starting skill points and random targeting are cursed) that I’m considering making a new run",
            "This just in, I spent money getting one month of Nintendo online just to realize how trash I am at smash. Feel kinda bad ngl. It's has me reconsidering if I should even bother getting SF6 and the marvel vs Capcom arcade classics collection. I don't want to make an ass out of my self and end up getting clipped just so people can point and laugh at me online. I don't know, maybe I'm just overreacting.",
            "Survived another layoff bloodbath at my company. Whoop-dee-fucking-doo I guess.",
            "Company had layoffs this week due to cost-cutting, but I wasn't laid off. I had my brother's wedding to attend.\n\nIt's been very strange.",
            "Overall an okay week. Almost about to finish Pat’s Alan wake 2 LP. Going to go to a volunteer at a farm tomorrow and just got a new gym membership so hopefully that bring me some energy during the weeks ahead. Trying to get back into playing some games that I have partially played but it feels a little hard to find the motivation to do at the moment.",
            "Checked out a few shows in my down time:\n\nThe Acolyte is boring the shit out of me. It’s not even straight up bad, but just dull. \n\nFallout pretty good so far. Haven’t delved to deep into the games but I do like what the show is presenting\n\nHazbin Hotel I put on as background noise expecting a low brow raunchy comedy. Wasn’t expecting what it actually was. Some rough edges but I did have a good time.",
            "I tried out Bloodborne again after not giving it a go for a couple of years and being unable to get into Dark Souls or Dark Souls II.\n\nFor some reason, I'm only begun vibing with it now.",
            "I've (hopefully) finalised a new place to move into for when my current lease expires. By sheer luck, it's ended up being literally up the road from where I currently live. The rent is higher, which isn't great, but it's just with a single housemate rather than two. I sadly didn't get along particularly well with my last two housemates, so I'm hoping this will be a fresh start.\n\nI also applied for a promotion and got offered an interview today! A lot of people at work supported me for it, so I'm hoping it will go well.\n\nBetween getting ready to move in a month's time and preparing for a job interview in two weeks, I have a lot of previous anxieties that have been replaced by new ones. So, I'm going to spend my weekend distracting myself from all that with Shadow of the Erdtree.",
            "After an extended hiatus, I finally managed to play through and beat **Like a Dragon Infinite Wealth**. \n\nHonestly, while I do like the game and it left me satisfied overall, I do feel mixed about it as a whole. Not because I think it does anything particularly bad, but more so that I think I'm hitting a major fatigue point with the franchise that I kind of feel like I know exactly what I'm getting into with every entry structurally. I get it, this is very much an annual and extremely iterative franchise, but after 10+ entries of roughly the same core formula, I feel like I need a really huge change to the formula beyond swapping the combat to a Turn-based RPG. I'm just not really sure though what that change up is that I'm looking for.\n\n  \nAside from that, I also dabbled a bit more into the Rhapsody: Marl Kingdom Chronicles and took a break from the second game to try out the first chapter of **Rhapsody III: Memories of Marl Kingdom**. This entry is definitely a major change up from the prior two titles that shared the same basic formula in favor of being an Live-A-Live style anthology, and the change up to the combat again from the more traditional JRPG party members into squads of JRPG characters is pretty insane; by the time I was done with the chapter, I had 16 characters out all throwing attacks at once, with is certainly pretty chaotic to say the least. It does seem like as a result of this anthology approach the world design as been heavily streamlined so far, which is a bit disappointing after the full scale JRPG world of the previous titles, but I'm willing to give the shift a fair shot and appreciate it for the strengths it brings to the table.",
            "Hey folks, hope you’re all well and doing great\n\n**GAMES**\n\nLatest patch for **HSR** is wild, being able to repeat runs is such a great QoL. Having to choose between Ruan Mei and Firefly was tough, but only one of them has a bomb-ass mech suit so…\n\nPretty much done now with **Stellar Blade**, found all the cans, finished all the sidequests. Haven’t touched the Boss Rush stuff yet, saving that for a rainy day. I stand by the belief that Shift Up actually cooked. With better writing and voice directing this could have been a cult hit, as things stand I’m seeing it as an exciting sign of things to come\n\n**STUFF**\n\nRatatata is an absolute earworm, I’d never come across Electric Callboy previously. It’s always wonderful when you come across new things and get to fall into a rabbit hole\n\nNew EN Gen! Elizabeth better have the most Bri’ish accent possible, or I riot",
            "For anyone interested, I uploaded a video talking about a hypothetical 'good' Suicide Squad game would be, on a mechanical and story perspective.\n\n[https://www.youtube.com/watch?v=rlRxXZXXRak](https://www.youtube.com/watch?v=rlRxXZXXRak)",
            "Was pondering what audiobook to listen to while playing the Elden Ring DLC and landed on....Stormlight Archives 3: Oathbringer! The second book was really crazy, like, I expected all that stuff to happen at the climax of the whole series not in the second book, so I'm very interested in where they go from here.\n\nAlso beat Pikmin 4 this week and wow, that's a serious contender for Best Switch Game for me, unlike the other Pikmins it feels like a real juiced up game",
            "I tried to start shadow of the erdtree but it was just stuck in the loading screen for a couple of minutes without ever starting, God I hope it's just a small problem that fixes itself later",
            "I got a bunch of good work done this week on [the CCG I've been building](https://matchcards.love). I did a lot more design work, fixed a bunch of UI bugs and improved the stability of the in-app store (which is in test mode and doesn't actually charge money yet). \n\nI want to improve the design of the game board, and there's still a bug about auth tokens I need to fix. \n\nI don't think I'll ever feel like it's \"done,\" but it certainly is a game that people can play. Gotta keep working.",
            "Finally saw Hundreds Of Beavers last night. Most I've laughed in a long time.",
            "The book formatting process goes…ok. For some reason, they removed all of the ellipses and Em dashes when they formatted it. So I had to re-add them, which was mildly annoying. \n\nThe publishing/copyright paperwork is going alright, I just need the final versions and I can send them off to the Library of Congress to get that dealt with.\n\nAs a bit of a fun thing for me, I made a [Spotify playlist](https://open.spotify.com/playlist/61ZW5yBEtDwkU9Xh0xyJ8n?si=0a8836a9948945fe) with all of the music references in the story.",
            "What is going on with this Haunted business?",
            "**What a week.** A good one, actually. Two days off thanks to holidays. On my days off I've been walking the line of doing nothing so I can rest, and being productive enough to not hate myself. I also made headway with my internal monologue at work; telling myself, \"You belong here, you're making progress in this job\" is enough to keep the spiraling away.\n\n**Trail watch**. Did a trail walk on Tuesday in hopes of starting again, but it's been raining here in town all week since. I can at least put in an hour's walk and do 3 miles a session. I saw the pair of cardinals that hang out in the groves. I'm glad they're doing well, I missed seeing them.\n\n**Books watch**. I put *Left Hand of Darkness* to the side so I can read my overdue library books, lol. I started and finished ***Regarding The Pain Of Others*** **by Susan Sontag**. At the risk of bringing up politics in the fartgas sub, I want to recommend this book to anyone who's had trouble processing what at this point amounts to a lifetime of seeing images of real-life violence, war, and genocide in the news. Sontag does a good job presenting the history and psychology of war photography and the dissemination of genocide imagery, and she challenges the idea that the horror alone will ever be enough to stop war. There's a line from her book that I think is perfect:\n\n>Compassion is an unstable emotion. It needs to be translated into action, or it withers. The question of what to do with the feelings that have been aroused, the knowledge that has been communicated. If one feels that there is nothing 'we' can do -- but who is that 'we'? -- and nothing 'they' can do either -- and who are 'they' -- then one starts to get bored, cynical, apathetic.\n\nI also got back into ***My Year Of Rest and Relaxation*** **by Ottessa Moshfegh.** I'm not done but so far I like it. It's darkly funny, thanks in part to the uncanny way Moshfegh depicts characters like the narrator's self-obsessed friend Reva and the sketchiest psychologist alive Dr. Tuttle; not to mention the way she casts horrific scenes of abuse and cruelty as completely mundane. But I'm also running up against my attention span reading this because the beginning is slow and it's very withholding about where it's going, if anywhere. Am I irrevocably monkey-brained? Possible. But I'll report back next week and let y'all know.\n\n**Video games.** I'm abysmal at ***Mega Man X*** and I will be taking no further questions on the matter.\n\n**Music.** I'm actually spending today cleaning out my backlog, finally. This week, I've enjoyed ***El Mal Querer*** **by Rosalía,** ***Wolfgang Amadeus Phoenix*** **by Phoenix,** and ***Wonderland*** **by Demdike Stare.** I hate to say I finally listened to all of ***Playing Robots In Heaven*** **by James Blake** and felt kinda cold on the second half of it. Anyways, the week's tracks:\n\n* [\"Di Mi Nombre\" by Rosalía.](https://www.youtube.com/watch?v=mUBMPaj0L3o) Spanish experimental pop.\n* [\"Miss You\" by bo en.](https://www.youtube.com/watch?v=i_xNEe-DYrw) Fun electronica.\n* [\"The One I Love\" by R.E.M.](https://www.youtube.com/watch?v=j7oQEPfe-O8) 90's pop rock.\n* [\"Mary\" by Alex G.](https://www.youtube.com/watch?v=INaXwbgvGVc) Indie rock.\n* [\"The Hangar\" by Tales Of Us and Vaal.](https://www.youtube.com/watch?v=LxEFP8cFwjM) Techno.\n* [\"Fire The Editor\" by James Blake.](https://www.youtube.com/watch?v=u1PhXAD0F0k) Electronic alt pop.\n* [\"Love Like A Sunset, Pt. 1\" by Phoenix.](https://www.youtube.com/watch?v=m3rkRTygrSI) Synthpop.\n\nSee y'all next week! Hope everyone's doing well out there",
            "It will be a very hectic weekend.\n\nI have to attend the Mermaid Parade that will be held in Brooklyn this Saturday. And I will bring some 35mm films along with me. And I also have to attend the film screening that I organized in Brooklyn this Sunday night as well.\n\nAnd also, check out [cosplay photos that I did](https://www.instagram.com/p/C8dq43-OxIT/?utm_source=ig_web_copy_link&igsh=MzRlODBiNWFlZA==) [with Kodak Ultramax 400](https://www.instagram.com/p/C8dsX4zOPwX/?utm_source=ig_web_copy_link&igsh=MzRlODBiNWFlZA==). I was surprised how they all came out nicely.",
            "[Velvet Room Aigis](https://www.youtube.com/watch?v=cFaAM7ELkIQ)\n\nIt's kind of hard to find personal emergency alarms that actually have useful functions and don't rely on literally your normally used phone's battery.\n\nThe Firefox screenshot function has started defaulting to very helpful file names such as \"a[...]\". Thank you, update.\n\nHuh, Beldam doesn't outright call Vivian a man anymore in the japanese version of Paper Mario remake.",
            "I'm enjoying reading about Nintendo game news on here and knockout, along with the elden ring dlc is a good week for video games",
            "The Summer months suck. Autumn is better, it's so pretty, and there's Halloween & Thanksgiving, and I can leave my apartment without wanting to fucking die.\n\nWHY DO PEOPLE LIKE THIS TIME OF YEAR!?",
            "This week… the long wait for **FF14 Dawntrail**. Got Bard to 90 though. So now have Dragoon, Dancer, Samurai, Reaper, Black Mage, and Bard at level 90. Probably going to play Black Mage or Dancer until I unlock Viper and Pictomancer. Started leveling Arcanist with the intent of leveling Scholar so I can finally learn healing. Could use Sage but don’t want to jump straight into the deep end and figure it might be better to level a healing class normally to get a hang for the role.\n\nOther than that… \n\nWatched two anime movies this week while I was dogsitting. \n\nFirst I watched **Sword of the Stranger**… Holy fuck, that might be one of the best action anime I’ve seen. I understand why that won a bunch of awards and was submitted for the Academy Awards. Idk why it wasn’t chosen that year since there were only 3 nominations for animated feature film that year, but oh well. Fuck em. Studio Bones fucking nailed it though. Animation was fantastic, and Yutaka Nakamura popped off as usual. Some raw wipeouts in that movie >!like every side character ate it so hard lol!< Music was phenomenal and that main theme got me so emotional, especially >!when Nanashi finally drew the sword!<. Glad I finally watched it.\n\nThen a few hours after that, I watched **The Night is Short, Walk on Girl**, animated by Science Saru and is from the same creator as Tatami Galaxy and Penguin Highway. This one being about a girl out on the town, living it up, having zany adventures, while the guy that likes her is trying to keep up with her antics while having an awful night. Whole movie is a visual feast with constant classic animation techniques. Science Saru always having that classic cartoon style of animation, but with anime characters. Just a super fun time and if you like animation or that creator’s other stuff, then it’s definitely worth a watch.\n\nFinally, I finally picked **Monstress** back up after like two years. Reread the first volume then read the second. Have two more volumes, then will have to buy more. Art still crazy, and really getting into the meat and potatoes now. Very interested in seeing how things play out.",
            "Never really post in here but this week has been about personal change so I figure what the hell.\n\nFinally decided to man up and start on an exercise journey. In the past, motivation and lack of long-term planning have been major roadblocks, so my solution has been to set a 12-month goal I can work towards, and one that forces me into situations that are not easy to back out of. Namely: by 6-17-2025, I plan to have completed the 12 sub-5-mile hiking trails in my local region of the Ozarks. This week I got a bunch of advice from various sources, most notably /u/Terthelt hooking me up with a list of gear from a season professional hiker she knows, and I bought/ordered most of the things I will need. This Saturday I'm going to a local hunting store to pick up some bear mace, but otherwise I'm ready...gear-wise at least.\n\nExercise-wise, I'm aware it won't be smart to jump in the deep end first, so I've started taking a 1-mile walk around my local park as of yesterday. I'll be doing it every other day until my legs and core are good enough to go once a day, and then I'll be confident in starting the real hikes.\n\nAs for games, I've played about an hour of Shadow of the Erdtree. >!I went left into a basement and died to what feels like a DS2 player invader, so instead I went to the right and [was ambushed by a Bloodborne NPC.](https://www.youtube.com/watch?v=X0mWx8oFMlI)!< Going great so far.\n\nTomorrow/today my final exam for the first of two summer classes takes place, and I only need a 52 to pass with a C, so I'm feeling confident. After that I will have more time to work on my CV and start applying to billing/accounting places for remote work to fill in the gaps left by the client winding-down my hours at my current place.  Cautiously optimistic for the future.",
            "I played through **Far Cry 3: Blood Dragon** again, and I don't have much to say except that Ubisoft-style map clearing is actually pretty enjoyable when you can clear the entire map in about six hours.\n\nThe more important part of the story is that playing Blood Dragon again reminded me that I still needed to watch **Captain Laserhawk: A Blood Dragon Remix**. Man, what a weird show. It's only six episodes long, but it feels like it blows through multiple seasons worth of plot points, which is both a positive and a negative. I found it to be pretty enjoyable overall, though, and I was surprised by how much I enjoyed all the Ubisoft cameos and references. When the show first got announced, I thought it would be a cynical cash grab, but it's not. I'd recommend it, especially since a second season is coming soon to resolve the cliffhanger ending. Also, as an aside, the show seems to acknowledge that Watch Dogs 2 is the only entry in that series worth caring about, which is fair.\n\nAlso, I started playing **The Ascent**. It's pretty good so far, but I only played it for an hour, so I don't have much to say except that it's got an impressively detailed cyberpunk setting.\n\nFinally, are there any **Hi-Fi Rush** fans reading this who are Korsica/Peppermint shippers? I'm looking for a beta reader for a fanfic I wrote. I usually don't ask for a second opinion, but I went with what might be an odd structure for this story, so I'd like to get some feedback on the pacing before I publish it. Also, it's my first time focusing on romance in a story — I've previously only had romantic subplots — so I'd generally like to know if it's any good. So, if you want to read roughly 27K words of two high-strung women pining for each other, having a misunderstanding, getting advice from their friends, and eventually working it out, let me know.",
            "Happy early birthday! You really should treat yourself to a cool gift, it's just one of those things that makes the passage of time worth it.",
            "Happy early birthday!",
            "My mom and sisters cat's birthday is also the 20th so we celebrated both lol",
            ">Gundam 00\n\nBoy oh boy hope you're ready for >!The Future Dialogues To Come!<. Even going into Awakening Of The Trailblazer with a friend we weren't ready.",
            "> Crow Country\n\nI'm really liking this renaissance of retro-styled survival horror, and man Crow Country really does knock it out of the park. It's really just a perfect-sized horror adventure that has more to sink your teeth into than you'd expect, that's for sure. It was fun watching you see all the reveals on stream too!\n\n> Mobile Suit Gundam 00 S2\n\nI'm glad you liked season 2! A lot of people write it off as a much weaker season than it is, even if there's still some pretty consistently good stuff in that season too. Like I said in my own post, even if it doesn't reach the sheer heights of season 1, it's still got plenty in it's own favor. Now, all that's left is to see how the childhood of humanity will end.",
            "\"Mr Bushido will return in Gundam Endgame\". You just cant appreciate the genius that is an American white guy named Graham weebing the fuck out, learning how to be a samurai from his friend's dad, then making it his entire personality. Was like a Tom Cruise Top Gun guy originally, then became John Blackthorne lol",
            "I've been waiting for you to hit \"The Die Is Cast\", because fittingly, this is the episode where there's no going back and DS9 revs up to what it really is. >!Some of the series' smartest power players and most militarily competent factions joined up to bloody the Dominion's nose, and the Dominion proved exactly why they've got the name. It's one of the most riveting and hopeless things Trek has ever put out, and I adore it.!< And by the by, >!that entire fleet battle was mostly done with the same practical ship effects Trek has always been using, just with a shitload of really clever camera tricks to disguise it.!<",
            "To be fair, I don't think it's possible to play Hi-Fi Rush and *not* develop a small crush on Korsica.",
            ">Warframe\n\nI saw some weird discourse on Jade Shadows pop up in my non-Reddit spaces and my biggest takeaway is just \"This is just one more notch on the '*Fuck The Orokin*' belt that they would >!subject a pregnant woman to the Warframe/Helminth conversion process!<, this shouldn't be as big an issue as y'all are making it.\"",
            "It was great hearing your reactions to Live A Live in the LGBTQ CSB Discord server. Seeing how hype you were getting proves that even for a story that was made a while ago, it still holds up super strongly.",
            "Hey, I'm sorry to hear that. If I may suggest something for future use, I assume that saving a stream as a \"Highlight\" would preserve it for posterity. I can't confirm that as I only made the assumption from seeing older videos in the Highlight section, but perhaps it may help you.",
            "Hells yeah on Knuckles dude!",
            ">The Expanse\n\nSeason 3 is a banger from start to finish, so you're in for a lot of fun developments. It's a toss-up between this and Season 5 for where I think the show peaks. >!As for Mao and his ever wavering sense of moral outrage, what else can you expect from a space multibillionaire?!<",
            "First time getting a really drastic hairstyle change can be tough especially if you have anxiety in general lol. During the pandemic I let my hair grow out entirely. Then I needed to get it touched up for work and decided on getting the badass action woman long on top to shoulder length with shaved sides look. Kinda like karlach from BG3. Unfortunately that's difficult to explain because as far as I'm aware I couldn't exactly find what the specific style is called online. I ended up seeing a comment somewhere off hand calling it the \"lesbian cut\" and sure enough if you Google that it's exactly what I wanted but I felt awkward in calling it that at the salon so I just saved multiple pictures as reference material instead lmao. Technically this was my second attempt because my first one at a different place I didn't have any pictures as reference and again trying to explain the style can be pretty difficult so the first attempt ever ended with the entire length being cut off instead. This time however I made sure to explain exactly how I wanted it and have multiple references. And I'm quite happy with it now and have been growing it out even longer since then.",
            "The emotions of a fumbled haircut are *very* relatable. I'm glad you're feeling alright with it and that you're looking forward to your next style! That's awesome.\n\nAlso, Sabrina Carpenter has taken over my life so I'm glad to see her pop up here!",
            "Fingers crossed. Heard nothing but good things about S3 so I need to catch up with it in due time.\n\nBig excited for the new Holo girls. It's gonna be new chaos lol",
            "I hope they're all european, it'd be pretty funny to have a holo gen with 4 different accents",
            "Get Ruan Mei imo if you can. Firefly loses a lot of power without her and HMC in the team. She's also absurdly helpful for every other team archetype.",
            "Any fighting game just takes time. It’s about the self improvement not being great online. Take it from someone who’s not very good himself it’s still can be fun just trying to learn some stuff",
            "I kinda agree with trying to level a default healer first, since you will learn how you should slot in your skills for the other healers later on. I will say that sage’s kit has been the easiest to use on controller.",
            "Ah yeah Monstress is really good. I caught up a couple months and the wait for volume 9 in november has been pretty brutal.",
            "Graham Aker went from Tom Cruise in Top Gun to Tom Cruise in The Last Samurai.",
            "It also makes Stalker have a stronger reason for his hunt for the Tenno. >!To destroy everything related to the Orokin and effectively free all of those still left of the Helminith system. (Even if most of our systems are.. Yeah it's confusing lore/gameplay separation) Because he has effectively lost his love to the Orokin, only to keep her barely alive for who knows how long at that point.!<",
            "That sounds like it could work. Honestly theres a part of me thats considering just switching to streaming via youtube to skip the whole download/upload process",
            ">!It’s just funny to me that Jules-Pierre just keeps on weathervaning between his morals and being a greedy fuck. Although I guess he isn’t all that unique in regards to the Protogen conspirators, since Errinwright was also like that towards the end of season 2.!<",
            "Hahah, thanks for sharing your story. A simple trip to the barber is one of life's many challenges, I suppose. I can imagine that everyone has stories and misadventures like ours.\n\nI'll certainly be a bit more thorough next time. More pictures, a video, and try to communicate better. I'm sorry to hear that your first attempt went poorly, but it's good to know that things worked out for you in the end. Go rock that hair.",
            "Hey, thank you for the kind words. It has certainly been a little adventure of mine as of late. I've come to simply be able to admire it for what it is and wondering what else I can do when it comes to styling it, while also looking forward to my next trip to the hairstylist. For now, it's been a bonus for my self-confidence and I feel nice and comfortable. I suppose that's the point of it all even though I didn't get the hairstyle that I wanted at first.\n\nAlso, it's nice to see another person recognizing her here. It's always a pleasant and welcomed surprise whenever Youtube recommends a song that appeals to you just right from time to time, which was how I discovered Espresso.",
            "Update: I got Bronya instead while aiming for Firefly, so at least I’ll just settle for unlocking Misha or trying to max out Xueyi.\n\nFinal Update: Misha has eluded me. I now have a maxed out Xueyi and Gallagher so im just gonna stop.",
            "Yeah, but the thing is I don't even mind losing, I just don't want to get curbed stomped. Especially when using my favorite character. Though I will say I did have a match yesterday where it seemed me and the person I was playing against were around the same skill level. I still lost but had fun in that match as I didn't feel as pressured. And I did learn something which was that I was trying too hard to make things happen instead of just letting it happen naturally. So I guess there is something to it.",
            "Yeah friends have recommended doing White Mage before Sage just to get the hang of it, but I think I like Scholars vibe more than regular ol White Mage, so wanted to work towards it. Even if Sage is still the end point.",
            "It's always good to spare the headache if possible, right? Either way, best of luck to ya."
        ]
    },
    "Finally a convincing argument to go vegan ": {
        "title": "Finally a convincing argument to go vegan ",
        "score": 108,
        "url": "https://i.redd.it/9u74ad6cm38d1.jpeg",
        "content": "",
        "num_comments": 29,
        "comments": [
            "Lol, I remember this.\n\nThey used this art without permission from an artist on Twitter.\n\nThe artist found it hilarious that they used the piece with the fattest tits.",
            "...is the implcation that goats would become dinosaurs with fat tits, or that humans somehow hunted dinosaurs?",
            "Why does this egg laying reptile have the most massive mommy milkers tho.",
            "Weird lookin goat",
            "Oh hey, I recognize that art. Upai does good shit, but never once thought I'd see anything by him on this sub!",
            "Ah yes, the goat with no other natural predators besides humans lol",
            "NEVER FORGET WHAT THEY TOOK FROM YOU!",
            "Yeah,well,starting now would do little to create big titty goat mommies now,wouldn't it?\n\n\nWe got labs for that.",
            "Parasaurolophus were goats!?",
            "Well I’m convinced",
            "This looks like the fever dream of am all tomorrows fan.",
            "So...how do predatory dinosaurs fit into this equation? If they go vegan, do they also evolve into anthros with massive tits?",
            "Finally, a Jurassic Park that isn't a massive mistake.",
            "No, you see, this is only about saving goats",
            "You know why",
            "Because my people are degenerates and want to cause pain to Brennan Lee Mulligan specifically\n\nhttps://youtu.be/8mx2MfFMe9E?si=GY8PxCxoRjARYJbM",
            "ive seen a couple fun ideas for lizard people/aliens to have breasts. one theory is poison sacks.",
            "Thats where they store the Hist Sap.",
            "They didn't get his permission. The original artist found it funny they chose the art with the fattest tits.",
            "RETVRN\n\nRETVRN TO.... WHATEVER THE FUCK IS HAPPENING IN OP'S PICTURE",
            "Yes because through convergent evolution the dino women started to evolve glands that can produce nutrient rich milk for their young ~~why did i typed that~~",
            "Don't show him that one side character from MHA.",
            "Dummy Ssssnick, With four S's.",
            "Humans get a little too feisty so they evolved to have milkers that secrete a deadly venom, specifically for us",
            "XCOM sniddies",
            "That doesn't sound vegan.",
            "…I have no idea who you’re talking about",
            "ew its like ducks",
            "Bless Chimera Squad for making Viper Nightclubs canon.\n\nThe Devs knew their audience."
        ]
    },
    "Morrigan making sure her bestie stays hitched": {
        "title": "Morrigan making sure her bestie stays hitched",
        "score": 398,
        "url": "https://i.redd.it/b18wsq7el08d1.jpeg",
        "content": "",
        "num_comments": 35,
        "comments": [
            "Truth be told I could really go for a series of official comics depicting Marvel vs. Capcom.\n\nAnd then a Marvel vs. Capcom Amalgam universe. Someone had the idea of calling it the \"Combo Universe\".",
            "Morrigan and Spider-man are now canonically besties, and you can't convince me otherwise.",
            "[Source for the art](https://x.com/Osse_Art/status/1804054807440695360)",
            "Is this the new art trend? Imagining Spider-Man and Morrigan as besties? Because I'm all for that",
            "Someone get this person onto Amazing Spiderman!",
            "[Live reaction of Mephisto learning he was getting beaten up for \"stealing\" the marriage](https://www.youtube.com/watch?v=ztq5WpGleps)",
            "The funny thing is that as long as he's not in hell Morrigan can actually box with mephisto, no jokes.",
            "Has Morrigan and Spidey being BFF's always been a thing because I'm down for it.",
            "So I feel like I'm missing a keystone point of context here.  I've seen lots of comics of pete and morrigan being besties, but why?",
            "Mephisto with his dying breath:\n\n“Damn it, Morrigan, you don’t understand. *He* MUST win.”",
            "There were some cool ideas in infinite that got wasted like the reploid city merging with asgard, symbiot empowered T-virus, wakanda having to open itself to the services of the monsters hunters as the new mega fauna appears. A lot of it was hurt, thought by I think the unfamiliarty they writers had with some characters over others.",
            "Honestly with the amount of potential you can get off making interactions a comic anthology run maybe depicting the events of the games or just pairing off fun combinations is something I'm unsure why Marvel hasn't done beyond like, the one shots they did leading up to 3 and Infinite\n\nFriendly reminder that Frank Tieri pitched to make an animated series based on the games and that hasn't gone anywhere; if Disney wants to capitalize on this that's still on the table",
            "Yes , MvC Amalgam Universe is a peak idea , and calling Combo Universe is apt , afterall , if MvC would had an Avatar it would be [Combo-Man.](https://marvel.fandom.com/wiki/Rick_Wilder_(Earth-616))",
            "I'm down for a Awkward Zomibie/ All in the brawl style comic with MVC.",
            "Friends with benefits, IMO.",
            "Just to add for extra visibility, the artist's name is [Osse\\_Art](https://www.instagram.com/_osse_art_/p/C6-d8r7teZY/).\n\nIf I may suggest, you should put the artist's name in the title whenever you share their work. I know that their signature is there, but it's a good practice for aiding artists.",
            "Yup and I want MOAR. \n\nThe shit the webhead has been through, he deserves a succubi besti who'll watch his back.",
            "Thanks to Capcom for making them bestie decades ago with MvC games. And now they're back with the fighting collection.",
            "I mean it's technically true, in fact the deal he gave Peter was the most upfront deal hes ever given anyone, lol. Like he was so honest it's arguably put of character for him.",
            "Isn't so so hilariously broken that she could even fuck with him IN hell?",
            "They had a cute thing in Marvel 2",
            "There’s a splash screen from Marvel vs Capcom 2 of Spider-Man and Morrigan, Spider-Man is saying something like “Hope MJ doesn’t mind I’m home late!” (Referencing him fighting in the game), and Morrigan is next to him making a very succubus-like seductive face. It’s easy to infer something very uh, promiscuous happened and was meme’d as such. \n\nI probably butchered the explanation lol but Google “MvC2 Spider-Man Morrigan” and you’ll see what I mean.\n\nAnyway, with MvC2 being revealed to finally come back to home consoles, the meme kinda got revived but now it’s taking a more wholesome twist of “nah fuck that, Morrigan didn’t help him cheat, she’s his bestie and wingman”",
            "They started the plot in the god damn middle for whatever reason.",
            "like u/MarioGman and u/Kimarous had said , they started the plot in the middle , which is awful.\n\nAnd while the ideas of the merges are great , I don't like the T-Virus Symbiont , it would be great if they had merged [Maniac](https://marvel.fandom.com/wiki/Lee_Price_(Earth-TRN461)) with Wesker instead.",
            "And then you had Thanos learning to use the Dark Hadou",
            "The Infinite story was....something, but I actually really love that them trying to separate the universes at the end doesn't work, so they are now effectively stuck with eachother permanantly.",
            "The benefits are that they can crash on each others couch whenever.",
            "Oohohohoho, I know what you're saying! \n\nThey share PSN accounts!",
            "I mean from Mephisto's perspective he was bringing a weak game that week. Just kind of throwing out the hooks and seeing what bit without his heart being in it. Then boom Spider-man's sold and all of a sudden you don't have the gotcha clauses ready. Dude was unprepared.",
            "iirc Mephisto was hiding the fact that preventing the marriage would also prevent MJ's pregnancy (said child being a future threat to his agenda). Which definitely would have changed the arithmetic for Peter.",
            "Nah not in hell he's super busted in there but if she had her full body its possible at full power she was destroying multiple universes at birth.  Sadly her dad took that possibility with him when he died",
            "\"In medias res\", except they forgot that it works when showing \"how we got here\".",
            "Also wingman for each other/prevent each other from ruining their lives.",
            "That retcon came more then a decade later and it amounted to nothing, the whole Spider-Girl would have defeated Mephisto is whack anyway.",
            "And very rarely Morrigan's brought in for a threesome. She gets kinda weird about it. Not sex weird, almost fangirl-y weird that even she's kinda embaressed by"
        ]
    },
    "One of the best things about the Metroid prime 4 trailer is seeing retro studios devs finally being able to express their enthusiasm and excitement": {
        "title": "One of the best things about the Metroid prime 4 trailer is seeing retro studios devs finally being able to express their enthusiasm and excitement",
        "score": 155,
        "url": "https://www.reddit.com/gallery/1dln2ry",
        "content": "",
        "num_comments": 16,
        "comments": [
            "Also shout out to one of the devs of the original Metroid prime being hyped that the morph ball physics in the trailer look to be the exact same ones he developed all these years ago",
            "I couldn't care less about the comments I'm seeing that are like \"Why should I be excited for this? How is it innovative? What's the hook?\"\n\nBy the time it comes out it'll be 18 years since Metroid Prime 3. I don't even understand how that's a real number. I get a new Metroid Prime and it's going to be rad.",
            "Retro's about to have a banner year in 2025 with both Metroid Prime 4 coming out and with Donkey Kong Country Returns (albeit being handled by Forever Entertainment) being made available on Switch for a new generation.",
            "The crazy shit is that this game is so long after the last that people who grew up on prime are old enough to have the experience to work on 4.\n\nWe've got prime that may have been built by the people who wanted it the most",
            "A good sign I see for if something is gonna be good or not is if I see a bunch of people proudly going \"Hey! I made that, and I'm really proud of it!\"",
            "I just hope that after 18 years (starting from Prime 3’s 100% ending teasing Sylux) we finally get a great story arc involving Sylux since he was teased and built up for so long by Retro Studios and Kensuke Tanabe as the next major villain Samus will fight.",
            "Sometimes you just nail it. I really don't know how you'd improve it, it's really good already.",
            "link to hat dev?",
            "\"Whats the hook\"\n\n\nMotherfucker the *hook* is that its Metroid Prime fuckin 4. ",
            "> \"Why should I be excited for this? How is it innovative? What's the hook?\"\n\nWhy is it that the people who scream about *every* game needing \"InNoVaTiOn\" are also the ones that shit themselves over when games change *too much*?\n\nOr worse you get those weirdos like that glut of CoD/Battle Royale streamers a few years back that all started complaining that the industry lacked innovation *while they only played Battle Royales/Military Shooters*.",
            "Sometimes all you need is a good sandwich. Especially if nobody's made it in years.",
            "There's at least one dev who's working on this game (I believe UI) who is a massive Metroid fan. He even had fanart of him with Samus and ridely when he applied to retro. I will link it when I find it ,found it:\n https://x.com/adlanarv/status/1803588000514974110?t=z7p5qgd1TBcJhgoFJvRnEA&s=19",
            "Yeah sure \n\nhttps://x.com/DylanJobe?t=rYTQ8brXwFWeHgwcVbJ5pA&s=09",
            "It's like... What more could you want, Prime 1 is one of the greatest games of all time and has aged immaculately, and the other two aren't far behind it. They're phenomenal and don't need to be reinvented every time. \n\nGive me fun new gadgets, pretty environments, and engaging bosses and that's all it needs",
            "The wHo AsKeD fOr ThIS discourse and its consequences has been a disaster for gaming forums",
            "I tend to think they're the same types that rally behind AI.   \n>\"Whoa, look how amazing this pure AI movie is!\"  \n>>[the worst shit smearing across the screen]"
        ]
    }
}