{
    "r/ukpolitics General Election Campaign Megathread - 22/06/2024": {
        "title": "r/ukpolitics General Election Campaign Megathread - 22/06/2024",
        "score": 19,
        "url": "https://www.reddit.com/r/ukpolitics/comments/1dlnyll/rukpolitics_general_election_campaign_megathread/",
        "content": "**[👋](https://imgur.com/a/BelZnxc)** Welcome to the /r/ukpolitics **General Election Campaign Megathread**.\r\n\r\nThis is our daily megathread for all of the day's news until the election. Polling day is on 4th July, and you need to have a form of photo ID (passport, driving license, etc) in order to vote. If you don't have photo ID, you can apply for a [**voter authority certificate**](https://www.gov.uk/apply-for-photo-id-voter-authority-certificate).\r\n\r\n---\r\n\r\n**Please do not submit articles to the megathread which clearly stand as their own submission.** Comments which include a link to a story which clearly stands as its own submission will be removed. Comments which relate to a story which already exists on the subreddit will be removed, to keep everything in one place. Links as comments are not useful here. Add a headline, tweet content or explainer please.\r\n\r\nThis thread will automatically roll over into a new one at 06:00 GMT each morning.\r\n\r\nYou can join **[our Discord server](https://discord.gg/DPQERCvzbg)** for real-time discussion with fellow subreddit users, and **[follow our Twitter account](https://twitter.com/rukpoliticsmods)** to keep up with the latest developments.\r\n\r\n---\r\n\r\n### Useful Links\r\n\r\n**[📰 Today's Politico Playbook](https://www.politico.eu/newsletter/london-playbook/london-playbook-pm-friday-is-for-the-devolved-guys/?utm_source=RSS_Feed&utm_medium=RSS&utm_campaign=RSS_Syndication)** · [**🌎 International Politics Discussion Thread**](https://www.reddit.com/r/ukpolitics/comments/1d4o5bp/international_politics_discussion_thread/) . [**🃏 UKPolitics Meme Subreddit**](/r/noncredibleukpolitics)\r\n\r\n[**🪪 Apply for a voter authority certificate if you have no voter ID**](https://www.gov.uk/apply-for-photo-id-voter-authority-certificate) · [**🚶🏻 Apply for a proxy vote**](https://www.gov.uk/apply-proxy-vote) ([or here in NI](https://www.eoni.org.uk/Vote/Voting-by-post-or-proxy)) · [**📚 GE megathread archive**](https://www.reddit.com/r/ukpolitics/wiki/ge-archive)\r\n\r\n---\r\n\r\n### 📅 Key dates\r\n*from the [Electoral Commission](https://www.electoralcommission.org.uk/sites/default/files/2024-05/UKPGE%20Election%20timetable%204%20July%202024.docx), [BBC](https://www.bbc.co.uk/news/articles/cq55qk7k847o), [Sky](https://news.sky.com/story/general-election-sunak-and-starmer-to-go-head-to-head-in-first-leaders-tv-debate-13144919), [ITV](https://www.itv.com/presscentre/media-releases/itv-announces-further-election-debate)*\r\n\r\n* **21st June, 7PM BST** - 📺 The Panorama Interviews with Nick Robinson - Nigel Farage (Reform UK)\r\n* **24th June, 5PM BST** - 💻 The Sun - Never Mind The Ballots: Election Showdown - Sunak and Starmer live Q&A (online)\r\n* **24th June, 7PM BST** - 📺 ITV The Leader Interviews - Reform, Green (England/Wales) / SNP (Scotland)\r\n* **26th June** - Deadline for new proxy vote applications and voter authority certificates *(for this election)*\r\n* **26th June, 9PM BST** - 📺 BBC head-to-head debate (Sunak vs Starmer)\r\n* **27th June, 8:30PM BST** - 📺 ITV The Leader Interviews - Keir Starmer - Labour\r\n* **28th June, 8:30PM BST** - 📺 The Panorama Interviews with Nick Robinson - Ed Davey (Lib Dems)\r\n* **28th June, 8PM BST** - 📺 BBC Question Time Leaders' Special (REF, GRN, ???)\r\n* **4th July** - Polling day. Emergency proxy votes deadline at 5pm. Polls will open at 7am and close at 10pm.\r\n\r\n---\r\n\r\n### Manifestos\r\nManifestos are essentially a set of documents which outline the policies that each party would want to implement if they were governing.\r\n\r\n* 📘 **Conservatives**: [View manifesto](https://manifesto.conservatives.com/) ([discuss](https://www.reddit.com/r/ukpolitics/comments/1ddawsf/conservatives_2024_general_election_manifesto/))\r\n* 🌹 **Labour**: [View manifesto](https://labour.org.uk/change/) ([discuss](https://www.reddit.com/r/ukpolitics/comments/1deux2l/labour_2024_general_election_manifesto_megathread/))\r\n* 🔆 **Liberal Democrats**: [View manifesto](https://www.libdems.org.uk/manifesto) ([discuss](https://www.reddit.com/r/ukpolitics/comments/1dchtsp/liberal_democrats_2024_general_election_manifesto/))\r\n* 🎗️ **SNP**: [View manifesto](https://www.snp.org/manifesto/) ([discuss](https://www.reddit.com/r/ukpolitics/comments/1djgtfn/snp_2024_general_election_manifesto_megathread/)) \r\n* 🌼 **Plaid Cymru**: [View manifesto](https://www.partyof.wales/manifesto)\r\n* 🌿 **Green Party**: [View manifesto](https://greenparty.org.uk/about/our-manifesto/) ([discuss](https://www.reddit.com/r/ukpolitics/comments/1de3rxn/green_party_2024_general_election_manifesto/))\r\n* ➡️ **Reform**: [View manifesto [PDF]](https://assets.nationbuilder.com/reformuk/pages/253/attachments/original/1718625371/Reform_UK_Our_Contract_with_You.pdf?1718625371) ([discuss](https://www.reddit.com/r/ukpolitics/comments/1dhxch9/reform_uk_2024_general_election_manifestocontract/))\r\n\r\n---\r\n\r\n### Election night coverage\r\nHere's a sort-of comprehensive guide to your 4th July election night coverage:\r\n\r\nChannel | Main presenter(s)\r\n---|---|----\r\nBBC One & BBC News (TV) | Laura Kuenssberg, Clive Myrie, Chris Mason\r\nITV (TV) | Tom Bradby, Robert Peston, Anushka Asthana, Paul Brand *(GMB from 6am)*\r\nChannel 4 (TV) | Krishnan Guru-Murthy, Emily Maitlis, Alastair Campbell, Rory Stewart\r\nSky News (TV) | Kay Burley, Sophy Ridge, Beth Rigby, Trevor Phillips, Ed Conway, Sam Coates\r\nGB News (TV) | Patrick Christys, Michelle Dewberry\r\nBBC Radio 4, Radio 5 Live (Radio) | Nick Robinson, Rachel Burden, Henry Zeffman \r\nLBC (Radio) | Andrew Marr, Shelagh Fogarty, Jon Sopel, Lewis Goodall",
        "num_comments": 1091,
        "comments": [
            "FUN FACT: Aldi will be stocking milk today which will outlast the Tories. Happy Saturday",
            "Ben Wallace: \"I think Nigel Farage is a bit like that pub bore we have all met at the end of the bar who often says if ‘I was running the country’ and presents very simplistic answers to actually I am afraid in the 21st century complex problems. It is not that easy to govern a country but also to find international solutions to problems …\"\n\nHard to disagree with any of that.",
            "Imagine being so patriotic you trot out apologia for our nation’s biggest adversary on prime time TV.",
            "> [@RishiSunak:](https://x.com/RishiSunak/status/1804158142076366859) It's not right for hard working people to pay the price for Net Zero.\n\nSo you'll take one for the team and foot the bill then, eh Rishi?",
            "As I sit at work early on a Saturday morning, tired, alone, and literally just watching ice melt for a few hours, I ended up thinking back to the calling of the election. There was that first mini-gaffe where Sunak strongly promised a woman he would pass a new law before the end of Parliament in the morning, then dissolved Parliament that afternoon. \n\nThere was a lot of discussion at the time on if he had meant what he said, but then in those couple of hours suddenly decided to call the election with no warning. Or of he was always planning to call it that day and was lying to her about passing new laws.\n\nThe betting scandal makes it pretty obvious that Sunak knew ahead of time he was calling the election, so was clearly lying to her. It's not a big surprise as everyone by now knows how little regard he holds for other people, but it's incredible just how readily and easily he finds deceiving random people for even super short term gains.\n\nIronically it still leaves the possibilities that either he still only decided literally the day before, or he trusts his own team so little that he had to wait until the last possible moment to tell them, and then they were still so incompetent they managed to cause him yet another scandal.",
            "[This art and crafts shop going through it](https://x.com/bmay/status/1804174768142221684?t=l9S4vvuTz9gl6PPTh9G2GA&s=19)",
            "https://x.com/carolvorders/status/1804235712998576323\n\nGet him Carol!",
            "Mercer is giving real gatekeepery vibes. Like that guy down the pub who is into a certain niche hobby and that’s all he talks about. But as soon as someone else comes in that has the same hobby he throws all the toys out the pram because he’s nailed that hobby onto every part of his identity. ",
            "Fun fact: Johnny Mercer has publicly admitted that the first time he ever voted was for himself when he first stood to be an MP in 2015.",
            "Mercer hates anyone from a military background joining Labour. This is [his little comment](https://www.youtube.com/watch?v=IQ8D8666h6E&t=276s) about \"how on Earth anybody leaves the military and then joins the Labour party\" from last year after the Selby and Ainsty by-election.",
            "Was listening to *All In with Chris Hayes* this morning - apparently a Democratic Party primary election in New York's 16th congressional district has had more money spent on it so far than the entire cost of the UK general election. Absolute insanity. Our system is far from perfect and needs reform, but the idea of spending $23 million on a single MP selection process is, thankfully, so impossibly alien.",
            "And now Rory Stuart and Cambell are commenting on comments from Mercer\n\nReminding him that some peoples service is quite secret\n\nWhat a fucking rocket and Rupert. This smacks of jealousy from him now. I mean if he wanted to come across as petulant and childish then go for it l. But this? This is properly fucking self defeating madness \n\n\nhttps://x.com/rorystewartuk/status/1804413878786195909?s=46&t=8yAdrdBzWy3jjYY9PP7lHw\n\nhttps://x.com/campbellclaret/status/1804134909310624155?s=46&t=8yAdrdBzWy3jjYY9PP7lHw\n\nEdit Cambells in a full on replying mood\n\n\nIf Mercer wasn’t already fucked, and he was, he’s now just an embarrassment and leaving himself open to being sued senseless \n\n\nClaims to hate Walts so much I’m starting to wonder about his own frontline service quite a bit.\n\nMost on my mates across the services wouldn’t give this much of a fuck",
            "I stand to win about £600 if Labour wins 500 seats or more - 12 days to go how are we looking lads\n\nEdit: people dming me no I'm not a Tory MP",
            "Support or excuses for Russian imperialism is an automatic disqualifier for any candidate, end of. People shat on Corbyn for a very good reason. Farage deserves the exact same treatment.\n\nedit: I wouldn't care if I agreed with a candidate on every single issue except this one. This one is a make or break. You are literally putting all of Europe's security in mortal danger by being a Putin apologist. There is no excuse for that. I am a right winger and it's fucking disgusting.",
            "**The Daily Telegraph**\n\n>Kemi Badenoch, the business secretary, has claimed Labour will reverse Brexit if it wins the general election, The Daily Telegraph says.\n\n[https://liveblog.digitalimages.sky/lc-images-sky/lcimg-20db3305-4338-4961-8048-c6f917bab4d5.jpeg](https://liveblog.digitalimages.sky/lc-images-sky/lcimg-20db3305-4338-4961-8048-c6f917bab4d5.jpeg)\n\nPolling for the past few months has clearly indicated that a lot of people regret Brexit.\n\nFearmongering that Keir Starmer will reverse Brexit ins’t going to prevent anyone from voting Labour.\n\nAnd the few people who still like Brexit are going to be voting ReformUK.",
            "[Aw, the Tories are saying we'll always carry around a photo of Sir Keir to remember him!](https://x.com/Conservatives/status/1804156690998104215)\n\n\n[Photo](https://pbs.twimg.com/media/GQmm42MWMAAgo-f.jpg)\n\nThey do realise people carry photos of loved ones in their wallets, right?",
            "Seems to me Johnny is on a solo run here and isn't picking up calls from CCHQ - he's demanding his opponent resign immediately over an unproven allegation which Johnny is framing as an \"integrity\" issue.\n\nOk, if that's the standard, John-boy, what are we going to do about all those bets?",
            "https://x.com/JAHeale/status/1804431821012169143\n\n> Men will stand for parliament instead of just going to therapy",
            "[Ha.](https://x.com/EliotHiggins/status/1804458800587399465?t=8m-g2atO-oVR9vbG5vIaIA&s=19)\n\n> > Only Reform UK will stop the invasion.\n\n> \\* Ukraine not included",
            "https://x.com/implausibleblog/status/1804268569934393667\n\nTheme emerging with Nige.. I caused x, it went to shit but because I wasn't involved after it happened",
            "The main question to me isn't will Farage's comments on Russia cost him votes, because it seems to me very plain that they won't. What I think is probably more interesting and what time will tell is whether any on the Tory right after the election wipeout will jon him. \n\nAfter all, with the traditional donor streams locked down by Labour, money's going to be tight. Some have already been flirting very strongly with the Orbánist right in Europe and far right in the US through networks like the New Conservative movement, both of which are either soft on Russia or openly courting Putin as an ally. I could very easily see the Tories going the same way as the Republicans in the US in finding their commitment to NATO significantly less firm than it is right now.",
            "Farage had a unique chance to rebrand Reform as the new Tory party with a focus on immigration and more in touch with the working class.\n\nAfter praising Putin and being anti-NATO he's just proven his party is just another loony party that's a threat to national security.\n\nHe may not lose many extreme voters but he's put an absolute ceiling on how many votes the party can get for the next few elections.",
            "https://x.com/afneil/status/1804463773400359186\n\n*That Nigel Farage is a fanboy of President Putin is neither new nor a surprise. It’s long been the case and it’s a common feature of the populist right on both sides of the Atlantic (think Trump, think Orbán). They have a curious soft spot for the Kremlin and a hostility to NATO, which means on this issue they have more in common with Jeremy Corbyn, Jean-Luc Mélenchon and others on the anti-West far left.*",
            "gotta hand it to Farage. Never in my life did I think there would be a situation I'd consider voting Conservative.\n\nYet, if my choice was Reform or Conservative because no other party has a chance to win? I'd be voting Conservative. Thank god I live in a strong Labour seat tho.",
            "I've felt like I needed a break from the election, but it just keeps sucking me back in. \n\nBut then I see the BBC top story is JK Rowling criticising Labour on women's rights and that has definitely given me the motivation to ignore politics for the day!",
            "Bit of an historical similarity \n\nhttps://x.com/redhistorian/status/1804417807976735218\n\n(Of course Mercer has also jumped on this)",
            "Interesting that according to Newscast the flurry of betting on a July election date was noticed by Labour and led to them starting to up their spending and ad space buying in preparation. Greedy Tories shooting themselves in both feet and then blowing their kneecaps off it seems.",
            "My twitter timeline is DESPERATE to show me as many Johnny Mercer tweets as possible. Not sure what I've done to deserve this.",
            "https://www.electoralcalculus.co.uk/fcgi-bin/calcwork23.py?seat=Plymouth%20Moor%20View\n\n\n\nMercer is getting battered. He can't just go with dignity. ",
            "having been reading this morning about Alastair Campbell's own history of mental illness and that of his brother Donald's, I thought I'd share the obit he wrote for his brother. Donald had schizophrenia and died ten years ago or so, aged 62. I do not agree with Alastair Campbell on everything by any means, but the work he has done for mental illness awareness cannot be denied. It takes bravery to talk about this stuff (one of the reasons I don't shut up about it - took me a long time to stop being scared, so now I talk a lot about it. If me saying I'm bipolar or have been hospitalised in a psychiatric ward (albeit breifly) helps one person, then I think that's worth it.\n\nAnyway: [https://web.archive.org/web/20170808114055/http://www.alastaircampbell.org/blog/2016/08/14/my-brother-donald-please-spread-his-story-far-and-wide-and-join-the-fight-for-better-mental-health-services-and-understanding/](https://web.archive.org/web/20170808114055/http://www.alastaircampbell.org/blog/2016/08/14/my-brother-donald-please-spread-his-story-far-and-wide-and-join-the-fight-for-better-mental-health-services-and-understanding/)\n\n>\"He lost his mind from time to time. Now, all too young, he has lost his life. But right to the end of it, he never lost the music in his soul. And though the Donald who died was the sick Donald, the workings of his mind divorced from people and events around him – which is what schizophrenia is, not the awful ‘split personality’ cliche which compounds the stigma  – in there somewhere was the real Donald.\n\n>The real Donald leaves behind so much grief precisely because he inspired so much love, and gave so much love to so many, not least his little brother.\"",
            "https://x.com/AdamBienkov/status/1804466362351259987\n\n>The Conservative Party has paid for a series of Facebook video ads, designed to look like emergency alerts, and containing a series of outright lies about Labour's policies.\n\ni did wonder if actually they'd use the alert system to say something like \"this area is at risk of a labour government, which will cause severe damage to your wealth\" but this is close enough.\n\nit was bad enough seeing the meltdowns people had over the idea of a test message, ads like this are even more suboptimal for confidence in the system",
            "Johnny's going to break the official secrets act next by revealing Fred did supply runs to the Ukrainian frontline.\n\nBuT hE dIdN't ShOoT aNyOnE",
            "Everyone is checking betting purchases the day before the Election was announced. Has anyone checked flight tickets to California?",
            "In important news, Binface is out polling Lettuce Liz according to the Star [https://www.tomorrowspapers.co.uk/daily-star-front-page-2024-06-22/](https://www.tomorrowspapers.co.uk/daily-star-front-page-2024-06-22/)",
            "[Labour has been real good at social media this election.](https://x.com/UKLabour/status/1804440052321182177?t=PtnpL5jdzfFPGd_ZOvEpqA&s=19)",
            "I'm not sure why, given Conservatives are haemorrhaging votes to Reform, why their Twitter activity still attacks Labour over the £2000 tax dud. Farage's praise of Putin and blame on NATO should be an open goal, yet they're not taking it",
            "Eastern Europe: I really don't want to experience the things we did under the Soviet Union again, the Russo-Georgian war only proves this.\n\nNigel Farage: The West provoked Russia",
            "Clarkson has written a column for The Sun saying he'll vote anyone but Labour because they'll be worse than the Tories\n\nI don't get how he can say with a straight face that the issues he believes in like farming, economic growth, taxation have been better under the Tories than they were under New Labour",
            "https://x.com/JohnnyMercerUK/status/1804401351071326504\n\n> Call it whatever you like - I don’t care. I call it out for all Veterans fed up of people lying about their service. He’s now changed his tune - fine, I will leave it there. Perhaps he shouldn’t have tried to mislead people in the first place.\n\nGiving maximum Partridge vibes here. I’m not sure why he’s ruined his own reputation over what seems to distil down to an alleged error in a Guardian article & relying on the fact that his opponent isn’t able to give details about his service history.\n\nWhat a way to spend your last two weeks on the parliamentary payroll and any sort of relevance. Mercer’s firmly at the top of my portillo moment list now.\n\nBetween him and Dorries there’s something to be said for people who publicise their Right Honourable title.",
            "Hello, I wish supporters of all remaining national teams in Euro 2024 well.\n\n  \nCleverly tweeted his negative comments about Farage and \"provoking\" Russia, but he's the only one from the top of the Tories. \n\n  \nWeird...",
            "Conservatives literally just in the business of making stuff up:\n\nhttps://x.com/Conservatives/status/1804450095636562228",
            "Johnny's having a [meltdown](https://x.com/JohnnyMercerUK) on twitter.\n\nI hope Labour install some sort of software that blocks candidates from replying to tweets in less than ten minutes. Someone needs to step away and touch grass.",
            "If Mercer spent as much time fighting for his constituents as he does getting on flame wars on Twitter he might not be in this position.",
            "Genuinely wondering if Reform will now lose voters or at least stop gaining votes following the Russia/Ukraine war comments. Quite possibly..",
            "Well, today's a bit interesting. I regularly use Twitter lists to try an approximate a right wing social feed, and today is the first time there is significant division. \n\nUsually when there's negative news is simply ommited or universally agreed, ie Sunak's D-Day being bad etc. Farage is the first time there's a lot of personalities arguing with each other [Julia Hartley Brewer spent last night calling out Kremlin lines being spouted by some GBNews presenters](https://x.com/JuliaHB1/status/1804274274988933229) and various others.\n\nSome [voices go hard for appeasement](https://x.com/alexharmstrong/status/1804219484049465486). Others [call him out](https://x.com/DPJHodges/status/1804439028390916484).\n\nMy favourite though is the likes of [Carl Benjamin who think it's wrong of the BBC to ask Farage about his views of Putin](https://x.com/Sargon_of_Akkad/status/1804287767033061495), cue his followers thinking this makes the BBC bias and we should defund it. Carl Benjamin, a prime arbiter for what is and is not \"slimy\".\n\nThis will be an interesting week to see what it does in the polls, and also what line is going to be tried by reform to deflect.",
            "I'm off on an 8 pub craft beer tour in a minute, so *I apologise in advance* for this evening's shitposting.",
            "Curiously the Northants chief constable Nick Adderley has been sacked for lying about military service, including wearing a Falklands medal (even though he was 15 when it happened) https://www.dailymail.co.uk/news/article-13476539/Nick-Adderley-wife-Walter-Mitty-Falklands.html",
            "This report by Lewis Goodall is somehow both very funny and very unfunny at the same time. \n\nhttps://x.com/thenewsagents/status/1804178802475700417?s=61&t=bBUutlwwJLuU-kCDZ22BIg\n\nThe level of brain rot in this country is concerning.",
            "https://x.com/AdamBienkov/status/1804466362351259987\n\n>Adam Bienkov @AdamBienkov 9m\nThe Conservative Party has paid for a series of Facebook video ads, designed to look like emergency alerts, and containing a series of outright lies about Labour's policies.\n\n\n\n(images of ads in tweet link)",
            "Election night will feel weird without Huw Edwards\n\nProbably gonna watch the Channel 4 coverage tbh, not excited by the BBC lineup at all",
            "🎶 *Oooooooon the THIRTY-FIRST Day of Rishmas, the Parties gave to meeeeeee...*\n\n- *Thirty-one [Walter Mercers](https://www.reddit.com/r/ukpolitics/s/MeFCTydKNE)*\n- *THIRTYYYYYY SHAAAAAME OOON YOOOOUUUUUUUS*\n- *Twenty-nine betting arrests*\n- *Twenty-eight [superb 'unts](https://www.reddit.com/r/ukpolitics/s/F4SFy2wumW)*\n- *Twenty-seven \"Reform Contracts\"*\n- *Twenty-six [walls of cynicism](https://x.com/SkyNews/status/1802248890931954099?ref_src=twsrc%5Etfw%7Ctwcamp%5Etweetembed%7Ctwterm%5E1802248890931954099%7Ctwgr%5E21f1b6c83ff00d13e75ffc41c45bdcf2f406960f%7Ctwcon%5Es1_&ref_url=https%3A%2F%2Fwww.theguardian.com%2Fpolitics%2Flive%2F2024%2Fjun%2F16%2Fuk-general-election-live-labour-conservatives-tax-clashes-campaign-trail)*\n- *Twenty-five Sussex Cowboys*\n- *Twenty-four enemies made*\n- *Twenty-three [hire taxis!](https://www.reddit.com/r/ukpolitics/s/x1KMehhjeV)*\n- *Twenty-two Dishless Rishis*\n- *Twenty-one manifalsehoods*\n- *Twenty [gurning Nigels](https://www.reddit.com/r/ukpolitics/s/FbKUABvhn2)*\n- *Nineteen **Emily Thornberry**-*\n- *EIGHTEEEEEN HOOOOOURS OF SILEEENNNCE*\n- *Seventeen shrieks from Penny*\n- *Sixteen ~~D Day photos~~ optics car-crashed*\n- *Fifteen dodgy costings*\n- *Fourteen interruptions*\n- *Thirteen Nukes a-launching*\n- *Twelve penis-checkers*\n- *Eleven level-up backhands*\n- *Ten polls a-widening*\n- *Nine [fiscal drag queens](https://www.reddit.com/r/ukpolitics/s/kZcCv0Pm9h)*\n- *Eight deselections*\n- *Seven Sir Eds sinking*\n- *Six MPs' finances*\n- *FIIIIIIIVE GREEEEEEK HOOOOOOLS*\n- *Four pension locks*\n- *Three Titanic jokes*\n- *Two planted questions*\n- *And a PM in pouring rain!*\n\n\nI wish the lyricists well!\n\n(The campaign just keeps on giving doesn't it)",
            "Actually frightening that many Reform supporters/voters (at least those I have seen and some I know on Facebook) are actually in full agreement with Nigel Farage about his Ukraine/Russia comments. \n\nGenuinely wonder if they actually believe it or they are just deluded into agreeing with whatever Farage spouts out",
            "good morning, campers! there are now **12** days until the general election! \n\ni see johnny mercer is *still* going at it on twitter. as i said yesterday, i know nothing about the forces, but at this point it looks to me like he’s desperately trying to muddy the waters. i will not be displeased to see him lose the election",
            "I want Sunak to win his seat because when he does abandon it then he will be forced to admit it was about ego and will leave one more broken pledge behind.",
            "I feel like Farages Ukraine comments are gonna end up costing him a lot of votes, being as pro Russia is not a vote winner",
            "wonder if the tories will keep running the starmer = putin ad when there's an actual pro putin party leader now",
            "Just did a postal vote for the first time, a bit weird to lock in the vote so early. But this election already feels like it’s lost all momentum. Just treading water.",
            "The HoC only has 220 seats on each side. With Labour polling at >400 MPs, only half of them will be able to attend any debate. Surely it’s time for a new debating chamber with a hemicycle?",
            "First canvassing session ever today. Scunthorpe\nMet up with the candidate and a bloke from regional with about 8 members. Lovely people. Knocked 48 doors most people didn't answer. The main task was to canvass postal voters who got their ballot yesterday or this morning. About 10 people labour about 5 don't know and two conservative and reform a piece. Everyone mostly very friendly I find the older people welcome the conversation more. All in all a good experience. One door we knocked the bloke was unhinged thumping his car shouting about how Muslims don't have to pay inheritance tax on religious grounds. Needless to say we moved swiftly on. His son was inside saying he was going to vote labour even if his dad was going berserk. If anyone else has thought about doing it but are hesitant. Give it a try you very quickly get into the swing of it.",
            "https://www.theguardian.com/commentisfree/article/2024/jun/21/election-politicians-israel-gaza-war-britain-slaughter\n\nMore bollocks from a terrible journalist.\n\nGleefully ignores or understates that:\n1) Starmer is now  in a clear \"stop the war\" position & has said what the IDF are doing is horrendous.\n2) Starmer is not in power.\n3) The most salient issues for most voters (per polling/focus groups) is their plummeting living standards/public services and to a lesser extent immigration.\n4) The mass murder of civilians in Gaza has been talked about repeatedly in this election.\n\nI cancelled my guardian subscription a while ago, I don't regret it.",
            "I got married yesterday. Things can only get better. \n\nDid I miss anything? Are polls showing Reform > Tories becoming, er... *normal?*",
            "Peharps Mercer's opponent also [insinuated his wife was a prostitute in the comments section of the Plymouth Herald](https://x.com/JohnnyMercerUK/status/1052233618356142080?lang=en).",
            "The conservatives and their traditional media allies are going hard against Farage for his Ukraine comments.",
            "Tories can retake a lot of Reform votes by repeating \"a vote for Reform is a vote for Putin\". Include Farage's quote. \n\nLet's see if they bother doing this but it's the easiest route to retaining a lot of seats that would have otherwise been lost.",
            "Obviously unprecedented, but If Sunak announced he was stepping away from the campaign, and the strategy shifted to \"let's get as many good tory mps in the commons as possible for a strong oppisition\" as Alex Wickhams piece has suggested some want... would that actually work? Or would the admission of defeat just lead to implosion?\n\nI can't imagine it would be worse than where things are now. And it surely can't be worse than the \"stop the labour supermajority\" line.\n\nThe piece I'm referring to: https://x.com/alexwickham/status/1804428407272353814?t=mv8fvQhj_h8gtAm0QMgGDQ&s=19",
            "Do you think Farage's stance toward Russia will affect Reform? It's one issue where he seems to be massively out-of-step with the wider public.",
            "The Johnny Mercer row is absolutely insane. My limited understanding of it from briefly reading responses is that it seems Fred Thomas did one recent tour which people speculate is Ukraine. \n\nNow clearly Ukraine isn't going to be technically a combat mission for obvious fucking reasons and this seems to be what Mercer is latching on to. \n\nIt's just insane that we have the Veterans Minister clearly using a technicality to skewer a political opponent who is a veteran himself.",
            "So either reform at polling above the tories or getting half their votes. Polling seems to be a mess right now",
            "I just read that Europeans on average spend 20% of the income on accommodation and how that's so bad. I'd be surprised if the average was anything like that in the UK considering the usual rule is to spend a third of your income on accommodation and people are spending more nowadays.",
            "Catching up with newsnight and those two girlies who are 20 and don’t want to vote, NoOOooOo 😭 pretty please go and vote, it hasn’t even been 100 years since we got the right to vote don’t throw it awaaaaaaay",
            "Can someone give me a summary of what Johnny Mercer has been saying and doing for the past 48 hours because I feel a lot has happened",
            "If Sunak/Tories actually had any sense they would attack Reform viciously rather than the bizarre focus on Labour.",
            "So what do we reckon, have the Tories got one last big scandal they can fit into the last two weeks? Further escalation of gamblegate? Or something entirely new?",
            "Random opinion from working in banking. The big high street banks will be destroyed, deservedly, by companies with better tech that can move more quickly and provide a better experience. I believe the reason this hasn’t happened yet is partly public trust for younger companies. I once heard a friend in her 20s say “I don’t put my salary in my monzo because it’s not backed up by a branch”, which means literally nothing, a branch is effectively just a shop front now. Another reason is the risk averse nature of investment capital in the UK. The set up costs to create a decent mortgage business would be dramatically higher than that of current accounts. That would require large amounts of capital for return reasonably far in the future. It’s areas like this that the country should prioritise investment. An incredibly profitable industry is dominated by clunky old dino companies that cannot be fixed. There needs to be incentives for companies to try. That’s where you’ll get real growth. I believe this probably applies to many other industries, it’s just something that occupies my thoughts.",
            "Canvassed again!!!! (adding an exclamation mark each time)\n\nThis time I managed to get a question in and asked about the consultation on ending the 50% faith school admissions cap. The guy blathered that they would listen to the consultation but when I pointed out it was already in the Conservative manifesto to lift the cap he just repeated that they'd listen to the consultation. Not impressed.\n\n(But also not really a vote deciding issue.)",
            "I'm curious, wouldn't Andrew Bridgen be a good fit for Reform?",
            "You follow some polls. I spend time learning the Electoral Dysfunction theme on a keyboard. We are not the same.",
            "Ed Davey currently surrounded by chickens gleefully eating from his hand. Meanwhile Sunak can’t even get the support of sheep. \n\nThat’s *my* Prime Minister",
            "I see jk Rowling's threatening to not vote Labour.\nI'm sure Keir is deeply troubled by this /s",
            "It’s now several hours since mercer shut up on Twatter. He’s still trending and oh boy is it glorious stuff including videos of people who served with him\nAnd his admiralty discharge letter.\n\nMercer done fucked up and I can’t wait for more of it.",
            "okay we can stop having reform go up in the polls now please. no more reform surge please.",
            "> Even after the invasion today Mr Corbyn was unable to level blame at Russia alone. In a tweet this afternoon he said: 'The Russian forces that have entered Eastern Ukraine should immediately withdraw. \n\n> 'The UK government should encourage a return to the Minsk-2 agreement to end the crisis and oppose further eastward NATO expansion.'\n\n> It came after Mr Corbyn was slapped down by Defence Secretary Ben Wallace in the Commons last night. \n\n> Mr Corbyn, now the independent MP for Islington North after being booted from Labour, asked in the Commons: 'Would he be prepared to countenance, if the Russians pulled back, any reduction in the Nato presence on the border as well in order to bring about a longer-term secure peace in the region?'\n\n> Mr Wallace rather bluntly replied: 'We didn't put 165,000 combat troops on the edge of a sovereign country and hold a gun to the head of a democratically elected government.\n\nhttps://www.dailymail.co.uk/news/article-10538829/Jeremy-Corbyn-slammed-attacking-Nato-UKs-aggressive-posturing-Ukraine.html",
            "Farage's Putin comments won't cost him any serious number of votes (a lot of the Reform base, and especially the youth part, is extremely isolationist and will happily swallow anything they're told about it all being the West's fault). What they *might* do, further down the line, is scare the 1922 out of admitting him should he ever attempt to defect as part of his ambition to take the Conservatives over from the inside.",
            "Morning all, I wish for the Bishop of Wells or whatever.  What effect do we think the weather will have on polling day?  Presumably the Greens are hoping for something unseasonal to make their point.",
            "There was supposed to be some 6pm news drop yesterday - was it the poll showing REF ahead of CON or did something else happen?",
            "Is Sunak really trying to win over the votes of young people in London today??",
            "How are other European nations on building?\n\nDo they have the same issues?",
            "Leafletwatch at home.\n\nContext: Red Wall-ish but possibly technically not because still Labour held. M62 corridor, so Rugby League. Ex-mining, ex-power generation, 'regeneration' as commuter dormitory. Castleford, W Yorks -most of rest of constituency is similar,despite boundary changes which did NOT, unlike previously, change demographic too much. Yvette Cooper long-term MP.\n\nTypically, very little campaigning activity. Because safe Labour hold. Yorkshire Party gets more vote than Lib Dem here, for example. \n\nSuddenly a flurry of three leaflets.\n\nLabour (2nd leaflet) Why a second one? IMHO because local hero Rob Burrow endorsed the first, but then died after it had gone to print, and bad taste to have his picture on for political purposes now.\n\nConservative: main message- *Cooper has been MP for 29 yrs, and done nothing for the town, so get rid of her!* It is true he failed to prevent the closure of the M and S. Typically, ordinary citizens blame the council/ the MP/ the government for things that are actually commercial.\n\nReform: As with others reporting in other parts of the UK, a standard leaflet with pictures only of Tice and Farage. Only reference to candidate is their name.\n\nGoing to Mereyside (Wirral side) today and will report what I see on the streets.",
            "Canada's view on the election and the 1993 comparisons: [https://www.youtube.com/watch?v=NhT7NwsBrfA](https://www.youtube.com/watch?v=NhT7NwsBrfA)",
            "In 2015, the Tories created a highly effective poster of a mini Ed Milliband poking out of the breast pocket of Alex Salmond. \n\nThey could bring it back and have a mini Farage poking out of the breast pocket of Putin.",
            "I find the psychology of the polling booth really fascinating; it’s like this private place where you have to really commit to what you want and what you care about. What person are you going to be? Nobody but you will know what box you ticked, but *you* will always know.\n\nI’m in two minds on Reform.\n\nPart of me thinks we’ll see a surprising number of traditional Labour voters opting for Reform in the polling booth. Pollsters account for the ‘Shy Tory’ phenomenon but there’s no such thing for Reform, even though the social cost of saying you’ll vote Reform is, for many people, much higher. Saying you’ll vote Labour is the easy, inoffensive option at the moment. Is that inflating their polling?\n\nAnother part of me thinks the opposite. That saying you’ll vote Reform is a great way to express your discontent but that in the moment of voting, many will have too many reservations to actually do it, and will go for Tory/Labour.\n\nThe relationship between the personal and the political is one of the most fascinating parts of democracy I think.",
            "Hopefully if Labour win they’ll release that Russian interference investigation. I hope there is a massive chapter on Farage. ",
            "One thing I will say about Farage, he probably did the best Lunch with the FT, about a month or two before the Referendum. I always go back to it every few months, I find it endlessly entertaining. He seems to go through every emotion a human feasibly can during the entire afternoon.\n\nI like it as a character study because it really underlines how weirdly brilliant he is at being a chameleon, and that's not a compliment by the way.\n\nI believe the FT never put it behind a paywall so if you have a spare 10 minutes; https://www.ft.com/content/864c3a96-fbf1-11e5-b5f5-070dca6d0a0d",
            "Will next week be the week of the Rishi Redux?",
            "Is there no recent images from the campaign that have been funny? Had the same MT image for almost a week",
            "blessed with two (2) lib dem leaflets today, this time for me as a voter rather than as a member. not individually addressed. \n\nsadly, no bar chart. seems to be targeting \"one nation conservative's\" (sic incl. apostrophe) who \"don't trust sir keir starmer\" or \"green party socialism\"",
            "If I can be a bit of a local stats nerd for a second, I'm intrigued by the predictions for the Bootle and Sefton Central on Electoral Calculus- I straddle the two of them so both are in my zone of interest.\n\nhttps://www.electoralcalculus.co.uk/fcgi-bin/calcwork23.py?seat=Bootle\n\nhttps://www.electoralcalculus.co.uk/fcgi-bin/calcwork23.py?seat=Sefton+Central\n\nNot on the formality of the result and who gets elected, that's obviously not in question. What has got my eyebrows raised is the expected vote for Reform.\n\nThese are areas where UKIP and the Brexit Party generally didn't make much of an impact in terms of votes historically, we voted to Remain too. They retained their deposits in both constituencies in 2015 but other than that, not much else to shout about.\n\nSo why on earth are Reform predicted to take 10% in Bootle and 13% in Sefton? I just think that's a bizarre take. I can only assume this is an automated prediction based on previous results and general demographic trends? I also don't believe the Tories will get 5.8% of the votes in Bootle either, they're considered poison at the best of times, never mind now.",
            "I’m watching the leaders QT from Thursday and atm Sir Ed Davey is coming across very well. Doing a good job relating to and building a rapport with the audience. Seems like a good bloke",
            "With the betting scandal is the implication that they had exact knowledge of the election date from Sunak or indirectly from Sunak? Has anyone asked him how they got the information? Has anyone asked if Sunak made a bet on the election date? It seems weird that I haven't seen anyone ask that.",
            "My Postal Vote's just turned up today, gonna fill it out and return it same day. Living in Boston & Skegness constituency, Labour is the only realistic shot and getting Tories out, but this is normally a very safe Tory seat so we'll have to see.",
            "Our media just doesn’t know how to scrutinise Nigel Farage. His views on Ukraine are clearly potentially problematic so do they ask him genuine incisive questions about it? Do they ask him how he’d vote on a Ukraine aid bill, a cruical question with a big impact?\n\nNo… they just bring up a decade old comment out of context (“you said you admited Putin”), he then puts in the context (“as an operator but as a person”) and the only people who care are the people who would still spend a day whipping up hatred against Farage if the only thing he did was leave the seat up.",
            "Farage should have taken a page from the New Labour playbook:\n\nTough on Putin. \nTough on the causes of Putin.",
            "I think that people are starting to get ahead of themselves when conflating the Tories and Reform. Yes, there is a radical element of the former that is sympathetic with the latter. But the core principle of the Tories is 'no revolutions' - they try their best to get people to accept that status quo whilst slow change takes place. The most 'radical' policy Sunak has is Rwanda - and (you might have noticed) nothing has actually happened with that because the Tories are still trying to achieve it through the existing system. \n\nReform wants to blow things up and rebuild in their own image. The majority of Tory voters do not want that. Yes, Brexit and Boris increased the number of radical minded people in the Tory party, but it's still a minority. It's like suggesting that all of the Labour Party would be ok with merging with George Galloway's party if it suddenly jumped to 20% in the polls.",
            "My vote will be going for whoever allows vigilante justice against the kids trying to bully various neighbours on the street.\n\nIt's trespass, minor theft and borderline assault but to honest it's just kids being shits.\n\nYouth centres and policing work over time on a macro scale, but I'd like swifter action on the 14 year olds taking a swing at people",
            ">[Before everyone jumps to conclusions about Nigel Farage may I suggest that he is sent to Moscow for testing to see if he is actually one of theirs?](https://x.com/newsinbrie_/status/1804476870794035392?t=dAxpYgS6P9hF0i3Lvvt7JQ&s=19)\n\n👌",
            "I've seen 3 videos now of Labour MPs (Shabana Mahmood, Rushanara Ali and Jon Ashworth) getting harassed by 'obsessed with Gaza' types.\n\nHas there been any official comment from Starmer or the Labour Party on this?",
            "Amazed that last night, switched on the ITV News and Etchingham led with *Gamblegate* - not the story, but the immediately mainstream use of the nickname.",
            "So far there seem to have been two polls where Reform is ahead. Hopefully this suggests it won't happen, the Tories are still just about leading in most of them (and leading by a fair bit in a few of them). I'm a lot less happy with this election since the prospect of Reform eclipsing or merging with the Tories was raised, that's one of the worst things that could happen to British politics.",
            "Can someone explain the header image to me?",
            "Have I missed a poll or is this just yet another bs account?\n\nhttps://x.com/jackreformuk/status/1804455466958770185?s=46&t=OqikFaYwt-WpTpXMtKyIcg",
            "Is Rowling actually going to endorse anybody or does she just like to light fires?",
            "Hour at gym trying to get myself out of the overweight Britain statistics (I also am on a diet, but trying to gain muscle as I go. BMI 25.1)\n\nWas thinking. The recommended daily allowance for a woman is 2000 calories (I am 5’10, so can probably get away with 2200 and not gain weight given my activity level). Wonder if we should look to lower the recommended amounts a bit, for office job people at least\n\nObesity is such a huge (lol) issue and we’ve had successive governments and successive failures. how do we help people help themselves? Better quality of life all round would help hugely I imagine. You don’t need to numb yourself after a crap day on minimum wage etc, if your life is materially better.",
            "[deleted]",
            "I've seen rising concern here on the danger of Farage and Reform becoming a real threat at the next general election. And I think it is incredibly important that those of us on the centre left try to do what we are normally terrible at, and that is to sort out our messaging.\n\nIf we worry too much about Farage, and the delusions of his supporters, we are strengthening him, making him seem more credible and allowing the media to move on from any of his scandals, as they just say that people don't care.\n\nInstead what we need to do, is to strongly, firmly say that he could never win our vote nor the vote of millions of people across this country like us. I would suggest as the strongest reasons that \"he is pro-Putin, a genocidal dictator, and so is a risk to our national security\", or that \"he wants Truss-style unfunded tax cuts and would crash the economy\".\n\nIf we can get these messages out, and get the media talking about a ceiling to Farage's support, and how he can never replace the Tories who draw on the support of more moderate voters, then the media will more properly scrutinise, and won't be able to glide over his inevitable scandals.",
            "After using iPlayer to watch the Euros in HDR I will be disappointed not to be given the option for election night. I want to see the vivid colours of the rosettes ",
            "[Tories post with Sunak's comments regarding Farage](https://x.com/Conservatives/status/1804508809840251063)\n\nCould be interesting to see where the comments going..",
            "Truly brightened my day - thank you. \n\nYou have also inspired me to look in my fridge for post-Tory produce. \n\nAside from condiments and preserves - so far we have a dozen eggs, a block of cheese, and a courgette I’m sure can go the distance.",
            "Oh that’s a good point. My “use by 5th July” yoghurt I bought this week will now be my celebratory beverage.",
            "This has been clear for years. There's a reason why any time politicians like him are pressed for details on anything they flounder hard, regardless of where they are from. That's also exactly why so many people who are utterly disengaged from most of this shit and tired of the 'complexities of modern day problems' flock to them.",
            "It's the curse of our era that when government got demystified it left the impression that anyone could do it.",
            "Yeah I think Wallace thoroughly demolished Farage in that interview. It's a pity it is unlikely it will reach the ears that need to hear it however.",
            "“Enjoy yer night mate”.",
            "Isn’t that literally how he started out? He just did it with enough chutzpah and had enough money to turn it into a successful ~~job~~ grift.",
            "Assuming this is Farage - though I know he's not the only one:\n\nThere's something particularly unimpressive about his \"I'm not saying I like Putin, just that I admire him politically\" line. It's up there with \"I'm not saying Hitler was good, just that he was great *at what he did*.\" Which can be forgiven coming from an edgy 14 year old who is thinking about morality and effectiveness as two different qualities for the very first time, but it's pretty tediously unoriginal at this point.",
            "Who pays the price if we keep emitting CO2 unchecked?\n\nWho pays the fucking price, Rishi???",
            "It's like the debate scene in the West Wing. What are the next 10 words? So who does pay for it? \n\n>Ten-word answers can kill you in political campaigns. They're the tip of the sword.\nHere's my question: What are the next ten words of your answer?\n\n(I know it's not quite 10 words, but it's close)",
            "Richest 1% responsible for 16% of emissions on their own. So obviously they'll all be happy to pay a 16% carbon tax. Right?!",
            "I think you're more right about his disingenuous nature. It's like asking, seriously, why lie? Noone gains from it at all .",
            "Their bio is quite something...\n\n\"Battling porn addiction, recently divorced and looking for a new venue for arts & crafts nights. Will update when found\"",
            "“I had to…” made me laugh.",
            "Remember, nothing to do with Farage. He essentially disowned all his candidates last night.",
            "The arts and craft fair has formed a gestalt consciousness that is focused on Spunk and Nigel Farage.",
            "I've not been up long enough to process that...thing?",
            "It was just resting in his account.",
            "Have you ever seen that Key and Peele skit about another black guy joining a friend group? It's like that, it's what makes him super-special in his environment and he hates, *hates* having anyone challenge him on that turf.\n\nSee also Joan Crawford/Bette Davis (although this is a bit more one-sided). It's petty ego and jealousy.",
            "It’s clear at this point that the Minister for Vererans is actually the Minister for Johnny Mercer and His Mates  (most of whose just happen to be veterans).",
            "Really loathsome, disrespectful attitude.",
            "[He's also just a rude, arrogant sore loser in general](https://www.google.com/amp/s/news.sky.com/story/amp/government-minister-johnny-mercer-criticised-for-comparing-labours-new-mp-in-selby-and-ainsty-to-the-inbetweeners-12924626).",
            "Loathe this attitude, especially from the minister for veterans.  He just can't countenance anyone not fully absorbed in his exact world view.\n\nMercer, like some on the weird left, likes to pretend that the Labour Party has always been what it was only briefly under Foot and Corbyn.  It's the only way Tories know how to campaign.",
            "He's also consistently been a prick to Richard Foord and called Foord a fake bloke so I don't think this extends to just Labour.",
            "No wonder American politics is so thoroughly dominated by money, what could be the point of such expensive campaigns other than raising the barrier to entry as high as possible?",
            "I'm sure I read a stat that said it costs over $1bn to campaign for president\n\nIt's fucking insane",
            "I think one of the sides was spending something in the realm of $17,000 per minute to unsest Bowman",
            "I wonder what would happen if some American SuperPAC decided they really liked Reform and casually dropped a billion bucks on Facebook/YouTube/TikTok etc on their behalf.",
            "Mercer doesn't like that he's running against not only another military man, but someone from an elite unit. He's green with envy because being an army man was his thing\n\nHe's pathetic",
            "Stewart with his 'I wasn't a spy, though if I was a spy it'd be illegal to tell you', being the son a spy, and having a history of doing fairly spy-like things like going hiking around Afghanistan shortly after the war started can probably tell you quite a lot about the need for discretion in certain services.",
            "I'm reporting you to the Gambling commission just in case you're Shapps alt account.",
            "How’s the house hunt going in California?",
            "What odds did you get on it?",
            "And yet theres basically zero coverage from the right wing papers (minus daily mail); Farage being held to lower standards than everyone else once again.",
            "Don’t threaten me with a good time Kemi",
            "labour's highly detailed manifesto commitments about not changing brexit in any material way are a reason why i don't want to vote for them\n\ni wish badenoch, \"lord\" frost, and all the rest were actually right in their doom and gloom proclamations here",
            "For some, including me, if I thought Labour would actually reverse Brexit, it would be more of a reason to vote for them. She really hasn't thought this through.",
            "Old Meg ❌\n\nPhoto of Keir Starmer ✅",
            "Our dear leader Comrade Starmlin has ordered mandatory photos of himself to be on all persons at all times",
            "if they're going to keep doing the tax argument, why can't they get their australian friends to whip up a new version of [this](https://www.youtube.com/watch?v=P2Tp8_7glXs)",
            "So the next Tory scandal will be about wallets. Is that how it works?",
            "These are Electoral Calculus's predictions for Plymouth Moor View:\n\n[New Seat Details - Plymouth Moor View (electoralcalculus.co.uk)](https://www.electoralcalculus.co.uk/fcgi-bin/calcwork23.py?seat=Plymouth%20Moor%20View)\n\nTL;DR - Fred Thomas has an 89% chance of winning...Mercer has a 10% shot at retaining his seat. \n\nPoor old Jonny Mercer is up for his very own Portillo moment and with it the loss of his £91K a year job. As his wife runs his office she'll be losing her job too...so something like a £130K plus hit to their finances, then there are the generous expenses....\n\nNo wonder he's throwing shit at the wall.",
            "Perhaps the director of campaigning should intervene directly and have a private word \n\n*Oh wait*",
            "Someone got the HIGNFY clips where he got in a tussle with Hislop due to dodgy payments?\n\n[Oh, I got it here.](https://www.youtube.com/watch?v=jpe2u1wKpiU&t=39s)",
            "Subtle dig at Johnny 'Twitter meltdown' Mercer there",
            ">Nick Robinson, \"You can't run vetting but you could find £150 billion in public spending savings\"\n\nHahahaha, Not that it matters to the people voting for Reform but this level of incompetence being normalised is hilarious.",
            "I can't believe so many people fall for his obvious bullshit. All he does is point out problems that make people angry (problems that anyone can already see) and then provides simplistic solutions that would never actually work.\n\nAnd then when they don't work (like Brexit) he blames someone else.",
            "Farage is entirely unable to take responsibility for his actions.",
            "They seem to be importing more and more Republican style talking points. \n\nI suspect you're right and they might just copy them wholesale.",
            "I don’t know how much luck they’ll have with far right sponsors in Europe. Most are profit goblins, not ideologues, and the Tories have kinda cut off their noses to spite their faces in regards to corrupt European money. \n\nAmerican money however….",
            "I suspect his Russia commentary will cost Reform some votes. Many were considering Reform to punish their default political choice.  Perhaps they're now more likely to stay home this GE... or hold just their nose and do what they do every GE.  The is war scarily close to home and not in the Middle East.",
            "> He may not lose many extreme voters but he's put an absolute ceiling on how many votes the party can get for the next few elections.\n\nHe's also going to trigger a major grassroots revolt if he tries to take over the Tories, they're absolutely not in the business of praising Russia and support for Ukraine was one of their few recent successes",
            "I still subconsciously read his Twitter handle as 'Andrew Fuckin' Neil'. Every time.",
            "Join me in manifesting Mercer sinking his own campaign through the power of twitter. It's a great day. \n\nAlthough I get you, I keep telling myself two more weeks and we'll be out from under this. There's a strange efficacy to Labour's message of change, I find myself looking forward to July 5th in the same way as I look forward to a day I plan to live a series of 80s training montages and finally get my life in order.",
            "It's fucking grim.",
            "Her's is one of the saddest stories for millennials of a socially liberal viewpoint.",
            "It wasn’t at 5;30am, it was Farage. \n\nIt was just times this morning leading with Rowling , someone decided to remove the lead as Farage and Putin and go with JK instead",
            "Mercer really is a relentless tosser.",
            "Jesus. Not having paid a massive amount of attention, from Mercer's tweets I'd fully thought Fred Thomas was the one who was convicted of lying about his medals.",
            "He's actually doing the \"I'm so bored of this\" thing my sister used to do when she realised she was losing an argument she started. \n\nAdmittedly, she was a 17 year old girl at the time.",
            "Just block. He'll be irrelevant in a fortnight anyway.",
            "can we trade? i'm getting all the \"i'm a nurse/veteran/artisan sandwichmaker, 7/43/55, who is voting reform party\" tweets at the moment",
            "High likelihood of him storming off during the winning candidate's victory speech.",
            "Cambell’s more recent honesty about his own struggles, his families and the wider problems in society are nothing but a good thing and you’ve got to say yeah that’s a bit of good in the world \n\nWe could lay a lot of today at his feet in the media and how they behave let alone the new Labour years but he’s also had some daemons he’s battled and spoken about publicly that helps balance some of the shit out.\n\nPeople are complex and so for me he gets a bit of a boost because of these actions",
            "They're starting to get desperate now, and there's still 12 days to go. We're going to see some really unhinged shit soon, and I'm not talking about Johnny Mercer's twitter meltdown.",
            "This is a very silly hill for Jonny to die on, he really should know what service with the Special Forces Support Group (SFSG) actually entails. I’m starting to suspect he’s a bit thick",
            "Yup.\n\nEdit: fuck me Johnny are you actually going to pick a fight with Rory Stewart?",
            "Post-MP job hunt not going well I suspect",
            "I've just found that Mercer wrote a book about his time in the army called We Were Warriors: One Soldier's Story of Brutal Combat.\n\n\"Brutal combat\" sounds a bit Partridgey.",
            "He isn't getting on a commercial jet like some kind of poor.",
            "I just hope someone is looking at betting patterns for other dates. There were widespread rumours that a GE was about to be called, so people may have put a bet on, knowing they soon wouldn't have a chance.",
            "Or school enrollment. ",
            "Yes. All props to them.\n\nIt's a bit more memey and online than I instinctively want the official party account to be. But there is no doubt that their work is creative, attention-grabbing, and high-quality (apart from the spelling error in the launch video).",
            "See I think there's a certain portion of tory vote that love brexit above all things that are prepared to endorse a bit of Putin loving if their lord and savior Farage says its okay. \n\nThese are the kind of people who put their fingers in their ears and chanted \"we can't hear you\" about Russian interference in the brexit vote in first place.",
            "Because tories and Farage draw from the same pool. Attacking Farage would be, to an extent, taking a swipe at its own base.",
            "Conservatives cannot talk about Farage.\n\nHe is their Candyman.\n\nMany of their voters like him - even if they won't vote for his party - so, insulting them through him is bad tactics.",
            "Probably just don't want to draw attention to the fact that he exists.",
            "It’d be perceived as an acknowledgement of how in trouble they are.",
            "It does feel a lot like saying an abuser was provoked into murdering their victim because the victim was planning on asking the authorities for help.\n\nIt’s a kind of truth, but it tells you a lot about the truth-teller.",
            "Is this Clarkson the real person, or Clarkson the persona? Because he'll let you know which one depending on the backlash he gets...",
            "He's mates with Cameron.",
            "This election is a wake up call how far gone many voters are",
            "He is besties with Cameron and Rebecca Brooks. ",
            ">  because they'll be worse than the Tories\n\nCitation needed.",
            "I assumed his constituency would be a Lib Dem - Conservative battleground but [EC says](https://www.electoralcalculus.co.uk/fcgi-bin/calcwork23.py?postcode=OX7+3PE) Banbury is going to Labour.",
            "He has a large commercial enterprise that relies on not upsetting his fans. \n\nSaying that the Tories are useless doesn't lose you any viewers. \n\nSaying you're going to vote for Labour does.",
            ">I will leave it there\n\n4 more tweets in an hour after this btw",
            "I always love a \"I'm having the last word and let's leave it there\" argument. Mercer is clearly a Redditer.",
            "Strictly speaking. I don't think MPs can claim a salary after parliament has been dissolved.",
            "Ah yes, the Reddit tactic of declaring yourself the winner and flouncing away from an argument when you know you've been talking utter shite. I'm just hoping he gets sued",
            "Why don't they just fight it out on a tactical training course? Winner takes the seat.\n\nThe spy in Special Ops should walk it.",
            "Cleverly going for the centre-right grouping in the upcoming Tory Civil War Part IV.  He may be in the minority.",
            "I noticed that - you're not Foreign Secretary now, James.",
            ".... but if ULEZ was national you'd just ban high emission cars... You wouldn't need the cameras...\n\nNot only fictional, but irrational!",
            "Honestly it didn’t even make the point it was trying to for me, Iooked at \n\n- logo\n- photo\n- text\n\nSo my first impression was the tories were doing a readiness campaign for their own ulez rollout? \n\nWhy did they put national ulez on a photo with the Tory party name and forget to mention Labour??",
            "My first thought seeing that pic is that they're proposing a national ULEZ. Not sure its the best bit of graphic design I've seen.",
            "Mail & Express reporting this too in the last 24 hours, not sure if it's coordinated?",
            "I am so ready.",
            "Minister for Veterans now trying to gatekeep what it means to be a veteran and saying it should be a criminal offence to claim to be one if you don’t fit his narrow definition.\n\nWhat a bellend.",
            "Was his wife spotted working late night shifts or what has gotten his panties in such a twist?\n\nOr more truthfully, some people are really bad at losing, like Mercer apparently.",
            "I feel like Mercer *not* having a twitter meltdown is more worthy of comment at this point.",
            "once again wondering if there’s any sort of levers the military brass can pull to shut him up.",
            "Oh how embarrassing",
            "I'm impressed at how earlier today he said he was going to \"leave it there\" and now he's still furiously digging.\n\nNice to see we've gone from \"you lied about your service and should be arrested\" to \"you should apologise to me for this guardian article you didn't write\". I really hope he gets sued for this nasty display of why the Tories deserve to be annihilated",
            "I can't remember a single word out of him that wasn't about veterans. He doesn't have constituents, all he cares about is the army.",
            "he might even have got the veterans ID card onto the voter ID list",
            "Depends on whether it's publicised in outlets which are likely to reach Reform voters.\n\nI see it's front of The Telegraph, which has been flirting with Reform, and somewhat more strongly on the front of the Mail. Express obviously silent. I'm surprised they didn't pull the Diana alarm.",
            "Never underestimate the stupidity of the British public. ",
            "Doubt it. There seems to be a double standard with this stuff. Corbyn and his followers were rightly and repeatedly crucified for their weakness on defence, not been the same reaction from the press so far.",
            "It took time for right wing voices to align behind Trump’s Putin-sympathetic views in the US, too.\n\n\nThey all fell in line eventually.",
            ">My favourite though is the likes of Carl Benjamin who think it's wrong of the BBC to ask Farage about his views of Putin,\n\nI'll be damned if I listen to the unhinged rantings of that man with an unwashed arse.",
            ">Easy to squirm at it but if we are serious about avoiding WW3 we must look at NATO’s move to the border of Russia and sympathise that this would never be acceptable by any western country if the shoe were on the other foot.  \n\nThe shoe *literally is* on the other foot for Poland, Estonia, Latvia, Finland, etc. what is wrong with these people?",
            "Godspeed 🫡",
            "Put on some sunscreen. It's nice out and easy to sit outside getting sloshed and sunburned.",
            "Am I right in remembering you’re Bristol based? I did the craft beer fest there the last few years which is great, is this a pub crawl you’re doing or an official tour? Keen to learn more if the latter",
            "That whole story is bonkers, and more than a little scary that someone got into that senior of a position without anyone thoroughly checking his record.",
            "A pathetic George Santos.",
            "Really the cream of the crop of the British electorate on show there.   \nTruly depressing and only slightly hilarious there.  \nI've seen a man tear up a ballot because UKIP weren't standing and he wanted to vote UKIP, storm off and then 10 minutes later return asking for his ballot (that has been put in the box at the direction of the RO via the presiding officer) - I'm getting similar vibes to that in this video.",
            "Pizzagate guy said Farage wasn’t crazy enough for him?",
            "There are a million reasons to dislike Sunak, this is the first time I've heard \"too young\" as one of them... He's 44. Certainly not *old* but comfortably middle-aged...",
            "Tory mp: “These are the cognoscenti of Spalding”  \n\nAnd it’s a guy with a big “Milf hunters” sticker on the front of his mobility scooter     \n\nSatire is dead ",
            "Remember you may sneer and joke but I guarantee to you every single one of those specimens is going to vote.",
            "With a war on in Europe and heightened tensions in a lot of places, this is irresponsible and should probably be illegal. It makes everyone that bit less switched on if there’s an actual emergency (I don’t consider unemployed Tory former MPs an emergency). \n\nIt’s not surprising but the fact that it isn’t surprising doesn’t make it any less scummy.",
            "“Labour will flatten the green belt”\n\nThank you for brightening my day, mysterious warning system.",
            "Hideous Tory misbehaviour. Shocking. A great reminder of why we’re attempting to destroy them as a political entity",
            "That's shameful. Just when you think we've reached the bottom of the barrel.",
            "Where's FactcheckUK when you need them?",
            "Are these actually running?\n\nAnd has anyone reported them to the electoral commission?",
            "Laura K not buttering your parsnips?",
            "I’ve gone with Channel 4 ever since 2010 when they had Charlie Brooker and his “we’ll be right back after this series of short films about the nature of capitalism”. \n\nTheir lineup this year looks pretty good.",
            "I hope you're going to edit this into a video",
            "They’re just agreeing with whatever their team says. Farage is saying it and it’s provocative so they believe it. It’s also almost completely lacking in nuance which appeals to Reform voters. Simple solutions for simple people.",
            "It's a common sentiment in online right wing circles.  It is of course utterly ungrounded in reality and a line lifted directly from Russian propaganda, but those things aren't a concern for those susceptible to this sort of information manipulation.",
            "If Farage had come out fully behind Ukraine they would have had no second thoughts about it. Just like how the maga brigade suddenly all had strong opinions on Ukraine when Trump decided it would be politically useful",
            "For a lot of them it's an abdication of thought - they'll follow whatever he says because it's easier than having to form their own opinions and risk having to defend them.",
            "At what point in the next parliament will you start the countdown again..?",
            "Particularly when it is hard left and hard right who are the only ones that agree. That pool is absolutely minuscule. ",
            "Starmer's Genies really need to unionise at this point. In the last few days we've had Conservative gambling fraud, Farage outing himself as a Putinphile, and wasn't there some SNP news right before the debate?",
            "Reform voters idolise Farage, this wont change their mind. It's like how Trump voters don't care that he is convicted of a felony.",
            "The hard Reform vote won't be affected, but I do wonder about the \"vote Reform to punish the Tories\" crowd. Question is whether the Tories are able to pivot to take advantage of it, so far they've shown the nimbleness of a drunk England fan.",
            "I know what you mean. It feels like the Tories have given up and so the media aren’t interested in anyone other than Farridge.",
            "I still find it odd that postal votes get issued so early. Locking in a vote almost 2 weeks before the campaign ends seems undesirable to me even if you have no regrets and were never planning to change your vote.",
            "Star wars style Senate colloseum",
            "Yes, somewhere away from London.",
            "There’s a small group of people that care about Israel/Palestine and think it’s the only thing anyone else should care about. Whereas the majority of the population probably interest probably starts and ends at “I wish they’d stop killing each other”",
            "I can't believe you'd use such strong language.\n\nOwen Jones is not a Journalist.",
            "Its also ignores that the UK position means diddly squat to Bibi - he’s currently laughing in the face of the US, he’s barely noticing us.",
            "100% agree and same. I'm sick of people acting like a position on a complex historical foreign conflict is *or should be* a central policy area during an election.\n\nSeparate to that, I also cancelled my Graun sub (about 18 months ago) and lately stopped even checking the site. It has become an absolute toilet.",
            "I am not entirely sure how Owen remains relevant, he appears to turn up shout everything is awful, imagine if Jeremy were in office and that's all he has to offer.\n\nPeople can't afford to feed their children, they are not worrying about a conflict in the middle east, he might think that's crass but looking after the people of the UK is, and should be a higher priority than effectively virtue signalling about a war we cannot influence.\n\nI'm sure Isreal take it so very seriously when Bury council etc tells them they must have a ceasefire, they won't do a thing until America says they've gone too far.",
            "Amazing that someone who has written multiple books about the British class system is surprised that an election is being fought on domestic economic issues and not a minor conflict on a different continent.",
            "All papers would improve dramatically with the removal of \"opinion\" sections which are purely there to drive outrage.",
            "For me, I stopped trusting the Guardian when they posted an article about a subject I have intimate knowledge of, and it was all entirely bollocks. Every sentence was wrong. And wrong as in literal, easily discoverable facts were wrong, not difference in opinion.",
            "Owen Jones has never really struck me as a bastion of balanced reporting. He does an excellent job of shouting very loudly in to an echo chamber that would have you believe it represents anyone left of centre.",
            "In hindsight, Starmer has also had a sensible position throughout.\n\nCondemning the 7 October attacks, repeating Israel's right to defend itself in the face of attack, calling for caution and a clear plan etc., calling for aid to be let through, and then after things dragged on too long and there was a sense of disproportional response / lack of what to do after retaliation, calling for the war to stop and condemning the suffering caused by Israel's response.\n\nIt's as much as any mainstream political leader of the UK could do.\n\nCompare this with some on the left like Owen, who within what, 1 day, 2 days, started demanding a ceasefire and using weasel 'you reap what you sow' style language.  Framing (in sly words) any attack by Hamas as being somehow _understandable_ given the history.\n\nTbh it's been refreshing how Gaza-free our UK general election has been, other than a few obsessed people running as Green or independent candates (like that awful Brummie grifter lawyer who idolises Andrew Tate).",
            "I would say that Gaza has been talked about too much in the election. \n\nIt is an important issue in foreign policy, but there are many differences on foreign policy that need to be aired.",
            "Congratulations, you tell us though. I bet you were doing some pretty intensive polling of your own.",
            "I wish the married couple well.",
            "You will now understand the importance of having the majority of opinion (and votes) in the House.\n\nCongratulations! \n\nNow, in the nicest possible way, fuck off and pay your other half some attention instead of getting caught up in terminally online short term dopamine addiction.",
            "Congratulations. May your marital coalition be stable and lead to good domestic government and prosperity!",
            "Congratulations \n\nDoes the honeymoon involve counting ballots in your local run down leisure center in 2 weeks?",
            "Congratulations!\n\nNow get off reddit and don't come back for the rest of the day you muppet, go spend time with your wife!",
            "Congratulations! Don’t spend your honeymoon on Reddit lol x",
            "Congratulations on that.\n\nIf this isn't getting too para social.",
            "Iconic political tweets vol. 94",
            "He's not beating the Alan Partridge comparisons",
            "So...real talk, did someone insinuate this?\n\nIf so, that's disgusting. But this is the oddest way to remedy it.",
            "For once I don't disagree with them, it absolutely should be called out.",
            "Good, it should be called out for the utterly brain dead comment that it was/is/will always be. \n\nIt's a shame that they have such a difficult time calling out the rest of his BS.",
            "*Everyone* should be doing that tbf.",
            "I mean as much as I hate them good this is one of the main things I'd hoped that every non fringe element of the UK could agree on.",
            "After the vetting scandal this was always going to happen. Reform are going after their mates, they need to be punished. ",
            ">let's get as many *good* tory mps in the commons as possible\n\nI think I've identified a problem with this plan.",
            "I think its too late for any of that and there's more than just sunak tainted now.",
            "With 12 days to go? Nothing is going to work now. \n\nI think it would have been the best strategy from the start though.",
            "Actually, yeah that would work. Especially as it would let them spread out the media appearances between people like Street and Cameron, it would force people to think about the campaign locally rather than nationally, which reinforces the incumbent's advantage. \n\nThe thing with Rishi is, people hate him. He's a slimy little squirt. We've all met someone like him and they just aren't likeable. But it's not even that, it's the opportunity to cut Labour out of the newscycle and reframe the question from \"punish the tories\" to \"actually Bill's been your MP for 15 years and he's not a bad egg, now that Rishi's gone...\"",
            "given the quality of the 2019 intake, i can't imagine anyone willing to be a sacrificial lamb for this election is any better",
            "Support for Ukraine remains very high but a part of me worries that Farage's influence will cause his supporters to shift position on it.",
            "You have to consider that Farage's supporters will views his comments in a more 'forgiving' way than people on here will. It's like with Trump in the US - he occasionally says things that his various bases hate, but they just ignore it.\n\nI know it's not the same with Farage/Reform as they don't have that loyalty. But I do think that most Reform inclined people will look at a headline of \"The West provoked Russia\" and will respond  \"Yeah, they probably did - but that's not the point.\" Then they won't bother digging deeper into a story that they don't really like.",
            "I'm already seeing reform supporters, even those with a flag in their name, falling in line behind Farage's narrative.",
            "I think it will put off some disillusioned Tories, but most of the people looking to vote Reform are likely the sort of people who are happy to parrot whatever their populist saviour tells them.",
            "Nope.\n\nLike other extremists (Trump, Boris, Corbyn) so long as the core pillar of his appeal isn't undercut, the other stuff will be simply handwaved away until such a time that the weight of evidence and examples becomes unbearable.\n\nThere won't be a single breakpoint issue. There will be straws that progressively break an increasing number of backs.",
            "I don't think his voters would care, he has called it the EUs fault too, they might like that",
            "He has previously said the he doesn't understand how veterans could vote Labour and I think because now a veteran is standing for Labour against him it has broken his mind.\n\nThat together with him being constantly one step away from getting angry has lead to this situation.",
            "Mercer seems the sort to think it's 'clever'.\n\nHe's very badly mistaken.",
            "i hope journos dig into the \"i'm a minister in the department\" remark.",
            "He might have been there training Ukrainians how to use the equipment and that’s still valuable position. He has not claimed to have seen combat as far as I can tell and it shouldn’t matter. \n\nBut a veteran minister acting like Mercer is doing, that’s very worrying. ",
            "I think the right wing vote being split so badly plus the massive swing to Labour kinda broke the normal polling methodologies",
            "With bills more than half for me",
            "Do you have a link for the source on that? I don’t doubt you, I’m just wondering if it’s for all accommodation or just renters and mortgage payers. \n\nThe best stats I could find for the UK were:\n\n* Mortgagors: 22% of household income\n* Social renters: 27%\n* Private renters: 33%\n\n[ONS](https://www.gov.uk/government/statistics/english-housing-survey-2021-to-2022-headline-report/english-housing-survey-2021-to-2022-headline-report#section-1-households) \n\nGiven that about 1/3rd own their homes outright I wouldn’t be surprised if our average nationally was about 20%.",
            "I know loads of would be Labour voters who aren't voting, youngsters mainly, they don't see any point, they think they're all the same.\n\n\nI disagree and always outline the pros and cons for voting for whatever party.",
            "There was a hustings in Plymouth Moor View where Labour's candidate, Fred Thomas, was asked some questions about the under-cover ops he was involved in while he was in the Marines. \n\nBeing confidential (and maybe these are on-going) Thomas was unable to furnish any details, something that Mercer should be aware of, after all he rarely passes up an opportunity to remind people of his military background. \n\nConsequently Johnny Mercer has taken to the media to broadcast his scepticism that Fred Thomas was involved in any under-cover ops even referring to Thomas as a \"Walter Mitty\", a statement that flirts dangerously with the defamation laws - but then Mercer knows full well that Thomas cannot sue because in so doing he'd have to disclose details of those confidential military campaigns he was involved in which creates a legal catch 22 situation...\n\nMercer then graciously expressed his disappointment at the barrage of incoming fire directed his way and said he would \"leave it at that\". Only he hasn't...and has doubled down on them. \n\nEssentially with predictions pointing towards a Labour win in his constituency he's lashing out in all directions in the hope that somehow it turns his fortunes around. I would presume that Plymouth Moor View has a higher proportion of people connected to the armed services than in most constituencies and Johnny boy is trying to appeal to these people. That however is double edged, military folk are not keen on seeing other's people's military service being doubted.",
            "wouldn't say it's a lot, he's just being very loud about it\n\nultimately it's still \"he says\" vs \"he can't say\" and mercer has escalated it beyond all sensibility by releasing secretly recorded hustings and making potentially libellous claims\n\nit's absolutely what you'd expect from a guy who is about to lose his huge taxpayer funded income, as is his wife\n\ne: while i'm [here](https://x.com/JohnnyMercerUK/status/1804446864520966334)\n\n> The Labour Candidate in Plymouth has now changed his tune to say the article which he promoted for ten months is ‘misreporting’ his service. Veterans at the hustings smelt a rat; they were right.\n\n> Bored of it. Lots of other things to campaign on. In Southway today- come and chat.\n\ni wonder if this time he'll make it to an hour before Logging On",
            "The challenge for the Tories is that they now have to fight on two fronts, and most local organisers were prepared for neither.",
            "No. This is a bad idea.\n\nMany of their voters like Farage and some of his ideas. They are Conservative voters, though.\n\nAttacking him will be attacking them.\n\nPlus, giving him more attention is actually not a good strategy, unfortunately.",
            "I fear for Larry.",
            "I thought the D-Day thing was the worst it could get and then it somehow got worse. So yes, there will be more and it will probably somehow be worse than the gambling scandal.",
            "I work in a similar field where we compete with the banks on some business areas. You are absolutely correct that the younger fintech companies blow them out of the water with their innovation and capabilities, and it's a shame that there hasn't been a wider, more positive reception to these companies. There is a real growth opportunity here, both domestically, but also to export our fintech business as well, bringing more money into the UK. A large barrier is the political clout that banks have, and that pension funds are so limited in what they can and do invest in - they should be investing in riskier, more exciting firms than your classic high street bank.",
            "i don't put my money into monzo because they tie it all to an app. it just feels flimsy.\n\nwhat is actually wrong with \"clunky old dino companies\" other than \"clunky old dino\". in the world of \"tech\" we are constantly told that old is bad, but without any actual basis in fact\n\nwhat would qualify as a so called \"fintech\" anyway? monzo, on the whole, doesn't do anything groundbreaking for me. and their fucking video face recognition thing is incredibly tedious",
            "Talk about damning with faint praise.",
            "He’s actually too crazy for them. He’s gone fully down the rabbit hole: chemtrails, vaccine microchips, great replacement, wef etc etc",
            "Tice blocked him as being a bit too mad.",
            "I really hate the name of that podcast.\n\nDick jokes aren't funnier when a woman is telling them, and I think it gives a depressing, old fashioned view of feminism where we laughed about how stupid men were and how great it would be if women ran the world because we were preternaturally better at it. For three such powerful women, I just find it a little backwards and I want to see a model of feminism in public life that's more positive.",
            "There's a tablet for that.",
            "I see she used the phrase \"luxury beliefs\", I always appreciate when people use terms that let me know straight away that you've been drinking a particular brand of Kool-Aid.",
            "Labour +2",
            "It's really quite the piece of writing.\n\nAs in really quite the piece of writing that suggests you're having some real problems.",
            "What's the TL;DR of the Mercer drama? haven't been following",
            "The youth base isn’t a lot of the Reform vote.",
            "I think the sunshine will make people feel hopeful and up for a potter to the polling station, reinforcing the Labour vote who may have stayed at home if it were wet because \"they'll win anyway\".\n\nThen a lovely sunny speech from the new PM Starmer which will be endlessly contrasted against Rishi's rainy speech calling the election.",
            "[The baby eating bishop of Bath and Wells?](https://youtu.be/zpZ3QgcxHrs?si=Y_IHHFV8CazaX__i)",
            "Jake Berry teased an announcement at 6pm but it just turned out to be Boris doing a cameo video for him.",
            "There is a housing crisis across most of western Europe.\n\nIreland, Spain, Portugal etc.",
            "> Conservative: main message- Cooper has been MP for 29 yrs, and done nothing for the town, so get rid of her! It is true he failed to prevent the closure of the M and S. Typically, ordinary citizens blame the council/ the MP/ the government for thing that are actually commercial.\n\nMP's getting blamed for shops closing is an annoying folly of British politics",
            "This is a great comment!",
            "I wish they would, the MAGA and Farage ties to Putin concern me greatly",
            "While I personally agree I suspect you’d be disappointed by just how few go through any of that thought process.",
            "Reform is the protest vote.  Farage shouting revolution at every opportunity also endorses it.\n\nBut, if you privately tick Reform, what is it that you actually want?\n\nOther than being mean to immigrants and kind to millionaires/billionaires, I can’t see what Reform want to actually do.\n\nMaybe allow part of Europe to be invaded.  If anything, I think the polls have Reform high.  People saying it for shock value,  but when you go to make that tick they’ll remember they are complete arseholes.\n\nPolls are now saying 18% of people might vote Reform.  I don’t know anyone who’d tick Reform.  Feels high.  As do the Tories, you have been dyed blue to still vote for them at this point.\n\nSo, in summary, fucked if I know.  I can’t bloody wait though.  \n\nFarage in a Tory coalition opposition would be a shitshow. Like fuck.  Imagine PMQs with Farage just shouting catch phrases.  I’m also here for that.",
            "I'm hoping that a lot those potentials are put off by having already been on the 'voted Ukip -> voted Boris -> got this shit-show' journey. It's not quite the same as when they were lifelong Labour voters taking their most radical electoral action. They're already changing their vote in switching back to Labour.\n\n\nMight be a whole sack o' cope, I don't know.",
            ">Pollsters account for the ‘Shy Tory’ phenomenon but **there’s no such thing for Reform**, even though the social cost of saying you’ll vote Reform is, for many people, much higher.\n\nIs this an assumption or have you saw psephologists commenting on this?\n\nI'd be very surprised if the don't take shy Reformers into account.",
            "Thanks for this. Really interesting as you say.",
            "Surely someone can knock up a Photoshop of Johnny Mercer in the classic Platoon pose on stage next to the returning officer for Plymouth Moor View as he loses his deposit.",
            "Spin the wheel, what kind of Lib Dems are we today?",
            "Ugh.\n\nMisplaced apostrophe would lose my vote if I were on the fence.",
            "They're probably working off national demographics, as Merseyside is an outlier in being much more left wing than England at large.",
            "Yeah. Easy to do when you're promising the Earth in the knowledge you'll never have to deliver.\n\nWill be interested to see if the rosy glow around Davy lasts after his appearance at the Post Office inquiry.",
            "Yes, the implication is that they knew and placed fraudulent bets",
            "He doesn't drink. I would be genuinely shocked to find out that he gambles.",
            "I was brought up in Skegness and still have friends there. Strong Blue vote and the people on my FB feed from there seem to be very anti-Labour. I’d be putting my 50p on Reform (although I’m hoping for a Labour win.)",
            "This is the first time Farage has faced proper scrutiny. He didn't get it during the Brexit debate, no one did. He's finally having to face the same questions real UK politicians do. You're observing the facade coming down.",
            "But Farage regards putin as a highly effective operator, he really took control of Russia see?\n\nI assume farage views that guy that charged bitcoin for childporn as a highly innovative and enterprising pedo, even he _dislikes him as a person_.\n\nWhat is it people from the alternative right being obsessed either Putin. It doesn’t seem patriotic at all.",
            "If you read Reform’a manifesto it’s a lot of ill-conceived nonsense, but the general gist seems to be turning us into US-lite… without the anti-Putin stances.",
            "So...Reform, then?",
            "Labour have called for a ceasefire, said they'll recognise Palestine as a state to be part of a two state solution, called for the release of all hostages and for more humanitarian aid in Gaza.\n\nAt this point these \"obssessed with Gaza\" types won't be satisified unless Starmer, Raynor, Reeves and the rest of the shadow cabinet parachuted into Rafah and started gunning down IDF soldiers.\n\nAnd because of that, they should be ignored, they've got their own party now, go vote for Galloway.",
            "Not that I've seen.\n\nI just hope labour hold their nerve and remember that the nutters singularly obsessed with Gaza are a tiny minority.\n\nThing is even if Labour / Starmer condemned Israel daily and officially declared what Israel is doing a genocide, it wouldn't be enough.  Campaigners would keep pressing for more.\n\nThese folks define themselves by the Israel/Palestine conflict, they have nothing else.",
            "Can people just cool it with their harassment of politicians?\n\nCan't they just do something useful? Fundraising, for example?",
            "I hate *gate*. Another dreadful American import. \n\nWe need to return to the format of *the [blank] affair*",
            "Who can forget Andrew Mitchell's famous *Gategate*",
            "Reform will not poll as well on the day as is currently suggested. People will tell polling companies one thing, but when they get to the ballot box they change their mind. This is exacerbated for newer parties by a lack of an effective 'get out the vote' structure.\n\nTwo good examples of this recently. In the run up to the 2010 General Election there was a huge amount of hype about the Lib Dems and 'Clegg-mania'. Expected to do very well on the day, but while their vote did increase it wasn't by as much as expected and their result was 'meh'.\n\nIn the recent Senedd elections, the Abolish the Welsh Assembly party also polled well, with predictions of between 4 and 8 seats (which is a lot in a 60 seat Parliament). But again, even despite the semi-proportional nature of the Senedd voting system they utterly failed, and had a result of zero seats.\n\nReform are going to do ok, but they aren't getting the 18-20% the polls currently put them on.",
            "From [Lewis Goodall's voxpop video](https://x.com/TheNewsAgents/status/1804178802475700417) in the safest Tory seat. It's a really good video.",
            "it's from a lewis goodall video where he interviews the locals in spalding, that's on someone's mobility scooter",
            "I've seen this account pop up before - they're very dishonestly reporting on individual subsamples from general national voting intention polls. In this case, they're reporting on the subsample with a sample size of 220 from the breakdown of the national Redfield poll the other day. With such a small sample size wild swings like this are entirely expected because the margin of error is massive",
            "It's both genuine and highly misleading. It isn't a poll, rather it's a subsample of a R&W poll. Problem is, when you start looking at demographics like this the margin of error is far higher. Notice that the Lab vote is swinging all over the place over the month, far more than any polling has suggested, because there is a load of random noise in there. The are posting it because the latest version shows a big jump in Reform and drop in Labour and thus it suits their narrative, but it isn't distinguishable from noise.",
            "In The Times article she wrote yesterday it concludes with her saying she's unsure of who she'll vote for but is leaning towards an independent candidate in her constituency who supports amending the Equality Act to make it crystal clear that sex means biological sex.\n\nNot much of an endorsement if it's not a party that is standing all over the UK.",
            "People who pay attention to their calorie consumption don't take government figures that seriously and will instead set their daily intake by their goals. Everyone else doesn't bother looking at calorie counts anyhow.\n\nIf you want to have a government driven approach to decreasing obesity amongst office workers you'd be better of advocating for less abstract changes like trying to make fruit a cool snack to bring in instead of cakes.",
            "I think there’s so much variation in height, activity levels etc from person to person, there’s no point in having a one size fits all number.\n\nMuch better just sticking your stats on a calculator and seeing what works for you. https://tdeecalculator.net/",
            "I was obese, then got down to a healthy weight, now it's crept back up to overweight. I know a lot of slim people who are intuitive eaters and don't really think about food. I know ones who work hard to maintain their body composition. Me, I think about food a lot. If I'm calorie restricting, I've got to think about what I'm eating, log it, measure it. I've got to put the work in. If I'm not, I'm still thinking about what I'm looking forward to cooking or what I've been craving.\n\nRight now I'd like to be a bit lighter, but I also know that I cannot be arsed with the amount of mental work I have to do to lose weight (not so much the physical work as I'm already quite active and enjoy exercise). Everyone knows what they have to do to lose weight - eat less (and move more). It's conceptually simple. But for most of us it's just not pleasant.\n\nSo what more can the government do? Subsidise low calorie food perhaps? I think the most promising intervention could be getting the latest generation of weight loss injections quickly rolled out on the NHS. It'd be costly, but probably much cheaper than dealing with the health problems that obesity will bring in the near future.",
            "Personally I'm quite in favour of this not becoming part of the national discourse so it not getting more air time than when Farage opens is mouth is fine.\n\nPeople who have decided to vote Reform aren't broadly going to change tack just because of one comment - in reality a large proportion of them will internalise that idea as one of their own.",
            "It's on the front page of the Mail and the Telegraph, which is what you'd expect.",
            "Hahahahaha. Good one! This is like that Rimmer joke from the red dwarf episode where he threatens to start a leaflet campaign against the GELF.",
            "We did try that theory and we got Liz Truss\n\nAnd we still didn’t learn!",
            "West Wing season 4?",
            "Edit this on the goose meme and you have a winner.",
            "Yeah, but that's like, *hard*, man.  It's way easier to just trot out a quick one-liner with no thought or plan behind it, appealing only to those who won't spend more than a few seconds thinking about it.\n\nLike most things, I think West Wing absolutely nailed that part of political messaging with Ritchie.  He was a drop-in for Bush and that era of short, bold, meaningless statements, and the show had tons of subplots laying out the problems with politics of that sort.  That era seemed to quiet down in the Obama period, with neither McCain nor Romney fitting the mould, but my gosh did it come back with a vengeance with convicted fraudster Trump, and brexit and Johnson here.",
            "Exactly! What I really don't get is that surely he understands that promising one thing in public and then immediately going back on it just makes it so nobody will ever take him on his word? \n\nDo they not teach *the boy who cried wolf* at Winchester or something?",
            "Bahaha.\n\nI JUST commented saying I hope his wife had left him!",
            "It may have been there, but it didn't see active combat.",
            "Or a more British example, the only gay in the village in Little Britain",
            "would explain why he was so obsessed with how he's in the cabinet, and how labour's probable axing or downgrading of that position is the most tragic thing ever to befall this country.",
            "It's a combination of lax & ineffective campaign finance laws, an 'elections-as-an-industry' commercialisation, political calcification meaning that there are only two places for your money to go, a fetishisation of the democratic process without real implementation of it, and the two parties themselves being commercial entities in all-but-name.\n\nIt's an irreparably broken system - here in the UK there are fundamental issues, but due to significantly less political calcification amoung voters, and Parliament’s ability to act relatively unilaterally, it's very fixable with willpower.",
            "It's AIPAC.\n\nAIPAC is making an example of Rep. Bowman for daring to criticize Israel",
            "Im genuinely curious about what lies Mercer’s told about his service now.\n\nPeople don’t react this way to Walt’s in the real world, not unless they themselves feel threatened.\n\nIn an old job we had an outrageous Walt, claimed a rank he never had and was seen not long ago wearing pins for units he was never in etc\n\nHe was a media bod….stood in front of a camera his entire career. \n\nAnd of all the other people who’d served and worked there ? Yeah nobody gave this much of a fuck, they just ignored him and treated him like shit to his face, but nobody went mental about it at all. Because they knew he was full of shit as did everyone else with half a brain. The folks who seems to go the most mental are the ones who did a short service period or who are also bullshitting. Guys and girls with 20 or these days nearly 30 years service generally just don’t care. It’s sad and pathetic but they don’t act like Mercer, Mercer is how Walt’s act when they get outed in public though.\n\nI never served, I’ve family who did, in one of my jobs I was about the only person who hadn’t served so have dozens of friends who did and I’ve never seen anyone react this way. It’s properly fucking weird and properly suggestive of projection.",
            "He dad wasn’t just a spy, he was basically second in command of Mi6 ",
            "Indeed!",
            "Betting companies are currently checking their databases for accounts with the name Michael Green.",
            "12/1",
            "Give it a bit of time.",
            "Front page of [The Telegraph](https://www.tomorrowspapers.co.uk/daily-telegraph-front-page-2024-06-22/) as well, though in slightly more neutral terms than the Mail.",
            "……ehhhh….well…. \n\nThey say that. But they also say [this](https://archive.is/kzpK7) - and despite this bit:\n\n> She reiterated Labour’s existing red lines in the area, saying there would be no rejoining the single market or customs union, and that freedom of movement and a deal on youth mobility were off the cards. These will limit the scope of any future EU deal.\n\n…they’re sounding like they’ll try and do a lot of ‘Swissing’ - which is a good way to get us into a position where we can at least talk about rejoining in a decade or so.\n\nFree movement isn’t going to be on the political horizon until like 2040 unless something major happens - and I doubt that would come from Labour - but there are things they can do to make it a lot easier for everyone despite that (talking about musicians touring in the EU is a good sign).",
            "Even if it was Labour's policy to rejoin the EU we wouldn't be able to do it in the next term anyway. What they will be doing is aligning us with the EU again so that we're in a good position where we could potentially rejoin at least the single market in the following parliament.",
            "I think this is the correct framing for his meltdown.  He's in deep shit and knows he needs something spectacular to turn things around, so he's going full-tilt unhinged in the hope that it cuts through.\n\nSeeing literally everyone turn on him is glorious though.  He's always been a bellend, but now he's at the top of my Portillo watchlist for election night.",
            "That feels like a bath of warm sunshine.",
            "and while some might say he'll be a shoe in for a post politics job given his ex military credentials and government connections, this entire episode should be a red flag to any potential employer\n\nbesides, not many high paying jobs in north cornwall where he actually lives (and will probably have a lib dem as his local MP lol)",
            "What’s the tbundercunt done this time",
            "They’re importing them from somewhere, sure enough.\n\n\nBut it ain’t America.",
            "She's a poster child for Twitter brain rot",
            "...that context makes it so much worse",
            "The Russian bot armies are definitely at work on their behalf.",
            "I think he might just snap and give the least gracious conceding-but-only-because-he-has-to speech of all time.",
            "i get the vibe that he just wouldn't turn up (or would leave before they go on stage)",
            "It's already around. One of the paper today's says Labour will reverse Brexit on their front page.",
            "Tbh it's funny. As based on when they have tired stuff like this in the campaign. It backfires badly",
            "This is the bit that jumped out to me too.  SFSG had long been established and earned its reputation by the time Mercer left the army.  He's surely feigning ignorance with this performative misrepresentation of how they operate.",
            "He does seem to be burning his bridges - Both Campbell and Stewart usually speak well of him. He was on TV with Campbell for the Make Me Prime Minister series. Stewart looks for any excuse to love a Tory Minister, and Mercer's veterans stuff has always worked for that.\n\nBoth of them have now told him that this isn't looking good and he should back off. And he's just doubling down.",
            "Why not? Dislike Mercer, but the reverence accorded to Stewart as some sort of sage is undeserved.",
            "He likely had his career path mapped out in his head. Defence Secretary, Foreign Secretary, Prime Minister. Now all that has been swept away with the Tories likely out of power for a long time and his own seat looking at risk.",
            "Yes, but scheduling a snap GE so soon after a thrashing in the locals, not even telling most of your party in advance. That’s just silly, not going to happen, because it would just be an act of a nincompoop. Oh.",
            "Or at least the base they have left after spending the last five years alienating most moderate historic Conservative voters.\n\nChickens, roosts, etc.",
            "But what about the Lib Dem/ Con undecideds? Surely the Conservatives are taking a swipe at that base all the time with this Reform pandering. ",
            "My sources tell me Labour is campaigning pretty hard in that seat. The council I think is already has a strong Labour presence and the major settlements already lean labour, its the more rural areas that are hardcore Tory",
            "they're paid for the election period. as is their staff, such as mrs. mercer",
            "He’s still a minister as well. \n\nMinister for ALL Veterans (Except one 😡)",
            "It almost certainly is. The Mail are desperate to avoid a Tory defeat. To me, newspapers that campaign on behalf of a political party should be subject to the same rules about campaigning as any other organisation, and subject to the same registration requirements and spending limits.\n\nIt’s not acceptable for billionaire newspaper owners to have free reign to pump out propaganda for their agenda while everyone else has to abide by limits. One of the first things Labour should do is reconvene the Leveson inquiry to reform press regulation.",
            "What's really bothering me is his use of the possessive apostrophe. You're angry about Walter Mittys, Johnny, plural.",
            "Even his supporters are telling him to get door knockers.",
            "Very specifically the army. He seems to really get annoyed by the marines.",
            "He’s talked about himself a lot too.",
            "All he cares about is himself, and coincidentally he was in the army so he can pretend he cares about them as well",
            "Amusing to think Corbyn and Farage probably at last have found something they agree on.",
            "It's a concern, but I don't think the situations are exactly the same. Brexit didn't remain popular, and support for Ukraine is strong for many reasons including proximity.\n\nIt'll be harder to happen - I hope.",
            "Fortunately it's just typed word. I wouldn't subject anyone to his band of \"well ackshully here's some misrepresented data\" broadcasts. Horrid scrotes.",
            "They admire authoritarian regimes just like tankies.",
            "I’m Bristol yep. This ‘tour’ is curated by a beer-bore friend of mine, it’s unofficial. \n\nI understand the proper £40 craft beer tour doing all the microbreweries around Temple Meads is really good though.",
            "Leaving her biases to one side, I just don't get the appeal. I'd happily watch someone like Andrew Neil present even if I disagree with his views.\n\nI've just never found her to be insightful or charismatic so it's a hard pass for me.",
            "Led by donkeys could help! Release on 5th, no. 1 in no time ",
            "if this is to become a recurring series, i guess i’ll keep the rules the same - either when it’s called or whenever i feel like the prime minister is taking the piss by not calling one, whichever comes first",
            "You can wait until last posting day and I THINK there are arrangements for handing it in on the day if you really want. You’re not locking yourself in very far in advance unless you want to. ",
            "Open air amphitheater in Kettering, let's see if they get things done a bit faster when their seats are made of cold stone",
            "Agree. I like the idea of Tamworth; ancient capital of Mercia so has form, crossing point of the West Coast Mainline and the Cross Country line. Not Brum/Manc/Leeds etc so avoids favouritism in inter-city rivalry. Never gonna happen of course, but it’s worth hoping.",
            "I propose the centre of mainland UK. I believe that is Haltwhisle from memory?",
            "My view is it's dreadful, I wish it wasn't happening, but it's not our problem to solve. \n\nI've seen it argued that due to our history of sticking our oar in it's our responsibility to fix things, whereas from my point of view it just shows the importance of Britain not sticking its oar in.",
            "Note that his guardian comment pieces don't even have guardian comments turned on.\n\nI like the guardians live blogs and political coverage etc.  but some of their columnists are insane.",
            "Opinion pieces should be subject to factchecking regulation. That would cut out the 99% of them that are uninformed bullshit by, typically, angry dweebs.\n\nAlso Simon Jenkins should have his internet privileges revoked.",
            "Sounds pretty useless of them. Out of interest, what was the subject?",
            "I get \"old man shakes fist at cloud\" vibes from his \"articles\"",
            "He’s an opinion columnist, “balanced reporting” literally isn’t part of his job description.",
            "\"anyone left of centre\", surely you mean the enlightened ones who are your moral betters and coolest kids on campus?!",
            "Not in hindsight, though. Many of us were on board with his position at the time.\n\nAnd, to be clear, I absolutely agree that Israel should have had a military response to October 7th. And I believe that anyone who says otherwise - and claims that would be their position if their own country were attacked - is being dishonest. \n\nLabour got it right.",
            "\"Now that's what I call tweeting\"",
            "This is what I think the thinking behind it is. Switch the strategy to a local campaign. We get it, you absolutely despise Rishi Sunak, but he's not going to win and he's going to be gone in two weeks. So turn out and vote, otherwise half of your cabinet MPs, your Penny Mordaunts and Jeremy Hunt's are going to be gone too.",
            "Seen anyone do it who's forgotten to remove the Ukrainian flag yet?",
            "\"They're all the same\". The Classic, tried and tested, disillusion tactic now often coupled with \"What's the point, Labour are gonna win, I don't want them to have a super majority\".      \n\n\nI wish Labour would put a lot more effort into calling these tactics out for what they are. ",
            "Nope \nHe posted 5 minutes ago",
            "Arguably three fronts because of the Lib Dems.",
            "Dude abandoned his wife and kid because of his spiral into conspiracy theories. An absolute nutter of epic proportions",
            "You just know there's a minority in his constituency that think he's the best MP they've ever had.",
            "I'd love that to be true",
            "Yeah that's a clear indicator of someone who's given up on reality",
            "Mercer claimed his Labour opponent didn't see enough combat to be able to talk about his military credentials. The Labour chap worked on secret operations so can't discuss what he has done, Mercer knows this and is trying to use it as evidence for his slander",
            "He accused his opponent, whose military service and the secret nature of it had already been confirmed, of lying about his military service.",
            "Mandate of Heaven innit",
            "Oh, well that's a letdown. Thanks!",
            "interestingly no real mention of NIMBYism even though this place is NIMBY central.\n\n \"A Lib Dem fair deal is needed to for housing to provide for the needs of everyone - a secure roof over your head should not be a dream\"",
            "He's on record discussing his love of spread betting on cricket. And he worked in high finance - doing something very close to gambling for a living.",
            "Well he was a fund manager. Isn't that pretty much the same as gambling?",
            "They’re not properly scrutinising him. They’re not asking hard questions, only gotcha questions. That’s my point",
            "I know, we can invade the middle east again! \n\n\nThey surely wouldn't complain about us doing *that*. ",
            "If she’s still in Scotland she’s lying and means the family party\n\nWho are fucking mental!",
            "Talk about a person with a depressing character arc, going from being known for beloved and very successful children's stories to being a batshit insane culture warrior who makes everything about disliking trans people is such a fall from grace.\n\nIt's like seeing Tim Peake flying janky cargo planes for Aeroflot after deciding to piss off the space agency.",
            "Quite. Once upon a time people selected a party based on their own beliefs. Now it seems a sizeable chunk adopt their beliefs wholesale from what their chosen political leader says.",
            "give quiche a chance",
            "Something like 80% of my opinions are in some way derived from Sorkin's shows.",
            "It kinda baffles me that there is a Minister for Veterans Affairs in general. It really sounds like a made up role\n\nIsn't the Defence Secretary the cabinet position that should be responsible for veterans?",
            "It wouldn't surprise me if it comes out that he's boosted up his credentials. Especially if it's something like he was in the army during the Iraq war but he was stationed in the UK running logistics or something",
            "yeah, I get vibes of jealousy at the very least (also never served but have lots of family who did)",
            "Who only retired when he didn’t get C !",
            ">He's in deep shit and knows he needs something spectacular to turn things around, so he's going full-tilt unhinged in the hope that it cuts through.\n\nIt's a stupid gamble though. If it doesn't turn it around (and it doesn't look like it's working) then it's really trashing his reputation at a time where he's about to be relying on that reputation to get a new job.",
            "Just a total meltdown over the last 24-48 hours because he's accused his opponent (a man with a certificate signed by special forces brass) of making up his military record and obviously he can't give specifics due to the nature of the service - wild",
            "I'm already in, you don't need to sell it to me.",
            "Which will appeal to about 2/3rds of the country judging by the polling",
            "Also, Rory knows seven ways to kill a man with a dish of hummus.",
            "\"At risk\" is very generous. EC has him at a 10% chance of holding it!",
            "As my learn-Ed friend Bibemus takes pains to note in ways I cannot be currently bothered to (on mobile, in shop queue) the tories have moved so far from the center they're hoovering the dust that accumulates in the corners of the room. \n\n\nTheyve divorced themselves from the lib dem spectrum (most notably since lib dems have been staunchly pro Europe and you can't make that and Brexit meet in the middle).\n\nUndecideds are possibly the more interesting part where they're looking around for a new home and trying to figure out which is their main differentiation point.\n\nNimby as fuck? Greens.\n\nPro Europe? Lib dems.\n\nAnti immigration? Reform.\n\nPro NHS? Labour.\n\nIts a whole new world.",
            "I'd be careful what you insinuate about Mrs Mercer.",
            "It seems mad, the press could have done a nudge nudge, wink wink \"We'll hold the attack ads, you forget about Leveson\" agreement a month ago when it was obvious which way the wind was blowing. Now they have nothing to barter with, and they already blew their wads trying to find anything to pin on Starmer. At this point I'd reconvene it out of spite, never mind the fact that it absolutely needs to be done.",
            "Walters Mitty?",
            "> get door knockers\n\nAlright, this is a new one to me.",
            "Oh, like \"you were never that hot anyway\" energy?",
            "I think Farage's reasons for being pro-Russian might be somewhat closer to Galloway's than Corbyn's.",
            "> if this is to become a recurring series\n\nWell I certainly hope that this isn't the last election, but you never know, maybe with the Labour supermajority Keir will declare himself as Lord Protector.",
            "At the very least, on 4th July, you need to do “1866 days until the general election” to fuck with people who aren’t fully awake yet.",
            "Just confirming that yes you can hand in a postal vote at a polling station if you want",
            "Parliamentary business also takes less time so everyone can quickly leave Kettering",
            "Trouble is, if Rishi doesn't publicly defenestrate himself, it won't be enough, it won't have cut-through. Has to be open, and fast, and really dramatic. \n\nIt still won't be enough, I think they've moved past the point of no return with FPTP, but it might save a handful of MPs.",
            "Pleanty, in their head I suppose they support Ukraine but it's the EUs fault. ",
            "oh no this is the *second* time he said he'd go and touch grass today, that is the tweet from 5 minutes ago",
            "And was evicted from his own family firm. \n\nIt got to the point where I don’t feel comfortable mocking him. No one deserves to have their breakdown in public like that.",
            "I met someone once who told me Jacob Rees Mogg was the last honest MP.\n\nI ruined his day by telling him the Moggster is the same age as Kylie Minogue. Somehow locating JRM in the real world negates all his power. Like Freddy Krueger.",
            "It's ex-SNP, ex-Alba [David Henry](https://theedinburghreporter.co.uk/2024/06/general-election-2024-david-henry-independent-candidate-edinburgh-west/). He seems to have decided \"biological sex\" is the biggest issue facing the country...",
            "It sounds like an independent candidate rather than a small political party:\n\n*If you choose to prevaricate and patronise rather than address her concerns, if you continue to insist that the most vulnerable must embrace your luxury beliefs, no matter the cost to themselves, I don’t trust your judgment and I have a poor opinion of your character.*\n\n*An independent candidate is standing in my constituency who’s campaigning to clarify the Equality Act.*\n\n*Perhaps that’s where my X will have to go on July 4.*",
            "I don't know what you're talking about, I always loved falling off a paddleboard",
            "exactly. it's like promoting the minister for roads to cabinet and having them sit alongside the transport secretary\n\ni can see why you might have a minister for veterans affairs but it would be subordinate to the def sec. i can only assume the tories were trying to copy the military fetishist US in having it as a cabinet level role (but at least they head an entire government department)",
            "Honestly the way he’s reacting to this is so bizzare it is now raising questions",
            "Just caught up\n\nThe last hour is glorious self destruction",
            "Rory knows to defend other spies like himself",
            "Exactly, like trades union.",
            "Door knocking, I think I meant.\n\nThe terrifying thing is I'm typing on a keyboard, there's no autocorrect.",
            "Ffs",
            "Exactly.",
            "_You_ are the autocorrect.",
            "Shame, I was hoping it was a Plymouth expression I could borrow. I might just start using it regardless",
            "Be the autocorrect you want to see in the world.",
            "It is very strange but I have started to make whole word typos. Like, I'll type out the right word, just in the wrong tense / conjunction.  The internet has broken my brain."
        ]
    },
    "Reform UK's tax plans disproportionately benefit high earners, analysis shows": {
        "title": "Reform UK's tax plans disproportionately benefit high earners, analysis shows",
        "score": 395,
        "url": "https://news.sky.com/story/reform-uks-tax-plans-disproportionately-benefit-high-earners-analysis-shows-13156776",
        "content": "",
        "num_comments": 252,
        "comments": [
            "Snapshot of _Reform UK's tax plans disproportionately benefit high earners, analysis shows_ :\n\nAn archived version can be found [here](https://archive.is/?run=1&url=https://news.sky.com/story/reform-uks-tax-plans-disproportionately-benefit-high-earners-analysis-shows-13156776)  or [here.](https://archive.ph/?run=1&url=https://news.sky.com/story/reform-uks-tax-plans-disproportionately-benefit-high-earners-analysis-shows-13156776)         \n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/ukpolitics) if you have any questions or concerns.*",
            "It's irrelevant talking about who would benefit more or less when the real talking point should be that Reform's proposals are not in any way grounded in reality and would be completely un-deliverable anyway.",
            "Of course. The whole point of the Reform UK project, just like the Tories, is to rebuild Britain to become a tax haven for the wealthy and a sweatshop/forced labour colony for the rest of us. This is what Brexit was all about. \n\nYou don't need workers rights or proper wages, you don't need free healthcare, affordable housing or a benefits system, you don't need human rights... all this is 'woke' nonsense. \n\nIf you think Farage is 'telling it like it is' and all this stuff they're taking from you is going to be replaced, I suggest you go have a lie down and stay well away from plastic carrier bags and sharp objects.",
            "\"People who pay more tax benefit from tax cut shocker\". \n\nI'm not shill for Reform by any stretch, but these headlines (which can apply to any income tax cut by any party) very much fall into \"bear shits in woods\" category. \n\nThat said, the 40% threshold is too low. What was originally sold as a tax that only affects the highest earners is now starting to catch a lot of fairly ordinary people on fairly ordinary career trajectories.",
            "Well, all the fiscal drag and tax polices for the past 20 years benefited the low earners. 10% of population pays 60% of income tax. And let's not forget that we have one of the highest marginal tax rates in the world. \nA high earner in UK pays scandinavian level of tax without the benefits that comes with it ( like no free tuition, no free childcare, even worse, you no longer allowed to use childcare funded through your own tax money , and so on ). Being a high earner in UK is a bad return on investment compared to most of the countries IMHO.\n\nAnd before you throw shit at me. The high earners are not the problem. They're the solution. Higher earner ≠ rich. Those are still people that work for a living. Doctors, engineers, IT professionals and so on. Currently what is happening is that we got a 8 milion NHS backlog and doctors are reducing hours not to hit 70% marginal tax rates. IT professionals and remote workers moving abroad for a better standard of living and lower taxes. That's what crab mentality gets you, a worse off society without growth.",
            "Of course they are, but isn’t this right out of the modern right wing populist playbook?\n- You target the relentlessly shat on post-industrial urban poor. You say that you’re the only one who gets them and can bring back the good old days.\n- You make promises that sound good on paper but are either entirely undeliverable or would do more harm than good\n- you get in and being in massive tax cuts that overwhelmingly benefit yourself and the rich/powerful you’ve been cozying up to\n- you dismantle and/or sell off large operations of government to those same people on the cheap to pay for it\n- you get the hell outta dodge before everyone realises you’re just a snake oil salesman and they’ve been conned.",
            "That's exactly what Trump did - massive tax cuts that disproportionately benefitted the higher earners while making sure that it threw a crumbs in the direction of the lower paid. \n\nBut it's those lower paid people who'll provide the bulk of the votes that Farage/Trump needed to get elected, like Trump he'll chuck in some other populist stuff about immigrants stealing your jobs. \n\nThis is basically a political Stockholm syndrome at work.",
            "Next you're going to tell me their other policies disproportionately benefit Putin!",
            "It’s convenient how people attack the Tories for freezing income tax thresholds. And then when a party actually proposes reversing the threshold freezes, they get attacked for “tax cuts for the rich”.",
            "What a surprise. Dig into Far Right Rage’s history and you’ll see his backing from likes of sex predator hedge funder Crispin Odey and Aaron Banks. About as much a man of the people as Rees Mogg. But like Hitler 1932 appears teflon despite the obvious evil nature of it.",
            "They are also planning to raise the personal allowance to some £20'000, which disproportionally benefits low earners.",
            "bringing higher earner up to 70k would be really nice for me to be honest. It's due for a increase in line with salary growth and inflation. Bringing up the lower band as well would be great for everyone. Obviously we need to get money from somewhere for the budget so I understand if we don't increase it, but whoever is in power should at least work to lower expenses like rent and utilities then.",
            "Well yeah, that's the grift.\n\nAny normal working person who thinks Farage has their interests at heart is being fooled.\n\nProblem is, Farage is good at fooling people.",
            "It’s just tax cuts for the wealthy and a gutting of public services as a result. We would all be worse off while more wealth is shovelled upwards. This misleading grift needs calling out for what it is. \n\nAnd all this before you get to the salient facts that reforms sums don’t even add up.",
            "I love how everyone is trying to be like some surgeon, tearing apart Reforms manifesto. It does not matter, it is nothing about that.  \n\nReform are there for three reasons really. \n\n1. Immigration.\n2. Protest vote.\n3. Give the tories a good kicking.",
            "Reform's tax cuts is like Truss on steroids, it will wreck the bond market and wipe out a bunch of pensions, which was what Truss almost did. Their manifesto shouldn't be considered seriously.",
            "Why is this a bad thing?\n\nIf you're asking if someone can afford to pay more, then you should also why someone can't afford to pay more. Choices matter.\n\nIf the top 15% of the country already funds everything, why aren't the bottom 85% paying more?",
            "People voting for reform aren’t looking at the details of their manifesto, they are voting for one particular reason and that’s all. They will blindly vote thinking they’ll will solve all their problems. Mr Farages company (that’s right it’s a an incorporated company with him being the largest shareholder so he doesn’t have to deal with being voted out of his own party) wants to attract the donors who will want to buy influence and best way is tax cuts for the rich.",
            "Yes that's what 'right wing' means.",
            "How can people be so stupid to want to try this again, we saw what happened when Liz truss tried it",
            "Of course they do. RefUK Limited is the party of the Oligarch. It is set up as a company. It was set up by external parties in this way to retain control from thr fascists and racists they expected to attract as “members”. \n\nAs with all populist movements, it is a facade.",
            "When you need Super Liz to swoop in and truly fuck things up.",
            "The ultra tories are favouring high earners?\n\nIt can't be",
            "Even if he increases the tax free allowance to £20k, its just gona come with massive cuts to services.\n\n\nHe certainly ain't gona raise rich peoples taxes to pay for it!",
            "Funny how Reform supporters get called bots, but post a random article about the minutiae of Reform's manifesto or some candidate's Twitter history and immediately the *\"resistance\"* arrives to upvote it and save the world.\n\nNone of this matters.",
            "Of course they do. The people who actually pay most of the tax will be most affected by cuts to tax.",
            "Good. It's about time. Lower earners need to pay their fair share - it just isn't viable to run a country where only a small minority of people are lifetime net contributors.",
            "Many in the media really seem to be scared of Farage. Very much reminds me of Trump in 2016, though I’m not suggesting that Reform will win this year. They’re going hard on the tax plans and the Ukraine comments. \n\nI watched his interview with the BBC and I’ve looked at Reforms tax plans rarher than the headlines. I personally think their tax plans would be too radical over one term in government but the media seem to be deliberately portraying them as a giveaway to the rich when obviously any changes in the bands/PA are going to impact everyone from the top to the bottom of the ladder. It’s very disingenuous to focus on the raw figures and not as a percentage of income.\n\nAs for Ukraine, it’s clear he doesn’t think we should be continuing to support them indefinitely but that’s another argument. I don’t think there is anything controversial in saying that NATO spooked and gave Putin ammunition to invade. Everyone can still see it was wrong and that Ukraine has a right to self determination.",
            "no it doesn't it corrects some wrong doings. Saying that fixing IR35 for example benefits high earners is nuts. Right now people are forced into an employment style contract of which they are then paying their Employers NI contributions. Its effectively tmp work, at perm rates without stability.\n\nIR35 is a tax break given to large orgs by Labour and the Tories. Reform are the only party willing to revert this.",
            "Article is missing out that it does NOT benefit those on £100k - £140k, currently £100k - £124k £(personal allowance * 2) is taxed at 60%, this would increase to £142k so the premise that it disproportionately benefits high earners is incorrect.",
            "Not a fan of that muppet but always a bit surprised at the outrage at these charts.\n\nLike yeah ofc it's easier to move the needle for someone deep in the 40% or god forbid 60% bracket than someone that barely clears the tax free threshold and isn't contributing much tax in the first place.",
            "Yet to see a positive article about reform in any capacity and somehow they are about the only party consistently increasing their vote share. Now showing as the second most popular party in a majority polls coming out and that’s despite being placed under other in several polls and their representatives not being invited to most of the debates.\n\nEither the media is getting something very wrong when it comes to capturing the tone of the movement, that or Farage has tapped into something they find uncomfortable and struggle to articulate. Either way Nigel has shown he can thrive in a hostile environment and unless something on the ground changes his support will keep creeping forward",
            "It's almost like they are just extremist Tories...",
            "Because high earners pay more tax. Duh. It’s not hard.",
            "Why? I mean, if this was a real effort to win votes, pander to the more numerous lower earners and give the wealthy donors a wink - if we ever get near power we’ll look after you, this is just for the plebs. ",
            "Good, that's exactly who we want to incentivise.",
            "I mean in terms of money they get of course because they already make more but in terms of % of income, I doubt it.",
            "Tories being Tories. \n\nReform are nothing but has-been old Tories. Haven't you seen what Tories have done to this country? \n\nNow every MP knows that you can steal public funds for your nearest and dearest and never be held accountable let alone suffer the consequences.",
            "Man of the people.\n\nJust of Donald Trump's people",
            "In other news, the sky is blue. More at 6",
            "Not as a percentage of income. In raw numbers, yes, but anyone who says that some £125/mo for the lowest earners in our society wouldn't be a huge deal for their quality of life is completely blind to the realities of living on such a low income.\n\nFor a person earning £50k+ (let alone more), £125 represents an indulgence or an investment.\n\nFor a person treading water, it's something a little nicer to eat than the absolute basics. It's the breathing room needed to pay down some debt. It's the padding required for the next breakdown of an appliance to not represent a dire financial emergency.\n\nThis article is a moronic gotcha from people who just don't get it. And if there's one thing Labour voters should back where Reform is concerned, it's fucking this.\n\nNobody else is offering an uplift for the poorest in our society this dramatic, yet not a fucking peep about that can be seen anywhere. Just another grand opportunity for yet another gotcha which won't stick.",
            "No one cares. We can't vote for Conservatives and we can't vote for Labour.",
            "If I'm on £700 net and this move gives me an extra £200, then I'd consider it great. Even if a richer person gets more in cash terms.",
            "The party is making many of the same mistakes that UKIP made.",
            "Or more importantly, it means absolutely nothing as they aren’t winning. They aren’t even going to win enough seats to be opposition. They may as well promise a free bulldog to every family.",
            "The real talking point is the one we are never allowed to say because it might offend someone.  Reform is Nigel Farage.  And Nigel Farage is a vicious racist who has systematically attacked anything good or positive in our country.  Just saying it like it is.  \n\nThey could have the most sensible policies in the world and it would still be wrong to vote for them.  Britain should be about more than just technocratic tax policy.  We need leaders who are honourable, brave, intelligent.  Farage is none of these things.",
            "to paraphrase an answer they gave in an interview they know they're not going to be in a position to deliver any of it, these are all campaign points and arguments they're going to be making and forcing the government to have answers to, ie this tax should be lower this should be x this should be y, z is a waste of money what are you doing to get there if you're not doing anything why not, etc, why are we still spending on z etc",
            "I think knowing what their agenda is, is probably more important. They could make it deliverable somehow but a leopard isn't changing their spots",
            "Well Labour and conservatives don’t listen to the people and look at the state of the country. What’s the worst that can happen? We need change and reform is the only suggestion for it.",
            "It sucks because I like some of their tax ideas and UKIP manifesto was better",
            "We deregulated the house market & mortgages  and rents soared. \n\nWe reduced the power of unions and wages stagnated.\n\nWe de regulated utilities and bills increased.\n\nHow the fuck is the answer more deregulation",
            "He's such a good speaker he had me convinced about the establishment and them v us for about 30 seconds before I remembered everything that's led us to here in the last 10 years is because of him.",
            "> just like the Tories\n\nThe same Tories who raised taxes to a post WW2 high want to make Britain a tax haven now?",
            "That is exactly what Reform want to do. Farage, Tice, Valance, anyone else in or funding it. They just want a tax haven for people like them. People who bluffed their way to wealth, married it or cheated their way to it.\n\nThey hope to fool people by portraying Farage as an ordinary bloke with a pint and a fag who is \"in touch\" with the working man.",
            "Absolutely no one sees the UK as 'tax haven'. It's more fleece us here then move the money to a tax haven.",
            "What nonsense",
            ">That said, the 40% threshold is too low. What was originally sold as a tax that only affects the highest earners is now starting to catch a lot of fairly ordinary people on fairly ordinary career trajectories.\n\nThis. The real problem is that people earning £50k to £100k are considered \"high earners\". That's pretty much the bare minimum that you need to comfortably feed, clothe, and house yourself these days.",
            "I would like to just point out that income tax is not the only tax. Things like VAT and fuel duty are regressive, while NI is much closer to a flat tax. VAT specifically has gone up quite a lot in recent years. So while 10% of high earners pay  60% of income tax, they probably pay less than that of the overall tax take. This point always seems to get forgotten.",
            "If you have to work for a living you're not part of the inequality problem regardless of your salary, and I think that's a point that needs to be more widely recognised because acting like crabs in a bucket is mutually harmful and plays into the hands of demagogues like Farage. The problem is genuinely entrenched wealth having a far too outsized say in how the country is run both officially and unofficially, even if someone's on £150k they're decimal dust compared to the chinless wonders who we can sensibly level the 'entrenched wealth' accusation at.",
            "> 10% of population pays 60% of income tax\n\nThat 10% of the population is the [only part that has seen the wage growth enjoyed in the 80's/90's](https://www.gov.uk/government/publications/real-annualised-hourly-pay-growth-by-pay-percentile/real-hourly-pay-growth-by-pay-percentile-uk-1975-1999-and-1999-2023) and the 1% of [those own 70% of all assets](https://www.oxfam.org.uk/media/press-releases/richest-1-grab-nearly-twice-as-much-new-wealth-as-rest-of-the-world-put-together/).\n\nI mean perhaps we can give them 100% of all growth and assets and then complain that they pay 100% of all tax?\n\n> That's what crab mentality gets you, a worse off society without growth.\n\nNo growth for some.",
            "Income tax ≠ all taxes. UK total tax burden is below the G7 average and far below the most developed EU countries, of course you don't get free childcare free tuition and so on",
            "The issue is the deliberate and blatant dishonesty of Farage and Reform in claiming the opposite of the truth. No more to be trusted than Johnson.",
            "Oh leave off. Tax income freezes mean that lower income individuals pay more tax. It's fair to feel this unfair. \n\nFeeling that tax plans that benefit the rich is also unfair isn't a contradiction. It's a continuation.\n\nYou mustn't be that daft, so this feels a bit willful.",
            "The Tories have substantially raised thresholds",
            "It’d be a pretty shitty analyst if they hadn’t taken that into account already before drawing this conclusion.",
            "That's just gona come with service cuts. If everyone saves £1500 in tax, that just mean they have way less budget. ",
            "It is surely intended to make work pay.",
            "Wealthy people won’t even notice these income tax cuts.",
            "The poorest would get a big boost also though..",
            "0.9. Help their rich mates",
            "Reason 1. : Reform Party Canada 1993.",
            "No small party’s manifesto should be taken seriously tbf. None of them are going to be enabling big economic policies",
            "Sometimes it’s best not to write about things you don’t undertstand.",
            "Because without 85% of population United Kingdom will have to change its  name to Erased Kingdom.  \n\nWhat SkyTV package did you grow up deprived of ?",
            "No one thinks they can win so don't care?",
            "The tax pledges in a party's manifesto are minutiae and don't matter?\n\nThat's certainly a take.",
            "It's the same thing over and over again then a shock when certain results happen, there's been clear changes happening all over the western world in politics especially Europe in a big way ... the UK has been the slowest so far but it's starting to show",
            "After annexing the Crimea without any opposition Putin was always going to continue to push the boundary. It’s nativity on NATO’s  part rather then Farage’s farsightedness we should be discussing",
            "They are not scared of him. He's an establishment man through and through.\n\nThey are profiting from him by publishing stories",
            "Reform's plans would essentially detonate a bomb under government services according to the IFS. Turbo-austerity would be required to come within a lightyear of balancing the books, mostly for departments that are essentially on their last legs anyway. Promising the poor tiny tax cuts in one hand and destroying the services they are totally reliant on with the other is not a good idea.\n\nTheir manifesto is a complete budgetary fantasy. Just populist fodder cobbled together so Are Nige has a drum to bang.",
            "You didn’t look at the graphs did you?",
            ">Reform's plan to raise the higher rate threshold from £50,271 to £70,000 would amount to a tax cut worth almost £6,000 for the top 10% of earners, vastly overshadowing the benefit to the lowest earners.",
            "I feel that is not a good position to take. They need to be taken seriously and called out on their bs",
            "Yeah I know, it just pisses me off that they're given a free pass on this. I'm sat watching Sky News and they keep focusing on how Reform's proposals will benefit the rich more than they benefit the poor, ignoring the fact that they're complete garbage and won't benefit anyone.",
            "Free bulldog you say? 🤔",
            "\"Everyone gets a pony! And a blowjob!\"",
            "That would be a lot cheaper too",
            "I’d rather get a cockatoo. Can I?",
            "> it means absolutely nothing as they aren’t winning\n\nI remember reading Americans saying there is no way Trump would ever win!\n\nAn our press is all over reform, waiting for them to do or say something so they can put out another click bait article",
            "Farage says he favours a meritocracy. People should look up what a meritocracy is, and then decide if Farage would be part of one.",
            "'who has systematically attacked anything good or positive in our country'\n\nCould you elaborate on these things that he has systematically attacked?",
            "So effectively it's just a gobshite's shopping list.",
            "Liz Truss tried to make some \"bold changes\" and nearly bankrupted the country in a matter of days. You are poorer now, because someone who didn't know what they were doing \"made changes\". Farage is promising to increase our manufacturing base and reduce immigration to zero. Where will these workers come from? Companies will have to pay more to encourage workers to work for them (sounds great!) so how will these products be competitive internationally?AND nobody pays tax under £20k! So now you're earning more, British products are too expensive to move on the international market and the value of the pound decreases. Congratulations you now have inflation and you're paying more tax, the manufacturing companies don't survive and there is massive unemployment, but now there are no benefits to rely on because Farage is scrapping them to pay for the tax cut he gave millionaires at the start. Oh, and you can't go to the Dr anymore because you've not paid for your insurance as you're unemployed.\n\nThat's what can go wrong, in a nutshell.",
            "Reform candidates openly call for concentration camps. \n\nNever again.",
            "Really?\n\nTheir tax policy is basically Liz Trusses policy on coke",
            "The answer to all our problems is obviously more deregulation.\n\nBecause of blah blah ... Thatcher ... blah blah ... *insert think tank here... blah blah ... growth  ...blah blah ...  communism bad.",
            "Stop complaining, I'm pretty sure one more tax cut for the rich will solve everything /s",
            "But it's not a true _free_ deregulation, we've got to _deregulate_ deregulation and soar merrily into the Sun.",
            "I'm pretty sure it's not the exact same Tories that were in charge post WWII.",
            "sorry - do you want the labour party to REDUCE taxes?",
            "For the rich.",
            "In what world is that true? Some very rough generous numbers here:  \n£15k rent, £3.5k Council Tax, £6k food, £1200 phone bill & internet, £2.4k utilities\n\nThese figures works out to just over £28k and that's assuming an 1 bed in London, very high council tax, spending a crazy £500 a month on food and having some mobile contract & internet you pay £100 a month for...\n\nThe cost of living is nowhere near as bad as people make it out to be imo and some of these figures would be notably lower in many parts of Britain.",
            "VAT and fuel duty are not regressive since those are flat rates, so they're neither regressive nor progressive. A regressive tax will be council tax for example since it's a flat amount rather than a percentage. But other than that I do agree on the point",
            "This is absolutely the conversation that needs to be had if anything useful is going to get done in terms of making life better for the majority of people in this country.",
            "Wealth ≠ income, and we should tax wealth more. A top 0.1% PAYE in UK barely afords you an average house in London.",
            "The thresholds have literally been frozen for 4 years",
            "Mate our public services have already been gutted and yet the Tories keep raising our taxes.",
            "Like Brexit?",
            "\"How dare you judge us on our policies!\"",
            "Liz Truss's budget wiped £425 billion from pension funds, perhaps you should learn about the economy before you write about things you don't understand.",
            "Please stop holding our political parties to account, it's not a good look",
            "I agree that post Crimea a further escalation seemed likely in hindsight. Interesting, Farage was saying the same in 2014. However, he has also been talking about this since the 90s long before Crimea and that’s the point he’s making.",
            "What profit are the BBC making from him?",
            ">according to the IFS",
            "The graphs are not correct (hence the lack of methodology)\n\nThey also don't represent accurate % increase, and don't give it in the context of disposable income",
            "Sounds like a good policy to me. The tax thresholds have been frozen for 4 years and we’ve had massive inflation. Adjusted for inflation, the higher rate should currently be £64,000, and the lower rate should currently be £17,000.\n\nWe have record high tax levels and we have nothing to show for it.",
            "So?\n\nBoth the Tories and Labour were planning to do it and didn’t.",
            "Take home for 20k goes from 17.9k to 19.4k - an increase of 11%\n\nTake home for 70% goes from 51.2k to 56.7k - increase of 11%\n\nHardly overshadowing\n\nEdit: of course if you look the extra as a % of disposable income, which is after flat costs (rent/mortgage, food and utilities) it's going to be a much greater % for those on 20k.\n\nA person on 20k who has £100 to spare each month will be > 100% better off with these changes.\nSomebody with £1 left over will be 12500% better off\n\nWe can all choose numbers to suit our worldview",
            "They’ve been quite clear they’re not going to have to implement their policies.",
            "True, don't want them influencing the Tories down the road",
            "Agree. Lets not forget this man was the driving force behind brexit. Hes never held a position of significant power but his influence is far reaching. Allowing his nonsense to go completely unchallenged is dangerous.",
            "Why? They aren’t winning. We aren’t in hung parliament leading to coalition territory. \n\nIt’s going to be a clear Labour win\n\nReform are predicted to gain at most 3 seats. \n\n\nThey aren’t going to win, they aren’t going to end up like 2017 with the DUP (who are also on the decline), they aren’t going to be the opposition. \n\nPeople are voting for them as a protest vote to upset the Tories. \n\nYou may as well spend your time hyperventilating over the Heritage, English Democrat, and UKIP manifestos.",
            "Because they are completely detached from reality and trying to persuade people they don’t understand \n\nIt’s the exact mistake they did with Trump and Brexit \n\n\nJourno: “He said/proposed [thing that’s upsetting to upper middle class urban progressive people]!”\n\nNon upper middle class urban progressive people: “don’t care he makes you upset and that’s better than what we’ve had for the last x decades”",
            "Where is the free pass?",
            "Ed Balls went into Farage over this on ITV",
            "It will be an English bulldog with the associated high vet bills due to genetic predisposition and reduced life.",
            "In a two party system where he was up against Hilary Clinton there was always a chance he would win. \n\nIf he was running as Tory leader there’d be a chance, but he’s not.",
            "they’re a protest vote",
            "I'd prefer Gove's policy on coke",
            "I think making it start at 20k is a good idea",
            "I'm amazed that people still go on about Thatcher when she is considered to be one of the worst PMs ever. Liz Truss obviously took the crown, but still. Why celebrate someone who messed so much stuff up. All her solutions where \"sell government assets to pay today's bills, and let the people have higher bills tomorrow\".",
            "On 50K, with a plan 2 and a postgrad (not all that uncommon requirement for a job which pays 50K) and a 3% pension you take home around 35K, leaving you 7K for everything else for the year. That's around 600 pounds per month for travel, future savings, and any kind of hobbies or pleasures you might want to do other than work and sleep. \n\nSure, you can move out of London (expect to pay extortionate travel costs unless you're lucky enough to WFH), you can even cut down in many places, and 600 pounds isn't exactly chump change, but that is hardly an extravogant champagne and cavier lifestyle? \n\nAny lower in a higher cost of living area (in the south), especially without a partner, and it would begin to veer into the uncomfortable. Fiscal drag has been applied to higher rate income tax for longer than the other thresholds, but these salaries are much more likely to be found in higher cost of living areas.",
            "They are regressive. Flat rates always are, since although they're an equal payment from everyone, in relative terms, more of a low-earners income goes to paying the flat rate.",
            "> Wealth ≠ income\n\nIt is when your wealth provides you with passive income. It's 100 people playing Monopoly and 1 person owning 70% of the entire board...then complaining that they have to pay 0.00001% of their income landing on the super-tax box and calling the other 99 people who only get 3 out of every 10 properties greedy with a \"crab bucket mentality\".\n\n> and we should tax wealth more\n\nThe devil, as always, is in the details here. It's inadvisable  discouraging investment and innovation. But if you let foreign companies and wealth funds mass buy up your infrastructure...",
            "The threshold for the 45% tax rate has been lowered from £150k to £125k. They haven’t been frozen.",
            "Yes .They ŵere raised substantially after Gordon Brown",
            "Just wait for them to cut local budget another 50% and then council tax will skyrocket to balance it out. You won't be able to drive anywhere due to the potholes. ",
            "David Cameron was Conservative.  He won Brexit.",
            "Was this just from the market crashing? If so how much would this have recovered since then? \n\nOr is the 425 bil wiped from existence?",
            "That was a Bank of England coup to install Sunak tbf",
            "Farage said the same in 2014 , 3 months after Russia invasion of Crimeea.  You can Google that. \nNato expansion started in 2004 ,not the 90s. \n\nPS. It's disappointing when an uninformed Redditor defends Putin blaming NATO expansion in Eastern Europe.  Those people know the Russians , their pogroms,  genocides and wars in the last 300 years. Transnistria problems started in 1992.",
            "Clicks, viewers, and attention.",
            "Oh, do you know better than trained economists working for the only institution dedicated to studying British fiscal policy?",
            ">Sounds like a good policy to me.\n\nAn unfunded fantasy tax cut when public services are on their knees, which does nothing to tackle underlying issues of an aging population, the damage of Brexit and low productivity, sounds catastrophic to me.  Have you ever heard of Liz Truss?\n\nIf it sounds good to you, you need a hearing test.",
            "Quite clear isn't clear enough for British voters.",
            "The sort of populism Farage promotes is like a cancer so you need to deal with it as soon as possible.  Demagogue politicians depend on people not taking them seriously until there is a moment of weakness in the major parties and then suddenly their agenda gets taken seriously because \"why not try something else?\"  Arguably this was the mistake that was made with Brexit.",
            "Its about standards. No politician should be able to stand up and outright lie - theyre continuously getting away with it.",
            "It doesn't matter if they're going to win or not, misinformation in the political sphere is never a good thing.",
            "It needs to be called out because part of the problem is the unrealistic British psyche towards tax, the endless cakeism of getting wooed by the prospect of lower taxes but somehow thinking we can square the circle of an ageing population and crumbling public services without additional taxation revenue and also apparently without all the necessary working age immigration. The willful blindness of the population on this conundrum means that we get mainstream political parties who don't want to level straight with us about the trade-offs, and allowing Reform to inflame the narrative that we can have a tax-cutting bonanza without negative consequences will make the job of building trust between the mainstream parties and the general public even more difficult in future, thus further eroding trust in politics.",
            "They aren't winning *this time*. I think we need to call out their BS on the regular to make sure they never do.",
            "They are on track for significant vote share. Reform voters will be majorly disenfranchised at this election. \n\nUKIP was in a very similar situation in 2015. They still pushed the country to a position we left the EU. \n\nWe need to engage with their ideas as a policy platform and build a narrative to explain to Reform voters why there is a better alternative",
            "And Brexit will never happen",
            "Well I can only hope you are correct.",
            "I think also there's that thing about Trump, isn't there, that his opponents took him literally but not seriously while his supporters took him seriously but not literally.\n\nYou're not going to convince a Reform supporter by quibbling over the precise financial consequences. Just as in the days of Brexit an argument over the precise number on the bus was never going to sway anyone.",
            "Skirting past the weird class projection here (i have thoughts on what a breakdown of Reform UK voters' economic circumstances would show - expecting to see a bigger proportion of outright homeowning retirees, career landlords and moderately sized business owners there than the horny-handed sons of toil people tend to assume), I agree that there's a mistake on focusing on this stuff too much. It's not helped by a presently poor quality of interviewing/interrogation across the board. Everyone's keen for clicks and soundbites and doesn't quite understand the Farages of the world gain more from it than they do.\n\n\nThat said, not everything has to be Tactics and it's important to at least get this stuff on record. The proposals don't stack up. The core reform supporters won't give a shit either way but no-one should be allowed to claim ignorance.",
            "I think because they are more likely to be invited onto a panel over Lib Dem’s or Green Party, the news loves sensationalism.",
            "It's there in my comment.",
            "Farage : \"EU started the war in Ukraine\"\n\"I've said it in 2014\" \n\nPS Russia started the war 3 month earlier.  \n\nMe : \" Argentina will win the World Cup in 2023\" . Now, please place your bets.",
            "Can I get mine with breathing difficulties and a face that looks like it's been flattened with a spade?",
            "\"My policy on coke is that I like to have my coke and snort it\"?",
            "Great.\n\nSo now there is a huge black hole in public finances. Where do you raise taxes? What services do you cut?\n\nWhat is the net impact of everything? Giving people a £1.5k tax cut but then forcing them to spend £3k on health insurance isn't going to help anyone.",
            "That is a great idea but how do you get that money back, Farage is planning to do it by scrapping the NHS but he's using slippery language like \"insurance\" and \"appointment fee\". Also the overall tax scheme benefits someone on £100k more than someone on £20k, so that's not a great idea either.",
            "People still go on about Thatcher because she was frank about what she stood for, what her objectives were and how she was to go about achieving them (qualities I feel Corbyn shares).\n\nFor many people she made education easier to access through Student Loans for accomodation, she made the poorest home-owners by selling them their state housing at high discounts needing only small deposits, she helped us through and out of the energy/oil crisises curbing inflation by crushing the unions that keps insisting on raising wages (causing more inflation) and which had policies of overstaffing reducing our productivity, she made reforms so that unions could no longer coerce their members into joining and so that no strike would be held without a proper vote & process when before the country was often brought to its knees in strikes that the union members weren't even fully behind.\n\nAnd at what cost? The decimation of some communities of their traditional jobs, the humiliation of signing up for the doll, the landscape of a proud industrious nation being pulled back into the reality, the reality that we had lost the advantage of being the first to industrialise and other nations of greater populations and resources were able to do many things better than us, an inevitable consequence where we wonder what it means to be a 'service society'.\n\nAnd indeed had she reformed the planning system and built houses at the same rate she was selling them into the private hands of the poor, we wouldn't be facing many of the problems that we face today.\n\nWhere we do agree is that to sell some assets makes sense, others do not, and I do think privatising utilities & infrastructure that is natively not competitive was an idiotic move by her and her successors.\n\nNow where do reform stand? To bring back industrialisation where it's feasible to do so. To reform the planning system. To reduce immigration until we're back on our feet. To bring back utilities into 50% public ownership.\n\nI'd rather them or Corbyn to lead our country than the Store-Brand Tories & Labour that claim to represent the values of their parties and the fence-sitting Liberals.\n\nSo yes. People do have a great deal of good to say about Thatcher because she had guts and she defeated communism and that same devotion to her duty turned out to be a double-edged sword only because so many subsequent Prime Ministers did nothing to respond to the rising challenges for decades. She would not have coasted like every single one of her successors did, until Blair came to power and did many things that unfortunately exaccerbated previous problems.",
            "Errrr...\n\n\nWhat you mean is after basics of living flat taxes are regressive ",
            "The income tax rates that are frozen are for PAYE. If you derive income from wealth you're either paying capital gain tax or dividend tax.",
            "So you are denying that the government has raised our taxes? It’s just objective reality. This is a stupid conversation.",
            "Do you live outside the UK? We already have completely broken roads",
            "Cameron campaigned against Brexit, and promptly resigned after losing the referendum. He didn't win Brexit in any way.",
            "What do you mean by “won Brexit”? He put forward the referendum to deal with infighting / UKIP - campaigned against to remain in the EU, lost and had to resign 1 year after being reelected Prime Minister.",
            "Nothing you have said is in disagreement with anything I said but you've framed your comment as though it does. Everything I said including about the comments Farage made in 2014 as an MEP make perfect sense in the context of the discussion I was having above.\n\nAlso, the Vilinus group may have not joined NATO until 2004 but as you can imagine there was a lot of discussion about that happening before, it didn't just happen overnight. Not to mention the Visegrad group joined in 1999. I also haven't depended Putin.\n\nPerhaps you should drop the smarmy, arrogant, know it all attitude when reading comprehension isn't exactly a strength of yours.",
            "Surely it’s the BBCs job, even more so during an election, to remain impartial and give everyone the coverage and attention they deserve. Making Farage rage bait headlines to push clicks when they don’t even have advertising seems wrong to me.",
            "Economists are not infallible nor immune to criticism. IFS has consistently been incorrect in their forecasting, and have been repeatedly criticized over the years by politicians on all sides. Their funding is obscure (except for the European commission and IMF who hardly have UK interests at heart). They have entrenched the conventional economic school of thought that is upheld by globalist \"elite\" (without sounding too conspiratorial) and they have consistently supported tax cuts for the wealthiest over the poorest. \n\nNot to mention that many will have a bone to pick with Reform for wanting to end the BOE gravy train.\n\nSo yes, sorry if not everybody trusts the IFS, and want a more progressive approach to taxation.",
            "What misinformation are you talking about?\n\nWe’re talking about their economic policies.",
            "> square the circle \n\nThen why do we have the third highest marginal tax rate in the world ?",
            "Next time they will have a different manifesto and we will have a competent government in power.",
            "> They still pushed the country to a position we left the EU.\n\nNo, Tory MPs did. It was down to the ERG that it was pushed, and Cameron having a very small majority. There are no Labour MPs with Reform leaning and Labour will have a large enough majority that they don’t need to negotiate with the extreme back benchers",
            "Engagement doesn't mean implementing what they want. It can and should be \"We aren't doing that; and this is why\"",
            "If every single Tory voter changed to reform, they’d still not be close to winning. \n\nAnd if you’re worried about coalition, just look at 2010-2015. The LibDems got fuck all out of it and the closest thing to something on their manifesto being realised was the AV referendum which was t even the system they wanted. \n\nOr for unofficial coalition through confidence and supply agreement the DUP got nothing except delaying Brexit which was the opposite of what they wanted.",
            "That bus number was genius from DomCum you have to give him that. \n\n“We give £350m a week to the EU”\n\n\n\\*voice with adenoids*: “akchewally with the rebates we get we only give £250m a week”\n\nNormal people without much understanding of supranational economics: “that’s still a massive sum, that doesn’t make it any better!”\n\nIf they’d put £250m on that bus it wouldn’t have been talked about and advertised everywhere by the press.",
            "I thought that QT analysis showed the Greens got on more often? Can't remember Lib Dems but would be surprised if it was less. Going purely from memory though so am happy to be disproved",
            "I mean they have been on the same debates and reform is polling with nearly both of them put together",
            "I mean you say they get a free pass but are getting criticized daily..",
            "I don't get what your point is. Has nothing to do with this discussion",
            "Good news!",
            "One thing that comes to mind is giving people with low disposable income a tax cut boosts economic activity as they'll likely spend most of the extra money.\n\nThe rich, on the other hand, are more likely so save it.",
            "Yep if we want better service, giving people better lifes we need to tax more or claw back areas we're spending a lot but getting diminishing returns. So tax more,borrow, make sure the corporation are paying taxes. I would cut pensions and foreign aid also and cut immigration which is a drain with who we're currently letting in. I think the NHS is reaching a point where more money just won't solve the issues.",
            "> Farage is planning to do it by scrapping the NHS\n\nHe does not but continue with those fake lies him pointing out that the NHS in its current state is not working is a fact it's getting more money and failing harder every year. \n\n\"Also the overall tax scheme benefits someone on £100k more than someone on £20k, so that's not a great idea either.\" wow someone who makes more might get more.. but lets ignore the poorer who also get much more money in terms of % of income.\n\nyes people who can afford to use private should use private.",
            "> If you derive income from wealth you're either paying capital gain tax or dividend tax.\n\nYes. 20% (24% for residential property). And it's around 10-18% if your income is below ~50k.\n\nThe higher rate for a similar amount of waged income is 40%.\n\nThis is supposed to incentivise investment. In practice, well, we can see...",
            "The basic tax threshold was raised from around 6500 to around 12500 by the Tories, between 2010 and 2019, then we were hit by Covid\n\nIts a stupid conversation because you are so ignorant of facts.\n\nLook up the exact figures,  educate yourself",
            "It can always get worse! Reform will introduce 20mph speed limits due to potholes lmao",
            "Cameron single handedly won Brexit. \n\nThere are plenty of political commentators across the globe saying this.",
            "Sure matey, I'll do exactly that when you stop crediting Farage with inventing sliced bread. \n\nHence my point above.",
            "Coverage and attention they \"deserve\" is a contentious point at best.\nSurely the only attention the Reform manifesto deserves is an absolute shredding by the press on its ridiculousness?",
            "Yes, that's the misinformation.",
            "Well, I hope so, but the last whole of my life does not give me much faith in the process.",
            "That’s 2024, but regardless of how big this Labour majority ends up, 2029 will be highly unlikely to be the same. Without engaging with those voters, we will have a faction of the voting public wanting more and more extreme things to be implemented and a risk they eventually get it",
            "And I agree, that is what they should do. But the general way Reform seem to be approached is stating that their plans are totally unworkable so it’s barely worth considering the practicalities. Reminds me a little of the way Trump was constantly dismissed as a joke at every stage, then he became the president. \n\nI’m not sure the best way to engage with these things, but I think the tendency of British political debate towards short form responses really hampers most of this and makes for lots of simplistic attack lines",
            "meanwhile, the brexit ref only happened because cameron was shitting himself over ukip getting like 10% of the vote and thought he could gamble it all for a third time.\n\nif I remember correctly the DUP got a ton of money for NI out of that arrangement.",
            "If every single Tory voter changed to Reform, combined they would be within 5 points, which is almost the margin of error",
            "Exactly that!\n\nFarage was playing the same game a little last night, I thought. There was a solid few minutes there of whether migrants on work visas could or couldn't bring their mothers with them. \"Yes they can bring their mothers.\" \"No, Nigel, that's not true, they can't bring their mothers.\" \"Yes it is, they can bring their mothers - or they might as well be able to!\" \"But they can't actually bring their actual mothers. That's untrue.\" \"It's true. Sure they can. Or they might as well be able to.\"\n\nIt strikes me that while there's a correct answer, that's not what really matters to Farage and his supporters. The point is about bringing dependants at all and the high numbers involved. And every time they went around the loop again, that same point was reinforced: Workers bringing dependants. High numbers.\n\nIt's incredibly hard to counter. You either let it go, or you challenge it and reinforce the point.\n\nThe best thing would be to ignore it and make your own point, but clearly that doesn't work in an interview.",
            "As a professional Remain voter, the \"wELL aKSHUALLY\"ism of the Remain campaign was such a turn off. Working class Brexit voters don't give a shit if it's 250m or 350m, especially not when the message comes from a middle aged Waterstones Dad looking motherfucker.",
            "I'm seeing little of Farage getting held to account for his bullshit accounting by national media. ",
            "Free pass. \n\nNo one challenges the lies Farage spews since 1991.",
            "> lets ignore the poorer who also get much more money in terms of % of income.\n\nThey don't - there's a graph right there in the article that shows they don't.",
            "Farage plans to make the tax system more \"regressive\" which means increasing the burden on the poor. Don't give me nonsense about earn more keep more. The tax system is regressive enough already.",
            "OK... And the last 5 years tax threshold rise has been what?",
            "> Reform will introduce 20mph speed limits \n\nThis might just be the most frostbitten hot-take I have ever heard.\n\nDon't support Reform in the slightest but this is just ridiculous to say.",
            "Welsh Labour have done that.\n\nThe roads in Wales are in a terrible state and they’ve implemented a blanket 20mph",
            "Name one. And serious one at that.",
            "You’re unable to take my comments at face value because they’re being coloured by the caricature of a right wing populist you’ve obviously decided I am.\n\nHence the complete lack of substance in your comment, you don’t deem my opinion worthy of a response.\n\nI have no intention of voting Reform but I’m not so blinded by my own dogma that I can’t have a level of nuance in my political opinions.\n\nIf you have a reasoned response to anything I’ve said I’d like to hear it but I presume you will continue to going around burying your head in the sand thinking you’ve got it all figured out.",
            "I don't see how that is relevant to the point I was making and the point you replied to.\n\nAnyhow, in response to what you said obviously its difficult for the BBC to know how much coverage each party should get, not all parties have equal support. As you say there are many good arguments to be made against many aspects of the Reform manifesto, which ties in nicely with the whole point I was making that they don't need to be so disengenuous with how they are covering the tax aspects.\n\nLabour quite rightly have kicked up a fuss about how the Tories have evaluated their tax plans and the BBC gave considerable exposure to Labour's argument on the £2,000 figure. I think Reform aren't being treated with the same fairness on their tax plans. It would be quite right to say that tax cuts that deep so suddenly would likely cause distress in the markets like Truss did. However, they seem to want to frame them as a tax cut for the rich and not the poor because they're worried about how many working class voters are moving to Reform.",
            "Economic policies are misinformation?",
            "How old are you?",
            "Due to him being in a coalition previously and a surprise minor majority at the time due to LibDem cratering. Labour are not going to be in that situation",
            "Especially as all our current breed of interviewers are fucking awful and purely trying to get a YouTube clip and a headline with gotcha questions. \n\nIf they were serious they’d get Andrew Neil to interview him.",
            "Hes not winning the election it really doesnt matter and they are not doing the same against others who have big holes also?",
            "He literally gets challenged non stop its not his fault the media are so shitty and cant do it good.",
            "Well I dont agree with that part then I do agree that anyone under 20k shouldnt pay tax.",
            "Covid Feb 2020 onwards has inhibited further threshold rises.\nCovid has to be paid for.\nPre Covid the threshold rises were consistent and dramatically different to what Brown and Labour did.",
            "due to potholes\n\n\nWay to take it out of context. You think local budget and services are bad now, Reform would destroy them. ",
            "What face value when again you're doubling down on Farage being anything else than a tool . \n14 years in a job and he attended 2 Fishery meetings. \n7 times failed as an MP . \n3 months after the war started officially,  he had a speech.  \n15 years paid by Russia Today. \nIRA slogans on Radio . \nEtc, etc",
            "\"If elected we will do [impossible to deliver thing] and it will solve everything.\" is misinformation, yes.",
            "No, their economic policies are misinformation. They're basically claiming to want to \"make Britain great again\" and especially for the working man. This article is about how that is a false narrative.",
            "In my fifties",
            "Andrew Neil founder of GB News? No thanks.",
            "Ok , you win. \n\nPlease allow me to correct my statement: the British press is so shitty,  they give Farage a free pass almost every time he opens his mouth.",
            "I'm asking for the exact figures for the last five years, please.",
            "How? They might get 3 seats. To Labour’s 400+",
            "How is that different to the SNP, Plaid, Green or LibDem manifestos? They all have that.",
            "How can economic policies of “we will raise thresholds” be misinformation?",
            "You’ve been through a hard left wing Labour Government, who the lost in a landslide to thatcher, who was then coup’d by a one nation conservative who then lost to a centre left Labour, who lost to a centre right One nation conservative, who was coup’d and then lots of coups and coups between one nation and Thatcherites. \n\nUnless you’re a communist who thinks Wilson and Callahan were right wing you’ve won at some point",
            "He could be professional when he needed to be.",
            "To see why people ask for this watch his interview with Ben Shapiro. Whether he would be as tough on Farage is hard to say.",
            "No correct yourself again\n\nthe British press is so shitty, they try to catch Farage but fail almost every time.",
            "Oh dear , struggling a bit are we?",
            "It's theoretical, if they were to win that would be their policy. "
        ]
    },
    "Peston: “It becomes an existential threat to the existence of the party” @GavinBarwell reacts to the #ITVYouthTracker which found only 1 in 10 people between the ages of 18 and 24 are planning on voting Conservative": {
        "title": "Peston: “It becomes an existential threat to the existence of the party” @GavinBarwell reacts to the #ITVYouthTracker which found only 1 in 10 people between the ages of 18 and 24 are planning on voting Conservative",
        "score": 112,
        "url": "https://x.com/itvpeston/status/1803554306647310441",
        "content": "",
        "num_comments": 58,
        "comments": [
            "Snapshot of _Peston: “It becomes an existential threat to the existence of the party” @GavinBarwell reacts to the #ITVYouthTracker which found only 1 in 10 people between the ages of 18 and 24 are planning on voting Conservative_ :\n\nA Twitter embedded version can be found [here](https://platform.twitter.com/embed/Tweet.html?id=1803554306647310441) \n\nA non-Twitter version can be found [here](https://twiiit.com/itvpeston/status/1803554306647310441/) \n\nAn archived version can be found [here](https://archive.is/?run=1&url=https://x.com/itvpeston/status/1803554306647310441) or [here.](https://archive.ph/?run=1&url=https://x.com/itvpeston/status/1803554306647310441)      \n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/ukpolitics) if you have any questions or concerns.*",
            "In the 2010 election 18-24 year olds went 30/31 conservative/labour\n\nThe decline is a result of conscious decisions they have made",
            "Turkeys don’t vote for Christmas. Bizarre. Structure your entire campaign around benefiting the older generations at the expense of the young and I fear you may lose the young vote. Combine that with terrible economic growth and the genuine possibility that young people today may not receive a state pension, and you create a longstanding hatred. Even the national service policy was designed specifically to stir up the vitriol of older voters, at the expense of the young.",
            "who are the one in ten? they walk among us 😬",
            "Nuts when the overall number is just about 2 out of 10.",
            "I mean, look at the final question Sunak got on QT this week and this should be no surprise.",
            "Always surprised it is as high as 1 in 10. Assuming that's the absolutely privileged children of the super-elite? Genuinely curious who these people are.\n\nI don't expect the other 9 are voting Labour, or even to various left parties. But I can't think of a single reason any 18-24 would vote Tory. They've been watching their future get systemically fucked by this government for their entire lives. What could possibly appeal?",
            "Fuck the Conservative Party, I couldn’t care less for the fate of that as an organisation. \n\nI am worried by this though. Only 1 in 10 might be voting Conservative, but I don’t believe that means 9 in 10 are committed left wing progressives. There’s going to be the same underlying spread of views on the economic and social issues as there was 5 years ago.\n\nThat means there’s a decent sized block of 13-19 year olds who will be looking for a “right”ish party in the 2029 election. I’m not looking forward to finding out who fills that gap.",
            "The old saying is that if you're not a socialist by the age of 20, you don't have a heart and if you're not a conservative by the age of 40 you don't have a brain. The conservatives have been relying on the shift in people's attitudes towards them as they age. \n\nThe real danger to them is not that young people are leftists. They've always been. The real danger is that the people are not shifting to the right in same numbers as they used to. In particular the millennials who should be in that transition are much more leftists than the previous generations at the same time. \n\nOne reason is the home ownership. They are struggling to buy their first house. When you own a house, you suddenly care a lot more on the protection of wealth than if you don't. If you don't own a house, you're much more open to redistributing policies of the left (although the current Labour is not promising much on this).",
            "It's not that far off the general population to be honest. Current polls show that less than 2 in 10 are voting for the Tories.",
            "Surprised it's as high as that, to be honest",
            "> 1 in 10 people between the ages of 18 and 24 are planning on voting Conservative\n\nEducation clearly didn’t work on them.",
            "Who would have guessed repeated policies that screw over the young don't win you their support.",
            "My brother in christ you have fucked over my opportunity to study abroad without paying 20k a year. Driven up rent prices due to your inability to build houses and will to protect landlords and also created a cost of living crisis with your mini budget\n\nWhy the fuck would I want to vote for you",
            "That’s a typo it’s actually 1 to 10 people between the ages of 18 and 24",
            "Why is everything seen through the lens of its impact on the Tory party? Good if they get wiped out - it will be positive for the country.",
            "They don’t like forced unpaid labor, an awful job market *or* unaffordable housing?\n\nTalk about entitled!",
            "Might also be thinking the grass could be greener after growing up through the Blair years. \n\nSource: I was in this age range in 2010.",
            "Bet they regretted that lol",
            "Almost everything they've done over the past 14 years has been an attack on young people and their future. Tuition fees, scrapping green policies, brexit, lack of house building, stagnant wages, lack of NHS funding, lack of school funding... I mean the list is endless. Why would anyone in that generation vote for them?",
            "If a hangover is because you’ve taken happiness out of tomorrow for today, then this is the result of stealing from the future to pay for the present.",
            "That was my thought, 10% amongst this group is far better than I'd have assumed. The Tories should take it as good news they're still this popular despite all efforts to repel the youth vote lol.",
            "I know one, still to this day loudly celebrates the conservatives. Saw him last week campaigning with my local conservative MP. Very nice guy but he does tend to treat politics like a football team.",
            "Mostly very indoctrinated children of rich parents who are very sure they will remain in the top x% the tories give a damn about.",
            "It won't be one in ten. That ITV tracker will be a cheap online survey and if you ask basically anything in a cheap online survey, 8-10% of respondents will say yes to it.",
            "The unemployed (Early 80's UB40 reference)",
            "Essentially the top ten percent of the income distribution. Or rather, their offspring.",
            "I’m one of them, and for me it’s largely about education. I’m happy that the Conservatives have reversed Labour’s relentless focus on university. They created many alternative routes to a good education, through the Advanced British Standard, the Lifetime Skills Guarantee and apprenticeship reform. Michael Gove’s reforms also stopped grade inflation, making sure our GCSEs and A-levels actually mean something.",
            "Well if 7% of uk children are privately educated, it’s stands to reason that the majority of that 7% are from traditionally Tory families and so will be forever tories. Add to that the non-zero percentage of people who like to feel ‘different’ from the mainstream and you’ll get the remainder I’d assume.",
            ">One reason is the home ownership. They are struggling to buy their first house. When you own a house, you suddenly care a lot more on the protection of wealth than if you don't. If you don't own a house, you're much more open to redistributing policies of the left (although the current Labour is not promising much on this).\n\nThis is the crux of it. The original notion is that as we get older, we accumulate wealth, we have a house, a family, and a pension pot. Middle-aged people with these things value stability over revolution, so gravitate to conservative attitudes, which are about maintaining the status quo.\n\nBy taking an anti young people stance like the tories have done and delayed this wealth accumulation, you end up with a middle-aged group with no reason to want to maintain their status quo. So no reason to vote Conservative.",
            ">When you own a house, you suddenly care a lot more on the protection of wealth than if you don't.\n\nAnd as someone young (well, sadly have to concede I'm well past the 18-24 cohort now) with a mortgage, I can attest that the damage done by Truss (and to a lesser extent the rest of the post 2016 Tories) have served only to make it harder to accrue that wealth once on the ladder.\n\nAt this point, I'm voting the Tories out before I can barely afford a brick.",
            "Personally speaking, I feel like I'm shifting further left the older I get, and I know others my age who feel the same way.",
            "The tories problem is the same as it always has been, lies are all well and good while they're still hypothetical, but you can only grift for so long before people start to notice tax breaks for the rich, fire sales of state assets and the decimation of public services don't actually lead to a prosperous country.\n\nIn 20 years time we'll be back in the same place",
            "1997 was the first election I voted in. By 2010, I was feeling that the Labour government was losing its way a bit just because they had been in power so long. As usually happens, there had been an accumulation of various scandals (though nothing like what we have seen recently), and they had acquired a quite unpleasant authoritarian streak that was very off putting.\n\nI didn't vote for Cameron, but I don't doubt that a lot of younger people did look at him as a viable option with his apparently somewhat softer more centre ground form of conservatism.\n\nI think a lot of those younger people will not have been expecting what was to follow - austerity, tuition fees (which are attributed to the Lib Dems, but it was a Tory policy), the scrapping of Surestart which will have affected a lot of people starting families, the gutting of local authority funding and services etc. Then came the brexit referendum and all the shit show that followed.\n\nThe past 14 years have absolutely cemented the fact that the Tories have no interest in anyone under the age of about 50, and they are paying the price for it now.",
            "I do think that is a big factor",
            "Whoever was in charge after the recession was going to struggle. It was very easy to make a convincing sounding case for austerity as well",
            "You say that as if by just about any objective measures the UK wasn't doing better under Blair and Brown.",
            "The main problem of British political culture. ",
            "That's just it though. I know someone like that as well. \n\nBut that's just one person, I probably \"know\" to various degrees, maybe 200 people - former colleagues, schoolmates, my university year, my kids friends parents, etc. \n\nThat's 1/200 rather than 1/10 ha.",
            "Or working class Tory types",
            "Yeah 1 in 10 seems generous. Being under 60 and voting Tory at the moment is just embarrassing. Actually, scrap that, voting Tory atm is embarrassing full stop.",
            "even if you think they did a good job with education, i just can't see how that outweighs everything else. if I was a tory from a young age, wasn't mad enough for reform and didn't feel at home voting for Labour, I wouldn't vote. they've got far too much wrong to swallow",
            "Surely, that's undercut significantly by the tories damage to the economy and harm they've done to the chances of young people getting on the housing market ?",
            "Slightly off topic but the 97 election is now covered in A Level history.\n\n\nMy oldest has been asking about it and making me feel very old",
            "Sorrry but this doesnt really hold up too much since they won larger majorities twice in that period.\n\neven after the brexit referendum...",
            ">just about\n\n\nI can't think of any measure, objective or otherwise, where the country is doing better know than it was under Labour.",
            "Not just British but everywhere, probably even more in the US. \n\nBut sure, if you read this subreddit you see how many people are entrenched in defending their political party and attacking its opponents instead of discussing political questions free of party politics.",
            "Agreed, he’s the only person I can think of",
            "Or the neglected ones without sky.\n\nThere is still a working class \"king and country\" orange tory voter who will never change. Not a big factor or talked about much though.",
            "\"Say what you will about Nero, but the arts were never the same after he fled Rome\"",
            "Thats education, education, education",
            "So is the 2005 election! Not in as much detail but doing history A level 2 years ago and writing about an election which took place a year after I was born felt a bit bizarre to me",
            "The demographic collapse of tory support has been recognised as a problem for them for quite some time now. It's not a sudden phenomenon, but it has become much more obvious over the past few years. Instead of trying to appeal to a younger demographic they've increasingly chased after the votes of older people which as had the effect of alienating the young still further.",
            "Gay people can get married and that's about it, I think",
            "It’s very telling that the best example of progress during the 14 years of Tory rule was opposed by the Tories (more Tory MPs voted against than for) and only got through because of support from Labour, the Lib Dems, etc!"
        ]
    },
    "Rishi Sunak says Nigel Farage 'playing into hands of Putin' with 'completely wrong' comments on Ukraine war": {
        "title": "Rishi Sunak says Nigel Farage 'playing into hands of Putin' with 'completely wrong' comments on Ukraine war",
        "score": 74,
        "url": "https://news.sky.com/story/nigel-farage-playing-into-hands-of-putin-with-completely-wrong-comments-on-ukraine-war-rishi-sunak-says-13157055",
        "content": "",
        "num_comments": 28,
        "comments": [
            "Snapshot of _Rishi Sunak says Nigel Farage 'playing into hands of Putin' with 'completely wrong' comments on Ukraine war_ :\n\nAn archived version can be found [here](https://archive.is/?run=1&url=https://news.sky.com/story/nigel-farage-playing-into-hands-of-putin-with-completely-wrong-comments-on-ukraine-war-rishi-sunak-says-13157055)  or [here.](https://archive.ph/?run=1&url=https://news.sky.com/story/nigel-farage-playing-into-hands-of-putin-with-completely-wrong-comments-on-ukraine-war-rishi-sunak-says-13157055)         \n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/ukpolitics) if you have any questions or concerns.*",
            "Well, just when I thought there was literally nothing Rishi could make me side with him on something, there's finally atleast one.\n\nReform really is just a copy paste of Trumps Republican party isn't it?",
            "The one thing that has surprised me about the current government is their unyielding stance on Russia, Ben Wallace was great and is missed, BoJo was BoJo at everything apart from the war in Ukraine, and Rishi has carried that on. \n\n\nI feel like there's a catch somewhere, but I'd rather it this way...",
            "Sunak and Starmer are right. Farage is saying that Poland, the Baltic states and other countries with a pretty recent history of being invaded by Moscow shouldn’t have chosen to protect themselves by joining NATO. Finland and Sweden did not feel a need to join NATO until Russia’s aggression against Ukraine. \n\nAnd Putin’s views on Ukrainian autonomy and independence pre-date the expansion of NATO: there is a clip of him from the early 1990s in which he complains about how Lenin gave autonomy to Ukraine after the collapse of the Russian Empire. He has repeated these views ever since: he wrote an article in 2021 entitled “On the Historical Unity of the Russian and Ukrainian People” and his invasion speech of February 2022 was a long lecture about why the collapse of the Russian Empire and the USSR were bad things.",
            "Sunak finally standing up to Farage just about 4 weeks to late!!",
            "Remember when people said Corbyn and Labour were threats to national security? I’m no Corbyn fan but I think it pales into comparison to what farage has said. I can’t imagine a world in which the British prime minister (farage) and American president (trump) are both tools of Russia’s dictator. I can imagine putins glee at getting his men into high office in the two countries which have traditionally been seen as the leaders of the western world.",
            "Maybe I've missed the other parties response + possible they just haven't got to it *quite* yet. But I'm pretty disappointed that the other parties have taken the opportunity to absolutely dogpile into Farage/Reform on his statement about Ukraine.",
            "Well it's not \"completely wrong\" is it, he DID use the expansion of NATO as an excuse for starting the war, just as NATO used the expansion of Russia as the reason for intervening in it.",
            "What a limp response. Just shows how scared he remains of Farage. ",
            "It must be kind of galling for Sunak. I mean, as much of a useless prick as he is and as much as his campaign has been like an episode of The Thick of It, here's Farage sticking up for Putin and it won't do his campaign ANY harm at all. Meanwhile every time Sunak opens his mouth it seems enough for him to lose a few more points.",
            "Like all far right groups Russia influences in its ongoing effort to destabilise the west.",
            "I mean a lot of the left also said Nato expansion was pressuring Russia. \n\nI do think Farage is quite wrong but lets not just say its a Trump/Right wing thing.",
            "I expect the intel on Russia is very bad. As in they are all in on trying to recreate the Russian Empire. Call it a third world war, who cares, Putin wants what he wants.\n\nI expect this is the case across Europe.",
            "We fuck about at home but when it comes to protecting it, no games.",
            "Bojo was completely Bojo at Ukraine - a self serving opportunist thar his chance to roleplay Churchill.\n\nHe turned up in kiev all pomp and brouhah showing he was with the people and all that in his suit not afraid, got a street named after him in Ukraine etc etc\n\nHe was in Merseyside the week before in a bulletproof vest and helmet lol.",
            "Foreign policy is generally pretty consistent regardless of government. The interests of the UK don’t really change, the brief stays the same. \n\nEnsuring the war continues in Ukraine is in the interests of the UK. It drains Russian resources, valuable info can be gathered to adapt doctrine, we can test the effectiveness of our equipment, and importantly the US/UK can show they will defend the rules based order they impose on the rest of the world. We can also get revenge for Salisbury.\n\nEverything else is just propaganda and noise. Russia isn’t seeking to rebuild its empire, it isn’t seeking WW3. It can’t because of NATO. Ukraine is very important for Russian national security. Ukraine left the Russian sphere of influence, and now Russia wants it back. It’s that simple.\n\nA war in Ukraine has been predicted for decades anyway, well before the revolution. Ukraine was one of the fault lines listed in the ‘Clash of Civilizations’ thesis in 1992 as being a likely location for a future conflict.",
            "There's few things more bizarre than Tory rhetoric being designed to try to stop the bleed of votes to Reform but spending their entire time attacking Labour and trying to hide from Reform as much as possible. Sunak's political instincts and leadership are some of the worst I have ever seen.",
            "They've both said the same thing. The exact same talking points straight from Russian propaganda. \n\nPoor Russia had no choice, NATO expansion, Imperialism, USA bad, whatabout Iraq etc etc.",
            "It goes to show how much power the media has to make or break a political campaign. I suspect there are a lot of Reform voters who would have insisted in 2019 that Corbyn's views on foreign policy are a huge threat to the UK, but wouldn't say the same about Farage.",
            "100% \n\nCorbyn and a bunch of left wing figures were fucking eviscerated for saying essentially the exact same thing back in 2022 - and rightly so.\n\nThere is absolutely no reason whatsoever that Farage should be allowed to get away with saying shit like this without any kind of consequences. Indulging in racist / nationalistic rhetoric and associating with far right activists,  conspiracy theorists, anti-vaxxers, climate sceptics, Nazi sympathizers, etc. is bad enough - but openly parroting the lies of an authoritarian dictator engaging in a brutal, unprovoked war of aggression based on paranoia and revanchist delusions, as part of a broader effort to rebuild the Russian Empire and weaken / outright destroy the 'West', *has* to be recognised & responded to as the Rubicon-crossing moment it is. \n\nHe is no longer a 21st Century Enoch Powell; he is a 21st Century Oswald Mosley. If the other party leaders do not respond as such, it will represent a moment of abject cowardice & a gross dereliction of duty.",
            "A lot of the smaller parties most likely think the same tbh",
            "horseshoe theory \n\nFar Left (Galloway) - Russia/Palestine\n\nLeft (McDonnell) - Ukraine/Palestine\n\nCentre Left (Starmer) Ukraine/Israel\n\nCentre Right (Sunak) Ukraine/Israel\n\nRight (Farage) Russia/Israel\n\nFar Right (Nick Griffin) Russia/Palestine",
            "Its like he's still fighting a political campaign of a different place in a different time.",
            "And when they *do* acknowledge Reforms existence they spend the entire time moping about how much Reform is kicking their ass, basically giving them free PR. Like that ad they released screeching about how Reform was going to cost them 20+ seats.",
            "The only country practicing imperialism is Russia which seems to think any country in its region with the slightest of historical Russian influence belongs to them."
        ]
    },
    "‘Get real, wakey wakey, red pill time’: Reform candidates in their own words ": {
        "title": "‘Get real, wakey wakey, red pill time’: Reform candidates in their own words ",
        "score": 98,
        "url": "https://www.theguardian.com/politics/article/2024/jun/22/reform-candidates-in-their-own-words",
        "content": "",
        "num_comments": 76,
        "comments": [
            "Snapshot of _‘Get real, wakey wakey, red pill time’: Reform candidates in their own words _ :\n\nAn archived version can be found [here](https://archive.is/?run=1&url=https://www.theguardian.com/politics/article/2024/jun/22/reform-candidates-in-their-own-words)  or [here.](https://archive.ph/?run=1&url=https://www.theguardian.com/politics/article/2024/jun/22/reform-candidates-in-their-own-words)         \n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/ukpolitics) if you have any questions or concerns.*",
            "A weird collection of climate deniers, Hitler admirers, and anti-vaxxers. How surprising...\n\nOf course Farage denies these people are anything to do with him, despite them being his candidates that he's still endorsing 🤔",
            "The only consultation for having a constitutional electoral system like ours is that Reform won't win many seats , bullet dodged.",
            "You have to wonder whether they even bothered with the most basic candidate checks. Apart from those already outed in the media Raymond Saint, the Reform candidate in Basingstoke. appears on the leaked BNP membership list from 2007/8 which can still be found on wikileaks. Surely even the most incompetent right wing party would have checked names against this list?",
            ">‘red pill time’\n\nWith all their anti-transgender rhetoric (including pg1 of Reform's contract stating \"Transgender indoctrination is causing irreversible harm to children\"), I'm surprised they're still using that reference from The Matrix considering both the creators are trans and the films themselves are a trans metaphor.",
            "I will pop back here in a few hours and see if this post has been brigaded by reform supporters justifying why they are not far right lunatics. \n\nReform is just MAGA UK.",
            "Reform are a bunch of tin foilers, yet the stupid will vote for them.",
            "On one hand getting 20% of the vote and no seat is ridiculous.  \n\nOn the other hand these people need medical attention for their mental trouble, not a seat in parliament",
            "Not exactly what you'd call strength in depth",
            "> Lee Bunker\n\n> David Burgess-Joyce\n\n> Mark Butcher\n\n> Angela Carter-Begbie\n\nThese are some incredibly evocative far-right names. Your classic mix of \"I joined Reform because those bloody asylum seekers stole my missus\" and \"I joined Reform because it's so hard to find a good maidservant of caucasoid cranial type these days\".",
            "Reform- the party for racist, Putin sympathisers, who enjoy being conned by a privileged multimillionaire conman..",
            "Hmmm, that seems like misappropriation of a metaphor.",
            "Not a Reform fan but I think the Guardian may need to adjust to this election normalising National Populism.\n\nI don't think mainstream Right is about to go back to Cameroonian Conservatism.\n\nWith National Populism comes all kinds of wacky ideas of fascism light.",
            "The matrix is the go to movie to reference for conspiracy theorist wackos.",
            "Yeah, if the Hitler headlines didn't do it then this ain't gonna.",
            "Conflicted with most of these people, Douglas Murray, Melanie Phillips etc. On one hand they do occasionally have something worth listening to. On the other they don't seem to grasp that for a society to function we have to turn a blind eye to countless ugly truths.",
            "I got a reform pamphlet through my door and the only mention of the guy running in my area was his name it’s was just buzzzwords and a picture or Nigel and some other guy",
            "As with his Putin comments, it's the classic grey area bullshit. Gives just enough plausible deniability for those who want to claim that he's not endorsing Putin, just saying you have to recognise his effectiveness and what about all these things we could have done differently, whilst being lapped up by the not insubstantial part of his audience who are outright pro Putin.",
            "You left out the incels - red pill talk etc.",
            "Of course he's deliberately talking out of both sides of his mouth, but the logical line of questioning is \"If you're saying you had nothing to do with the recruitment and vetting of these candidates, are you refusing to endorse them?\"\n\nAlthough I suppose the obvious answer is \"I don't necessarily support all their views, but they have the right to freedom of expression etc\"",
            "\"you have to remember I've had nothing to do with this party for 3 years apart from being the largest shareholder and president, all the problems are from third parties and the media.\"",
            "Don't forget Putin appeasers",
            "‘They’re just saying what real people are thinking’",
            "I take it as you can walk them out on stage. Smile on face. And see them fall apart from scrutiny",
            "Not that surprising. There’s always people who stick to their belief on something no matter the facts. It’s like people thinking homelander in the boys is a hero when literally everyone related to the boys  has called him a villain since day one",
            "Same thing happened with American Psycho lol",
            "> the films themselves are a trans metaphor\n\nI have to admit I haven't seen the film for a decade or more but that's reaching a bit, isn't it?\n\nWhen the story is like the Narnia ones, it's pretty hard to argue that it's anything other than an allegory. But with the Matrix, surely it overlays nicely onto any sort of \"becoming aware of true reality\" metaphor? You could use it for any political or social or personal choice between accepting supposed reality or returning to your old life like everyone else.\n\nI mean, if that's what the creators have said, then fair enough, and I'm not a militant \"death of the author\" type, but certainly I can see how someone could miss that alleged metaphor.\n\nA bigger problem is probably why a sci fi film from a quarter of a century ago is providing the language for a political candidate - though it's far from the most objectionable thing a Reform candidate has said this week.",
            "True but it being a trans metaphor seems almost certainly something they came up with much later.",
            ">I'm surprised they're still using that reference from The Matrix considering both the creators are trans and the films themselves are a trans metaphor.\n\nMost people couldn't tell you who made the matrix and definitely couldn't tell you their gender identity. Even if they could and cared one way or the other it wouldn't stop them using popular phrases because that level of puritanism would be silly.",
            "I don't think the <word>-<word>-#### crowd are real people. It's impossible that it's always different people with this particular name format. It's clearly bots or false accounts set up to spread this kind of stuff.\n\nLook at the comment history of the bot who replied to you. They have hundreds of comments recently but only on ukpolitic and one other uk political subreddit. Scary really how much effort is going on to pushing reform.",
            "It's not just here. Tiktok has been absolutely filled with reform bits from new accounts for months!",
            "MBGA surely? :p",
            ">justifying why they are not far right lunatics\n\nNobody cares.",
            "What makes them far right names ?",
            "I'm expecting Angela to chuck a pint glass off a balcony and start a fight.",
            "What is wrong with the names - what would you prefer?",
            "Fortunately turning the ugly truth that Reform is full of fascist lunatics, racists and hitler apologists is not one of the ones we have to turn a blind eye to. Unless you want a government filled with racists and fascist lunatics?",
            "Exactly the same through my door yesterday.",
            "Was the other guy 30p, he seems to have become 2nd in the propaganda hierarchy",
            "Richard Tice. I got the same one this morning. I’d imagine a lot of it is to do with the fact that it’s far cheaper to print a standard leaflet and just text mailmerge the candidate name at the top rather than 500 separate short run prints with a different photo for each candidate.\n\nAnd also because it’s a thinly veiled cult of personality.",
            "Yeah, I got one the other day. It just looked like it was bodged together on Windows 98 or something. \n\nRecycling bin seemed like the only way some good could be made of it.",
            "We think of dog whistles being about carefully coded racism, but it applies here. What he's saying is just a dog whistle to pro-Russian scum that he's on their side but worded so he can deny it and say he meant something else if challenged on it.\n\nPeople who support Russia and want us to cut off Ukraine and force them to surrender don't say that openly, they veil it with crap about NATO expansion and \"let's talk about peace deals instead\". The pro Russian ones know *exactly* what he means.",
            "Tbh, I think most people aren't pro Putin. Or anti climate change. Even amongst their supporters. There's a small group of red pill 4chan young people who are. Most people like them because of the immigration stuff. I bet most other people don't know/don't support the Putin or anti climate change stuff. That's the thing with been a single issue party when your other stuff doesn't go down half aswell.",
            "Yes. It's the same kind of people who watch Full Metal Jacket or Platoon and then say how great it was when films weren't political.",
            "The creators have [explicitly stated it](https://www.bbc.co.uk/news/newsbeat-53692435), and were known as the Wachowski Brothers and are now known as the Wachowski Sisters. They're both trans women.\n\nAsfaik \"red pill\" spawned from gamergate, popularised by 4chan, and then morphed (alongside gamergate) into a general catch all term the far-right use as a bastardised version of \"woke\" (the original meaning of it anyway).\n\nAs for why, well 4chan being 4chan viewed the Matrix as a metaphor for people \"waking up\" from being controlled by either women (for your misogynist users of the term) or some nebulous \"NWO\", often Jewish (for your generic far-right users of the term).\n\nEdit: Looks like the Reform candidate is using the term as the latter, generic far-right antisemitic meaning.",
            "https://www.bbc.co.uk/news/newsbeat-53692435\n\nI mean, it's close enough.\n\nThe intention is there to make it a trans metaphor overtly but it didn't make it production. It's still quite queer coded.",
            "It's not just about knowing who the writers are, it's about doing some basic media literacy on what The Matrix is actually saying about personal identity",
            "It's a default name format used for lots of username generators",
            "That's just the default randomised username template when making a new account on reddit. It still suggests alts made to spread shit that people don't want on their main but they're not necessarily bots.",
            "MGBA. \n\nI don't like it, redo it! But with no changes!",
            "[deleted]",
            "I'm really not sure, very torn sometimes. If the left wants to head off the rise of something awful  the concerns of working class social conservatives will have to be adressed.  That doesnt mean throwing x or y group under the bus, just raising most peoples living standards enough  that scapegoats arent required.",
            "Richard Tice probably. He was on my Reform leaflet, same size as Farage. Which seems kinda hilarious because outside of politics nerds I can't imagine anyone knows who he is...",
            "Yup, precisely what it is. It's a nudge to the uninformed and undecided and a nod to the already irredeemable.",
            "The same people who wear the Punisher logo on their shirts and fail to realise the character would detest them.",
            "It probably gained more traction after Gamergate but The Red Pill was created over 2 years before Gamergate happened. It turned out that the guy that created it [was a Republican in the Hampshire House of Representatives](https://www.cbsnews.com/news/robert-fisher-new-hampshire-lawmaker-criticized-for-online-misogynistic-forum-resigns-the-red-pill/) and he resigned once people found out.",
            "Someone else already posted the first link as a reply - I hadn't seen that before and I replied to them.\n\nYour other two paragraphs, I'm afraid, completely lost me.\n\nBut if \"red pill\" is another word for \"woke\" (which itself seems to be the new \"politically correctness gone mad\") to one group while also being a symbol of trans identity for another, with origins shrouded in overtones of misogyny and antisemitism, then it sounds a little like its the absolute perfect internet argument topic! All you need is to throw COVID in there somehow it'd be complete.\n\nWhich is a good point for me to step back. I'll let our colleagues in the YouTube comments section take it from here.",
            "Huh. Interesting! Thanks for sharing that.\n\nThe article notwithstanding, I think I'd still maintain that in the released film it's a pretty subtle metaphor that could apply equally well to any other \"becoming aware of the truth\" paradigm, even if the author's inspiration came from one particular set of experiences.\n\nIn other words, there's plenty to criticise Reform candidates for this election, but I'll give them a pass on not picking up on this one! If they want to use the \"red pill\" and \"blue pill\" as symbolic of something to do with voting for them or not, that's fine by me.",
            "Honestly I thought it was a cheesy movie with a lot of action scenes innovatively using slo-mo inspired from Descartes 'evil demon' concept.\n\nI definitely need to re-watch it and pay more attention xD I was probably too young to pick up on all the 'queer-coding' mentioned in other comments.",
            "On its own it doesn't mean much but when a group of standard usernames appear with similar patterns in views and similar histories its really suspicious.",
            "Not really, but if it makes you feel happy then sure.",
            "But the left hasn’t been in power for 14 years. And everyone’s suddenly convinced they aren’t going to do anything and we need to vote Reform. \n\nBecause when you are a struggling working class person voting for a millionaire ex-banker as an ‘anti-establishment’ vote is the logical choice, right? That’s how deep the right wing propaganda has run in this country.",
            "\"Woke\" was originally a progressive term, used by the African American community, as shorthand for \"aware of racial prejudice and discrimination\". It was only later that it was bastardised as a term of mockery by the right wing, as you said turning into meaning \"it's PC gone maddd\".\n\nBut nobody uses \"red pill\" outside the far-right, even if it was originally a trans analogy. It has been totally coopted and anybody unironically using it will be an unpleasant person.",
            "Not quite. If you have taken the red pill you have woken up, which is not the same as being “woke”. Look up Based and Red Pilled.",
            "Yeah, AFAIK \"red pill\" is more used as \"you've been woken up to the conspiracy\" (which they take to include all forms of \"political correctness\") rather than the older use of \"woke\" which is woken up to the oppression of the powerful and originated in black communities.\n\nRed pill guys would view \"woke\" as part of the conspiracy against them, along with feminism (which is why \"red pill\" and \"pick up artist\" go hand in hand).",
            "There was a cut detail where one character changed gender in and out of the matrix,  WB wouldn't allow them to do it.",
            "Back to the Death of Author which is ironically a postmodern belief.",
            "Yeah, it's pretty dodgy and I think the amount of genuine alts from \"You can't say that anymore, but I really want to\" people is a thing, but a fairly low proportion of the total. I wouldn't be surprised if it were something like 25% real people, like those articles the other day of people trying to see if the reform replies on tiktok were real.\n\nBut a lot of the troll factory work used to be done by hand using the kind of tools that businesses use for managing social media accounts, before LLMs and the like. If it's people in an office in a low income country getting paid to do it, rather than fully automated bots like Twitter's pussy-in-bio swarm, it doesn't really make it better.",
            "Ironically a lot of the policies on the left would help the working class. Harsher taxes on the wealthy would mean better funded public services, investment in green infrastructure would mean long term sustainable economy and jobs, stronger worker rights would mean, even if you are native or immigrant, you would have the right to strike and negotiate for better wages.\n\nAnd yet, right wing media has poisoned the well to the point where if you even mention these things you are branded as loony lefty liberal.",
            "That would have been an interesting story element for sure - and played nicely into the idea of computer gamers generating a character who is entirely unlike them. I could imagine it confusing things for the audience though, especially back when the film was released.",
            "Switch",
            "Yeah, indeed.\n\nI don't have a strong opinion on it in general. It depends on the work for me.\n\nIt seems at least rude and at worst unhelpful to completely ignore any comment from the author on their work. If they tell you they were inspired by X, or thinking of Y, or definitely not writing about Z then that deserves some attention.\n\nSimilarly, it can't be true that \"I interpret work A as being a metaphor for B\" is reasonable for all possible values for A and B. Sometimes it's just going to be nonsense.\n\nOn the other hand, it feels unnecessarily exhausting to have to keep up with whatever an author (perhaps even a corporate author like a studio) happens to want to add or correct or reveal about their work. Or the author who insists that some scene that can perfectly well be understood as C is actually about D, when the text doesn't make the case particularly strongly.\n\nAnd there's something quite tedious about the sort of super-fan who insists you can't possibly understand Luke Skywalker's arc in the original Star Wars (which is about as simple as an arc can get) without textbooks worth of context, as though it were a religion.\n\nSo yeah. I'm somewhere in the middle? Mild cold of the author? Sprained ankle of the author?",
            "I believe that was the reason WB wouldn't allow it, they thought it was a confusing movie already.",
            "Reduced-to-three-day-week of the author.\n\nTo me the multiple interpretations of a work is a fact. In that sense it is like a religion. But then I think religious drives are emergent.",
            "One of the most confusing aspects, to my mind, was why one’s Matrix presence necessary bore *any* resemblance to one’s physical form in the first place, given nobody observed the physical form.",
            "i suppose the reason would be the same one that the matrix needs to be a copy of the real world right? to put humans in a cage they cant see. Given they have their bodies perhaps an avatar that diverges from their body would give them a kind of dysphoria and threaten to break the illusion?\n\nI dont know why the robots cant just ket them up to eyeballs in their little battery?"
        ]
    }
}