{
    "4:47 EEST; The Sun is Rising Over Kyiv on the 849th Day of the Full-Scale Invasion. Part 15 of the ideas, values ​​and dreams of fallen defenders of Ukraine. These are the words of the Heavenly Regiment.": {
        "title": "4:47 EEST; The Sun is Rising Over Kyiv on the 849th Day of the Full-Scale Invasion. Part 15 of the ideas, values ​​and dreams of fallen defenders of Ukraine. These are the words of the Heavenly Regiment.",
        "score": 114,
        "url": "https://www.reddit.com/r/ukraine/comments/1dln6n4/447_eest_the_sun_is_rising_over_kyiv_on_the_849th/",
        "content": "We are **Ukraïner**, a non-profit media aimed at advocating for the authentic Ukraine - and unexpected geographical discoveries and multiculturalism.\n\n**This is the fifteenth selection from a series that we have been updating since it was first published in 2022. You can find other parts here:**\n\n[Part I](https://www.reddit.com/r/ukraine/comments/13pcvua/501_eest_the_sun_is_rising_over_kyiv_on_the_454th/) | [Part II](https://www.reddit.com/r/ukraine/comments/13r4ra9/458_eest_the_sun_is_rising_over_kyiv_on_the_456th/) | [Part III](https://www.reddit.com/r/ukraine/comments/13vd58m/454_eest_the_sun_is_rising_over_kyiv_on_the_461st/) | [Part IV](https://www.reddit.com/r/ukraine/comments/13x529c/452_eest_the_sun_is_rising_over_kyiv_on_the_463rd/) | [Part V](https://www.reddit.com/r/ukraine/comments/1421000/449_eest_the_sun_is_rising_over_kyiv_on_the_468th/) | [Part VI](https://www.reddit.com/r/ukraine/comments/143vtec/448_eest_the_sun_is_rising_over_kyiv_on_the_470th/) | [Part VII](https://www.reddit.com/r/ukraine/comments/14rueqa/454_eest_the_sun_is_rising_over_kyiv_on_the_498th/) | [Part VIII](https://www.reddit.com/r/ukraine/comments/15m2bhn/537_eest_the_sun_is_rising_over_kyiv_on_the_532nd/) | [Part IX](https://www.reddit.com/r/ukraine/comments/15ytad7/559_eest_the_sun_is_rising_over_kyiv_on_the_546th/) | [Part X](https://www.reddit.com/r/ukraine/comments/175x0pi/715_eest_the_sun_is_rising_over_kyiv_on_the_596th/) | [Part XI](https://www.reddit.com/r/ukraine/comments/17b82m7/715_eest_the_sun_is_rising_over_kyiv_on_the_603rd/) | [Part XII](https://www.reddit.com/r/ukraine/comments/186g4bj/733_eet_the_sun_is_rising_over_kyiv_on_the_644th/) | [Part XIII](https://www.reddit.com/r/ukraine/comments/1dg7cot/446_eest_the_sun_is_rising_over_kyiv_on_the_843rd/) | [Part XIV](https://new.reddit.com/r/ukraine/comments/1dhlm36/446_eest_the_sun_is_rising_over_kyiv_on_the_845th/)\n\n\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\n\n# Viktor Sukhodolskyi\n\n[Viktor Sukhodolskyi](https://preview.redd.it/h4r5xm45n08d1.png?width=1100&format=png&auto=webp&s=29c1fdca95f05ce82abf44d070d52c32130b8a05)\n\n**Soldier | Entrepreneur**\n\nOriginally from Rivne. He was a small business owner and also served in military transport aviation. In 2014, he voluntarily joined the reconnaissance unit and trained as a sniper. After returning home, he created his own YouTube channel, \"Didusyk TV,\" where he used chat-roulette to communicate with russians, debunking Kremlin propaganda narratives. At the start of the full-scale invasion, he returned to the front. On June 14th, 2023, he was awarded the medal \"For Bravery in Battle.\"\n\nHe was killed on June 17th, 2023, near the village of Piatykhatky in the Zaporizhzhia region.\n\n# — \"In this great Victory, there will be an intermediate stage — the liberation of our territories, including Crimea. And we will fully celebrate when russia collapses.\"\n\n\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\n\n# Anatolii Tehza\n\nhttps://preview.redd.it/g6nowvocn08d1.png?width=2000&format=png&auto=webp&s=cdbea0836f6c3545273c490b2b52c368a0cf34fd\n\n**Soldier | Entrepreneur**\n\nAnatolii, call sign *Varvar* \\[Barbarian\\], was originally from Zakarpattia. He held a degree in Economics from the Academy of Personnel Management. Later, he founded his own agricultural company. After the start of the full-scale invasion, he defended Ukraine as the commander of a tactical group of the 8th Special Forces Regiment. For successfully completing combat missions, he was awarded  by the Commander-in-Chief of the Armed Forces of Ukraine the \"Golden Cross\". Posthumously, he was awarded the Order \"For Courage\" III degree.\n\nHe was killed on July 14th, 2023, on the outskirts of Bakhmut.\n\n# — \"All the soldiers defending their country are defending you so that you may live in peace and harmony.\"\n\n\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\n\n# Ihor Andrukhov\n\nhttps://preview.redd.it/lwewl48xm08d1.png?width=2000&format=png&auto=webp&s=3b51c6d0b219a2e6141786e55f980d0ee7a96f4f\n\n**Medic | Senior Sergeant**\n\nBorn in Pavlohrad (Donetsk region). After receiving a secondary education, he received a medical degree. In 2014, he was mobilized into the Armed Forces of Ukraine. As part of the 74th Battalion, he defended Donetsk Airport, for which he was awarded the Order \"For Courage\" in 2015. In the summer of 2022, he transferred to the 78th Regiment \"Hertsi,\" where he held the position of Head of the medical unit of the assault battalion.\n\nHe was killed on July 8th, 2023, during the evacuation of wounded brothers in arms.\n\n# — \"The main thing is that the guys who gave their lives are not forgotten, that they are remembered. Because, as they say, 'heroes do not die for the first two days.'\"\n\n\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\n\n# Ruslan Senchuk\n\nhttps://preview.redd.it/s1dqd47tm08d1.png?width=2000&format=png&auto=webp&s=1e53b25a63997a71e5ace584faa76553015bdd70\n\n**Former Head of Vyzhnytsia District Administration | Captain**\n\nRuslan was originally from Khmelnytskyi. He received his higher education at Yurii Fedkovych Chernivtsi National University. Ruslan headed the Vyzhnytsia District Administration from 2016 to 2019. He joined the Armed Forces of Ukraine in May 2022. He held the rank of Captain and was the commander of an anti-tank missile systems company. He served in the 82nd Air Assault Brigade.\n\nHe was killed on January 6th, 2024, but his death could not be officially confirmed for another month, so he was listed as missing in action.\n\n# — \"As a former government official and now a soldier, I have undergone a radical reassessment of values: material things are nothing. The most important value is human life. And when you see such steadfast guys dying, it hurts a lot. \n\n# At the same time, I do not believe that Ukrainians in peaceful cities and villages should live only by the war. We are here standing and will continue to stand until Victory. Everything will be Ukraine!\"\n\n\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\n\n# Sviatoslav Kovshikov\n\nhttps://preview.redd.it/gk8exfymm08d1.png?width=1500&format=png&auto=webp&s=8ff8ca1e268a92770dd28e20a77b1c3de41e1964\n\n**Grenadier**\n\nSviatoslav was born in Berdiansk. He studied at the Faculty of Philology at Berdiansk State Pedagogical University. In 2023, he joined the Armed Forces of Ukraine. He served in the 401st Rifle Battalion as a grenadier.\n\nHe was killed on July 20th, 2023, while performing a combat mission.\n\n# — \"We will succeed. Ukraine will be free. All of it, without exceptions. Ukraine begins with each of us: with the person who puts a cigarette butt in the trash or the person who doesn't give a bribe. We are our future, no one else will make it for us.\"\n\n\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\n\nThe 849th day of a ten year invasion that has been going on for centuries.\n\nOne day closer to victory.\n\n# 🇺🇦 HEROYAM SLAVA! 🇺🇦",
        "num_comments": 4,
        "comments": [
            "Slava Ukraini! Good night.",
            "Since the Russian full-scale war against Ukraine started, supporting our team and gathering donations has become more challenging as we, like everyone else in Ukraine, focus on fundraising for our defenders. Now, we turn to you—the international community and supporters of Ukraine—to help us continue producing vital stories that not only support Ukraine’s fight against invasion but also remind the world of the value of freedom.\n\nPlease consider donating any amount on our Buy Me a Coffee page:  \n[https://buymeacoffee.com/ukrainerinternational](https://buymeacoffee.com/ukrainerinternational)\n\nNo donation is too small; even $5 can make a difference. All funds raised will support our core team and volunteers who create and broadcast content in over 10 languages. Thank you for standing with Ukraine!",
            "🇺🇦 !"
        ]
    },
    "The roar of motors is the heartbeat of war. More often than not our Recon friends are the only ones able to evacuate wounded soldiers in one piece. Please support our fundraiser to purchase the vehicle seen in the video, it is being worked on already. We have a 501(c)(3) compliant donation option.": {
        "title": "The roar of motors is the heartbeat of war. More often than not our Recon friends are the only ones able to evacuate wounded soldiers in one piece. Please support our fundraiser to purchase the vehicle seen in the video, it is being worked on already. We have a 501(c)(3) compliant donation option.",
        "score": 207,
        "url": "https://v.redd.it/01hm3ypf6w7d1",
        "content": "",
        "num_comments": 10,
        "comments": [
            "Huge thank you to everyone donating, especially to the people supporting regularly. This means the world to me! every $ brings us closer to the goal. We’re at 48% now.\n\nVehicle for recon squad\n\nPayPal: jesterboyd@gmail.com\n\nVenmo: mykola-jesterboyd (8833)\n\nCashApp: $jesterboyd or\n\nBTC: 3NEqdTJDcELgvJvyxZUuD3ia1uG9pq1dUb\n\nLTC: MS8GG2Tg14RBgxaTHvtkKqBuGr6fMj6rDz\n\nDOGE: DDUyrBv1Xo2YZHUXqDzTUYFwcCkNBq7qwF\n\n501(c)3 compliant option (let me know if you use this)\n\nhttps://ukrainefrontline.org/donate/",
            "Donated! How close are you now?",
            "Sent what I could. Stay safe 🇺🇦",
            "I donated.  I saw a young Ukrainian woman who had to flee the country and she burst into tears when I asked her about the war.  I hope the troops will be safe and victorious.",
            "It's sad they have to mention they're a 501c3 so people can make sure and write it off their taxes.",
            "We’ve raised $4950 out of $10000",
            "Thank you!",
            "Thank you!",
            "Nothing wrong with that as sometimes people donate substantial amounts or work for businesses that match their donations to charities"
        ]
    },
    "Unboxing a russian turtle tank": {
        "title": "Unboxing a russian turtle tank",
        "score": 1664,
        "url": "https://v.redd.it/u9h4nyjh128d1",
        "content": "",
        "num_comments": 80,
        "comments": [
            "\nПривіт u/TotalSpaceNut ! During wartime, this community is focused on vital and high-effort content.  Please ensure your post follows [r/Ukraine Rules](https://www.reddit.com/r/ukraine/about/rules) and our [Art Friday Guidelines](https://www.reddit.com/r/ukraine/wiki/artfriday).\n\n**Want to support Ukraine?** [**Vetted Charities List**](https://www.reddit.com/r/ukraine/wiki/charities) | [Our Vetting Process](https://www.reddit.com/r/ukraine/wiki/charities-vetting)\n\n**Daily series on Ukraine's history & culture:** [Sunrise Posts Organized By Category](https://www.reddit.com/r/ukraine/wiki/sunriseposts/)\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/ukraine) if you have any questions or concerns.*",
            "The turtle tank captured by the soldiers of the 22nd Brigade has made it to Army TV for an exclusive review. Recently, videos have circulated on social media showing an FPV drone striking the Russian turtle tank. This immobilized vehicle was then captured by the soldiers of the 22nd Mechanized Brigade along with the tank crew.\n\nLieutenant Colonel Serhiy Misyura spoke with the brigade soldiers and conducted a thorough examination of this technological marvel. What kind of tank is hidden inside the shed? What electronic protection measures did the Russians employ? And why does the tank have a gun that doesn’t shoot? Find the answers to these intriguing questions in the detailed report by Lieutenant Colonel Serhiy Misyura.\n\nSource: https://www.youtube.com/watch?v=lWCew0fmhGk\n\nTranslation: https://www.youtube.com/watch?v=Zk7JrM2nLEg",
            "Tanxi, my new favorite word.  Using a tank…a highly formidable weapon on the battlefield…to transport troops into battle.  If only we had thought of a way to do this, it’s brilliant!",
            "Cramming Russian mercenaries into a dysfunctional sardine can and even shitting on toilets with golden clogs. How much is Putin taking the piss out of his subjects?",
            "Fun fact: the guy on this video is one of ex commanders of 72 brigade (one of the best), who fought ruzzians since 2014 and was active in social media revealing truth about the war. He got callsign “Captain Price” from his subscribers because he looked exactly like capt Price from COD.",
            "So they  turned a clapped out tank into a really shitty APC",
            "What this really shows is how far into the dregs of soviet stockpiles Ukraine has ground Russia down to. \nThe Orks are left  using tanks that they can only get the engine and gearbox working on front line duties.",
            "it makes sense that it is taxi .\n\n1. Without ammo. (because ammo explodes) \n\n2 . Gun is fixed (no ammo)\n\n3. no reactive armour( they burn and explode)",
            "Blind, loud, stupid, useless.  Pretty much sums up any russian",
            "Just look at the abyssal depths the orc legions have reached. This is simply humiliating, yet they keep coming day after day, night after night. When will the madness end..?",
            "Bring it to Kyiv so all can have a laugh",
            "Load with explosives, add some vodka on front so they don't shoot at it... remote control and send it back to Russians... bum!",
            "Perhaps the Ruskies will trade some of these wunderwaffens for some top of the range North Korean missiles while Putie is over there. 🤣",
            "Thw first appearance of the turtle tank was succes - it survived. So Russia thinks, this is a wunderwaffe! Now they are pouring resources into it and are waiting for \"inevitable\" success. But in the end, there is only death for invaders.",
            "\"Second greatest army in the world, now the second greatest army in Ukraine.\"",
            "“Quirks and features” this would get a low Doug score",
            "\"More than half of Russians are prepared for a World War and expect victory over the USA\" \n\n\nhttps://www.reddit.com/r/europe/comments/1dggqbp/more_than_half_of_russians_are_prepared_for_a/?utm_source=share&utm_medium=mweb3x&utm_name=mweb3xcss&utm_term=1&utm_content=share_button",
            "Pretty much sums up the state of this pathetic country. Some Ukrainian hackers should stream it on ruskies tv.",
            "If anyone would like to learn more about Cope Cages, I made [Past, Present and Future of Cope Cages with Jerry from Analytics](https://imgur.com/a/5bNKlEM).",
            "Everyone laughed at the [Bob Semple tank](https://en.m.wikipedia.org/wiki/Bob_Semple_tank), but it was a genius design that was a century ahead of it's time.",
            "nice video, just a little repetitive. \n\nbut the main question that I'm left with: it is mainly an anti drone device, yet it was disabled by drones. why/how? was the anti drone tech disabled? did they stay far enough away?",
            "The pinnacle of Ruzzian engineering!",
            "The fact that this exists makes me laugh 😂 human intelligence can go a little more weird than excpected",
            "I’m no tank expert but that’s a pretty fuct tank.",
            "A dude in Grandby Colorado with a welder and a few months of spare time made a safer vehicle out of his old Komatsu bulldozer. \n\nSeriously though, the truck that my family provided to transport troops in Ukraine is about as effective as this tank that the Russians are using, and ours had leather seats, sat 8, every power option and a VCR and TV to watch movies LOL. I bet it was considerably faster off road with 4x4 too.",
            "Well in know is stupid and it hopefully shows the dwindling resources in Russia.\n\nHowever, from the perspective of the crew, it’s like a little self made motor home. They could have made some YouTube videos: 5 things we like about our rv.",
            "u/N_Performance",
            ">The main gun doesn’t even shoot\n\n>This is a Russian T-62M\n\nI am at a loss for words.",
            "It's Captain Price",
            "Useless it may be, but wouldn’t it be more safe than your regular Russian tank because there’s no ammunition to promote the soldiers to cosmonauts?",
            "You kids who grew up with cell phones just don't appreciate how cool this is.  When I was young we had portable radios that you could carry around so you could listen to music anywhere you wanted.\n\nThis appears to be a 40 ton portable radio.  How cool is that?",
            "russian shit show",
            "That drone is me in WoT when i immobilize a Maus by shooting it's tracks. But i think i've seen some with tracks protections too.",
            "Crazy orks, this is like something out of Warhammer.",
            "I am honestly having trouble believing this thing. It boggles the mind that it wouldn’t have camera’s rigged to get some vision for the crew.",
            "Would it not be possible to make sort of a dual charge warhead / FPV drone that can take on these garden sheds easily?",
            "I don't know why but I kept watching the video, they are actually trying to field an oversized paperweight...",
            "I really wish I could be a fly on the wall in the room where military strategists are discussing how cheap drones change tank warfare. It's a totally new type of threat that tanks aren't particularly well equipped to deal with.\n\nI wonder if we're going to see netguns or electromagnetic weapons strapped to the top of US tanks.",
            "I was hoping for a more explosive kind of 'unboxing' at the end of the video...",
            "It is a really pathetic contraption.",
            "Sheet metal... nicked from a junction-box.. And here I was, thinking that the armour of the classic vietnam-era M113 was about as crappy as it gets, or our DAF YP408 (Yes. I'm by now, old enough to have been carted around in those during training)",
            "“Let’s examine this marvel of modern Russian engineering.”\n\nBWAHAHAHAHAHAHAHAHA",
            "They didn't mention that the shell around does provide some protection against shaped charges for those inside the tank.",
            "MTV CribZ",
            "It’s less of an unboxing and more of a hands-on",
            "Best unboxing video I ever watched :D",
            "That cigarette pack at the end has “blindness” written on it lmao",
            "Mhm if its intended to be used as a relativly safe battle taxi, why not?\n\nSwitch sites.  A very outdated tank is transformed into a safe for the passengers to use apc that dont kill the crew when running over a mine.",
            "This seems like something you find a way to broadcast all around Moscow and outer regions",
            "Because it's designed to get you to shoot at it.",
            "Using tanks to transport infantry is solid doctrine if you have a lot of infantry and don’t care about them too much.\n\nBut the point is there should be many of those tanks and they should be battle-ready and supported by mechanized infantry.",
            ">Tanxi\n\nLove it.\n\nHowever\n\nRUber?",
            "Is he speaking Ukrainian?",
            "Russia will suffer a poverty driven and crushing defeat. And these serfs will follow their master into the gaping abyss in which this war is plunging Russia. An abyss of their own making, and the Russians are not even capable even now to remotely grasp what is happening.\n\nThe communists were already bound to their leader by faith and fear. I took a special kind of mind to truly believe that the worse things appeared, the better they actually were. Such reasoning went by the name dialectics, but by this time that word, (despite its proud descent from the Greeks through Hegel and Marx) meant little more than the psychic capacity to adjust one's own perceptions to the changing expressions of Stalin's will.\" Timothy Snyder, Bloodlands, page 65\n\nGareth Jones talked about the \"pure primitive worship\" of Hitler in 1933 shortly after his election at a rally in Frankfurt\n\nThe same primitive worship is given to Putin today.",
            "Something tells me that this is only one of many ridiculous contraptions the Russians will come up with as they run out of equipment. The motorcycle cage was also funny.",
            "Yeh, I see the resemblance, thanks for the extra info!",
            "Mom can we have APC?\n\nWe have APC at home.",
            "And intelligence gathering platform.  Recon/EM Recon by expendable tanxi.",
            "It's even more jank then I suspected.\n\n\nThe armor was scavenged off an electrical box? Wow",
            "Sadly r*zzians simply do not end. The French have ended, the Germans have ended, but not this scum",
            "As far as I understand, EW protects against fpv-drones kamikaze, which must fly directly to the vehicle and the range of EW. However, this tank was damaged by a drop, which does not need to get that close to the target.",
            "The tank tracks were disabled. Not the ECM set itself. It was removed for further study after the tank was captured.",
            "Here is why not: \nIt’s not bulletproof like regular APCs",
            "The video we got last month showed one leading a column of armoured vehicles, the ecm antenna dish on the roof protecting from drones, and a chain roller fixed to the front protecting against land mines.   I thought those were later model tanks, and had functional guns, but could only be traversed by moving the whole vehicle right or left. They survived those early encounters, but within weeks the UA upped their game and figured out how to knock them out.  The new videos showed the drone flying right into the back hatch, so the passengers probably didn't even have time to scream.  When drones control the air, SP's and tanks become fixed artillery hiding in the bush, at risk of being detected every time they fire or move.",
            "[deleted]",
            "the same can be said of many countries. I'm not excusing Russia or their action but to think they are \"simple\" and blindly follow, whereas we in the west (for example) are \"better\" ingores many of our faults. Eg look at tge rise of the right/religion/conspiracy and char8smatic yet damaging leaders gaining popularity.\n\nregardless, fuck Rusdia and Slava Ukrain",
            "sounds reasonable, would be very low-range anti-drone tech then... interesting!",
            "I got that. But with the tank having anti-drone tech, how did the drone come close enough? That's my question.\n\nCan drones easily approach from above? Like being high-enough over the tank to not be affected, with reasonably low to aim properly? Is the anti-drone only effective against suicide-drones?",
            "But If you ran out of APCs, have only useless tanks left and Major General Ivan wants the next assault to start at dawn?",
            "I mean it does work very well when executed correctly, in terms of achieving military objectives.\n\nI don’t think it’s nearly as scary as it used to be before the advent of cheap drones though.",
            "> anti-drone tech\n\n> tech\n\nIt doesn't actually have either of those things.",
            "Afaik, drone dropped munitions disabled it track, not Fpv drones we normally see. Which mean, the drone flying high enough to avoid Ecw interference & and being able to dropped let say, shrapnel warhead right to tank tracks side.",
            "> But with the tank having anti-drone tech, how did the drone come close enough?\n\nIn order to disrupt a signal, you need to be louder then the signal around it.\n\nSo if a drone gets close to a ECM, your overwhelming the frequency that it MAY be operating on, so any incoming or outgoing signals get disrupted.\n\nBut disrupting a signal is a game of power. And power is linked to how many watts you can put out. So lets say a signal can be 95% disrupted at 5m, with 400W (made up numbers). But at 10m, your efficiency drop link a brick to maybe 20%. So how can you disrupt something at 10m, well, maybe you need to output 4000W of signal strength to overwhelm. But at 15m ...\n\nThe more distance, the more power you tend to need to disrupt signals. So if a drone flies 25m over your head:\n\n* You need a insane amount of power to get 360 degree, coverage\n* That drone is also flying high, so less thing that will be blocking its return signal to home base (like trees etc). So any jamming will be even less efficient, vs a already compromised signal that has issue with geography and obstacles. \n\nSo again, jamming helps against FPV drones and even that can be overcome by drones if for instance they have a \"dead man switch\". Aka, where you tell a drone to fly by a set of predefined instructions. You move in for a kill, set the drone into \"dead man mode\", and if you lose signal, the drone will keep flying into the previous direction. And there goes your ECM! \n\nWe know Ukraine is already doing this with bigger drones, with simple \"AI\" to recognize targets (if it loses signal).\n\nReality is, ECM has a use but there are counters against it. You may lose accuracy but still get relative good hit rates using inertia or other old fashion \"speed * distance * travel time * ...\" calculations.\n\nNow there are other forms of ECM but they are not relevant to this tank ECM stuff (GPS spoofing etc).\n\n>  Like being high-enough over the tank to not be affected, with reasonably low to aim properly?\n\nPeople have gotten very good at dropping from high altitude. Lots of experience means a operator can \"guess\" very well where something will fall. The closer you are, the more accurate but you will be amazed at how high drones drop.\n\nSure, ECM will mean that you need more attempts to take out a target, less of a issue with reusable drop drones. So the main benefit is disrupting those RPG7 FPV drones. But we have seen footage of drone operators literally guessing, slamming the drone forward, it getting disrupted (video feed becoming a massive mess) and still hitting. More difficult yes, more drones needed to take out a target, yes. Ultimate protection: Hell no! Far from it.\n\nAnd the issue is, that a RPG7 drone is literally a warhead where they have huge amounts off, and a cheap 200$ (if even that these days) drone (even less because a lot are 3d printed these days, with simple electronics and a strapped on battery pack). That ECM is going to be WAY more expensive... In the cost war, its a loss.\n\nIts those big ECM platforms, that can disrupt entire areas that are a issue, but those can also be geolocated back and Mr Himars tend to say hello. Or they figure out what frequencies it jams, and modify a few drones to operate on other frequencies and go say \"hi\". Again, power = range, but the more frequencies you try to jam = more equipment + power needed. So its a cat and mouse game of switching frequencies between both sides to get the best value out of ECM or Drones.",
            "😅 yep this thing is the antithesis of 'tech'"
        ]
    },
    "They laid down their lives for Ukraine & Europe! RIP - Maksym Zinevych (25), Vasyl Miovkanych, Valentyn Perevertailo, Mykola Kitseliuk": {
        "title": "They laid down their lives for Ukraine & Europe! RIP - Maksym Zinevych (25), Vasyl Miovkanych, Valentyn Perevertailo, Mykola Kitseliuk",
        "score": 564,
        "url": "https://www.reddit.com/gallery/1dlqdtj",
        "content": "https://x.com/euromaidanpress/status/1804365696455053570?s=46",
        "num_comments": 11,
        "comments": [
            "\nПривіт u/Snsetoverdi ! During wartime, this community is focused on vital and high-effort content.  Please ensure your post follows [r/Ukraine Rules](https://www.reddit.com/r/ukraine/about/rules) and our [Art Friday Guidelines](https://www.reddit.com/r/ukraine/wiki/artfriday).\n\n**Want to support Ukraine?** [**Vetted Charities List**](https://www.reddit.com/r/ukraine/wiki/charities) | [Our Vetting Process](https://www.reddit.com/r/ukraine/wiki/charities-vetting)\n\n**Daily series on Ukraine's history & culture:** [Sunrise Posts Organized By Category](https://www.reddit.com/r/ukraine/wiki/sunriseposts/)\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/ukraine) if you have any questions or concerns.*",
            "God bless you lads 😢",
            "Rest in Peace. Thank you to these people and all the others.",
            "Deepest Condolences & Sincerest Sympathies for the Families, Friends, Comrades & Country People of Maksym, Vasyl, Valentyn & Mykola from the people of Northern Ireland.\n\nWhen you go home, Tell them of us and say, For Your tomorrow., We gave Our today.\n\nGlory To Ukraine 🇬🇧🇺🇦🇬🇧",
            "Слава Героям",
            "I am sorry for your loss",
            "🕯️",
            "💔💔💔💔",
            "Heroyam Slava.",
            "RIP heroes, 🇺🇦❤️😢🇺🇦"
        ]
    },
    "The Netherlands, together with an unnamed country, will supply Ukraine with Patriot system": {
        "title": "The Netherlands, together with an unnamed country, will supply Ukraine with Patriot system",
        "score": 408,
        "url": "https://mil.in.ua/en/news/the-netherlands-together-with-an-unnamed-country-will-supply-ukraine-with-patriot-system/",
        "content": "",
        "num_comments": 20,
        "comments": [
            "\nWe determined that this submission originates from a credible source, but we still advise that users double check the facts and use common sense when consuming mass media. If you are interested in learning how to evaluate news sources more thoroughly, you can begin to learn about how to do that [here](https://tacomacc.libguides.com/c.php?g=599051&p=4147190).\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/ukraine) if you have any questions or concerns.*",
            "Funny thing is that Putin seriously believes that he can break the West simply by wasting hundreds of thousands of Russians as cannon fodder. \nBut the reality is, as it has always been (think of WW2), the West in general is slow in responding, but once the wheels get turning, the shit start flowing backwards right into the face of old Vlad. That is what we witness now happening. I wish I could see a Nurenberg-style trial with old Vlad sitting on the bench in handcuffs, but this, unfortunately, is extremely unlikely to happen. Some of his cronies will definitely end up there, but too few of them and too late.",
            "It's ROMANIA!\n\nNot an unnamed country :(",
            "Un-name everything. Leave Russia guessing",
            "Part of me kinda hopes for a more Gaddafi-esque ending. \n\nDragged out of a hole wetting himself, and getting his shit kicked in by a mob. \n\nThen of course a quick trial and hanging. Hell, I’d slip the hangman a tenner to make the cunt suffer properly. \n\nAlthough, seeing him be broken in The Hague has a hell of an appeal too",
            "The combined GDP of US and EU is around 45 trillion dollars vs 2 trillion of Russia. Somewhere it's just a numbers game. ",
            "No no, it's unnamed. Romania supplies no military aid to Ukraine! It is known \\*wink",
            "No, this an additional one. The system donated by Romania is mentioned by the Dutch defense minister as well and its clear from her words that this is not the \"unnamed country\".",
            "arent those 2 seperate systems? one from romania and this one?",
            "🙂\n\nI can't really think of a fair punishment for him to be honest. Execution is pointless, lynching too, but putting him in jail is also not harsh enough punishment. Problem is, you see, that his country will pay for his crimes, mostly people who had nothing to do with all this shitshow...",
            "Yeah, but if I come to think of the funny German painter, these sort of people do really believe that they can take on the whole world alone. There's a saying that history repeats itself, and boy what a big truth that is. Only thing is that some people fail to learn the lessons of history. Putin, despite of otherwise being a well educated man actually, is just committing that mistake. Prime example why nobody should be allowed to spend more than two terms as head of a state, just like in the US. Power distorts personality, mentality, the way of thinking and creates a false sense of invincibility. Especially uncontrolled power, where thee are no brakes, no nothing to hold one back from doing whatever he/she wishes with an entire country and it's people..",
            "Where are the crowds of Russians chanting “no more attacks on Ukraine”?",
            "You just hang him and be done with it. Public trial, convict him for his crimes, hang him. It's not about punishing him most fittingly in a way that he adequately pays for his crimes, it's about showing that justice prevailed.",
            "Feet first into a wood chipper. 1” a day, and the blades are coated in salt & haemostat",
            "We got lucky that the Russian system is as corrupt as possible. Putin is surrounded by yes-men, thus his reality is distorted. But he makes some great mistakes, also the energy wat with the west, he thought he could use it to win, but the west called his bluff and found other ways to get energy. Making his energy weapon useless.",
            "There were at some point, there was plenty of media about it. Not all Russians are orcs that many of us like to think, and I am by no means defending them by saying this. But being the leaderless, decentralised bunch that they are/were, the sane part of society stood no chance against the maniacs. And the indifferent part of them is just minding their own business, going about their eveyday lives, because meddling in politics in Russia, unless you do it in favour of Putin, is a sure way to book yourself into a prison, an insane asylum or a graveyard. Or simply just fall out of a window, which is trending in Russia lately.\n And in a way I even understand it, as this is how they've been for so many decades during communist times, so it's probably in their DNA already...",
            "But then you could simply let him live on as an Average Joe. Kind of as a living proof that good always prevails in the end, no matter how hard the dregs of society try.",
            "True. Biggest mistake he made that he thought that the West, for whatever reason, fear, greed, indifference, etc, will stay silent as they did when he grabbed Crimea back in 2014. Which is a shame of modern history. But grabbing the entire country is a whole different thing, especially a country that has fought so hard to get rid of Russian dominance and average people literally shed their blood on the streets for that. The shitfuckery the West does about helping Ukraine is still a shame, but at least the wheels are already turning and as I said before, the shit is already flowing backwards into Vlad's face, though that's little consolation to the millions displaced, killed, wounded, disabled by this war.",
            "Nah can’t leave him alive. Best thing for everyone is bullet to the back of the head. No need to drag it out, have a percentage of all countries yell about how it’s wrong and he isn’t that bad ect ect. Once he is dead and Ukraine is free people can move on to what is next. If he is alive there will always be that fear of him having influence or god forbid power again one day.",
            "I think Crimea was a wakeup call for the west. After the invasion the US started under Obama to support Ukraine with non lethal support. Eventually training the troops on western war doctrine. This resulted in a better trained troops that went into the 2022 conflicted compared to 2014. This was already a smart move from the west. Hopefully they will fully support Ukraine for the rest of the war in order to finally stop Putin colonial ambitions."
        ]
    }
}