{
    "Marc Whitten (CPTO) quits Unity": {
        "title": "Marc Whitten (CPTO) quits Unity",
        "score": 254,
        "url": "https://mobilegamer.biz/marc-whitten-quits-unity/",
        "content": "",
        "num_comments": 81,
        "comments": [
            "He was a prominent advocate and designer of the installation fees. Following that debacle, it became evident that Unity required a change in leadership.",
            "#The best part of this article \n\n>One major partner apparently said “Fuck you, we’re not paying” to Riccitiello in a meeting over the fee.",
            "First big thing incoming CEO Bromberg does is show the door to the poor-track-record-holding product & technology head, very positive news!",
            "Is it a good thing for unity ?",
            "Pls I want my game engine to heal!!",
            "[deleted]",
            ">On May 13, 2024, Unity Software Inc. (the “Company”) announced that Marc Whitten will resign as the Company’s Chief Product and Technology Officer, Create, effective as of June 1, 2024 (the “Transition Date”). Mr. Whitten will assist with the transition of his responsibilities and has agreed to continue serving as an employee until he departs from the Company, effective December 31, 2024 (the “Resignation Date”).\n\nFrom the 8-K SEC filling [https://investors.unity.com/financials/sec-filings/sec-filings-details/default.aspx?FilingId=17534160](https://investors.unity.com/financials/sec-filings/sec-filings-details/default.aspx?FilingId=17534160)",
            "Great news",
            "Great",
            "Quits? More like house cleaning.",
            "A big step in the right direction. Marc damages every product where he is in a leadership position. He is Unity's biggest problem.",
            "I don't follow leadership at any company a lot.\n\nMy gut feeling is a senior tech artist and/or veteran Indie/AA game developer should be somewhere around the board or management level.\n\nI mean as if a bit of John Carmack or Tim Sweeney would exist here, a smart game tech developer and strategist as a big part of their skills and thinking.\n\nMaybe they exist right now and are just completely stuck in politics, mostly invisible and unheard of, or avoiding the circus (resting a lot enjoying the salary + equity). :D\n\nAnyway, I think it is going to get better, if the game engine focus is a thing for a decade or so again.",
            "Unity will probably strategize for mobile as first class citizen unfortunately. Other areas are much harder to compete against unreal or specific engine.",
            "What a shit show",
            "His role was to be here until they find the new guy. If he quits, that mean Unity will have a new face soon",
            "[deleted]",
            "He's served his purpose, introducing the fees. And gets to walk away with an extra $800k on top of whatever he's already earned from salary and stock.",
            "Wasn’t he the white knight guy?",
            "sounds like Facepunch",
            "wish theyd actually fired him but w/e",
            "probably good. Dude was hired under Riccitiello's tenure, Unity needs to purge every exec and VP that was hired or promoted during Riccitiello's management.",
            "Yes, he basically designed the whole install fee bullshit",
            "Absolutely ",
            "Unity has around 500m in operational costs. 150m of those are payments to 5 c level execs including Marcyboy This is a good thing",
            "I'm guessing it's bad.   Either he didn't want to be there or they don't want him.  Unity being the fresh turd it has become, him not being there means he's not a good fit for the shit.",
            "Management does not quit, they always only resign with a giant bonus for all the great work they did. Like alianatingntheir customer base or dropping the stock value immensely.",
            "Absolutely should have fired him for cause. Instead they are paying him millions of dollars to \"quit\".",
            "This guy, Marc Whitten, is going to be paid 815,000 USD for 6 months of \"advice\". I wonder how many games he's made in Unity to be able to give advice worth nearly a million dollars? Does he even know what a prefab is?",
            "Why do you say that? Nothing about this post points to anything even remotely like that. Unity is crushing Unreal still in the PC gaming market, as well as on Switch. I don't know the Playstation market well enough to comment on it really, but afaik in-house engines are dominant there. \n\nUnreal is really pretty niche compared to Unity, all things considered.",
            "unity has over 70% of the desktop games market",
            "You're confusing him with the CEO, who was already replaced and the interim CEO moved up to the board.",
            "100%. Now if they somehow get co-founders David Helgason and/or Joachim Ante to come back in key roles, this company will turnaround hugely",
            "Uninstall fee :(",
            "garry rocks",
            "Thanks for your input",
            "what does unity do? I have $4000 of stock, now worth $2700. Looking for some guidance on whether this company does anything important.",
            "Holy crap...",
            "Their operational expenses in 2023 were around $3 billion. \n\nhttps://www.alphaquery.com/stock/U/fundamentals/annual/operating-expenses\n\nThe compensation for the top people was around $90 million, over 90% of that in equity. \n\nhttps://www1.salary.com/Unity-Software-Inc-Executive-Salaries.html\n\nThis isn’t even close to being correct.",
            "Not true",
            "Thanks for the reply",
            "Work in a school district, same. High management isn't fired, they \"step down\". I understand the strategy and optics of it, but let's not get it twisted.",
            "Unity has a serious problem with putting executives on \"garden leave\" like this. There are a number of executives who haven't even officially quit yet, but no longer have any direct reports or any responsibilities. Unity is paying these incompetent leaders millions of dollars just so the former leadership cabal doesn't lose face. As an investor, albeit a minor one, in the company it is fucking infuriating.",
            "what a dick to get paid that much",
            "I agree that there are far more Unity PC games, but Unity doesn't make as much money from them. They get the premium Unity subscription fee and that's about it.\n\nThe real money is in all the additional services that Unity offers, like ads and in-app purchases. Which are most only found in mobile games. That's why Unity is an $8 billion company.",
            "The majority of devs won't switch engine mid-project, so the effect of the last year or so's events probably won't be seen for some time yet.\n\nThe real question is whether they will start *new* projects in Unity following the runtime fee debacle, wave after wave of redundancies, and the tech remaining fairly stagnant.",
            "Unity is dominant in mobile market, not pc. Hence why they chose a new CEO from mobile game background. Majority of large budget PC games uses UE or inhouse engine.",
            "The number will go down, thrust has been lost, Unity has a serious competitor Godot 4 and Brackeys make Godot tutorial that will reach millions of views.",
            "Ah yes indeed ! My mistake sorry",
            "I love gary. His blogs are awesome too.",
            "Unity's mission is to provide the industry standard in the field of pissing in your own pool. Unity leads the way in shitting the bed and specializes in embedding projectiles autopodiatrically.",
            "Unity makes games, that is entertainment, it doesn't do anything important. If you are looking to sell you can wait for the Unity 6 launch, that should give a small boost to Unity stock and should be the peak for a long time. Otherwise you will have to wait a few years for the market to recover. Games is in a bad place right now.",
            "Wait for Unity 6 launch then sell, the company killed any confidence people had on its future.",
            "My opinion is either long hold for redemption story (reasonable monetization of the engine) or stagnation.\n\nI don't see any significant gains in 4 years horizon, especially with visibility that Unreal and Godot have at the moment.",
            "thank you for fact checking.",
            "I believe that's partly why they added the new 2.5% royalty.",
            "But unity doesn't control these. Anyone can build an ad service sdk to display their own. \n\n\nUnity's may be first choice for most devs looking for an easy solution, but successful games will replace it. That's why they introduced the new pricing model.",
            "We can speculate about the future, but only time will tell.",
            "Most PC games aren't big budget though. Plenty of PC games still using Unity.",
            ">Unity is dominant in mobile market, not pc.\n\nMost games on Steam are made with Unity. Several of the best selling games of all time on PC/Steam are made with Unity. Unity is definitely dominant on PC as well, it's market share dwarfs UE on PC.",
            "yeah sure.",
            "Looool Godot compared to URP??? Lmfaooooo you a 2d boy for sure",
            "S'all good, my god we had a positive interaction on reddit lol",
            "unity does not make games and that's the problem.",
            "[https://www.youtube.com/watch?v=BnE8GqyB\\_bc](https://www.youtube.com/watch?v=BnE8GqyB_bc)\n\nOne Unreal game like this is easily 1000 - 10000 indie pc game with Unity in term of budget. This is the point im making. Unity is not dominant in pc market compare to mobile market (where high budget games like Genshin Impact, COD mobile, and a lot of gacha games are made with Unity)\n\nEdit this comment here because most people seem to misunderstand how the market share works.\n\nWhat metrics do you calculate market share ? By [Investopia](https://www.investopedia.com/terms/m/marketshare.asp), \"Market share is calculated by dividing the company's sales over the period by the industry's total sales over the same period\".\n\nThe keyword is sales, not title made by Unity. How many of 10.000 indie games that can cover enough license sale for Unity (by either the old term vs new term) compare to %5 revenue before tax of a high budget tripple A made by Unreal engine ? The number is significantly low, you can view this [report](https://www.gamedeveloper.com/game-platforms/what-can-we-learn-from-the-1-600-highest-earning-indie-developers-on-steam-).",
            "And what metrics do you calculate market share ? By [Investopia](https://www.investopedia.com/terms/m/marketshare.asp), \"Market share is calculated by dividing the company's sales over the period by the industry's total sales over the same period\".\n\nThe keyword is sales, not title made by Unity. How many of 10.000 indie games that can cover enough license sale for Unity (by either the old term vs new term) compare to %5 revenue before tax of a high budget tripple A made by Unreal engine ? The number is significantly low, you can view this [report](https://www.gamedeveloper.com/game-platforms/what-can-we-learn-from-the-1-600-highest-earning-indie-developers-on-steam-).",
            "Voxel Global Illumination and reflections with Filmic, volumetric fog and MSAA gives a good render.\n\nFor open worlds dynamic GI the current SDFGI will be replaced soon by HDDAGI and will fix the dark spots: [https://youtu.be/9Dj9lvBkY-o?si=MkTxYstuYHNcr5wb](https://youtu.be/9Dj9lvBkY-o?si=MkTxYstuYHNcr5wb)\n\nAlso it is very optimized for low end computers.",
            "I think you mean Unity doesn't publish games, or make AAA games? Because Unity does make a lot of indie style example games.\n\nBut honestly if that is what you want from a engine then just use Unreal, it exists, doesn't make sense to turn Unity into Unreal when Unreal is an existing engine with more developer friendly terms than Unity.\n\nPersonally I use Unity because it is indie friendly, and Unity is that way because they don't make AAA games and I personally hope that in the future Unity will continue to make indie games their focus. Would I like if they made a indie game, published it, then made the source project available, sure. But I don't think Unity should chase Unreal. Many developers don't use Unreal.",
            "What a dumb take. \"10,000 times more in budget\". What does that have to do with how dominant Unity is? \n\nMore than half of games coming out are made with Unity. Thousands of games. The last few months alone included huge hits like No Rest for the Wicked or Prince of Persia Lost Crown. Heck, Vampire Survivors alone is several magnitudes bigger than that game you linked. If you look at the top 1000 best selling games on PC I bet more than half are made with Unity.",
            "When people use the word \"dominant\", they're normally talking about market share.",
            "You can use funny word games to try and define stuff however you want. I am talking about market share as in how many players play Unity games vs Unreal ones.",
            "Oh damn that’s built in to godot?",
            "I think more accurate would be that it is primarily a tool with which to make games",
            ">Unity does make a lot of indie style example games.\n\nlittle toy projects that could never scale to an actual game. plus they are developed in one version of Unity and then still throw errors even in that version of Unity. don't even think about opening one of these projects in a different version, it won't even let you enter play mode due to all the breaking changes. there is no comparison in effort or approach between a game and a little toy prototype.\n\nI don't care about AAA production values at all, that's not related to my point. I agree that Unity should focus on being the best engines for small studios.",
            "Copy from my other reply when talking about market share. You need to look at this from how an engine maker makes money, not from developer's perspective.\n\nWhat metrics do you calculate market share ? By [Investopia](https://www.investopedia.com/terms/m/marketshare.asp), \"Market share is calculated by dividing the company's sales over the period by the industry's total sales over the same period\".\n\nThe keyword is sales, not title made by Unity. How many of 10.000 indie games that can cover enough license sale for Unity (by either the old term vs new term) compare to %5 revenue before tax of a high budget tripple A made by Unreal engine ? The number is significantly low, you can view this [report](https://www.gamedeveloper.com/game-platforms/what-can-we-learn-from-the-1-600-highest-earning-indie-developers-on-steam-).",
            "And what metrics do you calculate market share ? By [Investopia](https://www.investopedia.com/terms/m/marketshare.asp), \"Market share is calculated by dividing the company's sales over the period by the industry's total sales over the same period\".\n\nThe keyword is sales, not title made by Unity. How many of 10.000 indie games that can cover enough license sale for Unity (by either the old term vs new term) compare to %5 revenue before tax of a high budget tripple A made by Unreal engine ? The number is significantly low, you can view this [report](https://www.gamedeveloper.com/game-platforms/what-can-we-learn-from-the-1-600-highest-earning-indie-developers-on-steam-).",
            "so in your \"unfunny\" word, you can make your own definition of what a business market share is, regardless of how the business world defines it ?",
            "Yes, but I don't understand, you wanted to compare graphical features without knowing the latest technologies of Godot...",
            ">little toy projects that could never scale to an actual game.\n\nWhat is an \"actual game\" to you? Is it even something that can be made by indie developers? Because Unity has provided many samples of games, even a nearly completed Opensource game to learn from. Unity also provides the most detailed documents out of any engine, and they provide the most learning recourses.\n\n> there is no comparison in effort or approach between a game and a little toy prototype.\n\nSure but how much of that is the engines responsibility? Is Unity suppose to do everything, maybe make a game in every genre then publish it to the store so everyone can make asset flips?\n\nI mean the Unity pro fee is less $200 how much of a game would you develop for someone if they told you that they will pay you less than minimum wage per month? Wait no, Unity gives it's learning resources and manual for free.\n\nAll I am asking when is it time for the developer to put in their effort? Or is it that Unity should instead focus on AI or some other tool that will just save developers from doing their part.",
            "You started babbling about revenue when sales usually refers to units sold. You can't even get your own argument right.",
            "Maybe business talks is not the right topic with you. Unity or Epic Games as a engine maker business, they get revenue through license sales (both unity or epic has other businesses as well, but that is not a topic here).\n\nSo for PC market share, if you want to calculate it, you need to calculate how much license sale/revenue that they can make per game title that uses the engine. 10.000 indie game only has less than 10% of titles that make more than 100k (this is the milestone where you need to pay Unity). One triple A game alone, with 5% of their game's revenue going into Epic games as a license's revenue can easily outnumber license sales from Unity for 10.000 indie games.\n\nThis is why Unity does not dominate the pc market share, compare to the mobile market, where there are a lot of gacha games made by Unity, that generate a lot of license sales for Unity since the game developers make a lot of money.\n\nOne last thing here, since you never care to learn the actual definition of business word, sales do not refer to unit sold. Sales in general can be roughly viewed as revenue. In short, sales != unit sales.",
            "The conversation was never about Unity or Epic games as companies or how well they do financially. This entire discussion was about who has the biggest market share on PC/Steam in terms of users of games made with their engines.\n\nBringing in the revenue the companies behind said engines gross is completely irrelevant to that."
        ]
    },
    "Major Nelson is joining Unity": {
        "title": "Major Nelson is joining Unity",
        "score": 94,
        "url": "https://www.theverge.com/2024/6/17/24180241/major-nelson-larry-hryb-unity-community-xbox",
        "content": "",
        "num_comments": 51,
        "comments": [
            "This could be interesting.  Clearly, Unity still has an image problem.  My biggest concern will be if this is just to make things look better, or if it will actually result in positive change.",
            "Yeah we all like Major Nelson but its never been super clear what he contributes besides being a hype man. I will say he's had good commentary on the gaming industry since leaving microsoft so it seems like hes got the right ideas but like I said idk if theyre paying him to take his advice on the direction of the engine.",
            "I used to listen to Major Nelson way back in the mid 2000s and enjoyed his Xbox coverage.  I can see him being a good fit for Unity, provided Unity really steps up in a major way.  I say this as the value of their engine right now as compared to the free open source options is more or less the same for flat screen games and even XR soon with Meta currently working on extending their XR SDK to Godot.  If Unity seriously delivers features and functions that speed up and make my development easier and justifies their fees, then I am ready to listen to Major Nelson again, but if Unity is going to continue to milk their engine while not being better than free options then I am moving to Godot as soon as the XR SDKs are available.  It is in your court Unity and slick marketing is not what will keep me in your engine.  I wish Larry all the best at Unity.",
            "Saw the activity on Twitter surrounding this, lots of optimism and positive energy:\n\n[https://x.com/majornelson/status/1802723522986536967](https://x.com/majornelson/status/1802723522986536967)\n\nHere's a retrospective on Major Nelson if anyone is curious, this guy was integral to X-box gaming for over a decade:\n\n[https://www.youtube.com/watch?v=Ey2oaHGyKN0](https://www.youtube.com/watch?v=Ey2oaHGyKN0)\n\nNice to see more and more positive energy surrounding Unity and a desire to get back to basics. Larry's acquisition is just another example. More focus on features, more focus on competency, more focus on a positive image developers can believe in.\n\nHere's a video of Larry taking the heat from Angry Joe:\n\n[https://www.youtube.com/watch?v=6RtSGFryKwo](https://www.youtube.com/watch?v=6RtSGFryKwo)\n\nHe's a bit corporate, but in the traditional sense. I doubt we'll be seeing more insane runtime fees trying to cover the cost of 5k employees with undefined jobs or futures. This is an improvement over the nonsensical decay we've been seeing within Unity the past several years. And you can't say this guy isn't willing to take the heat and have direct conversations with people, it takes some balls to let a YouTuber like Angry Joe unload on you with neckbeard fervor. Larry is a real one and you can tell from this interview he takes pride in his job, his company and will take the heat to stand up for those things.\n\nBetween all these picks for top roles of late and so much positive gains happening with Unity 6, getting a lot of confidence back for the future of this company. Who knows if this engine ever soars again in the future, but for now, just stoked to see they are stemming the bleeding. It's like waking from a bad dream.",
            "Hello all! I am excited to join the Unity team. I am not here just for looks - I am here to help change. Hit me on DM's if you don't feel like asking me anything in a public forum and I'll do my best to answer.",
            "It seems that this role might be similar to the one that he took with Midwest Games as the \"Advisor For Communications\".  I think they are doing better partially because of him, but I don't follow the company that well.  One thing that I do know is that he seemed to always be someone who was down to earth with gamers in general and those that met with him personally had good things to say.  So, fingers crossed.",
            "So are we going to need to talk to Major Nelson now when Unity once again sends us an email saying that we need to upgrade our license for nebulous reasons and then they ghost us when asking for clarification?",
            "This is bad bad bad Bad BAD.\n\nI mostly guarantee that Microsoft is aiming to aquire...\n\nThe deal is probably already done and its just a matter of thinning the herd.\n\nHow so?\n\nLook back at what happened to Nokia.  Once a former MS exec joins in, it isnt long before more show up until the reins become held by MS.\n\nI call it now...  Unity will be consumed by Microsoft.",
            "From a recent game jam I was a part of, a HUGE percentage of games are now being made in Godot. Not sure how that impacts Unity necessarily, but the movement away from Unity is actually very palpable.",
            "Larry is a PR guy. they're obviously doing it for image reasons. having said that, i really like Larry going back to the xbox 360 launch days.",
            "Unity dosnt have an image problem, unity has a structural problem",
            "What you saw of me at Xbox was a lot of the external facing work - I did a ton of stuff that no one saw in terms of connecting community back to the product team. I plan on doing that on a grander scale with Unity.",
            "100% in agreement.  Deeds, not words.",
            "I will try to be less corporate. Coming from MS to Unity is a big change and one I am here for. So much work ahead, but I can say I am excited by the things I have seen. EVERYONE at Unity is excited about the future, and that's why I am here.",
            "There are only so many things they could be doing right now to fix their image/trust problem.  This is a step in the right direction and hopefully the first of many.",
            "It's great to see!  After a few decades of development work (mostly in the Microsoft universe), I switched gears to working on a game with a small group.  We decided to choose Unity as a platform due to the type of games we were going to make and the easier learning curve, as we had just come from a predominantly C# programming life.  It's been a great learning experience.  That said, the bad Unity decisions really left us questioning what the future of our gaming development would look like.  We are all hoping that things improve and better decisions are made.  I hope you can help bring about that change.  The fact that you are responding to this thread gives me a lot more hope.  I am looking a lot more favorably towards the future of Unity game development now.\n\nThank you and I wish you and the Unity team luck.\n\nEdit: spelling",
            "\"Mostly guarantee\" is a funny way of saying \"I have no fucking clue\".",
            "Rather than the classical statement of \"Microsoft bad,\" I think if Microsoft is interested in acquiring unity, this can lead in many situations from ultra optimistically good to super idiotically bad.\n\nFirst, if ms is interested in buying, there's an 85% chance of success for him. The main question will be why they would want to acquire unity? And it can be simple. They need to have new good games that sell, not only have the property of big ips. And maybe the fast, secure, and promising way to achieve this is having the property of the engine that can make literally any game in the market. \n\nAnd this can be really good or really bad, it can be good in the way that if it happens it means that it's the last chance of Xbox to have financial success. So that means that they will make all good with their fucking brains to not shit on unity. And the other hand they will having a mental stupid breakdown and make hilarious decision more stupid that the install fee of Jhon Riccitiello.",
            "It definitely makes sense. Unity has long since not been the most ideal engine to make tiny, lightweight proof of concept type of games you see on game jams. I prefer Unity since I'm familiar but the competition is welcome as always.",
            ">the movement away from Unity is actually very palpable.\n\n Game jams feel more like a sport than a reflection of the state of Unity",
            "I do wonder what the number is for the non-hobby crowd.\n\nPivoting engine quickly doesn’t seem like something most companies who invested resources in their pipeline would be very happy to do.\n\nSo , I could be wrong, it might actually be a non-issue for unity as most of their real customers are still with them. (I would need some insight in their numbers to back this up, just my speculation rn)",
            "I noticed this too but they also didn't look anywhere near what previous years were aswell. I feel like Godot is still too far behind to allow the fidelity that unity has been able to offer from the get go. But that's just me.",
            "clhave you tried making games NOT for pc olwith godot?\n\n💀💀💀",
            "They have an image (and trust) problem right now, so this makes a lot of sense.  They need to back it up with changes that make a positive impact on the developers and the gamers that play their games.  Let's hope they do that.  It will benefit the industry overall as well.",
            "I agree.  I think one creates the other.",
            "Are you really Larry?",
            "And corporate isn't a bad thing. This industry needs some old school sensibilities back before it implodes under the weight of its \"virtues\".",
            "Great to hear. Here's to that excitement turning things around, it's good to see more engagement from you guys out in the wilds.",
            "Thank you. Everyone I have met is committed to the users.  That’s what attracted me to Unity. I’ll do my best !",
            "Ye. I can't imagine why they'd want unity. \n\nAnd I think they'd be better served to use one of those instead. They have close to every genre within their game studio lists, with close to all having different propertery engines",
            "I can see a lot of reasons why Microsoft might want to buy Unity.  I remember all of the buzz about that being a possibility when  John Riccitiello was, thankfully, shown the door.  However, I think there will be a lot of legal hurdles (antitrust) for them to actually acquire it.  Maybe a deeper partnership?  I am not sure how that could work.  Maybe more Unity Cloud development with Azure?  Maybe partnering to expand their own store offerings to compete with Steam/Epic by making it easier to get games from the development stage into the Microsoft Store?",
            "Game jams are where people experiment. If it works, then people are more likely to use it in a professional context.",
            "I like to remember that Unity were the guys that essentially democratized game development. An engine with good support that was essentially free to use. They built their reputation on that, and it's the small, independent, and hobby developers that made Unity the household name it is (in gamedev households at least lol). Even today if you were to ask the question: what major/AAA games are made with Unity? It gets hard to answer after a few games and you start talking about games fewer and fewer people know. So where does that leave them? Not really hitting it in the big time, but alienating their core users? So is it industrial design now? Is it ads? I'm not sure even Unity knows the answer anymore, which is why I said they have an identity crisis. Godot on the other hand is welcoming in new devs with open arms. I'm hopeful for Unity 6 and just downloaded it last night to try a new project in. I'm especially keen to see if they've made web games less heavy as even their own research as highlighted the pivot to these types of games. We'll see.",
            "I've never used Godot and have always stuck with Unity, but where they were probably the engine for 80+% of games in a given jam, I think that number is trending closer to 50% now, which just means the spell Unity had on developers has been broken and people are now exploring the field.",
            "Yes. Yes I am.  Why?",
            "There are no anti-trust issues with Unity acquisition by Microsoft. There's at least one very large competitor (Epic Games, Unreal Engine) and several smaller ones, even Crytek could realistically be a competitor.",
            "XR",
            "There is definitely a trend away from Unity and particularly to Godot thanks to the major boneheaded decisions by Unity's management, all of the bad press, the jump by those who people follow (streamers, content creators, etc.).  Brackey's being a prominent one.  I think that, after a time, the negatives can be healed, but it will take effort.  Hopefully, this is a step towards that and not just trying to quickly put a bandaid on a bad situation.  Real change and honest dialog with developers and gamers need to happen.",
            "people have always been exploring ... \n\nand then always coming back 🫴",
            "Oh wow, for me personally, it's good to have you on-board. I listened to your podcast back in the day and the way you engaged with the Xbox ecosystem and gamers as a whole was really nice, especially for someone so high up the ladder. \n\nMind if I ask, can you share any details on how you plan to engage with unity developers in your new role?",
            "I think the idea is that people would get worried after Microsoft bought a gaming development software that builds games for multiple types of platforms and how some favoritism of their own might get worked into it.  If Sony bought the Unreal Engine I could see similar concerns.",
            "100%. i like godot and I'm using godot for some current projects but to suggest that it's ready for all developers is a lie. it's better than Unity in some ways - specifically, I really like GDNative as a concept. i have friends who are using Rust in Godot and having very few issues, which is pretty cool.\n\nbut - the big issue I have with Godot isn't that it's missing features, but that it's so blindly in love with it's pure OO and tree based model that it absolutely kills your iteration time. for example - I wanted to add a Rigidbody which uses a box as a collision mesh\n\nUnity: right click -> 3D -> cube -> Add Component -> Rigidbody ->  Add Component -> Box Collider -> Done\n\nGodot: right click -> add node -> Rigidbody3D -> add child node -> CollisionShape3D -> add the shape to collision shape -> add new child node to RB -> add mesh instance -> add box mesh to mesh instance\n\nThese *might* sound similar but, the Godot workflow here is significantly longer - and, that's just... how you're expected to use the engine.\n\nUnity is also soo much better when it comes to building custom tooling, or extending the Editor - we like to dunk on UGUI / UI Toolkit existing at the same time, but, it is just... better.\n\nAs for game jams - Godot probably *is* better for game jams right now though - and that's just because GDScript having hot reload is very good for iteration time, whereas Unity is still stuck with Mono's slow domain reloading (until Unity finally moves to CoreCLR).\n\nFundamentally - my opinion is that Godot is a wonderful engine if you're a programmer who is really in love with OO, but, if you're not a programmer, or you want to delve outside of something the Node world can represent, you end up in a world of hurt.",
            "Yeah, makes sense. Happened with me. I tried Godot, but for what I wanted it was still too unstable. It corrupted my files after moving some resources 3 times! The first two I thought it was me, but now I'm just waiting for 4.3 stable to try it out again. Still a fun engine to use and toy around with, but I went back to using Unity for my larger, long term project, without regrets",
            "Not this time I'm afraid. Unity is in trouble with small/hobby/indie devs and I don't think it's an exceptionally popular engine in triple A either. So anyway the point is they have a bit of an identity crisis at the moment and need to figure out what they are offering to who. The move away from Unity, in my opinion, has never had at much momentum at it does now. Even Brackeys is pushing Godot. This is probably at least partially what's motivating the changes happening at Unity.",
            "It’s a bit too early to tell. It’s not a one size fits all approach. I need to poke around and see what’s what first :)",
            "As someone that's getting into gamedev from software engineering, Godots work flow is very intuitive and clear.\n\nIt is unfair to say Godots workflow is significantly longer when it's about 3-5 seconds added. Compare that with the hot reload from script to run vs waiting, sometimes minutes, for changes in the script before you can use the editor in Unity and then you have a significant loss in time.\n\nI started my gamedev journey about 9 months ago and started with Unity. Loved it. But after using Godot for a while, it's just what works for me ATM (mostly cause I don't like clicking around so UE is not my cup of tea as I'll much rather use Blueprints than C++ with those compile times). Unity is great but Godot suit my needs better and seemed more intuitive to me (also it's age does show but with that comes less distractions with multiple things I don't need)",
            "Brakeys is nothing man 💀 ... it is honestly cringe to see so many developers and influencers ENABLE this in their audiences, not for the good of godot or gaming, but for themselves to have a drama to talk about and having a purpose in \"fighting the good fight agaknst the corporations\" for a while ...\n\nyou know ... the same evil corporation that gave jobs to the very people now complaining and going to Unreal ...\n\nthink what you will ... but by services offered, and C-written source code performance and compatibility, nothing beat Unity.\n\nand that is not changing, given how many rich people have stocks and investments that use Unity to function, both for entertainment and for State/Education even",
            "Those 3-5 seconds add up though - and, while yes GDScript has hot reload, all the other languages will still have compile time - and, Godot's C# support has a known issue where the assembly will sometimes just... fail to reload - and the UX is you just get linked to [this Github Issue](https://github.com/godotengine/godot/issues/78513) - and then you have to restart the entire Editor. The current Godot workflow (at least for me) is significantly sower than Godot.",
            "This is fixed in 4.3. I use 4.3 beta and this problem doesn't exist anymore",
            "oh my god,,,, it's been 84 years dot gif\n\nbut seriously, that's fantastic news!"
        ]
    },
    "Been working on this game in my spare time for more than a year.": {
        "title": "Been working on this game in my spare time for more than a year.",
        "score": 88,
        "url": "https://v.redd.it/cvc791jxy28d1",
        "content": "",
        "num_comments": 9,
        "comments": [
            "Do a ~~barrel roll~~ keg stand!",
            "Love the StarFox vibes 🥰",
            "I love the visuals, well done m8",
            "Wow looks cool 👍",
            "Looks really aesthetic, impressive :) \nEspecially the background reminds of some retro futuristic artworks, I haven’t seen it in a game yet. If I can suggest something then I’d say that you can stylize a few more elements to make the overall look more consistent and it can really be artistically unique. Imo the light beams and the starship materials could use some styling. Maybe go for an outline for more edges in starships and maybe add a little cel shading to them or simply make their material more matte, so they will look more detailed in close up. The light beams would be very appealing if they were more consistent with light beams from the sun in the background. Good luck with the game :)",
            "You should check out [liquid space dimension](https://store.steampowered.com/app/2538340/Liquid_Space_Dimension/) that came out last year. It's another indie dev starfoxlike game.",
            "You really nailed it on the art and models! Way to go :)",
            "Looks amazing",
            "Looks really fun!!"
        ]
    },
    "After dedicating half a month to developing a dynamic sail and rigging system for my naval combat engine, I am now faced with a propulsion conundrum: What is the principle of power for ancient ships, and is it truly possible to control the sails to move against the wind?": {
        "title": "After dedicating half a month to developing a dynamic sail and rigging system for my naval combat engine, I am now faced with a propulsion conundrum: What is the principle of power for ancient ships, and is it truly possible to control the sails to move against the wind?",
        "score": 53,
        "url": "https://v.redd.it/lk8tfhu4h18d1",
        "content": "",
        "num_comments": 17,
        "comments": [
            "You don't have to use all of wind momentum to push boat. With correct angle sails can get some energy pushing them forward by wind coming from nearly front of boat. These were usually zig zagging against the wind so in a way... Yes they can. \n I believe in your case gpt would be great starting point towards starting research to get few references.",
            "I don’t know how the square sails do it, but the triangular sails when viewed from above work similarly to a plane’s wing. The sail is curved when filled with a breeze, and the shore resembles an airfoil. The wind passes over the leading edge and some goes ‘above’ (we’re still visualizing it from above) and some goes below. The sail surface forms a high pressure underneath and lower pressure above, and the wind passes the trailing edge angled down. This ‘Bernoulli effect’ pushes the sail ‘up’ (like an airplane wing generates lift) \n\nThe key difference to the similarity to an airplane is a boat’s hull has a keel. Otherwise the wind would be pushing the boat backward. \n\nWith the keel at an angle to the ‘wing’(sail), the boat instead travels in the path of least resistance. Which is forward, against the wind, but at an angle. \n\nWhat angle? Different geometries behave differently, but 45 degrees is probably a good approximation.\n\nhttps://letstalkscience.ca/sites/default/files/styles/width_800px/public/2021-11/action_reaction_lift.png?itok=GGMWQjBf\n\nhttp://www.phys.unsw.edu.au/~jw/sailing.html",
            "The cloth physics are nice. Is that your own or a plugin? if yours did you use verlet integration?",
            "As far as I'm aware, ancient ships didn't have the right sails or keel to 'tack' into the wind and so relied on rowing oars when heading into wind.",
            "Jibe ho!",
            "it depends how \"sim\" you want to go with it. \n\nSea of thieves doesn't really sim much, the game tracks a wind direction, sail angle and how opened the sail is, and the game makes a clamped speed calculation based on that. Wind speed doesn't change, the direction shifts a small amount constantly, the ships have different max speeds in different kinds of wind direction, and the ship just moves at its set speed based on the calculation. The game also allows the ship to move slowly upwind but tacking can be more effective, especially with the medium ship, the Brig which goes fastest in a crosswind.\n\nOr you could go full sim and try to calculate the amount of push your sail configuration has, like Sailwind does, but this can be janky and might be a major hindrance in combat. The wrong configuration can make the ship impossible to control, add too big a sail to your ship and the thing might capsize from an errant crosswind",
            "You can't sail directly into the wind. You usually sail at 45 degrees, but that alone isn't enough as the wind will still push the boat sideways. You use the keel/centreboard to convert that to forward momentum. \n\nI feel like it would be very hard to replicate in unity, at least hard in my head lol. It could be faked fairly easily however.",
            "Exactly...in sailing, it's called tacking and would be difficult but possible to mimick.",
            "Indeed, many places have mentioned this kind of operation, but I didn't understand the physical principles behind it. It's impressive that ancient people could master such a skill.",
            "Thank you very much for your explanation and the materials you provided.",
            "Square sails don't do it. They are kites as opposed to wings, they do not generate lift. They can move some direction lateral to the wind, but not at all into it like the more modern rigging. Triangle sails can actually move faster than the wind. ",
            "Thanks. Initially, there was consideration for the cloth to implement a compute shader for GPU cloth calculations or to apply verlet integration on a mesh structure. However, I felt it seldom has the opportunity to collide with the physical world., especially considering there might be dozens of sails in the scene. The sails should not consume excessive GPU resources. In the end, I opted for baking basic physical effects combined with vertex shader swings for the detail. The rigging system, on the other hand, did utilize verlet integration.",
            "Thank you for your suggestion.",
            "Thank you, I have also researched the sail dynamics in \"Sea of Thieves.\" I have only seen the experiences summarized by players but have not found any official introductory materials, and I am troubled by this.",
            "Physics is just forces. If you can draw the arrows on a piece of paper and do the math you can draw the arrows in code and do the math",
            "Think of it like this. Wind is pushing. its excerting power on the sail. The path of least resistance for the air to pass around, is for the sail to go through in that way. and for the sail to move like that, the boat needs to go forward in that zig sag way because water has more resistance on the shape of the boat. If the boat was straight on, the wind would push it back.\n\nImagine you have a flat piece of card board at 30 or 45 degrees against a strong fan. And you are holding that board. the air is deflected according to the angle of the board. Well it also excerts an opposite force to the board. if you were on wheels that are angled, that opposite force would push you.\n\nancients weren't dumb. i mean they discovered most of the math, chemistry and physics we use today. They observed and checked to see what goes on.",
            "There's not much you can gain from lesson material when it comes to play, both styles are more about getting the feel of the ship and mechanics, learn by doing.   \nYou might be able to find something from developer conventions like GDC, Rare's staff have done a few talks there, but mainly about shaders and visuals from what I've seen."
        ]
    },
    "Build town in the Wild West with your friends ": {
        "title": "Build town in the Wild West with your friends ",
        "score": 10,
        "url": "https://v.redd.it/86k1lpr0548d1",
        "content": "",
        "num_comments": 1,
        "comments": [
            "Forty-Niner is a survival RPG game set in a procedurally generated world of Wild West. Experience freedom as a pioneer, setting out into a massive world to strike it rich mining, build a homestead, or adventure through dense wilderness, alone or with friends in online multiplayer.\n\nDemo is planned this fall!\n\n Wishlist on [Steam](https://store.steampowered.com/app/2379820/FortyNiner/?utm_source=rd_Unity) \n\n\n\nHere's a link to our trailer [https://www.youtube.com/watch?v=04hpb-\\_e9Nk](https://www.youtube.com/watch?v=04hpb-_e9Nk)\n\n[](https://www.youtube.com/watch?v=04hpb-_e9Nk)"
        ]
    }
}