{
    "Jolly Jurist Justice - Weeklyish Discussion Thread - June 21st, 2024": {
        "title": "Jolly Jurist Justice - Weeklyish Discussion Thread - June 21st, 2024",
        "score": 90,
        "url": "https://www.reddit.com/r/VirtualYoutubers/comments/1dl0wfx/jolly_jurist_justice_weeklyish_discussion_thread/",
        "content": "Was it Justice is Cute or Cute is Justice?\n\nI wonder what brought that on...\n\n[Follow the Rules](https://www.reddit.com/r/VirtualYoutubers/wiki/index/rulesandguidelines)\n\n[Previous Weekly Thread](https://www.reddit.com/r/VirtualYoutubers/comments/1detc1m/yielding_yachts_yawning_weeklyish_discussion/)",
        "num_comments": 403,
        "comments": [
            "Hololive English 4th Generation Unit -Justice- Debut\n\n[Thread](https://www.reddit.com/r/VirtualYoutubers/comments/1dlc6ss/hololive_englishs_new_4th_generation_justice_unit/?utm_source=share&utm_medium=web3x&utm_name=web3xcss&utm_term=1&utm_content=share_button)\n\nDo talk and use this specialized thread for all things new gen (rather than the weekly thread), especially regarding expectations, live debut watching, and more across these two days.",
            "[English speaking Yagoo, talking about overseas expansion ](https://www.youtube.com/watch?v=-CYSz5lu3g0)\n\nLooks like Holo is gonna start ramping up overseas stuff",
            "[Kiaras watchalong for the Austria - Poland match has begun](https://www.youtube.com/watch?v=tggPK1mpGWw)\n\nPS:  \nSlightly lol'd that Cover actually legit puts out an article for once were they outright say East-Asia and Europe are what they want to expand into next and apparently didnt tell their one Talent already living there lmao",
            "In less than 100 years there will be vtuber merchandise experts on Antiques Road Show.",
            "[https://twitter.com/momosuzunene/status/1804143578299666849?s=46&t=IQ79cksnUeCTRZ7I8SmoqQ](https://twitter.com/momosuzunene/status/1804143578299666849?s=46&t=IQ79cksnUeCTRZ7I8SmoqQ)\n\n【✨BIG NEWS✨】\n\nKAIGAINIKI\\~\\~\\~\\~\\~\\~♡\n\nNENE GOOOOOOOOO✨ACGHK2024✨\n\nI look forward to meeting you all🍑💛\n\n[https://m.facebook.com/story.php?id=100064742494395&story\\_fbid=864969219004487](https://m.facebook.com/story.php?id=100064742494395&story_fbid=864969219004487)\n\nhttps://preview.redd.it/yev7rblcjx7d1.jpeg?width=1145&format=pjpg&auto=webp&s=d7fa231397bc639c63553adf57f3c9ed960548ff",
            "Good news on Mio’s health from Subaru. Stream is still ongoing.\n\n[https://www.youtube.com/live/CN6jdwWX8hg?si=ZYyB8HnBbOGr8QLS](https://www.youtube.com/live/CN6jdwWX8hg?si=ZYyB8HnBbOGr8QLS)\n\nhttps://preview.redd.it/c5rmllsa818d1.jpeg?width=1284&format=pjpg&auto=webp&s=4ea1a835c9270e221a67420ea4a2260100a13736",
            "【COVER】OTONABLUE (Elizabeth Rose Bloodflame)\n\nhttps://youtu.be/zZXW_iXIrss?si=tax_uS65cEk6RraR",
            "【MV】Hitomania - Gigi Murin (Cover)\n\nhttps://youtu.be/bmT_cEfOTJE?si=CgYOjJPGpeeRxVww",
            "[Sora playing HoloEarth](https://www.youtube.com/watch?v=e_k2JiT8JDg)\n\nI guess the line outside the shops are tradition now. Iirc people did it for Watame, IRyS, Bae, Ollie, and now Sora.\n\nEdit: waiting patiently\n\nhttps://preview.redd.it/m624g4etow7d1.png?width=2559&format=png&auto=webp&s=6f13dfaa632dd4125b59f0e60b1ddcd53bcc9183",
            "[YAGOO](https://www.youtube.com/watch?v=-CYSz5lu3g0)",
            "[https://twitter.com/MintFantome/status/1804284764591141365](https://twitter.com/MintFantome/status/1804284764591141365) MINT IS NOW SPONSORED BY GAMERSUPPS\n\ncode BOOMER for a 10% discount on ur favourite hag approved flavor\n\nalso, doki and mint hospital 666 in about an hour\n\n[【HOSPITAL 666】2 girls enter 1 girl leaves【Dokibird】](https://www.youtube.com/watch?v=1JfuKXp5QTg&pp=ygUIZG9raWJpcmQ%3D)  \n[【HOSPITAL 666 COLLAB w/ u/Dokibird 】just two idiots running around【Maid Mint Fantome】 ](https://www.youtube.com/watch?v=qraKhxcuv6c)\n\nboth povs edit: they are live!",
            "https://twitter.com/hololive_en/status/1804316143504757025?s=46&t=IQ79cksnUeCTRZ7I8SmoqQ\n\n◢◤◢◤　#BreakingDimensions　◢◤◢◤\n\nhololive English 2nd Concert -Breaking Dimensions-\nDue to overwhelming popularity, we are considering extending the deadline of concert merch vol.1 sales! \nDon't miss out!✨",
            "Big Announcements from Motoaki Tanigo | COVER\n\n[https://youtu.be/-CYSz5lu3g0?si=l1MXNSqwzokTuuE2](https://youtu.be/-CYSz5lu3g0?si=l1MXNSqwzokTuuE2)\n\nYahoo mentioned the already known announcements, but also teased more announcements in the future(I assume it’s EN since it’s on Hololive English Channel but it’s possible it’s also ID since both were mentioned in the video)\n\nhttps://preview.redd.it/bco7a56vzx7d1.jpeg?width=998&format=pjpg&auto=webp&s=b7ee63852c660943f356425cba95aa41198c7dd8",
            "Not that the lore is a huge thing for me but with Justice and their background files is this the first time were getting fictional countries and in a way a kind of 'setting'?(for hololive EN specifically)  I could be misremembering but I don't remember places like this coming up in the previous gen's background. Advent were held in \"the cell\" but I always took that just to be some Tartarus-like jail in our world and though Council's lore was nuts I still understood them as being part of our world, Mumeir for example was dealing with our civilizations in our history, Fauna is representative of nature surrounding us and the planet we're standing on now.\n\nI suppose they are just trying to lampshade the counties the talents are from but I'm sure there are other ways of doing it. \n\nI know this is a much more established thing for HolostarsEN but it seems new for the Hololive side.",
            "[Reine is having her weekly brunch freetalk today](https://www.youtube.com/live/iMdXrBO5xpk?si=QC7js3gsr0tLQhhx), it's about half an hour after the EN4 debuts end, so stop by if you're looking for something to watch afterwards. She's also close to 800k subs and plans to fly to the Philippines and try balut for the first time when she reaches the goal.",
            "[Ina Plays Elden Ring DLC: Shadow of the Erdtree! Part 1: Mine Would Be an Order of Cookies ](https://www.youtube.com/watch?v=-uL92ZxaepM)\n\n[Ina and Past Ina beat the ~~first~~ second DLC boss! (Spoilers)](https://cdn.discordapp.com/attachments/861982747173715968/1253887002093555814/SPOILER_Screenshot_20240621_213843_YouTube.png?ex=66777cc5&is=66762b45&hm=93dc288426c9f9767677997019ef19982c783cfa516c4ebe3e006480a1036d0e&)",
            "My wallet…\n\nhttps://preview.redd.it/kurhm02v808d1.png?width=1170&format=png&auto=webp&s=a9d14b9de3ca6015cf7d36e2e24877df808be984\n\nSometime I regret being a vtuber fan because holy shit the amount of money I have sunk into this hobby",
            "YEAH!!! Ina finally beats >!the Lion asshole!<.",
            "Gigi schedule, seems like Fauna's usual time\n\nLiz didn't post hers yet on twitter or on stream\n\nhttps://preview.redd.it/0gnx368nz18d1.jpeg?width=1920&format=pjpg&auto=webp&s=3425463c71bd8b212679de7934065de1797be4c4",
            "Small note unrelated to Justice, but Bae just posted a highlight video of her Yakuza 0 playthrough. It made me realize how much I miss highlight or \"best of\" videos of super long lets plays,  even more so with these super long streams that can be even harder to digest than the old lets play format. Actually feels really weird that there's not more supercut videos that go through Vtubers' entire playthroughs (other than the huge amount of work).",
            "Korone’s Justice debut watch a long \n\nhttps://www.youtube.com/live/4NIO6ZWxMCA?si=fbzmX6kHFkmuQ2fi\n\nFirst time doing it for EN members",
            "Since she's not debuting today, I think it belongs here\n\nhttps://preview.redd.it/b1630z2w718d1.png?width=1200&format=pjpg&auto=webp&s=68d705feef690376080c96e4891ed8bd935b9d69\n\nCecilia first community post! She's nervous so also give her support, check out the others too maybe they posted as well",
            "Yo!...new threads.\n\nSo...question.\n\nDe we gonna have dedicated threads for HoloEN4 or else you guy gonna see reaction spam in this megathreads tomorrow for sure.",
            "Subaru's [Fullmetal Alchemist: Brotherhood watchalong](https://www.youtube.com/watch?v=imYZmFeb6oU) starts today. Finally, a good enough reason for me to actually watch the thing XD",
            "Botan reached master in sf6",
            "[Korone tree totsu](https://www.youtube.com/watch?v=BewUKxwJFUI)",
            "The Advent and Indonesia group watchalongs hit me with the realization that A-chan is still out for a bit longer. I miss the resident staff member and hope she's doing well and that we see/hear her again someday soon.",
            "Luna's face during don't scream is very concerning 😂. Her face leans away but her eyes are bloodshot open everytime a jumpsvare happen",
            "It’s pretty common knowledge that Kiara’s oshi before joining Hololive was Pekora, and I know some others like Nerissa’s being Kiara. My question is what other Hololive members have shared their oshis prior to joining Hololive? Is there something similar with Holostars too for those experienced with them? I honestly don’t remember any of the boys mentioning pre-debut oshis but I could very easily be mistaken. \n\nIt would have to be within the same company as its somewhat different if someone said they idolised someone but didn’t end up joining their company. \n\nOther companies welcome too, though I’d be much less experienced with them.",
            "[Ina Elden Ring in 6m!](https://youtu.be/-uL92ZxaepM)\n\n[Fauna Warioware in 1h6m](https://youtu.be/ZuZX1TzV6uA)\n\n[Biboo Elden Ring](https://youtu.be/N8F8x4Dlvos) and [Fuwamoco Keep Talking](https://youtu.be/5silKaoaQ88) in 2h\n\n[Calli Elden Ring + Justice debut watchalong in 3h](https://youtu.be/Hs9URYX-IzI)",
            "[Fauna will play Wario Ware Smooth Moves in 1 hour.](https://www.youtube.com/watch?v=ZuZX1TzV6uA)",
            "I become an *Official* hololive Merch Salesman for a day.\n\nhttps://youtu.be/aURkY3PtVV8?si=NW2rUDqj5ETfYhSP\n\nThe collaboration with Korea",
            "Raora #flexing that she met Yagoo in person before she even debuted\n\nhttps://preview.redd.it/9u6d0yvjp38d1.png?width=1200&format=pjpg&auto=webp&s=fd753b1174343adb935a6884e72dcb058a8fce16\n\n[https://x.com/raorapanthera/status/1804461313332273167?t=cUGruhvTJ77oyahJHXZ-Gg&s=19](https://x.com/raorapanthera/status/1804461313332273167?t=cUGruhvTJ77oyahJHXZ-Gg&s=19)",
            "Catching up to Kanatas elden ring vods, and man, this PP tenshi bloodthirsty-ness cost her another valuable npc. Rip prawn bro",
            "Ah shit, I can't stay up too late to watch the Netherlands - France match if I want to watch holoJustice debuts later\n\nNo choice but to make certain sacrifices in life I suppose",
            "Blessed AZki [train ASMR](https://www.youtube.com/watch?v=dUkUyVHFo3I) again.",
            "[Kanade Izuru 5th Anniversary singing stream!](https://www.youtube.com/watch?v=9NZ9uHS-W3o) He also just released a cover for [Tokyo Shandy Rendez-vous](https://www.youtube.com/watch?v=T7NKIeE652s)",
            "[Chloe’s guerrilla karaoke in 5 minutes!](https://www.youtube.com/live/ZfYYTbcWKPk?si=eDAfneXSvkjIiNu9) She’ll mainly focus on old vocaloid songs.",
            "So, Biboo finally beat >!the Twin Moon Knight and she got a new weapon where she can go POWERRRRRRRRRRR!<.",
            "I'm very surprised but tomorrow's Beast Cup starts at noon, same time as debuts actually. afaik there is like 5000 participants so makes sense. anyway here is [Aruran POV](https://www.youtube.com/watch?v=lYSXFZLmPLg) and [Aki POV](https://www.youtube.com/watch?v=sz97dvJRTTs).",
            " She’s a 10 but she believe anti-hand dryer propaganda",
            "[Elden Ring - Shadow of the Peko](https://www.youtube.com/watch?v=hE6ECpfFXnY)",
            "Ollie will have a Justice Debut watch a long with Zeta, Kobo and Anya \n\nhttps://www.youtube.com/live/4TynmEc9igY?si=Ez1WqYrTwyv4mUpt",
            "Why is it that every time a new hololive/HOLOSTARS gen is about to debut, the first thing that pops into my mind is, \"Who in this gen is a *Sonic* fan?\" Look, I was hooked onto hololive thanks to *Sonic*, okay?\n\nHeck, [Cecilia Immergreen](https://www.youtube.com/watch?v=p_ZQs-kgUKI) and [Raora Panthera](https://www.youtube.com/watch?v=JW7j8tKMOfY) are debuting on Sonic's Birthday (at least in JST)! Why the hell am I even laughing at that coincidence?",
            "[Altare Plays Elden Ring DLC: Shadow of the Erdtree! RELEASE DAY! WE WILL RULE THE LANDS BETWEEN!!!](https://www.youtube.com/watch?v=plJk-2gVFDM)\n\n[Biboo Plays Elden Ring DLC: Shadow of the Erdtree! Part 2: Banished to the SHADOW REALM (Motivated Run)](https://www.youtube.com/watch?v=N8F8x4Dlvos)",
            "Lap-chan streaming Valorant on [Twitch](https://www.twitch.tv/laplusdarknesss_hololive)",
            "[New $10, 3-week Humble Bundle](https://www.humblebundle.com/games/uploadvr-summer-devolver-showcase), a bunch of Devolver VR games\n\n* Gorn  \n* Tentacular  \n* Talos Principle VR  \n* Serious Sam VR: First/Second Encounters, Last Hope  \n* Serious Sam 3 VR BFE  \n* Block'hood VR",
            "\nhttps://twitter.com/hololive_en/status/1804137222054228296?s=46&t=IQ79cksnUeCTRZ7I8SmoqQ\n\n✈️🌐  hololive STAGE World Tour 2024 -Soar!- ✈️🌐\n\n\nhololiveSTAGE24 venue tickets for Anime NYC concert go on sale June 24th!🎉\n\nConcert Date: August 23rd (ET)\n\nSales period: June 24th 7 PM (ET) ~ (*First-come, first-served)  \n\n\n🔽Ticket\n\nhttps://animenyc.com/hololive-soar/",
            "[Its time for FUWAMOCO Morning!](https://youtu.be/JxkXIozpz80)\n\nA bit late, my only excuse I have is that the internet provider was blocking me from posting earlier lol.\n\nEdit: And the FUWAMOCODE for the archived viewers for today is: BAU BAU Debuts!",
            "All the discussion about EU talents debuting in NA prime got me into thinking. Wasn't it the same for all the EU livers in NijiEN as well? I think I remember all their past debuts always happening at the same hours.",
            "https://preview.redd.it/4brdl47w328d1.jpeg?width=1000&format=pjpg&auto=webp&s=464feef4b68c3bb519cc5de634168ffe0d758035\n\nMood.\n\nAnyways.\n\nOnce again whoever the fuck that did the scouting / going over the auditions and Yagoo scored gold once again with these 2.\n\nElizabeths singing was absoluty beautiful and her voice impressions were spot on.\n\nGigi was really cute and with her going the D&D route and her 'Youtube plays Gigi' minigame was really funny. ~~I was the one that kept typing down. ANARCHY!~~\n\nAnd TOMMOROW we have Cecillia and Raora!",
            "The Sun never sets on the HoloPro Empire",
            "Mori's Elden Ring stream, somewhat inevitably, [will also turn into a Justice debut watchalong.](https://www.youtube.com/watch?v=Hs9URYX-IzI)",
            "Zen([Zentreya - Twitch](https://www.twitch.tv/zentreya)) is showcasing her newest model and the last one by Yuniiho and must I say she COOKED. Zen looks so smug it's perfect for her lmao\n\nSome thoughts about Yunii's new self:\n\n>!I wonder if we will ever see another model by Yunii. Unlike the other artists that became hololive vtubers, she graduated her only other account. I guess she was too big of a vtuber to stay even semi active as an artist. Making models anonymously or creating another account seems like a waste. I wish the best for her, but I'll definitely miss her work.!<",
            "My rrat for Holo debuting Justice this \"soon\" is because they need someone to do watchalong for the 2nd En Concert (since advent is definitely joining, thus won't be able to watchalong) lmao /j\n\nAnw it always amuses me as to how good of hires they get. Yagoo (or their talent acquisition manager) must have Midas' touch or something. I'm just so happy I get more oshis! Gigi is just so cute and I love her design a lot. And Elizabeth is just... wow... her voice!",
            "[Aqua's karaoke stream is live](https://youtu.be/DYNxsLQgucQ)! She will also be showing some accessories of her new outfit she didn't show in her outfit reveal stream.",
            "[Towa's turn to Holoearth](https://www.youtube.com/watch?v=1fa26A8-RHQ)\n\nStill seiza-sitting in front of the store.\n\nThank God my system can somehow handle having two games up at the same time. I can play other games while waiting for stuff.\n\nSora's having fun in her simulation room. Was cute when she apologized to the sheep she had to defeat for mats. Currently trying to get a horn from the deer.\n\nMeanwhile, Towa-sama's stream:\n\nhttps://preview.redd.it/qn1x8eaekx7d1.png?width=2559&format=png&auto=webp&s=8e16a640f61f3216bf70a3943cb545f289755e2b\n\nLook ma I'm on TV",
            "Woke up way too late for it but fuck it, here are some Beast Cup POVs: \n\n[Akirose](https://www.youtube.com/live/sz97dvJRTTs?si=VH1WND42K-DNzPGF)  \n[Aruran](https://www.youtube.com/live/lYSXFZLmPLg?si=e6_Im8wrQrKzure-)  \n[Higuchi](https://www.youtube.com/live/Kxx_AoKAfyg?si=PpLLRABEQsaOwZmv)  \n[Naraka](https://www.youtube.com/live/CbicFMCKncE?si=-wZVrRg9S4nA85QH)   \n[Dogura](https://www.twitch.tv/ikoma_dogura)  \n[Tachikawa](https://www.twitch.tv/tachikawabr)  \n[Ren](https://www.twitch.tv/ren_kisaragi__)",
            "[Aqua continuing her 3 lives Elden ring challenge](https://youtu.be/VueywPLwGl0)! Her rules are: 3 lives, first Grafted Scion death not counted  \n\n\nWelp, made it to Morgott before stream ended",
            "Anyone else use LiveTL for watching streams? If I use embed TL, I can't comment on chat anymore, no matter what. Subaru's chat, which has 5min sub mode, wouldn't let me chat with on, so I had to refresh the page to turn off embed. This let me chat again.",
            "[lmao the title of this video.](https://m.youtube.com/watch?v=qiWi5yTNuMY) If this was actually for its intended purpose it would actually be extremely easy to stay still for a pose too, since...well its a 3D model, not a flesh and blood body to have to keep in position. You can just freeze the model once its in its desired position. I wonder if Kagura Nana could pull it off real-time, though athleticism probably isn't all there is to this kind of thing.",
            "[.LIVE will hold Auditions from June 21 to July 21.](https://docs.google.com/forms/d/e/1FAIpQLSfL9Zp5ug21jXoZ12ahyz4ve4n8FV2GH0EGHM36IaUt-RHgXg/viewform) Successful audition candidates will receive 300,000 yen to fund their activities.\n\nhttps://preview.redd.it/exttb5vf2y7d1.png?width=960&format=png&auto=webp&s=51a85b10fcd78145e50c16299f380ea2a026f0c9",
            "[Kiri Kilovolt is starting a 24-hour donothon](https://www.youtube.com/live/Vs2IB4tIp8M)... driving a virtual 24-hour of Le Mans in Gran Turismo 7!\n\nEdit: Bit of delay, Kiri is still prepping something.  Will hopefully get rolling soon!",
            "Hopefully not too late (been going for 5 hours already), but [Jets is celebrating her 3D debut!](https://www.twitch.tv/jeanfaymas)",
            "[Aqua returns to the streets](https://youtu.be/LGrcDjiOI-U) after her Elden Ring challenge and is aiming to make it to Diamond",
            "- (JP) Kashiko Mari and ChumuNote covered [Absolute Zero](https://youtu.be/W-tum6faFNQ).  \n- (JP) Iida Pochi. covered [Bansanka](https://youtu.be/UnQYzt7lf4E).  \n- (JP) INSIDEchan Mark 2 and Toutoshi Kumarisu covered [Tenbyouno Uta](https://youtu.be/SbeUdzheuuo).  \n- (JP) KAMITSUBAKI's Harsaruhi covered [Nandemo Icchatte](https://youtu.be/oPCBX_Ys2z4).  \n- (JP) Hoshimeguri Gakuen's Hakuchoge Mahoro covered the acoustic version of [ray](https://youtu.be/HCoFjvm1riA).  \n- (JP) Utai Makea covered [Demons Banquet](https://youtu.be/JI4yuKQr0Lc).  \n- (JP) Hoshimeguri Gakuen's Makura Rui covered [I don't mind if you're a little minx!](https://youtu.be/TpPUqhMdcc8).",
            "[Sora is currently playing HoloEarth to check out the new update!](https://www.youtube.com/live/e_k2JiT8JDg?si=FfkzEvrKjTxIvcdw)\n\nEdit: [Jurard has been streaming for 6 hours now trying to beat the original FNAF's 4/20 mode. He has actually been close to beating the mode a couple times now but got unlucky with the Freddy Blackout RNG or lost power too early at 5 A.M.](https://www.youtube.com/live/VKk1xoyyusE?si=AzHNqqP9TQxCUJmT)\n\nAnd Jurard has now called it quits for now so that he can rest up from this crazy stressful endurance stream.",
            "Sorry if this is too negative of a question but have you ever experienced a decrease in enjoyment of VTubers after their new identity/return to a previous identity? Spoiler the comments obviously in accordance to rule 7.\n\nIs this also a concern for people on big new debuts that their former oshis don't vibe with them the same way as they did before? I do suppose most people are just glad they returned and are presumably in a more stable position than in the past.",
            "I'm super anxious because of an upcoming 7 hour car ride, so I decided to look for something else to focus on and I found [this](https://youtu.be/Uy_Wp6RLSKM) Doki clip, and oh my god, it instantly made me lose my shit xDDDD It's absolutely going into my emotional support videos playlist",
            "[Bettel](https://youtu.be/14tMbvutkOw), [Ruze](https://youtu.be/1m6U2vYsDHM), and Flayon are playing the Elden Ring DLC. They're not in co-op, but they are in the same voice chat while going through everything. It's like an end-of-week online hangout :p",
            "Has Kiara ever talked about her viewership demographics, in particular what regions watch her the most? I think something like that was mentioned on reddit but my memory is fuzzy.",
            "[Immortal Mugi is playing Valorant right now!](https://www.youtube.com/live/FmntRWWW-fQ?si=-8ZZ0L3JIdcFNhj-)",
            "Fuck me finally done with exams, just in time for holo euro",
            "as always, Cover’s Hiring Department never misses with who they get into hololive",
            "Kannagi Tenri is live now at [TOBIRA MUSIC FESTIVAL](https://www.youtube.com/live/1O81fqLuBz4)\n\nEDIT: as someone who is very tired and just woke up the process/flow of TMF is quite hard to follow, especially with those technical issues at the beginning, but at least Tenri seems to be having fun.\n\nI wish I could have given the event more attention and tried it out using the intended new application but I had so much to yesterday and so much to do later today so I had to settle for waking up just before it started at 3:30am and then I'll be going back to sleep as soon she's done until her next stream for the [Hoshino Rock Festival](https://www.youtube.com/watch?v=uu_ERsAZUz8) karaoke relay at 19:00",
            "[Kisara’s debut right now!](https://www.youtube.com/live/WjJendjXMi4?si=C1rsHX27Pwt3pA5c) I wasn’t going to post this here but she started off with a song and damn it’s pretty nice.",
            "[Watame is back in Resident Evil Village.](https://www.youtube.com/watch?v=z619THtMdTc) Off to the baby boss today...",
            "Today's VSMP streams:\n\n[Spectra will make her debut](https://www.youtube.com/watch?v=LKV7hoSAa58&feature=youtu.be)  (there is chance that Globie's Pippa will join as well). \n\n[Kanna who decided to swap most of Elden Ring DLC streams to VSMP](https://www.youtube.com/watch?v=tfZXzSGPwDU) and [Tomoe (Kawaii).](https://www.youtube.com/watch?v=2G-kpkJPW94&feature=youtu.be) \n\nLater on [Elia (V-Dere)](https://www.youtube.com/watch?v=fXC5EeD-NxQ&feature=youtu.be), [Kohaku (Kawaii)](https://www.youtube.com/watch?v=bbRkX2Q00-Y&feature=youtu.be) and [Lottie](https://www.youtube.com/watch?v=2ZXAQ1hj_D0&feature=youtu.be). \n\nAnd more invites to join the server have been sent.",
            "* (JP) Nornis has a new MV, [JOHARI](https://youtu.be/66FfVXogNUc?si=bUjZza5SnjcDgPUy).\n* (MY) MYTH-OS's Aozaaki Maeena covered [Bad Apple](https://youtu.be/NrMwCYvENss?si=wkq59e6-ojmNpPVZ).\n* (EN) Phase Connect's Uruka Fujikura made a violin cover of Towa's [Palette](https://www.youtube.com/watch?v=tFS-C5a0h-Q).\n* (EN) Alohaii (formerly Lone Alpha) premiered the [SUMMERTIDE album](https://www.youtube.com/watch?v=jiiI6mygFTo), also available on [Spotify](https://open.spotify.com/album/64N5WSwgDqsp8JxcXzufoB?si=4vIpKngKR4KlhphW2NCLaA). The 10 tracks feature the vocals of Kiyon, Kiichan, Ember Amane, Rachie, Yuuka Bear, Miori Celesta, Yuuna Nini, Nia Suzune, JubyPhonic and TOFIE. Several of the tracks already have their individual MVs, they are in the YouTube channel.",
            "[Another Vtuber-Guest announced for Dokomi: Umi Kyoku!](https://twitter.com/KyokuUmi/status/1804165292232175873)\n\nShe'll have a performance on Dokomis Vtuber-Stage on Friday, 2 PM CEST, along with a big surprise\n\nAnd a Meet & Greet with Merch on Friday and Sunday, 4 PM CEST. No need for tickets, just come by the assigned booth and say hi",
            "new thread\n\njust in time for holoJustice debuts",
            "Kinda felt like checking out Ui's newest daughter after some clips...\n\n[Wait how long IS this game??](https://m.youtube.com/playlist?list=PL7rBIMrt1ue7Ri7vVuzA9_iOnCQXUcet3) Is this actually a Yakuza 8 playthrough in disguise or what?!",
            "[https://www.youtube.com/watch?v=DbDDp9uT21A](https://www.youtube.com/watch?v=DbDDp9uT21A)\n\nbettel continue his ER run, now fighting >!messmer!<",
            "The super talented vsinger KAF is [counting down to a million subs](https://www.youtube.com/live/QIRRaMyVqYg?si=5BMGHodW9h4IOAih) right now as we speak, she’s super close, just under 300 to go so check it out if you’re interested!\n\nEdit: she reached it! 🎉🎉🎉",
            "[Jurard will have a watchalong of HoloJustice tomorrow with Octavio](https://twitter.com/jurardtrexford/status/1804131991086088285)\n\n  \nGonna be a bit scuffed he says.",
            "[Sabrina DiDuro is hosting her Birthday Livestream on Twitch today at 1PM EST!](https://www.twitch.tv/spaceybat_) Feel free to stop by!\n\nhttps://preview.redd.it/b363etylfy7d1.png?width=715&format=png&auto=webp&s=385cb13e41d7cb5471a23e256bf560cc21f685b3\n\n(Also, does anyone want to help me write her [VTuber wiki article](https://virtualyoutuber.fandom.com/wiki/Spacey_Batotelli)?)",
            "[10JIN streaming from the anomalismp Minecraft server](https://www.youtube.com/watch?v=q24OhPHnJAk).",
            "[Yo! I never thought someone could go this hard singing IGNITE live!](https://youtu.be/gk053NSEksM?t=3352) This got effects on it or is she just that raw? Also always appreciate anybody singing Aoi Eir songs.",
            "[Mimi](https://www.youtube.com/live/UNSYwcxSdLs?si=EkuVac_YsRPFYpVN), [Beni](https://www.youtube.com/live/7YN9mp7iisA?si=F9lEzf8Mnf85oLL7), [Akarin](https://www.twitch.tv/akarindao), [Uruca](https://www.twitch.tv/ow_uruca) and [Mother3](https://www.twitch.tv/mother3rd) Valorant right now!",
            "[Kanna Yanagi of PixelLink](https://www.youtube.com/watch?v=suClYHz_3_g) is playing Shadow of the Erdtree now!",
            "you know how 豪鬼 from street fighter got made into Akuma in english? it's funny how even MTL accepts it's Akuma, making it look like Japanese people in chat are in on the westernization.  this whole thing is very funny, imagine if it translated ベガ, which is also a star, into M. Bison",
            "Some midnight Valo with [Tsunapi](https://www.youtube.com/live/NuzZiFIQUG8?si=OSH2jBqAaiKm9fUl), [Meto](https://www.youtube.com/live/FdtIdldFHoE?si=h_SBRNdOjnA308dv), [Shino](https://www.youtube.com/live/u-5JedAktmc?si=jk1zkqE0jMJc-a8P), [Mittiii](https://www.twitch.tv/im_mittiii) and [Rassya](https://www.twitch.tv/rassya12) right now!",
            "[A prominent music producer in the rhythm gaming community, sasakure.UK, is currently debuting his 3D vtuber persona named Perio, with Nijisanji's Yashiro Kizuku tagging along.](https://www.youtube.com/watch?v=5WhnZ58G_NE) Apparently with Niji's 3D tech, they're just playing Chunithm lol",
            "[Ramuchi LoL right now!](https://www.twitch.tv/ramuneshiranami)\n\nhttps://preview.redd.it/8qeutpga838d1.jpeg?width=1668&format=pjpg&auto=webp&s=db8db7088ee4988607bb76b1c3c5de8475a7c4d4\n\nでけえ",
            "Today was Koboshi Kiora's birthday and to celebrate she released a cover of [No Logic](https://www.youtube.com/watch?v=gp6U0s0J42M)\n\n[Minetsuki Ritsu](https://www.youtube.com/@ritsu_yumemita) will be going live in just a moment (21:00) with a vertical karaoke + chatting stream. No waiting room since it's vertical.\n\n[Kannagi Tenri](https://www.youtube.com/@KannagiTenri) will also being doing a vertical karaoke stream this one will be at 23:30.",
            "I’m sorry if this steps on some toes, but why are some EU hololive fans so aggressive? I understand the fustration of not being catered to for 4+ years, but why make up your own headcanons about all of the new debuts living in like, Boston or something and then get mad at cover for it? We already have evidence that 3/4 of them are European, and even if one of them is in Japan or something I’m sure she’ll adjust her streaming times to be EU-friendly if enough people support her. Also, PL question:>!Was Yuniiho popular in EU, or was she still more popular in the US?!<\n\nI also understand being frustrated with the unfriendly debut times, but you have to understand that they just want to maximize viewership, and EU is still a bit of an unproven market in terms of vtubing.",
            "Ayakaki’s cover relay right now!\n\n[Shiga Riko’s High-Touch☆ Memory](https://youtu.be/qs5zL6cM5BI?si=0Tr6-3Gy71YkeBaC)  \n[Tamanoi Nana’s TONDEMO-WONDERZ](https://youtu.be/6B_Qy_KP2_o?si=jk71pTm9GsR9184R)  \n[Kisara’s Necro no Hanayome](https://youtu.be/yVBy8zyN5pw?si=53tyxwFUapB1XSmc)  \n[Kozue Mone’s Tougen Renka](https://youtu.be/NAlKtJrbcsk?si=2d_qvYUsEnW0PrTV)  \n[Lunlun’s Starlight](https://youtu.be/zQ8mibI_LRQ?si=IapMbwchKtDJ11Ky)",
            "U-San's [3D showcase](https://www.youtube.com/live/pLD_M93GLXA?si=B3Nu7oBZ2xn7ZkVe) has been postponed until tomorrow\n\nDoing a [Twitter space](https://x.com/i/spaces/1yNGaZgEYbNJj)",
            "Ayakashi (or the new Nijisanji JP gen) PL discussion\n\nI thought there would be no more debut from the streaming gens past, but three of the five are from the previous gen, 1 from 2nd, 1 from 3rd, 1 from 4th.\n\nShiga Riko - Tsuyuzaki Tsuyu (2nd) Known for her cute intonation and the habit of putting stuff on her head, she is very close with Nozomi and Meruto (she cried at Nozomi's 3D debut, which was yesterday) and therefore would introduce a nice third wheel between the couple.\n\nKisara - Naejiro Chiwa (3rd) I think third gen in general had interesting woman talents, and this was one of them. She is relatively close with Ruri, who expect some te-te there.\n\nKozue Mone - Kinano Kotoha (4th) Sadly short-lived fourth gen had a couple of talent left after the purge, and indeed she is one of them. She is the most boring of the three.\n\nTwo other talents are from outside the VTA. Lunlun is thought to be a relatively small streamer but Tamanoi Nana might ironically most anticipated of all of them.\n\n>!Tamanoi Nana - Suzuka Stella (Megalight). Suzuka Stella is someone I would consider to be the prototypical jukebox VTuber. Megalight folded two years ago and Stella was gone from the public eye for two years and suddenly she appears here, of all the places. Once again, one of the most 'wanted' reincarnation in the JP VTuber world, so this is huge news.!<\n\nSo, this gen come to be a bit of a shock but a very welcome one. We'll see if the remaining unknown VTA member will join the fray later on. (More on that on reply)",
            "Purifying is Cleanness as a Virtual YouTuber.",
            "[Nose](https://www.youtube.com/live/9O5zvQeTl48?si=oXeUklG6_PX9V4H_), [Risa](https://www.youtube.com/live/rDQaBryaiwA?si=MUXFpfSJGMWZ-Eql), [Vdk](https://www.twitch.tv/vodkavdk), [Kamito](https://www.youtube.com/live/iaZBaSmJh7A?si=PqrkpojDCL4cteGR) and [Marutake](https://www.twitch.tv/marutake_a) Valorant right now!",
            "[deleted]",
            "It is not like it is that important but is there a reason that Holo Justice's sub counts seem to be on the lower side ? The members are still bellow 200K (and i am not sure if the youtube hit them with subs). Devis was kinda like that as well though there was the deal with youtube hitting their subs too much for them",
            "[https://cover-corp.com/news/detail/20240622-01](https://cover-corp.com/news/detail/20240622-01)\n\nThis was also posted as well.",
            "Ha, Yagoo himself promoting Justice.",
            "COME ON AUSTRIA SCORE SOME FACKING GOALS",
            "I can’t believe Kiara just referenced “Possession is a negative stat” in The Year Of Our Lord 2024. Absolute madness.",
            "AUSTRIA 3:1",
            "DAWAĆ DAWAĆ KURWA\n\ni ain't even a football guy i just want poland to have ONE W",
            "Pawn Star reboot about Hololive Dodgers Trading Card",
            "All those acrylic standees and figures we have will probably be treated the same way by our grandchildren that we treat our grandparents' \"fine china\".",
            "Rushia's wedding rings will be sacred artifacts.",
            "100? I think it will be sooner, many 1980s-1990s artifacts already belong to a museum.",
            "We've had a couple of updates about Mio's condition recently. In addition to Subaru talking about going to Mio's place (alongside Korone and Okayu), [Korone also talked about Mio looking much better](https://www.youtube.com/watch?v=1UNxL5e5Jc4) about 6 days ago and [Fubuki went to Mio's place a couple days ago too](https://x.com/shirakamifubuki/status/1803780659196104920). They had mapo tofu together and played board games and talked about what they wanted to do in the future for hololive.\n\nEveryone's been saying Mio looks healthy now, Fubuki especially pointing out that she looks as she did before she went to the hospital during her blue Axotl stream last night. Though Fubuki didn't ask Mio when she was planning on coming back to streaming (because she doesn't want to pester her about it), but she did think Mio might come back soon. Korone also thought Mio would be coming back soon too, but didn't want to make a definitive statement and told any Miofa listening just to wait for Mio to make an announcement herself about when she's coming back.\n\nSubaru's the only one so far who I've seen a definitive \"Mio is coming back soon!\" from. Not sure if Mio told her something she didn't tell the others or if it's just Subaru jumping to a conclusion or what... though Mio coming back soon doesn't seem too farfetched anyway, since everyone has been saying how much better she's doing and she's been more active on her accounts as well. I hope she's good enough to come back soon!",
            "The stop motion stuff is great.",
            "Holy shit, stop motion!",
            "Really dig the video! Nice mix of styles.",
            "I see myself in the line lol\n\nHere is another angle in front of the clothing shop\n\nhttps://preview.redd.it/19bncmsgvw7d1.png?width=2560&format=png&auto=webp&s=b6586467b2b998c727bfc2de192803c66b20e4ed",
            "Mint doesn't know how to use Steam at all lmao\n\nDoki: \"What did you learn in the last 3 years!?\"   \nMint: \"Everyone did that stuff for me...\"",
            "I love these two dorks so much, their banter is always top tier imo.  I also love how they just get dumber around each other lol.",
            "[in coordination, Cover's notice of global expansion.](https://cover-corp.com/en/news/detail/20240622-01)\n\nIt says they'll focus on opening new fronts in East Asia and Europe.\n\nNo Latam mention unfortunately but there's hope if they succeed in their new ventures",
            "(I don't think so, I think it was more a global announcement in the english language.)\n\nI am still betting in that HoloID Gen IV this year.\n\nThat tribute to Sana... Tip my hat to mister Yagoo, never forgotten indeed.",
            "There's still the next ID gen that folks are also expecting to happen... but then again if the company really wants to go global... there's still potential underserved audiences in South America, Africa, etc. ? Who knows... but an ID gen was mentioned, and now there's Justice... was there something else also that I'm forgetting?",
            "Cool announcement video by YAGOO but everything here was already announced before lol, and to be frank doesn't interest me much as my oshi isn't involved in any manner, but here's to hololive production's future growth and expansion.",
            "The only country ever being mentioned before was Ame supposedly being british, I think, and \"Atlantis\".",
            "I think the \"using fictional places as stand-in for real places\" started with tempus. They have a joke \"northern elysium = Australia\" and since then they run with it until now it became more complicated.",
            "TEMPUS lore had regions/continents. But there's much TEMPUS lore I've forgotten that I'm not qualified to explain fully. There's Elysium and Xenokuni\n\nAlso The Cell is not in the Underworld as one would expect gods would send criminals to. It's specifically stated to be underground (highly likely to be under Japan since that's where Advent resurfaced)",
            "yeah tempus and armis has all that. actually the lore between the two pairs is very similar, and imho it worked perfectly for the guys. like I WANT to know what else is there. I want to see some corruption beast characters (sadly they are not pretty enough to be vtubers). it's simple but good enough to reuse it.",
            "There is a tipping point. I have no space anymore. I have at least 40 plushies, 20+ nendoroids and other merch, just from vtubers. And this is not counting the Gunpla and Evangelion angels I have (and many of which have been packed away to make space).\n\nI literally can't buy anymore because they would just be in their boxes.\n\nClothing on the other hand, especially subtle ones, *chefs kiss*",
            "I know that pain. Last January I had maybe 3 pieces of vtuber merch. I now have almost two display cases. It is an addiction, and I will not seek help",
            "FromSoft's dlcs have traditionally been harder than their base games, and this one boss is one hell of a difficulty spike despite being the intended first main boss, lol.",
            "that camera angle jank was criminal",
            "She mentioned starting a bit earlier then her usual times to be closer to the rest of Justice. Probably will end up in the same time slot as the rest of the US based girls",
            "Fauna is 3PM PDT, Ina is 2PM PDT",
            "I'm guessing Justice will do something along the lines of the stream relay that Advent did, where they stream one hour after each other at first. Based on the timezones they showed Gigi will probably be last.",
            "I really wish more Vtubers would do this too with a lot of their streams, but the videos usually don't get enough views to justify the work spent on making them. It's so much easier to digest an edited 30 minute video over 7 hours of raw footage.",
            "Hololive definitely seems to be doing a major change with these watch-a-longs. Calli doing one in the middle of her Elden Ring stream says it all that they are going against a more centralized approach to debuts. Have to appreciate them continuing to try new things out with these debuts. A lot of interesting choices in this one. Will be interesting to see how this goes.",
            "Tbh I'm not really a fan of watchalongs for debuts, i feel like it takes away some of the attention for the debuts in favor of those established. I guess they have the data that it drives engagement if they are continuing the practice. But I think it will continue to not sit right with me, along with shortened collab bans outside of genmates (less than 1 month).",
            "was there even any watchalongs for JP or ID members? other than Oga twitter spaces I don't remember any",
            "What a sweetheart. I hope she gets over her nerves. Im sure her and the rest of Justice will do great on their debuts.",
            "sure we'll do so.",
            "It'll probably happen regardless but i *would* appreciate a dedicated one so it's easier to navigate.",
            "Going by past hololive debuts, I think there will be certain users who will create dedicated threads for each member and post the links here to redirect the reactions.",
            "A dedicated discussion thread in the subreddit is the norm, but within this thread hopefully people stick to the whole, reply to the first comment about the thing/linking the stream that we usually do.\n\nIs been that way for the past few big events other than the wrestle mania thing with doki.\n\nI don't mind that amount of comments in the general thread, it's just a lot harder to look through past comments when they are all top level comments",
            "I think EN4 is big enough to have dedicated threads, and hopefully people will stick to them. I literally cannot escape any mention of them the past few days. Hell, posts about them from the main sub (which I’m no longer a part of) still appear on my front page for some reason. It’s overshadowing the content I’m actually interested in. Frankly I’m slightly annoyed, albeit irrationally.",
            "~~finally, a good enough reason for me to *rewatch* the thing~~ \n\n*having literally* just *used subaru's old re:zero s1 watchalong as an excuse to refresh my memory for season 3*\n\nmy sleep schedule: ah shit here we go again",
            "Is it members?\n\nRip, I can't watch it rn... Might have to hope for clips. FMAB is a goated anime.",
            "She finally met him, >!Shou Tucker!<.\n\nAhh, the trauma but at the same time, I want to see Subaru's reaction...",
            "Well, christmas certainly comes early this year, lol.\n\nEDIT: Thanks Zeta, you have turned this weird christmas stream into a horror stream, LMAO.\n\nEDIT: So we have korone christmas tree merch! ... In June. I have soooo many questions about this, lol.",
            "Sometimes they outrightly say it or make it obvious. Sometimes its more of someone who got them to know hololive. Some of them also have a few oshis obviously.\n\nWhat i know / remember \n\nChloe's is Shion.\nLaplus's is Towa.\nIroha's is Suisei. I think Ina and Calli's too.\nRaden's is Aki\n\nGura says watching Aqua pulled her to the rabbit hole. Marine says Aqua inspired her.\n\nAo and Ririka has also mentioned they were inspired by Pekora.",
            "I'm pretty sure Lamy's oshi was Marine (these days you'd hardly guess they are anything but equals though) and Iroha's oshi is Suisei since before Suisei became a corpo vtuber. Laplus is well known for being a Kenzoku. I actually can't remember if Suisei ever said who her hololive oshi is...but I do know she wanted to play with Aqua since before she was even redrawn by Teshima Nari. Miko's oshi is Sora.",
            "Ina has mentioned watching and being a fan of both Fubuki and Suisei before she joined Hololive",
            "There's [this](https://www.reddit.com/r/Hololive/comments/1947ia2/do_we_have_a_full_list_on_which_hololive_member/kherc3a/) list from a few months back",
            "iirc Watame's was Okakoro I think?",
            "anya's oshi is fubuki. she pretty much made it clear since her debut stream",
            "I don't think either of them have used the word oshi specifically, but Gamma was a fan of Roberu's and used to watch him while at his old terrible desk job (I can't find a clip but he's talked about it a few times), and Fuma [fanboyed out for like 10 minutes straight](https://youtu.be/PTFkxx7xgfc) the first few times Astel showed up in his chat.\n\nAnd in case you somehow didn't hear LOUD DINOSAUR NOISES, Jurard's oshi is Pekora.",
            "I think FuwaMoco's may be Marine? But their answers have kinda shifted on occasion, so hard to say for sure.\n\nFauna's was Gura I'm pretty sure.\n\nAnyone know Bijou's? I know she straight up became a Vtuber because of Hololive, but not sure who her oshi was in particular.",
            "To rattle off a few, Mumei has said that Korone was her oshi prior to joining Hololive. Jurard said Pekora is his oshi during his debut. I don't know if its ever been confirmed but Roberu is often said/joked to be Bae's oshi from before she joined Holo.\n\nAlso it's worth noting Nerissa has multiple oshi's and I believe calls both Kiara and Marine kamioshis, distinguishing them by branch. I don't think she's stated if she has a preference between the two. \n\nApart from ones others have mentioned, for a lot of members we might know their oshi but don't have confirmation whether they were a pre-debut oshi or not.",
            "IIRC Kaela said Miko was her Oshi.",
            "Noel's oshi was Ayame",
            "Fauna's is Gura,  \nMumei's is Ina,   \nKaela's is Watame",
            "I don't remember if Gura PL mentioned it but when in Holo, her oshi is Aqua, she's mostly been gushing about Marine, Okayu and Shion over the years though, mostly Marine but not sure if it's because they're just closer",
            "https://preview.redd.it/9r5gvoq6t38d1.png?width=152&format=pjpg&auto=webp&s=572257b9f365a67ed21570b63bcff6896226bfc2",
            "I fear for Patches if she ever meets him.",
            "6 hours after the match to sleep - plenty",
            "mainline energy drinks coward",
            "I'm pretty sure that so long as they're different sections of Hololive, ie JP, EN, and ID, they're no longer beholden to not stream anymore. This was like ages ago, right?",
            "Damn that’s early, I hope I can wake up early enough to catch it. Where can we check the names of significant participants btw?",
            "As someone not a Sonic fan, the reemergence of Sonic besides it's games is the \"Sonichu Medallion\" in mainstream internet which strikes fear in my heart, i regret going down the rabbit hole",
            "Altare joined the VC of Bettel and Ruze in their ER runs >!and just malding!<",
            "I'm sure it's standard cover practice to have debuts to happen at 8pm PDT",
            "since people say half of them don't live in eu, and currently none are in eu, the whole time zone discussion is getting pointless. it's absolutely hilarious that people are already getting mad at cover for not being eu enough or something.",
            "With the screenshots of that Employee meeting with them cheering, it's looking more and more like a religion (jokingly)\n\nLemme pull it up in a sec\n\nEdit: here, it's declaring World Domination\n\nhttps://preview.redd.it/3ea47kps228d1.png?width=1200&format=pjpg&auto=webp&s=1b97a9ac22d42948e982938d8faecb0a142c8b41",
            "At this rate should be a cult tbh lol",
            "I thought there was a rule against overlapping same branch debuts/3D debuts. Advent's watch along makes sense since it's the official channel, but it's fine even if it's a watchalong in the middle of a regular stream?",
            "During her graduation, she expressed that she wants to grow as an artist. Whether that means stopping doing models, we'll see.",
            ">!There shouldn't be issues on Cover's part, Ina is still doing illustration work for Azur Lane and FGO. If anything being based in Japan would give her even more opportunities to work as an artist!<",
            ">!there's a handful of vtubers that graduate and continue using the same account for work/etc (ex. Chiika and Sachimu come to mind), not even necessarily cause they debuted with a company. So it's not impossible for her to use the same account for posting art, as long as it complied with noncompete or whatever!<",
            "Monochrome/White version of the outfit\n\nI appreciate that holo does alternative colours for their outfit these days",
            "For HoloHiguchi (Akiroze, Aruran, Higuchi), they won all 3 of their preliminary rounds. Currently waiting for the next round.",
            "Do you use Firefox? I am having the same issue and got around it by viewing streams through Holodex. You can use multiview and input the url for any stream or video on YT.",
            "That's quite the amount. Is it enough for a proper mid end gaming pc + streaming peripheral? I wonder if that includes needing to purchase an iPhone",
            "Wonder how she’s gonna set that up. GT7 don’t have that big of a time limit so her best shot is setting it at 200 laps. But even that’s not enough to cover 24 hrs.\n\nE: Nvm I guess I’ve been away from GT7 too long. It’s set for 24 hrs.",
            "Yeah, I don't mesh with Vesper and Magni's PL as much. There's a few others but in general the ones I stop watching change up the games/content they play or become too unhinged for my taste.",
            "It's like when you felt very nostalgic with your friend in high school, but when you try to catch up and hang out with them again, it just doesn't hit the same. It's not just the person, it's more of a combination of the setting, the circle of other friends, and all the other stuff that felt special only at that specific period of time. It's truly a graduation in a sense, you know you CAN see them again if you really try, but things just aren't the same.\n\n...at least that's how I feel about it, and I guess it's fine to just let go.",
            "Anyone who switched to Twitch I don't watch as much, because Twitch has an awful player with so many ads I literally don't understand how its usable for viewers. I swear it wasn't this bad 10 or even 5 years ago.",
            "Most of the people I used to watch have switched to Twitch with their new personas, which has taken away some enjoyment. Even though i'm getting used to the Culture  it doesn't feel quite the same",
            "It happens. Sometimes you like the constrained version more (if they're graduated from corps), or you liked the unrestrained one more if they went the other way. Or they may feel a need to reinvent themselves that takes them out of your strike zone.",
            "Yeah, I use to watch coco, and cried at the graduation, then watched her a little bit when she returned as kson, but it’s not the same. I still like her, but don’t nearly watch her as much.",
            "Kind of a different case for me since my oshi is still active as both other persona/identity and corpo (corpo came later). I first came to know him from his corpo persona, so that's what I'm most comfortable with. in fact, I didn't bother with his other persona until quite recently.\n\nI found right away that I don't enjoy his other persona's content as much as I do with his corpo one. I still watch it sometimes, his personality is more or less the same. It's just that in his other persona, he mostly does collabs with other people (a quite big group), I don't know much about them yet to care, and I don't bother to learn about them, so I don't enjoy it as much. Maybe I'll try if he graduates corpo.\n\nAlso, >!as much as I love werewolf-like games, it gets boring if I have to watch it every single day.!< And more of a skill issue, everything is in Japanese, and these games require a lot of talking. My skills aren't that good yet so I'd prefer some translation on what's happening to cover what I don't understand, which I don't get with his other persona (or maybe I just haven't found it, I don't know).",
            "it varies for me\n\nfor example, i enjoyed people like >!FWMC, shiori, and mumei!< because they brought something new to the table/further imrpoved their craft as content creators. i also enjoyed >!maid mint ever since she returned!< because she more or less stayed the same as a lovable idol fan and goofball. on the other hand, i leaned away from >!kson!< because the promise that she’d be able to creatively express herself after leaving was disappointing because she just ended up staying the same and i expected more from her",
            "Two actually.\n\n>!I liked watching both Vesper and Nina (Nina only rarely, admittedly, but I did), but on the contrary I was never really able to get into watching Randon or Matara. Matara especially I just really dont like her model too, idk even know why, I just dont like looking at it for any amount of time. Altho her switching stream-times was probably the major reason.!<",
            "I was kinda worried about that this would happen with me when >!Erika returned as Kanna!< but she more or less stayed the same. >!The only thing I kinda miss is the moe gap between Erika's mature design and her personality, but Kanna's design is good, and it helps that she had a lot of input in her design so I'm happy about that. I kinda wonder if she ended up in Hololive I'd feel the same since small corpo and a big corpo would have completely different cultures and I wonder if she was given a chance to be a holo but ended up declining because she preferred being small corpo, taking into account how EN4 is EU focused. But that doesn't matter much anyway and is me making up rrats for no reason, she's doing good where she is now especially since she was the main driver in the creation of the VSMP Minecraft server that's getting a lot of activity currently.!<",
            "A certain dragon for me, for the same reasons others have mentioned.\n\nOn the other hand, my vsinger oshi went from small corp to small corp (previous corp died) and I enjoy her just as much on both. It might be because her main content doesn't rely on other people much, but the only thing that changed was her model (even though I do like the previous one better), her content and personality are basically exactly the same. She's also doing like 4x better than her previous peak in terms of subs, the new company is providing a lot more support, most of the older fans followed her over, and she's even managed to capture a few big-name illustrators as fans so she's really thriving now, and I'm happy to see it.",
            "There's a lot of vtubers that I sort of follow but not regularly watch, just once in a while or for collabs, and definitely when their situation and surroundings change it kind of puts a damper on things. Like, none of the former Niji ID people are *that* different from before (well, a lot of facecam/irl presence might put people off) but before they were part of a 'thing,' and now this thing is gone, and it kind of sapped my motivation to keep up with them. It probably doesn't help that a lot of the ones I followed are not very active as indies anyways. If they only stream once a month you just kind of...move on.\n\n  \nThere's also some people like Henya and Matara who changed their active hours. And it's a smart business move, there's a reason why there are ten million streamers active during evening NA times. But the old timeslot was definitely one of the reasons why I was watching them in the first place, and now they have endless competition, so only being kinda interested in them basically means I will never tune in because there is always a competing stream to watch instead.",
            "nina seems less stressed now so I'm happy for her. also i like the streamers that she hangs out with so that's nice (anyone cool with vinny melpert vinesauce is cool with me)",
            "I won't touch on their previous identities or even name which ones, but 2 of my 3 main oshis right now are reincarnations of older oshis I had that graduated.\n\nThere were many things both lost in gained in both reincarnations. \n\nOne was a reincarnation from indie to corp and into a very specific role within that corp too. While they are generally really lax in what they let her do despite being a pretty major corp (not major within VTubing though) it's still very noticeable to me the ways she's changed through becoming a part of this corporation. I really appreciate all the things she's become able to do with all the extra support, and she seems really happy with where she is so I'm very happy for her, but there are still always moments where I feel a bit of a sense of loss of what she used to be like. Regardless I don't see myself stopping watching her or supporting her.\n\nThe other actually went from indie to indie for a myriad of reasons I don't want to delve into in respect of her privacy but the gist of the reasoning behind her reincarnation is there was a lot of baggage with regards to her image with her previous identity and she wasn't able to become the VTuber she had desired to. So she took a fresh start and it's very clear and easy to see the efforts she's taken in order to be more like the VTuber she's always aspired to be. She also seems to be very happy and I fully support her in her endeavors but I do find it a little sad both that she was that unhappy with how her previous life had ended up when I loved her that much, and also with her new image it also means she'll be doing a little bit less of some content that I really liked before and more of my least favourite type of content (but her main content is still my favourite type of content so I'm definitely not going anywhere at all).",
            "Yes\n\nEvery identity/character is a different experience, even if it is the same person behind it",
            "Lucky enough I haven't experienced this, with the exception of if they also change the way they talk to something irritating. Also if they switch from yt to twitch after reincarnating I happen to watch them less.",
            "Vezalius Bandage. His debut made all my French genes cringe.",
            "Very common. I remember seeing a post here referencing an old fan of Biboo before Hololive for example.",
            "Not really, most because I consider them to be different entities.",
            "Unfortunately, yes. I think it's mainly because I've been watching small indies since before big corporate EN VTubers even existed, so I've become so used to smaller, more tight-knit communities and loose indie culture that I find it harder to vibe with the larger, more detached ones that often come with reincarnations.\n\nEven if the content creator themselves is no different, everything else surrounding them changing can definitely alter my enjoyment. I dunno, maybe I place too high an emphasis on community, but that's just my own personal feelings.\n\nHoloAdvent PL talk: >!To be 100% frank, as much as I love Shiori herself and am happy for her success, I do miss the unique individual connection she used to have with her smaller community as Natsumi Moe. I'm grateful that she still keeps in touch, but the shift in community culture, her stream time slot change, and the improbability I'll ever get to see the amazing chemistry she had with her OG EN VTuber friends (who I mainly watch besides her) again do put a damper on my enjoyment.!<\n\nEdit: Words",
            "It is honestly a weird expectation to think that their new corpo/indie self would be the same as their old corpo/indie self. I mean obviously the restrictions for being in a (especially big)company will change how a streamer operates versus how they do by themself. As others have said here, many former corpos returning to the indie scene haven't really bothered taking advantage of their new found creative freedom. Staying in their lane a little too much. Doing to much of the same with little variety. Whereas oddly enough, being forced to work with restrictions has made for better streamers for those in a company. Clearly more creative in what types of streams they do. Seems contradictory at first but it actually makes sense.",
            "i have the opposite! doki being the big one, even tho i enjoyed her a lot in her previous iteration i and many others could tell she was being held back and would never be able to achieve her full potential so i cant wait to see what she does in the future now that she basically owns her own company \n\nmatara as well, i enjoy her content more now than before primarily cuz i like how she just dives head first into a topic and is overall just seems happier which i love to see\n\nmaid mint as well, seeing her clearly fall in love with streaming again has been amazing and i pray to god she sticks around beyond just this summer   \n  \n \\[theres a bit of a common theme between all of them here as you can maybe notice\\]",
            "personally never watched vtubers in another identity. I subbed to some but that was it.",
            "The bird model just fits her so well; that whole bit was hilarious.  It's seriously like a bird just magically gained sentience, complete with her being confused about where she is and everything lol.",
            "That stream, and especially that moment, has been living rent-free in my head ever since...  the stupid \"CAWW\" gets me every time.",
            "This is such a good vibe, just three dudes hanging out ~~struggling~~",
            "She's definitely asked chat (and possibly made a poll) before.\n\nBut more recently, she's asked if her viewers are watching at work (PST/EST viewers) and there definitely is a large amount of those, myself included.",
            "I vaguely recall her mentioning that she had more NA fans than EU fans, but I wouldn't be able to provide a timestamp.",
            "Not really. She had polls about stuff like \"have you ever watched me while at work\", but not about location, and she once said she has basically never actually checked her viewer-demographic in youtube studio regarding age, gender or location.\n\nWe did a couple community-polls regarding those but how representative those are is another question ( EU-viewers were mostly between a quarter - around 40% of those, slightly more if you include MENA)",
            "Pretty sure they're discouraged from discussing that since the taiwan fiasco",
            "Never. All extrapolations about audience come from superchat currencies.",
            "[Lunlun’s debut right now!](https://www.youtube.com/live/jDpZnGygy7w?si=EMkP143BmumysQuR) This is the one I’ve actually been looking forward to.",
            "The baby boss was a genuine terror. Like it was so unsettling. Sending my energy since I can’t watch live.",
            "Also streaming or starting soon:\n\nV&U: [Cerenity](https://www.youtube.com/watch?v=Ltx1E-FMfjs&feature=youtu.be) and [Ciccino](https://www.youtube.com/watch?v=8hMrzNxQWtY&feature=youtu.be)\n\nVReverie: [Furi](https://www.youtube.com/watch?v=A6DFfdkC6i4&feature=youtu.be)\n\nEien: [Navi](https://www.youtube.com/watch?v=siCPChKzSeM) and [Amora](https://www.youtube.com/watch?v=DU_bvZyZHxs)\n\nV4Mirai: [Mono](https://www.youtube.com/watch?v=TlSRFTDvamU)",
            "dunno about Yakuza but jrpgs were always super long. I just finished two suikodens this year and each took 70 hours to see everything. and from the tiles she's in post game already.",
            "It's not that long actually, I think an average playthorough is around 25 to 30 hours. Maybe she did a lot of zatsu in between?",
            ">!Yeah. I tuned in to Ruze’s ER stream and he had Bettel in VC while fighting bosses. Both were malding so hard, especially Bettel when he got to Messmer LOL. He definitely needed that break.!< \n\nYou got this, Bettie.",
            "Currently in the stream, she's working with EdgeDriveArt to draw some *Ring Racers*-styled sprites of herself.\n\nhttps://preview.redd.it/b625okbroy7d1.png?width=1631&format=png&auto=webp&s=97666af47a3e9ce1430164d93d2b0fa7c8ad3401\n\nThat reminds me, aside from her, are there any other VTubers out there that have played *Dr. Robotnik's Ring Racers*?",
            "Dunno. As an EU HoloPro fan I'll just take what's given. Maybe they just like to drum up pointless drama like people usually do or are just throwing a temper tantrum over another promise that was never even made? To me it just seems like crying over spilled milk. Even if Cover were to fail to deliver enough talents for EU viewers to find their oshi in and watch live at sensible hours there's always vtubers streaming at EU hours outside HoloPro too. No point in getting angy over it... already got used to the situation.\n\nWhile I see folks saying that the debuts are happening in NA prime time or something to me the explanation that it's just once again more like that it's about it a time convenient for the JP staff to support the debutees.",
            "For me, I just want to see streamers at decent times instead of the the usual 11pm-6am slot. An ex-pat european member streaming at PST times would be a real monkey paw's situation because that slot is already well catered for. I'll be delighted if things change with this new gen, but I'm really not expecting them too.\n\nAt the moment the EU fanbase is in a weird anxiety state of \"Can we get excited for this? Are they all european? Why are they debuting at 4am? Based on tweets, some definitely aren't in our timezone?\"",
            "They're like most other niche fans who want desperately to be seen as important. Some might also feel betrayed by Kiara whose stream times don't necessarily cover all their times, and may feel a bit bitter that she's not catering to them more.\n\nVesper did try to do EU friendly streams, and they're convinced that Cover hates them all personally for not setting up shop in Europe, never mind that EU is a minefield with regards to legal and logistics requirements because of how both EU and local member states may have laws that contradict with regards to content requirements as well as labor rules. Cover may be expanding, but they're not going to just jump into a market blindly because a few dozen or even a few hundred people are endorsing it.\n\nJustice may be a step in that direction.... but we can't be sure since they've yet to debut or share their streaming strategy and general schedules\n\nAlso, they definitely have a legitimate beef with regards to merchandise shipping being either extremely costly or not available at all from the official stores. Cover only started to fix the NA situation earlier this year, and EU hasn't seen any signs that they'll get a local hub to cut costs from ridiculous (being as much or more than the merch) to merely expensive.",
            ">but you have to understand that they just want to maximize viewership\n\nMaximize viewership in a time zone they won't be streaming in - so both fans and people who might be caught by the algorithm won't see them live, thus limiting potential reach. \n\nI'd say that after 4 years of being showed middle finger in terms of streams, having show another when it comes to trailer and third with debut times, that might leave EU based fans a bit peeved. \n\nAnd then we have NA fans going with 'now it's your time PROVE YOUR WORTH!' and while I'm sure EU fans will come around, for people who don't stick with Holo it's on Cover to show why they should pick them over many excellent options we have nowadays.",
            ">but you have to understand that they just want to maximize viewership\n\nbecause I dont think that argument makes any sense looking at the long-term prospects.\n\n*Assuming* they are, all this means is that alot of people will watch their debuts that wont be able to watch them again afterwards, and similarly alot of people that could potentially actually watch them afterwards are immidieatly deterred from checking them out at all.\n\nDifferent example:\n\nImagine you're about to debut a Vsinger, but you're unsure about how popular that content would be, so you present them as an high-level FPS-streamer in the debut instead. Yeah that means you get more people to check out the debut, but you still basically attracted an audience unlikely to actually watch them more *post-*debut\n\nMaybe Covers internal data tells them that just having Eyes of *any* kind on the Debut is more important than the eyes of who you want to reach specifically (again, assuming the assumptions are true, not like this SUb hasnt been horrifically wrong about PLs plenty of times), I cant know that, but as an outsider I find it weird.\n\n>I’m sure she’ll adjust her streaming times to be EU-friendly\n\nConsidering that'd mean consistently not even starting before 1 Am I find that somewhat unlikely\n\n>>!Was Yuniiho popular in EU, or was she still more popular in the US?!<\n\n>!I dont think anyone that doesnt have access to her twitch-statistics can answer you that question.!<",
            "european hololive fans: man I really wish there were more hololive streams we could watch live\n\ncomplete weirdos on reddit: whatever the fuck this is",
            "Why would it only be EU people questioning Cover's decision to debut a presumably \"EU focused\" gen on one of the absolute worst time for EU to watch, the ones who CAN catch the debuts will be informed that they are only used as debut numbers if they do end up streaming at different hours soon after.\n\n\n\n\nNotice how i use the word \"presumably\"? I'm too jaded too say that they are definitely going to finally stream at my hours since i really don't trust that Cover will put any effort towards doing that, hell Vesper was even dissauded from doing so when he was around.",
            "The aggressive comments you do see is in the same vane as entitlement in other regions of the fanbase just exasperated due to circumstances.. Europe is not prioritized on many different aspects whether it being time zones or merch. You see it to lesser degree with NA fans regarding those topics. It just doesn't have as much impact as the geography does allow them to at least somewhat accommodate half the world. Hololive has internal data on their demographics so they probably know better than most where the fans are.\n\nOne of the replies is direct but probably correct in that Hololive does not see maximize potential audience in doing it during the evening in Europe. For perspective here:\n\n8PM CEST = 2PM EST = 3AM JST\n\nEdit: Also note it isn't exactly the optimal time for NA either starting at 11PM on the east coast.",
            "Because ID and the rest of EN didn’t have to “prove the market” before getting debut times friendly for their audiences. Kiara remains extremely successful in the wider market despite not streaming at a US or JP friendly time and Globie is putting in solid numbers.",
            "[deleted]",
            "is it even europeans? people saying cover is backtracking because it's not full eu, like they ever promised anything about it, is some prime schizoing. but hey I have several men streaming in eu times every week.",
            "It seems they are more worried in proving that EU matter than anything else and Cover not submit completely to their fantasies hurt their ego. Collectively speaking that is just the loud minority as always.",
            "Entitlement",
            "A crumb of context, please, the children are starving",
            "I don't know if it's just me but this comment is incomprehensible",
            "https://www.grammarly.com/",
            "I'm not sure what you are insinuating, but it's the debut period, and advent hitting the milestone was different because they were teased weeks before debut(remember they were teased at the end of connect the world). Justice is more of a stealth drop. We had no idea they existed 20 hours before the trailer.",
            "You are asking to explain a black box so don't expect a complete answer. YouTube has purged some subs a couple of times but nothing massive so far. Could be as simple as less hype as Advent with the 2+ years of anticipation. They are hitting similar debut stream numbers as Advent with maybe even slightly better turn out on watch-a-longs so not exactly a big issue atm. ReGloss got completely destroyed with purges. Pretty sure they were hitting 100k a day after debut.",
            "They just debuted mate",
            "> It is not like it is that important \n\nIt isn't. We don't have to worry about sub count speed like we're shareholders. Just enjoy, and the subs will come if they hit the right luck. Being in Hololive gives them name recognition and a built in base at the least.",
            "It's a rising tide raise all boats situation, Myth had Gura and Calli reach mainstream thus boosting everyone's subs to an insane degree, FWMCO is the second for Advent, let's wait and see if one or two of them goes viral, get a significant boost and lift the others as well, if not that's fine as well anyways, they'll still grow, you'll definitely see Liz get a big lead if she ever produces many Covers, see Nerissa having more subs than Biboo and Shiori\n\nAlso it's crazy you call their sub low, that's their sub count just 1 day after debuting",
            "I'll make a less snarky one. 200k and lower side can't be put in the same comment without sounding crazy. so don't be surprised people will be annoyed to read that.",
            "[Here is the English version](https://cover-corp.com/en/news/detail/20240622-01)",
            "never",
            "They can get their W against France… >!omg who am I kidding!< \n\nHonestly, I really pity Poland. When it’s Euros or the Cup, they always be choking at the group stages.",
            "it'll mostly be yellowed by time and kind of worthless",
            "Special grade cursed object you mean",
            "> less than 100 \n\nI covered my ass!",
            "The *sounds* when she realized Mint didn't know how to change her privacy settings lmao.",
            "the single braincell gets split in half when they're together",
            "I really hope one of the first things they focus on is getting that EU shipping established sometime soon. As someone who has spent a small fortune on merch being able to skip proxys would be great.",
            "Latam shouldn't even be a thought for them right now. Gotta get a solid foothold in Europe and other eastern pacific countries first. Bigger market and all that.",
            "What was the Sana tribute? I must've missed it",
            "They need to factor in the spending power and the average disposable income of each region. There is no point in expanding to a region just for the namesake of going 'global' if that region has no spending power.\n\nHere's an interesting sheet about the [World Disposable Income Per Capita By Region](https://www.eia.gov/outlooks/ieo/data/pdf/A_A18_r_230822.081459.pdf). I'll write out the 2025 predicted data for individual regions those that don't want to open the link:\n\nRegion: | Est Avg Disposable Income 2025\n-- | --\nUnited States | $49,193\nCanada | $28,073\nMexico | $15,608\nBrazil | $11,582\nOther Americas | $3,709\nWestern Europe | $24,232\nRussia | $16,287\nEastern Europe and Eurasia | $9,839\nJapan | $24,037\nSouth Korea | $22,960\nAustralia and New Zealand | $32,360\nChina | $12,236\nIndia | $6,308\nOther Asia Pacific | $6,319\nAfrica | $1,703\nMiddle East | $5,290\n\nBasically from this chart, you can see why an entertainment company like Cover would not care about getting into Africa whatsoever. The entire continent has extremely low disposable income per person. Similar case with South America, although we do have Brazil and a somewhat standout spender.\n\nYou can see why NA is so appealing for companies to expand into. With the US alone, for the price of dealing with a single country, you get a population of 330m+ people with more than double the disposable income of Western EU's population of roughly 300m people. And they don't have to deal with the red tape and differing regulations of a ton of different countries. Throw in Canada (40m population) and you've got an extremely sweet NA deal.\n\nAU's got very strong spending power per person as well, they're just held back by population number (about 30m for AU + NZ).\n\nChina's spending power looks relatively lowish, but they have an insane population number to multiply that with (1.43 billion) which is why they're so appealing to expand into.\n\nOf course there's other factors to consider, like the conversion rate of getting people to spend on digital goods rather than traditional merch, how much VTubers can actually penetrate the market or go mainstream, etc. But yeah, this should give you a rough overview of which regions are appealing for Cover to expand into, and which regions just aren't worth trying.",
            "No global but they had a japanese audition call with the DEV_IS hashtag some months ago\n\nEdit: kinda global since DEV_IS is unorthodox, could have more east Asians joining under it to stream mainly in japanese",
            "It's a flex and a more palatable way for tourists to consume loads of Info while simultaneously shilling everything including Justice and from Yagoo to boot, now no way will anyone forget about it",
            "the arknights formula!",
            "The Badlands was a new location introduced during Armis' announcement. \n\nIt's essentially just a dessert/mesa biome.",
            "It's implied that all of Vanguard are slowly being corrupted (Hakka and Bettel's hands turning black, Shinri's half-monstrous arm, Flayon's hair turning black) so I feel like they could make a dark-themed corruption beast wave work.",
            "I saw a joke tweet about how Justice and Armis have the exact same member.\n\nRedhead leader? Check.\nExcellent artist? Check.\nMusic-theme and puppet-theme in one person? Check.\nThat one person who looks like the feral of the group and has cookie&cream hair? Check.",
            "I wish Holo would keep the plushes smaller and save us some shelf space lol. When I ordered the Myth mascots eons ago I didn't pay attention to the size, so I was shocked when a box the size of a mini fridge showed up. Now I've got Promise and Tempus on top of that, plus all the miscellaneous other plushes.\n\nI'm sure others disagree, but the size of Gura's shrimp plush and Selen's Ember plush is a lot more ideal for me.",
            "The struggle is definitely real",
            "Seems like that to me as well... in my part of eastern EU we're living between +2 and +3 GMT so 9 PM GMT is closer to midnight. Seeing that the collab with the rest of them is earlier perhaps might mean that the rest of them streamer earlier. We'll see.",
            "Close enough, the day always starts with Kiara, to Ina/Fauna then it's a overlap of the others then ending with IRyS if the others don't stream for long which they do with Calli, and Biboo\n\nFor reference, I'm SEA so i follow JST, Kiara streams at 2am for me, the only perfect stream i never miss because it's ideal to me is FWMCO Morning which is at 11pm lol",
            "Tons of vtubers do it though, it’s actually a decently common thing. Of course some just rely on official clip channels.",
            "Yeah, I like to experience big things like this on my own. If something I find particularly interesting happens I might go and see the watchalong reactions, but I'm not too interested in trying to balance audio and comprehend multiple people at once when I feel like the original stream deserves the most attention.",
            "More people watching them overall is waaaaay better than just having slightly bigger numbers on one stream.\n\nLet's just say, for example, that they would've been at 100k viewers with no watchalongs, and 50k with watchalongs. \n\nAt first glance you think \"wow watchalongs really screwed them over!\" \n\nBut then you realize that combining their stream along with the watchalongs means now there's a total of 200k viewers which will likely increase the amount of subscribers/ long-term viewers, not so bad now, is it?\n\nDon't forget that success in streaming is strongly linked to being discovered by the right people, so the more eyes on you at any given point the better.\n\nIt's a similar logic as clips, clips may detract some views from the stream, but they boost the streamer's visibility to a wider audience which is what actually matters.",
            "I wouldn't watch if not for Armis watchalong so they got +1 at least",
            "ReGLOSS had watchalongs, both officially on the hololive channel and also there was a watchalong on Suisei's channel. \n\nI don't think watchalongs were done before Tempus debuted and most of those have been on the official channel. So ReGLOSS is the only gen that would fit the criteria of watchalongs for JP/ID members.",
            "Stream watchalongs weren't really a thing due to overlap rules, Tempus was the first I recall there being one on YT and the only non-EN that's debuted since then were ReGloss who did have some watchalongs",
            "No, it's not a members-only, Subaru's friday watchalongs are public.",
            "It's actually a big brain move. She put it out now since it will ship near Christmas.",
            "Since you mentioned a majority of HoloX, gonna piggyback and add Koyori's oshi is Pekora well, she was a hardcore fangirl in debut like Kiara was over Pekora",
            "Biboo always mentions everyone in EN+ Kaela or whoever's been kind to her recently. [Some](https://www.youtube.com/watch?v=WdY3kksUKj8) [links](https://www.youtube.com/watch?v=Nv3mgUMzb7s)",
            "Fuwawa's is Marine and Mococo's is Polka. I think beboo 's is Ina, but I am not 100% sure",
            "It's Ina",
            ">ever been confirmed but Roberu is often said/joked to be Bae's oshi\n\n~~That's what she said on her debut. She mentioned both Roberu and Subaru iirc.~~\n\nEdit: I didn't remember correctly. She just mentions she watches them a lot, and also puts Marine on the same level. In another stream [she mentioned she doesn't have an osh](https://www.youtube.com/watch?v=yzD17H90cgA)i though.",
            "[right, but not ages ago](https://note.cover-corp.com/n/ne9a79eca8b99?gs=1a9ad2f9a21b)",
            "For the girls, they still try not to stream at that time even though they are from different branch. Koyori supposed to stream at 12.00 JST today if you looked at her schedule earlier this week but she changed it to 13.30 JST after the Justice debut announcement. Subaru will also start her stream at 13.30 JST which is later than usual for her Saturday stream. Although in Aki's case, she can't do anything about it because it's a 3rd party tournament.\n\nIt's just like for 3D birthday live which most of the girls try not to stream at the same time if they can even though there is no rule for that.",
            "Not sure, it looks like one of those tournaments where you need several rounds before you get what's what. Also there are three rank categories afaik and HoloHiguchi is in the highest one",
            "The curse of that medallion needs to be researched.",
            "It's like the clowning around competition with Bettel and Ruze egging each other on in trying to find the goofier sounds to make.",
            "That standard only started with Tempus VG and carried on to Advent and now Justice.\n\nTempus HQ was also in NA prime time but a few hours earlier.\n\nCouncil was a full relay that started at EU prime time.\n\nIRyS was in NA prime time, same slot as Tempus HQ I believe.\n\nMyth was a semi-relay, with Takamori at JP prime time and then Inamesame at EU prime time.",
            "I mean I guess it is now but one can disagree with that standard practice surely? There have been EN debuts at much better times for EU in the past.",
            "> and currently none are in eu\n\nWho is saying this? If anything [this particular art](https://x.com/hololive_En/status/1804031501505564847) shows that 2 are currently in EU.",
            "Always has been.",
            "If those 90 minutes are dedicated to the watchalong, it should be ok. That still keeps the attention towards the debuts.",
            "Given that Cover is allowing anyone to do a watchalong this time around regardless of any company affiliations it would be slightly odd if Calli couldn't.\n\nNot like super odd, but slightly.",
            "The point of overlap rules is to avoid taking viewers away. A watchalong (without audio, so viewers have to open both streams) *increases* viewers.",
            ">!Is Ina working as Ina though? If yes that's awesome and I hope Yunii's new self has similar opportunities. But if not, the thing is that Yunii doesn't have a side account to post her stuff on anymore. At least not one that I know of. It really doesn't look like she's going to do anything as Yuniiho anymore. !<",
            "Yeah, its an easy way to make an outfit look different.",
            "Nice! I woke up too late so I only caught Higuchi’s round.",
            "I can do that for sure, but it doesn't fix the issue of FF and LiveTL. I can live without the embed TL, I think, but I'll definitely try it, though.",
            "I've heard Magni's PL is looking to go back into Vtubing, you think people will check back on him and stay if he channels some of his Magni content back then or is it the Kson situation where the environment and interactions, including the management restrictions that made people love him? Frankly I never checked back on him first because it's on Twitch and i didn't like his PL content one bit including the YT ones",
            "I've definitely seen some people express the sentiment that graduations are meaningless because of how often people reincarnate (e.g. [this Furi clip](https://youtu.be/50e2C3ijz0Y?si=x8-4un3gPJofJ185)) and while I see where they're coming from and don't entirely disagree, I think your comment echoes my sentiment on why graduations still have meaning. It's the end of a persona that the vtuber and their fanbase have probably become pretty attached to. It can also be the end of them publicly affiliating with certain people (e.g. others in their corp if they're graduating from that corp, or some of their old indie friends if they're an indie moving to a corp) and can signal a change in content or in general vibes. It also means a change in community, since only the more hardcore members of their audience are likely to look for their reincarnation and more casual fans will move on and maybe become part of the community again if they find their new persona by chance. \n\nThere are certainly graduations where the person decides they just don't want to be a vtuber or online creator in general anymore and rides off into the night never to be seen again. But for a lot of graduations, they're not a goodbye to the person as much as to the circumstances that person finds themselves in.",
            "The same... >!with both Coco and Vesper!<. It's just not the same. Which I think makes perfect sense in that the people we are around with do to some extent define us as well. Outside HoloPro obviously one can't take advantage of the things that can only happen inside HoloPro but then again also there are things one can't do inside HoloPro... just a trade-off.",
            "Same for Coco. I realised what I liked most about her was the whole \"fish out of water\" thing. A foul mouthed dragon in an idol company just made for many comedic moments. I still like her now, but there's llittle difference between her content and the others of her group so there's less \"shock comedy\". There's no \"Would they dare say Motherf**ker?\" speculation. They all would.\n\nIt's just like when a lead singer splits up with a band and forms a new group or goes solo, and often times their new songs / style don't hit the same spot",
            "I was so happy that she invited vinsworth to play l4d2 again",
            "[This video](https://www.youtube.com/watch?v=N1dhMR-ZyaA) is my headcanon: a crow ate Dokimato and absorbed its consciousness",
            "Group VC ER sounds very fun, but I'm already watching Ina's... I'll watch these guys later in the weekend...",
            "I remember something similar. Thanks.",
            "I didn't think Holo forbid them to talk about this because Fauna talked about it just several weeks ago although she didn't mention every country on her list and surprisingly she have a high number of JP viewers.",
            "She was definitely not a fan. lmao",
            "That is very valid and solid comment about the situation. And indeed, there is legitmate complains from EU fans like merchadise access, not having many stream at their best time zone. But the hyper focusing in a debut time slot is just petty.",
            "Yeah, I guess that is just a RedditorTM thing. I’ve been on this website for far too long. Remember the Ellen Pao debacle?",
            "That is not really even the problem, the problem come from they aggressive retoric like:\n\n\\- All EU streamer should be resident in EU.\n\n\\- A EN Gen debut should put in the best time slot of EU ignoring the main EN audience\n\n\\- They should change the schedulers of hundreds of employees to accommodate the EU audience.\n\nIn way EU fans are not so different from EN fans when it come to their entitlement.",
            "> ID\n\nThey don't have to. ID vtubers were already popular before HoloID was even a thing, they had NijiID, Maya Putri and probably a few others to refer to.",
            "Forgive me if I’m getting my history wrong, but I thought HoloID was for the first two gens seems as more of a bridge between JP and EN, and did not actually capture the ID market until Kobo came along and blew up there. As for EN, I guess you are correct, but hololive had already built up a sizable EN fanbase through Coco before Myth, and Myth just took it to the next level.",
            "ID didn't have anything to prove, nor did North America. It was already proven by other companies and by how popular JP was in those areas. EU is more complex due to the large number of languages they're dealing with as well as how many timezones it spans.",
            "Humm... ID is the same timezone as JP and EN was the first oversea venture of COVER... I don't think it is even close to EU situation, this is a EN gen debut in a EN gen debut time slot. The fact they are EU is a bonus and a novelty.",
            "> Edit: RedditCare message for this? Sure and you keep on wondering why people are pissed.\n\nI didn’t RedditCare you. If you report it, they should ban the person who did it most of the time. At least, they’re pretty good about doing it whenever I report them.",
            "Those are some bad insights, It seems according to it if you don't live in EU, your EU status is revoked as a streamer lol",
            ">Cover not submit completely to their fantasies hurt their ego.\n\nThe fantasy of being able to watch the debuts live? God forbid people want to actually catch streams live.",
            "Meaning: All Vtuber are Seiso as Equal",
            "I tried like 3 times, I'm pretty sure it's MTL and the pronouns are fucked.",
            "If you divide it be  paragraph the last three make sense even if they have little to do with each other but the first two are completely contradictory with each other. How can she lost the lawsuit and the next paragraph the ruling say that she is with her right to say what she said... Really confusing indeed.",
            "Just asking out of curiosity. People are so quick to take anything as offensive these days, i know they are extremely likely to get the recognition and build a good fanbase",
            "Rookie numbers. Has to hit 200k+ viewers at the debut and 1M subs lol. I've said it a couple of times now, but they did a really good job getting this much attention to be comparable to Advent on viewers for their debuts. I kind of expected this mentality though as we saw it with Council who ended up still doing really well and are arguably thriving more than Myth now.",
            "It's number brainrot with ever increasing unrealistic expectations of Hololive, it happens. Literally just today we have the #2 Company debuting as well, their main branch in fact and they're actually the same range both for subs and debut CCV with Denauth of NijiEN\n\nhttps://preview.redd.it/zd9r26omd48d1.jpeg?width=1200&format=pjpg&auto=webp&s=6e1abdd5902d4d80601b59f18476ef317e802e5b\n\nTheir subs are 30-35k",
            "h",
            "What do you mean my Gura nendos and Calli UnAlive album won't be able to pay for my retirement until I'm unalive?",
            "Just like the china!",
            "Come out, ~~Rika~~ Rushia!",
            "The braincell is working overtime, lol.",
            "I sometimes wonder if they even have a single braincell between them tbh",
            "It's most likely in the pipeline. I think their priority is production line and logistics in the USA, but once that's sorted out and with experience with US-JP international logistics and warehouse goods exchange, US-EU shipping and logistics should be more straightforward. It'll take a while tho but hopefully that log company they contracted can help speed up some JP-EU shipping.",
            "Kind of. I understand Latam shouldn't be a thought at this moment in time, [but just like Europe, it was in their radar 2 years ago.](https://www.animenewsnetwork.com/interview/2022-08-26/crunchyroll-expo-2022-with-covercorp-ceo-motoaki-tanigo/.188262)\n\nSince Europe market development moved to the short term goals (2~5 years business plan), then there's hope for LATAM to follow the same steps sooner or later, hopefully in the same short-term period.",
            "https://preview.redd.it/buglz1m77y7d1.jpeg?width=1046&format=pjpg&auto=webp&s=ffa541b56bab308fad4637f715aa6ac7aa7362f3",
            "0:33 in video, bottom left",
            "For clarity sake, [the average disposable income in Indonesia is $3990 USD per capita](https://www.statista.com/outlook/co/consumption-indicators/indonesia#household-income). This may seem to be very low than other key markets but keep in mind that:\n\n1) Indonesia has a huge population at 227 million, and has a birthrate of 16 per 1000, one of the highest in the world.\n\n2) Average disposable income is set to grow to $5240 per capita by 2029\n\n3) Has a GDP growth rate of +5% per year\n\n4) An active audience hungry for Japanese media\n\nLike China, it's set to grow richer and larger each year, and making inroads is definitely a smart choice.",
            "I'm kind of surprised that Canada has more average disposable income than Japan, and Mexico is higher up than I expected too. Lets go NA trio!",
            "totally fair, as I couldnt begin to describe SEA/JP hours aside from being asleep. Ina streams at a weird intersection of NA, EU, and SEA that isnt optimal for any but is the beginning of the NA timeslot. Only Kiara (and some Rissa/Shiori and starsEN occasionally) stream in morning NA, but looks like theres plenty of hints that some of Justice want to stream then",
            "I don't think the overlap rules would really apply to a stream where the entire purpose is to watch the thing you're not supposed to overlap. As long as they don't restream the audio, it encourages more people to watch rather than taking away from it.\n\nIt's probably not so much that it was forbidden before; instead it's probably just that they're pushing it now.",
            "Great, ty",
            "Improvise. Adapt. Overcome.",
            "I thought it was Miko for Koyori.",
            "Went back to check she just said she watched a lot of Subaru. Her second mention was Roberu, in neither case does she say they are her oshi. If you want to take that as what she means that's fine, but that's not enough for me to say its confirmed. In the end its also how you define oshi in your head when they're not outright saying \"X is my oshi\".",
            "Jfc, that was only November last year...",
            "I'm sure, outside of just consideration for the new talents, a non-zero number wouldn't want to stream during the debut just so they could check the new girls out themselves too. ",
            "Yeah, for sure. Everyone still tries to do it.",
            "Just remember to never put it on yourself or you become a lolcow",
            "Cover does like to be consistent with times after all",
            "Has there? I haven't really been keeping up, but that timeslot means jp staff can be around for it (noon) to monitor and be on hand.\n\n\nDon't expect an EU primetime debut time (6-9pm)because in jp it could be anywhere between 3 to 6am which means no staff around.",
            "There is a belief YouTube tracks the primary stream you are watching. If you have audio up of the debut and are viewing a watch-a-long stream, it might not necessarily count you as a viewer based on that belief. I don't think decentralized watch-a-longs increases viewership at the source but may increase overall eyes on the debut at this size.",
            ">!Ina jeeps Nagu separate, as a work identity which has nothing to do with Vtubing. Anh stylistic flourishes that Ina shows in a drawing stream resembling Nagu are purely coincidence.!<",
            "An update: they won their next round, and their next match will be streamed on the [~~main broadcast~~](https://www.twitch.tv/daigothebeastv) ~~on Daigo's Twitch channel~~ actually, it will be on one of the Beast Cup's staff's [channe](https://www.twitch.tv/kunpei_k9)l.\n\n2nd Update: unfortunately they lost and got eliminated from the tourney. It was against a Rashid player that's currently Legend Rank number 2 in the world.",
            "I remember seeing it mentioned in the Hyperchat discord, they should be aware but I don't think a fix is slated until the next big update.",
            "For me, it's the latter. Those restrictions are often the spur to creative content, or at least content that vibes with my interests",
            "It's as they say that necessity is the mother of invention. When you have to get creative to work around restrictions, it normally ends up making things way better. It's like when shock radio jocks had to get creative to get around FCC rules on content versus moving to satellite radio.",
            "Yeah, I think you got it with the Gap part of cocos character. Vshojo is much more chaotic, so while you could say that her content fits in more with vshojo, I think the fact that her content didn’t quite fit in with holo made it more enjoyable.",
            "Probably all the Watame clones (respawns?) tuning in.",
            "I think expressing frustration over not being able to catch the debuts live is normal, especially if we're assuming that this is supposed to be Cover throwing us a bone (although even that isn't clear yet). Ina and Gura debuted during EU prime time but the maybe hopefully fingers crossed EU gen absolutely has to debut at 4 AM? It is what it is but I don't think it's strange that EU viewers aren't applauding the debut times lol.",
            "me when i make up people and arguments to be mad at:",
            ">All EU streamer should be resident in EU.\n\nIts not about the actual location, its about timezone-compability.\n\nAssuming you have School, Uni, or a non work-from-home Job, which I assume are most people, the earliest you'll really be able to watch streams at properly is 4 or 5 PM, 6 PM more realistically. But for a streamer living in Japan, that would mean **starting** **at Midnight or 1 Am**, and the basically streaming through the entire Night. Sure, that *can* happen, but just statistically speaking its much more *unlikely*.\n\nIs that that hard to understand?",
            "Given how little information we've actually gotten I think people are trying to figure out what we're actually going to get, and based on vague piecemeal info so far we've gone from \"this is holoEU\" to \"ok only 2 of them are actually in Europe and judging by their debut times they might still be focused on PST primarily\" which is a bit frustrating if you're hoping for more streams in an underserved timezone. Ultimately you're still acting weirdly angry over people saying they want to be able to watch more hololive streams live.",
            "Some EU fans... some. Don't go painting all of us with the same brush.\n\nAm I remembering this wrong but some of the other EN fans were whining about the same things back in the day when they figured out that not all of Holo EN live in NA permanently if at all?\n\nI remember that either with Niji EN or Holo EN some folks where whining along the lines of \"it's wrong for people who should've applied for JP to take a place from potential EN talents.\" I feel like I've seen this same kind of crap happen with both companies by now to some extent... I wonder how much there is overlap in the fanbases and if it's the same people whining again about the same thing. Not that I really care... I think both companies simply just try to hire the best talent they can within the possibilities they're given.",
            ">All EU streamer should be resident in EU.\n\nYes, people expect EU streamers to live in Europe and stream at European times. This isn't a particular weird request.\n\n>A EN Gen debut should put in the best time slot of EU ignoring the main EN audience\n\nWho's asking for the best time slot? People are asking for a timeslot that isn't in the middle of the night.\n\n>They should change the schedulers of hundreds of employees to accommodate the EU audience.\n\nHow much work do you think goes into actually debuting? They don't need anything more than a handful of employees being on standby. Which would be no problem if they hired outside of Japan.",
            "NijiID was tiny apart from Hana.",
            "Kobo blew up the market by grabbing normies, but Holo moved into ID because they already had a local market for Vtubers because of their love of Japanese media as well as Nijisanji having a relatively successful branch there that they inexplicably abandoned.",
            "And yet ID got 2 gens before “capturing the market” as you put it. So why are Americans going around saying we have to front up with numbers equivalent to them to justify having any Hololive members stream in a CEST friendly time other than Kiara? European vtubers aren’t few and far between - DoKomi has been featuring them for years - but no corps have taken much interest till Brave through Globie and now tentatively, Cover.",
            ">EN was the first oversea venture of COVER\n\nIt was the third",
            "I mean yeah, FWMC and Irys live in Japan now, and they stream to US timezones fine. I’m sure the same can be done with EU. FWMC mornings are even still around.",
            "Dude has a bee in his bonnet that European fans are jaded and cynical after so many years of being left by the wayside and watching what Kiara has had to put up with. He’s all over this thread.",
            "Hey, I'm a Kenzoku and never get to catch her live anymore after she went back to stream times that work better for her and her now mostly Japanese audience.\n\nIt'd be **nice** to see her live. And I do get to see the Holos who work on West Coast times live more often than that, but hey. I'm hoping the new Gen works out for EU fans, but their struggles aren't exactly new to Holo fans outside of JP.",
            "Which is weird cuz the original commenter knows how to type comprehensible English.",
            ">Has to hit 200k+ viewers at the debut and 1M subs lol.\n\nPut /s or people will misread it as you being serious, you never know.\n\n>Council who ended up still doing really well and are arguably thriving more than Myth now\n\nTbf, Myth has been out of commission and haven't been focusing on streaming for a long time now, it's always Kiara and Calli grinding still, Ina sometimes comes back but her content choice is sometimes not good for attracting the most number of viewers, she also still does Priestess duties as well\n\nFor Promise really, the only one left that we can say that we may not know if she'd be out of commission is Mooms because she's still got College. Unless they also burn-out like Myth does, Promise is doing amazing on the streaming side hence they're the targets of those 4chan schizos with the bots by using Advent against them",
            "Isn't that just Sana's part from the Council's PV\n\nNow that I look at it again, kinda funny that IRyS has her own section but named Promise instead of Project Hope",
            "Canada in general has a lower cost of living, even accounting for how expensive real estate and food are compared to most of Japan outside of the major cities.",
            "That sounds logical in hindsight. But if they hadn't thought to make an exception for it before, then it was technically still forbidden.\n\nI recall Bae saying she came up with the plan for the Tempus watchalongs, and got them approved through management. My guess is when they saw how positive the response was to that, they decided to allow the exception to the overlap rules for watchalongs in a more general sense.",
            "Wait you're right, it was Miko, I might have conflated the Peko fangirling interactions in my head",
            "Yes, I agree. She later even [denied having one](https://www.youtube.com/watch?v=yzD17H90cgA). I'll keep digging for clips for a while to see if she mentioned anything else on the matter, if you find anything please tell me!",
            "We have seen the curse firsthand, Look at Nick Rekeita lmao. He put the medallion on and now his life is a trainwreck. Cryptid level shit lmao.",
            "This was the schedule for the Myth debuts in the GMT timezone (all during the same Saturday) \n\nCalliope: 11 AM\n\nKiara: 1 PM\n\nIna'nis: 7 PM\n\nGura: 9 PM\n\nAmelia: 11 PM\n\nCover must have fired a ton of people since then if they can no longer support these debut hours, I hope they're doing alright",
            "Youtube only does that for the CCV\n\nWhen the views are tallied up for the VOD, it will include people watching on a different tab. It will also include people using third party embedded videos too (which is how Discord accidentally racked up over a billion views during April Fools)",
            "Tbh I think overall viewership probably matters more than a number on YouTube anyway. The latter may help you do *x*% better in the algorithm, but the point of doing well in the algorithm is to get more eyes on you. So doing it via watchalong is just cutting out the algo middleman.",
            ">!I understand that. My point is that Yunii doesn't have a work identity. It looks like she retired \"Yuniiho\" for good and will just be Raora for now, but yeah we'll have to wait and see.!<",
            "That's good to hear, ty",
            "I'm going to horribly butcher the phrase but I've heard it said that \"limitations are the wellspring of creativity.\"\n\nThe gist being that sometimes operating with more severe restrictions leads to greater innovation than having the freedom to do whatever you want. Obviously this really only shines with people who have the mindset to capitalize on the opportunities they have and the patience to polish their skills in preparation of those moments.",
            "Exactly this. After four gens (and three gens of Holostars) where Kiara has remained the sole EU representation, its not rocket science to understand why EU viewers are desperate for streamers they can actually watch. \n\n\"I'm British but I live in San Francisco and will be streaming at 3am your time just like all the others\" really doesn't move the needle any or change the situation from what it is now.",
            ">\"it's wrong for people who should've applied for JP to take a place from potential EN talents.\"\n\nyea, kotoka and meloco (and back in the day shu) from nijien and fwmc from holoen all have persistent dedicated haters who use this reasoning",
            "> Who's asking for the best time slot? People are asking for a timeslot that isn't in the middle of the night.\n\n\nYeah, I mean, they pretty much picked one of the objectively worst timeslots possible for the debuts if they want to appeal to EU fans. A relay starting at 4 or 5 AM is too late for most night owls but too early for most early risers.\n\n\nAnd we've defenitely had better timeslots in the past, Council debuted at a much more reasonable time for Europeans even though two of its members were Australian.",
            "Yagoo mentioned this in the early interview. On top of other reasons, they saw the statistics that a lot of views from their streams and clips came a lot from ID\n\nSo basically ID didn't have to prove themselves because the audience there already proven that they consumed a lot of content even though it was all in Japanese at that time. I think Yagoo also mentioned seeing hololive cosplays in unrelated anime expos in very early days. So it showed somehow hololive got popular organically in ID without Cover even trying to do anything there. \n\nBeing in the same-ish timezones as JP and it being much cheaper to operate in is definitely a factor too.\nThat's why they took the step. Its little risk for them.",
            "HoloID exists because NijiID existed, Cover was just copying what Nijisanji was doing back in the day. This idea is reinforced by the official HoloKR and HoloIN twitter accounts that were created but nothing ever came of them.\n\nAs for Dokomi, they pissed Cover off one too many times by messing up their concerts and meet&greets that they won’t even bother with them anymore.",
            "ID is a traditional test market for Japanese corps looking to expanding overseas.",
            "Idol doesn't count?",
            "[deleted]",
            "It's not IRyS own section (I also thought that at first), Promise replaced Council as a gen.",
            "wait that's actually crazy. I 100% thought cover pushed for tempus watchalong",
            "It's not Miko. It's Pekora, she always evaded the oshi question, but people assumed Miko because they're close and Koyo had a Miko wallpaper, but she decided to reveal it last year so she could express how much Pekora gave her confidence to not give up on her dreams.\n\nShe didn't say before because she didn't want anyone to bother Pekora over it, so she first told her directly, revealed it on her last anniversary live and then went over it [when she did the Pekora sololive watchalong](https://www.youtube.com/watch?v=Cd-lU9gcJdU). Sorry for the long answer. lol",
            "I didn't want to mention names because it's kinda off-topic but to heck with it,  yeah I know, first one to make that a meme is because of Idubbbz wearing it then later having endless out of touch dramas with his partner over the creator clash charity money being wasted to host parties and pay content creators and their private life being shown to the world with some of the info that can put people to shame \n\nNick Rekieta is worse with scam on vic mignogna coming to light, swinging relationship, embarrassing kinky shit like the \"ball-do\" (some kind of sex toy that crushes your balls) which he had been sponsored for it multiple times as well, drug abuse, potentially child abuse worse than neglect (latest findings say one of their child was positive of cocaine) etc\n\nHaven't even mentioned the creator of the medallion Chris-chan and the deeper rabbit hole it is to even expound upon",
            "Do you mean they first debut oversea in which they don't have much idea of what result would be??? It is called streamlining, they collected the data from the other debuts and developed what they think is the best option for said process.\n\n COVER has reached what they think is the best possible time slot for EN Gens Debuts and they will probably will not change it.",
            "Yea. I don't think it's necessarily a bad idea. I like them trying things out as I don't think the core audience will be impacted either way. Only argument would be they might not get the best algorithm hit to attract new people but that's a black box of \"who knows\" anyways... Based on how trending works, the algorithm might use secondary sources and other platforms anyways.",
            "Cover doesn't restrict what other work you do, unlike Anycolor. They only want you to keep an arm's-length relationship between the other work and your corporate identity.",
            "Yeah, usually the freedom to do whatever for streamers leads to react content or being involved in drama.",
            "meloco one is flaring up again because she's in Niji GTA, one of the few, maybe the only NijiEN consistently joining it because of their RP rules discouraging a lot of EOP NijiENs, the other ENs that can speak Japanese are busy or out of commission so she's kinda standing out and getting hate from different fronts",
            "> As for Dokomi, they pissed Cover off one too many times by messing up their concerts and meet&greets that they won’t even bother with them anymore.\n\nWhat exactly happened? I remember watching their HoloEN panels back in 2021 and don't remember anything bad.",
            "I didn’t mention DoKomi in relation to Cover, I was pointing out that vtubers in Europe, not just Hololive ones, have had a presence in the anime community for years.",
            "And most of the ones I follow are JP or ID, so they never match me.   More power to EU fans, but we can't say if they're locked out just because the debut times aren't in EU timezones yet. Ina, as pointed out earlier, streamed at a time that was EU friendly, but she's not focusing on the EU audience and isn't based there. Vesper had EU friendly times, but they weren't his main market either.\n\nHell, even with the EN I do follow, most of them stream while I'm working so I have to catch the VOD anyways.\n\nTowa-sama, after the week's suspension, streamed at NA friendly times. That's when a bunch of Kenzoku got to see her and follow her. We can't say if Justice will be streaming at their debut times forever, or if they'll go to EU friendly times after their debuts. Anyone who's complaining about their debut times catering to NA needs to chill out.",
            "So I was correct! Yeah, the hype and giddiness oozing from her for Pekora was different for Miko, like, it couldn't just be her being reserved to Miko if she was her oshi but then go gush about Pekora",
            "Wait what scam? You mean how he convinced Vic to waste money on a lawyer who didnt specialize in defamation who also had ties to his own estate, while he gassed everyone up into thinking it was an easy win, then Vic lost and we never heard about it again? Or was something even worse happening?",
            ">Do you mean they first debut oversea in which they don't have much idea of what result would be??? \n\nIronically the GMT debut times for the second EN gen were arguably even better aligned with EU prime time:\n\nSana: 6 PM\n\nFauna: 7:30 PM\n\nKronii: 9 PM\n\nMumei: 10:30 PM\n\nBae: midnight\n\nGoing from this to having talents to do one of the arguably most important and certainly most stressful streams of their career at 4 AM to an audience that presumably won't even be able to watch the majority of their \"normal\" streams anyway seems questionable but in the end there's nothing we can do about it I guess",
            "For the concerts, they put the concerts right on opening doors so a ton of people who wanted to go to the concert couldn’t because they were stuck in line to enter the venue.\n\nFor meet and greets, they forgot to announce the winners of the raffles through email so no one knew who won until when m&g should’ve started. KFP ended up helping a lot with getting people aware of where to go after emails were eventually sent.",
            "Yeah, Koyo and Miko have a sibling relationship and she respects Miko a lot as well, but it's a bit different. Funnily enough there were some hints over the years like Marine revealing on stream that Koyori's house is full of Peko goods or how loyal Koyori was to Pekora in Rust while still trying to always to respect her space. lol",
            "That indeed, also because said lawyer Ty Beard supposedly not only did not specialize in defamation, he sucked HARD at it and basically lost every hearing be it due to multiple errors in paperworks submitted, alleged tardiness, and offense full of holes and basically have to pay his opponents for losing so badly and appealing\n\nhttps://preview.redd.it/n2ennmcc918d1.png?width=1200&format=pjpg&auto=webp&s=ef91a14d4bf1b7943e764669270d14b5d0e2f465\n\n[https://x.com/GreatCheshire/status/1753528907930677573?t=Odk4ClcOV6z4JTYbF3Sv8Q&s=19](https://x.com/GreatCheshire/status/1753528907930677573?t=Odk4ClcOV6z4JTYbF3Sv8Q&s=19)\n\n>lawyer who didnt specialize in defamation who also had ties to his own estate\n\nAlso it goes deeper because from the piranha of lawyers chiming in the issue leaking stuff about Nick, Ty Beard was not only that, he was also a family friend of his grandparents/parents who were millionaires, yes Nick is a Trust Fund baby and Ty Beard was helping him back then to start up his business firm, people speculate that, him giving the gig to Ty Beard is a pat on the back move not because he's qualified for the job obviously",
            "Yep, as an EU fan I remember the total disappointment when the girls shared their shedules. They'd pretty much never stream at that time slot again. After that, I don't expect anything but I'd love to be wrong."
        ]
    },
    "Weekly VTuber Spotlight: Bonnie Barkswell - June 17, 2024": {
        "title": "Weekly VTuber Spotlight: Bonnie Barkswell - June 17, 2024",
        "score": 203,
        "url": "https://www.reddit.com/r/VirtualYoutubers/comments/1dhyhw2/weekly_vtuber_spotlight_bonnie_barkswell_june_17/",
        "content": "# [Bonnie Barkswell](https://www.youtube.com/@BonnieBarkswell)\n\n[ All aboard! Brave Group’s globie Gen 2 #Solstia 's goodest girl!, Airship Engineer Bonnie Barkswell from Gen 2! 🔧 Expert at napping & yapping! Enjoyer of art & snacks 🥰 ](https://preview.redd.it/ys63go8wu47d1.png?width=2010&format=png&auto=webp&s=3c4f26bc99fba2ec1c62df86620288dbfb97f7ae)\n\n# Overview \n\n* Name: Bonnie Barkswell\n* Illustrator: [@Anzu\\_1026](https://x.com/Anzu_1026/status/1781421238398914688)\n* Affiliation: Globie (Brave Group Europe)\n* Active since: April 2024\n* Nicknames: Ballswell\n* Oshi Mark: 🐶🔧\n\n&#x200B;\n\n[Character design by Anzu\\_1026](https://preview.redd.it/bo57bqeav47d1.jpg?width=2048&format=pjpg&auto=webp&s=70cf66f0af4195b97e354637842f9aa8faf67fe5)\n\n# Introduction\n\nBonnie Barkswell is a female English-speaking VTuber member of globie  as part of their 2nd generation, under the subgroup, Solstia, alongside  Kiri Kilovolt, Rubarb N. Kustard, and Alicja Da Lontano. Bonnie also  speaks conversational Japanese, and can understand a little French.\n\nBonnie is a Golden Retriever Airship Engineer with a Steampunk style,  complete with goggles, leather gloves, sturdy boots, large overalls and  various tools hanging from a belt. She also has short, orange hair with  white tips and a paw-print marking on one of her ears. \n\nBonnie loves to chat and free-talk with her viewers and collaborate  with other VTubers. She also enjoys doing Karaoke streams, cozy games  and  and playing old point-and-click adventure games from the 90's.  Bonnie is also a hobbyist illustrator and sometimes does art streams and  posts her work on twitter. She likes to draw herself or fan-art of  other VTubers. Bonnie's favourite streams are ones where she can push  the boundaries and be innovative and creative with assets and viewer  interactions.\n\nOn 17th April 2024, Bonnie was the first member of globie to reach  over 10,000 subscribers on Youtube, 2 days before her debut on the 19th.  She then reached 20,000 subscribers on 7th June 2024. Her debut stream  consisted of a short skit inspired by a cruise ship safety briefing  video, and a minigame in which chat had to use various tools to \"fix\"  the pipes and clear the room of steam, revealing her model. \n\n# Trivia\n\n* Bonnie is often teased on twitter for being \"old\" and some of her  most viral tweets have involved memes from the community joking about  \"refiring a dying star\". One of these memes even being featured in a  \"Know Your Meme\" entry. Her viewers also coined the terms \"Pupmaxxing\"  and \"Litterpilled\" in reference to her.\n* Bonnie revealed on her debut that she is a Golden Retriever and 4  in dog years, making her age approximately 28-32 years old in human  years. \n* Due to Bonnie's first ASMR stream being derailed by many  high-value donations from viewers, it is now a running joke in the  community that every Friday stream is called \"Findom Fridays\".\n* It's a common misconception in her lore that Bonnie is the  Captain of the airship, however she is actually just the Engineer and  often refers to a mysterious Captain figure who flies the ship. One of  her goals at debut was to be promoted to Captain.\n* Bonnie has stated that one of her biggest passions is travelling the world and has so far visited over 22 different countries.\n* When Bonnie began streaming, she had a small collection of 4 or 5  Hatsune Miku figurines. However, due to a large number of donations  from her viewers via Throne, she now has over 20 different figures.\n* Bonnie loves space and sci-fi movies like Interstellar,  Hitchhiker's Guide To The Galaxy and Gravity, but her favourite movie of  all time is The Martian.\n* Bonnie's catchphrase at the start of her streams is \"BALLS OUT  FOR BONNIE! 🥎\", a reference to her first tweet and to how dogs are  commonly associated with tennis balls.\n\nLinks\n\n* [Youtube](https://www.youtube.com/@BonnieBarkswell) \n* [Twitter](https://x.com/BonnieBarkswell) \n* [TikTok](https://www.tiktok.com/@bonnie.barkswell) \n* [Instagram](https://www.instagram.com/bonniebarkswell/) \n* [Reddit](https://www.reddit.com/user/Bonnie_Barkswell/) \n* [Throne](https://throne.com/bonniebarkswell) \n* [Twitch](https://www.twitch.tv/bonnie_barkswell)\n* [Streamlabs](https://streamlabs.com/bonniebarkswell/) \n* [Globie website](https://globie.net/) \n* [Globie twitter](https://x.com/globiesocial) \n* [Globie Subreddit](https://www.reddit.com/r/globie_hub/) \n* [Globie Youtube](https://www.youtube.com/@globieofficial) \n\n[ Goodest girl!🐶 art by  @Anzu\\_1026](https://preview.redd.it/hzfuypx1z47d1.jpg?width=2000&format=pjpg&auto=webp&s=f57678fd6570fbb17b46b0f1f218d70ef977c2b2)",
        "num_comments": 12,
        "comments": [
            "WHOA! A DOG! 🫵\nThank you for your help setting this up 🥰",
            "After watching last nights's Phasmo collab all I can say about Bonnie Barkswell is that Bonnie barks well.",
            "She's live right now with ~~Mliking Monday~~ Mommy Monday\n\nhttps://youtu.be/wV2TkaJUXSE",
            "HAG LOVE HAG LOVE HAG LOVE.",
            "***\n\n######Editor's Notes\n\nThank you for reading this week's spotlight! Thanks to u/Bonnie_Barkswell writing and providing the information for this spotlight.\n\nAs always, if there's a VTuber you think we could spotlight for the future then feel free to comment about it and depending on the circumstances we may be able to feature them. If you want to help write one of the spotlights on a VTuber that you know about, then feel free to reach out as well by sending us your entry to our modmail which you can find in the sidebar. \n\n***\n\n#####Previous Spotlights:\n\n- [**FalooVT - January 22, 2024**](https://redd.it/19df2wh)\n- [**Rurudo Lion - January 29, 2024**](https://redd.it/1adqqdj)\n- [**Kyaramel - February 05, 2024**](https://redd.it/1ajfi69)\n- [**Maru Nanamona - February 19, 2024**](https://redd.it/1aut7yn)\n- [**RainyRentyn - February 26, 2024**](https://redd.it/1b0ho7z)\n- [**Kiona - March 04, 2024**](https://redd.it/1b6bl3t)\n- [**Saori - March 18, 2024**](https://redd.it/1bhk8au)\n- [**Zli the Slime - March 25, 2024**](https://redd.it/1bnbn9b)\n- [**Bajiru - April 01, 2024**](https://redd.it/1bt2cmo)\n- [**Eleska Bell - April 08, 2024**](https://redd.it/1byxoby)\n- [**Twig - April 15, 2024**](https://redd.it/1c4jxeb)\n- [**Liari - April 29, 2024**](https://redd.it/1cfzkrc)\n- [**Mirai Xavier - May 06, 2024**](https://redd.it/1clhllh)\n- [**USS New Jersey BB-62 - May 13, 2024**](https://redd.it/1cqv58y)\n- [**Nanami Urara - May 20, 2024**](https://redd.it/1cwh14u)\n- [**Kiri Kilovolt - June 10, 2024**](https://redd.it/1dcl32j)\n\n***",
            "Hag love",
            "Good timing for this promotion. I wonder how many decided to check her out after seeing this and experienced yesterday's stream as their first Bonnie stream. That'd be quite the start for sure.",
            "She’s the coolest",
            "She's great! I love how comfy her voice is. Don't ask her about the fan-fic they wrote about her...",
            "Bonnie stole my tennis balls. 10/10 Dog behavior!",
            "i'm probably way too amused by balls jokes",
            "\\*Yeah her other streams aint better.\\*"
        ]
    },
    "Gigi Murin【DEBUT】GG STANDS FOR GIGI! 👧 #hololiveEnglish #holoJustice": {
        "title": "Gigi Murin【DEBUT】GG STANDS FOR GIGI! 👧 #hololiveEnglish #holoJustice",
        "score": 553,
        "url": "https://youtube.com/live/15aufXwBIKw",
        "content": "",
        "num_comments": 102,
        "comments": [
            "Ngl this line up really makes me wonder who’s all was auditioning behind the scenes lol. Like I never really expected >!eilemonty!< and >!biscotti!< the talent pool must be insanely good",
            "D&D FAN?! \n\nBRO COUNT ME THE HELL IN BOIS",
            "anyone can figure who she is from her voice?",
            "So the mascot is an active part of the model. That’s so fuckin cool",
            "Congrats to both Liz and Gigi! I was a fan of their PLs and found them super entertaining and talented. They averaged like 80 viewers… so I’m glad they get a huge audience now!",
            "This lore video is an acid trip.",
            "is she >!biscotti!< ?",
            "~~111k~~ 131k subs and ~~50k~~ ~~117k~~ ~~120k~~ ~~117k~~ 115k watching already. Wowzers",
            "That's quite a unique debut(Hololive). Interactive chat is something I have not seen in a debut. Previous debuts sometimes feel prerecorded.\n\nDid she make that chat controlled game? If so, she really deserves the spot.",
            "Hope she doesn't feel too bad about failing that math check, EBR also borked her height conversion, lol",
            "The start screen is really cute.",
            "Omg, she’s exactly right up my alley",
            "I couldn't hear her in the beginning but the laughs are the same. Either her voice is pitched up, or back then she was talking at a lower-ish register",
            "so this is why her PL was so short\n\nanyway very cool interactive debut",
            "Her cover of Hitomania actually goes hard as fuck. I've watched it like 10 times already and every time I notice some new subtlety in either the audio or visuals.\n\nIt's masterfully done and really artistic. Combined with the intro lore video I'm really digging this avant garde vibe. I'm excited to see more!\n\nMeanwhile I'll be over here listening to this cover another 100 times.",
            "Literal gremlin energy.",
            "Looks like she spent a lot of money for her debut",
            "Her dedication to the bit on her previous character was quite remarkable.\n\nI wonder, what she's gonna do with this one.",
            "So can anyone breakdown that kinda dark lore video in the beginning?",
            "So anyone can breakdown that kinda dark lore video in the beginning?",
            "[removed]",
            "automatically my fav debut just because of the maplestory, s4 league and grand chase BASED taste",
            "I'm hoping that Gigi can straddle around the stage >!like a certain horse Biscotti !<once she got her 3D debut.",
            "She went from 11k subs to 120k subs (Gigi). Kinda the same as Biboo. Both good talents, who joined the bigger company and saw a massive boost in numbers, I wish them all the best.",
            "It feels like just getting to join Hololive is such a good career move that they can get whoever they want really.",
            "yeah back then for >!eilemonty!< I thought she was becoming a fulltime VA, would have never expected her to join a Vtuber corpo",
            "Oh wow so HoloJustice were only preparing for 3 months. I was expecting longer",
            "Is she American or Aussie? I can't figure out from her accent.",
            "I need proof that >!Gigi was once a member of V4Mirai.!<",
            "Roll a Persuasion check please.\n\nno, actually, make that Intimidation. Its in all caps.",
            "Nerissa must be so happy that another DnD fan has joined Hololive lol.",
            "horse",
            ">!hampwn!< -> >!Biscotti!< -> Gigi",
            "everyone knew before debut lol",
            "I think everyone has that thing set-up like that, the mascot moves the same as the model.",
            "yes. it's been mostly like that. even to their first member sora.",
            "I was tickled that I recognized both of their voices! Youtube had to help me remember Gigi's PL but she sounded super familiar. I still listen to songs Lizzy had sung in the past though, so that was an immediate connection.",
            "Can you dm me who liz was",
            "[removed]",
            "yes",
            "based on her drawing & that singing voice, yes",
            "her credits say it was [the creator of fugis that coded it!](https://x.com/Fugiman) those audio reactive images you see with discord calls",
            "[Shinri's debut](https://www.youtube.com/watch?v=zpXDBficVL4&t=1924s) had chat vote on which actions to take in an RPG-style combat. But yeah, in general it seems like that sort of thing is rare.",
            "Its cannon now! Gigi is bad at math!",
            "probably that's her natural voice as she also sounded the same back in nov last year-last mar",
            "Did any of her PL streams survive or were they all deleted? I watched all streams on Biboo's channel and I wanna watch more, yet I can only find clips of her PL.",
            "Wasn't Advent given 2-3 month preparations as well?",
            "It's probably more than that. If I remember correctly, Shinri's PL graduated/announced his indefinite hiatus on December 2022, but is probably already preparing at least since September of 2022",
            "I think they have longer than that. Once they have finalized the contract, there should be some grace period so if you're from other company or have some unfinished business to attend as indie, you have time to clear all those then graduate.",
            "Likely to be longer than that. They could have multiple contracts for different phases of the debuting to respect the talents' other contracts.\n\nA goodwill graduation is not something you just throw in within a short timeframe. There are all kinds of arrangements to settle the paperwork and project schedules with the grad date as the last public communication. It could be just the deadline for the full contract's entering, which requires legal uncompromised commitment.",
            "Given that she's from \"Freedonia\" (or somesuch), I suspect she's the lone yankee among the Justice crew.",
            "American for sure. Based just on voice she sounds just like some of my Filipino-American coworkers, so probably American with immigrant parents of some sort.",
            "listen to her laugh and look at the doodles she's done. also her timezone (according to holoen official tweet) and her interests line up",
            "honse\\*",
            "Wow, I did not see that one coming. Good for her. V4Mirai seems like a dope company but to also get picked up by Hololive is crazy.",
            "Damn, she left her last company so suddenly , I wonder if she already planned on doing this or simply changed her mind.",
            "Wait hampwn is Gigi?!! I thought ham was still active",
            "That doesn't really help those not in the know here though, does it?",
            "No they didn't, literally everyone thought she was someone else",
            "Any chance you could dm me?",
            "Yeah I just remembered Shiori’s ink glob moves too",
            "It's on the other threads",
            "Literally the top comment of this thread",
            "Nice I just recently discovered her and was sad she left so soon but now I get to follow her again.",
            "I knew that pictures from somewhere and now I know it's from ex-Vshoujo tech",
            "Everything is there",
            "Yeah, they can't really do much more than that.\n\n3 months prep, up to 2 months to get paid by YouTube. That's nearly half a year without pay already, although Cover kicks in if they really need it.\n\nAdding a few more months to that would be extremely financially difficult for them.",
            "Advent had at least two months - their Hololive debuts were at the end of July 2023, and a couple of their PLs had their graduations at the end of May 2023.",
            "Oh I have no idea.",
            "Yeah, my first impression when I heard her talking was that she sounded a lot like Anya.",
            "Was it ever confirmed that she is part Filipino? Not gonna lie, but when I saw the list of MMORPGs she liked, a lot of them were the games that were very popular among the Filipinos around the early 2000's. Ragnarok, Flyff, Maple Story, etc. So I somewhat got the suspicion that she may be Filipino or at least has some relation to it.",
            "I see. Hoping that >!she gallops like a certain horse.!<",
            "I think she auditioned while at her last company on a whim and got accepted. The time frame adds up since she'd known she got in months ago and was excited to move on to the next stage. People thought she'd be leaving vtubing all together, not thinking she was moving up.",
            "wow same here, did not know ham moved on to another company, and now this. she was always a riot on scarra's streams. and the ff14 arc they had with sayu and other vtubers was peak content.",
            "LMFAO",
            "can u dm me when u know",
            "You mean on her twitch? Because on youtube I saw only 3 videos and 1 short, but thanks a lot for telling me!",
            "Didn't Holo have a base salary?",
            "this isn't confirmed at all just saying what her accent reminded me of",
            "I think it's more likely that she sent her applications to Brave and Cover at the same time, and Brave got her first, and then, months later, Cover got in touch and decided to buy her out.",
            "Yeah she spoke about financial and family problems in her \"first\" twitter profile so everybody thought she was going for a more full-time stable job.....but on the other hand if you are in Cover that solves it well enough.....",
            "Its in the thread already my man.",
            "Youtube. Her live section has all the streams and her videos go from debut teaser to her last cover 3 months ago",
            "Its alluded to be alittle above minimum (ave. ¥931/hr). They still get a salary even if they have their cuts iirc. Risu has expressed that that alone got her thru so much personal things.",
            "yeah, we don't know if it covers pre-debut or only after, but Cover would definitely help if needed",
            "Base salary is not that high though. Not enough to pay for rent in a small Tokyo apartment. Factor in the weak Yen and cost of living in Western countries I'm guessing it's barely enough to just pay utilities bill, or groceries.",
            "Whatever it is I just hope this won't create any bad blood between companies. Or with her former colleagues.",
            "Someone dm’d me",
            "Thank you yet it seems I'm either too stupid to find the live section or there is no more live section on her PL account, only home, videos and shorts. Oh well, good thing she streams almost daily. Again, thank you very much for your help.",
            "Yeah but the lower limit acceptable for income is a little bit different from Indonesia compared to EU and US......it would be on the very lower end for that (although you might get additional benefits from the state at that stage)",
            "Yup I know, Tokyo is expensive...but at least even JP members arent required to live in tokyo, a bunch of their members still admit to living quite far or in rural areas. \n\nHopefully its enough to cover for their daily stuff in the meantime. Depending on where the EN members live that could go from enough to live off to barely I agree. Hopefully they started getting some money even during the training months",
            "In the vtuber world i think everyone knows that if hololive comes calling, you can't blame anyone for taking it.",
            ">!her old V4Mirai genmates were in her waiting room of her debut way before it started. its safe to say that they were really excited!<",
            "Are you on mobile?",
            "I *vaguely* recall Kronii's old colleagues and vtuber mama went crazy retweeting art of her, so I imagine people understand when its Hololive.",
            "Yeah at that point you have to take it. It's the golden ticket in the Vtubing world. Rather I'll be more surprised if someone didn't go through with it.",
            "No, PC. Why?",
            "I think you guys are getting mixed up. You want to watch Biboo's PL right? I think the other guy is telling you Gigi's is still readily available on YouTube since that's where Gigi's PL streamed.",
            "Maybe the layouts or UI is different idk. I’m on the mobile app"
        ]
    },
    "Elizabeth Rose Bloodflame【DEBUT】Ello Ello Ello~! 💄 #hololiveEnglish #holoJustice": {
        "title": "Elizabeth Rose Bloodflame【DEBUT】Ello Ello Ello~! 💄 #hololiveEnglish #holoJustice",
        "score": 537,
        "url": "https://youtube.com/watch?v=NdlSHUEVCj8",
        "content": "",
        "num_comments": 109,
        "comments": [
            "This girl is actually Yuri-Shipping Kiara and Calli LIVE!",
            "It DEF sounds like, >!**EileMonty**!<",
            "How in the god *damn* does Yagoo keep finding these women who don't already have million dollar contracts when they ought to\n\nFirst it was >!~~Caitlyn Myers~~!< Nerissa Ravencroft, and now it's the Queen With The Pipes. I cannot believe she wasn't already totally sewn up.\n\nAnyway that's one hell of a way to come out swinging.",
            "Oh this girl is absolutely getting shipped with Risa.",
            "Jesus. ~~107k~~ ~~117k~~ 128k subs and ~~52k~~ ~~118k~~ ~~122k~~  120k viewers already",
            "Unintentional FFXVI reference with her...\n\nAs soon as she said her fans are Rosarians, I immediately thought of the Shields of Rosaria, and then she even went on after to say the fans are Shields if she's the Sword. Just a really nice detail on top of everything else here lmao.",
            "Wat, oh it ended lmfao",
            "I can unironically say Hololive has connections to The Living Tombstone now.",
            "~~^(So are we taking bets on who folks used to be?)~~\n\nI actually do wonder if some of these folks might be previously unknown-ish talents in the V-Tubing sphere, like some of the older JP and ID members were.",
            "Is that Bettel in a fur suit?",
            "Kinda wanna see GiGi collar with Ironmouse, so we get Gremlin vs Grem-o-lan.",
            "My fucking god I never expected this holy fuck",
            "And doing such a good impression it wasn't until 'Calli' spoke that I realized it wasn't actually Kiara. Girl is scarily good at impersonating people",
            "If so we've upgraded from \"imitate Marine\" to \"imitate most of Hololive\"",
            "That explains her lack of streams and activity, goddamn, this explains a lot of things.\n\nEdit: wat an end, can't be EN stream without scuff. Also, I love the name reference, almost a call back to her own name.",
            "100% is her. I was 95% when she was talking but 100% once her powerful voice hit us. And 110% when the incredible impressions came out.\n\nI wondered why her channel suddenly went quiet 6 months ish ago. This is definitely the happiest answer to that question and I cannot wait to rejoin her membership :D",
            "Man I remember her, way way back for… *sigh*\n\n>!MLP covers!<",
            "This is exactly who I thought it was on finding out she was British, I'm glad the meme lady made it in.",
            "Thannnnk you I couldn’t remember her name but that’s who I instantly thought of when she started impersonating advent",
            "huh, don't think I watched any of her content outside seeing her do impressions from other VTubers reacting to her.",
            "so THAT’S why she sounds familiar, I was listening to >!Die in a Fire!<",
            "Her [Twitter account](https://x.com/MontyVocals/followers_you_follow) is also followed by the Hololive casting crew Ollie and >!CaitlinMyers!< xD",
            "I'm always surprised these channels with several hundreds of thousands of subs apply to Hololive.",
            "That's a name I haven't for many years >!since I stopped being into MLP.!<It's been so long, I don't think I would have ever recognized her voice anymore.",
            "You thought so too? Man, it's been so many years and of all the livers, THIS one was the one I thought: where have I heard that before? If it really IS her, it's a big step up from what she used to do.",
            "They're getting thousands of applicants and only 4-5 can debut. It is like how the top Korean Kpop companies keep churning out top kpop groups. And the bigger Hololive grows, the standards will keep increasing. Hololive has a clear branding and that makes those with specific aspirations as a vtuber know where to apply. Earlier on they focused on growing quickly with members that aren't necessarily gifted but can persevere in the streaming environment and there were several nepo hires too like the entirety of gamers. Even then their eye for gems is unparalleled and even now we have several late bloomers that finally managed to shine after several years.",
            "Biboo is the symbol of how strong Cover's scouting is. To go from a really, really small indie to one of the most popular Holo en members in less then a year",
            "I think Yagoo/COVER's talent scouts real skill is identifying people who deserve million dollar contracts and offering them said contracts before anyone else finds them",
            "The thing I love about Holo scouts is that they're not afraid to reject auditions outright and they keep coming back as a better version of themselves ready to be deserving success",
            "Why does people keep saying Yagoo find them when they came to Yagoo's doorstep during audition?",
            "So I googled Nerissa's old channel, then I stumbled across a video I liked a year ago: the Rick Roll Anime version\n\nNever thought it was made by her lmao, what are the odds, it's so bizarre",
            "This girl is shipping HERSELF with Rissa. And it appears mutual.",
            "Just cracked 120k viewers. Looks like people are around on Friday!",
            "You're going to have to update that for like a week. Considering that voice she is going to *skyrocket* in subs. No question. *GOD DAMN*.",
            "great debut.. i wonder who will be the next highest ccv debuts..\n\nthe highest ccv debut they had was 180k (koyori)..",
            "How does this compare to Advent?",
            "Fuck, you are right",
            "This one was definitely very well known, her vtuber impression videos from a couple of years back went viral for example. She'd gone quiet for a few months, so happy ro fund out this is why. Girl loves performing so damned much and it shows.",
            "I just realized and she's been well know, at least for the fandoms I was in she was pretty famous there, shame she deleted most of those videos, there where some good nostalgic memories 🥲",
            "No, its his mascot.",
            "Forget AI Deepfakes. Elizabeth Impersonations are the real threat to society.",
            "Ayup, yes we have",
            "Kanata can already do all of JP. I think Ollie did everyone on her debut but dunno if she's kept up.",
            "**all** of Hololive*",
            "She also said she was stopping activity due to \"becoming a florist\"\n\nAnd her new name is Elizabeth ROSE Bloodflame",
            "I just assumed she was going to become a professional VA like Kira Buckland and Kayli Mills back then",
            "No reason to be ashamed for that, better to remember those times fondly, the world and Internet were completely different places",
            "I knew I recognized her voice, singing, and impersonations from something but my god its been like a decade since I saw her. Glad to see she's still kicking and thriving now.",
            "Do you want to see the moon riiiiise?\n\nOr \n\nI am Octavia?",
            "she did quite a fair bit of VA work for \"indie\" Youtube animations",
            "I remember a collab where Calli specifically was talking about a vtuber doing spot-on impressions of Hololive members. Fuckin' lo and behold, here we are!",
            "lol, not even subtle are they?\n\nTbf, her PL is also quite popular to even outside the fandom she was in.",
            "I love that they found Kanade too. A Korean girl singing K-pop and Japanese Vocaloid songs then got her to move to Japan.",
            "Wait, is Korone *really* a nepo hire? Because she's hands down an incredible across the board talent. I'd love to hear the story behind that, honestly.\n\n(And that's not to say that nepo hires can't also be talented, I've seen that with much-maligned leftist streamer Hasan Piker. It just means that some very talented people don't get shots because the nepos get them first.)",
            "GAMERS are nepo kids? Huh, that unexpectedly worked out pretty well in the end. I guess how wrong nepotism are only determined by how much value it brings to the entire company.",
            "tbf biboo got rejected twice already before",
            "Cover is like Xavier's School, but for VTubers instead of mutants.",
            "They still have to file through mountains of applicants so in a way they are searching out for \"the one\"",
            "Weird my screen shows 118k still. Even refreshed",
            "glad the watchalong debut didn't destroy the on debut viewership. watchalong debut are great since more eyes to the debuting talents but it also lessens their debut viewership (which is also important) since other people will just watch at the watchalong to get 2 stuff at once.",
            "I’ve got a running tally on Hololive and Stars, Phase, and I’m gonna start tracking Globie too(hoping Kiri gets the long neck toggle) on my notes app lol",
            "And then came Pekomama's debut. XD",
            "taking the average of all 4 of advent, it's around the exact same, give or take a couple thou",
            "Can't find a number for FWMC which should be the highest in Advent, but Shiori and Biboo' were around 125k - 126k",
            "I really wish I could tell ya but I didn’t keep track of that lol",
            "Yeah, I was a little surprised to see her previous channel *obliterated*, since we know for a fact that avoiding previous professional identities is absolutely *not* a requirement for Hololive and she had some seriously impressive accomplishments previously, apparently.\n\nAt least that's 100% up to her, but it was a little surprising to see. Still, she's already earned a silver button on the first *day* and with her talents, I'm absolutely certain she'll go far.",
            "Ah. I don’t watch too much Bettel",
            "Oh, she'd said something? I must have missed her last stream, I just realised I hadn't seen her live in ages and found out she'd locked down her account when I couldn't find her cover of \"not ready\" :'-(",
            "She'd said on stream that she wanted to focus on her singing rather than VA work a few months before she disappeared, so I guess in hindsight this fits the bill",
            "Well technically she is a full time Va for hololive. So you weren't wrong.",
            "I discovered that gen of MLP thanks to server-hopping in TF2. I found one where people micspammed MLP songs (and a lot of Queen) which I thought was fun, so I hung around it for a long time. \n\nI *recognized* Lizzy's voice real fast because I was listening to a lot of MLP and FNAF songs back then. That hasn't happened since Fuwamoco, but I think everyone knew who they were gonna be. I've never seen threads explode like they did when those two returned. \n\nGigi sounded familiar and I couldn't remember why, but Youtube-kun helpfully sidebarred clips of her PL and I had that fucking Leonardo DiCaprio Pointing moment. \n\nEveryone thinks they know who Rao-Rao Fight the Powah is gonna be, but I'm still clueless on Cecy.",
            "Oh I love I am Octavia.\n\nIm gonna listen it again.",
            "Lunar Pirate with Carbon maestro is how I initially discovered her\n\nAlso, this confirms the mlp to vtuber pipeline",
            "Oh gosh what a timewarp this became. Thats how my gut told me who it was",
            "Uptown Funk  \n[https://www.youtube.com/watch?v=RSh2dwPvNCM&ab\\_channel=GabeHuber](https://www.youtube.com/watch?v=RSh2dwPvNCM&ab_channel=GabeHuber)",
            "Like who?",
            "I think Ollie is known for scouting out new talents, I remember seeing a clip once where she popped up in Bae's PL VTuber stream with her official Hololive account, which was also very obvious xD\n\nAnd >!Caitlin!< is incredible well connected due to her history as a cover song singer and anime voice actress. I wouldn't be surprised if she followed >!EileMonty!< for years or if they know each other personally from cons and stuff, but I think there is no way of seeing how long someone follows a Twitter account.",
            "From what I remember fubuki recruited mio, who then recommended Okayu and Korone to fill up the slots in Gamers",
            "IIRC it's as simple as they were goods friends of our friend (Fubuki).",
            "Which also speaks to the strength of the brand that such talent would rather keep applying for Holo after getting rejected twice than settling for a different corpo.\n\nA lot of these talents aren't just looking to be in a corpo, they're looking to be in *Hololive*.",
            "the first time she literally applied without having any videos or streams done.....and many had to apply more than once even with a working portfolio....find me one hiring agent that can extrapolate without any background how good and dedicated somebody is",
            "Are you implying hololive isn't a school for mutants?!",
            "This, with so many applicants, if you do not have the right hiring/interview process, the right HR people to identify the right talents, they would have had missed them out.",
            "The watchalong doesn't include audio from the debut stream to avoid this exact problem.",
            "Globie is kind of a silent runner up that has potential to be big. We'll have to see how their growth happens over the next year.",
            "do we really count those?. i mean it was only for april fool.. but for pekomama had peak at 181k..",
            "it was in the community tab",
            "Apparently, >!Soyapoya!<",
            "Never thought I would remember my brony roots again. First Fauna and now her? Hahaha",
            "She sang the die in a fire fnaf song for the living tombstone",
            "check out the youtube channel >!mashed!< she voices pretty much all the female characters in their animations",
            "It's sorta a daisy chain thing iirc. Mio got in on Foob's recommendation, then Mio suggested Okayu apply and Korone followed Okayu because Okakoro is real.",
            "Some of them might be considered mutants or have mutated traits, but hololive is more into showing their talents in music, arts and games than say using temporal powers, reaping souls or keeping a FAQQING monkey (IT'S ALIVE! 🌩️)",
            "oh didn't know that, ive only watched the debut streams. thats indeed a good way to negate the negatives of watchalong debut.",
            "Bonnie and Kiri’s growth right outta the gate compared to everyone else is astounding",
            "There are more Horse Woman among us https://www.youtube.com/live/gd12kTdSlNw?si=QqezmkgmDRXAPvFV",
            "wait, who's fauna?",
            "youre not fucking with me on this one, right?",
            "I know she's the one that did those impressions videos that Calli even mentioned in one of her streams, but I didn't know she's the singer of one of my childhood songs",
            "oh dang I watched a few never realized",
            "Mio didn't get in on Fubuki's recommendation. Fubuki did not know Mio applied and neither [did Mio tell her](https://www.youtube.com/watch?v=elL7NK5Se4A).",
            "They are putting absolute work into marketing themselves so they deserve it",
            "There will be loads on the Internet but for some reason people are ashamed of it.\n\nIt was a cool creative time, probably the most creative fandom of all time tbh",
            "No",
            "Nope. We are not fucking with you. :)",
            "she does a great >!Tails!< voice, also decent NSFW-ish >!Peach!< voice so quite a good range vocally",
            "Degen bronies are no different from degen weebs. If anything, bronies have pumped so much fancontent even after the series ended. FiM was just that good.",
            "You can watch it",
            "/mlp/ is still a very active board, to this day people still fight for which horse is Best Horse.\n\nIs Applejack."
        ]
    },
    "Do other girly Vtubers have a similar thing?  😭😂 (I don’t mind but wowww)": {
        "title": "Do other girly Vtubers have a similar thing?  😭😂 (I don’t mind but wowww)",
        "score": 144,
        "url": "https://i.redd.it/n8qru159s18d1.jpeg",
        "content": "My YT: ZyaaaVT",
        "num_comments": 15,
        "comments": [
            "Female Vtubers in general have very male dominated viewership",
            "I'm a man tuber and still have that ratio. It might just be the demographics of the games we play.",
            "Was that... unexpected?",
            "Yes, it’s actually a running joke among the girls of Phase Connect that their female viewership is too low to get sponsorships from otome games they might want to play on stream. In particular, some of them wanted to get sponsored by Love and Deepspace I think it’s called. Chisaka Airi even did a joke stream to brainstorm ways to get her female viewership up, and that stream had even less female viewers than average.\n\nSome girls do get higher female viewership, but I think it’s a matter of the type of content you make and what you choose to talk about.",
            "The female Vtubers are everywhere meanwhile the male viewers are bountiful\n\nExpect this to stay consistent for the future\n\nIt takes a lot more work for male Vtubers to stand out too imho (especially if you don't have an instantly-pleasing/sultry voice)",
            "Connor/Cdawgva used to have 93% female viewership back when he started out. So it can happen the other way around too. (Even if he wasn't really a Vtuber back then).",
            "Yes",
            "I think the Vtuber audience is just predominantly male. I can only think of a few vtubers with a majority female audience, and it's usually the BFE type male vtubers. Not always, of course, but that's the common theme I've noticed.",
            "Hey check it out, the male loneliness epidemic in analytic form.  Most women don't need to watch a woman on a screen, they can just hang out with their friends.",
            "vtuber viewers are just horny weird guys, sorry you had to find out like this",
            "[There's a hour+ stream lecture describing the psychological reason behind this bias](https://www.youtube.com/live/CyUPsc4pqYg?si=7rKYDncMjaedUBLu)",
            "The joke is porn",
            "I’m still new to posting on YouTube and looking at Analytics! I guess I expected more of both! I just wanted to see what other people had :)",
            "I wouldn't be surprised if the streaming audience in general is male dominated, or at least for video games and such.",
            "Lmao XD"
        ]
    }
}