{
    "Weekend Discussion Thread for June 21, 2024": {
        "title": "Weekend Discussion Thread for June 21, 2024",
        "score": 61,
        "url": "https://www.reddit.com/r/wallstreetbets/comments/1dld55m/weekend_discussion_thread_for_june_21_2024/",
        "content": "[View Post](https://sh.reddit.com/r/wallstreetbets/post-viewer/1dld55m)",
        "num_comments": 3512,
        "comments": [
            "Whoa, just discovered this super cool setting on Robinhood! Y'all should give it a go\n\nhttps://preview.redd.it/p63ci9e1ez7d1.png?width=681&format=png&auto=webp&s=b53fe35a43da53ba34c68dab85f7596a68ed5963",
            "NVDA goes up for 2-5 days:\n\nEveryone: **NVDA IS GOAT, BERS FUK** ![img](emote|t5_2th52|4276)![img](emote|t5_2th52|4276)\n\nNVDA goes down for 1-2 days:\n\nEveryone: **NVDA CLOWNS, BOLS FUK** ![img](emote|t5_2th52|18632)![img](emote|t5_2th52|18632)\n\nNVDA: ![img](emote|t5_2th52|8882)![img](emote|t5_2th52|4275)",
            "Everyone is now bleating about NVDA overvalued, taking a breather, etc.\n\nNext week it runs back up to $140, everyone will be taking about 4th industrial revolution, AI, blah blah. \n\nThese fucking chicken heads are all the same. Like sock puppets with a hand crammed up their asses telling them what to parrot",
            "shoulda listened to that one guy who posted that yesterday and today were historically two of the worst trading days in the year",
            "# AI Discussion Summary\n-  Multiple people are treating things that aren't casinos like they are casinos and losing money\n- Someone's embarrassment about not knowing what an anal cyst is, is bringing a group of people closer together\n- As someone is discussing AI, another immediately disregards everything by insinuating they \"don't understand AI\"\n- A short chat happens about how to celebrate newfound wealth by spending as little money as possible",
            "Welp...been buying NVDA calls on every dip for the last 48 hrs.  80% port NVDA now.\n\nNext week I'm eating either Ruth's Chris or ramen.",
            "I would do ANYTHING for a 85x bagger next week",
            "So many NVDA bears coming out, it’s time to switch to calls",
            "The 140c got this sub good.",
            "I’m going to go through my weekend feeling nothing and being lifeless and soul less counting down the hours till I can feel something again on Monday",
            "So, all those anal-ysts increased NVDA price target just for this exit liquidity ![img](emote|t5_2th52|27421)",
            "\"When one door closes another door opens\"\n- Boeing",
            "Nvda $140 bagholders ![img](emote|t5_2th52|4271)",
            "I spent about $1.2M total today day trading NVDA\n\nKept swinging $NVDL in lots of 300 for the 2x leverage and taking small ass profits\n\nI made $800\n\nNo part of this is a joke\n\n/u/zjz Can I please get “Spent $1.2M to make $800” as a flair? I’ll DM proof if you need",
            "There are two times a grown man truly cries: witnessing the birth of his child, and witnessing his options expiring on a Friday.",
            "I just want to say thank you to everyone here. This is one of the few places on the internet where you can still engage in civil, Intelligent discourse.",
            "Imagine paying $100+ a month for cable TV just to watch medicine ads and fast food ads all day",
            "Theres no better feeling than being sucked off >!a boeing airplane after the door falls off!< when you lose money",
            "made 1400$ in 2 mins in my bed on appl puts this morning🙏",
            "Who would have thought that one day I would dislike weekends because the markets are closed ![img](emote|t5_2th52|12787)",
            "so many millionaires on WSB, wish that was me   😞",
            "Dude got like 400 comments everyday bro don't do jackshit at work",
            "Help\nA girl\nAt her lowest and she’ll leave you at yours",
            "Why are we #1 in stocks and investments. I thought this place was for gamblers yoloing full ports and posting gain/loss porn. Shouldn’t we be #1 Gambling and Shaming?",
            "It is kinda weird nobody bumps into dfv",
            "Hello guys, it's me, Exit Liquidity. How are you all doing?",
            "Taylor swift 👸& NVDIA stock holding this US economy ![img](emote|t5_2th52|4271)",
            "Daily $15k swings in the portfolio on options and no sweat, but I start losing $100 on a sports bet and feel like I’m about to lose the house",
            "Nvda 140 next week",
            "Wendy's dumpster will be packed this weekend",
            "Heads up, there are some weirdos on this page. Someone messaged me and asked me to meet them in the woods naked for a satanic ritual and they didn't even show",
            "DFV completely destroys his legacy by coming back and pump and dump on the apes lol.",
            "avgo is avgone  ![img](emote|t5_2th52|4260)",
            "That last min dump on AAPL was XLF ETF managers re-balance right?",
            "Made $65 day trading in my taxable account today. Lost $80 day trading in my Roth.",
            "think its going up huge on monday",
            "Options are truly like drugs. Except with none of the downside.",
            "Eat the company’s Friday pizza and form a union anyways 🧠",
            "Feeling like I’m fucking running on fumes, man. Every single day. I don’t know what it is. Literally apathetic to everything rn, fr. Trying to find joy in stonks, but all I do is make shit trades.",
            "Holy shit, just went to Wendy's and when the employee opened the drive through window a violent gust of BO hit me and it lingered in my car for a few minutes... fucking puts.",
            "Special Operation: Restore Your Portfolio next week![img](emote|t5_2th52|27189)",
            "# AI Discussion Summary\n- A commenter revealed they pee on their neighbor's property.\n- Holders of NVIDIA are arguing with a bear who wants to claim \"I told you so\" after a predicted dip.\n- A group of people are discussing rising Airbnb prices and how the service affects local economies.\n- Some people seem to be roleplaying the characters of a teen drama.",
            "I'm almost drunk enough right now to admit I'm sexually attracted to Garfield cartoons",
            "NVDA you were the chosen one ![img](emote|t5_2th52|27421)",
            "Don't tell my boss but I didn't do shit this week.",
            "Can I turn off the \"AI\" shit in Google so I stop getting incorrect information about fucking everything",
            "My mom won't talk to me after I told her to buy nvidia yesterday at the dip ![img](emote|t5_2th52|4260)",
            "Jealous of the guy hitting 1m with Nvda, he's gotta pay like 50% in taxes. And he lives in the bay area. So basically, this guy is still poor lmao. Jealousy gone.",
            "I will forever associate juneteenth to when I got mauled by bears",
            "Some dude offered me a bj today in exchange for a product promotion. I turned it down as I’m a man of strong moral character. Just as strong as a sheet of the all new, extra thick bounty paper towel. Now available in medium and large rolls.",
            "Rebalancing commencing as soon as the bell rang both NVDA and AAPL have share blocks of 999,999 and as high as 3 million blocks passing...the MM's brought them down so they could rebalance on the back of retail...you're welcome regards ![img](emote|t5_2th52|4267)\n\n  \nThe AAPL price is 207.49 and they are adding NVDA at 126.57 never seen this many huge blocks just piling on one after another....",
            "Not to brag, but I made $19 today.\n\nAfter losing several hundred.",
            "so many game stonk 6/21 call holders got wrecked today. mm's and thetagang absolutely feasted",
            "#Ban Bet Lost\n\n/u/alon359 made a bet that NVDA would go to 129.0 within **2 hours** when it was 126.997 and it did not, so they were banned for a week.\n\nTheir record is now 0 wins and 1 losses\n\n[**Join WSB Discord**](http://discord.gg/wsbverse)",
            "I’ve lost so much money ![img](emote|t5_2th52|4271). But I now have developed a sure fire strategy to make up all my loses. I’m going to wait for a catalyst then full port weeklies. All I need is a 4 bagger and I’ll be happy!!’ Can’t go tits upemote:t5\\_2th52:4275",
            "If NVDA don't hit $135 next week, my 🍑 will be 🌱.",
            "Genuinely depressed",
            "Made almost 10k this month. Never been so lucky before.",
            "Pretty funny that NVDA is having an employee retention problem because some of their employees have stock options now worth over $20M",
            "I remember the last time everyone said it was the end for NVDA. How did that go again?",
            "approached the gym girl today, in the parking lot, black out drunk, and she pepper sprayed me. They say bad attention is still attention.",
            "I just wish the hawk tuah girl was here with me now, man…",
            "Im a fincel, I have never touched profits ![img](emote|t5_2th52|4260)",
            "# AI Discussion Summary\n- Many people blame Nvidia for their losses and think it may go down even further. Others suggest buying calls for other tech stocks. Some users express disbelief at the recent drops.\n\n\n- Quite a few people are sharing that they are upset about their option positions or portfolio values today and yesterday, using colourful insults and references. \n\n\n- Tourists are apparently bad in every country, according to one comment. Americans are apparently the worst tourists, however. Another user sarcastically describes how much fun Americans have overseas doing activities that are illegal in America. \n\n\n- One user is trying to predict how the markets will perform next week and beyond, aided by an unspecified MVP. A responding user thinks there will be no rip next week.",
            "Refinancing crisis soon. All these underwater CRE loans coming to maturity over next two years. No one is going to refi this toxic trash.",
            "Amazon $200 next week?",
            "AVGO to the moooooon",
            "Many say breaking up with your partner hurts but theta killing your calls hurts even more than a break up",
            "!banbet\n\nGoodbye friends, nvda let me down again",
            "aayooo! that Eric from Cantor Fitzgerald guy says we've topped on ai.  That guy is always fuckin wrong. calls!",
            "Was going to buy MU calls until I realized every regard here is doing the same. That play is fucked",
            "its really easy to fall in love with a crazy person if you don't want to be lonely",
            "#Ban Bet Lost\n\n/u/kananishino made a bet that AAPL would go to 195.0 within **1 week** when it was 207.2 and it did not, so they were banned for a week.\n\nTheir record is now 0 wins and 7 losses\n\n[**Join WSB Discord**](http://discord.gg/wsbverse)",
            "How hot is it where you’re at",
            "NVDA down 10% from the high, pull back achieved. Time to rocket next week ![img](emote|t5_2th52|4276)XLK rebalance copium. nfa.",
            "5’7” guys telling stories like “when I was little”\n\n\nGuy you mean like this morning?",
            "Can’t sleep so I’m just here reading the comments because I have no life ![img](emote|t5_2th52|12787)",
            "Thought I was a genius after making $200 on NVDA\n\nToday I **lost** 15k in NVDA ![img](emote|t5_2th52|27421)",
            "My Nvidia puts were worth .11c at open \n\nClosed them for 6.6",
            "The entire market is 6 tech stocks jerking each other off in a circle",
            "Gamestore bagholder checking in. Still an absolute piece of shit as of june 21 2024.",
            "But of a rough day ![img](emote|t5_2th52|4260)",
            "the only rebalance happing is the balance of your folio to MMs folio lmaooooooo!!!!!",
            "Copped some nvidia options today nice dip",
            "Bools and bers had a very very bloody fight this week.  Round two next week.",
            "I managed to buy a HIMS call at the top a few days ago. This has to be the 3rd time I buy HIMS calls at the top. ![img](emote|t5_2th52|4271)![img](emote|t5_2th52|4267)",
            "I'd like to thank Bears for being liquidity this month. made 4 new ATH's.",
            "I like turtles",
            "Spending the weekend relaxing in my sister’s leopard skirt, drinking a cosmopolitan 🍹",
            "I may spend a day meditating on buying an option, or even a week...and when I finally pull the trigger, usually within an hour I learn some piece of information on why it was a bad decision. Like clockwork.",
            "I like to call her tiddies 69420 and 10665 \n\nBecause together they make 80085 \n\n🅱️0️⃣0️⃣🅱️💲 😮‍💨",
            "# AI Discussion Summary\n- European countries are apparently still a thing and one person really does not like them.\n- A disgruntled gang member's crippling depression turned into crippling digit loss. It's all fun and games until the bears come out.\n- AI is cool but useless, whatever that means. No one was speaking with any authority on the subject.\n- There were a number of sentiments shared about openings of various orifices. Open to interpretation but probably NSFW.",
            "Hey guys, o have something to say:\n\nNvidia NVDA Nvidia NVDA Nvidia NVDA",
            "A Dorito got caught sideways, I chomped down, and it cut the roof of my mouth and I am in sadness ![img](emote|t5_2th52|4260)",
            "Why is it that went it comes to buying myself things or going places I'm stingy as a motherfucker but when it comes to pissing away money in options it's no issue",
            "Hoping for a good MU earnings ![img](emote|t5_2th52|18630)",
            "Should’ve taken the $500 profit instead of hoping for semis to rebound. Now I’m a long term investor in AVGO ![img](emote|t5_2th52|4260)",
            "Coming back to this subreddit after switching to long term investments…. the opinions on here are wild",
            "Pump and Dump Kitty got extra 50mil in his net worth. Apes got more ramen.",
            "I saw the tiny blip where xlk bought NVDA.",
            "$5 trillion in options expired.\n\nSPY 🥱🛌💤",
            "dumped so hard they said “naw, we don’t need to rebalance” ![img](emote|t5_2th52|31225)",
            "Im so regarded that i lost money with nvidia puts",
            "I'm looking for a man in Finance ![img](emote|t5_2th52|4275)",
            "OPEN THE CASINO ![img](emote|t5_2th52|27421)![img](emote|t5_2th52|27421)![img](emote|t5_2th52|27421)![img](emote|t5_2th52|27421)![img](emote|t5_2th52|27421)",
            "AAPL what on earth",
            "Got MU, NVDA calls for next week",
            "After these last two days, I think the daily chats are gonna be much quieter next week. 🤭🤭🤭",
            "Market was hitting all time highs\n\nMy portfolio was hitting all time lows ![img](emote|t5_2th52|4271)",
            "It's unamerican for the market to pull back before Independence Day ![img](emote|t5_2th52|4276)",
            "MSFT on top market cap casually enjoying his wine and cigars while he looks onto the streets below where 2 homeless dudes NVDA and AAPL fight over the half eaten hamburger that's 2nd place market cap.",
            "I sure hope my WSB DD pays off. I bought forty shares of NVDA at 126.10  Better late the never huh??",
            "When I was a teen I was led to believe that my pre-cum could get a girl pregnant, but I’m thinking you have to fully bust in there. This was never cleared up for me.",
            "NVDA back to prices not seen for 9 days, WSB in shambles",
            "Scared money don’t fuckin make money.",
            "#Ban Bet Lost\n\n/u/ArnoldRothsteinsAlt made a bet that SPY would go to 541.0 within **2 hours** when it was 544.809 and it did not, so they were banned for a week.\n\nTheir record is now 5 wins and 10 losses\n\n[**Join WSB Discord**](http://discord.gg/wsbverse)",
            "I need to vent guys. I bought 0dte puts and I lost money today. Has anyone else ever experienced this feeling here?",
            "#Ban Bet Lost\n\n/u/A_Retarded_Trader made a bet that SPY would go to 525.0 within **1 week** when it was 542.909 and it did not, so they were banned for a week.\n\nTheir record is now 2 wins and 15 losses\n\n[**Join WSB Discord**](http://discord.gg/wsbverse)",
            "# AI Discussion Summary\n- The gang is discussing what to eat and how food relates to their portfolio. \n\n- NVDAs and burns are being discussed quite a bit, with many people joining a Discord server to share information. \n\n- Apparently, there's a CEO who is not very well-liked or respected. \n\n- Due to some poor financial decisions, several members need to make some extra cash and are now looking for odd jobs, including babysitting and nightclub work.",
            "Yea nobody selling confirmed",
            "On weekends I look forward to Monday, on Mondays I look forward to the weekend.",
            "You show me a pay stub for $72,000 I quit my job right now and I work for you",
            "NVDA 140 by Friday.",
            "Some of you don’t reward yourself with the bliss of heroin after an honest days work stripping copper from your neighbour’s garage and it shows.",
            "I see no issue with trying to be a quick bear, take a gamble time the market turn a couple hundred into a couple thousand. It’s not for me, but I get that. It’s the perma bears, walking around saying the sky is about to fall, victory lapping one red day predicting 15 of the last 2 market corrections that irk me.",
            "I’m gay and my dick is small",
            "So who’s still poor after this week? ✋",
            "nVda $140 next week ![img](emote|t5_2th52|8882)",
            "One red day on nvda and half the sub wiped out lol",
            "This weekend i will be spreading the good word of NVDA to indigenous tribes hidden throughout North Sentinel island. Given 95% of the population is already invested in NVDA we must convert the remaining humans that live with no connection to the outside world.",
            "If I weren't so lazy, I would go find the post I wrote a while back explaining in more depth that NVDA does this almost every quarter:\n\n1. Reports blowout earnings. Shoots up overnight\n\n2. Week following earnings - continues to run up as analysts raise targets\n\n3. Following month - eventually runs up to the higher end of average price targets (In this case 1400 - Split adjusted $140)\n\n4. Then drops - follow by churning around for a month.\n\n5. Then about 2-4 weeks out from next earnings, starts a slow climb back up to that same higher price target average.\n\n6. Reports blowout earnings, rinse, repeat.",
            "Can NVDA go up 15% in 3 weeks?\n\nNo\n\n>!It can go up 15% Monday!<",
            "BRO I LOST SO MUCH MONEY THIS WEEK",
            "This sub is overdue for a proper culling. NVDA has a two day dumpy streak and we're flooded with dozens of posts about the NVDA crash. Bears took it up the ass in silence for months while getting clowned on, one tiny pullback and the young bulls are shitting their pants.   \n\n\nYou regards are actually pissing me off, NVDA back to prices not seen since June 10th.",
            "I am officially done with options, never touching it, never ever. I should have just stayed away ![img](emote|t5_2th52|4260)",
            "##Everyone in here is just AI talking to AI. In fact, you're AI.",
            "Pizza rolls locked and loaded 👨‍🍳",
            "Jpow : Plunge protection team deployed today ah, I repeat",
            "The fuck was that amzn pump at close?! I have puts expiring next week that were barely break even and went to -48% all of a sudden, fuckin kunts and of course I averaged down on that shit ![img](emote|t5_2th52|4640)",
            "open the casino ![img](emote|t5_2th52|4260)",
            "Red day. Surprise.\n\n  \nBUT I GOT MY VA CLAIM $$$ LETTER! \n\n\n\n80% from 3 claims with 18 more still in work.\n\n  \nYA BOY GETTING 100%.\n\n  \n....kinda sucks though.\n\n  \n(50% of that backpay going straight into the portfolio)",
            "the number of regards in here that think Quad witching is all that exists is impressive. today was a Triple witching regards.",
            "After 3 months of options trading I have the infinite money glitch for all you regards. Hear me out: Starting Monday I will post the calls and puts I buy and you all just do the opposite! I lose money and you win!",
            "So when will Wallstreet realize that Apple is a stagnant and washed up company ![img](emote|t5_2th52|4267)![img](emote|t5_2th52|4271)![img](emote|t5_2th52|4271)",
            "Y’all should know by now, fear is the mind killer",
            "Neel Kashkari added me on LinkedIn.",
            "Imagine talking about stocks in weekend thread instead of Latina booties or big tiddies",
            "\"Excuse me sir, do you have a moment to talk about Latina booties and big tiddies?\"",
            "Remember on Harry Potter when Harry was making Dumbledore drink all that pp water? Shit wasn't right ...",
            "Imagine if they opened the market on Saturdays from 10-3",
            "Need to give my girl a deep cockin’ later",
            "Okay I think my sister is on onlyfans making money.\n\n\nthere is no way an unemployed chick for the last 4 years can live in DC alone.\n\nOn top of that she doesnt date men because of her lesbian thingy. \n\nthere is litterray no other way.",
            "# AI Discussion Summary\n- People are discussing the challenges of trading options and the differences between cash and margin accounts. There's also worry and regret about NVIDIA calls as well as skepticism towards those who buy into a stock with large and consistent returns. \n\n- A group is strategizing on Airbnb (ABNB) and the effects of policy changes on tourist housing in Barcelona. Some believe that banning tourist apartments/houses will have a significant impact on the company and the overall tourism industry, but others disagree. \n\n- Sports betting is on everyone's mind. Several members are concerned about their losses from sports betting and compare their experiences with trading options. \n\n- There's a discussion about a sister possibly being on OnlyFans. Many jumped to the conclusion that an unemployed lesbian sister living alone in DC must be on OnlyFans. RagingBearBull is now reverse-engineering social media handles to find out more.",
            "Buttholes > vaginas",
            "I hope you pussys bought the dip",
            "WATCH ME DANCEEEEE DANCE THE NIGHT AWAY 🕺 💃",
            "Guys there is only one hour of oxygen left in the titan submersible. Praying for them 🙏",
            "The entire front page is NVDA loss porn ![img](emote|t5_2th52|4271)",
            "The fukr that invented yoga pants needs a damn statue ilon Mt rushmore",
            "NVDA good dip buy",
            "Time to send a hey you up text",
            "Who's holding NVDA options over the weekend, and are they puts or calls?",
            "i will order from a different restaurant on uber eats to avoid a steep delivery fee but sleep like a baby losing $800 on puts",
            "5’7” guys telling stories like “when I was little”\n\n\nGuy you mean like this morning?",
            "Remember when hertz buying teslas was going to be the game changer for that company and drove the market cap over a trillion?",
            "MOASS is a regarded theory, especially now that Ryan Cohen has shown that he'll just dilute shareholders/dump on them. \n\nPeople are really really dumb at this point",
            "SPY 555 Monday",
            "Market topped Juneteenth\n\nThanks Obama",
            "gambling addiction is a real and serious problem.. but its also pretty funny",
            "![img](emote|t5_2th52|27421)",
            "That close somehow pissed off bulls and bears on NVDA.",
            "Okay whose hitting the bar to drown their sorrows away? ![img](emote|t5_2th52|4260)",
            "Feels like we already had 🅱️eekend this week\n\n#🤔",
            "that looks like the rebalancing at the end. 115m in the final minute.\n\nso they manipulated nvda all day so they could load without driving the price up a ton",
            "The witch roasted me",
            "Anybody remember a link to the post of the guy who said June 20 and 21 are one of the worst performing days in history next to some days in September. \n\nAnybody got a link to that post?",
            "Someone selling 5 million shares of ARM at 4:01 ![img](emote|t5_2th52|4271)",
            "Well my financial future is tied to 550c on SPY for 6/28 expiry",
            "My credit score just dropped 34 points.  Apparently buying a new home and racking up credit card debt is bad.",
            "If you think about it stock price movement is 50% fundamentals and 50% hot popular girl cheerleading contest (how sexy the company is)",
            "I am Icarus, and I flew too close to the sun.",
            "AAPL and NVDA are neck and neck, 3.18T to 3.17T",
            "If Nvda drops another ten percent like the people on cnbc want, I’m full porting calls cus that’s insane",
            "Disney puts on Monday they don’t like white straight men![img](emote|t5_2th52|27189)",
            "The chances of your portfolio being killed by a BER are low but never ZERO ![img](emote|t5_2th52|4640)",
            "Bought 130, 133, 134 NVDA calls expiring 12th July, how cooked am I?? ![img](emote|t5_2th52|12787)",
            "How do I get some goddam flair",
            "Staying long with tech. Adding on these slight dips.",
            "still kind of in a funk over the fact that kroger beat earnings/guidance and pumped 2 days before, and day of pre market to fall not even 10 seconds in. \n\nsometing about that doesnt sit right with me.",
            "I think i understand it.\n\nAll the old people in CA have hair, all the old people in FL are bald, and all the old people in TX are suffering from obesity.\n\nThat sums up those 3 states pretty well.",
            "Made steak burgers tonight🍔",
            "Its a ramen kinda night.![img](emote|t5_2th52|4260)",
            "Got into an argument with my 1/4 Asian 3/4 white cousin who looks like plain white guy from a midwest that he ain't \"ethnic\" or \"POC\" because everybody thinks he's white upon first glance.",
            "SPY hasn't dipped -1% in almost 2 months, hasn't dipped -2% in 16 months and hasn't dipped -3% in 22 months.",
            "Bruhs what if tornados are actually alien spaceships spinning really fast?\n\n#🛸🌪️🤔",
            "The fuck am I supposed to do all weekend",
            "Cash gang on top, NVDA calls next week then return",
            "I sold my NVDA calls above $140 and bought back in at close right around $126, I have a feeling we will see $135 again next week.",
            "I can’t believe the panthers are doing this for a 3rd night in a row ![img](emote|t5_2th52|4260)",
            "#FEAR IS DRIVING THE MARKET 😱😫💀👻",
            "Who be the sleepiest guy alive 😴🥱",
            "[deleted]",
            "Ready for the rocket fuel next week. No more red. We had a nice little tech pullback. Time for green machine. ![img](emote|t5_2th52|4276)![img](emote|t5_2th52|4276)![img](emote|t5_2th52|4276)",
            "Lots of data dropping next week ![img](emote|t5_2th52|4276)",
            "https://www.reddit.com/r/wallstreetbets/s/phnaYRSjdl\n\n👀 I called the two red days in a row, in Wednesday’s overnight thread. Now I will be wrong for the rest of my life, like I deserve to be as a 🌈🐻.",
            "Tbh I'm looking forward to a NVDA redo so I can short it.  NVDA please 140 again.",
            "Moving NVDA gains into MU next week",
            "Avgo",
            "MU opening at 150",
            "# AI Discussion Summary\n- Some guy got pepper-sprayed, but it's unclear whether it was deserved or not and why it keeps happening\n- Reentry is still worrying, everyone is being very mean to Boeing while Travis Barker and Kim's sister are doing something lewd\n- A rough translation of a ticker led to an interesting interpretation of the market's health\n- Claims of people being unreasonably large and strong, hookers refusing service, putting organs in the wrong orifices, offering strange life advice, and generally unsavoury activities",
            "Remember bros NVDA shareholder conference Wednesday June 26\n\nExpect more titties to get signed![img](emote|t5_2th52|12787)\n\nNot financial advice",
            "Last 2 days cleared out all of my profits from this week 😭",
            "Amber Ajami got the kind of milk cannons that could save the whole ass orphanage if the crops fail because of an early frost 😭 \n\n🫲🫱",
            "I fought with customer service over $5 extra internet charges but I didn’t feel anything when theta was killing my calls\n\nOptions addiction is something else",
            "This guy warned all of us:\n\n„June 20 and June 21 are the 4th and 5th worst trading days of the year“\n\nhttps://www.reddit.com/r/wallstreetbets/s/MRDYnWUPPM\n\nu/pttrader22",
            "AVGO SPY NVDA MU  GOOG AAPL",
            "SPY 550 on Monday I’ll do some hawk tuah on multiple things.",
            "$aapl got rugged hard into the close ![img](emote|t5_2th52|18632)",
            "#Ban Bet Lost\n\n/u/TeslaLeafBlower made a bet that TSLA would go to 200.0 within **22 hours** when it was 181.515 and it did not, so they were banned for a week.\n\nTheir record is now 1 wins and 106 losses\n\n[**Join WSB Discord**](http://discord.gg/wsbverse)",
            "Roaring shitty cult got gaped today ![img](emote|t5_2th52|4271)",
            "!banbet $NVDA 150 2w",
            "Bears see stocks down 7% and then they buy puts",
            "I’m buying SPY 300 puts\n\nWhen it splits 2-1 at 600 I’m going to be fucking rich\n\n![img](emote|t5_2th52|27189)![img](emote|t5_2th52|4276)![img](emote|t5_2th52|4275)",
            "Lesson learned, never buy calls on Juneteenth week",
            "Those 4 witches grabbed bools by the p\\*ssy ![img](emote|t5_2th52|4267)![img](emote|t5_2th52|4271)",
            "I’d like to give a shout out to the “2 worst stonk market days in history” guy. Pretty sure everyone ignored you but solid dd",
            "I got to thank Nvda bulls for making the top so obvious even tho I did worry for a second at open yesterday",
            "*\"I prefer large, natural breasts\"*\n\n-Julius Caesar 40 BC",
            "BREAKING NEWS: I'm incredibly gay![img](emote|t5_2th52|4271)",
            "Gay",
            "Holy fuckery![img](emote|t5_2th52|4640)",
            "🅱️ENIS ![img](emote|t5_2th52|4260)",
            "Spx up 35 pct in 9 months. Yes, i am so smart and rich.\n\nspx down .5 pct. WHAT THE FUCK IS HAPPENING",
            "oof...down 7K on the week",
            "how does apple have 100m volume candle wtf????",
            "Now here comes the nvidia after hour pump ",
            "I think I might be ga…",
            "Calls on $PORN till Monday.",
            "Market was about to pop and Apple shat the bed lmao",
            "I’m pooping and getting paid ￼​￼​![img](emote|t5_2th52|4276)![img](emote|t5_2th52|8882)",
            "Got some nvda calls and tsla put lotto tickets for Monday\n\nTime for some beer ![img](emote|t5_2th52|8883)",
            " Citi Economist Dismisses Soft Landing Narrative For US: 'Not Seeing It In The Data'",
            "Balls deep in ASTS calls on a hail Mary they announce gov funding at next weeks event.",
            "That EoD dip filled all my buy orders. Looks like I'm cash poor again",
            "I'm here for the...power...hour...?",
            "Imagine if NVDA goes to 140 next week\n\nDoes ber just cry and downvote?",
            "AAPL calls ![img](emote|t5_2th52|27421)",
            "I can’t believe they are crashing the markets right before 4th of July",
            "Monday fin to rip",
            "An estimated 5.5 trillion dollars in options were set to expire today. Wow, at this point what even is money? Least they can do is kick me a milli",
            "sufferin succotash",
            "AVGO really letting me down.",
            "My psychic said keep buying TQQQ. I’ll be billionaire before I retire ![img](emote|t5_2th52|4258)![img](emote|t5_2th52|4258)",
            "Hope I didn't make a mistake with that last minute AAPL impulse buy. 210c weeklies. ![img](emote|t5_2th52|12787)",
            "Cancelled an order of 60 AAPL @ 208.50 right before it bombed. Fidelity doesn't show the time stamp of my cancel order but MAN it was close.",
            "Would certainly love a more greenish day for Monday,  not much green, just to get the vibes back up. Last two days have been an absolut clusterfuck",
            "!banbet AMZN 200 2w",
            "APPL is slowly getting yummy again ...![img](emote|t5_2th52|4258)![img](emote|t5_2th52|4258)",
            "Its getting really bullish… im concerned",
            "Left a lot of money on the table this week. Feels bad man. ",
            "Disney is so fuckin cooked lmfao.",
            "Joanie loves chachi!",
            "With micron earnings we can guesstimate how well NVDA is doing ![img](emote|t5_2th52|12787)",
            "[deleted]",
            "Wendy's dumpster rebalancing this weekend",
            "I bet we rip next week before debates so Biden can tote that when the economy is brought up. This was a major witching so things will be back to normal next week to all time highs. ",
            "If Apple had nicely released Artificial Intelligence, they would have been fine at EU.\n\nBut no, they had to rename it to Apple Intelligence. Of course the boomers in EU would lose their shizz ![img](emote|t5_2th52|4271)",
            "YOU GUYS ARE STRESSING ME OUT TOO MUCH!!!!!",
            "# AI Discussion Summary\n- Someone gave tips on how to avoid having losses in your brokerage account. The method is to keep your phone on airplane mode for 7 years. \n\n- A new immigration strategy was discussed, which involves getting married to a local and then moving out of the country. Others added advice, including the significant time and financial costs of regular immigration. \n\n- The sub experienced some large losses on NVDA calls and the mood is very salty but some still hope to eat at Ruth's Chris next week instead of instant noodles. \n\n- A witching event was identified as the reason for all the blood in the streets today. It's unclear if anyone actually knew this would happen beforehand and a lot of counter-arguments were made.",
            "Tesla peaked in 2021.\n\n—Unpopular opinion",
            "I’m up 70k this year but I feel like my gains are one bad month from being vaporized ![img](emote|t5_2th52|31225)",
            "Nvda 150C 8/16 @ 3.80 - will it print?",
            "what i learned today is \"triple witching day\" means nothing",
            "Need the nvidia ceo to sign some more tits this is brutal",
            "!banbet $MU 160 1w",
            "!banbet NVDA 133 1w",
            "When she looks a little mean ![img](emote|t5_2th52|29637)",
            ">Nvidia’s CEO Jensen Huang and AMD’s CEO Dr. Lisa Su are actually first cousins once removed. Their family ties trace back to Tainan, Taiwan, where they were both born. Huang’s mother is Su’s grandfather’s sister, which makes them close relatives in the family tree. \n\nI wonder if they have a third cousin in TSM.",
            "Finally a weekend to relax 👏😮‍💨",
            "any nvda predictions mid july? \n\ni dont think my crayon drawing analysis is right",
            "I’m going grey. I’ve been told it’s a sign of maturity and masculinity?",
            "So who’s working behind Wendy’s this weekend ![img](emote|t5_2th52|31225)",
            "I bought INTC in my ex wife’s Roth IRA and NVDA in my own\n\nWe’re on great terms but damn, she is fuk",
            "Saw some landwhales wearing super tight yoga pants",
            "\"Ask your doctor about these pills. Side effects include bleeding from anus and death.\" \n\nEvery ad commercial ever.",
            "Binge watching paint dry",
            "The old Friday night dick twister maneuver",
            "You ever feel lonely? Big titties only do so much ![img](emote|t5_2th52|4260)",
            "I know I’m old cause now high schoolers annoy the fuk out of me",
            "Have you considered being 6'5\" w lawyer parents and a can do attitude 🤔",
            "I lost money today, but its still funny when other people lose money. I guess im sadistic",
            "I prefer the middle urinal, it's more social and it has the best views",
            "Imagine not being able to do math",
            "Well all I can say about the last two days is Fuck Me. I knew I should have sold every fucking thing when it started looking red.",
            "We in an AI tech bubble. Wen crash this year or next?",
            "###THEY BENIS CUZ THEY ANUS",
            "The drinks are talking to me. They’re saying DRANK ME",
            "It's 2024. Why can't I set a gif as my desktop background",
            "HIMS gave me that Hawk-Tuah today! ![img](emote|t5_2th52|4271)![img](emote|t5_2th52|4267)",
            "It's time for me to crank one out.  ![img](emote|t5_2th52|4275)",
            "We are staging a protest against bers in the town square.\n\nWhat do we want?! Free money and stocks go up!! When do we want it?! Now!!\n\n![img](emote|t5_2th52|4258)![img](emote|t5_2th52|4260)![img](emote|t5_2th52|18630)![img](emote|t5_2th52|12787)![img](emote|t5_2th52|27421)![img](emote|t5_2th52|4258)![img](emote|t5_2th52|4260)![img](emote|t5_2th52|4258)![img](emote|t5_2th52|27421)![img](emote|t5_2th52|4259)![img](emote|t5_2th52|4259)![img](emote|t5_2th52|18630)![img](emote|t5_2th52|27421)![img](emote|t5_2th52|4258)![img](emote|t5_2th52|4260)![img](emote|t5_2th52|4259)",
            "Could swear on my frosty, there were a few of you behind Wendy's sitting by the dumpster.. that last hr traffic ![img](emote|t5_2th52|4271)",
            "SWEETCHIN MUSIC AND I WONT PASS THE AUX, HOW MANY STOCKS DO I REALLY HAVE IN STOCK ONE TWO THREE FOUR FIVE PLUS FIVE",
            "This thread is so funny when you’re drinking lmfao",
            "Getting tired of tinder chicks using pics from 5-10 years ago and catfishing my ass",
            "What are the consequences of uncontrolled shitposting?",
            "Starting with $100 in both accounts Monday\n\nLet’s make it back team ![img](emote|t5_2th52|4258)![img](emote|t5_2th52|29637)",
            "If you’re one of those vegetarians that eat fish I think you should be able to eat bird too because birds are just like flying fish, they can move all around but in the sky ![img](emote|t5_2th52|8883)",
            "Some of y’all could be getting banged by a hot woman.\n\nBut instead, lounge out on here with a bunch of single horny degenerates ![img](emote|t5_2th52|51295)",
            "stop buying stuff you dont need\n\n![img](emote|t5_2th52|27421)",
            "[deleted]",
            "Got home safely after work",
            "I've been jerking off more than usual lately",
            "Do you guys think cocaine futures exist? ",
            "# AI Discussion Summary\n- Boeing may be in hot water, but there's a mixed bag of feelings on SpaceX. One thing is for sure, space is hard.\n- Everyone seems to love NVIDIA and have a slightly unhealthy obsession with Cramer. \n- This might be a thin excuse for /r/wallstreetbets to discuss rocket sizes and insinuate how fast and smooth their thrusters perform. \n- Checks notes... now they're discussing spacemen and something about walnuts?",
            "pro tip. if your boyfriends gf is on her period. buy her a rib eye. she'll appreciate you.",
            "at this point people on WSB are just posting the same news everyday about Boeing for karma farming.",
            "You guys see that insane 100 million NVDA volume in the last 1 minute?",
            "5 million NVDA calls gone up in smoke.",
            "That AAPL drop was probably the sketchiest thing I’ve seen all year.",
            "“Rebalance” is a new and confounding term  with no understanding of what it means to our fellow regards here.",
            "I will sleep tonight knowing I won't lose money in the next 2 days ![img](emote|t5_2th52|18630)",
            "Robinhood is adding index options???\n\n#The BULL MARKET HASNT EVEN STARTED YET. MANIA COMING END OF YEAR 2024. Boookieeet",
            "Spent a week badly timing the market, now i get to spend the weekend badly timing my attacks in the Elden Ring DLC",
            "Fat rolls locked and loaded 🫃",
            "NVDA to 140 next week... Until then drink some beer and get laid",
            "People from nvdia sub calling people from tesla sub delusional ![img](emote|t5_2th52|4271)",
            "Market Correction done, we are going up next week",
            "I think it would be nice to be stalked by a women.\n\nI never have felt that level of passion, so that would be cool. Plus the movies make it look cool.",
            "bought more NVDA and SMCI calls ![img](emote|t5_2th52|4258)",
            "Don’t ever fucking eat Indian food before a travel day, don’t",
            "Big booty latinas 😍",
            "SPY only made 3 new ATHs this week out of 4 trading days. What a terrible week.",
            "Casino is closed. Let’s get some fresh air",
            "Rocket Lab bros... we are so back",
            "If you didn't buy the NVDA dip you ain't black",
            "Have a nice weekend.... See you Monday.",
            "After hours is gonna prove this shit is rigged ![img](emote|t5_2th52|31225)",
            "Holy shit I do not have the mental fortitude for this casino, I'll see y'all on Monday",
            "Where the people saying XLK buying $300 Billie's at 4pm",
            "[deleted]",
            "so whats the news on apple?? thats definitely not a normal drop out of the blue.",
            "Wtf happened to Apple and AVGO? Not too mad because Amazon did the complete opposite.",
            "Which Hedge fund exited out of Apple that last 10 min ? Not suspicious at all",
            "It looks like algos sold Apple and bought Tesla and Amazon right before close.",
            "If you didn't grab AAPL 210 FDs right before close, are you even a proper regard? ![img](emote|t5_2th52|4260)",
            "Easy come, easy GUHne",
            "Tried to buy NVDA 8/2 150C’s at close and it didn’t fill. \nWas it saving me from blowing 2500 or did I just cost myself a 10 bagger",
            "#Ban Bet Lost\n\n/u/OPINION_IS_REGARDED made a bet that NVDA would go to 125.0 within **1 hour** when it was 126.569 and it did not, so they were banned for a week.\n\nTheir record is now 3 wins and 4 losses\n\n[**Join WSB Discord**](http://discord.gg/wsbverse)",
            "I am no longer fond of the Swiss",
            "puts outweigh calls blah blah blah.  As smart as some people think they are they should be on a yacht instead on posting here",
            "My copium post: the problem isn’t that NVDA is overvalued, it’s that MSFT is undervalued . 500 EOY",
            "Just as expected it goes parabolic after everyones calls end worthless ![img](emote|t5_2th52|4271)",
            "All this rebalancing shit takes place at close and after hours, doesn't it?",
            "Crying in my bed",
            "Crying under that dudes bed",
            "I had 100 bucks yesterday to throw in sold my 137p eod for 1020",
            "Apple Unintelligence",
            "Sqqq and chill ",
            "Bitch ass witches",
            "Stuck in a meeting and was forced to hold SNOW, DJT, TSLA, AMZN calls, came back to +20k holy fuck what happened bers",
            "Apples always fall off trees  ![img](emote|t5_2th52|4271)",
            "So was the rebalance a nothing burger?",
            "Barrel rolls locked and loaded 🚀🦊",
            "Set a sell order at 50% profit on my SMCI put yesterday. This is the way to go. No emotion no checking every 5 minutes. Filled on the dip today while I was working and I open my port once at EOD to them gains ![img](emote|t5_2th52|29637)",
            "Plunge protection team > drill team 6",
            "Cathie is in profit on her Amazon purchase from June 6th I repeat Cathie is in profit",
            "A mass shooting at a store called The Mad Butcher?",
            "In order to celebrate my gains this month, I will be splurging on Hot Pockets, water, and Lima Beans.",
            "#Ban Bet Lost\n\n/u/LuckyBullfrog2602 made a bet that NVDA would go to 129.0 within **2 hours** when it was 126.955 and it did not, so they were banned for a week.\n\nTheir record is now 1 wins and 1 losses\n\n[**Join WSB Discord**](http://discord.gg/wsbverse)",
            "Meanwhile ARM gave zero fucks..maybe that thing will go to 200, and have a forward PE of 1000000",
            "It was Red ![img](emote|t5_2th52|18632) that fell on Newton centuries ago.\n\nThe second time was today before market close. Fuck Apple! 🍎![img](emote|t5_2th52|18632)",
            "I picture a Ber being someone like Clarence Thomas ![img](emote|t5_2th52|8882)",
            "Horses get farted on more than any other animal ![img](emote|t5_2th52|8883)",
            "PLTR LEAP calls $40 for Jan 2026 going for $300/pop\n\nMay just drop a grand on those Monday morning",
            "Forgot to row it down. So I'm Holding mu 180c over the weekend. Either it opens 5% up or I'm fooked",
            "Can’t wait for nvda to open up green so I can load up on calls and then when they hit 1 penny I can load up on puts! Keep buying high selling low guys!",
            "Just heard from the wife that my 70 year old mother in law wants to buy nvidea stock. \n\nNow she’s mad that I laughed and said it’s a top signal",
            "Seeing NVDA and Broadcom in the TOP LOSER tab on investing is weird af ngl",
            "I managed to save blow up my port Friday. Save it Monday, extend my gains Tuesday and then blow it up again yesterday and today.  I’m a true regard.",
            "# FUCK MY JOB\n\nI’m out of here ![img](emote|t5_2th52|27421)",
            "I let my girlfriend torture me last night",
            "Sooo like is asts still a thing?",
            "I was getting ready to hire prostitutes earlier this week… \n\nNow it looks like I’ll be getting pimped out to ghey bears this week to make up for my losses",
            "!Banbet AVGO 1750 1w",
            "Jensen Huang brining AI layoff platform to market very soon",
            "Anything pumping after hours?",
            "Thoughts on HOOD and RDDT for next week? I bought calls at the dip today.",
            ">It has recently emerged that Nvidia CEO Jensen Huang and AMD CEO Lisa Su are first cousins once removed, with 60-year-old Huang being the older cousin.\n\nThis family is taking over the world",
            "All I know is big money, medical weed, and publicly traded companies.",
            "who got my hopes up?? i thought my nvda 147 9/20 call closed at $9.58 for real,, turns out one of you regards just put in a limit sell for $11.55",
            "#Ban Bet Lost\n\n/u/Mean-Coffee-433 made a bet that ASTS would go to 15.0 within **3 days** when it was 11.494 and it did not, so they were banned for a week.\n\nTheir record is now 0 wins and 1 losses\n\n[**Join WSB Discord**](http://discord.gg/wsbverse)",
            "Bears are in full force today.\n\nWe are down less that 1% between 2 days.\n\nBears suffer from premature ejaculation.",
            "#Ban Bet Lost\n\n/u/Breathemore557 made a bet that NVDA would go to 135.0 within **1 day** when it was 130.187 and it did not, so they were banned for a week.\n\nTheir record is now 0 wins and 1 losses\n\n[**Join WSB Discord**](http://discord.gg/wsbverse)",
            "A sucker really is born everyday ![img](emote|t5_2th52|4275)",
            "suns out buns out ![img](emote|t5_2th52|29637)",
            "![img](emote|t5_2th52|4271)",
            "The most profitable user feature yet",
            "lol this fr, its funny how quick the narrative changes based on 2-3 days of price action",
            "He is the real MVP. I think he also said the week of July 5 is likely to be shit.",
            "Somebody find that guy",
            "That 3rd bullet is pulitzer worthy",
            "Those 3 calls gonna take you far brother",
            "Yes, as typical",
            "![img](emote|t5_2th52|4267)",
            "Green is green",
            "Guess NVDA wasn't going to go to 200 in 8 hours ![img](emote|t5_2th52|4260)",
            "Positions or GTFO, regard.",
            "Stfu",
            "You’re a fucking nerd",
            "“Intelligent”",
            "Get on your knees cuck",
            "Lmao this made me laugh",
            "You my friend are as obsessed as I am.",
            "I hate how this is true.\n\nAlso never ever, ever, ever, ever open up to a chick. She will think you are weak and leave you.",
            "He doesn't go where the poors go anymore",
            "200.",
            "![img](emote|t5_2th52|4276)![img](emote|t5_2th52|27189)",
            "I don’t think he gives a fuck he’s worth 300 mil now",
            "To the apes he can do no wrong",
            "I bought calls at the end of the day of just such an event, no way bers get three days",
            "The last time NVDA dropped more than 1% on back-to-back days (only one of now three occurrences in the last 3 months) it popped over 4% by the next open, >5% by close. That was also over a weekend",
            "What about the \"losing all your money\" downside",
            "Yo man if you don’t have anything better to do then drive to your nearest scenic hiking area and do a hike.  You’ll clear your head and get exercise.\n\nEdit: also make sure you stay hydrated, not just while hiking, but always.",
            "and i bet u still ate that food ![img](emote|t5_2th52|4640)",
            "Like the comic strip?",
            "Still is! Patience, Maximus Decimus.",
            "Should have asked your mom boyfriend for financial advise ![img](emote|t5_2th52|4271)",
            "![img](emote|t5_2th52|12787)",
            "![img](emote|t5_2th52|4271)![img](emote|t5_2th52|4271)![img](emote|t5_2th52|4271)",
            "You think anyones here bc they enjoy their life?",
            "Call me if u want 515-329-2543 or any of u regards. I'm at work in my office all evening. It will get better and those are not just cliche words. You got this 💪 👍",
            "No reason to stay, unless you love working to define the future of computing.",
            "Your Dad left your Mom and never spoke to you again.",
            "You already have a bet going - NVDA to 140.0 before 21-Jun-2024 06:03 PM -05",
            "Lmao the house always wins 😂😂😂![img](emote|t5_2th52|4271)![img](emote|t5_2th52|4267)",
            "Feels like 24/7 swamp ass here in south fl",
            "Yes",
            "75 and sunny everyday here in the Bay Area",
            "and then they try to tell you they're 5'10",
            "💎🤲🏻 that shit to 0",
            "How ![img](emote|t5_2th52|12787)",
            "You should call her",
            "U thik u btr than us cuz u went fancy as posh place. Lng term investing. Know ur roots kiddo 😤😂",
            "What's wild about NVDA 500 next week huh? There were some Anal ysts using lots of words about something, I don't know what they were talking about but there were lots of words, so nvda go up",
            "This is true... but scared money doesn't lose money either.\n\nPick yer spots.",
            "Name checks out",
            "We are always wanting, chasing, desiring... But never happy or content",
            "“Quick bear” is just a regular dude. Perma-anything is so stupid.\n\nBut also, bears are the worst.",
            "Ex: Last Quarter (going off memory, so blow me if im off)\n\nBefore earnings closed around 660, reported blowout earnings and opened at 750. Shot up to 850 the following week. Then for the next couple of weeks ran up to \\~950 (which was literally the high average of analysts' estimates).\n\nIt then suicided down to $750. churned around 800 to 880 for a bit. Then two weeks out from earnings started slow climb back up to 920. Reported earnings, opened at 1050. And so on.",
            "Since when have bulls not shit on bears. You make this sound it hasnt happen for past 2 years. We just take turns",
            "to be honest its kind of annoying hearing daily comments talking shit back and forth. \n\nyou make the best money playing both sides.",
            "See you on monday",
            "&#128065;&#8420; *Illuminerdy confirmed* &#128065;&#8420;\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/wallstreetbets) if you have any questions or concerns.*",
            "Today was a quadruple witching day. What are you talking about?",
            "I’d be down more",
            "Come on man, your family was planning on eating that rotisserie chicken for dinner ![img](emote|t5_2th52|4260)",
            "Let me know if she needs a deeper cockin’ ![img](emote|t5_2th52|29637)",
            "Post your sister for Karma. ![img](emote|t5_2th52|29637)",
            "Never had the pleasure unfortunately. \n\n\nJust the tip, and she rang the bell. 😔",
            "Honestly could be fine. Idk when you bought maybe You’re down now, but dont sweat it unless nvda actually dies which i doubt",
            "hang out long enough over the weekend, a flair god may show up. ![img](emote|t5_2th52|12787)",
            "bro you are coming off desperate",
            "drop an egg and some green onions in that shit",
            "U have enough for hot water. Thats $100 on waterbill. Cancel it and Throw it into 0dte",
            "If the Oilers can bounce back, so can NVDA",
            "What's driving you\n\n#🫵😳",
            "Buy a ticket to Dubai and be the fucktoy for a wealthy prince.",
            "how about u eat my ASS\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/wallstreetbets) if you have any questions or concerns.*",
            "Cleared my whole month lol",
            "and its still higher than when I sold for a loss two months ago because it wasnt moving at all ![img](emote|t5_2th52|4260)",
            "I just noticed that wtf LMAO",
            "1-106 not bad",
            "You already have a bet going - AMD to 200.0 before 09-Aug-2024 10:17 AM -05",
            "Yeah that dudes cryptic post was spot on.so much so I'm putting it in my calendar for the future",
            "![img](emote|t5_2th52|4260)![img](emote|t5_2th52|31226)",
            "I guess this was all just to murder the calls expiring today",
            "imagine working.",
            "I went the safe route and bought spy 547c expiring Monday",
            "Fbi agent saved u",
            "**Ban Bet Created:** **/u/CUbuffGuy** bet **NVDA** goes from **126.58** to **133.0** before **28-Jun-2024 06:12 PM EDT**\n\nTheir record is 1 wins and 4 losses.\n\n[**Join WSB Discord**](http://discord.gg/wsbverse)",
            "![img](emote|t5_2th52|31224)",
            "Just be rich",
            "It's only funny if they lost more than you.",
            "With that much money at stake I'd imagine the cartels must have some mechanism to manage the risk in price volatility.",
            "Ayo 😳",
            "Get laid with who ? Yo mom ?",
            "NO ID RATHER ARGUE WITH REGARDS ONLINE ![img](emote|t5_2th52|27421)",
            "Apple is delaying the release [of its Apple Intelligence tech](https://www.bloomberg.com/news/articles/2024-06-21/apple-won-t-roll-out-ai-tech-in-eu-market-over-regulatory-concerns) to EU users,",
            "Was it as painful as trading hours today?",
            "Im pumpin",
            "Your wife is getting pumped hard by her boyfriend",
            "My accountant is going to fucking hate me tax season",
            "We have no value, only deep fking ![img](emote|t5_2th52|4260)",
            "I was seriously questioning if I should, I ended up eating it lol.",
            "The word strip is right there",
            "You guise had profits???",
            "![img](emote|t5_2th52|4271)",
            "Fack"
        ]
    },
    "Most Anticipated Earnings Releases for the week beginning June 24th, 2024": {
        "title": "Most Anticipated Earnings Releases for the week beginning June 24th, 2024",
        "score": 115,
        "url": "https://i.redd.it/jfqm24w09s7d1.png",
        "content": "",
        "num_comments": 228,
        "comments": [
            "Blackberry to announce rebrand as BlackBerrAI, stock rises +100%",
            "Did I have a fucking stroke? Everyone in this comment section sounds mentally deranged even with it being WSB",
            "Survivors from the last MU reckoning please gather, it's time to chant 'MU please fly again'",
            "MU don't let me down. (More than today)",
            "Who else down thousands immediately every time they pull the trigger? Without fail.",
            "MU",
            "I’m gonna throw $30k into NKE long next week because I hate myself and lost a lot of money this week",
            "Who hates money as much as I do and can’t wait to lose more of it tomorrow?",
            "MU calls til Wednesday afternoon then swap to puts",
            "https://preview.redd.it/hp83r7vjwu7d1.jpeg?width=1080&format=pjpg&auto=webp&s=39cd1f1289ed3b6f0a5713f9bfca144c18ff8102",
            "MU please print, let me have one big win this month.",
            "All you regards saying ‘MU puts because it’s up 100% already watch it pull a DELL!’ need to realize it has the highest forecasted growth + cheapest on all metrics (apart from Intel). A major guidance raise/earnings beat could send this flying 20% overnight like we’ve previously seen with NVDA\n\nhttps://preview.redd.it/4aq4pyio9v7d1.jpeg?width=795&format=pjpg&auto=webp&s=ac96279d48c1fb05630c1c1f92347383faedc5d7",
            "MU and MKC going to come in strong. I CAN FUCKING FEEEEEEEEEL IT!! 🤑🤑🤑",
            "We need to get rich so so so bad",
            "yuh grrr",
            "OK MEN \n\nITS FRIDAY WHO WANNA MEET FOR GLORY HOLE FUN LETS GO CAWK AND STOCK\nALL WEINER !!!!!\n\nYasss!!\n\nIt’s RAINING men !!!! \n\nTesla 250 EOM",
            "you know what to do when EVERYONE in wsb says to get MU calls?",
            "CUK\n\n\nTeehee",
            "Hi, my name is Long the Mong, I have averaging down syndrome",
            "How will Levi and Nike fare given the general drop in consumer retail outlook?",
            "MU",
            "CALLS  -   $CCL   $MU\n\nPUTS   -    $NKE   $MU\n\ni'll flip a coin to decide what $MU will i buy ![img](emote|t5_2th52|4271)\n\nWhere's the corgi that makes decision for us ![img](emote|t5_2th52|27421)",
            "FedEx calls is a play. 275 strike",
            "puts on fedex. \n\ni dont think they have been doing great this year. \n\nthey might/are merging both fedex express & ground to be one. \n\nalso read somewhere that they've had to cancel a lot of weekly scheduled pick ups for businesses that arent meeting the \"pick up requirements\" meaning they aren't shipping as much as they once were with them. \n\nnfa",
            "I just realized that Carnival Cruise Line’s stock symbol is CUK, that’s good humor and it definitely summed them up during Covid.",
            "BB for the win?  Gosh I loved their phones.",
            "My company uses paychex and their website is dogshit.",
            "Who bought PLTR at 26? ![img](emote|t5_2th52|4271)",
            "A hex on the bastard who said CarMax was gonna moon in yesterdays earnings",
            "If MU premiums weren’t so expensive I’d get in 😅",
            "CCL and MU are the plays boys. Let’s hope the dip continues tomorrow, buy on Monday.",
            "I'm thinking Micron puts and Paychex calls.",
            "WOR looks like one of those boring stocks that will go up 6-10% on earnings regardless of the outcome. It won't be big money but it is the safest bet out there imo and the current price is attractive.",
            "FDX puts -> MU calls -> NKE puts\n\nYou’re welcome",
            "Not FedEx again",
            "My MU 160 calls for next week will most likely not make a return ![img](emote|t5_2th52|4275)",
            "What about BB?",
            "Monsters University ![img](emote|t5_2th52|27189) Move Up!",
            "blackberry is the bet to make here",
            "Everyone saying fedex puts tells me calls 100000%",
            "All in on cuck",
            "Everyone saying MU puts, so calls it is",
            "MU gang wya? Busted $10k on these July calls today. Ez 3 bagger let's get this bread\n\nhttps://preview.redd.it/yqtrjlnz9s7d1.png?width=738&format=png&auto=webp&s=b8f2dcd291066e9b7f893558b0716e5e4dde6c49",
            "Fedex garbage",
            "fedex puts",
            "CCL calls at the money exp a month out",
            "Levi’s calls. Clothes has been going crazy for earnings.",
            "Can we get this for monthly. I would like to know if I'd be at Wendy's or not",
            "Small amount of calls on BB \n\nI’m banking on BB talking about Cylance and that people haven’t been paying attention will buy in because it has AI. \n\n“BlackBerry Introduces Cylance Assistant, the Next Level of Cybersecurity with Generative AI Capabilities”",
            "FDX puts — a tale as old as time",
            "Man how time flys \n\nI remeber 1999 mayne \n\nNo iPhone and vivin la vida loca was blasting by Ricky Martin \n\nI was in a glory  hole 🕳 in New York City 42 and I was sticking it a anoos and then a ball sack pops out \n\nAnd I still went all in Tesla 250 calls EOM\n\nGood times mayne \n\nGood times",
            "Lol seeing KR in the red after so many ppl said calls calls calls is hilarious to me. Glad I didn’t touch it.",
            "Sooo …how much did everyone lose today?",
            "I’m pooping and getting paid ![img](emote|t5_2th52|4276)![img](emote|t5_2th52|8882)",
            "wtf why is Carnival Cuck",
            "Need to buy micron option 2 week out  or … https://www.reddit.com/r/Whatcouldgowrong/comments/1qrufd/firecracker_in_cow_shit/#lightbox",
            "CCL calls\nNike calls \n🫡",
            "Volatility is back on the menu boys!\n\nConsumer confidence on Tuesday,\n\n$MU on Wednesday,\n\nGDP, jobless on Thursday,\n\nand PCE on Friday.\n\nWill $NVDA reach 150 with good data points?",
            "🤔 who will mention AI and who will not?",
            "WALGREENS BABY! WBA! LOOKING FOR GROUP!",
            "MKC could be interesting",
            "General Mills gonna shit the bed.\n\n  \nPeople are trading down on cigarettes per Bloomberg.  No shot they are paying name brand prices for sugar and corn/wheat/rice in a smaller package.",
            "queued CCL $15 calls exp 6/28 when the casino opens again",
            "I don’t understand the popularity of these as alternatives have no liquidity. Good luck getting your money out.",
            "any opinions on MU , im buying calls",
            "[deleted]",
            "Ready to be CUKed",
            "SPY calls at close were free money",
            "Just joined, does this graphic come out every week?  Awesome stuff thanks",
            "you guys lost on Fedex??",
            "How do you get that chart ?",
            "WBA calls. Company is in the poopers  but I think they've sandbagged expectations so that okay earnings will be good.",
            "[removed]",
            "GIS calls FTW",
            "Is my app just wrong or did someone dump 5mil ARM shares at close?",
            "Which inflation reports are important next week?",
            "TSLA coiling tighter and tighter",
            "What do you think on MU ?",
            "IV crush on MU will be too heavy for any calls to print. I would advise to sell ahead of earnings. I sold last Thursday. I have to admit though that it looks tempting, especially with the correction over the last two days",
            "CCL Call\n\nMU Put similar to Dell play\n\nFDX Call\n\nNKE Call",
            "soooo bb puts?",
            "MU will cut some heads",
            "6/27 another dip day",
            "MU and CUK Puts ?!",
            "I was told today would be 🧨 because of ‘quad witching/ big open/ rebalancing .",
            "full port into DWAC",
            "Puts puts puts",
            "Puts on Tech",
            "Kmx about to spit on that thang",
            "bagholders still wont break even",
            "It unironically would, like that one time every company put blockchain in the company name for a bit. I love when the finance world memes and makes millions\n\nhttps://www.cnbc.com/2017/12/21/long-island-iced-tea-micro-cap-adds-blockchain-to-name-and-stock-soars.html",
            "ill let all the MU comments slide",
            "Jesus christ man that shit sting today\n\nIf I see MU starting bad at all tomorrow I'm buying a put",
            "I lost $10k once buying the wrong dated tsla options, closing them and reopening at the expiry I wanted. $10k just on the bid/ask spread lol.",
            "Just Do It!",
            "I think this is the way just not sure if this quarter or the next. I’m thinking this one though since we’ve got Olympics right around the corner.",
            "Nike is shit shoe company.",
            "Hate money? I wipe my ass with it!",
            "What’s your price average?",
            "Once would be pretty cool too",
            "Puts it is. ![img](emote|t5_2th52|4275)",
            "straddle it is",
            "exactly this. everyone already knows that ish is gunna have fantastic earnings, why tf would it pump? shits gunna trade flat and or just take everyones premiums  and nobody will win. Flat or puts , calls gunna lose",
            "Bagholder spotted.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/wallstreetbets) if you have any questions or concerns.*",
            "Last earning I bet puts but it shot up massively, so this time I will bet call, you are welcome",
            "It’s already had like a 40$ slow fall the last couple months, on the company I’m torn on it, but on the chart I don’t see puts being the play",
            "Lego also stopped using them. FedEx is literally the worst.",
            "what?",
            "I'd love to know that too, I feel like both of them are bearish but we I am not feeling sure enough to bet on it",
            "fashion reporting is that \"denim is in\" so ... possibly not bearish?",
            "CCL has too much debt; they aren't going anywhere yet",
            "puts on $MU is absolutely regarded... hell i'll make the decision for you right now, buy shares so that you can pump my calls lmao",
            "They shot up last earnings I'm not sure if we see as big of a pop this time.",
            "That may be the case but between the layoffs they’ve done and the stock already beaten up badly, all that may be priced in. Fed ex almost always bounces around this time so I’m loathe to bet against them.",
            "Hopefully no one, it's buy $21, rinse at $25, repeat ![img](emote|t5_2th52|4271)",
            "This guy bought carmax calls ![img](emote|t5_2th52|4271)",
            "buy the dip",
            "Micron puts why?",
            "What's your positions for these?",
            "Why nke puts?",
            "i'm gay",
            "Well.. Negative return mby",
            "Cylance AI powers their cybersecurity process now. If AI booms, their contacts do too. \n\nAnd they’ve already released two ER’s saying their profits are expected to grow through 2025.",
            "What makes you say that? \n\nGenuinely curious.",
            "Get a strangle, buy a call and put 5% break even each way",
            "Thanks for your comment 🍀 forgot already about micron but with todays drop I can buy my calls back ![img](emote|t5_2th52|4271)",
            "Made this week 400 bucks on the run up ![img](emote|t5_2th52|4271)",
            "I mean whatever they say is worth 2.50, right?",
            "They’re reaching out to me for an uncompleted job application, I’d say that’s bullish.",
            "I had puts for their December ER and made a 10x; it can drop this ER but you’re not likely going to see a 10+% drop.",
            "It literally went up last ER",
            "Bullish on Tesla even though declining sales?",
            "Something stinks at the Safeway deli counter... no wait, that's just my bag of Jul 19 calls. ",
            "Still made 33% on it with calls",
            "Bagholder spotted.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/wallstreetbets) if you have any questions or concerns.*",
            "I made good $ on short put spread. Sold early this week just in case but made over 50%.  Tough business they’re in 😀",
            "14% of the portfolio today, 24% on the week. ouch.",
            "nothing",
            "The market was red literally the entire day. How could you lose when any put that you bought would print.",
            "Carnival Corporation common stock is traded on the New York Stock Exchange under the symbol CCL. Carnival plc is traded on the London Stock Exchange under the symbol CCL and as an ADS on the New York Stock Exchange under the symbol CUK",
            "opposites of  fedex last Q , so puts ",
            "why ccl call ? anything bullish?",
            "Why is it always about nvda.",
            "I think PCE will come in on point or lower since gas has been down - n it’s looking at June numbers \nFinish the month strong",
            "THANK you! That's all lfg will ever mean to me, lol.",
            "CCL call, CUK put",
            "Got calls too, that DD was good enough for me. Smaller market cap, and Ai craze is still strong. I think Nividia is almost guaranteed tapped out within these next two months. Micron has a bad history back in the day, I don't know shit about their inner workings but I feel like if they post great earnings and say anything about their involvement in Ai, it's gotta at least makeup the dip it's had. I plan on buying more if it keeps selling off (or maybe not), but it seems like a solid play",
            "Twinsies except Minnesota.  This place is hell on earth why did I come here",
            "It truly is where the CUKs take their wifes",
            "![img](emote|t5_2th52|4258)",
            "Yup! Welcome to hell.",
            "And then will tell us their next year is shit too lol",
            "Worst company ever.  But a short-term pop may be possible given the positive regard the new CEO seems to get on Wall Street.  Still the worst company around tho",
            "Why FDX call?",
            "That’s my fear. MU doing a DELL",
            "why",
            "Why MU puts?",
            "why MU?",
            "DJT*",
            "You really believe in Lord tiny hands orange mushroom cock?",
            "u wanna be different so badly",
            "This guy a genius ![img](emote|t5_2th52|4271)",
            "Theyre at a very decent valuation and looks to have MAYBE bottomed at that $88 a few months ago. I’m not doing short dated but NIKE is one of those top brands you can bet on for a recovery at some point",
            "Just do it",
            "$249.90",
            "Because tutes *love* MU. Institutional ownership sits at 82%. BofA added MU to its US 1 list last week. The last week alone we’ve gotten 10+ sell sides piling reports with PTs ranging from $160 to $200. That’s what they value it at *current* multiples. If MU raises guidance next week we’d be at even cheaper multiples, and tutes are almost guaranteed to react immediately and panic buy it further with all the potential MU has coming for it. The demand for DRAM/NAND memory from the AI sector is ridonkulously high with no signs of slowing down. The world will increasingly depend on DRAM/NAND makers",
            "thanks dude! even still - i have some time after earnings to ride the hype wave down should they beat. \n\nteamsters could get a foothold on unionization efforts and send me on up\n\nya never know",
            "chart means nothing to me\n\nthey are overvalued af and none of their current situation has been priced in. \n\ncycle repeats itself over and over\n\ninverse my play in december ",
            "But what about most of the clothing companies ER's recently? They went up for the majority in recent earnings calls",
            "Ralph Lauren is in,  Levi already got bump last Q probably run flat .",
            "Told myself upcoming earnings is easy money, in @ 155c 7/05, that was tuesday. Ugh.",
            "nothing technical. They are up 110$ in 1 year. Are they making bank or riding hype of Nvidia. If the report is not massively impressive it will tank 15% on the computer algos trading AH.",
            "[deleted]",
            "Good timing for the pop, but these premiums are too rich for me, on sale as they are.",
            "Did you not experience IV crush?",
            "[deleted]",
            "Why nobody talking about Nike ![img](emote|t5_2th52|4260)",
            "What strain were they smoking when they decided on that ticker",
            "DD?",
            "Ships were all redirected away from red sea ports due to the war, ports everywhere else got jammed and ships aren't returning fast enough which caused crate prices to soar. A lot of business switched to airfreights to keep up with demand due to similar cost, that in turn caused airfreights to also be jacked up in price. FDX benefited from large bulk orders as business across the globe keep sourcing different ways just to keep up. You know it's bad when even infamously expensive ports like Singapore got so jammed to the point [where a collision happened](https://apnews.com/article/singapore-tanker-collision-oil-spill-a7e50fa7b5f41594152840e3c6938360) because ships can't dock for maintenance and repair",
            "MU is -3.4 EPS at 150 billion valuation puts only make sense, so the stock with accordance with the stock market will obviously surge.",
            "lol its what I did today\n\nI had a $770 premium MU call expiring tomorrow, I noticed it getting disintegrated today and quickly bought a put\n\nThe put ended up paying me about $430\n\nSo now tomorrow if the MU call is looking like its gonna expire without value I can just put up another quick put, make a quick 300-400 and cover my losses atleast.\n\nI do have a 7/19 155 MU call that Im hoping does better",
            "It's gonna be fine, they will crush earnings. Just dipped 'cause opex. Today was actually bullish.",
            "yeah I wonder if it will be like what happened to DELL",
            "I mean aren’t they supplying nvda with key components to make their GPUs used for AI?",
            "who tf are you",
            "Yeah they were really expensive so I ended only buying few",
            "No, the expected move was much less than what occurred. And I had 260 strikes and it went to like 244 or so",
            "All my homies like Nike",
            "priced in",
            "it climbs to 286 last earning , wondering it could do it again",
            "You all realize MU slides before earnings just as it did last time. Don't bet on run up. Bet on earnings! ![img](emote|t5_2th52|27189)",
            "they will crush earnings... but $155 is more than +10% away and it doesn't even breakeven until +15%. if they bought tuesday it probably doesn't breakeven until like +25%. that's a tall order for two weeks. i think it's very likely that there will be an earnings beat, and i would even say that you should hold $155Cs. but i don't think the chance that you end up profitable on $155Cs w/ a $10 premium is very high.",
            "I'm sure I should know but, what's that mean?",
            "Ive seen a trend of if it goes up big last qtr this qtr it goes down and vice versa. Happened to Foot Locker, Snapchat, and as you said Dell. I dno how micron did last earnings but this stock is up.",
            "[deleted]",
            "Clip a coupon and look at the 8/2 25c on HIMS, earnings day, and a ton of open interest around $1.15 — limit order around that bid, maybe it falls to fill tomorrow.",
            "I thought the move had to be pretty big enough to not get IV crushed? Is that not the case?",
            "I love Nike ![img](emote|t5_2th52|4271) collecting those sweet air max ![gif](emote|free_emotes_pack|heart_eyes)",
            "lmao say it like it is  ![img](emote|t5_2th52|4271) options are annoying",
            "Oh really? I figured there would be a pile in up to ER now that there’s more hype with it.",
            "Tbh I wasnt invested in MU before their last earning, when was that exactly? I'll look into it",
            "Seems like it was up big then down big, then slowly crawling back up until recently it’s been climbing faster. I’ve owned it for awhile.",
            "ty bro. knew i was straight",
            "Hadn’t played Hims yet, I will take a look!! I hope we go down tomorrow a little bit more so I can load up! Bought the drop on SMCI today after selling the top ![img](emote|t5_2th52|4271) gave me something around 1k on 990 calls",
            "Hims earnings is the 5th. Better change that order before it clears, player.",
            "Good strike price and call play for HIMS?",
            "It was over a 15% drop which is a big move",
            "Unsure, just found it interesting that there’s a bid way below ask for about 1200 contracts at that strike, someone is yolo’ng",
            "That makes sense thank you 🙏"
        ]
    },
    "Barcelona will eliminate ALL tourist apartments in 2028 following local backlash: 10,000-plus licences will expire!": {
        "title": "Barcelona will eliminate ALL tourist apartments in 2028 following local backlash: 10,000-plus licences will expire!",
        "score": 7493,
        "url": "https://www.theolivepress.es/spain-news/2024/06/21/breaking-barcelona-will-remove-all-tourist-apartments-in-2028-in-huge-win-for-anti-tourism-activists/",
        "content": "thoughts on AIRBNB?",
        "num_comments": 719,
        "comments": [
            "\n**User Report**| | | |\n:--|:--|:--|:--\n**Total Submissions** | 3 | **First Seen In WSB** | 4 months ago\n**Total Comments** | 164 | **Previous Best DD** | \n**Account Age** | 8 years | | \n\n[**Join WSB Discord**](http://discord.gg/wsbverse)",
            "\"Tourists go home\" sign guy at La Boqueria is thrilled, ib.",
            "Long hotel chains",
            "interesting, it all depends if the rest of europe\\\\world will do something similar",
            "Housing in general aside, but Isn’t the tourism industry a big contributor to Barcelona’s economy? The stats vary but 8% or so of GDP seems like it’ll be impactful along with 8-9% of the city’s employment if this were to drop significantly. I don’t get me wrong, I do empathize with the locals and understand the housing crunch.",
            "Calls on Spanish hotels",
            "We should ban Airbnb everywhere",
            "\"Tourists go home!\" cries city with **tenth highest tourism income in the world**. \n\nAre they expecting people to just mail them checks?",
            "Hotel lobbyists rejoice!",
            "10,000 licenses will expire and there will be 20,000 Airbnbs. The company actively encourages hosts to break local laws because they know the volume is too much for a handful of city staff to deal with.",
            "There currently legislation in Hawaii proposing similar measures. Not all vacation rentals, but a lot.",
            "Why 2028? Why not 2025?",
            "hope this will include the “temporary rental up to 11 months” bullsh*t, aka 80% of all listings right now.",
            "In 2028… yeah we will see. It will be a completely different world in 2028. I don’t know what will change but something will certainly change in the meantime",
            "Spain is incompetent, nothing will change.",
            "lol this will just continue without licenses then..",
            "Who cares what those lazy fucks do. I was there in 97 and after what I hear, they are still not done with that church.",
            "So puts on VRBO?",
            "On one hand I support this because AirBnbs raise local real estate prices to unsustainable levels. On the other hand, I'm really glad I visited Barcelona before this happened.",
            "So how will they host events like MWC every year ? There are not enough hotels in Barcelona and 50 KMs around it.",
            "Hope this happens im my country soon - Airbnb is a cancer.",
            "I mean, what else could do they do?\n\n> The deputy mayor for Urban Planning, Laia Bonet, hailed the move as the ‘equivalent of building 10,000 new flats’ which can be used by locals for residential use.\n\nBesides actually building new housing, I guess.",
            "Barcelona has a huge over tourism issue so I think it’s more about that",
            "Mexico should do exactly the same",
            "I think this is great Barcelona people great job I’m proud of you and your great city",
            "Last AirBNB I booked it was a house with each room being keycode locked for each renter. \n\nI was neighboring with a young couple and the walls were paper thin so I couldn't get any sleep with their loud fucking every night but didn't want sound like a grandpa and complain up in their faces about it.",
            "lol coming from a city that relies heavily on tourism to survive.",
            "Airbnb should be banned everywhere",
            "Fuck AirBNB, that's my unoriginal thought on the matter.",
            "You will more likely see it becoming more expensive and more hotels going up to satisfy demand",
            "Airbnbs have been in and off banned in Barcelona since its invention, it hasn’t stopped people from running them. \nIt will however decrease the amount of airbnbs, small mom and pop places will probably be ok.",
            "I personally think that it should be limited, only allow people who have one apartment, and they could only rent it for 3 years, then another 3 years long term and so on. \nBtw, everyone mentions Airbnb but booking is also renting private apartments.",
            "I’m off to Ibiza this year. Brits on tour baby ![img](emote|t5_2th52|4276)",
            "i wouldn't be surprised if the bans originated from hotels, whose revenues are declining due the growth of airbnb and rentals from private landlords.",
            "![img](emote|t5_2th52|4258)",
            "So were these apartments strictly for tourists? The point of airbnb was to rent out your house/room when you aren't there or if you have the extra space. The fact that the city would create licenses strictly for this one things is wild",
            "I was in Barcelona and someone said to me \"you Americans think you are the land of the free...welcome to Barcelona..\"",
            "i need money now i aint wating 4 years",
            "10k units will be back on the market and 2 million people . Might help but Europe has under built density for decades. I get southern Europe wants to keep the vibes but this isn’t going to solve much.",
            "Ah of course, everyone’s solution to the housing crisis. Blame other people",
            "It's priced in.",
            "Good",
            "Teach America to do this.",
            "Barcelona hotel prices quadruple in the next 4 years.",
            "Puts on Airbnb.",
            "Almost anyplace nice is now overrun with tourists.  There are many reasons.  Just a generation or two ago only rich people traveled.  Most people lived their entire lives within a few miles of where they were born. The average Westerner lives better than a king did just a few hundred years ago. People don't think anything of jumping on a plane and flying half way around the world. Television & then the Internet passes information so fast that anyplace that was good yesterday doesn't stay that way for long. Make any kind of \"best of\" list on the Internet ...best place to visit, best place to retire etc will have it ruined so fast it will make your head spin. \n\nImagine you go to a place to hike trails in a national park.  Ahhh the great outdoors.  Only to be told we limit the number of people on the trail daily and you must now make an appointment.  What do you mean I can't start until 2:00pm?  It will be dark before I get back.  What do you mean there are no campsites for the next three years?\n\nKinda takes all the fun out of it doesn't it?",
            "So buy PUTS on abnb! Got it!",
            "Airbnb's stock might face volatility; time to review strategies.",
            "See Vancouver you CAN do it",
            "Spain used to be a big world player, not for a long time now. How to put Spain?",
            "Soon the locals can Barcelonan appartment",
            "I'm glad I was able to visit spain before all the tourist resent grew. Maybe one day I'll visit again, it's really unfortunate because Granada and Cartagena are really amazing places.",
            "Good.  A neighbor replaced their garage with an apartment and moved out.  Now a single family home with 4 off street parking spaces, is 2 rentals (4 beds total) with one off street parking space between them.",
            "That’s extreme.",
            "California, are you reading this???",
            "Good for them. Airbnb sucks",
            "Who is going to make up the 20% of their GDP?",
            "Looks like someone that plays anno 1800 built that city",
            "Calls on ABNB",
            "Some people just hate economic growth, economic activity, and GDP...\n\nSure would be nice if they went to live their dream environmentally-neutral lives in a cave in the mountains somewhere instead of wresting control of local governments from those who actually have heads attached to their shoulders, though.",
            "Wow 10,000 units in a city with multi millions of people, that’s really gonna make a dent.",
            "The world can thank budget airlines and cheap cruises for flooding cities with people. Global travel is now available for billions of people. More cities will move to restrict tourism as have Amsterdam, Venice, etc. Cheap travel will become harder to do — and I’m not sure I am hating that.",
            "LoL \n\nLearn from 3rd world countries \n\nThey make promises so far out in the future, that they're hoping PPL will forget about it when the time comes \n\nAnd social media apps take care of the rest",
            "Europe is allergic to money",
            "The local economy is in for a rude awakening",
            "They hate tourists until their local economy collapses and all their favorite local restaurants and shops close because they don’t make enough money…",
            "No way this backfires.",
            "Airbnb has been slowly dying. By ever increasing Profit margings. If i can stay at a nice Hotel with included breakfast for the same price or Sometimes even cheaper, why should i choose Airbnb?",
            "Hotel companies salivating",
            "This should be /r/news not /r/wallstreetbets. What is the trade on this? Nothing.. Ok.",
            "op - short squeeze Barcelona???",
            "Hotel prices are insane. Like €500/night insane in any desirable location.",
            "Doubt",
            "The UK media are reporting daily about anti over tourism demonstrations in Spain. They are even reporting cars with UK registration numbers are being vandalised and UK expats commenting on how they are being “singled out”.\n\nI normally do a two week October trip somewhere in Spain. It is my partner and I, we don’t drink excessively, eat out a lot and tend to spend quite a bit on holidays- we do half beach half hiking.\n\nI don’t want to risk feeling unwelcome, so we are going to Miami instead.\n\nMy friend has cancelled a trip to Malaga for the same reason.\n\nI wonder what tourism of the future will look like.",
            " Airbnb is done. It used to be brilliant but now it’s ridiculously expensive, the hosts are unbelievably entitled and they’re ruining local areas.",
            "I will be more likely to visit. Airbnbs suck the soul out of communities.",
            "The idea that people can't find housing *because* of AirBnB is *wild*. There's **zero** chance that the same person that can't find a place right now is going to get a place that used to be on Airbnb. Those renters and landlords don't cross paths.",
            "I live in Valencia and had a friend visiting from the US.  She wanted to go to Barcelona for a couple of days so I rented a tourist apartment for about 175€ per night.  That was cheaper than a hotel within walking distance of the major tourist sites.  It was the worst AirB&B I’ve ever used.  Broken toilet, worn furniture and lots of street noise.  In short, I wish I had spent the 50€ a night more for a hotel room.  Personally I find Barcelona way too touristy, over priced and full of pick pockets.  If getting rid of the tourist apartments helps clean up the problems I’m all for it.",
            "A short lived artificial financial intervention.\n\nEconomy finds its way (stolen from Jurassic Park)",
            "Actually, that was not a lot. \n\nA mere 10,000 or so tourist apartments is going to solve the housing crisis? \n\nAm skeptical.",
            "After being to Barcelona, I wish I would have listened to them and stayed out of there. It is not a nice place.",
            "Hotels are great (and probably better) for couples or singletons.\n\nWith young kids?  AirBNB all the way - being able to be away from the whilst they are sleeping, or for one of you to have a lie in is awesome.\n\nZero chance our boy can be in his own hotel room until he's at least 14 or so, unless there's a connecting door and a definite physical lock on his room.",
            "Good news!!",
            "I went to Venice a few years ago, I heard that it's so expensive now that the locals can't afford to live there and many properties have been turned into Airbnbs. \n\nEven in the small town I live in it's happening to a smaller extent and it's nowhere near as desirable a tourist location as Venice is.",
            "With climate change tourism in Spain will go to shit anyway. In summer at least. The already have a drought problem, with all the farming going on there, which will be the next economy that goes out of the window. ",
            "Wait till you see taxes increase to cover the hole in public finances... They will be begging for tourist to come back.",
            "Good I hate AirBNB!",
            "they're going to fill all those rentals with migrants",
            "When my wife and I went to Barcelona we made an intentional effort to take pictures in front of all the “tourists go home” signs. \n\nFortunately, our experience with the people of Barcelona was warm and welcoming.",
            "Guy: “Tourists go home!”\n\nTourists: *stop coming to Barcelona and spending their money*\n\nGuy: 😠",
            "I used to think airbnb was cool but then I stayed in a really nice hotel and asked myself why the hell am i paying nearly as much for a bunk bed or ikea futon in some stranger’s home? Hotels all the way.",
            "Seriously tho is that the move",
            "I’d think buying into travel stocks right now would be buying the top.  This “revenge travel” thing is getting long in the tooth.",
            "HLT, MAR.MX ftw",
            "Long trains",
            "And we all know they wont.",
            "Could you please explain how the changes in Barcelona are dependent upon the decisions made elsewhere?",
            "British Columbia / Vancouver banned STRs for homes that aren't the owner's primary residence",
            "Romania for one does at its hardest to destroy its tourism industry without external interfernce",
            "I don't think it will work. People will pay in cash, and the owner won't declare the money. That is what is going to happen, and it will be impossible to prove the ilegal activity. \n\n\"Yes, but neighbors will see a lot of people going to the house.\"\n\n\"Yeah, they are my friends from around the world, and I have lots of friends.\"\n\nAt the end of the day, you have to prove the money exchange. \n\nObviously, these houses won't appear in Airbnb. They will be offered in forums, and the money-talking will be done in a private encrypted chat.",
            "It's already happened in some major cities",
            "They will. Amsterdam is cracking down on it, Malaga is cracking down on it, mallorca is cracking down on it, a few Italian communities are and cities in Germany are trying to crack down on it now, especially with buildings that have multiple airbnbs, they will revoke the privileges they have over hotels.",
            "It's started in the tourist areas where I live",
            "barcelona wont do this.  they’ll talk about it then decide on an airbnb tax and move on.",
            "The idea is that they'll stay in hotels instead.",
            "Rentals are less than 1% of houses, so it's not gonna magically make home prices come down or have some sort of magical anti-gentrification effect. \n\n\nThe only thing this will do is suck tourist dollars away from local businesses and shove it to corporations that own big hotel chains and restaurants.",
            "Yea, but a lot of tourists there come off a cruise ship for the day only. Every single day.",
            "Airbnb is simply arbitrage between the cost of an apartment that real people can live in and the cost of a hotel. It destroys housing for normal people to allow for more tourism. It is a net drain on the economy.",
            "It’s pronounced “barTHelona”",
            "It depends.  If they're banning tourist apartments, like the article says, then that's only ~1% of the total accommodation of the tourism industry.\n\nIf they're banning tourist *houses* as well, then that's killer, that's 25% of their tourism rentals gone.",
            "Also, Airbnb’s aren’t cheap anymore. You get a much better experience with going with hotels",
            "Require “price posted = price paid” for all lodging including airbnb and hotels.  All taxes and cleaning included.  People will see that the hassle of most airbnbs aren’t worth it.  Only really cool properties would survive",
            "would actually help housing prices. Not a ton, but some.",
            "With the caveats that  \n\n A) authorities need to be equally vigilant with hotels and their pricing . they aren’t angels either and will milk the reduction in supply. \n\nB) more hotels must be built to counteract the reduction in supply. ",
            "Exactly. It completely abused its business model and along the way contributed to making millions of people struggle with housing, a basic and fundamental human need",
            "Don't worry, Spain is famous for it's incredible economy outside of tourism",
            "They are expecting tourists to live in hotels not in their housing units.",
            "I think they mostly want to afford to live where they work.",
            "It survived before AirBnB and will be still fine without it. ",
            "People don’t care so much about GDP.. rent prices on the other hand",
            "I work at the city council/municipality of a major European tourist destination. \n\nTry this, go ahead. We are very active in tracing airbnbs that break the rules and the fines are HUGE. I'm talking about fines in the range of € 10k to € 100k. Per unit. I am not kidding. We are very effective in cracking down on this.",
            "Either way, aren't those peanut numbers for Barcelona?",
            "They are letting licenses expire rather than cancelling.  Probably less of a headache.",
            "Because they don’t want to compensate them. It gives owners of these rental time to get out on their own",
            "Because it's a political play and once it has zero effect on reducing housing costs, it'll be far enough in the past they can blame the next scapegoat.",
            "Because it’s shit policy and they don’t want to be linked to the fallout",
            "Explain?",
            "Galaxy brain take",
            "RemindMe! 4 years\n\n\nHousing prices are up 10% from now, 2024. People whine online. No remarkable change economically.",
            "![img](emote|t5_2th52|4271)\n\n^(this) meme we all like to spam is actually “El Risitas”, a Spanish guy. He died a few years back. Say sorry for what you just said.",
            "Spain, maybe sometimes. But the Barcelona city council is really not.\n\n\nFor instance, it won a years-long battle against American companies that tried to bypass its ban on rental undocked electric scooter.\n\n\nI would argue it's as easy to track Airbnb locations in the city from the web.",
            "not giving the local government a cut is the worst thing you could do.",
            "I mean, when (almost) everything is gone from the big platforms, most people will stop looking.",
            "You’re on r/wallstreetbets, you could have drilled a hole in the wall to watch and/or partake. \n\nWhat has happened to this sub smh",
            "Woahhh that's like a good reason to get an airBNB here",
            "You mean: filled with people that are fucked by the housing prices?\n\ncapitalism wins again/s",
            "it would bring world peace",
            "Because most people don't use it that way.",
            "people will do whatever the fuck they want as much as possible, but let's not kid ourselves it is nowhere near south america freedom hahahaha",
            "Barcelona is lovely but it was better in 08 and 2011 then it was in 2019 and alot better then it was in 2023. Airbnb has pushed the locals to the brink. \n\nI used to love Airbnb when I traveled for work. 10euros a night for a spare room, less if you didn't mind sleeping on the sofa. Then people started buying apartments just to put on Airbnb and I stopped using it. I'm away at the minute and booked a condo on booking.com and it's cheaper then on Airbnb to.",
            "I’m out of the loop. What’s going on that they don’t want tourists there?",
            "When we travel as a family of four with kids, or the in-laws come along, it’s nice to stay in a house or apartment together. Squeezing the four of us into a hotel sucks.",
            "[deleted]",
            "With a family, AirBnb is way better than a hotel. You get a kitchen and laundry, that probably saves you 500 to a thousand on a vacation. No need to upgrade to checked bags, you can eat meals in...",
            "Airbnb is really only the best for families, it’s so hard to have kids/babies and be in hotel room where there’s no kitchen or extra rooms for the crib",
            "For the extra security you get in an airBnB, if you were to get robbed the AirBnB would have video evidence of what happened from different points of view, including the toilet, shower, wardrobe and bedroom. They even are polite enough to hide the cameras so the attackers don't know they're even there.",
            "We went to Lake Como in 2016 and stayed at an AirBnB for $65/night without too many fees, just a normal cleaning fee and taxes. It was the best stay anywhere I've ever been, I'd open the door to [an amazing view of the lake and the mountains at the base of the Alps](https://i.imgur.com/OsxKnEy.jpeg), go down to Varenna for gelato and pizza, it was incredible. Now they don't allow AirBnBs, and the places by the airport where they (also) do(n't) are 200+/night with a tiny footprint, plenty of noise, fees up the ass, and they tell you to sneak in and out so no one catches on to their short term rental.  \n\nIt reminds me of Uber vs taxis - taxis got so greedy an upstart could create a better service easily, causing pressure for taxis to get better, while Uber gets worse and tries to hit profitability. Eventually they meet in the middle, the rich make some cash, and the rest of us look for the next place with decent service.",
            "I hosted for a while in the early days when the vibe was mostly still “stay cheaply in local persons place and have an authentic experience that’s like living there”. At that time it was unique. But comms from the company was already pushing upscaling the experience, clearly so to increase costs and fees for the company. Then later you realise that it’s not much cheaper than traditional accommodation and you’re trusting a LOT to the host and things can definitely go very wrong (had a few very bad experiences both as host and guest).\n\nThey hold on because people have forgotten that holiday apartments were a thing even before Airbnb (they still are)",
            "I went to morroco and got to stay in a private riad and it was amazing. Next door to the grand palace, Sunbathing on the roof and 10 minutes walk into the medina. \n\nAll the main hotels we're built like a fortress and felt totally out of place, It depends what your looking for I suppose but it was far more authentic. (Still very nice inside though)",
            "That's because when AirBnB started out it was way cheaper.",
            "Plus you don't have to worry about anything. Reception is there in case of any situation.",
            "Kitchen",
            "It used to be cheaper but the free market decided they wanted to make hotel money ",
            "Eh, most Air BNBs have been worth it. Way bigger space and sometimes some cool shit like a hottub",
            "The AirBNB's I've stayed at have been full on houses.  Garage, kitchen, multiple bedrooms, a dining room, an enclosed yard.\n\nOf course I'm going to take that over a hotel room.",
            "Because when you are traveling in a group (kids, etc), you can get a much bigger place with better amenities. Airbnb /Vrbo is often much cheaper.",
            "In my case the question is where do I leave my luggage when I arrive early in a city or leave later that day. At a hotel, you leave it at the lobby, at AirBnb...",
            "It was cool but like 15 years ago. I visited Edinburgh for 3 days (2 night) and I paid like 40£ back then. Then something changed, they added cleaning fee, that fee, this fee and literally airbnb lost what it was made for.",
            "The idea of airbnb is just nonexistent here in Asia when you can live in like a 5 star hotel in SE Asia for like less than 200 a night",
            "You always see these comments, but anywhere I've been, a tiny 4 star hotel room equates to a whole modern Airbnb apartment in terms of cost and I'd rather have that.\n\nThe group thing is no brainer.",
            "I’m still finding cheaper prices on Airbnb. The pictures I see are the actual pictures of the place I’m staying at and not some random room somewhere in the hotel. Usually the place looks nicer, lived in with some personality instead of some soulless 4 walls and a bathroom plus there’s a kitchen so I can cook. \n\nI get the issues society faces because of airbnb and the likes but let’s not act like there aren’t valid reaons for people to prefer it over traditional hotels. \n\nOn the flip side, my father absolutely wants a hotel because he wants a lobby and a receptionist and cleaning to be done everyday, which are things I do not care for. So to each their own.",
            "They're not nearly the same price in Europe. Airbnb will be half the price, maybe a third",
            "Because hotel prices got insane, air BNB showed that. Now air BNB has done the classic thing of raising prices after getting customers hooked, and now BNB are as expensive as hotels. ",
            "I looked at MAR margins... Holy shit, money printer right there",
            "on OP's wife",
            "And Barcelona neither.\n\nI live in Spain. We are the the playground of Europe and the World. A country of waiters.",
            "In Canada the province of British Columbia did this for all cities except Whistler (resort town).",
            "They will and are esp with party changes",
            "We don't even know if Spain has the balls to follow up on their own shit. They've been shitting on Brit tourists for decades about how they go to Spain for stag/slag parties, are drunks who misbehave, the old folks are ignorant/disrespectful like American but doubly worse cause they are penny pinchers who don't tip either, and most are there not for the culture (like the Japanese) but because it's cheap/warm. [It's not just the Brits](https://i.dailymail.co.uk/i/pix/2008/06/03/article-0-017989FE00000578-800_468x313.jpg), but it hasn't stopped Spain from being a tourist destination for many including those in the \"worst\" categories. Even with whatever complains the Spanish have, Brexit meaning Brits can't cross over as easily, and the PIGS mostly stabilizing their debt issues? Brits still hanging out in Spain.",
            "Eh I mean some cities have already. Maybe not as sweeping as Barcelona but nyc for example made it extremely hard to buy an apartment to use for an airbnb",
            "I think they’re implying that the rest of Europe following what Barcelona is doing would have the real impact. \n\nIf the EU effectively bars tourist apartments, then airbnb is gonna be real fucked",
            "Moving from Airbnb to forums will definitely be a huge hit to demand. Having an easy to search database with some consumer protections is how the market exploded, without that framework we'll see only a fraction of the demand.",
            "I would agree with you but that’s a big hurdle for the majority of the users of Airbnb. It is a lot more effort. The motivated will do it but the majority of people are not that motivated.",
            "no one will book an AirBnB in a forum to potentially save a couple %, if there is any savings at all. NO ONE. Do you think they will pay in advance without any legal safety? I have the feeling you are not aware how an average consumer acts.",
            "Paying in cash a rental from tourism? Are you implying that landlords will rent to an unknown person without guarantee of payment which can not show on the date? And without rental deposit?\n\nAnd do you think travellers will be carrying thousands of euros to a place where they can be robbed because at least one person knows they will be carrying lot of cash?\n\nDo you realize how stupid the idea is?",
            "Forums? Lmao. Let me get prepare some traveler’s cheques",
            "So people will stay in hotels. Anyone dealing direct with the owner knows you can negotiate massive discounts because otherwise the apartment stays empty. It's just hard to find the owners when there isn't a discovery service like Airbnb.",
            "And this won't be nearly as accessible as airbnb, meaning the scale won't be anything close to the current situation with airbnb.",
            "there's zero chance I'm paying a stranger money in an encrypted chat for an apartment sight unseen in a foreign country. That's how you get scammed.",
            "It’s too complicated.  Most people are either lazy, or want to sleep at night knowing they won’t be bothered by legal issues.",
            "Why in the world would I travel with zero gaurentees about my accommodations to save a few dollars? I mean, I'm sure there are some folks out there that would, but certainly not the same volume that currently uses AirBNB. This is why AirBNB took off in the first place, a bit of extra insurance for both parties...",
            "And that substantially increased overhead on the illicit letting businesses will have an impact on the market.",
            ">People will pay in cash, and the owner won't declare the money.\n\nBullshit. It will help.\n\nAs a tourist I would never fork over cash for a rented apartment just to get screwed over. If it's not going through a safe portal like Airbnb with escrow, I'm choosing a hotel.",
            "The tax man taking an interest could be very problematic",
            "Perfect is the enemy of the good. Any policy that gets rolled out will have non compliance, it’s to be expected. Far more will comply than not.",
            "You do realise that’s irrelevant to the question, since that money won’t go to Airbnb, right?\n\nOh wait, of course you don’t, because Spaniards are almost as financially illiterate as us Portuguese folks.",
            "> They will be offered in forums\n\nLOL. So few will go to that length. This effectively kills STR.",
            "95% of people want to book their accommodation well in advance with a few clicks on their iPad or phone. They’ll book hotels instead.",
            "No man. Airbnb is about simplicity. This is nonsense. Nobody is gonna go hunting forums for a 2 bed in Barcelona on the 17th July for 3 nights with wheelchair access and off street parking under €300 / night with no cancellation charge please Mr forum man.",
            "yeah and even that we will have to see, we (portugal) had plans for an extra tax and other measures that hit all tourist apartments but the govt changed and is working on getting it revoked now.",
            "Europeans can correct me, but isn't the fact that Spain is extremely afforable to visit one of the main draws for a very large percentage of tourists? Decreasing the supply of vacation accommodations will undoubtedly result in hotel price increase and fewer tourists.",
            "Disclaimer: I didn’t read the article\n\nThe suggestion is that Airbnb’s will be banned but hotels are allowed?",
            "Hotel owners are overwhelmingly local. Hilton, Marriott, and all the others are large franchise and marketing companies, the actual hotels themselves are locally owned and operated.\n\n\nTheir cut of a hotel booking is on par with the cut AirBNB will take out of a host booking. Without saying any corporation is superior the option where apartments stay apartments and hotels stay hotels is probably the better choice",
            "Seriously. The smart thing for Barcelona's government to do is increase taxes on tourist apartments and use that money to build social housing. ",
            "Maybe 1% overall, but in specific areas that are highly desirable, that's going to be a lot higher.\n\nSecondly, if the city regulates hotels, then it has an interest to not allow some randos circumvent those regulations by running a hotel without calling it a hotel. If the site were still individuals renting out a spare room in their house or something like that, maybe that might be fine though you'd still want health and safety checks.",
            "Dude, this is NOT true.\n\nTourism is a big problem for Barcelona, people literally needs to leave the city because of Airbnb's.",
            " Same thing happened in NYC when short term rentals were banned. Tourism decreased, housing prices stayed the same, housing crisis got worse because people that used to Airbnb looked for other methods to get clients (under the table etc) or simply did not open their house for renting anymore due to fear of squatters. And then the migrant crisis came in and then the government also had to pay hotels for their housing lol. Great results. Speaking as a host myself who often stays at Marriotts because I get free stays there if I stay with my dad.",
            "I miss the old days of AirBnb when it was just other peoples actual homes.",
            "Right lmfao why tf would I pay more just to have to take care of somebody else’s house for my damn vacation when I can rent a hotel, get free breakfast, nut all over the bed while leaving cocaine residue after the hooker leaves, and then just bounce ![img](emote|t5_2th52|4271)",
            "If I’m staying for over a week I prefer airbnbs because it’s nice to have a washer/dryer and a kitchen",
            "I think the longer you're there the better Airbnb starts to look, having a small kitchen and maybe a washer starts to be pretty appealing vs a usually cramped hotel room. It also makes the cleaning fee a bit more manageable. \n\n1-3 days a hotel is much better.",
            "The phantom clean fee and other dumb inflated fees ... was the downfall imo\n\nClean fee... when only like 30 percent of owners are honest about it",
            "Hotels when its me or me and wife. Airbnbs when its a bigger group. Pretty easy decision making process.",
            "booking > airbnb imo fuck them cleaning fees at airbnb",
            "The only upside to Airbnb is sometimes you get a whole dwelling to yourself vs a room. And we’ve found airbnbs to be more accommodating for bringing our dog.",
            "I have never found a hotel to be cheaper than Airbnb, especially if you’re staying more than a few days",
            "Says someone who doesn’t have kids. Airbnb with a family is THE way to go.",
            "But I hate people and noise. Hotels are the fucking worst. People stomping down the hallway, stomping around upstairs, TV sounds and talking leaking through the walls, doors slamming, children screaming, fuck hotels. \n\n\n The fucking worst.  \n\n\n Tho I never use Airbnb. Vrbo or Booking ",
            "Ahhhh so we all got to experience the Federal Reserve’s 0% interest rate policy through VC backed discounting\n\nAnd when it came time to turn a profit, the investor backed subsidy went away ![img](emote|t5_2th52|4267)",
            "It depends on the owners. Some people are god-tier hosts. Most are shit.",
            "I'm legit happy that hotel chains are getting in on the STR home market so I can deal with an actual professional company instead of scummy Airbnbros",
            "not if everyone starts using hotels again and prices rise accordingly",
            "It is internationally still. The US it’s garbage",
            "Not always true. I recently booked a monthly stay through Airbnb, which ended up being much cheaper than any hotel in the area. Got a full apartment with paid bills for the price of a small hotel room. \n\nIt all depends on the location and what you want.",
            "100% The pendulum has swung back to hold, the convenience alone makes them worth it for me.",
            "Where? I keep hearing this, but it’s absolutely untrue in most of Europe at least. Particularly for more than 1 person and smaller cities.",
            "Why does everyone forget that you have the option to cook your own food and wash your clothes in an Airbnb? That makes a big difference in keeping costs down on a week+ long stay.",
            "I wonder if these comments are paid for by big hotel and the obligatory response of \"but for groups airbnb is better\" paid for by big airbnb, or if people just like parroting ad nauseam what they've seen upvoted before.\n\nEither way, the cost of a tiny hotel room usually equates to an entire apartment of a similar standard and I'd rather have the apartment.",
            "Aren’t hotel prices going to skyrocket once they ban airbnbs?",
            "What do you mean? last time I got an airbnb I just paid upfront including taxes and cleaning",
            "Short term housing makes up just over 1% of residential properties in the US. That's up from the historical ~0.7-0.8% pre-abnb/vrbo days. \n\nPeople drastically overestimate their impact, and it makes a convenient political scapegoat for bad zoning policy.",
            "*bans tourists*\n\n*economy crumbles*\n\n\"Why would tourists do this?\"",
            "Catalunya and especially Barcelonas economy isn‘t that bad, the industry grew quite a bit.",
            "Oh thank goodness they can give their nightly revenues to billion dollar chains instead of middle class Spaniards.",
            "Home prices have doubled in my town in Michigan, too. Could it be the *same* tourists? Running around the world, raising prices!?",
            "In my last city, the city council gave out monetary penalties but couldn't get a state law passed to give them legal authority. Someone had a big Airbnb with $1.2M USD in fees they couldn't collect.",
            "Not doubting you so all, but would you wager your city is weaker or stronger at this than Barcelona? Surely capabilities are not even across the continent",
            "This just means I might be able to buy a vacation property in Barcelona in 2028 ![img](emote|t5_2th52|29637)",
            "It’s not just about reducing housing costs. But, those 10,000 places should be for locals to live in. Not run as a makeshift hotel business. Doesn’t matter if it affects rental prices (though we recently passed a similar law in my city and the market got flooded with furnished units)\n\nBut also, people don’t want to live in a building where random people are in and out with keys every other day. My building was broken into and they traced the keys back to Airbnb. Someone copied the keys then came back later, or an associate did.\n\nShitheads have no respect and party until 2am because they don’t give a shit since they don’t actually live there.\n\nIt’s not a singular issue.",
            "Spain put a strict rent control law in place for long term rentals that more or less discourages being a landlord for that time (no inflation-adjusted rent increases, squatter evictions are practically impossible, incredibly high taxes, etc). \n\n\nWith these controls, the market can't get to equilibrium for long term rentals, so many landlords now rent for under 1 year which doesn't have these restrictions.\n\n\nThere are also a lot of landlords flat out exiting the market, choosing to sell instead of generating income. \n\n\nBarcelona and Spain have really fucked up their rental market and are doing everything they can to make it worse.",
            "Bro I could even be smart in 2028 anything is possible",
            "I will be messaging you in 4 years on [**2028-06-22 00:14:51 UTC**](http://www.wolframalpha.com/input/?i=2028-06-22%2000:14:51%20UTC%20To%20Local%20Time) to remind you of [**this link**](https://www.reddit.com/r/wallstreetbets/comments/1dlaf12/barcelona_will_eliminate_all_tourist_apartments/l9p1jig/?context=3)\n\n[**CLICK THIS LINK**](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=Reminder&message=%5Bhttps%3A%2F%2Fwww.reddit.com%2Fr%2Fwallstreetbets%2Fcomments%2F1dlaf12%2Fbarcelona_will_eliminate_all_tourist_apartments%2Fl9p1jig%2F%5D%0A%0ARemindMe%21%202028-06-22%2000%3A14%3A51%20UTC) to send a PM to also be reminded and to reduce spam.\n\n^(Parent commenter can ) [^(delete this message to hide from others.)](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=Delete%20Comment&message=Delete%21%201dlaf12)\n\n*****\n\n|[^(Info)](https://www.reddit.com/r/RemindMeBot/comments/e1bko7/remindmebot_info_v21/)|[^(Custom)](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=Reminder&message=%5BLink%20or%20message%20inside%20square%20brackets%5D%0A%0ARemindMe%21%20Time%20period%20here)|[^(Your Reminders)](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=List%20Of%20Reminders&message=MyReminders%21)|[^(Feedback)](https://www.reddit.com/message/compose/?to=Watchful1&subject=RemindMeBot%20Feedback)|\n|-|-|-|-|",
            "His entire story only happened because he was incompetent. But no offense to our guy.",
            "Yeah, they hate people not cutting them in to profits off something they had nothing to do to with.",
            "nah mate, this stuff has been highly illegal like prison illegal in Singapore forever and I have never stayed in a hotel there. The apartments you can get in the glitzy golden towers are actually much more expensive then hotels but also so much nicer..",
            "100% they recorded it then edited into a PMV. WHERES the link OP? Coward!!",
            "Airbnb in 2014 was peak. Everything under €100 for a night",
            "It’s the same apartment on both platforms, just different fee structure for the host",
            "Any place that gets a lot of tourists, even and maybe especially if the local economy relies on tourism, absolutely fucking hates tourists.",
            "Everything is a tourist trap. Rent prices are impossible to locals. Every building has a tourist appartment with drunk people raving at 4 AM. Barcelona is turning into a theme park and the locals are being pushed away.",
            "Local here. Why rent to a local for 1200€ a month when you can rent to a tourist for 2100€ a week?\n\nVulture funds buy entire buildings and extort any neighbors who refuse to sell. \n\nLots and lots of loitering, people rather throw their empty beer cans at a fountain than the several bins next to it. They’re also very noisy on working nights, and even if you ask them out respectfully they’d either tell you to eat shit or straight up fight you.",
            "It's not exactly about tourists themselves, it's more about how AirBnB has made it near impossible for locals to be able to own a house or apartment, or even rent.\n\nI live in the Canary Islands and we have almost the same issue here.",
            "> What’s going on that they don’t want tourists there?\n\nHigh rent, all city centers becoming the same, Barcelona is becoming a city for tourists, and not for the people who live there, and the tourists go home movement is part of a push to stop the mass unrestricted tourism. Some tourism yes, but when the few new buildings are all dedicated to hotels, the rent is unfordable due to airbnb and digital nomads commanding more income, and pushing people from there out of the city.",
            "They don't really hate tourists.. They hate that like a billion percent of available housing in the city has become short-term tourist rentals and it's becoming impossible for locals to find Any available long-term housing (much less affordable) in the city.\n\nSource: I have lived in Spain for nearly 15 years and recently had to leave the costal city I was living in because the owners of the flat decided it didn't make financial sense to continue renting the apartment long term, when they can make the same amount of money I was paying for a 12-month lease by renting the apartment as an Airbnb for three months in the summer (they are now literally charging PER WEEK during the summer season what I was paying per month before)\n\nThere is a huge push to reduce Airbnbs and instead return to a more hotel/hostel-centric model of tourist accommodations which doesn't directly reduce the number of available housing units for locals.",
            "People are getting priced out of their homes and their city",
            "My family has a small apartment in Portugal, and we discovered that several other apartments in the same complex are on AirBnB.  This turns out to be super-convenient, because family can come visit and basically stay in an apartment a couple floors up.   \n\nIt's also a great idea from a cost-saving perspective:   my in-laws used to have a huge apartment they didn't need anymore, and have downsized.  The airbnb option lets them temporarily expand their accommodation for visiting family just for those weekends, while the rest of the time they pay modestly for an apartment for two people.",
            "Holiday apartments were a thing before Airbnb and still are. You’ll easily find the same kind of thing on booking.com and you’ll have a LOT more protection if something goes wrong",
            "Also, kitchen",
            "When airbnb first came out they didn’t have the housing inventory to handle such a model. It was entirely based on solo and couple travelers looking for a bargain and regular homeowners looking to make some extra money. Groups only took off when Airbnb housing became totally industrialized, where larger properties were gobbled up for the sole purpose of airbnbing.\n\nThe group focus is simply a marketing and strategy pivot, as hotels became more appealing and price competitive again.",
            "I actually think AirBNB is only worth if you are going in a large group. As a frequent solo traveller, hotels are so much better from a quality, to check-in/out, and over all value perspective.",
            "Airbnb was started as a way to rent out a spare room or a sofa for cheap, and evolved into what it is today. \n\nWhat you’re thinking of is VRBO, their business model has been more focused at whole home rentals for large groups.",
            "Who's upvoting this? Airbnb was designed to be rent a room for cheaper than hotels. Up until few years ago when only reason to get it is for having group activities. Even then, 80% of hosts are paranoid you're going to have some kind of feces smashing orgy whenever you book the house for an event/gathering. Airbnb only wants you to go there to sleep the night, not to actually use the house for gatherings.",
            "I book airbnbs because I want somewhere to make food. I’m already paying for a place to stay, eating out for every meal is another expense I don’t need.",
            "The easy access to laundry also allows you to travel light, and in some specific circumstances, like a family coming in for Thanksgiving or some other holiday, the AirBnB can be used to actually have everyone over for dinner, and save local relatives the hassle of hosting and cleaning up.",
            "Apartments are still a thing completely without airbnb and were beforehand as well, just need an actual license and dedicated plot for it",
            "Is there a hotels ETF? Marriott, Hilton and Hyatt are all up 40%+ in the last year. Damn!\n\nEdit: QQQ and SPY by dollar value of position, VOO of 4th largest, VUG 7th largest MGK is up there also. I hold VOO, QQQ, VUG and MGK lol\n\nBy percent allocation CRUZ, JRNY, LUX, BEDZ",
            "MAR 16% operating margin? That's seems like... you have to believe hotels will be obsolete in a decade if that's not undervalued.",
            "Laws are useless in Spain, everybody does however they feel.",
            "Is Portugal better or worse in that respect :p\n\nI hope Barcelona follows through and is the first of many countries to do the same because Airbnb is a blight",
            ">A country of waiters\n\nSo, Florida?",
            "😭",
            "Waiter? Who called Portugal?\n\nIm portuguese btw.",
            "No that's Greece",
            "This resonates a lot...and it's unfortunately quite upsetting",
            "Isnt unemployment high there, i doubt they will follow through on anything that hurts tourism",
            "what does country of waiters mean ? may you elaborate",
            "As a local, what are the best cities to visit in your opinion? I went to Madrid and Barcelona. Madrid was boring and Barcelona was a little more interesting with some cool architecture.\n\nAre there better cities than Barcelona? I was looking at Valencia, Murcia, Malaga, and Gibraltar, but haven't been in person yet. Anything else to do?",
            "MANUEL!",
            "This is considered a desirable outcome in capitalism and one all economies should strive to transition to.\n\nPersonally, I don't believe it and it has led to critical supply chain issues since the 1900s",
            "I always though Canadian are better than europeans I dont know why. Your like americans but witouth all the dumb stuff.",
            "America catchin strays lmao",
            "Tourism is big part of the economy honestly I think they wont do it. Too much money involved. But yeah Ive seen some wild flags in Barcelona some people really hate all that tourism and Airbnb shit 😂",
            ">like American but doubly worse cause they are penny pinchers who don't tip either, and most are there not for the culture\n\nyou would be a fool to overlook the fact that British tourists are the major support of the economies of many parts of Spain - the Balearic islands in particular, if they leave then the government will have other issues on their hands (namely unemployment, even more so than the mess of unemployment in Spain currently)",
            "It's because Spain is cheap it gets the worst of it, it offers up the nightmare fuel of all inclusive drink and food package deals targeted specifically at Cortnee and Deano with their kids Daniella, Kaylee and Little Deano. Later in the year Deano will be back with his mates Conner, Coner, Kayden and Oakley for a stag do because the beers cheap and you can get a \"decent fry up\" down the local cafe. Spain created the environment for them, targeted them and seems to continue to do so while complaining about it.",
            "Depending on where, it could also heavily impact tourism and thus the local economy.",
            "Wouldn't a better solution be to make short-term rentals a minimum of 4 nights? The idea being - keep the money flowing but attract a better type of tourist?",
            "They won't move to forums. \n\n\nMuch more likely agents will take Airbnb's place. Or you'll have travel agencies rent the apartments and sublet them for \"airfare + accomodation\" type deals.\n\n\nLike 10+ million tourists visit Barcelona a year. That's more than enough motivation for people to skirt the regulations. ",
            "True, we will have our tourism house dealers. They could even sell the drugs as well xD.",
            "Calls on hotels?",
            "No, man. I am from Spain. Believe me, doing it legally is a pain in the ass. The burocracy is crazy. One step is going to the local police and giving them IN HAND copies of the tenant's IDs. Obviously, this is done to discourage landlords from renting to tourists.\n\nIllegally, you have no burocracy, no airbnb fees. You just have to search people in forum's like r/barcelona, telegram or whatever.",
            "Correct, so they will sell instead of rent. Still reducing the rent offer, thus making price go up, just like current price regulations on rent",
            "Not as wild as you think. will demand drop? ABSOLUTELY, but it is actually already happening where some landlords are fedup with airbnb and just advertise their home on FB marketplace (you can check right now and will find them) Its a lot easier these days to get a credit card machine from say stripe or even shopify and run it that way. \n\nSo you are not wrong, but it is becoming more common practice... I say this because I frequent Vancouver BC a lot and you already see places been listed on FB and not airbnb for these exact reasons",
            "That’s they way it worked 15 years ago. Not firms per se but independent sites and services. It was so common they made a rom com about it.",
            "Will the apartments stay empty if the local state/council double or triple tax on 2nd homes",
            "This exact thing happened in NYC and Brooklyn this past October. AirBnb was banned except in very specific circumstances. Rents didn’t really go down because occupancy is so sky high already, the extra apartments were simply snatched up at market rate.\n\nI work in the service industry and our Open Table bookings are down YoY but only by like …6%? We still get plenty of tourists, a lot of Europeans, I assume they’re in hotels exclusively now.\n\nBetween that and the migrants being housed in a lot of the cheaper hotels, hotel prices have spiked hugely.\n\nI assume, there are similar factors in play in Barcelona, but you never know. The extra supply could drive down rents",
            "Those \"vacation accommodations\" are supposed to be residential homes, not businesses. They also increase traffic flow in residential areas from all the tourists there",
            "I mean it’s cute enough sure, but adorable? It’s no San Marino",
            "Fewer tourists paying more ist the goal of those measures.",
            "Spain is affordable… Barcelona, not so much. The hotels are quite expensive, hence the success of AirBnB. And yes, it might become even more expensive if there are fewer options available.",
            "Mass tourism in Europe has been a thing before airbnb existed. I dont know where people get the idea that tourism will cease when airbnb is banned.",
            "I have no idea what your last sentence means, but I agree ",
            "But then we couldn't blame all of our problems on tourists!",
            "Those are all good points.\n\n\nThey don't explain how this pseudoban will benefit the lives of everyday Spaniards right now, or even in 5 years, though.",
            "The population of Barcelona is growing but unless you guys are going to tear down parts of your city, and start building American-style or Asian-style high-rise apartment buildings, this change will not make a dent in the housing demand and prices. Many places have the same issues and don't have tourism to use as a scapegoat.",
            "According to the pundits. Don't mistake internet information for real life data",
            "https://www.sciencedirect.com/science/article/pii/S0094119020300498\n\n\nUnfortunately the data do not support that conclusion. Prices are up everywhere, Barcelona is a popular city, and Airbnb is a convenient target.\n\n\nTourism is a massive part of Barcelona's income, too. Would you prefer to keep the money but kick the tourists out? Or just enter a massive recession?",
            "What percentage is it then? I do wonder because I had heard they got rid of their golden visa. But that the amount of people that actually used it was a low number.",
            "I think people need to leave the city because Barcelona needs to build more housing, but banning vacation rentals is a more palatable (but ineffective) political talking point",
            "It's all professional rentals now. Feels less personal than actual hotels lmao",
            "I’ve found 2 of these recently, and had forgotten how nice it was, to stay somewhere that’s actually somebody’s (vacation) home",
            "It still is outside of major cities. People need to venture outside the big names more often. I went to some small places in France last week and people were insanely friendly and pretty much everything was affordable. In tourist areas it's packed and expensive. I really don't understand why people go there.",
            "Couchsurfing was the best use case of this. I had some great trips as well as people staying with me.",
            "We bounced around airbnbs for the last 2 months as we figured out our next city and it’s so annoying trying to live out of Airbnbs. One had no hand soap, no broom, no trash bags, and a bunch of other common necessities. \n\nIf I’m just looking to sleep somewhere I guess it was okay, but anything more than that was an issue.",
            "Not the coke residue",
            "True the value proposition just isn't there anymore",
            "Uhh cleaning fees are completely set by the owner",
            "Booking isn't nice to hotel owners though...\n\nCalling hotels directly > rest.",
            "I’ve had the opposite experience, once including the cleaning fee.",
            "Seriously.  And why would I want to stay in a hotel room with kids?  In most hotel rooms I can't go down to the local market and come back to a fully equipped kitchen to cook local stuff I picked up.  I do like some benefits of hotels but I've seen airbnb be cheaper or the same price with more benefits I enjoy.",
            "All in price to all in price, for one or two people/one hotel room, ehhh.",
            "If you include checked baggage fees and dinners out, they end up way cheaper.",
            "Right, I feel like it became hip and \"edgy\" to hate on Airbnbs so people just parrot what they hear about hotels being the better option.  I travel frequently and Airbnb is almost exclusively the cheaper option usually by a fair margin.",
            "Yes hotels must be so annoying what with their pools and breakfast and set pricing and no absurd fees.",
            "This is what I don't understand, why are hotels not trying to address this by converting some of their rooms to suites or something like that.  They must be aware that families and big groups want a house-like experience where there are separate/private areas in addition to a shared area.  There's been an ad running for months about this, that when you stay in a hotel, \"your kid's bedtime is your bedtime\".  It's so damn obvious.",
            ">People stomping down the hallway\n\nAre you staying at Motel 6's?\n\nNever had that issue at mid-tier and up hotels (Residence Inn, Courtyard, AC, etc)",
            "This speaks more to the quality of hotels you're staying in, lol.",
            "Yes, I am being paid by the big hotels. That is why I spend all my day commenting on r/soccer as shown in my profile because that is what they pay me for.... LMAO",
            "When looking for a place to stay, they don't show the total amount you will pay in per night prices. There are extra service, cleaning etc charges. You only see them when you are paying. So it gives the impression that it is cheaper per night.",
            "This is not only not in the US, but a large part of the US is also not a tourist destination.",
            "So that 1% number is such a sneaky way to put things. \n\n1% includes so many properties that are pointless in the middle of nowhere. \n\nWhat it also includes is cities that are short in space and all the potential airbnb properties are gobbled up. \n\nThis drives out people who work in the cities to the suburbs. Which drives up the prices. It just trickles down screwing everyone over.",
            "People that tell you it won't matter don't understand float. Either way, I know it won't make much difference. And yes, ultimately shit zoning and nimby is the major issue. That's why I said it would help \"some\"",
            "Maybe, but I think you're *underestimating* the impact of .2-.3% of housing suddenly becoming available in a market. There are supposedly about 1.7M homes available in the US right now. If 50k homes suddenly became available, that is certainly a difference on supply/demand.\n\n\nThey're certainly not all single family homes, but in the US, Airbnb had over 2M listings in 2021",
            "Wrong.\n\nUsing the figure you presented, 1%, It would cover close to [half](https://www.axios.com/2023/12/16/housing-market-why-homes-expensive-chart-inventory) of what is needed.",
            "Willing to bet airbnbs take up a way bigger percentage of SFHs in areas people actually want to live and have jobs.",
            "How is that distributed? \n\n\nWhat's the percentage in places like Barcelona?",
            "A lot of them aren’t middle class Spaniards owning these. Like many cities across the world, it’s individuals or companies that own multiple properties for the sole purpose of renting them to tourists pers day, rather than renting in general. Preferable to locals of course. \n\nWhen those “businesses” snap up apartments, it drives up the market for the remaining spots. \n\nWith the ruling, those business apartments would not be put on the market for someone to actually rent/own. And ideally it’ll allow their housing to come down. \n\nThe tourism should still be there as nothing is changing with that. They’ll now just have to stay at hotels.",
            "It's not middle class spaniards. Middle class spaniards don't own two houses, and one in Barcelona no less lol, to be able to rent one of them a quarter of the year.\n\nMiddle class spaniards are struggling with a rent level that takes away +40% of their two salaries family income, on an economy with trash stability in the private sector and trying to save enough money to reach the minimum saved amount to get a mortgage to start getting a house.\n\nSmall hotels also exist and are quite popular within our tourist ranges. I don't get the \"billion dollar chains\" complaint at all. In fact we even have government owned hotels of old historical places such as castles refurbished to be used as hotels.\n\nIt's a simple matter of supply and demand. If you don't build new houses and the remaining ones are used for touristic rentals the residential supply slowly disappears. This is a BIG issue in big cities, because they atract all the non-tourist jobs like a magnet but have the most tourist rentals and worst housing markets; meaning... tourist rentals are actually hurting our industrial economy.",
            "Yeah it really depends to be honest...\n\n  \nFor a long time there were no legal frameworks to ensure Airbnb cooperated with municipalities. There were laws for landlords, but not for platforms. And the platforms didn't go out of their way to cooperate if there was no legal requirement.\n\n\n\nThus the municipalities had to investigate themselves. That position was extremely weak and it required sending investigators to apartments, ringing the doorbell, hoping there's a tourist there who will testify to staying there as a tourist, and then taking that basis to bring the landlord to court. Barely effective, very resource intensive, and only a tiny fraction of landlords faced such an investigation because of it.\n\n  \nThen laws were introduced requiring Airbnb to have the landlord register with the municipality, then record that registration number on his Airbnb account, and then provide all this data back to the municipality including all records of any stays. Around the same time a rule was implemented limiting airbnb renting to 30 days a year.\n\n  \nThis was super effective because essentially all the data is now with the municipality, Airbnb has to abide by the law, and the municipality can essentially just use a two minute Excel filter to see who is breaking the rules, bring it to court, win and indeed the fines are huge. It works well.\n\n  \nSo it all depends on whether there are local laws enforcing Airbnb to cooperate with sharing full data and implementing a license/registration system on their site. Cities that don't have this aren't effective at combatting enforcing local laws. Cities that do, are effective. Idk for Barcelona.",
            "sorry to inform you but, pre-rich isn't a real currency ![img](emote|t5_2th52|4271)",
            "> There are also a lot of landlords flat out exiting the market, choosing to sell\n\nThat's a good thing tho",
            "Let's not speculate on such unrealistic things",
            "But do you have to go look for them, or are they top of the list on booking.com? Cuz most tourists don’t look further than maybe the big 3 for a place to stay, they’d never bother to look for an unlicensed, local renter.",
            "That and short-term rental services drive up housing prices and rent as a result of trying to capitalize on the tourists",
            "The only people to despise tourists more than the locales is other tourists.",
            "Being born and raised in a tourist driven place. This is not even fucking scraping how I feel about tourist. After living where I had lived, I truly can say I watched gentrification. Now said tourist are just flooding to live there.",
            "Live in tourist town in Florida. Absokutely hate it can confirm. Constant influx of people who don't know where they are going and don't mind slowing down to 30 under the speed limit so they can window shop every store without having to exit their vehicles and don't forget they refuse to miss any of their turns.",
            "Try living in Amsterdam! I think every major city in Europe has this issue(don’t know how the rest of the world is coping with this issue). Resulting in an increase in rent where you are paying 2\n€2000 euro a month for a Harry Potter like closet under the stairs. They already took measure in Amsterdam. But the crackdown will continue in the coming years. While if you visit the Netherlands, you can get a nice hotel/apartment for a better price outside of Amsterdam and only travel by train/bus and be there within an hour. Additionally you can get an good feel for the country and Amsterdam and other cities.",
            "That is horrific behavior for a guest.",
            "i hate that. was just in barcelona a few months back, was respectful but I’m sure many are not.",
            "I just stayed at one of these in Le Mans and Paris. It wasn't actually the route I wanted to go but when it came to finding a place to stay for myself, my brother and our three friends, hotels were pretty much booked up months early or what was available was significantly more expensive than the AirBnB options. \n\nI understand entirely how you feel, I live in NYC myself and we have these here and they're very frustrating to deal with tourists routinely but when traditional hotels still are overpriced and unavailable... AirBnB will continue to expand.\n\nI booked our Le Mans apartment about 8 months in advance, as soon as race tickets were available. Even then there was actually nothing available outside of AirBnB. Needed a single night in paris for the return... hotels were $500-700 a night for a single room. Sorry but for the same money we could house all of us in much nicer accommodations with more space. It's really an economic issue and Hotels (in some places) need to get their acts together. I travel a lot for work and many of these hotels have rates and benefits programs that are designed solely to cater to business travellers. Vacationers, singles or families can get fucked. The rates are unreasonable for most normal people that aren't travelling on a business line of credit.",
            "or owners are sick of the rental headaches and found something better.",
            "Not just touristy places, I live in rural Michigan, US and the same thing happens to any house on any lake in our area. Bought up all cash and rented out on AirBnB or the like for 4x the previous monthly rent. Completely jacks the cost of living in the area.",
            "Really sucks for people who actually have to live there though",
            "It used to be much more focused on renting rooms, rather than a whole place too. It was more like a bed and breakfast, but without the breakfast.",
            "Yep, I stayed at a few AirBnBs back in the day. Made my trip to Japan much cheaper. Got to stay near Mt Fuji at a nice cabin that was clearly someone's summer home and not really lived in. Also at some college kids' room (complete with their laundry on the chair) to see an eclipse while they slept in 1 room. But it just became abused to the point New Orleans had more AirBnBs than residents in French Quarter. So they [banned AirBnBs](https://thelensnola.org/2019/08/08/short-term-rental-restrictions-fly-through-final-council-vote-advocates-partially-pleased/) in specific sections, and of course, wannabe hotel owners sued and [got the law struck down.](https://apnews.com/article/new-orleans-neighborhoods-government-and-politics-1caa823c6aac2a296459cbf27577b14b)",
            "I used it rather early on to rent rooms in actual Airbnb's as a solo traveller and I did so recently too when I visited a few tourist cities with my partner and they were fine because the places had staff that lived at the location.\n\nBut yeah I've previously rented some apartments and what not as a solo traveller but didn't do many and went back to hotel rooms.\n\nUnfortunately there are some smaller tourist towns where basically all of the properties near the destinations (beach, etc) are on airbnb and the hotels are garbage or nearly nonexistent...when people go to there places they don't have a choice and now the possibility of someone buying up the inflated land values and building a hotel is reduced too.",
            "It was nice then one by one hosts show up to a massacre after checkout and the fees and deposits skyrocket as insurance. Its the same.for rental market and weeding out eviction risks. Its one thing to leave the sheets and towels on a hotel room floor, then one summer upon checkout some decides...hey! Lets eat some watermelon and chop.it.up with a wooden stick, leaving rind and seed and juice dripping down the counters. Thats just animal-like behaviour. Just take the fruit home if you didnt get to eat it during your trip",
            "Could check out residence inn if you're looking for a hotel with the same capability",
            "Yup, access to laundry is a big advantage over hotels who have no laundry or super expensive laundry. But then you get to the apartment and the unit is a 2 in 1 (washer + dryer) AND IT SUCKS BALLS AND MAKES THE ENTIRE BUILDING SHAKE!",
            "The platform they advertise on is kind of moot though. There's not really a difference between Airbnb, VRBO or craigslist. We're talking more about short term rentals in general.",
            "So buy MAR?",
            "really; it doesn't seem that way with the local policia.. 🤷‍♂️",
            "OK, so this is what I thought as well.\n\nThen I traveled right after the COVID lockdowns first ended, and found that Spain had the best rate of compliance for mask and disinfectant use of anywhere that I traveled. Also, Spain was the only country that actually seemed to check vax status upon arrival at the airport.",
            "Barcelona might well follow through with this. But only when the timing works for the mayor's cousin, the counsellor's sister, the ajuntament lawyer to build/refurbish/stock a hotel or 3. Maybe convert some social lodgings to 4 star hotels, luxury fittings etc. 2028? Reasonable ...",
            "No, you're thinking of gators",
            "Yes, they even developed Waiterade to keep them hydrated and with sufficient electrolytes.",
            "Anaksunamun",
            "They said waiters, not meth heads...",
            "Jesus, this hit close to home.",
            "I recently heard the UK described as a Butler Economy (servicing rich people who make their money abroad). Sounds about right",
            "Waiters & the rat, that’s where it’s at.",
            "Ah snap!  Implying a Canadian is like an American is fighting words in some places. 🙂",
            "America lives rent free in the world's head",
            "It's ridiculous, on one hand they are insulting Americans and then post an infographic showing Americans being amongst the best tourists.",
            "Wait till you learn about Chinese tourists.",
            "I live in Barcelona as a foreigner and there a lot of God awful takes among the natives for pretty much anything related to the economy. \n\n\nTourism is only 13% of the economy (the city is actually a major tech and startup hub), yet the way they talk about it, you'd think they're being exploited by tourists.\n\n\nUltimately, the problems here are 100% of their own making, but it's way easier to blame the tourists and other foreigners than actually make meaningful policy so....🤷",
            "Folks here in SoCal are the same. I think over here it's just more taxes and regulations rather than outright bans. \n\nEither way, locals always complain about tourism until they don't have it. Just like how folks acting like the current economy is worse than the great depression while we have inflation higher than the 70/80s when it's actually better than the 2020 or the GFC.",
            "Nothing wrong with tourism but i like classic air bnbs where I stay with a family",
            "Tourism is a big part of the economy and *hotels* wield a lot of local power. There are going to be people on both sides of this and we'll see who prevails but I'd bet on the hotels, they donate more to the politicians and pay taxes.",
            "Why should they leave, cause there's no airbnb? They just need to stay in hotels. Spain needs more high quality tourism, not masses that crowd public buses so that residents can't get around anymore or people entering private premises to take selfies.",
            "Mallorca has the Germans.",
            "People literally live worse now than back then when there wasn't so much tourism",
            "> the Balearic islands in particular\n\nI mean that specifically is more of a German centre. You have to go more towards Benidorm or Costa del Sol to be in British land.",
            "Eh I’m not sure how much honestly. Hotels still exist. There will still be a market for tourism.",
            "It’ll help hotels.",
            "They aren’t trying to attract tourists with this move. They are trying to address housing issues.",
            "I'm just surprised Hotel lobbying groups aren't more proactive in this effort to ban as much AirBnB as possible. After all, it hurts their bottom line and they can say \"it's better for the housing market\" or something.",
            "If you do it illegally how do you protect yourself against someone trashing your place and stealing anything they can get their hands on? I'd figure this would only have to happen a few times before owners started to see this as too risky. \n\nAlternately, they'll have to vet everyone themselves - nobody under 30, nobody without a $5k credit authorization, nobody with a non-EU passport, you'd have to verify the guest's identity, and even still your house wouldn't be insured because you are engaged in illegal activity. \n\nThat's starting to sound more stressful than having a job.",
            "You also don't have the convenience of finding everything in one database and paying by card, with all of the convenience that entails. Most people won't move to forums from AirBnB. They will move to Booking.com/Expedia and stay in hotels.",
            "Honestly as a tourist if I open AirBnb/Booking/etc and everything is expensive because most of the supply is in the black market I'll probably just think \"wow, Barcelona is way too expensive to stay at\" and pick a different destination.",
            "If you do it that way, how would you prevent the home being taken over by Okupas?",
            "But even you are admitting it's paid by credit card, not cash as previous poster said.",
            "Edit: affordable",
            "The idea is more hotels will take their place. AirBNB’s typically limit already existing housing supply in cities like Barcelona. These range from entire apartments, to lofts, and just spare bedrooms though. Not sure how many housing stock will be available on the market because of this. However, this just means hotels will take their place which usually makes everyone happy except the landlords of those short term rentals.",
            "The problem is mainly the disturbances caused by using apartments as hotel rooms. It really ruins the quality of life for all the neighbors.",
            "Except for they are not as professional.",
            "I still prefer the “extra bedroom” ones\n\nIt’s cheapcheap and you KNOW it’s someone’s actual house because they apologize about the pile of dishes in the sink",
            "Is it still alive? I was a heavy user (hosting and staying) but then the commercial coup happened and everybody and their mom knew about it. Also, I became older and can't do that much spontaneity lol",
            "Coke residue?! In THIS economy?!",
            "My wife and our 3 dogs had a gorgeous place in North Carolina on a river. Under 1500 for a week, I walked out the back door and was at the water. We were 30-45 from Asheville and the blue ridge. \n\nI’m not sure where these people book, but if their only experience is Airbnb on vacation in Florida gulf coast, yeah it’s fucking expensive. But if you spend some time researching, you can get a fantastic place.",
            "Dog. No one says hotels are annoying. If you have kids the Airbnb is just more useful. Your kid can sleep and you can hang. No sitting in a hotel room at 7pm in silence because your kid is asleep. There will always be a use case for this kind of arrangement, and particularly strong one for people with kids.",
            "and daily room cleaning",
            "Pretty sure they are. I believe I have read some of the big hotel chains are branching into the extended stay model.",
            "You mean Aparthotels?",
            "Hotels already have suites. You can book one if you want. If hotels felt like they'd make more money by offering better options for families with sleepy two year olds, they would. It's not like it's some massive market segment.",
            "Yeah, the worst experience I had was an old rundown Holiday Inn Express in Midtown Manhattan. My room was right next to the elevator and zero sound proofing in the room. There was some cheerleading/band competition happening in town so students were running a muck all night. I complained and got a bunch of points from IHG and the next time stayed in a better mid tier IHG property.",
            "Those are gonna be the only ones cheaper the airbnbs lol",
            "Just the parroting of popular sentiments it is then.",
            "that's and you're right. it's kinda annoying",
            "Obviously the rentals are going to be predominantly located near tourist attractions. I disagree that it's a negative when the people who would be most negatively effected by short term housing are people who directly benefit the most from the increase in tourism.\n\nWould you rather have a strong economy based on tourism with higher housing prices, or lower housing prices because you've eliminated a chunk of the tourism industry?",
            "I would argue the bigger impact on house prices would be from the decrease in tourism, leading to a smaller local economy in the first place. \n\nSo, sure it will 'help' lower house prices. Mostly by making locals poorer.",
            "Yes essentially this. Plus a lot of the \"tracing\" of illegal airbnbs is simply looking on the website of airbnb and comparing addresses with permits. And an important rule is that you can't rent out an airbnb for more than 30 nights a year. A lot of investigating can be done behind a desk.",
            "Our AI tracks our most intelligent users. After parsing your posts, we have concluded that you are within the 5th percentile of all WSB users.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/wallstreetbets) if you have any questions or concerns.*",
            "Nuerolink literally can’t go tits up",
            "I always did airbnb there, never [booking.com](http://booking.com) so not sure. There is definitely going to be less apartments around but then ones that are still there will make ever more money. Also not likely anyone will go to prison so the reward may be much higher then the potential punishment. Still I wish the people of Barcelona that things get more quiet for them..",
            "People are keen to forget this when discussing the subject",
            "Can confirm - am self-hating tourist.",
            "I stayed in an apartment, a mini hotel and a hotel near Ajax stadium.\n\nMuch preferred staying outside a lil bit",
            "just stop being poor",
            "Agreed. It needs better controls in many cities but there has to be a middle ground somewhere.",
            "wonder if the BNB in the name gave it away",
            "I didn't buy it so it's probably going up",
            "Its does if you're one of them",
            "Shit gets done when it gets the attention of the public and makes the policia look bad. Other than that, people won't care about such laws and will continue to rent out apartments to tourists.",
            "Ah.  Got it.  What rhymes with “sharks”?",
            "It's what waiters crave.",
            "Oops.  Sorry.  I’m stoned and really really hot.",
            "I'm just being honest there about ourselves.\n\nAmericans are rarely disrespectful on purpose but they are often ignorant of other cultures, don't speak anything other than English, expect others to cater to us, and sometimes come off as disrespectful mainly due to ignorance.\n\nBut as a whole we aren't downers, spend big, throw cash around, and tip well. That's the impression I get from family/friends who work in the hospitality/service industries in both Asia and Europe. Brits are penny pinchers, make less than American so they spend less, and don't have the same tipping culture.",
            "It really does. It's so funny and sad.",
            "It's some weirdo European inferiority complex.",
            "It seems like scapegoating foreigners is the one thing that unites all cultures.",
            "> I live in Barcelona as a foreigner and there a lot of God awful takes among the natives for pretty much anything related to the economy. \n\nLol, I mean have you seen how much rent has increased in Barcelona? It's not only tourists, but 10k less apartments are impacting the price, just as foreigners who come to be digital nomads there, and with their higher disposable income displace the lower rent locals from the area. \n\n>the problems here are 100% of their own making\n\nLike which? It's easy to not blame yourself for the problems you are contributing to in a foreign land. \n\nTourism may not be the highest money maker (which in Barcelona it very much is, as many of those startups and tech companies are there due to things like ease of connection, international congress', etc. which are all adjacent to Barcelona's toursim industry). But it is one that is having the highest impact on the city and its inhabitants.\n\n>it's way easier to blame the tourists and other foreigners than actually make meaningful policy so....🤷\n\nWell with this policy they're killing two birds with one stone it seems.",
            "Meanwhile every other state complaining about Cali tourists lol. Let’s face it human are assholes but tourists add that i don’t give a fuck cuz I’m on vacation vibe.",
            "Unless I'm traveling with a large group with funds who can splash out for a decked out estate with all kinds of perks, give me a nice hotel every day of the week. I don't want to make my bed or take out the trash or any of that nonsense. I want room service! I'm on vacation.",
            "In fact it would probably cause a few more hotels to be built, which is construction jobs, jobs for running the hotel and more houses for people to actually live in.",
            "This might be my jam when I’m traveling without the family. I enjoy meeting new people",
            "And the late drunk sex, then looking at them in the morning havin forgotten someone was there the night before",
            "The issue might be more that the family with the sleepy two year old is too poor or cheap to pay for the suite.",
            "Fair enough. But people are dumb, though. \n\nThey fail to realize tourism (within reason) is literally an equivalent to voluntary income redistribution. People with more disposable income go to places and spend more money than they typically would in their hometown/on a regular basis. It's a huge boost to local economies. There are literally countries that would be near economic collapse if rich folks didn't visit them and spend exorbitant money on overpiced hotels/food/etc.",
            "Inb4 your implant makes you think you are a monkey",
            "I did, now my bank account is disagreeing with me",
            "People who live and work in a city should be able to afford a place to live there, the middle ground is that landlords get to profit from the arrangement.\n\nAirbnb should be banned in every major city so we can *get back* to the middle ground, instead of further entrenching the gap between owner and renter.",
            "unfortunately i'm not..",
            "Narcs?",
            "larks.\n\nnot that there are that many left, since they are all eaten by the gators...",
            "Cocaine?",
            "I've traveled the world enough and interacted enough with people all around the world to realize that Americans are actually pretty knowledgeable about other cultures comparatively, or at the very least they're on par in general. People in Europe are generally knowledgeable about other Europeam countries but beyond that are very ignorant. Same goes for people in various parts of Asia, people in South America, and people everywhere basically.",
            "I think hospitality/service folks are also aware that America is very large and diverse.  I noticed decades ago that when I visited Europe and told people I was from California they treated me much worse compared to after I moved to New Mexico and started telling them I was from there.   I asked a waiter about it on a recent trip to Barcelona and he basically said:\n\n1. All British tourists are awful across the board with the pleasant/polite ones being the exceptions.\n2. Americans can be awful but it tends to be in patterns by state.  Floridians, Texans, and New Yorkers were the absolute worst.  He claimed New Mexicans and Coloradans were the best and he loved that folks from those states seemed to always know at least a little Spanish.\n\nThis all aligns with what I observed when I lived in Amsterdam for a few years.  The British tourists were consistently so bad that I learned pretty quickly to just avoid going to bars, clubs, and coffee shops on British bank holidays, Americans were a mixed bag and it did largely depend what state they were from (with NYC tourists being the absolute worst consistently).",
            "American tourists are also excessively friendly. It comes off well in Canada, but I can see how it might be overwhelming in more reserved cultures.\n\nFrom my (now long past) time in the service industry, younger American tourists were awesome. The super old ones who resented Canada being in the way of them getting to Alaska were the crabbiest.",
            "I think you mean British.",
            "Hotels are more dense and provide jobs for locals, while also leaving single family homes for residents only.",
            "Yup it will absolutely be framed as “new jobs, more affordable housing, and more stable rent markets” and honestly it’s a damn hard argument to disagree with",
            "Wait what?",
            "Yeah I totally agree. I live in SE Alaska and our town would shrivel up and die if tourism collapsed. Doesn't stop some of our residents from opposing it every step of the way.\n\nI'm constantly hearing retirees complain that their favorite businesses are too busy and that we should end tourism so that it's less crowded for them. Like, they don't realize that ending tourism would force most of those businesses to shut down.",
            "One of the police or Spanish?",
            "Mostly Adderall.",
            "Exactly. Europeans are utterly ignorant about the U.S. Their whole image of the country is a bunch of half-baked stereotypes that they cling to with almost religious conviction.",
            "Could be hit or miss.  When we were in Spain last fall, we (NYers) were repeatedly told that the only tolerable Americans were NYers because we didn’t act we had never been to a city before, watch out for ourselves to avoid trouble and seem to be the least likely to act opposite the local culture.  And because we tip the best, apparently.\n\nVery consistently called out as the worst?  Texans and Midwesterners.  Rude, ignorant, shocked at being in a city and by differences to American culture, and bad tippers cited as reasons.  We have heard this exact thing repeated in every European city we have ever visited.  The hatred especially for Texas is super strong.",
            "Not sure if you have WSJ sub - but I literally just saw this article. Very on point:\n\n[Europe Has a New Economic Engine: American Tourists - WSJ](https://www.wsj.com/world/europe/europe-tourism-economy-american-tourists-f6112f78?mod=hp_trending_now_article_pos1)\n\nhttps://preview.redd.it/oj3jtiinnz7d1.png?width=1882&format=png&auto=webp&s=89096fa0066ef608ead0fd9497842a051d6fa1c7",
            "r.i.p. \n\n'moose is loose' donut shop in soldatna :(",
            "I swear I heard someone was trying to reopen it a while back.",
            "🤞🏻"
        ]
    },
    "Astronauts stranded in space due to multiple issues with Boeing's Starliner — and the window for a return flight is closing": {
        "title": "Astronauts stranded in space due to multiple issues with Boeing's Starliner — and the window for a return flight is closing",
        "score": 1915,
        "url": "https://www.livescience.com/space/space-exploration/astronauts-stranded-in-space-due-to-multiple-issues-with-boeings-starliner-and-the-window-for-a-return-flight-is-closing",
        "content": "Why even rely on this company fir spacecraft when they couldn’t even get airplanes right. I am praying for their life now. ",
        "num_comments": 324,
        "comments": [
            "\n**User Report**| | | |\n:--|:--|:--|:--\n**Total Submissions** | 10 | **First Seen In WSB** | 3 years ago\n**Total Comments** | 174 | **Previous Best DD** | \n**Account Age** | 4 years | | \n\n[**Join WSB Discord**](http://discord.gg/wsbverse)",
            "This sounds like a joke…wtf is Boeing doing",
            "In space, no one can hear you whistle blow",
            "Those astronauts had a hell of a yolo on that mission.",
            "It's Boeing. If the window for a return flight is closing, we can assume a door is opening.",
            "I remember reading in one of the stories that happened right after launch how proud one of the Boeing executives was with the flawless launch and all the shoulder patting he was doing. \n\nOnly minutes later the thing started literally falling apart. \n\nHopefully the space station has a nice cocktail lounge. They might be taking zero g dumps for a while up there.",
            "Calls on BA, they will get Billions to find a solution.",
            "I mean, it shows you how they work when you read the last part regarding past attempts: \\[...\\] After more reviews last year, the company had to fix issues with the capsule's parachutes and **remove around a mile (1.6 kilometers) of tape that was found to be flammable**.",
            "I'm guessing they were the lowest bidder and NASA had to use at least one contractor other than SpaceX.",
            "At least the emergency exit hasn't popped out yet.\n\n  \nThis is the kind of shoddy engineering you expect from a Soviet-era communist tractor factory.\n\n  \nI hope it is just Boeing, and not an indicator of American decline.",
            "We’re buying calls right?",
            "I sure hope Elons got a ship ready to fly a rescue mission.  Time to break Boeing up into a million little pieces.  Maybe they can make e-Bikes and e-scooters or something less complicated than airplanes and spaceships.",
            "Clickbait. They have 45 days and minimal issues. Nothing burger.",
            "“ShArEhOlDeR vAlUe!&$!” AKA they milked the contract and awards for everything that they could knowing that NASA couldn’t justify starting over with someone else.",
            "Turns out they only sent whistleblowers up",
            "Godspeed ![img](emote|t5_2th52|4271)",
            "Boeing will kill the manned space program for 5 years and force SpaceX to not be able to launch astronauts while the government spends the 5 years investigating boeing.\n\nEach boeing executive will walk out with more money than all the dead astronauts will make their entire lifetime once the investigation is over.",
            "Those astronauts had a better chance with a 100 bagger 0dte",
            "I love how their CEO is still there. The balls on that guy.",
            "In space no one can hear you whistleblow",
            "\"Stranded in space\" is a great headline but unless the SOP on the ISS has changed they have a spare soyuz to get them home if the Starliner ends up being a no go.",
            "I hope their controls aren't like the titan submarine",
            "Ask Elon for a Ride back to earth 🌍",
            "I’m SHOCKED",
            "![img](emote|t5_2th52|4271)",
            "So the Boeing official stance on Helium leaks is turn it off, and back on again and if it isn’t leaking it’s fine.",
            "And all the science, I don't understand.",
            "Just lean against the door. They’ll be back on earth in no time",
            "Elon looking pretty good now. Bro would be tweeting from space talking shit on Boeing",
            "Maybe they're whistleblowers.",
            "I thought Season 5 of For All Mankind was already filmed.",
            "Didn’t know KSP experience was the only hiring requirement",
            "I trust they'll find a safe solution soon.",
            "Just stay with the cosmonauts and let that piece of shit fly away.",
            "Boeing? Inconceivable.",
            "Just remind me how much the CEO of Boeing earned ... What was his year on year salary increase?",
            "Monetizing this is perverse. Hope they make it back safe.",
            "Every time a Boeing airplane crashes. The US government buys more fighter jets. At this point I feel the executives are downing planes themselves so the US can keep buying crap",
            "There were problems before lift off and they still went ahead with the launch.  These astronauts should have put their foot down knowing it's Boeing.  That thing could have exploded with their track record.",
            "“The OceanGate sub has 3 hours of oxygen remaining”",
            "Anyone want to teach us how to buy puts? Or sell calls efficiently?",
            "Shitting on Boeing is surpassing MSMs love for shitting on Elon.",
            "Elon getting the call",
            "Send dragon",
            "Execs need to face criminal charges at this point",
            "Wow this actually real Jesus how much did they pay these people sign up with them after all the shady shit they've pulled off \n\nThat's the better question",
            "Their rockets are clearly as reliable as their 737's",
            "Jesus fucking Christ. ![img](emote|t5_2th52|4267)![img](emote|t5_2th52|4271) Boeing is basically an onion article",
            "wtf how is this not a bigger story",
            "BOEING….. Lol",
            "If you buy puts are you basically praying for their deaths",
            "Can't wait for the movie to come out",
            "Boeing stock will double in the next 5 years.",
            "Is one of the astronauts Sandra Bullock?",
            "The window will just fly by itself",
            "Even after all of this BS, Calhoun is still the CEO btw.",
            "ELON!!!!",
            "If its Boing it ain't going.",
            "Jfc Boeing. What a shit show. Didn’t have them ALSO putting the return in jeopardy on my bingo card",
            "I hold Airbus shares :)",
            "I think there was a movie like this",
            "Imagine grinding, working hard all your life to make it into the 0.0001% and selected to be an astronaut. \n\nThen you find out you’re launching on a Boeing.",
            "Ah yes more redditors shittalking Boeing even though they have zero idea of how even a Cessna works.",
            "They should’ve used SpaceX \n\nThey make it look so easy",
            "This takes Killing whistleblowers to a whole new dimension!",
            "Man Boeing puts just keep paying holy shit. I'm gonna get some 2026 0p leaps.",
            "after everything that happened, why would you ever trust a boeing spaceship when they cant even build planes.",
            "This sounds like a job for Jeb from KSP. To the VAB!",
            "Praying for their lives?  They're in the Space Station.  They can live there for months, worst case Space X can send up a taxi for them.  A rescue like this has never been done, but you can guarantee it would fire people up to see how quickly they could put one together.",
            "I don't think a panel flying off in space is quite as survivable.",
            "Literally whoever hired boeing needs to go to jail no way they make it home relying on them. Hope im wrong",
            "FOMO",
            "Would be hilarious if spacex gets a call lol",
            "DANGER WILL ROBINSON!!",
            "Just need a little Hawk Tuah from Dragon.",
            "It’ll make it back safely - with the crew - but it doesn’t seem like there’s any rationale for awarding Starliner a flight certificate to begin manne operational missions based on the nature of the current faults and their persistence/NASA’s lack of understanding about them (which is probably why the return has been delayed - they need all the data they can get on those issues). \n\nSo without a manned flight cert Boeing will either have to pony up for another manned test flight (after they’ve resolved these issues they’ve had on orbit), forfeit the contract (no idea what the costs there would be), or NASA can just terminate it.  \n\nThis certification dilemma is going to the hot potato of hot potatos as soon as Starliner and crew are back on the ground safely.   ",
            "Thanks for being a whisleblower we value integrity here at boeing!  You have won a space journey all expenses paid ofc.",
            "Stranded on the ISS, so not too bad",
            "I had a sigh of relief when I realised the 777 I was flying in 2 days ago was an old plane.",
            "Let’s hope they don’t take down the ISS with them…",
            "Lol 😂 I knew this was going to happen when they went ahead and pushed for the launch even knowing there were helium leaks and other issues. Odds of re-entry survival is low. Puts on astronauts. The burning re-entry and dead astronauts will be the cherry on the Boeing shit sundae. NASA knew and gave the okay. Hope is not a strategy.",
            "They are docked to the ISS, they will be perfectly fine. I’m pretty sure people don’t even read the article itself….",
            "On Earth: If it’s Boeing, down you’re going.\n\nIn Space: If it’s Boeing, down you’re not going.",
            "![img](avatar_exp|183017677|holo_card)",
            "They’re not “stranded in space”. They can leave at any time and safely return to earth. The reason for the delay is that the issues discovered during their maneuvering are in the Service Module which will be jettisoned before re-entry. They want time to learn as much from it as possible before it burns up in the atmosphere.",
            "Call in SpaceX to save the day",
            "Sold all my BOEING shares after the door fiasco. This company is about to hit rock bottom.",
            "Clickbait. No one is in danger. If they don't return with what they got up there with they'll just go down with a Soyuz. The ISS is permanently crewed and supplied, you can't get stranded on it.",
            "Did they fly a 737 Max 8/9 to space? Jeezus",
            "Clickbait trash article.\n\n\"sTrAnDeD iN sPaCe1!1....... safely aboard the ISS.\"",
            "Can’t get planes right that they have been building forever.  So US govt thought they could  now do space? wow",
            "Just need Elon to call out Boeing as pedos and launch a rescue mission.",
            "Never saw that one coming lol",
            "Why is Boeing allowed to just be trash?",
            "Priced in",
            "No one is stranded.\n\nThe issues with the Starliner are with the trunk portion of the craft.  That part gets jettisoned and burns up in the atmosphere.\n\nIf NASA and Boeing want to go over the data on that happened during the journey to the station, they have to do it while the trunk is still attached, so they're waiting out the mission time (up to 45 days) before Starliner must return home.",
            "Boeing is the real life consequences of the enshitification going on with companies",
            "While stranded in space sort of works they are stranded on the ISS and not just floating away out into space as the headline led me to believe. Dicks. That’s one of my greatest fears about how I die. Surely a 43% chance that’s how I go.",
            "They need to end fines for saftey violations and just imprison executives. This is ridculous.",
            "Not that bad, they are on ISS. There is SpaceX with regular route there. But if those two would be stranded ABOARD the Boeing flying bucket, that is real shit.",
            "Yes, the ship doesn’t work but they’re on the fuckin space station not “stranded in space” total clickbait lol",
            "Boeing execs about to scuttle the entire ISS.",
            "https://preview.redd.it/mp0g6tm6848d1.jpeg?width=1139&format=pjpg&auto=webp&s=7b7ae408f844b99f78b60819af0651582e96e646",
            "i can think of worse places to get stuck.\n\ni just hope they do not force them to take that leaking disaster ship back to earth!",
            "This is what happens when you replace a once engineered led company with MBAs trying to please Wall Street only to see the opposite results with their stocks.",
            "Puts on Boeing and ULA.   Calls on SpaceX",
            "Astronauts were whistleblowers.",
            "Does starliner use mcas?",
            "They shouldn’t have flew with Boeing",
            "They are not stranded in space. They are docked at the international space station.",
            "In assuming they are worried that the Boeing craft is not suitable for re-entry into the earths atmosphere. If it's about getting these astronauts home safe, couldn't they pay to have a SpaceX craft get them? \n\nIf they can get another craft up there to safely bring them hold, jettison the Boeing craft. It's an unsafe hunk of junk. \n\nReally, they need to consider severing the contract with Boeing as it seems they have some massively internal issues with their quality. There's zero faith in Boeing at this point.",
            "This article is sensational, completely blowing the situation out of proportion. There are issues but as many other news outlets have reported, they are not stranded at all.",
            "SpaceX will gladly send a ship to bring them back for half the cost.",
            "A year to the date after the sub incident…",
            "From the article :\"After more reviews last year, the company had to fix issues with the capsule's parachutes and remove around a mile (1.6 kilometers) of tape that was found to be flammable.\"\n\nWow",
            "This is Bidens fault (aka the government)\n\nBoeing is too big to fail so they will prop them up, America is a failed state",
            "Lining the pockets of the execs and shareholders at the expense of the US tax payer.",
            "Agree. I feel that Boeing probably pressured someone at NASA to let this thing fly in the first place. Given the problems with their planes, there is no way I would trust them to make a vehicle capable of space flight.",
            "Bribing congressmen and flag officers to buy the EX which we already know from day 0 isn’t surviving in a modern peer A2AD environment. Swell.",
            "Their Department of Assassinations is really out of control.",
            "Marrying their first cousins",
            "busy assassinating folks.",
            "I’m not an engineer, but I think I might be better at this just trying.",
            "Being who they are",
            "Does it make it better if the issues with the helium valves were known about and widely reported prior to the flight, they launched anyways, and now are like \"Oh, oops, I guess it's worse than we thought\".",
            "Profit!",
            "They are suffering from a case of the MBAs. “Why should we pay extra to keep these experienced employees around? Replace them with younger workers.”\n\nLeadership by spreadsheet has ruined many companies.",
            "Accidents happen. Intelligence and skill isn’t remotely enough to handle every unforeseen circumstance. There are so many it’s incalculable. People always get surprised but we are relatively on the cusp of space travel so there unfortunately will be many more tragedies to come. It’s just the unpredictability of the universe.",
            "Boeing is helping with the war in Ukraine. Commercial planes are suffering because of the demand for weapons systems.",
            "Starliner helium leaks likely caused by Chinese farts that permeated the atmosphere and degraded Boeing gaskets during fabrication.  Also, Ghina titanium.",
            "Unfortunately for Boeing they have next of kin.",
            "Space might be the safest place to be a Boeing whistleblower",
            "It's a novel alternative to the hitman approach (or maybe the hitman is up there too...)",
            "Damn that was good if you know the reference",
            "\"🎵Can you blow my whistle, baby, whistle, baby? Let me know🎵\"",
            "Well Boeing still hired an astronaut with 15 years of assassination experience, so….\n\nRIP",
            "Why can't they just get Red Bull sponsored parachutes and sky dive down?\n\nSurely, we have the technology by now.",
            "Somebody get ahold of the MBAs to tell us what to do!",
            "Reason why they choose veteran only for this test flight instead of bringing some younger face (for experience) with them.",
            "Wonder if they would rather fly a starliner or 737-8 max w/floppy doors",
            "\"Whenever God closes a window, Boeing opens a door.\"",
            "Soft landing. Wait…",
            "> I remember reading in one of the stories that happened right after launch how proud one of the Boeing executives was with the flawless launch and all the shoulder patting he was doing. \n\nHe was part of the launch team, not the get-the-crew-back-to-Earth team. So it's Not His Problem®.",
            ">Only minutes later the thing started literally falling apart.\n\nYeah, that's the point where the Boeing made stuff had to start working. The launcher was ULA.",
            "That's some forward thinking dude.",
            "![img](emote|t5_2th52|29637)",
            "The solution: Pay Spacex to do a rescue mission using their Dragon capsule",
            "\"Did you use the tape labeled flammable or inflammable?\"",
            "My favorite is \n\n> Starliner's first uncrewed test flight in 2019 was scuppered by a software fault that placed it in the wrong orbit",
            "Hahaha dear lord",
            "Actually you’d be surprised to know Boeing won nearly twice as much for this fixed-price contract ($4.2 billion compared to SpaceX’s $2.6B). Boeing was seen at the time (2014) as the clear #1.",
            "Nope, they were the highest bidder. The lowest bidder also got the contract and has already completed all operational missions, with them launching the current mission Boeing is having issues with 4 years ago in 2020.",
            "think they may endup sending a empty dragon up just in case.",
            "All Boeing has to do is play the patriotism card and they get countrywide support\n\nThat's how they got the contract in the first place. Same with the Air Force tanker program",
            "Nope. The boeing Starliner costs significantly more than spacex dragon.",
            "There's no consequences for the top management decisions that lead up to this situation.\n\nZero accountability and they'll keep wining fat government contracts no matter what.\n\nIf anything goes wrong they just need to lobby a bit harder and throw a few more millions to the next Presidential campaign on both sides.\n\nA company that's crucial to US security and transportation should not be allowed to do stock buybacks and paying 50% salary increases to the CEO in the year they had two fraud lawsuit and severe quality problems.",
            "We don't need our bike paths to become debris fields when the controls inadvertently put an 80yr old in a Dutch roll.",
            "Elon said he was going to send a ship, then tweeted out the astronauts were pedophiles.",
            "Elon announced that he was going to the moon with humans leaving orbit in 2017, I just got out of a coma, how did that go? Also, really excited for full self driving which has been out for many years.",
            "Just break it into old Boeing and McDonnell Douglas.",
            ">I sure hope Elons got a ship ready to fly a rescue mission.\n\nDon't worry, he'll probably show up, offer a useless submarine and call Bill Nelson a pedophile for refusing it because it doesn't help. \n\n[Reference](https://www.theguardian.com/technology/2018/jul/15/elon-musk-british-diver-thai-cave-rescue-pedo-twitter).",
            "He announced the rescue ship would be ready in 2019",
            "Toasters",
            "Yea and Tesla’s have no issues whatsoever..:please. Elon just delegates and has enough money.. he simply buys the brains.",
            "Last time Elon tried to help on a rescue it didn't go so well...",
            "And they are docked at the International Space Station.",
            "100% clickbait.\n\nThe issue isn't preventing the astronauts from coming down. It was a problem from when they *came up*.  \n\nThe part they are troubleshooting isn't supposed to survive reentry, so they are staying up in space for a while longer so they can diagnose and study the issue. Because when they decide to head down, the issue may or may not be replicated on the ground.",
            "In space, nothing burgers 🍔 can kill you. 🤦🏼‍♂️",
            "This should be top comment. \n\nBut fuck boeing's top management bean counters and their stock price fixation culture for ruining a once great company.\n\nWe gotta find a way to break the corruption rampant everywhere...",
            "Ah yes but this is an opportunity for the same old recycled jokes.",
            "Worse, it's made by Boeing",
            "The nice thing about helium leaks is that if you wait long enough, it will stop leaking for sure.",
            "\"So they're gonna sound like Mickey Mouse on reentry... what's the big deal?\"",
            "think not exactly, they have issue with thruster, think their worry is not able to get into or accurate reentry",
            "Execs probably. Shareholders not so much. Stock has been a dog over the last 4 years. Still isn't worth 50% of what it was pre-Covid.",
            "Shareholders ![img](emote|t5_2th52|4271)",
            " \"at the expense of the US tax payer\"\n\nNot to mention people who fly in their planes and now astronauts.",
            "It is also letting the sales team run the company not engineers",
            "Them executive got 45 day options on BA",
            "🛎️",
            "Whaaat? Boeing? I refuse to believe it.",
            "The good news: Boeing does not seem interested in making a vehicle *capable* of space flight.",
            "This is why we need NASA to build rockets again. NASA never had a profit motive and thus took their time to develop shit. Boeing used to be okay, but greed took over.\nSpaceX somehow is doing fine, Elon is just very eccentric",
            "You’d probably be surprised how often fucks ups happen in the aviation sector alone, maintenance workers make mistakes,.. things not installed correctly… etc. Look how much of a hot commodity Tesla is but the fraction of a % of drivers will have a serious malfunction.. brakes..car won’t stop..etc. Building / bridge contractors don’t always keep up with codes/maintenance as has been seen in recent events. Nothing made by anyone is foolproof. Rockets with astronauts inside have exploded before.",
            "Uncle dad told me there weren't nuthin wrong with that",
            "MAGA has entered the chat.",
            "Not for long... 😉",
            "They will just sponsor them a holiday trip that starts with a long flight on a 787. Sweet Dreams....",
            "[I Jumped From Space (World Record Supersonic Freefall)](https://youtu.be/Hz2F_S3Tl0Y)",
            "Those really high altitude parachute jumps are like 1% the energy of coming back from orbit. So no, the technology is not there. Although there was a concept with an inflatable ball you could ride down in, but it never went beyond the drawing board.",
            "Sorry guys, I’m here. Has anyone tried to buy back shares? It would concentrate the share value giving us a nice bump in the stock price which would benefit everyone, including the astronauts assuming they are holding shares.",
            "\"Once the rockets are up, who cares where they come down?\n\nThat's not my department, \" says Wernher von Braun.",
            "To his credit my company hasn’t but a ball in space yet. He achieved an incredible launch. Right before they do their quarterly raises, promotions, or whatever shit to bump himself I’m sure.",
            "So their new business model is… extorsion? Wait until they meet space-mafia",
            "“Flammable, inflammable, and non-inflammable…why are there three? I mean, either the thing flams or it doesn’t flam” - George Carlin",
            "https://youtu.be/Q8mD2hsxrhQ?si=Hba9qRTXiWMqyzCy",
            "How the turntables",
            "I am, but, not at the same time.",
            "Way over budget and way behind. Scary shit if you ask me.",
            "Have you noticed a trend with companies that are too big and dumb to fail and politics?",
            "Better than getting stuck in a Dutch oven.",
            "My king",
            "black mirror sucks now too",
            "The only other working human spacecraft the US flies is SpaceX’s Dragon, which actually is docked to the ISS right now because it took up the other US ISS crew members currently up there. NASA has paid SpaceX to successfully fly its astronauts on 9 missions so far to ISS since 2020. Literally the only American entity that is capable of human spaceflight besides Boeing is SpaceX.\n\n\nElon’s kinda an asshole and I don’t give a fuck abt Tesla but don’t draw all your knowledge from memes bc SpaceX is incredibly competent and by far the most capable space company out there.",
            "Oh? Are you upset that Elon is 5 years late on developing transformative technology for the entire human race? How disappointed you must be.  Give me a break.",
            "Or you know continue to be Americas only reliable ride into space for a fraction of the cost of all other pretenders.",
            "thruster problem though, it may have a problem getting to reentry.",
            "Bing bang boom hamburger time.",
            "This. Haven‘t seen a dividend check in years. Stock has been shit. Would like to sell, but would have to pay LTCG tax.",
            "Maybe they skull crash a few more planes.",
            "A few plans falling from the sky will do that to ya.",
            "https://preview.redd.it/7x8m2b7d538d1.jpeg?width=1284&format=pjpg&auto=webp&s=effa9c2ad27b3bfb9b3fd79b307be9418ea6a7fb\n\nI literally met the team behind Starliner (first article). I had an incredible experience sharing cookies and they took a great inquiry in my personal information.\n\nNotice [the third article](https://www.boeing.com/space/starliner#feature-stories)? I actually counted 6 ways this wows. Boeing is undervalued by the market for sure",
            "Challenger and Columbia have entered the chat",
            "I actually spoke to some pretty high up people at nasa and the issue with them developing is that it’s government funded. \n\nNASA has some of the greatest minds but they don’t think about cost. They think about literally anything and everything else tho! The development details and things they research will feed private development immensely. I’ll share a story of what I mean. \n\nThey were testing something with a battery. Battery accidentally dropped during testing and explodes. The business move is “omg get this asset working and the project back on track for launch.” The people at nasa go, “we didn’t expect that, let’s do it again on purpose and run some tests.”  \n\nThat story there is why NASA is great at new tech but at a far greater cost due to actually testing every thing they can think of vs slapping something together and sending it to space with people in it.",
            "Listen to the Podcast “inside the back box”, the two episodes about Columbia. Will completely change the way you think about NASA",
            "NASA has always used contractors to build their “rockets”. Lunar module = designed and built by Grumman. Saturn V = Boeing, North American, Douglas. Orion = Lockheed Martin.",
            "It is but once it happens on your eyeball grabber your stock tanks.",
            ">Rockets with astronauts inside have exploded before.\n\nOnly once though (Challenger). And they practically knew that was gonna happen in that case, and launched it anyways.\n\nAll the other spaceflight fatalities were all different problems, and interestingly there are no repeats of same or similar faults.",
            "But the placement of the eyes on your sister aunt's face says otherwise.",
            "I know you're not serious, but just because some people might not know....\n\n\nJumping from space is perfectly possible, as this video shows.\n\nThe difference between this guy and the astronauts is that he jumped from space while stationary. The astronauts are moving sideways at 28,000 kilometers per hour. This is a factor 10 faster than the speed you would get from a 250km high drop from space without taking air resistance in to account.",
            "not true, i saw jcvd pull this off with dennis rodman's help.",
            "Oh yeah, your astronauts definitely yoloI'd their life savings into a company whose engines fall off while riding the company's rockets known for leaking",
            "It is not surprising that the V-1 and V-2 missiles had such low accuracy.",
            "He tried hittng the moon but hit London instead.![img](emote|t5_2th52|4260)",
            "Great Tom Lehrer song.",
            "What a country",
            "Yeah it’s been quite the fall lol",
            "Someone is still into vinyls, I see.",
            "Boeing contract has a fixed budget contract with NASA. So if anything is over budget, Boeing has to pay for it.",
            "That’s Big Defense’s Moto. It’s basically a white collar jobs program.",
            "Not as good as doing the Dutch rudder though",
            "Lots of disappointment to wake up to.",
            "Damn suck that Elon cock a bit harder lmao",
            "Yeah, I may think Elon is an insufferable asshat, but SpaceX it putting rockets in space reliably at a breakneck pace. . . I get launch alerts sometimes less than 24 hrs apart for SpaceX rockets. . . I’m all for competition but clearly SpaceX is the safer and cheaper option so why give Boeing another dime",
            "You don't pay taxes if you don't make gains. \n\n*- Sun Sue*\n\n- r/wsb",
            "You’d rather own a company that has had at least 2 major negative documentaries made, can’t make plane doors work correctly anymore, and has had major issues with regulators than pay a capital gains tax? \n\nYou belong here.",
            "I mean.. that'll always be a problem for you",
            "Better pay LTCG than waiting for bankruptcy",
            "Reminds me of people who bitch about AT&T.  Suffering shareholder here.",
            "If you have to pay LTCG tax it means you are still in the green so it’s no so bad. In any cases, cutting your losses and invest in a broadly diversified ETF (SP500, all-world, …) is a much better perspective than a miraculous recovery.",
            "Not if it’s a net loss.",
            "They haven’t made a profit in like 5 years",
            "Start selling covered calls deep OTM. Extra side income and no need to sell the shares",
            "Would you rather lose all your value?  If you were talking short term maybe but I would get out now.",
            "Not sure if serious or ironic.",
            "Work on making money, taxes mean you are winning.\n\nRight now you are losing sitting on a deadbeat",
            "Have you heard of this company called SpaceX? Boeing had 50+ years of experience before SpaceX was founded and now they’re showing the world how incompetent Boeing is. Space is hard. It’s even harder when you’re stupid and greedy.",
            "Apollos 1 and 13 would also like a word",
            "There’s a reason NASA is the originator of the phrase “go-fever” lmao. They knew about foam strikes on the shuttles for like 12 years….",
            "I don’t think that’s an issue right now. \n\nI would think that the main issue with NASA doing development is that a huge chunk of the direct NASA engineers that work there are systems engineers that more or less manage contractors. \n\nIn fact, 73.5% of NASA’s budget was spent on contracts.",
            "Thanks I've been looking for a new podcast!",
            "https://preview.redd.it/gwqfrsn4g28d1.jpeg?width=500&format=pjpg&auto=webp&s=879668f8f6c4ee02ee5f90e7b22a261a62aa2938",
            "Why not using brakes? Just push the pedals",
            "What if you jumped from geo stationary orbit?",
            "I challenge you to build better guidance before computers were invented.",
            "Naw, someone is into The Office.",
            "And you know exactly what happened there. They tried to skim as much of the fixed price as possible to help the books and sidestepped a metric load of proper engineering design steps.",
            "Never go rudder to mouth",
            "Is any of what that person said wrong though? Imagine chastising someone for making reusable rocket technology work (something that even NASA couldn’t do with decades of trying).",
            "He reached the balls. He can’t go deeper.",
            "What app do you use for launch alerts? Sounds pretty cool",
            "Safer to be on a SpaceX rocket than a SpaceX factory, lol",
            "Only real competition is Airbus, and I don't live in France, so...",
            "Might not be. Let’s see how this plays out first",
            "Why doesn’t the largest astronaut not simply eat the others?",
            "If the pedals don’t work I use the hand brake because then it’s an emergency",
            "You would not go down. That's the point of the orbit being geostationary.",
            "Japan\n\nNot a word more, thrusting the man inside the rocket.",
            "r/unexpectedoffice",
            "Elon didn't do any of it. He only said yes or no to projects that led to the development. He is a decision maker, that's it, nothing else. Not a scientist, not a genius, just a business man. He doesn't create anything.",
            "I use Next Spaceflight",
            "As the other person said Next Spaceflight; give pretty solid descriptions and 24 hour, 1 hour, and 10 min alerts",
            "You know you can own international stocks right? Something like international brokers lets you buy it from the exchange directly.",
            "It's a bold tax strategy, Cotton!",
            "Wait, is the plan to wait until the stock falls so much that there are no gains?",
            "We really are better than these nasa engineer",
            "Bruh, you jump the OTHER direction.",
            "Presumably the question was \"what if you jumped from the height of geo stationary orbit?\". Obviously if you're in orbit you don't go down, but if you were at that height and not in orbit you'd definitely start falling.",
            "The problem with that is by the time they were building those it would have been easier to find a computer than a young alive man.",
            "With spacex he was literally drawing company plans for reusable rockets on napkins in day one. \n\nHe did do a lot of it.",
            "A visionary and decision maker.   The most important role there is given that engineers can be replaced, someone willing to see and push for something that’s never been done before and then bankroll it is far more important for it actually happening.\n\nYou may not like the guy or his politics, but you hurt your credibility when you say dumb shit.",
            "Always love this take from delusional Redditors. Anything good he does, it’s obviously not because of him at all, but anything bad, it’s obviously all his fault Lol.",
            "Nobody says you have to own any airline stock.\n\n*Edit: Or airline supplier / plane manufacturer stock",
            "Yeah but... France.\n\nNot even the Ape scum are that degenerate.",
            "It’s the smooth brain way",
            "In that case, you would come in at around 26.000 km/h, comparable to ISS speeds.",
            "How's that Elon cock taste",
            "Well, airbus isn’t an airline, but yes, nobody says that.",
            "Touch some grass",
            "Pretty good.  It’s incredible being the only nation on earth with reusable rockets. If we wanted to we could close space to every other country on earth and create an antiballistic missile program that actually works.",
            "Airline supplier stock, excuse me.\n\nYes also military plane supplier.\n\nBut I think for the defense play there's better options.",
            "No u."
        ]
    },
    "Best DD": {
        "title": "Best DD",
        "score": 593,
        "url": "https://i.redd.it/2sm71j8n028d1.jpeg",
        "content": "",
        "num_comments": 57,
        "comments": [
            "\n**User Report**| | | |\n:--|:--|:--|:--\n**Total Submissions** | 10 | **First Seen In WSB** | 3 years ago\n**Total Comments** | 14528 | **Previous Best DD** | \n**Account Age** | 4 years | | \n\n[**Join WSB Discord**](http://discord.gg/wsbverse)",
            "Nancy has the best DDs",
            "Top: Emperor Palpatine, Dark Vader\n\n\nBottom: The General hit by the A-Wing, Stormtrooper with the crooked rifle",
            "Gotta know when to hold em, know when to ARKK em, know when to buy your way, know when to inverse Cramer.",
            "Too much DD for me",
            "What if Cramer and Cathy had a child....",
            "Serious question- how does Kathy Woods still have a job?",
            "The Cramer-Wood Conjecture",
            "Hilarious",
            "Cramer: *Sell then run",
            "Inverse Cramer....maybe he knows we know ...",
            "Bottom left is Kathie Wood?",
            "Guys I've been saying this for so long, just all in voo and then *bong* yourself on the head so you forget about stock and leave it for 10, 20 years",
            "Just buy vtsax. \n\nOh sorry where is r/bogleheads",
            "Cramer is actually right surprisingly often considering he has to give off the cuff answered to random boomers asking about dumbass stocks.",
            "What we buying my regards?",
            "I hate to point this out LJIM outperformed SJIM.",
            "Cramer has consistently been a bull in Nvidia",
            "Cramer has seemingly being pretty good. But when you give so many opinions, you're bound to be wrong often. As for Woods, ARKK is down 5% over 5 years while the sp500 is up 85%...impressive.",
            "Cramer bullish on nvda since 2016",
            "My panw went sideways for like 6 months dawg",
            "![img](avatar_exp|141765522|fire)",
            "who is bottom left?",
            "Shouldn't Cramer be 'Do the Opposite'",
            "I don't really know why everyone hates Cramer so much, I just think he's really funny but I'm not crazy enough to believe what he says.",
            "As someone previously said, for Nancy it can only go tits up ![img](emote|t5_2th52|4271)",
            "If only her surgeon could fix those sunken eyelids…",
            "Dark Vader?",
            "I knew he was reading my emails",
            "looking forward for the day where Pelosi grabbed and throw Buffett to the core of death star, as he shoots out Electricity",
            "I have a brother??",
            "Nightmare on Wall Street 😭 as soon as this kid breath the SP500 will fall 10% 😂",
            "Put printer",
            "When you own the company you can fuck up as much as you want.",
            "My left or your left?",
            "Honestly sure.  But voo can only get you 300 percent in 30 years if your lucky.    Haliburton gave me 600 percent in covid.   Rycey almost 400 percent.    \n\nMy play Roth is already equal to my 20 year Roth.",
            "Cramer alt account detected",
            "Or, and hear me out, he *was* quite accurate back in the day, but times changed and he is no longer in with what’s good.",
            "I get he’s a meme at this point but you’re right he actually is not THAT bad. Back in his hedge fund days he was actually pretty good comparatively speaking.",
            "Nvidia & Palo Alto like our queen Nancy ❤️",
            "He has always said buy Nvidia.....",
            "Because he came from the problem and admitted what they did on camera.... Then said bear sterns was solid bank.",
            "Man, I wish Benjamin would upload more videos ![img](emote|t5_2th52|31225)",
            "Dark Vader?",
            "*whispers* leverage...",
            "Ah shit, they found me out. Not financial advice! Ahhh the bot is after me, I can feel it.",
            "Too much coke will catch up to us all one day I guess \n\nOne day we will all be homeless, looking like Rickety Cricket, giving handjobs for a bag of lemons",
            "OMeth4life Smokin the wrong pole cowboy",
            "Scary 4th comment",
            "Dark Vadon",
            "When life gives you lemons… it’ll be from me.",
            "When life feels gives you lemons, make lemon curd."
        ]
    }
}