{
    "Update 36: Jade Shadows": {
        "title": "Update 36: Jade Shadows",
        "score": 306,
        "url": "https://www.reddit.com/r/Warframe/comments/1dit9kb/update_36_jade_shadows/",
        "content": "[Source](https://forums.warframe.com/topic/1400346-update-36-jade-shadows/)\n\n[e4e0963af77446ab93d7a3398312175_1600x900](https://www-static.warframe.com/uploads/thumbnails/e4e0963af77446ab93d7a3398312175_1600x900.png)\n\n**UPDATE 36.0: JADE SHADOWS**\n\nIn moments of despair, let the battle resonate with song. Delve into long-held secrets of the Origin System with our new Ascension Game Mode, Operation: Belly Of The Beast and the latest cinematic Quest that uncovers a secret, long kept by the Stalker. \n\nJade Shadows also brings our 57th Warframe, Jade, a glorious herald of both life and death. An Arsenal of her radiant weapons awaits you, fit to combat that which lies in the dark. \n\nDiscover New Warframe Augment Mods, the Yareli Pandea Skin Bundle, new TennoGen and more! We’ve also packed this Update with reworks and QOL - read on to learn everything Jade Shadows has brought!\n\nJade Shadows is a Mainline Update! \n\nMeaning that everything the team has been working on since the launch of Dante Unbound is in this update (with the obvious exception of content that is not ready to be released). It is very likely, as it is with all Mainline updates, that things slip through the cracks so we will be watching for bug reports and feedback in the [dedicated Jade Shadows Subforums](https://forums.warframe.com/forum/1966-update-36-jade-shadows/) to address in follow-up Hotfixes.\n\nIf any of the terms above are new to you, visit “[The Warframe Lexicon for Updates](https://forums.warframe.com/topic/1355354-the-warframe-lexicon-for-updates-patch-notes/)” to learn more about Warframe’s development cycle. \n\nUpdate Download Size: ~1.15 GB \n\n**Total Warframe Download Size: 39.5 GB**\n\n* * *\n\n**TABLE OF CONTENTS:**\n\nThere is much to explore in Update 36: Jade Shadows! We highly encourage you to read the patch notes in full but if you are looking for a specific topic, simply CTRL+F the following keywords to jump to its dedicated section:\n\n  * New Cinematic Quest: Jade Shadows \n  * New Warframe: Jade \n  * New Weapons \n    * New Bow: Evensong \n    * New Thrown Secondary: Cantare \n    * New Scythe Melee: Harmony \n  * New Game Mode: Ascension \n  * New Eximus Unit: Jade Light Eximus \n  * Operation: Belly Of The Beast (begins today at 11:30 AM ET) \n  * New Warframe Augment Mods \n  * Tennogen Shadows \n  * New In-Game Market Additions \n    * Jade Collection \n    * Jade Chorus Pack \n    * Jade’s Ensemble \n    * Yareli Pandea Skin Bundle \n  * Resistances And Status Rework \n    * The following list is featured sections and is not exhausted: \n      * Simplified Faction Resistances \n      * Armor Adjustments \n      * Shield Adjustments \n      * Status Effect Reworks \n      * Warframe Changes \n        * Includes Frost Rework, Ember Changes and more \n  * Duviri Additions & Changes \n    * New Decrees \n    * New Undercroft Mission: Alchemy \n    * Pathos Clamps Rewarded From Undercroft Portals \n  * New Player Experience Improvements \n    * Debt-Bond Farming Changes \n    * Voidrig Acquisition Improvements \n    * Awakening Quest Improvements \n  * UI Additions, Changes & More \n    * Loadout Customization From Navigation \n    * Arsenal UI Additions & Changes \n    * Stat UI Changes & Fixes \n  * HUD Changes \n  * Finisher Changes \n  * New Video Setting: Reduce Frame Latency \n  * Additions \n  * Changes \n  * Top Fixes \n  * Optimizations \n  * Fixes  \n\n\n\n\n* * *\n\n  \n\n\n[95e413030679a8f8b410866f5929164f.png](https://www-static.warframe.com/uploads/95e413030679a8f8b410866f5929164f.png)\n\n**NEW CINEMATIC QUEST: JADE SHADOWS**\n\nStruggling to understand the oldest and deepest secret from his past, Stalker finds himself allied with sworn enemies on the troubling road toward uncovering the truth… and averting an incalculable loss. \n\n**Spoiler Courtesy**\n\nJade Shadows contains significant spoilers for Warframe! **To ensure that all Tenno enjoy the best possible experience, we ask that you allow others to complete the Quest at their own pace, and to please be kind by avoiding spoiling it for others.**\n\nIf you’d like to discuss or share anything related to the Quest after playing (and we certainly expect that you will), **please use spoiler tags so everyone can experience it as intended.**\n\nHere’s how you can use spoiler tags/warnings to share your experience without impacting others:\n\n  * Use “Spoiler” warnings on any content pertaining to the Ques. This includes social posts, live streams, videos, Capturas, Fan Art, Etc. \n    * On our Forums you can use the “Spoiler” tag to properly mark your post, as well as the built-in**** “Spoiler” button to cover your text up when posting:  \n[97d4fe7820f0842c6453f85bd04bcc9d.png](https://www-static.warframe.com/uploads/97d4fe7820f0842c6453f85bd04bcc9d.png)\n  * Content Creators should clearly label spoiler content and use spoiler-free thumbnails and titles.\n\n\n\n**Quest Prerequisites**\n\n**You must have completed The New War Quest in order to play the Jade Shadows Quest**. The Quest will become available from your Codex once you have done so. \n\n**Quest Commitment & Duration**\n\nSimilar to The New War Quest, once you commit to beginning Jade Shadows you will be unable to do other Warframe activities for the duration of the Quest. You will be able to pause the game, and your progress will be saved between missions. It is roughly a ~30 minute experience, perhaps faster for seasoned Tenno! \n\n**Content warning:** This quest contains scenes of trauma related to motherhood. \n\n**Quest Rewards**\n\n  * **Jade** Warframe Blueprint\n  * Access to **Operation: Belly Of The Beast**\n    * Read the dedicated section below to learn more about the Operation\n  * Access to the new **Ascension Game Mode**\n    * Read the dedicated section below to learn more about the new Game Mode\n  * New Captura Scene from the Quest\n  * New Displays from the Quest\n\n\n\nShare your [Feedback](https://forums.warframe.com/forum/1985-jade-shadows-quest-feedback/) & [Bug Reports](https://forums.warframe.com/forum/1978-jade-shadows-quest-bugs/) on the Jade Shadows Quest in the dedicated Feedback Subforum. \n\n  \n\n\n[44753cfd6f1d407fd4e9b4b51bf9d487.jpg](https://www-static.warframe.com/uploads/44753cfd6f1d407fd4e9b4b51bf9d487.jpg)\n\n**NEW WARFRAME: JADE**\n\nBecome enraptured by the song of devastation. Through her, the Jade Light can be a source of destruction or a source of support.\n\n**How To Acquire Jade**\n\n  * **Completing the Jade Shadows Quest:** Jade’s Blueprint is rewarded after completing the Quest.\n  * **New Ascension Game Mode - Brutus (Uranus) Drop Tables:** Jade’s Component Blueprints have a chance to be rewarded from the new Ascension Game Mode on Brutus, Uranus (more information in the “New Game Mode: Ascension” section below). \n  * **Ordis’ “Release Vestigial Motes” Store in the Larunda Relay:** Jade’s Blueprint and Component Blueprints can be exchanged for Vestigial Motes via Ordis in the Larunda Relay on Mercury (more information about Vestigial Motes can be found in the “New Game Mode: Ascension” section below).\n  * **In-Game Market:** Jade and her Collection are available for purchase in the in-game Market for Platinum. \n\n\n\n**Jade’s Abilities**\n\n**Passive: The Anointed**\n\nJade’s profound understanding of the relationship between life and death grants her two Aura Mod Slots. Some of her Abilities apply **Judgments,** increasing enemy damage vulnerability by 50% for 10s. \n\n**Ability 1: Light’s Judgment**\n\nCreate a well of light that heals allies and hurts enemies. Those who enter the well will be highlighted by Judgment.\n\nLight’s Judgment is Jade’s Railjack Kinesis ability. \n\n**Ability 2: Symphony of Mercy**\n\nCycle through three songs that strengthen allies. Extend the duration of each song by killing enemies surrounded by Judgments.\n\n  * **Power Of The Seven:** Increases Ability Strength \n  * **Deathbringer** : Increases Weapon Damage\n  * **Spirit Of Resilience:** Increases Shield Regeneration and decreases Shield Regen Delay \n\n\n\n**Ability 3: Ophanim Eyes**\n\nJade summons an accusatory gaze that slows nearby enemies and dissolves their Shields and Armor. When the gaze falls upon allies, they can be revived from a distance.\n\nOphanim Eyes is Jade’s subsumable Helminth ability. \n\n**Ability 4: Glory on High**\n\nSoar with destructive power. Use alternate-fire to detonate Judgments, causing an explosion of Jade Light. Enemies inside the Light’s Judgment radius empower the explosion. \n\n**Jade’s Glory on High Exalted Weapon: Glory**\n\nUnleash the power of the Jade Light. \n\n**Maximum Loadout Slot Increase:**\n\nWith the release of Jade, the maximum number of purchasable Loadout Slots has been increased from 25 to 26. \n\n**Jade’s Prex Card**\n\nExpand your Prex Card collection with a new addition! Jade’s Prex Card can be found in a special location in the new Ascension Game Mode’s tileset.   \n\n\nShare your [Feedback](https://forums.warframe.com/forum/1974-ascension-game-mode-feedback/) & [Bug Reports](https://forums.warframe.com/forum/1979-jade-new-weapons-bugs/) on the Jade in the dedicated Feedback Subforum. \n\n**NEW WEAPONS**\n\nJade brings with her a full Arsenal of weapons that evoke feelings of hope, a counterpart to that which evokes an absence of light. \n\n[fbdf592487c4990a6816491023319a27.jpg](https://www-static.warframe.com/uploads/fbdf592487c4990a6816491023319a27.jpg)\n\n**New Bow: Evensong**\n\nCounter the dread of battle with a song of praise. Enemies cannot hurt your allies while wounded by Evensong’s arrows. Kills with Evensong empower ally weapons with Multishot. \n\n**Unique Trait - Evensong Devotion**\n\nDamage dealt by Evensong's arrows applies 7 stacks of Puncture Status, which reduces the target's damage output by 100% and increases their Critical Chance of damage taken by 35%. Kills with Evensong activate Evensong Devotion, a buff that increases Multishot by 35% for allies.\n\n  \n\n\n**How to Acquire Evensong:**\n\nAcquire the Evensong Blueprint from the new Ascension game mode, or obtain the Blueprint in exchange for Vestigial Motes from Ordis in the Larunda Relay on Mercury. It can also be purchased fully built via the in-game Market for Platinum.\n\n[9e662544cb85481b5cf1a5faa7cdab28.jpg](https://www-static.warframe.com/uploads/9e662544cb85481b5cf1a5faa7cdab28.jpg)\n\n**New Thrown Secondary: Cantare**\n\nIn moments of despair, let the battle resonate with song. Cantare’s blades lodge into the battlefield and return upon reload. When returning blades strike enemies, Cantare empowers allies with increased Reload Speed. \n\n**Unique Trait - Cantare Chorale**\n\nCantare's blades have a 300% Critical Chance when they return upon reload. Strike enemies with returning blades to activate Cantare Chorale, a buff that increases Reload Speed by 20% for allies.\n\n**How to Acquire Cantare:**\n\nAcquire the Cantare Blueprint from the new Ascension game mode, or obtain the Blueprint in exchange for Vestigial Motes from Ordis in the Larunda Relay on Mercury. It can also be purchased fully built via the in-game Market for Platinum.\n\n[4dd96a10fc711f7daa6b2c5c6d0027d7.jpg](https://www-static.warframe.com/uploads/4dd96a10fc711f7daa6b2c5c6d0027d7.jpg)\n\n**New Scythe Melee: Harmony**\n\nHarmony triumphs over hate. Heavy Attacks condense Status Effect damage into a single instance. Heavy Attack kills empower allies with increased Status Duration. \n\n**Unique Trait - Harmonic Resonance**\n\nHeavy Attacks condense all Status Effects that deal damage over time into a single instance. Heavy Attack kills activate Harmonic Resonance, a buff that increases Status Duration by 30% for allies.\n\n**How to Acquire Harmony:**\n\nAcquire the Harmony Blueprint from the new Ascension game mode, or obtain the Blueprint in exchange for Vestigial Motes from Ordis in the Larunda Relay on Mercury. It can also be purchased fully built via the in-game Market for Platinum.\n\n**Jade’s Ensemble Buff**\n\nWhen all three weapons are used together they have a unique buff! Evensong, Cantare, and Harmony sing together. Their buff effects are doubled.\n\nShare your [Feedback](https://forums.warframe.com/forum/1974-ascension-game-mode-feedback/) & [Bug Reports](https://forums.warframe.com/forum/1979-jade-new-weapons-bugs/) on the new Weapons in the dedicated Feedback Subforum. \n\n[b1d7659a31e0763af00b60401b156412.jpg](https://www-static.warframe.com/uploads/b1d7659a31e0763af00b60401b156412.jpg)\n\n**NEW GAME MODE: ASCENSION**\n\nThe Stalker’s stronghold is under intensive assault from marauding Corpus forces, but what they’re after must remain safe. You’ll need to initiate an emergency evacuation before embarking on a grueling ascent through enemy-infested elevator shafts to the Extraction waiting for you above.\n\nVisit the new **Brutus node on Uranus** after completing the Jade Shadows Quest to assist Ordis in gathering Vestigial Motes! This new non-endless mission unfurls in three stages:\n\n**Stage 1 - Mote Collection**\n\nThe Corpus have set up **Mote Collectors** to extract energy from the air - Ordis has taken them over, so you must defend them while they complete extraction!\n\n**Stage 2 - Ascension**\n\nOnce you have extracted the Motes, they must be transported in their **Extraction Capsule** top-side! To do so, power the elevator using **Ionic Capsules** dotted throughout the map, or dropped from enemies. As you approach them, they’ll be marked with a small green waypoint! Keep your eyes peeled for extra-glowy **Boosted Ionic Capsules** that offer an additional power and speed boost. Once picked up, use the Alternative Fire to throw them at the Extraction Capsule to power your ascent!\n\n  \nPlayers can keep up with the ever-rising gameplay with increased jump height (thanks to a special Air Support deployed by Ordis), and via jump pads littered on various platforms. Should you take an unfortunate fall to the bottom of the map, use the jump pad at the bottom of the elevator to catch up to its height. \n\n**Bonus Objective:**\n\nAlong with the Ionic Capsules, players may come across **Sister Beacons** hidden throughout the map, identified by the soft pinging noise they emanate upon approach. Collect three of these to summon a Sister of Parvos, who will spawn once you reach the top of the Elevator shaft. Defeating the Sister will reward you with 5-7 Vestigial Motes and a chance at a new Arcane, listed below (8-10 Motes and a guaranteed Arcane on Steel Path). Sisters of Parvos will also drop Steel Essence in Steel Path Ascension missions.\n\n**Stage 3 - Extraction**\n\nOnce you’ve made it to the top, escort the Extraction Capsule safely to extraction and defend it from Corpus foes along the way! Should enemies manage to deplete the health of the Extraction Capsule, its progress will stop briefly and the health will regenerate, at which point it will continue on its path once more. \n\n**Rewards**\n\nSuccessfully completing an Ascension mission will award players with 11-13 Vestigial Motes (16-18 on Steel Path), as well as a reward from the mission drop table, including:\n\n  * Jade’s Component Blueprints\n  * Endo\n  * Relics\n  * Harmony Blueprint\n  * Cantare Blueprint\n  * Evensong Blueprint \n\n\n\nFor a full overview of the Ascension Drop Tables, please review our[ Drop Tables site](https://www.warframe.com/droptables). \n\n**Releasing Vestigial Motes**\n\nVisit Ordis in the Larunda Relay on Mercury during Operation: Belly of the Beast to exchange Vestigial Motes for various wares, including: \n\n  * Jade Main and Component Blueprints\n  * Harmony Blueprint\n  * Cantare Blueprint\n  * Evensong Blueprint\n  * New Arcanes (read on below to learn more!) \n\n\n\nOnce Operation: Belly of the Beast ends, Ordis will relocate to the Drifter Camp and offer his wares there. He finally got a job, yipee!\n\n**New Arcanes**\n\nEnhance your Arsenal with these new Arcanes! Acquire these new enhancements from Sisters of Parvos spawned in the new Ascension game mode, or exchange them for Vestigial Motes via Ordis in the Larunda Relay.\n\nStats below are shown at max rank. \n\n**Arcane Ice Storm (Warframe)**\n\nOn Enemy Frozen: Gain +2% Ability Strength and +2% Ability Duration for 15s. Stacks up to 20x.\n\n**Arcane Battery (Warframe)**\n\nGains 0.30 maximum Energy per Armor point, up to 1000 Energy. \n\n**Secondary Surge (Secondary)**\n\nOn Ability Cast: Next shot gains a Damage Multiplier for every 200 current Energy, up to x8. \n\n**Secondary Fortifier (Secondary)**\n\nGain 1 Overguard for every 100 Damage dealt to an enemy’s Overguard. Deals x8 Extra Damage to Overguard.\n\n**Melee Afflictions (Melee)**\n\nEnemies affected by Status Effects gain 6 additional stacks when they're knocked down or flung by melee attacks.\n\n  \n\n\n**New Semi-Auto Fire Mods**\n\nThese new Mods can be equipped on Semi-Auto Fire weapons only, and prevent their firing speed from being modified once equipped. \n\nTarget Juno Sapper Moa enemies in Ascension missions to earn these Mods!\n\nYou can identify which weapons are eligible via the Arsenal if their Trigger type is “SEMI”. \n\n**Semi-Rifle Cannonade**\n\n+240% Damage  \n+1.5 Punch Through\n\n**Semi-Pistol Cannonade**\n\n+300% Damage  \n+1.5 Punch Through\n\n**Shotgun Cannonade**\n\n+240% Damage  \n+1.5 Punch Through\n\n**New Status Damage Mods**\n\nThis mechanic was originally introduced with Dante, and we have dedicated a whole series of Dual-Stat Mods to it! Increasing your Status Damage stat increases the damage per tick for Statuses that do damage over time (specifically Slash, Heat, Electricity, Toxin, Blast, and Gas). \n\nEarn these Mods from new Juno Sapper Moa enemies found in Ascension missions!\n\n**Rifle Elementalist**\n\n+90% Status Damage\n\n+0.6 Punch Through\n\n**Melee Elementalist**\n\n+90% Status Damage\n\n+60% Heavy Attack Wind Up Speed \n\n**Pistol Elementalist**\n\n+90% Status Damage\n\n+60% Reload Speed\n\n**Shotgun Elementalist**\n\n+90% Status Damage  \n+60% Magazine Capacity\n\nShare your [Feedback](https://forums.warframe.com/forum/1974-ascension-game-mode-feedback/) & [Bug Reports](https://forums.warframe.com/forum/1981-ascension-game-mode-bugs/) on the new Ascension game mode in the dedicated linked Feedback \n\nSubforums. \n\n[7d345af2728b287a9a3e05514132c58c.jpg](https://www-static.warframe.com/uploads/7d345af2728b287a9a3e05514132c58c.jpg)\n\n**NEW EXIMUS UNIT: JADE LIGHT EXIMUS**\n\nIntroducing a new Eximus Type: Jade Light Eximus.\n\n  \nPlayers will find them in all missions where Eximus spawn, where they will face the threat of Jade Light on the battlefield.\n\nThese new foes will target up to 2 players, and will summon a beam of Jade Light that follows them and deals increasing damage the longer you are in contact with it. Players can either avoid the Jade Light until it dissipates (~8 seconds) or attempt to destroy the beam by shooting at the top of it — or kill the Eximus unit itself, of course. Once a Jade Light is summoned, the Eximus' Ability will go on a short cooldown before another can be cast.\n\n[b4d5e5e6f0e8a4d87fea68e95e7e7844_1600x90](https://www-static.warframe.com/uploads/thumbnails/b4d5e5e6f0e8a4d87fea68e95e7e7844_1600x900.png)\n\n**OPERATION: BELLY OF THE BEAST**\n\nJUNE 18TH @ 11:30 AM ET - JULY 18TH @ 11:30 AM ET\n\nParvos Granum is attempting to harvest Volatile Motes to make his own Jade Light Eximus army, and only you and Ordis stand in his way. With Ordis’ help, you can commandeer the Mote Collectors and put an end to Parvos’ plans. \n\nVenture to a secretive location (discovered in the Jade Shadows Quest) at **Brutus on Uranus** to preserve Jade’s legacy! Fight against the Corpus to earn new and returning rewards from previous Operations.\n\n**What You Need To Know**\n\nOperation: Belly of the Beast requires you to step into this shrouded location - only those who have completed the **Jade Shadows Quest** are permitted to do so. \n\nAfter finishing the Jade Shadows Quest, players will have access to a new node on Uranus: Brutus. Here they can access the new Ascension game mode and access Operation-specific missions. Successfully foiling Parvos’ efforts will reward you with special Volatile Motes, which can be exchanged for Operation rewards.\n\n**What You Need To Do**\n\nWhile Operation: Belly of the Beast is live, players will have access to special nodes that allow them to take on Parvo’s forces. In these missions, all Eximus units you face will be empowered by Jade Light - meaning the only Eximus units that will spawn are Jade Light Eximus. You can help Ordis in his mission to stop Parvos in one of three ways:\n\n  * Operation Variant of Brutus (Uranus)\n  * Operation Alerts\n  * Stalker Joins the Fray\n\n\n\n**Operation Variant of Brutus (Uranus)**\n\nIn traditional Operation style, the new Brutus node on Uranus has its own Operation variant. Play Ascension as you know it, but with all Eximus units spawning in as Jade Light Eximus. On top of the regular Ascension rewards, each Operation mission will award players with 4-6 **Volatile Motes** (8-10 on Steel Path), which can be traded for rewards via Ordis in the Larunda Relay.\n\nSummoning a Sister of Parvos will also earn players an extra 1-3 Volatile Motes (2-4 on Steel Path), as well as her usual drops.\n\n  \n\n\n**Operation Alerts**\n\nIn addition to the Brutus node on Uranus, timed Operation Alerts will appear across the solar system that will also reward players with 10 Volatile Motes (15 on Steel Path). These non-Ascension missions will have normal gameplay, but will feature increased Eximus Spawns, and will only feature Jade Light type Eximus. Look for these time-limited Alerts appearing every half hour or so as an alternative method to earning Volatile Motes. \n\n**Stalker Joins the Fray**\n\nVisiting Ordis in the Larunda Relay not only allows you to earn Operation Rewards, but also lets you call on an old foe to assist in your efforts. In speaking to Ordis, selecting the “A Shared Purpose?” option will allow you to join another Squad’s mission as Stalker. Doing so will reward you with the usual mission rewards, but at risk of losing them all should you be downed.\n\n**Rewards**\n\nNo Operation is complete without rewards, and Ordis has collected quite a few offerings for you to choose from. Ordis can be found in the Larunda Relay in the Navigation Room, where he will trade Volatile Motes for rewards.\n\n**Community Progress**\n\nBelly of the Beast comes with a Community Progress segment, tracking the total Volatile Motes collected by players. As the total number of Volatile Motes collected ticks up, progress is made towards a new variant of the Jade Light Ephemera, unlocking it for purchase for all players at Ordis in the Larunda Relay.\n\n**Commit Volatile Motes**\n\nOrdis is carrying a vast array of items in exchange for Volatile Motes:\n\n  * Low Guardian Chest Plate\n  * Belly of the Beast Sigil\n  * Aspirus Ephemera (Once overall Operation progress has reached 33%)\n  * Aspirus Emergent Ephemera (Once overall Operation progress has reached 66%)\n  * Aspirus Apex Ephemera (Once overall Operation progress has reached 90%)\n  * Krios Signa\n  * Prominence Wisp Totem\n  * Fluctus Rahk Skin\n  * Ceti Lacera Blueprint\n  * Basmu Blueprint\n  * Stance Forma Blueprint\n  * The Ballroom Simulacrum\n  * Arcanes:\n    * Arcane Tempo\n    * Arcane Consequence\n    * Arcane Momentum\n    * Arcane Ice\n    * Arcane Nullifier\n    * Arcane Warmth\n    * Arcane Resistance\n    * Arcane Healing\n    * Arcane Deflection\n    * Arcane Victory\n    * Arcane Strike\n    * Arcane Awakening\n    * Arcane Guardian\n    * Arcane Phantasm\n    * Arcane Eruption\n    * Arcane Agility\n    * Arcane Acceleration\n    * Arcane Trickery\n    * Arcane Velocity\n    * Arcane Precision\n    * Arcane Pulse\n    * Arcane Ultimatum\n    * Arcane Aegis\n    * Arcane Arachne\n    * Arcane Rage\n    * Arcane Fury\n    * Arcane Avenger\n\n\n\n**Clan Contributions**\n\nOrdis is also carrying additional stock for Tenno who are in a Clan:\n\n  * Enlightened Hate Skin\n  * Gilded Clan Sigil\n  * Glyphed Clan Sigil\n  * Phased Clan Sigil\n  * Belly of the Beast Emblem\n  * Arcanes:\n    * Arcane Energize\n    * Arcane Grace\n    * Arcane Barrier\n\n\n\nAll Arcanes purchased from the “Commit Volatile Motes” and “Clan Contributions” stores will be limited to 42 (2 max rank Arcanes) per Arcane per player to prevent Operation burnout. \n\n**Clan Trophies**\n\nVolatile Motes collected by Clan members throughout the Operation will earn your Clan Trophies! \n\nLike previous Operations, Clan Trophies are available in Terracotta, Bronze, Silver, and Gold. The amount of Volatile Motes required to unlock each tier are as follows:\n\nClan Tier  |  Terracotta  |  Bronze  |  Silver  |  Gold   \n---|---|---|---|---  \nGhost  |  15  |  30  |  45  |  60   \nShadow  |  45  |  90  |  135  |  180   \nStorm  |  150  |  300  |  450  |  600   \nMountain  |  450  |  900  |  1350  |  1800   \nMoon  |  1500  |  3000  |  4500  |  6000   \n  \nPlayers can view their Clan’s progress in the “Event” tab in Navigation.\n\nShare your [Feedback](https://forums.warframe.com/forum/1987-operation-belly-of-the-beast-feedback/) & [Bug Reports](https://forums.warframe.com/forum/1988-operation-belly-of-the-beast-bugs/) on Operation: Belly Of The Beast in the dedicated Feedback Subforum. \n\n**NEW WARFRAME AUGMENT MODS**\n\nNew Augment Mods for Dagath, Protea, Sevagoth and Qorvex are available to acquire from the Syndicates! \n\nStats below are all shown at max rank. \n\n[3b82a0375e8b4cc989cc5841a2654d5f.jpg](https://www-static.warframe.com/uploads/3b82a0375e8b4cc989cc5841a2654d5f.jpg)\n\n**Dagath Grave Spirit Augment: Spectral Spirit**\n\nImmediately assume Grave Spirit’s Spectral Form. 100% chance for weapons and abilities to apply Doom. Kills outside of Spectral Form decrease its cooldown by 1s.\n\nAvailable in the Red Veil and The Perrin Sequence’s Offerings. \n\n  \n\n\n**Protea Blaze Artillery Augment: Temporal Artillery**\n\nWhen Temporal Anchor is activated, one existing Artillery unit will attach to Protea, halting its duration countdown. Max combo count is 20x.\n\nAvailable in the Arbiters Of Hexis and The Perrin Sequence’s Offerings. \n\n  \n\n\n**Sevagoth Sow Augment: Dark Propagation**\n\nEnemies killed while inflicted with Sow spread its effect in a 15m radius. Shadow's Death Harvest also inflicts Sow.\n\nAvailable in the Cephalon Suda and The Perrin Sequence’s Offerings. \n\n**Sevagoth’s Sow Change:**\n\n  * Sow can now be recast! \n    * Previously, Sow could not be recast if at least one enemy was affected by it. This has long been a feedback point from players requesting we allow it to be recast regardless of this and with the introduction of the new Augment Mod which will also benefit from this, it is now Sow! (heh). \n\n\n\n  \n\n\n**Qorvex Containment Wall Augment: Wrecking Wall**\n\nStrip 50% of armor and shields from struck enemies. Hitting 5 or more enemies will restart the duration of any Chyrinka Pillars and empower them.\n\nAvailable in the Cephalon Suda and Steel Meridian’s Offerings. \n\nShare your [Feedback](https://forums.warframe.com/forum/1973-new-warframe-augments-feedback/) & [Bug Reports](https://forums.warframe.com/forum/1980-new-warframe-augments-bugs/) on the new Augment Mods in the dedicated Feedback Subforum. \n\n**TENNOGEN SHADOWS**\n\nA brand new batch of creations from talented community artists arrive with Jade Shadows! TennoGen Shadows includes original takes on Equinox and Lavos, as well as Armor and Operator Accessories to expand your Arsenal. \n\n[68860e68e92a7462cce244a0aa2189e4.jpg](https://www-static.warframe.com/uploads/68860e68e92a7462cce244a0aa2189e4.jpg)\n\n**Equinox Omni Helmet**\n\nA helmet for the Equinox Warframe, designed by Rekkou.\n\n[6a76d9dd856191631e665bdef7ae3330.jpg](https://www-static.warframe.com/uploads/6a76d9dd856191631e665bdef7ae3330.jpg)\n\n**Lavos Yersin Skin**\n\nA unique skin for the Lavos Warframe, designed by Lubox.\n\n[161496c6764315bc311b79f13687a728.jpg](https://www-static.warframe.com/uploads/161496c6764315bc311b79f13687a728.jpg)\n\n**Corachrix Shoulder Armor**\n\nA unique shoulder armor for your Warframe, designed by LostEpoch & DasterCreations.\n\n[2cca1fd5c0fc281cbcbe57c4bb331ade.jpg](https://www-static.warframe.com/uploads/2cca1fd5c0fc281cbcbe57c4bb331ade.jpg)\n\n**Spicularis Oculus**\n\nA unique Oculus, designed by VentralHound.\n\n**Spicularis Mandible Mask**\n\nA unique Mask, designed by VentralHound.\n\n[76d22dfbf0c09f0a304fc6fcbbeaf440.jpg](https://www-static.warframe.com/uploads/76d22dfbf0c09f0a304fc6fcbbeaf440.jpg)\n\n**Kuva Pump Chest Plate**\n\nA unique chest armor for your Warframe, designed by CERF. The Kuva Pump Chest Armor is available only on the PC version of Warframe. \n\n  \n\n\n**NEW IN-GAME MARKET ADDITIONS**\n\n**In-game Market Change:** When viewing a bundle for Platinum that has a similar, real world currency Pack, the related pack will now appear in that bundle’s Market screen under the header “There is a similar bundle available” (and vice versa for the real money currency pack). Players can view the similar bundle’s contents and price on-hover, or select it to go to its Market screen.\n\n  * For example, the Dante Collection screen now has an option to preview/view the Dante Chronicles Pack and vice versa. This also applies to the new Jade Market bundles.   \n[dc49c12a22c76b750b4d0462d099e16c.jpg](https://www-static.warframe.com/uploads/dc49c12a22c76b750b4d0462d099e16c.jpg)  \n[254c15d19c78ca0d9e0899965da73109.jpg](https://www-static.warframe.com/uploads/254c15d19c78ca0d9e0899965da73109.jpg)\n  * The purpose of this change is to increase visibility of the purchase options that are available to players.\n\n\n\n**Jade Collection**\n\nLife and death meet in Jade. Her collection includes (all of the items listed can also be purchased individually): \n\n**Jade Warframe**\n\nBecome enraptured by the song of devastation. Through her, the Jade Light can be a source of destruction or a source of support.\n\n[51ac313c18dc1573e0d84537c8fe4305.jpg](https://www-static.warframe.com/uploads/51ac313c18dc1573e0d84537c8fe4305.jpg)\n\n**Jade Aureolt Helmet**\n\nAffirm Jade’s sacred nature.\n\nAs with all newly released Alt Helmets, its Blueprint will eventually be added to the Nightwave Cred Store in the future. \n\n[62c4ca234f021511d53a43cd2d75bd2a.jpg](https://www-static.warframe.com/uploads/62c4ca234f021511d53a43cd2d75bd2a.jpg)\n\n**Motetique Signa**\n\nMuch as music enriches the atmosphere, the Motetique Signa enhances your appearance.\n\n**Evensong Bow Primary**\n\nCounter the dread of battle with a song of praise. Fully drawn arrows fired by Evensong impale enemies and empower ally weapons with Multishot.\n\n**Cantare Thrown Secondary**\n\nIn moments of despair, let the battle resonate with song. Canatare’s blades lodge into the battlefield and return upon reload. When returning blades strike many enemies, Cantare empowers allies with increased Magazine Capacity.\n\n**Harmony Scythe Melee**\n\nHarmony triumphs over hate. Its Heavy Attacks instantly kill enemies that are open to Mercy kills. Defeat hordes in this manner to empower allies with extended Melee Range.\n\n**Jade Ophanim Decoration**\n\nBe not afraid with Jade’s gaze in your Orbiter. \n\n  * **Gift Bonus:** Gift the Jade Collection to another player and receive the Jade Ophanim Decoration as a Gifting Bonus in return. \n\n\n\n  \n\n\n[08827c7833b8623739bc65306e26f9ef.jpg](https://www-static.warframe.com/uploads/08827c7833b8623739bc65306e26f9ef.jpg)\n\n**Jade Chorus Pack**\n\nPierce through suffocating darkness by adding the radiant songstress Warframe, Jade, along with her signature Customizations to your Arsenal! \n\n**Note: As mentioned above, this real-world currency pack is the real world currency “sister” pack to the Jade Collection and is available to view from that collection’s preview screen.**\n\n**This pack features everything in the Jade Collection, the following items AND 275 Platinum** (also available for individual purchase in the in-game Market with the exception of those marked with *): \n\n[ac6163a3e1a35852c25eb72615d885c5.jpg](https://www-static.warframe.com/uploads/ac6163a3e1a35852c25eb72615d885c5.jpg)\n\n**Terror Landing Craft Skin**\n\nTransform your Landing Craft into a perfect match for Stalker’s. \n\n**Light & Shadow Color Palette**\n\nInvoke the play of light and dark with this selection of colors. \n\n**Jade Ophanim Sigil**\n\nA sigil depicting Jade’s Ophanim gaze. \n\nJade In Action Glyph* (exclusive to the Jade Chorus Pack) \n\nA glyph for your profile. \n\n**Jade’s Ensemble**\n\nArm yourself with Jade’s entire signature weapon collection. Includes the Evensong Bow, Cantare Secondary and Harmony Scythe. \n\n  \n\n\n[540293f90ab40623cd1bd5175f3d80dc.jpg](https://www-static.warframe.com/uploads/540293f90ab40623cd1bd5175f3d80dc.jpg)\n\n**Yareli Pandea Skin Bundle**\n\nStrike forth from the watery depths with the power of Yareli Pandea. Her collection includes (all of the items listed can also be purchased individually): \n\n**Yareli & Merulina Pandea Skin **\n\nWith the fall of the Orokin, Yareli Pandea drifted into the ocean’s depths where Hunhow rediscovered her. Now, she ascends to fight once more. Call upon Yareli Pandea’s faithful companion with the**** Merulina Pandea Skin (included with the purchase of the Yareli Pandea Skin and Collection). \n\n**Nidoblast Kompressa Skin**\n\nCapture your prey with Yareli Pandea’s signature Kompressa skin.\n\n**Rubra Sugatra**\n\nGive your weapons a deep sea flourish with Yareli Pandea’s signature sugatra.\n\n**Merulina Pandea Domestik Drone**\n\nFight dirt and grime with this aquatic Domestik Drone inspired by Merulina Pandea.\n\n  * **Gift Bonus:** Gift the Yareli Pandea Skin Bundle to another player and receive the Merulina Pandea Domestik Drone as a Gifting Bonus in return. \n\n\n\n**Yareli Fixes:**\n\n  * Fixed falling off a platform in the Mastery Rank 13 test while riding Merulina resulting in broken physics for Yareli. \n  * Fixed Companions not gaining Affinity from player kills while riding Merulina or K-Drive. \n  * Fixed being unable to use Transference after switching to Operator while riding Merulina and dying as Operator. \n  * Fixed icons for available K-Drive races in an Open Landscape not appearing in the detailed map when riding Merulina. \n  * Fixed being able to still use the Operator Void Beam attack after completing The New War Quest while riding Merulina and a strange dead Excalibur spawning at the same time without a head. \n  * Fixed kills while on Merulina not counting towards Sanctuary Onslaught Efficiency. \n\n\n\n  \n\n\n[9ef874e5bdcdad53ea70eb1e0a22f603.jpg](https://www-static.warframe.com/uploads/9ef874e5bdcdad53ea70eb1e0a22f603.jpg)\n\n**RESISTANCES AND STATUS REWORK**\n\nAs discussed over the last two months, across both Devstreams 179 and 180, we’ve overhauled Warframe’s Health Types and Resistances alongside a select few Status Effects! \n\n**To help players revisit their builds following these changes, an inbox containing 3x Forma will be sent to all players today (June 18th) at 12pm ET today.**\n\n**New Health Types**\n\nPreviously, enemy resistances and vulnerabilities were split between 13 Health Types: \n\nGrineer  |  Cloned Flesh  |  Ferrite Armor  |  Alloy Armor  |  Machinery  | - | -  \n---|---|---|---|---|---|---  \nCorpus  |  Flesh  |  Shields  |  Proto-Shield  |  Robotic  |  Ferrite Armor  |  Alloy Armor   \nInfested  |  Infested  |  Infested Flesh  |  Fossilized  |  Infested Sinew  |  Ferrite Armor  | -  \nSentient  |  Flesh  |  Robotic  |  Ferrite Armor  |  Alloy Armor  |  Shields  | -  \nMurmur  |  Indifferent Facade  |  Ferrite Armor  |  Infested  |  Machinery  | - | -  \n  \nEach of these Health Types had unique interactions with the various Status Types: \n\nPhysical  |  Impact: Stagger  |  Puncture: Reduced Damage Output/+Crit Chance  |  Slash: Bleed  | - | - | -  \n---|---|---|---|---|---|---  \nIndividual Status  |  Cold: Slow/+Crit Damage  |  Electricity: Tesla Chain  |  Heat: Burn  |  Toxic: Poison  | - | -  \nCombined Status  |  Blast (Heat + Cold): Inaccuracy  |  Corrosive (Toxic + Electricity): Corrosion  |  Gas (Heat + Toxic): Gas Cloud  |  Magnetic (Cold + Electricity): Shield Disruption  |  Radiation (Heat + Electricity): Friendly Fire  |  Viral (Cold + Toxic): Amplified Health Damage   \n  \nOptimizing builds to make use of this system required players to memorize health types per enemy (not just per Faction) and their resistances/vulnerabilities. Our goal is to reduce the friction necessary to engage in optimal play, so we’ve:\n\na) Simplified the number of Health Types\n\nb) Redesigned how Faction Resistances work \n\nc) Increased the visibility of the new vulnerabilities in normal gameplay flow \n\nInstead of having 13 Health Types, we have simplified them into 4:  \n\n\n  * Health\n  * Armor\n  * Shields\n  * Overguard\n\n\n\nNow, these Health Types only serve to differentiate between Status Effects and Abilities that affect them, such as Magnetic hindering Shields, Corrosive stripping Armor, or Viral amplifying Health damage.\n\nWe’ve changed the system so that Resistances and Vulnerabilities are **no longer tied to the previous Health Types**. Resistances and Vulnerabilities are now based upon the Faction a player is engaging with. \n\n**Star Chart “Suggested Damage”**\n\nVulnerabilities are now listed in The Star Chart mission nodes! Here, we aim to recommend the appropriate per-Faction Resistances, which will then universally affect that specific group.\n\n**The Star Chart** now shows Faction Resistances per node. Aligned with the present Faction, **Vulnerabilities and Resistances** will be listed to communicate the “Suggested Damage” options best used against any specific Faction or location.\n\n[66f1be34ab89ea74fe28f2b721efe055.jpg](https://www-static.warframe.com/uploads/66f1be34ab89ea74fe28f2b721efe055.jpg)\n\nSub-Factions will also have different Vulnerabilities and Resistances from their primary counterpart. The three main Sub-Factions are:\n\n  * Kuva Grineer\n  * Corpus Amalgam\n  * Deimos Infested\n\n\n\nViewing Faction Vulnerabilities and Resistances now also depends on where the player is within Warframe’s Story. The Factions (and Sub-Factions) will be unlocked via:\n\nFactions:\n\n  * Grineer: Unlocked by **default.**\n  * Corpus: Unlocked by **default.**\n  * Infested: Unlocked by **default.**\n  * Orokin: Unlocked after **Phobos Junction.**\n  * Sentient: Unlocked after **The Second Dream Quest** completion.\n  * Narmer: Unlocked after **The New War Quest** completion.\n  * Zariman: Unlocked after **Angels of the Zariman Quest** completion.\n  * Murmur: Unlocked after **Whispers in the Walls** **Quest** completion.\n\n\n\nSub-Factions:\n\n  * Kuva Grineer: Unlocked after **The War Within Ques** t completion.\n  * Corpus Amalgam: Unlocked after **Jupiter Junction.**\n  * Deimos Infested: Unlocked after **Heart of Deimos Quest** completion.\n\n\n\n**Simplified Faction Resistances**\n\nWith the removal of Resistances/Vulnerabilities being tied to Health Type, they will now be Faction-specific.\n\nDefault Faction Vulnerabilities and Resistances:\n\n  * Grineer: Vulnerable to **Impact** and **Corrosive**\n  * Corpus: Vulnerable to **Puncture** and **Magnetic**\n  * Infested: Vulnerable to **Slash** and **Heat**\n\n\n\nFactions by Quest Vulnerabilities and Resistances:\n\n  * Orokin: \n    * Vulnerable to **Puncture** and **Viral**\n    * Resistant**** to**Radiation**\n  * Sentient: \n    * Vulnerable to **Cold** and **Radiation**\n    * Resistant**** to**Corrosive**\n  * Narmer:****\n    * Vulnerable to **Slash** and **Toxin**\n    * Resistant**** to**Magnetic**.\n  * Zariman: Vulnerable to **Void**\n  * The Murmur: \n    * Vulnerable to **Electric** and **Radiation**\n    * Resistant to**Viral**\n      * Rogue Necramechs also fall under these Vulnerabilities and Resistances.\n\n\n\nSub-Faction Vulnerabilities and Resistances:\n\n  * Kuva Grineer: \n    * Vulnerable to **Impact** and **Corrosive**\n    * Resistant**** to**Heat**\n  * Corpus Amalgam:****\n    * Vulnerable to **Electric** and **Magnetic**\n    * Resistant**** to**Blast**\n  * Deimos Infested:****\n    * Vulnerable to **Blast** and**Gas**\n    * Resistant**** to**Viral**\n\n\n\nWith these Resistance and Vulnerability changes, we’ve made a notable decision to make **Impact** deadlier towards the **Grineer** , while making **Puncture** deadlier towards the **Corpus**. This is a departure from the previous system, however, we believe that these two Statuses are more suited for these specific Factions.",
        "num_comments": 157,
        "comments": [
            ">Stalker Joins the Fray\n\n>Visiting Ordis in the Larunda Relay not only allows you to earn Operation Rewards, but also lets you call on an old foe to assist in your efforts. In speaking to Ordis, selecting the “A Shared Purpose?” option will allow you to join another Squad’s mission as Stalker. Doing so will reward you with the usual mission rewards, but at risk of losing them all should you be downed.\n\nThis seems like we're joining as allies right? Would be fun to join as an enemy, but could probably lead to griefing and Souls style sweatiness.",
            "* The Heat damage per second from ring of fire can now trigger Heat Status Effects\n\nPablo heard and cooked\n\n* Players often hop into Operator/Drifter mode to traverse gaps, but doing so over a void would reset your Warframe once they hit the teleport volume. If you ever experienced a fade-to-black while Void Slinging over a void, this was what caused it! Now this will no longer happen, provided you are in Transference when your Warframe falls into the teleport volume.\n* Kuva and Tenet weapons with 58% Elemental Bonus or above will now automatically round that value up to 60%.\n\nluv u DE",
            ">We’ve improved enemy spawn logic in Excavation missions to decrease the wait time between completing Excavators.\nThis addresses the player reported issue that it often would take far too long for enemies to spawn when moving from one Excavator to another.\n\nAFTER TEN THOUSAND YEARS I'M FREE",
            "Since**Impact Status Effects** enables **Mercy** actions, we found that it wasn’t all too effective against **Corpus** due to their lower Health counts compared to their **Shields** , while **Mercy** killing **Grineer** is more accessible due to their innate tankiness. The **Corpus** can deliver incredibly high amounts of raw damage, allowing for **Puncture** to naturally play effectively into limiting their damage potential.\n\n**Armor Adjustments**\n\nImportant Note: We have not changed player Armor. This only applies to enemy Armor!\n\nEnemy Armor scaling in its previous current iteration meant that Armor Stripping was almost an all-or-nothing game, especially at higher levels. This resulted in players focusing on Armor Stripping as a way to tackle Grineer at higher difficulty content. Our goal is to reduce some of the extreme damage reduction offered by Armor at high levels, and make partial Armor Stripping more feasible. \n\nTo do so, we are making the following changes: \n\n  * Armor has a maximum cap of 2700 Armor (90% Damage Reduction).\n  * Armor has a minimum cap of 200 Armor.\n  * Steel Path no longer increases Armor values.\n  * Grineer enemies have increased Health scaling.\n  * Altered the formula for Armor Reduction to increase the effectiveness of Partial Armor Stripping.\n    * For reference, currently around 50% of Damage Resistance came from just 300 Armor, which is why complete Armor Strip felt so needed at higher levels.\n\n\n\nAdditionally, our goal was to make partial Armor Stripping a more valuable tool. By capping enemy Armor and adjusting how Armor is calculated, a partial Armor Strip will allow players to engage with high-level Grineer more easily - meaning max Corrosion stacks against an Armored enemy (reducing the Armor by 80%) will feel more impactful due to the new distribution of Damage Resistance from Armor values). \n\nFull Armor Strip is still valuable, but we wanted to even the playing field so players didn’t feel forced to build around it.\n\n**Shield Adjustments**\n\nImportant note: We have not changed player Shields. This only applies to enemy Shields!\n\nThe Grineer are tankier by design, but the Corpus try to make the difference through their Shields. However, Corpus Effective Hit Points (EHP) are significantly lower, making them often trivial to deal with by comparison. Our goal is to reduce the discrepancy between Grineer and Corpus time-to-kill (TTK) by making Corpus Shields a bit more challenging and interesting to fight. \n\n**Changes to Enemy Shields** :\n\n  * Shields now scale more quickly starting at level 80. This means stronger Shields than before as players fight higher-leveled Shielded enemies. \n  * Shield Recharge Delay is now unified across all enemy types.\n  * Shield Recharge Delay now has a minimum and maximum length depending on how much damage has been dealt to enemy Shields.\n    * The more damage dealt, the slower enemy Shields will begin recharging, so if you can’t outpace enemy Shields right away, you can chip their Recharge Delay down within a maximum and a minimum.\n      * For example, if enemy Shields break at any point, it automatically acts as if 200% damage (which becomes the maximum delay) has been inflicted on those Shields. However, if an enemy absorbs 99% damage (so 1% of their shields left), their accumulated damage taken now sets their Recharge Delay in the middle of their respective minimum and maximum delays. Should they Recharge and you deal another 99% damage to their Shields, they’ll have absorbed 198% damage, taking them to the maximum Recharge delay of what that scaled enemy can have.\n  * Shield Recharge Rate scales with enemy level, recharging at a faster rate for higher-leveled enemies.\n    * Shield Recharge Rate will also accelerate while Shields are actively Recharging.\n      * Shield Recharge Acceleration Rate’s base multiplier greatly increases after level 80, resulting in faster Recharge rates at higher levels.\n  * Steel Path Shields are now multiplied by 2.5x, in place of the previous 6.25x. Steel Path Shields were doubly-applying the multiplier unintentionally.\n\n\n\n**Effective Hit Points (EHP) Adjustments**\n\nEnemy stat scalings, such as Health and Shields, now grow faster as enemy level increases, in compensation of the loss in Enemy Armor and to make Shields more engaging to deal with. \n\n**Changes:**\n\n  * After Level 75-80, enemies receive increased stats, such as Health, at a slightly increased rate to prevent EHP stagnation.\n    * It’s important to note that the increase in Health scaling is not meant to match the EHP values seen by previous levels of Armor. \n\n\n\n**Status Effect Reworks**\n\n**Blast**\n\nOur goal with Blast is to invoke an immediate and on-death effect to emphasize explosions. \n\nNow, instead of enemy inaccuracy, you **detonate** your enemies! When dealing a Blast Status Effect to an enemy, the following will happen:\n\n**Blast Changes:**\n\n  * Upon inflicting a Blast Status Effect, individual stacks will cause a mini-explosion, and a max stack count of 10 will inflict combined damage in a 5m radius\n    * After 1.5 seconds, an individually incurred Blast Status Effect deals a percentage of base-inflicted damage per stack-explosion and over 100% of base-inflicted damage for a full (10 stack) explosion.\n  * Status Duration will increase the delay before the Status Effect applies and depletes.\n  * Removed the previous Status Effect of inaccuracy.\n\n\n\n**Cold**\n\nWith Cold, we want to fully realize the fantasy of slowing, freezing and shattering your enemies. The existing Cold Status mechanic of slowing enemies is unchanged, but now has a new mechanic upon applying Max Stacks - freezing your foes!\n\n  \n\n\n**Cold Changes:**\n\n  * Cold now has a maximum cap of 10 stacks (was 9).\n  * Applying 10 Cold stacks to a foe will make them **Frozen** for 3 seconds. Frozen enemies cannot move, will not recharge Shields, and receive double Critical Damage. After the Frozen effect wears off, 3 Cold stacks will remain. \n    * Bosses, such as Alad V or Kela De Thaym, will be unable to be Frozen since they cannot accumulate 10 Cold stacks.\n\n\n\n**Gas**\n\nGas often lacked effective readability, making it difficult to distinguish its presence from the enemy or yourself. We’ve introduced enhanced visuals so that when the Gas Status Effect is active, you’ll be able to recognize it more clearly.\n\n**Gas Changes:**\n\n  * Added VFX on top of the target affected by a Gas Cloud to clearly show an effect is active.\n    * In addition to current and new VFX, Gas VFX now also more clearly shows the radius of the Gas Damage-over-Time (DoT) effect around a given target to better understand its impact on surrounding enemies.\n      * If a player is inside the radius of the Gas DoT, the visuals are reduced for them to maintain visibility, similar to Frost’s Snow Globe. \n  * Gas VFX now has billowy volume to better present presence.\n  * Gas VFX now has additional floating particles around the smoke.\n\n\n\n**Magnetic**\n\nMagnetic has received a few buffs to increase its effectiveness against Shields and to hammer home the power fantasy of overloading enemy Shields.\n\n**Magnetic Changes:**\n\n  * Damage to Nullifier Bubbles has been increased\n    * Minimum Damage raised to 300 Damage per shot.\n    * Maximum Damage raised to 1200 Damage per shot.\n    * Additionally, we now show the minimum and maximum damage numbers against Nullifier Bubbles, with Magnetic attacks displaying the buffed damage shown above, while non-Magnetic sources will display the original, unbuffed damage.\n      * Known issue: Clients see the incorrectly unbuffed damage from Magnetic sources, which is strictly a UI/visual bug. Magnetic sources will continue to deal increased damage towards Nullifier Bubbles despite the incorrect numbers displayed. We will look to resolve this in a future Hotfix/Update. \n  * Reduced Shield Regeneration by a percentage per Magnetic stack against affected targets.\n  * Upon Shield/Overguard Breaking a target, the enemy will now be dealt Electric Status damage for a percentage of Max Shields/Overguard per Magnetic stack while also forcing an Electric Status Effect.\n  * Magnetic stacks on an enemy with Overguard now allow for bonus damage to Overguard, similar to how Magnetic affects Shields. \n\n\n\n**Warframe Changes**\n\nWith the above changes to Resistances and Status Effects, we took a look at Warframe abilities and made some adjustments to compliment the changes.  \n\n\n**Frost Rework**\n\nFrost, the definitively-themed Cold Warframe, has received a rework to better situate him for how Cold works with this Update! While Frost dealt icy attacks to his foes, the Freeze from his hit was not tied to Cold Status Effects. With the update to the Cold status, we have also amended his kit to properly use Cold Status Effects to Freeze enemies! \n\n**New passive - Fortifying Freeze:**\n\nCold Status Effects applied by Frost Abilities have their duration increased by 100%. Frost gains 50 Armor per enemy inflicted with Cold Status within 15m.\n\n**Freeze (1st Ability):**\n\n  * Adds required Cold stacks to freeze instead of simply freezing to both initial hit and AoE interactions.\n  * “Duration” is now known as “Freeze Duration,” indicating how long an affected target is Frozen.\n  * Doubled the baseline Area of Effect component of the projectiles.\n  * The Area-of-Effect aspect now scales with the Ability Range stat. The Area-of-Effect Radius is now present in the Ability description. \n\n\n\n**Ice Wave (2nd Ability):**\n\n  * “Duration” is now known as “Freeze Duration,” indicating how long an affected target is Frozen.\n  * **Ice Wave Impedance Augment Changes:**\n    * Leaves a frozen trail for 12s that adds a Cold Status Effect per second on enemies in contact with it.\n\n\n\n**Snow Globe (3rd Ability):**",
            "The new Semi-Auto mods that add punch through are game changing, especially for secondaries and shotguns. Modding punch through was extremely hard for those weapons due to a lack of options, and now they have a great one that combines with your damage.\n\nFor Primaries, it may still be worth taking Shred since it combined your fire rate mod and your punch through mod already, but many weapons still didn't want or need that fire rate.",
            "only took 10 years to be able to duplicate our mod loadouts lol",
            "- Changed Tenet Diplos to continuously burst fire at already marked targets while aiming and holding the firing input. \n\nThis little nugget in here is amazing, thank you. No longer will we be forced to hip-fire!\n\nWas the hold to fire semi-auto function coming with this update, or a later one? I can't remember.",
            "I'd like to take a moment to thank the sponsor of today's update, Jade: Shadows Legend",
            "Love, love, love the idea of having Sisters of Parvos as a kinda zone boss ala Void Angels. I hope we can have something similar for Liches in high level Grineer content someday. \n\n\nSomething to maybe test, can you subsume Doom and still apply it through Dagath's augment? Might honestly make her a little cracked if so.",
            "Aren't the new Status damage mods kinda huge for some builds? I don't remember seeing those in devstreams lmao",
            "Dagath augment in a syndicate I actually have let’s gooooooooo ima have some fun",
            "Jade Chorus pack in the patch notes says it is supposed to have everything in the Jade collection, but doesn't include the weapons\n\nEdit: Ok I bit the bullet to test, it doesn't include the weapons and it locks you out of buying the Jade Collection with plat because it's marked as \"owned\". Seems like an oversight I guess, will raise a ticket.",
            "Patiently waiting for kengineer to do the armor math for me on if I want 2 green shards or if I can do 1 tau green",
            "I’m a little saddened by status effects on enemies no longer matching your energy color, but everything. Else seems great!",
            "WE’RE GOING BACK TO THE EMO ORIGINS WITH THIS ONE‼️‼️🗣️🔥🔥 🖤🖤",
            "As an Exergis enthusiast this new Shotgun Elementalist mod has me kinda stimulated.\n\nFriendship with Ammo Stock ended.",
            "* Fixed chat window sometimes moving after joining a mission as Client. \n* Fixed loss of function when attempting to leave Submersible Archwing in the Grineer Sealab Tileset. \n\nThank the gods.... this was so annoying.",
            "Whelp, time to go back to maining Frost full time!",
            "> Fixed Mag’s Magnetize Ability not taking effect when casted onto a target ragdolled by her Pull Ability.\n\nOh my god finally. This has been bothering me since I got mag prime in October.",
            "The damage gain/loss from using the right damage type against the enemy faction is 50% (0.5x or 1.5x multiplier). This isn't by itself going to outpace viral's damage amp (as it shouldn't), but will greatly help builds that didn't want to or can't use it.",
            "> Pathos Clamps Rewarded From Undercroft Portals \n\nThis seemed like it'd be huge, but after trying it I'm disappointed.\n\nThe three portals only appear after you beat the Orowyrm, and each portal only gives 1 Pathos clamp.\n\nThe undercroft is where the bulk of the time spent in Duviri goes, as many of the game modes there involve waiting. 3 undercroft dives pretty much doubles the length of the run, for a measly 3 extra Pathos Clamps.\n\n--\n\nIt'd be quicker to just run the lone story twice.",
            "This is what my soul needed",
            "Holy shit something I haven’t seen anyone point out is the Tenet Diplos change, auto-locking machine pistols now",
            "Protea's blaze artillery is either bugged or shadow nerfed. The shit fires so slooooooow now.",
            "Buffs to parkour velocity! Amber shard users stay winning.",
            "Does the dual tox incarnon semi auto? What will happen in incarnon mode with that mod?",
            "I'm stuck at work but *so excited* to dig into the new quest and game mode and operation. \n\nSo many cool changes and additions. \n\nSo many QOL tidbits. \n\nViewing blueprints in the market will now display what syndicate you can pursue for it, what quest progress you need towards it, etc. That is HUGE and beneficial to new and vets alike. \n\nNot to mention, two new signas and an evolving ephemera for the operation!? And a 3rd new signa coming soon with Heirloom Ember!\n\nSo much mouthwatering stuff. I can't wait to get the new mods and arcanes from the new mode.\n\nThank you DE!\n\nYou all prove time and against you're worthy and deserve all the love and respect for you authentic dedication and work.",
            "I don’t see it mentioned but they’ve also changed the Necramech Grind. It no longer requires things unlocked at higher syndicate levels and mostly needs world resources now. That’s pretty huge. I have 3 friends who haven’t done New war yet since the grind for a mech was such a slog.",
            "Tenora prime got a fire rate nerf went from 12 to 5",
            "Extremely pleasant change this update: the shadow color set was removed from the \"What Stalker?\" weapon bundle on the market, making it available to purchase by anyone any time. Price also appears to have decreased.",
            "Voidrig recipe changes are gonna make me go insane. Was about to craft him after getting all the materials but right back to 0 progress",
            "> Doing so will reward you with the usual mission rewards, but at risk of losing them all should you be downed.  \n  \nAnd you would choose to do this... why?",
            "View in your timezone:  \n[today at 11:30 AM ET][0]  \n[11:30 AM ET - JULY 18TH ][1]  \n[June 18th at 12pm ET][2]  \n\n[0]: https://timee.io/20240618T1530?tl=Update%2036%3A%20Jade%20Shadows\n[1]: https://timee.io/20240718T1530?tl=Update%2036%3A%20Jade%20Shadows\n[2]: https://timee.io/20240618T1600?tl=Update%2036%3A%20Jade%20Shadows",
            "So are the auto fire options not in this update or did I miss something in the patch notes?",
            "Can you get jade's components while doing the belly of the beast version of ascension?",
            "Did the increased enemy spawn on console also ship with this?",
            "THANK FUCK THEY FINALLY PBR'ED THE STALKER WEAPONS. Literally the thing that hyped me the most.",
            "A side note: thank you DE for giving Ordis a few more afk lines. It's honestly such an innocuous thing but it goes a long way to making him feel like a part of the Tenno family rather than a background piece like he was for so many years.",
            ">*Belly* of the Beast\n\nYou sly dog DE",
            "The new eximus units remind me of haunted pirates. Maybe because i just started playing sea of thieves.",
            "Did they change archwing weapon launcher? I was in fortuna useing my larkspur and it doesn't have magazines anymore its purely recharge based and the old 5 minute cool down is gone now.",
            "7hours of grinding 0 parts of jade nor weapons",
            "I really wished Dagath's Augment turned it into an autocast toggle that either quickens or outright removes the casting animation. :(",
            "Does the operation version of Ascension drop Jade parts?",
            "anyone able to tell me why recaptcha or whatever the fuck its called is so fucking ass? i just want to log in to the forums man",
            "I might legit have to use the grace system to get all of jades parts, i've almost got 450 motes and not got a single part",
            "So Warframes can get pregnant after all",
            "More Tennogen for Lavos? 🎉\n\nHaven't gotten a chance to check it in game, but I do like that plague doctor mask",
            ">!Can the new Stalker still drop War blueprints? I've got a riven for it and I've been trying to get it to drop for a long time now.!<",
            "Well, you ruined the circuit. Alchemy is a disaster. I guarantee the stats on circuit play will show people quitting as soon as alchemy shows up.",
            "Time to see how Dante does later I suppose.",
            "I ain't reading allat.\n\n/s\n\nEdit: Adding an /s because text can only express so much.",
            "i dont like the armor changes. as i figured you can just power through level 200 enemies on SP circulus with the ignis wraith now. armor used to be a problem to solve, promoting intentional build design. now you can just put heat on a weapon and itll probably kill everything without any extra effort or build design on your part. \n\ngod save anyone from melee influence dagger argonak builds i saw numbers upwards of 1.6M just doing auto spam in SP circulus",
            "I think playing as Stalker was originally a pvp idea, but presumably was scrapped in favor of this.",
            "Moment of silence for our fellow Tenno who grinded out that last bit of missing % damage.",
            ">Players often hop into Operator/Drifter mode to traverse gaps, but doing so over a void would reset your Warframe once they hit the teleport volume. If you ever experienced a fade-to-black while Void Slinging over a void, this was what caused it! Now this will no longer happen, provided you are in Transference when your Warframe falls into the teleport volume.\n\nOh my GOD",
            "> The Heat damage per second from ring of fire can now trigger Heat Status Effects\n\n~~Wmber mains in shambles (eg. Me)~~ Nvm we good, they added it for Ember's 4th as well.",
            "\"The Heat damage per second from ring of fire can now trigger Heat Status Effects\"\n\nThis turns Ember extra toasty, its insane.",
            "That's the Bramma sorted for me, not that I use it much these days.",
            "FINALLY I CAN FARM THE THOUSANDS OF NECROTIC OR WHATEVER ITS CALLED. IVE BEEN PUTTING THAT ON HOLD FOREVER!",
            "* Applies a Cold Status Effect every 3 seconds to enemies inside the Globe.\n  * Updated “Slow” stat to “Cold Status/Second”.\n  * Instantly apply full Cold stacks **on cast** if an enemy is within **Snow Globe range.**\n  * No longer blocks player projectiles from the outside!\n  * Snow Globe now visually cracks as it takes damage.\n    * When the Snow Globe breaks, it’ll also explode and deal damage and 3 Cold stacks to enemies within its radius.\n  * **Chilling Globe Augment Changes:**\n    * Updated the Augment to add 10 Cold stacks if the condition is met (i.e., unify the freeze with the Cold Status Effects as we normally do now).\n\n\n\n**Avalanche (4th Ability):**\n\n  * Adds the required Cold stacks instead of simply freezing.\n  * It’s “Duration” stat is now “Freeze Duration,” indicating how long an affected target is Frozen.\n\n\n\n**Ember Changes**\n\nWe’ve made changes to the Heat-incarnate Warframe Ember to stoke the flames of her power and give her some more firepower. \n\n**Fireball (1st Ability):**\n\n  * Removed the hold to charge to get the maximum damage. The damage increase (500%) from the previous hold charge is now applied to the now default tap cast. \n  * Its AOE now has a 100% guaranteed Heat Status Effect. \n    * Previously, it only had a 50% chance to apply this effect. \n  * Increased radius from 2m to 3m.\n    * Previously, its max range with fully charged cast was 2.4m. So we’ve bumped it up to 3m for all casts. \n  * Added an “Immolation Meter” stat to inform of the amount of Heat Fireball generates for Immolation. \n\n\n\n**Immolation (2nd Ability):**\n\n  * Reduced the Energy Per Second cost when at max Heat from 10 to 4. \n    * We want to make it easier for players to maintain its Heat gauge at max. \n  * Added an “Immolation Meter” stat to inform of the amount of Heat that is passively generated by Immolation. \n\n\n\n**Fire Blast (3rd Ability):**\n\n  * Energy cost now scales based on the Immolation’s Heat gauge\n    * 75 Energy (at lowest) all the way down to 25 (at max). \n  * Fireblast’s Heat Damage and Armor reduction now affects bosses that are by default vulnerable to Armor stripping abilities (ex: Captain Vor), as well as Acolytes and Demolishers.\n    * Its knockdown effect will not affect those listed above that are CC immune. \n  * Improved hit detection so that enemies at varying heights in relation to you (above or below) are hit by Fire Blast. \n  * Added an “Immolation Meter” stat to inform of the decrease in Heat generation overtime. \n  * Added an “Immolation Meter on Cast” stat to inform of the % of Heat Fire Blast removed from Immolation when cast. \n  * **Augment Mod Changes:**\n    * **Healing Flame:** Now converts all over healing (gaining Health points while as max Health) into Overguard. \n      * Description now reads: “Each enemy hit heals by 25 to 50 depending on current Immolation level. With Ember, over healing grants you Overguard.”\n      * This only applies to Ember herself and not to Fire Blast on other Warframes via Helminth. \n    * **Purifying Flame:** Ember will now also benefit from the Status Effect cleansing and Status Immunity when hit by the ring of fire. ****\n\n\n\n**Inferno (4th Ability):**\n\n  * The Heat damage per second from ring of fire can now trigger Heat Status Effects. \n    * For a boost in its CC effect and to give it a more lasting effect on impacted enemies. \n  * Added an “Angle” stat to better inform of the on-screen LOS checks. \n  * Added an “Immolation Meter” stat to inform of the amount of Inferno generated for Immolation. \n\n\n\n**Other Ember Changes/Fixes:**\n\n  * Moved Ember’s Passive icon from the Buffs Bar to be above the Immolation Gauge.  \n[5955ca67d49876d2f6c32bac782d5c67.png](https://www-static.warframe.com/uploads/5955ca67d49876d2f6c32bac782d5c67.png)\n  * Fixed recasting Ember’s Fire Blast while another Fire Blast is active resulting in the original Fire Blast not armor stripping or interacting properly with the Healing Flame Augment.\n    * Also fixed recasting Fire Blast with a different Ability Strength than the original cast resulting in the first cast taking the Ability Strength of the second cast.\n  * Fixed Purifying Flame Blast UI Buff appearing to end earlier than expected. This was a UI-only issue and did not impact gameplay.\n  * Fixed Fireblast not showing its Altered stats in the Helminth screen. \n\n\n\n  \n\n\n**Gauss Thermal Sunder Changes**\n\nGauss’ Thermal Sunder has been updated to properly reflect the mechanics of Cold, as he is one of the few Warframes capable of fully Freezing targets with Thermal Sunder!\n\n  * Tapping Thermal Sunder**during Redline** will now apply 10 Cold stacks - resulting in the same full Freeze. Its duration scales with the duration of his Ability.\n  * Tapping Thermal Sunder will add 9 Cold stacks on the second tap if it hits a target already affected by a Cold Status to reach full Freeze.\n\n\n\n**Atlas Petrify Changes**\n\nAtlas’ Petrify interacts with Freezing and Resistance values. As such, he’s received a few changes to clarify and enhance the mechanics of his ability.\n\n  * All enemies caught within the cone are now instantly turned to stone. Petrified enemies have their Damage type modifiers increased by +50% (does not scale with Mods).\n    * Added a “Damage Vulnerability” stat to Petrify to communicate this mechanic. \n    * Petrifying Frozen enemies will retain the Frozen Status Effect, but the petrification will override the enemy visually.\n\n\n\n**Baruuk Reactive Storm Changes**\n\nWe’ve updated his “Serene Storm” Augment to properly adapt to the new Vulnerabilities, rather than the optimal Health Type as was before.\n\n  * Adjusted Baruuk’s Reactive Storm to utilize the new Vulnerabilities system rather than the Health Type system - Reactive Storm will behave the same way it did before, but we’re just ensuring it works properly with the new system!\n\n\n\n**Modular Companion Changes**\n\nModular Companions from Son are also now adjusted for the new Resistance system. Mutagens will be based upon Resistances instead of Health Types. \n\nPredasite  |  Vulpaphyla  |  Elemental Resistance  |  Physical Resistance   \n---|---|---|---  \nLeptosam  |  Adra  |  Heat  |  Puncture   \nChiten  |  Elsa  |  Electricity  |  Slash   \nArioli  |  Zarim  |  Cold  |  Impact   \nMonachod  |  Phijar  |  Toxin  |  Slash   \n  \n**Miscellaneous Changes**\n\n  * Codex Changes: \n    * Enemies now have their Resistances and Vulnerabilities more clearly labeled in their Codex entry by Faction. \n      * Previously, only the Damage Type icons were present and were labeled as green/red depending on whether it was a resistance or vulnerability. For a player who is unfamiliar with these icons, this was not entirely helpful. \n      * Now, these icons are partnered with their written name and are categorized under a Vulnerability/Resistance header. Additionally, combined elemental damage types have the damages that are used to create it in parentheses. \n    * Health values are now indicated in the Codex entry. \n  * Removed Armor Scaling from Eximus Units due to the Armor Cap implemented. \n    * With the cap, Armor Scaling is unreliable in increasing the difficulty of eliminating Eximus Units. To compensate, Eximus units have had their Health and Shield multipliers increased by 50%.\n  * Status Effects no longer inherit Energy Colors, so players can more easily identify when an enemy is affected by a Status Effect.\n  * Damage Resistances (from Mods such as Shock Absorbers) have been added as a secondary stat to the Armor Stat on-hover.\n    * Tau Resistance was already reflected on-hover for Armor Stats, now other damage resistances are given the same treatment. \n  * Tooltips for Status Effects in the Upgrade screen UI now include what they are “Effective Against” and its “Damage Efficacy”. \n  * Unified terminology for the following Status Effects throughout the game: \n    * “Bleed” is now “Slash Status Effect”\n    * “Ignite” is now “Heat Status Effect”\n    * “Confusion” is now “Radiation”\n    * “Disruption” is now “Magnetic”\n    * “Corrosion” is now “Corrosive” \n      * These Status Effects have long been using the above terms interchangeably to describe the same thing. So, in an effort to prevent confusion when interacting with these, we’ve updated all mentions to their proper term. We’ve also fixed inconsistent capitalization of Status Effects throughout the game for consistency. \n  * Zealoid Prelate will now cleanse himself of Status Effects during invulnerable periods to prevent Cold Status Effects unnecessarily slowing the fight.\n\n\n\nShare your [Feedback](https://forums.warframe.com/forum/1971-enemy-scaling-status-effect-rework-feedback/) & [Bug Reports](https://forums.warframe.com/forum/1977-enemy-scaling-status-effect-rework-bugs/) on the Enemy Scaling & Status Effect Rework in the dedicated Subforums. \n\n**DUVIRI ADDITIONS & CHANGES**\n\n**New Decrees**\n\nSourced from our incredible Design Council, a new set of Decrees now have a chance to appear in Duviri to bolster your efforts to escape Dominus Thrax’s vicious cycle. \n\nThe creative minds in the Design Council came back with more ideas than a Maw could eat up! The Dev team chose the following from the ideas pitched and made changes for balance purposes. \n\nStats shown below are indicative of each Rank of the Decree to its max stacks. \n\n[2a968f18c4cd008af2353f785d5d5500.jpg](https://www-static.warframe.com/uploads/2a968f18c4cd008af2353f785d5d5500.jpg)\n\n**Bountiful Harvest**\n\nDouble drops from crates and plants. \n\n**Paragrimm’s Wisdom**\n\nGain 3 Decree Rerolls. \n\n**Marauder’s Nerve**\n\nReduce incoming damage by 3% per Decree up to 75%.\n\n**Fault Finder**\n\nWeakpoint kills create a 10m field that deals 10/15/20% of the killing blow’s damage as Electricity Damage every second for 8 seconds. \n\n**Grim Armory**\n\nOn kill: 5/10/15% chance to refill the ammo for whatever weapon you have equipped. \n\n**Rain of Vitality**",
            "i'm really curious to see how this affects lex incarnon as well as latron incarnon. both already hit like a truck.",
            "Are they still doing the full auto mode for semi auto weapons? Or did I miss that part?",
            "I *can't wait* to try these changes out with the Dual Toxocyst.",
            "Kuva Hek is GREAT on this! It was sluggish with Critical Deceleration, but now it no longer has this issue, and gets that punch-through that it so desperately wants. It gives even more base damage than PPB with way less investment. It doesn't really benefit from +fire rate anyway, given its small magazine, so no fire rate modding is hardly a downside (I'd argue it's a buff, actually).\n\nIdk how this compares to faction mods (though Shotgun Cannonade makes it feel a LOT better to use for the above reasons), but at least I feel more justified in running Shotgun Vendetta over Merciless.",
            "Fully auto Magnus Prime with is gimmick buff sounds FUN",
            "It's cool that it negates critical decelartion fire rate decrease :).",
            "These mods seem only work on some weapons I can only equip it on the Zarr ",
            "OMG thank you for pointing that out!\n\nThere's a literal mountain of notes to go through and I'll use this one for sure!",
            "Apparently its on accessibility, can't check rn if its actually there.",
            "Comments say the semiauto thing is under accessibility.",
            "anytime theres a new source of damage that isnt additive its pretty big, especially for heat stacking builds etc",
            "They're worse than the racist mods because it won't double dip on the hit and the status, but they're absolutely going to take the place of those in casual play for slash builds.",
            "Have you purchased it? I also noticed that, went to the in game market as well as the platform store and neither of them say the Jade Collection stuff is included, I'd pick up the Chorus pack if it does but I don't want to be baited into spending money I don't have to",
            "If anyone has tried buying the Jade Chorus pack, a confirmation whether you get the weapons or not would be nice--could simply be a display mistake on the store page.",
            "Or if it's just not even worth it to use the green shards for that at all I guess",
            "You should notice a smaller difference between most vs full armour strip with the rework.\n\nAlso damage types no longer reduce armour and give  bonus damage (if applicable). Instead they just give a flat multiplier regardless if it is shields, armour or health.",
            "Ahh a fellow exergis lover? This has gotten me quite excited too 😅",
            "Back? I never left! This is a new dawn for Frost Mains!",
            "This has been a bug that's been in the game for at least a few years. I even put in a bug report on it. I'm so glad it's finally resolved (though I will still test it thoroughly to ensure that it has been).",
            "Omg, that's what's been preventing my 2!?!?!",
            ">The three portals only appear after you beat the Orowyrm, and each portal only gives 1 Pathos clamp.\n\nYou need at least 5 or 6 decrees for them to be enterable, did you not do any side objectives? Or maybe the logic changed with the patch, I didn't test it.",
            "Archon vitality doesn't seem to work for me anymore either.",
            "In my head it's for one of two reason. \n\n1, roleplay. Playing as the Stalker is something a lot of people want to do, and having him lose connection to the current mission upon down is how it works when he comes for you.\n\n2, it allows you to bypass the typical 4 player squad limit in missions. I doubt this is it, but it would be cool if it were possible via these secondary characters.",
            "New players might not have good enough builds for SP event mission.",
            "Stalker is powerful at a baseline level, and some people who may have strugglebus'd through The New War might not be able to survive in it on Steel Path.",
            "Its in the update, its under accessability. Not called auto fire. It was not mentioned in the update notes for some reason",
            "I can't see why not. It's the same map / mode regardless, and I don't recall hearing the drop tables being different for the Fragmented One mission during and after the op.",
            "Steel path is bugged. Only drops on normal currently. ",
            "Do we know if the status chance he receives against scanned enemies is a flat 50% percent or multiplicative?",
            "I did and its worth tbh, tons of good stuff they didnt mention in streams",
            "> armor used to be a problem to solve\n\nIt was a boring as hell problem to solve, shoving armor stripping subsumes onto every inferior frame that didn't have it by default or wasting two shard slots on green's. This was a binary option, you either had it and melted enemies, or didn't and their tankiness was absurd.\n\nFeel like the better response would have been give more reasonable access and variety to armor strip for a lot more frames and weapons but tbh that'd likely have just resulted in even more garbage augment mods and near useless arcanes. Armor was terrible design.",
            "Yea, I get that they are increasing grineer health scaling to compensate for the EHP reduction of armor no longer being multiplied by SP, but this seems like a huge nerf to SP difficulty.\n\nAlas I'll hold on to my doomerism for now because I won't be able to play the update for another 8 hours to see for myself.",
            "If I recall correctly (which I may not) way back when the devs would actually sometimes play as the Stalker and invade missions at random, so it wasn't always just an AI you were fighting.",
            "the friendly stalker mode is definitely a retooling of that old idea, you join in as a 5th player and it even marks allies as enemies (probably because tenno was going to be the enemy for a playable stalker)",
            "me holding my 57.9% Tonkor after seeing this",
            "Feels like a really small thing, but *damn* was that annoying sometimes.\n\nLove that change.",
            "Isn't that a good change?",
            "Circuit made that grind *way* easier. In the first couple weeks I got more criotic than I'd gotten in the past year.",
            "Enemies have +60% additional chance to drop Health Orbs. Health Orbs increase Armor by 80/160/240 for 10 seconds. Effect triples for Warframes.\n\n**Storm Caller**\n\n100/200/300% Magazine Capacity. Gain 1 Electricity Damage by every bullet reloaded to your weapon.\n\n**Inner Absorption (Spiteful)**\n\nSacrifice x0.5 from your Weapon Damage to increase your Ability and Power Strike Damage by 600% to enemies. \n\n**Good Governance (Spiteful)**\n\nSacrifice x0.5 from your Critical Chance to gain x3 to your squad’s Critical Damage.\n\n**Cloak and Dagger (Spiteful):**\n\nYour weapons deal an extra hit with 100% Slash Damage and Status, but 100 Slash Damage with Status are self inflicted when you attack. \n\nShare your [Feedback](https://forums.warframe.com/forum/1975-new-decrees-feedback/) & [Bug Reports](https://forums.warframe.com/forum/1986-new-decrees-bugs/) on the new Decrees in the dedicated Subforums. \n\n**New Undercroft Mission: Alchemy**\n\nYour knowledge on the elements from your explorations of Albrecht’s Laboratories is required in Duviri, Tenno! Maintain the laws of alchemical science in the Undercroft with the addition of the Alchemy mission type. \n\nLike most things in Duviri, completing an Alchemy Undercroft mission is different from how you know it outside of the Spiral. Here’s what you can expect: \n\n  * Players must fill 2 Crucibles in order to complete an Undercroft mission or to move to the next stage in the Circuit. \n    * There is no Conversion Progress mixing stage in the Undercroft - players do not need to destroy Distressed Pipes while the Crucible mixes the elements. \n  * Dax Enemies will drop the required Amphors for the active Crucible, while other enemies will drop them at random. \n\n\n\n**General Alchemy Change (applies to Duviri and standard mode):**\n\n  * Slightly reduced the amount of Amphors required to fill up an element in the Crucible for Squads of 3 or 4 players.\n\n\n\n**Pathos Clamps Rewarded From Undercroft Portals**\n\nPathos Clamps are now rewarded from completing **Undercroft Portal side objectives**(story stage Undercroft portals do not reward Pathos Clamps) in the Duviri Experience! This is in addition to the current Decrees, Arcanes, and Steel Essence (if played on Steel Path difficulty) rewards. \n\nUndercroft Portals completed on standard difficulty have a guaranteed reward of 1 Pathos Clamp for completion, while those completed on Steel Path have a guaranteed reward of 3 Pathos Clamps. \n\n**NEW PLAYER EXPERIENCE IMPROVEMENTS**\n\n**Debt-Bond Farming Changes**\n\nWe have revamped Solaris United Bounty Drop Tables to increase the amount of Debt-Bonds earned across the board. Our goal with these changes was to increase Debt-Bond drop rates, but not affect rare or desired items already in the Drop Tables. \n\n  * Moved Debt-Bonds from Stage 1 to Final Stage, but increased drop rate significantly for every Bounty Tier.\n    * Running the first Bounty Stage was a common practice to farm Debt-Bonds, and while we wanted to increase Debt-Bond drop chance, leaving them in that Stage would only incentivize that behavior further. \n    * With these in the Final Stage Drop Table, players who complete all the Bonus Objectives will have an extra kick at the Debt-Bond can, since the Bonus Objectives reward comes from this drop table. \n  * Increased existing Debt-Bond drop rates in Middle-Stage Drop Tables (Stages 2, 3, and 4, where applicable).\n  * Removed lackluster “filler” items from the Uncommon and Rare reward tables: \n    * Level 5-15: 3,000 Credits\n    * Level 10-30: Tepa Nodules\n    * Level 20-40: 3,000 Credits\n    * Level 30-50: Tellurium\n    * Level 40-60 (including Narmer and Steel Path): 500 Kuva\n  * Replaced 10k Credits reward in Level 40-60 Bounties (including Narmer and Steel Path) with rare resources (Neurodes or Orokin Cells).\n  * Slightly adjusted Garuda Blueprints and Synth Mods drop rates to accommodate changes above, but we did our best to avoid increases or decreases over 5%. \n  * Reduced the Credit costs of Ticker’s Debt Bonds by 50%. \n    * Previously, the cost would randomly roll between 5k - 350k Credits depending on the bundle offered. Now, it’ll roll between 2.5k - 175k. \n\n\n\nFor a full overview of the Drop Table changes, please review our[ Drop Tables site](https://www.warframe.com/droptables). \n\n**Voidrig Acquisition Improvements**\n\n  * Players who haven’t completed The War Within are now prevented from equipping the Necramech Summon to their Gear Wheel. \n  * Further amended the Voidrig Blueprint build requirements to require less investment in the Necralisk Syndicate, reduce overall farming time, and include resources that can be found in the regular Star Chart.\n    * Voidrig Casing Blueprint:\n      * Replaced 8 Stellated Necrathene (Rank 2) with 30 Faceted Tiametrite (Rank 0)\n      * Replaced 5 Cranial Foremount (Rank 4) with 140 Lucent Teroglobes\n    * Voidrig Engine Blueprint:\n      * Replaced 1 Biotic Filter with 4 Parasitic Tethermaw\n      * Replaced 6 Cabochon Embolos (Rank 3) with 10 Orokin Cells\n    * Voidrig Capsule Blueprint: \n      * Replaced 2 Scintillant (locked behind Master Rank 5) with 3 Morphics \n      * Reduced Spinal Core Section cost from 15 to 12, as players can get a maximum of 2 per fish\n    * Voidrig Weapon Pod Blueprint:\n      * Replaced 40 Thaumic Distillate (Rank 2) with 40 Purified Heciphron (Rank 1)\n      * Replaced 6 Trapezium Xenorhast (Rank 3) with 30 Purged Dagonic (Rank 0)\n  * Moved Damaged Necramech pieces from Necraloid’s offerings in the Necralisk to Father.\n    * Players are given the Voidrig Blueprints upon completing the Heart of Deimos, but the majority of the acquisition path is hidden behind The War Within. While we initially added these items to Necraloid in Update 34: Abyss of Dagath, we found that players still had difficulty finding them, especially if they had not yet progressed in the Main Story Path. Moving them to Father is lore-consistent and should help reduce the grind further. \n\n\n\n**Awakening Quest Improvements**\n\n**Starter Warframe Color Customization**\n\nWe have added the ability to select one of three color presets (composed of the free colors in the Classic Palette) in the starter Warframe selection screen for Mag, Excalibur and Volt in the Awakening Quest. The selected colors remain during the Quest and afterwards until the player changes them from Arsenal. \n\n[aecc0d8aab66f1e476fcfe31135e36c3.jpg](https://www-static.warframe.com/uploads/aecc0d8aab66f1e476fcfe31135e36c3.jpg)\n\nYou can reset to the Warframe’s default colors by hitting the “X” icon next to the color options. \n\n  \n\n\n**Awakening Quest Checkpoints**\n\nWe have added checkpoints to the Awakening Quest so players who leave part-way do not have to start from the beginning when they return. Players will be notified once they hit a Checkpoint, and will get a preview of the remaining checkpoints they need to complete to help them better understand their progress.\n\n[4e1e3fa392b4130b23ca433cf41d4d5f.jpg](https://www-static.warframe.com/uploads/4e1e3fa392b4130b23ca433cf41d4d5f.jpg)\n\n**Other New Player Experience Changes and Fixes:**\n\n  * Updated the TennoGuide path to include suggested Nodes in addition to Quests/Junctions up until the Mercury Junction.\n    * This change offers new Tenno the most optimized path to progress through Venus in their Main Story path. New player experience is a delicate balance of guiding players on what to do next, while maintaining player agency in their Warframe journey. \n  * Moved the Unda, Venus node (Spy mission) so that it is no longer required to complete to get to the Mercury Junction. \n    * Spy missions are a bit advanced for new players who are still learning the ins and outs of parkouring. So we’ve moved Unda away from the main path and onto a branch of Venera so that it is optional to complete. \n    * The new path to the Junction is now E-Gate > Fortuna > Kiliken. \n    * Increased enemy level range of the Unda, Venus node from 4-6 to 6-8 now that it follows Venera (which has a 5-7 range). \n  * Replaced ammo drops from storage crates at the start of the Awakening Quest with resources, as players do not have weapons at the stage they appear. \n  * Updated the Bullet Jump tutorial text in the Awakening Quest to read “Hold” instead of “Crouch/Slide” to better inform players on how to perform Bullet Jumps. \n  * Added a flashing icon that points players in the direction of Glass Shards in the Saya’s Vigil Quest when using a Scanner. \n  * Removed the Mastery Rank requirement from Maroo’s Bazaar. \n  * Reduced the difficulty of the enemies in the Corpus spy drone defense sequence in the “Talk to Thursby in Fortuna” stage of the Vox Solaris Quest. \n    * These enemies (notably the Terra Shockwave Moa and Terra Trencher) were rather dangerous for new players who may not be equipped to handle them, so we replaced them with more manageable enemy types. \n  * Fixed enemy pathing issues at the start of the Awakening Quest. \n\n\n\n  \n\n\n**UI ADDITIONS, CHANGES & MORE**\n\n**Loadout Customization From Navigation**\n\nYou can now change your Loadout directly from Navigation! Instead of running back and forth from the Arsenal when you need to make a change before jumping into a mission, you can now do so conveniently from the Navigation screen. \n\nMost actions you can accomplish in the Arsenal you can do here: \n\n**Change Loadout:** Selecting this option will bring up all of your available Loadout options to swap to. \n\n[f470520400bbf84e081c8e46064fad8e.jpg](https://www-static.warframe.com/uploads/f470520400bbf84e081c8e46064fad8e.jpg)\n\n**Warframe Options:**",
            "Lex loves it, because it means fire rate buffs wont nerf the hemorage mod",
            "yep, it's under accessibility settings",
            "Yes, it is a thing in the options, the mods are exclusively for altering fire rate, not the firing mode",
            "Can't use it on Dual Toxocyst :(",
            "If I'm reading it right, its x1.9 Status damage vs x1.55 Damage in general. There is a case for Hunter Munitions where the hit damage is much, much lower than the hit damage on Armored enemies. \n\nI think it's still far too early to tell if its any good or not.",
            "racist mods KRSEAÇLFGP\n\n\n\n\\[TYU7KEHÇIJYUL0\\~UY98L0Y89GB",
            "This is my take too. I think DE would've been better served just converting status duration mods into status damage mods though.\n\nMaybe it's just me, but I've never used or know of anyone who has used those.",
            "Ok I bit the bullet to test, it doesn't include the weapons and it locks you out of buying the Jade Collection with plat because it's marked as \"owned\". Seems like an oversight I guess, will raise a ticket.",
            "Ok I bit the bullet to test, it doesn't include the weapons and it locks you out of buying the Jade Collection with plat because it's marked as \"owned\". Seems like an oversight I guess, will raise a ticket.",
            "We are few but our shards are many, comrade.",
            "I reported it too lol. I’m glad they eventually noticed.",
            "Yep, magnetize couldn’t affect any ragdolled enemy for 1-2 seconds.",
            "No, I was doing side objectives... I'm sure I had more than 6 by the time the Orowyrm appeared, though I might be mistaken.\n\n--\n\nEither way, it doesn't change my main gripe that the reward is way too low to be worth the time spent waiting on Survival or Excavation.",
            "Thanks, I was getting worried they'd forgotten.",
            "The notes say its the same drop table.  That being said, im 15 runs in and ive gotten the 3k endo EVERY SINGLE RUN.  no blueprints, no relics, nothing except endo.",
            "It was supposed to come across as sarcasm given the sheer amount of information but it never translates well through text unfortunately. For the record though I have actually read through a good portion of it but my boss is starting to get suspicious of me not doing work.",
            "Green shards are reasonable access, Ofc they're late in progression but you don't really need full stripping before EDA",
            "Yeah, I'm fairly sure they've shown it off on a few occasions, but it was always a fun little thing they cooked up that didn't really work well enough to release for players.",
            "R.I.P.",
            "It fucks up heat inheritance unless the proc (and the initial damage) is astronomical. I assume ember mains rely on her 4 for that, which has good scaling.",
            "Yeah, I hadn't gotten to the part where they added it for Ember's 4th yet -- I was dumbstruck that they added it for Nezha (ring of fire is when you have his 1 active and teleport with the 2) and thought they left my girl out.",
            "* Swap Warframe\n    * Select from your available Warframes to equip. \n  * Upgrade Warframe\n    * Change upgrades (Mods, Arcanes, etc.) on equipped Warframe.\n  * Select Mod Config\n    * Select from your existing Mod Configs for equipped Warframe.\n  * View Warframe abilities \n    * Hover over the ability icons for the equipped Warframe to view stats.\n  * **Note:** Access to change Exalted Weapons from the Star Chart will be coming in a future update. \n\n\n\n[7a990e593fae7a120778d8b7f348a3e0.jpg](https://www-static.warframe.com/uploads/7a990e593fae7a120778d8b7f348a3e0.jpg)\n\n**Weapon Options:**\n\n  * Swap Primary/Secondary/Melee Weapon \n    * Select from your available Weapons to equip.\n  * Upgrade Primary/Secondary/Melee Weapon \n    * Change upgrades (Mods, Arcanes, etc.) on equipped weapons. \n  * Select Mod Config\n    * Select from your existing Mod Configs for equipped weapons. \n\n\n\n**Companion Options:**\n\n  * Swap Companion\n    * Select from your available Companions to equip. \n  * Upgrade Companion\n    * Change upgrades on equipped Companion. \n  * Select Mod Config\n    * Select from your existing Mod Configs for equipped Companion. \n  * Companion Weapon Options\n    * Swap Companion Weapon\n      * Select from your available/eligible Weapons to equip onto equipped Companion. \n    * Upgrade Companion Weapon\n      * Change upgrades on equipped Companion Weapon. \n    * Select Mod Config \n      * Select from your existing Mod Configs for equipped Companion Weapon. \n\n\n\n**Arsenal UI Additions & Changes**\n\n**Featured Look Links**\n\nWe’ve added a new feature to the Arsenal to display a curated list of Featured Warframe Looks! You can find the list in your Arsenal when customizing your fashion (Warframe > Appearance), replacing the spot that was taken by the stats window. \n\n[87e28e5ba5a7feb9a18676bb020585cf.jpg](https://www-static.warframe.com/uploads/87e28e5ba5a7feb9a18676bb020585cf.jpg)\n\nOur goal with this feature is to display your amazing fashion to share with other players! Very similar to the Look Link feature in chat, players will be able to click through the Featured Look Link list, preview fashion, and apply it to their own Warframes using the **“Apply Look”** button. \n\n[02e164f6461a736dda0510110dfc79a8.jpg](https://www-static.warframe.com/uploads/02e164f6461a736dda0510110dfc79a8.jpg)\n\nCurrently, you can see fashion curated from our very own DE staff for the following Warframes: Jade, Excalibur, Mag and Volt. \n\nWe will be collecting and curating Look Links from players to add to the Featured Look Link list. Stay tuned for more info. \n\n**Upgrade Screen Additions & Changes**\n\n  * Added the option to duplicate a Mod Config onto another Config in the Upgrade screen.   \n[85de425bb808c11fc3a1ab1550323205.jpg](https://www-static.warframe.com/uploads/85de425bb808c11fc3a1ab1550323205.jpg)  \n[52dd63325943f9ef5f3a3bcd99b67d73.jpg](https://www-static.warframe.com/uploads/52dd63325943f9ef5f3a3bcd99b67d73.jpg)\n    * Here’s how to duplicate your Mod Configs: \n    * Select the new “Duplicate Configs” button in the far right of the Config bar on a Mod Config that you’d like to duplicate onto another one of your Mod Configs.\n    * Select the Mod Config you’d like to duplicate to another Config. \n    * Confirm you’d like to override the selected Mod Config. \n      * As an example, Config A is selected, use the Duplicate button to copy over the Mods in Config A to Config B. Config B now has the same Mods as Config A. \n  * Added a little indicator to show the Polarity of the Slot when a Mod with the wrong Polarity has been equipped onto it.\n    * Gone are the days where you’d have to remove the Mod to see what Polarity is hiding behind it, you can now make informed Modding decisions without having to do so!  \n[341dc6416cae86849233b498245c8de5.jpg](https://www-static.warframe.com/uploads/341dc6416cae86849233b498245c8de5.jpg)\n  * Added a sound FX when equipping an Arcane Adapter to a slot in the Upgrade screen. \n\n\n\n**Stat UI Changes & Fixes**\n\nIn the Dante Unbound Update, we reworked the Warframe, Weapon, and Railjack Stats UI to reduce the sometimes overwhelming visual noise and instead put focus on just the most important information. With Jade Shadows, we continued those efforts by taking into account the player feedback and bug reports we received from the rework. \n\n**Changes:**\n\n  * Added a dynamic diamond icon next to stats that changes states depending on equipped Mods:\n    * This icon always appears next to “Core Stats” (visible at all times in the stat screen) that have Secondary Stats nested within them to indicate that hovering over it will show the tooltip. \n      * In an effort to clean up the screen, it wasn’t obvious enough that Secondary Stats existed. While not as important as Core Stats, players should still be able to easily identify which of the Core Stats contain other relevant stats. \n    * Dynamic States: The following states are also reflected in the Secondary Stats tooltip to inform players that they are also affected. \n      * Increasing stat beyond the previous values will prompt a green arrow to appear above the diamond to communicate the increase.\n      * Decreasing stat below the base values will prompt a gray arrow to appear below the diamond to communicate the decrease. \n    * [2349a13690797166810c5cd59b781b9a.jpg](https://www-static.warframe.com/uploads/2349a13690797166810c5cd59b781b9a.jpg)\n\n\n\n  * The following is related to and was also listed above in the Resistances & Status Effects Rework section:\n    * Damage Resistances (from Mods such as Shock Absorbers) have been added as a secondary stat to the Armor Stat on-hover. (This is related to and listed above in the Resistances & Status Effects Rework section). \n      * Tau Resistance was already reflected on-hover for Armor Stats, now other damage resistances are given the same treatment. \n    * Tooltips for Status Effects in the Upgrade screen UI will now include what they are “Effective Against” and its “Damage Efficacy”. (This is related to and listed above in the Resistances & Status Effects Rework section). \n  * Conditional stats will now remain visible after unequipping the Mods that prompt them to appear so that players can see the comparison with/without the Mods. They will disappear after leaving and returning to the Upgrade screen. \n  * Shield Recharge rate is now displayed as a flat value instead of a percentage of total Shield value. \n    * Let’s use Xaku’s base stats as an example of how this stat will now appear in the UI (their stats have not changed, just how it is displayed):\n      * Before: “9.6% per second”\n      * After: “31.5 per second”\n  * Added a Damage Falloff Secondary Stat to the Melee Slam Attack Core Stat: “Deal X% Damage to enemies on the edge of the impact zone.” \n  * Moved “Reload Speed” back as a Core Stat instead of nesting it within “Magazine”. \n  * Added a Void Damage tooltip in the Operator stats UI to show its efficacy stat and Status Effect description. \n    * Now reads: “Damage Efficacy: X damage to Zariman.  \nStatus Effect: Highly effective against enemies with Overguard Health and Sentients as it resets their damage adaptation. Void creates a bullet attractor sphere on the target that attracts and concentrates further attacks.”.\n  * Added an Overguard tooltip to Rage, Archwing, Necramech and Hunter Adrenaline Mods, due to their new interactions with Overguard as of Update [35.5.6](https://www.warframe.com/updates/pc/35-5-6). \n  * Reordered Charge Rate stat to the top of the list for Bow and Charge weapons, and renamed it to “Charge Time”. \n  * Changed Melee Follow Through stat to be represented as a percentage instead of decimals. \n  * Added measurement units to Weapon stats:\n    * Ex: Added “s” for seconds on the Melee Heavy Attack Wind-up stat and “m” for meters on the Weapon falloff stat. \n\n\n\n**Fixes:**\n\n  * Fixed Valence Bonus stat sometimes rounding up decimals when viewed in the Arsenal or when purchasing from Ergo Glast.\n  * Fixed Precision Intensify not properly displaying Ability Strength stat increases for the following Exalted Abilities in the Arsenal: \n    * Excalibur’s Exalted Blade\n    * Baruuk’s Serene Storm\n    * Titania’s Razorwing\n    * Valkyr’s Hysteria\n    * Ivara’s Artemis Bow\n    * Mesa’s Peacemaker \n    * Sevagoth’s Exalted Shadow\n    * Wukong’s Primal Fury\n  * Fixed Chat Linking unowned equipment (Warframes, Weapons, etc.) resulting in fewer stats being listed than if they were owned.\n  * Fixed certain Incarnon Weapon stats showing as “0” and the UI showing a comparison state as if Mods had been equipped, when in fact they had not yet. \n  * Fixed the Wind Up stat increasing in UI instead of decreasing when Heavy Attack Wind Up Speed Mods are equipped. \n  * Fixed the Chilling Reload Mod’s Reload Speed stat going red instead of green when increasing its rank. \n  * Fixed Paris Prime’s Status stat tooltip not showing a breakdown of “chance for each Status Effect type per hit.”\n  * Fixed stats not updating in the UI while modding Companions in a Relay/Town/Dojo/etc. \n  * Fixed repeatedly hovering over Praedos’ “Drifting Grace” Incarnon Evolution incorrectly increasing a Warframe’s Sprint Speed stat in the Arsenal UI.\n  * Fixed the following Warframe Aura Mods not affecting the Ammo from Pickups stat in the Arsenal UI: \n    * Rifle Scavenger\n    * Pistol Scavenger\n    * Shotgun Scavenger\n    * Sniper Scavenger\n  * Fixed the Critical Multiplier from Braton Incarnon’s “Prelude of Might” perk not being indicated in the Arsenal stats (this was strictly a UI issue, the stats increase was applying).\n  * Fixed Ruvox Incarnon’s Damage stat not updating from Impact to Puncture when transformed to Incarnon Mode in the Arsenal stats. \n\n\n\n**HUD Changes**\n\n**Improved HUD Scaling**\n\nWe’ve changed the HUD Scale option so that the HUD now scales proportionally to the player's game resolution!",
            "Cranial Foremount removed is a massive W",
            "from the reading i did when setting mine up the Incarnon mode is so slow to fire that even with multiple fire rate mods the 2.5 fire rate is never broken. not to say this isnt a good thing still, but my understanding was that Lex was safe with fire rate mods and Hemorrhage because it's so slow even when modding for it",
            "This new setting doesnt seem to be working for me at all maybe it just isnt working on the switch, i even tried several weapons",
            "For the accesibility setting, yes you can.",
            "That's because you're not reading it right. It's 1.55x damage on the initial hit that causes the status, and then 1.55x damage on the status caused by that damage. The faction mods double-dip, which is why they are by *far* the most significant dps increase on a status build.",
            "There is ONE use of them, which is expedite suffering builds for disruption. Very, VERY niche, but still there nonetheless. And who knows, maybe they have some other niches. It’s better for them just to add new mods anyways just so that no meme build gets left behind.",
            "I use them on primer builds because there's not much else to put there. But never in anything that wants to deal damage",
            "Damn, what a shame, I should imagine that's a patch notes error rather than the more ideal outcome of a bundle error.  Thanks for testing and letting me know, I really appreciate it, hopefully support can make things right for you.",
            "That's not good. On the bright side, MTX stuff usually gets fixed sooner rather than later, and hopefully if it's indeed intended to come with the weapons, you'll get sent yours. DE usually makes good with this kind of stuff.",
            "I never see anyone else rock it but I personally think it’s got the most god tier sound effects with headphones on\n\nIt hits like a truck too lol",
            "While this is horrible news for you, I hope I can take advantage of that for a bit when I get off work\n \n\nI'm a gluten for piles of endo. Don't need it. Just like seeing it pile up.",
            "Yeah same, that's all I kept getting",
            "> reasonable access  \n> Late in progression.\n\nK.\n\nThe point is that a mechanic that literally forces EVERY SINGLE BUILD to build around it, just to create arbitrary difficulty, is poor game design. You either build armor strip, or you don't play later game content. That's your choices. In other words, it *isn't* a choice, and therefore isn't a good game mechanic. \n\n  \nAny time that a game offers a \"choice\" but there is only one \"correct\" option means it's not actually a choice and it's poor design. This is literally why Corrosive Projection was nerfed - because it was the ONLY aura people ran on 99% of builds.",
            "Funny. I got my shit mixed up and thought \"Ring of Fire\" was the nane dor her 4th, didn't realize y'all were talking about Nezha.",
            "Previously, the HUD was what we call “Fixed size”, where the HUD elements were of a predetermined size that did not automatically scale to accommodate different resolutions. Players who used the game resolution 1280x720px (the “Fixed Size” resolution) would see the HUD at the initial 100% size we made it for.\n\nHowever, if players set their game resolution to 1920x1080px, the HUD would then be 66.6% of the size we initially made it for. This led to players having to manually change the HUD Scale in the settings.\n\nNow, we have changed the HUD to scale proportionally. The HUD Scale is now based on the player’s game resolution, and with that the HUD Scale 100 proportionally looks the same at every resolution.\n\n[3c33805115d868c6646070238751f550.jpg](https://www-static.warframe.com/uploads/3c33805115d868c6646070238751f550.jpg)\n\n[12ddcec1b32f49461985893b6c9948df.jpg](https://www-static.warframe.com/uploads/12ddcec1b32f49461985893b6c9948df.jpg)\n\nMaking the game resolution wider does not continue to increase the size of the HUD. The HUD Scale is now going off whichever measurement (horizontal or vertical) is lower than 16:9, and with that, it will use the smallest axis as its anchor.\n\nPreviously, the HUD Scale option ranged from 1x to 3x (Scale 100 - 300). Now, we have changed it to 0.5x to 2x (Scale 50 - 200).\n\n**Please note** : With Jade Shadows, we have set the player's HUD Scale option to 100(%) so that players don’t get blasted with a super-sized UI. To make adjustments, go to Options > Interface > HUD.\n\n**The following numbers show the overall HUD Scale difference from before vs. now:**\n\nSome expected numbers based on the aspect math at 100 HUD scale:\n\n  * Old 720p - 100 scale = New 720p - 125 scale\n  * Old 1080p - 100 scale = New 1080p - 80 scale\n  * Old 1440p - 100 scale = New ~63 scale\n  * Old 4k - 100 scale = New ~42 scale, so no longer available\n\n\n\nOther way around at new default HUD scales, should be equivalent to:\n\n  * 720p: 80\n  * 900p: 100\n  * 1080p: 120\n  * 1440p: 160\n  * 4k: 240\n\n\n\n**HUD Mod Pop-Ups**\n\nPreviously, any Mod that you acquired as a drop mid-mission would take up a considerable chunk of your screen, no matter the Mod. So we’ve made HUD changes to minimize the impact of these Mods: \n\n  * Mods that you already own will now appear minimized at the bottom-center of your screen (like Resources), while new or Rare Mods will appear as they have previously.\n  * Common Mods will appear at the bottom of your screen with a Bronze tag and a singular diamond, and Uncommon Mods will appear as a silver tag with two diamonds. \n\n\n\n  \n\n\n**General UI Changes & Fixes**\n\n  * Damage Numbers have received an overhaul to make it easier to see while damaging an enemy. Damage number “flyoffs” (the way the numbers appear and move off of damaged enemies) will now “fly” further based on distance from target, to ensure you can aim to hit the target easily without numbers blocking your view. [New Distance Scaling Damage Numbers VIDEO_ BEFORE AND AFTER EDIT.mp4](https://content.invisioncic.com/Mwarframe/monthly_2024_06/NewDistanceScalingDamageNumbersVIDEO_BEFOREANDAFTEREDIT.mp4.8ab017c84f54c21c9b578acebcb28e90.mp4)\n\nThe last “Cloud” iteration of damage numbers (bunched around the reticle) is still available to use if preferred in the Interface Options > Show Damage Numbers.",
            "Until you run into a wisp mote, grimoire alt fire buff, etc unless this mod doesnt prevent that either",
            "Oh I meant the semi-auto mod, but the accessibility thing I figured it was able to use.",
            "True, that's a good point.\n\nBut a status damage mod (with the same %) would deal the same damage as status duration with expedited suffering. With both status damage *and* status duration though, I guess that'd be a net buff, but I can't imagine many builds being able to fit all of that.\n\nThe only real difference between the two is that status duration also extends the length of CC-like effects like cold or radiation, or I guess the damage amp effects of corrosive or viral.",
            "The other niche is making longer lasting Gas clouds",
            "* We’ve updated Incarnon Evolution descriptions across all Incarnon Weapons and Incarnon Genesis to improve overall clarity and be more consistent with Mods, Arcanes, and each other. For reassurance, the upgrades themselves have not changed, only their descriptions. \n    * For example, Incarnons which previously contained the phrase “Increase Critical Chance by |VALUE|%” now read “Increase **Base** Critical Chance by |VALUE|%.\n  * The Magistar Incarnon’s Evolution II Perk ‘Crushing Verdict’ has been changed from multiplicative follow-through to base follow-through. This means that the value also changed from +100% to +40% to maintain the same effect. Players should not notice a functional change.\n  * The Nami Solo Incarnon’s Evolution II Perk ‘Master’s Flourish’ has had its text corrected. The effect has not changed, but the text did not match the effect this perk was providing.\n    * The text has been changed from “On Finisher:+20% Health per second for 10s.” to “On Finisher: +40 Health per second for 10s.\"\n  * The Syndicate Segment UI panel in your Orbiter has a new look! \n    * In addition to its new sleek design, it now shows the Syndicate you are Pledged to more clearly. \n    * You can also now see exactly how much Daily Standing you have from this panel instead of having to interact with the Segment. \n    * The relation to each Syndicate is now also indicated here.   \n[2aaed4f8cb75dbe6918e1f87666db54a.jpg](https://www-static.warframe.com/uploads/2aaed4f8cb75dbe6918e1f87666db54a.jpg)\n  * Added a “View Augments” option to the Ability preview tooltip that will show you associated Augment Mods (in the Abilities screen itself and at Helminth). Hovering over the Augment Mods in the pop-up will tell you which Syndicates you can acquire them from.   \n[71d99bb8af4b25353237c0f48eebdf55.jpg](https://www-static.warframe.com/uploads/71d99bb8af4b25353237c0f48eebdf55.jpg)  \n[ef945ffe6f0182ebfbef5c6adefb14bb.jpg](https://www-static.warframe.com/uploads/ef945ffe6f0182ebfbef5c6adefb14bb.jpg)\n  * Moved the “Cursor” customization options from “Customize UI Theme” to the Accessibility tab. \n    * Players had reported that these customizations were difficult to find in the settings, so we’ve moved it over to the Accessibility tab since it is inherently an Accessibility option and will have much better visibility there.\n  * Added Damage/Status Effect icons to correlating mentions in descriptions throughout the game. For example, a Heat icon will now properly display with any mention of “Heat Damage.”\n  * Unowned Captura Scenes are now indicated by an “eye” icon instead of a “Locked” tag. \n  * Changed the “Equip” button in the Arsenal to say “Swap”. \n  * Changed confirmation button from “Give” to “Confirm” in Bird 3’s Shiny Treasures screen. \n  * Added a subtle on-hover glow to Decrees to make it clearer which one is being selected. \n  * Updated Inbox sender icons to have consistent backgrounds. \n  * Added a “Last Equipped” label to the last-equipped Relic in an endless Void Fissure mission. Relics with this label will always appear at the top of the Relic selection screen in-mission. \n  * The Void Fissure tab in the Navigation Screen will now appear if you have previously owned a Void Relic, even if you don’t currently have any in your inventory. \n    * Previously it would only appear if you owned Void Relics (and had the Void Relic Segment installed in your Orbiter). \n  * Updated the damage type icons to their colored versions to improve visibility in the following UI areas (not exhaustive):\n    * Arsenal Stats\n    * Simulacrum’s enemy tooltips \n    * Lavos’ HUD\n    * Alchemy mission HUD (including icons over Amphors) \n    * And more! \n  * Fixed Syndicates with negative reputation saying they are ready to Rank Up when they are at the max amount of negative Standing instead of the minimum. \n  * Fixed being unable to scroll through the list of Warframes in the “Invert Tap/Hold Abilities” setting. \n  * Fixed the “Invert Tap/Hold Abilities” menu opening up blank. \n  * Fixed “How To” option appearing on locked Nightwave Acts.\n    * Players will gain access to the “How To” pop-up once they have completed the Nightwave Act’s prerequisites to avoid spoilers.\n  * Fixed issues when swapping from a PlayStation controller to a keyboard to type in a text box.\n  * Fixed the tutorial button missing in the Arsenal when using a controller.\n  * Fixed the Cedo Daybreak Skin displaying the \"This is a cosmetic for Cedo, which you do not own.\" regardless of Cedo ownership message on-hover in the “Tune in to Nora's Mix Vol. 6” preview screen.\n  * Fixed Attachments Appearance Menu for Railjack Crew not allowing players to customize energy tint. \n  * Fixed Necraloid showing up in the Sanctum Anatomica Fast Travel menu for players who are not Rank 5 in the Cavia Syndicate. \n  * Fixed Open Squads always appearing as 0 regardless of actual Open Squad count when selecting missions from the Chrysalith Elevator. \n  * Fixed interacting with a Terminal while a Glaive and Incarnon Form Pistol are dual-wielded resulting in only the Incarnon Form reticle being used. Now it should properly swap between Dual-Wield and Incarnon reticles depending on aim state. \n  * Fixed simultaneous inputs for Transference, opening the pause menu, and opening chat resulting in the Menu screen being aligned to the Warframe instead of the Operator/Drifter.\n  * Fixed opening Decree Menu simultaneously with another context action in Duviri (ex: playing Komi) resulting in the Decree Menu overlapping the screen. \n  * Fixed Circuit “Reward Ready to Claim” indicator appearing on top of other UI elements in the Navigation menu. \n  * Fixed the Mod pick-up pop-up overlapping with the Squad panel in-mission. \n  * Fixed the Dual Wield (Glaive + Pistol) reticle not being affected by HUD scale settings. \n  * Fixed Friends list not displaying the correct enemy level and faction (Grineer instead of Murmur) for friends in a Deep Archimedea mission. \n  * Fixed Clients seeing the Incarnon Evolution challenge UI popping up in Duviri for unowned Incarnon Weapons (players cannot evolve these weapons as they do not own them, so the popup was misleading). \n  * Fixed the Squad Equipment menu at times not appearing in Relays, Towns, Maroo’s Bazaar, etc. \n  * Fixed Ash’s Smoke Shadow Augment missing its HUD buff indicator. \n  * Fixed Conservation markers at times not showing the closest target after completing a Capture. \n  * Fixed the Earth Razorback Armada node overlapping with the Orbiter in the Star Chart. \n  * Fixed chat window sometimes moving after joining a mission as Client. \n  * Fixed various controller-specific UI elements in the Upgrade Screen. \n  * Fixed Region Chat’s history not properly updating when returning to the Orbiter. \n  * Fixed reloading reticle remaining on the screen if Voruna’s Ulfrun’s Descent is cast mid-reload. \n  * Fixed cursor being able to leave the Game Window when interacting with the “Review Logs” terminal in the Sanctum Anatomica.\n  * Fixed “Reactant Collected” UI tracker lingering in HUD after completing Void Storm and Omni Fissure missions. \n  * Fixed the ability icons overlapping with the stat box in the Arsenal UI. \n  * Fixed Index Mission Progress screen having broken UI elements. \n  * Fixed the Valac Europa node’s Crossfire Faction saying “Grineer VS. Corpus” instead of the intended “Corpus VS. Infested”. \n  * Fixed “Mission Failed” End of Mission screen showing again after exiting Arsenal if they had just returned from aborting/failing a mission. \n  * Fixed Infested Salvage Alerts not informing players how many rounds they have to complete in the UI. \n  * Fixed an issue where the mission results screen wouldn’t open while in the Orbiter when activating the “View Mission Progress” input.\n  * Fixed an issue where Melee weapon Unique Trait text would become unreadable in the Arsenal Upgrade screen due to the text overlapping while a Stance Mod is equipped.\n\n\n\n  \n  \n\n\n**FINISHER CHANGES**\n\n**Unified Finisher Mechanics**\n\nBefore explaining the changes, let’s define a few terms and basic concepts about Finishers:\n\n  * **Mercy Kills:** Available on specialty enemies when they reach certain health thresholds.\n  * **Finishers:** Available when a move “opens enemies to finishers”.\n  * **Ground Finishers:** Available after certain effects which knock enemies down. \n\n\n\nAll of the above count as Finishers for relevant Mods, Arcanes, Abilities, etc. Mercy Kills differ slightly as they are specific to your Parazon upgrades which do not apply to other Finishers.\n\n  \nIn order to make utilizing finishers easier, we have updated how they function to unify their mechanics: \n\n  * Increased the Finisher context action distance for Finishers from in front or behind from 2m to 3m.\n  * Ground finishers are now performed via context action instead of automatically via Melee Attack input. This should allow players to execute Ground Finishers much more reliably.\n    * The “Ground Finisher” context action will appear on enemies in range who are open to Ground Finishers.  \n[b71a32796499087a93b6b863f219ecec.jpg](https://www-static.warframe.com/uploads/b71a32796499087a93b6b863f219ecec.jpg)\n  * Updated the Mercy Kill context action with unique visuals to clearly distinguish between Mercy Kills and Finishers.  \n[bc44797143af5c4df805c02c25aec63a.jpg](https://www-static.warframe.com/uploads/bc44797143af5c4df805c02c25aec63a.jpg)\n  * Updated the overhead icon displayed on enemies open to non-Mercy Finishers.\n\n\n\n**Enemy Size Scaling**\n\nWe’ve taken strides in reducing how we scale enemies whenever a Finisher is used against them!\n\nBy default, Finishers cause enemies larger than your Warframe (ex: Grineer Bombard and Corrupted Gunners). This had the risk of causing some strange visual issues on the enemies that weren't ideal. \n\nWe’ve audited the contact points between the player and the enemy with all Melee Weapon animations to resolve these graphical sizing mishaps! \n\nWhat this looks like is:",
            "I tested the shotgun version of this mod with Wisp and can confirm that this mod blocks the fire rate increase.",
            "* If a point of contact is present between the player character and an enemy, such as a chokehold or grabbing a limb, enemy scaling will persist.\n  * If there is no physical point of contact between the player character and an enemy, the enemy scaling doesn’t occur as it isn’t necessary!\n\n\n\n**Scaling Fixes:**\n\n  * Fixed an issue where Finishers on Corpus Crewman and Grineer Lancers would stretch their spines. Like an untrained chiropractor. \n\n\n\n  \n\n\n**NEW VIDEO SETTING: REDUCE FRAME LATENCY**\n\nWe have added a new Video setting: Reduce Frame Latency!\n\n[12f5539aa59ac7be3347950aacab3ea1.png](https://www-static.warframe.com/uploads/12f5539aa59ac7be3347950aacab3ea1.png)\n\nThis option can reduce the time between when you act (eg: fire your weapon) and when you see it on-screen (muzzle-flash, tracer etc) and should make the game feel more responsive.\n\nSurprisingly, this option actually needs **less** VRAM than normal, particularly for high-resolution (4K), ultra-wide, or HDR displays; having more memory VRAM free can reduce texture streaming pops and improve performance by keeping more textures in cache which might compound the effect of making the game feel more responsive.\n\nIf you are using a Variable Refresh Rate (VRR) display with a technology like Nvidia G-Sync or AMD FreeSync, or you have disabled Vertical Sync (VSync), there should be no drawback at all to using this option.\n\nYou may find, however, for fixed refresh-rate displays, particularly at lower frame-rates, that this option might make the game feel less cinematic: your average frame-rate should be the same but some frames might arrive sooner or later and slow camera movements might feel less smooth.\n\nOur hope is that, given Warframe’s typical fast-paced movement, none of the drawbacks will be obvious and the improved responsiveness will enhance your sense of immersion.\n\n**While it is currently disabled by default we would encourage everyone to try enabling it so we can gather feedback to decide what the best default should be.**\n\n**Note:** The setting will not take effect until you restart the game.\n\nWhile we have exposed the option for DirectX 11 and DirectX 12 on PC we have not exposed it for other platforms yet (it has been tested on some though, notably Nintendo Switch, where the VRAM savings are very tempting).\n\nPlease let us know how it feels to you (please include your system specs so we can make sure we get feedback from a wide range of systems). Hopefully with your help we can decide if it makes sense to enable it by default. Thanks!\n\n**ADDITIONS**\n\n**New Prex Cards**\n\n[6cd6d91043e3c7f3ab58d7e8679a1c72.jpg](https://www-static.warframe.com/uploads/6cd6d91043e3c7f3ab58d7e8679a1c72.jpg)\n\nThere’s word that several Prex Cards have been strewn about the **Kronia Relay on Saturn -** help locate them and add these Warframe’s Prex Cards to your collection! \n\n  * Ember Prex Card\n  * Vauban Prex Card\n  * Titania Prex Card\n  * Garuda Prex Card\n  * Protea Prex Card\n\n\n\n**New Simulacrum Rooms**\n\nNew Simulacrum Rooms are available for you to take your simulated fights to the next level! \n\nSimilar to the Sanctum Simulacrum room that launched in Dante Unbound, the following rooms allow enemy difficulty to be set 25 levels above the standard maximum. \n\n  * **Ambulas Arena** **Simulacrum** \\- Simulate a battle on your foe’s territory. \n    * Acquired from The Perrin Sequence offerings at max rank. \n  * **Moonlit Courtyard Simulacrum** \\- Simulate a battle under the light of Lua. \n    * Acquired from New Loka offerings at max rank. \n  * **Red Veil Temple** **Simulacrum** \\- Hone your combat skills under the auspices of the Red Veil. \n    * Acquired from Red Veil offerings at max rank. \n  * **Zanuka Arena Simulacrum** \\- Stage a battle in your enemy’s arena for deeper insight into their tactics.\n    * Acquired from Arbiters of Hexis offerings at max rank. \n  * **Orokin Derelict Simulacrum** \\- Simulate a battle inside an Orokin Derelict. \n    * Acquired from Cephalon Suda offerings at max rank. \n  * **Grineer Asteroid Simulacrum** \\- Step into your opponent’s territory to devise a strategy for their defeat. \n    * Acquired from Steel Meridian offerings at max rank.\n  * **Orowyrm Arena Simulacrum -** Simulate a battle straight out of Tales of Duviri. \n    * Acquired from Acrithis’ Wares. \n\n\n\nThese new Simulacrum Rooms and the Sanctum Simulacrum Room are also tradeable and sellable! This is so that players can trade between one another without having to switch around their Syndicate Pledges/acquire from Loid for Vessel Capillaries. The Citadel room remains untradeable as it is the default, as well as the Ballroom as it is an event-specific reward. \n\n**General Additions**\n\n  * Added the **Cavia Arcane Collection** to Loid’s “Arcane Dissolution” Offerings - this Collection has a chance at the following Arcanes:\n    * Melee Fortification \n    * Melee Retaliation \n    * Melee Animosity \n    * Melee Exposure \n    * Melee Influence\n    * Melee Vortex\n    * Melee Crescendo \n    * Melee Duplicate \n  * Added Fast Travel to the Gear Wheel in the following areas:\n    * Dormizone\n      * Duviri, Arsenal, Operator, Drifter Intrinsics, Acrithis, Somachord, and Decorate Dormizone\n    * Maroo’s Bazaar\n      * Set Up Shop, Arsenal, Maroo, Varzia, and True Master’s Font (for MR 30+ Tenno) \n    * Cetus\n      * Konzu, Arsenal, Hok, Fisher Hai-Luk, Old Man Suumbaat, Nakak, Master Teasonai, Quill Onkko, and Mission Entrance \n    * Fortuna\n      * Eudico, Arsenal, Rude Zuud, The Business, Smokefinger, Ticker, Legs, Roky, Little Duck, Briefing, and Mission Entrance \n      * [2638924339ca4cd1215b79882ca35de4.jpg](https://www-static.warframe.com/uploads/2638924339ca4cd1215b79882ca35de4.jpg)\n    * Necralisk\n      * Mother, Arsenal, Father, Son, Daughter, Grandmother, Otak, Loid, and Mission Entrance\n    * Chrysalith\n      * Quinn, Hombask, Cavalero, Archimedean Yonta, Arsenal, and Zariman Navigation\n    * Sanctum Anatomica\n      * Fibonacci, Tagfer, Bird 3, Loid, Necraloid, Arsenal, and Mission Entrance\n  * Added a “Weapons Enabled” Toggle in Captura Settings to specifically enable/disable Operator Amps. \n    * Note: This setting is re-enabled after switching back to Warframe from Operator. \n  * Added a separate “Swap Weapons” binding for Railjack.\n    * Previously players could unknowingly bind over this functionality as it was not listed in the Key Bindings screen.\n  * Added an icon above planets in the Navigation Menu once a player has completed all of its nodes.\n    * Both Normal Path and Steel Path track planet completion separately, and have their own unique icons to denote completion!\n  * Added a “Fire Manual Trigger Weapons Continuously” setting to the Accessibility menu.\n    * Toggling this on will allow you to shoot manual trigger weapons (including Semi, Burst, and Charge Trigger types) continuously on a singular input. \n\n\n\n**CHANGES**\n\n[eac888d7210afbda442e8ef6914a709c.jpg](https://www-static.warframe.com/uploads/eac888d7210afbda442e8ef6914a709c.jpg)\n\n**Ceno & Vahd Suit Now Available For Drifter **\n\nBecome one with the Ostron as Drifter! The Ceno and Vahd Masks, Pauldrons, Greaves and Apparel have been converted to fit the Drifter and can now be equipped on them. \n\nPurchasing or crafting any of these customizations will include both the Operator and Drifter variants! For those of you that already own Ceno/Vahd items, the Drifter versions will be added to your inventory upon downloading the update and logging in. \n\n**In-Game Market Change:** Operator Suits that can also be used on Drifter now indicate such in their Market screen. It reads “This item provides cosmetics for both Operator and Drifter”. \n\n[a4075185f4208ba667dd749d16958462.jpg](https://www-static.warframe.com/uploads/a4075185f4208ba667dd749d16958462.jpg)\n\n**Line Of Sight Improvements**\n\nAs a continuation of our efforts to improve LOS systems within Warframe, which have been ongoing since Dante Unbound, we’ve made further strides towards improving how we handle these checks.\n\nFrom a technical standpoint, we’ve improved the consistency and performance of the underlying LOS systems within the game by handling how we detect unrendered targets, in addition to improvements we’ve made in recent hotfixes. \n\nAbilities that use LOS checks already have been updated to this improved technology! Additionally, with these improvements, we can now easily shift over any Warframe Ability that relies on LOS checks to be seamlessly migrated to this new, more accurate system, meaning we’re able to act faster on any outlying offenders that may arise. \n\nTo name a few Warframe abilities that benefit from this with Jade Shadows:\n\n  * Gara's Passive\n  * Nyx’s Psychic Bolts\n  * Inaros’ Scarab Swarm\n  * Wukong’s Primal Fury\n  * Gyre's Rotorswell\n  * Styanax's Axios Javelin (Vortex)\n  * Xaku’s Grasp of Lohk\n    * This also fixes ragdolled enemies not getting targeted by Grasp of Lohk weapons. \n\n\n\n**Deep Archimedea Changes & Fixes**",
            "Ye so ill probably use it on Lex, with galv stacks 60% fire rate and 60% multishot isnt as nice as gaining punch on Lex base form and some wall collision ignorance on the incarnon plus the massive DPS increase",
            "* As mentioned in Devstream #179, Deep Archimedea and Netracells now award Standing with the Cavia Syndicate. Deep Archimedea will award 15,000 Standing upon completion of the third mission with any modifiers (or none at all!) and Netracells will award 5,000 Standing per completed Netracell. \n  * Reduced the duration reduction of the “Abbreviated Abilities” Personal Modifier from 75% to 50%.\n  * Changed how Deep Archimedea’s “Untreatable” Personal Modifier interacts with Health Orbs in the following scenarios:\n    * **Lavos’ Universal Orbs:** Energy can now be gained from these Orbs when picked up, but not Health (as intended with this modifier). \n    * **Equilibrium Mod:** Energy can now be gained when picking up Health Orbs, but not the other way around (as intended with this modifier). \n      * A “Health Pickup is blocked” HUD pop-up will now appear at the bottom of your screen to help provide more information in the scenarios above.\n  * Changed “Unified Purpose”’s description to better explain what this Deviation does: \n    * Now reads: “Enemies can target and destroy Conduits.”\n  * Toned down the intensity of Void explosions caused by the “Postmortal Surges” Risk Variable. \n  * Made the following changes and fixes to the “Powerless” Personal Modifier to improve its functionality:\n    * Added an icon to the HUD to indicate the required number of kills. When the kill count requirement is met, the icon will disappear.\n    * Fixed Powerless blocking Ability effects from other players interacting with their kits.\n    * Fixed Powerless preventing players from using Transference.\n    * Fixed Powerless not properly applying to Clients.\n    * Fixed an issue where Powerless would appear to not countdown following the first mission, causing the player to be unable to finish the Modifier’s requirements to remove its detriment.\n    * Fixed Powerless not progressing from Squad kills while in a Necramech.\n  * Fixed Clients not receiving Research Points from their selected Individual Parameters equipment if invited by a Host active within a Deep Archimedea Mission.\n  * Fixed the HUD buff icon for the “Knifestep Syndrome” Personal Modifier remaining visible regardless of whether or not it is actually active.\n  * Fixed an issue where Client’s wouldn’t have their suggested/chosen Deep Archimedea equipment count towards the activities reward track if invited by a Host already in a Deep Archimedea mission.\n\n\n\n**Assassin Drop Table Changes**\n\n  * Increased (Shadow) Stalker’s drop rate for Despair, Scimitar Engines Blueprint, Hate, War, and Broken War to 11.73% each.\n    * Dread’s drop chance has been reduced on both Stalker (64.8%) and Shadow Stalker (41.33%) to compensate.\n    * Note: The Drop Chance of rolling a reward from this Drop Table is unchanged (i.e. 50%). \n  * Wolf of Saturn Six now has a guaranteed (100%) Weapon Part drop per kill, increased from 35%. \n    * This drop rate was originally designed for The Wolf of Saturn Six Nightwave Series, where a) all players were marked with his Death Mark and b) he had an increasing chance to spawn in-mission while the Series was live. Now, players farming the Wolf Sledge can only do so via Wolf Beacons, so drop rates have been amended with this in mind. \n\n\n\n**Feral/Wild Kubrow Fur Updates**\n\nIn the Dante Unbound update we updated the fur on Companion Kubrows to give them a more realistic look and feel. To reiterate: \n\n  * Improved lighting and shading response in different environments for better texture resolution. \n  * Improved fur density so that it looks softer and fluffier.\n  * Added depth to fur color and shading.\n\n\n\nWe have applied the same upgrades listed above to the following wild Kubrow-type/adjacent creatures: \n\n  * Feral Kubrow\n  * Drahk \n  * Sentinel Stover\n  * Vallis Kubrodon \n\n\n\n**General Changes**\n\n  * You can now replay the Whispers in the Walls Quest! \n    * To re-experience the trials and tribulations between Loid, Albrecht, the Cavia and the creeping Indifference go to your Codex > Quests > Locate the Whispers in the Wall Quest and select the “Replay Quest” button to begin again. \n  * In order to better manage data, we have added a maximum amount of Adversaries (Kuva Liches and Sisters of Parvos) that can be stored in the Codex’s “Universe” tab. \n    * If a player reaches a total of 150 Adversaries (Converted or Vanquished), they will be prompted to make space in their saved history by deleting entries before confronting a new Adversary. This is accomplished by using the “**Relinquish Adversaries”** option in the Codex.   \n[927b40d5a75a2d05dc516ee1d0bbb2b6.jpg](https://www-static.warframe.com/uploads/927b40d5a75a2d05dc516ee1d0bbb2b6.jpg)\n    * Please note that any Converted Adversaries will no longer be in your inventory if their history is deleted. This is reflected in the confirmation message given when you attempt to Relinquish an Adversary.\n  * We’ve improved the Warframe neck animations so that they no longer turn their head like an owl and distort their head/neck.   \n[1d9b282b6219d734794124f2f7c60760.jpg](https://www-static.warframe.com/uploads/1d9b282b6219d734794124f2f7c60760.jpg)\n  * Improved the responsiveness of holding the Melee Attack input to perform a throw for Melee weapons with ranged attacks (ex: Sigma & Octantis). Pressing and holding the Melee attack input now throws after one swing instead of two. \n    * As a result of this change, it is now easier to activate Tennokai with Glaives in the window it is available. Prior to this change, the second swing could prevent you from hitting Tennokai before the timer ran out. \n    * This also fixes multiple issues with thrown weapons and Tennokai: \n      * Fixed Wolf Sledge not benefitting from Heavy Attack Wind Up Speed Mods or Tennokai’s Wind Up Speed bonus. \n      * Fixed instances where the Wolf Sledge’s Tennokai Heavy Attack would not complete (the animation would halt halfway-through and leave players stuck mid swing until they Melee attacked again). \n      * Fixed an issue where throwing a Glaive manually (ie. by releasing the Melee attack input instead of auto-throwing) would consume and waste Tennokai unnecessarily.\n  * Trading Legendary Arcanes now requires you to be Mastery Rank 11. \n    * It’s important to note that only the player trading requires MR 11 and not the receiver. \n      * We needed to address an issue with exploitative Legendary Arcanes farming and ban-evasion account creation used to trade Legendary Arcanes. Other options we experimented with had the risk of innocent players getting caught in the crossfire of the ban-evasion subjects. When we took a look at Trading stats we found that a very small number of players below Mastery Rank 10 trade Legendary Arcanes, and therefore decided to go this route. This is purely a means of deterring the bad actors and ensuring legitimate trading for players. \n  * You can now trigger an early start to Void Armageddon waves by interacting with Exodampers. \n    * The long period between waves was originally added to give players time to set up beforehand, but for some this wait period was not necessary, so we have added a way to expedite the process for those who want to jump right in! \n  * Defense missions will no longer be unnecessarily extended whenever enemies are affected by Nyx’s “Mind Control” or Garuda’s “Blood Altar.” Instead, they’ll work similarly to Revenant’s Thralls, where invulnerable enemies don’t count towards the remaining enemy tally required to progress to the next wave. \n  * We’ve improved enemy spawn logic in Excavation missions to decrease the wait time between completing Excavators.\n    * This addresses the player reported issue that it often would take far too long for enemies to spawn when moving from one Excavator to another.\n  * Topaz Archon Shards have been changed to grant Shields from enemies hit by Blast Damage to enemies killed with it.\n    * The description in-game has always stated “Kills” but this was not actually the case - Shields were being regenerated from enemies hit with Blast Damage. While we understand that this changes the efficacy of the perk and deviates away from what players have been used to, the change was made to avoid photosensitivity issues resulting from Shields breaking and recharging quickly in certain scenarios (ex: Mesa’s Peacemaker Regulators with Blast Damage).\n  * Changed the Braton Incarnon Genesis’s Evolution III Perk (On Punch Through Hit: 20% chance for 10% Ammo restored) to give 10% of the Braton’s Maximum Ammo instead of 10% of an Ammo pickup.\n    * On an unmodded Braton Prime, this means the Perk will now give 60 Ammo instead of the previous 8 Ammo when it triggers.",
            "* Updated Market Blueprint descriptions for Warframes, Archwings, Archwing Weapons, Necramechs, and Weapons to more clearly outline the free path to earning them.\n    * Descriptions have been standardized to include important details such as:\n      * Quest or Mastery Rank requirements\n      * Syndicates they are acquired from\n      * Specific missions or Planets to farm on\n      * Brief instruction on how to acquire necessary keys or currency (ex: Mutalist Alad V Coordinates, Kullervo’s Bane, etc.) \n      * And more!\n    * While the Wiki is an invaluable resource for many players, our goal is to increase access to key information in-game as a starting off point. For those looking for more in-depth farming tips, the Wiki, our drop table site, and other community-made resources are king. \n    * Fixed a variety of Warframes and weapons having incorrect or missing Market Blueprint descriptions. \n  * Updated and standardized resource descriptions for a variety of resources, components, keys, and tokens. \n    * Since The Duviri Paradox update introduced the ability to see resource descriptions on-hover in your Foundry - in addition to already being able to Chat Link them - we feel it is especially important that these descriptions include a general overview of how to acquire these items. These are not meant to be comprehensive, but still offer enough detail for players to farm them successfully. \n    * Updated descriptions include (but are not limited to) the following:\n      * Necralisk Tokens, Debt-Bonds, and Orokin Matrices\n      * Rare Gems requiring specific mining tools\n      * Damaged Necramech components\n      * Items acquired from Invasion missions\n      * Items with special acquisition paths (Anomaly Shards, Kullervo’s Bane, etc. )\n      * Dragon Keys\n      * Sentient Cores \n      * Variety of items missing planet or node names, and more. \n    * Note: Fishing resources have yet to be updated to this new standard. \n  * Advanced Nosam Cutter can now be used to acquire Rare Orb Vallis Gems (Zodian and Thyst).\n    * Now both the Advanced Nosam Cutter and Sunpoint Plasma Drill can be used to mine all rare gems across landscapes. \n    * Also updated rare gem and mining tool descriptions to better communicate these requirements. \n\n\n  * The following Mods are no longer eligible to be traded or sold from Inventory. Essentially, they have been given the same treatment as Mentor’s Legacy to prevent players from removing Mods that can only be acquired once. If you have already sold the following Mods, you can submit a ticket to our fantastic Support Team at [support.warframe.com](http://support.warframe.com). \n    * Mountain's Edge Stance Mod\n      * Awarded from completing The Duviri Paradox Quest. \n    * Thermia Fracture Rewards - these were already untradeable, we’ve just also made them unsellable from Inventory: \n      * Amalgam Serration \n      * Amalgam Organ Shatter \n      * Amalgam Barrel Diffusion \n      * Amalgam Shotgun Barrage \n    * Daily Tribute Milestone Login Rewards these were already untradeable, we’ve just also made them unsellable from Inventory: \n      * Primed Vigor \n      * Primed Shred \n      * Primed Sure Footed\n      * Primed Fury\n  * Switching through the different Verse of Dante’s Final Verse will now play the associated video preview for the Verse you have selected instead of looping through the same video for all. \n  * The VFX of Excalibur’s Exalted Blade has had a visual refresh! The energy emanating from the Blade has an all new flow to it. \n  * GI Lighting Changes & Fixes: \n    * Adjusted ambient GI lighting in the Orbiter for better contrast in the lighting. \n      * This also improves the lightning in the Arsenal, which we received feedback on being too dark for the purposes of fashion framing. We have more changes and fixes planned for the next update.   \n[6ecefabf3605c405d7b5bce642d80e95.jpg](https://www-static.warframe.com/uploads/6ecefabf3605c405d7b5bce642d80e95.jpg)\n    * Updated GI Lighting in the Helminth room, including improvements to the pond beneath the floor to increase fish visibility.\n    * Adjusted lighting throughout the Orbiter to feel more realistic based on direct vs indirect light sources.\n    * Updated the lighting on various waters in the Drifter Camp so that the waterfalls aren’t glowing white and blown out at night. Also fixed being unable to see the fog over the landscape when viewing it from the Orbiter window. \n    * Fixed GI lighting shadow issues with Decorations in the Orbiter. \n    * Fixed some indirect lighting in the Orbiter to help alleviate areas that were far too dark. \n  * Synced Last Gap’s controller haptics with the heart beat sound. \n  * Improved the frequency of appearance for the new Albrecht’s Laboratories tiles that were released with Dante Unbound.\n  * Updated older Grineer decals to improve resolution and quality.\n  * Changed Tenet Diplos to continuously burst fire at already marked targets while aiming and holding the firing input. \n  * Argon Crystals are now automatically waypointed when dropped by enemies or resource containers in-mission. \n  * \"Parkour Velocity\" mods now affect a few more parkour-related activities:\n    * Increases velocity when wall running parallel to the wall\n    * Increases velocity when wall jumping away from a wall\n    * Increases the instantaneous velocity change when performing a double jump\n  * Updated the visual materials on the Dread, Hate, and Despair.\n    * This change also made many untintable areas now tintable (notably all of the metal on the Dread).   \n[b52c07d12eb55deab8a0106b8a9354e7.jpg](https://www-static.warframe.com/uploads/b52c07d12eb55deab8a0106b8a9354e7.jpg)\n  * Updated the “From on High” Nightwave Act description to include K-Drives. \n    * It now reads: “Kill 100 grounded enemies while soaring above the Plains of Eidolon, Orb Vallis, or Cambion Drift on your K-Drive or Archwing.”\n  * Removed the Kuva Sobek from Conclave eligibility due to not being Conclave balanced. \n  * Updated Lavos’ Valence Formation Augment Mod description for accuracy (the Augment itself has not changed, this is only a description update).. \n    * It now reads: “Casting an Ability imbued with extra Elemental Damage applies that Element as a 200% bonus to your weapons with guaranteed Status for 20s.”.\n  * Adjusted Ordis’ Camera angle and gave him Idle Animations in the Drifter Camp during the New War Quest.\n  * Your Warframe falling into a void while in Transference will no longer cause a screen fade-to-block which deactivates your Warframe’s abilities. \n    * Players often hop into Operator/Drifter mode to traverse gaps, but doing so over a void would reset your Warframe once they hit the teleport volume. If you ever experienced a fade-to-black while Void Slinging over a void, this was what caused it! Now this will no longer happen, provided you are in Transference when your Warframe falls into the teleport volume. \n  * Kuva and Tenet weapons with 58% Elemental Bonus or above will now automatically round that value up to 60%.\n    * Players who have existing Tenet and Kuva weapons (including those pending in the Foundry) with 58%+ Valence Bonus will have this value rounded up to 60% upon logging in after downloading the update.\n  * Increased the window for players to join an in-progress mission when playing a Star Chart node for the first time. \n    * Previously, the window was much smaller for first-time joiners, to avoid them missing key cutscenes or transmissions that appear at the start of the mission. The unintended result was that many players ended up starting a new session and playing the mission alone.\n  * Made a small adjustment to ambient sounds in the Strata Relay. \n  * The Warframe Launcher will now display “Downloading new content” once the download actually starts.\n    * Previously it said “Checking for new content” when both checking and downloading the content.\n  * Reduced the damage of the Juggernaut’s ranged spine strike. \n    * The amount of Toxin Status Effects it caused could be difficult for newer players to tackle, so we’ve reduced it to make it more manageable. \n  * Updated the Helminth Ability “Expedite Suffering” description for accuracy (the ability itself has not changed, this is only a description update).\n    * Now reads: \"Condense all Slash and Toxin Status Effects into a single damage instance.\"\n  * Updated Dante’s Fourth Ability “Final Verse: Tragedy” description for accuracy (the ability itself has not changed, this is only a description update)..\n    * Now reads: “Two Dark Verses cast in succession attack enemies. Damage Over Time from Slash, Heat and Toxin Status Effects accumulates in a single blast.”\n  * Updated the Templar Prime Operator/Drifter Transference Suit Collection to clarify its usability by both the Operator and Drifter.\n    * Now reads: “The dress uniform worn with pride by Harrow's faithful legions. Includes the full set for both Operator and Drifter.”\n  * Updated Nezha’s “Divine Retribution” Augment description for accuracy (the Augment itself has not changed, this is only a description update).\n    * Now reads: “Status Effects spread to all speared enemies. Spear explosions scale by 1.5x of remaining Slash, Toxin and Heat Status Effects. Base Radius is 14m.”\n  * Changed the Update Screen to use release date (year and month) instead of the update numbers for the listed Updates. \n\n\n\n  \n\n\n**TOP FIXES**",
            "* Fixed Dante’s passive only applying to enemies who were scanned in-mission. Now it should apply to enemies who were fully scanned before the mission started. \n  * Fixed Sevagoth’s Shadow not benefiting from the Shadow Haze Augment Mod on enemies inflicted with Death’s Harvest. \n  * Fixed being unable to Auto-Melee as Chroma while Spectral Scream is active. \n  * Fixed held items (Datamass for example) causing visibility issues with the Grimoire equipped. \n    * The item will now be hidden when aiming and/or firing with the Grimoire to prevent it from blocking view. \n  * Fixed being unable to throw Voidrig’s Necraweb Grenade. \n  * Fixed the “Loid” fast travel option in the pause menu taking you to the front of the doors to the Sanctum Anatomica instead of directly to him. \n  * Fixed the Host’s invisibility option for Warframe abilities (Semi-Cloak or Glow-Cloak) overriding Clients’ invisibility option. \n  * Fixed Melee Crescendo stacks vanishing after Host migration for Ash players that collected them with Blade Storm while holding a Primary Weapon. \n  * Fixed Host and Client going back to completely different areas when the Host aborts, but still remaining in the same squad (e.g. Host returns to Obiter, while Client returns to Cetus). \n  * Fixed an issue where one player using Transference would close the Ability menu for everybody in the squad. \n  * Fixed being unable to use Last Gasp if the \"Ability Menu\" controller binding has been replaced with \"Activate Selected Power\".\n  * Fixed the alt-fire not throwing discs in Duviri Enigma Puzzles if the player has a Melee weapon equipped. \n  * Fixed the Derivator Crewman’s energy dome showing through Grendel when feasted, and partially limiting his movement. \n  * Fixed being unable to cast/cancel abilities or attack as Wukong after ledge grabbing during Cloud Walker’s cast animation. \n  * Fixed loss of function (invisible weapons, being unable to reload, etc.) as Wukong after hitting a teleport volume while in Cloud Walker. \n  * Fixed loss of function as Valkyr after entering a Nullifier Bubble during Hysteria.\n  * Fixed Saryn’s Toxic Lash affecting Clients damage numbers by displaying the wrong damage values (UI only issue). \n  * Fixed loss of function when attempting to leave Submersible Archwing in the Grineer Sealab Tileset. \n  * Fixed Shade’s Ghost Mod randomly deactivating while surrounded by enemies who are in range.\n    * This was because Shade would choose one target to trigger invisibility, meaning the effect would end once they were killed. Now this Mod’s effect is no longer tied to one target, so the invisibility will persist so long as players do not engage in behaviors that will disrupt it. \n  * Fixed Zephyr’s Tail Wind not deactivating while the player is in Bleedout. \n  * Fixed cases of players receiving a different rotation reward than what was displayed in-mission. \n  * Fixed a case of the Total Eclipse Augment offering a permanent Eclipse buff for Clients if another player also casts Eclipse. \n  * Fixed being able to dislodge Fragmented enemies from Garuda’s Blood Altar. \n  * Fixed function loss for remaining player(s) if both Host and another Client leave at the end of a round in The Index.\n  * Fixed Mirage’s Hall of Mirrors clones not shooting Incarnon Form weapons unless they had hit enemies before the Incarnon Form was triggered.\n  * Fixed being unable to progress in Void Armageddon Bounties after completing the Bounty requirements. \n    * Prior to this fix, players would be forced the extract after completing the Bounty requirements. Since this is an endless mission type we want to give players the option to stay and complete more Rounds if they wish. \n  * Fixed the Temporal Prime Ephemera causing Focus Badges to be oversized.\n  * Fixed lighting glitches and intense bloom when switching between certain weapons (notably the Tenet Grigori) in the Arsenal.\n  * Fixed being unable to jump as Operator after using Transference mid-movement.\n  * Fixed the Onos Evolution V challenge (Complete a solo mission with an Incarnon Weapon equipped in every slot) not completing when entering Extraction in Titania’s Razorwing form.\n  * Fixed Onos’ Incarnon Form projectiles hitting enemies that are directly behind the player instead of where they are firing. \n  * Fixed the Distressed Pipes in Alchemy missions not properly resetting after being destroyed with a high damage weapon, which could lead to a halt in mission progress. \n  * Fixed Zephyr and Nyx being unable to acquire Decrees in Duviri while Tail Wind hovering or using Absorb, respectively.\n  * Fixed the increasing likelihood of not receiving Void Traces in Railjack Voidstorms when opening Relics over multiple Voidstorm missions without resetting the session.\n  * Fixed K-Drive Board Slam kills not properly tracking for Clients for Yareli’s “Waverider” Quest Challenge.\n  * Fixed an issue where Auto-Melee wouldn’t work while on a Zipline.\n  * Fixed Mag’s Magnetize Ability not taking effect when casted onto a target ragdolled by her Pull Ability.\n  * Fixed Mag’s Magnetize Ability causing ragdolled enemies to float, jitter around or fly away. \n  * Fixed an issue where repeatedly using Transference in the Orbiter would cause the Warframe to lose functionality.\n  * Fixed recasting Hydroid’s Plunder ability causing its Armor buff to stack indefinitely.\n  * Fixed Ivara’s Artemis Bow not benefitting from the Galvanized Aptitude Mod. \n  * Fixed The War Within Quest replay not starting immediately due to players being unable to select the first stage “Investigate the Reservoir on Lua” node in the Star Chart. \n  * Fixed Operator’s Appearance switching to a different Appearance Config Slot than what’s selected after using Transference to and from Warframe in Orbiter. \n  * Fixed the Prime toggle not applying to Protea Prime’s Abilities when a TennoGen Skin is equipped.\n  * Fixed an issue where Client AoE/Radial damage was not being absorbed into Zephyr’s Tornados. \n  * Fixed the Pack Leader Mod reducing the amount of Overguard on a Companion if they already have the Mod's max amount (+1200).\n  * Fixed Mag’s Magnetize sometimes not working when cast on ragdolled enemies. \n  * Fixed Protea’s Temporal Erosion Augment being able to armor strip allies, instead of just enemies as intended. \n  * Fixed Dante’s Wordwarden not sharing Noctua’s elemental damage to squad mates if Dante is a Client. \n  * Fixed enemies in Grendel’s gut triggering the Energy Exhaustion personal modifier in Deep Archimedea. \n  * Fixed area of effect of Inaros’ Sandstorm remaining indefinitely if a Kuva Lich or Sister of Parvos performs a finisher on Inaros while in Sandstorm. \n  * Fixed Chroma’s Guardian Armor Augment not triggering Archon Intensify when healing allies. \n  * Fixed Grendel being able to fire primary weapons in Pulverize after casting Aquablades with the Surging Blades Augment equipped.\n  * Fixed being unable to use the Fishing menu if the Ability Menu controller binding is unbound. \n    * Now, when switching between mouse and controller the button callouts will reflect the “Classic Controls”. You can also now use the back button to exit the gear picker without having to pick something. \n  * Fixed being unable see Mirage’s Hall of Mirrors clones in Grendel Locator missions if you have a Companion equipped. \n    * Also fixed being unable to Melee Attack after casting Hall of Mirrors under the same conditions. \n  * Fixed getting permanently slowed by a Gruzzling after casting Mag’s Magnetize on it and letting a Warframe stand in its slow field while in Operator mode. \n  * Fixed cases where the Extraction timer would no longer count down for remaining players post-Host migration. \n  * Fixed Grendel losing momentum when casting Abilities while in Pulverize. \n  * Fixed being able to apply 5 Puncture Stacks to VIP enemies with Overguard, instead of the intended 3. \n  * Fixed Murmur enemies not properly ragdolling when caught in Khora’s Strangledome. \n  * Fixed Archon Nira not engaging in combat and floating in the air after the end of the intro cinematic. \n  * Fixed Dante's Pageflight Paragrimms targeting inactive enemy turrets, such as inactive/undamageable Orokin or Corpus turrets. \n  * Fixed weapons in Incarnon Mode (notably Paris Prime and Dread Incarnon) dealing less damage to enemies trapped in Zephyr’s Tornadoes. \n\n\n\n**OPTIMIZATIONS**"
        ]
    },
    "Jade Shadows - Spoiler Courtesy": {
        "title": "Jade Shadows - Spoiler Courtesy",
        "score": 160,
        "url": "https://www.reddit.com/r/Warframe/comments/1dfx2k0/jade_shadows_spoiler_courtesy/",
        "content": "[Source](https://forums.warframe.com/topic/1400054-jade-shadows-spoiler-courtesy/)\n\n[image.png](https://content.invisioncic.com/Mwarframe/monthly_2024_06/image.png.114f0c47f5adfc197d065518636ef9ca.png)\n\nHey Tenno! \n\nWe are just a few days away from the release of our next update & cinematic quest - _Jade Shadows!_ As we reveal more of Warframe’s story, we ask that you help preserve the mystery for fellow Tenno as they enjoy the update at their own pace. \n\n**Spoiler warnings** on your respective platforms, as well as**spoiler tags on the forums** , are the best way to share your experience without ruining the quest for others. \n\n**Content Creators (streams, videos, Captura, fan art, etc.) should clearly label spoiler content and use spoiler-free thumbnails and titles.**\n\nFor our forums, you can use the **‘Spoiler’ tag** to properly mark your post, as well as the built-in **‘Spoiler’ button** to cover your text up when posting: \n\n  \n[image.png](https://content.invisioncic.com/Mwarframe/monthly_2024_06/image.png.2238775c6e01d1ee904c5eabb325d16c.png)\n\nWe will have a dedicated subforum for Jade Shadows on launch, which will house all update-related discussions, questions, and more so that we can keep the rest of the Forums spoiler-free. \n\nWe’re excited for you to revisit the mysterious Stalker, and learn more about Jade - see you on **June 18th!**\n\n------\n^(This action was performed automatically, if you see any mistakes, please tag u/desmaraisp, he'll fix them.) [^(Here is my github.)](https://github.com/CephalonAhmes/CephalonAhmes)\n\n^(I have found a new home on AWS Lambda, RIP Heroku free tier.)",
        "num_comments": 78,
        "comments": [
            "Reddit fellas, this post is in discord and forums format. \n\nTo add spoilers in the body or comments:\n\n```>!insert spoilers in here!<```\n\nExample: >!insert spoilers in here!<\n\n###Titles for posts do not use this format.\n\nSo please, tag it [Spoiler] or [SPOILER] and DO NOT put the actual spoiler in the title.\n\nThis respects users who are also on other apps or browsers.\n\nPosts that do not follow this will be removed. \n\nOur rule is that ***this spoiler enforcement will last up to 10 days*** after the last platform has obtained it.",
            "the part where its revealed that the Stalker was just a stack of 8 corpus ratel robots in an elaborate warframe costume and hat completely blew my mind\n\nand all the robots having thick cockney accents was a stroke of genius\n\n  \nbravo, i say!",
            ">!Did not expect to play Guitar Hero on a pregnant Warframe but here we are. I want that damn Upgrade for the Hate it looked awesome.!<",
            "> asspoiler \n\n\nThe perfect location for a typo, =D\n\n\nWe shall avoid all ass poilers! o7",
            ">!Well that’s was short. And weird.!<",
            "Holy shit these vestigial mote rates are INSANELY slow. 2 hours of doing the event and I have 149 motes. Taking like 6-8 minutes to do SP with the sister.",
            ">!Testing, testing 1, 2, 3!< \n\nIs this thing on?",
            "Well, regarding story progression,  \n>!THAT'S A FREAKING WARFRAME BABY, AND IT'S SENTIENT(as in it's not a puppet), HOLY FUCK!!!!!<  \n>!I bet the next-ish story update will see the remaining Grineer Queen try to take that baby to do transferance on it.!<  \n>!I mean, yaeh a tenno body is cool and all, but here we're talking of something completely new and with untapped, possibly gigantic, potential.!<",
            "Just a reminder that it's a 25-30 minute quest, meaning we'll probably only get 5-10 lines of dialogue as the rest is running Ascension for the first time as a tutorial",
            "has anyone figured out which settign fixes my UI scale?",
            "Damn, DE is really invested in this one. I love lore quests, but for a relatively small quest like this I thought, \"oh yeah, it will probably be nice, something like the Sevagoth quest\".\n\nBut the way they are talking about it, hyping it up, spoiler warnings, locking you in for the quest, the lore interview with Reb, I am curious what this quest about, I thought it'd just be some Stalker backstory/lore, and what I, for now, assume is a a love story with Jade. But who knows?",
            ">!Really hope we get an alternative skin for Jade. It feels really awkward playing as a pregnant woman.!<",
            "Can't wait to see how they'll manage to make Xx\\_Darklord69\\_xX relevant again.",
            ">!While the story was disappointedly short the implications of a Warframe being born from another Warframe will help branch the story further then Wally's Arch will be.!<\n\n>!It's worth noting this can also serve as a plot point in which Wally could be ''born'' into Real Space, at least in a way that it wouldn't break the fabric of reality itself anyways.!<",
            "Not part of the story, but I really appreciate some of the nice QoL things that came with update. The status with corresponding icons is really nice and the loadout change at the navigation screen is fantastic.\n\nNot sure what else there is since I haven't gone over the patch notes, but those are what I've noticed in my 1 exterminate mission.",
            "Jade is available on dojo for 15k each part 😂😂\n\nAmazing bug 🔥",
            "The music of the quest. I can't even! Again a beautiful, touching drop of summoning onion cutting stealth frames",
            "Does the event mission not drop the BPs? I only got 3k Endo in a row. Not even Relics etc.",
            ">!So, uh... did our Operator use Transference on Jade, or am I misunderstanding it?!<\n\n>!Considering that Transference causes them to feel what the Warframe feels, did our Operator just give birth along with her?!<",
            ">![Understood](https://i.giphy.com/YYfEjWVqZ6NDG.webp)!<",
            "Any idea when we’d typically be able to read patch notes?",
            ">!Wasn't paying attention to the UI early on; did it say \"Erradicate\" instead of \"Eradicate\"?!<",
            ">!pregnancy frame!<",
            "I just wanna know how long it takes to finish before I start it.",
            "Sir yes sir!",
            "Roger that! All aboard the hype train",
            "Ok >!got it!<",
            "Putting a spoiler in the post title and marking it as a spoiler is still spoiling the story to people. How dense can some people be?",
            "Wait jade was preggers! That means? Stalker!? My mannn 😎😎",
            "And then there are people like knightmareframe that spoil it 5 seconds into their videos, smh",
            "awesome can't wait. When will Whispers in the Walls and The Heart of Deimos be replayable?",
            ">![Remember?](https://clips.twitch.tv/GoodOutstandingManateeHeyGuys-9ih1X4XUBAx9I2wC)!<",
            "you can buy it as a skin from the new event",
            ">!It is really way too short considering the theme it's trying to tackle. Felt more like a plot summary with all pacing taken out than an actual storyline... Maybe they just overhyped it!<",
            "that Quest should have been an Email",
            "I liked it",
            "I’ve run like 30 ascension missions and haven’t seen a single weapon bp drop",
            "bro but they are legit riven sliver heaven , i got 32 riven slivers from a single mission without a smeeta kavat",
            ">!Sounds like we're gonna have modular Warframes and it'll be sassy because its dad doesn't like us!<",
            "NVM I found it, it's HUD-Scale, 80 is about the old one.",
            "Don't read too much into it.\n\nI think DE is particularly against spoilers this time around because the Stalker and his lore are such a massive part of the Warframe history, you can even play as him in Duviri, he's right up there with Excalibur in terms of Warframe fame",
            "You're right, I want a skin that makes it >!more visible and bigger!<",
            "Would use plat to get that",
            "[removed]",
            "who is he?",
            "Mate our operator is 16.",
            "[https://forums.warframe.com/topic/1400346-update-36-jade-shadows/](https://forums.warframe.com/topic/1400346-update-36-jade-shadows/)",
            "35 ish minutes",
            ">!\\>!i love the new sister, and she step away when she realise what going on!<!<",
            "Nah man I want it to shoot the same projectiles",
            ">!Yeah this is my big gripe with the quest. Felt like it passed at gale speed and didn’t really leave much time to process the themes or reveals.!<",
            "To be fair, this has been a problem with most non-\"cinematic\" quests, especially the ones centered around a new frame. Felt the same even for the \"bigger\" quests like Protea or Sevagoth. This seems to be just a reality of the dev cycle for a game like Warframe - the \"side quests\" are usually just a bit compressed. Especially after we got spoiled with The New War.\n\nHonestly, I wish they'd be more willing to add \"filler\" missions into these short quests. Here, an extra mission just shooting >!Corpus!< with minimal dialogue (maybe a setup for the >!Corpus captain's morals!<) would've just given us some time to process.",
            "I think it’s setup honestly. Feels like there will be a big time skip after 1999 and this is setting up a thread for post ‘99",
            "I'm not sure they *can* drop? I assumed they were all just purchased with currency",
            "Cue audio \"But Daddy, i love him!!!\"",
            "thanks",
            "Please hide this comment",
            "Hello /u/BigBadBodyPillow, your comment has been removed from /r/Warframe because it is an **[improperly formatted spoiler post](https://www.reddit.com/r/Warframe/wiki/rules#wiki_spoiler_posts)**.\r\n\r\nFor comments, use >! and !< before and after the spoiler content, in that order respectively. Do not use a space between the formatting and content. \r\n\r\n\r\n___\r\n\r\nIf you would like more information about this removal, please [message the moderators](https://www.reddit.com/message/compose?to=/r/Warframe&subject=Spoiler%20Post%20with%20Improper%20Formatting&message=Hello%20moderators%20of%20/r/Warframe,%0A%0AMy%20[comment]\\(https://www.reddit.com/r/Warframe/comments/1dfx2k0/-/l9711dd/\\)%20has%20been%20removed%3B%20I%20would%20like%20you%20to%20reconsider%20because).",
            "Oh damn! That's way quicker than I expected. Thanks!",
            "It's basically the Hate Incarnon projectiles reskinned for that quest, would be cool though.",
            "I am absolutely *in* for smaller sidequests that expand the world and lore of warframe without having some world-altering events or cataclysmic enemies to fight. Stalker definitely deserved some additional lore after being on the sidelines for so many years. I just think they oversold this one with all the \"we wanted to do this for years\" and \"Megan was crying for 5 minutes straight\" and \"absolutely no spoiler talk please this is so important!!!\" talk before the update launched for what was in the end just a short neat story whose primary purpose is to be a hook for future content.",
            "It’s bugged and DE knows about it. The BPs do drop from regular ascension tho, just not the event version",
            "Nah that’s on you.its a reply to a comment marked spoiler, which is under a post marked as spoiler",
            "Hate Incarnon projectiles are spheres that we shoot.\n\nthe Hate in the mission shoots wide beams like excals exalted blade.",
            "Yea I just discovered that thanks!",
            "Was there any official communication about this? I haven't seen this and have been running the event a lot :(",
            "It’s in their listed bugs for the update on the forums"
        ]
    },
    "Stalker at the supermarket": {
        "title": "Stalker at the supermarket",
        "score": 480,
        "url": "https://i.redd.it/8z32jt98t28d1.jpeg",
        "content": "",
        "num_comments": 24,
        "comments": [
            "I was not expecting to wake up see reddit and see this gem this made me laugh so hard 🤣",
            "I need a short sfm or something showing stalker and his kid's antics",
            "Living for stalker as single dad.\n\n\nChild proofing corners. Those little gates everywhere. Then remembers its a WARFRAME baby and panics about baby proofing for THAT.",
            "\"I made this.\"",
            "What will he buy",
            "Give us six seasons and a movie of two and a half men esque antics with stalker, stalkers kid and hunhow",
            "https://i.redd.it/gz92szvmz38d1.gif",
            "I just imagine the lights at walmart flicker....",
            "So cute!",
            "Spoiler, thank you",
            "I mean if I had a kid I would..",
            "Make sure there’s no blue orbs or a spare equilibrium laying around",
            "Growing Power, gotta get that baby’s strength up",
            "Oops I thought I did, fixed, thanks!",
            "Why are you on the subreddit if you dont wanna get spoiled?\n\nNever understood that logic.\n\n\"I dont wanna be spoiled so let me check the community that talks only about this game which gets a major update once every 4 or so months\"",
            "Growing Powder.",
            "Don't forget warm coat, for the chiily weather.",
            "I thank you",
            "this subreddit is home to many things. builds, bugs, events, tricks…",
            "Maybe even flow once the kid starts going to school, help them focus",
            "No, I thank you",
            "Builds change every update, bugs do, event itself needs you to finish the quest so it cant spoil you.\n\nWhats your point? Do the 10 minute quest and stop crying for spoilers.",
            "Do you know what crying is? The guy said thank you, twice! So you’re saying he was crying tears of joy? Relief? \n\n“Never understood that logic” \n\nman go iron your fuckin fedora",
            "Everyone was told ungodly amount of times to not spoil it. (In this case, it was an accident, we are over it.) \nBuilds can have spoilers? What's your point? Why should I have the quest completed if I want to check for weapon builds first?"
        ]
    },
    "Meet the Space family": {
        "title": "Meet the Space family",
        "score": 508,
        "url": "https://i.redd.it/da8dkcfkm28d1.jpeg",
        "content": "",
        "num_comments": 65,
        "comments": [
            "Don't forget to add our step family, the Entrati, into the lineage. Mother immediately was titled Space Step Mom upon release.",
            "I would swap Umbra and Teshin. Teshin is more of a Space Dad, white Umbra is that weird uncle who you see once a year - and half of the time he's in jail.",
            "Ordis is the best friend that you consider like an older brother",
            "Where CLEM!? he's like the cool cousin.",
            "U forgot grandma",
            "I'd say Umbra is another uncle we adopted. We don't really have a space dad",
            "Ordis is space dad #2 because he deserves it",
            "To me, Stalker has always been the brother who hates the family and wants nothing to do with us. So the little ball of cuteness is my sweet little nephew. \n\nAND I DEMAND TO BE A PART OF HIS LIFE, SHADOW!!",
            "We gave birth to our cousin 😃",
            "Now where would the Drifter fall in line here?",
            "Isn’t ballas technically “space dad” but he’s a bastard and we’d never call him that",
            "You forgot Ballas, the one who ,,made\" warframes.",
            "Isn’t grandpa also grandma?",
            "New genealogy of kings just dropped",
            "Nah, Umbra is that close family friend that nobody remembers how they met but is basically family, Teshin is space step dad and Ballas is space disowned dad",
            "Nah Umbra would be Space Uncle, Teshin would be Space Step Dad and Ballas would be Abusive Space Dad. Darvo is also a Space Uncle.",
            "ballas is the space dad not umbra",
            "What's with the Ordis erasure\n\nOrdis has always been Space Dad, and during the good 5 or so years he spent replacing the Lotus and looking after the Operator himself, he was Space Dadmom",
            "And let's not forget that Kaelli is one of Kahl's \"girl brothers\", which makes basically everyone in the entire system that isn't evil part of our extended family cause to Kahl everyone is a brother.",
            "Well, they did >!adopt us!<, in a way. Even gave us a >!name!< and everything!",
            "They even name you",
            "Nah, umbra and the tenno are space son and dad, cuz one killed his son and the other killed his/her parents. This makes them have a kind of sentimental bond where each one fills the other's sentimental void.",
            "And butler",
            "Clem is the neighbourhood weird kid we always go hang out with because we know his secretly cool as heck once y'know them.",
            "Clem isn’t in our family tree because we’re too lowborn for him",
            "TECHNICALLY it's Ballas",
            "Man in the wall is the obvious answer for space dad imo",
            "We have several candidates: Ballas, Teshin, Ordis. \n\nAlso Wally, but I don't like that option.",
            "nah ordis is babysitter hired by spacemom",
            "When Grandpa, his last ally in the family, forced him to cooperate with the Drfter was the ultimate betrayal",
            "Why do people keep saying that? Since The War Within, whenever the Operator is piloting a warframe, it goes inside them. That didn't happen during Jade's delivery.",
            "Same, they just older operator from a different timeline",
            "It should be added to the chart In a way to mimic that one meme with yearbook pictures.\n\nOperator.\n\nThe cooler operator. (It's drifter with glasses cosmetics coloured to resemble shades)",
            "You 2",
            "Stalker and jades child godfather (or uncle)",
            "Ballas is space step dad that no one likes.",
            "I mean, technically, we're the house pet.",
            "Canonically, Umbra walks around the Orbiter on his own when not in missions, so besides Ordis, he is with us 24/7. The latest quest confirmed this.",
            "Balls made Umbra and lotus,  so that makes them siblings?\n\nUmbra is our uncle who everyone thought was dead for the last decade until he just started living in the guest room.",
            "Umbra and Teshin are both uncles. Ordis is our dad. (taught us how to use the orbiter, keeps us sheltered, drives us everywhere, unsettling personality issues)",
            "Well, that's my headcanon of why Umbra is space dad",
            "I honestly feel like Wally is a better option than Ballas. \n\nBallas is the abusive dad. At least Wally is just the dad that went out for milk and cigarettes when you were young.",
            "Nah, Ordis is the annoying little brother",
            "Yeah. We've played Stalker without piloting him, why it had to be different with Jade?",
            "Checks out",
            "Technically no, Lotus does not recognize Drifter as the Tenno in new war, and Drifter also hasn’t formed a familial bond with Margulis/Lotus and doesn’t know Umbra at all. If anything they’re the cousin because Teshin is the closest to being their parental figure",
            "He’s the space weirdo that was perving on space mom for centuries",
            "Not even that, we’re a recreational appliance. They name us the equivalent of a Nikon camera",
            "Must’ve missed Umbra appearing at all in the last quest cause I did not see him even once",
            "Balls didn't make lotus persay, but yes ballas is also grandpa due to umbra...  Which makes umbras dax son our stepbrother",
            "Ordis is space butler. He had to step up while there was no space dad.",
            "Known abuser vs eldritch abomination who strong armed is into a deal to save our friends after his own realm drove parents insane. \n\nI do not like either option, and I don't which devil is worse.",
            "I feel like a more obvious thing is that we played as Kahl, and I certainly hope we weren't piloting him, that would open a huge can of worms.",
            "We are talking about what the Operator did and did not. What we do as players isn't always equivalent to the Operator doing it.",
            "I would've said am adopted sibling because they kinda grew up in another place and then left to be part of this timeline and \"family\" in place of the tenno despite not being helped and raised in the same way",
            "Nikon camera/usb stick",
            "Nah it's a voiceline by Ordis, proving that Umbra also walks around in the orbiter.",
            "But, the known abuser was part of the group that sent us into the eldritch abomination's realm in the first place.",
            "Queens",
            "Yes, it's what I'm saying.\n\nWe play as Stalker, but the operator doesn't control him. Why the operator would be controlling Jade in the minigame when we have already played as Stalker.",
            "missed opportunity to have Umbra be the sentry Stalker slips past then. Bit naff we get told rather than shown that",
            "It did show us in the transferred pod reacting at the same time despite not being there. Maybe we did control Jade to assist with the birth",
            "I remember reading a comment that sounded cool, when the Stalker finds the operator and holds them at Scythe point, it pans back a bit further to show Umbra holding the Stalker at sword point the entire coversation",
            "My god that would’ve gone so hard. I’d love it",
            "Come on.\n\nIt would've been more acceptable to see him reading the paper while spitting out his coffee during that scene."
        ]
    },
    "Jade Eximus are getting out of hand (kind of a rant)": {
        "title": "Jade Eximus are getting out of hand (kind of a rant)",
        "score": 998,
        "url": "https://v.redd.it/9fdad6wob18d1",
        "content": "So I don’t ever post on my Reddit account but I do sort of lurk around reading posts here and there and I’ve been reading different reactions to Jade Eximus. Personally, I found them fun and encouraged more active gameplay out of some of the more afk builds that are becoming more common, and introduced an actual challenge beyond extreme level/ armor scaling. But THIS was so bad I had to post it somewhere hoping that this is some sort of bug. And this happened to me TWICE beforehand. \n\nExplanation (skip this paragraph if you can see lol):\nIn this clip you’ll see that the Hyldryn is staying on the target to provide shields to the defense target while I cast Tentacle Swarm to provide crowd control in the area while I go to kill an Eximus that was in the area. Another Jade Eximus appears and (apparently from BEHIND A DOOR) targets the Hyldryn and in FIVE SECONDS absolutely shreds the defense target, causing the mission to fail. The eximus I tagged was the only one I could see in the area.\n\nIn what universe is this fair? An eximus that can attack from what appears to be more than double my cc range, is not effected by my cc anyways, and can shred a defense target faster than anyone can have the opportunity to react. I’m happy to have challenging content but this is just excessive. I understand that it’s not good for allies to stand on the defense target as it can get hit by stray bullets and draws more enemies to the target but even in those cases you have a good while to clear the enemies from the area or move before it gets out of control. It’s actually kind of ironic because the Jade Eximus seem to be made ignoring all the restrictions most warframes have to follow. They have incredibly strong damage with no obvious LOS check all with ridiculous range. This isn’t a challenge, it’s just straight up impossible to handle. \n\nSide note: Why do eximus abilities effect defense targets anyways? They’re already difficult enough being immune to all cc, I don’t see the point in them nuking the defense target too.",
        "num_comments": 436,
        "comments": [
            "This will probably get buried under all the comments here but allow me to clarify a few things. \n\n1. The damage is perfectly fine on players and as I state IN THE POST I absolutely welcome a unit punishing AFK players \n\n2. My problem is not that it punishes AFK players, it’s that the punishment ends the game for everyone who’s actually playing properly \n\n3. Im not the hyldryn? I know how to play around the eximus? Im genuinely confused at how someone else going AFK is MY “skill issue”. \n\n4. Just to be absolutely clear: if the hyldryn went down as punishment for being afk, maybe even a noticeable amount of damage to the objective to encourage players to rally back to the area, that would’ve been fine. It’s the fact that the game ended faster than I could even notice the health bar depleting that’s bothering me. \n\n5. No “just subsume” is not a good counterpoint",
            "I see too many people saying \"don't afk on the objective!\" Like the person is just unaware, but what if they do it on purpose?\n\nThis is an extremely effective grieffing tool and will absolutely be used as such, let's see how those opinions change when people start trolling on purpose",
            "I agree completely. My genuine concerns with this isnt that it’s too strong, it’s the ability it gives the toxic players for griefing. Anyone who is targeted by the jade eximus who wants to fail the mission for everyone now can. I hate that there is toxic players in this community but it is a sad fact. I’m assuming they are going to remove its damage on defense targets when they realize this. \n\nSide note, don’t just say play solo. If an enemy is forcing the entire player base to play solo it’s a problem with the enemy.",
            "I thought we collectively had a conversation about why being AFK on top of the objective is bad back in what... 2015?",
            "People all talk about \"anti-afk\", since when stoping for 3 seconds is being afk? You stop to respond a message and you are dead, you want to write something to squad, you are dead, wanna use Mesa's 4 for more than 4 seconds, you are dead. I think its a cool mechanic but the damage is off the charts. I played Belly of the Beast on SP for a day and it looked like a green laser hydra, you shot 1 laser and 2 more would appear, i think i spent more time looking up and destroying lasers than playing the actual mission.",
            "DE on Warframe abilities: \"Oh no no no NO\" you can NOT hit enemies that are not in your view !  \nDE on eximus:  \"Yeah so this cool laser will target the player across the walls\"",
            "One of the most frustrating threads I’ve seen on here\n\nJust play solo\n\nJust subsume silence\n\nJust stand on the platform the whole time and babysit\n\nJust get better teammates. Try discord!\n\n\nSimple answer is that it does less damage to the objective. \n\nThe same try hards saying this shit are the ones that complained about circle killing netracells. You *liking* that boring ass content that you HAVE to play solo since those bad teammates drove you off?\n\nThis will be patched though. I can’t imagine DE will keep that in once the fails start rolling in. If not, this will be the first post of many…",
            "While I agree that they shouldn't be able to target you through doors or walls this is 100% on the person who just stood there while the beam charged up and didn't bother to move. All they had to do was not stand still once the beam started. Just slide to the left.",
            "Defense objectives in particular have always been garbage at being able to take a few hits at high levels. \n\nThe defense objective on Akkad can tank an entire wave of the infestation, compared to this scenario where the objective has *even more health and shields*, I think a great fix for this kind of thing would be to just change all objectives to the same health, and filter enemy hits so they deal a certain portion of the objectives health at any time.\n\nThere is no scenario where the defense objective should be one-shot by ANY enemy.",
            "The OP's video literally proving how unfair this new eximus is: while trying to \"punish\" the afk, but also involving everyone together. It doesn't solve anything, just makes it worse.\n\nMeanwhile the majority is saying: \"skill issue\", \"yep I love the new anti-agk mechanic\".\n\nBro is the problem the afk? Kick them out asap instead of this bs. It's completely unnecessary and we already had 2 different eximus that targeted you with damaging bubbles. Rocket League for example doesn't even wait 1 minute to kick afk players.\n\n-Nothing stops the afks to be dead the entire mission while you complete it for them. Or respawn right at the end.\n-Neither them running some immortal frame like Revenant and doesn't helping for any reason.\n\nI know those things because I've been getting those afks on my squads, especially the first case. I got some prints and clips from a guy just running around on sp circuit, not that would change anything. Still I'm right here having my invisible operator taking dmg while reviving a squad mate, then instantly being dead when going back to frame, resulting on two people down.",
            "Yeah \"skill issue\" blah blah, in what other way can another players skill issue cause YOU to fail in this game? This is absolutely a problem that needs addressing.",
            "Playing pubs is going to be annoying for a while, de just gave all the griefers the perfect tool.",
            "People really are saying “skill issue” when it wasn’t even OP who stood still on the objective but the Hildryn. How do people not think it is an issue when all it takes is 1 random teammate to fail the entire mission for everyone else? And I don’t mind anti-AFK, but this ain’t it",
            "I swear the Tenno in this section screaming \"SKILL ISSUE\"  and \"DESERVED FOR AFK\" forget that OP WAS NOT THE AFK ONE.\n\nObjectives in this game can be paperthin, but we know the threats. We can see them. Most require LoS.\nThe jade eximus is blasting the objective (thanks to the afk one) from a different realm, all the while the team is engaging with the game and looked away for a sec.\n\nBy the time the objective HP really dropped, it was too late for anyone on a different side of the map to intervene.\n\nThis was not a Demolyst, this was not a Hemocyte or something else that is a boss unit, it's a god damn eximus, a random elite enemy.\n\nSo, in a mission a player can, either by malice or distraction instantly end the mission for you in the time you look away, no warnings because that's a \"elite random enemy\" and the objective doesn't give any warning sound off.\n\nImagine if I could simply void dash the capture target off the map and he doesn't get respawned, but instead is deleted, mission failed. If i could actively add NEGATIVE progress onto an interception console.\n\nThat would be horrible, that would be dumb. \nI'm not playing league of legends, i don't play Warframe to be at the mercy of some random guy.\nThis has to be changed, it has to, or the incursion of trolling and frustration would be catastrophic for the game's health.",
            "This has too much grief potential. It shouldnt do damage to defense targets",
            "So THATS why I lost that one defense. And it was the Octavia's fault too who had a complete meltdown in the chat after and said he'd write a ticket and report the rest of the squad xdd",
            "I lost Scimitar Engines to this...",
            "They should probably work this out so it doesn't do damage to objectives at all... I can easily imagine one of the lasers going off on a target while following a moving player that doesn't even know there's one behind them. Wrong place wrong time wrong target sorta thing.",
            "This green laser can be a huge problem if you were accidentally trying to run away from it and if you run into mission objective like in Defense, Mobile Defense or Hijack and the laser following you and destroyed the mission objective.",
            "After all these years of problems specifically with defence missions and the many many times they've had to change mechanics and scalings, to still have issues like this... it's ridiculous. They already have a solution to it in the new ascension mission too. Let the defence point respawn after a hefty downtime hell even make that round reset as punishment. It's time to change defence missions",
            "While I do agree that eximus abilities probably shouldn't damage objective but considering your teammate:  \n1. Went AFK on an objective  \n2. Didn't react to the beam startup sound  \n3. Didn't shoot the beam down after it appeared\n\nI'm just gonna call skill issue here. They made an anti AFK mechanic and it's doing what it's supposed to do. Just don't AFK on objectives and you'll be golden, aye?",
            "If this is the new anti-AFK system, then I'm all for it.",
            "I’m hoping this will force them to make our healing an defense abilities work on defense points again.",
            "It's Blitz/Volatile Eximus all over again. I don't get why defense objectives can't just be immune and untargetable to Eximus.",
            "There's no reason for the beam to be able to harm defense targets. 11 years later they should understand shitty player will do shitty things and troll.",
            "Lot of people speaking about \"skill issue\" when the problem is way more about potential trolling and ridiculous damage to objectives. The beam should not increase damage done on any defendable objectives (defence/mobile defence objectives, rescue targets, excavators, etc...). That Hildryn should have died before the objective.",
            "I feel like these eximus wouldn't be bad at all if we had some kind of tell. Arson and blitz eximus shout and you know a wave/blast is coming from THAT ONE eximus. \n\nWith jade eximus there's no line of sight to the enemy. You don't know which one is targetting you because they can do so from behind pillars and WITHOUT BEING ON FULL ALERT LEVEL. I've had them target me when the enemy didn't even know where the fuck I was. I've had them target me alone in a room with no visible eximus from the door whatsoever. You basically just get fucked by a random laser that moves and does too much damage for it to be worth emptying a full clip on the orb that spawns it.\n\nAlso nothing else in the starchart deletes defense targets like this so of course no one is going to be always looking at its health bar. By the time hildryn notices the target is dying faster than herself she might be stuck mid-animation",
            "Sooooo am I allowed to say skill issue here? I feel like I am",
            "This happed to me in a Defense on the same map. We're nuking the piss out anything with in los like good Tenno do and then during the final round the objective gets nuked by a Jade Eximus from \"some where\" and thats that, we fail.",
            "Is that Mahoraga?",
            "It is actually a pretty good counter for AFKers and people with afk builds with frames like Vauban or Saryn that just push two buttons and do nothing more in some missions.\n\nBUT this feels really extreme.\n\nFirst of all, it punishes players that go afk even for no more than 10 seconds, just any real life thing that requires the slightest bit of attention can get you killed ingame, changing music on another tab, responding a message, or anything along the lines. \n\nSecond, even if it's a no brainer to not stand on the objective, this mechanic can make an entire team lose due to just 1 AFKing, making the afk griefing much easier and more punishing FOR THE REST OF THE TEAM. \n\nAnd last, I just saw another post on this sub talking about eximus units just straight up ignoring defensive habilities, while the player can't do the same with them. That made me instantly think of the lvl 30+ solo defense with 0 damage on the objective riven challenge, that I've failed so many times due to a fire eximus ignoring Frost's shield and things like that. \n\nWhile I absolutely love the addition of this new Jade Eximus, I don't feel like it makes the game more challenging, but rather a pain in the ahh most of the times, still think it might not need to be \"addressed\" by the devs, maybe just a little tweak and give the community time to adapt to them",
            "I think the beam would still work as anti AFK measure if it didn't damage objectives, only players standing on it",
            "All of this Anti AFK talk is good and all, but DE forgot that 90% of their player base are extreme casuals who cant be bothered to constantly move around and pay attention to everything around them",
            "If our skills can't be allowed to work without LOS, why can the enemies?",
            "Yeah, i think i will be playing my silence Xaku a bit more now.",
            "The only thing that truly gets put of hand this bad in warframe history is......\n\n*HOLD UP!! GLASS RESONANCE!!\"",
            "Completely unrelated but, is that a mahoraga cosplay?",
            "Defence targets need damage gating. The damage they receive per second should be capped.\n\nThey also need some form of massive damage \"shield\" at 50/25% to give a few sec to deal with the problem.",
            "Maybe it could kill a bit slower, I could see that being adjusted.  But that was the Hildryn's fault for being afk on top of the defense target.\n\nA bright green alien abduction beam appeared on their screen and they did nothing. You just shoot the beam, or move 5 steps away.",
            "Who's that goober Hildryn that isn't even moving away from the defense objective? Like he's just standing there.",
            "man if I could see the player name of thse \"skill issue\" peeps I would just drag a beam onto the def target purposefully and when they get salty I would say it is THEIR skill issue and not my griefing tool!",
            "Your team mates is a dipshit. \n\nThat's all this clip shows. \n\nIts so funny seeing all the rage this stuff is generating. It isn't hard at all to avoid.",
            "Those beams can be annoying on spy missions. I was hacking a terminal while playing Ivara (I think my energy runned out) and one of those killed me while the eximus was behind the wall",
            "God damn it, Loki should be now soo meta. He can just teleport dumb teammates away from defense target!",
            "Old habits die hard",
            "I'm not keeping with all changes in recent years, but failing defense on like 20th wave - does it deletes ALL rewards prior? What about relics and their rewards?",
            "What not a lot of people get is that the damage on it is exponentially scaling. Doubles every second til you deal with it. So either shoot the eximus, or shoot the orb.",
            "They could just make it to not damage the obj...",
            "They said they fixed this .... hah..",
            "Had this happen to is and the guy who was standing on the defense started boaming everyone for not protecting it while he was who caused it",
            "Oh... they can damage objectives? I hoped that wasn't the case, so people couldn't troll.",
            "Griefers can now grief on defense and probably excavation to fail or extend the run.",
            "Agree but heres a tip if someone decides to be like taht or just in general. You can destroy the lazer by shooting it and shotguns seem to be the best as they one shot it (atleast mine do)",
            "they should just make it so jade eximus beams don't affect defense obj's and just keep it as good ol' fashioned enemy guns and physical attacks.\n\nwe don't have to overcomplicate how the jade light functions any further, just disable it's damage on defense obj's. I would also suggest defense abilities actually deflecting/nullifying the beam as well, but the former should be applied first because you'd be screwed if no one on the team didn't bring some sort of barrier frame in defense modes.",
            "Easy, DE just need to code it that the Beam won't target mission relevant objectives or exclude the damage from Jade Light from Mission Objectives.",
            "So that green light kills frames?",
            "Ever since the eximus rework back when blitz eximus would just nuke objectives, I've been of the opinion that eximus abilities shouldn't be able to hurt defense points, considering you can't even CC eximus units either. Even Frost's bubble won't do anything about the jade light, there's not really an effective way to protect an immobile point from the light, especially since the beam doesn't have a line of sight requirement nor a visual to determine which unit is casting it if multiple are present (at least not that I've noticed).\n\nAt the absolute least, the light shouldn't have its damage ramping on defense targets-- that's not even difficulty at that point since the target can't be shielded from it and can't move out of the way, a single dingus can ruin it for everyone as it is now.",
            "I dislike it because it kind of messes up texting on consoles where you sit still for a while. Sure I could go into the operator and circumvent this but I feel like that's more of a bandaid solution and you shouldn't rely on knowing certain game mechanics just to be able to text safely",
            "Simple. Don't stand on the objective, and it's as easy as usual.",
            "Does Gara with mending splinters help heal objectives or does she just provide DMG mitigation ?",
            "You can shoot the top part of the light and it just dissipates/disappears.",
            "Use silence. It's noob and grief proof.",
            "I honestly think it should not hit objects like that. The light moves so slow and the damage scales so fast. We tried the Hijack for Belly of the Beast and every time the laser would end up inside the objective and melt it in seconds. We tried to keep it away, but we had to defend and charge so someone had to be near it and all of the lasers at the same time made it ridiculous to manage.\n\nThe damage can be managed, but in comparison to all other eximus, the jade are insane when dealing with defense.",
            "Naa please buff the objectives so they don't get melted. Excavation can be unplayable. This is not fun",
            "so does no one know you can shoot the beam origins to stop them?",
            "I’d play if I wasn’t banned /(",
            "I will throw my Vauban boost pads and throw these people off the cliff\n\n*I miss my pinball trampoline..",
            "i have lost about 10 defenses to this by now and every. single. time, i have warned my team mates about it and they just do not care. at this point, i simply skip defense because solo in SP defense takes longer than just running another 2 belly missions.",
            ">DE adds a eximus that punishes player for standing still  \n>stand still EXACTLY on top of the defense target  \n\"why it ded?\"  \ni wonder why, now go and post on reddit and make it sound as its DE's fault and not of your team mate that is doing nothing at all",
            "I'd say it's not your fault because it seems like Hildryn was not moving on the objective, causing the objective to be affected and killed by the green beam. I'd say they can fix this by not letting the green beam hurt the objective or at least, take significantly less damage from it since it cannot move so people like this Hildryn can't grief other players into losing.",
            "What are we looking at?\nI need an explanation",
            "Crying babies...",
            "it's great  \nkill the eximus, shoot the orb ontop of the deathbeam, or move  \nif you can't do one of these three things then it is a legitimate skill issue",
            "Those beams only target players, not defense targets. Don't be an imbecile and get away from it! Please, stop complaining about ANYTHING that tests your skills as players.",
            "Exilus abilities shouldn't be able to damage defense objectives, or at least THAT much I agree with you on this.\n\nBut to AFK near the defense objective? Here's some advice, don't. You clearly know that those damn orbital nukes can and will disintegrate you if you let it lock on to you long enough meaning that you have to move, not stand near the god damn defense objective and let it get fried along with you.\n\nTl;Dr skill issue",
            "This thread's crazy. While I do think 4 seconds is a little too fast depending on where you are on the map, it's not that hard to get to it. I used to play Gauss Prime in Steel path Void Cascade and I could go from objective to objective in 10-15 seconds tops assuming I don't hit my head on too many walls. \n\nThe other thing I have is with this hatred towards afk playstyles. While I do agree that it's better for people with two button stay in one place builds like Saryn to go solo, just as how you like to run and gun around the map, what makes others happy and feel powerful is staying in one spot and watching mobs die. Just because you don't like it doesn't mean people should be punished for it. It was the same when Kuva Bramma and Zarr were at the peak of their power. It was peak in terms of enjoyment I had for the game and they just nerfed it because people were crying that they couldn't do anything (??) while people destroyed the whole map with bramma. I just hate it when devs listen to the people that listen to people that aren't even doing the hardest level content in the game, and fuck it up for the people who do. Kuva Bramma in endless in steel path and even SP Void Cascade was so much fun. Hell, in endless I could've just gotten someone with bramma and solo carry for 15-20 minutes while we either watch something on our phones or second monitor and switch out. It was so good back then not only because of how strong it was but how convenient it was. It's not worth running it these days if I have to get all ammo economy mods I can shove onto my build and also carry ammo refills if I want to have the same experience as back then.\n\n  \nRant aside this doesn't even look like steel path, so idk. One thing I want to add is if you don't like that someone is doing an afk build, what's stopping you exactly from dipping and requeueing? You don't get a penalty for leaving the mission before it ends anyway. In a way, crying for the devs to punish afk players is the same thing as what the afk's are doing. You are not any different. You can just leave and requeue, simple as that.",
            "have you tried protecting the objective",
            "Obviously you need your full team sitting on the cryopod, this way the jade beams will nullify each other for sure /s",
            "Have you tried shooting the eximus. To death preferably.",
            "this post ha to be bait come on, AFK Hildryn  and you're mad??  one single shot to the laser is enough to destroy it...",
            "Idk how the game works that well bc im pretty new but idk if this is crazy or not but because of those eximus I got an 18 million damage hit using wukongs one ability where he reflects damage. The most I'd ever done before that was 22k (not sp)",
            "I just hope that their are temporary to the event \nThey are really annoying if you have to stop moving for a sec for any reason.\nLike half the game content is (wait for x seconds here) and now the game has a very punishing unity to that behavior.",
            "Quite a few commenters in this post don’t have an IQ that goes past 60 as the point of the video either goes straight over their head or they mental gymnastics gold medalist why it’s somehow overblown.",
            "Why I could only think of \"get wrecked loosah\"",
            "[deleted]",
            "It's as easy as not standing still on top of the defense objective \n\nThey should change it tho, not because of difficulty, but to avoid griefing. The defense objective should 100% be eimmune to it",
            "Your team mate should try playing, he had the eximus in his sight.",
            "Yes, heven forbid you afk on top of the objective against the elite spawn that is specifically made to counter afk/stationery targets in a movement based shooter...",
            "It should be even more deadly",
            "Well then. That new Anti-AFK system is doing wonders this time around",
            "Another reason for playing solo.",
            "Well, it's the Jade Light we're talking about here. Its purpose is to turn things into mist and gore after all.",
            "Before the nerf, I agreed. They did way too much dmg. After the nerf, they are perfect. It now becomes a skill issue (rare in warframe) if you can't not die to it.",
            "Op has some fair points from my perspective,but why can’t it be like a fun kind of difficult to deal with? Like I think the idea of some eximus being worse than others is pretty cool",
            "Sitting duck... 🦆 The idiot on top of the cryopod just stand there like nothing is happening. If you see a jade light forming up, don't stand over the target...just go full doom slayer and keep moving around!",
            "1. Dont afk RIGHT ON TOP of the defense objective\n2. Dont afk and help exterminate the jadelight eximus targets, at least in particular \n3. Do consider rolling guard to get it off you for a couple of seconds.",
            "damn imagine that the game about moving around and shooting wants you to MOVE AROUND TO NOT GET KILLED AND SHOOT TO KILL ENEMIES BEFORE THEY DO SOMETHING TO YOU OR THE OBJECTIVE",
            "Anyone else leanr you can shoot the beam if you aim at it's epicenter. BUT it's insane I felt like the only thing keep the point alive last I played was the warding halo augment. Those jade beams are no joke for damage and man do they move fast.",
            "\"Side note: Why do eximus abilities effect defense targets anyways? They’re already difficult enough being immune to all cc, I don’t see the point in them nuking the defense target too.\"\n\nThey target afk players and hildryn was afk.",
            "Jade Eximus can only target players as far as I'm aware. \n\nWHY IS ANYONE STANDING ON THE DEFENCE POINT!!!",
            "Reason #8275 to play solo.",
            " You lost because a players actions having the consequence of giving an enemy eximus the perfect clean shot of the AoE on the defense objective. It’s a justified mission fail. Got you guys dead to rights.\n\n DE told us the AoE was significant and dangerous, even to a long time player, and it is.\n\n I recognize it might seem crummy to you, because you feel you didn’t get a chance to do anything. I’d like to remind you, you were doing a thing at the time the mission wiped. It was another player doing something much less helpful than you that lost the squad the mission.",
            "I dont think this was a Jade Eximus thing, I think the person at fault here is your Ally.",
            "verdict: don't afk on top of the defense objective.",
            "The problem isn't the eximus. It's the cretin hyldrin afk on the point\n\nSkill issue",
            "That's completely on the players, lmao \n\nWhy do y'all just stand around, even more so on top of the objective?\n\nEnemies target you, being on top of the objective you're meant to be DEFENDING never made sense to me 😭",
            "just use limbo? or frost?",
            "I see the problem here\n\nI didn't see them killing the Eximus",
            "This, in my honest opinion, is just ksill issue.  \nYou do NOT go AFK on the objective, ever.  \nBut also.. I do hate the new eximus, it's just not that fun, it's annoying.  \nI've yet to ever die to it, or be in trouble because of it (thanks to my Saryn healing like she has no other choice), but it's just.. yeah, not fun for me.",
            "That's a problem *with AFK player*. Jade Eximus units working perfectly as intended.\nFuck AFK players.\n\nEdit: there you pedantic little bitches, the core arguments still stands. Reddit nerds are being Reddit nerds again...",
            "Me stay on the defense target and me no shoot the green laser that's coming after me and the objective because me afk :) me complain because I can't afk in this game, Game bad :c",
            "Imagine doing a 20+ wave defense and someone decides to be a little mischievous and stand on top of the objective on purpose to fuck with you\n\nPeople missed the point so bad in this post I may start trolling on purpose just to REALLY get the point across",
            "Sweaty tryhards in this thread going around acting like 4 seconds is enough time to notice the objective being demolish and then react to it. \"IT'S A BIG GREEN LASER JUST SHOOT THE ORB\" my dude, there are enemies all over the map, do you really expect everyone to keep their screen trained on the objective the whole time?  Naw.\n\nAlso in the video the orb is in the rail.  So like.  Not even sure if it could have been shot even if you did notice it.\n\nKeep up the good fight, my man.",
            "The amount of trolls here is why I won't trust anyone here for game balancing and feedback.",
            "I think DE should make it that only the player targeted gets damaged or that objectives get less damage from jade light",
            "The Warframe community is so goddamned toxic it's unreal and nobody wants to admit it.",
            "Just subsume your teammates should work fine",
            "People disagreeing with you are crazy delusional. Yes, staying AFK is bad, yadda yadda, but this kind of interaction where other players can't do shit to react (seriously, 5 seconds and it's an instant mission failure!!!) either shouldn't happen or the damage should be massively downgraded against defense targets. When eximus got reworked and we got Blitz eating through defense targets health bar like popcorn, people were (rightfully) angry and begged DE to either nerf them or buff the target's stats. They listened and defense was finally doable, especially in Circuit. We need to cause the same kind of uproar against Jade Eximus.",
            "It makes sense to punish afk players but I just don’t like to move sometimes, I use a controller to play and moving while aiming can be difficult for me. Normally when I shoot an eximus I stand still so as to not miss as many shots and I normally have enough dr to kill an eximus but with the jade light the beam kills in like 2 seconds or less, can’t they make the damage ramp up slower? Like I understand not making it weaker but like at least allow me to live long enough to move because if the beam doesn’t kill me, the heat procs do",
            "I mentioned this same exact thing in discord and basically everyone told me to\n\nA. Not AFK (i was not the one getting hit by the laser)\n\nB. Just shoot the laser LMAO skill issue.   \n  \nThis would be fair but why do i have to babysit other players because they decide to afk near the objective? And if I dont we all lose the game.\n\nI dont even know. I really like the new units and im all for difficulty but shredding objectives in a couple of seconds because of one person just feels bad.",
            "You can stop the beam by destroying the bubble it comes from if this helps. The bubble is ontop of the beam.",
            "Unfortunately you have to babysit the objective and be prepared to shoot lasers weak spot. It's not a skill issue that your teammate is a dip shit. Still totally avoidable though.",
            "I dont even think It works as anti afk tool,,,, apparently with some adaptation and a bit tanky frame you can just stand in it. Only people It actually punishes are the ones who try to play the game on steelpath with less tanky frames.   \nSo if people want to afk they just do so, I had people stay on the platform afk for belly of the best for the whole mission while i bust my ass off, as an act of defiance I didnt resurect them so they just stayed dead till the end of the mission and got rewards anyway.... I dont like this.",
            "This happens in Sorties with rad hazards too btw.",
            "Obligatory \"it's fine, just shoot the orb\" comment",
            "Report them. DE will eventually take action.",
            ">Side note, don’t just say play solo.\n\nPlaying solo was never the solution for dealing with griefers unless you're pressed for time and need something done right and fast, then it is a genuine option. Play public, report griefers, purge them out of the community.\n\nGenuine mistakes happen but a player getting reported for a mistake once or twice is unlikely to face consequences, a player that keeps getting reported for making the same obvious, mission failing, mistake over and over is either resistant to learning or doing it on purpose.",
            "On the other hand, those toxic players better not troll much, because they will be reported",
            "Look, I'll always say what I think about random multiplayer: you're always gambling. If you get a dick, you get a dick. The jade light is indeed an annoyance. It's supposed to be. It's supposed to promote active play. The thing doesn't even seek anything out but players. The light can be destroyed by shooting it, killing the eximus, or you can just dodge it. It's a genuine skill issue if you need to use multiplayer AND can't stope the easily stoppable Jade light.",
            "Can you repeat said conversation here please?",
            "Afk, yes, obviously, but never heard anyone complain about being on top of objectives prior to now.",
            "man I jope noone will use this to troll on your runs!",
            "Yeah, even back then blitz eximus were notorious for (nearly) one shotting defense objectives.\n\nJust simply.... do not exist near the objective. There's no reason to, you can stand elsewhere and fire upon anything that goes near it from afar. That both draws aggro away from the obj, and eximus effects won't go near it.",
            "my experience also",
            "tbh yes especially on less tanky frames, I play volt and after my 4 I need to instantly bulletjump across the map otherwhise I will just die because the shield heal from 4 just isnt enough to keep up with the laser, and its the same for everything I want to do. Want to use a shiled and grab it? than you better move fast right after It becuase there is 3 lasers comming",
            "when the damage was bugged i got killed multiple times just trying to waypoint a kuria. no way to know what enemy should i take revenge on too.",
            "Sometimes i switch tabs to change podcast or stream im listening and it can tike 5 and sometimes 20 seconds. Same with songs.  But that doesnt mean im not playin and infact i usually tell others that \"i need to change something afk for couple seconds\". Havent played any defense missions with jade eximuses but so far it looks miserable in bad way",
            "Thanks for using your brain, i swear those tryhards want to foster a state of perpetual sweat, anger and griefing.\n\nThe damage is exponential, these jade lights will fry anything given enough time on ANY difficulty.\nI get being absolutely NUKED on netracells, because i chose to go to tryhard city, i get lategame scaling and having to be on your toes.\n\nBut warframe usually is a pretty chill game allowing players to dictate their own pace. This unit dictates panic pace any time there's a defense objective, since one player can end it all for you.",
            "i hate the \"just play solo\" like bruh over half the missions I play on pubs are fine. I'm not gonna suck all the fun and convenience out of the game just because of the godawful wisp, dante, and wannabe-speedvas I meet.",
            "Slide to the right.",
            "In what other way can another players actions cause you to fail? This is absolutely an issue that needs addressing.",
            "Correct, it is on them and it's still not acceptable on DE's part.   \n\n\nYes having bad players can reduce how well a mission goes, but you shouldn't *fail it in a few seconds* just cause a new/afk/just texting for a few seconds player was on the objective",
            "\\*\\*EDIT: It seems like people read this and think I'm advocating for AFKing, so let me make this clear: I'm not.  I'm advocating for being able to take a four second pause every once in a while because life exists outside of the game.  Certainly, you could pause in more convenient locations than others, but a misplaced pause shouldn't end the mission.  Having a defense objective go from 100% to 0% in four seconds flat isn't good game design, no matter  how inconveniently you've placed yourself. \\*\\*\n\nI will push back on this a little.\n\nPeople need time to sneeze.  Or take a drink.  Or go to another tab for a hot second and go five seconds back on a video 'cause they missed what was said.  Or talk to a loved one.  The game shouldn't be so punishing as to force people to be glued to a screen 100% of the time, excluding all other inputs in their life.\n\nFuthermore, the beams can charge up from off-camera, and the noise isn't audible if you have the volume down low. (I keep my volume to a point where I can hear gunshots and a handful of sounds and not much else; I had no idea that there was a charge up sound for the beams until someone pointed it out in another thread.)\n\nAnd, just in general, the beams shouldn't do this much damage to an objective.  Nothing should.  That shit is wild.  Even if they noticed and slid to the left, it would still do an incredible amount of damage to the defense objective as it followed them, leaving the objective in a much more vulnerable state for future rounds, wherein another beam can just casually pass over it and end the mission in just a few seconds.\n\nI'd be astounded if this isn't hotfixed soon (or, if it hasn't been already).",
            "this right here",
            "Operative defense, mobile defense or hijack missions are about to be HELL on wheels.",
            "you ask how these mistakes get repeated I just point to the glassdoor reviews.",
            "While I completely agree with you, I still think it's a pretty harsh punishment, he made the entire team lose due to his own mistake. \n\nI've found myself dying to the jade eximus for standing a hot 3 seconds while I was changing the music I was listening or responding someone's message on another tab. I know that's fully on me, but since jade eximus have been added, the times I died doing these things went from like 1 of every 20 times to basically 4 out of every 5 times. And that's kind of annoying",
            "Yeah but going from full health on the objective to failure  in 5 seconds feels a bit harsh. I’d prefer if the punishment for a player going afk was the player going down, rather than complete failure for the whole team faster than anyone would be capable of reacting to",
            "The OP didn't AFK on the objective. However, because of one AFK, the entire party has to suffer. Since Warframe **still** doesn't have a kick option, this is just not right.",
            "🎶Goldeneyeeee, I found his weakness\n\nGoldeneye, he'll do what I please\n\nGoldeneye, no time for sweetness\n\nBut a bitter kiss will bring him to his kneeeeees🎶",
            "so you want people to be able to troll objectives by killing it with the jade eximus ability. yeah that will work out well.",
            "The whole team shouldn't be punished for the mistake of one player standing on the objective for a few seconds. The player was AFK, not the defense objective or anyone else, let the player who made the mistake be the one punished for it  \n\n\nAlternatively you could always run Loki so you could just switch teleport them off but... No",
            "Should fuck up afk players, not objectives. The latter screws over the team more than the AFKer.",
            "One player AFKing shouldn't force three others to fail the mission.",
            "DE has always disliked AFK and if this is another tool against it, that's hilarious.\n\nI just hope DE doesn't nerf the light into being pathetic. It has 3 methods of counter play, it should be allowed to do serious damage.",
            "\\*new griefing tool.",
            "yeah its an amazing idea to let trolls ruin 3 other peoples game. nice",
            "One player's skill issues shouldn't force three other players to fail.",
            "Yup.\n\nEveryone, repeat after me.\n\nSKILL ISSUE.",
            "am I allowed to grief all your def missions with this?\n\nI feel like I am.",
            "this has to be one of the rarest occasion that its correct to say skill issue",
            "After the nerf(it’s a bug fix but feels like a nerf) probably yes.",
            "Yeah, literally silence banshee would fix this problem and even help squad with weak point debuff.",
            "It is indeed",
            "hell, you can't even reply to a message with more than 3 words before this beams in.",
            "It gets worse when there are situations where you are not AFK but forced to stand in a spot and can’t move, yet the beam can spawn above you and burn you down. Had that happen to me on Deimos while grabbing the bait from the device for a vault run. Cleared all infested around me with none in sight or on the radar. As soon as I pressed the button to grab it, a jade eximus spawned out of sight and radar to dropped a beam on me. \n\nCouldn’t move because I was stuck in the animation and once that finished I was downed instantly. It spawned on the other side of the mountain with no line of sight or notion I was in the area and I only realized that once I panned around to see the green infestation lurching towards me after I was downed.",
            "Then they shouldn't be playing on the XP farming node",
            "You don’t game much do you? Thats been a common occurrence for a LONG TIME",
            "so punish the hildryn and not the whole team?\n\nwhat is soo hard to get about that?",
            ">DE adds a eximus that punishes player\n\n\nIt would be fine if it punished only the player standing still. Instead it punished everyone. That is a problem.",
            "if you had eyes and more than 2 braincells you would see that it was not op who was afk",
            "Guy stands on defense target, jade eximus hit guy with jade laser. Jade laser goes through guy and hits the defense target. Defense target dies, mission fails.",
            "Or silence",
            "This is literally a form of griefing, there's no need to make it damage the objective the player dies anyways",
            "I literally wrote that’s I’m really happy about the challenge. I’m not happy one player can single-handedly ruin the whole mission",
            "I clearly know that cause I’m not the one standing there. So why is it that- instead of the singular player being punished- the game ends faster than you can glance at the health bar?",
            "Have you tried watching the video? With open eyes preferably.",
            "So the AFK Hyld should go down, die, and not get mission rewards.\n\nEveryone ***else*** playing shouldn't be punished because of one jerk on their team.",
            "That’s the problem. A single shot to destroy the afk hyldryn? Absolutely welcome. Ending the game in 5 seconds because one person doesn’t wanna play the game properly? That’s my problem.",
            "Meanwhile, the hydroid playing the game like we all did for years before this update getting fucked over by Hyldrin grabbing a drink or something-\n\nThis ain't league of legends, I'm not playing warframe to be at the mercy of my mate's stupidity.",
            "Because its accurate",
            "> it's 100% ur team mate's fault here\n\nteammates playing poorly shouldn't fail a mission for everyone else.\n\nIt isn't like they can force move him (without loki or Valkyr, and who plays those regularly?) and then they lose to no fault of their own, short babysitting the player and instantly shooting all green beams above their head, and otherwise not playing because the objective would die otherwise...\n\nIt's poorly designed that it hits the defense objective, that's just a fact. Warframe is one of the least toxic communities because 99% of the time a bad player can be lifted up by a good one. Warframe does not typically allow individuals to ruin the experience of others. \n\nIts also hilarious that people say it's a skill issue (as if I have any control over my teammate's actions) when they literally added a gamemode without a fail state (Ascension). \n\nI can't imagine what's going on in some people's minds that \"one player can make all the others fail\" is being entertained as anything other than bad design.",
            "By punishing the three players who are actively playing?",
            "I have no problem with the damage on players, as a matter of fact I agree it’s perfect. I believe that’s it’s effect on objectives is a different story. Also no one died in this clip",
            "I have no problem with the difficulty as it applies to players. I just don’t think the current state of “instant game ender” if someone is afk is reasonable. Had the hyldryn been the one punished for being afk by the afk punishing unit while the damage to the objective was noticeable but not absurd, this post would’ve never happened",
            "Damn, imagine reading the part where I explicitly state I’m happy there’s an anti-afk unit and my problem is the defense objective disappearing before I can even see the health go down, which punishes the squad, not the afk player",
            "I’m very aware, but the punishment designed for an AFK ally resulted in the game abruptly ending for the three other people including myself, who were playing the game properly",
            "Its an eximus.",
            "Again, like I’ve had to reply to every comment despite it being in the beginning of the post, I’m HAPPY to see an anti-afk unit. I’m not happy it punishes squads rather than any players actually being afk.",
            "How is that OP's problem, OP is not even the one afk? What should op just drive to the guys house and move his hildryn away?",
            "Im not the hyldryn standing there??? Why does everyone keep bringing up the afk player like it’s even from their pov?",
            "What’s annoying is that standing on top of the objective used to be the ideal position.\n\nYou could see around it more easily, you become a target from all sides reducing damage to the target, you’re in a central position to cast abilities, and you’re close enough to melee units that sneak past gunplay.\n\nSimilar to how thrax were modified to not one shot the circuit defense target, I do expect they’ll adjust the speed at which this kills defense targets. Clearly they understood it was a problem, because they made the ascension defense target invincible.",
            "The temptation is real, but unless you know who these dinguses are and can follow them around in game, you're just hurting randos who don't deserve it. I think these dinguses will see the light the first time it happens to them, don't you worry.",
            "I just played a defense alert where two Jade's both stood on the defense target, after I kindly asked them to not stand on it cuz the jade light shreds it one of them stood a couple steps to the side but the 2nd dude either didn't notice the message or stood on it to spite me. We still won but yeah ppl do be quite peculiar.",
            "Imagine having a failstate in a videogame, couldn't be warframe.\n\nPeople already can grief defence missions with heavy CC by slowing it a crawl. Which very small amount of people do on purpose, the community in game is rather chill. And even if someone decides to be an ass, that laser or the eximus placing it can be shot down in time still.\n\nAnd if all else fails, just bring Silence.",
            "but jade beam dont target objective - afk player here is problem. If hildryn wasn't afk - nothing bad would happen. Its hildryn fault.\n\nOnly problem here is 3 players lose time because 1 asshole decide afk on objective.",
            "What world are you from? Warframe is literally known for it's positive community.",
            "![gif](giphy|Az1CJ2MEjmsp2)\n\nThe toxic side of the community:",
            "Or Sortie Spy.",
            "Well, I understand you're point and I think specifically for defense objectives it should have SOME retention. \n\nHowever, I feel the need to play devil's advocate and say that if the objective is losing chunks of health in the span of a few seconds, you would probably want to look at it and thusly see/shoot the pillar. \n\nKeeping an eye on the health every couple of seconds is paramount to defense. Which is one of many reasons, among spawn, time and map designs causing slow rounds, as to why I'm not a huge fan of defense to begin with.",
            "Calling it a skill issue for playing with friends is so wild lmao",
            "“Afking on defense objective is bad”",
            "Enemies split aggro between you and the objective based on something I can't remember. If you are on the objective, aggro aimed at you is now also aimed at the objective",
            "Criss cross!",
            "Crisscross! Crisscross!",
            "Layer 8 issuesust be dealt with on a layer 8 level.",
            "Lua rescue\n\nSortie spy\n\nMobile defense sortie with radiation modifier\n\nBut these are predictable, and relatively few. The problem here it that it adds to this \"grieffer - able\" mission pool all the defense and mobile defense missions",
            "Someone could also have shot the laser",
            "Just...go AFK on something that isn't a defense target. It's not that hard.",
            "I don't know about you, buy my sneezes don't take this long. And if I really need to do something irl like take a drink or pull the food out of the oven, I sure as fuck don't stand on top of the defense objective, especially when Jade Eximi are the hot new thing in this update. \n\nYes, the defense objective can get badly hurt if the beam just passes through it. Well here's a crazy idea, don't afk and bait the beam away from it so they never touch or better yet, kill the Eximus/shoot the beam source.",
            "If you need pause in Warframe go solo mode and press escape. Works even in Netracells run. And if you don't want objective to be destroyed, you don't stand on it afking.",
            "But you wouldn't change music while standing on an objective, would you ;)",
            "I dunno why people are even disagreeing with you, there's zero reason for this attack to be able to interact with anything that isn't a player\n\nIt's not like the defence objective was AFK, the Hildryn was, and I didn't see you complain about the *teammate* getting zapped...\n\nMeanwhile people are too busy salivating over the thought of an anti-AFK mechanic to realise this is a far, far more effective *griefing* mechanic. Is AFKing missions even a problem in 2024 Warframe? Feels like I'm in /r/guildwars2 over 'ere",
            "It's literally where they were standing. He was directly on top of it, and he shouldn't have been there even before the Jade update (literally, just stand to the side of it....). Someone posted something similar with DA experience of a Voidrig 1-shotting the defense object. The reason it was 1-shotted was because he was afk Voidrig Defense mode, but sitting directly on top of the objective, and the Voidrig was targeting HIM. He should NOT have been there. Always a bad idea, even before that.",
            "Bruh have you ever had a rad proc with mesa in def? Accidentally deleted the defense objective in 0.01 seconds. You just have to adapt to New things",
            "Counter-point: its 5 CONSECUTIVE seconds of someone staying directly on top of objective not doing anything, and everyone else also not doing any defending on a defend mission. The laser starts at 30 damage and damage amp resets completely when contact with a target breaks.\n\nI highly doubt the laser moves slow enough to fry an objective if you were just passing by it with bulletjumps, you need to actively guide the laser onto it to fail that way.\n\nEventually people learn that if you need to AFK on a defence mission, its best to do it in literally any part of the map except the one spot where you would attract enemies to attack the only thing you meant to defend.",
            "And that's fair, like I said that is up for debate. Generally though I think we just need to give it time and the culture will change bit by bit. After all no one likes losing, neither you nor the AFK guy, it's probably just too ingrained in their muscle memory by now and change will take time.",
            "I mean I have eyes, I saw the video. That aside it's not the only way a random can fail a mission, neither is Warframe the only game that works like that so meh\n\nBy playing a multiplayer game you tacitly agree to have your enjoyment in the hands of your teammates, it's one of the big negatives of team games: sometimes (even often, depending on game) your victory/performance/enjoyment can be ruined by random people on the internet and there is literally nothing you can do about that.\n\nSo I understand the frustration, I really do, but designing a game so that a mission can not be failed by a single person is unrealistic.",
            "It can also be used to troll.",
            "Don't trust your objective with an AFKer then.",
            "Jade Light can't target non-players in the first place, be it other NPC or objectives. It literally can't fuck up an defence if nobody is right on top of it.",
            "The other three could have killed the beam by shooting the top of it, so yes it should force them to fail if they can't pay attention to the objective.",
            "I think the only thing that perhaps needs tuning is the heat proc - just for newer players who don’t have access to Operator or Rolling guard are pretty stuck if they’re just a little bit too slow (which could be due to ping or platform played on) then they’re pretty stuck. \n\nBut otherwise yeah I agree - it’s not like Jade Eximus are common outside of the current event anyway, they won’t be neaaaarly as bad when they’re down to normal eximus spawn rates ",
            "Yea after my first few missions with it, I just swapped to a silence frame and now the beams show up for a half second before I re-up silence and I havent even taken a damage tick from them since... but as an anti-afk method I do think it'd be funny",
            "Same. I'm going to be so depressed if the whiners win on this.",
            "The beam feels good the way it is in regards to damage against objectives. \n\nWhile I personally liked the bugged damage output against frames, at least before really crazy scaling kicked in, I can absolutely see why it was an issue (Hijack objectives getting melted in two ticks, leaving no time to shoot/drag the beam away when you need to be near them to progress, any frame with long animation locks getting similarly melted with very little room for counterplay if they get targeted mid-cast).\n\nIf they leave it the way it is now it's a hilarious anti-afk tool and encourages situational awareness.",
            "Forget skill issue.  This is ripe for griefing potential from trolls.",
            "Why does no one on this thread seem to understand this? I expected better from \"one of the best communities in gaming\".",
            "Team based game. That's typically a hazard of these. Warframe is, in my personal experience at least, unusual in how often and thoroughly one player can carry a whole team.",
            "You have no idea who I am so you’d just be a prick to everyone but me more likely",
            "It's always correct.",
            "I can't even open my chat window and grab my keyboard to begin typing by the time me and everything i've ever known and loved is dead. I already didn't really type in missions but now it's even more of an absolute last resort I wouldn't dare do unless forced to because it's a guaranteed death to me as a console player",
            "This isn't an xp farming node? It says waves remaining instead of just waves",
            "There are plenty of games that exist where the enemies don't have unfair mechanical advantage in comparison to the player.\n\nThey have proper AI.",
            "Thank you for that. So we now got jade lasers on all types of missions?\nI didn't read patchnotes yet 🙂",
            "A jade nullifier eximus walks into the bar",
            "If the player is doing it on purpose, yes, it's griefing. Report the player. But one player getting downed is a slap on the team's wrist for fucking up big time. I think the way it's done is good.",
            "That will always be the case with multiplayer games. It's just the way it is. I'm happy I have the option to run content solo if I ever get tired of randos fucking up. Some games don't even allow that.",
            "Which is why I agree with you that Eximus abilities shouldn't be able to damage the defense objective that badly, but regardless afk-ing on or near it is still a bad move.",
            "Then shoot the laser? You know he's afk on the point, You know the lasers deal a million damage - See the laser and react.",
            "I think the poster was being sarcastic, but it doesn't really show well in text. \n\nBut yeah, I'm looking at this video, and I'm unsure if that afk player intentionally did that, or if they didn't know that'd happen. I do hope that eximus damage gets needed on objectives because Jesus, it melted that defense point.",
            "Hey, i don't work at DE. You go ask them lmao",
            "☝🤓Umm... actually, there's a person in the objective. In reality, the person is the objective. So someone, in fact, died in this clip",
            "you saw the light above him that you can shoot",
            "After reading your post again, I think they should make the Jade Light a single target beam.",
            "Bold of you to assume people read past the title, good luck for dealing with that",
            "I'm sorry, the words were wrong, i was focused on the AFK player, not really on you. \nBut ultimately my point still stands, AFK players have been a scourge on this game for long enough. You presented the simple solution to this problem already.\n\nThat you got caught in as collateral damage is unfortunate, but don't hate the mechanics, hate the players who are unwilling to adapt.",
            "Just stop playing with these people, problem solved",
            "Because he's the one who screwed up the mission not the other people by staying literally on top of the defense target and also not shooting the laser when it was doing damage to the target?",
            "Keep trying to party with the devs on stream and then do it to them. That might get it fixed.",
            "> Imagine having a failstate in a videogame, couldn't be warframe.\n\nAbsolutely no one argued against that, literally no one.\n\n> People already can grief defence missions with heavy CC by slowing it a crawl.\n\nA minor inconvenience at best, warframe is already adhd candy, no one realistically guards the defence point everyone is running or zooming around spawn camping the enemies, so slowing them down means nothing just camp their spawns, all it does is make the mission last longer.\n\n> that laser or the eximus placing it can be shot down in time still.\n\nNo, my bad, I should've bought my crystal ball to divinate where when a beam is about to fire at the teammate 30m away from me while I'm hyper-focusing on something else\n\n> And if all else fails, just bring Silence.\n\nThat's a good one actually, real, I don't even know why we have the other 50 something frames",
            "Yeah, but, like, that shouldn't be able to happen in the first place.\n\nLet's put this in another light: People got upset when excavators would suddenly explode.  It sucks when you're doing everything right and the thing you're trying to protect just up and explodes. So DE fixed it (mostly).  Now enemies can't crit excavators, and the health scaling on them is a little better.\n\nA single unit shouldn't be able to 1-shot a fully healthy defense objective, no matter what.  That shit happens in four seconds flat with the jades.",
            "Still, it allows griefing, heavy and incospicuous griefing to which you can't really react",
            "You know how some frames have defense abilities?\n\nYou know how some frames have defense abilities that center on themselves?\n\nYou know how some frames have defense abilities that center on themselves and has a cast time, like Gara's wall? Or the Zephyr body block? Yeah, that's not \"being afk\".\n\nYou know that Mesa can't move during her 4 unless you run an augment?\n\nYou know that Mesas like standing on the objective during her 4 because it's the one place that offers optimal view over all enemies that can see and shoot the objective? Yeah, that's not \"being afk\" either.",
            "[At least 1/4th of the squad when someone brings Limbo to Defense:](https://youtu.be/LOZuxwVk7TU)",
            "Thats why i do them solo. Theres a few mission i do solo simply cus its faster or i can garuntee the win. Most assassinates, sabatoge, and spys are done solo cus im not having some dumbass ruin it for me",
            "M-kay!",
            "Well there's also the consideration that Blitz Eximus explicitly don't target Defense objectives because they do so much damage. So a Blitz will only wreck the Defense target if you're standing too close to it, I imagine Jade Eximus come with the same logic.",
            "They patched it, jade lights only hit players not objectives",
            "Cha Cha real smooth! 🕺",
            "One person AFKing shouldn't tank the mission for everyone else.",
            "I'm with you but your comment only applies to the ones standing on the objective. For everyone else, it does seem kind of intense to have to look at the objective constantly to shoot down the lights if you cant get the player off the objective. Worse, if there is a griefer, they can just jump on the objective any time they get the light to end the mission. No warning.",
            "In this particular video, the eximus was behind a door and the orb was in the rail.  I don't know if it's shootable at that point.\n\nBut that's beyond the point.\n\nIn any other game mode, failure states take time.  Hull breaches give the player a full minute to respond to it.  The capture target has to run through the level to escape.  The enemies have to get to 100% in interception.  And on and on.  None of these allow the players go from 100% to 0% in just four seconds.  Why is it suddenly cool to be able to nigh instantly lose?  No matter what the players are doing or how badly anyone is fucking up, you have time to respond - time that doesn't require 4 second reaction.  Some game modes let you fail over and over again.\n\nI'm honestly confused by people's reaction to this.  \"You deserve it.\"  \"Git gud.\"  \"Don't AFK on the objective\" all the while missing the entire point.  Warframe game modes don't end like this.",
            "I think you're misunderstanding a couple things.\n\nFirstly, I'm not the one AFKing.  I'm not saying AFKing is good.  I'm saying that sometimes people need a few seconds to scratch their butt.  I don't know about you, but I don't know when my butt needs to be scratched, it just happens.  So I can't plan ahead and go solo because I'll maybe be inconvenienced at some point.  Nor should I have to.\n\nSecondly, I can't control when OTHER PEOPLE need to scratch their butt.  MY mission shouldn't end because someone else decided to scratch their butt at exactly the wrong time.  And nor should the mission end for the other two people in the mission.  It shouldn't matter where they decide to scratch their butt;  In every game type, missions take time to fail (until now).  At the very least thirty seconds.  EVEN IF someone decided to scratch their butt in the worst place possible with the worst timing possible, it shouldn't end the game in four seconds.",
            "Hahahaha no, I wouldn't, I always try to go somewhere where I won't annoy my team",
            "Well imo it's a cool counter to people just making full afk builds with frames like Vauban or Saryn that are able to kill everything just with the push of two buttons and which I find quite annoying in some missions, BUT this is a bit too much, now I find myself dying when going afk for a hot 3 seconds just to change a song or any other thing",
            "I understand that HE should not have been there, but what does that have to do with everyone else actually playing. It feels like it’s not very effective for punishing AFK players, but rather encourages those griefing by being AFK",
            "The problem here is that it doesn't only punish the afk, but the entire team, the rest of the team not only has to handle a full team amount of enemies being themselves less people, but now they have to watch out in case the AFKer is on top of the objective. \n\nIt makes afk griefing much easier and fucks the rest of the team two or three times as much as before",
            "I literally can’t adapt to someone else not playing the game",
            "You do understand that the way this is implemented right now actively discourages me from playing online - in a co-op game? Before, I could at least ignore the AFK players and do my thing, since they would do no harm to *me* and *my* gameplay. But now I am forced to babysit this ungrateful prick lest I risk the defense ovjective obliterated.\n\nAgain, why should I bother?",
            "It's a video game. It traded realism for enjoyment already. It shouldn't be possible for one person to fail the mission for everyone.",
            "Tell me how to do that without turning of public matchmaking.",
            "Ok so hear me out.\n\nYou play the game. You join a PUG. One of the randoms are afk on objective. Objective gets destroyed and me and the two good active guys lose. Literally no counterplay for us except not playing with randoms.",
            "Fuck that noise.  Four seconds isn't enough time to react, even if you do happen to notice the objective losing health; there's no alarm, visual or audio, to say if the objective is low on health.  People shouldn't have to be keeping the objective constantly in their screen at all times.  You should absolutely be able to look away for a few seconds.  You're just wrong about this.",
            "Oh yeah, silence. So 4 main methods of counterplay. Use Silence, Kill the Eximus, Shoot the top of the beam, or just move out the way.",
            "Play solo if you don't want to encounter any potential trolls.",
            "becouse it is not one of the best comms.\n\nit was, but now it is way worse and has been astroturfed to hell.",
            "> Warframe is, in my personal experience at least, unusual in how often and thoroughly one player can carry a whole team.\n\nWarframe is also, in my personal experience at least, unusual in how little toxicity exists.\n\nIf you want that to die, then sure, let one player ruin the mission for everyone else. That won't result in flaming or anything, nope!",
            "oh you are getting it! slowly but surely we are getting somewhere!\n\nsee? this can be used by any old knob to ruin the game of quite a lot of people.\n\nedit: double reply and blocks, real mature but ok.\n\nlet me elaborate to you, it is a skill issue at most for 1 guy, but op did not have any skill issue, he failed becouse of someone else.\n\nI was expecting some more empathy towards others from a genderfuild person but herewe are.",
            "Riiiiight so as someone who has played plenty of games with enemy AI, proper or not, i call bs",
            "Thankfully they are rare when I play",
            "But - and this is important so pay attention - HE ISN'T THE ONE AFKING.\n\nThe whole point of this post is that OTHER PEOPLE can fail the game for you.  It doesn't do anyone any good to say, \"Well don't afk on the objective,\" because the person afking on the objective ISN'T HERE TO HEAR IT.",
            "By the time I got to him the mission was failed. I didn’t even notice the health bar was depleting like that until I looked back at the replay footage",
            "Did you even watch the video?",
            "Oh yeah the beam that was behind railing? The one that ended the mission by the time I got to him? That one? I know how the eximus work, I just can’t babysit a player who has a five second window to ruin the entire mission",
            "Lol, I'm glad the devs of warframe are also warframe players, means they can see issues from both sides and notice real problems sooner. It's not like games where devs are just employees doing their job and don't notice an issue until it's too late and tue community has really blown up over it.",
            "Its all wasting time in the end. Slowing mission to a crawl is wasted time. Losing mission because someone decided to troll with jade light and having to replay it is a wasted time. \n\n  \nAnd theres plenty of people here arguing that jade light shouldn't be able to do so much damage to ojective, even tho its only possible when someone deliberately trolling and literally nobody else is paying attention. Or bringing silence, because woe is me, the game with 50+ frames gives a reason to play something that isn't fucking Revenant for every single gamemode. \n\nIts just a kneejerk reaction. Players aren't used to Jade Light being around and being actual threat. Yea, it can be used for trolling, but so is datamass in mobile defenses, and i don't come across people softlocking the mission for no reason very often, if ever.",
            "Agreeing with you. People tend to overlook, this isn't like rain falling from the sky and nobody can help it, DE could fix it. DE could make it not target objectives or do drastically reduced damage to it.\n\nFixating on it being the Hildryn's fault or calling it a skill issue or something else (lol) just leaves cheap shots in the game for, frankly no good reason.\n\nSomeone stands on the objective, fail\n\nSomeone has the jade light spawn behind them out of render and walks over the objective, fail\n\nI can already imagine the mobile operative targets following the one team member with a jade light behind them and frying themselves\n\nLet's skip the bs and just have DE change it imo.",
            "You can see hildryn was afk standing. She do nothing after jade beam hit her and do nothing before jade beam. Any warframe and situation you mention someone is PLAYING game. Hildryn was doing nothing, just cast 1 spell, give shields and cya later alligator.\n\nWe need dmg cap vs objectives. In theory this eximus is amazing vs \"im wisp player, here is buff, now im afk, you can handle rest\" but DE didn't test jade beam vs objectives.",
            "Our ~~toxic~~ trait is we don’t have a toxic trait! We’re a positive community. If you don’t believe me- you’re wrong. Stupid.",
            "You're AFK on the objective *right now*, aren't you?",
            "Probably. I've only ever seen Jade Eximus destroy something because the beam was chasing a player",
            "Is this a new thing, because pretty sure when Undercroft was introduced they would go for defense objectives with their blast wave",
            "[deleted]",
            "You mean only aim for players, not objectives? Or you really mean they never hit (damage) objectives even if they aim at a player which is standing on the objective (like what happened in the video) ?",
            "You've said that at least three times in this same topic, one of which I replied to. Allow me to repeat:\n\n>Team based game. That's typically a hazard of these. Warframe is, in my personal experience at least, unusual in how often and thoroughly one player can carry a whole team.\n\nI obviously can't speak for every team based game ever, so maybe it's not as normal as I think for one person to be able to fuck the whole team over. But yeah, happens. And cobsidering obe only needs to move a short distance away to not get the objective blown up if they need to handle something irl, this is a player issue more than a system issue.",
            "One person actively triggering a fail condition like this is always going to result in mission failure, whether it's activating the alarms in a spy vault then doing nothing or getting a rad proc and shooting a defense target, as long as it's possible to fail by accident it'll be possible to fail on purpose.",
            "You're precisely correct, so don't go afk on the objective?",
            "You're 100% right. \n\nAnd I have good news.\n\nThere's an *easy* fix for that. \n\nAs an AFKer, simply *don't join public matchmaking*.\n\nThat way, when *you* AFK, it doesn't tank *everyone else*  mission. \n\nForeign concept, I know. \n\nHaving to actually *commit time* to an in progress mission that you *knowingly joined*.\n\nIf your real life is so important, then you shouldn't be tabbing into Warframe to AFK in a lobby you know you can't commit the full time commitment to. \n\nThat's why you check into matchmaking when you're *ready* to. Not when you know you have to call your mother, cook dinner, take a bathroom break, do your homework, go to work, etc.\n\nYour time isn't more important than everyone else's.",
            "I didn't mean exactly you. It was said as general sentence. And as others mentioned, going into operator void mod3 and opening chat lets you stay invulnerable for around 30 seconds to scratch the butt.",
            "Operator void mode, literally takes a second to pop into and lasts for way longer than you'll ever need to realistically afk for something like changing a song",
            "Press 5, press toggle crouch button, boom you are now invincible for several seconds, plenty of time to change songs or whatever.",
            "It is true that this is causing issues, but its already very well known the many ways its possible to troll teams in a very similar way. look at void mot for example. after some time i think trolling with beams will die down a lot, since its not like this isnt one of many anti camping/afk methods",
            "What's the difference between that and radiation proc + nuking the objective because your teammate was equally negligent? Your teammate failed the mission as well,  did they not? They'll learn not to be such a loser, and you'll get less loser afk teammates from now on.",
            "It's an anti-afk mechanic that will eventually teach all your teammates to never do that. You don't want afk teammates anyway. It'll sink in eventually, and people won't do that anymore. As far as griefing goes, there was and still are plenty of ways to troll your team if you really wanted to. Bannable offenses that were never okay,  so those losers won't be around forever. All in all, I think it's a clever way to get the player to actually do something.",
            "It's an anti-afk mechanic that will eventually teach all your teammates to never do that. You don't want afk teammates anyway. It'll sink in eventually, and people won't do that anymore. As far as griefing goes, there was and still are plenty of ways to troll your team if you really wanted to. Bannable offenses that were never okay,  so those losers won't be around forever. All in all, I think it's a clever way to get the player to actually do something.",
            "I know, so until the general playerbase dont adapt to \"just stand away from the def obj\" just play solo then",
            "I edited my comment after you replied, but yeah, if it's a big deal to you: you shouldn't.\n\nI used to be really into StarCraft when I was a teen because it was 1v1. No afk people, no idiots, no griefing, if you lost it was because of your own actions. If losing a mission once in a while due to people like this actually bothers you then you should look elsewhere, I'm not advocating for masochism ahaha",
            "Unrealistic as in \"it's bad game design and no one will do it\"",
            "There is similarly no counterplay for someone to pick up datamass and refusing to install it in MD, you just get softlocked. And most people don't do that for obvious reasons. The question is \"why the fuck there's a player doing literally the only, singular thing, he isn't suppose to be doing\"?\n\nIf its accident \\\\ ignorance, well thats sucks, don't do that again. And if its deliberate griefing, which is extremely rare in WF to begin with, thats a report.",
            "The guy in the video was literally standing there watching it, and did nothing about it. The fault is with the non AFK people. Full stop.",
            "The same counterplay as someone joining a spy and triggering all the alarms, or calling down all the excavators so they keep getting destroyed, blowing all the dome charges in your railjack, slowvas or max range glooms making each defense wave take 15 minutes... I leave and re-queue. I would do it in netracells too for when people nuke everything outside the red circle on purpose, but the mission takes a bit too long before that stage.",
            "\"Four seconds isn't enough to react\"\n\nAre you playing completely stoned or what?",
            "Four seconds is more than enough time to react when it's a pretty big, neon breen laser you have to shoot the top of...",
            "There is audio….",
            "5. Sit under it with Rhino 2 and watch as a magical 7th digit hits your overguard number. Never worry about getting hit again for the next 20 mins.",
            "Just keep in mind... eximus inside nullifier bubbles **do not** get silenced until the exit the bubble... so if you have it up and still see the light, find the bubble",
            "Wait top of the beam?",
            "Or go invis",
            "Way to hard, have easier options?",
            "That's an awful mentality.  Trolls shouldn't be able to troll.  It just shouldn't be possible. DE wants people to play this game multiplayer.  This game is way more fun multiplayer.  Why should people have less fun because some people decide to be assholes?",
            "'Just leave the beach if you don't want your sandcastle kicked'\n\n  \nNah.  Fuck that mentality.\n\nBan everyone who is proven to engage in such griefing, and do your best to prevent it from happening.",
            "ah yes... play a multiplayer alone.\nbecause of a game mechanic that is shit.\ninstead of just fixing the mechanic",
            "what? astroturfed? how?",
            "Oh and happy cake day, bye now",
            "Sooooo me saying skill issue to a valid scenario is the same as you intentionally griefing? You didn’t think this through apparently",
            "![gif](giphy|TamGVAGxDTYDNt3dpn)",
            "Fair enuf I suppose",
            "All im saying that you had the laser on-screen for a decent period of time.  \n\nI'm not excusing afk players or anything, and yes the dmg is \"quick\" - But know you know it can damage the objective and will kill the lasers from now on.",
            "Yeah and I see no attempt to destroy the laser.",
            "yeah, thats the fault of that dumbass who can't be bothered to play the game, if he just died it wouldn't be enough of a punishment for him to make him play the game, yeah it's sad that 3 other people are punished but there is no better way to deal with afk dumbasses, that way they will get angry that they constatly can't do a mission like that and either they start playing the game or get filtered and no one else has to deal with them",
            ">And theres plenty of people here arguing that jade light shouldn't be able to do so much damage to ojective, even tho its only possible when someone deliberately trolling and literally nobody else is paying attention. Or bringing silence, because woe is me, the game with 50+ frames gives a reason to play something that isn't fucking Revenant for every single gamemode. \n\n\nDude they have a Hydroid, Hyldrin, Saryn, Ember why would you subsume silence? Yes it's good for survival on some frames but why bother when even on steel path its hard for enemies to kill you if you are jumping everywhere and killing everything?",
            "> Its all wasting time in the end. Slowing mission to a crawl is wasted time. Losing mission because someone decided to troll with jade light and having to replay it is a wasted time. \n\nThe magnitude in which this happens is wildly different, you can slow down enemies, making everyone slightly annoyed, sure, BUT you can still then extract after 5 waves, that's fine, you still keep the rewards and the binus affinity and everything, you lose maybe 10 minutes of playtime at worst.\n\nMeanwhile here you can completely fuck a 30 wave defense run at wave 29, making everyone lose all their rewards, progress and time, and even the bonus affinity if you decided to go to Hydron to level up\n\nIt's inarguably much much worse.\n\n> don't come across people softlocking the mission for no reason very often, if ever.\n\nI sincerely agree that the community isn't as toxic as in other games, and this is a fair point, however, if you were playing during pre-rework limbo, it's also not that \"chill\"\nPre rework limbo was so detested for his griefing ability to make enemies immune to damage that you'd get kicked for choosing him before loading a mission, and a lot of people were actually using him for trolling",
            ">I can already imagine the mobile operative targets following the one team member with a jade light behind them and frying themselves\n\nAh hell, there goes arbitration defense for a while.  I'm not even going to bother because I'm sure that's exactly what's going to happen and ruin the mission.",
            "*Throws away lunch I am eating* NOPE!",
            "![gif](giphy|l41JUb8h841UT321y)\n\nN-o-pe *nom nom nom*",
            "That got implemented with Echoes of Duviri. So almost a year ago but still after Duviri's initial launch.",
            "You got downvotes because your comment added absolutely nothing to the conversation, it’s essentially a glorified upvote.",
            "I believe he said:\n\n# Well there's also the consideration that Blitz Eximus explicitly don't target Defense objectives because they do so much damage. So a Blitz will only wreck the Defense target if you're standing too close to it, I imagine Jade Eximus come with the same logic.",
            "Yeah I mean they don't aim for objectives. I wasn't talking about the video",
            "Some co-op games fail the mission if even one bleeds out. Many others practically require everyone to do *something* due to roles and better balancing\n\nThe last one I personally played to a significant decree was Division 2 and while doing solo heroic (hardest difficulty, always scales enemies for full squad like sp and no checkpoints) *is* very possible, it needs optimized builds and any mission can fail way faster than this defense did if you decide to facetank a heavy (or sniper doggo lol).  \nThen there's obviously raids which aren't possible unless *at least* four people know exactly what they're doing",
            "In warframe, there already are some missions where one person can fuck the whole team on purpose, but they are pretty rare/predictable, like sortie spy missions, sortie defense /mobile defense with radiation modifier, or lua rescue. So you can know before launching the mission, that you'd better run it solo.\n\nHere, the addition of a new eximus unit which can spawn in any mission just enables griefing in every mission when you have to defend an objective. And from what i have noticed along the years i have played warframe, that is not something DE usually does on purpose. That's why it's a problem, in my opinion.",
            "Allow me to repeat: Naw dawg.  Fuck that noise.  I reject your entire premise wholeheartedly.  Whether it happens in other games or not doesn't make it good of fun.\n\nYou shouldn't be forced to babysit other players.\n\nAlso, where the person chooses to AFK is irrelevant.  You shouldn't be punished for someone else's carelessness.\n\nFurthermore, this allows for bad actors to grief other players simply by standing still.\n\nHere here here, let me just ask you this: Do you think this is fun?  Do you think a mission - that you were otherwise winning - suddenly failing is fun?  Regardless of how or why.  Does that seem like a good time to you?  Do you like having your time wasted by other players?",
            "And... so that makes this... good?  It's a good thing that a mission can fail in four seconds flat?\n\nIn the cases you've mentioned, there's at least more than four seconds to react.  Well, I dunno about the rad proc, that could be instantaneous, I guess, but I don't think I've ever seen a defense mission go from 100% to 0% like that before.",
            "I think you're... getting something twisted here.\n\nI'm not the one AFKing.\n\nOP isn't the one AFK.\n\nWe can't control other people, let alone where they AFK.\n\nYou can't either.  \n\nThis could happen to you.\n\nYou have no control over it.\n\nNow, in any defense mission, someone who is neither me nor you nor OP, could AFK on the objective and kill the mission for everyone else in four seconds flat.\n\nThat shouldn't be able to happen.",
            "I think you're completely missing something here;\n\nI'm not the one AFKing.\n\nOP isn't the one AFKing.\n\nI'm not advocating for AFKing.\n\nOP actually welcomes a punishment for AFKing.\n\nThe whole point of this thread and the problem I'm trying to highlight is that OTHER PEOPLE can AFK and end the mission while you've done nothing wrong.\n\n\\*Edit\\* I've had to fend off so many dinguses in this thread I forgot which thread I'm replying to.  In this post, I'm advocating for a little leniency in gameplay.  Not 100% AFKing, but letting the player take a few seconds to do something else. That shouldn't fail the mission for everyone else.\n\ninstant mission failure for a 4 second AFK is excessive, no matter where you're afking.",
            ">As an AFKer, simply don't join public matchmaking.\n\nBut then how else will I get others to farm loot for me 😔",
            "Huh! I did not know that you could do that.  Neat!\n\nUnfortunately, not everyone knows this.  I'd wager not many people at all know this.  Again, the problem isn't me.  It's other people.\n\nWhat I'm trying to say here is that the beam should do less damage to the defense objective.  It shouldn't be able to 1-shot it.  It can still do a chunk of damage, sure, fine.  But it shouldn't be able to melt it that fast.",
            "Unless it is Deep Archimedia",
            "How did I never think about that...? I'm going to bind toggle crouch and start doing it from now on, thank you! Hahahaha",
            ">What's the difference between that and radiation proc + nuking the objective because your teammate was equally negligent?\n\nThe Radiation Proc + Nuking objective scenario would occur more rarely than the AFK Jade beaming objective scenario, simply due to the fact that there  are very few ways that a WF player can do purposely get Radiation proc'ed, meanwhile each defense type mission could have at least two Jade Eximus spawn in the entire mission.\n\nAs far as i know, the only way that you could get rad proc'ed is through Lazer traps and Sortie Radiation",
            "Yeah you're right, I said something similar in other comment, I don't think it will necessarily be addressed by the devs, just maybe a little tweak and some time for us to get used to it, all in all is a cool mechanic I like",
            "The solution is simple, really: disable the beam from damaging the mission objective. This way, it still does its anti-AFK job perfectly by sniping the AFK player sitting on top of the objective while not disrupting gameplay for everyone else who is actively engaged. This has potential of being used for cheeses by covering under the objective but that can be remedied by thoughtful level and model design.",
            "...no he wasn't? did you watch the same video? he had approximately two seconds to react upon turning around to see the jade light was nuking the objective in which he MIGHT have been able to kill it if he processed what was happening fast enough. he was not \"literally standing there watching it.\"",
            "Bruh reacting takes more than noticing, you have to get there and kill it too. It’s shooting through a wall so even if you got there you’d still have to dps it and all because somebody ELSE is afk. I shouldn’t have to be a sheriff and tell players where to fucking stand",
            "Let me put it this way: You're winning.  This mission is a milk run.  Enemies are dying by the dozens, and the defense objective hasn't had a single hit on it.  You're picking off the last few enemies on this wave, one of which is stuck behind a locker in a spawn closet, so you run into the room and pew pew.  Would you even notice the defense losing health?  I suspect not.  Not that quickly.  But even if you do, you have to back out of the closet, jump a spot where you have a sight line on the orb, and then shoot the orb.  And by the time all that happens, even if you were the quickest you could possibly be, the objective has lost half its health.  And it's only wave three, and that may happen again at any moment.\n\nFour seconds is a long time if you're maintaining constant vigilance on the objective.  If you're doing anything else, the chances that you even notice that the defense objective is taking damage are very low.",
            ">Are you playing completely stoned or what?\n\nBrother I play Elden Ring high as hell... Being stoned ain't got nothing to do with that type of slow reaction time 🤣",
            "maybe I am on the other side of the map fighting?\n\nnah, you should teleport to the obj in 1 nanosecond and shoot the bubble (that is in the rail in the vid and may not even be hitable.)\n\nreal smart lad.",
            "What's up with the sweaty tryhards in this thread?  Did y'all get banned from CoD?  Were you too toxic for League?  I'm genuinely curious.",
            "Audio for the defense objective being low on health?\n\nLike, if a defense objective gets below a certain HP, a noise goes off, warning the players that hey maybe you should check out the objective?\n\nMaybe you should watch that video again, and listen very carefully.",
            "Got to 2mil health with merulina once, shit was funny",
            "Jade Null is going places.",
            "Yeah, the top of the beam has a little sphere source that you can shoot once or twice and it turns off the beam.",
            "It's Ash with rad proc on sortie all over again. I don't really get why people are so angry with afk'ing, like, game doesn't require everyone to contribute, and the best thing you could when you need to afk is to stay near objective. Which doesn't excuse standing on it, but at the same time failing a mission because some goober incurred the wrath of gods is silly",
            "So play in pre-made squad of people you know won't be trolling.\n\nNo MMO is free from trolls.",
            "Historically, DE has been very lenient with bans. I don't expect that to change.",
            "What's there to fix? It was a dumb teammate who thought they could just afk while standing on the objective and this turned out to be a bad idea as the new enemy type has an ability that punishing afk strategies.",
            "And I see no grass touched",
            ">Dude they have a Hydroid, Hyldrin, Saryn, Ember why would you subsume silence?\n\nTo not lose an objective to an eximus ability that could be turned off completely by Silence.",
            "I also think one of the reasons many people don't grief in missions is because it's too big of a hassle to set up only to be an annoyance... While just being afk and making the mission fail? Well, that is easy as hell...",
            "I was just referring to the video as an example. It could totally have been patched after the video was captured.\n\nThanks for the clarification.",
            "To answer the question;\nNo, it is not fun. That’s why we don’t stand on objectives like that. \n\nYes, you shouldn’t be punished for someone else’s carelessness… yet here we are. Being punished for people being careless. \n\nYou’re correct. One person shouldn’t be able to tank the mission like this, but they have been for the past 10 years. \n\nLife happens, cool. It cannot be hard to just slap your W key and MOVE OFF THE OBJECTIVE SO THAT YOU DO NOT TROLL YOUR TEAMMATES. NOBODY CARES WHAT YOU HAVE TO GO DO, YOU ARE DOING SO AT THE EXPENSE OF OTHERS. THE LEAST YOU COULD DO IS NOT ACTIVELY DO SOMETHING THAT SCREWS THEM.",
            "Not the person you answered, but let me clarify a bit.\n\n>You shouldn't be forced to babysit other players\n\nTrue, but like in every team based game, some might not know what they are doing if they are new and havent encountered problems in previous games. Also its not a big thing to watch a fellow player for a min if he needs to go somewhere.\n\n>Also, where the person chooses to AFK is irrelevant. You shouldn't be punished for someone else's carelessness.\n\nWhere the person chooses to Afk is relevant. In this case, mission was failed cos he stand top of defencive point. Also if you need to go Afk, wouldnt be a big problem to relocate to safer spot.\n\n>Furthermore, this allows for bad actors to grief other players simply by standing still.\n\nSadly, this is what some people do, same with radiation. What you can do tho, is report them.\n\n>Here here here, let me just ask you this: Do you think this is fun? Do you think a mission - that you were otherwise winning - suddenly failing is fun? Regardless of how or why. Does that seem like a good time to you? Do you like having your time wasted by other players?\n\nAgain, its a team based game. I dont mind players who are new or make a mistake. If they learn, its all good. Ive failed so many missions cos of radiation and spys. Yet i dont mind it cos it happens to all of us at somepoint. Also theres an easy fix called solo play. \n\nSome missions can punish harder than others. Luckily the community is quite nice so most people dont need to stress out when they make a mistake.",
            "Bruh just do what I do. Play solo",
            "Have you not played other online games? At least ones that require other people? Something like League of Legends or any multiplayer shooter out there, hell, even MMOs can be included. People always afk, they should not. Is it the game's fault or the developers? No, that's the person going afk regardless. We all get life and whatnot can intervene, and that's ok. \n\nIt is not fun to lose a mission like this, but the game shouldn't be dumbed down or changed because some bush decided to root on the objective. And truthfully, when you're playing with randos, this is pretty much a very possible outcome. \n\nIf you want a more organized experience, then you should play in a premade group, be it with friends or other people that are interested in doing the same stuff as you, since you share a common goal, they won't do stuff like this.",
            "You players are always so fuckin stubborn lmfao.",
            "I didn't intend my comment to be about you specifically, and I don't disagree, shit like this punishes everybody else instead of just punishing those with bacterial levels of brain capacity",
            "Well, it's gradually increases it's damage over time. I've got 50 millions iron skin on Rhino staying still under the beam. I guess that's why it destroyed objective. You need to stay in one place to get there.",
            "me when i have to use my brain instead of pressing 4",
            "As the player standing on top of defence object - I would notice big F green light on my screen...\n\nThis is his fault and its good that team lost a team based game when one is completely AFK.\n\nThis will encourage those three guys to report this one and that's good\n\nAnd dont try to say \"he is maintaining constant vigilance on object\". This light is visible when it target you... VERY VISIBLE. He was just AFK\n\nOh... And I also forgot this beam makes a noise...",
            "i understand your logic, but this is telling the point of view of the OP rather than that of the person who stood there and just didn't even move. 4 seconds is more than enough time for you to realize there's a green alien probe beam lighting up your entire screen and youre losing health.\n\nedit: i do agree with the point that an active player may not notice the defense objective is losing health. we've all been there. the point is that this wasn't the fault of the active player, but that of the afk one. and perhaps those near it who may have noticed, because they could have just shot the beam to disable it :). Besides, its also known to anyone who's done high level content in a squad not to stand right on top of/next to the defense objective (I'm looking at randoms in archon hunt mobile defense >:D). jade light isn't the only thing that can deal massive damage to an objective out of nowhere because you're near it \n\na big part of the game is reacting as fast as possible to the fact that you just lost your shield or gate, so dealing with it should be ingrained into every player. the fact that the guy just stood there taking hits leaves me to believe they're afk, because otherwise they would have reflexively bullet jumped away from the 'ouchie zone'",
            "🤣",
            "Your bar must be pretty low if you think this is being a tryhard. And besides that, what's your point?",
            "You don't need to be tryhard to notice big green laser beam on your screen with annoying sound. \n\nJust dont be afk.",
            "Oh sorry, you didn’t specify so I assumed you were too stupid to listen for the laser 😶",
            "Wow",
            "Thank fuck, someone with some sense.  I thought I was going insane with all these sweatlords all over the place.",
            "Warframe has been.  I've been playing this game for years, haven't run into a single troll.  I'm pretty sure mostly because it's nearly impossible to troll in this game.  Well, it was nearly impossible.",
            "Unless you're using systems they gave you and get one or two too many smeeta buffs in a 2 hour survival.\n\nThough those are just trade bans.",
            "theres.. a rather easy fix for this... it doesnt damage objectives.\n\nthere you go.\n\nfix done.\n\nnow the teammate dies but he cant troll his team",
            "Because I'm stating an out of the situation?...",
            "So you are saying i should subsume silence onto every warframe on the off chance i match with a rando who may be a troll? Or are you just being sarcastic?",
            "If a specific ability is 100% mandatory for a mission type to work, the mission type is fundamentaly broken.",
            "Tested, working as on the video. Because there is nothing to patch. This conversation is just \"skill issue\" but spelled differently 20 times",
            "My dude, I don't know what game you've been playing, but that has not been my experience at all.\n\nLike, seriously, even if someone does AFK, you can just go about your business and still get through it.  I've never once had a mission fail like this because someone wasn't around.  I've had missions go slower, sure, but I've never lost a mission like that, and certainly not that quickly.  Honestly I've had more problems with people hunting for voca on netracell missions than I've had with AFKers.\n\n  In OP's video, they were winning handily.   They weren't even close to losing, until the beam hit. \n\nIt's wild to me how you can just... accept this and even defend it.",
            "That's stinkin' thinkin' my friend.",
            "I've played Warframe.  I've played Warframe for years.  I have never once encountered a troll.  Or, if I have, I haven't noticed it.  Mostly because it's nearly impossible to troll in this game.  Or, was.\n\nHonestly, I haven't notice that many AFKers either.  If they are around, I'm too busy playing the game to notice, and so far, it hasn't hindered my experience.\n\nEVEN IF someone is AFKing, it's super easy to just play through the mission and win and then leave the group and never think about it again.  Why?  Because - up until now - one player sandbagging the rest hasn't been able to tank a whole mission.\n\nY'all super ready to just throw up your hands and say, \"this will cure the scourge of AFKers,\" as if it was a scourge that has been ruining the whole game.  If it is, I've never seen it.\n\nSo, no, I don't buy what you're selling.",
            "[removed]",
            "Yes because that the point! This whole thread has been from the point on the active player....",
            "My point is y'all are \"git gud\"ing something that's obviously just bad.\n\nI seriously honestly cannot fathom why you would want this in the game.  Why would you want to suddenly fail a mission that you're otherwise winning, through no fault of your own?",
            ">... you didn't specify...\n\n\n\n>... there's no alarm, visual or audio, to say if the objective is low on health.\n\n...?",
            "It’s a Reddit thing in my experience. A lot of people on Reddit are very insecure and not particularly smart or self-aware. They’ll call EDA unfair and then tell you it’s a skill issue when your teammate griefs your game intentionally. Don’t try and put logic to it, it’s all from the framework of emotionally dysfunctional people who have very little going for them in their lives.",
            "This is the first time I've seen a mechanic in this game that can, in the right circumstances, be used to troll in an mission objective failure. \n\nOnce word gets around, some sad sacks will start ruining the fun for others just because they can. \n\nBut apparently, this lot are just going to take it and go, \"oh well, hahaha, skill issue I guess. Hahaha\".",
            "It doesn't even need to be immunity, it could even be 60-99% damage reduction.",
            "Do you really think everyone should be 100% focused on the game to the point where they can shot on a ball in 5 seconds when there's little to no indicator that the objective is being obliterated?! Don't Don't say about the health bar, that thing is minuscule when compared to everything drawing your attention",
            "I thought it was a bit obvious, so let me clarify:\n\n**THE JADE LIGHT CANNOT TARGET ANYTHING EXCEPT PLAYERS**, and require Eximus to have both line of sight on a player, and have it as a current target.\n\nIf eximus had other non-player targets, this wouldn't happen. If players pay attention, this won't happen. If players stay AFK in literally every single spot except the objective itself, this won't happen.\n\nBut if someone insist on fullfilling all those conditions at the same time - yes, i guess that makes Silence mandatory for them.",
            "I would say \"play solo\" more than \"skill issue\" in fact because i don't consider being paired with good teammates as a skill.",
            "So the thing is, mobs spread their targeting over the players and the objective. If a player is near, they'll most likely target them first.\n\nIf 2 of the 4 people afk on the objective, guess what? \nThat's 3 of the 5 mobs focusing them. The jade was maybe targeting the player, but slammed the objective down in the same dunk.\n\nSay the guy went to afk somewhere else, he'd be dead, probably, but the objective wouldn't have caught collateral damage.\n\n\nThe exact same thing applies to Blitz eximus. If you stand on the objective, they'll focus you and turn the cryo pod into a broken museum piece. If you stand anywhere else, you will probably get merked, but thr mission stays up.\n\n\n>Like, seriously, even if someone does AFK, you can just go about your business and still get through it.\n\nNo, actually. That's what this video shows.",
            "True that’s just shitty game design, warframe difficulty is next to non existent historically, afkers were never an issue in a timesink game of repetitive (to the point of needing second screen with some sort of webinar) grind, adding some random bs one shot ability won’t magically make gameplay exciting.",
            "It's also \"stinkin thinking\" to expect DE to change something because some people are stubborn and can't stand 5 feet away from the defense objective and can't adapt to New changes. This thing is literally the easiest to avoid... Until the general playerbase dont adapt to \"just stand away from the def obj\" just play solo instead of complaining",
            "Hello /u/Whirledfox, your comment has been removed from /r/Warframe for breaking the **[Golden & Excessive Trolling Rule](https://www.reddit.com/r/Warframe/wiki/rules#wiki_golden_.26amp.3B_excessive_trolling_rule)**.\n\n/r/Warframe was created as a place for positive discussion. **Do not troll, be rude, condescending, hateful, or discriminatory.** \n\n**This is your first strike.**\n\n\n___\n\nIf you would like more information about this removal, please [message the moderators](https://www.reddit.com/message/compose?to=/r/Warframe&subject=Golden%20and%20Excessive%20Trolling%20Rule&message=Hello%20moderators%20of%20/r/Warframe,%0A%0AMy%20[comment]\\(https://www.reddit.com/r/Warframe/comments/1dlldrk/-/l9qcjq3/\\)%20has%20been%20removed%3B%20I%20would%20like%20you%20to%20reconsider%20because).",
            "Because it IS my, or my teammate's, fault. I'm being seeked by a nuke and stay/get close to a defense target in a defense type mission. I'm paying the price for my own stupidity.",
            "issue is it deals more damage the longer it hits, so even with 99% damage reduction it would still deal a fuckton of damage, just need longer to ramp up",
            "That depends - What does 100% focused mean to you? You don't need to sweat to destroy a green bauble.   \n\nThe health bar is small yes. I rarely, if ever, look at it. So no that's not my argument.   \n\nBut the beam is bright and huge, not much else was there to draw OPs attention - 5 seconds is eons in a fast paced game. I reckon if you don't frequent places like Reddit, discord etc, and don't communicate much in-game (Which is fair) you wouldn't know how the beams function or that you could destroy them.  \n\nBut OP did, and didn't attempt to do anything to counter it. That's all im saying. This might be OPs first interaction with it destroying an objective and its reasonable to not think about the beam being able to destroy it - But now he knows and it shouldn't happen again, granted that he decides to destroy the laser.",
            "There's no point in making an ability mandatory on all frames to counter trolls and/or idiots, the devs should make defence objectives immune to gameplay sabotage by not letting the jade light vapourise them or even just not letting the jade light damage them, either works. That's an issue the devs should fix though, not something you should changr your gear to accomodate.\n\nNever accomodate trolls and people who go afk on top of the objective, that's just normalising gameplay sabotage as if ruining a mission isn't a dick move.",
            "Wait, you mean you haven't unlocked the discord frame that filters trolls from your matchmaking? /s",
            "But the blitz eximus has a cooldown on its abilities. It can't kill a defense objective in a single it.  You have way more time to react.\n\nAs for your last bit, I meant before Jade. And they still can.  I have no doubt in my mind this shit is getting nerfed.",
            "I think the idea is actually good, but it needs a lot of \"except when\"\n\nIt should, given its damage, not damage objectives for example\n\nI also just yesterday experience whats basically spawn killing. The laser killed my sevagoth as i loaded in, i revived myself, but since the laser kept on my sarcophagus, the moment my shadow returned to it and i got into the self revival animation i got blasted again before i could move, causing me to go back into shadow. \n\nSuch things are fine to overlook when you just introduce them to the game, but shouldnt happen once people realize its issues",
            "You're missing the point.\n\nFailure takes time, in warframe.  In any other game mode, you have much longer than four seconds to react to a mission going south.  A hull breach in railjack gives you a minute.  The capture target has to run through the level.  Survival missions take like a minute thirty of zero activity to reach 0 life support.\n\nNothing in this game takes a mission from 100% to 0% in four seconds flat.  At least, nothing used to.",
            "My dude.\n\nYou're not paying the price for your own stupidity if it's someone else being stupid.  You understand that, right?"
        ]
    }
}