{
    "War Thunder \"Seek & Destroy\" - Changelog": {
        "title": "War Thunder \"Seek & Destroy\" - Changelog",
        "score": 287,
        "url": "https://warthunder.com/en/game/changelog/current/1626",
        "content": "",
        "num_comments": 336,
        "comments": [
            "20 mm Hispano SAP-I — the amount of explosives has been increased from 3 to 11.66 grams. Source: The National Archives, AIR 23/7500 Operational Research Section fighter ammunition, structure and penetration.\n\n\nQuite a large increase in explosives there.",
            ">The parameters of the high-explosive impact of shaped-charge shells, ATGMs with shaped-charge warheads and HESH shells have been reworked to ensure the mechanics of penetrating through thin armor at the point of impact by the high-explosive part of the explosion.\n\nFinally",
            "Am I correct in understanding I can now arrange my crew slots properly from light to heavy etc?? :O\n\nIf yes, this would be the best change! :D\n\n**Following the Roadmap:** The ability to change the order of crew slots has been added. The specified crew order only applies to the selected vehicle preset; accordingly, each vehicle preset can have its own crew order. In the near future, we’ll also add the ability to rearrange crews by dragging and dropping, rather than just selecting a crew from a drop-down menu.",
            "seek and destroy my sanity",
            "> ZTZ59D1, ZTL11, WMA301, ZTZ88A, Type 69 IIG — the BTM1 concrete-piercing (semi-armor-piercing) shell has been added. (Report).\n\nChinabros? (130 something mm of pen, preforms like normal SAP I assume)",
            ">For aircraft with ARH missiles, a limitation on the number of simultaneously operating missile data link channels has been implemented. When launching more missiles than the carrier’s radar can provide, missile data link will work for missiles launched last. The limit on the number of data link channels is indicated in the radar tooltip in X-ray mode. Current radar restrictions:\n\n    Su-27SM, MiG-29SMT, Tornado, JAS39 — 2 missile data link channels.\n    F-16C, Barak II, F-4F KWS LV — 6 missile data link channels.\n    F-15C — 8 missile data link channels.\n    J-11A — one missile data link channel.\n    F-14 — 6 missile data link channels.\n\nAre those values realistic? Also, what about m2k-5f? edit: just checked ingame, m2k-5f has value 2.",
            "* **Mirage 2000D-R1, Mirage 2000-5F, Mirage 2000C-S5** — MAWS has been added.\n\nOUI FRANCE NUMERO 1 RHAAAAAAAAA",
            "the mig23 mld has lost all it's countermeassures exept for the extra pod\n\nedit: the mld has its countermeassures fixed",
            "Italy mains seeing 2A7V in their lineup:\" i have now become death\"",
            "Wake up babe AAMRAM update just dropped",
            "* **F-15A, Baz, F-15J** — the AN/APG-63 radar has been replaced with the later AN/APG-63 PSP. It lacks pulse modes (LPRF), but has a Raid Assessment tracking mode - RAM, switching to which and back is made from the usual tracking mode by pressing the “Change Radar/IRST mode” control. Note that illumination of targets for SARH missiles is impossible in the Raid Assessment mode.\n\nCan't find this in game, am I misinterpreting what this means or did they not add it?",
            ">*A5M4 (all variants), A6M2 (all variants), A6M3 (all variants), A7M (all variants), J2M2, J2M3, D3A1, D4Y (all variants) — engine Fire System has been added.*\n\nVery interesting. It's been [2 years](https://www.reddit.com/r/Warthunder/comments/wxjk0a/comment/ilrf2j1/?utm_source=share&utm_medium=web2x&context=3) since EFS was added to some planes, and [4 years since a Report](https://web.archive.org/web/20220825205453/https://forum.warthunder.com/index.php?/topic/484101-fire-extinguishes/) to the devs included relevant info to cover EFS for several JPN aircraft.\n\nI wonder how that will change enagements and behaviour... I ground my way up the JPN props learning that 'if you get looked at = you get set on fire', and what you can do to put out the fire. If I can engage EFS on these, it should let me fight again rather than turning off the engine and diving in hopes the fire goes out before I disintegrate.",
            "So the War Thunder 3D model of HMS Queen Mary arguably helps make understanding her demise at Jutland  as with the positions of the magazines able to be looked at, it becomes very quickly apparent that once Queen Mary was hit in the forward part around the 4\" castmates, she was doomed",
            ">For Air Realistic Battles, a game mode setting that allows you to participate in battles with smaller team sizes (maximum 12 players per team) has been added. To enable the option, go to the game mode selection window (under the “To Battle!” button), then on the Air Realistic Battles button. Here click “Game Mode Settings” and toggle the “Participate in battles with smaller team sizes” option. This option is only available for aircraft with a Battle Rating of 10.0 or higher.\n\nThis is a highly important change. I advise everyone check this box, and tell people in game to check it as well. Air RB needs smaller matches, and this is the way to make it so.",
            "Type 93 and Type 81C being in the first wave for more detailed damage models, ouch... not that it will matter much when you get 50cal'ed through the window.\n\nTooltip for the Type 81 seems to mention the FCS controlling LWS and LR... got my hopes up that the Type 81 now has laser warnings :( I'm guessing they just use LWS/LR as a catch-all rather than having it tailored per vehicle.\n\nInterestingly, the PUMA doesn't list LWS/LR as being controlled by the FCS (or any other module, that I can tell). I don't know much about the PUMA, so I wonder if that's intentional or an oversight.\n\nEDIT: The Pantsir FCS is... [interesting](https://imgur.com/a/VX7OiMe) :D",
            "Mostly non-ww2 stuff for ground, I sleep",
            "Babe wake up, new update just dropped.....\n\n\n\n\nHeadache intensifies, dread settles in, back hurts, that stabby bone in the back of your head hurts even more\n\n\n\n\nOh hell yeah, I'll enjoy this update.... I know I will.... Just like all the other ones...m",
            "Hell yeah stock AIM-9Ms for a bunch of vehicles",
            "Vidar has its gun depression reduced by -1.5  so now its -2.5",
            "The sound changes for ground are just terrible",
            "Got up when it finished and immediately remembered I’m on Xbox.\n\nFor the love of god Microsoft rolled out your shit out faster.",
            "So BESH got an update to it, brb imma test it out on the Centurion AVRE",
            "Yo wheres the mig 23 flares at??",
            "I can no longer lock any target in my targeting pod view, can anybody tell me whether this is a me problem or have I missed something in the patch notes?",
            "So they finally added the flare for Q-5L. The fight is over now ?",
            "Wait, no FM change for the Mirage 2000, with all the different changes during the dev server ?",
            "Why is it that the Bernau costs 220K RP to research as a tier IV vehicle? That just seems obscene for something that would be vaporized by any reserve destroyer.",
            "just wanted to post it, but you was 1 minute faster :D",
            "More PUMA nerfs if I'm reading the FCS and powerpack and new modules changes correctly...tf is even the point of it now when begleit exists?",
            "What kind of braindead bugs y all expect?",
            "Ok so cool thing that just happened to be relevant to me as I’m at around 7.7 in the China ground tree: the PLZ83 (Chinese version of the M109) got given a new HE round- with almost double the explosive mass, better penetration for the exact same shell mass and speed? I mean I won’t complain but it’s got almost 10kg of TNT equivalent",
            "Ground crews heal over time! Woo!",
            "Oh... so they did release USS Coolbaugh after all? Nice! :)\n\nOverall it's a surprisingly huge update for naval, with a bunch of new features and improvements added. I especially like the changes to the  hitcam/target ship status view and the new Show crew distribution feature.\n\nLooking forward to play on the new and revamped maps. I'm so used to having some fear of the map changes, cause it feels like a coin flip - either maps get better, or much, much worse. 👀",
            "The Vextra 105 now only has OFL 105 F1 instead of F2, very sad.",
            "Most scuffed update in recent memory",
            "How many Gigs is the new update?\n(My internet is slow)",
            "What is the data charge of MICA for the mirage 2000 5F ? It is not specified in the devblog...",
            "For those who use WASD and Shift to control planes, there are new keyboards for this. \"switch countermeasures\" and \"Visual weapon selector\"  rebind these at minimum. They will be on and off all the time as you are flying. Really not helpful to put keybinds over my control surfaces gaijin",
            "Only two mid tier vehicles and nothing for Japan ground forces, wake me up when the next update drops in a couple months.",
            " so the smaller matches are going to be as rare as night battles great fucken change",
            "Really love how they changed the controls so fucking much that I can't flare anymore without pressing a bunch of buttons beforehand. Thanks Gaijin.",
            "As a USA main, man the sound of the 50 cal guns sound so much better.",
            "Anybody know how to hide the visual weapon switch indicator on your screen? Disabling the keybind doesn't work.",
            "I think it's lazy af that Benelux ground was not added in this update. 90% of that would be copy paste anyway but if they add Benelux, might as well guive us that to bolster french ground forces.\n\nBut nope, Gaijin is too lazy for the copy pasting. THis company really is one of the worst.",
            "Is it just me or do the sound effects sound like shit now?",
            "New explosions sounds are fucking godawful. Sounds like they recorded them underwater. The artillery and bomb sounds are particularly awful. Fuck whoever at Gaijin feels the need to ruin the sound every update.",
            "Wonder how noticeable the \"increased chance of fuel tank explosions\" is going to be.",
            "update file just appeared for me on my Series X, console fellows, check your updates and see if it's live for y'all\n\nedit: total update size for me is 15 GB",
            "Kfirs finally have drop tanks, hell yes.\n\nPS Appears to be the centerline tank for now.",
            "Its so ridicilous. They made a copy of the JAS39A, called it JAS39C and gave it the amraams, that the JAS39A was supposed to have to begin with. All while the JAS39C is missing almost everything that actually discerns it from the A model. They just added the plane to force sweden players to grind a new plane for the new missile. It never has been more obvious just how toxic this company is.",
            "\"In the future, new modules will be added to other vehicles, the highest priority being SAM/SPAA\"\n\nOf course, the flying cunts have to have their supremacy in GROUND battles.",
            "Wish France got sum like…..the mirage G…… the Rafale (STILL WAITING FOR THAT SOMEDAY)",
            "Crew voices have an echo.  It sounds like they're in a bathroom.",
            "My poor Super Hellcat going from 460 HP to 400 HP when its more than 4 tons heavier than the M18....",
            "And the MUSS on the PUMA ***STILL*** doesnt work like it should, now its just lagging behind the Turret when turning.\n\nA+ work Gaijibbles",
            "Why did they change so many sounds?\n\nExplosions and arty sound like farts now.",
            "So no changes to AHEAD?",
            "for the love of GOD! did u guys just remove AP-T from R2Y2 kai V1? it have 45mm pen which can help me spent time to grind so i can supports ground without no bomb  \nNOW i can't even pen a FOX with a APHE only 38mm pen that can't go thought Fox top turret  \n\n#",
            "What does \"tracks have been replaced by physical ones\" mean?",
            "Why on earth would they add the visual inspector and default bind it to Shift + A?\nDo they expect people to not increase throttle and roll left at the same time???",
            "I can't hit crap now with my Bomb sight. What gives???",
            "Did they include the HE changes? I don't see anything about it, until they do; half their fucking vehicles are broken.",
            "Time to log off for a week or play low tier because premium spam is gonna get worse.",
            "M2 .50 cals sound so bad now, my American pride is deeply offended, at least the M2HB is still chonky.",
            "Mirage 4000 doesn't have fox 3 is that a fcking joke ? it's the top tier of france aircraft rn",
            "Not alot of ground vehicles, as someone who doesnt play planes kinda sad",
            "If I read it right the teased buff to HEAT and HESH went through and is now live.\n\nThat's wonderful and now I've got no more excuses to avoid grinding UK ground. :)",
            "\"hill removed\"",
            "Is there much in the update for those of that like to play 8.0 and below?",
            "where are the dutch voicelines for the Fokker... why are there no dutch voicelines in general?",
            "Day 500 of asking for f111 swing wing and gunpods. Was working in beta and would do alot to balance the plane",
            "Anyone know how to disable the crew training popup they recently added below the vehicles in your lineup?",
            "Ever since the update, war thunder crashes after each game I play.  Doesn’t matter what game mode, win, lose, leave early.\n\nIs there anything I can do.  I can’t find anyone else having this issue.  I have average 23 ping ans 400fps each game.",
            "lots of AA missiles are now silent when you fire them.\n\nbravo gaijin, such immersion, many patch.",
            "Now there are Dutch planes but still no modern RNLAF decal, just the old orange triangle... Dafuq Gaijin?",
            "Anybody know a way for me to make the sound mods I had before the update work again? I had custom music and voice lines but the new update got rid of them even though the box for “sound mod” is enabled",
            "The MIM-72E is no longer smokeless?",
            "Su-22M3 — RWR: SPO-15 has been replaced by RWR: SPO-10\n\n\nIs this good or bad?",
            "Yo theere's echos now sick",
            "Did they fix atgms?",
            "Can I remove the \"left shift +A\" notification from the screen when in CAS?",
            "Wait Wait Wait... Hold up ! Seek and Destroy ? Like Metallica ? Why 8GO of download ? What's new in game ?",
            "okay, so we got more missile slapping battles",
            "Literally unplayable",
            "Did y'all check out the PUMA and 2s38 internals? If you destroy PUMA FCS then you lose: stabilizer, LWS/LR and NVD\n\nwhen you destroy 2s38 FCS: only stabilizer.\n\nWhat is this fucking bullshit",
            "Am I missing something? Is Sweden not getting fox3? The later viggen is literally set up for the specific reason to carry aim120's\n\nIf I have to seriously grind an another fucking gripen out just to get fox3 I'm going to be so miffed",
            "What a disappointing update",
            "Day of reckoning for ground huggers",
            "I thought Japan is getting F15J Kai, what's F15J(M)?\n\nAnd here I was thinking that for an update with ARH missile Type-81 would receive one, guess that's just wishful thinking",
            "RB EC please",
            "Any clue on how long Xbox takes",
            "I just connected to war thunder and I realized that my mig 23-ml premium does not have revenges by default, what happened?",
            "Multi-pathing reduced. They caved to the F14 shitters. I have been playing since 2015 and today, I uninstalled. GG.",
            "Base bombers should be very afraid of my f-14 early with 6 phoenix loadout",
            "> K9 VIDAR — the vertical guidance angle values have been changed (reduced) from -4/+70 to -2.5/+70. Sources: Korean Defense Products Guide // 방위산업, 저성장 시대의 대안.\n\n:(",
            "So after getting insulted for saying the Z-19/Z-19e AGM's are complete dog shit and that \"it'll be fixed next patch\", it's awesome to see that the AKD-9 is not in the list of tandem HEAT AGMs that got fixed.\n\nIt's so insanely bad, it's not even worth taking.\nIt doesn't overpressure, and the post pen damage is comparable to a fucking Strv m/31's 37mm gun.\n\nSure, once every 20 shots you'll accidentally one shot something.\n\nMost of the time, it takes 4 missiles to kill a fucking truck.\n\nWhat a waste of money this was... At least it's great at air defense, I suppose.",
            "Did they fix the gigantic neck weakspot of abrams? Getting shredded frontally by even SPAA ain't very much fun",
            "It barely changed anything in terms of damage when I tested it back when dev server was up, mostly because the explosive type it uses is equal to like .01 grams of tnt.",
            "HESH IS BACK",
            "Yes, I was able to switch the order. It's weird in that you have to use the arrows on the bottom to do it. Can't drag and drop them yet.",
            "Man I spent so much SL on putting vehicles in specific crew slots lol, the days of that are over",
            "Praise the snail. Most of lineups are left to right, but for some reason I did two nations right to left.",
            "The pen seems to vary depending on the vehicle, but I’ve at least gotta try it",
            "HELL YEAH BROTHER WE ARE SO ASCENDING",
            "CHINA HAS BEEN GENEROUS",
            "Holy shit, 8 missile datalink channels in the F-15.\n\nIf the same goes for the 15J I'll be eating good this patch",
            "And I still remember that post where someone cried about F16 and F15 doesn't have its 6 datalink channels and the Su27SM will 'probably' has 6 when the update drops with hundreds of upvotes. Truly a r/Warthunder moment.",
            "Doesnt the tornado and gripen have 4 ? 🤔\n\nMaybe the new harrier too, not sure about this.",
            "Truly russian bias moment",
            "Is that really gonna change much for these missiles? Are people going to be shooting from much further than 16km?",
            "SAAB advertises that Gripem can shoot 4 radar missiles (AMRAAMs or METEORs) simultaneously so they are not realistic",
            "afaik the f15c can engage 2 and track 10.",
            "But what is the data link channels for a Mirage 2000 5F ?",
            "There's an acknowledged bug report on the J-11A. The version before the MLU (as delivered) that is in game has the same radar capabilities as the Su-27SM and Su-30MKK.",
            "But the flares and chaffs are bugged lmao",
            "No C-S4, my beloved... 🙁 Still, I know it's historical. Also don't regret putting a talisman on it. ",
            "First plane im playing this patch... france is finna cook so hard",
            "MLA too or no?",
            "Good luck for anyone looking to start grinding Italy though, the patch note says that they nerfed the 47mm pen.",
            "Babe: Missile. Missile. Chaff flare. Over G. Over G. Roll left",
            "So when you lock someone and then press the \"Change Radar/IRST mode\" button you get a TWS lock of some sorts. I'm unsure how is that gonna be useful, as Sparrows can't be launched that way but maybe could be useful for being sneaky with 9Ms in Sim buuut yeah, guess that's what they meant.\n\nAlso now you can't use non PD radar mode (the SRC) and instead you get this.",
            "I dunno, but it's interesting! I love that Gaijin is expanding the detail of radar and avionics in game, hopefully we will soon see things like active jamming, home on jam, burn through, and the importance of EMCON. So much potential for more tactical gameplay and not just missile spam!",
            "It sounds like IRST",
            "The danger for Japanese planes was always fuel tank fires, not engine- this doesn't help against it at all",
            "This should have just been the default option and the 16v16 mode should have been optional. Now 12v12 is gonna be like night battles, you’ll never get one.",
            "It depends, I'm not fan of smaller team sizes do it's personal preference.",
            "Been playing for an hour and a half now with it enabled and telling people to check it every match.\n\nSo far, 0 small sized matches",
            "even 12v12 is too much. Should be 8v8.",
            "i already did it and out of 9 matches 0 was with smaller teams.",
            "this is the dumbest change in the game for me, I love the new fox-3 meta and it would be a borefest like naval to play this at 6v6",
            "Not everyone plays top tier cancer. Bigger matches are necessary for low to mid tier.",
            ">EDIT: The Pantsir FCS is... interesting :D\n\nIt has a main stabilizer, a backup, a backup for the backup and a backup for the backup of the backup.",
            "While as a Japan Main I agree, at the same time it was somewhat ridiculous how completely empty the 93 and 81 models were X-ray wise, and also, neither of them should be played in ways that get you shot at anyway",
            "Good. Any nerf to that thing is welcome.",
            "LET'S GOOO 8.0 is still way too low, but any nerf is a good nerf to the vidar",
            "Like what the fuck did they do to the voice lines bruh. Also artillery doesnt sound as terrifying vs the previous one.",
            "The new artillery sound is awful, its like pfft pfft pfft.\n\nThe sound of guns firing more than 200m away sound like artillery.\n\nI really do thinkg gaijn has fucked up the sound mixing. #FireTheSoundGuy",
            "How long will u think it will take?",
            "I'm saddened but thoroughly unsurprised to report that absolutely nothing changed",
            "Same with helicopters. Cant lock on to anything.",
            "If you had disabled « Automatic turn on of aircraft radar at start of battle » or whatever it’s called, enable it back, that fixed it.",
            "Still dissatisfied until they give the Q5s their historical missiles. All Q5s can carry the PL-2, the Q5A onward can carry the 5B, and IIRC later Q5Ls got the PL-5C. It’s good that it won’t get fully curbstomped anymore though",
            "According to Reddit Enhancement Suite, it was 3 seconds faster)))",
            "It's only a matter of time before other vehicles (presumably including the Begleit) see these changes as well. PUMA just gets the pleasure of being first in line",
            "I heard AHEAD rounds got much better on PUMA, no?",
            "Well, apparently my game deleted half of all of my loadouts on my F-14A. And when I say half; it literally deleted half of the plane on every single save. Right half with missiles, left half with bare pylons. I don’t know where the spaghetti code went wrong this time.",
            "Well so far decals are quite fucked sometimes. Some moments they work, other times you have 8 random decals on your tank.\n\n\nATGMs also seem completely silent on launch while using the sight, atleast with spikes. Which is strange.",
            "> I mean I won’t complain but it’s got almost 10kg of TNT equivalent\n\nso now its even with all the other 150s which isnt far fetched at all \n\nit was just kinda dogshit before",
            "The PLZ83 is not related to the M109 whatsoever other than being a similar caliber SPH.",
            "I'm kinda mixed on this. I get that it's annoying if your loader gets hurt and you're stuck with slow reloading for the rest of the battle, but  I'm hoping the crew are not like regenerators from RE4 where the wounded debuffs are almost nonexistent now because they heal too rapidly.\n\nI'm fine with it in arcade battles though, and I play arcade battles mainly, just I think for realistic battles it should be slowed so wounded crew are still penalizing throughout the match, and it takes minutes to recover instead of seconds. Maybe you could go to a capture point and activate crew replenishment to \"swap the wounded crew out with fresh ones\" etc. as a way to heal them in a roundabout way. Or maybe they only heal half of the debuffs applied so they recover some of their ability but not all, and a badly hurt loader will still have a moderate penalty once he's gotten his bearings and figured out how to load the gun with one arm missing and the breech slippery from blood.",
            "They did say in the Air Superiority devstream that the next few updates would be great for Naval fans I believe",
            "Seems to be about 15-16",
            "ah that's just fantastic....",
            "I think one of the slash buttons minimises the hotkey bar",
            "NOOO. WHY GAIJIN.",
            "Centerline tank on the Canard is bugged though, and falls off immediately.",
            "Same thing they did for the viggens, idk why anyone is surprised at this point",
            "New to war thunder? ",
            "Sweden has the best top tier in game, dont whine\n\nSource: i am top tier sweden",
            "New modules for SPAA will probably not really be relevant for air opponents, since they usually either fire a lot of projectiles or missiles/bombs/rockets with a lot of HE filler (especially after the big buff to secondary HE damage in this update). It will be relevant to Ground players who fire with APFSDS though",
            "It makes sense. The larger ones were made up of 80% empty space. They were more survivable than some MBTs against kinetic and shaped-charged projectiles.",
            "Rafale and Typhoon will come later because right now they would be busted, the Typhoon would be a turbo gripen with the best thrust to weight in the game while the rafale can carry 14 MICAs with an AESA radar",
            "We're not seeing the Rafale any time soon. We're at the beginning/midlife of gen 4 aircraft still.\n\nPlease understand that Rafale and EF2000 are absolutely different beasts than what we have ingame right now. This is a completely different level of technology.",
            "I’m gonna laugh when it results in the super ending up at a lower BR. Smaller gun faster > bigger gun slower.\n\nIf you’re flanking, the 76mm has plenty of penetration and HE filler to knock out pretty much anything short of a maus.",
            "It was \"fixed\" on the DEV server. Give it a try in test drive. Should work",
            "It works, adjusts the range correctly for the time fuze. Its just doesnt do damage, especially if you ever watched the irl video of it working.",
            "3D modelled track links, instead of the old classic layered texture method.",
            "my throttle is S and W by default",
            "Pretty much everything sounds worse now, I'm debating taking  a break until they fix the sound.",
            "Because it was only a prototype and MICA didn't exist yet, thus was never planned for it.",
            "Some map adjustments, buffs to hesh and heat. A new veh subtree but not a great deal tbh",
            "wdym? plane's dont have custom voicelines for vehicles that arent the tree's main nation",
            "Might be a need for the mod maker to update them.",
            "The 2S38 fcs lists the same; stabiliser, LWS/LR and NVD.",
            "Could be that they didn't update the description. 2s38 lost those functions on dev.\n\n[https://www.youtube.com/watch?v=oWcCL95xGTc&ab\\_channel=Zenturion7](https://www.youtube.com/watch?v=oWcCL95xGTc&ab_channel=Zenturion7)",
            "\"New\" JAS39C for SWE with four Robot 99 on BOL rails.",
            "F-15J Kai is an unofficial name, it is referred to as F-15J MSIP officially and abbreviated as F-15J(M) in manual title, Gaijin corrected it to the abbreviated form.",
            "F-15J Kai is a made-up name, it’s actually the F-15J MSIP 2 which is shown in-game as the F-15J (M)",
            "F-15J (Modernized), F-15J that went through J-MSIP program.",
            "The 81C never had one what. Also you can’t fire a radar guided missile without a radar",
            "Yeah I just downloaded it and nows its saying I can't play lol damn",
            "Revenges?",
            "When an OP premium finaly gets a small nerf",
            "What a shame",
            "Don't worry, they'll manage to unintentionally break it somehow in the next patch",
            "We are so back HESH bro's",
            "no fucking way its conq time\n\nwelcome back britain to the cold war br",
            "In a test drive I couldn't see any difference.",
            "BACK AGAIN",
            "I'll believe it when I actually see it for myself. Not the first time they've said something like that.",
            "yes, I just got in as well and can confirm this, what a nice change! :) finally able to recorrect the order I want to because years ago just got new tank, drop it somewhere in the row or on top of somewhere, not thinking of any order and then it got locked in that crew slot.. :D",
            "Same xD",
            "China will grow larger!",
            "Gotta grind out six missiles to get the spaded A2A load out :/",
            "Wonder what us mains will cry about next time. My bet is on \"amraam is so underpowered and nerfed literally unplayable f15c is the worst 13.0\"",
            "Not at all unreasonable assumption, given how balance is usually done in regards to Russian stuff.",
            "F4F supremacy! I can guide 2 more ARH's than I can even carry!",
            "I think going high and fast and shooting them from 50+ km will happen, there its relevant. However I havent unlocked any fox3 yet so I havent tried.",
            "Exceeding the data link limit doesn't stop missiles from being fired or working. Active radar missiles have their own onboard radar and can hunt targets without data link. It just means you can't run them all in semi-active mode.",
            "true, but also can’t you only put them on two pylons in game?",
            "but that seem to be the case for all aircraft with flares and chaff so should be corrected in the next day hopfully",
            "How so",
            "Worth it if you have to grind with it",
            "Dont know, only got the m and mld",
            "Bitching Betty is the only woman to have talked to me in years.",
            "RAM might actually be very helpful in sim. RAM was intended to provide finer resolution of a group of incoming bogies (a raid) and could track up to 4 prioritized targets without a hard lock. Ok maybe it won't be that useful in sim, but it is still cool. AN/APG-63 as equipped on the F-15As never had TWS, RAM was the most similar thing although apparently it was hated.",
            "it's not. after you lock a target, you can switch your lock to this RAM mode, which is a soft lock (like TWS would give). not sure how this would be useful aside from slaving IR missiles without spiking the opponent's RWR, but idk.",
            "I'm not sure how true that is. If it was 100% a fuel tank fire every time, I don't think I could recover my JPN fighter prop fires as often as I do (about 30-40% of the time by turning off the engine and diving, which wouldn't make sense if it was a fuel fire). Most of them don't even have self-sealing fuel tanks.\n\nComparing that to a fire on the G4M1/H6K/H8K's where a fire on those is guaranteed death because it's just a fuel tank with engines and bombs strapped on.\n\nEven if it does nothing, then at least we can propose 'FFS' for planes next and get them in 6-8 years with all the documentation available.",
            "There are a few particular props in the game where I find myself successfully putting out engine fires only to realise I now have 15 seconds of fuel left :(",
            "You enjoy the 16 v 16 missile slinging contest? I mean, you do you, but really?",
            "Very true, bigger team sizes are usually more fun in air rb",
            "But... it's not 6v6\n\n> maximum 12 players **per team**\n\nEDIT: I'm a big dumb who doesn't read, it can go as low as 6v6",
            "Low to mid tier is completely unaffected. The setting specifically only applies to 10.0 and higher, and it says so in the patch notes as quoted here.",
            "Gotta stabilise the stabiliser! If your power system gets shot out though... one stabiliser fails 😁",
            ">neither of them should be played in ways that get you shot at\n\nWhat are you talking about? Type 93 is *the most* Dukes of Hazard vehicle in the game. If you ain't airborne with explosions behind you, you're not doing it right.",
            "Of course, I don't disagree that they should get the improved damage models, I just wouldn't have thought of them as the top priority given how they're already exceptionally vulnerable with no self defense (compared to vehicles that can eat the shot and readily fight back).\n\nI feel like volumetric weirdness has saved me more than empty X-rays in the Type 93 😂",
            "is it a nerf when the majority of maps are flat?",
            "The voice lines sound like they are over the radio, which is fine, makes sense.",
            "I kind of like the new voice lines tbh. At least for sweden(haven’t played anything else yet) it actually sounds like you’re in a tank, not shouting in an open field.",
            "AA missiles dont even make a noise when fired.",
            "The only good change was thr bit of echo on the crew voices",
            "It just dropped for me",
            "I disagree. Hits to the UFP of the t54/55 type tanks penetrate and start a fire + kill the driver where they would previously do nothing. \nHaven't tested much farther than that.",
            "They can overpressure now. At least, more reliably. They’re treated as HE shells with extra effect.",
            "From What i noticed side shots are also deadly now where if u hit the side engine area of tanks it will essentially penetrate now and blow up the entire tank",
            "and knowing gaijin they'll never fix PUMA armour and give it spikes, or give Begleitpanzer it's rightful HOT, tracking and APFSDS",
            "Would have been nice if they'd rolled out these DM changes for helicopters instead of ground vehicles first since the helis are a little more in need of such things.",
            "From what I've seen, normal rounds are still better.",
            "No you need like 30 hits and that is on bots flying a straight line so it's still literally useless against real players",
            "In what way?",
            "I know, sorry if the wording came off weird but I just used it as a point of reference as if you don’t play China you probably won’t know what vehicles the strings of letters and numbers belong too",
            "You know what he meant though and you're just being pedantic",
            "The way it's worded seems like it'll take a decently long time (minutes) for them to even start healing. So I think it should be fine. I think this is mostly a benefit to lower tiers where extended scraps are more common. Limping around at a fraction of your speed and a reload tripled is awfully painful, you might as well have died. \n\nSince repairs are a full restoration (as far as effectiveness goes) I think crew should be that too.",
            "Nice, somehow i missed that :) Thanks for the info & looking forward to it! We already know the next patch will have French coastal, wonder what's beyond that!",
            "Oooo nice! Looking forward to seeing what we get in the next one then too! :)\n\nMaybe subs and/or more 16\" ships soon.",
            "Thnx",
            "this is good, hopefully less soviet and chinese fuel tank bullshit",
            "Yes, this is a sad state of affairs.",
            "What does that have to do with anything u/Jamork said?",
            "did i complain about the plane not being competitive ? no i did not. I just highlighted how stupid gaijins practices are. please read and think before giving me your bullshit. However, the gripen also got its flight performance nerfed, so the statement of it being the best top tier is at least questionable right now.",
            "Best top tier? It can only carry 6 ARH and datalink 2 at the same time.\n\nIt is more nuanced than just \"plane turns good\" now.",
            "It will matter for ATGMs with shaped-charged warheads",
            "☹️☹️",
            "Arent there older versions of the rafale without AESA radars?\n\nTo this day most eurofighters are without AESA radars too.",
            "☹️☹️☹️☹️ b-but gas-39 gripen😞😞",
            "whyd you put it in quotation marks?",
            "Huh, weird it doesn't on my pc. Maybe something wrong in my files then.",
            "Right... I see",
            "It does carry one, and can use it without help of external vehicle, the missile model is in the game file\n\nSomeone made a report about it a while ago\n\nAh the CAS player downvote",
            "Stay brother it’s worth it",
            "It's not like those 2 degrees made it OP tho",
            "*unintentionally*",
            "Oi! I'm going to play the Russian 2S3M and the American counterpart with 62mm and 61mm respectively.\n\nOh, you talk about HESH, unlike HE. My bad.",
            "I just GE that shit",
            "F4f is so op, put it at 13.3 please",
            "If you put it like that, the amount of missiles a plane carries is the only limit.",
            "Onboard radar works only once the missile gets to about 10-20 NM from the target, Gripen can fire 4 missiles simultaneously from way further",
            "No, it can carry 4 AMRAAMs",
            "Well for example some aircraft have an incorect amount of flair some can drop somthing like 200 flair in a second and some simply can't use them as i say i only report what i've seen on this sub and other since i still haven't try it my self",
            "i like her voice. It sounds a little tomboyish imo. i imagine her as a spunky tomboy telling me to \"pull up pull up!!\"",
            "Like i said, could help with sneaking up for 9Ms but that's pretty much it. I can see why it was hated too, you need a hard lock before you can use RAM. So still you let your target know, even for a few seconds, that you're going for them and it can take away the sneakiness of your attack sometimes. \n\nI know I'm kind of nitpicking here and being petty.",
            "Turning off your engine and diving is always useful when facing a fuel tank fire- it stops the fire from spreading via the fuel lines to the engine, and it's still extra(cool) airflow over the fire.",
            "Not everyone is smashing their dicks into the dirt in high-tier homie",
            "Holy strawman Batman",
            "Still better that 10v10 missile slinging contest",
            "nothing changes, everybody will go to the middle, useless zombers ruin game more, less people to shot out",
            "Yeah I also do.",
            "Nothing will change untill we get dynamic air rb maps.Tired of boring stupid fly middle get 1 kill die repeat.Warthunder use to be fun #bringbackbomberglory days ",
            "YES\nAlso YES",
            "Touché but if you’re good at it then no one hits you  ;)",
            "Just played the P-47, the .50 cals sound like little dry farts. Bring back the meaty metal chunk chunk sound. 2 years ago, it was amazing.",
            "If you hit a Tiger 2's UFP with the AVRE's 203mm pen 20kg TNT equivalent explosive BESH, you will barely kill the transmission and the driver. Typical for BESH\n\nHowever if you hit the track from the front it will overpressure the entire tank. This behaviour is more in line with HE. I'm struggling to remember if it was always like this tho\n\nOverall seems just as inconsistent as before",
            "Well yeah, they've doubled the chance of fuel explosions for everything",
            "I tried working with a few others a couple of years back on fixing the bagel. iirc wasn't the APFSDS not a thing? But gimme the damn heli finder gaijin.",
            "https://www.reddit.com/r/Warthunder/comments/1ddg3sg/ahead_ammunition_works_on_the_dev_server/",
            "Yeah I mostly agree. I’ll need to hop in game and test it out but more often than not I’d rather have dead crew than injured. If they’re dead I can at least replace them on a cap.",
            "I honestly think its broken? I had an orange crew sit for 4 minutes on a cap idle without changing anything.",
            "I got some different sizing. [Here's](https://imgur.com/a/F7hgOnc) mine",
            "That there is no reason to whine because sweden gets enough shit already",
            "I never stated that you said it wasnt competitive either so ye ur reading isnt great either. The gripen is still an insanely good jet and sweden ground is undoubtily the best in game atm so sweden gets enough good shit, one little extra grind isnt that bad plus the swedish air tech tree isnt very big",
            "Top tier isnt just planes, swedish tanks are on #1 so when their air gets something a little worse there is no reason to get angry at gajin",
            "The Typhoons have a solid state radar but I think the Rafale always had an AESA",
            "how many times has gaijin \"fixed\" something but only made it worse",
            "Restart the game?",
            "True but the vidar does NOT suffer with 2 degrees less",
            "You think that Gaijing is competent enough to nerf it intentionally right after buffing it?\n\nIf they tried, they'd probably just end up fucking up something else, like APFSDS.",
            "Gaijoobles give me Link16 so I can guide other peoples missiles with my ICE.\n\nI wonder who would get the kills in thst sense. \nIts YOUR missile but IM guiding it untill it goes pitbul.",
            "That still doesn't prevent them from working, if they lose datalink before finding the target they just activate their radar and fly to the last predicted intercept point",
            "sure but it's almost never going to stop all your fuel from burning out",
            "Cool beans, the smaller teams size was specifically requested for top tier though.",
            "It's only applicable to BR 10.0 and above",
            "Sure, so perhaps you wait outside the furball for half of both teams to die before you commit? That practically leaves you with a reduced lobby size again.",
            "I'm confused as to which you prefer.",
            "Except that you can now more effectively defend against missiles. \n\nFor one, theres fewer missiles in the match which I might have to defend against.\nAnd there are fewer enemies which fire from fewer angles, leaving wider margins to notch missiles without stearing into another one.\n\nSomething ABSOLUTELY changes with smaller lobhy sizes",
            "Oh no i meant like it will penetrate like a AP shell and explode inside like shrapnells going through the entire tank not a Fuel Tank Exploded Kill",
            "https://old-forum.warthunder.com/index.php?/topic/385727-begleitpanzer-57-questions-information-and-gameplay-advice/page/31/\n\nIt does exist, but no info on the round itself is easily available, but was stated to have 200mm pen at 60 deg at 300m, if you look on the next page of the forum \n\nBut yeah heli finder and HOT definitely should be added",
            "I gotta try it",
            "They only heal up to the point where they no longer give any debuffs. Maybe that's lower than we think, I dunno.",
            "A friend of mine got only 6.6 gigs",
            "But that's kinda low IQ, no? Two things can indeed be true at the same time. SWE is in a good spot for top tier air, and GJN screwed them over with the tech tree rollout.",
            "The thing with the grinding is that is not the 1st time they do it. With the JA37, they added the D variant with just the \"new\" missiles and no other upgrade (iirc, the D was able to launch the amraam).\n\n\nNow, with JAS39, they delayed the addition of the C model, giving us the A one (not for UK, tho, who had the C) just so they can make us to grind the same plane for the arh, because they will make no upgrade.",
            "What if you dont play ground am i supposed to be happy to be shafted because some other dude stomps on a gamemode that i dont play",
            "> Top tier isnt just planes\n\nIn air rb it is lool.",
            "Pls, differenciate between air and ground. Not all players likes to drag their dicks on the ground.",
            "i saw  a vid on the ahead ammo on the dev server that looked like it was actually fixed.\n\non the other hand ghost shells have been \"fixed\" many many times so i guess youve got a point",
            "Weird didnt do it for me either. Gonna check game files themselve now",
            "You will get nothing, second guy will get \"hit 30sl 20rp\"",
            "Depends on the plane. That tank is pretty much 100% fucked, but if you have other, undamaged tanks, you can limp home",
            "Yeah check my other response from 11 hours ago, I caught that",
            "[I know](https://www.reddit.com/r/Warthunder/s/zb49xjh0yS)",
            "A lot of assumptions today, isn't there?",
            "That’s a bizarre assumption to make based on nothing lol. 16v16 with props makes for a better match because, as you alluded to, some folk ram into the furball, but the rest are either hitting ground targets, bombing bases, climbing and fighting at high altitude, or simply going into space; if you remove 25% of those players the match will become even more boring",
            "Both suck, one just sucks at smaller scale",
            "which has much lower effect then 2 of your players deciding to be useless bomber, games are gonna be unrecoverable from those positions",
            "Yep, but in general sweden is treated very well where as OC just says gajin evil company muh muh while we most of time get the best shit in game",
            "Not to mention that its not guaranteed that everything thats fixed on a dev branche gets pushed to live. Some things migjt not get merged properly for whatever reason.",
            "Duly noted sir",
            "Yeah, but this is only for higher br lobbies.",
            "the 10 v 10 option doesnt even do anything for matches under 11.0 BR. Its literally designed to reduce top tier missile spam lobbies.  16 v 16 is perfectly fine for prop games.",
            "10 v 10 is better IMO",
            "We beans, I didn’t catch that last sentence in the quote. If it only affects missile combat then my opinion is far less valid",
            "The quote says 10.0, but yeah, I missed that when I first read it",
            "I think it's better to have 16 opportunities after flying for 5 frickin minutes than 10 opportunities",
            "Ahh 10.0 my mistake. But yeah only for hightier. This change qould be terrible for props because they are so (comparatively) slow",
            "I think its better to have \"only\" 60 ARH missiles shot at you instead of 96",
            "Fully agree.",
            "Props were 12v12 for the first decade of WT's existence? Should be an option for them aswell, you already see many 10-12 player prop teams when lobbies don't fill up all the way.",
            "You receive the same amount proportion wise"
        ]
    },
    "At this point it's just straight up better to be playing Ace Combat at least that game still gives some fun to us...": {
        "title": "At this point it's just straight up better to be playing Ace Combat at least that game still gives some fun to us...",
        "score": 290,
        "url": "https://www.reddit.com/gallery/1dlreoi",
        "content": "",
        "num_comments": 48,
        "comments": [
            "<<All right. All aircraft, form up on Trigger! Nice and tight!>>",
            "Is this Mission 11 of Project Wingman?",
            "Wth hahahah is the first image really what top tier looks like rn ?!",
            "The Ace Combat comparison always strikes me as strange because in that series, missiles have unrealistically *poor* maneuvering/agility and are easily avoidable by just turning. As it's not a series to care about realism, the focus is just on fun, and having missiles be nigh guaranteed kills would be really boring gameplay which no sane developer would ever-\n\nOh wait. Hi Gaijin.\n\nAs a bit of an extra note, I grew up playing games like Ace Combat so when I first reached higher BR jets in this game it was extremely jarring that I couldn't just turn to avoid missiles. It's a very strange concept coming from arcade flight games. I can't say I've ever found it fun. Getting hit by an AIM-9L in a G.91YS rarely feels deserved. Eating an AMRAAM in an F-104S.ASA doesn't feel any better.",
            "\"Just notch, bro!\"",
            "It's just a game. if you're not enjoying it, it's okay to play something else - sunk cost really isn't a thing. the time and possibly money you've put into it is gone and that's fine.\n\n\nMaybe dick around with AB props for a bit, or farm a new line out, get into sim mode and wear a flight suit at the computer. Sounds like smashing your head against a shit meta is just going to burn you out.",
            "Project Wingman > Ace Combat ",
            "Just quit the game then",
            "finally people start to realise\n\nif you want a good arcade with gen4+ jets just play ac7, its awesome. has actuall missions and pvp is actually less chaotic because its 5v5 at most",
            "Imagine flying Tomcat and have audacity to cry about Ace Combat experience in WT Air RB",
            "It’s trash, so just stop playing it. Go play something else.",
            "Flash backs to project wingman.",
            "would be nice to have some new modes, not just big server tdm with 120s on both sides for the one billionth time",
            "\"Yo buddy. You still alive?\"",
            "1st image reminds me of [paths of hate](https://youtu.be/qPELcGcVHfU?si=EabG-w8gJN2YXr-w)",
            "that first photo explains top tier perfectly",
            "Yeah it’s spamraam time. Try to keep your distance while notching/beaming the enemies. Wait for them to shoot every fox3 they got and than turn back hot.\n\nIf this and other strategies get well known, spamraam will just end.",
            "Dude is top tier really like that? how can i supose to survive",
            "Oh no... who could have seen that coming? Missiles that home on their own at considerable range being spammed? Oh no. So unforseeable. So very unexpected.\n\n\nThe players were so preoccupied with wishing for newer toys they didn't stop to think if they should.",
            "ARH vehicles need a 100x100km wide map atleast. Give each team 4 spawns that are assigned randomly and place 4 teammates on each spawn.",
            "Turn on smaller battles",
            "Follow Trigger and you’ll make it",
            "MISSION 11 - SHOWDOWN OVER THE BERING STRAIT\n\n[ MISSION START ]",
            "If you're reading this and don't get the reference from the comment above `^`, do yourself a favour and look at Project Wingman on Steam.",
            "No, but that's how it feels",
            "yes",
            "No.",
            "yeah, and remember to keep enough distance to have time to notch.\n\noh wait, you only have 2 aim9s which go 3km at best? fuck you poor bitch, buy fox3 with GE",
            "But just playing another BR, tech tree, game mode, vehicle won't get you karma online. \n\nEvery time a new top vehicle or technology gets added it's broken. Every single time. Whether it's Fox3, drones, helicopters, AGMs, or even HEAT rounds. I remember the outrage when \"cheat-FS\" came out and people were very angry that their armor is worth less now. \n\nIt was often warranted since balancing before releasing it isn't Gaijins strength. But you simply just stop playing the relevant BR range or mode for a bit and just wait a few weeks or until the next patch until they fix it. This game really has more than enough content. And not playing WT for a bit is of course also always an option. \nI don't understand why people need to bash their heads against the wall and then complain.",
            "Yep, I've been on a break for the last 5 or 6 months and my mental health has improved tremendously",
            "It's good but the lack of planes hurts, also Ace Combat just has more funny weapons. Both are good!",
            "no, it really isn't. these are just cherry picked images, most matches don't have this many missiles at the same time.\n\nand even when they do, keep in ming 90%-95% are just not for you, they're not even aimed in your direction. it's actually quite manageable especially if you climb and give yourself the time and space to defeat the ones actually coming your way.\n\nit's definetly less chaotic than last patch's IR missile furball, that's for certain.",
            "That's the neat part, you dont!!",
            "Notching missiles or fly low",
            "Amd then still not get any because it's not guaranteed.\n\nAlso the \"smaller\" battles are still 12v12",
            "Sorry I'm naive",
            ">  It was often warranted since balancing before releasing it isn't Gaijins strength.\n\n\n\n\nYou get it all wrong, Snail knows overpowered shit that makes everyone else miserable sells the best.",
            ">But just playing another BR, tech tree, game mode, vehicle won't get you karma online. \n\nBut what if I want to play something 11.7-12.0ish? \"Playing other BR\"  isn't a substitute for that. The game was kinda ok with 100m multipathing a no Fox-3. It was toxic, but still borderline acceptable.",
            "Truth. \n\n\nI only ended up here because I was sick of The Other Tanks Game. Quietly voting with my wallet.",
            "These people that make such posts generally try to be the first one of their team and rush in. And then act surprised when they become an easy target for the entire enemy team.",
            "Trees belike:",
            "you gotta sell those premiums somehow, right?",
            "Don’t tell them that, they’re a good distraction while I go for the kill",
            "Pssssst dont talk about it. I need my\" low attention span cod kiddo rush crowd\" big and juciy",
            "Go to test fly and practise flying low.\nI do that every day after game session to touch the grass before going to bed",
            "They're good fox3 bait while I sideclimb and notch until the worst of the spam passes"
        ]
    },
    "What air RB feels like": {
        "title": "What air RB feels like",
        "score": 1455,
        "url": "https://i.redd.it/mq8fh6xqk08d1.png",
        "content": "",
        "num_comments": 131,
        "comments": [
            "I miss the glory days of Migs and Sabres on Korea tbh",
            "Cold war jet battle are more like 8.3 Sabres and MiG-15s curbstomping 7.3 jets and being curbstomped by 9.3 F-104s, Su-7s, and MiG-23bns.",
            "It's modern BVR fights now.\n\nMissile joustling will be more common.\n\nNot learning how to defend against missile is a death sentence\n\nGun kills are often last resort\n\nPeople cant hug the deck(rip stock planes)\nAnd missile alert will be very cmon\n\nWait isn't this just ace comba-",
            "Props feel like climb 5 minutes>Die to some bs>Another game climb 5 mins>Die to XP55 orbital strike.",
            "Best BR rnge for me is 9.7-10.7 cause missile is not tht crazy & dodgeable if u pay attention and dogfighting still happen a lot",
            "I'll admit that I'm having a very negative experience with this update overall.   \nEven with planes/matches where I'm doing well, it feels very artificial. After I'm done with the current round of videos I'm making, I'll probably be playing mid-tier for at least a month.",
            "Warthunder is just a ww2 game trying to be a modern warfare game because gaijin realise most of its players has no any sign of intelligence\n\nThe fact they're still using 16v16 at top tier like in ww2 br proves my point",
            "i would love to play top tier Air RB, because the jets are sick, but the gameplay is just shitty.",
            "killing guns only in top tier (+8500 aura)",
            "Reality is that top tier is not that hard the problem is map size and player count, map are too small and teams are too big, when I played DCS I never had this problem even though matches in DCS are Even larger but DCS maps Are massive, with AWACS telling you the General location of the enemy, Ive had some enjoyment in sim due to larger maps and most of the times smaller lobbies, but air rb where most people play is an absolute cluster fuck that basically gets finished the first 2 minutes of the match by who fired the missiles at the correct moment.",
            "Man I love a good MiG-15Bis vs F Sabre dogfight",
            "Been playing me f86 and mig 15 in sim and it’s a blast man some really fun fights",
            "I'm at 6.0 US and just by looking at videos of top tier. Shit looks very easy lol just wiggle your jet and pray you don't get hit 10km",
            "I hold an immense hatred for all fox 3s, I also don't understand why the f15a/j/baz is at 12.3 when it's completely on par with the planes at 12.7",
            "Make Early Cold War Jets Great Again (especially hunter f1)",
            "Bro I was vibing in my Su-27, the vanilla one, not the Goth S&M one, 2 to 3 kills every sortie, sometimes a gun kill in between. It doesn't sound like much but it's Sim.\n\n\n\n\n\n\nNow, I take off, immediately on the scope, launch warnings for multiple directions, hit the deck, look around, nothing. Dead\n\n\n\n\n\n\nBro I haven't even unlocked my SARH missiles, so I'm just running on R-70s and R-27s, I'm literally useless now",
            "IMO top tier was alot more fun before this update, yea r27s were much more superior than sparrows, but it didnt bring as much chaos as whats happening now. You wouldnt need to start notching in the first 2-3 mins of a match",
            "No missile Air RB feels like a fight game",
            "Honestly getting to a point where top will need a gun only mode to let that part of top jets shine\n\nIf f22 su57 eurofightes f35 come we will never see them do anything interesting with vectoring or general peak dogfiting",
            "Me meanwhile enjoying my flegel's:",
            "7.0-8.0 SLAPSS RN. BUT I DOO FEEL LIKE MY G91 BE SLAPPIN AND OH BOY IF I GET A DOWNTIER IN ME SAGGIBOI ITS CURTANS",
            "Sabers and MiGs are fun but so is the Venom, Vampire.",
            "The old days when 9.0 was the top tier, and it was MiG-15(bis) vs F-86F-2 (later also with the MiG-17 and Hunter).. with plenty of gun sparking, those were the days",
            "yeah every time i see Malzi post a top tier plane video im like \"ooo cool lock on and hope you get kills :) very engaging /s \" Granted top tier tank becomes a point and click adventure (it seems)",
            "my top tier strategy has become very simple\n\n1. side climb to 8k\n2. dodge the first volley of amraams (easy, since all us mains shotgun them from 50km away so you just fly perpendicular and the missile falls from the sky)\n3. close the distance a bit\n4. turn tws on\n5. fling 6 fox3s and get 3+ kills\n\nmonkey instead. and I think imma go back to the Korean war era. or the Vietnam war era",
            "Here's a tepid hot take: Battle Rating is not difficulty.\n\nThere is more actual skill required at lower tiers than the mind numbingly dull \"click to delete\" knife fights at high tier. This applies to air and ground.",
            "real",
            "No. F-86f at 740kmh will be invincible for Mig15bis.\nThat’s all. Game for 1 side.\n\n Brainless British jet: 15G missile does boom.\n\nTop tier. Launch, snake, notch, reengage, 2-circle dog fight…",
            "Sorry bro, times of knights are over. Firearms were invented🤣",
            "No, cold war jets dont feel anything like that.",
            "Peak War Thunder. I miss those pre CL-13 days",
            "Would love a Korean RB EC event. I would play the shit out of that. ( Please let me use F-2 Sabre)",
            "I've literally never seen someone do well in a MiG-23BN (or an Su-7 for that matter), but otherwise accurate.",
            "It's strange but I've never seen the MiG-23BN in any of the 8.3 games I've played. The Su-7s usually beeline for the bases and then get swarmed by teammates. The F-104A though is far more common and a gigantic pain in the ass to deal with",
            "Unless we get smaller teams, players won't be able to defend against fox-3s",
            "Missile jousting is a good definition of top tier. Also hugging the deck is how I dodge most of the radar missiles, you just have to be a good enough pilot to not crash.",
            "Now it'd be all fine if people without jousting missiles wouldn't be in the same matchmaking range as the people with them. I think anything BVR capable should be in its own BR range.",
            "MFW when not every plane is meant for BNZ:",
            "Then top tier is the same,but climb for 2 minutes-launch missile-turn 90 degree away-die from  third party missile hitting your tail)",
            "Honestly that's why I play arcade, if it was a bit faster into the action for realistic, I would Probably play realistic props.",
            "top tier brainrot player detected",
            "Play sim. Problem solved",
            "there's no \"dying to some bs\" in props, there's only skill issues.",
            "Skill issue",
            "Hi Tim!\n\nWould be great if the content creators could band together and say 'enough is enough' and demand some change with Air RB - we desperatly need EC Air RB back ( even though EC does need some work - more objectives, more (tims) variety etc etc, would be fantastic with all these modern fighters - multi role aircraft would actually be viable ) \n\nBVR combat at High Altitude, Strike aircraft being able to sneak around and do ground pounding with advanced weapons (Tornado my beloved) \n\nThis update has really taken the issues with Air RB and made them ALOT worse - don't even get me started with the NEED for BR decompression",
            "It honestly feels like the game is ~~devolving~~ progressing in a way that it caters more to players with lower attention spans now. The first sign for me anyway was when they halved the match time for air RB",
            "Funny thing.\n\nIf you look at their old (11+ year old) videos, you'll see a very different philosophy.\n\nThey made videos about BFM. About MEC. About sim.\n\nIt seems they gave up.\n\nControls also suggest they had a very different initial vision. There's a bunch of buttons in the MEC field that are kind of irrelevant.",
            "The game has no creative game mode. It's just team deathmatch.",
            "War Thunder was never only a world war 2 game considering the Sabre and MiG-15 were there at launch",
            "You think that if you enjoy modern vehicles more have no intelligence? Really dude?",
            "I very recently got to top tier  and I’ll tell you, for like one or two games you’ll have fun then blowing up from 20kms away without seeing anyone will make you go back to 10.3 and below",
            "Mountains and valleys will become your best friend",
            "There's a little more nuance to it, but you got the general idea",
            "Unlike what people who never learned how to do it properly acting like there is ton of skill involved in staying AFK and then diving on enemy would want you to believe. Missile combat is much more complex and diferent skillset than props. In props most of what you need to know is how well plane climbs and turns. In jet combat on top of that you have to know what missile and how many it carries (radar/IR, long/medium/dogfight range, IRCCM or without it), how good their RWR is, how good their radar is and then you get to positioning (can my missile reach at this distace if he maunevers, can the guy behind me launch missile reliably, can i succesfully notch ornoutpull their radar missiles). Definitely not easy if you want to do it with decent results and not just full afterburner fly into furball launch on all you can get one kill and then die.",
            "What, you don't like fighting all-aspect missiles in your jet from 1953?",
            "F-22 just defying gravity and hitting you with an Unflarable 9X",
            "It used to be rank v was top tier at a time, after all.",
            ">I miss those pre CL-13 days\n\nThe most important bit",
            "Even with CL13 it was far more balanced than now. Personally i kept playing F2 Sabre instead, rolling scissors and Snapshots with those ridiculous 20mm were so fun.\n\nBack then a 5kph speed difference was enough to call a plane OP, now we have planes fighting each other with more than mach 1 in speed-difference.",
            "I can do well in Su-7, people unexpecting it to actively engage also helps, but not in MiG-23BN.",
            "I've had some good games in it and seen others go ham with it.\n\nThe BN is the thinking man's Mig-23.",
            "My frend uses it and gets 10 kill games regularly",
            "Probably because the mig23bn is 9.7 lmao",
            "We did, but they made it so you have to also play 16v16 as well as smaller teams instead of just what you chose to play",
            "I mean, just treat them as hyper range fox2\n\nYou get an audio alert when fired at, and you have plenty of time to turn away from it and chaff until the rwr stops whining",
            "You can it's called stay out of the furball still",
            "But have you done it since the lowering of the Multipathing \"ceiling\" (since the update)?",
            "Actually.  \nI had to go into the test range and just fly around really low and fast to get accustomed to the feeling.  \nGetting used to flying lower than tree top level and not crashing did take a little bit",
            "This was a valid opinion pre-patch. Multipathing nerf made ground hugging pointless, giving you less option to notch etc.",
            "Terrain masking goes brrrr",
            "Valid reason, per situation.\n\nCounterpoint: The Zero. Terrible climb rate, limited speed, chaotic turn rate. Gets ambushed from above by a Spitfire, maneuver out of the way to avoid and try to get on their tail aaaaand- it's already 2km out.\n\nNot saying the Spitfire is OP, and the Zero is overtiered. Both own up to their own playstyle, but some planes simply cannot get enough energy to combat others.",
            "if you get killed by a missile you're going cold from you've put yourself in a situation where you're fucked no matter what you do",
            "It's kinda correct though. \n\nEssentially if your plane isn't faster than the enemy plane, and someone is 500m above you in props, you WILL die every time, almost no matter the matchup if the other player is actually good at the game. \n\nThe only reason you usually don't die there, is because 99% of prop players actually don't have hands, so you can kinda just bullshit your way out of it if you're good at the game. \n\nAnd even if you're in a faster plane, if the other guy just wants to never engage you and keeps passively climbing on your 6 you kinda get denied from doing anything except shallow climbing away for the entire game. \n\nTop tier with the multipath change and ARHs is also retarded currently, but the fact that in props you can gain a massive advantage by just doing nothing for longer than the other guy is kinda bad gameplay.",
            "He is saying the truth, prop you climb 3 min and then you reach the combat zone in the bigger maps",
            "Nah he is correct. As much as low tier elitists want to cry about missiles being no skill that doesn't change the fact that all skill on prop BRs can be negated by simply pointing away from battlefield and being AFK for longer than enemies",
            "Stuck with mouse and keyboard :(",
            "Spotting system is scuffed in Dusk maps with partial cloud cover.",
            "Only real bullshit I dealt with in props was my team.\n\nI'd usually end up engaging FW190s and yaks and spits at 5 km with a slight altitude advantage alone while my team is mowing the grass.\n\nI can get 1 kill before getting overwhelmed by sheer numbers.\n\nI'm not even side climbing. I am climbing at the enemy in an american plane, supposedly a worse climber than the enemy team. MEC is almost mandatory for american planes.",
            "Except if it's a yak3",
            "The climbing part def not skill issue\n\nIt takes like 2 or 3 min in the bigger maps to reach the combat zone",
            "> I’m more skilled than them since I climbed up 20s longer than they did! \n\n> They suck because they didn’t climb as long as I did!\n\n> That kill was bullshit he was 5mm higher than me granting him an energy advantage! No one could avoid that!\n\nI swear man both top and low tier have their issues but nothing is more boring than waiting 5 hours to climb only to die thanks to a stray bullet shot by Igor shooting at Bobby at the other end of the map.",
            "I'm pretty sure many if not all Content Creators were feeding Snail with feedback as elaborate suggestions.\n\nToo bad only feedback Snail listens to is money.",
            "Many of us complain directly to them (frequently...) about the current state of air RB, with various suggestions on how to improve it.\n\nHow much the snail cares what we think is up for debate.",
            "I agree but the time reduction was specifically because there would very regularly be one cunt space climbing for the duration of the entire map. It was generally well received and requested by the community at the time.",
            "You can see it in this comment thread. People are upset at having to climb in props for 2 to 3 minutes.",
            "They didn't gave up. They grew up from enthusiasts to big corpo and realized that they don't have to do all that to rake that cash. \nTogether with player quality falling down significantly, only caring about discounts on shitty premiums and larping instead of actually forcing gaijin to make a decent game. \nAnd gaijin keeps it that way because it is profitable, educated player won't buy some shitass premium and will complain about state of the game.",
            "Sabers and MiGs are fun but so is the Venom, Vampire.\n\nEdit: Whoops wrong thread.",
            "I thought getting to top tier would make the suffering end, but it only got worse. Pain.",
            "Always have been.",
            "I don't know why did you get down voted but in props I light a cigarette while climbing, then dive on someone. Most of the matches, climbing takes more time than the actual fight. In jets you're constantly stay alerted if you don't want that missile to hit you from 40km away. Then come here to cry some more because you can't dodge a missile by having inappropriate relationship with the ground",
            "Do that against three fox-3s from different directions",
            "When most trees are 100m tall good luck hugging the deck",
            "Yes",
            "Yes, I saved a clip where about 6 Fox-3’s were coming at me, at the same time. You have to get really close to the ground while using chaff, and it will most likely miss. I found that getting close to the ground and then just before the missile gets there, you dive down just a little more and pull up hard, it works pretty well. So basically you do a little dolphin dive just before the missile gets there, while you are almost touching the ground.",
            "Yes, it's not that bad. Most game forests have gaps between trees you can easily fit through. It took me some practice, but it's completely doable. Mountains make things much easier too.",
            "Yeah it can be tricky, luckily for me I was already accustomed to flying low because that’s how I flew normally. Playing custom battles is also a good way to practice dodging Fox-3 missiles, trust me the servers are filled with Fox-3 slingers.",
            "Why does everyone keep saying this, I do this every game and it almost always works. It’s 100% doable, in fact I have a clip of me dodging 6 Fox-3 missiles coming at me at the same time. I just stayed really low and notched even farther towards the ground when a missile was close. Obviously pop chaff while doing so, but I feel like this is more consistent than trying some random ass maneuver in the sky, which the missile will not give a shit about.",
            "Zero is definitely overtiered because 80% of enemy players being complete newbies, who don’t know how to deal with a maneuvrable but extremely slow plane, other 20% laugh as you try to at least 50/50 head-on with your 2x20mm japanese mochi-throwers",
            "4.3 is the highest a Zero should go, and the 4.3 Zero is the last fun Zero because of this. Having a 5.3 Zero is insanity, take an A7M or Ki-84 instead.\n\nI will say that some planes in a 1v1 basically cannot fight a good Zero pilot, P-38 for example will find it near impossible to get guns on a Zero that knows it's coming and has no other threats. Which is why for the love of god you kill the Zero's first, and don't get caught up with the other half dozen of your team chasing that burning Bf-110...\n\n\ndisclaimer: I don't really like flying Zero's, they're just poor man's Ki-43's",
            "Then you have the Razorback. Gotta pray you get to enough altitude. Once you have, dive like a fatman after a  cheeseburger",
            "I don't know what Gaijin are doing with the zero flight model, but I've never seen a fighter lose so much speed when on 0% throttle.\n\nTake the yak-3, it will hold its speed for a while at 0% throttle in level flight. The other fighters across all nations from 3.3 - 6.3 all behave similarly except the zero.\\[1\\]\n\nThe zero loses speed so fast, in fact in a slight dive it still loses speed. You need throttle to maintain speed.\\[2\\]\n\n1. When landing, I usually set throttle to 0 or turn off engine, so I do get a sense for that.\n\n2. Engine died at high altitude, glide back to base. \n\nBut can that zero turn fight, it's so much fun.",
            "Most planes that are high skill, high risk, high reward are overtired. Most Spitfires, most Zeros, most Italian fighters.\nYou know what you're doing in them they absolutely punish.",
            "“Actually don’t have hands” is a hilarious insult",
            "Playing well in props come down to risk management. You can't just run away whenever you don't have altitude advantage, because while that might preserve your precious kdr it also means your team has one less player pulling their weight and kills in the earlygame are what decides which team wins and which team loses. If you want high kills per battle and high winrates, you have to learn to be aggressive for early kills and engage people when you're not the highest plane in the lobby. \n\nIt's kind of a weird situation where the *optimal* play is to start every fight from an energy advantage, but if you're a good player then the best way to rack up high kill counts and high win rates in ARB is actually to go balls to the wall, free up the braindead lawnmowing teammates by killing everything that's threatening them, and then push the numbers advantage to bait and reverse the guys still clinging on to high alt 10 minutes into the match.",
            "That has absolutely nothing to do with actually being good at the game (or playing it at that)",
            "You can negate a lot of that by defensive flying and learning MEC.\n\nF8F bearcat without MEC: reaches ~3.5 km from sea level flying straight at the enemy.\n\nF8F bearcat with MEC: reaches 5 km from sea level flying straight at the enemy.\n\nI'm literally flying at my enemy and have an altitude advantage while the rest of my team is below me.\n\nIt's not even big brain MEC:\n\nTake off: set radiators to 100, pitch to 100, enable WEP and accelerate to 290 km/h and pitch up to around 23 degreesish.\n\nAt either 1700 m/s or when you hit 270 km/h, switch supercharger gears - whichever comes first. This is earlier than intended, and will make your engine run hot a little but you can maintain climb angle while accelerating back to 280 km/h.\n\nBoom, altitude advantage.",
            "Console controller it’s a game changer if you don’t have a stick, been playing sim with my Xbox one’s since last year",
            "While somewhat underBR-ed, there's nothing bs about the yak3",
            "And that's a good thing. You actually reach altitude.\n\nWith MEC, you'll even be higher than the enemy.",
            "No shit, dieing is the skill issue. Good players climb for 3 minutes then get kills lmao\n\nImagine not having the patience to wait for 3 minutes to watch how the game is playing out. No wonder this game is going to shit.",
            "A change that was utterly stupid becuz people couldn't be bothered to ground pound and farm tickets to win instead. Say goodbye to sideclimbing and fuel management and drawn-out prop dogfights because our brains are all cooked with overstimulation and matches can't be longer than 20mins apparently",
            "And like, it's not even afk climbing. I have compared climbing straight until contact with AEC vs MEC.\n\nI get at least a kilometer or two by actually managing my engine. It's not complex management, just shifting gears earlier than the engine would and keeping radiators at max until 10 km away. \n\nBut it makes a night and day difference with the f8f.\n\n\nAnother thing.\n\nI was called a sweat in another thread for using the keyboard for pitch up/pitch down.\n\nOriginal gaijin BFM tutorials from over a decade ago explicitly tell you to use the keyboard for doing stuff more complex than keeping the nose on the enemy.",
            "people with shit attention spans forgetting air arcade exists",
            "> but so is the Venom, Vampire\n\nThe Vampire was my favourite jet at 7.0, and was still hugely fun at 7.7. It has no business being at 8.0 though, it was one of the slowest, if not the slowest jet at 7.0, and only got moved up because braindead players couldn't learn not to dogfight it.",
            "Minus the cigarette part, I agree.\n\nHonestly whenever I go back to my props I feel like I'm sealclubbing, no matter the tier. I've gone back recently to various aircraft at different BR (P38, Yak3, VK107, various Bf109, A7M, etc.) and prop gameplay is just the same at every BR. Once you know your plane, getting decent results is just so easy. There's a lot of bad players too, who just reverse into my guns, or know only how to head-on and get completely lost as soon as they aren't immediately winning.\n\nYou don't need half the awareness you need in jets. Even at 10.3 you have to keep your head in a swivel and be mindful of 30G missiles.\n\nCurrent top tier BVR combat could be more interesting. Mainly by doing something about the insanely stupid stock grind, removing the small maps without relief (Golan Height, Sinai, and small Spain too), and reducing team size significantly.\n\nOh and throwing a bone to Russia, because holy shit they're sad right now. The 29SMT is like their only decent plane past 10.3 and it's only because it has a good radar and RWR. Mig23 is dead. 12.0 planes without BVR are dead. Su-27 is dead. Su-27SM is dead on arrival because it keeps the same shitty radar.",
            "I agree, if you're somehow in a position where you have an ARH missile coming from all three angles then you're probably fucked unless you find a hill or something \n\nSo try not to find yourself in-between three enemy jets.\n\nI've been stuck with the old swedish gripen. I've got nothing that can hope to match the range of the fox3 slingers at this BR. I've still been able to get kills by not just holding w directly into the furball.",
            "when missiles are fling from the top they'll not care anyways.\n\ndolphin dives work when it's coming from your own altitude (intersect course happens to get into the ground and missile slams it). \n\nMulipathing (radar signature seeming lower than the target is) is only useful when the missile is coming at a shallow angle, and with the new meta of \"climb to space and fling shit at bvr range while dodging whatever the enemy fires at you\" most of the missiles come from the top.\n\nAlso, long range shots loft anyways so they will come from the top even if fired from the same altitude",
            "Explosive mochi",
            "I was trying to spade 5.0 5.3 zero a couple weeks ago. It was surprisingly chill, either that I'm too slow to get into the furball, everyone just run away like a magnet or fail to BnZ you.\n\nThe hei variant is actually quite nice if you want a very chill gameplay of just being a strike aircraft",
            "4.3????\n\nI still regularly get 4-5 kill games in the a6m5 ko that's at 5.3\n\nAt 4.3 it'd be absurd.\n\n4.7 is more realistic, even then tbh 5.0 was fine.",
            "Ah, the Ki-43. I love calling it 'The malnourished golden child.'\n\nAgile, slim, yet is packed with deadly 20mms.\n\nThe J5M is objectively better than the Ki-84 and A7M, in the sense that it can climb and slam that engine. But in all other fields, those two exceed as all rounders.",
            "Yes, the controller is underrated for sim since you can set up controller tracking to look around. That's what I do, and I've gotten the hang of tracking my enemies and maintaining a visual.",
            "Someone has to die for every kill, that means one person's climb wasted",
            "But how their egos are going to survive fact they are playing Arcade instead mUh ReAliStIk?",
            "It mostly relies on your enemy being kinda shit though, there's many any aircraft that can comfortably scoot along in level flight at the _compression speed_ of the A6M5. Stay fast, kill Zeroes.\n\nThey're a bitch to balance though really, anything that turns well is always gonna be a threat. I'd still easily take the A7 over an A6 any day of the week though",
            ">4.3????  \n>  \n>I still regularly get 4-5 kill games in the a6m5 ko that's at 5.3\n\nThat doesn't mean a plane is any good.\n\n||BR|Speed 700m|Speed 5000m|Climb rate|Turn time|\n|:-|:-|:-|:-|:-|:-|\n|A6M5 Otsu|5.3|491 km/h|551 km/h|17.6 m/s|13:44s|\n|Yak-3U|5.7|627 km/h|672 km/h|22.9 m/s|14:84s|\n\nThe A6M5 Otsu would be perfectly fine at 4.3, even aircraft like the Yak-1B at 3.0 or P-39N at 2.7 can fight it just fine when flown properly, let alone the Yak-3 or XP-50 at 4.0.",
            "It's the roll rate, I miss the 43 roll rate. You'll get bnz'ed endlessly but there's no real risk of being hit when you're changing direction every 0.01s.\n\nI like the J5M, Ki-83 at a not shit BR basically, but the flexibility of the A7M/84 is really hard to pass on and they do climb better than most",
            "Do you know where can I find a good Dualsense controller config?",
            "Wow big brain logic here. If you don't get a kill in GRB or at top tier ARB you're time is also wasted for being bad af the game.",
            "Zero is one of them planes that rely on people being absolute idiots when it comes to air combat. \n\nLuckily there is an abundance of these idiots hence why the A6M5 faces the fucking P-51H..."
        ]
    },
    "the gangs all here": {
        "title": "the gangs all here",
        "score": 756,
        "url": "https://v.redd.it/j72sk35zm08d1",
        "content": "",
        "num_comments": 51,
        "comments": [
            "that one duster... lmao",
            "they were all aligned and you ruined it smh",
            "YOURE BREAKING THE LINEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEE",
            "Was it really that difficult to inch backwards? You were the only one unaligned",
            "Really disappointed this isn’t a video of y’all all shooting at the same plane at the same time.",
            "CAS mains' worst nightmare... Until one of them with a single braincell decides to flank and drops a 1000lb bomb",
            "bro can u move behind a bit 🥺",
            "You ruined that video",
            "thats a lot of BRRRRRRRRRRRRT",
            "Did yall shoot at a plane, please tell me you did",
            "Beautiful",
            "I want to physically hurt you for not aligning yourself with the rest of them",
            "Anti anti anti air",
            "No fly zone",
            "Planes… BEGONE!",
            "2/10 not filmed brrrrrrrrrrrrrting in unison",
            "The fuck around and find out airspace lol.",
            "Oh, i think i know which SPAA will be my first ever T5 tank",
            "a strafe from the side would be funny especially with the lack of radar",
            "The Duster in in the back 👁👄👁",
            "Super mega aa assemble formation",
            "That's such a good target for a bomb. I wonder if they shot all planes down. Or if they got killed.",
            "I hate that you were the only one that didnt fit into the line",
            "this but with proxy shell M247s",
            "You breaking the line is a hard OCD trigger.",
            "***\\*CAS Spawns\\****\n\n**Wall of Lead:** \"Allow us to introduce ourselves.\"",
            "They should all shoot at a different pitch so we can reenact the Hersheys Christmas bell commercial.",
            "How to make hud look like that",
            "Anti-fly zone be like.",
            "I feel that so much. You're playing 7.3, your best AA is the duster. All the brrrts are having fun while you have to sit in the corner. Then you get slapped by a 262. \n\nGaijin 4.0-7.3 US AA when????",
            "literally gonna downvote just for this",
            "IM SORRYYYYYYYYYYYYYYY",
            "Holy fuck imagine being a CAS plane thinking you're about to have some fun just to meet a wall of 20mm. They don't even have to be accurate because anywhere near your plane is filled with cannon shells.",
            "Good fucking luck with flanking",
            "That one controller player spamming x",
            "US does have a decent AA sitting at 7.0 named F-84. That's just how real life Americans improvised",
            "My 6.7 lineup just has the M109A1 as my SPAA with its proxy rounds and commander mg. The crew is so large you can survive strafing runs and jets never expect it.",
            "my man, almost every us tank can play AA with that 50. Except on maybe 6,7, most jets are quite survivable against 50.",
            "The dusters good if u know how to aim.",
            "That SPAA doesn’t have search radar.  You have to know where to look if you want to lock anything.",
            "My man, 99% of SPAA/SAM players are deaf and blind as fuck since their brain shuts off whenever there isn't a radar ping.",
            "Good thing jets don't cost many many more spawn points.",
            "Most of them don't have the elevation after they got nerfed a while ago.",
            "Most of them don't have the elevation after they got nerfed a while ago.",
            "Honestly. It irritates me playing aa cuz ill go in and play Aa and there will be 5 others. Yet i clear the whole air because nobody realizes how much you have to lead planes. Honestly id much rather play AA then regular tanks because of that. I feel like i turn the whole game around after slapping 5 planes out of the air",
            "Well that can't be me cuz i use both cas and spaa and i can fucking assure you planes suffer more than aa",
            ">their brain shuts off whenever there isn't a radar ping.\n\nThere are people who hug buildings/slopes, so their radar is not going to ping anything at all.",
            "Thats me when I play Germany around the 4.0 - 6.7 bracket. Their SPAAs are amazing but the players using them usually aren't. So after I die in my first tank I tend to just respawn into 3 different SPAA vehicles to keep the skies clear against the neverending cas spam.",
            "And that is my point exactly...?\n\nSPAA/SAM players have shit for brains and non-existent eyesight and they rely on radar way too fucking much.",
            "Yea my 6.7 russia lineup is my main go to. The btr zd amd the praga are my go to. I litteraly got like 3 to 4 kills on tanks then 5 to 6 kills in the air to be the top of the lineup."
        ]
    },
    "Would you like to see this in-game?": {
        "title": "Would you like to see this in-game?",
        "score": 127,
        "url": "https://i.redd.it/kyeio0qd538d1.jpeg",
        "content": "History\nIn 1992, the South Korean Army initiated the development of the K2 Black Panther, responding to their need for a next-generation tank. The Ministry of National Defence organized a seminar, led by Dr. Eui-Hwan Kim, inviting experts from various countries to provide advice before the concept design phase.\n\nThe attendees included:\n\nIsrael: General Israel Tal (Merkava 1/2/3)\nJapan: MHI engineer Hayashi Iwao (Type 74/Type 90)\nUSA: General Dynamics engineer Philip W. Lett (M48/M60/M1)\nSweden: Bofors engineer Sven Berge (Strv 74/Strv 103/UDES Project)\nUnited Kingdom: Professor Richard M. Ogorkiewicz, Imperial College London\nStarting in July 1995, the Agency for Defense Development (ADD) conducted systematic conceptual research on the next-generation tank until December 1997. This involved determining the tank’s capabilities, performance, appearance, necessary technologies, development methods, and expected efficiency.\n\nOverseas studies were conducted with the Ministry of National Defense’s permission, sending 7 individuals to the UK for a year of training.\n\nBetween November 1998 and December 2002, ADD developed numerous technologies and software for the next-generation tank, including the K2’s cannon, target tracker, APS, and autoloader.\n\nFull-scale development commenced in 2003, and after four years, the first prototype emerged in 2007. In September 2008, it was declared combat-ready. Due to delays in developing a domestic powerpack, the German powerpack from the prototype (MTU MT883 Ka-501 engine and Renk HSWL 295 transmission) was used for the initial production in 2011.\n\nIn second productions, the K2 was equipped with a powerpack featuring a DV27K engine from Doosan Infracor (now HD Hyundai Infracor) and a Renk HSWL 295 transmission, which continued in the third production, including the K2GF exported to Poland.\n\nFirepower\nK2 tank is equipped with the CN08 120mm L/55 tank cannon as its primary weapon and the M60E2 as its coaxial machine gun. Additionally, it has a 12.7mm K6 machine gun mounted in the commander’s hatch for multipurpose use.\n\n Spoiler\nProtection\nThe basic structure of the K2 tank is made of MIL-12560H steel plates, and the composite armor is made of SiC, replacing the AlO3 used in the first-generation KSAP, to achieve higher protection. In addition, it is equipped with ERA, LWR, and MWR to achieve high survivability.\n\n Spoiler\nMobility\nK2 tank has a 51t basic weight, 55t combat weight, 70km/h forward and 34km/h reverse top speed and can climb up to 31° slope.\n\n Spoiler\nInterior\n3 crew members are on board, and ammunition storage is located at the rear of the turret and the front left of the hull.\n\n Spoiler\nSources\n Spoiler",
        "num_comments": 68,
        "comments": [
            "Man there’s so much cool shit I want to see in ground. K2, Stingray, Yatagan, Oplot-M, LAV-25, LAV-AG, Stryker Dragoon, Cadillac armored cars, Commando Scout, and more",
            "Both Koreas + Turkey subtree is honestly the best way to deal with three major nation priorities at once",
            "man this is going to have massive turrent mantlet weakspot",
            "K2NO as Swedish squadron vehicle 🇳🇴🇳🇴🇳🇴🇳🇴",
            "I think lots of people, me included, would like to see this. The main sticking point is where it and other South Korean vehicles should actually go.\n\nA lot of people on this sub say they should go with Japan, but I don't really think so. There's the bad history those two countries share, and Japan didn't have anything to do with the development of South Korean vehicles or vice versa. A lot of it is just Japanese mains who feel entitled to shiny new vehicles in a tree they've already grinded out. I don't blame them at all for wanting new toys to play with, but keep it to things which actually make sense, like a Thai subtree.\n\nAn option which theoretically makes a lot more sense is the USA due to their close relations and them being heavily involved in the development of South Korean vehicles, as well as the South Koreans using a lot of American equipment, but they have plenty of vehicles of their own and they don't need a subtree.\n\nTherefore, in my view, the best option is to have a unified Korean tree which starts after a certain rank, like Israel's tree. They could even throw a Turkish subtree in there as well since they've collaborated on vehicle development and there for sure aren't enough Turkish vehicles for a standalone tree.",
            "The turret kinda reminds me of the leclerc. Very badass futuristic design ngl (both the leclerc and the k2)",
            "Check my flair and a lot the forum",
            "South Korea and Turkiye. We want.",
            "korean here\n\nim not here to spout \"korea shouldnt be with japan cus we fucking hate them\" (I fucking hate their prime ministers and government policies but their people are some of the most respectful in the world), but rather korea doesnt fit japan's tank development as it does with the US\n\nimo id say they should make korea a US subtree that starts with some korean variants of the m4, m48, etc\n\nsame goes for the north koreans maybe add them to china? idgaf about nkorean tanks they shit anyway",
            "Bob semple tank, the best tank ever built",
            "Yes pls",
            "Yes but I don’t want a whole copy paste tech tree just to get the K series tanks in game. Everyone wants a South Korean tree but then the whole thing is copy paste until like rank IV or V",
            "I feel like an Eastern European tech tree with a Korean subtree would be the most appropriate use of Gaijin's resources at the current time being. Especially after the recent weapons sales. A full blown Korean tech tree does sound nice and especially as a Korean myself I would love to see it come to the game. However, after seeing how neglected the Israeli tree is today I have doubts that Gaijin could fully deliver on a united Korean tech tree . I wouldn't mind Korea becoming a subtree for Japan but looking at Gaijin's decision  to add Thai vehicles to Japan tells me that they decided to take different route.",
            "Would like to see balance and not a apdfs 700mm pen at 10.0",
            "in us tree, yes.\nin japan/china tree, uhhh i dont think so, as a korean, no.",
            "Oplot as squadron vehicle in Japan.\nK2 in Sweden.",
            "no",
            "Hopefully it goes to Japan. It would complement the lineup well:(",
            "You’ll have copy pasted F-16s/T-72s and like it! ",
            "fr",
            "Elaborate on 3 major nation priorities",
            "Please Christ not another half baked copy paste tree like Israel again. Israel is just barely tolerable two years after being introduced and god help you if you go past 10.0.",
            "The only people saying it should go to Japan are Japan mains who are too lazy to grind a whole ass tree, lol. Though I understand the sentiment that's really the only real reason why anyone wants to see it in Japan",
            "US could definitely do with a SK subtree, the variety would add a lot of flavor and japan can have thailand which will have a whole lot less drama. SK will definitely help out the american tree especially in higher tiers where the k1-2 can be an alternative to the paper abrams.",
            "I think it’s a little self defeating to argue that South Korea shouldn’t go into the same tree as Japan for political reasons and then advocate for putting them in the same tree as North Korea.  I get we already have the precedent with Taiwan and the PRC, but I think that was a mistake.  Japan and South Korea don’t have the best historical relationships…..but if nothing else they would almost certainly be on the same side in the event of any major regional war.   \n\nI’m skeptical they can make a worthwhile standalone Korean tree that doesn’t rely too much on copy paste vehicles or multiple minor variations of the same vehicle to pad out lineups…..and the grind is already way too bloated…..but I’d be more than happy to be proven wrong.",
            "Their current political relations are irrelevant. Taiwanese tanks go in the Chinese tree for instance. Korea was part of Japan during WW2 and they’re culturally very similar+neighbouring, therefore their tanks go in the Japanese tree, it’s that simple. If not in the jap tree then they go in the Chinese tree. Gaijin aren’t doing any new trees",
            "what does the K2 have to do with Sweden?",
            "No? Why not?",
            "abandon such dream",
            "Reddit:  *Complains when new tech isn't added* gaijin so lazy they just copy paste vehicles\nAlso reddit: *complains when new tech is added* new unfinished buggy pile of dogshit booo",
            "Koreas and Turkey are some of the most requested subtrees",
            "The koreas could help pad out Japan's tree, and Turkey could go with isreal maybe?",
            "Nobody will be forced to grind it if they don't want to.",
            "Exactly lol. They'll say \"we NEED it!\" but simultaneously reject Thailand even though it makes a lot more sense. Beggars can't be choosers...",
            "I can definitely see an argument for the K1 at the very least since it's an Abrams derivative.",
            "The political thing is just one side of it though. Another big factor is that Japan and South Korea simply have nothing to do with each other militarily. They don't use each other's vehicles and neither assisted the other in their respective vehicle's development. Maybe they're both part of the USA's strategy to counter China, but we're not arguing for Japan and South Korea to both go in the American tree or anything. \n\nIf people don't like the idea of playing a standalone Korean tree, they can simply choose not to grind it. In any case, while it ultimately relies on Gaijin implementing it properly (lol), the suggestions I've seen for a unified Korean tree actually look pretty promising.",
            "> Taiwanese tanks go in the Chinese tree for instance\n\nTaiwan's official name is the Republic of China. Both them and the PRC's official position is that each is the only legitimate government of all of China. It's not remotely the same as South Korea and Japan at all and I have no idea why people keep trying to use this argument. It makes no sense.\n\nBut sure, they're neighbouring. Israel's tree is looking quite sparse, and Arab countries are close by. Maybe Israel can receive some vehicles from there.\n\n> Gaijin aren’t doing any new trees\n\nSays who?",
            "this dude has no idea about what he's talkin 💀",
            "Before I write anything, calm your tits.\nTested by Norway and anything that's from North goes to Sweden.",
            "Would be another 75$ premium",
            "Yeah, sucks for that I guess. What nation would It go to then?",
            "But - imagine this - what if Gaijin just added new vehicles and updates without bugs, sounds great doesn’t it? Nothing stopping them from doing it",
            "Not what straw man you’re fighting in your head but ok 👍",
            "What's people's opinion on the Polish tech tree? I'm no historian myself but I think polish tech tree would offer a good mix of vehicles from different nations whilst offering some unique ones from early world war 2 and unique modifications like Twardy. But still it would probably be a bit of a copy paste one and the issue  is that of it were to be added as a subtree it would be hard to place them. Russia's tree is already too big, UK has South Africa.",
            "could help in some minor's opinion, and that's the end",
            "Yes i am aware of the existence of the costal navy trees. However, I would like the devs to introduce balanced and fun content instead of optional exercises in self flagellation.",
            "It’s just pointless slop content, you don’t need a whole tree of copy paste just for the like 10 tanks you want in game from a certain nation.",
            "My goal is to make strong unique tech trees while getting away from the trends of homogenization where the same vehicles can be found in every tech tree.  It’s probably not a hill worth dying on, but I still want to avoid situations like the Hungarian sub tree that adds a few unique WW2 vehicles (if that), and then serves as an excuse to add a bunch of copy paste vehicles from other nations to pad out lineups…..and in the process has turned Italy into another tree with Gripens, MiG-29s, T-72s ans Leopard 2s etc. \n\nJapan needs some help and Thailand is better than nothing, but I’m still drawn to the appeal of a top tier line up consisting of Type 10s and K2s that can’t be found in any other tree…..but who am I kidding, even if Japan got a South Korean tech tree, it’s only a matter of time before the Germans get a premium Polish K2, and the Swedish get a Norwegian k2 squadron vehicle.",
            "gaijin has denied korean subtree in japan for several times and they are gonna get thailand subtree, which passed to the developers as soon as they appeared at the forum. but weeb's cringe is never gonna stop lolol",
            "But again, North and South Korea have even less to do with each other military apart from the fact they’re hyper antagonistic towards each other.  South Korea and Japan are more likely to fight side by side than South Korean and the DPRK. \n\nStill I would rather get a unified Korean tech tree than get no Korean vehicles at all.",
            "Then it should go to Poland since it literally has K2s",
            "Key word being \"tested\", they never bought it. \n\nSweden already has too many test vehicles, but at least they were evaluated by Sweden, I don't think the game should go down the \"Subtree is close to another subtree and that's close to another subtree and they kinda sat in the tank for 5 seconds so the main tech tree should get it\" route",
            "perform a independenced one with NK like china, starting from rank IV.\n\nproblem solved.",
            "Poland should be a subtree, not quite enough for a full one",
            "I understand that, but I also think South Korean vehicles would offer a lot to the game and adding them as a unified standalone tree is the best way to do so.",
            "> My goal is to make strong unique tech trees while getting away from the trends of homogenization where the same vehicles can be found in every tech tree.\n\nUnfortunately, that's just the way things are with modern vehicles. Countries simply make a lot less of their own stuff than they used to.\n\nYes, Gaijin has been lazy, but even if that wasn't the case, there's a limited base they can draw from in the first place.",
            "There's the Thai Gripen and I think a Thai Harrier for Japan was leaked as well. But they insist that Japan is going to get that South Korean subtree any day now, just you wait...",
            "They're still both Korea, like how the PRC and ROC are both China. But at the end of the day, they could probably make it work by just adding South Korea and then giving them Turkish vehicles too.",
            "it is so simple, like china and taiwan, SK and SK will be in the same 'korea' techtree. not about being antagonistic or about the militarical relativity.",
            "And Poland Leopard is in Germany😂",
            "But it is going and even worse copy paste route and stupid people will happily throw money at Gj.",
            "Yeah just grind through all the copy paste M48s and T-62s first, I'm so looking forward to that so much fun.",
            "That’s true, but it’s also why I’m advocating for greater selection with sub trees.  I.E. combing South Korea and Japan creates a stronger, more unique tech tree than combining Japan and Thailand, which mostly serves to further homogenize the tree. Conversely a standalone Korean tech tree just adds another minor nation tree, which is over time going to add a lot more copy paste vehicles to the game and will potentially face the same problems that trees like Italy, Japan and Israel are facing. \n\nLike I said, it’s probably not a hill worth dying as on as it’s already a lost battle, but I consider this one opportunity to not make things worse.",
            ">But they insist that Japan is going to get that South Korean subtree any day now, just you wait...\n\nWho is this \"they\" exactly? I haven't seen such statements for years now",
            "That could work too, creating a “misc” nation for minor vehicles. \n\nI’m still not a fan of combining Taiwan and the PRC, and I kind of wish the game moved more towards creating “political blocks” given the nature of modern politics. \n\nI’ve been very vocal about adding Korea to Japan as I think it makes the most sense from a purely gameplay perspective…..but I just want Korean vehicles in the game, and I’ll be happy wherever they go as long as it’s well implemented.",
            "YES! K2 TO GERMANY!",
            "I've seen it in every thread about South Korean tanks on this sub 🤷",
            "From my point of view why not.We are far away from when trees were only nation,now it's Leopards everywhere, Shermans,Tseries,Mi,Migs etc.\nWhy people still think a nation should be \"clean\" when it's like not."
        ]
    }
}