{
    "/r/WeAreTheMusicMakers Weekly Feedback Thread": {
        "title": "/r/WeAreTheMusicMakers Weekly Feedback Thread",
        "score": 7,
        "url": "https://www.reddit.com/r/WeAreTheMusicMakers/comments/1dh6dws/rwearethemusicmakers_weekly_feedback_thread/",
        "content": "Welcome to the /r/WeAreTheMusicMakers Weekly Feedback Thread! The comments below in this post is the only place on this subreddit to get feedback on your music, your artist name, your website layout, your music video, or anything else. (Posts seeking feedback outside of this thread will be deleted without warning and you will receive a temporary ban.)\n\n\nThis thread is active for one week after it's posted, at which point it will be automatically replaced.\n\n##Rules:\n\n***Post only one song.**- *Original comments linking to an album or multiple songs will be removed.*\n\n* **Write at least three constructive comments.** - *Give back to your fellow musicians!*\n\n* **No promotional posts.** - *No contests, No friend's bands, No facebook pages.*\n\n##Tips for a successful post:\n\n* **Give a quick outline of your ideas and goals for the track.** - *\"Is this how I trap?\" or \"First try at a soundtrack for a short film\" etc.*\n\n* **Ask for feedback on specific things.** - *\"Any tips on EQing?\" or \"How could I make this section less repetitive?\"*\n\n***\n\n#Other Weekly Threads (most recent at the top):\n\n* [Click here for Feedback threads.](https://www.reddit.com/r/WeAreTheMusicMakers/search?q=author%3A%22automoderator%22+title%3A%22feedback%22&sort=new&restrict_sr=on&t=all)\n\n* [Click here for Quick Questions threads.](https://www.reddit.com/r/WeAreTheMusicMakers/search?q=author%3A%22automoderator%22+title%3A%22Questions%22&sort=new&restrict_sr=on&t=all)\n\n* [Click here for Collaboration threads.](https://www.reddit.com/r/WeAreTheMusicMakers/search?q=author%3A%22automoderator%22+title%3A%22collaboration%22&restrict_sr=on&sort=new&t=all)\n\n* [Click here for Promotion threads.](https://www.reddit.com/r/WeAreTheMusicMakers/search?q=author%3A%22automoderator%22+title%3A%22promotion%22&restrict_sr=on&sort=new&t=all)\n\n* [Click here for Our Former Gear threads.](https://www.reddit.com/r/WeAreTheMusicMakers/search?q=author%3A%22automoderator%22+title%3A%22Gear%22&sort=new&restrict_sr=on&t=all)\n\n\n\n[Questions, comments, suggestions? Hit us up!](https://www.reddit.com/message/compose?to=%2Fr%2FWeAreTheMusicMakers)",
        "num_comments": 392,
        "comments": [
            "I feel stuck with the mixing process on our new song (alternative rock?). I want the mix to be clear and right, but something isn't sitting well and I don't know what. Any insight is super appreciated!! Thanks :)\n\nhttps://www.youtube.com/watch?v=lXBB7EUjBOk&lc=Ugz01U4LoRMHVdbb9d94AaABAg",
            "Hi all. Posting a track from a few weeks back. Bumpy Whirly Birb. Somewhat of a bass heavy idm ish experience and I was trying to convey a little bit of fun and joy plus meme word for bird in the title. I was wondering if anyone enjoys this kind of thing. Cheers. https://youtu.be/6mfPoomQkbk?si=TEBv-0Iq-erZCEu_",
            "Are my lyrics too depressing? https://open.spotify.com/track/7xpD5GDDD67LVTqORH8zaE?si=lg0tbYFlQ-OSqjdw5s4TTw&context=spotify%3Aalbum%3A72gpvR2MgaZMmeyKtVeaJE",
            "  HEY! I bring you an experiment from yesterday, a short full immersion to concentrate and study but also other things, who knows, I wanted to give it a rhythm, I hope I didn't accentuate it too much, let me know what you think! Thanks in advance \n\n:) \n\n[https://youtu.be/nRFUjH1rj70](https://youtu.be/nRFUjH1rj70)",
            "Hello! So I wanted to make my own spin on a lofi track but utilize full orchestra soundscapes. This is very simple but I think it came out pretty good. I’d love any feedback you all would have on it! Wanting to develop this sound into an EP. https://youtu.be/r9mYLiexvDw?si=A_ZM1wWVEZ_AyR-U",
            "Pop song! second iteration after I posted it a while ago and received some valuable feedback. Is it ready to be released on Spotify and getting a bit of promo love?? Also, does this remind you of any other artists? Having a hard time identifying my potential audience...\n\n[https://soundcloud.com/itsgloomsy/gloomsy-hundred-nights](https://soundcloud.com/itsgloomsy/gloomsy-hundred-nights)",
            "Made this for my better half - she loved it, which of course is the most essential. However, looking at improving for future tracks i am wondering if it is too repetitive? \n\nhttps://youtu.be/p2UmOhbd8hw?si=0Y82LyiXLC9D0Nfl",
            "My latest song, the video I created using my 12 yo drawings and she loves it. Would love to hear your feedback.\n\n\nhttps://youtu.be/uTKhkCCBMIU?si=xQsgVeHTv76knpJS",
            "Hey, I'm Brian Gawlik! Algorithmic music maker. I use MaxMSP to make performable ambient-electronic sets! Check out this set I recently recorded, and let me know what you think.  It is a live take with minimal edits.\n\n(it's quite long - no pressure to listen to the whole thing).\n\n[https://youtu.be/6RH5qpEN4-o](https://youtu.be/6RH5qpEN4-o)\n\nBrian Gawlik Music",
            "Hey, I'm a small local artist from Poland, just wanted to share something glitchy/electronic I made in the vein of arca or whitearmor. I'm looking for any tips you might have on the mix or the general structure, as that's something I'm still struggling with. Thanks!\n\n[https://soundcloud.com/soundtraki/bez-zmian](https://soundcloud.com/soundtraki/bez-zmian)",
            "independent Scottish 3 piece rock n roll\n\n[https://open.spotify.com/track/7CjPsKMen4v5R4YyHDYFdy?si=b898a3f843a54357](https://open.spotify.com/track/7CjPsKMen4v5R4YyHDYFdy?si=b898a3f843a54357)",
            "First attempt at creating an ambient/chill/electronica sound. Any suggestion? \n\n\nhttps://youtu.be/MipJSGwbQok?feature=shared",
            "**Guitar Playing / Soundtrack**\n\nHi there guys, this is my latest YouTube music channel video, performing the opening theme for a popular Marvel 90s series/franchise that has been on the rise on popularity lately since a sequel series has been launched.\n\nI hope you guys like it! Thanks for watching!\n\nhttps://www.youtube.com/shorts/KnQazp1KNBM\n\n(Feel free to link me to your music as well for a listen)",
            "Track 5 of my new EP, called 'Empty Buckets in the Rain'.\n\nhttps://open.spotify.com/track/5Tdjca8OeKq0csOm6yQwJ2?si=bdQxV1WdTG-imTsQJOFEaQ\n\nIt's a bit of a lofi, asmr, chill vibe kind of song. It's relaxing, and easy to fall asleep to. The other songs of the EP are more uptempo, so this one kind of stands out, but I like it. Hope you do too!",
            "Check me out.  Feedback returned \n\nListen to jason voorhees 2024 by C. Dot da God on #SoundCloud\nhttps://soundcloud.com/digitalmolly/jason-voorhees-2024-rough-mix?ref=clipboard&p=a&c=1&si=6b55670b11e34f54b99a35c64750fe51&utm_source=clipboard&utm_medium=text&utm_campaign=social_sharing",
            "It is incomplete but sometimes mixing helps to inspire my direction in a track. Any feedback towards the mix here would be appreciated. Thoughts on genre clash and composition as well. I've listened to this so much in mixing that I can't tell what sounds good anymore. Particularly reverb and presence with certain instruments.\n\nListen to Tegucigalpa V4 by Allon Bacuth on #SoundCloud\nhttps://on.soundcloud.com/gJB6SBDfNkmMQ4k58",
            "Instrumental. I tried not to get too ambitious. Is it any good? Feedback returned.\n\nLately I have been wondering if music is born out of things that can change or things that can't change.\n\n[https://tenmillion1.bandcamp.com/track/moth](https://tenmillion1.bandcamp.com/track/moth)",
            "Faith (CJF REMIX)\n\nhttps://youtu.be/v5RVHKhAJtM?si=vQzqJf101tSUZIhG\n\nLet me know how you feel about the mix overall",
            "This is a pretty long dark synthwave track that goes through a lot of tempo changes, but my concern is if the bass synths translate to speakers alright. When I've ran it thru various mastering tools, it always filters out the low bass wub rumble counterpoint to the high atmospheres, and I really didn't like the way it sounded, so went with my own master, which is the following..\n\n[https://on.soundcloud.com/8jmDwjCeUF2whXtX9](https://on.soundcloud.com/8jmDwjCeUF2whXtX9)  \n  \nWhat the AI mastering crap wanted to do was cut off the synth bass rumbles and to boost the kick, but the kick isn't meant to be a focus except when it is during the outro rolls.. Feel like I'm breaking the rules keeping in frequencies that may be inaudible, but it's meant to be felt as warm cavernous space. Maybe just accept that I don't abide standards? Thanks in advance for critique, leave a track of yours for me to listen to and I'll give you feedback.",
            "Hey guys! I’d love some feedback on this track I was working on yesterday. It’s hard for me to pin down a genre for this one. It’s still a work in progress and needs a solo I think. \n\nhttps://on.soundcloud.com/XdaKYekDwcaJmdjT6\n\nI appreciate everyone’s feedback!",
            "Heyy, check our new song\n\nWe are fresh bedroom band from east Europe. Check our new song FCK WRLD or our another music. We will be happy for every 💙, follow, repost or comment. \n\nThx a lot, love u all, BJ.\n\nhttps://on.soundcloud.com/8KQvD",
            "Would love to get some more ears and takes on my most recent original.\n\nListen to Never Be Yours by radioriot on #SoundCloud\nhttps://on.soundcloud.com/e19Kt",
            "This is my most recent song I’ve been working on. I’m not sure if it’s fully done yet but I enjoyed making this one! Cheers on any friendly feedback! \nhttps://on.soundcloud.com/2x2ZGDr1hF1qyLqQ8",
            "My latest hiphop beat, J Dilla/ Kanye inspired, for any feedback, returning feedback too! https://on.soundcloud.com/HFDhZVXcgzk1cr4C7",
            "\"I dont need clout i'm a alien\" composed with a youtube type beat, only one vocal track, stock reaper plugins except for antares autotune. recorded with a Blue Yeti Nano inside of a Toyota rav4. I am looking on tips to improve how my vocals cut through the mix, more layers? More compression, more eq?\n\nhttps://soundcloud.com/helljosho/i-dont-need-clout-im-a-alien",
            "I pulled up an idea I was sketching out a while back and finally got an arrangement around it. I spent the weekend mixing with some new plugins I was trying out.\n\nI'm calling this an ambient/electronic genre\n\nI'd love any feedback if anyone cares to listen! Overall feedback is very welcome. Specifically I'm curious to hear feedback about:\n\n1. Does the arrangement tell enough of a story?\n2. Does the bass track need more variation?\n3. What are your thoughts about the overall mix and quality?\n4. More specific genre ideas that come to mind? \n\nThanks much! Will listen to some other tracks and provide feedback tomorrow in the morning.\n\n[Morf Yawa - What Are You Grateful For?](https://on.soundcloud.com/spDVC)",
            "Hi everyone! Here's my darksynth track [https://youtu.be/56Ahn5iKRPc?si=zYy05fhwLDuCN-iD](https://youtu.be/56Ahn5iKRPc?si=zYy05fhwLDuCN-iD)  \nI want to get the feedback on my mix or arrangement.",
            "# sly and fine(prod.noizy)(lyric video) new lyric vid, do check it out\n\nnew video, do check it out\n\n[https://youtu.be/Dd3P\\_1lfYC8](https://youtu.be/Dd3P_1lfYC8)\n\n[https://on.soundcloud.com/fUS8rHDDaMX9Dk3K7](https://on.soundcloud.com/fUS8rHDDaMX9Dk3K7)\n\ngod bless",
            "Hello all. Grateful to have found this sub. I have been creating music for 7 years underground and made a promise to myself I would not share until the production was where I knew it had to be. Here is my debut track “Gr8ness”. Songwriting, vocals, engineering, and production made by me from scratch! A fuse of electronic and rap\n\nhttps://open.spotify.com/track/3qbZMJy7GxeDcqNTQhP9rr?si=cS9oQO5QSiGfK_uHtMX8eQ",
            "Yo! Hope y'all enjoy this new beat I posted today. Tried to do something a bit different with the mix. Thoughts? [https://www.youtube.com/watch?v=U63fB4fqrdQ&ab\\_channel=Wavit](https://www.youtube.com/watch?v=U63fB4fqrdQ&ab_channel=Wavit)",
            "Hi! This is from my upcoming album release. Mostly I'm wondering what people have to say about the overall mix, does the bass hit the way I'm hoping (it's the primary instrument), is it giving you a good feel. One of the challenges was starting the track with synth drums and gradually moving to a real drum part. Is that too distracting? Does it work, in your opinion? Thanks!\n\n[https://www.dropbox.com/scl/fi/zihi64w29669stdvqk32x/2-The-Forgetter-EverythingEver-FINAL4.wav?rlkey=5ewpkuicis4b52jwpttm3cuyg&st=oqnbeks1&dl=0](https://www.dropbox.com/scl/fi/zihi64w29669stdvqk32x/2-The-Forgetter-EverythingEver-FINAL4.wav?rlkey=5ewpkuicis4b52jwpttm3cuyg&st=oqnbeks1&dl=0)",
            "[Lazlo The Lizard Man (#Ambient)](https://soundcloud.com/howard-lamb-123/lazlo-the-lizard-man)",
            "ALLFIVE - Medically Important out on notorious Diffuse Reality. ¤ tracks of pure techno.\n\n  \n[https://open.spotify.com/album/7syiebkdt5pYclX9rqvE6p?si=d7z2EwItTKWFtJb3ObctIA](https://open.spotify.com/album/7syiebkdt5pYclX9rqvE6p?si=d7z2EwItTKWFtJb3ObctIA)",
            "Just released first POP single made entirely remotely over internet. We can't sing so vocalist was hired! [https://www.youtube.com/watch?v=1Ygle0I\\_6zo](https://www.youtube.com/watch?v=1Ygle0I_6zo)",
            "My name is Kyle DeHaven and this is the first song off of my latest album:\n\n[https://www.youtube.com/watch?v=CHFiZa8Ff5U&list=OLAK5uy\\_mtbmwshLMU7EdU\\_GHaIBBt2NdC1\\_wg9bE&index=2&ab\\_channel=KyleDeHaven-Topic](https://www.youtube.com/watch?v=CHFiZa8Ff5U&list=OLAK5uy_mtbmwshLMU7EdU_GHaIBBt2NdC1_wg9bE&index=2&ab_channel=KyleDeHaven-Topic)\n\nSome have described my sound as stripped down grunge/folk punk, Thanks!",
            "Hey guys, my dumb self accidentally removed some files and in turn I lost a few of my ableton projects ;(\n\nI'm so let down but I still want to release my album, thus I am trying to recreate one of the main songs. I just can't seem to get the background melody right... Can someone please help me out?\n\nJust the melody - [https://soundcloud.com/ostap-beshta/melody/s-D9Wxz4XHDFu?si=8e3f66be7ac2477dab7942ed7fa08343&utm\\_source=clipboard&utm\\_medium=text&utm\\_campaign=social\\_sharing](https://soundcloud.com/ostap-beshta/melody/s-D9Wxz4XHDFu?si=8e3f66be7ac2477dab7942ed7fa08343&utm_source=clipboard&utm_medium=text&utm_campaign=social_sharing)\n\nMelody with the rest of track - [https://soundcloud.com/ostap-beshta/lonely-nights-in-a-crowded-room?si=9df77dffa4d144b2ac2a1f696fca9868&utm\\_source=clipboard&utm\\_medium=text&utm\\_campaign=social\\_sharing](https://soundcloud.com/ostap-beshta/lonely-nights-in-a-crowded-room?si=9df77dffa4d144b2ac2a1f696fca9868&utm_source=clipboard&utm_medium=text&utm_campaign=social_sharing)\n\nI will literally give you credits on the song if you do this for me..",
            "No matter how many video tutorials i look at I am always unsure about my mixing. Maybe my ears are just not sensitive enough. \n\nI fiddle with the mix and it sounds good, until i export and then something sounds off.\n\nSo what am I missing here.\nWould appreciate some mixing related feedback specifically based on my track: \n\nFossil Eater - God of Gaps\n\nhttps://on.soundcloud.com/qghRHcBHkfpHoJT27",
            "My first rap song, I waited it to feel raw and be lyrical, any feedback would make my day ❤️\n\nhttps://on.soundcloud.com/AUFz25ev7pyAYwr17",
            "This track is inspired by the band standing on the corner, and I wanted to feel messy and kinda rough. I'm happy with drums, I think they really got the feeling, but the bass and especially the keys aren't really there. I was hoping for tips on how I can fix that, as well as just general thoughts on if the instruments are too sparse, especially the chords. Thanks!! \n\n[https://soundcloud.com/tanvir-sahni-536921275/ouch?si=0795374b2940447d90ace245ea6f4768&utm\\_source=clipboard&utm\\_medium=text&utm\\_campaign=social\\_sharing](https://soundcloud.com/tanvir-sahni-536921275/ouch?si=0795374b2940447d90ace245ea6f4768&utm_source=clipboard&utm_medium=text&utm_campaign=social_sharing)",
            "Wrote and produced this new rock song by my band DownUpDown. I’m Playing B3 organ and bass on it, aiming to get a raw but harmonic sound. Enjoy [https://open.spotify.com/track/2pjqPEM2kbKKsAhgPwCCpB?si=NKhiXBGHTYGwQGBFgEqKAQ](https://open.spotify.com/track/2pjqPEM2kbKKsAhgPwCCpB?si=NKhiXBGHTYGwQGBFgEqKAQ)",
            "Hey would really appreciate some feedback on this [Beat](https://youtu.be/1lJdZZEwDaU) so lmk what u think!\n\nAlso returning feedback",
            "Rnb Track about life:\n\n[https://open.spotify.com/track/2YGbL9VAOXCrUs6tR4ABZr?si=4447bcf0dcdb41ce](https://open.spotify.com/track/2YGbL9VAOXCrUs6tR4ABZr?si=4447bcf0dcdb41ce)",
            "I am mixing an old 1940s popular standard and am not sure if I have the right balance between the vocals and the orchestra. Do the vocals stand out enough? Or maybe too much?   Below is a link to a 1 minute excerpt.  Thanks so much.  [https://drive.google.com/file/d/1bs1WRifw-ygAKPr6e8pNwYoN4JH6IR76/view?usp=sharing](https://drive.google.com/file/d/1bs1WRifw-ygAKPr6e8pNwYoN4JH6IR76/view?usp=sharing)",
            "This is my newest track, titled Mirage; it's an instrumental electronic / dance track. Would appreciate feedback on the song's sound design (especially bass and lead synth) and arrangement, as those are areas I struggle with. \nhttps://open.spotify.com/track/2I4LnIWyntOlidbxPTPsn9",
            "!! RETURNING FB !!\n\nRecently published my latest track 'Molly's Kid' ... going for a melodic chillwave type of thing. Appreciate any fb on the composition / production / vibe :\n\n[https://open.spotify.com/track/1qKFypGJMHHmrQOPPy6VMa](https://open.spotify.com/track/1qKFypGJMHHmrQOPPy6VMa)\n\n[https://youtu.be/9HmurYNq2Jo](https://youtu.be/9HmurYNq2Jo)\n\nThanks!!",
            "Saunimon - DD\n\nhttps://open.spotify.com/track/0YoE1eO6rmJp5XvWJEk1Xl?si=4c6acbe5432a4edb\n\nhttps://music.apple.com/us/album/dd/1711362474?i=1711362480\n\nhttps://saunimon.bandcamp.com/track/dd\n\nthis is a ambient pop ballad from my mixtape, ANDERS. was inspired by vaporware and dreamcore for this one. would love some thoughts, enjoy!\n\nif you want to stay up to date with me, here’s my ig:\n\nhttps://www.instagram.com/saunimon",
            "indie, alt rock, folk, post hardcore vibes\n\n\nRemastering for an album. I think a bump around 200hz and 60hz could lift it a bit. What do you think? Any feedback would be great!\n\n\nhttps://www.youtube.com/watch?v=DTltpkCTEJ0\n\n\nhttps://liontrail.bandcamp.com/track/well-be-forever",
            "Hey everyone. Just made this hip hop beat wanted to know if you guys have any feedback. Thanks for listening.\n\n[https://www.youtube.com/watch?v=YxDDBzv9UFA&ab\\_channel=FranciscoMonteiro](https://www.youtube.com/watch?v=YxDDBzv9UFA&ab_channel=FranciscoMonteiro)",
            "[acoustic catdog theme](https://soundcloud.com/wormridge/catdog-222-cut/s-GGlvInoE2qQ?si=d6d4f89feb9246a5993ef9c0fffca98e&utm_source=clipboard&utm_medium=text&utm_campaign=social_sharing)\nkinda indie/lo-fi/twee i guess, maybe freak-folk? not sure if i quite fall under that genre.\n\n posted this before, now i have double-tracked the main vocal, added some higher pitched background vocals, and added a whistling noise.\n\nlooking for any comments/criticism/feedback.",
            "Hey everyone, i released my first song today, would really love to hear your thoughts\n\n[https://distrokid.com/hyperfollow/akrid1/m7](https://distrokid.com/hyperfollow/akrid1/m7)",
            "Instrumental track that combines ambient music, house, and kind of an R&B vibe\n\nhttps://open.spotify.com/album/56pvEQHuadBanbir8ecKZK?si=Ypk6llCBTiC6pn13TjMJ-Q [day dream](https://open.spotify.com/album/56pvEQHuadBanbir8ecKZK?si=Ypk6llCBTiC6pn13TjMJ-Q)",
            "i've been trying to clean up some of my mixes, and was hoping for feedback on this song i cleaned up. anything to point me in the right direction as i still feel pretty new to mixing, but feedback of any kind is greatly appreciated.\n\n[Gomorrah](https://on.soundcloud.com/w7TpFWMmM2utdJnY9)",
            "A Tribe Called Quest - 1nce Again (HD Remix)\n\nhttps://youtu.be/5tNnqV3vh3c?si=M3fj8NVAZ5eSYHsP",
            "This is part 3 of my four-part EP. The full 17-minute EP can be found in my Soundcloud for those who are interested.  \n  \nThis is a dark-edged big beat/trip-hop number that stands as the darkest moment in the EP. Tell me what you think!\n\n[\"Life Tracks Part 3: For How Long\" by proJectmaker](https://soundcloud.com/projectmaker/life-tracks-for-how-long-edit?si=12ea687ad91b49fdb68e4c5f5296e5c1&utm_source=clipboard&utm_medium=text&utm_campaign=social_sharing)",
            "It's been awhile so I'm posting in one of these again. \n\nHere's my bands latest release Enharmonic. It's a little bit more rockier than our usual stuff, but I would still love feedback on the Mix, Tone, and Arrangement aspects as we're gearing to have another single release soon. \n\nThanks and I hope it sounds alright. \n\n[Enharmonic - Ryan Gads](https://youtu.be/79BLZlazKlw?si=fFEzs4LrrsXd61kl)",
            "[Padiano - Static Projekt](https://on.soundcloud.com/WFGhukpmmMwQCrcA9)\n\nEDM/Hyperpop sounding dance track, looking for any feedback but also wondering if anyone else thinks it's lacking vocals",
            "***Callummm - Largo for 19 Shower Holders and the Ability to Slow Down Time Very Precisely***\n\n[YouTube](https://www.youtube.com/watch?v=3E-aPUTIAQM&pp=ygUOY2FsbHVtbW0gbGFyZ28%3D) // [Spotify](https://open.spotify.com/track/3oFMRrLBaZFrPIDQTDCKu1?si=e7477e539d314e3c)\n\nFreshly released today! I'm challenging myself to make an album using only a shower holder, and this track is the first release, made with a time-consuming time-bending process! Slow, experimental, hints of ambient, drone, microtonal, musique concrete, etc. Any thoughts (video, composition, mix) are very welcome, and I'd specifically be interested in what kinds of playlists you could imagine this song fitting into?\n\nFollow my [Instagram](http://instagram.com/callummm_yes) to hear more, or to know about shower holder gigs in London!",
            "Hi! Looking for feedback on this Pop Rock track \"Best I Ever Had\"! Will return feedback!\n\nhttps://open.spotify.com/track/6WOsbtId0IKq3px6SdXm3Q?si=9ec813c468664bce",
            "[Abandoned - Sam Brenner](https://open.spotify.com/track/1gUPuMjmCUZuOfowzVEGby?si=oYW6qoSCReG2_IGA8RRsIw)\n\nLooking for some feedback on melody for my verses /lyrics. I’ve received feedback from people on submithub that it’s repetitive and doesn’t “grab” the listener. Hoping to get some constructive feedback or examples of artists that can help me improve! Thanks!",
            "Hi! I made a beat and wanted to get some feedback on it, especially on mixing because I think that's what i struggle with the most. Thanks!\n\n[https://www.dropbox.com/scl/fi/hzabx3obgkkp4mlhadaq9/rgnflr.mp3?rlkey=vwqh0bd95eawsc57tnmu6l3q5&st=i4k70vfb&dl=0](https://www.dropbox.com/scl/fi/hzabx3obgkkp4mlhadaq9/rgnflr.mp3?rlkey=vwqh0bd95eawsc57tnmu6l3q5&st=i4k70vfb&dl=0)",
            "[J Priori - Pressure | REEL1RAW \\[HIPHOP & LoFi\\] (youtube.com)](https://www.youtube.com/watch?v=HCblssoEw-g)\n\nHey guys, experimenting with some things and wanted some feedback. These are my own mixes, not perfect but getting better translation. Let me know what you think!",
            "[Campusanis - Brand-New](https://www.youtube.com/watch?v=UY4lKsBWhvQ)\n\nI'm looking to pitch this song to Spotify playlists but am not sure about the genre. I usually do more straight-forward alternative rock stuff, and while I don't think this song is worlds away from that, I don't know what exactly to call this. Any genre ideas and/or playlist suggestions would be super appreciated!",
            "[Spacey/ambient electronic](https://www.dropbox.com/scl/fi/44dl2wxz7d09oxi0yxfyo/vision-tap.wav?rlkey=t7wc3twwaiqegcveci5juoz1o&st=xm2heg5k&dl=0) - Is it too random? used Granulator in Ableton to randomize the playback position of a vocal loop so its basically random vocal chops soaked in reverb. Then i added tons of pad layers and textures.",
            "Yo whatsup! Here's a demo of my new song with this female singer from Toronto I've been collabing with. I made the beat around some dry vocals she sent me, went for a club feel with the synths. I rapped two of the verses & did the hook\n\nI re-structured my beat last night to add more energy & variation, I might re-record a few parts to fit that vibe better now though (drums were mostly \"four on the floor\" when I first recorded my verses).\n\n\n\nLet me know what you think so far! Returning Feedback - [https://on.soundcloud.com/DNWneoB5eyjTVPxv9](https://on.soundcloud.com/DNWneoB5eyjTVPxv9)",
            "My first song ever!! Its in Japanese but I hope someone can help me polish my J-rock sound. Please be kind!\n\n[https://on.soundcloud.com/TTQAzws9LWY7Q9Dq5](https://on.soundcloud.com/TTQAzws9LWY7Q9Dq5)",
            "If anyone knows how to better produce the bit in the middle of this piece, I'd be grateful\n\nThis track will come near the end of a gaming-style album that I'm currently creating, but the small silence/drop almost exactly halfway through just feels lackluster to me right now, and I have no idea how to make it jump\n\n[Hero's Stage](https://on.soundcloud.com/bYdPq)\n\nEdit- the link is broken, please use the one below!",
            "Chceck our new song FCK WRLD and be ready. New music is on the way.\n\nThx for every ♡, comments and reposts.\n\nLove u all, BJ.\n\nhttps://on.soundcloud.com/tyS78",
            "made a little dark lofi hip hop beat and would love some feedback :D\n\n[https://soundcloud.com/crowbina/noir](https://soundcloud.com/crowbina/noir)",
            "[https://vocaroo.com/161UBYgQaViX](https://vocaroo.com/161UBYgQaViX)\n\ni made this loop this morning. i worked so hard on the harmony behind using all my music theory knowledge but i feel that it doesnt have the material to be a trap song. lmk your suggestions",
            "I uploaded a new music video a few days ago. It's gotten a lot more positive feedback than normal, so I'm pretty happy with it, especially given that I have really no experience in video editing haha. \n\n[https://www.youtube.com/watch?v=Ebq1Us5oExY](https://www.youtube.com/watch?v=Ebq1Us5oExY)",
            "[Before You Leave Me Cover](https://soundcloud.com/mileena_rayne/before-you-leave-me?si=d0520ec571bc4d9abdc7f1e47dc6dd3e&utm_source=clipboard&utm_medium=text&utm_campaign=social_sharing) I made a cover song originally by Alex Warren. I changed some of the melodies and I feel like it fits for my beat I found, I hope it all still works anyways. The original song is so great. Do I have a good voice for this folk/country type music? I was also wondering if I did well on my layering. I've been working on doing more with layers. I welcome any and all feedback, Thank you :D",
            "Hello I'm MTA and id love to hear feedback for my track (I feel).\n\nMake sure to hear both drops please 🙏 \n\n[MTA - I Feel](https://on.soundcloud.com/VFx5vrjM6xtx12cQ9) \n\n==> Also any ideas which genre it belongs to (piano house ?)",
            "\\*AMBIENT ELECTROPOP\n\nI've been sporadically working on this track for about a month and I feel I've hit a bit of a dead-end. I'd love any feedback re: mix, structure, etc. I don't think I'm done but the end is nigh. Very excited to release this one, any tips are greatlyyy appreciated!\n\n[Depth Blindness V2](https://soundcloud.com/christincarnate/depth-blindness-v1/s-9xLe7QubvgY?si=ada89975487c4ed48cd05f740e1e9942&utm_source=clipboard&utm_medium=text&utm_campaign=social_sharing)\n\n(Also-- I'm working over a beat my friend sent me so my control over that aspect is pretty minimal)",
            "Greetings! I wanted you to listen to my latest experiment, the same song in different keys, the soul of the sound remains the same but varies so as not to remain monotonous (at least that's what I hope!)  \nsuggestions and criticisms are welcome! Thanks in advance!  \n:)\n\n [https://youtu.be/HaXqsGaNJHI](https://youtu.be/HaXqsGaNJHI)",
            "https://on.soundcloud.com/etnqpML31DiXauCRA\n\ngoing for a memphis beat. Feel like something is missing but at the same time dont want to add too much stuff or else i think it’ll be too much going on. idk anything about music theory or what not, just whatever sounds good i guess",
            "Hi this is not my song \"I nether wrote it nor did the music\" but saw the video on YouTube and started playing around with it with an online music mixer called [Rave.dj](http://Rave.dj) and came up with the jumbled up base of what I think could be a great song if mixed professionally. I think it has a Lana Del Ray vibe \"I did use a free beat called Lana Del Ray beat puppy\" but yes I could be completely wrong. I have posted it here [https://rave.dj/ezDf7eyhcdESmQ](https://rave.dj/ezDf7eyhcdESmQ) and  the original song/video and artist is here [https://youtu.be/J-EG7R5ZsZ4?si=lgIuphUjEfs2dg4i](https://youtu.be/J-EG7R5ZsZ4?si=lgIuphUjEfs2dg4i) If you can hear the potential hopefully you can contact her and do something as I would love to be able to help in some small way an artist break through. Thank you.",
            "New deep house track looking for a home, pretty happy with the mastering on this one for once in my career!\n\nLet me know what you think of the mix and master on this one \n\n[https://soundcloud.com/kaphamusic/spectre](https://soundcloud.com/kaphamusic/spectre)",
            "mashup/remix thing - https://on.soundcloud.com/tTdjonZppjywVQG7A any mixing feedback in particular appreciated",
            "This is part 3 of my four-part EP. The full 17-minute EP can be found in my Soundcloud for those who are interested.\n\nThis is a dark-edged big beat/trip-hop number that stands as the darkest moment in the EP. Tell me what you think!\n\n[\"Life Tracks Part 3: For How Long\" by proJectmaker ](https://on.soundcloud.com/Kr4EA)",
            "Hey friends! I just released my first single Dance The Night Away! It's a dance-pop/nu-disco style track. I would love some feedback on it: [https://open.spotify.com/track/1tSF2V2yYRUqDrWvqjUcrS?si=be7d0196f44444ee](https://open.spotify.com/track/1tSF2V2yYRUqDrWvqjUcrS?si=be7d0196f44444ee)",
            "I tried to make a different type beat from what I usually do. Would love to hear y'alls thoughts on this. [https://www.youtube.com/watch?v=LDZWRw8kIFk&ab\\_channel=Wavit](https://www.youtube.com/watch?v=LDZWRw8kIFk&ab_channel=Wavit)",
            "[Bass Sounds (Indie Dance)](https://on.soundcloud.com/G29DmUEUCg3WagQd8)\n\nWorkin on a collaborative EP with my best friend of these like indie pop/dance tunes and this is the one I’m focusing on currently! Probably gonna record some more vocal layers and work on some glitchy cutups if I’m not satisfied enough with the current version, but what do yall think of the work in progress mix and the song itself? I’d love some opinions! Will return all feedback, link your song :)",
            "Hey everyone, my name is Ben or Vellichor (artist name). I make melodic house and organic electronica stuff. \n\nLet me know what you think of my new song/music video \"Dear Indiana\". \n\nBelow: \n\n[https://www.youtube.com/watch?v=Si3Zv8dxMH4](https://www.youtube.com/watch?v=Si3Zv8dxMH4)\n\nLooking for feedback on the overall feel, what do you think of when you listen, what would you say the genre is? \n\n  \nThanks and looking forward to hearing everyone's creations\n\n  \n-Ben",
            "hey I'm jarad webster I usually only do rap, but I heard frank ocean and now I'm inspired to do R&B. Is this a good sound for R&B? or does it just sound like a soundcloud artist made it? [https://www.bandlab.com/post/ddd867d1-4929-ef11-86d2-6045bd2cd6bc](https://www.bandlab.com/post/ddd867d1-4929-ef11-86d2-6045bd2cd6bc)",
            "# Running(prod.noizy)(lyric video)\n\n#  [https://youtu.be/\\_kDWMCmAhHQ](https://youtu.be/_kDWMCmAhHQ) \n\n# [https://on.soundcloud.com/KLLAswCGqMAYSg177](https://on.soundcloud.com/KLLAswCGqMAYSg177)\n\n#  NEW SONG,DO CHECK IT OUT, GOD BLESS",
            "My band played a concert, first one we recorded!\n\nWe're a Swedish band called The Rhythmic Service, who play our own songs mainly written by me. Very wide range of genre and some spicy instruments!\n\nI wrote the songs for this concert while at exchange studies in Ireland last Autumn, and I don't know exactly how to describe it. It's a story about the band going on an adventure through Irish folklore, and it's also a metaphor for my time there. Very fun!\n\nHave a listen and let me know what you think!\n\nhttps://www.youtube.com/watch?v=BANTaRAsu3I",
            "Hello, \n\nI am a small indie artist named: Vansanity, I make Hip-Hop/Rap, and R&B as an artist. \n\nHere to showcase my talents in this song I made [Talking Frog in My Pocket](https://youtu.be/13cXS8B_uoQ?si=sUy_kz-VwKcS42kI)",
            "Hello,\n\nJust started learning music production and was hoping for some feedback on a song I made. Any comments with regards to mastering and song arrangement would be helpful. \n\n[Wanderers Still](https://on.soundcloud.com/owjka)",
            "HEY! what do you think of this sound? modifications to the same song create more tracks that I tried to connect together with always this soft siren background, it's an experiment!  \nI would appreciate any kind of feedback also because I like this kind of bases but I don't know how far I can go so as not to be boring!  \nThanks in advance!\n\n(:\n\n [https://youtu.be/DSase0ZN5E0](https://youtu.be/DSase0ZN5E0)",
            "Hey, I just released a new [beat making video](https://www.youtube.com/watch?v=xsEd4r7vSFM&t=27s&ab_channel=polishsmile) - would love to hear some feedback from you guys.",
            "Wrote a nice EDM track, and got no listens.\n\nHow do you think, is it worthy?\n\nhttps://m.youtube.com/watch?v=ON-K_oDe7sM&pp=ygUMUGxheVRvbmUgWWFo",
            "My newest EP, goes for around 10 minutes.\n\n[Spotify Link](https://open.spotify.com/album/2MfYR2F6dS58FAc7RzQxJ7?si=zwWHJyHwR2ejoJVqi3DwnQ) \n\n[SoundCloud Link](https://soundcloud.com/markioly/sets/this-aint-going-to-plan)",
            "Does this sound madlib inspired? Is it listenable?\n[Beat](https://drive.google.com/file/d/1PxQRfQTQi58wPppVVswGPsUrWQ_Farcf/view?usp=drivesdk)",
            "# awake awake brotherin(prod.noizy)(lyric video) new song,do check it out\n\n[https://youtu.be/cnO7M058IAs](https://youtu.be/cnO7M058IAs)\n\n[https://on.soundcloud.com/yfy1K6tig1wdJefa7](https://on.soundcloud.com/yfy1K6tig1wdJefa7)\n\nGOD BLESS",
            "# Give it to us!\n\n# Need some feedback.\n\nHey guys!\n\nWe need some feedback on a tune we made. We worked really hard on it. Hope you like it!. If not please give us some good criticism so we can improve! 😱\n\n  \nLet's GO!!\n\n[https://soundcloud.com/adderoony-hynter/yesterday-sun?si=c0e81ae9f84f4923a04d5fca5d2d2f9c&utm\\_source=clipboard&utm\\_medium=text&utm\\_campaign=social\\_sharing](https://soundcloud.com/adderoony-hynter/yesterday-sun?si=c0e81ae9f84f4923a04d5fca5d2d2f9c&utm_source=clipboard&utm_medium=text&utm_campaign=social_sharing)",
            "[https://soundcloud.com/howard-lamb-123/trippy-trap-beat-free](https://soundcloud.com/howard-lamb-123/trippy-trap-beat-free)",
            "I'm 59, old enough not to have to take myself seriously, but my knowledge of software is good enough to sculpt sounds. If I build/distribute a vst to sculpt music do you think it can be usefull ? (Right now I can do it locally).  \nI make this track Emotional Portal (DRUINE) with it:  \n[https://youtu.be/CqEoqu9DOWQ](https://youtu.be/CqEoqu9DOWQ)  \n[https://open.spotify.com/intl-fr/track/0tRhKKHW081qx1sx8f0wGB](https://open.spotify.com/intl-fr/track/0tRhKKHW081qx1sx8f0wGB)  \nSome professionals said it's good and adds it to playlists. But I'm just wondering if the sound sculpting I get would be useful to you?",
            "Heyo, I'll be returning feedback to anyone who responds.\n\nFinally figured out the main single for my debut album, I've been struggling with making short songs and I finally got a 3 minute-r with a nice vibe and energy that could be played live and get people excited. The song is about a woman I met on the bus, and how our encounter got cut off by her having to get off the bus. I'm looking specifically for critique on the arrangement and compositional technique. There's a few parts I think still need work, but I'm going to re-record this song with whatever feedback I get in mind, then this version will probably go on a demos tape or something.\n\nAlso, what does the band name \"The Manta Shrimps\" make you think, first impressions before and after hearing the song would be incredibly useful as I'm still figuring out the perfect band name but I'm pretty close to settling on The Manta Shrimps.\n\nTHE MANTA SHRIMPS - BUTTERFLIES\n\n[https://www.youtube.com/watch?v=zGJNharUkS8](https://www.youtube.com/watch?v=zGJNharUkS8)",
            "How are y'all. My name is Marcus Gianni and I took a break from music for a year or two but now im back and this is my first track. Any feedback given or love you guys want to show would be appreciated! [https://soundcloud.com/user-500596067/mommas-gift](https://soundcloud.com/user-500596067/mommas-gift)",
            "[https://soundcloud.com/electro\\_milk/ghostly](https://soundcloud.com/electro_milk/ghostly)\n\nI would love to hear some feedback on this track. It's the most fun I've had working a DAW in a while! The vibe is synthy groovy dark electronic rock/dream pop",
            "SYNTHMANIA\n\n[https://youtu.be/fR68QOHGHzM?list=OLAK5uy\\_lBFTA0vmOM222iIUyiXXupy285ut6Q\\_Qw](https://youtu.be/fR68QOHGHzM?list=OLAK5uy_lBFTA0vmOM222iIUyiXXupy285ut6Q_Qw)\n\nThe second of the deepmind 12-logy. I'd love your opinions on this admittedly weird composition.",
            "Beautiful melodies and vocals for your personal enjoyment, let me know how I did by subscribing, or liking, if you really like it look up \"24 hour club\" on your favorite streaming platform.\n\nListen -\nhttps://youtube.com/channel/UC4Xdn0MXxk7uOc_MnHbPcKA?si=NggohR6_y_X3ytv2",
            "tried my handd at something a bit more experimental. let me know what works and what doesn't, it would be a great help!   \n[https://soundcloud.com/soundtraki/017165\\_15\\_15-21777-1678-22a](https://soundcloud.com/soundtraki/017165_15_15-21777-1678-22a)",
            "I'm not a singing expert but I believe some lo-fi textures on the vocals will fit the mood better!\n\nThey are too \"clean\" for the style...",
            "Cheers for sharing. I am thinking it could be cool to experiment with some echo and or delay and possibly stereo effect plugins.",
            "Agree with the other post, the vocals need something, but im not sure what. Dunno if lofi is the way to go, but worth to try.\n\n The bass and drums are nice, I like them. Maybe add a bit more variation in them though?",
            "That bassline is beautiful\n\nThe vocals aren't great to be honest, the melody idea works but I think there's parts where you're trying to fit too many words into a measure and it ends on a bit of a word salad. I also think you need some singing lessons (coming from me that's fuckin hypocritical). These vocals over this kinda post punk-y song I reckon you could reverb the fuck out of these vocals and it would sound great.\n\nThe end part with the hi hat was sick, don't change that!",
            "I think you need to bring your rhythm guitar more forward. The tone you're using here has a lot of dynamics going on and those plucks should be more noticable. I'd experiment with the levels of your tracks and some subtle audio effects could go a long way to fill out the mix. Double tracking guitars might be another way to get a more full sound there. As it stands I think the mix is a bit thin. And I really like that bassline 👍",
            "100% with the other comments. Try some different vocal takes and maybe add some interesting effects to the vocals while sitting them a bit deeper in the mix. Don't keep those other instruments hidden behind the lead!",
            "Cool intro! The entrance of each sound is fitting and sounds great. The beat entering is also great timing and composition, and perhaps the drums could be sharper in the mix as it feels a bit too muddy IMO. Overall good use of sounds!",
            "A very unique composition! I definitely love the groove! what synths did you use?\n\nI love the track through and through and I'd love to hear an extended mix someday!",
            "Loved the track, parts of it towards the end reminded me of Tycho's music. Especially liked the bass at the beginning. As others have mentioned, the drums could stand out more but in parts of the track I do like the more muted quality of the drums. ",
            "Overall this was fun to listen to, the sound selection overall stood out to me, nice work!",
            "Maybe the very last note could be different though I respect an ending where \"people\" just stop playing. There seems to be an opportunity at the end. Was that a dobro slide emulation? Very nice!",
            "hey i like this song!",
            "judging just by the title, yes, but the song is good i like it. The Lyrics are depressing tho but if thats your vibe then go for it I guess",
            "As a person infatuated by the macabre, I cannot judge the lyrics...\n\nI love the tension of the song, the happy drums clash with the dark lyrics creating an unique atmosphere!\n\nThe guitar tones are beautiful here as well as the mixing! I love your style!",
            "I ask this question often, but people listen to music to feel. Think about how many bands sing about heartbreak and being hurt, or hating themselves. Whenever I feel like my lyrics are too depressing I always tell people it’s just me using my artistic license lol",
            "Really enjoyed it! Very chill but also do appreciate those rhythmic elements in it. I don't really have any constructive criticism for it ",
            "really nice, definitely chill enough to relax or study to. loved the bell and the whole switch up, gave the song a more spacious feeling. nice chill groove on the drums, kick hit nice and hard. bassline was nice, set a nice foundation for everything.",
            "Wow! I was super impressed by this track. The orchestral elements definitely brought in an emotional quality and weight to the track. Also really liked the instrument that came in at 1:04 ",
            "Loving the combination of sounds and the simplicity of it, quite beautiful",
            "I like what you have going here! The production is nice, the vocal performance is solid, and well-mixed. Honestly my only real feedback might date me, but I'm missing a bridge. It feels like the song has another gear that we never got to. Obviously that's a LOT more work, to create a memorable bridge, but my gut tells me I want to hear a change up of some kind before that final chorus. Perhaps not a massive amount of extra work to repeat the music of the last verse with some kind of musical solo? Know any good acoustic guitarists who could add a tasteful lick? Or even something surprising like a classy jazzy flute?\n\nIf you don't agree it needs that, I'd say the song is ready for whatever you have planned. It's nice!",
            "Great mix, the vocal sounds really clear even on my crappy laptop speakers, which is hard to achieve. I agree a bridge could work wonders and elevate the song to another level, but I think it definitely works as it is.",
            "Sooo cute! Almost giving laid back k-pop song which i love personally",
            "great song, sounds a lot more professional than last time if im remembering right. really nice dreamy instrumental, and the mix is really clean and clear. great vocals, really emotional and emphatic delivery.",
            "I really like the stellar theme (universe etc.) perhaps for the context I would have lowered and varied the notes a little so as not to give too much repetition and not make it resemble a chant, unfortunately I also continually fight with repetition in songs to always create them more fluid and listenable. but still nice work!",
            "Production is tasteful. The synth voicings you've chosen are great. I would agree it's too repetitive, but this is the risk with instrumental music. If you don't have a lead line and you aren't telling a story with a voice and melody, you have to work twice as hard to take the listener on a journey. Considering most aspiring musicians these days seem to gravitate to instrumentals, you have to fight to make anything unforgettable in this glut of content from which we all can consume. Great start though, and as you say, did she like it? If so, you already scored a key victory! =)",
            "I like how all the instruments blend nicely without any feeling as though they overpower anything else. The video is also reminiscent of Bill Wurtz",
            "No feedback from me just appreciation - love the music and the video",
            "Yo dude, nice track, dig the vibes. In terms of feedback, I think it could be cool to add some sort of texture like rain or vinyl crackling in the background, but that's just me",
            "I really like the piano track, the only thing I would tell you is that if a track is so full of emotion and you try to create a video that conveys it I would change style, the comic cartoon doesn't seem suitable to me, having said that I like the track content message too! keep it up!",
            "This is great, I've always loved immersive sound & these pianos are amazing. Congrats, keep it up.",
            "Yo, this is dope. It reminds me of the compositions of my uni professor. Something i would think would be cool to add to the vibe of the piece is to add a video of a forest or just something that fits the piece. I also think it would be cool if in the future, you experiment with impulse response reverbs, or granular delays.",
            "Lots a nice piano work in here. The loud pluck was really interesting...I think you should play on that more throughout the song to keep the audience aware. I really like the progression around the 12:30 mark. Make it a little more clean with some attack on the synth.",
            "this is really really good.. especially the bass around the 3 min mark, i think it contrasts really well with the piano and synths and creates a really special atmosphere.",
            "I enjoyed this one a lot - put a few of your tracks into my driving playlist :)",
            "I too have added this to several driving playlists now. \n\nNice work, fan gained!",
            "Cool intro with the synth and vocals, very smooth. The instruments are all fitting well. The drums entering are real fitting, and perhaps the beat could be a bit more complex at points. Overall it sounds good IMO :)",
            "I'd love an instrumental version, the vocals ruin the ambience of the song and turn it into a pop-esque piece.\n\nOtherwise you did a great job! Very professional recording! Especially the vocals!",
            "I love the vibes but imo the drums could have come in earlier and a light hihat or smth would have also benefited them imo. The instrumental is great tho, I love it",
            "Man, I love that theme, it's so good. Also, well played, better than I could do it 😀\n\nI got no constructive feedback, sorry, I just enjoy rocking out to it!",
            "The playing is done really well, I think the tone is a bit too muddy and gain-y if that makes sense, it could be a bit less overdriven and the tone knob could go up by a teeeny bit. Apart from that though I think it works through and through, the playing is well done.",
            "Absolutely dialed in with your intonation on those bends, nicely done",
            "I  definitely love the sad dark aesthetic you are going for. A sense of melancholy and loneliness encapsulates the listener. A beautiful introspective piece!\n\nThank you for sharing!",
            "Would you have an alternative to spotify for me to listen to? Thanks.",
            "This felt almost like a soundtrack song to me, with the atmospheric qualities and all. But that’s not a ding it was still an enjoyable listening experience especially with headphones. The sound selection was cohesive and that low end bass isnt super loud but it’s there, lurking. Nice work!",
            "It's got a big dungeon synth vibe to it at the beginning.\n\n  \nI think the mix is really sharp and too in your face, the snares and kick especially are quite harsh and my ears kinda have to turn down their sensitivity to accomodate that but then I miss out on other parts of the instrumental. The drum beat itself is a cool rythmn, although that snare fill does get a bit overused (every single fill it's a bit much) it is a cool fill\n\nThe synth note bit around 0:55 is really good.\n\nThen you got the spooky part around 1:10 which is where the dungeon synth first impression came from I think.\n\n  \nOverall I do see potential in this as a kinda horrorcore Clipping type track.",
            "Great now I have the image of Jason Vorhees rapping in my mind...\n\nGreat beat, energetic, in your face and fun! \n\nIt's not my type of genre but I appreciate the execution!",
            "Kinda sounds like you played with the Pan a little bit too much, atleast imo and the sadly the build up has no dynamics and kick build up would need a chang up imo, especially when you use it so often, but other than thats its good",
            "I forced myself thru this by turning my headphones down, the drums are clipped super loud and distorting, but from what I could hear of the instruments, there are some pretty cool buzzing bass and synths that should be in the foreground of the mix. You can even see it in the waveform that the sounds at the beginning are almost half as quiet as when the drum slams into the clipper. Turn the drums down in the mix so you get everything sitting around negative 3db and and use a multiband compressor to bring the overall track volume up to no more than 0db. If you want intentionally distorted drums for horror theme, I dig bit reduction distortion for a light static sizzle that adds depth. The song idea has potential, but needs to be mixed and mastered.\n\nOn a side note, the loudness wars of the mid 2ks ended, music sounds far cleaner when it's dynamically mixed lower and you may need to turn headphone UP to hear things, not DOWN because it's too loud. A quieter mix will still hold focus for the listener to decide to listen harder and turn it up, but if the track comes in too hot, the first reaction is to hit mute/stop/skip and if you're lucky, they'll just turn it down to not damage their ears/speakers. I'm mega guilty of over clipping music from 20 years ago, and now trying to locate the original masters to redo them, but that overdrive for powernoise/gabber kinda worked at the time, but it's 2024 and there are way better plugins for mastering than slamming it into a Brickwall limiter.\n\nTotally dig the horrorcore theme, I'm aliens 👽",
            "I find it well mixed actually, each instrument is in a clear position in the mix.\n\nThe composition itself is awesome! it has a nice buildup to it. What exactly would you want to change here?\n\nMaybe I'm overlooking something? It sounds good to me...\n\nThe epic ending is awesome I love the second part of this composition!",
            "Interesting melodies and use of instruments in this one! I wouldn’t worry about genre clash, I think mixing genres is how we push music forward. I like it!",
            "This is the best thing I've heard here today. I love it, the vibes are stellar. Really nice job. If I were to critique one thing about the composition it's at 2:10, I get a little lost in what you're trying to do here. Whatever melody is going on clashes a little bit with what you've built up to. Don't take that too critically because I think what you've got going on here is really cool and unique.",
            "Totally down for the vibes here, really chill. As a matter of taste I would recommend cleaning up the lows just a little bit, but it also could totally be the texture you’re going for too. I echo the other comment on not understanding the direction of 2:10 on as much, but I don’t think it keeps this from being really great!",
            "Nice work I think this is all good. I don't think I would change anything\n\nLooking for feedback on this https://youtu.be/5tNnqV3vh3c?si=Urt_zlQBrV34C9E6",
            "this is really cool, i really like the atmosphere. i think the bass sounded good, a nice rumble throughout. sound design and direction overall was really nice.",
            "This is top tier shoegaze right here. Sometimes less is more and I think this is a perfect example of that. The heavy reverb feedback on your tone is really awesome and your voice is complimentary to the vibes.\n\nI don't know if it needs a solo to be honest. One thing that did come to mind is, idk if you've ever listened to Wand but their Golem album has this crushingly deep dirty heaviness and I was just imagining this moment where that huge tone would just come in swinging hard. Not actually necessary but I just really want another band like early Wand to come along lol. Anyways, hope you actually develop this into an album, I'd buy it.",
            "That song is much different than your other songs on soundcloud. I'm curious about the difference. Blue Heart vs On My Mind is way different.",
            "Cool sound that gives a kinda Rey Pila vibe. Not sure if the lyrics will age that well though lol.",
            "nice song, i like the upbeat playful vibe of it. really nice sound design. i like the lyrics, i think they fit the playfulness of the song. i think the vocals could be a little more forward/ clear, especially during the chorus. the vocals sound nice, they just sometimes get buried under the instrumental.",
            "My first thought was that I'd be interested to hear a version of this song where the vocals are more forward in the mix. Really liked the guitar solo parts! Also think the chorus could be a proper ear worm, I just feel like it was sonically quite similar to the verses so it was a bit hard for me to identify it as the chorus as first.",
            "This was well written, really like the lyrics, the instrumentation was well done but overpowers the vocals a bit, personally would like the vocals brought up just a bit and the cymbal/ride brought down a bit (just bright in the mix so stands out) it was melancholy and a good track for sure.",
            "i like how honest and raw the lyrics are, guitar is great, i like and the arrangement. the vocals are overly filtered for my taste and a little pitchy, i think they could be more up front in the mix - melody could perhaps do with a little variation.",
            "First of all, a bit off-topic but I like your visuals on Soundcloud, the song cover art at first feels like an unusual choice for the track but I somehow really dig it :D also enjoyed the track itself and all the little beat variations",
            "I like it, good use of percussion. Only thing I would say is the pad sound thats playing the chord sounds a bit rigid.\n\nI'm looking for feedback on this https://youtu.be/5tNnqV3vh3c?si=Urt_zlQBrV34C9E6",
            "I'm digging the percussion layers, nice beat bro. I think something you could add is a layer of small noise, or rain ambience to create that vintage sound heard in some Dilla tracks to help fit the vibe!",
            "I dig what you're doing here. A couple things: was the drop in audio across the board on purpose at :38 in? That came off a bit odd. I can't tell if the ambience effect on the vocal is because of the vehicle's natural sound, or if you've added additional reverb. I think a reverb with less mid-range and more upper mids might help increase the clarity of the voice. I also recently discovered a game-changer plugin: Trackspacer the ducks whatever tracks you set it on, and can be triggered by any other track. So in my case, I use it a lot on the master bus, triggered on the vocals, to get the entire mix to duck ever so slightly when the voice comes in. You can definitely overdo it, but I've found on several vocal projects that I was having a hard time with, it boost the clarity without boosting volume if you use it subtly. Cool track!",
            "Just checked it out I love the mellow synths you have going and the really chill chords. The mic sounds clean as well only thing in my opinion is I feel some elements needs to be a bit lower in the mix but not bad at all great job.",
            "Admittedly, I don't know much about darksynth tracks but I dig the aesthetic that you are going for here. The one thing i'm thinking is that maybe that lead synth is a bit to harsh on the highs and maybe you could use a shelf eq to tame that? Again, maybe that's just the characteristic of darksynth, but i don't know",
            "This is good. Strictly speaking, I would drop the main melodic, slightly detuned voicing down a bit more in the mix. I don't think anyone is going to miss the main gist of the track, but with a bit higher volume, it's a bit grating in the upper frequencies. Maybe just running it through an amp plugin, or making it a bit dirtier with some additional effects would cut the harshness a bit more as well. But this is a great start!",
            "i like it! It sounds like the sound of a Gotham chase!",
            "Pretty cool! I like the vibe. I'm inclined to want more emphasis on \"sly and fine\" - it comes and goes throughout the lyric lines, but as the main idea and song titled, it feels like you are almost trying to de-emphasize it. They say \"leave them craving more\" but in this case, I would say I'm wanting a second verse while I'm listening. It feels like it ends a bit abruptly.\n\nNice work though. This is a great vibe!",
            "The production is pretty great on this. Lots of ear candy. I'm not sure I'm buying the rap, but this could be my own biases and preferences mostly. The voice seems fairly raw compared to the other elements. Perhaps consider dropping your voice down a bit more throughout the piece or using some other effects to increase the interest. Those moments when you do that already are some of the more interesting. I would also say that you clearly have musical acumen listening to the backing vocal pads. Consider writing a pop melody and maintaining a lot of the rhythm of the current vocal, but sing something instead. Again, that's feedback based mostly on my own preference, so take with a grain of salt.\n\nNice work!",
            "> https://open.spotify.com/track/3qbZMJy7GxeDcqNTQhP9rr?si=cS9oQO5QSiGfK_uHtMX8eQ\n\nawesome artwork. like the organ sound chops, cool vibe. Smooth vocals!! that synth breakdown at :40 is so cool!! \"like a busy doctor I got loads of patience\" great line!! this reminds me of some of the more electronic stuff Childish Gambino has done. build at 1:49, so sick!! Cool track, enjoyed listening!\n\nLooking for feedback on this track if you have time! https://open.spotify.com/track/6WOsbtId0IKq3px6SdXm3Q?si=9ec813c468664bce",
            "Super catchy song, only Feedback I’d give is to make a cleaner transition to the rapping, happens suddenly and it kind of caught me off guard which isn’t a bad thing just think it could be smoother, Macklemore does a pretty good job at these transitions if you need an example.",
            "great sound! it's a perfect ambient, light and not annoying distortions, even the rhythm is pleasant! good job!",
            "Did you imagine the bass or vocals as being the focal point? Guess we're conditioned to expect vocals taking priority, but felt like the mix but the bass further forward, although the harmonies etc make it sound like the vocals are intended to grab attention (rather than just being textural). The drum transition worked for me!",
            "that gradual shift in the drums is such a cool idea. it's not distracting at all, it doesn't stand out and i think most people wouldn't even realize. it's a good, subtle way to change up the sound throughout the song! \n\ni do agree with the other feedback that the bass does seem more powerful than the vocals. i don't really know much about mixing, but in the instrumental sections i think it already sounds fine as is if you want it to be the glue. \n\nand at the same time, the more i listen to the song, the more i feel okay with the mix lol\n\n\nalso thanks for your feedback on my track, the stuff you suggested instantly made my mix sound better to me!",
            "so bad it's almost good?",
            "I don't know why, but I like it lol. Not too much feedback. Maybe have a part in the center that's more similar to the intro and then come back to the distorted part harder? Could be cool",
            "I'm not a fan of the genre but I think it has too high notes..",
            "listening to Medically Important!! Wow! super clean techno production, holy shit!! this is quality. love the kick sound, hats that come in at :15 are super good. great build at :35. this is top notch quality!! Shout out to Finland!! i'll be nearby in sweden this summer, can't wait. would love to come support this live in NYC one day soon! amazing ride sound at 1:09, so full!! that synth stab that comes in at 1:55 is great. Great track, enjoyed listening! \n\nLooking for feedback on this track if you have time! https://open.spotify.com/track/6WOsbtId0IKq3px6SdXm3Q?si=d5dcdff9d47440ad",
            "fantastic sound!keep it up!",
            "Woah - love this track, the kick is really sweet and the synth stabs are such a nice accent. Nice work!",
            "I really enjoyed this track! The vocal performance is well done and the mix is clean. The bridge is fun and the bassline and perc there build the energy really well for the final chorus. Nice!",
            "Great vocal and very clean mix",
            "Hey bro I listened to your track and I like what you were going for and respect that lyrical approach. For a first track this was a great start. I like the way you flowed on the beat and I like that you embraced your style as it came to you in this song. My only tips are to work on your production going forward and also your rapping but both of that will drastically improve as you make more and more music. Good luck bro!",
            "Hm, honestly I think this is really good. I personally don't see any issues with both bass and key. The only thing that I can think of atm is that you could maybe start differently with the bass. The part you have between 24 and 28 seconds might work better as an introduction and then you can become a little more playful along the way. So basically you could try switching your current bass introduction with that part and see if that works. \n\nYou could also maybe try adding a mellow instrument in the back that plays some sustained notes so that you have something that grounds the listener and they can fall back to when they feel like they are getting lost in the arrangement. \n\nThat's all I can think of right now, but again, I really like this! You are correct that especially your drums are on point. :D",
            "Honestly, love it! Do you have a soundcloud so i can like and repost?",
            "I'd say I love the happy with a touch of melancholy atmosphere you've created!\n\nThe instrumentation and mixing are great! Maybe the drums could be more... pronounced?\n\nOtherwise great beat!",
            "Hm, I like it, but I kept waiting for a bit harder beat to drop (especially around 1.20). You know, like a bit of a trap beat. For some reason i expected it. It could benefit from mixing it up a bit more perhaps.\n\nOther than that, sounds good, keep it up!",
            "This sounds like the uplifiting song on the album, like the one where the rapper goes on about how their mother worked really hard to put food on the table and shit like that and how things can juuuust about work out alright if you play your cards right. \n\nI disagree with the note about a harder beat dropping at 1:20, I think the way that works is good, I do think it could switch up a bit more before doing the crescendo-y type thing you do at 1:45ish. I also felt like the main synth resolving on that slight uptick major note got old after a while, I'd like if on the fourth bar of a measure the synth ended on a downtick instead of an uptick.",
            "I think a lot of the other comments pointed it out thoroughly but I think it just needs different or more drums. The tops are there for rhythm but they don't hit so it sounds like a long bridge at some points. For what it is it's well put together, but getting sub/808 and kicks and such to really hit when things come back in would tie it up nicely.",
            "Good vibes, but I think it needs to pop off at some point, like it seems like it’s building to something that never comes",
            "Idk.  I think you need to incorporate more theory into this and use better sounds.  Right now, it sounds very amateur.  Maybe use some modulation and accents.  Everything is kinda flat with no dynamics.",
            "This is a beutiful track man. I'm picky with my rnb and I don't just compliment an rnb song like this for any reason but this is a great sound you're developing and this is something that can get you a lot of attention. Also the mixing on this and production is superb. Keep doing your thing man, you got talent!",
            "Love this! So this may just be a matter of taste, but I feel like lowering the vocals *slightly* so it doesn’t dominate the orchestrals is a good idea. I feel like the vocals should be ornamented by the strings, not on top of them. It may also just be a matter of putting a little more reverb on the vocals to give them more space to sit in.",
            "I really enjoyed that, well done! Some minor feedback points from my side, though some of that could be subjective:  \nThe additional synth coming it at 0:44 didn't fully fit for me, it felt a bit harsh and competing with the general flow. Other than that, I think your sound choices suit the genre very well! The break that starts around the 1-minute-mark went on surprisingly long for me, for example as a listener I was already anticiparting the drop or at least something slightly new happening at 1:22. I think it's fine for it to be longer but then needs a bit more subtle variety to keep my attention. Also, the outro part at 3:07 could have a slightly more interesting transition.\n\nBut again, please keep in mind that the overall track works well, these are just the things I would personally probably take another look at if it was my song and arrangement!",
            "Would you perhaps have an alternative to spotify for me to listen to?",
            "The main part that comes in at 1:06 is the best part.  Really catchy. The rest of the composition is not quite as engaging, though the harmony in the intro is somewhat interesting. The keyboard sounds are well made and the mix is clear. The guitar is a nice touch, as is the background noise.\n\nWhen the drums kick in at around 0:45, the crashes sound rather unnatural. I would remove some of them, since I don't think they are really needed, or rethink the crash sound.\n\n  \nNice work overall! Here is my song if you're interested: [https://soundcloud.com/projectmaker/life-tracks-for-how-long-edit?si=e1d979b59cdf4906b2a2e6d6ffeebc9b&utm\\_source=clipboard&utm\\_medium=text&utm\\_campaign=social\\_sharing](https://soundcloud.com/projectmaker/life-tracks-for-how-long-edit?si=e1d979b59cdf4906b2a2e6d6ffeebc9b&utm_source=clipboard&utm_medium=text&utm_campaign=social_sharing)",
            "Instantly grabbed me, this sounds great!! A satisfying stable loop (dreamy but driving), with subtle movement around that base. Really like this a lot actually, I've added it to my playlist!",
            "Interesting - I like the environment you've created here, but it does feel a bit repetitive. Once thing you could consider without having to change anything radically would be some drum breaks and maybe play around with filters here and there, to change the vibe in certain sections. It may help the intelligibility of the vocals to drop the drums ever so slightly down in the mix - maybe 1.5 - 2db?",
            "> https://open.spotify.com/track/0YoE1eO6rmJp5XvWJEk1Xl?si=4c6acbe5432a4edb\n\nlistening to DD! really interesting ambience, vocals are sick!! reminds me a lot of Burial!! vocals at 1:01 are cool, reminds me a lot of Tame Impala right there!! that vocal harmony at 1:34 is awesome!! the vocals also remind me a lot of the indie artist Unknown Mortal Orchestra. the vibe of this track reminds me a ton of the track \"Unknown Mortal Orchestra - Hunnybee (Baltra Remix)\". Great track, enjoyed listening!\n\nLooking for feedback on this track if you have time! https://open.spotify.com/track/6WOsbtId0IKq3px6SdXm3Q?si=d5dcdff9d47440ad",
            "Waaay too overcompressed to my ears! Think there's plenty of 200Hz, frequency balance is reasonable when everything is in",
            "Honestly I like what you are doing musically, but for me, the drums seem very compressed and slightly disconnected from the rest of the instruments in the mix. There may be some rhythmic issues contributing to this as well, but it seems like we need something to glue the rhythm section together a bit better. Boosts at 60 and 200 I agree could help a bit with the drums being a bit anemic as well, but may not do enough to glue it all together.",
            "Yo dude, I think u did a good job with the beat overall bringing in and back the drums. Something i would experiment with is the velocity of the piano midi you used. Try to randomize it so it sounds a bit more vintage and realistic and that could help the vibe of the overall beat.",
            "I dig it! One thing you may want to consider: if you cut some mid-range out of the signal being sent to your vocal reverb bus, the lyrics might be slightly more intelligible, but it depends on your end goals. That's the main thing I noticed that was distracting. The whistling may also contribute to a bit of a bunch-up in the upper-range of the voice. Maybe look to cut some 3-5k in the whistle. That may take too much presence out of it, so you may need to experiment.",
            "Nice man! This may be more of a preference thing, but I'd drop the snare down in the mix a bit - it's a bit disruptive to the overall vibe, in my opinion.\n\nI'd also check the harsher upper frequencies in the vocal - the 3k - 5k range could use some dynamic EQ ducking, in my opinion, to take care of the spikes. Maybe even a more de-esser.\n\nI like the voice, I like the vibe. The other production elements are really nice!",
            "> https://open.spotify.com/album/56pvEQHuadBanbir8ecKZK?si=Ypk6llCBTiC6pn13TjMJ-Q\n\nsick artwork, damnn!! love the synth intro. bass is super clean and huge!! this reminds me a ton of ODEZSA. love the drums, really tight sound!! breakdown at :46 is awesome, also reminds me a lot of Porter Robinson here. that guitar like synth at 1:10 is sick!! Cool track, enjoyed listening!\n\nLooking for feedback on this track if you have time! https://open.spotify.com/track/6WOsbtId0IKq3px6SdXm3Q?si=9ec813c468664bce",
            "Yo love the artwork too! This actually has a dope groove to it and is pretty chill almost summer house kinda vibe. \n\nPlease take my next feedback with the purest of intentions to really wanting your music to sound the best it can.......For so long I struggled with too much low end in my productions until I started playing night clubs and realized that I had WAY too much sub bass. It takes so much less than you think (most of the bass that you hear and even feel happens from 80hz-1.2khz), not saying put less bass because I love bass, but there's a way to do it without eating up headroom that squashes loudness and clarity. Longer compression, split sub and mid bass and turning the sub bass down, cutting the low out of everything besides the kick at 80 hz (which I am sure you already know and can hear your kick/bass sidechaining). I put the track though my source emulation and even on Air Pods the bass is very prominent.   \n  \nIf I didn't truly care, I would have stopped with the easy two sentence comment, but this literally took me years to realize after relentless mentors telling me. For me, I thought the way I was doing it was the only way to get the sound profile",
            "A laid back song. It's overall well made and doesn't overstay its welcome. It's not really my style, but it does its job as a relaxed EDM instrumental. Good work!",
            "This is cool! Mix-wise, in my opinion, the high pass filter may have been a bit too aggressive. The voices all sound a little anemic. I wouldn't adjust it too much, but just a bit more low-end in the 200-400hz range on the voices I think would hit right.\n\nThe hat loop is also just slightly crispier than I would prefer. Maybe consider cutting a bit of 3khz-5khz out of that part. Otherwise I think this is a pretty great production.",
            "Really great song! In regard to the mastering, the drums are super quiet, guitar seems like it overshadows the drums a lot. Vocals sound about right in my opinion but the mastering needs a second ear to balance the instrumental correctly.",
            "Yeah, love the song! I agree the drums could be quite a bit louder, I would even beef them up with some more/different compression. After that, everything else that seems a bit loud at times now might fall into place.",
            "Sounds pretty good, but yes I'm a guy who wants the emotional connection to a vocal. Very few instrumentals do it for me; particularly synth/loop instrumentals, mostly because there is such a glut of them out in the wild. Much easier to produce than the next level, with a vocal, lyrics, emotional performance, etc. But it's a great start! Your instinct seems to agree with me - a vocal would be a great layer here.",
            "> YouTube\n\nwow this sounds cool! the violin bowing of the cups sounds so cool. that deep bass at :48 is sick!! that knob that comes on screen is cool, video concept is awesome. 1:38 explosion is insane!! this is epic. really different composition, haven't heard much like this. feels like a super dystopian part of an adventure video game. feel like it could go in the game series Uncharted. that distortion at 2:23 is sick!! Cool track, enjoyed listening!\n\nLooking for feedback on this track if you have time! https://open.spotify.com/track/6WOsbtId0IKq3px6SdXm3Q?si=9ec813c468664bce",
            "I really like this single! Super catchy, there’s a clicking from the pick that I can hear in the pre chorus but it’s not super noticeable unless you’re listening closely.",
            "I think it sounds good actually! The sense of not really \"grabbing\" the listener might come from the fact that it sounds like you're in your comfortable range a lot. Breaking out into a higher register for even just a few notes here and there (especially for a 3rd or 4th line of a verse) can add some spice and a change of pace in my opinion. You're kind of already doing this but could probably push it a little further.",
            "> Abandoned - Sam Brenner\n\nlove this artwork!! super lush guitar and drum sound. vocal is super smooth!! love the guitars that come in at :32. the vocal reminds me a ton of Green Day here. production is excellent!! also reminds me a lot of blink-182's vocals. \"same notes on different wavelengths\" is a great line!! love the falsetto backing vocals at 2:07! this is super solid and full!! Great track, enjoyed listening!\n\nLooking for feedback on this track if you have time! https://open.spotify.com/track/6WOsbtId0IKq3px6SdXm3Q?si=d5dcdff9d47440ad",
            "I dont know if you use Ableton but you can highlight the notes that are in the scale in piano roll to make things easier. Id say you should probably work on making your tracks less repetitive before you start learning how to mix better. I'd say the bass fits really well with the other elements but the main pad thing that plays those chords over and over and over is veryyyy repetitive. \n\n\n\nId say add some kind of melody on top of that like a mono synth that plays something new so then have something to latch onto.  I like the synth that comes in layer but i would definitley lowpass it using either Auto Filter or EQ. All in all, id say just keep doing what youre doing and youll keep learning from experience. The drums and bass are mixed quite well actually. I think that crash cymbal sounds a bit weird but everything else hits nicely.",
            "wow this video is awesome!! really love the groove at the intro. Vocal is amazing!! reminds me a ton of City & Colour. this is super smooth. love that guitar break at :39, this is insanely good!! vocal melody is amazing at :50. this also reminds me a lot of Boys Like Girls, major 2000s alternative rock feel to it. the voice reminds me so much of Dallas Green from Alexisonfire and City & Colour!! love the \"everythings brand-new\" hook at 2:11. so good!!! Cool track, enjoyed listening!\n\nLooking for feedback on this track if you have time! https://youtu.be/j-bfM1Y2ceY",
            "I like it - great job! The first 2 minutes has just enough variation/progression to keep me hooked while also feeling relaxing/mellow. To me i might be missing a leading element or melody in the section from 2 minutes in an onward to keep me hooked the same way the vocals does in the first section, or the lead at 3:38. The transition is to each is section  is nice though",
            "Not too random! Cool stuff! The vocals really brought me in. Nice. The synth element at \\~2:20 is gorgeous. Really nice development there. I think something that would work well to intensify the music towards the end would be to increase the intensity of the bass in that progression. 6-5-4. It does grow, bc the whole ensemble grows, but I think to grow the bass more relative to the rest of the ensemble could be effective. Pretty nice already though!",
            "i think the best way of making it jump is to work in the low harmonics. in trap and hip hop,  the two genres im most familiar with, the best way of making a theme like this to \"drop\" is using a riser and some 808s (on the most basic level). i dont necesarily think this might work here, since many of the instruments aim for a more \"acoustic\" sound, but maybe some cello samples would do the work with enough equalization and compression",
            "the theme in general sounds pretty good. maybe is not for me, because there is some things about the guitar EQ that dont give it \"enough body\" (maybe a bit of compression on the middles?) but overall a good theme. also, on the instrumental bridge, i think the guitar would benefit of a bit of sidechain over the rest of the instruments. same for the bass and kick\n\nbesides that, an amazing track",
            "the idea is good. and i like the dissonances that you put in here. however, i think the song would benefit of some more low pass filters and phasers if you want to archieve a more \"lo-fi\" sound. specially for the drums. \n\nthat being said, love the 808s. if we are embracing the mix of genres, i think i'd benefit of some glissandos, pretty much what is done in uk drill music.. also, is the leifmotiv you used the beggining of a jehovah's witness song? because the theme sounds pretty close. \n\noverall, a good theme and fun to listen, kudos.",
            "Not too well-versed in trap but I could really see this as a more cloudrap type of beat, I'm not sure if that's what you're going for but I like what you've done with it-- the mix is solid, and I love the way the chords swell into eachother. From my limited understanding, maybe integrating more attention-grabbing drums/bass would give it more of a trap feel?",
            "> https://www.youtube.com/watch?v=Ebq1Us5oExY\n\nlove that intro. really cool video, like the performance shots in lofi. driving shots are cool!! this reminds me a lot of Smash Mouth! and Barenaked Ladies! \"lack of circumcision imma give a little tip, sometimes i dont mean it but i tend to be a dick\" that is an insanely good lyric!!! catchy chorus!! like the \"sing with me nananana\"! super cool track and great vibe. Cool track, enjoyed listening!\n\nLooking for feedback on this track if you have time! https://youtu.be/j-bfM1Y2ceY",
            "Like the vibes, really upbeat which is refreshing. Got a soft spot for the mass crowd, went to Umass Amherst which is when I started getting into the music. Real down to earth stuff, love it homie. \n\nI will say for video editing in the future, pay attention in your headphones to the stereo field and send that left hanging intro to mono, distracted me a bit in the beginning from the good stuff!",
            "Cool track! As far as genre goes - I think you could say it's in the ballpark of electronic/house, and then leave it open-ended from there. That'll at least give people a general idea.\n\nCritique - It's quite soft. Had to really turn up my volume. Also, the beat - or maybe just the whole track - I think could really benefit from more aggressive compression/limiting. This will help with volume and also give it a fuller, bigger sound. I honestly don't know a whole lot about producing beat-music like this, but yeah - I think that's the main issue. It's lacking **oomph**. \n\nReally nice musically though!",
            "This is such a fun dancey track! Great vocals, great energy, love the variations in the beat. My main critique would be putting the vocals higher in the mix in the beginning, but for most later points in the song (after each drop) they're mixed nicely so it might be an intentional thing. Great work, keep creating n experimenting! Music is a playground",
            "I REALLY like those vocals, where'd you source the samples?? They are super clean in the high end, I want more of them! Would have loved to hear them glitch out over the drop sections. \n\nIt sounds a bit more like lounge music honestly hard to pin down a genre, which is a good thing to define a sound.",
            "Hey, this is pretty cool! Tough to make recommendations since you're working over a backing track essentially, but I think your vocals could be a biiiit louder. Like, not much, but a tiny boost might give a better mix. They are currently just a tad buried to my ear. \n\nIt's a cool track though - Def release it!",
            "> https://youtu.be/HaXqsGaNJHI\n\ncool visualizer! like the snare sound, awesome bass tone at :10!! love the beat drop at :20!! super slick and clean sound. that bass is insane!! this reminds me a lot of LAKEY INSPIRED. has a wintry feel to it, love that drum fill at :59! like how the key changed at 5:00. this is a cool concept!! sounds really good across the keys. wow!! Cool track, enjoyed listening!\n\nLooking for feedback on this track if you have time! https://youtu.be/j-bfM1Y2ceY",
            "I think the main beat is good, though the vocals could be a bit louder. I would suggest a couple of structural changes: Make the intro shorter (i.g. Introduce the kick and snare at the same time) and introduce a bridge (a different section) before the last part to help the song feel more full and better paced.\n\nNice work!",
            "sounds really professional and well done! one thing imo that could change would be the chorus transition, it doesn't 'hit' as well as it could.",
            "Love the vocal harmonies!",
            "I actually like the beat...I think you could do alot more with the background and synth to play around with the rise and fall of the track. Good work though!",
            "General vibe is pretty chill, I'd definitely say it's a dance/house/thing, but I'm not exactly up on my genres, I just like what I like\n\nI do like this too",
            "i really like the vibes and the subtle keys in the background. if i were you, i'd maybe look into vocal mixing techniques - it kind of stands out from the rest of the mix imo. the cover of the track is also really good.",
            "Hey bro I just listened to your track and I like your style. You got a nice flow that can get much better as you make more music and as the production gets better your music will sound even crazier than it already sounds. Good work on this track and keep putting in that work!",
            "All I hear is a finished product. Can you demo the before/after or the actual ways you can sculpt the sound?",
            "Has anyone ever told you that you sound like the big fake head guy Frank from the movie Frank? This is a compliment, I love that movie lol",
            "Did I just stumble upon a masterpiece? Yes I did!\n\nYour voice is amazing and has character, reminds me of 70's singers.\n\nThe song has a nice rhythm to it, the pacing is perfect and the sounds are clean.\n\nI love that the track has an uncertainty to it, you don't know how to feel, there are energetic and melancholic parts throughout!\n\nThis song is a hit waiting to happen, Is there a way to follow the band?\n\nAlso MANTA SHRIMPS is a cool name, it reminds me of the sea!",
            "I really don't like the lead vocalists tone.  The instrumentation is dope.  I feel like it could have been mixed better.  Maybe, thicken the drums through eq.  It sounds like something.  I don't think it is Coachella good, but you definitely have potential.",
            "Needs more sheep!😉 (I like this vibe, good work!)",
            "I like your voice! Reminds me of some vocalists in the 70s/80s, though it could use some more developing. Overall the song structure is nice, the mix could use work but the song has a nice vibe like you said. I like the guitar work in this song and I think a better mix and maybe with more guitar layering it would really bring that to the attention of the listener. Nice work\n\nMy latest track for any feedback! https://on.soundcloud.com/HFDhZVXcgzk1cr4C7",
            "I love the strings, this is great. Not my usual genre but I enjoyed this song a lot! Production is solid too from how it sounds on my laptop speakers",
            "Nice sounds going around there. Only thing i would recommend is some mixing techniques. The snare is a bit too aggressive and the main distorted synth is a bit too distorted and could maybe use some reverb to widen it a bit. When the pluck thing drops though, it sounds really cool. But i think there isnt really a clear melody to latch onto and theres a lot of randomness going on with the pattern. Sound selection on point though",
            "Cool start with the \"weird\" sounds, it sounds interesting! It starts sounding like an old video game soundtrack around 0:50, like a mashup of Terraria and Mario. IMO the song lacks development and feels a bit empty. It could have moved into a more energetic beat after a minute or so, or changed to a different direction by adding more instruments.",
            "Hiya! I am hearing a friendly tribe of robot colonists exploring a new solar system for them to colonize. I do like me some weirdness. Cheers.",
            "Man, that's something else all right! It's not really my cup of tea, but it did trigger something and kept me listening and interested. I'm curious about your process of creating this though, how did you approach this?",
            "i like the vibe and you definetly reached what u was going for but in my opinion it gets repetetive really quickly and as the other comment suggested as well, some developement with adding or removing instruments for different parts and maybe adding some drums would make it more enternaining",
            "I don't think it got repetitive too quickly,\n\nThis really reminded me of like a more intense version of stuff off Mother Earth's Plantasia. The quiet bit at around 1:35 was my favourite easily, it had the perfect blend of tension and serenity. And the way it continues is amazing. Personally I think it's a great track, I do think the click-y synth maybe gets a bit too much use throughout and it could be varied up a bit.",
            "Honestly, just keep diving further into the experimental synth and get as weird as you can. I love finding new ways to use sound and experimental stuff is such a good source of inspo",
            "It definitely sounds like you are just beginning.  It is pretty bare and a snooze to listen to.  Keep working.",
            "Do you have a song you would like feedback on? The link takes me onto your artist page.",
            "Yeah this is literally against the sub rules.",
            "Thank you kindly! I aim to keep the mud out but it's a skill that is hard to master. :D",
            "Thank you very much. I checked the list for you. Mind you these are all software synths in Reason 12. I used 4 instances of eXpanse hyperwave synthesizer from Blamsoft. 4 instances of Europa (Basses)(Reason exclusive) 1 instance of Xpand2 from AIR music technology. 2 instances of Objekt (Reason exclusive) 1 instance of BBC Symphony Orchestra from Spitfire Audio. 2 instances of AlterEgo. (Synth voices) And 2 instances of Rytmik Drum Machine. (Reason exclusive) And a liberal use of effect plugins. Cheers.",
            "Thank you kindly for listening and commenting! It is appreciated.",
            "Thanks Ruralviking!",
            "Thanks much Late-Risk. First time I heard of a dobro slide. I looked it up. Fun effect indeed. This was just me playing around with a software synth. :)",
            "Thank you! Well I like Billy Joel lol",
            "thanks for feedback :)",
            "thanks for feedback :)",
            "Thank you! Yeah I actually love that lead synth myself. Definitely saving for future use. I had to do a bunch of tweaking to get the blend to sound clear and pronounced but still play well with a full orchestra.",
            "Thank you!",
            "first off all, thanks so much for the encouraging words :) and I gotta say, I can totally see how a bridge could further elevate the song, so this definitely got me thinking. If I do write one I will make sure to ask you for follow up feedback if you don't mind :D",
            "Oh I'm glad you say that, because personally I have been a bit frustrated because ithe mix still sounds a bit muddy to me on my jbl flip :D but I guess that's also perfectionism rearing its head, so your comment made me feel a bit more at ease, thanks!",
            "Ooooh I love that description! I've struggled a bit to think of similar songs / artists / pop sub genres, but I can totally see why you would draw that comparison, I do really enjoy vibey kpop so that could totally be a subconscious influence :D",
            "thanks so much for taking the time to give me feedback a second time, that's so cool :) and feels really good knowing I was able to actually improve the song!",
            "Thank you! And yeah i think i will try to vary the main melody in future tracks and possibly also use different sounds for more variation  \nWould love to hear something you are or have been working on :)",
            "Thank you! I can’t describe how happy i am to have my production being described as tasteful! \nYeah good point i think i might try to use more vocals and experiment with even more with the composition of the tracks i make. I recently learner of the “two loop rule” which i might want to enforce for myself \nAnd yeah she really did! We really had a moment when she listened to it. And the next couple of days she said “cant believe you made a track for me”, which was amazing especially since she is not typically into this sort of music :)",
            "Thanks very much!",
            "Thanks for listening, and good suggestions! Who was your uni professor?\n\nI usually put a little video clip on my stuff, but just didn't get to it for this one. Haha. But yeah, that would be nice.",
            "Thanks for listening :) I assume you're talking about the really sudden and loud piano note? It was kind of an accident, but honestly it is a good idea to have that peppered in a few times throughout. I'll keep that in mind.\n\nThe stuff happening around 12:30 was really nice. I agree. I think I really felt the direction in that moment and went pretty crazy on the bass part. Some attack could be nice.\n\nThanks for your thoughts!",
            "Thanks so much for listening! Glad you like the bass part. I do too!",
            "thank you very much, really appreciate it",
            "Good point about the beat, thanks.",
            "Such an irony since I wanted to highlight the vocal with the minimal arrangement hahaha. Thanks a lot.",
            "Thanks for the input, it means a lot.",
            "> I got no constructive feedback, sorry, I just enjoy rocking out to it!\n\nNo problem, appreciate that you took the time to listen. If you have any music of your own as well that you would like me to hear feel free to link me to it too.\n\nGreetings!",
            "Thanks dude!",
            "Thanks man, I appreciate that!",
            "https://m.youtube.com/watch?v=xKfMu6nFV6A&pp=ygULbWFpbG1hbiByb24%3D\n\nThis ok for you?",
            "Thanks man, that means a lot to me!",
            "I have a bad habit of over indulging in buildup and it results in a less engaging track. One thing I was hung up on a lot was the lead synth when the heavy guitar comes in. I don't want it to sound too shrill and I like reverb to soften those issues up but then sometimes it recesses the leads too much. Ive gone through many changes and can't trust my own ears anymore, fresh ears are nice. I appreciate your thoughts, thank you very much!",
            "That bit at 2:10 is pretty much just noise. I think it needed something there but you're right that that's maybe not the right thing. Thanks for your feedback!",
            "What do you mean about cleaning up the lows? There is a bit of distortion on the guitar. I'm using SubLabXL but that's almost a sine wave which seems like the cleanest tone. Is it too predominant in the mix?\n\nAnd you are right about the stuff at 2:10 sometimes I throw in placeholder noise to differentiate an area and I forgot to define it.",
            "The vocals sound great, but i think  some of the elements in the beat are not in key,  or it's just that the sound selection doesn't blend well with the verses. Thanks for your feedback",
            "Thank you for the feedback and thank you so much for the compliments!! \n\nThe more I listen, the more I agree that it doesn’t need a solo. I actually haven’t heard of Wand before but I’ll be listening to them all week for some inspiration now lol. \n\nI actually am working on an album right now! I’ve been dialing in my sound and trying to write as much as possible as well as practice the instruments that aren’t my forte (like drums and bass guitar). I have some tracks and ideas that are much heavier than this one. \n\nThanks again, I’m glad you like the track!",
            "Hahah I know, I can see that giving some whiplash. If you sort by most recent you’ll see a much slower build to this point. But ultimately I was gifted a midi keyboard a few years ago and started making deep house. I had “mild” success and was playlisted and then started making music for the wrong reasons. \n\nIn turn, I lost motivation, realized I didn’t want to tell other people’s stories anymore and dove into making music that is more true to me. There are a lot of middle ground tracks that aren’t on SoundCloud too",
            "Thanks, I do prefer vocals to be deeper into the mix  but I probably have to work on making it, and all the other parts, stand out a bit and less mushed together.",
            "Thanks so much! Appreciate the honest feedback!",
            "Thanks for the feedback! I will probably redo the vocals soon, I am a long haul truck driver and recorded them on a headset mic in the cab of my truck on a break! Not the best studio or mic!",
            "Much appreciated thank you!",
            "Much appreciated thanks. \n\nNice work yourself, the acapella fits the beat well in terms of style and vibe. Matches up pretty well. Nice work",
            "I feel ya, thanks for listening!",
            "Thank you for giving it a listen and the detailed feedback. Very solid advice. I had stuck a reverb generator on there for the first time and had no clue what I was doing lol. I’m going to use trackspacer on the next project thanks to your suggestion. And the drop in audio is on purpose to remove an artifact. Definitely odd way of doing that but the song in itself is extraterrestrial so anything goes lol!",
            "Thanks a lot! Yeah I know that lead is a bit harsh, but I kinda like it. Maybe it's because I spent too much time with it. Definitely will try to highcut and it can free some space to make arps sound more readable or some",
            "Thank you for your feedback! Definitely will work on it❤️",
            "Appreciate it ❤️❤️❤️",
            "appreciate it , was thinking of adding a bit more but hesitated , thanks for the feedback ,god bless.",
            "Sorry yeah - the vocals are really the primary \"instrument\", but the bass carries the rest of the  instrumentation. Are you thinking the vocals aren't prominent enough?",
            "Thanks for your feedback. I dropped the bass ever so slightly (.3db and cut just a bit more in the 250hz range to cut back the tubbiness just a bit) and I think that's better! \n\nAnd I love hearing my feedback helped you too. Mix on!",
            "Thanks!",
            "Thanks for the feedback!",
            "yea i see what you are saying and it makes sense ngl yea",
            "Thanks so much!",
            "Thanks so much 🙂‍↔️ more soon, updates here : https://www.instagram.com/saunimon",
            "Thanks for the feedback, maybe I could’ve done more with filtering. My new music has a lot more of that so I’m looking back objectively haha\nMore soon, here’s updates : https://www.instagram.com/saunimon",
            "Ty for the kind words! Your track is cool, liking the vocal delivery :)",
            "Oh that's pretty cool to hear. Is it too compressed? Any tips on how to make it sound as loud but less compressed?\n\n\nAnd thanks for the feedback, really appreciate it!",
            "That sounds like a simple fix. Part of my problem is the headphones I'm using to mix with. This kind of confirms what I felt I just need to make an investment in better gear. Either better headphones or monitors plus sub. Thank you!",
            "Just curious, what is your style?",
            "thank you",
            "It just brings it to another level if it's done well and definitely agree, thanks for the feedback m8.",
            "Wow, thanks for the kind comments!! I had trouble trying to get the deep bass to translate well between different sets of speakers, glad it sounded good for you! With everything you've mentioned (explosion, epic, different, dystopian, distortion), it sounds like you've experienced it exactly the way I wanted it to be experienced! \n\n**Comments on your song:**   \nListened to it twice, great song! A really confident blend of styles. There are some surprises in section changes, like the more pop-punk verse leading into a big tom fill, then suddenly dropping down lighter for the chorus - but it's done so deliberately, it works well! Bold vocal, VERY memorable hook - think this'll be stuck in my head! Excellent production, and plenty of well-placed bits of one-off ear candy! This earned a spot in my playlist!",
            "thanks! hope i can make more music like this one day soon!",
            "I get that. I try to stay in a range where I’m confident I can sing it live and not get into trouble, maybe taking more risks during the recorded versions will help.",
            "Thank you! The artwork came out great, I made it layering a picture I took near cape cod. Appreciate the feedback!",
            "Thank you for your feedback, it means a lot.",
            "Oooh, I like the idea of a cello riser, that's definitely going on the list, thank you!\n\nI'm happy to try some 808 stuff too, there is a whole synth line buried in the mix already. As you might tell, I'm a bit far from trap *or* hip hop",
            "Been a busy couple of days, and with your suggestions, and a few from mates and whatnot, [it's finished.](https://on.soundcloud.com/rUAY1)\n\nHonestly the first time I can confidently, 100% say that a track I have made is done, and it literally only happened because I threw some cello in there, so thank you, internet stranger!",
            "thank you! didnt want it to be too muddy so maybe lofi wasnt a good descriptor of the track given that aha\n\nthe intro is a sample from green in blue by miles davis aha",
            "You're literally the first person to catch that lyric haha. I laughed pretty hard when I wrote it and was a little disappointed when nobody noticed it. But you have made it all worth it hahaha thank you.",
            "Thank you. Yeah I realized the intro thing after I posted it. Transferring it from VHS to digital apparently only did mono audio and I didn't realize it until later. \nAppreciate you checking it out and the compliment",
            "The genre was for record labels they wanted to know which subgenre it was for house lol.\n\nThank you for your opinion. I definitely think the drop lacks some \"oomph\" lol but I tried changing it yesterday and I felt it changed the vibe of the song, as if it didn't match so I'll keep working on it. \nAlso im interested to know what kind of music do you hear ? (Asking about electronic music) Or tell me some electronic songs that you like. Thanks 🙏😊",
            "Thank you so much for your kind words and thoughtful feedback! I'm glad you enjoyed the track and its energy. I appreciate your note about the vocal levels at the beginning, and no it wasn't intentional (I'm pretty bad at mixing and mastering). I'll definitely take that into consideration in future mixes.",
            "I usually use splice to find samples but for this one I actually made them myself, but the lyrics are inspired from an old r&b track I found on the same scale  I used for my notes, but I can't use it for copyright reasons so I took only some parts and recorded them added a ton of reverb and EQ also I changed the pitch.\n\nThank you for your feedback. What do you mean by making them glitch out ? (Cuz I made some vocal chops in the second drop)\n\nFor the genre it's weird yeah I have to take a reference track in a specific genre and improve the drops and arrangements to fit it. Because like this, it's hard to get signed on record labels. It needs to fit something.\nThanks again 🙏😊",
            "i like it ! fantastici track ! its your voice?",
            "Thank you so much! I appreciate the feedback!",
            "Thank you so much!",
            "Thanks for the suggestion!",
            "thank you! i've always struggled with vocal mixing lmao but this is very useful",
            "appreciate it",
            "It is easier for me to transform a little wav file that you could send me so that you have a real feedback on its effects.",
            "Tbh I looked the film up and I really don't see it looool",
            "Cheers aye, glad you liked it! Will def use this as the main single now LOL\n\nGotta finish this debut album, but there's a few EPs/Mixtapes uploaded on Bandcamp: [https://westbeesmotherhood.bandcamp.com/](https://westbeesmotherhood.bandcamp.com/)",
            "Yeah I'm still a shit vocalist, I've only recently gotten into singing. But it's gonna take some time, I'll probably go back and re-do the vocals at the end of recording the full album. Will defo thicken the drums that's a good idea.",
            "Cheers aye!",
            "Im being so honest, thank you so much for the feedback. I love getting solid thoughts on my stuff and this means a lot. I'm glad you enjoyed the song. I know I still gotta keep going but small stuff like this means a lot to me!",
            "I see what you mean! Maybe drums would fit better? I wanted to replace them with the trippy sound.\n\nI experimented with the synth (deepmind 12) here and I got lost a bit, haha...",
            "That's a wonderful imagination!\n\nGlad you enjoyed it!",
            "Thank you for enjoying my admittedly weird and experimental piece.\n\nAs for how I make the tracks, I am very \"spontaneous\". I found a lead sound, wrote a melody, then found a bass sound, wrote the bassline and the trippy effect was me messing with a preset and hitting the arpeggiator.\n\nUnfortunately there is no deeper thinking going on, just me playing with my new synth and experimenting!",
            "Yeah I can see the flaws of this piece. Admittedly I've constructed superior compositions. However I still enjoy the trippyness of it.",
            "Thanks for the kind words! Yeah, I've listened to Plantasia a lot (my fav Mort Garson album) so I cannot deny the influence.\n\nI liked the clicky synth too much and I wanted it to replace a possible drum pattern so it persists throughout the track. It's worth mentioning that I have an \"one and done\" method where I create sounds and don't save them, forcing myself to find new ones every time.\n\nSo even if I wanted to change the track I can't :)",
            "Thank you for the inspiring words 🙏🙏🙏",
            "Sorry to hear that you didn't like this one...\n\nKeep in mind not every song needs to be \"in your face\" energetic though...",
            "Thanks for the info!!!!",
            "thanks!",
            "Happy to help - good luck!",
            "I just posted one in this thread, actually!",
            "Yep. Ill be having a listen.",
            "Alright! A sweet gentle sound experience with lots of good samples and sounds. Very laid back. A few things. It felt just a tad too short. I was expecting a light change in beat to give it just tad more roll later in the track maybe. That bucket sound could have faded in and out volume wise just a bit more imo. Mind you these are all subjective personal opinions. Overall a highly enjoyable sonic romp. Thanks for sharing.",
            "It's funny how that can work. The same thing happened to me but with visual art so I switched to music. A little bit of success can backfire. Personally, I like the last track better than the earlier ones but given your history forget I said that.",
            "Yeah - I think the vocal was getting buried a little at times, sounds like the vocal is competing with the bass rather than the vocal being undercompressed. So to start I'd try putting the vocal up a little, maybe just 1dB or so! If that's too blunt, maybe use volume automation for the moments where the vocal falls underneath, or use a multiband compressor to sidechain the mids of the bass so that they duck *slightly* during the vocal (not enough to be noticeable, just to make a little space). \n\nBut otherwise I think it's a great mix and great song - I could just imagine it sounding even better!",
            "thanks!!",
            "Yes, far too compressed - I'd recommend spending more time thinking about whether it sounds dynamic enough and how the transients sound, rather than whether it's hitting a specific loudness or LUFS value! Dan Worrall's longform youtube videos are an excellent resource to learn about loudness. If you compress too much, the transients get squashed and don't have any impact",
            "I only mix on Senn's the HD650's and run both SoundIDReference and Realphones emulation and check most if not all sources frequently during mix and composition. Cant recommend this combo enough. I do have a lil mono mix cube and recently just got a nice BassBoss system so I don't have to run to the club, but both of these are usually only to check masters with real speakers. Both the emulation software and my RME interface can toggle mono and simulate different club environments. \n\nIt's a simple fix just force yourself to mix the sub as low as possibly tolerable to your taste, then another db down I found worked for me haha",
            "Well, I like more 90s style electronic music as opposed to most modern styles. I also enjoy soundtrack and heavy metal.",
            "thanks!!",
            "awesome!!!",
            "hahaha!!",
            "Oh I seeee. Gosh they really wanted you to be specific. It's so tough sometimes.",
            "thanks!! Yes it is!!",
            "Is it still code?\n\nThen what you can do instead is to upload several raw, unaffected WAV files, and the resulting affected WAV files. Maybe note what parameters you have changed upload that as audio.\n\nThe before and after is important, because how it affects the original sound will help determine if people want to use your program or not. \n\nIt will also help us give you feedback, because it is possible that another plugin is already doing the same thing.",
            "It's not a problem tbh that clicky synth it works for this song, but I think going forward ease up on it a bit. That method probably really helps for getting tracks out I noticed you're on a bit of a prolific streak! Keep it up man!",
            "OK, heading there for a listen",
            "Thanks, that's good feedback, appreciated!",
            "You’re right, it’s strange how quickly it can shift your focus. Hahah I appreciate that, but I’ll try to forget it. I’m gonna check out some of your tracks here shortly",
            "Thank you!",
            "Can you share a song or two for context?",
            "Fucking love your song, straight bop! You’ve got a very Mark Hopper-esque voice, also a bit of MGK (I know he’s  a bit divisive in the punk rock community but tone wise you’re similar). I’ll give you a follow on Spotify! Did you get your song professionally mixed and mastered or was this DIY?",
            "Is there a place in reddit to exchange small wav files? To prove effectiveness I would prefer to start from files that are submitted to me rather than sounds that I know to be effective ...",
            "thanks, though I'm taking things slow for now release and production wise...",
            "Do you mean a song I like or a song I made?",
            "Vocaroo allows you to upload audio for free and share them as a link. SoundCloud does as well.\n\nI don’t think sounds sent to you would be any more effective than the ones you already have. \n\nWhat most people look for is simply cause and effect. Just use several different original WAVs with the same effect. Use one WAV and apply different parameters to it. Use a sine wave and transform that.\n\nFor now, understand this: only you have control over your program and only you can use it for now. You can show us what you can do to our audio, but we don’t know what we can do to our audio.\n\nThe goodness of the result is irrelevant for now, but the potential of the program is very relevant. If you want to make a plugin with this, you need it to have the potential that many users can utilize. How well it works can depend on many more factors than just your program and its parameters.",
            "Thanks to you, I will do that."
        ]
    },
    "/r/WATMM - Weekly Motivation Thread": {
        "title": "/r/WATMM - Weekly Motivation Thread",
        "score": 1,
        "url": "https://www.reddit.com/r/WeAreTheMusicMakers/comments/1dlnxzg/rwatmm_weekly_motivation_thread/",
        "content": " Welcome to the [/r/WeAreTheMusicMakers](https://www.reddit.com/r/WeAreTheMusicMakers)  Weekly Motivation Thread!  Share your successes and and encouraging words here.  Posts/Comments looking for motivation can also be appropriate here.\n\nThis thread is active for one week after it's posted, at which point it will be automatically replaced. Note that our rules on \"no promotion\" are still in effect and apply to this post.\n\nIf you are interested in helping us mod these weekly threads please inquire about moderation opportunities by writing in to mod mail.\n\n## Other Weekly Threads (most recent at the top):\n\n&#x200B;\n\n* [Click here for Feedback threads.](https://www.reddit.com/r/WeAreTheMusicMakers/search?q=author%3A%22automoderator%22+title%3A%22feedback%22&sort=new&restrict_sr=on&t=all)\n* [Click here for Quick Questions threads.](https://www.reddit.com/r/WeAreTheMusicMakers/search?q=author%3A%22automoderator%22+title%3A%22Questions%22&sort=new&restrict_sr=on&t=all)\n* [Click here for Collaboration threads.](https://www.reddit.com/r/WeAreTheMusicMakers/search?q=author%3A%22automoderator%22+title%3A%22collaboration%22&restrict_sr=on&sort=new&t=all)\n* [Click here for Promotion threads.](https://www.reddit.com/r/WeAreTheMusicMakers/search?q=author%3A%22automoderator%22+title%3A%22promotion%22&restrict_sr=on&sort=new&t=all)\n* [Click here for Our Former Gear threads.](https://www.reddit.com/r/WeAreTheMusicMakers/search?q=author%3A%22automoderator%22+title%3A%22Gear%22&sort=new&restrict_sr=on&t=all)\n\n[Questions, comments, suggestions? Hit us up!](https://www.reddit.com/message/compose?to=%2Fr%2FWeAreTheMusicMakers)",
        "num_comments": 1,
        "comments": [
            "At over 59 years old I have sculpted sounds that have been appreciated by professionals. Never hesitate to start creating!"
        ]
    },
    "What makes you want to check out new music/ a band? ": {
        "title": "What makes you want to check out new music/ a band? ",
        "score": 5,
        "url": "https://www.reddit.com/r/WeAreTheMusicMakers/comments/1dlqur1/what_makes_you_want_to_check_out_new_music_a_band/",
        "content": "I'm trying to get started with music and am having a hard time figuring out ways to make checking my music out more appealing for people without being obnoxious about it? Any help or insight is appreciated ",
        "num_comments": 22,
        "comments": [
            "Artist collabs with one of my favourite artists, artist gets on a label I already like, artist playing a gig along side artists I already like, artist gets on a playlist with other music I like, artist posts about stuff I’m interested in on socials. I’m sure there’s more but these are some that came to mind and thank you for asking because it’s given me ideas to get my own music out there :)",
            "I’m always looking to hear new songs from new artists. The way I hear about them tends to be playlists, so I can listen to lists without fidgeting with the phone. This is because I listen while I work/exercise etc. Hands free. I am also a musician, and no one really listens to mine either. Good question because you caused me to have an insight. Getting on peoples playlists might be worth focus.",
            "Word of mouth. If people whose musical opinions I respect say they are good I’ll go check them out. ",
            "Good band name, interesting genre tags and an accessible way to check it out (ideally a youtube or bandcamp link) is usually all I need. My own marketing along those lines has had zero success so I don't know how well it's working for them, but to answer the title question that's what has worked on me as a listener. I frequently check out all kinds of random artists that pop in my feed.",
            "Are you just blasting out promo to anyone and everyone, or being selective and going to where people who already like similar music to what you make are? The first one isn't going to work.",
            "If it seems like something similar to what I already like, I'll definitely check it out. So I look at genre, influences, imagery and whether or not I get a sense that we're on the same wavelength in terms of songwriting/production/etc. \n\nSpecific genres ''old school indie pop' or 'psychedelic hyperpop' are better than broad ones like 'rock' or 'rap'... I will almost always skip the latter, because 9/10 times it turns out to be unremarkable anyway.",
            "A good live performance.",
            "[I feel like bands always find me when I need them](https://youtu.be/NW3_KbbJsD4?si=F6aEsiW3XnzTKQmZ)",
            "get on bills with bigger bands",
            "Interesting",
            "Yea ATM I'm not really sure where to promote it tbh. I found some Facebook groups that are for the style of metal I'm trying to do, but I'm not even getting negative feedback or my posts deleted",
            "If only it were that easy haha",
            "Unfortunately I live in a dead spot for musicians, I'm trying hard to find people to do live shows but it's rough.",
            "what kind of metal?",
            "Yeah I mean I wish I found every band I like earlier on but I feel like so many bands just popped up when I needed them most haha",
            "even this doesn’t really do what you’d think",
            "Trying to to for a melodic death metal kind of thing just a bit lighter kind of like dethklok",
            "Yea I get it lol I just gotta situations where people unexpectedly need my music muahahah",
            "Well share it here I’ll check it out forsure",
            "I appreciate it any feed back is always appreciated even more as well https://www.reverbnation.com/astraldirge/song/34507633-star-eater-astral-dirge",
            "It’s good man heavy as fuck riiffy as fuck too",
            "Thank you man I appreciate you even checking it out 🙏"
        ]
    },
    "What're these sounds at the start of this song": {
        "title": "What're these sounds at the start of this song",
        "score": 2,
        "url": "https://www.reddit.com/r/WeAreTheMusicMakers/comments/1dlsjbi/whatre_these_sounds_at_the_start_of_this_song/",
        "content": "I don't know what sub to ask this in, I assume here?  \nAnyways, cut to the chase. Lets just say I might want to sort of transcribe this piece of music, despite it probably being digital and all that. I want to transcribe these sounds just as though they were normal 'ol percussion instruments. I mean, they don't sound like they have a pitch (besides that super high pitched one).  \nThere's these wind effects and like sorta electronic like little things.  \nHere's the music I'm talking about. [https://www.youtube.com/watch?v=XneukMwAGL8](https://www.youtube.com/watch?v=XneukMwAGL8)  \nOh god it's anime oh no!!!!!!  \n  \nAnyways, tl;dr: If I were to write these little sfx into sheet music, what instrument and little text above said part would I put?  \nAlso, I do want to know if these effects have names. I'm more on the music theory side of music making, so I don't know a lot about all these synth things which seem super cool to me. ",
        "num_comments": 1,
        "comments": [
            "It’s commonly known as a whoosh (it doesn’t really have a specific name as far as I know).\n\nYou could be specific and call it a cinematic whoosh.\n\nEven more specifically, a “digitally slowed down cinematic whoosh to the point of producing artifacts”.\n\nThat’s because the sound is created by taking a whoosh sound effect that’s typically used for film and film trailers, and it’s slowed down to the point that it exhibits digital processing artifacts.\n\nA similar sound can be created with a very large gong, in which case you are going to notate a wash for a large gong."
        ]
    },
    "How do you as a listener go through artist's catalogue?": {
        "title": "How do you as a listener go through artist's catalogue?",
        "score": 0,
        "url": "https://www.reddit.com/r/WeAreTheMusicMakers/comments/1dlui03/how_do_you_as_a_listener_go_through_artists/",
        "content": "I'm an old schooler so would love some thoughts on this. I love the idea of albums but most don't care. So how does one listen through all the music from artists once you've found something interesting on Spotify?\n\nDo you go to the Discography page? Do you only play the 5 popular releases on the main page and let Spotify autoplay afterwards? Do you click on each release?\n\nI want to keep releasing albums as I'm concerned about my style changing juuuuust enough for it to be good for me to compartmentalize, but don't even know if people care about albums even if they're available. :/\n\nThanks.",
        "num_comments": 2,
        "comments": [
            "Make an artist playlist of yourself and curate the order of listening through your catalogue that way. Keeping in mind people might get through 5 songs.",
            "Thanks, that's a good idea. I'll do that. But do you think that's what listeners go to though? I'd love for that to be the case but I personally never check out artist's own playlists."
        ]
    }
}