{
    "Cumulative Updates: June 11th, 2024": {
        "title": "Cumulative Updates: June 11th, 2024",
        "score": 16,
        "url": "https://www.reddit.com/r/Windows10/comments/1ddjdd1/cumulative_updates_june_11th_2024/",
        "content": "Hey all - changelists now up, linked here for your convenience:\n\n* Windows 10 version 1507 — [KB5039225 (OS Build 10240.20680) - Microsoft Support](https://support.microsoft.com/en-us/topic/june-11-2024-kb5039225-os-build-10240-20680-48d7d7c2-bf55-458b-bdc2-06eb6be3d912)\n* Windows 10 version 1607 — [KB5039214 (OS Build 14393.7070) - Microsoft Support](https://support.microsoft.com/en-us/topic/june-11-2024-kb5039214-os-build-14393-7070-07836869-b221-42a9-a63a-62f10967068f)\n* Windows 10 version 1703 — [EOS](https://support.microsoft.com/en-us/topic/windows-10-update-history-83aa43c0-82e0-92d8-1580-10642c9ed612)\n* Windows 10 version 1709 — [EOS](https://docs.microsoft.com/en-us/lifecycle/announcements/windows-10-1709-end-of-servicing)\n* Windows 10 version 1803 — [EOS](https://docs.microsoft.com/en-us/lifecycle/announcements/windows-10-1803-1809-end-of-servicing)\n* Windows 10 version 1809 — [KB5039217 (OS Build 17763.5936) - Microsoft Support](https://support.microsoft.com/en-us/topic/june-11-2024-kb5039217-os-build-17763-5936-d435559e-ae16-44d0-b145-027eb4af7f47)\n* Windows 10 version 1903 — [EOS](https://docs.microsoft.com/en-us/lifecycle/announcements/windows-10-1903-end-of-servicing)\n* Windows 10 version 1909 — [EOS](https://support.microsoft.com/en-us/topic/end-of-service-statement-e440a698-de79-4ace-b53b-5a6a3e36685e)\n* Windows 10 version 2004/21H1/20H2/21H1 — [EOS](https://support.microsoft.com/en-us/topic/end-of-service-statement-e440a698-de79-4ace-b53b-5a6a3e36685e)/[EOS](https://support.microsoft.com/en-us/topic/end-of-service-statement-e440a698-de79-4ace-b53b-5a6a3e36685e)\n* Windows 10 version 21H2, and 22H2 — [KB5039211 (OS Builds 19044.4529 and 19045.4529) - Microsoft Support](https://support.microsoft.com/en-us/topic/june-11-2024-kb5039211-os-builds-19044-4529-and-19045-4529-f7e528c9-5e9f-4cd8-9161-704708448517)\n\nReminder - \"Patch Tuesday\" updates include changes from previous preview/optional updates if you chose not to install them. For 22H2/23H2:\n\n*  [May 29, 2024—KB5037849 (OS Build 19045.4474) Preview - Microsoft Support](https://support.microsoft.com/en-us/topic/may-29-2024-kb5037849-os-build-19045-4474-preview-cda7ed71-6202-45ed-a649-63b11fedabfe)\n\nGeneral info:\n\n* For a list of known issues and safeguards, please refer to the dashboard [here](https://docs.microsoft.com/windows/release-health/).\n* For details about feedback, and how to capture traces if needed, see [here](https://aka.ms/howtofeedback).",
        "num_comments": 40,
        "comments": [
            "If you've tried basic troubleshooting steps for the issues you're encountering and these don’t help, submit your problem to the Feedback Hub! This is the best approach to get your feedback properly sent to the Engineering Team, which can also gather additional details and information about your issue. Follow these simple steps:\n\n1. Open the \"Feedback Hub\" app and click *\"Report a problem\"*\n\n2. Follow the on-screen instructions and click *\"Submit\"*\n\n3. Click *\"Share my feedback\"* and open the feedback you submitted\n\n4. Click *\"Share\"* and copy the unique link\n\n5. [Send the link you copied to u/JenMSFT](https://www.reddit.com/message/compose/?to=JenMSFT)\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Windows10) if you have any questions or concerns.*",
            "KB5039211 fails to install on mine. I hope it's not absolutely necessary.",
            "And again 1507 outlived 20H2 and almost the rest 🤗💗",
            "Not sure what the heck they did, but literally after updating my laptop now runs like hot garbage and won't hold a charge for the slightest second.",
            "Windows Shell Experience Host is taking up a lot of my CPU now. Can this be from the update earlier? How do I stop it?",
            "I tried playing Pathfinder WotR again after the update (120 hours in already). GPU reached 99-100 in the main menu, making it unplayable.\n\nI uninstalled the update and the game runs smoothly again. What did they do with this one?",
            "is this the update needed for that wifi takeover attack?",
            "Downloaded it, had the yellow circle next to the shutdown and everything yesterday, and now it's vanished.... has Microsoft rolled back the update?\n\nHuh nevermind it installed when I restarted, weird, oh well.",
            "KB5039211 is messing around with Realtek Audio drivers. My audio is completely gone. Sound icon has a red cross and says 'no speakers or headphones plugged in'. Device Manager does not even show Realtek Drivers. Manually installing them from Laptop's drivers website did not work as Realtek audio does not show up on Device Manager.",
            "Had to uninstall the update from June 11th, made my 4090 gpu utilization get stuck between 0-12% in games. i Went through all the drivers and realized this was the issue.",
            "Updated and now not only have I gotten 2 blue screens, an important file (Windows system32 winload.efi) is apparently fucked up. I've tried just restarting my laptop and disabled the secure boot neither worked. When will the next update fix this shit. Edit: I'm now stuck in an endless loop of having to sit and wait for my laptop trying to fix drive errors (and failing) and getting constant blue screens. I tried uninstalling the update couldn't using sfc it not working and then trying to fix that,please tell me I don't have to get a new laptop.",
            "With this update it did what happened in Januarys update, it went through and made my pc absolutely unusable, I can open any apps and then the pc will freeze and I have to hard shutdown, I had to wipe my harddrive with januarys like 10 times and then it stopped but it’s doing it again and I don’t want to wipe my harddrive fresh again does anyone know how to fix this issue",
            "KB5039211 fails to install also.",
            "Fails for me to",
            "Failed to install on mine as well.",
            "It installed fine on mine, and I wish it didn't, because it's causing extreme stuttering in games. Very weird too, instead of having spikes and slowing down, it freezes for about 1-3 seconds in which cpu and gpu usage drops to zero.",
            "For me too. Together with the older KB5034441 which was for the recovery partition. although I have followed MS instructions and made the recovery partition bigger.",
            "That tracks further than what I had but what I feared would transpire for my old Windows 10. That system took a hit with 21H2 and two/thirds the volume was lost on Realtek for a couple of years. Didn't bother upgrading to 22H2 with that rig in concern of losing much more and ended up changing computers.",
            "Not just Realtek. Somehow my audio craps out after not even hour of music from youtube.",
            "having same issues. were you able to fix it ?",
            "Same here",
            "Any luck in fixing it? I have deleted the update but I have realised that it basically does nothing :D",
            "I also confirm the stuttering, really annoying, I deleted the update but keeps installing on its own.",
            "no unfortunately I don't think I can.",
            "Same -- I had resized partitions the last time this had happened and fixed things, but yet again it stalls forever then fails and rolls back.  Run dsim restorehealth, run sfc, resize partition again this time to 3GB, still fails.",
            "Not yet, I rolled back the update and the stutters/mini freezes are shorter and half as frequent but still there. I think it's caused by a graphic driver timeout but I'm not completely sure. I tried repairing the driver but it did nothing, but I haven't tried a full clean reinstall yet.",
            "I disabled automatic updates, so for now when I turn off the pc I just don't select the update option. I managed to make the stuttering go away, it was in fact the gpu driver that got fkd. The repair option didn't work, so I downloaded AMD driver removal tool and used it in safe mode, then rebooted, installed the driver again, rebooted again, and then it worked. Still pretty annoying, first time an update borks the system for me since I switched to LTSC several years ago.",
            "I was able to uninstall this update just now from settings, hope it fixes the issue",
            "Yea, I did all of that too to get a couple of them installed in January and again in May. At this point I’m just not bothering at the moment :/",
            "Hey !  \n  \nSo i managed to install the update after not being able to.  \nHere's everything i did, with no idea about what actualy fixed it :   \n- Ran sfc scan now   \n- Troubleshoot Windows Update  \n- Installed some optional updates from intel on Windows Update  \n- I used to press \" Update and shutdown \" but decided on the last try to press \" Update and restart \" instead.\n\nCheers.",
            "Yo, how did you roll it back? System restore?",
            "Thanks for the help, I hid the update with the tool from Microsoft",
            "I also attempted that via control panel and command prompt but neither worked,control panel just gave me a error saying it couldn't delete it all,and command prompt was wierd, there was actually two updates with the same date one ended with 211 (the same as the control panel) the other ended with 995 I couldn't find any update with those same end numbers in Microsofts update history. also weird was control panel said it was a security update. either way I'm now fucked because of what my first comments edit said,blue screens and a error screen saying that \"windows system32 winload.efi is corrupted\" from what i recall,I think I just have to reinstall Windows 10 which I don't now how to do and I to stupid to figure out.",
            "no, i uninstalled the update",
            "By the way, I'm guessing the update is related to the recent wi fi exploit they found on windows, so if your pc has wi fi but you don't use it, try to disable it. If it only connects through an ethernet cable, then there's no worry, as the exploit is only for wi fi connections.",
            "as it turns out my laptop still blue screened after the uninstall. I’ll be taking it to someone to get it checked.",
            "Hm. It won't let me do that annoyingly",
            "I have it disabled anyway, if you are having more problems with the update you can try the tool I used, its called wushowhide.diagcab, you can download it directly from Microsoft site",
            "I hope for the best."
        ]
    },
    "Simple questions and Help thread - Month of June": {
        "title": "Simple questions and Help thread - Month of June",
        "score": 4,
        "url": "https://www.reddit.com/r/Windows10/comments/1d5lfhe/simple_questions_and_help_thread_month_of_june/",
        "content": "Welcome to the monthly Simple questions and Help thread, for questions that don't need their own posts!\n\nBefore making a comment, we recommend you [search your problem on Bing](https://www.bing.com/search?q=Windows+issue) and check if your question is already answered on our [Windows Frequently Asked Questions wiki page](https://www.reddit.com/r/Windows/wiki/faq). This subreddit no longer accepts tech support requests outside of this post, if you are looking for additional assistance try r/TechSupport and r/WindowsHelp.\n\nSome examples of questions to ask:\n\n- Is this super cheap Windows key legitimate? (probably not)\n\n- How can I install Windows 11?\n\n- Can you recommend a program to play music?\n\n- How do I get back to the old Sound Control Panel?\n\nSorting by New is recommend and is the default.\n\n----\n\nBe sure to check out the [Windows 11 version 22H2 Launch Megathread](https://www.reddit.com/r/Windows11/comments/xj877b/windows_11_version_22h2_build_22621_launch/) and also the [Windows 11 FAQ](https://www.reddit.com/r/Windows/wiki/faq) posts, they likely have the answers to your Windows 11 questions already!",
        "num_comments": 43,
        "comments": [
            "I just noticed that Dev Home for Windows Developers (preview) was added to my system. I don't know if it was part of the Cumulative Update or it was installed later.\n\nThis is a gaming computer, and I don't use it for development, so I don't know what triggered the install.\n\nDid anyone else have this installed?",
            "How do I permanently kill the news and interests on the taskbar? Every time I go into settings and disable it, it turns itself back on. I don't want all that junk on my login screen and I'm tired of turning it off every time I open my laptop.",
            "How do i make windows to reinstall my webcam driver? it stopped working.. now i go into device manager and driver is not there.. i tried different usbs and rebooted several times, even downloaded a driver booster thing and didnt help. Webcam has no brand and no drivers online... its supposedly \"plug and play\", i tried it in different pc and it worked but just wont work in mine...",
            "When i launch fallout 3 from the microsoft store and press plag it just closes. Im on windows 10 and want to know if i have to have 11 or?",
            "Hello everyone, first time posting here, hope this is ok, I tried googling without success.\n\nSo what's happening is if I use the search box in any Windows folder it won't show any results with the searched word, even if I know for a fact it's there as I can literally see it (I did some tests when I noticed I wasn't finding some results that I was fairly sure had to be there).\n\nWhat's even weirder is that it does find some .pdf files that are literally the mentioned .xls saved as pdf, and same goes for Word files.\n\nAny idea why that could be?\n\nThank you!",
            "Hello guys This is also my first time posting here and idk if this is a virus or keyboard problem.  \nBasically when I'm playing fullscreen games Ex. Valorant, League Etc, I get alt tabbed to my browser,  \nAnd it Doesn't matter if I'm paused in game it just suddenly happens and I tried closing my browser  \nbut it still alt tabs to my windows or any background app i have like my Sound App I'm not even close  \nto the alt tab button and it still does it I'm , but this has been happening since last month and I just  \nrealized that its not even alt tab cuz it doesn't show the apps when you hold the alt tab button\n\nI hope someone also experienced this and figured how to fix it  \nHelp a fellow gamer!",
            "Windows 10 (Samsung) laptop suddenly stopped sleeping. Setting is to have laptop sleep when lid is shut, usually at day's end but lately in the morning it's already \"running.\" Every day for the past 5-7 days lights on outside of laptop shell/case are on and fan is running when it should be asleep. Did Microsoft change something recently? Perhaps in conjunction with the newly added widgets seen on locked screen?",
            "I use a dell laptop xps12-9250.\n\nFor a while now, blue tooth devices will freeze on me after a while. For example if I'm using my stylus for the touch screen it will work normally. Then the pens cursor disappears on the screen and no touches from the pen will be read until I push buttons on the pen a few times. As an artist this gets in the way.\n\nWhen I'm using a Bluetooth mouse and or game controller; it will work just fine but then suddenly things will stop moving. The mouse stops working, as in clicks won't be read and the cursor won't move. Until of course I click it a few times. Same thing with my game controller. I can be moving the joysticks then suddenly the game won't register any movement. \n\nNothing will outright disconnect from my computer. The devices still say they are connected, it just stops moving. Please help it's been going on for too long now.",
            "https://preview.redd.it/a43av7dsf35d1.png?width=436&format=png&auto=webp&s=608da8903739c4a6efe2482af950a23abb377c8a\n\nis this normal?  I only have this issue on my fairly old HP laptop that isn't high end to any capacity, but random windows processes/programs will occasionally decide to eat the cpu and the cooling is awful on this laptop so anytime the cpu usage is like 50% or higher the fans go wild, and usually if i'm just browsing or doing schoolwork it doesnt use much cpu so it doesn't matter, but if my laptop randomly decides that some windows host process is gonna consume the cpu, then my laptop just seemingly is freaking out for no reason and this happens all the time.  never had this issue on either of my gaming pcs tho",
            "How do I delete these events on my calendar? When I click them, I get redirected to Microsoft outlook, but there's nothing there on those dates.\n\nhttps://preview.redd.it/kc1827hkj55d1.png?width=355&format=png&auto=webp&s=40e44f1385ae19dd54b28af4d9ff4736fdb29f9f",
            "On a laptop + mouse setup, is it possible to use the trackpad for gestures (including two finger scrolling), but disable it for moving the pointer?",
            "Yesterday, I changed my motherboard and CPU, and since then, Windows 10 has been giving me constant problems. First, it didn't recognize the Alt key, then the Alt+Tab command bugged out, either switching too quickly or getting stuck. Today, it recognizes the keyboard, but it's as if it's locked; it's like I'm pressing multiple keys at the same time. For instance, using the mouse wheel triggers the Ctrl+WheelUp/Down command.",
            "Does tiny10 or tiny11 still activate and give you security updates? I need to upgrade an old laptop to ssd and was thinking of going with one of these OS.",
            "how would i combine two microphone inputs in into one output? If there's a free app for it, please let me know.",
            "I received a computer that belonged to a friend that passed recently. I want to add my own microsoft account to this pc but it will only allow me to sign into his. I do not have his login info. I have already attempted to use the safe boot option and using command prompt but this also asks me for a password and is at the limit of my technical skills. Any ideas?",
            "Paint doesn't work, I can't open it. The process get stuck on task manager. What can I do to fix it please?",
            "I winget uninstalled winget. How do I reinstall it?",
            "I am running a full scan on my PC from windows security and the antimalware executable is using 96% of my CPU (i5 10 gen). Is this normal?",
            "After the latest update, my sound now says, \"No speakers or headphones are plugged in.\" Can anyone help me please!",
            "Has anyone else had mouse input issues on win10? My mouse has felt very sluggish lately. I have the logitech g502 proteus spectrum. I reinstalled my usb host controller a few days ago due to an issue with a usb drive but I doubt that is the reason for the laggy feeling. I've tried with other mice aswell but all feel the same.",
            "Are any of these ok to remove? Got the laptop recently and I've been trying to keep up and make sure little to no stuff I don't need/not using is installed. Specifically wondering if that update one at the end of the list is needed. \n\nI figure a lot of these need to stay since I've seen them on most of my Windows PCs in the past. \n\npls treat this post like it was posted in r/NoStupidQuestions. thx\n\nhttps://preview.redd.it/immk96kjz76d1.png?width=1275&format=png&auto=webp&s=2c65cb32169933b44a171225bc8c610a2a0ba8fa",
            "Anyone know about any good alternatives to WinDirStat to get a good overview of files on a drive? WinDirStat takes ages to completely go through everything, was wondering if there are better alternatives for Win10.",
            "Hey all,\n\nI'm trying to assist my Father who lives in a different city and is 81 so when he has computer issues, the world ends....lol.\n\nSo, when he powers up his desktop (running windows 10 I believe), he gets this message \"Is your Windows software up to date? Protect your PC by making sure it's on the latest version of Windows.\"\n\nThe computer then turns off and the screen goes black.\n\nThanks about all the info I have, any ideas?\n\nThanks!",
            "https://preview.redd.it/bol8fgw1ak6d1.png?width=1278&format=png&auto=webp&s=1100c1cf9453b982cc37cb97f55c78356c5c5876\n\nHi! I'm really stumped about audio inputs. I have Sonys Bluetooth headphones connected to my PC, its recognised in BT audio settings, but I just cant select it as an output device!\n\nAlready tried redoing the bt connection process/ restart PC & headphone but its still not working",
            "https://preview.redd.it/em7guxltcl6d1.png?width=856&format=png&auto=webp&s=b8ab10ba9abf13a7a52b322f0a4d10247bf5be0e\n\nWindows doesn't show frequent apps on the right side of Search anymore. Is there any way to change it back so it does?",
            "Why do I keep getting loged out from microsoft family",
            "For some reason my laptop came with Windows 10 Enterprise, I'm trying to change it to Home by following the instructions [here](https://www.reddit.com/r/Windows10/wiki/solutions/edition_downgrade/), but when I paste the prompt on PowerShell, nothing happens, no confirmation or anything.  \n  \nWhen I run the setup.exe, it asks me for the product key. I tried using the same one used on my laptop by following [these instructions](https://www.avg.com/en/signal/find-windows-10-product-key) (had to use the regedit option because neither cmd nor powershell gave me any response) and apparently it's not valid???\n\nReaaally getting desperate here so any help is appreciated.",
            "whenever i open my task manager it shows my cpu usage upta 100% but after some time it comes down show about 10-30% usage . I tried it again and again it shows same what . IS THIS IS NORMAL???",
            "Seen multiple threads on here about Microsoft Text Input Application, but not really a clear answer on what it is. I tried killing it and changing the folder name, but it starts up again after a few seconds regardless of what I do. What is it, and what do I do?",
            "I use a usb switch to switch my mouse/keyboard input from a work to home PC. Sometimes after doing this my mouse/keyboard lag/hang on the work PC. Is there any way to reset USB services short, of restarting the PC? Plugging/unplugging the devices doesn’t resolve the issue.",
            "So what would change if I finally update Windows 10? I've been using a several-years-out-of-date version for... well, several years, and it got to the point where I worried I'd have to adapt to basically a new OS if I updated, especially with my growing fondness for Linux over Windows. How different IS Windows 10 from where it started?",
            "KB5039211 has gutted my gaming performance, both options to uninstall don't work. I've got a 5800x3d, 3060ti, 32GB oh 3600MHz dual channel RAM, everything on SSD's, etc etc. I noticed my games suddenly stuttering more, tried endless troubleshooting steps before realising it was after a windows update. I found a few posts with similar issues, so I'm wishing to uninstall it. However, in windows update there's no \"uninstall\" option, and in cmd it says it can't be uninstalled, \"update is required and cant be uninstalled\" or something similar.\n\nAny way I can brute force nuke this update from my PC?",
            "WHAT IS GOING ON WITH THIS \"Windows Recovery Environment\" UPDATE? I HAVE TO DO COMMAND PROMPT RESIZING OF MY OS PARTITION??????????????  \n\n\"**~Resolution:~** Automatic resolution of this issue won't be available in a future Windows update. ~Manual steps are necessary to complete the installation of this update on devices which are experiencing this error.~ \" \n\n????????? GO FUCK YOURSELF ?????? \n\n\"Guidance to manually change the WinRE partition size can additionally be found in [KB5028997: Instructions to manually resize your partition to install the WinRE update](https://support.microsoft.com/help/5028997). \"\n\nWell guess what. IT'S WRONG ??? \n\nWhat. the. fuck. \n\nCan I just disable Windows Recovery Environment? Please help",
            "Yes. I have it listed under Windows Accessories. Never noticed it before.",
            "Set the group policy to disable it (if you are running Win 10 Pro.).",
            "Voicemeeter",
            "Hey, I have the same issue, any resolution yet?",
            "Those are Runtime Libraries. They contain functions used by other programs.\n\nIf you remove them, the programs that use them might stop working.",
            "I'm on Win 10 Home",
            "I noticed that my Realtek Audio drivers seem to have disappeared from Device Manager. Manually reinstalling them doesn't seem to help, they just don't show up under Sound, or even system drivers on Device Manager",
            "My bro in discord help me with Regestry editor thingy that I don't understand but it work",
            "Ok! Thank you!"
        ]
    },
    "Finally back to windows 10 after being on 11 for 2 years. It feels way better.": {
        "title": "Finally back to windows 10 after being on 11 for 2 years. It feels way better.",
        "score": 514,
        "url": "https://i.redd.it/pgn13zb6cx7d1.png",
        "content": "Everything feels faster and better and kinda nostalgic ",
        "num_comments": 229,
        "comments": [
            "Enjoy it while it lasts!",
            "Give me your wallpaper",
            "Enjoy it while it lasts. Because support runs out next year.",
            "At least part of that is just having a clean install. Lots of people complain that Windows 11 is slow, but personally I've noticed no difference between it and Windows 10.",
            "Running all HDR monitors with my main two being OLED, 4k and QHD. Windows 11 HDR support is definitely better than 10s. Will never touch 10 on my own devices again.",
            "i just find it insane how they can make a product worse and continue to make it worse being completely tone deaf of complaints",
            "I don't \"get\" windows 11... its just windows 10 with a whole bunch of added features... they legit could have just kept updating windows 10 with \"feature updates\"... looking back and ive been a heavy windows user since win98 and windows 11 is the least changed version of windows to date. 98 and 2000 were actually pretty similar but xp, win7, vista, win8... win me in there somewhere but we don't talk about win me lol.  They've all been very different operating systems until this windows 11... I can't help but feel like its not so much a new operating system but rather a manipulated push for hardware sales... \n\nAlso everyone on win 10 has until October 14, 2025, then they cut the updates which is more important than people realize... not the apps or features but the security holes they keep patching. Search up how fast xp got riddled... sitting idle for like 20 mins while connected to internet it was completely flooded with crap. \n\nFor a time frame reference XP lost updates 2014... i didn't see any videos of any other unsupported windows versions so its just the one time stamp but in 20 years you can have it connected to the internet for 20 mins and be so infected its nearly unusable. Doesn't really create a GOOD time frame reference but gives some kind of idea...",
            "Remove that search icons, widget icon, weather, task view and install translucent taskbar.",
            "Wallpaper plsss",
            "Wallpaper link plz",
            "Windows 11 isn't really that bad.... If you modify it a bit lol compact view, remove all extras from taskbar, move bar to the left, remove all user folders from this pc, restore classic right click menu.\n\nI have a script that does it all for me in 30secs or less lol\n\nAfter that windows 11 is pretty much exactly the same with smoother animations",
            "how did you downgraded your machine?",
            "Same here 👍",
            "Wow, any links to download that wallpaper ?",
            "Im sad this wallpaper doesnt exist for 1440p :<",
            "Basically I switched from a bloated operating system to a slightly less bloated operating system.",
            "bro has heaven on his pc",
            "If you want a lightweight system, you can try Windows 11 LTSC IoT Enterprise, which uses almost the same RAM, CPU, and even less storage than my old Windows 10 LTSC did.\n\nBtw, if you really prefer W10, it's ok, it looks so beautiful with your wallpaper. Wallpaper Engine is an amazing program",
            "Dont you need to pay at all like 40 dollars for updates?, i seen this somewhere else on news.",
            "- said everyone about W7 when 8.1/10 came out\n\n\nThat said, I'm waiting for W11 to mature a bit more in terms of third party support before making the jump. I have no qualms about switching to W10 LTSC for longer support if needed.",
            "I still use windows 10. Not gonna upgrade until Windows 12 release",
            "People who like Windows 10 will be sticking to their guns. Microsoft can 'do one'.",
            "Why did you go back to 10? It's less efficient, worse performance, going out of support next year.",
            "That wallpaper looks great. Could you please share it?",
            "Do yourself a favor and install Linux! Microsoft is only going to continue to get worse.",
            "I just did the same, booted a vhdx and just.. kept it. I couldn't stand Win11 anymore.",
            "NGL, I'm normally always resistant to os change, but I just installed w11 yesterday since I got a fancy new 14700k... It actually feels and looks reallllyy good.  It's so snappy.  Very noticeable.",
            "Best current Windows OS: Windows 10 IoT Enterprise LTSC 2021 \\[Supported for 10 Years (till 2032)\\]\n\nThank me later for a clean without bloatware OS :)",
            "I switched to Windows 10 too. Will use it until Windows 12 come out. If it turns out bad, I'll switch to Mac or Linux maybe :D",
            "Please send a link to that wallpaper or similar ones :P",
            "Fuggers pushed the update to my older Alienware gaming laptop which is not supported by Dell. So now the LED lights no longer work properly and I can’t get updated drivers. This bullshit should totally be opt-in. I need to roll it back to windows 10, but I have several daily giveaway software titles installed and I will lose those activations.",
            "what is better? Wallpaper?",
            "It’s objectively a better OS, enjoy! Unfortunately until 2025…",
            "Wallpaper is beautiful af",
            "Why? What’s wrong with the 11?",
            "It's much better than Windows 11. Windows 11 is the worst Windows since Vista IMH.",
            "I did the same.  \nUsed Windows 11 for a couple months, no issues. But it kept feeling slower than 10.  \nI made a dualboot to compare. The difference is noticable. \n\nWin 11 just needs more polishing.",
            "I run Windows 10 and I get BSOD roughly every other day on start-up, I take it as MS' way of encouraging me to upgrade because there's nothing wrong with my laptop. This phenomenon started around 1 month ago.",
            "Great wp",
            "Did the same with mine i couldn't stand it",
            "Almost like coming back to XP from Vista after SP3 dropped. Also I love that wallpaper you gotta link for it?",
            "Did this today. Switched from Win 11 to ubuntu for 2-3 weeks but was having problems with gaming so I switched to Win 10. Feels nice",
            "indeed .. 11 is just millenium .. I mean vista.. I mean the in between beta test they sell every other version.",
            "What a weird walpaper.",
            "Search is broken on Windows 10. The upgrade to 11 alone is worth it for getting a better search.",
            "Windows 11 23H2 is way faster on my i7-6700K Skylake than Windows 10 ever was. There is no reason to regress back to 10.",
            "ugh these posts of old uncles clinging to old software thinking its cool",
            "My Windows 10 will last until 2032",
            "Wait. I heard long time ago that they will force all to go win11 . Is that true ?",
            "not sure why op didn't link to it but I used some samsung ai to find it. [https://4kwallpapers.com/nature/foggy-scenery-14972.html](https://4kwallpapers.com/nature/foggy-scenery-14972.html)",
            "Type Lake Scenery in Wallpaper engine it's a live wall paper.\n\nBtw it looks way better than in this post",
            "So what. Support only means more m$ bloat/ransomware i didn't ask for and features I do use removed without asking or telling me. I could not care less about \"support\".",
            "Lol are you kidding me?!\n\nhttps://preview.redd.it/ubvunjtjd28d1.png?width=876&format=pjpg&auto=webp&s=9330b24dc72871416c59eb6661b8ffe02e83c00b",
            "Honestly I noticed inconsistent animations like they feel smooth but suddenly laggy a bit and also battery life was better for me in win 10 for some reason by alot",
            "True but the performance of windows 11 is terrible\n\nI went to 11 and 10 many times and my fps is always lower in windows 11 and animations are not consistent\n\nBattery life in win 11 is 2.5 hours \n\nIn win 10 it's 5.4 hours I don't even know why I had same setup for sure",
            "This XP getting infected thing is only true if you connect it *directly* to the internet. So, no router, firewall, etc. - it's likely that Windows 10 and 11 would get infected with that setup. It's just not a configuration that anyone would use.",
            "> its just windows 10 with a whole bunch of added features... they legit could have just kept updating windows 10 with \"feature updates\"\n\n  \nIt is. Just that marketing division butted in and asked for the number to get changed to 11 bc their OEM partners were crying that PC sales have been slow ever since the continuous feature update model began.",
            "Just get StartAllBack instead.",
            "I think this \nhttps://4kwallpapers.com/nature/foggy-scenery-14972.html",
            "I think this works \n\nhttps://4kwallpapers.com/nature/foggy-scenery-14972.html",
            "do you have any way to make the taskbar win 11 calendar productive again?",
            "Can you provide that script. Will appreciate",
            "still not the same tbh, i have a new laptop so performance is no issue for me, but visually- win10 is way better. also much easier to mod/theme.",
            "What's wrong with the user folders in win11?",
            "What about all the telemetry and tracking and forced MS accounts tho (if it isn't a thing yet, I don't doubt them enforcing it in the future), honestly it's a dumpster fire",
            "Installation tool from Microsoft website . It deletes everything tho",
            "https://4kwallpapers.com/nature/foggy-scenery-14972.html",
            "I have 1440p monitor and the wallpaper is too perfect like it's so detailed and sharp but I'm using it from wallpaper engine",
            "HUH????",
            "Nah win 8 was amazing",
            "https://4kwallpapers.com/nature/foggy-scenery-14972.html",
            "You could Dual-boot.\n\nThose giveaway software titles have accounts, right?\n\nYou can just sign in on the Windows 10 side, right?\n\nAnd once everything is migrated, delete the Win 11 to reclaim the disk space.",
            "Animations, swiftness. Even my games I get higher fps by like 10%-20% and less vram used somehow idk wtf win11 had in the background",
            "It's not objectively a better OS if not everybody agrees with you.",
            "Even better in live try it with wallpaper engine. It's called Lake Scenery",
            "Animations are laggy sometimes, performance is worse by 10% at least , battery life sucks . So many bad things idk why but I endured it cuz it had some QoL",
            "11 is a spyware mess",
            "Why do you think so?",
            "Animations are fake smooth too they seem smooth sometimes then laggy idk why even on best laptops I have",
            "You should see the difference with Arch Linux compared to Win 11 Pro, it's absurd, network latency down, input latency down, responsiveness, less memory consumption, better CPU scheduling like...Win 11 at this point is just functional nothing more, and definetely inferior, and yes Windows 10 are indeed as well faster and way easier to debloat without breaking things compared to 11, ask me how i know.",
            "People have been saying it needs more polishing since it released. Win 12 is almost here now and Win 11 is still not as good as Win 10 performance-wise.",
            "Sounds like a hardware or software issue. Just do a reinstall.",
            "It's called Lake Scenery on Wallpaper engine app from steam if u want to try it",
            "If you have wallpaper engine it's called  Lake Scenery. It's live and looks way better than in his picture it's so detailed and smooth \n\nIf you don't have wallpaper engine Google image this post",
            "Huh? It gives me 40% more battery life and better and faster animations a d performance tf u talking about",
            "Yes, but 3rd party software support won't. You'll be good well beyond 2025, I'm sure, but I really doubt there's gonna be much in the way of software support for Windows 10 as far out as 2032.",
            "They won't force you but you'll stop getting updates.",
            "Support for win10 ends october 2025.\nMicrosoft is tricking everybody into upgrading. If you don't check what update you're installing you might accidentally install win11 haha",
            "Somewhat true. End of life support is coming up-- but windows plans to offer a paid extension of updates to those that wanna pay for it",
            "Yes, it's already started. \n\nWindows 10 Support ends on October 14th, 2025.",
            "Force hardly but they will make it easier or more compelling to switch to 11 or 12 if it will be out until the support for Windows 10 ends which is in fall 2025. That basically means that they will blast you with commercials and upgrade popups so making 10 more annoying to use. After the security update support ends you will be more vulnerable to malware, ha king and what not so not really smart to stick with 10 if you are connected to the internet or not a networking and IT security super pro. Better get used to 11 early on or pray for yourself liking 12.",
            "They want you to use Windows 11, since Windows 10 support ends next year.\n\nThis means no more security updates, and eventually applications will drop support for it.\n\nYou can keep using Windows 10 of course, but it's not recommended.",
            "You can disable Windows updates with winaero tweaker",
            "They can try all they want. I have edited w10 so they have zero control over my pc now.",
            "No you can easily avoid it and not getting updates is not that big a deal if you know how to stay safe online.",
            "nah, someone will crack it and show a middle finger to Microsoft soon lol",
            "Brother  idk how wallpaper engine linking works sorry 😔 at least I gave the name",
            "I was going to ask for this too. That's awesome. I love it. Thank you.",
            "any link? I cannot find it!",
            " RemindMe! 9 Hours",
            "No it means that Windows 10 will not get security updates that patch any known or discovered holes in the system OS, meaning that unless you use your computer disconnected from the internet you will perpetually be at risk of virus or ransomware or anything that is designed to exploit the current holes in your software. Basically, as long as you're connected to the internet, you'll always be at risk.",
            ">[m$](https://i.imgur.com/We4Uj04.png)\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Windows10) if you have any questions or concerns.*",
            "It's an imgur link lmao.\n\nhttps://preview.redd.it/bb4jzi1as28d1.png?width=877&format=pjpg&auto=webp&s=4b94555cd4d580135ad792263b3deda8d6c9cea2",
            "Dude, I thought the problem was with my laptop. i just bought a new laptop and installed windows 11 on it and I've noticed that for example when want to check the wifi or Bluetooth or anything on that thing which I forgot the name of (task view or something), it just lags to open but then next time it open smoothly. I thought the problem was just my CPU.",
            "How'd you mess systemnup so bad with a single upgrade? 11 has waaaay better battery life and performance on my Acer Swift X.",
            "Never have had any performance issues with my 4090 on 11. The E-core/P-core design of 12th+ gen Intels seems to have fewer issues with 11. I'd say any major performance differences has to be setup related. I've never seen any pro reviews showing a big performance difference between 10 and 11 overall and not once seen it myself.",
            "actually you get slighlty more FPS on 11 compared to 10 on most games out there\n\nThis an issue on your side",
            "Definitely not true lol",
            "Can confirm windows 10 and 11 don't have that issue.... i turn off the firewall in the router and PC... when able I turn off the router functionality of the gateway im provided and just use the one ethernet port if i can't get a regular modem. I also don't use any security software and windows defender is completely disabled on my system, as in can't even re enable itself. I'm sure there's some shit on here but nothing that seems to impact how it runs. I still play heavy AAA games on here, its not much slower than when i first installed. which i do about quarterly bc ive never encountered a clean up or maintenance app thats ever had it running as fast as a fresh install. Gimme cat 6 and a direct connection any day... idk if it matters but ive been also running the tiny versions of 10 and 11 since i learned of their existence a while back. \n\nDidn't know it was a direct connection tho with the xp video... tbh my kid showed it to me and i didn't watch the entire thing.",
            "Ok so i was right lol... sometimes idk... need someone else to confirm lol",
            "It is not as responsive as the default one. Translucent taskbar works instantly and consume little to negligible resource.",
            "IDK what you mean by that, i literally only use it to check the date randomly lol",
            "It's just based off one the been around for a while but sure. There's apps that do the same but i like that is simple enough. Be sure to use the w11 one and run default.cmd as admin. You can use default.preset to disable shit you don't want.\n\nhttps://github.com/reddit-reaper/Win10-Initial-Setup-Script/tree/Windows11",
            "You could take a look at Chris Titus Tech's Windows Utility\nhttps://github.com/ChrisTitusTech/winutil\n\nI has a lot of feature which will help W11 to become bit snappier.",
            "I can agree with that to all extent. W11 definitely looks better in many aspects",
            "I hate it lol i prefer the windows 7 way. User folders in quick access and only drives in this PC. I can click my user folder to see the full directory if needed",
            "Telemetry is whatever though my script turns it off, you can bypass the msft account easily but i use it as its convenient and more secure than local account as they can't break the password",
            "hey, been wanting to try this too. although my laptop was already pre-installed with win11, i think i'd like to enjoy the last year we have with windows 10.\n\n  \nI don't really care about losing my data, but if I just run the media creation tool, does it just do it? did it go well for you?",
            "Fantastic! Many thanks 👊🏻",
            "go to r/Windows11 smh...",
            "Linux...  \nTried so many distros years ago, always went back to Windows. Linux is just not the thing for me i guess.",
            "Too much hassle in reconfiguring the settings of all the apps or I'd consider it.",
            "Thanks. Either way sounds like a plan.",
            "yup arc browser already made app only for w11, so i guess anything new nowdays will be similar",
            "> Yes, but 3rd party software support won't.\n\nMost of the software I use still works on Windows 7, let alone Win 10.  \nOnly in the recent 1-2 years some programs started to not work on 7.        \nSo Win 10 will probably be good for another 10 years",
            "Nope. You don't know what you're talking about.",
            "And once the updates stop. I’m coming for that booty 😈. Stealing all your shit",
            "LOL because the updates are always so valuable for the enduser. How many more \"tips\" do I have to turn off?",
            "I can't `accidentally` install anything since my perfectly fine AAA gaming i7 apperently isn't compatible... 🤷‍♂️🤣",
            "ltsc has support till 2032",
            "I use this cool utility on all my parents' machines https://www.grc.com/incontrol.htm",
            "Disable TPM in BIOS and it will never accidentally install it",
            "Oh my goddd no I'm too late",
            "It's alright man. You showed us the way. Thank you.",
            "https://4kwallpapers.com/nature/foggy-scenery-14972.html",
            "Found it [https://steamcommunity.com/sharedfiles/filedetails/?id=3222792440](https://steamcommunity.com/sharedfiles/filedetails/?id=3222792440)",
            "https://4kwallpapers.com/nature/foggy-scenery-14972.html",
            "I will be messaging you in 9 hours on [**2024-06-22 07:23:09 UTC**](http://www.wolframalpha.com/input/?i=2024-06-22%2007:23:09%20UTC%20To%20Local%20Time) to remind you of [**this link**](https://www.reddit.com/r/Windows10/comments/1dl3m7o/finally_back_to_windows_10_after_being_on_11_for/l9ol6kz/?context=3)\n\n[**CLICK THIS LINK**](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=Reminder&message=%5Bhttps%3A%2F%2Fwww.reddit.com%2Fr%2FWindows10%2Fcomments%2F1dl3m7o%2Ffinally_back_to_windows_10_after_being_on_11_for%2Fl9ol6kz%2F%5D%0A%0ARemindMe%21%202024-06-22%2007%3A23%3A09%20UTC) to send a PM to also be reminded and to reduce spam.\n\n^(Parent commenter can ) [^(delete this message to hide from others.)](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=Delete%20Comment&message=Delete%21%201dl3m7o)\n\n*****\n\n|[^(Info)](https://www.reddit.com/r/RemindMeBot/comments/e1bko7/remindmebot_info_v21/)|[^(Custom)](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=Reminder&message=%5BLink%20or%20message%20inside%20square%20brackets%5D%0A%0ARemindMe%21%20Time%20period%20here)|[^(Your Reminders)](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=List%20Of%20Reminders&message=MyReminders%21)|[^(Feedback)](https://www.reddit.com/message/compose/?to=Watchful1&subject=RemindMeBot%20Feedback)|\n|-|-|-|-|",
            "I know. Who cares? I have only had one virus in 30+ years. I'm good.\n\nTo honour your post yes you are right. IF the pc is used for critical work with sensitive data. But for by far most people you can forgo all the hyped up security bs and just backup your data for one. Only have sensitive personal data on an external hd or a second pc not connected.",
            "What is? What is it you think I am laughing at?",
            "Nope, I've set up tons of computers at work, not amazing PCs, but still pretty decent. IIRC it's i5 13500 and 3070s inside most of them, all having M.2s, UI animations look like shit. It's like this big conspiracy where you feel like your PC works like shit and want to buy better one lol.",
            "I have set up 200+ computers in the last two years at work and no matter the hardware, nothing can solve 11's sluggish response speed in UI. Is it by design? Probably. Also, I understand they feel the need to change UI non stop because otherwise users are gonna notice it's all the same with added bloat, but I really don't like the changes on right click menu and don't see how they're supposed to enhance my workflow, but that's up to the taste anyway so can't argue around that.\n\nI wouldn't let 11 near my home PC even in the form of a USB install media, we'll see how 12 is. I seriously hope Microsoft still respects their \"every second Windows isn't shit\" rule.",
            "Of course not.",
            "Bro I swear that I never encountered the issue they are having",
            "Never had problems myself either. I play a lot of demanding games and I never have problems like OP is describing. Windows 11 is completely fine in that regard.",
            "Also battery life on wind 10 is way way way wayyyy higher I swear I get 3hours of use in win 11 but in win 10 I get 5 hours and a bit",
            "Also battery life in win 10 is double 11 I swear I'm not making this shit up . I endured 11 only for QoL things",
            "Mate, you probably have a million viruses and other badware with that set up. Even modern servers require heavy firewalls. Don't go online without at least a software firewall and enable your antivirus.\n\nI wouldn't do any banking on that computer now...",
            "StartAllBack isn't even an app lmao. By internet standards, my PC is a relic from the Paleolithic era and I've not yet had the taskbar lag once.",
            "On win 10 you were able to check any TODOs or memmos for the date. You were even able to appoint new tasks for the date without the need to open the calendar app. Its the worst change in win 11 that youre not able to do so anymore",
            "Maybe I'm crazy but that's exactly how it is on my laptop that is on windows 11 and I swear I didn't do anything to change it lol but it sounds like I did",
            "I did it over 10 times in the past 3 and half years it's safe and good but idk about ur initially win 11 laptop I think it will be fine but mine was originally win 10 so it was normal but I didn't try it with a naturally win 11 laptop but I think it's fine cuz there shouldn't br any issues \n\nFor safer steps watch a video about how to downgrade to win 10 u just install a tool from Microsoft and let it download and boom it takes like 20min depending on he laptop",
            "What do you mean last year? Do you think W10 will stop functioning just because of a date? No is the answer. Only W10 stops being useful is if steam will not let new games install or directx 13.",
            "What does this even mean?",
            "Linux is much better now, but you can't just decide to switch on an impulse. You'll have to plan out which programs you'll need to replace with Linux alternatives and figure out which apps are already supported. Linux is now MASSIVELY better for gaming now. The only games that don't work are games with a specific type of anti-cheat software. I encourage people to try Linux IF they're not happy with Windows.",
            "Browser no one has heard of.",
            "Most of the core under the hood is in the same in both W10 and W11 so they'll be a lot more support than for other EoL OSes.",
            "> so i guess anything new nowdays will be similar\n\nit won't be",
            "leave my booty alone",
            "What is your profile picture",
            "This story comes to mind 😈 [https://www.tomshardware.com/software/windows/idle-windows-xp-and-2000-machines-get-infected-with-viruses-within-minutes-of-being-exposed-online](https://www.tomshardware.com/software/windows/idle-windows-xp-and-2000-machines-get-infected-with-viruses-within-minutes-of-being-exposed-online)",
            "Updates means security updates which is the main concern of end of life",
            "Windows updates are incredibly important for ensuring security on your device. Any vulnerabilities present after the updates have stopped pose a significant risk to anyone using the end of life system. Even if you're careful most of the time, one wrong download could fuck you.",
            "While I do agree, I have to say that security updates are indispensable.",
            "Lucky you! Would disabling TPM also be effective? Lol",
            "If your i7 isn't compatible it's pretty damn old. 8th gen above are supported.",
            "Sorry but if your i7 isn't compatible then at this point it's likely very old and no longer perfectly fine for newer AAA games",
            "Don't worry, they'll extend it.",
            "Dude you definitely have an issue with your laptop, maybe old hardware. You should get the same battery life with 11, and personnaly with my debloated 11 I got more battery life than debloated 10",
            "Ain't no way man lol something wrong on your setup for sure",
            "oh i don't anyway, legit ONLY game on it, browse reddit, check email, and watch videos/listen to music. There's next to no personal info on here. I don't even use any kind of password saving stuff. not even googles built in one on chrime... but lets see.. ill snag an av real quick",
            "Ahh ive never actually used it for other than checking the date lol didn't even know that existed",
            "oh thanks that helps. yea I got the media tool already but I am concerned because unlike my win10 PC this one came out in 2024 and was pre installed with 11, so idk about drivers and stuff like that",
            "it means what it means",
            "The more people switch and become a notable market share, the more support and programs get released by both community and companies. There's already so much good open source software for Linux (but I can never get over how much GIMP sux compared to PS)",
            "> Linux is now MASSIVELY better for gaming now.\n\nYep, and it keeps getting better and better.",
            "It’s new and sort of trending",
            "My cooter",
            "The greatest security tool is the user not being a dumbass.",
            "Yeah maybe this is personal opinion at this point but the vulnerability anxiety is a huge selling point for Microsoft and the antivirus industry and has been very lucrative for those people. I keep important data backed up to physical media, a reimage wouldn't kill me. Get a good adblocker, Use common sense.",
            "Thats what i did",
            "Probably, since that seems to be the only thing keeping it off the vast majority of chips.",
            "And the problem therein is what, exactly?  \nOther then the problems Micro$oft creates just to get you to buy shit, that is?  \nMoorse law slowed way hell down many years ago.  \nThe only reason I would need to upgrade to the bleeding edge at this point, would be to play native 4K at 144Hz with RTX on, or even 8K, which I'm not interested in. Nor am I interested in P cores vs E cores... with thread scheduling issues because a non-trivial tread was run on an E Core.... fabulous!  \nBeing able to maintain 60Hz Vsync @ 1440p on my Large Format Display, has been a perfect place. Also, I'm not made of money, upgrading the GPU is expensive enough, which I've done it many times now.",
            "60hz Vsync @ 1440P says something very different to me. 🤷‍♂️\nSorry... I'm not trying to run 144hz 8K, at max settings with RTX on...\nThats not what average PC gamers do.\nNor can working class gamers afford to replace their perfectly fine hardware everytime Micro$oft says jump. 🤷‍♂️\n\nCan't wait to hear what YOU think are acceptable specs. 🤣",
            "The 6th and 7th gen CPUs are perfectly fine for day-to-day stuff. My whole server cluster runs on i7-7700T CPUs.",
            "They already anno8kxes they will...for like $60/yr for supoort.\n\nThe business side of W10 will still have supoort for like 3 more years.\n\nSo it's a win win for MS at sole point. People move to W11 or pay to stay on 10.\n\nOf course people could move to Linux, but most people can barely install software much less a whole OS.",
            "I'm not on a laptop but I second what you're saying. I'm using a custom ISO on W11 24H2 and it runs just fine. i5-4590 with a GT 630 if you believe that.",
            "What did you do to debloat?",
            "In win 11 I get 2 hours and around 30min  in win 10 I got 5 hours and 30min \n\nAlso win11 has so much more bloatware and background stuff.",
            "Found 12, all were explained by defender controls (bc like i said, i completely disabled it) and game trainers/inventory editors. there's ONE trojan loader im a little concerned about but can't find enough information on it to make a definitive decisions to keep or remove (uixmarketplugin.dll)\n\nThe scan was done with malwarebytes",
            "Ask around and research it just to make sure",
            "I wasn't even talking about me specifically, dough head.",
            "I remember trying to use GIMP about 20 years ago. I couldn't figure out how to do anything,  I have it again and I think I've got a handle on how to do simple things, but honestly, I think that putting up with a few inferior alternatives is worth it. Linux is a far less bloated and versatile platform. I made sure to meticulously plot out my migration so that my work-flow and regular routines seamlessly transitioned over. I wish more people could realize how competitive the user experience is against Microsoft/Apple.",
            "Guys, I so wish it was true. I use Huawei Mate book D15 2021 and I can't use Linux just because it's still doesn't have audio and mic drivers. I spent 2 days looking for a solution, but found only one that enables audio, but everyone on forums saying it's impossible to properly turn on the mic. \nOn my old PC I remember not being able to launch Dota 2 because of something with shaders cache. There was a solution but it's so annoying that almost everything needs troubleshooting. As for now, I can agree to share my personal data with Microsoft to use something that just works out of the box.\nI still need Linux because I'm Data and ML Engineer, now I using WSL 2. I wish to use Linux but I just can't :(",
            "Nothing spectacular about it btw",
            "Looks like a tree in the middle of the ocean",
            "nice",
            "Lol, that may be true but I wouldn't be trusting an unpatched OS with anything important.",
            "even if the user is smart, using an os that no longer gets security updates is a bad idea, there will be unpatched vulnerabilities that can compromise your system that requires 0 user interactions lol",
            "Taking security updates is part of not being a dumbass…",
            "Sure, if you consider the person not being an idiot by actually using an OS that gets security updates. \n\nVista can be hacked into from just simply connecting it to the internet. Same with XP. Plenty of machines are vulnerable when simply having a connection. Windows 10 will be no exception at some point. Only a moron would use an unpatched OS online.",
            "If you connect older versions of Windows to the internet now, you can be hacked in seconds without doing anything. There's so many exploits and breaches that have been found. W10 (and 11) recently patched another severe one.",
            "Its interesting to be able to read comments like this, but also recall a time when simply connecting an XP machine to the internet would result in total compromise in 30 seconds.",
            "common sense will only go so far, once win 10 stops receiving security updates, there will be unpatched vulnerabilities that requires 0 interactions from the user, you’ll get to a point where just connecting to the internet is enough to get your machine compromised",
            "You can't backup your bank balance.\n\nPlus backups can be infected too and you might not know.",
            "It's so funny, when Windows 11 was released people complained about the artificial hardware requirements blocking them from 11, and now people are artificially creating hardware blocks to block 11 themselves 😂😂",
            ">[Micro$oft](https://i.imgur.com/We4Uj04.png)\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Windows10) if you have any questions or concerns.*",
            "If you're running old games, sure your old i7 is fine, but realistically any new CPU you upgrade to would be massive. Even a 12th Gen i3 would still net you way better performance.\n\nYou don't have to spend that much. AMD and Intel both have both have amazing options in either price range you pick.",
            ">[Micro$oft](https://i.imgur.com/We4Uj04.png)\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Windows10) if you have any questions or concerns.*",
            "WinToolkit from Legolash2o, and NTLite",
            "Such as?",
            "It doesn't have more bloatware. You do know Windows 11 is very similar to 10? It was originally going to be called Windows 10X. Very little was changed besides the UI and system requirements.\n\nWindows 11 is optimized more for SSDs and and CPUs that use E and P cores, so basically anything made today should be running 11.",
            "eh i removed it... id rather have something stop working lol but hey that ain't bad... only 12 and only 1 was unknown/unaccounted for..",
            "💀 yeah bye",
            "This is a bit rare of piece of hardware to be honest though, you could try a usb based auto solutions there are very small USB adapters, check compatibility with linux before you buy one if you do, they are quite cheap. This is all assuming you are willing to try again, best of luck regardless.",
            "you're 100% right but sadly people like that think they know better and if they just act \"safely\" online, they won't be compromised.",
            "I don’t get why people are so desperate to not have 11. It’s good",
            "Doesnt matter what games, if his cpu performs good enough for him, he doesn’t NEED to spend ANY money, he could spend money but why should he be forced?",
            "No it would not, at least not enough to be worth the cost of replacing the system at this time.  \nI've already ran these numbers about a billion times on PCmark....  \nMy 6700K @ 4.8Ghz comes in at the 182nd percentile while an i3 12100 come in @ 121st percentile. And is not an unlocked chip. That's not a huge gain on paper, and it'll be even less of one in practice. Along with the expense of both time and money.\n\nWhat exactly qualifies as an \\`Old\\` game?  \nDiablo 4 Maxed out RTX on 60Hz 1440p.  \nAlan Wake 2 Maxed out \"... \"  \nBF 2142 \"...\"  \nDragons Dogma 2 \"...\"  \nBaldur's Gate 3 \"...\" ??\n\nAre they \\`Old\\` games?\n\nI'm not seeing an actual problem with this hardware, and you've yet to address it, other then make claims about 'old game' which are clearly not \\`old\\`.  \nAs long the as the CPU can keep up with Calls from the GPU, it's doing it's job, and doesn't need to be replaced. My use of Vertical Sync rather than blasting out frames I'll never see at max speed for no apparent reason then to heat the room with bragging rights... might have something to do with it.  🤷‍♂️  \nScreen tearing makes me motion sick....",
            "Originally 10 was supposed to be the last Windows version according to them. \n\nM$ always saying one thing then doing another. It's why nobody trusts them. That and they constantly abuse their power.",
            "Sounds like you're infected lol. You have a silly setup. Enable Windows Defender at the very least. Get it back on a hardware firewall.\n\nI hope that email you use on there isn't connected to anything... If it is, then you should log out of it and change the password on another machine.\n\nThis is particularly egregious if that email is used as a recovery for any other accounts, or a form of 2fa.",
            "I mean sure you do you. I upgraded from a 7700k a long time ago and not only did I see improved frame rates, but 1% and 0.1% lows were also a lot better, something that benchmarks don't usually show. This means less stuttering and more stable frame rates. I remember this happening when my 7700k was maxed out, which you generally don't want in gaming, since it increases stuttering.\n\nI can also multitask while gaming without losing performance. This wasn't possible on my old 4 core i7 unless I wouldn't to deal with stuttering and frame rate drops when opening something on my second monitor.\n\nIf you're casual gaming though I guess you can still get by with an older 4 core by lowering the settings, but I remember some games just not running well at all, Starfield, Remnant 2 and Cyberpunk didn't run well on my 7700k. Those games require atleast a 6 core CPU to run well.\n\nAlso, running games at a higher frame rate has a big benefit, less input lag. This is why a lot of people running reports titles prefer a high frame rate. 60fps is too laggy in my opinion. Once you get to 120fps you can instantly feel the difference regardless if you have a high refresh rate monitor or not.",
            ">[M$](https://i.imgur.com/We4Uj04.png)\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Windows10) if you have any questions or concerns.*",
            "because of ONE file? haha no thanks, id rather have the performance... am i saying anyone ELSE should do this? hell no, i can't tell you how many \"and i clicked on this one thing\" stories and nightmare virus removals ive had to do on other peoples systems lol. the other 11 i knew EXACTLY what they were because AV doesn't like anything to be modified or modify anything in memory and thats basically every game trainer and inventory editor in existence. I'm not really worried about a single file over the course of months lol. Anything on here just gonna get scrapped next time i reinstall anyway lol. \n\nMost people only need that much protection bc they click on everything in sight and don't know how to stay away from bad sites and bad proggies and such... I've been running without av/firewall forever since probably win 7 when i really got into gaming. The security hype is only because of the lack of knowledge by the avg user... its why defender was eventually made so no one could turn it off... too many \"I know what im doing\" people who end up with horribly infected computers lol. I'm still not convinced that one supposed trojan was even a trojan... so many of those av scanners mislabel things they can't find any other category for and a lot of others are just so vague you can tell it was like \"hmm somethings not right here but we don't know what so heres a generic label\" lol\n\nThis is reminiscent of dealing with all the old ladies at an old tech job where everything was \"hacked\" even when it was just because they didn't know wtf they were doing haha I called those people the tin foil hat brigade lol. Used to love watching their face when i pointed out it was just because they were hitting the wrong thing..., they'd come in all steaming hot mad too like somehow its the techs fault they were \"hacked\" lolol\n\nI think my fav was when i was doing over the phone support, customer was CONVINCED her gateway was hacked and demanded I shut off her wifi before someone \"got in\". Even asked to make sure we were not using voip through the gateway and that she was not on wifi calling... she was very adamant we were not... so i killed the wifi... call drops... ofc. So i call back, \"well now i have no internet\".... and this is why we need windows defender for most people lol",
            "Lmao this is hilarious and has very jim vibes.\n\nI work in secops."
        ]
    },
    "Why do I still have the option to allow a “deleted” threat?": {
        "title": "Why do I still have the option to allow a “deleted” threat?",
        "score": 4,
        "url": "https://i.redd.it/4b1kav5wo38d1.jpeg",
        "content": "I downloaded some less then official software and I’m 99% sure that I got flagged for a false positive, but that’s not my issue, just how I got here. I removed the item like it said and even deleted the folder that it says it’s in, but I still have the option to allow it and it gets moved to my allowed threats. I guess what I’m asking is, is it already gone and it’s just a minor bug or oversight with windows thinking it’s still there, or is it actually contained on my computer somewhere by windows incase I want to allow it. If the latter is true, where is it contained and how do I actually remove it completely? Thank you 🙏 ",
        "num_comments": 2,
        "comments": [
            "the option is there in case its false positive or you wanna sandbox it\n\nbut in this case it was removed...so sure go ahead and enable removed threat, no issue since its gone :P"
        ]
    },
    "Stopping this app and all background things like this.": {
        "title": "Stopping this app and all background things like this.",
        "score": 6,
        "url": "https://i.redd.it/ervwdsyal08d1.jpeg",
        "content": "I put windows 10 pro on this 3rd machine I built and I “did” disable news notifications ALSO, in CMD “winget remove windows experience pack” \n\nThis news feed thing is running all the time how do I rid it? \n\nAnything else to disable? I want nothing but steam running. ",
        "num_comments": 5,
        "comments": [
            "oh is this the reason I have dozen msedge.exe processes churning away in the background, recently?  (even though I have Startup Boost disabled)\n\nI'm very close to trying Image File Execution Options to completely suppress msedge.exe\n\nbut I don't know what level of pain that will cause, the rest of the OS.\n\n[https://bc-programming.com/blogs/2019/03/taking-control-of-windows-10-with-image-file-execution-options/](https://bc-programming.com/blogs/2019/03/taking-control-of-windows-10-with-image-file-execution-options/)",
            "uninstalling edge webview should delete this 2 frames per year abomination",
            "lol, I mean; I have an iPhone for all my stuff. I want my game pc’s super light & clean and running most minimal things. I’ve noticed those multiple edge browsers running also at times.",
            "Okay, is that an extension of Edge?",
            "nope but it completely dies when the webview is uninstalled"
        ]
    }
}