{
    "Simple questions and Help thread - Month of June": {
        "title": "Simple questions and Help thread - Month of June",
        "score": 0,
        "url": "https://www.reddit.com/r/windows/comments/1d5lf1b/simple_questions_and_help_thread_month_of_june/",
        "content": "Welcome to the monthly Simple questions and Help thread, for questions that don't need their own posts!\n\nBefore making a comment, we recommend you [search your problem on Bing](https://www.bing.com/search?q=Windows+issue) and check if your question is already answered on our [Windows Frequently Asked Questions wiki page](https://www.reddit.com/r/Windows/wiki/faq). This subreddit no longer accepts tech support requests outside of this post, if you are looking for additional assistance try r/TechSupport and r/WindowsHelp.\n\n\nSome examples of questions to ask:\n\n- Is this super cheap Windows key legitimate? (probably not)\n\n- How can I install Windows 11?\n\n- Can you recommend a program to play music?\n\n- How do I get back to the old Sound Control Panel?\n\nSorting by New is recommend and is the default.\n\n----\n\nBe sure to check out the [Windows 11 version 22H2 Launch Megathread](https://www.reddit.com/r/Windows11/comments/xj877b/windows_11_version_22h2_build_22621_launch/) and also the [Windows 11 FAQ](https://www.reddit.com/r/Windows/wiki/faq) posts, they likely have the answers to your Windows 11 questions already!",
        "num_comments": 60,
        "comments": [
            "I have a program that can only be resized by dragging from the bottom, but with me being unable to move the task bar at the bottom in windows 11, I cant resize it. Is there a way around this?",
            "Can't activate Windows after reinstall\n\nI've bought a Samsung 990 Pro SSD and a new Windows 11 Pro key when I first got my G14. After recently finding out that Bitlocker was only using software encryption, I was forced to reinstall the OS again to enable hardware encryption. Now Windows claims it's unable to activate, even after manually typing in my own key because \"it looks like the hardware on this device has changed\" when it definitely hasn't. Now looking at the product key on the bottom of that settings page, it clearly seems to insist on using what seems like the original key that was preinstalled with my G14 which was for the Home edition and it's not letting me replace it with my Pro key due to the error message above.",
            "I've got a US keyboard layout as it's a 65% size, is there a way of mapping Ctrl+<a key> to output \\\\ for instance and Ctrl+shift+<a key> = |\n\n  \nUsing the registry if at all possible. \n\n  \nI've got sharp keys but that looks like it can only do 1 to 1 replacements?",
            "Simple question but.. way back when 3.1 and 95/98 were still in active use. People could use animated GIF for wallpaper and it'd work. Then Microsoft said no more and blocked that with XP I think. I recall hearing claim that animated GIF wallpaper on XP and later would be too demanding on CPU.\n\nToday's computer has enough power to emulate Pentium III and Windows XP yet we still can't use animated GIF or APNG for wallpaper without needing 3rd party program.\n\nWhat was the real reason Microsoft blocked the animated GIF in the first place?  And what would you suggest for animated wallpaper for W11? I want to use 2 different large GIFs (if you're familiar with trippy art from P Robertson, those GIFs!!) and have them stretched out on 2 monitors.",
            "I hope this is the right place to ask this, had a lot of trouble finding a firm answer to this question.\n\nI've been trying to adjust my UAC to always require credentials to be entered, even for Admin accounts. I am trying to avoid KeyStroke Injection and the simple Yes/No prompt required by Admin level accounts seems weak against this. Is this a legitimate concern? And if so, how can I force UAC to always require administrator credentials to be entered?\n\nThank you in advance for any assistance.",
            "I could use some help.\n\nFor some reason after my PC randomly shut down and updated Windows on its own while in the middle of playing a game, my Windows keeps creating these empty Notepad files on my desktop labelled \"log\" with a bunch of numbers after.\n\nIs there a setting I can turn off to prevent this? Its pretty annoying. They get created at random and not after I do anything specific.",
            "I’m not sure if this is a simple question or not because I’m not really educated much in this area. But the wifi option in my laptop has disappeared for two days in a row now, both times I did a network reset which was what the troubleshooter told me to do. The second time it didnt work, so now I’m worried about the potential indications this has for my device as it’s the only one I have and I’m starting college soon.",
            "Don't see anyone elses questions being answered but Imma try anyway since its really simple:\n\nShould I upgrade to windows 11?\n\nBasically since theres about a year left of win 10 support I got a popup about it that told me Im not eligible for win 11 even though the windows settings has said I am since windows 11 started, but I've heard mixed opinions about it so I've been putting it off since win 10 works, but now that we are getting closer to ended support I may just have to upgrade\n\nanyway yea dumb question ik but at least im not making a full post about it",
            "Hello. I want to factory reset Windows 11. But when I click on reset, a key code appears that needs to be typed. The problem is that the first part of the code has a few letters, but letters cannot be typed there, only numbers.\n\nI have two questions:\n\n1 - Why do I need to type this code? Previous Windows did not require any key codes for the reset .\n\n2 - Do I need to skip the small part with letters and enter only the part with numbers, or it is a bug?",
            "I really like the virtual desktop on windows and utilize 2 or 3 at a time. However, the control+windows+arrow key is too much to quickly and easily go back and forth between them.  I have a mouse that has a scroll wheel that I can push both left and right. Is there anyway to make that left and right click (or any of the few side buttons on the mouse) flip me between virtual desktops?",
            "I have a Windows 10 Home key I am going to deactivate on my dual-boot macbook to use on my new custom PC.\n\nOn the new PC, can I fresh install Windows 11 Home and use the 10 key? Or do I have to start with 10, activate, then upgrade to 11?",
            "when do we actually get reviews of the arm snapdragon laptops?",
            "My phone does not allow data to be transfered. This \"do you trust this computer\" pop up window never appears or does not work when I do agree. IPhone 12 mini, does that have something to do with it being a work phone?",
            "Why is my Windows 11 install showing location as: \"Microsoft Data Center Boydton, Herbert Dr, Boydton, VA 23917\" - I live in Canada",
            "Hey all! when I use the window directional snapping keys, Win+[Arrow keys] the windows have defaulted to snapping to the left quarter, middle half, and right quarter. This is changed within the last year it seems. I have until this change been able to snap to the right-half and left-half. Is there a way to get it back or should I just make the switch to Win+Z?",
            "Hello redditors\n\nI have been experiencing issues with many of my drivers. Pretty much any wifi/bluetooth adapters simply don’t work. I have wifi hooked up via my Ethernet port.\n\nI suspect my system is corrupted. How do I go about repairing it? Repair shops are too expensive so I have to be able to do it from home for free.\n\nIs resetting my system a good option? Would my Ethernet ports drivers auto install (k need wifi duh)",
            "I desperatly need help. Everytime i open my pc it blue screens about 1-3 times. I have tried everything but nothing works. My pc is a pre-build.",
            "When choosing an OS for an old device (surface pro 3), is EOL Windows 10 or unsupported Windows 11 a better choice?",
            "Win10 - how do I open a program on startup if said program is one that prompts the admin confirmation menu when you open it? In my experience it just hasn't been opening and I still have to do it manually. I put a shortcut to the exe in my startup folder, and the exe is configured to always open as admin (if it's not opened as admin, it doesn't work correctly). is there some way I can give the program itself specific auto-permissions or something?",
            "why does the first alt-tab pause at the selection tab screen? shouldn't it just go straight to the next tab? these new features are so annoying and stupid.",
            "I installed Windows 11 on a motherboard that had an injected license. As far as I understand, that means that that particular board will always have a licensed install, right?\n\nThe problem is, the install broke during an update (couldn't be repaired) and I re-installed from a Windows 11 USB. Now it's saying that I need to activate Windows, and when I try, it gives me an error that says it can't be activated. I'm getting an 0xc004f213 error code and when I go into slmgr /xpr in the cmd, it says Windows Core Edition, Windows is in Notification mode. When I use PowerShell and enter *wmic path softwarelicensingservice get OA3xOriginalProductKey* I get a blank space beneath it.\n\nWhat's going on with this thing?",
            "Windows 11 File explorer immediately crashes when having more than 1 file selected and right-clicking. Any help is appreciated as I can't find anyone else having this issue online.",
            "How can I prevent my laptop from dimming the display when I unplug the power cord?  I have the power plan set to High Performance and when I click the 'Change advanced power settings' link the only setting I can find under display is 'Turn off display after'  I'm using an HP Envy x360 and Windows 10 Pro 22H2.\n\nThe only other setting I see that might affect the display is 'AMD Graphics Power Settings' but the only thing in there is 'AMD PowerPlay Settings' and that's already set to Maximum Performance for both Plugged In and On Battery.\n\nI forgot to add, I've also already tried the keyboard shortcut for the brightness setting, but it's already at maximum.",
            "I just rebooted my PC and chose to download the windows version via the drive and delete all other files. Now when I came back its telling me I cant activate windows 11 can someone please help me out",
            "Is there a way to make Windows 11 install media on a Windows 10 PC that isn't eligible for an upgrade?",
            "When i enter this DNS address in DNS settings, it doesnt let me save and says \"Can't save DNS settings. Check one or more settings and try again.\" And i tried entering alternate DNS address and checking/unchecking some options. I dont understand much about computers so i need some help.",
            "Why are screenshots in Windows 11 brighter and crisper than the underlying app?  I've tried a few games and Chrome, and for each of them, the screenshots are much easier to read than the program itself.",
            "What does \"Edge is part of the operating system\" mean? I've heard it said many times. People seem to imply that Windows cannot function without Edge installed and running. \n\nI have, however, once again successfully wiped edge off of my machine. Deleted it right out of System32. Windows seems to be fine. So what do people mean when they say \"Edge is part of the operating system\"?",
            "How can I check if my PC has a windows license or if it is just the free trial period?\n\nI’m planning on selling my pc after swapping some parts out. I downloaded windows 10, but it never asked for a windows key. When I go to activation setting it says “Windows is activated with a digital license…” It seems like it is activated, but could this just be the free trial or something? The parts I swapped: CPU, RAM, SSD\n\nI don’t want to sell someone a PC without a license, especially if it just appears like it has one.",
            "There are no CPU requirements mentioned anywhere for DirectX 12 Ultimate. Does the CPU limit the DirectX version running on a system? If so, what are the actual CPU requirements for DirectX 12 Ultimate (feature level 12\\_2)?",
            "I’m about to build a new PC. I’m currently running Windows 10 and still have the install disc for it (and yes, I’m keeping my old optical drive and moving it to the new system). My question is would it be better to install Windows 10 and immediately upgrade to Windows 11, or should I just get a Windows 11 license and install that right off the bat? I’d rather not pay for it if I can just install 10 and upgrade for free. I guess it’s not technically a fresh install, but I would upgrade before installing any other software.",
            "You could try using keyboard shortcuts. For example, windows key + alt + up arrow to move the window to the top of the screen.",
            "You could take a look at powertoys. There are also other similar projects that might be able to help.\n\nIf the project that works is open source, you can take a look at the source code and see how it works. I can't say for sure that you can do it in the registry, but you can likely recreate it.",
            "I could be wrong (I'm on my phone right now so I can't check), but I Believe that there's a UAC strength setting in control panel.",
            "Maybe you should install and run Malewarebytes or the Kaspersky virus removal tool.",
            "Try asking in /r/Antivirus",
            "I had a similar problem with Bluetooth, I just went into device manager, deleted all the Bluetooth stuff, and restarted. The restart reinstalled everything properly. Worst case scenario, deleting the stuff made it worse (or just didn't work), you can download the drivers from your manufacturer.",
            "Stick with Win 10 until you have no other option.",
            "If you have a reason to upgrade (ex. An app only runs on 11), upgrade.\n\nIf you don't have a reason, stick to 10 for as long as possible.",
            "Can you post a picture or screenshot of this screen?",
            "I'm a trackpad user so I could be completely wrong, but if you have a driver/app for your mouse, you might be able to map mouse buttons to keyboard shortcuts.",
            "Everything works just fine when I plug it into a mac",
            "If you're using a VPN, it could be messing with your location.",
            "If you have free disk space (win10 32bit: 16gb; win10 64bit: 32gb; win11: 64gb) I would make another partition on your drive and install windows to it using a USB installation media. If it works, I would go back to your main windows install, delete the partition you just made, expand your main partition to take up the unallocated space, and then reinstall windows. If it doesn't work, you can always delete the temporary windows install and try something else.",
            "What is the error? It should say near the QR code.",
            "I'm probably wrong, but if you're placing it in your user startup folder, try the system startup folder instead.",
            "I'd look at the BIOS to find the product key. It's not always there but it's worth checking.",
            "\"Hi everyone,\n\nI have a couple of questions:\n\n1. Is there a reliable source to buy a legitimate Windows key at a reasonable price?\n2. What are the steps to install Windows 11 on a new PC?\n3. Can anyone recommend a good program for playing music?\n4. How can I access the old Sound Control Panel in the latest Windows update?\n\nThanks in advance for your help!\"",
            "No. In factory reset screen you can't make screenshot.",
            "DPC\\_WATCHDOG\\_VIOLATION",
            "also, i figured out it was bc of my wd discovery ssd memory. But after watchin several videos. I cant update it",
            "I think you meant to post this in the main thread instead of replying to my comment.\n\nAnyway,\n1. Can't help with that one :(\n2. If the computer comes with windows 11, follow the onscreen setup. If the computer has windows 10, follow the onscreen setup, and update to windows 11 from settings. If it runs something else, or nothing at all, use [https://www.microsoft.com/software-download/windows11](http://create windows 11 installation media).\n3. The pre-installed Media Player app should be fine\n4. There's quite a few methods, [so Google it and find one that works the best for you.](http://google.com/search?q=windows+11+old+sound+control+panel) You might also be able to make a shortcut on your desktop to `mmsys.cpl sounds`.\n\nEdit: damn I'm stupid lol I didn't even realize what you did",
            "Do you have a camera or phone to take a picture with?",
            ">[Google it](https://i.imgur.com/AwxNPpN.png)\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/windows) if you have any questions or concerns.*",
            "I'm not showing you my key code. Go away.",
            "Lmao. W mod who made this bot",
            "You can just use a photo editing app (they're usually preinstalled with phones) to cross out the key code.",
            "I just don't have too much time on my hands. I have a life."
        ]
    },
    "[CONCEPT] all the essential start menu components in one click, no distractions.": {
        "title": "[CONCEPT] all the essential start menu components in one click, no distractions.",
        "score": 141,
        "url": "https://i.redd.it/qcv4bskoe08d1.png",
        "content": "",
        "num_comments": 54,
        "comments": [
            "\nFor more designs, concepts and ideas related to Windows, check out r/Windows_Redesign!\n_____\n\n*This submission has NOT been removed. Concept posts are always allowed here as per our community rules.*\n  \n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/windows) if you have any questions or concerns.*",
            "[Looks like the KDE start menu](https://uploads.golmedia.net/uploads/articles/article_media/1228818921709045295gol1.png)",
            "Nice concept, looks pretty and functional.\n\nYou could cram in an advertisement banner, or a few \"sponsored\" programs here and there though.",
            "Microsoft loves distractions. They would never",
            "You can do it with an app called Windhawk.\n\nhttps://preview.redd.it/k71j3sjvz18d1.png?width=1376&format=png&auto=webp&s=6778de13b50b9476cf0113742201997ea5b43b8a",
            "Looks great!",
            "Like in W10, with the all apps list in view. This customization looks nicer tho.",
            "i'd move the search bar to the bottom and make it auto focus on the search bar when u open the start menu. apart from that, actually perfect. functional and pretty. ms should hire u",
            "Beautiful!",
            "so the the windows 10 start menu?",
            "finally, A concept that suits the \"dark\" mode",
            "That's just 10 menu without live tiles. Change the pinned apps out for a set of links and that's basically 7 menu",
            "the concept: w10 start menu",
            "Wallpaper. Now. Please.",
            "Love it, can we fire whoever designs the start menu and get you hired?",
            "Look just like win 10 start menu",
            "Looks good, but how do I give a voice prompt to ask Microsoft JeevesGPT to search online to find a local document I'm looking for?",
            "I really like it",
            "This is just KDE",
            "Great concept, but if you’re aiming for zero distractions, I’d recommend that you remove Solitaire, News and other useless programs off it as well.",
            "My one criticism is that there is too much unused empty space.",
            "That my friend, is fucking neat. Loving it",
            "Isnt that possible with Start11? Not sure what start menus they all offer because its a lot",
            "This makes too much sense, Microsoft hates when things make sense and are logical.",
            "we always come back to the XP layout, it's inevitable",
            "I want thissass i beg you make it into a github app 😭😭",
            "https://preview.redd.it/liebtwd3648d1.png?width=827&format=png&auto=webp&s=7df728e7698db0969858611b673238ace854aef9\n\npretty much the default KDE start menuon linux, which is really nice and distraction free",
            "Not at all a bad thing",
            "OP : \"He does everything I do\"   \nKDE : \"But better\"",
            "[deleted]",
            "damn thats a missed opportunity🔥\ni should've included an ai chatbot instead of the search box as well",
            "> Windhawk\n\nI really like StartAllBack...",
            "Suggest some good mods to go with",
            "Its not looking alike tho",
            "thanks!",
            "it came out a bit too dark thanks to my laptop screen lol",
            "sure check dm",
            "i wish i could man",
            "It's a compliment KDEs menu works really well",
            "[Here's another one](https://i.ytimg.com/vi/JfreWHt_bDY/maxresdefault.jpg)",
            "Don't forget Microsoft Rewards, and a virtual AI-based altar for lord Bill Gates.",
            "Kind of looks like KDE plasma.",
            "StartAllBack is paid, windhawk is open source.",
            "I use these ones:\n\nhttps://preview.redd.it/rdm9ggf7h48d1.png?width=1560&format=png&auto=webp&s=0e70575d534e0f37068fb6e62257edb593fe9dfd",
            "I know, to me, the layout is more important, not the colors. \n\nHowever, I think it's possible to change the colors using that mod.",
            "Would you mind sending me the wallpaper as well",
            "It looks so good",
            "Needs more bing!",
            "Thanks👍🏼",
            "They're here: [https://wallpapers.microsoft.design](https://wallpapers.microsoft.design)",
            "thanks👍",
            "Damn, I should bing it so I learn more about binging from the start menu. I binged more after I started edging. Never stopped edging and binging after that.",
            "Yeah, I love clicking bing news on accident, it's so fun",
            "Truly a microsoft user."
        ]
    },
    "I HATE the direction Windows is going - how to fight it?": {
        "title": "I HATE the direction Windows is going - how to fight it?",
        "score": 118,
        "url": "https://www.reddit.com/r/windows/comments/1dl8oxm/i_hate_the_direction_windows_is_going_how_to/",
        "content": "The ads are bad, the pop ups for anti virus or whatever else are getting worse with each iteration. I keep having to remind myself how to do a backup without signing up for Windows paid online storage system. Settings are harder to find in general. Putting programs like Word and Excel on there that aren’t paid for but are still the .docs first option to open those files, or gaming apps that are pre installed and keep trying to update when i don’t game.\n\nLots of my work equipment connected by network or USB don’t connect well or at all on newer windows when a laptop with Windows 10 connects just fine.\n\nWhat do you do to fight this stuff (besides using a different operating system). I always use open office for word but aside for that, it feels like a losing battle. Eventually windows is going to try to get you to pay monthly to use the operating system or something similar. i can just feel it.\n",
        "num_comments": 229,
        "comments": [
            "You and I really don't matter in the big scheme of things:\n\nhttps://preview.redd.it/aw1bhc13e18d1.png?width=1080&format=pjpg&auto=webp&s=f0f158843155f6f1caf1cb65536683e6455cf484\n\nSo unless enterprise starts to kick up a stink, it won't have that much of an impact\n\n[https://www.kamilfranek.com/microsoft-revenue-breakdown/](https://www.kamilfranek.com/microsoft-revenue-breakdown/)",
            "Microsoft does not pay attention to the opposition. Currently the best way to combat it is to move to Linux. Vote with your wallet, if the number of users drops so much, Microsoft will be interested in doing something that users like.",
            "I got rid of Windows. 11 was the last straw for me.",
            "Switch to macOS or Linux, microsoft clearly doesn't care much for its users anymore :/",
            "Where are you seeing ads within the OS? I’ve heard this complaint many times but I don’t think I’ve ever encountered any. It could just be that I disabled it with a GPO long ago.",
            "I never thought of even considering Mac OS or Ubuntu until MS deployed their recall+copilot. Now I’m actively thinking of getting a MacBook Air and installing Linux on my existing machines and laptops.",
            "Copilot man,\nI don’t like AI stuff,  just want a Computer that i can control",
            "Either use shell programs or move to Linux. Microsoft don't care.",
            "I haven't actually seen any ads in Windows. I hate where Windows is going for different reasons.\n\n1. Terrible UI (Windows 11).\n2. Bad GUI (Windows 11).\n3. Frutiger Aero was abandoned (Windows 8 and up).\n4. Made for people that are under 7 years old and cannot understand all the \"complex\" and \"hard to understand/use\" features (Windows 11).\n\nAnyone can suggest additions to this list.",
            "You fight it by abandoning it.\n\nYour question is moronic in itself. \"I HATE how the new mcdonalds hamburger tastes, how do I fight it?\". Yeah by not going there.",
            "I literally never have any of these issues.  No pop ups, settings are a few keystrokes away every time, USB works just fine, and I get free Office 365 from work. \n\nI dunno, OP.  Git gud, I guess.\n\nLearn shortcuts, learn how to disable stuff you don't like, it's easy peasy. \n\nI use Mac, Windows and Linux every day.  I find they all have their pros and cons, but Windows is easily the only OS that lets me do *everything* with no fuss.\n\nMy wife loves Apple and god love her, I guess, but I don't find it useful for anything but web browsing and light productivity tasks. I suppose if I were more active in video/audio editing or art I'd be more impressed.",
            "None of what the OP is describing has ever happened on  any of our PCs. We use Windows 10/11 24/7. It always works.",
            "I'm using Windows for 30+ years, but genuinely have no idea what you are talking about...",
            "Lol\n\nWindows is better than its ever been. If you don't want to use Office, uninstall it. \n\nThe fact you can't remember how to do your own backups is not Microsoft's fault.\n\nEverything that works on Windows 10 will work on Windows 11, I've had no compatibility issues.",
            "See. I don't know about others, but I STRONGLY agree with what you just said. \n\nThe best part is, you can't really do anything much about it. Switch to Linux or MacOS? Yeah, but you can't exactly live without a Windows VM just in case. That's how reliant on Windows we are.",
            "You used to be able to skip every other version of Windows, ie. ME, Vista, and 8. I think Microsoft hated that and is now forcing everyone to upgrade to 11 to receive support/updates.",
            "Exact same fuckery is going on with MacOS too, so I feel your pain.  ProxMox, FreeBSD, or TrueNAS - maybe even Ubuntu are in my future.",
            "I fought this by ditching Windows and installing Linux... it was a scary move, I been using windows since 3.1 came out...  it's so far doing everything  I need.. I hope my luck keeps up...",
            "![gif](giphy|5YuhLwDgrgtRVwI7OY|downsized)\n\nI think you know what to do.",
            "You’re tired of windows ? You’re tired of all these laptops with poor battery life, engine spinning fans and bulky or bad quality build ? Linux seems tempting but you’re afraid of it or afraid of support ?\n\n Go buy yourself a MacBook with Apple chips. Actual useful working features, private, no ads, consistent UX, insane battery life, lightning fast, light, beautiful, excellent build quality. No jet engine sounds and as much supported as windows.",
            "WTF are people talking about with the ads. I constantly hear about them in explorer, on the lock screen… literally everywhere in the OS, but I’ve been using Windows 11 for over a year and have not seen a single one. WTF are you all doing to be confronted with ads? I’ve asked this multiple times but have never received a straight answer. I don’t get it.",
            "You fight it by not using Windows. It's a losing battle because most people can't (or won't) fight it with you.",
            "**Join the Linux community!** The more people switch from Windows, the sooner Microsoft will recognize their flaws and return to making a truly decent operating system.",
            "Where are you guys getting ads and antivirus popups? I have yet to see either of these in 20+ years.",
            "this sounds like a you problem. i have w11, good knowledge in IT as i have been working in the field for 20+ years so in theory i know what i am doing, and have none of these issues, especially the ads",
            "How to fight it? lmao\n\nBorn yesterday? I needed the chuckle, thanks\n\nOn a serious note if you troll youtube on how to get rid of windows \"features\", you might find some help.\n\nOr you could become king of the universe and buy microsoft.",
            "Linux :)",
            "Return to a usable Start menu - Classic Start Menu or StartAllBack\n\nDisable spying and annoyances - O&O ShutUp10++ \n\nDon't use Edge",
            "[https://www.oo-software.com/en/shutup10](https://www.oo-software.com/en/shutup10) can resolve a lot of your issues.",
            "You are not alone, my wild guess is that all the computer Enthusiastics are",
            "Leave it. I’m on windows 10 and hope that win12 is a decent upgrade. But I’m not too worried, I’m super comfortable using Linux and if I really have to, macOS. Hopefully won’t come to that. Win10 until 2030!!",
            "Lol what are you talking about its been garbage for a minute.",
            "It's up to you. You have to weigh the pros and cons with each OS. Mac I'm sure is good, but you need to fork out $$$ to buy a Mac. You could tolerate Windows 11(or a prior release) with its pros and cons. Could get a chrome book. Just use an android tablet. Could switch to Linux Mint or Fedora (free😉) . I run Win 11 on one PC that I game on, Fedora on my laptop with Libre office or Google docs. The use case is also important to consider the best OS for your application. The best part is you have lots of options.",
            "I've used Windows 11 for ages and have never seen an ad.",
            "How can you fight it? Get gud. Install an Enterprise version of Windows and pick an EU country for your location. If you insist on using a consumer version of Windows (that includes Pro) MS is gonna treat you like one.",
            "I think this is sounding a whole lot more like \"I have a me problem with Windows\" than anything else.\n\nThe ads aren't bad, I don't see em myself. I have an adblock on my network to kill all that stuff, and even when I'm places I don't, it's not bad.\n\nBackups are incredibly easy to do, and if you need to remind yourself how to do that, it's, again, a you problem. The sky is the limit on backup options, and it's never required you to get a Microsoft backup option.\n\nSettings aren't hard to find. They're in \"Settings\". And then when you need to find one specific one, you use the search bar. It's incredibly easy to find.\n\nOperating systems come with applications not everyone wants on them. A lot of people do want them though, so if you run into that situation where you don't want the program natively installed, then just uninstall it. It's not the end of the world; it's like saying \"I moved into a house and the types of faucets that come with houses are so annoying\"... No sir, you just don't like them, that's fine.\n\nCan't speak for your work equipment, but if it's something specific to your job, chances are your job just hasn't updated the drives, that's a your job problem, not a Microsoft problem; your job should be creating drivers that are compatible with the current supported operating systems.",
            "With your feet…if you catch my drift",
            "Organize. Get people together who feel the same,and maybe know people who work at Microsoft that you can talk to. \n\nOthers say use Linux, I say organize people to develop a Linux flavor that works & feels EXACTLY like the Windows you want. One that strikes exactly the perfect balance between user friendly and configurable. ",
            "https://preview.redd.it/jo1i8grz628d1.png?width=1280&format=pjpg&auto=webp&s=84d84b52a94f29aec09ced03ce23bdaecb4092a3",
            "Unfortunately, there is no way to fight it, this is the natural evolution of Windows. \n\nYou're probably from a time when Windows was different, maybe Win 7 or XP, those days are long gone and not coming back. \n\nI hate to say it but as it stands you either move to Linux or get with the program. Microsoft won't change or listen because it controls 70% of the market and kids are already used to the new trend.",
            "Either install the corporate version of Windows, or abandon Windows and install a Linux distro.",
            "Two solutions may be to install the corporate version of Windows, or abandon Windows and install a Linux distro.",
            "Use NextDNS and opt out Microsoft ads. No more ads. You are welcome.",
            "I have windows 11 and i have no pop ups or ads. After i installed windows  it took maybe 5 minutes to disable all the crap. There are tons of premade checklists online with step by step instructions on how to adjust everything to make it non intrusive. It's a very solid OS when you set it up right.",
            "The reality is that you can't \"fight\" this stuff, as in you have no way to force a meaningful change. The only way to make that happen would be for significant amount of users to jump ship to another OS, but: a) as things are right now you won't convince enough people to do that, b) even if you could convince enough people it's questionable would Microsoft even care considering these days their money is in cloud services not OS sales.\n\nSo what's left? Well, the one thing that you still have is ability to change things for *yourself*. As in, you can decide which you find more bearable: dealing with what Microsoft is doing with Windows, or dealing with having to learn new OS/find new apps to replace ones you've been using on Windows.",
            "We all go back to win7.",
            "I fought with this by not allowing myself to buy or pay anything Microsoft related any more. Microsoft cannot go into my home (exception is work laptop). I am not using anything Microsoft related in personal life. I think there are better alternatives. I have originally switched to Linux several years ago and I was satisfied. Only because I have some spare cash and wanted to tried MacOS, I bought Mac which I am using now. I appretiate the consitency, but since I see how Apple is driven now, I am really think to switch back to Linux, when I am gonna buy new laptop in following years. I think there is no other way to fight Microsoft, Apple or Google. Just to stop using their services.",
            "Just leave. Bye!",
            "Microsoft are definitely losing the plot. The amount of crap features they are wasting time shoehorning into Windows (Recall anyone?) while ignoring blindingly obvious UI issues (the Control Panel / Settings  mess that has been dragging on for years now, the craptacular Start menu, various annoyances with File Explorer, just for a few examples).\n\nI just want someone to go back to basics and write a nice solid OS that does a few things really well, not feel like I'm fighting a losing battle for control of my personal data every time I log in.\n\nClearly all the big companies really care about is finding new and exciting ways to data mine the hell out of consumers and sell it to the NSA and marketing companies.",
            "Sorry bud, you can't stop it them, but you can stop using them. Give Linux or macOS a try. From personal experience, Linux is great, Arch user btw.",
            "I agree with many of the people here, that you can change operating system, but I do know some tricks to make it much more tolerable. \n\nMy main trick is that every time a configure a new Windows computer, I wipe the factory shipped version of the OS, and install a fresh install of windows behind as blocking DNS like Ad Guard or NextDNS. \n\nDoing so basically cuts out all the crap that makes Windows insufferable. \n\nAfter that, I make sure to use always use an ad blocking DNS on the system. This ensures that the computer remains ad free, and that it has the ability to send less telemetry. \n\nThis makes an insufferable OS sufferable :) ",
            "Don’t use it.",
            "Don't use Windows. There are alternatives if you don't like Windows or the direction MS are taking it. Vote with your wallet is a thing, or rather, vote with your user data.",
            "Guess what, there is a barcode scanner at my workplace that didn't work with Windows 10. Even it's so buggy on 7.",
            "1. I haven't seen a single ad on windows 11 except the windows 360 in the home section in settings, but it is so small it is hardly noticable most of the time\n\n\n2. Antivirus popups? If you mean those notifications saying how many threats it detected this week then you can turn those off via settings and the pop up also gives an options to see fewer of those.\n\n\n3. I actually find the windows 11 settings way easier to go through and find what I need. And I can always use copilot to enable/disable a setting for me if I needed it.\n\n\nYou seem to be having a hard time with Windows 11. That's not a bad thing since everyone has their good OS and bad OS. You could stick to Windows 10 and wait for 12 to see if that is a better OS to use or use Linux.",
            "I don't know what ads you are referring to. You might be mistaking recommendations, suggestions or notifications for ads, all of which can be turned off in settings. Yeah, some settings are cumbersome to find but a quick search will point you in the right direction. You should also take some time to patiently go through all of the settings and familiarize yourself with any hidden ones. \n\nYou can try a bloat remover like Bulk Crap Uninstaller to remove apps and programs that you don't use, like the gaming ones that are bothering you. There are other programs and tweaks out there to remove bloat from Windows 11.  \n\nYou can use LibreOffice instead of Office if you are having issues but really, all you have to do is a simple search on Reddit and you would be able to use Office without any issues. \n\nAs far as your USB connections are concerned, it sounds like some type of hardware issue. Maybe update the drivers for those devices. \n\nYou can bypass Windows forcing you to log into an account. Again, searching Reddit or the web is your friend for helping you with this. \n\nAs far as Microsoft moving towards a subscription based service to use Windows, I wouldn't be too concerned about it. I am sure there will be ways to bypass that too. \n\nOther than that, you would have to use another operating system but be prepared to have issues there too.",
            "> Settings are harder to find in general\n\nThis is one of the most stupefying things I hear people say about Windows. In what reality is the absolute monster of a chaotic mess of Control Panel better than what we have now..?\n\n> Putting programs like Word and Excel on there that aren’t paid for but are still the .docs first option to open those files\n\nSo, let me get this straight - you get the option to open these files using the free, online versions of paid-for programs... and that's a *bad* thing?\n\n> gaming apps that are pre installed and keep trying to update when i don’t game\n\nAre you sure about that? Last I checked these were only placeholders in the Start menu that aren't even installed.\n\nBut even if: right-click -> Uninstall.\n\nOr, if you're doing a fresh install, select \"International\" as your Region. Apparently you won't get anything like that then.\n\n> Lots of my work equipment connected by network or USB don’t connect well or at all on newer windows when a laptop with Windows 10 connects just fine.\n\nHave you tried updating your hardware drivers?\n\n> Eventually windows is going to try to get you to pay monthly to use the operating system or something similar\n\nWell... Yeah. That's how capitalism works. If you have the perfect product that everyone has, you've effectively killed your business, because without constant, infinite growth of your income, your shareholders are sad. So you HAVE TO figure out new and new ways of increasing income. Literally every listed company will either go under or eventually face the exact same problem.\n\nAnd, other than switching to Linux (or, lol, fixing capitalism) there's nothing we can do about it.",
            "Move to Linux. That's the only way to do something about it. Microsoft doesn't care and it's users don't care as you can see in this thread, going as far as pretending it doesn't exist.",
            "I dont get any ads in w11. maybe it's a setting somewhere.",
            "Sounds like a skill issue. I have none of these issues.",
            "The amount of illinformed and straight up unfounded defenses for Microsoft in this comment section is odd at best, if not simply worrying.\n\nMicrosoft is in a \"too big to fail\" position. They make money hand over fist from virtually every company worth over a few million in revenue and don't give a fuck about consumers for anything beyond data mining or a wallet to sell SaaS to. \n\nWindows 10 was free. Windows 11 was free. Windows 12 will be free. The 100 dollar one-time charge they get from an oem license is a token charge at best. They don't make money from the OS, they make money from the shit but crucial software they lease to corporations, and the subscriptions they sell to users, and the OS is merely a platform to shovel that shit down your throat. As long as it works, is cheaper and more accessible than apple, and doesn't literally document and store plain text passwords, they're not going to lose an ounce of the market shade that matters to them.\n\nTolerating ads in the OS simply because they're first party, or extremely invasive privacy violations because \"i have nothing to hide\", or crazy self installing bloatware that slows down your machine (guess what the fuck makwarr is) because your machine is fast enough is literally the sole reason they keep doing this shit. It takes a collective \"no\" for them to hear (see recall). They will hear, but not if people defend that bullshit like it's their cherished puppy.",
            "What you mean, fight? And, BTW, you probably aren't fair and honest There are no ads in Windows. Why are you lying?",
            "The only way to fight is by doing what you said not to mention, get off Windows. I imagine the anti virus ads are from prebuilts/laptops, not MS.",
            "I stay on 8.1 and just tweak the start menu. not sure what im gonna do when programs wont work anymore",
            "You can try using the Win11Debloat scripts:  \n[https://github.com/Raphire/Win11Debloat](https://github.com/Raphire/Win11Debloat)",
            "I use Windows 11 Enterprise on one of my computers and it is tolerable. But I don't do Windows updates. I have a good antivirus software and have had no issues",
            "Kinda weird that LinkedIn is close to Windows on revenue. I bet that it is highly more profitable to them, considering an operating system development costs",
            "This. Even Mac OS is more tolerable and not littered with spam.",
            "Fully agree.\n\nWord of advice, don’t jump the fence if you don’t know or don’t have proper alternatives for your use cases.",
            "> if the number of users drops\n\nThat will literally never happen, because Microsoft survives off millions of corporate customers rather than home customers. The majority of companies are happy with Windows and have no desire to move to Linux.",
            "+1 for this. Unless the OP has a specific need for a software suite thats MS specific, Linux is an obvious alternative. Voting with your wallet is the only thing corporations will care about. Linux is def different and will have a bit of a learning curve but so is jumping from Win10 to 11. Gaming can be a little hit or miss sometimes (but overall very doable) but productivity on Linux is very mature. Theres no reason not to give it a try other than not wanting to have to learn something new.",
            "\"vote with your wallet\" is so stupid because nobody does that! a few people not buying windows licenses does nothing when businesses and manufacturers still do, and people still fucking use it.\n\nThere's no \"vote with your wallet\" here, that's not just how this works.",
            "The best thing to do now is to show Microsoft how bad their decision and they will fix that to bring back user and get back their profit. I am personally a Windows lover, but since MS started to add ads to Windows, I am thinking again about my choice and switching to Linux.",
            "The problem is, the number of users will never drop nearly enough because of all the enterprises and professionals that are stuck with windows.",
            "I'd agree, but the problem ultimately is that Linux is just not a real viable alternative for most desktop users, so that isn't going to happen in sufficient numbers to make Microsoft give a damn. Too much important software just doesn't have real Linux equivalents. Gimp does not equal Photoshop. Excel does not have any real alternative for a heavy user (and most users, like accountants, will never give up on Excel as they are too used to it - Microsoft can't even update or improve it much because the business users all scream and have tantrums when something changes).\n\nLinux also falls victim to having too many distros, with too many differences and developers pulling in different directions. That limits it to hardcore users in my opinion. The average user would be lost with Linux. Yes, they could install it - the install for most big distros is pretty painless these days - but if something goes wrong, then it is difficult to fix because every version or distro is slightly different.\n\nLinux desktop is probably always going to be stuck as a plaything for tech nerds. I was a software dev and currently setup and run Linux servers for my partner's business, and even I can't find enthusiasm for using Linux as a desktop alternative for any length of time. Joe average is never going to do it...",
            "> if the number of users drops so much, Microsoft will be interested in doing something that users like.\n\n\nThey actually may not unless they are enterprise users. Consumer grade laptop Windows may be higher in sales or numbers but business workstations and enterprise usage is what brings Microsoft the most revenue. Unless those enterprise folks speak up, nothing will change despite folks like OP voicing their concerns over this.\n\n\nThe only way here is either you switch to a Linux Desktop or the open source project [ReactOS](https://reactos.org/) evolves enough that it becomes a fully fledged binary compatible Windows alternative.",
            "Linux is crap",
            "The worst way is also to move to Linux.",
            "Here, loll\n\nhttps://preview.redd.it/nb48jlim9z7d1.jpeg?width=861&format=pjpg&auto=webp&s=a8b0c2b64642b3650b431b20a297f93e87dc0c58",
            "By definition, many of the responses you’ve got to your comment are legitimate examples of ads.\n\nMost of the counter-arguments here amount to “If it’s not intrusive, it’s not an ad.”\n\nThe argument’s not about whether or not the ads are intrusive.  The argument is about whether or not there are ads in the OS.\n\nPersonally, the ads don’t bother me if they’re not intrusive, but let’s face it: the examples people have mentioned are not wrong.",
            "If you're on 11, just open settings and you'll be greeted by three ads for Microsoft services.",
            "This. What is OP talking about?",
            "me too, bro hacked or got some apps installed.",
            "Hater are talking about ads where there's none. You want to know which, I'll tell you cause I had this discussion with a hater.\n\nYou know the shutdown button? Sometime, a bubble appear that tell you about OneDrive that could help you backup your file. Ads.\n\nThen, there's security center that have a message inside of it to use defender.\n\nThe, there's a little message in settings to tell you about cloud storage...\n\nThe worst one is edge, Microsoft does make it hard to switch I agree. At the same time, it make it harder for virus to take controle of that too but that's another thing. It true that Microsoft does try real hard to get you to switch to edge.\n\nThe on the web, when you get in hotmail or bing, a banner appear to try edge. Funny thing is Google does that everything I visit Google while on edge or Firefox but no one blame them.\n\nIt's just hater. Probably the same that worry about privacy and how much Microsoft mine your personal data (they don't take any personal data) while being on an android phone with Facebook and tiktok installed.",
            "If you want Linux, consider Linux Mint. It's a much better drop-in replacement for Windows - and it avoids some of the shitty things that Ubuntu has been doing recently.\n\n^overriding ^system ^commands ^to ^promote ^their ^own ^proprietary ^package ^manager",
            "not a windows fan but please get ur facts straight, microsoft never deployed copilot and it will only ever be available on computers with a processing that includes an npu that can hit 40tops which is currently only a few laptops with a qualcom chip",
            "It’s not really that simple, it’s more like saying “all good as of late is terrible because the companies that control all of the worlds food are cutting costs at every corner.”\n\nI mean sure you could go to your local farmers market and find exactly what you need every time you need to eat, but it’s incredibly inconvenient, and not realistic for a lot of people. (Using Linux.) \n\nOr you could hire a private chef to make all of your food for you, and make sure he uses the best ingredients (using Mac) and pay the premium for it.\n\nThere are other options and it’s entirely possible, but no amount of boycotting is going to hurt Microsoft. Everyone that ever sees this post ever could boycott windows for the rest of our lives, and they wouldn’t even notice. Let alone change anything.",
            "Agreed! Your outrage and uproar is only as strong as your convictions. If you're not willing to leave Windows, and MS knows that, then it doesnt matter what you do.",
            "I'm getting ready to build a new desktop pc, which is gonna cost a pretty hefty penny. Building for photo/video editing and gaming alike, working from home requires MS Teams. All our stuff is Apple nowadays except for my desktop, which is Windows.\n\nI don't really see any viable option than Windows if I want everything the way I'm used to, within reason. Not extremely keen on getting a high end Apple computer really. I like the sense of DIY that comes with windows/pc. I add another hard drive or some ram when I want. Can't do that with Apple, and I'm unsure of whether any Linux iteration can run all the programs and games that I'm used to?",
            "This is happened only for Linux fans",
            "Well good for you.",
            "Me too, I’m so confused by these complaints.",
            "Just because you haven't had comparability issues doesn't mean there aren't any. Win11 bricks tons of software and drivers for whatever dumb reason. Not even compatability modes fix some of the stuff I need for work.",
            "I just got the notification on my pc a few days ago that windows 10 will not receive more updates soon. Unfortunately my pc doesn’t support windows 11 so I’m screwed for now. Hopefully windows doesn’t break ",
            "👌👌",
            "I've never seen ads on Win 11, either.",
            "Are you using Enterprise or Education? I think those versions have less ads.",
            "Microsoft does not care about home users. They're all about business and Azure (I consider Copilot kinda part of Azure) and azure is unrelated to Windows in this context, and business users are never going to use Linux, it's just not going to happen. I use Ubuntu at home so even though I'm a baby Linux user, I get it. But as an O365 admin, I'll always have a job.",
            "Yeah, of that 12% I would gather not even half of them give a crap as much as us enthusiasts\n\nhttps://preview.redd.it/xnd2gofde18d1.png?width=1080&format=pjpg&auto=webp&s=f0d4a4d064d0533e8cd148fea5cf021390651a55",
            "Bruh, sure.",
            "Linux is crap, all is crap related to Linux, in 2024 font rendering is too bad",
            "1. Don't shout.\n\n2. No, MS won't \"return to making a truly decent OS\" because they're already doing that.\n\n3. Whatever marketing you attribute to MS greed is, in reality, the result of shareholder greed. As a listed company, if you don't want to suicide your company you MUST show infinite growth of income.",
            "Oh, and what is with the so many background processes that run automatically these days whether you ever use them or not - like XBox, Teams, etc. I don't want all this shit...can't they at least have it inactive until it is first used or you opt in?",
            "Thanks for being like the one response with a helpful answer.",
            "That's exactly what all the ads hater are saying. For them, all of these are ads. But google doing the same isn't a problem. It's like all the antitrust because edge is bundle with the os while android come with chrome and Gmail, iPhone with Apple stuff and Mac osx with safari and such.. Why it's not antitrust for them? It shouldn't be because you are the giant with the most market share, what's good for one person is good for another one. I'm pretty sure that shit about internet explorer/edge bundle changed nothing. People that didn't knew about them didn't start using those cause they didn't knew about them. Those that did where those that were already downloading it and installing it.",
            "What are you talking about, Windows 11 is one big advertisement; Both for their various supplimentary subscription services (gamepass, one drive, office 365, etc) & third party platforms. How do you think they justify providing the software for free? They're not just eating the lost licensing revenue, they're making it up elsewhere. The end-user isnt the primary focus anymore; You're the product now. \n\nTo be clear, theres nothing inherently wrong with that but lets not pretend it isnt happening LoL\n\nhttps://preview.redd.it/rbc2bpp8808d1.png?width=861&format=png&auto=webp&s=cda3ceb3a14f358ec9d5195a946d2cd31d248ab5",
            "probably win11 and tweak it",
            "The above comment appears to have a link to a tool or script that can “debloat” Windows. Use caution when running tools like these, as they are often aggressive and make unsupported changes to your computer. These changes can cause other issues with your computer, such as programs no longer functioning properly, unexpected error messages appearing, updates not being able to install, crashing your start menu and taskbar, and other stability issues.\n\nBefore running any of these tools, back up your data and create a system image backup in case something goes wrong. You should also carefully read the documentation and reviews of the debloat tools and understand what they do and how to undo them if needed. Also, test the tool on a virtual machine or a spare device before applying it to your main system.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/windows) if you have any questions or concerns.*",
            "It's small things, but I do appreciate how small and hidden the Safari ads are compared to the Edge ads on major upgrades",
            "“Even Mac OS”? Having used both and being originally a Windows fan, I just feel windows keeps stagnating with layers and layers of duplicate functions, UIs, ads, complexity and other quirks. Now I find Mac to be the superior OS.",
            "I'll throw in that although MS' enterprise customers use Windows because their buying from MS, a lot, if not most servers actually run a server version of some Linux distro due to the simplicity, low resource consumption, and better management capabilites.",
            "> Linux is def different and will have a bit of a learning curve but so is jumping from Win10 to 11\n\nWhat? The difference between learning Linux after Windows is VASTLY different and more difficult than switching to Win 11 from Win 10.",
            "Then vote with your vote. Certain German municipalities have tried to switch to Linux, but reverted when a new mayor appears and is lobbied by Microsoft.",
            "To a degree, it still matters to Microsoft. Windows 10 and 11 phone home often enough that they know exactly how many installs are active compared to the licenses sold to manufacturers. It's why they started \"threatening\" Windows 10 users to buy a new PC or upgrade to 11 if it was supported because they would be vulnerable when 10 goes EOL.  \nThey're not admitting to it, but all this telemetry and tracking they do is probably leading them to enough revenue for it to be worth expanding it (which is one reason Recall seems like a privacy and PR train wreck waiting to happen) so the less people actively using Windows will become quite apparent to them.",
            "Why? It may be a little harder than Windows, but learning to use something else for a short time just to move away from the trackers and all thats is a worthy decision.",
            "What? You make no sense.",
            "No, the worst way is to keep using windows",
            "None of these just pop-up out of nowhere. You have to press on specific stuff to get these pop-up.",
            "Most of them aren't ads, just options in the browser, backup suggestion, and then we have Microsoft 365 or xbox are the few ones I can consider ads, moreover Microsoft store has a program you can pay to get your app displayed on home page or recommendations this is pretty much how Google Play store work.",
            "Especially when you get the new useless \"Home\" menu in the Settings app.",
            "[deleted]",
            "[removed]",
            "Those aren’t ads those are optional features of the operating system you haven’t turned on",
            "THANK YOU! I was looking at that and downloaded the installer , your suggestion made my decision of installing that more concrete!",
            "Conviction and integrity are important, but these aren't the tools to solve this specific problem.\n\nMicrosoft's main Windows customers are enterprise, with hundreds and thousands of installs. Their customers are also laptop makers who want a \"complete solution\" for regular people who don't give it a second thought. Regular people don't choose their OS. They just want to get a computer to do their stuff and aren't enamored by the idea of computers. Microsoft makes Windows just bad enough that it goes under the threshold of these people caring and that's what keeps them at viable scale. People who are annoyed enough by Windows to leave, are just collateral damage.\n\nThe tools to solve this is to raise a stink in a way that people who can hurt them can understand: regulators. investors. IT managers. big customers. Convince them of the truth that Windows is rotting and will continue to unless they do something. Convince them that they should be using something else, if you can imagine something else they could realistically use. Support people who are making good alternatives.",
            "Lack of coherence, lack of meaningful updates in areas that need a desperate update (talking more about visuals), lack of meaningful implementations (seriously, so many things, especially on the visual side, could’ve been implemented in a far more beautiful way, a far more performant and far more efficient too).\n\nJust an example? WinRE, which all they did was change the ICOs inside its DLL, leaving the entire DirectUI interface completely untouched when, at the same time, in just a few months a community managed to do an entire redo of that interface and making it look like WinUI, without any additional software, just by changing the code that was already there. If a community of enthusiast did it in months without any documentation or source code, why Microsoft can’t do that in two years (and sadly, there are things like these that are far far worse…)?",
            "Same as this guy and I use Home. I'm fully updated (at least I think) and I don't see anything. Settings too is clean",
            "That excuse is getting old. Most people could easily switch to Linux Mint—it's simple, similar to Windows 7+, and packed with modern features.\n\nForget about downloading printer drivers or buying Microsoft Office 365. Linux Mint handles printer drivers automatically and supports OpenOffice or LibreOffice.\n\nSure, some people need proprietary software, but even that can often be managed with virtualization. Most home users can switch to Linux Mint without major issues. The worry about software compatibility is outdated.\n\nIf you need proprietary software, push developers to support Linux. I'm committed to this change—I've already switched my city hall, elderly care facilities, and local schools to Linux Mint. They're more efficient now, and we're reducing e-waste by keeping older machines running longer.\n\nAdvancing tech is great, but we also need to extend the life of our older hardware!",
            "Windows was ruined by capitalism in a nutshell.",
            "Just install a different browser?",
            "uBlock Origin",
            "I agree. I meant not only Linux, but even Mac OS is better than windows. And it's also written by a greedy corporation unlike Linux.\n\nThere were  times (xp, 7) when Windows was a lot more user friendly system. Still clunky but passable.",
            "I moved my 70-year old mother to Linux Mint a month ago and she hasn't called me ONCE for computer related problems - and she's not very computer literate.\n\nWhen she was running windows, she was calling all the time about every little thing and everything was a fucking nightmare.\n\nMy only regret is I didn't do this 5 years ago.",
            "Have you tried Linux recently? If the answer is no then its moot debating the learning curve if you have no point of reference. My point stands; Its def different but the learning curve isnt as steep as people make it out to be. Theres some basic command line syntax, some new file extentions and some unique folder structures you have to get familiar with but there are new things, functionality and folder management in Windows 11 you'd have to learn too. You pretend that Windows 11 is so easy and intuative but that is belied by the fact that half the posts on this sub-reddit are from people asking where certain feature are, how to access burried settings or how XYZ thing works. This is doubly true if you're someone who wants to disable all the nonsense telemetry its using out of the box which requires third party hackery. If you dont wanna spend the time or if its not for you, thats fine, but lets not pretend we're still working with the Linux of 2001 and that the average user couldnt learn to function just fine in a basic debian-based distro like Ubuntu. Break out of your walled garden; I believe in you.",
            "Everyone says this ignoring the fact you just point and click. Thats it. Windows and Linux are only vastly different in ways 95% of users wouldn't notice as they just point and click.",
            "In Switzerland, several public institutions have already tried to switch to Linux/FOSS only, but this has failed almost everywhere. \nHowever, it must be mentioned that this was not due to Linux or FOSS in general, quite the opposite, but rather due to a lack of know-how and catastrophic project management.",
            "there's nothing you or I could do, you'd have to get virtually every business, school, computer manufacturer, and government to switch to something else.\n\nyou can't do that.",
            "still though, most normal people are gonna still be using Windows and businesses aren't gonna switch either.\n\nRecall was already a disaster, it's not \"waiting to happen\" if it's already happening.",
            "My home PC I usually use for gaming on Steam and GoG. I also listen to music and watch cinema. I know that the last two use cases won’t be a problem, but how about AAA gaming and fresh GPU and chipset drivers and such? Would the switch be worth under such circumstances?..",
            "Because font rendering is shit, apps support is shit, adobe does not work, unstable, update break everything sometime.... simple Linux is not for desktop home users, if you want switch from Windows than go for MacOS.",
            "MS is constantly advertising their products all the time and whatever action you do in the OS, is quite easy to inadvertely trigger them. Even in Edge, sometimes I have random new tabs created by MS sending me to their msn page or some xbox game. It gets super annoying. I took the time to cancel many of them through options and register, so my OS doesn't look like a tabloid from UK.",
            "They shouldn't exist at all, and they do exist in areas where other functionality resides so \"not clicking\" isn't really a solution.",
            "\"It only happens when you use the OS\" lol",
            "This isn't true. They're putting this stuff in all sorts of places. Start menu search results. Settings app. Notification center. Lock screen. File explorer.\n\nAnd **there's an occasional full-screen prompt they have every couple of months** (maybe from specific Windows updates and it looks a bit like the Windows first-time-setup wizard) that asks for you to set your Windows settings, which among other things prompts you to get Office 365 or whatever.\n\nAnd they put a little **orange dot in places where they shouldn't be that makes it seem something about the OS needs your attention**, but it's just an ad for OneDrive. It won't go away until you click it and it keeps coming back even if you dismiss it. One of those places is the profile button in the start menu.\n\nYour OS shouldn't be passive-aggressively nagging you about subscriptions.",
            "Wha? How does that make it less worse? To play devils advocate, On Linux you can install KDE Plasma or literally any other Linux desktop environment, it’s a much less confusing layout, you get no ads and even have the ability to opt out of ALL telemetry no questions asked. You can reinstall the OS by just reinstalling the package if it breaks (on Arch at least for sure) you aren’t babied, and at no point do you have to go through 15 pages of “can we please take all or some of your data pretty pweeeeeaaase” screens or advertised to constantly, you dont have to connect to WiFi and make an account, there’s no ads on the setup screen, the Lock Screen, the start menu, the settings page and zero preinstalled apps. It’s so easy to use nowadays it’s unbelievable that it’s all free. Many of these on windows take time to remove or are incredibly annoying. I can’t count the amount of times it’s reinstalled Edge or showed me a pop up or new stupid preinstalled crap I don’t care about. Then there’s removing the bloat, and disabling telemetry is impossible because it’s closed source and honestly, anything could be in it. You just don’t know. You have no control. It’s like your computer is not yours.\n\nI love windows but I also love Linux, and windows is going so downhill. It’s obvious they’ve reduced their funding for it. I can’t even say I get better performance gaming anymore for sure when Linux even with a compatibility layer gets more fps, it’s hit or miss at worst by a few fps. It’s sad. I gotta say, Linux truly takes the power to the users. Not only can I choose what I have installed, have zero telemetry, ads, better performance, customisation and user choice, I can even fix something on my own terms if it’s ever broken.",
            "Bullshit, I see popups all the time, and  adds  in the searchbar as  well  despite turning them off  in  the past.",
            "They aren't ads, they're just things that Microsoft or other companies that pay Microsoft put there in the hopes that you'll click them and give them your money.",
            "it's very questionable since they talk about a backup in their cloud and they only give 5 GB free and when you approach 5 GB and even from the start you are bombarded with notifications to buy more.",
            "Right now I'm using Win11 both on my corp device (corp account) and on my private device (local account only) and cannot recall ads, backup issues, USB troubles or whatever the OP mentioned.\n\nIt just works.",
            "What would you call that?   What would you call app suggestions on a digital storefront?   What would you call a popup about additional services you can sign up for? \n\nIt’s by definition advertising.  It’s less obtrusive than some ads we are stuck dealing with, but it’s still an ad.",
            "Hi, your submission has been removed for violating our [community rules](https://www.reddit.com/r/Windows/about/rules/):\n\n* **[Rule 5](https://www.reddit.com/r/Windows/wiki/rules#wiki_rule_5._be_civil_and_do_not_troll_others)** - Personal attacks, bigotry, fighting words, inappropriate behavior and comments that insult or demean a specific user or group of users are not allowed. This includes death threats and wishing harm to others.\n\nDo not engage in blatant trolling or flaming.\n\n---\n\nIf you have any questions, feel free to [send us a message](https://www.reddit.com/message/compose?to=%2Fr%2FWindows&subject=Post%20removal)!",
            "That require payment to use*",
            "Advertisement:\n\nThe act or process of advertising something. \n\nAdvertising:\n\nTo present (something or oneself) to the public in a way that is intended to attract customers\n\nBy definition you are wrong. They are definitely ads.",
            "I know that. If you read properly, I'm stating what the haters are saying. There's no ads in windows.",
            "Perfect! I've been daily driving Linux Mint for a few months now, and genuinely the only issue I've had is that I own a couple games on EA, and the launcher didn't work properly.\n\nThere is definitely a workaround for it, but I've not looked too much into it because I wasn't too bothered about those games specifically. And it's only an issue for games that were bought directly through EA - playing EA games on Steam works just fine, even if they use the EA launcher.\n\nETA: you can run the entire OS off a USB before installing (it should be a pretty clear option when you boot from the USB.)\n\nAlso, make sure to look up how to check your Windows license key, if/when you're planning on deleting Windows entirely. There are ways of activating it without a key, but it might be best to make a note of your license key before you delete the OS entirely.",
            "\"why doesn't Microsoft do things in janky ways that break everything but can be done quickly\"\n\nWell little student, maybe they have to do thing properly so it doesn't break every enterprise product and is able to be iterated on for the future.\n\nIf you think you can replicate winUI with little code I have a bridge to sell you, you have no idea what you're talking about.",
            "I agree, however linux makes it difficult to switch. Microsoft is seen as convenient and a lot of people are very familiar with the workflow of windows. Switching to linux changes things and there's a learning to curve.\n\nAlso, check the link below (timestamped at 15:32). Luke explains the core issue of linux really well. Like... if it's bothersome to somebody as tech-savy as luke, imagine your average joe out there.\n\n[https://youtu.be/vmZtB18qR6I?si=aoicYHiT8\\_ddWV64&t=932](https://youtu.be/vmZtB18qR6I?si=aoicYHiT8_ddWV64&t=932)",
            "Most people aren't enthusiasts and as Apple has shown they are happy to pay a premium for things that just work. Great you enjoy the power side of things, most people don't give a shit",
            "I think they're talking about the fact that Windows will give you an unskippable full-screen prompt telling you to use OneDrive, Edge, Office and whatnot on some updates, and you can't just close it, you have to click through it.\n\nIt used to be the case there was a big \"X\" that would just get rid of it, but now, you have to go through \"No\", \"Nope\", \"Really no\" to get rid of it.",
            "What she does on her computer, just browses the internet? :)",
            "It totally depends on the Linux distro you use. Debian, Ubuntu based distros work out of the box. You don't need to set up anything more than you would with any Microsoft or Apple operating system. The claim that Linux has a steeper learning curve than Windows has been around since the 90s, but in 2024 it doesn't even come close to being true. \nThe better question here is if YOU have tried Linux recently.",
            "Indeed. Management of such a transition need to be completed by someone both skilled at large-scale deployments and knowledgeable of the minutae of using it. Additionally, KDE Plasma (the sole GUI that would feel comparable to Windows Explorer) in my opinion only became suitable in the latter stages of Plasma 5.",
            "Do you have any idea how “voting” works",
            "Speak for yourself:\n\n1.  In my secondary school, I was the sole reason they didn't remove Firefox, considering that everyone else appeared satisfied using Chrome (not Chromium, so relevant to the discussion).\n1.  I'm joining the RAF as a \"Cyberspace Specialist\" (I know, pretentious name) so I'm gonna try my damned best to get them to use some less crappy solutions than what they're using now.",
            "Isn't it still an insider preview? If it is already in general release, I need to start contacting my clients to turn that off because most of them usually don't get in touch with me until after they get socially engineered or something breaks.",
            "> AAA gaming\n\nDepends on the games you play. I imagine most of the upcoming games won't be an issue since Steam Deck is popular so it's in developer's interest to make sure their games run via Proton (tweaking of settings might still be required), but games with kernel level anti-cheat *might* be an issue depending on AC in question and developer attitude. You can check general game compatibility/tweaks needed on https://www.protondb.com/ (applies to Steam games, for out-of-Steam games you'd need to look into Lutris and Heroic Launcher), and anti-cheat compatibility on https://areweanticheatyet.com/\n\n> fresh GPU and chipset drivers and such?\n\nAMD stuff is generally plug-and-play. NVIDIA drivers have historically been a bit more of a struggle (still usable, but often more work to get first running), but it sounds like very recently things improved a lot. Control software (Experience etc.) is Windows-only AFAIK, although some of the functionality is probably possible to replicate via other apps, you'd need to ask around. It's various third party peripherals that are most likely to be problem, since hardware producers usually don't give a damn, and there is no guarantee there is a community made solution for that.",
            "I literally game on Linux and even dropped my drive in a 7950x/7900xt build when the GPUs dropped. Works fine since days one.",
            "That’s odd, not even once have I had an ad or Edge tab pop up on its own.",
            "Haha \"how dare Microsoft advertise Microsoft products on a Microsoft OS??\"\n\nApple doesn't do this! Oh wait, they do.\n\nIf linux had the market share they would do it too",
            "You can always not click. It's always an option and it doesn't force you to get the product. There's always a way to dismiss it.",
            "It doesn't stop you from doing anything, it doesn't interrupt anything. In this screenshot, many are from software that you have to actively click on them and run. You don't get any office prompt to register unless you click on office (and you have a trial version which is normal to ask for licence, have nothing to do with Windows and always was like that). I guess you could click on Norton or McAfee that often come bundle in pc and says there's ads for these also since they ask for licence after the trials?\n\nSamething with OneDrive, until you click on them, you won't get any of these prompt.\n\nThe only one in that screenshot that you might see, cause it's not always there, is the one in the start menu that prevent absolutely nothing. It doesnt hide a feature, doesn't stop you from doing what you want and it's a reminder that a built-in feature isn't enable, a free one. Since I use a Microsoft account, I never see this. Neither I see the office one since I have a valid licence on my account.\n\nI guess Apple is better? I get ads in the os for cloud file saving subscription, apple tv which has nothing to do with my computer, and time machine. And there's more but I don't recall. Oh and in iTunes, there's no ads? There's a lot.\n\nIf these are ads, they exist in every os even Linux, and it's been in nearly all os for the last 20 years if not more. There was things like that in xp. It's nothing new, it's not pulling random ads from an api. It's showing you either feature that are disable that you can activate for free or telling you that a software that is installed is running on a trial licence and not a registered one; something all software do since software shareware exist. It's not ads, it's information.\n\nYou are just proving my points and the one of many others",
            "Isn't that literally an ad?",
            "You just described ads lol…",
            "I forgot to mention copilot pro, but other than that what's an ad? Illuminate me, maybe I didn't catch something that for me is normal and it's behavior is an \"ad\", but throwing down votes, proof the point of someone saying these people are haters, you hate ads on windows, but you really fall in love with Google photos promoting \"Google one\" subscription or whatever it's called?",
            "And I would add that they're not very generous with free storage, they only give 5 GB, it was already 15 GB about ten years ago, Terabox give 1 TB although I don't know if it's very safe to put our data on there and what they do with it.",
            "A feature of the operating system doesn’t need additional customers. You already (presumably) bought it\n\nYou not using that feature saves Microsoft money, doesn’t cost them.",
            "I’ve been daily drinking mint since 17.1 and have very few complaints, funnily enough, one thing I did notice is that open source software works better rather than worse when you switch.  This makes me think that MS and Apple would break competing software to make it look bad.",
            "Never realised that modifying/updating your own product is the jankiest way to update your own product.\n\nActually though, modifying the existing product in this way *is* the way to break as little things as possible, because you don’t modify the underlying code that matters, but only the appearance of it.\n\nIf you think you can’t replicate WinUI with *Microsoft’s own tools*, then I have to tell you that you’re simply… delusional. This is just a beta, i repeat, even done only by editing an existing resource file without any source code, and it already looks far better than anything Microsoft has done. Is it a bit janky now? Of course it is, it’s being worked on by some people on a thing that doesn’t even have documentation. Yet, it looks miles better than what Microsoft did.\n\nhttps://media.discordapp.net/attachments/1080264228247719977/1253722168391630930/2024-06-21_01-16-53.mp4?ex=66778c01&is=66763a81&hm=d50be66aa1af7051411f9c18714d30f4d3ac231c6c63d780be9b0cf88b1ed3f6&\n\nThe WinRE environment is exactly the same as the current one, just the appearance changes. In this way, you don’t break any compatibility, since all the code that matters is completely intact.",
            "I’m sorry, but anyone who thinks Linus and Luke are competent based on their Linux challenge is seriously mistaken. I had no issues doing what they struggled with. Their video unfairly attacked Linux users and blamed the OS for being overly complicated. \n\nFact: You don’t need to use the command line if you don’t want to. I ran the same distributions they did and can confirm they didn’t follow the wiki properly. Linus deleted his environment because of a bad script he copied, and Luke? He’s just a backseat gamer with a premium streaming service that I can't believe people pay for. I tried it for a month and it was a joke.\n\nSwitching to Linux isn’t hard. I’ve helped elderly folks, middle-aged people, and kids transition smoothly, with no more issues than they had on Windows. Linus Tech Tips videos are NOT proof that Linux is difficult for home users. Sure, there are challenges with gaming and proprietary software, but otherwise, Linux is an easy OS to use.\n\n**Seriously try it for yourself and tell me that it’s extremely hard.**",
            "Fair enough, I hate that shit too.",
            "Scanning, printing, writing, email, netbank, image processing.. So yeah, not super heavy duty stuff, but enough to have issues with Windows. And then there's the privacy and telemetry part of it, which was what really drove her away.",
            "As a Windows and Mac user, and as someone preferring the latter - I still do not know which one to get. Is it Ubuntu, or Elementary OS, or Linux Mint, or Solus Budgie. I want to install something that is as close to Mac as possible and get up and running within a day.",
            "Agreed. I switched a laptop of mine that started being too weak for Windows to Linux Mint, and I haven't had much of a learning curve. Anything I don't know how to do (which has been about 5 times so far) I just google, and that's it.",
            "It's only for ARM PCs, which nobody buys anyway.",
            "That release has been \"put on hold\" for now.",
            "Thank you so much for the detailed response and shedding a lot of light on this matter! Appreciate your time.\n\nGlad to hear that AMD is plug and play for the most part, as that’s what I am running these days. Not sure how 5950x with its 16 cores and 32 threads would work, is the scheduler up to the task to make the most out of it? Windows 10 struggle with such setup a bit, perhaps Linux would be more advanced/better optimized for higher core counts? I will do further research. Just wouldn’t want to park cores to make things work, at least Windows 10 does try to load them up (though unevenly), but still better than disabling half of the CPU for stability. I felt it was a good long-term choice for a CPU, especially playing at high resolutions, so it’s nice if I can take advantage of its raw power at least once in a while.",
            "Don't post are we anticheat. They literally list single player games as borked with punkbuster and even native games as well.",
            "If a Linux distro did that, people would instantly move to another distro and their reputation as a company would be ruined.   \nLinux companies make money with corporate solutions, not by spoiling open source code with ads for regular users.",
            "You clearly have no idea how the Linux ecosystem works lol. Linux is just a kernel and honestly, I'd be impressed by the creativity required to make effective kernel level ads lmao. \n\n'Linux' in the sense of an OS is far too decentralized to effectively advertise, and the community (that builds the stuff, mind you) is so against that mind of bullshit they'd turn to an alternative for whatever software injected ads in a heartbeat. If a certain desktop environment, say GNOME for example, started putting actual ads (again, enabled by default and difficult/unsupported to remove) it would would be swapped out by 80% of users overnight.",
            "you can also not click on youtube ads, but they're still ads, so your argument isn't valid",
            "found the  microsoft share holder,  go away.",
            "When's the last time you ran through the OOBE for windows? 3 full screen ads. OneDrive, Office suite, and game pass.\n\nOpening the damn start menu in win 10 gives you ads.\n\nAlso, you're acting like 90% of ads aren't just info. Just because it's first party software doesn't mean it isn't an ad.",
            "Yeah I think that's the joke",
            "Thats the joke",
            "Game pass, Microsoft 365, the apps in the start menu like LinkedIn or Spotify, and the Games for you. They are all ads. Even if it is not something you pay for outright it is still an ad for a service that was not part of the system itself...",
            "There's nothing in that definition about costs. My echo is constantly pushing other features to me when I didn't ask for them. It's the most annoying thing about the whole device. Those are definitely advertisements for other features regardless if they're from the same company or even if they're free. \n\nAnd if you think then pushing one drive isn't about money my Sweet Sweet Summer Child lol",
            "Yay they made some buttons and janky animations how cool!\n\nNow if you want to know what a professional UI framework looks like install WinUI gallery from the microsoft store which shows EVERY tool that WinUI has and then maybe you'll understand why they couldn't build janky shit to support modern applications.",
            "Nobody said they're competent, but they are tech savy and know more than average joe out there. Now imagine if luke and linus are incompetent, how are others going to feel going into linux? They'll pass.\n\nLinus deleted the enviroment because he did what every average joe would - clicked yes. He was installing through software manager on pop\\_os and got a warning that he's trying to install steam. Average joe will not know what he's trying to do, he will just press yes because \"if i press yes things usually get installed\". Adding a link with timestamp (10:06): [https://youtu.be/0506yDSgU7M?si=7WZwJAQzKd2frPgM&t=606](https://youtu.be/0506yDSgU7M?si=7WZwJAQzKd2frPgM&t=606)\n\nLuke takes care of floatplane and afaik it's just a platform for people that want to communicate with linus/luke/dan and has library of behind the scenes videos.\n\nThe people you helped probably barely touch the OS itself because most of the time is spent inside web browser (which looks exactly the same on all devices) or steam. I'm going to assume if there was a problem you solved it for them to set it up so ofcourse there was no friction point that they could run into.\n\nAnd yes, I agree that linux these days is very usable for average joe. Until they run into a problem and have to fix it themselves. Then you have the problem that luke pointed out in the video I linked in my first comment.\n\nI personally enjoy watching videos of people trying linux for the first time. Here's one of them. He ran into a problem because his gpu was not picked up and couldn't change refresh rate and resolution. Troubleshooting took him about 90 minutes (timestamped at 13:01).\n\n[https://youtu.be/8WkcLwXCFJQ?si=vYyySiOOPm3-cohz&t=781](https://youtu.be/8WkcLwXCFJQ?si=vYyySiOOPm3-cohz&t=781)\n\nThings these days have to **just work** out of the box. Microsoft provides that because most people are on one OS and they're used to it. Many things on linux work out of the box too, but winning people over is a huge challenge.",
            "I can recommend either [Debian Stable](https://cdimage.debian.org/debian-cd/current-live/amd64/iso-hybrid). MX Linux (based on Debian) or Linux Mint (based on Ubuntu). \nElementary OS was a bit laggy for me and crashed frequently, which is why I can't recommend it as a daily driver.\n\nWhich distro you choose shouldn't make too much difference. The bigger difference will be which desktop environment you choose. Since you prefer Mac, I recommend a GNOME desktop environment, whereby you can then set up a \"Mac alike\" docking panel with the [Dash to Dock](https://extensions.gnome.org/extension/307/dash-to-dock/).\n\nHowever, if you really like the Elementary OS interface, you can just use the [Pantheon](https://wiki.archlinux.org/title/Pantheon). Desktop Environment and install it on your Operating System of your choice. \nIts also no problem to use several desktop environments on one OS, you can choose every time you log in. \n\nPersonally, I have been using Debian for years and have never had any major problems with it, recently I switched from GNOME to the KDE desktop, because it has a bit more configuration options and is more technical. However, if you simply want an \"Mac alike\" interface, GNOME is a great choice.",
            "Glad I was of any help. I'm afraid scheduler stuff is a bit out of my knowledge range, but perhaps asking on /r/linuxquestions or /r/linux4noobs might get the answers you need.\n\nAnd if you decide to give it a try doing a dual-boot setup is probably the way to go. To poke and prod around in an environment you won't be afraid to break or reset, and to figure out what you can carry over, and what you need to replace.",
            "Yeah dude teach me how Linux works, I clearly know nothing.\n\nYou're right, people would swap distros because the only ones using it right now know how to do that BUT IF they had the market share that Windows does they would not give a crap if 1% of their users left because of some ads, that's my whole point but you didn't read it.\n\nLinux enthusiasts are a tiny minority of the PC world, most people that use computers don't know shit about computers and just want to use it.",
            "YouTube ads stop what you are doing in the middle of what you are doing for paid ads from partner to show product. These are not interrupting what you are Doin. It's not popping while you are playing a game, navigating internet and it's not selling you anything. It's suggesting gesture built-in in the software that you might not know exist. They are all free and have subscription tier. It's clearly not the samething.\n\nAlso, I can't dismiss YouTube ads unless the timer allows it. These are clearly not the same, it doesn't stop you from doing anything nor interrupt you. Next thing, I guess office telling you you're licence isn't activated will be an ads next. We know, Microsoft is evil while all the others are God's.",
            "Exactly, these are all incentives that point towards something that will make them money.   Ad does not mean an ad from Pepsi or a travel agency loll.",
            "You said customers, you’re already the customer. They don’t need you to enable a feature you already paid for. Microsoft don’t do it except because it is useful to more people than it isn’t. \n\nWhere do you draw the line. Let’s disable every feature in windows and not advertise any of it in case someone thinks they don’t need it.\n\nWordpad: gone\nCalculator: gone\nClock: gone\nFile explorer: gone\n\nLet’s just disable everything and make it unusable.\n\nTimes have changed, those features are advertised because they are useful and save people’s time and data. And because even although it would be mighty useful to many, many people if they were enabled automatically they need positive consent to be enabled. \n\nThis is 2024. If you don’t want to use a modern operating system there are alternatives that are hacked to bits and barely work. \n\nAlso it’s not constant, every time you get one of those notifications you can disable it from appearing again.",
            "Microsoft has done nothing about it and has the exact same interface since 2012, poorly adapted for 10 and 11. In months, again, enthusiasts have done much more than what Microsoft has done in the past years, using Microsoft’s own files, tools, and programming language, without modifying the underlying codex\n\nNow, if you want to know what a professional UI framework looks like, go and learn about the Windows theming engine, DirectUI etc. oh wait I was forgetting, your “professional UI framework” is so professional that is far less modular than previous UI frameworks, doesn’t have a proper designer for development, and consumes much more system resources for little nothing. \n\nGo and actually see how Windows works before talking.",
            "They are literally selling you stuff. Look at the screenshots.",
            "You keep mentioning money. It's got nothing to do with it. Look you're not bothered by these advertisements, other people are. You can't conceive of that so you're bending definitions to fit your own narrative. I didn't ask to be pushed any other features when I just wanted to shut down my computer or anything else. They're advertisements by definition period.\n\n\"Alexa what time is it: \n\nThe time is 5:08 oh by the way, I'm going to read five paragraphs of me pushing things to you while you try to look for peace and quiet in your own house. \n\nIt's advertising.",
            "That first sentence is all I need to know, you never used it and you never followed the progress, you're just assuming \"Microsoft lazy and bad\" and being a troll.\n\nAt least research things before spewing out bullshit.\n\nHave a nice day.",
            "First the screenshot is someone opening everything that have these \"ads\" and combining then. The office telling you to register? It's not an ads, you have a trial version installed and it's prompting you to register it. You know like any trial / shareware?\n\nThe there's the OneDrive one telling you it exist and to use it to backup stuff.\n\nItd all built-in feature that could be enabled and except office, are all free. Yes. You can also subscribe. But it's clearly not the same as having a ads in your start menu for a Toyota rav 4 and such. And also far from the YouTube ads that stop you from doing anything.",
            "You said customers. You implied money. \n\nThe vast majority of people couldn’t give a shit about those ‘ads’ or find them useful.\n\nThose complaining are the tiny minority",
            "If you have to explain that something is not an ad, then it is an ad. I know a non-ad when I see it.",
            "Win11 is built around generating additional revenue; Thats the way they designed most of the feature set and why its so cheap. The whole system is an advertisement meant to shuffle you to the door of other paid services once they have you locked within their ecosystem. Back in the day, you use to buy a \"feature complete\" operating system but keys would run $100+. Now you can buy keys for sub-$10, if not free via an upgrade; Do you think it just got cheaper for them to produce the software? No, they just have other ways of recouping the lost licensing revenue. Thats where these in-app ads come in for OneDrive, Office 365 or third party tools like Antivirus.\n\nWindows 11 is Microsoft's tacit acknowledgement that the user is no longer their main revenue stream and therefor not their primary focus; You're the product now.\n\nThat all being said, theres nothing wrong with that, you do you; Just acknowledge thats whats happening and move on."
        ]
    },
    "I think it will give someone a heart attack": {
        "title": "I think it will give someone a heart attack",
        "score": 43,
        "url": "https://www.reddit.com/r/windows/comments/1dldss0/i_think_it_will_give_someone_a_heart_attack/",
        "content": "https://preview.redd.it/p2vnnu2jiz7d1.png?width=3840&format=png&auto=webp&s=2431eb8c1432c9c7315c57021602dd69fa9d3629\n\n",
        "num_comments": 3,
        "comments": [
            "That QR code. lol",
            "Bababooey",
            "^(it's offcenter)"
        ]
    },
    "There is not running away from Nvidia": {
        "title": "There is not running away from Nvidia",
        "score": 3,
        "url": "https://www.reddit.com/r/windows/comments/1dltbac/there_is_not_running_away_from_nvidia/",
        "content": "So the early benchmarks are out with the new Snapdragon PCs. Unfortunately, none can offer a great gaming experience. Reviewers desn't show where the bottleneck is but, rumors suggest that we're going to see Snapdragon Elites paring with RTX cards. ARM chips can easily replace the CPU, but not the discrete GPU. The same applies to Apple M series.",
        "num_comments": 3,
        "comments": [
            "I don‘t think anyone expected integrated graphics to beat a dedicated gpu, no matter if intel or arm.. the thermals alone make it entirely unrealistic unless you maybe compare the bottom barrel NV mobile chips with the highest end integrated graphics, but even there i doubt that sustained loads will offer comparable performance to something on a card with a hefty cooler.",
            "The power efficiency and lightness of ARM paired with an RTX card for GPU intensive tasks with an easy toggle? Seems like a dream.",
            "i think the idea is that these arent really catering to gamers."
        ]
    }
}