{
    "[Daily Discussion] Brainstorming- June 21, 2024": {
        "title": "[Daily Discussion] Brainstorming- June 21, 2024",
        "score": 3,
        "url": "https://www.reddit.com/r/writing/comments/1dl3gg5/daily_discussion_brainstorming_june_21_2024/",
        "content": "\\*\\*Welcome to our daily discussion thread!\\*\\*     \n\n&#x200B;\n\nWeekly schedule:\n\n&#x200B;\n\nMonday: Writer’s Block and Motivation\n\n&#x200B;\n\nTuesday: Brainstorming\n\n&#x200B;\n\nWednesday: General Discussion\n\n&#x200B;\n\nThursday: Writer’s Block and Motivation\n\n&#x200B;\n\n\\*\\*Friday: Brainstorming\\*\\*\n\n&#x200B;\n\nSaturday: First Page Feedback\n\n&#x200B;\n\nSunday: Writing Tools, Software, and Hardware\n\n&#x200B;\n\n\\\\---\n\n&#x200B;\n\nStuck on a plot point? Need advice about a character? Not sure what to do next? Just want to chat with someone about your project? This thread is for brainstorming and project development.\n\n&#x200B;\n\nYou may also use this thread for regular general discussion and sharing!\n\n&#x200B;\n\n\\\\---\n\n&#x200B;\n\n\\[FAQ\\]([https://www.reddit.com/r/writing/wiki/faq](https://www.reddit.com/r/writing/wiki/faq)) \\\\-- Questions asked frequently \n\n&#x200B;\n\n\\[Wiki Index\\]([https://www.reddit.com/r/writing/wiki/index](https://www.reddit.com/r/writing/wiki/index)) \\\\-- Ever-evolving and woefully under-curated, but we'll fix that some day      \n\n&#x200B;\n\nYou can find our posting guidelines in the sidebar or the \\[wiki.\\]([https://www.reddit.com/r/writing/wiki/rules](https://www.reddit.com/r/writing/wiki/rules))",
        "num_comments": 39,
        "comments": [
            "Perfect day for brainstorming. I have a book I just started writing (never publish, just personal short-ish stories) and I'm also looking for recommendations. Tried making a post, but apparently the auto-mod said they don't like it, and to list it here.\n\nI haven't read any *current* books in quite a long time, and I'm currently trying to get some inspiration of how to structure things a bit more clearly and eloquently.\n\nI'm curious of 1) which \"older\" author is your favorite as far as their writing style, 2) favorite \"newer\" author, 3) a good book or series that you find to be very well written.\n\nIt drives me *insane* when a book feels like it's written for a.... different audience. I grew up on books written by Edgar Rice Burroughs, Louis L'Amour, C.S. Lewis while also stumbling across Nora Roberts more recently.\n\nI like SciFi and Fantasy, and I'm wanting to branch into more adult books to see how things are done in books these days. I've written plenty of adult content for others, but never cared for the ones I attempted. They seem like they are childish in a way; inexperienced with a fantastical (though wildly impractical or unrealistic) idea of what is happening. \n\nI'm not old, I just hate moderate to piss poor effort in writing quality. Takes me completely out of the world I'm trying to get into.",
            "I struggle with names and titles. Do any of you have resources you use to help with that?",
            "How could I wrote someone who's pretending to be someone else, a good person who's funny, likeable, the person who they've always wanted to be etc when they're actually someone who's deeply calculative and a good liar.\nThey see themselves as the person who they pretend to be but deep down they know that they aren't, they ideally want someone who would accept them for who they are.\nI'm really thinking about how to show this kind of character, for example, their thoughts being extremely to the point and shrewd while their speech is extremely long and comedic.\nAny ideas?",
            "Dialogue or summary, which is the best? I am struggling with this dilemma. The situation is this: A secondary character will reveal some lore of the world and the political situation. However, I can't choose between a good long dialogue or a much quicker analytical summary. Any Advice?\n\nThis lore is relevant to the story",
            "FRIENDS-TO-ENEMIES-TO-LOVERS\n\nHow soon should I introduce the fact that childhood friends turned enemies are actually fated to be lovers?\n\nFor context, (werewolf novel) WMC was brainwashed into a revolution as a young child, and was subsequently taken into hiding with her future LI. They grew up as friends in hiding, LI eventually finds out she was the “leader” of the revolution, immediately hates her. Later they find out they are mated, he ends up rejecting her and takes off for years. She ends up proving her loyalty to the wolf-King and is given a pardon and is informed the Moon Goddess is now going to repair the rejected bond rather than give her a new mate. Now LI is back and they haven’t seen each other since the bond was fixed, but I have to bring them back together soon for a mission.\n\nI’m on Chapter 16, bond was fixed in Chapter 12-ish, after some heated arguments between WMC and LI. Should I just bite the bullet and do it in this chapter? It feels like too much to put in just a couple of chapters 😅",
            "Was going to put this in its own post because it's a rather long question, but got a warning to put it here when I added the title, so sorry in advanced for how long this is. I wrote the post before already, so I'll just put it here I suppose.\n\nI am writing a cultivation novel and would like some help figuring out what items would be necessary to bring a person back to life in my story. The character who's going to be bringing this person back to life is a peasant who's hoping to raise a martial master from his grave and make them mentor him. He is, of course, an idiot, if that's relevant, but I need him to successfully perform this task.   \n  \nThis is relevant because he likely wouldn't have access to any crazy artifacts that you might see an established cultivator struggle to obtain. It's possible for him to stumble across some sort of part or egg or something of a legendary beast by chance, because I don't want it to be super easy to raise the dead in this world, but he needs to manage it in the beginning of the story. I don't want to have too many details beforehand about him obtaining those items because this resurrection takes place at the very beginning of the story and the plot can't get properly started unless the story begins with him in the cemetery performing said ritual. Him going through a bunch of hardship in the beginning that he likely wouldn't survive in his state would sadly be way too awkward to fit into the exposition.\n\nDoes anybody know some items that could be used for this ritual, or any items he could stumble across by rare (yet convenient, lol) chance? Usually there would be some big arc building up to a revival in cultivation stories, but the whole point of this is that the protagonist, desperate for a mentor in the beginning of the story, resorts to raising the dead, only to revive the wrong person and have to deal with the annoying person he accidentally brought back instead. I'm open to having somebody pulling the strings behind the scenes that gave him these items, but ultimately my reason for asking this is because I have no idea what kinds of items would usually be necessary for this in a cultivation story or how they would be used.",
            "What did i miss ?",
            "Not sure where this would go, so apologies if this belongs in a different thread, but...Does anyone know if there's a database for all the writing/publishing resources? Like one place where authors can see things like resources for promoting your book, or resources for creating ads to sell your book, etc?",
            "Is there such a thing as a mystery writer's wiki or database where one can look up certain details? For example something such as how much of a certain substance would it take to kill a person? Looking for book contents and I feel googling it would put me on some sort of watch list.",
            "please share your honest reviews: [https://www.wattpad.com/1454249894-my-fantasy-boyfriend-chapter-1-wish](https://www.wattpad.com/1454249894-my-fantasy-boyfriend-chapter-1-wish)\n\n  \nmy first writing",
            "I've been working on a story for a good couple years. It's about a teenager named Nico who gets thrown out for being gay and having to figure out how to survive in the real world without being ready for it. It's also a deep dive into mental health and a real look into what it's like to struggle with it. It's a heavy story and it throws you headfirst into it from the start as I liked the idea of starting at the peak of the central conflict and going from there. The story is first-person and told through Nico's eyes for most of it. The way I have it planned out is due to the events of chapters 1 and 2 (I don't wish to share it publicly right now as it's incredibly dark and definitely requires trigger warnings.) Nico ends up at his friend Charlie's house and falls asleep by the end of chapter 2. I did this for a few reasons as chapter 3 is a series of memories told through him dreaming to explain how him and his mom got to where they end up by the start of the story, as well as explaining that she's kinda always been like that and only gotten worse unfortunately. It also is used because chapter 4 switches POVs to Charlie's as he has to go get what is left of Nico's stuff before the mom just outright gets rid of it. \n\nI have an idea of how I want to communicate it because switching in third-person is one thing but I know it's way harder in first-person. I was just wondering if this is a good way to do this as I've never done it before. At the end of chapter 2 before Nico falls asleep, Charlie shows him to his room and they talk. Something along the lines of:\n\n\"This is your room. If you need anything, I'll be right across the hall. The worst is over, I promise.\" \n\nAnd then Charlie closes the door and leaves Nico to his own devices. \n\nMy idea for starting chapter 4 is to write that scene again, but through the eyes of Charlie. So instead of Nico describing him, it'd be Charlie describing Nico. And then to show that it's not Nico's POV, when the door closes, we follow Charlie rather than stay with Nico like we did at the end of chapter 2. The point of why we go to Charlie's POV, rather than stay in Nico's is that when he goes to get Nico's stuff, him and the mom get into it. And after all that she's done from the first three chapters, I wanted to give a scene early on where someone finally tells her off and gets away with it as like a reward, if that makes sense. It also makes sense story wise because when she dies, I want her to be long gone because I want Nico's reaction to feel real. Especially with how destroyed their relationship is and how out of nowhere it's supposed to be.\n\nDefinitely want to know what y'all think. I know switching POVs in FP isn't usually advised but it has a purpose in my story and I just wanna make sure I get it right. Thanks for reading :)",
            "So I had this shower thought: Why do SciFi/Fantasy book writers, think that \"bigger is better\" (compensating much)? I kind of miss the old days of like Pratchett (Discworld) or Asimov (Foundation, or more general all the robot stories). These were \"normal\" (ca. 80k wordcount) books, that tell cool stories without much fluff. Riordian, Lewis, Leguin, they all managed to create compelling worlds without getting into 300k territory. \n\nIt even would let you explore other themes, subgenres, styles within your books. Look at Discworld, you get to experience the same world through so many lenses. A far better exploration (because like in real-life, everyone sees the world different). And as I said, you could make a book a romantic novel, the other a thriller, and so on.\n\nBonus: You actually get to finish your books much quicker (looking at your Martin) and with less stress (I think Sanderson recently said, that he is glad, the he finally finished his latest Stormlight Archive book). From a market standpoint its also better, because you get more money (as there are more books). And the publishers are also more likely to buy your books.\n\nMaybe they think: Well Tolkien did it? But let's be honest, some of the stuff is boring (at least in my eyes). I don't need to know the name of every tree in the forest :-) And even he managed to keep it short. He managed to tell more story in 3 books then Sanderson did in one book of Stormlight Archive (maybe a bit too harsh?) :-)\n\nOr maybe it's just me that does not like to carry around these heavy books.\n\nWhat's your oppinion?",
            "I'm a comic book kinda guy",
            "1) I love Mary Higgins Clark, and 2) I can appreciate a lot of the newer YA Authors (although some have some pretty weird issues going on with themselves personally) but I’ve been branching out to intentionally include more non-white writers into my collection. Adeyemi is a GREAT author, as is S.A. Chakraborty! 3) The Daevabad Trilogy was FANTASTIC, and I liked the Wheel of Time series, however it is a little slower (think Tolkien in the writing style).",
            "Louis L’Amour, I know he is commonly considered subpar for his pulp works and formulaic westerns but he’s made some excellent reading. Just began reading The Walking Drum and The Haunted Mesa (westerns might not be the only formulaic thing!)",
            "Fictional or as real as possible ?",
            "I use a name generator, honestly https://www.behindthename.com/random/ \n\n I’m unsure of where my world is taking place, but I almost attempted to create my own language, and it was immediately overwhelming 😅 at this point, my characters have names from basically everywhere and I’ve developed some of them to fit their name meaning rather than the origin of the name. \n\nAs far as titles, I’d just wait until you flesh out most of your book to see what may fit best.",
            "[https://www.fantasynamegenerators.com/](https://www.fantasynamegenerators.com/)",
            "He's pretending to be that guy who love (something) but he doesn't know the first thing about (that thing).\n\nWhile learning about it, he finds a real, true, passion for it ... and meet someone who is really passionate about it.\n\nthe \"write what you know'' comes handy here... if yourself have a passion for (something).",
            "Make a chapter out of it, narrated by the secondary character.\n\nNext chapter, see if Primary understood  :)",
            "Howzabout you reveal to the readers but not to the WMC ? \n\nCould LI learned about it after chapter 12 ?  \"Good thing you made peace, says the Seer.\"",
            "I think the simplest idea would be that in order to raise THE MASTER, he needs several common ingredients, but he’s too stupid to put them in the right amount/order, and that particular spell revives THE ANNOYING GUY. Or that he misunderstood some part of the spell and needs something specific from THE MASTER, and the idiot doesn’t know there are multiple people buried in the crypt and he just *grabs whatever* under the assumption the items in the crypt all belong to THE MASTER?",
            "Does the peasant have a trade or profession ? Farmer or lumberjack or shoemaker or ...",
            "Could the mentor be buried near a ruined holy place that carries enough energy that the peasant can raise him just by being there/ saying the words and the location does the rest? \n\nRelated idea: could the mentor be buried at the crossroads of some equivalent of ley lines and all the peasant really has to do is make an alignment—maybe accidentally, even— and the power of the earth does the job?",
            "My goal for my current fantasy is 100K words, but this is also my first full-fledged novel, so I’m allowing myself some grace. \n\nBut as a reader, I really appreciate having the details spelled out for me so I can envision the world with clarity. I want to FEEL the moss on the centuries-old castle, TASTE the gunpowder and blood on the battlefield. I like the sensory input. And when it’s a WHOLE NEW WORLD, of course there is a lot that may be different, but sometimes **important later on**. I love that, even if it means I’m carrying around a brick 😅",
            "It’s a sci-fi with just humans so I’m looking at pretty realistic names. I have Javi and Mads so far, although I’m still on the fence about Mads. I have been using Kayly and Zoe as placeholders for two other characters. The names I just pulled from my inspiration source and have been replacing them as I find something I like. I have replaced two, but Kayly and Zoe still fit the characters so well and I can’t find something with the same vibes. I could leave it. The story is pretty different from my inspiration source but there are still some key elements that are similar and I worry it’ll be too distracting or whatever to have the names in common too.",
            "Thank you! I haven’t been able to find a name generator for realistic names and reading baby name books was a slog! I’ll check this out!",
            "Currently WMC knows (the “seer” told her so) and MMC/LI doesn’t know yet. But it will definitely be a blow-up situation when he does find out 🥴 \n\nFrom the reader’s view, MMC just hates WMC for her part in the revolution, and they know she was previously rejected, but I don’t outright tell them WHO. It was meant to be a surprise, a dropped bomb. I’m **hoping** that the readers see their animosity for each other as unrelated to the repaired bond until I reveal it. But I’m wondering if I’ve waited TOO LONG. If I reveal this right now, I’ll be approx 1/4 of the way through my book.",
            "Great plot for Kung Fu Hustle 2 ... love it ! lol",
            "I feel you. I don't mind having the world described. It is more on how far authors may go. I don't need to know the whole backstory of who made the gunpowder in the first place and that the wife of the son of he maker, is now pregnant with twins. :-)\n\nI think there's a fine line of it being coloring and not adding much to the story overall (if I forget what you have written, because the payoff is 200k words later, what's the point) and being an immersion into a new world.\n\nI've enjoyed the Greenbone-Saga much more than Mistborn. There was less extranous fluff in the Jade books. Or at least that's what I felt. Sanderson has the tendency to repeat himself. Sometimes even in the same paragraph.",
            "One trick of mine. Don't tell anyone.\n\nFavorite movie... end credits... but not the actors... there's a bunch of names of people who worked on the movie. Shorthen them, switch them, have them in a stew lol\n\nGo wild !\n\nThanks for keeping it to yourself. Have fun.",
            "No problem! I honestly LOVE this one, especially since you can fiddle with the filters. I also love some of the funny name combos it spits out (Herald Gangsta Daddy is the top fav currently).",
            "then maybe just a moment of ... understanding between them ... before the reveal. I think the readers have to see it may be possible. \n\nSo, you're thinking before the end of the mission ? ... or after ? ... or the mission is about them and their \"fates\" ?\n\nHmmm? \n\n;)",
            "I can definitely understand that. The fine line of “this is how this author wants me to view their world” and “the details are now obscuring the plot of the story”.",
            "Herald Gangsta Daddy is fantastic!",
            "My current script is that the MMC is talking to the “seer” and being told of the WMC’s new status as part of the pack and of her being resolved of “her crimes”. Sort of allowing the MMC the opportunity to realize that everyone else is forgiving her and moving on, so maybe he should too.\n\nNot sure if you know much about werewolf “mate bonds” but they snap into effect upon seeing one another, and are solidified by marking one another. So it will need to be before the mission, because he will realize the mate-bond is there as soon as he sees her. \n\nThe mission is an actual mission. WMC has gotta stop another “revolution”! But MMC is gonna go with them.",
            "Sorry, i'm a little confused. They already knew each other. But they didn't know about their mate bond ? (before becoming enemies)\n\nOr is the bond decided by some authority, then they see each, they know, they accept and they mark each other ?\n\nNot trying to poke holes, it's for my own education ;)",
            "So the mate-bond are determined by the Moon Goddess and can only go into effect after they turn 18. However, they get their wolves at 16. \n\nWMC and MMC grew up together (they are about 8 months apart, her being the older one), and he didn’t know she was the “leader” of the revolution until she got her wolf at 16, which revealed who she was. He immediately shunned her, because he felt lied to, his best friend of roughly 4 years was the person who caused him a lot of hardship.\n\nThen, on his 18th birthday, he saw her and they recognized their mate-bond. He rejected her privately, and it actually almost killed her. After that, he took off for schooling abroad, basically. No one besides them knew they were ever mates.\n\nNow they are 21 and 22, and hoped to have “second chance mates”. The Moon Goddess has decided that their mate-bond will be reinstated instead, which means it will be much like how it was the first time. When they see each other, their mate-bond will be recognized.\n\nETA: They grew up IN HIDING together after the failed revolution and she was given a different name. They did not know each other personally before the revolution.",
            "Makes sense. \n\nSo you have to reveal the \"renewal\" before the mission... or at the moment they see each. \n\nWhich changes how they react to each other, in one case or the other. Which is the most interesting for you should be the most interesting for the readers. \n\nMaybe something happend during the mission that prove the Moon Goddess right.\n\nYou got this !"
        ]
    },
    "[Weekly Critique and Self-Promotion Thread] Post Here If You'd Like to Share Your Writing": {
        "title": "[Weekly Critique and Self-Promotion Thread] Post Here If You'd Like to Share Your Writing",
        "score": 7,
        "url": "https://www.reddit.com/r/writing/comments/1dlejc8/weekly_critique_and_selfpromotion_thread_post/",
        "content": "Your critique submission should be a top-level comment in the thread and should include:\n\n&#x200B;\n\n\\* Title\n\n\\* Genre\n\n\\* Word count\n\n\\* Type of feedback desired (line-by-line edits, general impression, etc.)\n\n\\* A link to the writing\n\n&#x200B;\n\nAnyone who wants to critique the story should respond to the original writing comment. The post is set to contest mode, so the stories will appear in a random order, and child comments will only be seen by people who want to check them.\n\n&#x200B;\n\nThis post will be active for approximately one week.\n\n&#x200B;\n\nFor anyone using Google Drive for critique: Drive is one of the easiest ways to share and comment on work, but keep in mind all activity is tied to your Google account and may reveal personal information such as your full name. If you plan to use Google Drive as your critique platform, consider creating a separate account solely for sharing writing that does not have any connections to your real-life identity.\n\n&#x200B;\n\nBe reasonable with expectations. Posting a short chapter or a quick excerpt will get you many more responses than posting a full work. Everyone's stamina varies, but generally speaking the more you keep it under 5,000 words the better off you'll be.\n\n&#x200B;\n\n\\*\\*Users who are promoting their work can either use the same template as those seeking critique or structure their posts in whatever other way seems most appropriate. Feel free to provide links to external sites like Amazon, talk about new and exciting events in your writing career, or write whatever else might suit your fancy.\\*\\*",
        "num_comments": 41,
        "comments": [
            "\\*Title: The Interloper, Chapter 1\n\n\\*Genre: Hard sci-fi\n\n\\*4245 words\n\nHi, there, I'm a newcomer here. I'm typically someone with more of an interest in science and philosophy, but enjoy speculative fiction as a vehicle to explore these concepts.\n\nSo, here's the first chapter of a story I'd like to receive feedback on. Given that this is hard sci-fi, the focus of a lot of my effort has been trying to make sure that the events in the story align as much as possible with current understanding of science and principles of logical consistency. However, I've also tried to make sure the writing is up to snuff - I've thrown away a few previous stories due to thinking they weren't delivered in a satisfying way, and the only reason why this has been posted here is because it meets my personal criteria for readability.\n\nI'm not looking for any specific feedback. While I would certainly appreciate pointers on where the plot deviates from believable scientific speculation or generally just strains credulity, I'd hugely appreciate (and am mostly expecting) feedback on aspects such as how the prose feels and flows, on how understandable the writing is, and whether the dialogue feels authentic enough.\n\nLink: [https://docs.google.com/document/d/1VRUve1NXcBEBN6eKt5VrXY-CnToFxnJh9e8yOZ\\_LYZk/edit?usp=sharing](https://docs.google.com/document/d/1VRUve1NXcBEBN6eKt5VrXY-CnToFxnJh9e8yOZ_LYZk/edit?usp=sharing)\n\nExcerpt:\n\nTwo months, fifteen days, twenty-one hours, and counting. That’s how long I’ve been here, dying in slow motion, my body slowly rotting from the inside long before I’ve even had the chance to take my last breath. My final resting place will be a twisted, hyperbaric coffin named *Proteus,* forged from metal, glass and concrete, entombed deep in the waters of a lifeless abyss.\n\nThe luminaire assemblies that line the walls of the hab gradually flicker on and illuminate the chamber in a sickly off-white glow, mechanically simulating a diurnal cycle for all its doomed inhabitants.\n\nIn the station, an ever-present soundscape practically smothers us, heavy and ominous and oppressive. The very walls that protect us from the elements scrape and buckle incessantly like a soda can under pressure, as if they could crumple inwards and crush us at any moment. In the endless, murky depths outside, the hydrothermal fields produce a subtle, low rumble that seems to emanate from somewhere in the very core of the world, like a massive sleeping god under our feet only kept alive by its host body’s eccentric swings from periapsis to apoapsis and back again. Softly stirring as it’s unwittingly press-ganged into providing the energy necessary to sustain *Proteus* and keep it from falling apart.\n\nI hear Whitlock faintly stirring in the bunk underneath me. The bed creaks as he slowly, gingerly sits up and begins to vomit into a bucket, choking and heaving and gasping as the contents of his stomach unceremoniously escape his body. Once the retching is over, there’s laboured breathing and a soft, low thud; the sound of a head being rested against a bunk pole.\n\n“Hey, you okay down there?” I call to him, my voice raspy and worn.\n\nNo response.\n\nStill extremely tired, sore and unwilling to get up, I close my eyes and try to ignore the faint glow behind my eyelids, letting the deep, all-consuming drone lull me back to sleep. Slowly, I lose awareness of my limbs and then my body, and very nearly manage to fall into a state of blissful oblivion until a quiet thumping and rustling emerges from near the door of the module, breaking me out of my hypnagogia.\n\nI blearily crack open an eyelid, and strain through the harsh fluorescent glare to see who it is. It’s Spivey putting on his uniform and shoes, getting ready for the day ahead so he can pretend to be useful.\n\nOf the lot of us, he’s the only one that’s bothered to act like the mission still matters. When he’s not doubled over in horrible agony and hacking up a lung, he conducts routine structural checkups, analyses sediment samples near hydrothermal systems, collects data on the topography of the seafloor, and performs a million other experiments that no one will remember. Amassing an ever-growing corpus of information so he can stave off the overwhelming despair and grief, desperately trying to convince himself that he still has a role to fill in spite of his impending doom.\n\nHe zips up his jumpsuit, and turns to us.\n\n“Well, I’m gonna have a look at field C-21. You two can rot in your bunks all day or you can help.”\n\nI groan and reluctantly peel myself from the bedsheets.",
            "Title: Nothing yet, the document title is a placeholder \n\nGenre: my attempt to blend sci-fi and fantasy \n\nType of feedback desired: overall impressions and/or line by line comments, I have them turned on\n\nhttps://docs.google.com/document/d/1w9_zE8-oxswVAfRw_1yAlC8MaTv6R9T2ibSu4_31lJo/edit?usp=drivesdk\n\nContext:\nSo this is my first time starting a project since I was a freshman in HS. I wrote this as a hook for the world and characters I intend to expand on in my project. I am curious how effective of a hook it is. Thanks in advance!",
            "Heyo!\n\nI'm working on an original web-serial about a boy and his kemonomimi companions traveling through the modern (but magical) world of Riterra. Though it's not always easy as they seek companionship in a world rapidly trying to objectify and commodify them.\n\n**What should I expect?**\n\n-Kemonomimi story where the cat-girls don't just go \"nya\" and have actual character to them.  \n-Modern setting, similar though different to real life at the same time  \n-Magic and spell-casting system complete with elemental affinities and other aspects naturally integrated in the narrative (readers compare it to Soul Eater meets Pokemon)   \n-There will be battles; we have \"Hunters\" and \"Duelists\" make of that what you will.  \n-Slow building romance, but no smut, we're PG-13 here, most you're going to see is some hugging and maybe a kiss or two  \n-Very cute fluffy slice of life elements to help break up the drama   \n-Currently at 106 chapters totaling over 316k words  \n-Two chapters a week with plenty of backlog to ensure I can keep up that upload pace  \n-If you're looking for something to get invested into in the long run this is your story!  \n-Best part: **IT'S FREE**\n\n**What are people saying?**\n\n-*\"A wonderful world with a clever magic system, solid worldbuilding, and characters that are tons of fun to get invested in!\"*  \n*-\"There is a lot to get immersed into, and I think it'll be enjoyed by those it is targeted for, and maybe those it is not.\"*  \n*-\"I love this story! The author does an excellent job drawing you in with interesting, multifaceted characters in my opinion.\"*  \n*-\"I believe the author has something to tell us and yet also give us a fun adventure world to explore at the same time. Big respect!\"*  \n-*\"Great read so far! The setting, or more specifically, the magic/battle mechanics are incredibly unique and well thought up.\"*\n\n**Where can I start reading?** \n\nIf you want to check it out, you can start [HERE](https://www.royalroad.com/fiction/74788/pruned-trees-re-sprout-ragazza-volpe-magica)\n\nI  would love to have you as a reader, please check it out! Follows are greatly appreciated, just knowing my work was worth clicking that button is worth its weight in gold\\~",
            "**Title:** Traveler's Will: Chronicles of the Lost Worlds\n\n**Genre**: Dark Fantasy\n\n**Word count**: 86.151 (45 chapters)\n\n**Current rate**: 4.81 \\*(68 reviews)\n\n**Synopsis**: This is a tale of a man known as the Traveler. In the pursuit of his own meaning and his thirsty will to craft his worth, he found himself facing the darkness of the world. In a deadly fight for survival, he shall tell his story. And as if each road should have, this is a tale of sorrow, a tale of wandering, a tale of one soul's search for the escape of his own fate, and how that search, and the fearless will that drove it, gave birth to a legend.\n\n**Type of feedback desired (line-by-line edits, general impression, etc.**): General impression and my writing style.\n\n**A link to the writing**: [https://www.webnovel.com/book/traveler's-will-chronicles-of-the-lost-worlds\\_25553012106498105](https://www.webnovel.com/book/traveler's-will-chronicles-of-the-lost-worlds_25553012106498105)",
            "\\* Title: Rotting Pigs in Lipstick\n\n\\* Genre: Religion , thriller\n\n\\* Word count: 480+\n\n\\* Type of feedback: General and pacing feedback\n\n\\* A link to the writing: [https://docs.google.com/document/d/19jbVY\\_sK6d1eBL1QiG-j7VEVKB\\_m8s93Jaxrv4gdOi0/edit?usp=sharing](https://docs.google.com/document/d/19jbVY_sK6d1eBL1QiG-j7VEVKB_m8s93Jaxrv4gdOi0/edit?usp=sharing)",
            "Hi, first time writer here looking for criticism of a short story.\n\nThe story's called Luna, and it's a near future sci-fi short story about a group of friends celebrating before some of them leave the planet.\n\nWord count is about 2200.\n\nI'm looking for feedback on the reader experience. Things like pacing, sentence structure, word choice and characterization. I'm also looking for anything which stands out to you while reading it which you either especially enjoy, or which brings you out of the story.\n\n[The link is here](https://docs.google.com/document/d/1G_3jYfdIEe0btbuBLAf2bR4dXOCmpiyJNrdTEvN92Dk/edit?usp=sharing), and I want to thank anybody who takes the time to read and give their thoughts on the story. No feedback is wrong or too minor, and the more criticism you can give the more I'll be able to improve my work.\n\n  \nShort sample for anyone interested:\n\n\tSean Dominguez was high on life, as was his younger brother Miguel. Their friend Edgar was high on blueblood and half a joint he’d found in his pocket after dinner. He might have taken Sean and Miguel up on having a hit of the baggie of synthetics they shared, but he’d always preferred to celebrate special occasions with a nice mellow. Jody, seven beers deep, clung to Reese’s shoulder as they stumbled forward. Reese, ever the square, was sober. The group were walking down Santa Lucia Street, cackling at one of Sean’s stories about the time he and his ex had misread a road sign during a day trip and it became a week trip.\n\n\tWhen he finally found his breath again, Edgar wiped his eyes dry and cleared his throat.\n\n“Miguel, it’s been real, man. It’ll be hard to see you go.” He gripped Miguel’s hand and gave him a thump on the back. His hand came away grimy, carrying a smear of the motor oil that Miguel had just barely failed to wash off his hands after work. He turned to Sean and barely kept himself from cracking a grin. “Sean, it’s been real annoying. I can’t wait for your dog-ass to be stuck on the moon.”",
            "\\*Title: The Story Of Us\n\n\\*Genre: Romance\n\n\\*2065 words\n\n\\*Hi. So first time writer here. I want to know your general impression about the story. Where do you think I can improve? How is the flow, tone and prose?\n\n\\*Link: [The Story Of Us](https://docs.google.com/document/d/1NxQT3pFIKcfWOeiAF0j4t2T2Og8H9CCiAt6Usvs1Tz0/edit?usp=sharing)",
            "Title: Under Red Skies - Part 1\n\nGenre: Upmarket Fantasy\n\nWord Count: 2k\n\nBlurb: *Anna Parks is a peculiar woman with a rather amazing gift; her dreams betray the future. For the last few weeks she’s been plagued with visions of the death of her son and is determined to do something she’s never succeeded at—change the outcome, cheat fate. Anna sets out to find answers and a solution, a path which uncovers truths long buried, reveals the dwindling fate of life on Earth, and puts her on a collision course with destiny and its helpers.*\n\n*John Mitchell, on the other hand, has spent the last seventeen years building himself a life and family. But when his brother returns with a proposition—the possibility of bringing Bella back from the dead—John is pushed to make a decision, one which unsettles the past, present, and future.*\n\nType of feedback required: General impressions\n\nLink: [https://drive.google.com/file/d/1N-eH8AL5rpV32VvjL02ISpuF579zMqhP/view?usp=sharing](https://drive.google.com/file/d/1N-eH8AL5rpV32VvjL02ISpuF579zMqhP/view?usp=sharing)\n\nThank you, and God bless you! :)",
            "\\*Title: The Demon Hunter's Curse, Chapter 1\n\n\\*Genre: Dark Fantasy\n\n\\*3249 words\n\n\n\nHi, I am looking for some high-level developmental feedback on the first chapter of my latest draft.  I'd like to know whether my main character comes off as a likeable protagonist, and that the plot is going in an interesting direction.  I'm happy to trade critiques!\n\n\n\nLink: [https://docs.google.com/document/d/1FgrEGOUJK3do51USFBcEnxV8qJbhDprG0WoaYFijQWM/edit?usp=sharing](https://docs.google.com/document/d/1FgrEGOUJK3do51USFBcEnxV8qJbhDprG0WoaYFijQWM/edit?usp=sharing)\n\n\n\nFirst 300 words:\n\nTo Arion, the early winter had been a blessing.  For months, he’d sweated under his breastplate while mosquitoes weaved between the gaps in his armor to bite him.  But not anymore.  A late summer snow had stemmed the flying little demons and made wearing his silver armor comfortable, rather than stifling.  It’ll be a good night for a spirit hunt, he thought as he strode down the snowy path with a spring in his step.\n\nDespite the attacks by spirit monsters, the walled town of Rhelton was surrounded by a sprawling shantytown teeming with life.  Arion raised his guard as he approached the sea of tattered canvas tents.  He shifted his eyes between the scores of people, wary for signs of cutpurses or cutthroats.  The smell of the place hardly helped his focus.  Every nook of the slum reeked of unwashed bodies and heavily spiced stew that made his eyes water.\n\nNearly everyone Arion passed stared up at him with sunken, hungry eyes.  Children stopped playing and either pointed at him or ran when he walked by.  Older folk were bolder.  They hissed at him and stood guard in front of the younger ones.  They brandished kitchen knives, pitchforks, or even holy Sun charms meant to ward off evil.\n\nThe sight of all those angry faces only worsened Arion’s tics.  Every few seconds, he’d feel a burning urge to jerk his head to the side, slap himself, or snarl like some rabid animal.\n\nEach time a tic slipped past his guard, he drew more bad attention to himself.  Then the new narrowed eyes on him only inflamed his need to twitch or snarl again.  Arion plastered a smile on his face and muttered, “it’s alright, folks.  I’m a spirit hunter.  I’m here to help.”",
            "Title : Vipers\n\nGenre : Sports Horror\n\nWords : 2300\n\nJust looking for a general impression, really. It’s the first time I’ve shared anything I’ve written. I’m not a horror writer but I was given an exercise that went off in a fun direction.\n\nhttps://www.wattpad.com/story/370815226-vipers",
            "Title: Why Dad Won't Teach Me How to Hunt\n\nGenre: Literary/Child POV\n\nWord count: 5k\n\nType of feedback: General, your opinion on the characters, thoughts on the child POV, message you got from the story\n\nLink: [https://docs.google.com/document/d/1I3N7Rr1-og2DRC5n\\_IgLu4CHjZK2ubdeB6hgqR-MQs8/edit?usp=sharing](https://docs.google.com/document/d/1I3N7Rr1-og2DRC5n_IgLu4CHjZK2ubdeB6hgqR-MQs8/edit?usp=sharing)",
            "All my ebooks are linked here on Reddit for downloading and sharing freely as well😁\n\n\nStory Title: A Fah’Rey Tale Genre: Fantasy, Romance, adventure, multidimensional, China\n\nWord Count: 30,000 Casual\n\nRating: Some sexual content, graphic violence\n\nBlurb: All Yuan wants to do is finish her homework and start enjoying her spring vacation. But the arrival of a winged visitor throws her world into chaos!!\n\nhttps://www.wattpad.com/myworks/359624163-a-fah%27rey-tale\n\nTitle: Another Fah'Rey Tale\n\nGenre: Fantasy, Horror, Adventure, multidimensional, Romance\n\nRating: Mature Graphic Violence, sexual content\n\nStatus: complete\n\nWord count 17,000 Casual\n\nBlurb: An old evil has awakened, relentlessly pursuing Maurice, he must protect his newfound family, most of all Serapheena, a very special girl, who's gifts might save...or destroy the nine realms completely \n\nhttps://www.wattpad.com/myworks/351004192-another-fah%27rey-tale\n\nTitle: Dreams, Nightmares, Awakenings\n\nGenre: Drama, Science fiction, genetics\n\nRating: Mature graphic violence, mild sexual content\n\nWord count: 12,000 Casual\n\nBlurb: In the near distant future, humanity faces a crisis, super flares are making the Earth uninhabitable. Six characters, two timelines\n\nDirk: An agent for a secret association on the moon Ganymede\n\nNadia: an Administrator an a local university in Houston\n\nAdam: Recently married, about to start an important job in hopes of moving him up in society's ranks\n\nAlice: A Female Journalist in her mid 50s, dedicating her entire life for her career\n\nDavid: A Young brilliant Geneticist about to change mankind forever\n\nNia: A streetwise girl with a complex past, eeking out a life on the bad streets of Ganymede, looking to exact revenge on those whom have wronged her\n\nhttps://www.wattpad.com/myworks/344261393-dreams-nightmares-awakenings\n\nTitle: God of War Genre: science fiction/drama Audience: Mature (violence/ some sexuality) Status: complete\n\nWord count 10,000 Casual\n\nThe year is 2042 humanity has sent its first colonist to the Red Planet. Julius Pritchard was hoping for fame and adventure, he got more than he bargained for. https://www.wattpad.com/story/360082358-the-god-of-war-exodus-2\n\nTitle: What Dreams Bloom in Spring\n\nGenre: Drama, Historical Fiction, , Romanian, Romance, 1800s\n\nRating: Mature Graphic Violence, Sexual Content\n\nStatus: First Book of 4\n\nWord count 4000 Casual\n\nBlurb: Four lives are weaved together by love, pain, laughter, and suffering, set in a small Romanian village in the late 1800s\n\nCerubian: Strong, proud, blacksmith's son, yearns for adventure outside the confines of simple village life\n\nLebada: Constantly lost in daydreams, wishing one day she could spread her wings and fly\n\nSarpen: Son of a local nobleman, about to become magistrate of the village, he is petty and ruthless\n\nLupin:Ward at the local monastery, wild in nature, local trouble maker\n\nhttps://www.wattpad.com/myworks/344960328-what-dreams-bloom-in-spring\n\nTitle: When the Last Leaf Falls (book 2 of the Vascau Chronicles Genre: Drama, Historical Fiction Audience: Mature (violence, sexual content)\n\nWord count 18000 Casual Status: Complete\n\nBook Two of The Vascau Chronicles\n\nThe Saga continues\n\nCerubian: Now a foot soldier for The Postelnic faces difficult choices that will test his loyalty to his new lord, his family, and his country\n\nSarpen: Forced to come to grips with his aristocratic family's financial woes, he is thrusted into a marriage not of his choosing. Further accelerating his descent into the abyss of debauchery and violence.\n\nLupin: Riddled with guilt after the fallout of his actions, he dedicates himself to learning, and the service of God and grapes.\n\nLebeda: Now partially blind, she learns that as a girl, she has no control over her future, and is destined to join a convent, her wings now forever clipped, but she still yearns to fly\n\nhttps://www.wattpad.com/myworks/361544989-when-the-last-leaf-falls-the-end-of-innocence",
            "Title: The Short Stick\n\nGenre: Action/Thriller/Comedy\n\n5,629 words \n\nI'm looking for general impressions, developmental feedback, or really any feedback for this one. It'll be very helpful and much appreciated!\n\nLink to the story: [https://docs.google.com/document/d/11VOPzMg7S5NdnJle14IBoeENjCPxi-EI/edit?usp=sharing&ouid=110747511927649340054&rtpof=true&sd=true](https://docs.google.com/document/d/11VOPzMg7S5NdnJle14IBoeENjCPxi-EI/edit?usp=sharing&ouid=110747511927649340054&rtpof=true&sd=true)",
            "\\*Title: Divine Relics- Chapters 1-7 (the only ones) +the Prologue\n\n\\*Genre: Mythological fiction\n\n\\*4215 words\n\n[Wattpad Link](https://www.wattpad.com/story/371465057-divine-relics)\n\n[Google Docs Link](https://docs.google.com/document/d/1b3Z0YmrfYZzDiBQ5e9wCa48KxZutZlVO8GZspSX-eWI/edit?usp=sharing)\n\nI'd like to see how I can move the plot forward without having the speed being the same as the Hazbin Hotel series (if you got the reference you're cool). And also just a general impression and how I can improve my writing style\n\nSummary:\n\nFour demigods-Sultan Iridarcos, son of Iris; Alan Solace, son of Hypnos; Mariano Artey, son of Boreas; and Noah Fenn, son of Apollo-embark on an epic quest across America to retrieve Athena's spear and shield. Each demigod brings unique abilities and strengths to the journey. Sultan's power over rainbows and communication, Alan's control over dreams and sleep, Mariano's command of the north wind, and Noah's healing and archery skills prove crucial as they face various mythological challenges.\n\nHowever, as the quest progresses, Mariano Artey begins to show signs of discontent and ambition. His desire for power and recognition grows, fueled by a mysterious force that manipulates his thoughts. Ultimately, Mariano betrays his companions, seeking the divine relics for his own gain. Sultan, Alan, and Noah must now contend not only with external threats but also with their former friend's formidable powers, racing against time to retrieve the relics and stop Mariano from unleashing chaos upon the world.",
            "Title: Maneater\n\nGenre: Gothic, dark romance, poetry/poetic prose\n\nWord Count: 2,985 (About 20 pieces)\n\nFeedback: Any and all. I have a general idea of the things I need to fix/incorporate moving forward. However, if there is anything else, I'm all ears. Also, I would appreciate just general thoughts on the pieces and the series itself. This is very, very far from what I've written before.\n\nNotes: Some of the pieces began as one offs, however I liked the tone and style, so I continued with it and realized I might be able to do something with them in a bigger capacity. The best way I can describe the series is: A visceral exploration of love and desire, \"Maneater\" dives into a passionate, consuming(cannibalistic) romance. Each piece captures the primal dance between lovers, blending beauty and brutality.\n\n[Maneater](https://docs.google.com/document/d/1dRI0TXbeEYFEhqL0MsNvgD5ccmEHg-iJTcO2JCfWf4w/edit?usp=sharing) **(Link right here)**",
            "\\* New World Magic\n\n\\* High fantasy Sci-fi Romance \n\n\\* 1,451 prologue [https://docs.google.com/document/d/1J70tWaTzD7GgffA\\_\\_k-waOOMj37uIjAMN4HvQzzz5sw/edit?usp=sharing](https://docs.google.com/document/d/1J70tWaTzD7GgffA__k-waOOMj37uIjAMN4HvQzzz5sw/edit?usp=sharing)\n\n\\* line-by-line edits, general impression, anything is welcome. \n\n\\* Princess Isla of Terra-II has sworn off love, focusing on archery, caring for her siblings, and accompanying midwife Selene. Her life changes when she encounters King Kyro, destined to marry her sister Lexa to secure an alliance. As Isla and Kyro’s love deepens, their plans are disrupted by the emergence of the Silverborn, immortal beings capable of planetary destruction. After the tragic death of Selene, Isla vows to defeat the Silver Witch and protect her planet.",
            "First time writer here!!\n\nTitle: White Foxes\n\nGenre: Young Adult Fantasy\n\nWord Count: 16k (4 chapters)\n\nLooking for: General impression of my writing style, tone, & prose. Do you like it objectively & what do you like/dislike about it? \n\n[Link!](https://www.wattpad.com/story/371305390?utm_source=ios&utm_medium=link&utm_content=share_writing&wp_page=create&wp_uname=morgangiudice)",
            "___ADVERTISEMENT___\n\n___\n\n**Book one**\n\nTitle: *[Skate the Thief](https://www.amazon.com/dp/1951471032)*\n\nGenre: YA fantasy\n\nSkate is a thief, trained and owned by the local crime syndicate, the Ink. When she tries to burgle a shut-in’s home, she gets caught by the owner—a powerful undead wizard. He makes a deal with her: “borrow” books from other wizards in return for a place to stay.\n\nCaught between her growing fondness for the wizard and her past with the crime syndicate, Skate doesn’t know where her loyalties lie. But she’d better figure it out, because there’s a new player in town, one whose magical hypnotism puts them all at risk.\n\nThe first chapter is available for free [here](https://jeffayersauthor.weebly.com/uploads/1/3/1/0/131087146/skate_the_thief_pre-release_chapter_1_sample.pdf). The book is available on Amazon in paperback and ebook. Kindle Unlimited users can read the Kindle version for free. \n\n___\n\n**Book two**\n\nTitle: *[Skate the Seeker](https://www.amazon.com/Skate-Seeker-Bone-Chronicles-Book-ebook/dp/B0C97HCYLK/)* \n\nGenre: YA fantasy\n\nA mentor is lost, but he doesn’t have to stay that way. He’s left Skate a clue to bringing him back, and she and her friends are determined to follow it.\n\nNo sooner do they set out for unknown lands, however, than things get dangerous. Hot on their tail is the witch Ossertine, furious over Skate’s part in her friend’s death and thirsty for revenge. Worse still are the attacks that come at night: dark, mysterious, and palpably evil.\n\nIn this race against time, magic, and implacable foes, Skate must rely on her wits and her friends to save not just her mentor’s life, but also her own.\n\nThe prologue is available for free [here](https://jeffayersauthor.weebly.com/uploads/1/3/1/0/131087146/skate_the_seeker_sample_-_jeff_ayers.pdf). *Seeker* is available on Amazon, and free to read for Kindle Unlimited subscribers.\n\n___\n\n\n[My blag](https://jeffayersauthor.weebly.com/home/) is there somewhere, so go peruse at your leisure. \n\nAlso, a friend of mine put together a fun chat AI. If you want to go have a convo with Skate, [go for it!](https://c.ai/c/qZ9IVjyg7glb13QibRNN-rKWzGQYf6l9SH9PW1ErVkI)\n\nYou can find [me on Threads](https://www.threads.net/@jeffayersauthor); I’m using it as a Twitter replacement for all the inane garbage I want to say. \n\nMy publisher also has some [sweet merch](https://www.redbubble.com/people/thinklings/shop?artistUserName=Thinklings&collections=2488951&iaCode=all-departments&sortOrder=relevant) for sale, if you’re into that.\n\nI have a book signing at a local store tomorrow, so I’m excited about that!",
            "Hello to everybody, first-time writer here 👋\n\nI'm trying to write some short stories before doing something longer. This is my first attempt.\n\n* **Title:** No title yet.\n* **Genre:** Short story.\n* **Word count:** 1.012 words.\n* **Type of feedback:** General impression on the writing style + would you continue reading it?\n* **Link:** [https://docs.google.com/document/d/14dj5j9\\_MCU7Qcf-HhvhcshZbVTI\\_pdLvB80ZF\\_aWbpo/edit?usp=sharing](https://docs.google.com/document/d/14dj5j9_MCU7Qcf-HhvhcshZbVTI_pdLvB80ZF_aWbpo/edit?usp=sharing)\n\nThank you in advance for any feedback 🙏",
            "Title: Vermilion Wing\n\nGenre: Fantasy, Action/Adventure, High Fantasy\n\nword count: 44,316(ongoing series)\n\n>synopsis:  \n**A Legend Begins**\n\n>Join Vermilion Wing: a ragtag group of mercenaries for hire. Led by the twins Kai and Vivian. Ready to take on anything and everything Valstrom has to throw at them.\n\n>When Kai finds himself cursed for a job, their group must venture to the island of Karo. What started as a simple job soon escalates beyond their imagining.\n\n>Can they be the heroes fate chose them to be? Or is this task too much for our unsung adventurers?\n\nAre you a fan of D&D or other TTRPGs? Well, Vermilion Wing is a fantasy story that works to capture the spirit of a campaign with fun characters, fantastical creatures, and quick pace action scenes. If you love exploring new worlds, watching the story of underdogs climbing their way up to legends, Vermilion Wing might be the story for you.\n\nAnd thank you in advance if you choose to check out the story, and any and all critiques, good or bad, are appreciated. Read it here: [https://www.royalroad.com/fiction/83807/vermilion-wing](https://www.royalroad.com/fiction/83807/vermilion-wing)",
            "**Title -** [Annabelle's Cheating Adventures, Chapter 6](https://archiveofourown.org/works/48431560/chapters/144400723)\n\n**Genre -** Smut, romance\n\n**Wordcount -** 22,216 for the entire story so far, 2,846 for chapter 6\n\n**Feedback -** Just general impressions or how I can make things funnier. I also wanted to give the impression of a lived in world so they'd see and hear characters outside of the main cast. \n\n**Note -** Smut begins after Sebastian carries Annabelle up the stairs. Also it's a fictional world I made up",
            "Just commenting to say this is excellent! The writing is exceptional and the premise is intriguing. No feedback for now, but great work!",
            "Loved the use of *click*. I think you should rely more on the \"show don't tell\" technique. Generally you should probably shorten the whole text a bit. Some sentences are hard to read, example: *\"The hallway she walks down is covered in old engravings, written in a language she recognizes, however does not understand\".*\n\nLastly, this may be subjective, but I think the prose would benefit from a different tense than the simple present.\n\nHope this helps!",
            "This felt very incomplete to me. It felt like the prologue of a novel rather than a short story with a complete beginning, middle, and end. I like the dynamic between the brothers/friends and the camaraderie they shared, but overall I felt that little actually changed between them, from the beginning to the end of this story. In the beginning they are reminiscing and anticipating a bittersweet goodbye, in the end they are...still anticipating a bittersweet goodbye. There's something more that's needed in order for this to feel like a complete story, instead of just a snippet from a longer work. I also think you could reduce the cast of characters as the focus seems to mainly be on the 2 brothers and their friend Edgar.",
            "Going to give it a try. Where do you prefer the feedback? If you can, dm-me.",
            "Overall I like what you posted.\n\nIn short: I think Arion's not the best he could be yet, but I like the direction you took him and with some tweaks he has fantastic potential. Your setup for the rest of the adventure is solid, and I'm interested in seeing where it all goes. Your prose needs some work in my opinion, but that's to be expected from a draft. The action was really enjoyable though and I think you should lean into it going forward. If you're interested in a more detailed critique let me know, but the bottom line is that with some work you're going in the right direction.\n\nI'm excited to see more, keep writing!",
            "I like this quite a bit. The MC is interesting and it's easy to empathize with him. There's some minor editing needed but for a draft it's great! Overall I really the balance between descriptions and thoughts. I already want to know what happens to this character :)",
            "Hi! I just gave this a read. I really enjoyed it!! You’re great at descriptions & I like the way you’ve written Arion. He’s definitely likable and I sympathized with him immediately. I actually saw your comment a few days ago about writing an OC with Tourettes and upvoted it! I love how he ‘forgets’ about the curse when he’s fighting & in his element. I think it’s cool how you’re weaving that sort of realism into fantasy. Your work is definitely something I’d like to keep reading!!  \n\nI also posted a story this thread for critique but it’s YA vampire fantasy genre, so no worries if you aren’t interested!",
            "I think you could improve your hook and the first (nine I counted) paragraphs. Most people know what a dorm room looks like. Even If I were standing in the room I would be extremely bored listening to the protagonist explain where she wants to place every piece of furniture. I'd tell her, \"Hey let's get out of here and explore the campus! You can think about how hard it will be to unpack your books from this bookshelf *after you’ve graduated* some other time. Yeah yeah yeah, that's a very nice chair you have, let go!\"\n\n  \nEdit: I read a little further. The two interactions she has with Wren and Kayley seem like a missed opportunity for something interesting to happen. Something that makes her think, that's weird? But she brushes it off. The blurb said she meets a myriad of strange students and the two people we meet seem perfectly normal. I can’t tell them apart. Which leads to the protagonist's first sight of Dorian and Alaric. \n\nI know that there is supposed to be a mystical element to them but the vibe I'm getting is that she is a bit creepy. She’s feeling this strange aura from them, but it's the first time the reader is confronted with a magical element, we don’t get any hints from the tour, her RA, or her new best friend.  Some hints, clues, and foreshadowing can make that moment when she first sees Dorian and Alaric more meaningful. The reader can put together these clues and attribute them to the strange feelings she’s experiencing.",
            "Where you do you have it published?",
            "Thank you very much for taking the time to read my work! I'm a fairly new writer, so I'm glad you enjoyed it - and don't worry, positive feedback is as helpful as any other kind for helping me gauge where I'm at.",
            "Hi!  I prefer on-line feedback.  I'll look over your work soon.",
            "This is valid! It’s the first chapter I wrote and I was getting myself into the headspace of the book. I’ll go back through and cut some of the fluff out. Thank you for the input!",
            "oh whoops, forgot the link, thank you for letting me know",
            "Okay, from the descriptions I think I will like it. It kinda reminds me the book-saga: \"The Demon Cycle\" by Peter V Brett.",
            "You’re welcome. I don’t want to sound harsh, but if you cut the first nine paragraphs the story would be missing nothing. The reader needs to know who the protagonist is, unless the campus and her room have a personality (the campus could have some strange and creepy lore that adds to the plot) it’s not as important as your protagonist. To get into the headspace of the book you need to know who your protagonist is, their likes, dislikes, greatest fears, dreams, and wishes. What does she want to get out of her college experience? How does she plan to make that happen? What could get in the way of her goals? What motivates her?",
            "You're welcome! I also publish there, if you want to, we can swap review there",
            "I appreciate the offer to do a review swap but I'd rather get reviews because people want to leave one rather than a promise of doing one for one in return",
            "Sure, it makes sense!"
        ]
    },
    "What do you do when you have an idea that isn't enough to become a whole book?": {
        "title": "What do you do when you have an idea that isn't enough to become a whole book?",
        "score": 25,
        "url": "https://www.reddit.com/r/writing/comments/1dlsbkc/what_do_you_do_when_you_have_an_idea_that_isnt/",
        "content": "Novelists: what do you do when you have an idea that you love, but that isn't enough to carry an entire book? Like you have the bones, but the bones aren't enough to be... well, enough, if that makes any sense. Like it's there, but it needs SOMETHING to be a real, working plot and not just points, details, characters, relationships, and (some) scenes?\n\nI struggle with this all the time. I'll have an idea that's fleshed out, but it's not enough of an idea to turn the pages without some X factor. What's your process for finding/coming up with that X factor?",
        "num_comments": 37,
        "comments": [
            "I simply write it as a short story. Or I let it fester in my \"Story Ideas\" folder.",
            "I exclusively write short stories",
            "I have a file on my computer called \"Random ideas\" where I stick every interesting idea I have while writing, watching something, reading something, or at work.\n\nThis ranges from page-long out of context scenes I've been inspired to write to single-sentence character concepts, quotes, interesting historical events or figures, or just about anything else. Some of it gets incorporated into the main work, and a lot of it just sits there in case I find a use for it later.",
            "I relate. Just write. Get those characters moving. Sometimes it will surprise you to see that is indeed enough for a short novel, and other times it will take you to new paths, subplots that will show up as you go. Naturally, it depends on what story you are writting. Solutions will not take the same form in a spy thriller than in a historical novel set up in ancient Rome. Think also on what commentary the novel can carry. A detective novel is not just about the case, for example, but the whole world around it, a social commentary on the circumstances, the street, a political sideplot. A historical novel is not just about characters in the middle ages moving thorugh the specific plot, but about representing more accuratelly that period. Show that world. As usual, the root advice here is to read. Check books on the genere you are tackling, grab a couple of novels (good or decent ones, to be on the safe side) and read them trough and trough and isolate the main plot with those things that are not, the side plotd or mere background, and you will get a clearer vision on how to bring your novel into a more complete form.",
            "u/HaggisAreReal said what I was going to say but better\n\n\nI'll start with what I will swear is only a small, quick idea - but then when I get to actually writing it, suddenly I've got an entire book happening. Then I go to edit/revise that first draft, and oh look - its a trilogy now.\n\n\nMy to-write list is annoyed, but at least my bank account is happy\n\n\nEdit: formatting",
            "I think everyone will say the same thing and tell you to write anyway. I am someone who plans minimally and writes on the fly. If I had a bare bones structure I would start writing and tell myself I couldn’t put in plot point x until I had written a certain number of words. Essentially space out your current ideas with new material in the spaces between the sketchy outline. I would bet you would need to close only two gaps this way before things fell into place. If it really speaks to you, give it a try.",
            "One option is to keep it in the back your mind until it combines with a second idea - neither may be a whole novel on their own, but together they may become something more interesting and complex.",
            "Write a novella.",
            "You put it in an anthology of short stories.",
            "Go over the structures of the story archetypes that fit into your idea and try to structure your idea around the archetype. Identify parts of your story that don't feel fleshed out properly and improve those aspects.",
            "Often times, one good idea isn’t enough for a book.  An amazing book often has numerous ideas.  Find how it can fit into a greater story.\n\nAlso, there’s nothing wrong with short stories, but if you want to write a novel, then the above would be my advice.",
            "lf it's just a very small idea / scene, write down the basic concept and put it in an ideas folder to use later. Or write a drabble or standalone scene if that's what you feel like doing.\n\n\nFor ideas that could be fleshed out into a novel / novella / short story, you can always do that.",
            "Well, my last little \"idea\" ended up being a series, so I never write an idea off so easily 🙂",
            "One of the things I've been learning recently, and has really improved my writing somewhat, is to let go the structure and whole process of \"turning an idea into a novel\".\n\n\nBecause even when you are writing a novel you aren't writing a novel, you are writing a scene, a chapter, a moment in time.\n\n\nSo embrace that when you create one. Essentially play with the idea. Take it out for a spin, where do you see it going, what forms do you see the idea in, what twists and turns can you take it, what characters are connected to it.\n\n\nI think one thing we don't as writers appreciate, in our dedication to make sure we write \"a novel\", is that sometimes we have to write paragraphs and lists of stuff around the idea to actually get to the idea we want to write about.",
            "I write out every scene, dialogue, setting design etc and 8/10, that usually kick starts something in the brain meats.",
            "Usually I add elements and scenes to it in my imagination, until I feel there is enough there. Sometimes though, if the idea is very strong on its own (and adding more would be like fitting wheels to a tomato) then I do write it as a short.",
            "Start as a short story and see where it takes you. I’m a firm believer in having the story tell you how long it’s supposed to be. I wrote one short story that ended up at 20k words. After filtering it through beta readers I realized there were some themes I wanted to explore more heavily. Now I’m at 57k and I’m fleshing out the final boss battle so to speak. Once it’s all completely fleshed out I anticipate it being in the 70-80k range.",
            "This really depends on what it is that you have. It sounds like we are very different writers, but I’ll share my process anyway.\n\nFor me personally, it is usually an image and a mood. I add it to my notebook of ideas, and when there are enough images and moods and concepts, I start arranging them to see which ones fit together to create a story landscape. It’s like pairing colors to compose a palette.",
            "A novella is a great starting point. I read a duology that began with a short novella. \n\nThe writer was suprised by the feedback and support she had gotten, people wanted to know more about the characters and world which led her to her writing two books.",
            "What happens if you just start writing? When I do that either the story comes, or it doesn’t. Either way I know",
            "You can shift your focus to a short story. But there are factors to consider. You might want to back burner it and see if you can build onto the overarching theme. Or it may be better off condensed, you don’t want to pad it for the sake of making it novel length.",
            "[removed]",
            "So I write an online novel on a certain site which demands I upload at least two chapters per day if I don't want my readers to lose interest. I started writing because I had this idea about a gay half demon protagonist in a fantasy world. That was it. Nothing about the plot or supporting characters in my brain. I began writing on a whim and before I knew it, my story became popular and I received a contract.\n\nWhat did I do next? I just wrote whatever came to my mind as I began creating an overarching plot. I don't even know where I'm going with this. I think you should start writing and allow your story and your characters to lead you.",
            "Same!! Except minds a Google doc so I can access it from my phone 😂",
            "This is brilliant advice! Thank you!",
            "I guess my problem comes down to if I don’t have the “big point” figured out, I struggle to get going. I’m not one to outline stuff or anything like that, but I feel like I need that main reason to really get me going somewhere if that makes sense?",
            "Thanks for the suggestions!",
            "Good point!",
            "Also I gotta say, I love your username 😂",
            "This is my method. I get a lot of what-if ideas. Put two together and things get a lot more interesting.",
            "Still have to have that main point/reason/X factor though 😭",
            "That’s okay 😊",
            "Don’t fuss too much over not having the big point. A short I need to actually get around to completing didn’t have the big point until I got most of the way through the outline. I couldn’t figure out why the character was doing what she was doing and then my teacher at the time brought up anti-psychotics and I went “ooooooooh”.",
            "I'm a discovery writer/pantser: I come up with a vague personality or two, a scenario that sounds interesting to plug them into, and then I let it all bounce around like pinballs, flipping my writer paddles here and there as needed to keep things going until I have an entire cast and a book-shaped thing at the end.\n\n\nBecause of this, I find tropes to come in very handy; like Legos you can bolt onto your story to smooth out pacing and add intriguing wrinkles.\n\n\nSay you want to write James Bond, and you've got Bond, Doctor von Naughty, an idea for a cool chase scene through Venice, and the macguffin. But you still need all the rest, right?\n\n\nOkay, so Bond needs to receive the mission in the first place, which means you set up MI6 and quickly teach us their function in this world. Now, Bond needs to show he's got the skills we're going to see more of later: he flirts with Moneypenny, he quips with Q, he shows loyalty and professionalism to M. We now have a baseline of who he is.\n\n\nYou can also block this out more by starting earlier - maybe we see him waking up in a supermodel's bed to show he's a cad, or you sprinkle in some flashbacks of his Wound or training days. Maybe there's a plucky reporter waiting outside his apartment block, and we learn what he does is secret or some future seeds are planted about the villain.\n\n\nSpeaking of the villain: show us their arena of power (Volcano lair! Minions! Shadowy Board of Investors!) hint at their Wound/origin story, the first moves that get this whole story rolling.\n\n\nBack to Bond: two cool things about super spies is all the flashy gadgets and sleek style (suits, cars, etc). This is tricky to write at the start, but you can also come back and layer in the tools we'll see used later.\n\n\nSo, setup done, now we can move into our main story. BUT! Maybe Act 1 is only about 15-20% of your genre's expected length, and you need to bring that up another 5-10%> Here is a good spot to remind you that stories are fractal. Just like we can add in those Lego blocks like the supermodel scene, or additional Q gadgets (I'll come back to this later), or flashbacks to Bond's past, we can also add fail points too, which will add some realism to your story.\n\n\nSo, maybe one of Q's gadgets blows up in the demonstration and he's got to scramble for an unexpected replacement (which of course ends up coming in clutch later, because tropes). Or maybe Bond *refuses* the mission - well, first we are going to need 1) a damn good reason why, 2) a fallout scene of how this effects his life/those around him, and 3) consequences. For example: 1) he's older now and seen too much, he said he was retiring and he meant it. 2) M is disappointed, MI6 is full of whispers and frosty looks, a flashy new wiz kid agent is brought in to take Bond's place. 3) It's Bond, so explosions and Meaningful Death. Maybe wiz kid was Bond's spunky young protege, maybe it's Moneypenny or Q or M, or the supermodel from the open. Whatever it is, it galvanizes Bond into action, and he takes the mission after all.\n\n\nYou can do this 2 steps forward and one step back all through the main narrative, adding both excitement and length to what would otherwise be a fairly straightforward story. Hell, at the end Bond could slip up and let Doctor von Naughty get away, and then you've got a whole sequel.\n\n\nAlright, so all that? That is the power of tropes. They make it pretty easy to pitch your idea to an agent or write a selfpub blurb too, because they are narrative touchstones embedded in the cultural consciousness. And once you start actually writing it, it will feel far less tropey, and more like *your* story, but it's a decent way to get started.\n\n\nGo on a tvtropes.com deep dive. Study story structures and beat sheets - hero's journey, heroine's journey (Gail C's book is amazing), save the cat, romancing the beat, etc etc etc. Even (especially!) if they are outside your chosen genre, because then you can see how different structures emphasize this or that element to affect a story's flow. And I cannot recommend this video lecture from Mary Robinette Kowal highly enough, because while she is focusing on short stories it's absolutely applicable to writing at any length:\nhttps://youtu.be/blehVIDyuXk?si=eS2EDiZbHOFWGgLr",
            "I so desperately want to know the story now",
            "Haha. It about a character who has a massive mental break (I’m talking should be in a padded cell with a straight jacket kind of break) and they go on a small killing spree. The problem is they can’t tell reality from fantasy. The audience can because their “reality” is in black and white set in NY 1940s, and the actual reality is in color set in present time. I’ve always been obsessed with film noir and want to mix the two so badly.   \n\nI should also add that this is for a short film, not a book.  \n\nI couldn’t figure out what would cause them to bounce between realities and what not but then the conversation with my teacher happened and decided the character would either be undiagnosed or completely off their meds."
        ]
    },
    "What are some tropes that you like for relationships?": {
        "title": "What are some tropes that you like for relationships?",
        "score": 12,
        "url": "https://www.reddit.com/r/writing/comments/1dlr8cm/what_are_some_tropes_that_you_like_for/",
        "content": "I’ve recently been thinking about tropes (the good and the bad). It’s got me fairly interested and I had to ask you guys: what are your favourite relationship tropes? I honestly don’t know.",
        "num_comments": 12,
        "comments": [
            "Fauxmance, where for whatever reason the two try to appear as if they are in a relationship while they're not. And then they slowly fall in love ❤️",
            "opposites attract. for example, a dumb fool is brave charms the intellectual broody opposite- or some variation of this. of the top of my head. iirc, watch Wakfu for this one. \n\nthere is the enemies to lovers, i guess that is another form of the opposites attract. it can be fun. \n\nthen there is the destiny binds two together. it's a hit or miss for me on this one. depends on how it happens i suppose. but destiny feels kind of a cheat to guarantee two getting together. \n\n age gap romances. this is often the arranged marriages route. not everyone likes those. an example would be a younger princess married to and older lord \n\nstudent and teacher relationships are another. platonic or even lovers\n\nchildhood friends.\n\ni like admirers to enemies to. a perfect example is syndrome form the Incredibles. Never meet your heroes!\n\nas for what's good and what's bad, that is subjective and ultimately up to the reader and the writer to decide. perhaps it's how the writer frames the relationship as good bad and who the reader perceives it. so, as a writer think how you want the intended audience to see it and proceed that way.",
            "forbidden love.",
            "Will they or won't they? Personality based tension, that is to say \n\nAlso I like a 5_10 year age gap between the characters, so they are like a brother and a sister, as well as boy and girl.",
            "I love the \"really just friends\" trope. Not everything has to turn into romance, even if circumstances say it could.",
            "I love all wholesome ones :3. But I personally write a lot of sunshine x gloomy, and god/monster x mortal. And they understand and comfort each other :D. The romance subplot of the story I'm writing rn is literally (mortal) undead sunshine x gloomy immortal demi-god lol. I also like insane characters so most of the ships I write are also some level of unhinged x someone who understands and keeps them grounded",
            "Friends to lovers \n\nRivals to lovers (NOT Enemies to lovers) \n\nAnything non-creepy and rather wholesome",
            "There’s the forbidden love trope and, as cliche as it may be, I love the “enemies to lovers” trope…",
            "Anyone else sick of tropes",
            "some of mine are...controversial!",
            "Forbidden love trope. They aren't allowed to date, because, whatever reason, they are dating others, they work together, age gap. Then they end up spending time together cause of work or saving the world or whatever, and they keep trying to avoid each other. And eventually, the hotel room with one bed trope, or falling on top of each other accidentally trope. I don't know. It's always the same kind of tropes in each romantic movie I watch. It's never getting old. If you start with just a normal date, continued by normal dates, how it is in real life, it's kind of boring cause there's no plot twist. That's why I like it, cause of the plot twist. That's why it starts with they're never going to date and they don't want to date, then we gradually develop the story to they start dating... and then i stop watching the TV series. If they're just dating as normal people it's somewhat so boring. It's only good 1 time, for 1 scene, the scene of the plot twist. I don't really watch romantic drama anymore though. And I never had the plot twist in my life happen either.",
            "The best part of “will they or won’t they?” is how much room it gives you to be creative. There are so many ways to write it. But the undergirding of it is just fundamentally captivating for readers."
        ]
    },
    "How do you deal with the fear of being exposed, of being judged as a terrible writer?": {
        "title": "How do you deal with the fear of being exposed, of being judged as a terrible writer?",
        "score": 13,
        "url": "https://www.reddit.com/r/writing/comments/1dlqss1/how_do_you_deal_with_the_fear_of_being_exposed_of/",
        "content": "I think many of us have these thoughts and images of ourselves as having good stories to tell, of having something to say that matters and makes people want to listen to us. But there is also this terrible fear of waking up from this dream and being told we really suck and have no talent.\n\nYou don't have this fear?\n\nOkay so maybe it's just me then.\n\nI'm so afraid that it prevent me from writing. I have intrusive image of me one day posting my writing in a sub here or a forum online, asking to receive constructive criticism, and then receiving nothing, then again asking for it and coming back to it a few days later to find one comment after another of people saying really hurtful things about me lacking talent and having no business writing.\n\nI guess I won't know until I do submit my work, but I wonder how other writers (or other artists in general) do it. How do they face and even welcome criticism? I've read that even great writers sometimes received really harsh criticism and some only became famous and appreciated for for their work years after their death. Such a sad thing that it can even happen to the best of writers. What chance do the rest of us have?\n\nThere is nothing you can do to prevent that kind of crushing reaction for certain. You could work on the same draft for weeks and months and years, and still have people saying it sucks. I feel writing takes a kind of courage that people don't always talk about. It's a tough business.\n\nBy the way, I've seen people give really hurtful criticism and drawing all kinds of conclusions about an author whose work they did not like, so I'm not just imagining a worst-case scenario.",
        "num_comments": 34,
        "comments": [
            "I just accept I might write something terrible. Then it becomes my editor's problem. 🤷‍♀️",
            "Go to goodreads and look up 1 star reviews of your favorite books. There are people over there taking a massive dump on anything from Pride and Prejudice to The Lord of The Rings. Absolute classics, definitely very good books, and yet they have some terrible reviews.\n\n\nYour writing will never please everyone and that's a good thing. If 80% of people don't like your stories, but the other 20% are hardcore fans, who cares?\n\n\nWrite for yourself. No one is looking over your shoulder. You don't have to share your stories, if you don't want to. \n\n\nThere's also the writer's curse. Something you really like today can look like shite two weeks later. That's good, because it means you've grown as a writer. You start noticing more and more flaws, which you can then edit, until you like it again.\n\n\nEvery writer in history has produced bad, clunky sentences and sometimes whole books that just didn't work out at all. It's the same in other fields, too. Look at the Beatles. They have some amazing songs and some that make me go \"what the hell were they thinking?\".\n\n\nIt's necessary. You will never write only good things. Not every sentence will be good, not every story will be good, but some of it definitely will. That \"some\" will grow. Instead of 1 out of 10 sentences being good, now it will be 3. Soon it will be 4 or 6 and before you know it, bad sentences will be the exception. \n\n\nAgain, no one is watching you. Just write. Accept that you WILL write some bad stuff, maybe a lot of it in the beginning, but you will also get better at it. What others might say about your work doesn't matter. You're not a pro yet, you're still learning.\n\n\nJudging by your post, you are definitely able to express yourself clearly. That's a big step towards being a decent writer, in my opinion.",
            "*\"How do you deal with the fear of being exposed, of being judged as a terrible writer?\"* \n\n\nBy accepting it and writing anyway. Over the course of writing you'll get better (unless you're too stubborn).  \n\n\nYou can either do that or let your fears defeat you, cry, curl up into the fetal position suck your thumb underneath covers weeping silently.  \n\n\nThe choice is yours OP. ",
            "Just... Do it.",
            "So, the terrible truth is that you might be a terrible writer, and if the thought of that, and being told that, is unbearable, then you won't ever be able to produce anything for public consumption.   \n  \nWe can all give you tips and tricks and our own philosophies, but my own life approach of \"fuck it we ball\" won't help you if you can't handle criticism.",
            "I have alpha/beta readers and an editor to tell me if and where it sucks so I can fix it before publishing. Anything before publishing is a learning experience, a chance to improve my craft and story.\n\n\nThen I make sure (because I self pub) that my cover and blurb and everything is on point for my audience, so I don't accidentally have yacht snobs wandering into my bicycle shop. (Okay, sure - you didn't like that chapter. But ma'am this is a Wendy's and it's a fav trope/genre staple of something you don't like but chose to read anyway.) If I've failed here, that's on me but it can still be fixed.\n\n\n\nSometimes you gotta remember that folks have bad days or are just terrible people, and they'll take that out on a lil $5 eBook like I ran over their grandma's house in a monster truck. That's not on me, that's them.\n\n\nI've worked retail, service industry, and as a freelancer on projects big and small. I have seen folks complain about the stupidest stuff and have learned its often really more reflective of who they are as a person than the thing they are complaining about. I won't lie, negative comments can still sting in the moment. But you dust yourself off and keep going, or else you'll never get anywhere at all.",
            "\"By the way, I've seen people give really hurtful criticism and drawing all kinds of conclusions about an author whose work they did not like, so I'm not just imagining a worst-case scenario.\"\n\n\nPeople who do this are assholes and losers - one of the best things one can do for oneself is to learn to ignore the opinions of assholes and losers. They're absolutely worthless. \n\n\nMost normal people really don't care all that much if they don't like your book or think it's rubbish, they'll just shrug and move on to another book. The main negative response you're likely to get to your work is indifference rather than hate, which is much less unpleasant. ",
            "If I receive comment after comment telling me I suck I'd be thankful because It means I can improve. **For free!** I want harsh criticism. I crave it! It’s not usually free. That’s why writers hire beta readers and editors. Multiple harsh criticisms would make my fucking day.\n\nWhat is fear?",
            "Criticism is a good thing. It’ll help you improve as a writer. And even then, you still might write something that isn’t good. We can’t bat 1.000.\n\nI got my first story published earlier this month, to positive feedback (that I know about). Then I wrote a first draft of a story that I felt stunk. So I put it aside and recently started a new story and after being 3 pages in I feel it’s better than the previous.\n\nLife of a writer. Keep writing. Get feedback. Not everything we write is going to be good (much like this comment; I don’t think it’s a very good comment).",
            "Reviewer: you have to be the worst writer I've heard of.\n\nMe: but you have heard of me!\n\nFinally, I did it!",
            "In the same way that someone faces shyness. They do it anyway, even if they make a mistake, and they keep doing it until they get used to it. There's no magic formula, it's exposing yourself and suffering until your skin is tough enough.\n\nThere will be someone talking shit about you and what you do regardless of what you do. Post your story, someone will eventually say something stupid, don't post and your own mind will call you a coward and lame, confirming your fear and making it even harder to overcome next time. Which do you prefer?\n\nI prefer to post and let others curse and despise, what do they know? The opinion of haters hurts you as much as you let it. Learn to filter out constructive criticism, and disregard hate and idiocy",
            "Be like Dan Brown, Brandon Sanderson, E.L. James et al - stop caring if your writing is terrible, they don’t. If someone finds it terrible, meh! Just write to the best of your ability. Keep striving to get better. Stop comparing.",
            "I only got feedback F2F. People moderate their insults when they are looking  you in the eye. But I looked for honest people. And the more they were published, the harder I listened.  Fellow amateurs seldom helped me. Pro writing teachers helped me a lot.",
            "So what? If I am not exposed I won't get better. Plus ai write for fun not because I am good. I do believe I am a competent writer but not great, yet.",
            "Wish I knew. I got an email link to feedback from a publisher this morning. Not going to open it till tonight when I am drunk and can go to bed immediately if my delusions are shattered by their feedback.",
            "Receiving harsh criticism is inevitable, regardless of how good your work is. You're going to have your haters. If your work really is that bad, it's nothing that can't be fixed. So if your feedback is negative, you're not a bad writer for life, you're a bad writer in that moment in time. \nI'm not expecting my first piece to be great; I'm expecting my beta readers to give me a hoard of issues I've concocted. Truthfully? I'm looking forward to it. Because it's a stepping stone to improving. It's easy for me to look at my work through rose tinted glasses. I need a fresh pair of eyes to give me the low down.",
            "the thing about writing as opposed to e.g. dance, live music, cooking, is that you can always go back and make the thing you're creating better. and the thing about writing as opposed to sports is that you aren't going to hit a physical peak and then decline - you can always get better, no matter how old you are or how late you started. \n\n\nwhen you look at it that way, writing is a pretty low risk medium, because the work people are critiquing can always be better tomorrow than it is today. ",
            "Terrible writers still garner an audience.\n\nAudiences still enjoy terrible writing.\n\nTerrible writers still get paid.\n\nSo what's to be afraid of?\n\nTherefore, no fear.",
            "Write for yourself, if you end up loving your work, why wouldn't there be others who would love it too? Don't put pressure on you as if you were supposed to be the next best author in the entire world, the feeling is gonna swallow you open and make you hate what you're passionate about: writing. Don't force it, let it come naturally.\n\nAlso... The fear prevents you from writing? So you can't judge your own work with your own eyes because you don't write, are you sure it's not an excuse to postpone or something? I'm saying it in a direct way, sorry... Most people who publish their works are only known in their very specific genre, and someone in the street wouldn't have heard of them at all. Just like many singers are never 'famous', but it doesn't mean their songs are bad, you know? If you see the good things in your story, if you try your best, if things are coherent and you feel emotions and all when you read your own story, there will always be people who will see those good things too and love them!\n\nYou have to believe in yourself and your aptitudes, because the only thing keeping you at bay aren't people's comments, it's only yourself for now. Disconnect yourself from all of that, and let your ideas flow.",
            "I have been listening to “372 pages I’ll never get back” (the podcast) and found myself envying the authors. I realised that if anyone cared enough to read my writing in-depth and found it “terrible”, it’s fine by me. \n\n- You’re the worst pirate I’ve heard of\n\n- But you heard about me\n\n… sort of deal",
            "There are plenty of bad movies and badly written books with tons of fans. A lot of random fans are able to write better endings for Game of Thrones for example.\n\nSo I may not be super good, but I know damn well I'm at least better than some Hollywood nepotism baby or those who got in due to connections. It gives me peace and confidence.",
            "be delulu",
            "I don’t fear it at all. I know that my prose is decent, my writing is clear, and my technique is acceptable. Somebody may dislike my craft, but that’s fine, arts are always subjective. I know where my weaknesses are and work to improve on them, and I know where my strengths are and keep at them. What is there to fear at all?",
            "I just don’t care. It’s probably more difficult if you’re trying to make a living off of writing, but I just do it because I enjoy writing",
            "I I understand what you mean and I haven't published anything either. My plan for now is finish writing a book before i post anything, this way I won't let any comments demotivate me. Once it's done I will post it, and if it sucks then I will take the criticism in consideration for the next one and I will be a bit more practiced. And if somehow people like it then I will continue it.",
            "Don’t go to reddit looking for constructive advice. It’s not a good place for that, I hear many ppl complain that ppl just get downvoted into oblivion when they try, and anyways when most writers recount sharing their work, its with close friends, writer-friends, family, you can choose who specifically, but they can actually give you proper feedback. Rather than anonymous online people who will most likely throw the book at you about your grammatical errors and skill issues and any sort of cruel stuff you can get away with no consequences online. Your writing, however good, will always be terrible to someone out there. You are writing because you like writing, because you feel you have something to say. ",
            "I honestly don't care as long as I enjoy what I write and there's some people who enjoy it too and find excitement in my plots. I'm not doing this professionally for that very reason, so that I can stay true to my liking and do it the way I enjoy",
            "By not giving a single F about what other people think.  A good % of negative reviews on books I’ve seen are nothing more than people trying to sound smarter than the author, and the rest are trolls. They’re almost never constructive. The very few reasonable bad reviews end up getting buried. Sad world we live in.",
            "I’m going to let you in on a little secret. \n\nEVERYONE is a bad writer. Or at least has been a bad writer. I’m a bad writer. You’re a bad writer. Tolkien was a bad writer. Shakespeare was a bad writer. \n\nEVERYONE is a bad writer until they actually start writing. THEN they start to get good. \n\nNow maybe you’ll be terrible. Maybe you’ll be amazing. But until you actually start, you’ll just be a terrible writer. And yes, you won’t get it right immediately. Nobody does. And nobody should ever expect you to either. Then again, you wouldn’t expect someone to become an Olympic athlete on their first try either. You get better with time and effort and practice.\n\nThe only solution is to actually start writing. And grow a thicker skin.",
            "Get external validation from someone who knows what good looks like. Be that a beta reader, critique partner, reviews, whatever. From doing this, I know I'm not terrible and am actually half decent.\n\nIt took me a long while (four books).to start believing it, but now enough people have told me that I can't not believe it.",
            "Ignore anything that's not constructive criticism. If someone just says \"your writing sucks\" that's not helpful and to me that says they may not even have a real complaint. Some people just like to insult others. But even if they had a legit reason it doesn't matter cause we don't know what it is. \n\nIf someone says \"it dragged on\" or \"the MC was too overpowered\" or things like that then you can use that to improve your writing. See this in the positive light that you can do better next time or improve the piece itself.\n\nBut it also has to be something more than one person complains about. If 100 people love your style and only 1 complains about it then I wouldn't worry too much. No book is universally loved so you also have to know that there will be readers that just weren't your target audience.",
            "I go to B&N and read the first few pages of some of the new releases. Then I don't feel so bad.",
            "I'm currently working on chapter 1 of my comic, which I'll release once it's done. I don't really have a worry on, (assuming people find it and read it), if they like it or not. art is all subjective, but there's some sort of linear improvement structure that occurs in writing. no matter what, in a few years, you'll look back at your first book, or chapter 1, or whatever release structure you're using, and you'll cringe, going \"agh!! I could have written this so much better with my current skillset..!!!\", but that's fine. that means you've improved.  \n\n\nI've been planning my comic for years now, and I'm finally doing chapter 1 (I've almost finished thumbnailing; that's 'first draft' for you novelists'), and I'm happy with how it's coming out writing and art wise. are you happy with yours? if not, that's OK, you just gotta keep working hard. art is a gradual process of infinite improvement as long as you can take that criticism and turn it into something positive, aiding your creative process.  \n\n\npeople actively looking to hurt others will always exist; you'll never change their minds no matter how good or bad your writing is, so don't worry about them. focus on actual criticisms and how you can improve from them. if you can believe in your ego while still retaining a sense of not being above others, you'll become a great writer, because to be a good writer you have to:  \n\n\n1. do your best and believe in what you're doing and that you'll do great.  \n\n2. stay grounded and don't become conceited; understand that you, aswell as all writers, are imperfect.",
            "Something I learned after I started publishing: reviews are for the readers, not for us. They aren't the things that will help us improve our writing, or the constructive feedback we need. Those come from editors and beta readers. \n\nI used to read reviews. Some made me so happy, others pissed me off. Until it clicked that I was invading a space that really didn't belong to me. So, I ignore them, and go on my merry way.\n\nAs for forums, I've never posted anything but fanfic in public websites, and when you do criticism might happen: it's inevitable. But you have to be able to filter things that are relevant and you agree with, from things that are someone's personal taste. You'll never please everyone. Just write what you love."
        ]
    }
}