{
    "Game Club - Vote for July's game": {
        "title": "Game Club - Vote for July's game",
        "score": 8,
        "url": "https://www.reddit.com/r/XboxGamePass/comments/1dgo8h6/game_club_vote_for_julys_game/",
        "content": "Our partners at r/GamePassGameClub have their nominations open for next months game. Please give them a visit and take part in sharing your experiences with other community members.\n\n[https://www.reddit.com/r/GamePassGameClub/comments/1dgkkax/looking\\_for\\_suggestions\\_for\\_previous\\_runner\\_ups/](https://www.reddit.com/r/GamePassGameClub/comments/1dgkkax/looking_for_suggestions_for_previous_runner_ups/)",
        "num_comments": 0,
        "comments": []
    },
    "What’s a good long game I can play?": {
        "title": "What’s a good long game I can play?",
        "score": 29,
        "url": "https://www.reddit.com/r/XboxGamePass/comments/1dlnml0/whats_a_good_long_game_i_can_play/",
        "content": "I’m looking for a good quality long game that will take like 40+ hours. The games I usually play are survival rpg and story so should what Should I try?",
        "num_comments": 92,
        "comments": [
            "The Yakuza games are great and they can be fairly long.",
            "Fallout 4.",
            "Elder Scrolls games",
            "Yakuza / Like a Dragon games",
            "AC Odyssey",
            "I just started Starfield and really digging it.",
            "Will always recommend mass effect legendary edition to anyone who like a good RPG and story",
            "Lords of the fallen",
            "No Mans Sky",
            "Persona 3 Reload. Took me 100+ hours but seen some people finish it in 80",
            "Morrowind, New Vegas,  Skyrim.",
            "Oblivion",
            "Fallout 76",
            "Can't remember which is on game pass, but assassin's creed origins, odyssey and Valhalla all provide a huge amount of content and story. It's whether you want to extend your 40hr to a higher value is the question",
            "Ac Valhalla or Odyssey\nJedi Survivor\nFallout 4",
            "I put about 40 hours into The Outer Worlds and it is a fun RPG with an interesting story.",
            "Octopath traveller or Lies of P. Some argue lies of p is a short game but if you suck it'll take way longer lol",
            "Witcher 3",
            "Quantum Break (but it's not very long)\n\nControl\n\nTomb Raider: Definitive Edition",
            "On Gamepass? \n\nStarfield and Fallout 4 have that exploration RPG vibe, both big games with decent stories. Fallout also has sort of survival elements with it's looting and crafting.\n\nFor something a little different, try the Octopath Traveller games. More classic RPGs but both excellent, fantastic stories and a really engaging battle system. \n\nIf you're willing to step outside Gamepass, others have suggested some great games. The Witcher 3 would be my top pick if you haven't played it.",
            "Grounded, if you haven't played it already",
            "Ghost recon wildlands and ac origins, both games so long I’ve still not beat and they’re pretty good with some reasonable criticisms",
            "I just saw that My Time at Sandrock is on there. I put WELL over 100 hours into that one on PC. That would be my choice for you.",
            "Bit of a wildcard but you may enjoy fallout 4’s survival mode.  For me it’s been a perfect balance of story, immersion and challenge. \n\n\nI recently dove back in due to the series x enhancement and binging the tv show and decided to give survival a whirl. \n\nEspecially after seeing this video on why survival mode is a masterpiece - https://youtu.be/DVHQcm-NBwc?si=_jv5OSd4ad-jQ7l8\n\nIt’s the most fun I’ve had with a Bethesda game yet, I’m engaging with the systems 10000% more having to build settlements and resource bases and learn the map. I’ve had to really consider what I’m carrying and all my various survival meters and stats. Also there’s no fast travel so stocking up and heading out you never know what may happen or who you’ll run in to. \n\nI’d give it a 10/10 right now",
            "Morrowind - once you get past the learning curve and accept its idiosyncrasies it's a deeply rewarding game",
            "Resident evil 2 or 7",
            "Dayz",
            "Survival rpg? the only right answer is Valheim",
            "Monster Hunter World",
            "Saw this exact question asked in another sub and saw Warframe as an answer. It's not on gamepass but it's free to play and you don't need to spend any money on it. It seems so far like there's just a ton of content to get into. I'm having fun with it despite the fact I have no idea what's going on 🤣🤣🤣",
            "If you don't mind jrpgs Tales of Arise is great",
            "Yakuza 0",
            "Yakuza 8 like a dragon, octopath traveler 2, lords of the fallen",
            "Mass Effect 1,2,3. Legendary Edition contains all three remastered.",
            "Yakuza 0",
            "Play the S.T.A.L.K.E.R series, very good games.",
            "If you wanna try something different: Persona 3,4 or 5. Persona 5 Royal is often listed as the longest pure story game around.\n\nI am currently playing Middle Earth: Shadow of War. It is very fun, and even though the story is not all that great, it is a fine backdrop for the action. It is mostly just a long game with lots of orc murdering",
            "If you're a man of culture and don't run away from a game just because it's a visual novel, then you could try house in fata Morgana.\n\n Long survival horror are like non-existent, but you could play the silent hill saga in you haven't yet.\n\nThe Witcher 3 and mass effect have such amazing stories and writing, even if the gameplay could be a wall for some people I guess. \n\nFinal fantasy games got some of the best fantasy stories you could experience in your life, but they're old and JRPGs, so idk. \nIn case, FF 9 should be the most balanced one, or you could try the 16, it should have a nice story but I didn't play it yet.",
            "My time at Sandrock is on gp now. It's good.",
            "Telltale the walking dead",
            "Marvel's Midnight Suns",
            "Prey",
            "Mount and blade bannerlord should still be on gamepass, it has somewhat of a story but sandbox mode is best. Deep lore rpg set in medieval times.",
            "Jedi survivor",
            "Final Fantasy XIV is free with trial account on Xbox. No subs required.",
            "Elden ring",
            "Monster Hunter Rise (I'd also recommend World,.but it's STILL not on Game Pass💀💀💀)",
            "For story, look no further than persona 3 reload!!",
            "mass effect legendary edition if youve never touched them.",
            "The Witcher 3: Wild Hunt (Action RPG)\nEmbark on a captivating quest as Geralt of Rivia, a monster slayer for hire, in this open-world action RPG. Explore a vast, beautifully crafted world teeming with life, from dense forests and bustling cities to monster-infested swamps. Unravel a dark and mature story as you make difficult choices that impact the world and your relationships with characters.\n\nRed Dead Redemption 2 (Action-adventure)\nImmerse yourself in the Wild West in this epic open-world action-adventure game. Play as Arthur Morgan, an outlaw caught between his loyalty to his gang and his own ideals. The game features a compelling story, stunning visuals, and immersive world that encourages exploration.",
            "the octopath games?",
            "Elden Ring",
            "Baldurs gate 3 took me 120 hours to finish, you can easily do more if you want to finish all the Quests and explore more.",
            "Lies of P",
            "Lord of the fallen",
            "I put over 100 hours into Cyberpunk...and the excellent dlc!",
            "I've heard Baldur's Gate 3 is very long but depends on your gameplay style",
            "I just started the 2018 god of war on PC. I love, mainly because of an (for me) ideal balance between story driven and gameplay. im 23 hours in with maybe 30% completion so far. And best thing: in September, God of war: Ragnarok will be released for PC",
            "Red dead 2",
            "Elden Ring :)",
            "Cyberpunk",
            "Hello sir, did you always want a bright and colorful world? Wanted to have to make really meaningful choices? See both things you love and hate and be frustrated that there is no black and white but also see the beauty of world being portrayed in grey scale, because even evil thing are not ultimately evil? Do you like fantasy setting, based on one of most popular systems played worldwide?\nBoy oh boy do I have a treat for you - Baldurs Gate 3 have it all.\nAnd if you can play beyond those 40h you mentioned even more things await outside character creator!",
            "Came to suggest this, the Mrs and I are currently going through all of these.\n\nSo far, we've finished Yakuza O, Kiwami 1, Kiwami 2, Like a Dragon, Judgment and Lost Judgment, right now we're on Yakuza 3.\n\nThis has taken a while, these are not short games. \n\nWe still have Yakuza 4, 5, 6, Gaiden, Ishin and Infinite Wealth to go.  😀",
            "Came here to say this",
            "I also just started it on PC and I'm loving it, so I second this recommendation",
            "Such a fun game for 60-75 hours. I stopped after that but was fun for that long.",
            "If you go all in on this game it’s easy to sink 100s of hours. The first 2 months after release I’m embarrassed to say I got about 500 hours in the game. I went everywhere. Scanned everything. Done all side missions and every faction quest. Done all I could find before NG+1.",
            "Came here to say this, it’s the best 🙌🏻",
            "First 10 to 20 hours max.",
            "Literally the three best games ever",
            "I'm enjoying this right now.",
            "If you don’t like the spirit realm (or whatever it’s called) at first, does it eventually click? I quit after an hour just getting annoyed with that mechanic",
            "Got 250 hours into NMS I love it.",
            "All of them are.",
            "The Witcher 3 is on GP?",
            "Tales Of Arise is good, I really enjoyed it but I feel it is lacking compared to previous entries in the series.  I can't quite quantify how but I just enjoyed Symphonia and Vesperia so much more.",
            "That's long? I finished done fallen order within a week's I'm curious",
            "Why are you recomending a game that is not on game pass?",
            "Its not on gamepass.",
            "Really good game but thats not gamepass, its steam and its $50",
            "This was a lot of words to not recommend a Game Pass game",
            "Unfortunately this isn’t a gamepass 😢 game but your not wrong I’m loving baldurs gate 3 I’m honestly about 60hours in and I’m still on act one 🤣",
            "Such an odd order since LaD is set after 6 with Judgment just before then Lost Judgment/Gaiden go hand in hand.\n\n0, 1, 2, 3, 4, 5, 6, Judgment, LaD, Lost/Gaiden then Infinite.",
            "you can get out of the umbral realm by resting near a vestige",
            "Not really. It's not a really well thought out aspect of the game. Especially with how critical it is to it. I quit after like 10 hours mostly due to not wanting to deal with it anymore.",
            "No, it’s not on Game Pass.",
            "Ah didn't see the subreddit",
            "Ah right. I bought it on a steam key site, never had issues. You get a key and can redeem it in steam. Was ~18 €. But fair point",
            "I didn't play them in that order.    Was just listing them as I remembered them.\n\nThe actual order we played was:  0, LAD, Judgment, Lost Judgment, Kiwami 1, Kiwami 2, now on 3.",
            "Story wise the nerds will still say it's not optimal. But enjoy, these are amazing games, and always great to hear that more people are enjoying them ❤️",
            "It's cool, I don't worry about playing things optimally.  These are amazing games, and Reddit isn't real life.\n\nHope you have a great day.",
            "Exactly. I actually think it makes kinda good sense to play them like this, since you got to try out all 3 different directions first: OG Yakuza brawler, judgment/detective style and JRPG/LAD\n\nAnd have a great day too 😊"
        ]
    },
    "Looking for a game with quick missions or matches": {
        "title": "Looking for a game with quick missions or matches",
        "score": 7,
        "url": "https://www.reddit.com/r/XboxGamePass/comments/1dlu2so/looking_for_a_game_with_quick_missions_or_matches/",
        "content": "The preference is to play a game where I can spend 10-20 minutes on a mission and be done or if I’m feeling it to play a few of them and then stop. Minecraft dungeon has been great for this as well as things like Mario kart or Mario party mini games. I’m not looking for story, because I don’t want to dive into a story and either get hooked into playing too long or forgetting what was happening after a long break",
        "num_comments": 8,
        "comments": [
            "Depends if you are interested in rogue-likes, where runs usually take such time. Dead Cells or Slay the Spire might be a good examples.",
            "Aragami might be good for you",
            "Use the site \"how long to beat\" and it gives times for games and dlc's",
            "Chivalry 2 - a team objective map takes about 15-20 minutes. No story, easy controls, just swing your weapon and enjoy the chaos. \n\nBroforce - run n gun, side scrolling shooter. A lot of maps take maybe 5ish minutes.",
            "Try Overcooked 2! Short sessions, no story, and hilarious with friends or solo.",
            "Evil West.\n\nMight be a bit too much story for what you want but it's very linear and frequent checkpoints. Each level is essentially a series of arenas. Beat a load of dudes, move to next arena, checkpoint, beat a load of dudes etc etc.",
            "Boltgun scratched that itch for me. Simple, fun, no big commitment needed.\n\nI only played the first couple of levels but each of them was 10-20 min long",
            "Broforce, just play."
        ]
    },
    "Fun family games?": {
        "title": "Fun family games?",
        "score": 3,
        "url": "https://www.reddit.com/r/XboxGamePass/comments/1dlt25u/fun_family_games/",
        "content": "Looking for games that me and my son, who are gamers, can play with the wife who hasn't played a game in 15 years.\n\nSo something fairly easy to pick up that is either multi-player or that is fun to watch so we can take turns.\n\nIt doesn't have to be on gamepass but it is very convenient if it is.",
        "num_comments": 2,
        "comments": [
            "It takes two",
            "I would definitely recommend any of the Lego games! It is 2 player couch co-op, and there are tons of them out there, so you can get the game for whatever series you like! Star Wars, Marvel, Jurassic Park, Harry Potter Lord of the Rings, etc."
        ]
    },
    "What's up with all the non-gamepass game advertisements on the gamepass home screen?": {
        "title": "What's up with all the non-gamepass game advertisements on the gamepass home screen?",
        "score": 23,
        "url": "https://www.reddit.com/r/XboxGamePass/comments/1dli38o/whats_up_with_all_the_nongamepass_game/",
        "content": " For example when I open gamepass they have a big advert for the \"Game pass add-on sale\" but some of the games aren't even on gamepass, like hogwarts legacy, AC mirage, borderlands 3, ghost runner, farcry 4, midnight sun's, metal hellsinger, etc.\n\n Do they have plans to add those later or am I getting my hopes up for nothing?\n\n\nEdit: ESO actually is on gamepass but wasn't showing up when searching. My b.\n\n ",
        "num_comments": 9,
        "comments": [
            "The sale is exclusive to game pass subscribers hence the name",
            "It's because Xbox Live Gold has been renamed \"Gamepass Core\", so to access those sales, you need at least Gamepass Core for the discounts.",
            "Sometimes you get free add ons in your gamepass perks. Even for games not on gamepass. So you might get a free outfit or map for any game available on Xbox, even if the game isn't a gamepass freebie.\n\nAlso, technically all Xbox games are available on gamepass. They're all gamepass games, they're just not all free with gamepass.",
            "Probably because of ESO perks that you can claim as part of GPU",
            "They want to sell Xbox games. Shocking, right?",
            "They are just advertising hoping people will see a game they want and buy it. Not all that suprising. Its like asking why theres commercials on tv",
            "It’s a sale for people who have game pass and Xbox probably expects users to have non game pass games like me with ghostrunner but I get where you’re coming from I think it would be smarter to discount GP games dlcs in the sale more",
            "This is the answer. Used to be called “Deals with Gold” but they changed that in favor of confusing labels and every subscription being a form of gamepass. Honestly very on brand for Xbox",
            "This guy gets it. “What is up with the game pass ads for games Microsoft owns. “ it’s almost like the OP has never seen an ad"
        ]
    }
}