{
    "r/Xboxone has moved to r/Xbox, please join us there for all your Xbox news and discussion!": {
        "title": "r/Xboxone has moved to r/Xbox, please join us there for all your Xbox news and discussion!",
        "score": 0,
        "url": "https://www.reddit.com/r/xboxone/comments/1d5lhnp/rxboxone_has_moved_to_rxbox_please_join_us_there/",
        "content": "r/XboxSeriesX and r/XboxOne have merged with r/Xbox to have it be your one stop shop for all Xbox content on reddit. Certain things are still in separate subs like all tech posts in r/XboxSupport , but all your news and discussions around Xbox will all be centralized in r/Xbox!",
        "num_comments": 0,
        "comments": []
    },
    "Xbox Games Showcase Followed by Call of Duty: Black Ops 6 Direct": {
        "title": "Xbox Games Showcase Followed by Call of Duty: Black Ops 6 Direct",
        "score": 44,
        "url": "https://www.youtube.com/watch?v=ZZ6gafqCjsY",
        "content": "",
        "num_comments": 0,
        "comments": []
    },
    "Microsoft's new Copilot AI will be inside Minecraft, and other Xbox, PC games": {
        "title": "Microsoft's new Copilot AI will be inside Minecraft, and other Xbox, PC games",
        "score": 98,
        "url": "https://www.windowscentral.com/microsoft/microsofts-ai-will-be-inside-minecraft-and-other-xbox-pc-games-new-copilot-features-will-search-your-inventories-offer-tips-and-guides",
        "content": "",
        "num_comments": 23,
        "comments": [
            "As long as they allow swearing Im ok with this rather than having to put down game to go google ad filled articles.   For example \"hey co-pilot, how the fuck do I solve this damn puzzle\"",
            "Wtf is it gonna do in minecraft. Unless it lets villagers speak and say stuff like “I saw an illager tower thataway” i dont need it",
            "the revolution has begun",
            "Hello",
            "Fuck AI, no one wants this shit",
            "All the more reason for me to never buy anything PC or Microsoft related ever again.",
            "I tried Capilot on my pc, and it simply just did not connect. I assume it's basically just Cortana A.I? Same as Google voice and apple siri.",
            "Coop games you can play with half decent ai and still get achievements for sounds pretty badass",
            "Damn this sucks, copilot is fucking terrible and possibly the least reliable/accurate chatbot ai I have seen. It’s almost incapable of answering most questions but will spit out paragraphs of unrelated nonsense all day.",
            "Other than money, why?",
            "I wonder, who asked for this. I mean, is there players asking for this actually?",
            "Seriously all I want is a minecraft game where an AI system takes a village and makes it a fully fleshed out society that you take part in. Natural \"quests\" specific to the random gen geography, traders, a military, always different every game. \n\nCould be worth another playthrough",
            "I am new to MC. it'll teach me how to craft stuff i hope.",
            "That would be nice... But it's more like a dashboard that pops-up and you can ask \"how does that game work\" or \"how can I craft a XY\". So still *meh*",
            "Hi",
            "But technically, and elon musk, cyber truck, advancing bro.\n\n/s\n\nSeriously, I have a tech bro as an inlaw and it's annoying hearing him talk nothing but tech bro stuff.",
            "Never used ai in my whole life, and I'm glad",
            "It's shocking how bad it is considering it's based on GPT-4.",
            "This isn't the Xbox version of \"game help\" auto play AI game thing? Idk I can't ever get on with it within telephone call menus for example and so on",
            "This is like boomers and silent gen bragging they never used email. Like, I'm not telling you to go out and make bad art with it, but flat out refusing to use a tool just seems silly.",
            "At least you agree that ai is ruining YouTube \n\nPlus, I haven't used it cuz there is nothing I want to do with it,\nAll I'm using is google assistant 😅",
            "I work in IT adjacent fields, so i use it more than google these days to look up simple commands and syntaxes that i havent memorized, since google has ruined SEO and filled it with absolute garbage and videos instead of just giving me the fucking answer. "
        ]
    },
    "I can't find any answers but I've always wondered why the download speed isn't actually what it says it is. I average 800mbps but in reality it's probably 70mbps looking at the bar. Any answers?": {
        "title": "I can't find any answers but I've always wondered why the download speed isn't actually what it says it is. I average 800mbps but in reality it's probably 70mbps looking at the bar. Any answers?",
        "score": 43,
        "url": "https://www.reddit.com/gallery/1cwpcvu",
        "content": "",
        "num_comments": 49,
        "comments": [
            "Are you confusing M**b** (megabits) with M**B** (megabytes)?\n\nFile sizes are typically expressed in bytes, while download speeds are typically expressed in bits. \n\nThere are 8 bits in a byte.\n\n800 Mbps = 100 MBps.",
            "Yeah I wouldn’t complain about downloading 7GB every 60 seconds.",
            "Imagine trying to download a file that size with early 90's dial up internet. Yeah, you can play your game in 52 years",
            "That's a damn good speed. You're effectively downloading 80MBps. If that was consistent, you could download that 88Gb file in about 20 mins.",
            "Ik this is off topic but why can't I make a post?",
            "The whole thing is based on Storage versus DL speed, peoples think it's the same unit, but it isn't.\n\nStorage work at the power 10 unit and the rest work with power 8.\n\nWhich makes it so the higher you go the bigger the number difference is.\n\nEdit:\n\nHere you can see an example in that article : [Article on Storage ](https://www.ionos.ca/digitalguide/websites/web-development/units-of-storage-in-computers/)",
            "This is somewhat different than what you are asking but for some reasons my consoles have always seemed to download slower than any other device in the house. PS4, switch, Xbox x, and stream deck all run well below my actual speeds. I’m probably missing something but just wanted to add.",
            "I download games a kbps sometimes 😭. Country livin",
            "2.5gz or 5gz?",
            "It's installing also",
            "Wow - I live in the countryside in Scotland - and I get a maximum of 5mbps - I cry a lot and cuss",
            "[deleted]",
            "my mbps is 290",
            "My son doesn’t have internet at his moms house what Xbox one games can he play that doesn’t require internet",
            "How did you check the download speed on the xbox (second picture)",
            "Finally a fellow Broforce player. Definitely one of the most underrated games I've played.",
            "Mine is the same way",
            "Ede",
            "When your playing while it's downloading. The download speeds turn very slow",
            "Isn’t the Xbox one x supposed to automatically update games overnight when it’s off? I turned it on today and a game needed to update.",
            "You are downloading at a very good speed. Remember though. Sometimes depending on the source you are downloading from and how busy it is. Can depend on how quickly you are able to download it.",
            "It will also vary depending on if you’re using WiFi or connected straight to the router at least it does for me. A lot more efficient and quicker connected straight to the router with a higher nat type cable. Done both ways with my Xbox x/ ps5  hard wired increased it from WiFi download speed saying an hour to hard wired complete in 10 min.",
            "Try cleaning your cache or better yet unplug everything that uses the internet in your house for like 5-10mins, go make a sandwich or something & then plug everything back in. This allows the cookies in your home network to break down & reset thus allowing faster internet speeds this should be done about once a month or so.",
            "Wtf with your internet connection why it's so high I have with luck like 16mbp",
            "And I've learned something new today, I feel so dumb🤣. I never noticed that my games had uppercase B but the download speed was lowercase. Thanks lol",
            "Ikr I struggle to keep a stable 30 Mbps",
            "Yeah, in Rochester Mn we have amazing fiber. I am still amazed that I can queue up a 100 gig game, putz around for 10 minutes and come back, sit down and play.",
            "old internet was 8mbps lol took 1 hour for 3GB",
            "Yep, it took 15 mins",
            "I forgot about that tbh, thanks for the link. I'll check it later! If it's not mentioned in there, there's also the read/write speed on the drive. Hdd's especially bottleneck downloads.",
            "It's just me thinking the download speed was mega bytes and not mega bits",
            "Your storage write speed is also a large factor. I recently replaced my xbox one x hdd because it was reading and writing at less than 1mbps when my download speed is over 100 times that",
            "Buddy this is an Xbox subreddit, no shit any problems in this sub don't relate to anything else. Use your head",
            "sorry, is Mbps",
            "Any single player story games are probably the best.\n\nRed dead Redemption\nA plagues take\nFar cry\nCyberpunk\nJedi fallen order\nJedi survivor\nDeathloop\nDead space\nMetal gear solid\nBorderlands\nLife is strange\nThe quarry\nMass effect\nWolfenstein \nBatman\nHellblade\nWalking dead series\nHalo\nTomb raider\nUncharted",
            "Network settings and test network diagnostics",
            "800mbps average with Ethernet plugged in, 500 without",
            "its very common to get confused. The only differentiating factor in the acronym is the letter casing 'b'",
            "Congratulations, you've learned the most important distinction in ISP marketing",
            "> I never noticed that my games had uppercase B but the download speed was lowercase.\n\nWho would though? \n\nAnd even if someone did notice, they likely wouldn't think that it meant anything significant. :)",
            "On steam with pc they use megabytes per second which is useful. Can't understand why xbox or ps don't do the same",
            "Think you will find old internet (dial up) was 56kbps",
            "One song took 7 hours",
            "1 hour for 3GB?!  What next gen world did you live in at the time :-)\n\nSitting over here with my 2400 bits/s baud modem.",
            "Not always. I've had things take 4 days and that was less than 1 GB",
            "Also, not everyone had that speed of internet. Just like today, some people have better internet than others do. Location and money are always a factor",
            "Enjoy! 😁",
            "Because people get upset on steam that they can only download 100MBps when they should download 8x that as they have 800Mbps from their ISP and blame steam for it being slow.",
            "1200/75 and before that 300 baud on an acoustic coupler, I used to sell both at Tandy in the UK (Radio Shack for everyone else)"
        ]
    },
    "Exclusive Xbox One and below titles not on PC?": {
        "title": "Exclusive Xbox One and below titles not on PC?",
        "score": 13,
        "url": "https://www.reddit.com/r/xboxone/comments/1cwmbti/exclusive_xbox_one_and_below_titles_not_on_pc/",
        "content": "I'm planning to get a One X but it would really be a shame to spend on a whole console just to play 2 entries of the Ninja Gaiden series. I already have a decent PC so it feels even less worth it",
        "num_comments": 26,
        "comments": [
            "Halo 5",
            "Rare Replay",
            "https://en.wikipedia.org/wiki/Hunter:_The_Reckoning_(video_game)\n\nand its sequel.",
            "There are many, many xbox and Xbox 360 titles that are not backward compatible and were exclusive to the platform. Too many to list.",
            "Halo 5 and Forza Motorsport 5",
            "Lost odyssey, Dante's Inferno, Asura's Wrath, and Resident Evil Code Veronica X are some xbox games I picked up that don't have pc ports.",
            "I totally feel where you're coming from! I mean, with the shared libraries across Xbox and PC for many games, it can be hard to justify buying the actual console if you're already set up with a strong PC. \n\nBut, let me tell you, even though the Xbox One doesn't have as many exclusives as, say, the PlayStation 4, it does have some titles that are well worth investing in a console for. You mentioned the Ninja Gaiden series which is phenomenal. Some other games, like Halo: Master Chief Collection, Forza Horizon 4, or the Gears of War series, also offer great experiences.\n\nYou might want to consider Xbox Game Pass as well. It’s a subscription service that provides access to hundreds of different games, including many exclusives, and can be a pretty great deal. Though plenty of those games are available on PC too, but not all.\n\nAt the end of the day, it just comes down to what kind of games you prefer and what your budget looks like. Maybe you can borrow a friend’s Xbox One for a bit and try it out before you make a decision. Happy gaming!",
            "Gears 1-3 well technically gears 1 is on pc but the other 2 arent",
            "https://web.archive.org/web/20230911112330/http://www.shubao33.net/xbox-one.html",
            "I just did the exact same thing for the Fable franchise a month and some change ago.\n\nFable 2 (available with lots of latency with xcloud), and it's an absolute pain to not only purchase but get Fable 3 working on PC",
            "Sunset overdrive",
            "Sunset Overdrive (a game by Insomniac, the people who made the 1st Spider-Man on PS4).  I bought a One S for cheap, and decided that, Radiant Silvergun, and the ability to play Splitgate with my sister was reason enough.\n\n\nEdit: just also remembered that I plan to play PREY 2006. That was a PC/360 release, but the 360 release is the simplest way to play it. N+ was also a great 360 game, but it was delisted. You get the same experience playing N++, though.",
            "Occultic;Nine.",
            "It's also just the experience of sitting on a couch and only having to pick up a controller. With PC, even if you connected it to the tv, you'd still have to load into windows, stretch the mouse, keyboard and controller across the living room, click on a bunch of things etc and there's still this PC look on the screen. A console has a different vibe.",
            "Huh? There are more than 2 Ninja Gaiden games playable on Xbox One. Ninja Gaiden 1-3 (both the separate games and the master collection) and Sigma 1+2 are playable on Xbox One. That’s all the Xbox had.",
            "Halo wars 2?",
            "Technically you can play forge and custom games on windows 10, but yeah, the actual game itself is exclusive to Xbox.",
            "There's a sequel that's playable on Xbox one?",
            "Also Judgement.",
            "I mean gears 1 has the remake that's avaliable on PC. I know the og release was buggy as he'll.",
            "That's on Steam.",
            "Wrong place for your comment. It makes no sense here",
            "I mean the only ones exclusively on Xbox were the original Ninja Gaiden, Ninja Gaiden Black (essentially the same game as the 2004 one but better) and the OG Ninja Gaiden 2. The Sigma variants and Razor's Edge are on PC.",
            "That was on PC day one",
            "Hunter: The Reckoning – Redeemer\n\nThey are not in marketplace though you have to buy the disks is the one downside.",
            "I forgot about that. Sorry"
        ]
    }
}