{
    "LIKE A DRAGON: INFINITE WEALTH DISCUSSION MEGATHREAD": {
        "title": "LIKE A DRAGON: INFINITE WEALTH DISCUSSION MEGATHREAD",
        "score": 214,
        "url": "https://www.reddit.com/r/yakuzagames/comments/19f24pz/like_a_dragon_infinite_wealth_discussion/",
        "content": "Hello, everyone! RJTM1991 here. Hope you're all safe and well!\n\nLike a Dragon: Infinite Wealth is almost here!\n\nEach chapter will have it's own discussion thread to let everyone chat as they play and avoid any potential spoilers.\n\n**Rules:**\n\n1. Please keep discussion of all Like a Dragon: Infinite Wealth **Main Story Content** in this megathread using **Spoiler Tags**. ***This includes*** **Major Spoilers,** **plotpoints,** and so on. We suggest that you only read the comments of this thread once you have completed the game!\n2. All **Main Story Spoilers** are allowed in the comment section of this megathread but remember those **Spoiler Tags**.\n3. Posts about **Side Content** can be made on the subreddit with the *Infinite Wealth* spoiler tag.\n4. Please discuss each chapter of the game as you finish it. There is no need for **Spoiler Tags** in these **dedicated threads**. Be sure to only discuss content related to the Chapter in the title of the thread, and not anything after it!\n\n[Chapter 1](https://www.reddit.com/r/yakuzagames/comments/19f30kx/like_a_dragon_infinite_wealth_chapter_1/)\n\n[Chapter 2](https://www.reddit.com/r/yakuzagames/comments/19f30pv/like_a_dragon_infinite_wealth_chapter_2/)\n\n[Chapter 3](https://www.reddit.com/r/yakuzagames/comments/19f30u8/like_a_dragon_infinite_wealth_chapter_3/)\n\n[Chapter 4](https://www.reddit.com/r/yakuzagames/comments/19f30yp/like_a_dragon_infinite_wealth_chapter_4/)\n\n[Chapter 5](https://www.reddit.com/r/yakuzagames/comments/19f312v/like_a_dragon_infinite_wealth_chapter_5/)\n\n[Chapter 6](https://www.reddit.com/r/yakuzagames/comments/19f3165/like_a_dragon_infinite_wealth_chapter_6/)\n\n[Chapter 7](https://www.reddit.com/r/yakuzagames/comments/19f3196/like_a_dragon_infinite_wealth_chapter_7/)\n\n[Chapter 8](https://www.reddit.com/r/yakuzagames/comments/19f31c2/like_a_dragon_infinite_wealth_chapter_8/)\n\n[Chapter 9](https://www.reddit.com/r/yakuzagames/comments/19f31g8/like_a_dragon_infinite_wealth_chapter_9/)\n\n[Chapter 10](https://www.reddit.com/r/yakuzagames/comments/19f31j4/like_a_dragon_infinite_wealth_chapter_10/)\n\n[Chapter 11](https://www.reddit.com/r/yakuzagames/comments/19f31mr/like_a_dragon_infinite_wealth_chapter_11/)\n\n[Chapter 12](https://www.reddit.com/r/yakuzagames/comments/19f31pd/like_a_dragon_infinite_wealth_chapter_12/)\n\n[Chapter 13](https://www.reddit.com/r/yakuzagames/comments/19f31s8/like_a_dragon_infinite_wealth_chapter_13/)\n\n[Chapter 14](https://www.reddit.com/r/yakuzagames/comments/19f31v8/like_a_dragon_infinite_wealth_chapter_14/)\n\n[Help/Bug List](https://www.reddit.com/r/yakuzagames/comments/19f3231/like_a_dragon_infinite_wealth_helpbug_list/)\n\nPost-game (Discuss in this thread, but remember the spoiler tags!)\n\nAlso, don't forget that report button. If you see a spoiler, be sure to let us know and we'll get it fixed up. We're always here to help you! Take care and enjoy the game!\n\n\\-The Mod Team",
        "num_comments": 1168,
        "comments": [
            "If you are new to the subreddit, [please read the wiki](https://www.reddit.com/r/yakuzagames/wiki/index/)\n\nReminder that all spoilers need to be tagged with a flair specifying which game is being spoiled. If you want a flair that says something else, you can edit it to say something like [Discussion: Y1 spoiler] or [Majimapost: Y6 spoiler], etc. **THIS INCLUDES CONTENT FROM TRAILERS**.\n\nIf the post is not marked for spoilers, all comments that have spoilers need to be tagged \\>!like this!< along with indicating which game it's spoiling. Example: Y3 >!Kiryu sings!< \n\nIf the post flair is marked for spoilers, the comments don't need to be tagged for the game indicated and the ones before it (So a Y6 spoiler post can have comments with untagged spoilers for Y5, but not gaiden or 7). \n\nIf you see any of the above (or any of the other rules) not being followed, please report it so we can keep this place safe for newcomers and those that haven't finished all the games yet. Thank you!\n       \n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/yakuzagames) if you have any questions or concerns.*",
            "Who the fuck thought it was a good idea to put in a podcast and not have translations?",
            "Just a heads up - the start of the game is meant to be English audio so don't restart the game even if you are unsure you chose Japanese dub",
            "I wish they kept the conversation log that was in Lost Judgment. It helps if I missed some dialogue and wanted to re-read it",
            "Excuse me my Ichiban finished the last game rich as *fuck*, why isn't he living in a mansion",
            "Imo we unlock Joongi Han too late",
            "It sucks that both dubs are flawed in different ways:\n\nJapanese is overall better, but it's pretty obvious that when characters speak English (even if they're not Japanese) the actors are clearly Japanese and/or non native speakers first, even if the character is a white guy. Eric is also odd, for someone who grew up in America he sure does sound like a Japanese person who learned English as an adult. \n\nPlus Danny Trejo not voicing Danny Trejo is just incredibly weird. I feel like Sega Japan and America should have combined their work and had the English dub voices for when people speak English, like they did with that Kson girl, or otherwise cast English actors who could realistically sound like the Japanese ones to switch between. \n\nOr hell, just pull a Tekken and have everyone speak their native language and somehow everyone knows what everyone else is saying.",
            "Just want to share some easily missed small details in post-game: >!(Canonically or not) If you wait a bit in Survive Bar and pay some attention to speech bubbles, Ichiban and Saeko apparently reconciled thanks to Adachi, Saeko still despises 'that' shirt and they're planning their dates etc. !<",
            "Combat being x10 better due to positioning mattering with colleteral/enviormental dmg and having movement really makes the gameplay loop infintelty more fluid and strategic,  perfect guard still an thing that feels interactive and keeps you from falling alseep \n\n\nTraversal through rechargable mini scooter is also amazing, man in having an blast so far ",
            "Just finished the game and I think >!7 has the better story!<",
            "Jesus christ steam please let me in",
            "I love Ichiban so much, him dancing with the homeless was so cute",
            ">!Did Ichiban shove Nancy up his ass? He's stark naked but Nancy shows up on his shoulder and like, where the hell was she?!<",
            "Bleach Japan is to Ichiban’s games what the Vice Minister of Health is to the Judgment series.",
            "The Japanase radio shows have **no** subtitles. Oof.",
            "Just discovered that Infinite Wealth has working escalators, literally the best thing ever",
            "Finished the game yesterday morning, really enjoyed it and I thought the story was overall pretty good. Wanted to sit on it for a day to sift through some of my feelings on it.\n\nSpoilers for detailed thoughts >!I only have two complaints, one being that I wish we had gotten one more Eiji scene between the club stuff and the ending. Honestly I don't even mind that we didn't get a scene where he feels bad; we just needed to know that was him and what happened to him after the stuff at the club. Something like how he got the boot for losing control of Tatara Channel, anything along those lines. Also I really did not the monologue before Bryce's fight, felt way too long and convoluted for things we already know outside of the mafia connection. We've already seen how evil he can be, I think it would have been interesting to see Ichi raring to fight him ASAP. I did like Ebina as a villain though, I felt that his motivation + the reason Kiryu wanted to fight him was good enough for me to accept him as a final boss.!<\n\nAlso one thing I did like that a lot of people didn't (spoiler again) >!I didn't mind that Kiryu and Haruka didn't reunite on-screen, I think it fit well with the final life link where she feels that it isn't able to handle seeing him again. Nice bit of character growth from her end along with Kiryu being able to reclaim his identity. I wish RGG made that one + the Akiyama a mandatory substory instead of avoidable side content that I have to grind for, I think it would have helped that plot thread a bit and avoided the pace being killed for me during Chapter 12.!<\n\nAnd one last piece of praise that hit my brain while writing this >!Yamai might be one of my new favorite characters in the franchise, his end scene was amazing and in general it might be one of my favorite scenes in a Yakuza game. It helps that he got a lot of screen time, but I appreciated that his plot beats were unexpected at times while still managing to feel appropriate for his character. I'm also glad that they're starting to steer away from always killing antagonistic characters off if they've done a bad thing, like Yamai (and to a lesser extent someone like Shishido in Gaiden). Hope he shows up in LAD9 as a playable character.!<",
            "we are so ichiback",
            "Here’s to hoping I can trick my Xbox into letting me play in 4 hours by switching it to New Zealand. \n\nI just can’t believe we got Gaiden two months ago and now we get to experience Kiryu’s final game. \n\nSaying that though, I bet he shows up in the next game running a bar called radiate or something along those lines. ",
            "Can confirm that changing my location to new zealand worked for me on xbox. I’m in.\n\nhttps://preview.redd.it/m0vfj01uikec1.jpeg?width=1192&format=pjpg&auto=webp&s=8ab608a2b5789d8dc98902baa25d6ec0ebc02c43",
            "Jesus, there have been some long intros in Yakuza games before, but this is nuts. This is the slowest opening to any game I have ever experienced, it's not bad, but out of the first 6 hours, 5 of them are cutscenes.",
            "Just a bit curious if anyone happens to know if there's any reason why they just decided to throw a person at the door of pretty much every single shop in Hawaii, not that it's that big of a deal, but by the look of it the interior of the shops seems to be modeled, and you can even see the cashier at the counter. Just kind of weird and immersion breaking that a random person is just standing at the door of every store selling you stuff",
            "the exploding arrow skill seems overpowered",
            "So I’m storming the Seiryu clan and this music is BANGING. This soundtrack is the GOAT.",
            "Gotta say.  Infinite Wealth is a lot more violent than Y7.",
            "Finished the game today. A clear improvement over LAD in terms of systems, gameplay etc but a massive step backwards in the writing department. LAD is a soft reboot and an onboarding ramp for new players, yet its direct sequel sidelines the LAD cast for huge portions to go on long nostalgia trips with the old protagonist instead which'll mean nothing to anyone who hasn't been here from the beginning. This approach is baffling to me and really hurts the overall Infinite Wealth experience for me.",
            "Bruh, I'm working when it comes out, but it will be Australia Day, so with holiday rates, I'll have Infinite Wealth.",
            "Epilogue: The Wonder of U",
            "Some things never change\n\nhttps://preview.redd.it/tti0tr9xjoec1.jpeg?width=1920&format=pjpg&auto=webp&s=c5900f9eb737314eb03162181c9905b7d44ea214",
            "HOW TF DO YOU WIN THIS IT'S SO HARD\n\nhttps://preview.redd.it/jxaxk8lsfigc1.png?width=1891&format=png&auto=webp&s=2f4e6caca0df8ce36fc788baf592a5edaaec9433",
            "So the opening segment of Yokohama Dungeon was hilarious and I searched about it. The bald guy Utamaru is apparently a real person who is a rapper/commentator/radio personality things like that, he together with that other female TV announcer in the other early side quest have a radio show, the one you can hear in the game\n\n[](https://ja.wikipedia.org/wiki/%e5%ae%87%e5%a4%9a%e4%b8%b8)\n\nand apparently in his many other radio show gigs, he had another one that had some annual segment named *オレたちが今一番蹴られたいオンナは誰だ最高会議* \"Who is the girl that we most wanted to be kicked by now?\"\n\nThat is why his cameo included being kicked by Seonhee in the game",
            "CreamAPI works btw, unlocked all DLC for free on the standard edition",
            "It's 2:30 am, just finished the game. Inshallah I'll be able to wake up for Fajr, and also I have a lecture at 9 💀  \n\nThis is definitely the first time I've finished an RGG title being hyped up rather than in tears. Seeing >!Haruka right at the end, with Haruto as well, and that achievement title, \"The man who regained his name...\"!< dude, I'm still stunned. In the last 12 months, we've gotten an incredible remake (Ishin,) an incredible spin off (Gaiden) and an incredible eight entry to the series.",
            ">!That grenade into the helo definitely counts as a kill and god knows where and on who it crash landed into!<",
            "Anyone else having an issue with the Audio Language?? I have it set to Japanese but when I level up or chat with someone on the street, Ichiban switches over to English",
            "my Xbox is a bro for thinking I moved to New Zealand",
            "his face looks real messed up on the pause screen",
            "Oh Yakuza games how much i've missed you.. 1.5 hours in and i've barely touched the controller.. now watching the date montage. Can't wait to buy my chips and popcorn for the future cutscenes, and ocasionally go from cut scene to cut scene",
            "Does anyone know why we don't get free gifts/DLC anymore from being loyal RGG players? \n\nI'm about 20 hours into the game now and still no Bob Utsunomiya doing his Ronald McDonald thing and giving me some free level boosters or whatever!",
            "I’m so overleveled from doing side content.",
            "I finished the game last week, did I miss something about >!Bryce!< ?\n\n>!There was a lot of talk about how he was a monster, and how he hasn't aged in like 50 years was this just a dropped plot point or did I miss a conversation somewhere?!<",
            "Kiryu is edging me",
            "Holy shit! Are ALL the chapters gonna be Elvis songs?! I love this so much hahahaha",
            "Um, were Adachi's arms always that ripped? Good lord, what the hell has he been eating, smaller Adachis?",
            "I'm curious, does anyone else find it strange that Ebina has an irezumi/tattoo?\n\nAs soon as he ripped his shirt off for the final fight I thought it was an odd choice to give him one. Ebina's entire backstory is one of raw hatred for Arakawa and by extension, the yakuza as a whole. Why on Earth would he brand himself with the most iconic yakuza imagery possible?",
            "Are there really NO free DLC or gifts to download when the system checks if you have other Yakuza games saved?\n\nThat's a first, isn't it? They always give you free stuff for being a loyal player",
            "Anyone getting a small bug where Ichiban says hey with his dub voice while playing subbed?",
            "Absolutely loved the game, save per the story, which, to me, was probably amongst the worst in the series, unfortunately. Everything Palekana was far too goofy and detached, we spend half the game in a wild goose chase after some woman who later gets ignored. Also, it's pretty evident this was developed before and alongside Gaiden; there are barely any connections between both games, and those that are actually there are seriously undercooked.  \nThe combat is superb, a massive improvement over 7 and a delight to experiment with. Music was, as usually with this series, extraordinary. Hawaii felt too large at first but ended up being very cozy and fun to explore. Minigames were a pleasant surprise (I hated Dondoko at first, but I ended up completing it in one go because I just couldn't drop it).",
            "ending: >!When is RGG gonna learn to take the easy wins? Not letting us see Kiryu and Haruka? Tossing Ichiban's whole arc of learning to communicate properly and consider Saeko's feelings all for the sake of a gag? The Ichiban and Eiji thing was cool since that's just emblematic of his attitude but the rest of it pissed me the hell off!<",
            "Is there a way to get subtitles for the radio shows (playing with English subtitled Japanese audio)?",
            "I am so glad I watched Yakuza 0 and Like a Dragon before playing this.\n\nPlease do yourself a favor and catch up on the story. Please do not jump into Yakuza beforehand. It is so much more enriching. \n\nA week ago, I had no idea what the story was. But I wanted to play this game, so I watched every cutscene and conversation through the series. So many moments that would not mean anything if you don't.",
            "Now that I finished the last chapter I got to say the ending was kind of... underwhelming. Especially compared to  Yakuza 7's ending, which was incredible. >!I know Ichiban's deal is that he is a forgiving person and yakuza jesus but honestly \"Ei-chan\" was willing to murder a 10 year old child, his last relevant cutscene had him all but laughing maniacally about how he'd transform ex-yakuza into slaves worked to the death, and... he just decides to atone? And trust Ichi again? Out of nowhere?!<\n\n>!And before that Bryce was like \"you guys are stupid, putting a video up on the internet won't change shit, I have the police in my pocket and many infiltrated zealots on the government plus international backing\", and they... put a video online, and send him to the police. Like, Bryce is right, they exposed the nuclear waste scam he was running, but long term he is still like the most influential person in Hawaii' underworld, and probably overworld as well if he has as many zealots in the police force and politicians as the game implies. Chitose's father cancelling him on youtube in japan won't do shit to get him a sentence in the states. Yet the game acts like this was a victory, somehow? Like, even in-universe they point out the reasons this shouldn't be a victory, yet it still is one?!<\n\n>!Also, the Kiryu death fakeout. Every game since 5 has a variation of \"Kiryu's story is reaching it's end\", yet they staunchly refuse to let the character go. If you're going to make his entire gameplay portion be about him remembering his past, and make a plot point that he's dying, and etc, only to then turn around and say j/k, it gets to a point where I just got emotionally detached. I'm sure that the next game they will try to pull it again, and probably the one after it too.!<\n\nBut the weirdest part of the endings for the Kiryu group and the Ichiban is that I feel they were kind of... switched around? >!Like, Ichiban had a much personal attachment Ebina, being a blood relative who is presented as a mirror version of him that is evil, while Kiryu had a much more personal drive to go after Bryce, because Lani being on the run reminded him of Haruka being on the run. And yet it's Ichiban who fights Bryce and Kiryu who fights Ebina. Ebina even makes a \"we aren't so different you an I\" speech about Ichiban, but Ichiban isn't even there so he has to go \"hey Kiryu me and Ichiban aren't so different\".!<\n\nAlso while I like how zany the series can get, I think the >!giant shark and giant squid that can swallow party members who then have to fight inside it's stomach are getting a bit -too- zany. Especially for a thing that is part of the main plot and not a side-story!<\n\n>!(Also am I correct in assuming Wong was going to be a playable character they cut out? He just emanates party member energy)!<",
            "Played about 2 hours already and the music is slapping so hard it's so freaking good lol",
            "Is anyone finding the light in Hawaii too strong? I guess it's intentional but I'm finding it hard to make stuff out. If I change the settings too much it ends up looking shit",
            "Got myself a stupidly good combo of items by chapter 5, Dragon Boots (from Kei I think at 100 friends) and the Pareo of happiness (I don't know what quest dropped this), and in short, the boots gives you a random buff each turn, and the pareo gives you a heal each time you get a buff. So easy regen each turn!",
            "Hot damn this game is good. It feels like they addressed everybody's problems with Y7 and added even more to it. Combat is way more engaging and fun and the new area of Hawaii is a breath of fresh air for this series. Having an absolute blast here.",
            "LOL at Ichi beating up americans like Cole and Steve and Dave",
            "I aspire to be half the man Ichiban is",
            "Not gonna lie, I was expecting the worst with Yong but I'm pleasantly surprised he did a pretty good job! The old saying holds true, \"don't judge a book by it's cover\".",
            "Anyone else feel like Kiryuu kinda overshadowed Ichiban?",
            "Now that Y8 is unlocked I am playing the [real yakuza game mode](https://i.imgur.com/KS2ZzF1.jpeg)",
            "If anyone wants to share their Dondoko Island tag and user ID i'll search for you and give your island a visit.\nHere's mine\nTag: Natural Wonder \nID: Legendary Bum",
            "Just finished the game - did anyone else feel like IW was really heavy handed with the emotional angle?\n\nI understand why they did that with Kiryu (his life links, reflecting on the past etc were all nice to experience), but even the side quests all had the same sad undertone. It felt like none of them were just goofy for the sake of being goofy, they *all* went back to some deeper, more emotional reason for why NPC #43 was doing what they were doing.\n\nThat one bit of piano that played *constantly* in the game lost its effect for me. I love the Yakuza series for being a balance of gritty crime drama and goofy, light hearted misadventures. But this one just kind of missed the mark for me.\n\nAlso, that one sub story where >!the Alo Happy lady full on SAs Kasuga!< and it’s done for laughs. Can we stop with this shit man?? I thought we’d left “it’s funny when it happens to a man” in mid 2000s comedies, but apparently not",
            "Every time >!The Funk Goes On!< comes on in >!Kamurocho!<, I smile. That's... nostalgic",
            "I must say, I'm not really feeling the whole Hawaii setting. Unexplainably everyone either knows Japanese (the cop for example, personality-wise doesn't make sense how he is so fluent). And in sidequests it's like Ichiban somehow is fluent in English because we interact with people constantly in full sentences (and no way the orphan kid or the restuarant customers speak Japanese). And the \"native Hawaiians\" can't speak English worth a crap...\n\nIdk, I'm still enjoying the game. But pulls me out and doesn't feel well done so far. Also feels completely unnecessary, but I'm early enough in the story that I'm sure (hopefully) it'll",
            "anyone else running around, pulling out the camera, and yelling “be sad!” to random strangers?",
            "Yes, your audio is set to Japanese. The opening scene is supposed to be in English.",
            "ik this is a minor thing but it really bugged me that there is only one animation for new enemies joining the fight after u wipe out a wave. its the exact same animation no matter what characters are coming in the fight.",
            "As someone who played with the Japanese VO, I couldn’t help but laugh at how bad some of the English-speaking performances were. Bryce, for example, sounded so silly sometimes that I couldn’t take him seriously.\n\nIf you played with the English VO, was it different/better? Still loved the game",
            "I'm sorry, but Kiryu >!not getting an on-screen reunion with Haruka!< makes this ending a complete failure for me. \n\n>!Haruka!< is the *core* to Kiryu's character. >!He hasn't seen her for eight years!<. All of his substories are about Date urging him to make one last connection with the people that love him, none more important than >!his daughter!<. It's teased that >!she's not ready to see him... *yet.*!<\n\nAnd yet >!Old Man Komaki!< gets a more emotional farewell with Kiryu than >!his *god damn daughter.*!<\n\nKiryu's ending is him >!finally choosing to keep fighting for his life rather than just rolling over and dying.!< Why would you not reinforce that ending with THE ONE PERSON WHO HAS GIVEN HIS LIFE MEANING?! >!The daughter of his only love that he swore to protect at the end of the first game?!< How is that not the logical and emotional endpoint for his character?\n\nThe Daidoji are used as a plot device for the entirety of the game: simultaneously useless and all-powerful when the plot demands it. One of their primary functions (besides convenient travel to and from Hawaii) is forcing Kiryu to remain anonymous and away from his family. Date speaks for the audience when he urges Kiryu to ignore these bastards and finish his bucket list. It's doubly frustrating after the >!Tatara Channel reveals that Kiryu is alive: what the hell is the point of their contract anymore?!< \n\nAnd then they're just... gone? Kiryu gets an >!off-screen reunion with Haruka anyway?!< Then what was the point!?\n\nThe whole game's story is a mess. Half of it was a tutorial, the plot picks up at the end of Chapter 6, and it immediately falls apart once the party is split between Hawaii and Japan. But I was confident they wouldn't fumble the most important emotional beat of the series. Not only did they fumble it, they spiked it into the ground and took a shit on the field.",
            "There's an annoying way in which the dubs are handled in this game. \n\nIf you have the recorded lines of an npc in both English and Japanese, why is the game making Japanese actors speak English with a Japanese accent for the npcs that aren't Japanese? The English voice actors aren't trying to speak Japanese when they're voicing Japanese characters.\n\nIt's like all the English voice actors are in one file and the Japanese voices are in another and the game has to pick one or the other. I feel like that's how it is given that you have to reload the game just because you switch the audio language in the Settings page.\n\n\nAlso why the hell is there a Japanese podcast available that has no subtitles?",
            "so mf excited",
            "damn, i hope they add subtitles for the radio soon. i was looking forward to listening to the podcasts you unlock",
            "The addition of movement in combat for Infinite Wealth makes it so much more satisfying compared to LAD.",
            "The fact that only the men of the party's battle portraits have their face half covered in shadow irks me to no end. RGG studio are cowards for not doing that for the entire party.",
            "Which of the animals do you think gives the best gifts? For those who haven't paid attention or aren't working on the friend/buddy aspect here in Infinite Wealth:\n\n* Dogs give a random plate after you feed them like 3x. \n* Cats give you a random \"weapon\" like baseball, volleyball, grenades, etc after you feed them like 3x. \n* Birds of all types will give you eggs, which restore your HP and MP when eaten, after you feed them 3x.\n\nI know there's a cow, but I haven't been there enough to see what it gives?",
            "I just finished the game and I'm... Confused? \n\nEverything about the game (game-play, job system, side content, etc) felt like a step forward except the writing for the main story. Pacing was all over the place, and the ending very felt abrupt (like \"we ran out of budget, so we're ending the game here\" abrupt). There are places where I feel like I missed things, but in reading the threads here, I don't think I did?\n\n>!What happened to Eiji? Why was he hiding in Japan. What happened to his leg?!<\n\n>!How did Kiryu get his name back? Didn't the Daidoji specifically say that they weren't going to let him out of their deal? ... Is Date dead now?!<\n\n>!I guess Ebina and Sawashiro are just Gone now?!<\n\n>!Not really a gap, but it's weird that Ichiban has a half-brother, they never really interact at all, and that whole revelation is never really examined in any depth from Ichiban's perspective!<\n\nI kind of got the feeling that the game was originally written as a follow-up to Like A Dragon, more closely focused on Ichiban, and then at a later date they decided to add Kiryu so the writers shoehorned him into an existing story as best they could.",
            "Man they rushed the ending like no one's business but gave me a 3 hour introduction\n\n![gif](giphy|zB5na8URITKyvAGxdE)",
            "Still can't pre-purchase the game in india. Idk what's wrong with Sega since they did the same thing with gaiden, making it available only after release. They're doing the same thing with p3 reload too.\n\n\nEven if they open the game for purchase after launch, I won't get the pre -order bonus classes and will have to buy it separately if/when they make it available.",
            "How can i grind levels as Kiryu in Yokohama? I dont want to just keep bashing trash street mobs",
            "Great game, but I don't get why like it looks so bad graphically. Y7 looked great, Gaiden also looked fine, but Hawaii looks so flat with the lighting. I've taken a decent amount of pictures ingame with the phone camera and applied filters which add depth and make the game look better. So why did they choose to leave it looking like this.",
            "I have two questions about Master Vacation. I hope someone can answer.\n\nIf I start Master Vacation do I have to unlock specific characters again or are they all available from the start? (So for example can I use Joongi in Chapter 1 or do I have to wait >!for the endgame!< again?)\n\nAnd if I complete it on Hard difficulty can I import that save for a Legendary run or only the base game's stats carry over?",
            "As someone who has only played subbed so I don't know what the English voice actors sound like, I feel that someone like Jack Black would be perfect for a role like Ichiban.",
            "So I held off on exploring and doing side content and stuff at first, but now I've unlocked the job system and plan on catching up on that front. Right after unlocking the job system however, the in-game time changed to night and I noticed that a lot of the side quest markers on the map disappeared.\n Right now the game is asking me to go to the beach to meet up with that volunteer group - does anyone know how long it's gonna take till it's daytime again?",
            "Im stuck on chapter 12... >!the fight between daigo, majima, and saejima is so bullshit especially considering the game tells you its recommended to be level 41 to do this. i really dont like the 2nd half of this game because it feels a lot more grindy than the first half. what level should i actually be to do this fight because 41 is definitely underpowered!<",
            "Are the stats on weapon brands known anywhere? Like if I want to improve on this weapon with a chance to burn, do I want to add Seal of Incineration (basic 500yen brand increased chance to burn) or this Seal of Suffering (50,000yen brand increased chance of damaging status ailments)? \n\nI would imagine the newer more expensive brand is a better chance for all damaging status effects than the more basic one?",
            "On the island, when you unlock the tiny lake section, Kasuga mentions the house looks familiar. What is it a reference to? I cant find anything else to do with it",
            "Dumb question: Why was this one called Infinite Wealth?\n\nBeyond the brief stop at the >!underground rich people mall,!<  it didn't seem like the title had anything to do with the game thematically.",
            "Substory 48: Did...did I just get raped by a talking palm tree?",
            "Finished the game earlier today. Gameplay wise it's a big step up from 7. Hawaii was a joy to explore and had some of the best sub stories and mini games in the series.\n\nHowever, story wise, pacing and characters, I think it's one of the weakest this series has ever been. I really struggled through sections of this game without skipping parts. Plus, there's simple things like not front loading 90% of the sub stories in the first few chapters and not making it possible to complete the final dungeon 1/3 of the way into an already easy game.\n\n>! I think Kiryu should be removed as a playable after he gets sent home from Hawaii. The second he becomes a dual protagonist the narrative gets even more messy and unfocused and he can actually pass the torch to Ichiban. Plus a lot of his content feels like Kasuga should be there: everything with Ebina and Sawashiro. Defeat Bryce maybe 2/3rd of the way through the game, but find out that no only does Ebina know what's been going on, but doesn't care. This would also give you a chance to interact with Ei chan more. Since apparently we care oh so much, but the dude had more screen time as a kidnapping blackmailer than anything else. It wouldn't fix all the issues with the narrative, but could help keep things focused. Kiryu can protect Akane or something while in Yokohama, so he's not out of the story and serving a purpose. But is actually suffering from cancer. !<",
            "Man, it's still yakuza, but what a letdown after 7. As always RGG struggles with following up on \"original\" entries (Judgment -> LJ, Y1->Y2, Y4 to Y5 ), but this has been the largest downgrade so far. Story is way less cohesive and focused. Minigames are not as engaging (I know people loved dondoko island, but it felt like a huge chore to me). Substories copy way too much from Y7 too. Maybe it's because RGG had to make a huge new location. Maybe it's because they released 3 games in a span of a year. But Y8 just feels undercooked, or rather hastly cooked. And it's such a shame too, cause gameplay is amazing and the last 3rd of the game has some of the coolest moments in the series. But the staples you expect out of rgg are just so meh this time round.",
            "So I beat the game and wow, is this game a weird one in the grand scheme of Yakuza games.\n\nIt honestly reminds me a lot of 5, which is one of my least favorites tbh. \n\nLike 5, man is the gameplay much improved. They made so many improvements that I wanted like job diversification because now you get to choose which skills carry over, more jobs, way more clarity in battles so you can actually plan better AOE attacks, the movement ring allows you to actually position (which helps the last point) and makes using weapons in combat an actual thing instead of how much it barely comes to play in 7 despite being there.\n\nHowever, like 5, I don't like this game's story much. Most Yakuza games have acts, where maybe the protag's initial goal is small, and then more gets revealed and you realize the conspiracy is deep. In 7, Ichi's first goal is to find Arakawa, but he needs to get information, he's wandering around Yokohama tackling smaller issues until the grand scheme is revealed around Masumi, which is great build-up. In 8, everything sorta gets revealed immediately. You spend 95% of the game looking for Akane and when you have her, I guess you learn that Ebina is bad? (which was obvious), and that Lani was the actual goal of the antagonist? I like the concept of the villain being essentially a cult leader, that's cool, but Bryce isn't very standout.\n\nAlso that whole sub-plot with Ebina being Ichiban's half brother? That's something that should hit, but it really doesn't. Us not getting a Kiryu and the kids reuniting scene? Come on! Sure, I get that they didn't need to shove it in our face, the send-off spoke words in a short scene, but I think we all were looking forward to finally seeing him re-uinte with everyone, but nope.\n\nAt least some of the new characters were great. Tomizawa deserves more love, he's one of my favorite characters already. Yamai was pretty sick, and his character moment was really strong it almost felt like he was going to join the party. Chitose was... idk man. I know it's in Ichiban's character, but the trust they gave her so fast was insane, especially when it's revealed that she is part of the reason things go to shit immediately. I'm surprised they brought back every party member from 7 (except Eri, who was a contest winner). Joongi Han arriving so late was lol.\n\nAlso weird side-note, but **anyone feel like the music is lacking in this one too?** I haven't seen it brought up yet, but the games usually have bangers, but this one there's maybe like 3 okay tracks and the rest is meh (Except the new karaoke songs, all of those are fire).\n\nAlso why did Ebina have a back tattoo? He hates the Yakuza. Shouldn't it be in his design to refuse a back tattoo?",
            "Question to those who had finished the game.. What did you think?  Major spoilers for the ending ahead so continue at your own risk:>!I'm asking because personally I felt a bit of a let down from the ending. As if the story of Kiryu should have come a full circle but it only went like.. 80%? I had imagined him returning to Okinawa to live the rest of his days there with the kids (obviously not kids anymore). I don't mind him seeking treatment but it almost felt.. rushed? I know the game was long but tbh, it felt like a lot of plot points were dropped by the end. What happened to Akane? Lani? The aftermath of Ei-Chan and Yamai. Bryce and Ebina. I know that they went to jail but Ebina and Bryce talked about the \"repercussions of messing up their plans to the governments of the world\", but we don't really see that. I'm not looking for a political espionage game or whatever, but I would have at least loved to know what the response of Japan was to the whole ordeal. And of course, Chitose. They say she went on to become the CEO of the Fujinomiya Corporation, but SHOW ME! I wanna know how my girl is doing! I felt like there was no resolutions. For a game filled with a bunch of exposition, by the end they really went for the \"tell don't show\" method, and that really grinds my gears. I know this comment is all over the place, but I couldn't find a better place to rant. Also, to anyone who objects to my views, I would love to discuss them further. Maybe someone will enlighten me to something I had missed.!<",
            "I am going to forfeit all my material possessions to Chitose",
            "For those who have the game, do party members join in on substories in this one? The fact that none of the party exists within a substory was my biggest gripe with LaD, and I was hoping that would be remedied in this one.",
            "It's really nice that they seem to have made new character models for Americans in Hawaii. When I was playing the last game, the vocational school opens with an American gut asking for directions, but it's just an Asian Guy they made pale and blonde, lol.",
            "I kept feeling like the game was building up to something that never arrived. I don't just mean 'twists' - there were a couple but I felt like all of them were easy to see from a million miles away. More like it just failed to deliver on anything in a significant matter - I enjoyed the game but I didn't wind up having a strong reaction to any single plot point or event. The ending wasn't bad or unresolved - just simple and straight forward.\n\nIt reminds me slightly of a JJ Abrams plot - it keeps acting like there's some sort of question or intrigue that you want to stick around for but by the time you arrive at the point you realize that it's all smoke and mirrors.",
            "I finished Infinite Wealth the same day I lost my cat Chancey. I literally got up after the ending scene and ready to shower up and she collapsed in front of me and died in my brothers arms on the way to ER. I started playing Yakuza during the pandemic and actually moved her cat bed next to me while I played to keep me company during long sessions ( especially the 5th game ). It hurts but I know she’s in a better place. Seeing how much Kiryu and the gang care about cats makes me feel good to post this here. I feel like Ichiban at the end of the game, carrying my family through the grieving process. They’ve done it so much for me in the past that I felt like this game was speaking to me directly when the gang told Kiryu to lean on his friends more. \n\nTake care guys. Hug your pets extra tight for me today. Tomorrow is not promised. Love today.",
            "Cancelled my Amazon order because they still hadn't updated about delivery. Yeh SEGA bad, RGG bad, anti-consumer practices, and all that, but I just went the whole hog and went digital ultimate edition anyway. <2hrs to go now.",
            "I'm just over here waiting for steam to let me in. Although I'm pretty high so that should probably wear off before I start the game LMAO",
            " well i finally finished the game. it was great, the only thing i didnt like was the story.  felt that it was too long and drag on the plot for no reason other than add more and more twist that lose any dramatic punch to it after a while and the whole >!Vtuber arc!<was dumb as hell for me.\n\nwish the attention was in other parts, like >!Kiryu  bucket list.   wish it wasnt a stale flashbacks through text  for the most part, it lacks the emotional punch that the yakuza series is known for.  the whole bucket lists should have been a entire chapter arc. and have alot of  cutscenes instead of the stiff in game characters that lack the emotion in their faces in the way they did it. !<\n\nbeside that  the thing that annoyed me the most was the main villain, just could not take him seriously and was too cartoonish for me and the fact that take so damn long to finally fight him was a drag.\n\nbut overall i still enjoyed the game, the mini games and the combat was fun at least.",
            "BRUUUH\n\nI just beat like a dragon infinite wealth, and the ending SUUUUUCKS",
            "Man, I really wish the game had a language selection where you could choose that characters in substories (besides Ichi obviously) would speak english, I've played every single game in Japanese but it is a bit weird having so many native japanese speakers on Hawaii.\n\nIf not a setting, hopefully somebody makes a mod for this, have Ichi and the gang speak japanese but other characters english.",
            "Just beat the game and some (okay, alot) of high level thoughts I need to make sense of.\n\nTHE GOOD\n\n+ They finally nailed the turn based gameplay for the entire duration of the game and it didn't once feel old. Big praise coming from someone who was very frustrated with 7's combat upto late game.\n\n+  So. Many. Minigames.\n\n+ Dondoko island. That's it that deserves it's own point.\n\n+ Skill Inheritance is here to stay I hope and I hope they allow us to bring in the special essence moves of other jobs in future games.\n\n+ Amazing substories maybe top 2 in the franchise.\n\n+ I had felt maybe Yokoyama set himself up by hyping him Yamai but he exceeded all expectations I really hope this is a recurring character in the future tho I don't believe he will be a party member anytime soon.\n\nTHE BAD\n\n- Hoo boy, here we go this game's story from chapter 9 or 10 onward is like a fever dream. Constantly squanders it's own potential by presenting good ideas with terrible execution perhaps more so than any other game in the series. Let's further break this down ->\n\n    • >! Akane WTF. I didn't mind the goose chase for over half    the game for this character as much as most people did but the payoff was underwhelming to say the least. She just walks up no fanfare and for most of the rest of the game you'd have trouble to convince me this is the long lost mother of the MC with how little she has to do in the story in a active capacity.!<\n\n    • >! Lani WTF. Who is this girl? Like seriously I know jack about her besides her grandma died and she's the sage. She must have like 5 lines i could count on one hand and that's it. I thought after Judgement series and LAD we were past the bad female character syndrome in this series but here comes the queen step aside Yasuko, Yumi, Mayumi and Kiyomi I guess the good female writers went on holiday to Hawai.!<\n\n    •>! Palekana the cult was actually not so bad as people are saying I mean sure it's a cult so it has all those stereotypes but they're not executed badly. That said, Bryce Fairchild what a man you are, perhaps someone to surpass Terada. I could not take this man seriously for one second and his boss fight was the worst boss fight bar none in the whole franchise no gimmick it's just he has guns. At least Jingu and Munakata were slippery bastards with guns this man has no game.!<\n\n    • >! Chitose. Okay this is one character I hope we never see again as a party member at least. It straight up felt sickening to control her (I had to cz kunoichi is that good) after she got Hanawa killed and got no pushback from any of the cast like Ichiban okay kinda stretching believability here but I get you're silly like that but what's up Tomi?! Didn't you call this happening earlier?! Why're you cool with this?! Then she admittedly does the right thing and exposes herself as Tatara (don't get me started on that voice) and brings down Palekana, her own family and even herself WAIT she gets promoted to chairwoman so she faces no legal consequences at all?! she is literally admitting to spreading defamation for years against the world's elites and she gets off Scott free...!<\n\n    • >! Eiji Mitamura- Before anything, how did this man go from Hawaii to Japan after giving Lani to Dwight then sail all the way from Japan to Hawai in a cruise (news anchor confirms this) then gets from Hawaii back to Japan and grows a stubble and his hair out within 24 hours?! Cz that's what it feels like what happened cz Kiryu was still on the ruf waiting for pickup. Am I taking crazy pills rgg?! Also for that matter, Kasuga is an asshole I get that he wants to capture Eiji as his pal but Kiryu might be fucking dying did he even visit the hospital once?? Does he care?! I wouldn't know since no one breaths his name after he finishes off Ebina!<\n\n>!Also this is the moment Ichiban's positivity went from endearing to offendingly stupid this is not a mirror to his bond with Masato. This is as if he went up and forgave Kume for everything he did and never raised his hand against him all because he believed Kume was feeling bad after killing Masato after a couple days and they had some fun in one chapter so they're pals.!<\n\nHonestly this should have been a Kiryu game with Ichiban as a supporting character in his party with >!Ebina as the overarching villain across both Japan and Honolulu. Everytime Ebina was on screen I was engaged yeah his backstory is nothing special and his motivation is predictable but this stereotype works for a reason and it was effective and I also appreciated Kiryu pulling an Ichiban and apologising to Ebina to atone instead of knocking him out. That said god dammit not another cliffhanger what's the point of this just let Kiryu have his heartwarming reunion with Haruka it is the number one reason I got the game...!<\n\nSidenote- >! Haruka looks silly with that haircut.!<",
            "any way to fix ichibans level up/shouting being in english even though i'm playing with japanese voices?",
            "Anyone else getting the bug where you chose Japanese as the dialogue option but english lines still come through like when leveling up, or at shops?",
            "Two early game Qs:\n\nIs there a setting to increase combat difficulty? The first boss in chapter 2 was really easy and I expected some challenge.\n\nSecondly, how exactly does perfect block work? I only seem to get it some times.",
            "Anyone else getting a weird halo like effect around each character?",
            "Am i the only one struggling with perfect block timing? I can't figure it out, I didn't have any issues with it in the first game. Maybe I'm just dumb though.",
            "so every chapter is named after an Elvis Presley song...that's a really nice detail.",
            "alright, people complained about yongyea kiryu but holy shit, whoever they got for Daigo this time around sounds way worse",
            "Anyone know how to get chitose's old hair back",
            "I just want to take a week off work and be able to play this game at least ten hours each of those days. That's the mark of a masterful game imo, but it's also been the Yakuza way for decades now. \n\nIt was a no-brainer that I was going to pay 69.99 at launch for this. And the number of games that I can truly say that about are too few and far between.",
            "I encountered a bug in Chitose's drink link 2. The English audio for her dialogue kept getting jumbled around and made her speak in tongues. PS4. Anyone else encounter this?",
            "ending timeline question: >!the \"big swell\" story happens in between the final boss fights and the month later stuff like Kiryu getting treatment and Ichiban fumbling the bag with Saeko again, right?!<",
            "Just finished the base game. Holy shit what an experience. Everything I wanted post like a dragon in more. Man I love these characters and I love this game",
            "I'm doing a NG+ run right now, so I decided to change language tracks. English just sounds weird for the karaoke (Adachi deages by like 30 years lol) and Kiryu just doesn't seem right (probably would have worked for Y0 Kiryu). The mandarin dub is surprisingly good. The casting works so well.\n\n&#x200B;\n\nThough my wife is like \"I've listened to you play this whole game series in Japanese and all of a sudden I can totally understand the dialogue. I am not used to this!\"",
            "What’s up with the silver chests in dungeons giving the same item? Like I’ll get 3 of the same 3 star weapons from different chest",
            "Random note, but being Samoan meant I actually understood a lot of the Hawaiian terms and expressions. Answering the question about the meaning of \"ukulele\" at Ounabara was like second nature, and a bit of a eureka moment when I realised the etymology.\n\nThat guy saying *\"Mahalo ia oe!\" (\"Graciousness to you!\"* if I had to guess*)* to Mother Nele after seeing Bryce in action had me buzzing out too.",
            "Love the gameplay and look of the game, the storyline was mehh for me, the conspiracy reveals were too early and lack the wow factor for me, Danny Trejo was severely misused imo, there was a lack of smaller boss fights too which made it a lot less epic when going through the levels.",
            "Do moves no longer show which buttons are used in the menu? I just beat LAD7 and they did in that game. I've found myself preemptively mashing square so I don't miss it everytime I get a new move.",
            "Just Finished. It's probably my favorite Like A Dragon Game now. They just get so much right and it was such a complete experience. I do wish these games had more of an epilogue because now I'm annoyed I have to wait for the next game to see what happens with the Second Dissolution. Also worried that we'll get forced to go back to Hawaii too soon now that they've created the map.",
            "Am I an idiot? I was looking forward to playing this game in English because of Daniel Dae Kim and Danny Trejo, but I finished it last night and I thought the whole time that DDK was Wang Tou, and not Ebina lmao",
            "That scene with Ichiban and Akane at the beach was one of my favorites scenes in the game so far, I'm kinda surpsied to see all this indifference towards it.",
            "My only issues with Infinite Wealth is that if you're a completionist like me and go into the dungeons as soon as they unlock, it's really easy to become very overleveled without meaning to, and it trivializes a lot of fights that are supposed to be dramatic. I ended Yamai's forest-on-fire fight in like, two turns for example.\n\n\n\nI'm at the end game and I'm purposefully avoiding using summons and only equipping mid weapons just to keep the challenge going",
            "Im into the last couple of chapters of Infinite Wealth, I am still really liking the game overall, but Jesus the endless Kiryu nostalgia as someone whose first game was Like a Dragon is painful. Just way to much Kiryu in this game, I don't care about him or the 30 years of game before this. I started with Yakuza 8 cause it was a fresh start for the story. I wanted more Ichiban. Just too damn much Kiryu. Hopefully he dies and we can move on from him.",
            "I just wanted to say that it was a bummer that Sayonara Silent Night wasn't available on the karaoke song list in Infinite Wealth. That song hits really hard.",
            "The story really falls apart in this game and is the weakest point (particularly the Hawaiian plot) in the otherwise amazing game.\n\n>!The whole selling point of the trailer and even much of the story's first chapters was Kasuga finding and meeting his mum for the first time. We get ZERO chemistry between them, save for that one scene at the beach after 3 long chapters of rescuing her. HUGE disappointment.!<\n\n>!Also ZERO chemistry between Sa-chan and Kasuga, I get there's a bigger fish to fry with the whole finding Akane plot, but I think after Chitose joins the party, Kasuga forgets to learn and develop in dealing with women and relationships. If someone skips the drink-links (which you shouldn't because it does have combat benefits), you miss out on so much.!<\n\n>!There was no point in having Lani in the game, I get she's instrumental in Bryce's downfall, but she gets forgotten and not even utilised, and it comes down to Chi-san exposing Bryce at Nele Island. They should have Lani being kidnapped and taken to Nele island and the final showdown was rescuing her.!<\n\nSeonhee, Joongi and Zhao was just shoehorned in so fans don't miss out of their presence.>! We didn't need Joongi appearing out of nowhere in the final chapters.!< But I guess it was to ensure the fans got a good 5 party balance per country.\n\nKiryu's Bucket List story is probably the best part of the game because you felt how tortured he was not being able to be Kiryu (i.e. use his name or see his friends and loved ones). With that said... just let the man rest... I thought the torch was passed to Kasuga already in LaD, but as Michael Corleone said \"Just when I thought I was out... they pull me right back in!\"\n\nDefinitely going to keep playing Premium adventure from time to time  though to do silly stuff.",
            "SEGA is actually insane with this DLC Pricing. $200CAD for everything.",
            "Wait I cant equip the costumes I paid for until I BEAT THE GAME?? WTF?\n\nIs there any hope they'll patch this? The whole fun of having costumes is to wear them while running around.",
            "Hows the english dub so far? I normally don’t do dubs but i liked the dub for 7 and a 100 hour game seems like a lot of reading, lol. I also heard the localization team changed but i’m not really sure.",
            "I've never played a game in the series at release before IW. Played 0-6 on Game Pass, bought 7 for cheap and got Lost Judgement on sale a few months after release.  \n\nKind of torn between blitzing through it so I can join in the story discussion or taking it at my own pace to really enjoy and take it in.",
            "PLEASE I've been so anxious all week because ive been waiting for IW to release can someone please tell me >!if kiryu dies from cancer (or dies at all)!< ?!? it'll be a long time before I can play IW but I need to know this to be able to sleep tonight 😭😭",
            "Did the opening cutscene look like shit for anyone else? Just wanna make sure it's not my TV. It looked low quality with shouts outside the car, like pixel-y but then when it went inside the car everything looked fine",
            "I've started on Dondoko Island rn . . . do I need to raise this island to a 1 star resort before I can return to Honolulu and keep going with the main story? I do wanna play Dondoko Island but not right now lmao, I'd much rather get back to the story. I hope I don't have to do a bunch of work on this island before I can get back.",
            "I like so many of the new classes I'm having a hard time picking who to be what. I would like a healer and a mage but what skill inheritance go together for that? \n\nIf I Want Tomi to be the mage/healer what classes would even do that? Like what loadout of skills from where?",
            "Anyone found a way to reliably get Legendary Warrior Musks? I blitzed the entirety of Sujimon and had 4 by the end but I simply cannot get that last one. Was hoping the Stadium or Haunt might have them but alas. Praying it's not literally just Sujispot RNG.",
            "Without Spoilers as to why or why not, will you be able to reunite Kiryus and Ichibans Teams? Can I use Nanba and Ichiban in the same Team? Or Saeko and Ichiban? They are currently with Kiryu and since he's also a Protagonist rn, I'm not sure if it will be possible to build my Dream Team\n\nI also havent invested in Characters I wasnt gonna have in my Final Party, so it would be better to know beforehand",
            "Can anyone help me - I don’t see the option anywhere to upgrade my house on Dondoko Island?? I’m on day like 50 lol",
            ">! Yokohama Dungeon Boss Anon fucked my lvl 55 party up more than any encounter in the game. 4 anons that can near full party wipe within 1 action then near 25% hp again 4 anons definetly was quite the experience, easy way to stack all 4 into AOE spam was using kiryu ULT to throw 1 far away so the entire party and enemies would reposition and stack back up on 2nd turn. Having enough gold to burn on the 2nd anon wave is also handy!<",
            "Kyodais, maybe minor spoiler but I don't think it needs a new thread:\n\n**Where can you buy items that revive party members?**\n\nGoogling to no avail, and can't seem to find it in game aside from random drops. Thanks anyway.",
            "PS4 Slim player here: damn, the game runs really well on last gen.\n\nI don't know if it's just me but it seems to be running better than LaD 7. 30FPS is 30FPS but everything feels so smooth.",
            "So I'm only a few hours into the game and I was wondering, during the hawaii parts, are some of the characters that talk to ichiban in japanese during the main story supposed to be canonically talking in japanese? Or is it just for convenience sake? Only on chapter 5/6 now and theres a chinese mafia guy that keeps speaking in english and ichiban says he can't understand him, but some of the characters have been seen speaking in english and then switching to japanese to speak to ichiban",
            "Curious if there are any other sources of >!shark fins or squid tentacles!< in the game. The ones I'm aware of are:\n\n* >!From trading in disks for Hawaiian Haunt or Yokohama Underground!<\n* >!From recycling trash on the beach!<\n* >!Fishing!<\n* >!A few from story bosses!<\n\nI want to farm up enough >!to make every job's ultimate weapon!<, but wanted to know if any others were available elsewhere.",
            "Just beat the game recently and currently doing the endgame dungeon!\n\nSpeaking of dungeons, I LOVE almost everything about the game, save for one major gripe... I don't like the dungeons.\n\nFirst run in Yokohama Underground in Yakuza:LAD was hell, but I loved the look and spaciousness of it more if I might say.\n\nAll these hallways and doors just got so tiring real quick...\n\nBut still, even with that, grinding is more fun since it's \"easier\" to switch jobs and grind thanks to the Skill Inheritance. Best thing they added IMO.\n\nCan't wait for their next release!",
            "I don't know if it has been fixed in the last update, but there were two bugs I found in the game;\n\n\nOne is that it's possible to build infinite urinals in Dodonko Island (probably other items too but I could only consistently reproduce the glitch with urinals). It takes a ammout of glass to build the urinal, but if you select an ammount to build that would make the glass on your inventory to go exactly to 0, you get the urinal built and the building experience but the glass count doesn't go down. Meaning, if you have 20 glass, and use exactly 20 glass to build urinals, you'd get the urinals and keep the 20 glass, but if you use 19 glass the count goes down to 1 as intended. I'm guessing there's a bug in the code we're for some reason the number of glass you have can't be zero or something.\n\n\nThe second is less funny but one of the healing items you can buy in the Chinese medicine shop says in the description that it \"recovers X HP and heals all status ailments for the party\", but the description is lying to you, it's actually a single person use item. That's why you shouldn't trust alternative medicine, folks",
            "So has anyone seen the waiting boyfriend and waiting girlfriend in front of a fountain near palekana?",
            "I’ve never played 0-6 and all I have to say is 7 and 8 are some of the most incredible video game experiences of my life. I’ve laughed, I’ve cried, and I’ve had some frustration. Also Ichiban really is one hell of a guy. \n\nI need a break after this one, but I’ll be back!",
            "I just wrapped it up.\n\nThe ending is...ok? Like it's not as bad as people say it was, but it could have been better. Like everyone else, I feel like Ichiban's story kind of goes nowhere. \n\n\nI'll go back for Big Swell later. I still need to do the last of the Haunt and the Yokohama underground.",
            "Where did Sasaki go? The Yakuza guy that Ichiban helped out during the first chapter and was part of Adachi's security company. Was his fate mentioned at all?\n\nI loved Infinite Wealth and I'm gonna have post game depression yet again. Kiryu's really hard to replace even if Ichiban is a really good protagonist. I'd really say this was a Kiryu game and every time he was in the spotlight, he made it shine. Life Links is beautiful albeit bittersweet. I wish we can get a real closure for Kazuma Kiryu, the man who regained his name.\n\nNow I just have to do:\n\n- Yakuza: Dead Souls (start the game + plat)\n- Like a Dragon: Ishin (finish plat)\n- Fist of the North Star (finish plat)\n\nAnd maybe feel post game depression again.\n\nI still have the Legend playthrough to do though, but it'll be a quick run sadly.",
            "I'm confused about Nanba. There is a lot of comments on this game about how homelessness sucked for him and he had to crawl it back up and etc, but wasn't it revealed in the past game that he was just pretending to be homeless to spy on the Geomijul? Like I thought that reveal meant he had a house and stuff but began sleeping on the street as a cover-up. There was even some high tech laptop in his cardboard house or something IIRC.",
            "I might have missed it, but was there any explanation behind the dilapidated cabin in the lake of Dondoko Island?",
            "Beat it tonight. I think the demo in Gaiden got me hyped a little too much, as I liked it but not as much as I thought I would. Still easily a top half game in the series. Kiryu's fighting style and Dondoko Island (once I got over a \"Ichiban Confections was WAY better\" hump) were highlights. Hawaii disappointed a bit, as they dropped the whole fish out of water English/Japanese thing pretty quickly.\n\nI am a bit flummoxed as to why the ending is really \"controversial\" or whatever. Yes, they laid on the nostalgia and fan service heavier than maybe any game ever before in service of telling the player that Kiryu is REALLY dying this time, guys! But he's come back from canon injuries enough to kill most at least twice before, with one being the actual perfect off-ramp for the guy. Plus the story explicitly tells you that him dying is basically him giving up! Yeah sure, it's \"letting himself die,\" but that's basically code for RGG letting him die. Plus, he didn't really look all that dandy in the end. Man practically looked his age for the first time in (in universe) decades. To be honest I thought the most controversial part was Haruka's hairdo. HONEY, what is that?!\n\nAlso Bryce should have probably had a native English-speaker as a VA but hey",
            "Finally finished the game. Overall a very enjoyable experience, but there definitely were some issues with the story and pacing. Anyone else get the feeling that there's two separate games here? I get the sense that the dual playable protagonist approach wasn't something planned from the get go, but rather crowbarred in somewhere mid-development.",
            "I finally finished the game, now I can unmute this subreddit!",
            "Just finished this game and the ending was a BIG letdown. >!Big part of the game was Kiryu living his last moments, the memories and meeting old friends. Then he doesn't die? As much as I love him, this was not a good ending. I was really invested in hunting down the memories, talking about the old games with my gf (We are both big fans of this series) and how this is the end of an era. \n\nEverything pointed into Kiryu dying in this one and I think us fans had accepted that, invested in it emotionally and then the writers do a cheap trick like this. Ruined a big part of the game for me.!<",
            "Post Game Dungeon and story has me rolling",
            "So question about the entire whole ass plotline of the game\n\n  \n>!So the entire plotline is about how Bryce made an underhanded deal with foreign governments to store nuclear waste in a small Hawaiian island off the main island. Now maybe it's just me, but I feel like with this sort of plan, that goes beyond the typical underworld, and would almost immediately have the US government shutting the whole thing down. Like, I can't fathom a world where the US goverment just... allows an individual to store nuclear waste on their property. Did I miss something here, or was that just a point of logic that was completely missed?!<",
            "I try so hard to like the combat, but I just can't. Everything else looks amazing. I am having major blue balls, and I hope everyone has a great time, Yakuza games are amazing",
            "Ugh, why does it take so long to be able to change jobs? Especially as they have weapons and gear appearing all over the place for them? Kind of dumb to be getting swords and all since Chapter 1 or so but still can’t use even in Chapter 4.",
            ">! how does haruka not see kiryu at the tv?? !<",
            "I just got to Kiryu's intro and had to force close the game because of how bad the voice was so I could switch to Japanese.",
            "I've only just started playing and up to Chapter 3 but this has got to be the slowest start to any game in the series right? Hope it starts to pick up soon.",
            "Wow, does it never rain in Hawaii? I know I’ve seen it rain as I played through the game. But now I’ve learned about the hidden trophy for taking a picture of a rainbow. And as I need to get that for my last achievement/trophy, it never has rained. I just spent a little over an hour in the game running around waiting for the rain to come.\n\nDoes anyone know a trick to making it rain? Or at least the rainbow appear?",
            "My biggest complaint with the 2 rpg games is if the leader falls, regardless of other characters easily being able to bring him back it's an automatic game over. \n\nI'm at the end of the Yokohama dungeon in 8, can destroy everything up to the boss but the boss has one move that'll decimate the main characters health that I believe is unblockable. Even if he survives another enemy (that can be revived if you defeat them all) will finish them off since the damage the first deals will do approximately 90% of your health. \n\nLove the game but man I hate this type of game design.",
            "Chapter 8 Spoilers: \n>!Why the hell did they introduce Hanawa in Gaiden, only to off him so easily in IW. Yet somehow Richardson can survive the fall off a hospital? Also I swear if they bring Mine back and he was a daidoji agent the whole time...!<",
            "Releasing soon on Steam!",
            "Am currently halfway through chapter 13 of Yakuza 7. Will I be able to finish the game before Infinite Wealth comes out tonight?",
            "I have to work all day and I want to play this so much!!",
            "Question: Is it necessary to play the IW special demo in Gaiden bcoz I heard there's an exclusive story not available in the main game. Or just hop in IW right away and I'll eventually reach that part?",
            "does everyone just do more damage now and its way harder to earn money?",
            "Is there an option to make the letterbox art black? I am playing on the steam deck and would like the letterbox art to be black instead...",
            "The English dub and motion capture are so good!!",
            "Are there subtitles available for the After6Junction radio episodes? Playing on Japanese audio and the episode doesn't seem to have subtitles when playing on the \"smartphone app\"",
            "Anybody know why when I'm eating at restaurants the \"menu completion\" isn't counting it?\n\nLike I'll eat 3 things but the shop info on the map still says 0/12",
            ">!I scarcely remember a scene going around after the first(?) story trailer released where all the orphanage kids went :O at the sign of Kiryu being alive. This scene wasn't in the final game (probably to ease the writing process), but I can't find it on the net anymore. There was a screen of it floating around this subreddit, does anyone remember? Was it a fake?!<",
            "I’m sorry but, even after hearing the b-tch reasoning and backstory, I still find her actions unforgivable. When will I get another team member? She is going straight to the junkyard.",
            "Survey out for SEA region, time to go ham on DLCs.\n\nhttps://enq.sega.jp/orca/PA20048086",
            "Is there anything missable? \n\nI’m starting chapter 6 and I wouldn’t wanna miss side stories or anything else, is there anything you guys would recommend to do before moving on with the story?",
            "When can we start switching and unlocking jobs?",
            "Does anyone know if there is a place I can reliably get shark fins in Yokohama?",
            "Do I need to play Gaiden before this one ideally? I bought IW yesterday but gaiden is still pretty expensive on the PS store",
            "Can I buy ankle weights or other XP farming gear? I accidentally sold mine.",
            "Does anywhere out there have a list of the weapon upgrades?\n\nI really wish strategy guides still existed. I just wanna know what weapons I wanna focus on early based on the late game options.",
            "What Classes outside of Samurai have Bleed Inflicting Skills?",
            "The answer is probably yes but I thought I’d check, can you finish drink links etc in the premium adventure? I’m at the point of no return and it literally says you can’t finish them but I’m guessing that just means until you’ve finished the story like in the other games",
            "When I bought the Add-ons at the last game, if I was to delete the save data off the console, I had to re-buy them.\n\nWill it be the same with this game? I don't want to have to pay for them again.",
            "I’m assuming there’s no way to convert weapon upgrade materials to their next tier? So fragments > geodes > crystals. If that’s the case, I’m assuming the dungeons are the best places to try and farm crystals?",
            "If you are wondering about the physical version Vs deluxe vs Ultimate etc. These are the DLC that correspond to the deluxe/ultimate tiers so you can buy the DLC for your physical copy.\n\n* [Ultimate] & [Digital Deluxe]= **Master Vacation Bundle**. Bonus dungeons, new game+, resort guests, sujimon (characters from the 7th game), outfits, gold swimsuits, some consumables, & karaoke music\n\n* [Ultimate] Outfits & Swimwear = **Assorted outfit bundle**\n\n* [Ultimate] Sujimon & resort guests = **Sujimon & Resort Bundle** (Most of the main back tattoo boss characters from all the previous games & LOTS of Sujimon/resort leveling items)\n\n* [Ultimate] Karaoke tracks = **Yakuza CD collection set** (different songs & more than the deluxe version)\n\nIt works out about 10% cheaper to get the ultimate edition than buying all the DLC separately. If you don't want the Karaoke bundle, it's still slightly cheaper to get the ultimate edition with the karaoke bundle included.\n\n* Not included in any edition = **Special Job Set** Linebacker (M) & Tennis ace (F) jobs.",
            "Are there ultimate armor for character's base class (Cabbie, etc.) in the dungeons, or does the character exclusive 7* armor you get in the final dungeon also counts as the class's 7* armor?\n\nI found one for most other classes down there.",
            "I’ve been checking out A lot of other players islands with pingwing. And I’ve shared my Island online as well. But there are some things The game is not clear about. Do you get notified when someone visits your island? And I doubt it but is there a way To choose what customer NPCs appear on your island when a fellow online player visits it",
            "I'm not sure which chapter to post this, but how to trigger the (substory spoiler)>!Ounabara Vocational School substory? I've already done all of the exams, am I still missing something?!<",
            "Any good place to grind the last levels to 70 without using the DLC?!",
            "Any word on fixing the issue where the bonus stats from job levels don't stay when you switch jobs?",
            "Hey does anyone know if the hero plate costume is in the game?? Looking online yields nothing....",
            "For the Brands to improve weapons, do the enhancements for \"increased chance to cause X status\" work if the weapon doesn't innately cause that status to begin with? TLDR: I want to put Bleed chance on Ichiban's ultimate bat, but don't know if I can with Brands.",
            "Brands don’t *add* anything right? Just increase likelihood? Like it doesn’t add charm, but if it’s in your weapon it’ll increase rate",
            "anyone having trouble triggering a memory at the batting cages? the icon is there on the map but there's no prompt for me to engage with.",
            "[deleted]",
            "Will there be an infinite wealth expansion DLC story similar to Lost Jugdgment DLC story ?",
            "Has Shintaro Kazuma ever been referred to as the reaper or am I just gas lighting myself? I feel like he was referred to as the reaper in at some point in the earlier games for what he did to the jingweon mafia or the flower triads but I can't find any reference to it.",
            "It would be nice if there was a way to remove the skill from the Menu.  \nI hate seeing certain abilities thats either an upgrade, redundant or useless. Its a waste of scroll space.",
            "I'll take a shot and try this here. Probably an unpopular opinion but i'm not a fan of the island at all. I was considering just skipping it and finishing the game but at the same time i'm a min maxer and always try to have the best gear possible. Do I just have to accept my fate and do the island if i want to go into the final areas with maxed out gear in terms of having money?",
            "just played the >!shark !<boss fight last night. it was hilarious my favorite boss fight in the whole series",
            "Just started Premium Adventure and wanted to buy charms/amulets from Kamulop, but he's only selling Tranquility Bat? How do I get those charms/amulets aside from him aside from Kamulop? Checked pawn shops and nothing there.",
            "Do I need to play the first 6 yakuza games to understand the like a dragon series",
            "Having finally finished the game, why exactly is the game called \"Infinite Wealth\"?  Like, when they announced that subtitle, I figured it meant the game was going to be about seeking wealth in some way.  Considering the previous game was about trying to recover from hitting rock bottom, I thought this one would continue with that idea, addressing the problem that the world tends to favor the rich getting richer and the poor staying poor.  Instead money was pretty much irrelevant to the plot.\n\nWas it really just that the infinity symbol looks like a sideways 8 so they just made up a meaningless subtitle so they didn't have to call it \"Like A Dragon 8\"?  It's not like the idea of \"infinity\" has any sort of thematic relevance either even though they use the symbol for it for the tag attacks.  If the idea is that the \"real infinite wealth was the friends we made along the way\", that's a pretty fuckin lame way to justify a subtitle.",
            "Someone should make a mod that allows selective voice acting, like if you like Ichiban's English VA but want Kiryu's Japanese VA. I'm sure it's difficult if not impossible due to pacing, and it would probably sound silly if not hilariohs to have a conversation between 2 characters where they clearly understand one another despite speaking different languages. \n\n\nAlso I asked a Japanese native if it really is that common for people in Hawaii to speak Japanese and she said it's basically the unofficial second language, more so than Spanish in the mainland US (considering that unless you're in certain areas of the country you'd be hard pressed to find a natjvd who can speak it unless they are the child of immigranra or work in an industry with a lot of Spanish speakers like in a restaurant) ",
            "Ichiban’s slow motion hand shakes are sooo weak. They make me uncomfortable. Give it a proper grip!",
            "I have a question about switching protagonists and areas. Minor spoilers for Chapter 10 and below.\n\n>!Without spoiling the story, does Kiryu ever go back to Hawaii or does Kasuga go to Japan? I'd like to use them both on the same team to complete the dungeons. Having two split teams makes it harder to complete them. !<",
            "Does anyone know when RGG tends to discount DLC? Anyone got the info for when the lost judgment season pass first got discount? Or any other similar situations. Really want to buy the master vacation bundle.",
            "Does the game get better? Going to come back to it but it's just not grabbing me. Combat feels so repetitive. ",
            "Taking items from the Honolulu team to put on my Yokohama team... damn these guys have the fastest shipping ever.",
            "Games a masterpiece imo, really loved it and i wasn't even a Yakuza fan like that to begin with (only played Yakuza Like a Dragon before, had my issues here and there with it).\n\nSpent 170+hours on it WHILE enjoying every hour of it.  \n  \nIt puts FF7 Rebirth to shame imo.",
            "Just finished it and overall, loved it. But when it comes to the story I... don't know how to feel? I'm ambivalent about so much of it. Felt a lot like >!we just kept being teased without much payoff, !<and even the ending when >!Haruka, the daughter he hasn't seen in years, turns up to Kiryu's room with the baby we all took care of, now a school-aged kid and Kiryu's just... not there? !<\n\nWe get an entire song for >!Ei-chan, complete with waxing lyrical about redemption and friendship but not the reunion?!<\n\nI could talk on and on about it but I'll leave it here for now as I have other shit to do, but >!I am glad that they didn't kill him off. That would just fucking suck. !<\n\nE: One other thing, RGG cutting corners with Bryce's English and it showed lmao. Reminded me of Mine. Oh, and how the hell >!did Andre survive falling off the ruff? !<",
            "The game doesn’t give you any good opportunities to do Sujimon battles, run Dondoko Resort, do Alo-Happy activities, or other side content. It expects that in the middle of rescuing somebody who has been kidnapped, that I will take a several week break to built an island resort. This is really annoying me. Instead of enjoying the story, I am spending the entire game hoping that the next chapter will give me a short break to explore Hawaii a bit. I am now on chapter 12.\nMaybe I should just start the game over from scratch and complete all the Hawaii side content in chapters 4 and 6?…",
            "I have been done with this game for over a month and it still makes me angry every time I think about the ending. Its my fault for expecting a lot from this game but what a letdown.",
            "My thoughts on the party members:\n\nI kind of wished that >!they didn't make all the same party members from LAD recruitable again in IW!<.\n\nObviously the core party moving forward is going to include Adachi and Nanba. They're Ichiban's besties at this point and I'm all here for it. Saeko is a toss-up but will likely be stable as the main female party member.  \nI'm glad Seonhee was playable. Her character design and role in LAD was too strong to not play a bigger part in IW, but the way they characterized her as a Kiryu simp compared to her being a lot more cunning and ruthless in LAD feels strange.\n\nI feel like >!they wasted Zhao and Joongi!< though. They should've made them support characters tbh as they didn't really have anything to offer story-wise >!(save for Joongi literally running away to Hawaii because he felt left out lmao)!< and their personalities feel so watered down.>! Zhao I can understand since he's not a part of the underworld anymore and is just chillin' with his restaurant but they did Joongi so dirty this game. !<\n\nI don't mind the party splitting up between Ichiban and Kiryu and sharing main protagonist roles but >!not having all the party together until AFTER you beat the game is such a waste. They could've done so much more for bonds and interactions between characters.!<\n\nThey introduced this support mechanic but only had it show up in like three battles? They should've expanded it out to include more characters or replace the summoning mechanic with it. Throw >!Zhao and Joongi in support and give us Yamai as a playable party member instead.!<\n\nOverall, I just feel like the party members needed to have a valid reason for joining the party from a narrative perspective unless >!they're a gimmick/optional character like Eri was.!<",
            "Man what an ending. Between >!Kasuga carrying Ei-chan to Shiina Ringo, to Kiryu on top of Ebina realizing he has to try and survive to really atone for his time as yakuza, to Kiryu getting his name back, I cried. Also another takeaway is Yamai may be my new favorite character in the series.!<",
            "Just finished the game. The main story didn't make a lot of sense this time but overall phenomenal game. The battle system is probably the best ever in a jrpg and Kasuga is the best written pure character I think I've ever seen in media. A bit too much Kiryu nostalgia drags the game down but otherwise it's a incredible game. I really hope the next game is a new character thought. I'd like a mid 20s female lead with Ichiban and Kiryu just playing supporting roles. Move the series forward with a new style lead character again.",
            "I've reached chapter 13 and I'm still wondering why this game is called infinite wealth? Nothing in the story or side content feels like 'ultimate riches'.\nThey could've called it >!Dying Dragon!< and it would be more fitting.",
            "I am SO glad this is not the last hurrah for kiryu because it could have been better for example they could have put every karaoke available for them to sing (even the haruka, Akiyama, majima, etc)  and they could have used the other characters better with the poundmate mechanic how cool would it be if the morning glory kids, the hirose family or the ono michio fans did some silly attack after we seen their part of the story during awakening the dragon, and that final dungeon I was honestly expecting some endgame shit were Date and Akiyama take care of the low level grunts as we keep climbing and then the ex Tojo also help out kiryu , hell they put the dudes from judgement and they do literally nothing",
            "I’ve been curious of this franchise and just beat Like A Dragon and am juggling both Judgement and Infinite Wealth now. What other games do you all play? I’m kicking myself for not getting into these games sooner. As of now I have yakuza:LAD, Judgement, LAD: IW and Lost Judgement.",
            "Not sure who was in charge of pacing of this game, but that guy needs to be fired. In many ways this is so far one of most infuriating Yakuza games due to unreal level of hand-holding and infinite expose that just prevent you from playing game. Fact that world really only opens up in Chapter 3 is up with my complains about Saejima in Y5 where it took FOREVER until you finally got to play game in open world and not follow string of scripted events.\n\nOn topic of pacing, I didn't know why I play the game because nothing seemed to be happening up until Chapter 10. There is no real reason why I should care about various mob groups in Hawai as Ichiban is just visitor aside of fact he is trying to find Akame and they been looking for her as well. Kamurocho and IJ seems to both be doing just fine too, no help needed, thank you. Chapter 10 finally gives you stakes but at that point I was playing for everything but story about which I lost any interesting in as developers seemed to have done the same. Not sure where the people who dropped banger like Y7 story went, probably were on vacation in Hawai when storyboard was drafted. With side content that you probably already consumed by Chapter 10 we are talking good 70-80% point in the game by that time, that's not good.\n\nKiryu portion was strongest, but entire Daidoji thing I feel was bad idea, Kiryu on leash of political group that is using his own foster kids as blackmail material (Gaiden) seems rather out of character for him, not to mention they don't seem to do anything but just exist. I understand devs are drawing parallels with Nippon Kaigi (which is hardly shadowy), but I would expect them to do something aside of sitting in house looking important.\n\nLife Links were good, especially seeing some characters we didn't in decades at this point, but wasn't fully aware why can't Kiryu just sit with them now the jin is out of the bottle and at least few characters like Fukoaka chief knew that? Again it draws back to Daidoji who, again, I think are kinda dumb. I don't think RGG will ever bring most of these characters back in any later installment so Kiryu having last heart-to-heart with them would be nice close and feels like missed opportunity.\n\nCombat improved and fun. I didn't care much for Tomi, but Chitose was fun as companion. Old crew from Y7 kept their very high standarts, in case of Seonhee even went up IMO. Yamai is very good new character, hope they keep him around even as companion. He has that nice balance of batshit crazy and honorable that worked wonders for Majima.\n\nOverall, I'd say Y8 after Y5 went off with boast about \"biggest Yakuza\" but where in Y5 it seems they told devs to go crazy and pull in any stuff they can think off, in Y8 they had all this massive emptiness and filled it with slog. Alas disappointing.",
            "It's a big ick for me too that various documents (newspaper and stuff) are in Japanese. The scenes clearly expect you to understand what the documents say but I simply don't. Not that big a deal but it feels like I've missed something, every time.",
            "Probably the same problem for Japanese people though with the English episodes.",
            "There's two podcasts and English one and a Japanese one. It'd be annoying to have constant subtitles for the radio. The intention is that you can listen to the one that's in your language.",
            "Yep. Had to pause the game and make sure I didn't somehow pick the wrong one. On that note, seems Ichiban's victory/level up barks are also always in English.\n\nEdit: Oh. I guess I should save+quit once to change that. Actually still kinda felt appropriate since *most* of the game is gonna be in Hawaii anyways.",
            "Yeah this bamboozled me but i thought it mau have been the case lol",
            "I hate that they only had it for one game.",
            "that's a lesson they should really take from Persona\n\nthe conversation logs would be so helpful, especially in this series that is full of a TON of dialogue and interwoven webs of plot threads",
            "It's a feature that I give extra points for in JRPGs, I wish that they had it in RGG games in general",
            "Finally someone said it!! Lol i remember having to open that log many times in LJ because characters talked too much and i couldnt always keep up. So with Infinite Wealth i had to rewatch some scenes on Youtube to not miss out on any lore stuff, not to mention some long dialogues got advanced really quick, for example Kiryu's inner dialogue about his old friends in Life Link missions.",
            "I'm always surprised at how many features are not preserved from game to game.\n\nJudgement didn't have minimap rotation like the other games had. And some games let you choose the the icons (Microsoft style ABXY/Nintendo BAXY/Playstation symbols) but others don't. Would be nice if it was a consistent experience across all RGG games.",
            "Knowing him he gave it all away",
            "Eri was a tulpa, a product of his imagination, and so the time he spent at Ichiban Confections. He just went there to an empty office and pretended he was working. All the money and items you get as a result are also part of his delusions.",
            "I would find it hard to argue against this, he becomes playable at like the 11th hour of the game lol. Like I'm not sure how much later they could have made him playable outside of making him playable for the last mission only.",
            "By the time he joined my party I'd kinda lost enthusiasm. I had to level him up by 20 levels to bring him in line with everyone else, and rush through all of his bond stuff in one go.",
            "I rushed to do all the walk and talks with him and it was STILL too late to get him to 70. Idk, but something about this game incentivises so much grinding. Same with the Dragon's Awakening.",
            "Tbh I didn't even bother using him; I'd done all the Drink Links and social shit for every other character, so by the time Joongi showed up, I was ready to just finish up the game and start the final mission.",
            "> I feel like Sega Japan and America should have combined their work and had the English dub voices for when people speak English, like they did with that Kson girl\n\nTo be fair, they did that with Kson because she's both the Japanese & English VA for the character.",
            "> Japanese is overall better, but it's pretty obvious that when characters speak English (even if they're not Japanese) the actors are clearly Japanese and/or non native speakers first, even if the character is a white guy. Eric is also odd, for someone who grew up in America he sure does sound like a Japanese person who learned English as an adult.\n> \n> \n\nthat was very weird. i figured what they'd do is mix audio tracks. use the english VAs when the character needs to speak english, and the japanese VAs when they don't (as you say).",
            "Yeah. Bryce especially had a really bad Japanese accent. Not necessarily the actor's fault but they could've just cast an English speaker. Does it even make sense that he knows Japanese?",
            "My biggest issue with the audio is that the characters voices don't sound very good with 3D headphones. I'm playing this and Doom Eternal simultaneously right now, and the audio and surround sound even with voices in that game blows Infinite Wealth away.",
            "I was pretty deflated after the ending but this has cheered me up somewhat, great catch!",
            "Great catch",
            ">!adachi truly is the goat. my man is the only one that did no wrong except laugh at his hair !<",
            "Im loving the combat, im having a lot of fun trying to line up tag team attacks and knocking enemies into things (or cars first time a moving car ko-ed an opponent I laughed so hard).",
            "Agreed - really was not a fan of the combat in Yakuza: Like a Dragon despite usually enjoying turn-based combat, but I absolutely love it so far in Infinite Wealth. Feels much, much more engaging.",
            "yes, the combat is *vastly* improved. being able to move around (movement range even expands as you level up!) and use objects for basic attacks made it much more enjoyable than the previous game.",
            ">!Yeah, 7 was hard to top. It had a lot of heart and was close to the chest for Ichiban who came off better in 7 (he comes off a little dumber in 8?). It also closes out Tojo/Omi stuff only for this game to say that it fails one year in. I think 8's story was a little too ambitious and spun its wheels for a bit around ch 6-8 when you're looking for Akane, picks up for a bit, and then ends.!<\n\n>!8's gameplay with 7's story would've been the dream. The job system in this game + positioning yourself optimally + Kiryu's real time combat were great stuff.!<",
            "Honestly the fact that no one important died is surprising, also why couldnt they show the scene of kiryu finally reuniting with haruka, grrr, makes me so angry",
            "i can see why you think that. this game's narrative was *very* ambitious and it might have felt shallow in parts (e.g. the gangs in 7 were very developed, not so much in 8 imo)",
            "I think the 3 key areas where it falters are.\n\n1. Trying to convince us that Ebina is a legitimate threat to the Yakuza despite his whole hatred of them only being revealed only in the last chapter, and really only to the characters at the final boss fight.\n\n2. Palekana. I guess I get what they were going for with the chase sequences. It would've been cool if it was like the Jingweon where they were popping up left and right. But they just disappear after we hide for a little.\n\nAlso no need to say this, but Bryce should've been cooler. Considering that they kept mentioning his age and he controls those giant monsters, I legitimately thought he was gonna be some kind of enhanced human.\n\n3. Lack of emotional depth. Basically only has emotional moments with Eiji, who I feel doesn't warrant it to the same degree as Ryo Aoki, who had been at Ichiban's side for years, and whose nihilism made for a much more interesting arc to contrast with Ichiban, imo. \n\nAlso the fact that Ichiban doesn't seem to give a shit about his biological family. Akane I kinda get, but they should've at least had a few more moments together. In fact, there could've been an interesting dynamic with Akane, the woman who loved Arakawa more than anyone, and Ebina, the man who hated him more than anyone.",
            "She's in a water bowl on the 'Revolve' rooftop/balcony.",
            "Or the Korean Mafia to Kiryu.",
            "Came here seeing if anyone else noticed this",
            "It was a weird oversight. But I guess it is fair if it is the same other way around.",
            "they were also in Lost Judgement but it is very impressive how well they work considering a lot of AAA games still can't figure stairs out",
            "I jumped on one and had to stop and be like \"huh, this shit actually working\" then proceeded to run up the down escalator Ofcourse 👍",
            "spoilers for IW ending\n\n>!i'm glad someone agrees on your second point. not everything needs to be explicitly happen to be understood. its not that haruka was gonna leave, she was waiting for kiryu once he's out of chemo!<",
            "I honestly enjoyed the haruka and kiryu points, !I agree 100% here with your view on it. I am just hoping with how they ended it,kiryu being able to use his name,that I hope we get some kind of DLC or maybe with the next game we get to see them actually enjoying each others company and kiryu can truly live in peace with haruka and her son!",
            "Please let me know if you manage to get on with the New Zealand trick.",
            "On PlayStation, you need to have bought the game with a new Zealand account for that to work",
            "Please let us know",
            "wasnt the entire 1st chapter of LAD 7 just a 2 hour movie iirc. Always prepare food and play it on the tv.",
            "I think Persona 4/5 was around the same length, or am I mistaken?",
            "Dondokodon resort and sujimon league are both almost entirely gameplay and nice change of pace but yeah the first 3-4 chapters main story wise are beefy lengthy, can imagine it being that way till credits roll ",
            "It's super slow, too. Like, if you haven't played 7 or any Yakuza game before, it's gonna be super super boring and confusing. Like, what?",
            "Not a lot of gameplay, but the set up of the story in 8 felt a lot quicker than 7. After 2 hours in LaD8 I felt like I knew what was going on and what I am doing. 7 had a bit more gameplay in the beginning but the story set up took longer.",
            "Tbh, i prefer when they dump a load of cutscenes on you, the combat in LAD games isnt that interesting to me and there is too much of it especially near the end of this game.",
            "I noticed that too, it's really lame I like walking into the shops.",
            "Bubble bale from housekeeper is ridiculous. Does crazy dmg and is an AoE it’s mental",
            "Seriously- marginally more MP intensive than the cheapest abilities, but heavy damage & AoE (and this time around light-medium-heavy is accurate to the actual damage values), the arrow skill you may as well inherit on every character.",
            "I put that shit on everyone but Nanba lol",
            "Human grating was top tier",
            "there are some BRUTAL moments in this game, even for the Yakuza series",
            "I was surprised too. It was weird because the tone in the games is so wholesome.",
            "Really? How?",
            "My take on that point: This is my second Yakuza game, with my first Yakuza game being the 7th (LAD). I heard the LAD was a \"reboot\" of the series, so I started there with no prior knowledge on the series. I obviously pieced together the big cameos in LAD were from previous games, which obviously had little impact on my emotionally but it didn't detract from the present experience. I finished the first game and rated it my personal favorite game played of 2023.\n\nNow that I finished Infinite wealth, my second Yakuza game, I can say that I thoroughly enjoyed it through-and-through. When I got to the Kiryu sections, I found myself quite invested in his story, as I was seeing it from the perspective of his party (Nanba, Seeona, etc.). Essentially, characters I am familiar with and understand how they act. I also found the Kiryu chapters to be the most fun from a pure-gameplay standpoint. The game has good systems, and you are encouraged to explore these more with his chapters. While some of the emotional weight was not there for me, I think they did a good job for players who have no background on Kiryu\n\ntl;dr I knew nothing of Kiryu but by the end of the game, I came to love his character and understand his importance in the series. His chapters where also just \"good video games\".",
            "That's very understandable. Even without the Kiryu Memories, I think its the first RGG game besides  Yakuza 2 where I think someone should play the previous title. I don't think its right to say that the writing took a step for shuffling the main cast around to fit the story that IW tells. While the Yokohama castmates definitely take a back seat for the story, The new and returning characters at the forefront do a great job at conveying a lot of the stories' themes. Not to say that they couldn't be done differently with the old guys. I think my issue is that I think this game jumps the shark figuratively and literally for the series as I have no clue what would make Ichiban's next adventure something that would be nearly as original as this one was without just retreading it.",
            "I am very late to the party but I have similar view as you, gameplays, mechanics, QoL, and minigame are huge improve over LAD, but story and character development are disappointing in IW. Not having play any other Yakuza game the “Kiryu a trip down memory lane” doesn’t quite pull the emotions for me. Aoki Ryo and Sawashiro are written so much better in LAS. Yamai being my favourite character written in IW. Tomi and Chitose character development aren’t  as good as Nanba and Saeko ",
            "He doesn't like getting in the middle of it.\nI am happy to have my pigeon raid again. ",
            "Yeah those box ones are complete bs, didn't have any issues getting the other non rectangular items. But those seem Nigh impossible to grab",
            "It's not a crane, it's a shovel",
            "Just DO NOT unlock the booster DLCs. They dump a metric fuckton onto your inventory, pretty much breaks the game.",
            "\"i never said i was a saint\"",
            ">!Yakuza 11 will reveal it was a rubber grenade!<",
            "Kiryu killed someone and Ichiban definitely fooled around at least a little with the girl from Ounabara 😂 growth",
            "Seems like saving and quitting fixed it for me - it also gave me all of the DLC I had bought (rip off, but I need everything)",
            "Me and a friend are also having this issue. Think it might be a bug.\n\nUpdate: as GrabZestyClose said, saving and quitting worked for me as well",
            "For real, I was going to have to work tomorrow before I could play so being able to play almost all day today has been a blessing",
            "This drove me up a wall but I feel like it’s at least gotten slightly better as I’ve progressed.\n\nNow if I could just get over the badass main protagonist running everywhere and fighting in FLIP FLOPS.",
            "Yeah, he looks like a serial killer about to say \"here'sss Johnny.\"",
            "I keep asking people this: What did we get with Gaiden and 7? AFAIK, we didn't, either.",
            "i think i got some superpower items for having Y7/6 in my save files from LJ/Judgment remastered",
            "I'm level 23 in chapter 4. The fights are level 13 lol",
            "As far as I know it never got actually discussed further in the game. I was also confused but I guess it fits alot into his \"God-like\" image and persona. Even his entrance scene very much played into that. My guess is he's just very git for his age and the rest just got out of hand through rumors and legends.",
            "I was thinking the point being just how much influence he has over his cult that it creates an exaggerated image of him: Aside from aging well, he's basically the wizard of oz: Man behind the curtain displaying a big image.",
            "Now Gaben is edging me",
            "He always had gigantic forearms, yup. I was baffled when my boyfriend said \"I thought Adachi was fat? He's ripped!\"",
            "He probably had to get one to keep his disguise as an yakuza going, but it is weird that he seemed proud of it. I think the imagery would be much better if his back was covered with scars from tattoo surgery removal",
            "Here's my take on it. Ebina wanted to end all the Yakuza right? By becoming one himself, this would include him. This is a subtle way to let the audience know that Ebina doesn't intend to make it out of this alive. That he considers himself Yakuza as well and thus deserving damnation. He isn't after a happy ending for himself.",
            "If you didn't see the other comments, it's fixed easily by just restarting the game.\n\nDunno why it happens, but after one restart, it didn't happen anymore",
            ">the story, which, to me, was probably amongst the worst in the series, unfortunately\n\nIt was a little disappointing after recent highs in 0, 7, and Judgment, but coming off of LJ which was also very divisive. I dunno, overall I still had fun and tbh I don't really play the games for good stories since the stories in the oldest games weren't the best",
            "> Everything Palekana was far too goofy and detached,\n\nYeah, it felt really off. I wonder how much of it was inspired by the JRPG trope of >!heroes go off on a personal quest and ultimately fight god!<",
            ">!Swapping the treatment scene and the Haruka scene then extend it so that Kiryu comes back to his room to see Haruka and Haruto, then it would be perfect imo.!<",
            ">!The ending, at least for me felt like everything wrapped up so neatly. Like I felt we were missing a few cutsenes like an actual farewell to Akane and Lani, a short last passing of the torch moment between Ichiban and Kiryu. I also felt like I missed a cutsene like how the hell did Eiji get to japan??!<",
            ">!They must think not showing it on screen solely because people want it is them being sophisticated or something.!<",
            "Honestly, easiest win would be >!Kiryu actually dying for real. Or leave it up for interpretation if he's alive or not. It would be sad, sure, but way more impactful, plus the whole game - not to mention every game since 5 - was gearing up to it and now all that buildup feels fake!<",
            "Yeah weird they have a substory saying to listen each chapter and then its exclusively in Japanese with no subtitles",
            "They're all great games. My personal favorite is 3 but I'm definitely in the minority there lol",
            "I really recommend playing them when you have time. Very fun games. ",
            "This is a good idea to get ultra burned out lol, each game is like 40-60 hours, lord help you if you wanna do 7 games worth to catch up on the story.",
            "Your first paragraph is a big one for me. Maybe it would've been better for it to be a Yakuza 3 ending with Ichiban >!Trusting Eiji, but like Hamazaki in 3 with Kiryu, Eiji stabs Ichiban. Idk what to go from there, but it's weird that they patched up so easily.!<\n\n100% agree on your 4th paragraph too. I felt it insanely weird who's final boss was who's. They should've been switched.\n\nDon't agree on the 5th paragraph. Those fights were highlights and their gimmicks made the fights really entertaining rather than standard RPG fare of spamming weakness attacks with an occasional heal or buff.",
            "Def agee on the last point, dudes chilling on your sofa for days",
            "the ending in IW is justr as good as 7 imo. the issue with IW is that they didnt make the game longer to add more depth since this was a dual protag game. needed at least a chapter between 14 and finale. add some more ebina stuff etc. the story was more high stakes and higher level but they screwed up the pacing. they also could of done more with wong.",
            "I'll second this, that pareo is absolutely busted. It's from the Lei substory, although I can't remember the name of it off the top of my head.",
            "Yeah, I heard bad things about Yong's voice in Gaiden(haven't played it yet) but I'm wondering if Gaiden was just bad voice direction after playing Infinite Wealth. He does a solid job. Wish they didn't autotune the karaoke songs so much, though, I've heard Yong sing in a recent video collab he did and there's no way he botched it so bad they had to autotune him.",
            "oh totally, his chapters were much better, felt more grounded and typical yakuza game. lots of big moments. the reminiscing stuff was actually great, and some of those side stories were the best in the game.  His ending fight was miles better than any of inchis stuff, which was really disappointing tbh.  Ichi seeing stuff different in his mind was a way to do crazy stuff, but now we are actually getting real crazy stuff like giant squids and jaws as bosses?  felt pretty stupid in my opinion, and i really hope yakuza doesn't go more down that road.\n\nThats why kiryu  stuff felt so much better, and tbh his party was also much better lol.",
            "> Anyone else feel like Kiryuu kinda overshadowed Ichiban?\n\nthis is something people were worried about, especially because it's kiryu's last game. they went the distance to celebrate his life and legacy.",
            "Once they split up, totally. Kiryu's chapters were more enjoyable, partly because of the all the reminiscing and Bucket List stuff you could do which had a nice somewhat existentialist tone to it.",
            "he kinda did, half of the game is Kiryu and I just wanted more Ichiban. I would just have liked for him to like, not come back after his little moment in Y7",
            "....is this really a thing? A more or less multiplayer mode in Yakuza game????",
            "That Alo-Happy thing was the one part of the game that made me want to stop playing for a bit. Especially after the game dropping several hints about his *lack of experience*, it felt even more gross.",
            "Not every substory has some emotional backstory. The Sojimaru substories and the one where that parrot lands on Ichiban's head are a couple of examples of ones that just go for comedy. Although I do agree that they *seriously* need to compose a few different emotional tracks. Hearing \"that\" piano and \"that\" guitar for the hundredth time while yet another NPC exposits their tragic story is definitely beginning to irritate me.\n\n>Also, that one sub story where the Alo Happy lady full on SAs Kasuga and it’s done for laughs. Can we stop with this shit man?? I thought we’d left “it’s funny when it happens to a man” in mid 2000s comedies, but apparently not\n\nHonestly, all of the \"romance\" substories are like this, it's not just the Alo-Happy one. But I agree, it's not good (okay, I'll admit seeing Gary Buster Holmes appear in Chitose's was pretty funny). The similar substories in Yakuza: Like a Dragon also sucked. Having to grind out generic bonding relationships only to get a weird sexual assault scene played up for laughs *five times* is just bad (made even worse by the follow up story where Ichiban is essentially punished for being assaulted multiple times - by the people who assaulted him in the first place).\n\nIt's especially crap in Infinite Wealth's context because Ichiban confirms multiple times that he's not interested in anyone else because his heart is set on Saeko. I know this argument is brought up every time in these sorts of complaints, but swap the genders of Ichiban and the substory characters and everyone would be rightfully angry. It should be no different now.",
            "I'm so glad they used the original version.",
            "Yh, they should have just kept the locals English, and everyone just understands each other like in Tekken",
            "Also, I ran away from the police and assaulted them, and then I'm waving at every stranger and I'm appearing on a tv show? lol",
            "As someone who has the same issues, I will say you get used to it (though its never really gets better).",
            "They’ve been using the animation since i think 4 or 5, I unironically know it off by heart",
            "You know what's funnier? Besides from Dwight, (as far as I can remember) they got dual VAs on three minor characters, the police and two Palekana staff, but not two of their supposedly English fluent major characters (Tomi and Bryce). The decisions they made in this game are so bizarre.",
            "That Eiji bastard got a fucking ending song but all we get for Kiryu and Haruka/to is having both of them on the same hospital. What the fuck is the point of this game?! There's really not much happening to move Ichiban's saga forward, and all we get out of Kiryu's story is \"he's not in the shadows anymore\". We don't NEED an 80 hour game just for that. WTF HAPPENED TO THE WRITING??!",
            "Cows give milk",
            "Plates",
            "The whole thing with family of Kasuga is inspected throughout the whole game, Kasuga always insist that he doesn´t care at all about blood family, he cares about the sentimental bonds made through actions. He cares a lot about the Arakawas because he lived with them and because Arakawa taught him a lot when he was his big boss. \n\n  \nTo him being related by blood to someone means nothing, and he tells that to others many times throughout the game.",
            "Fr man. I actually put up a complaint on the official Sega feedback website and all I got as a response was to \"All information about our upcoming titles release date/ availability and other marketing info will only be announced through our social media channels\" and then a link to the Sega Twitter account.\n\nIt sucks and I am so disappointed to be forced to pay more than others to only get the pre order bonuses.",
            "theres a dungeon that will unlock when you progress",
            "I hate the lighting as well, every session I play this game I inevitably end up in the HDR settings trying to make the NPC's not look like ghosts. I'm glad it's not just me or my TV because I've never had a bad experience graphically like this with a Yakuza game.",
            "I think 2 things. 1. They decided not to make this next Gen only and 2. Dragon Engine still isn't great with bright lighting",
            "Nope. The current actor is perfect.",
            "I played in Japanese solely for Kiryu, but I played a bit in English and also played LAD entirely in English and I honestly can't think of anyone better for Ichiban than the current English VA. His range of serious to goofy is straight up protagonist status. The same kind of goes for the rest of the English cast - their voices do lend a bit to their personalities if you're a native English speaker. One small thing is the little callouts they do during battle which unfortunately you don't get subtitles for if you play in Japanese. Eric in particular is pretty funny in English, and I thought the Sujimon were also surprisingly funny in English. Like when you go to capture one of them after a battle and they're out of breath and clearly injured saying \"Y-you wanna go??\" Lol gets me every time. I do kind of wish I knew what Kiryu was saying during his fights though. In English he says stuff like \"Time to take out of the trash\" when you switch to Rush Mode but I wonder if that's also what he says in Japanese.",
            "Middle of ch7",
            "1-3 7star weapons, kiryu full awakening in 1 of 3 styles and full 7 star armor should be easily doable before heading out in chapter 12, add having done all substories for the 10M poundmates and its pretty much trivial encounter when abusing weaknesses.",
            "definitely prioritize >! majima first !<",
            "The earlier house maybe",
            "There was a heavy hint in the ending cutscene song iirc, no? Infinite wealth = true friends and family. Kinda poetic, one of the very few things I liked about IW’s writing.",
            "Yes. And a needy Happy Alohan woman.",
            "yes i really enjoyed the ending, but after i sat with it for awhile. i do agree they kinda just droppped so much stuff. chitose really did need a closing cutscene. If you think about it without her ichi wouldn't have a clue how to handle that moment after they won the fight at the end.  She was the unsung hero of the game tbh and then just nothing , shes gone to be ceo.. ok?\n\nand yes ebina had a really good fight and then after that scene, just nothing. any word about him was just \" they have all gone now\" ok? \n\nits like they needed to wrap up the game so fast, yet they spent soo much time during the game with so much back story and side stuff. \n\nAnd finally kiryu ending was not finished again? like really? just send him off with haruka into the sun set and be done with it. its getting silly at this point.\n\nStill loved the game, but it could have easily been one of the best yakuza games if they had tidy up the story threads abit more.",
            "I think you missed the part about Lani and Akane while the gang spoke about them in the bar. >!Lani is now the new sage of Palekana and Akane is helping her.!<\n\nAs for Kiryu, I>! do agree that it’s kind of a cop out once again, because the cliffhanger ending just indicates that we will most likely see more of Kiryu in the next game. Can you imagine if the next game started up with Ichiban visiting his grave? What a kick in the nuts that’ll be. I guess this inconclusive ending was to be expected, because Kiryu is basically synonymous with the franchise at this point, and many fans have expressed their unwillingness to let him I really hope he doesn’t come back as a main character again, because all that bucket list stuff would’ve been a total joke. But because the matter of the Daidoji hasn’t been properly resolved, I don’t know how the writers will intend to tackle it in the next game… !<",
            "I completed all of them and the answer is >!no, except for the girlfriend one (it's a copy pasted substory from LAD).!< \n\nIt's kind of weird that we now have party members running around with us, yet they're not involved with any of the substories. I guess we'll have to wait for the next game to have this feature.",
            "Brother enjoy the game",
            "8 hours left less gooo",
            "> beside that the thing that annoyed me the most was the main villain, just could not take him seriously and was too cartoonish for me and the fact that take so damn long to finally fight him was a drag.\n> \n> \n\n>!ebina!< needed more screentime, either with or without the protagonists. instead he feels a bit 'tacked on' because we spend so much time far away from him and become invested in other characters instead. at least, >!bryce!< made me feel something (pure disgust and hatred)",
            "Yeah, it was such a big deal about him finding a cabbie that spoke Japanese at the airport, then literally everyone in the side-quest universe speaks Japanese.",
            "Honestly, I had the same feelings about >!Chitose!< that I had about >!Nanba!< in the previous game. To the point that I didn't even give it much thought, because I was like \"Ok, we're doing this again\". Like, these are the things that are going to happen in an Ichiban game: >!he will be betrayed by one or more party members!< and >!he will have a hidden sibling!<.",
            "Yeah, you can fix it by going back to main menu, switch to English audio, and then switch back to Japanese audio. Worked for me.",
            "I think that's just how the game is designed? Like a Dragon is a very easy game, right up until almost the end, where suddenly it feels like the Bosses are way, way harder than anything faced previously. (Admittedly I haven't finished LAD yet, got my ass kicked by [spoiler](#s \"Reiji and Mirrorface\") and decided to take a small break. But I distinctly remember thinking \"This combat is easy\" most of the game.",
            "I have figured it out pretty late in the game. I just press block button as soon as enemy's fist/projectile gets near the character. It's important not to press block button before, since it'll count (without any notification) as a failed block and there'll be a short period of time preventing you from blocking again.\n\nNot a very clear mechanic, honestly. I wish they'd make it easier to understand.",
            "Finish the game if you havent yet",
            "Big Swell isnt canon.",
            "I only just started the big swell but I think it’s non-canon so it kinda happens whenever.",
            "Yeah sadly it doesn't show anymore.",
            "The dungeons honestly don't even overlevel you THAT much because there is a soft-level cap per chapter, so if you bumrush the dungeons as soon as you unlock them, you're getting way less EXP for doing the later sectors than if you did them in a later chapter.\n\nWhat you're mostly experiencing is the game just being piss easy.\n\nFor me I:\n\n1. Didn't do the dungeons\n\n2. Didn't grind, mostly the only side stuff I did were the substories and dragon memoirs\n\n3. Had a personal rule of no consumables -- all my heals, revives, and MP restores must only be from skills or vending machines.\n\nAnd still, the game was really really easy.\n\nThey need to have a hard mode from the start next time, not lock it behind second playthroughs and DLC.",
            "it\\`s been like that in every yakuza game.",
            "Pretty sure 7 was the same until premium adventure so I guess not.",
            "Discussion doesnt go away and its seperated into chapters. Go at your own pace and do that for all things in life, youll be happier",
            ">!Kiryu lives on!<",
            "Aquanaut has two very potent AoE healing skills, and Pyrodancer's infinite range regen is also very useful.  Host and Pyrodancer seem to be the main mage classes, so you'd probably want to be one of them while inheriting stuff from the other and Aquanaut.",
            "You cannot reunite the parties until you beat the game. In Premium Adventure anyone can go anywhere",
            "Should be at the same guy that upgrades your bat, fully upgraded on like day 35",
            ">!I got destroyed when the Amon’s got brought back to life and triple combo’d Kiryu lmao. My first strategy was to try and AOE spam attack them but I found focusing one down at time helped me!<",
            "the drug store near district 5 i think",
            "if you haven't found your answer yet: you can buy first aid kits at pharmacies",
            "Convenience",
            "Crazy Delivery (I think)",
            "Minigames, rarely in suitcases",
            "I’ve gotten one or two just from the random items lying around in the dungeon",
            "> Hawaii disappointed a bit, as they dropped the whole fish out of water English/Japanese thing pretty quickly.\n\nYeah, I wish they really committed to the bit and actually had English-speaking characters speak English, and Japanese-speaking characters speaking Japanese. But past the first few chapters in the game, they mostly stop giving a shit about that.\n\nIt also felt like the early chapters set up themes of social commentary that the game decided not to really deliver on at all. \n\nThe game had a pervasive problem in general with the second half of the game feeling like it was written by a different group of people with a different vision than the first half. Both halves could have been good if the other half served as proper build-up or payoff.",
            "There are a LOT of flaws with the game story wise sadly",
            "Same questions. >!The entire orphanage should already know their Uncle is still alive!<.",
            "It's so dogshit",
            "Definitely the slowest start in the franchise. It’s straight up an intro for damn near the first 8-10 hours",
            "I read somewhere it has a higher chance of raining while you're around aloha beach. Tried it out and after ~15 minutes it started raining.",
            "Hate this too, but the Hero job does have a self-revive.",
            "Gaiden was made after Infinite Wealth and was supposed to be a DLC for it.",
            ">chapter 13 of Yakuza 7\n\nits already out so no :D",
            "Same I only got like 2 hours of playing in the morning. Now im working a 11h shift 😭",
            "It's just demo. Nothing exclusive, unless you count bugs. The playable parts in the demo are just some parts of the full game. AFAIK.",
            "I'm sure you already have the answer by now but just in case you don't:\n\nThe story in the demo is basically a hour long extension of Gaiden's post credits scene. It has a playable Kiryu part that takes place during a section of the story where in the full game you're still Ichiban. It explains what Kiryu is up to before he finds Ichiban. Then once they meet it gets kinda weird because it has you do stuff you do in the full game but it's altered, and so it isn't what actually happens, like they add a boss fight that doesn't happen until later right at the end of the demo. So I wouldn't say it's necessary but if you played Gaiden I would maybe just look up the Kiryu part of that demo?",
            "I think I know which one you're talking about and I'm pretty sure it was fanmade",
            "pretty sure that's fake",
            "Apparently it’s recommended to finish getting all jobs before 7",
            "Chapter 5",
            "Not really, when its necessary the game will give you an image with description and I even found the tone a bit mismatched between gaiden end and in this.",
            "Super late and you've probably found it by know, but the Chef's Cutlery attack is the best at getting the job done.",
            "Kiryu's DoD has a bladed attack that can inflict bleed",
            "IIRC one of the merchant in the top left of the Ijincho map has a material conversion service. Green mixer icon on map. Requires 10 to convert to the next tier. There should be one in Hawaii too but I don’t remember where that is.\n\nBut dungeons should still be best.\n\nEDIT: Top right, had a brainfart.",
            "You have to >!give gifts to the receptionist After the 3rd gift, it will trigger.!<",
            "There are some like \"gives you the ability to crit with magic\" that \"add\" something, but mostly they just increase things.  I would add, though, that even if the weapon doesn't have charm the brand would still increase chance to charm from abilities",
            "Same issue, eventually found it by going out back and to the roof",
            "I kinda hope so.",
            "He never gives a selection of things to buy. You buy the bat, then he'll offer a different item, which you must buy to get the next item, etc.\n\nPoor design.",
            "Nope.",
            "I do think Infinite Wealth is the friends we made along the way. The theme of the game for both main characters was the importance of building bonds and forming relationships and the lyrics of the song at the end felt very 'geared' towards companionship meaning you're never without.",
            "Premium Adventure only with some restrictions: >!Ichiban has to be the leader on the Hawaii team and Kiryu has to be the leader on the Japan team, the other leader will act as a normal party member, and you can mix and match people on both teams together.!<",
            "Lmao same. It left me with the same infuriating feeling Yakuza 6 in vaccun did. I'm just gonna head canon gaiden as my canon ending.",
            "Also Palekana Dance is such a banger",
            "Wouldn't mind a Seonhee Gaiden ngl.",
            "Since the Japanese title has no \"Infinite Wealth\" sub-title, I guess Sega of America put it as sub-title to match the English translation of the Japanese song title played when Ichi is piggybacking Eiji.",
            "That’s been an issue with the series since forever unfortunately",
            "There's a *far* larger percentage of Japanese people that understand English than there are non-Japanese people that understand Japanese.",
            "That would be cool if they were just the same podcast in different languages, but they aren't, they have completely different content in them. So you are missing something if you don't understand japanese, the Japanese podcast makes references to Shinada.",
            "Glad it's not just me. I'm currently verifying all my files to make sure I didn't miss anything, but it's a tad bit jarring and hopefully gets fixed. Very much enjoying this one so far outside of that",
            "I visited Ichiban Confections, it said he doesn't work there anymore. Dude definitely got a payout.",
            "No, Eri was real. Ichiban quit being president & Eri took his place & is now traveling abroad to bring Ichiban Holdings into an international market.\n\nYou can easily just stop by Ichiban Confections in Chapter 1 & get this info from Eri’s grandmother.",
            "The ONLY possible reason is they KNOW Adachi is DROPPED the moment Joon Gi arrives",
            "i was going off trading cards for the party characters because all the returning faces and new ones were there so i was shocked when>! Yamai never showed us as playable at all, even when he just walked off and left the hospital, he wasn't even mentioned after lol!<",
            "Yeah, they did that for the Chinese stuff, but there’s an instance where English dub adds English where it wasn’t there in place of Chinese dialogue, being the “MY LIFE FOR HIS WORD!” and the Chinese dub adds broken English in another part where it originally wasn’t there.",
            "I still think about and laugh every day at the early scene in the graveyard in 7 after he just met Ichi and Ichi responds grimly, \"I did\" when Adachi asked who committed the murder. Then Adachi just goes \"LOL, get real\" lololol",
            "I didn't even really find 7's bad, 8 is just so much improved",
            ">!I definitely feel like Ichi got flanderized a bit. He felt pretty realistically kindhearted and forgiving in the first game, but those traits were derived from his strong sense of loyalty: It's why he forgave Nanba: because Nanba saved his life and Ichi saw him as a friend the whole time they were together. I really feel like Ichiban's undying loyalty is something you have to earn. Ichi forgiving Tomi felt natural; Ichi forgiving Chitose over and over again felt forced, especially because Chitose didn't really work as hard to deserve it.!<",
            ">!going back to 7 made me really missed my street surfer and music player...and also smack down!<",
            "Hmm, I think Ichi is way smarter in 8. >!He basically predicts everything and is right on the money with what the bad guys are doing. Eiji is the only exception. \n\nHe knows sawashiro is on their side, he knows when something is off and won too easily, he played a gambit with the video, he knows what needs to be done in every situation. His alliance with Yamai, even if primarily passion-driven, also contained pragmatism that he was fully aware of. He was the only person in the party who KNEW that they NEEDED Yamais help to have any chance of saving akane. And he was right!<\n\n7 also has some genius reads and moves, but I felt the strategic astuteness was more evident in 8 (while still not detracting at all from the primary drive of genuinely wanting the best for others). \n\nIchi is a savant",
            "Imo this isnt necessary at all. We all know, or at least can imagine what is happening after. I think this is a winderful thought to be left with. His last words are just perfect for this kind of ending.",
            "But what about BEFORE Ichiban gets to Revolve? What about TSA?",
            "Yup, bad for japanase players as well lol.",
            "I was super impressed by the stair climbing animation. If you are walking, they actually hit each step.",
            "Sadly it doesn’t seem to be working. It’s telling me now that the game unlocks in 2 hours which is midnight where i am in Australia. Im guessing it might be a region based unlock?\n\nEdit: it works I’m dumb, it forgot that you have to change the system location and not the time itself.",
            "That may be your opinion. I noticed the difference regarding the slow start, but \"super boring\"? Not for me.",
            "Yeah, I know the studio enjoys going deep when it comes to character development, but this is ridiculous on so many levels.\n\nI stayed away from reviews because of the fear of spoilers, but I am curious to read them after I finish the game, because if they don't talk about the problems in the opening then their opinions won't mean much to me, even if the game becomes fantastic later on.",
            "I assume because Honolulu is so massive and this game is pretty long, they felt it was probably best to streamline the shopping process since you gotta have so many items in this game.",
            "That the one where you spin around with the mop and flatten everyone? Yeah, that one is too",
            "Seriously, bubble bale chewed through so many of the enemies during the finale fights. Every time there were like 10 enemies I'd get a single bubble bale off and there'd be maybe one or two guys left standing for the rest of the party to pick off lol",
            "Yup I relied on it so much for the last 2 whole chapters (and should have before then). It's just so strong for being only 20MP\n\nIn thinking about balance, I can see the point that it's one of the very few abilities that is only about dealing damage and doesn't have any other sort of utility. To where the successful action prompt results expressly in significantly more damage\n\nIt's just that, its damage is more useful than the other utility in so many situations where bursting down mobs is #1 priority. \n\n(Or, it could all just be bc I'm bad and don't know how to use the other moves)",
            "I was just as shocked as the first time Majima used the \"you are so pathetic\" stabbing heat move in Y0. So fucking brutal.",
            "Combat and the cutscenes have had a lot of >! Mutilation !<",
            "Pigeon Swarm, and later the Rose Essence ability for Host has been an absolute madman destruction for everything in the game. Nanba was my strongest fighter for a while, now Tomizawa and Zhao are my tops. Tomizawa's got some insane AOE damage versatility, and Zhao's got some insane ramp damage with his one kick move that increases his attack power every time he does it.",
            "Thanks for this tip. Was wondering why Ichiban was saying hello in English.",
            "flipflops and capri jeans lmao, I fear for his toes",
            "New game plus, true final millennium tower, and job ranks past level 30 are dlc in japan for 7",
            "Not exactly a spoiler, but a warning: It seems like the level 5 drink links may or may not include a battle, and the enemies are fixed at lv32. So don't be like me and did it at lv26, thinking I was so overleveled at chapter 5.",
            ">!About Bryce when one of the normal Palekana members said that an old orphan got plastic surgery and now had a new identity, I was expecting the twist to be that Bryce is actually multiple people sharing the same immortal identity. But then again, that’s literally our Joongi’s Drink Link story from the last game—he said he would raise a new successor to pass the Joongi Han identity to once he got old.!<",
            "Even Gondowara has a 6 pack lol, every character in this franchise is ripped.",
            "I always saw the tattoos as like a symbolism to their conviction which equates to their power level, and like the nicer done the tattoo/more complete it is the higher your power level in Yakuza game logic. \n\nSo maybe Ebina separated the tattoo being associated with the Yakuza part and used the general Yakuza game tattoo logic instead lol",
            "Ty, not reading any comments other than replies to avoid spoilersuif possible",
            "Absolutely agree, although I must say I absolutely LOVED Lost Judgment.\n\nHence my disappointment with Buraisu Fairuchairudo and his merry band of cultists.",
            ">!That's certainly a possibility. If I wanted to be somewhat more charitable I might think they just massively overthought the whole thing, but either way it was absolutely infuriating!<",
            "Oh, I felt burnt out. But I really liked the characters. More than I expected. It was so worth it because the events in this current game were so emotionally impactful that I was so glad I put myself through that.\n\nI also recently finished cramming all of the ER. All 15 seasons.\n\nNow I have watched every medical drama ever.",
            "I'd rather have more scenes with eiji having redeeming qualities than have that garbage hamazaki  stabbing scene happen ever again. That was one of the most infuriating things I've ever experienced in media",
            ">Yakuza 3 ending with Ichiban Trusting Eiji, but like Hamazaki in 3 with Kiryu, Eiji stabs Ichiban.\n\nThat's because Ichiban has a miraculous power of connection that Kiryu lacks.\n\nI'm serious: 7 was a direct callback and foil to 0 and K1 in so many ways. One of these was: both went to jail in place of their best friend.\n\nBut the DIFFERENCE was: in the very end, Kiryu was never able to reach Nishiki. In the end, Nishiki chose death, because he didn't believe he could be redeemed.\n\nBUT Ichiban DID reach Masato. Masato ultimately listened, accepted that Ichi was being genuine, and decided to start life over. The fact that Masato was killed afterward is completely irrelevant, because it was about Masato's CHOICE, regardless of the outcome.\n\nThere were many ways that directly put Ichi and Kiryu's storylines side-by-side (0 and 7 both opening with them doing collections is another example that tells you right off the bat some of Ichi's core differences from Kiryu) and used those to directly distinguish the two.",
            "I mean he fought tigers in 2",
            "Let me confirm that it is a thing, with rewards for visiting and stuff. Clearly if RGG wants to do a less kid-friendly Animal Crossing game, they could. There's so much content in this substory game than you could imagine.",
            "Ah that’s true! Thank you for the reminder of those substories - I did those earlier in the game and I think I got lost in the sauce of repetitive piano by the end lol.\n\n*sigh* Maaaaaan that sucks to hear. After the Alo Happy one, I didn’t follow through with anyone else’s gift giving thing because I had a feeling it’d play out the same. I love RGG but they really need a crash course on romance options in a video game and making them both appropriate and worthwhile.",
            "Hold on, why didn't they just say the vocational school is canon and then say that Ichiban speaks perfect English and just auto translates what he says and hears into Japanese cus it's easier for him.",
            "Foot shake. Optional wrist stretch. Shoulder massage. Ready to be pummeled!",
            "yeah i vaguely remember it from those games but it was a little more rare in those games. nearly every fight in 8 uses that animation at some point",
            "Ichiban has zero growth or change during this game, and he's supposed to be the new main character.\n\nEnding of Yakuza 7: no matter how low your rock bottom may seem, you can always look up and work towards the light. Keep living.\n\nEnding of Yakuza 8: The same fucking thing.\n\nKiryu did not need to be a playable character; he should have stayed a party member with a unique combat gimmick. The game only suffers once the party is split. Kiryu's non-committal nostalgia tour was so lame after the third identical scenario. I can't believe that's the most depth we got with Haruka for the entire game.",
            "1) Kasuga says that, but I'm not entirely sold that's 100% how he feels. Those kind of feelings are complicated. At any rate, we don't know since they never meet following this revelation and it's only ever brought up once (that I recall).\n\n2) If so, it's a completely irrelevant plot-twist. Why include that detail if it doesn't matter and it's never going to go anywhere? He could have easily had a background that gave him grudge against Kiryu >!(which would have given the fight at the end a bit more weight)!<. It feels like they wanted it to go somewhere and then changed their mind later.",
            "Let's get...Alo-Rapey!",
            "the entire game is kiryu celebration in effect, even more if you take the time to do all of his nostalga stuff.   they should have just ended his story with him spending the rest of his time with Haruka , going into into the sunset to finally be reunited.\n\nbut nope, they have to drag it out again? at some point people just wont care any more and that sux.",
            "i wouldn't mind >!him being in LaD9 in a supporting role, perhaps giving ichi some combat training or advice. but now that he's older, a cancer survivor (presumably) and the yakuza are long gone, he shouldn't be front-and-center in a game again!<",
            "That is disappointing to hear",
            "idk Nanba's betrayal was well justified and he never did irredeemable things to Kasuga and the people he knows he was just being an asshole for a bit >!Chitose however is on a whole different level of asshole she actually got innocents killed, defamed and countless people lost their livelihoods or maybe even lives just because of her choices.!<",
            "awesome, trying it now thanks!",
            "Its gotten tougher since I arived on Hawaii.",
            "Except Gaiden",
            ">!FUCK YEAH thank you youre a lifesaver!<",
            "Even though pyrodancer stats say max atk but not magic? Or does it matter",
            "Oh, thats fine. Thank you!",
            "I wanted to give it a fair chance because he did a great job as Pucci, but I just couldn't do it. Dude is like half Kiryu's age and sounds nothing like he should",
            "That's actually where I was hanging out. I ran around for a while, then just stood (until some wondering mobs attacked), then I went to the lifeguard hut and left it alone. More than an hour, no rain. \n\nGuess just is a bit of RNG and all. I'll be trying for it again here later.",
            "I had stuff to do in the morning and then working 9-7 or so, maybe a bit later, so I haven't even run the game once yet! 😭",
            ">!Is she the only one who needs gifts to trigger a substory? !<",
            "That theme might have landed better if there was some contrast between a character seeking monetary wealth while Ichi and Kiryu found more value from their friends.  Instead the villains were mostly motivated by consolidating power or taking revenge.",
            "I mean there is a good reason once u hit Hawaii. But maybe he was a MrBeast and gave most of his earnings away?",
            "Which is silly considering his life's purpose is to give former Yakuza a place to go after the dissolution. Would probably be a lot easier if he was the President of a massively successful company and could just hire them himself rather than try to find them jobs through Hello Work, or at least use some of that money to set up a charitable foundation. Makes no sense that he would give it all away.",
            "Nah, he'd be like \"welp, looks like I've done all that's needed and now you're super successful. Later!\" And then just leave, leaving the place to Eri and her g'ma",
            "... Just play along next time  :/",
            "Bitch they made me play a ~80 hour game. The least they could do, if they're not yet closing Kiryu's story, is give us an emotional closure. Gaiden is an eighth of that and it still managed to hit emotional beats.\n\nThey spent the final song on Eiji who I could honestly not give a rats ass about, but we can't get Kiryu reuniting with his daughter and grandkid?! Mind boggling AF.",
            "But I dont wanna imagine, I wanna see it and cry!",
            "Rubber Security and Customs.",
            "Yeah Japan is VERY strict on foreign meat and plants coming in the country (I'm assuming the other way also). I know you can't even leave with like sea shells lol, so right away I was like \"this is ridiculous\". But Nancy is ridiculous, so whatever.",
            "Thx kyodai works for me too!",
            "Uh... really. I haven't seen any yet.",
            "Running through a >!dilapidated underground structure!< in sandals what could possibly go wrong?\n\nTetanus is a bitch and a half",
            "Tomizawa’s final drink link fight beat the shit outta me lol",
            "Oh shit. Good looking out",
            ">!Not to mention this clearly causes issues with the Daidoji. They really need to address them in the next game, because clearly there is no happiness so long as they are around!<.",
            "Not as absurd as a giant squid or shark. I don’t even think fights like that or the heavy machinery would work well in a beat em up game.",
            "As someone who played the mainline games, the nostalgia tour was kinda fun, but I get how it can feel lame the nth time Kiryu does the \"I can't reveal myself, I'm supposed to be dead\" schtick. Which is why Akiyama's reunion is my favorite lol.",
            "Well, >!Chitose at least tries to make it right. As for Eiji, I literally have no idea what's going on with that guy.!<",
            "Lol dude correcting you on a *blatantly obvious* joke poking fun at Ichi's wild imagination",
            ">!I think the daidoji agreement just fell through when the Tatara Channel exposed Kiryu is still alive and then he appeared in live television. Like, the deal is that he would work for them and not expose their crimes for as long as they fake his death, and that he couldn't break the agreement by exposing himself on purpose. They failed to keep their part on ensuring the cover-up, so the deal broke on their end, not his!<",
            "Agreed. The ones that added a needed resolution (the Yakuza 6 crew) or had a direct interaction with Kiryu (Komaki) were great. But the whole \"I can't reveal myself\" schtick with characters like Sayama absolutely fell flat. \n\nAkiyama's was the best. \"Why didn't you guys call me during Yakuza 7? 🥺 \""
        ]
    },
    "Like a Dragon: Yakuza Live-action Series Announced for Amazon Prime Video This Fall": {
        "title": "Like a Dragon: Yakuza Live-action Series Announced for Amazon Prime Video This Fall",
        "score": 3129,
        "url": "https://www.ign.com/articles/like-a-dragon-yakuza-live-action-series-announced-for-amazon-prime-video-this-fall",
        "content": "",
        "num_comments": 474,
        "comments": [
            "If you are new to the subreddit, [please read the wiki](https://www.reddit.com/r/yakuzagames/wiki/index/)\n\nReminder that all spoilers need to be tagged with a flair specifying which game is being spoiled. If you want a flair that says something else, you can edit it to say something like [Discussion: Y1 spoiler] or [Majimapost: Y6 spoiler], etc. **THIS INCLUDES CONTENT FROM TRAILERS**.\n\nIf the post is not marked for spoilers, all comments that have spoilers need to be tagged \\>!like this!< along with indicating which game it's spoiling. Example: Y3 >!Kiryu sings!< \n\nIf the post flair is marked for spoilers, the comments don't need to be tagged for the game indicated and the ones before it (So a Y6 spoiler post can have comments with untagged spoilers for Y5, but not gaiden or 7). \n\nIf you see any of the above (or any of the other rules) not being followed, please report it so we can keep this place safe for newcomers and those that haven't finished all the games yet. Thank you!\n       \n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/yakuzagames) if you have any questions or concerns.*",
            "This is pretty unexpected. \n\n> The live-action crime-suspense series is based on an original screenplay loosely inspired by the first game in the series, 2005’s Yakuza. It will be set mainly in the Kamurocho entertainment district, straight from the games, and follows Kiryu and three of his childhood friends in two time periods, 1995 and 2005. \n\nSo another attempt at the first game's story. Loosely inspired means there are gonna be changes for sure. Let's hope it turns out well.",
            "I'm interested\n\nbut do they have what it takes to top THIS\n\nhttps://i.redd.it/rt588vv64h4d1.gif",
            "![gif](giphy|oYtVHSxngR3lC)",
            "That's fucking crazy\n\nHow did we go from 12 years ago, SEGA pulling the plug on localizing the franchise ever again, to today where we got a Prime TV series? Wtffff",
            "I just saw the ad on IG and thought it was fake. I’m keeping my expectations very low until we know who’s involved.",
            "Please dont be shit",
            "Hope it's good\n\nThey said it's an adaptation of Yakuza Kiwami, don't know if they said Kiwami as a stand in for 1 or if they'll have things like Majima Everywhere",
            "Ok RGG, you got another shot at turning Yumi into more than just Haruka's Mom/Kiryu's first love, you can do it!!!!",
            "https://preview.redd.it/45vj0y5z1h4d1.jpeg?width=1179&format=pjpg&auto=webp&s=d5d4b03498bfe344b44283f8d888c3c7a1564a67",
            "RGG EXCUSE ME YOU'RE JUST GONNA DROP A BOMB LIKE THAT\n\n![gif](giphy|BBNYBoYa5VwtO|downsized)",
            "##**THAT’S RAD!**",
            "It's going to be weird hearing someone other than Takaya Kuroda play him in Japanese.",
            "\"20 years in the gaming industry made you a fucking TV show\"",
            "> Of Kiryu’s place in the story, Take said, “In 1995, the protagonist is still young and he makes a lot of mistakes, and these lead to him spending a decade in prison and the consequences he faces when he gets out in 2005.\n\nInteresting quote, I wouldn't say Kiryu in the games really made any big \"mistakes\" in 1995. He couldn't have known in the long-run what taking the fall for Nishiki's crime would've led to, he was just being an above-and-beyond friend. So perhaps this adapation will have a more thuggish/naive Kiryu compared to the games.",
            "wtf this isn't april first",
            "![gif](giphy|yXcAx6DCIIugPSgax6|downsized)",
            "CAN YOU IMAGINE IF THEY KEEP THE “DUN-DUN” IN WHEN INTORODUCING CHARACTERS? ONG IM GONNA BUSTTTTT",
            "https://preview.redd.it/d13lhhy81h4d1.jpeg?width=111&format=pjpg&auto=webp&s=83d399ea99cb27b9018d29abdbc2bae0738cf635\n\nI will be there‼️",
            "![gif](giphy|LE7HSWdlpWtBiLDSFu)",
            "If Nishiki doesn’t say it, the show is automatically a 1/10.",
            "Day one watch (even if it's not that good)",
            "This show needs an extended sequence on Pocket Circuit. Otherwise, just don’t even bother.",
            ">Meet the new Kazuka Kiryu\n\nhttps://preview.redd.it/sxd9vjum8h4d1.png?width=2048&format=pjpg&auto=webp&s=3b472d388a27f6c604d87b2596cab8289f36a422",
            "![gif](giphy|v3p3CtSrNYNLa)",
            "man, there’s a lot of typos in that IGN article. “Kazuka” Kiryu, the “empty slot”",
            "Please be like the last of us and not halo....",
            "Part of LAD's charm has been being unapologetically Japanese, the silliness contrasted with the melodrama. I wonder how the series will convey that.",
            "All I'm asking is that the show doesn't take itself too seriously. The games aren't what they are without the silliness to balance them.",
            "We did it.\n\nhttps://i.redd.it/44nzgt3heh4d1.gif",
            "I actually don’t mind some changes made to the story of Yakuza 1 for the purposes of a TV series, I think everyone forgets while the game is great it’s also very stop-start with its various storylines, with parts of the story dragging Kiryu into various situations for the purposes of game mechanic tutorials",
            "https://preview.redd.it/k14ij9fb4h4d1.jpeg?width=600&format=pjpg&auto=webp&s=d76fbaff8d73df4e3fbda596db1b53c4542d62c9",
            "Blown away-- man this is a good year to be a Like A Dragon fan",
            "This came out of nowhere, especially considering it's already been filmed if it's gonna be out as early as the fall\n\nWTH",
            "It would be pretty funny if this follows the Fallout adaptation rule of \"this is canon btw\" and it retroactively fucks over Yakuza 1\n\nI say this as a fallout fan",
            "https://preview.redd.it/93rmqnz75h4d1.jpeg?width=736&format=pjpg&auto=webp&s=10319f0255622290693a479295125dc9c01dbe57\n\nGot a massive fortnite win tonight and now I see this",
            "I’m in shock like no leaks aside from the fact sega they want yakuza to be adapted. It’s also telling a story about kiryu by the looks of it but I I’m curious where in the games this takes place or if it’s before. Amazon with another videogame adaptation out of nowhere.",
            "Ah fuck now i have to worry and wonder for months on end if this is gonna be good or not, shit.\n\nAmazon kinda gives me hope though. Fallout was good. And if we're talking adaptations as a whole, The Boys and Invincible are great as well. So I have a bit of faith.",
            "GET SOMMMMMME!!!!!\n\nDear god I hope this turns out better than the Shardlake adaptation. Only 4 episodes and I can't get past the 2nd. So easy for something so great to turn out so poorly, but I am ever hopeful.",
            "Hopefully it doesn't turn out to be ass since the setting is more grounded in reality.",
            "https://preview.redd.it/n90l99k3ch4d1.jpeg?width=296&format=pjpg&auto=webp&s=0c776fc8585fbb43e3f39586cd76d3561b943507",
            "Will they actually give Yumi a real personality this time. I hope so",
            "i always wanted a series, but i wanted it to be animated and not live action\n\ndarn\n\n&#x200B;\n\nwell its something at least",
            "😱😱😱",
            "I am so excited for this!",
            "![gif](giphy|pv92vgg1AgRPkMADQm|downsized)\n\nHoly shit, that was unexpected!",
            "yoooooooo! That's rad.\n\nI tend to avoid Amazon, but I'll go for a month of Prime just to binge this.",
            "![gif](giphy|LpdlqTkgO2Lwwixwv7|downsized)",
            "the dragon tattoo in the background is different, its holding an onnaman Noh theater mask in its mouth. anybody have any speculation?",
            "Majima will be played by Chris Pratt",
            "Yeah, I know what I’m gonna do this October, Kyodais.",
            "Hope it's a good one but I'm not holding my breath",
            "Hopefully, it's one of the better video game live action adaptations and not one of the worst.🤞🏾",
            "It's funny how even the contemporary section of the story is a period piece nowadays. The modern day setting of the first game takes place nearly 20 years ago.",
            "For those wondering, this series is being produced in Japanese. \n\nSo no Netflix Death Note here…",
            "hoping for success similar to fallout",
            "This is cool but man I can’t help but feel it’s gonna be like 90% different",
            "I had to triple check the account was real when I saw it. I was like “WHAT?!”",
            "This sure came outta nowhere.",
            "I’m scared but also a little hopeful. Amazon have been killing it lately, they will probably adapt kiwami 1",
            "PLEASE BE GOOD",
            "What........the...........fuck!?",
            "Karaoke scenes with Kiryu and Haruka would make it an automatic 10",
            "I am honestly amazed they managed to keep this under wraps for god knows how long and just casually drops an announcement on Xitter xD;",
            "I knew this has been in production for a while, so it’s nice to see a concrete release date finally.\n\nExcited to see my boy Kamen Rider Drive as Kiryu.",
            "I can't believe mahboi Shin-niisan is going to be Kiryu",
            "Looking forward to Club Sunshine",
            "…huh.\n\nNot at all familiar with the director, so I’m just going to hope we’re in good hands. I actually love Miike’s adaptation so I do think this series can work well on film. Cautiously optimistic!",
            "I wonder what a high budget film would be",
            "Anyone knows how many episodes it will get?",
            "Please include this guy.\n\nhttps://preview.redd.it/s80bwkvufh4d1.jpeg?width=720&format=pjpg&auto=webp&s=0f8503c6eb2c31b284b86a64a89ef1ee9b08a2be",
            "they better have some special effects when they fight. if they had it in the 2007 ver., they better have it here.",
            "https://i.redd.it/fvonzjtqgh4d1.gif",
            "https://preview.redd.it/hd768y6zgh4d1.jpeg?width=224&format=pjpg&auto=webp&s=f39c62083e2cca3e4d6b5f97d2ea87118619a405",
            "It sad to see Shinnosuke’s life went down hill after the divorce and Kiriko took the kids.\n\nAlso HOLY SHIT HE’S FUCKING TALL",
            "I definitely wasn't expecting this. Hopefully it's good.",
            "wow theyve started to crack the code i think",
            "I need them to announce that Kuroda will be cameoing so badly",
            "I hope its as absurd as the movie",
            "So glad all the speculation and rumors a couple of years back was true. Ryoma Takeuchi trained hard for his Kiryu physique.",
            "This just came out of nowhere! I will watch it!",
            "I wonder if substories are gonna show up as filler episodes",
            "I will be there no matter what",
            "This coming out of nowhere is hilarious lol",
            "New story? Or retelling of games?",
            "I hope whole plot gonna be substories and Majima everywhere",
            "The cross over of judgement and yakuza actors is at Japanese drama “Believe “.A glimpse of the cast doesn’t seems suitable for Kiryu,perhaps a younger version.We shall see.",
            "It being based loosely on Yakuza 1/Kiwami means there will be a new version of For Who's Sake 👀",
            "Knowing how good the latest Amazon series were, I have good expectations. But the hard part would be to translate the Japanese culture and storytelling to Western audiences (not including people who have played the games. I think we are all well accustomed to them)",
            "the person who plays Kazuma used to play as a ploice officer in kamen rider drive",
            "Whenever Majima's not on the screen, all the other characters should be asking \"Where's Majima?\"",
            "I thought the show was titled the same way the movie was in Persona 5 lol",
            "Shitara Osamu should do a cameo as Majima\n\nhttps://preview.redd.it/dco4ug3q1i4d1.png?width=628&format=png&auto=webp&s=6e1719c06c7b6aeb8c91dd56b012a82ff070b993",
            "that's rad",
            "that's rad",
            "If Ryoma Takeuchi (Kamen Rider Drive) is gonna be Kiryu, we need Gaku Sano (Kamen Rider Gaim) to reprise his role as Nishiki from the Stage Play.\n\nALL THE TOKU ACTORS IN THIS SERIES!",
            "I worry.",
            "This is the exact thing RGG needed to advertise their games. The in-game stuff they usually market with tend to be rather spoilery (or EXTREMELY spoilery - look at IW's trailers for example). The tweets they've recently put out don't help with the marketing either. \n\nThat's why live-action is incredibly good to bring new eyes to the series and possibly grew it larger than it ever was before. Even if they're telling the stories of the games (which, truth be told, are already written in a way where they'd fit a live-action season) they're not ruining the games as much as the usual RGG trailers do.\n\nIf this does well, there's a good chance of them adapting other games as well and with decent spacing people have enough time time to finish the next game before the series is out.",
            "https://preview.redd.it/4monfktklk4d1.png?width=384&format=pjpg&auto=webp&s=c64e635972eb9ec33cdb50dafeb20ddee43752f3",
            "https://i.redd.it/iwucdj295l4d1.gif\n\nAny Kamen Rider Drive fans here?",
            "Motherfucker, its another live-action? Dammit! The Yakuza games are too Extra to do live...",
            "I’m pretty confident in this show with how good The Boys and Fallout were.",
            "of course the first episode will be Kiryu playing UFO Catcher for one hour straight",
            "https://preview.redd.it/r6tnrkao2h4d1.jpeg?width=194&format=pjpg&auto=webp&s=c6e69499d2c5b345102a975bb6a00006dd9580ff",
            "Shouldn't they start with Y0? I mean I get that Y1 is what started it all but there's already a prequel to that.",
            "Who were they thinking about when they cast this guy? Ayabe?",
            "Remember when they spent billions for Ring of Power and it sucks ball? Yeah I don’t expect much from this",
            "[deleted]",
            "Holy macaroni",
            "😱",
            "I am in there",
            "Did not expect that.",
            "So I'm a bit confused. This is referring to [this](https://www.reddit.com/r/yakuzagames/s/wSxcQ1ojkH) show that started filming last year right? So this article is just confirming that Amazon Prime will be picking it up for streaming in the fall?",
            "I'm scared and excited at the same time. But god damn, I hope this and Infinite Wealth are the breakthrough the series needs",
            "Did not expect a live action Yakuza for a long time. Cannot wait to see how they portray Majima in this one.",
            "Kamen rider drive!",
            "WHO WILL BE PLAYING HARUKA YOU FOOLS",
            "I’m going to cream oh my lord. PLEASE NOT BE SHIT",
            "We're having a great year for videogame adaptations. First Fallout, then Arcane announced for November, and now Yakuza. Simply glorious.",
            "I’m… going in with very low expectations. However, that the director of The Naked Director series is helming the project is a definite plus.",
            "I'm sensing greatness",
            "HOLY FUCKING SHIT\n\nhttps://preview.redd.it/mh1l9dqdvh4d1.png?width=1080&format=pjpg&auto=webp&s=e562bf3a46791600f57a518f49144838f27b9f76",
            "Nani?!",
            "Hell yeah",
            "If only kuroda was Kiryu in live action too.",
            "This is a such a pleasant surprise and they are filming already!!!  This and the cyberpunk 2077 show what a time we are in",
            "Original story supposedly. Probably inspired by Kiwami 1 tho. They cooked with fallout so I have faith",
            "I like this game",
            "I like this game",
            "*Processing img 9i2bzuj44i4d1...*",
            "*Processing img 9i2bzuj44i4d1...*",
            "*Processing img o7eav2u64i4d1...*",
            "*Processing img o7eav2u64i4d1...*",
            "So excited for this!",
            "I hope they lean into the over the top video-gamey nature of the games, instead of only trying to make it a serious crime drama. Yakuza is both, without the comedy/sillyness it's not Yakuza, just a crime show. \n\nAlso they need to have really good fight choreography, it's key for a Yakuza series imo.",
            "The unfinished tattoo in the promo art really makes me think we'll be getting at least some scenes between Y0 and Y1, since it's lineart only in Y0 and fully finished by Y1",
            "If half of NJPW aren't in this somewhere, I will fight my shoelaces",
            "it's going to be a VeRy crime related drama",
            "They need to also include some of the goofy substories",
            "Talk about a surprise!",
            "HOLY SHIT ITS DRIVE!!!!",
            "I would love to see Kuze or Takeshi Kitano in the show (Takeshi Kitano was the original guy from Takeshi's castle!!)",
            "OMG!!!!!!!!!!!!!!!!!!!!!!!",
            "I always figured this series would make a great TV show. I mean, you got 9 seasons right there! 10 if you want to throw in Gaiden!",
            "Needs karaoke",
            "Why do yall always want a live action anything?! Just play the games again",
            "Guy looks too teenage boy band to be Kiryu.",
            "The plot will be... 100 sidequest where they try to scam Kiryu.",
            "I had to double check this was real when I got sent this over discord, I thought someone was fucking with me with a well make fake image. I'm both excited and a bit worried, but seeing who's involved and what platform its in, I'm a bit less cautious. At first glance, I thought it was going to start at Yakuza 0, due to Kiryu's hair and unfinished tattoo, but reading the description makes me think its partially based off Kiwami.\n\nThey better include the \"DUN DUN\" for the character introductions, Kiryu playing PCR, and at least 4 Majima everywhere encounters. I'm getting the bingo card ready.",
            "Has this been rumored or anything? I hadn’t heard a peep about it before seeing this.",
            "I pray they handle the tone exactly like the games do: Completely down-to-earth during the dramatic scenes, absolute chaos once the fighting starts. \n\nPlease do it right.",
            "Amazon Prime is cooking blood this year.\n\n I hope it lives up to the IP, has Fallout is being on Amazon prime. \n\nhttps://preview.redd.it/9i6vlzwuik4d1.png?width=480&format=png&auto=webp&s=3bd2c185a48ff089556307cd9f4811f6e5ef4269",
            "I picked an unbelievable time to join this fandom. Hell yeah!",
            "Let’s go! My dog is named Kiryu, and my cat is named Majima, we will be watching this together",
            "starring Kamen Rider Drive no less. r/KamenRider doesn't allow sharing of non-rider related news (though actor projects ARE rider related news, they've just banned any posts about the subject, which is fucking stupid) but this is massive for a Rider actor to get. Kamen Rider community could be having a lot of discussion about this. But nope.",
            "For any Yakuza game to be transitioned into a film setting, there are changes that are gonna have to be made. However, Prime Video has done an awesome job making creative decisions to keep fans of the original material interested while also being able to bring in new viewers. (i.e. The Boys) Personally I'm stoked and I can't wait to see what they do with it.",
            "We will be there",
            "Would you guys have a problem if they race or gender swapped some of the main characters to make the show more diverse?",
            "Hopefully Amazon doesn't get much influence, wheel of time makes me worry for everything Amazon makes.",
            "So excited for this dudd",
            "Are they going to lean into the comedy and we get something like Fallout, which had serious stuff and silly humour or do we go completely character driven deconstruction like Sopranos?",
            "I've never even player Yakuza but there better be a rc car racing mini lore segment in this movie",
            "HELL YEAH BABY",
            "I'm not enthusiastic. I feel like it's going to be all dark and gritty with none of the levity of the games, or the unrealistic fight sequences.",
            "... I'm just waiting to see if Marina Shiraishi will show up.\n\n![gif](giphy|hVTouq08miyVo1a21m|downsized)",
            "Yet another dogshit live action.",
            "I'm not anything close to a gamer but I loved the first few Yakuza games and honestly, it helped that the lead character was so hot. They have to do his character justice in every way, please Amazon.",
            "Cant wait to see them replace the Asian men! /s",
            "I think people are not asking the real question.\nHow many AV actresses will be on it?",
            "After Fallout, I’m fine with Amazon handling this series.",
            "This is gonna be a real challenge to nail this. Yakuza is just so incredibly unique in the way it mixes tense and emotional moments with just downright ridiculous campy comedy.\n\nBut seeing as it’s “loosely inspired” by the first game, maybe this might be good. I’ve been pleasantly surprised with live action adaptations like Fallout and One Piece recently.",
            "Amazon I swear to god please",
            "I've noticed that the eyes are not completed like Rikiya's Tattoo, does that mean something?",
            "well darn i just got into the yakuza series with like a dragon, and loving it, but i won't get to watch this since i don't have amazon prime.",
            "It’s going to be awhile until I get a live action Seonhee (to admire)?",
            "https://preview.redd.it/1g5tlnr1fs4d1.jpeg?width=188&format=pjpg&auto=webp&s=3ed5d3ccc83f19fafd47ddba7334dff10f6260df",
            "I have questions:\nDo you think it'll have more seasons, like for the whole kiryu saga?\nWill Yong Yea POSSIBLY be the English dub of kiryu in this show?\nWhat will be the intro music?\nWill it succeed?",
            "Nuts how it was just announced and it's dropping in the fall. But I wish more shows and games did that instead of waiting for years. Also interested to know why they chose to adapt Like A Dragon.and why they reversed the title to Like A Dragon: Yakuza.",
            "I wanna watch this but i want to play the games first, sadge",
            "I decided to not have hopes. Will watch it for what it is. Im so tired of getting dissapointed so this time ill go with no expectations.",
            "Why would i watch this  when there 3 movies lol stupid",
            "I can’t wait to hear 10 years in the joint in live action",
            "Last time this happened we got the movie where, apparently, the only on brand character was majima",
            "I wonder if this does well, To fit in the substories they could do a mini inbetween season if a season 2 is announced.  \nwhere like each episode has like 1-2 substories in it.",
            "I can't wait until Kiyru sings Judgement on the big screen. ",
            "I'm really looking for the episode where he spends 20 hours managing a hostess bar or doing Pocket Circuit races.",
            "I am expecting this to be bad. Considering how awful Castlevania Nocturne and Rings of Power were, and how mixed Fallout seems to be.",
            "This should be interesting",
            "Its probably trash don’t spend money",
            "\n\n*\nOh boy another live action adaptation based on the first game. Also, 3 childhood friends? Who tf is the third one? Kazama?",
            "Well I hope the dub's good",
            "Amazon will probably have Idris Elba playing Kiryu.",
            "Nah I'm good.",
            "I just put about an hour into that game (never played any of the Yakuza games before), and I could see how it could be a good series.  \nBut man, I just couldn't get into the game, it already seems like it's just a movie where you get to control the character for a couple seconds between the 10 minute long cut scenes.",
            "Do we know if this is a Japanese studio or Hollywood production company is doing this? Of it's the latter, I hope it's actually shot in Japanese with Japanese actors and not in english with Asian American Hollywood actors",
            "Ughh... Majima will be running in his cabaret dress for entire show? I wonder how they will turn this series into woke puke.",
            "No thanks",
            "Should be pretty awesome as long as Amazon can resist the urge to do something stupid like mandate that Majima has to be played by a black guy or make Yumi trans...",
            "holly shit. After Fallout that was amazing I have full faith in this project....if the production is 100% japanese. Americans try to do japanese things and fail",
            "There cool and all but can rgg slow down with the yakuza stuff.  I love the franchise but give us something new like a spin off anime game or something left field like rgg baseball",
            "Will definitely be shit",
            "Oh no, make a remake instead",
            "Well it's got to be better than the terrible movie. Plus the guy who they got playing Kiryu in this new series was Kamen Rider Drive, so I'm definitely happy with that casting. I'd say my initial thoughts are cautiously optimistic.",
            "Amazonkuza be like \"we extrapolated that one time Reina tried to hit Kiryu with a bottle to her being able to 1v1 him and win\"",
            "As much as I love Kiriyu, i was hoping it would be Ichibans story 😭 i means its literally the name of Ichibans game so why not make it about him 😭",
            "lol, hopefully Yokoyama isnt working on this",
            "Every Majima everywhere moment needs to be in there",
            "> three of his chilldhood friends\n\nI imagine it's Nishiki, Yumi, and either an original character or Nishiki's sister getting a bigger role.",
            "I mean adapting the same story in a different medium, changes are inevitable.",
            "Didn't they reveal this a while ago? I could've sworn we even knew who the actors for kiryu and nishiki were going to be",
            "People always said that a series would’ve been more appropriate that a movie, so I’m glad they think so as well",
            "The original stage play was pretty good, some of the casting choices were strange(shimano was a little too short) but overall it should have some good legs to stand on",
            "Three of his childhood friends?",
            "Why can't they just go for Yakuza 0? It's a prime material for an adaptation in every way. It's set in an interesting time, has a pretty captivating romance, nuanced characters, longer, more complex and grounded story, also, we have Kiryu almost at his entry point which would work better with audience unfamiliar with how Yakuza works. There's a reason why the west at large fell in love with the series when that game came out.",
            "Hopefully the fight scenes will be action-packed and not so corny/cringe moments.",
            "Hmm, so the time immediately either side of Kiryu's first prison stay, maybe with a little more time spent in the 90s than the game.",
            "i would have prefered 0 for first LA tbh :(",
            "Changes\nOh no not changes\nThey gonna gut nishiki",
            ">Kiryu and three of his childhood friends\n\nI thought it was Kiryu, Nishiki, and Yumi? Are they counting Majima as a childhood friend?",
            "I'm hoping the intention (if it's successful) is for them to tell the complete kiryu saga.. Mabye 6 would be the last season. \n\nWould be amazing if they could get certain actors back, ofc beat takeshi and mabye even Tatsuya Fujiwara to play Rikiya.. he's  42 now so him playing Yuta and dating Haruka may be weird 🤣",
            "Can’t wait",
            "Three of his childhood friends? OCs or are they retconning the Jimas into being Sunflowerians?\n\nEdit. didn't recall Yumi. So who's the third one? Majima? Or Reina?",
            "I need to know this. Please tell me.",
            "Where is this from lol",
            "I have to see all LAD movies to celebrate, how many are they?",
            "Perfect adaptation. Just finished it and while it's different. It gave me the feeling of the first game the whole way through.",
            "Idk how they can top the og live action goro",
            "Why is it so perfect",
            "Nope nothing can top Takashi Miike",
            "I had the Same reaction, Kyodai.\n\nI thought people were just shitposting but it turns out to be real.",
            "Nothing is holy anymore. Sooner or later every gaming franchise is getting raped by TV execs.",
            "We gotta thank the original fans who fought tirelessly to get Yakuza 5 get localized. Otherwise we wouldn't get 0, and be what we are today flaws and all.",
            ">How did we go from 12 years ago to today where we got a Prime TV series?\n\nThey made Yakuza 0, which was finally genuinely good.",
            "It’s impressive how the fans at the time fought hard to get 5 localised. If we never did the series wouldn’t have been as popular. I wished fans of other franchises did the same. It’d show sega they are more than just a house for sonic.",
            "We already do. \"Masaharu Take, best known for the drama series The Naked Director. Made in Japan, the series stars the hugely popular Japanese drama and stage actor Ryoma Takeuchi in the role of Kazuma Kiryu\"",
            "Amazon nailed it with Fallout so I'm optimistic",
            "Fallout did pretty well, hopefully Amazon managed something similar with LAD.",
            "Yeah hoping it's like Fallout and not Wheel of Time/Rings of Power.",
            "The Fallout series was surprisingly good, so that bodes well for this I think",
            "![gif](giphy|HPvfnOuz1tOgg|downsized)\n\nOne who lost all hope.",
            "Hopefully they can still keep the “Dun Dun” when they introduce the characters",
            "They probably mean more than anything Nishiki will actually have a backstory, via both 0 and the expanded scenes in 1.",
            "It probably means that events from 0 will be referenced unlike the actual Y1",
            "Half of the episodes are just Majima Everywhere battles",
            "That's what I hope for giving her a major plotline that hasn't been explored in the mainline games.",
            "https://preview.redd.it/8jg0hnnszi4d1.jpeg?width=1290&format=pjpg&auto=webp&s=2963f7533b7ea1308fc1db8d02d7bd9a7568d30f",
            "https://preview.redd.it/64gseu1ldi4d1.png?width=1280&format=pjpg&auto=webp&s=77261083fc3a3cd5a7892f0ac618f4b0dbf49ea4",
            "I'm sure they'll include him as a cameo of some sort. same with a good chunk of the returning cast too like majima if I had to guess.",
            "Like the Mario movie.\n\nNew actor: \"Eh, what about the Tiger Drops? Is it... is it too much?\"\n\nKuroda: *Playing UFO Catcher* \"Too much? It's-a perfect! Wahoo!\"\n\nNew actor: \"Okay, I'm gonna trust you\"",
            "I guess you haven't seen the movie then.",
            "This may sound goofy as hell, but honestly I wish the voice actors would dub over the live action actors.",
            "Old Kiryu would be perfect!",
            "If its anything like The Last of Us, the actor will make the character his own enough for the role that my brain will be able to keep the two as separate characters entirely. TV Joel & Game Joel\n\nSo will try to do the same here lol",
            "Funnily enough, i would say he makes more mistakes AFTER he got out of prison rather than before lol",
            "I think a synthesis of Zero and Kiwami Kiryu would be the way to go, seeing him younger and a bit more hot-headed",
            "Yeah thats already a good sign the writer understands the character :DDDDDDDS",
            "they should\n\n\"Daisuke Kuze - captain of Tojo Clan\"",
            "If you're 12 years old.",
            "Day one watch (especially if its bad)",
            "Yeah, we need Kiryu going from a brutal fight scene to totally crushing an 8-year-old in a kids racing game. Then to cheer the kid up he buys him a present: a dirty magazine.\n\nI'm guessing this will mostly be the serious stuff and less men in diapers stuff.",
            "I want steve buschemi as goro makima",
            "Or Shintaro Fuma",
            "So you’re saying you DON’T want to see Kiryu’s ass cheeks?",
            "the dude making the series made the Naked Director tv show, which literally OOOZED yakuza campy silly melodramatic energy, highly recommended!",
            "Poorly, will be my guess.",
            "I mean, it's a different situation here. This is based loosely on Yakuza 1, whereas Fallout is set after the events of all current games to date. Sure there's back and forth with the past and that, but I don't think RGG would do that. If they change shit that everyone has referenced for the bulk of this bigger series it wouldn't work, whereas Bethesda have been changing shit since 3.",
            "If this does well then Kiryu might be in Fortnite soon after just like Fallout maybe, perhaps, hopefully.",
            "Loose adaptation of Yakuza 1 from the sound of it.",
            "1st game, split in two periods; 1995 and 2005",
            "Me too, and I love those series as well. Did the last episode of Invisible come out yet?",
            "I wonder if they had to change it due to copyright reasons. They probably dont have permission from the original artist because I don't see the artist's signature on Kiryu's back either. \n\nThat's my speculation. Also speaking from a point of an artist myself. Lol",
            "I have seen couple movies from the director and it's in good hands",
            "[deleted]",
            "Seeing him in photos with kouta's actor is hilarious because he is just so much taller than kouta",
            "Retelling of the first game.",
            "He also needs access to a time machine",
            "Drive Type Dragon! \n\nHISSATSU TIGER DROP!",
            "i was thinking about my lovely partner myself when i saw this announcement :) perhaps they did the same",
            "Conversely Fallout was pretty good and while I haven't played the games, fans say it did right by the series.",
            "I have hope since it is a Japanese team doing this instead of a western studio",
            "Counterpoint: Reacher",
            "counterpoint: fallout",
            "Yup. Prime Video’s Japan twitter [posted it](https://x.com/primevideo_jp/status/1797825609768345666) confirming Ryoma Takeuchi as Kiryu. So it’s definitely the one that’s been in production for a while.",
            "More importantly, WHO'S PLAYING THE FLORIST!?",
            "Amazon's Fallout adaptation got great reviews, so that's a bit relieving.",
            "It was rumored for a bit, but not many people were discussing it. It's official when major gaming outlets are reporting it",
            "I haven't seen it personally but from what I've heard The Naked Director, also a Masaharu Take project, basically has the same feel and handles it well for the most part.\n\nWe might be in good hands.",
            "I'm from that subreddit too. The amount of publicity that it can gain is massive and imagine the amount of Kamen Rider and LAD jokes it can produce.",
            "The cool thing about Prime Video is that if you buy stuff off Amazon anyway it kinda feels like a freebie",
            "Maybe Nishiki's sister, Yuko",
            "Kiryu, Nishiki, and *Yumi*?",
            "https://preview.redd.it/krnv5pnc2h4d1.jpeg?width=1034&format=pjpg&auto=webp&s=2076ee1a428f959d5f6868dd1c0f3c90754442e8",
            "Kiryu, Nishiki and Yumi were from the same orphange IIRC. I think it's them.",
            "Since it’s ‘95 and ‘05 my guesses would be Nishiki, Yumi and Date. With Haruka thrown in the mix at some point.",
            "They're cutscene-heavy and the starts are always slow, but once you get further into the game, they really open up with a ton of side activities and mini-games.",
            "They're some of the most gameplay-rich games I've ever played but they always start with a LOT more talking than playing. It's slow at first but the middle main chunk of the game is doing all kinds of stuff around the city",
            "Seems like a Japanese studio if not a Japanese director at the very least",
            "You do realise Yokoyama has worked on quite literally every game RGG studio has made",
            "Oh boy judging by that flair youre a ragebait troll",
            "Maybe put Majima in the background in various moments like ghosts in \"The Haunting of the Hill House\"",
            "I'd love to see this attempted.",
            "They’re popup ads",
            "they better add stripper majima and goromi that would be amazing",
            "I know it's only 6 episodes so every second *should* go towards something with plot relevance...\n\nbuuuut also if we don't get Goromi it's literally 0/10 unwatchable",
            "They said crime suspense, they are gonna try to make it gritty.",
            "Reina?",
            "my first reaction was \"they won't make Majima a sunflower kid right?\". Nishiki's sister makes more sense.",
            "I'd be guessing shinji",
            "No, I want 10 hours of Kiryu playing Mahjong for the completion list. 😠",
            "True, as some things can't be converted between mediums. I just hoping the changes are good as seeing many media transitions end up lacking.",
            "TBH even the first stage play and the movie are different from the game in some thing.",
            "That’s something both Douglas Adams and Eiichiro Oda understood.",
            "I think it also gives them a chance to omit/change a few things that may not have been the best choice back then. I could see them maybe removing/changing/retconning the Yumi amnesia & Jingu part of it",
            "The first game is honestly rather short. If they stuck to the main plot only then they probably could cover basically all of it in a short series.",
            "[removed]",
            "The IGN article says \"The series was announced today at a press conference at the picturesque Hotel Gajoen Tokyo.\", so sounds new to me.\n\nhttps://www.ign.com/articles/like-a-dragon-yakuza-live-action-series-announced-for-amazon-prime-video-this-fall\n\nEDIT: Turns out the some of the cast were seen a year ago, so this has been know.",
            "Yes, it had already been announced that he was working on the series, but since no more information had been given, it seemed that it had remained in the production stage.",
            "Shimano was so goofy and didn't feel menacing at all, and Nishki was also a bit goofy with that crying scene. Majima was great tho",
            "It's one of three things really: \n\n- A made up, original character\n\n- Nishiki's sister\n\n- Reina? Maybe. Depends on how long she knew them for pre Y0.",
            "Completely agree, seems like a no-brainer to me. I hope Reina and Haruka are in this show at least.",
            "Shinji/Nishiki/Yumi\n\n\nDaigo and Majima aren't childhood friends.",
            "The Like a Dragon movie from 2007 by Takashi Miike",
            "The movie https://youtu.be/XCDhpdpbP6c?si=W55BykNGgyVCpoWv",
            "I haven't seen it, myself, but I would assume it is from the Takashi Miike movie from 2007",
            "Yakuza’s already had a movie and a play adaptation.\n\nI think it’s safe to say this isn’t exactly new territory for the franchise.",
            "Do we know that 5's localization lead to 0's? IIRC they really ramped up 0's marketing campaign way more. Plus, 0 is very beginner-friendly unlike 5, which was released for a then-last gen system come localization.",
            "Yakuza 1 - 5 were also good.",
            "The preceding games were amazing too. Sick of this revisionist history.",
            "1, 3, and 5 were genuinely good tho",
            "It had nothing to do with any game's actual quality. \n\nThere were a few factors, the primary one being that they were only releasing them on the almost-failed PS3. Another is that Yakuza was seen as just another GTA clone, which the Playstation was utterly swamped with.\n\nIt's also extremely Japanese, which obviously didn't help it lose the niche label.",
            "Ive seen Naked Director and wow he will nail the campiness of Yakuza",
            "Oh god.\n\nKamen Rider Drive",
            "Amazon Budget AND Masaharu Take at the helm? \n\nPeak incoming",
            "100 Yen Love was great. I actually have high hopes for this.",
            "The Naked director is actually a little niche gem, he will nail the Yakuza style that's for sure, hope the story will be good but if there's one guy able to capture the Yakuza vibe it's him",
            "Ryoma = Ishin protagonist and Takeuchi is a similar name to another main character there as well, haha.",
            "Fallout was written by Jonathon Nolan who wrote WestWorld Interstellar Dark Knight.\nThat's the prime reason it's good.\n\nLook at Rings of Power, Amazon being involved doesn't automatically indicate quality",
            "Amazon originals have the best quality imo, when you see its a prime production you can atleast expect it to be solid.",
            "It can be popular and be shit. Star wars",
            "Fallout doesn't have any truly established characters, so any decent story that is lore accurate is good enough.\n\nYakuza is heavily dependent on the characters, so IMO it will be much harder to get it right.",
            "And Halo did terribly.\n\nAmazon has like 3 shows worth watching, maybe they can make it 4 but I am not optimistic.\n\nEdit:  The point is that if you look at it as an Amazon show or as a video game show, the odds aren't spectacular at the moment.",
            "Fallout was made by genuine fans of the IP who kept poking at Bethesda to let them make it for years, simply being on Amazon doesn't mean this will automatically be good it could be some corporate thing that Sega did and they just hired a bunch of people and we get another Halo situation",
            "Fallout was done by the Westworld crew so it had a leg up long before production began. We can only hope Amazon picks a good studio to do this also.",
            "That is unironically a good way to stop casual viewers from getting confused too.",
            "They should, those name cards are taken from old Yakuza movies anyway (most of which were directed by Kinji Fukasaku).",
            "and license \"The Funk Goes On\"",
            "Maybe we’ll get some flashbacks to the weightier moments, like Majima and Makoto.\n\nBut I can’t see them spoiling 0’s plot because they will probably use this series to get people to buy 0 as a jumping-in point.",
            "the other half is mahjong",
            "What if Kuroda plays Kazama",
            "12 YEARS IN THE JOINT",
            "Day one buy",
            "Yeah! Came out a while ago lol",
            "It's 6 episodes",
            "Imagine being taller than Fruit Jesus lol",
            "Makes sense. Thanks!",
            "not a very Kiwami move on their part, tbh. the only time where that word is appropriate for two massive japanese media franchises",
            "Oh god thats right. Forgot about her lol",
            "it said kiryu and 3 more.",
            "it said kiryu and his 3 friends, so only 2 we know.",
            "I'm obsessed with this idea. Also similar to there being a pineapple in every episode of Psych",
            "I was imagining Jim Carrey as Background Guy from In Living Color, where Majima just fights people in more and more outlandish ways in the background out of focus",
            "Season Finale has to have Majima Construction Anthem as a post credits scene",
            "People on the show also need to work like the NPCs where if the are walking close to Kiryu/Ichiban during a conversation they will immediately turn back",
            "It should be something like [this](https://youtu.be/UEOTTr1Rnik?si=QFbXfHj0DdvVo0Po)",
            "Maybe a montage of Kiryu and Majima in diifferent and weirder costumes crossing paths ?",
            "“While the games let you experience their world through the subjective lens, this adaptation will be the ultimately objective way to enjoy the show. I have no doubt that fans of the series will be drawn to how it brings the games to life and adds new surprises. Newcomers, I’m sure will find themselves invested simply in the gritty realism of the show.”\n\nA quote from the executive producer. So yes, they're definitely going to try and make it gritty.",
            "That would be a liberty because she met them in Yakuza 0, not as a childhood friend.",
            "I want Kiryu dying in the shoot out 50 times (he’s doing a legend play though)",
            "But for real, there better be scenes of them hanging out while doing silly mini games to kill time. Or showing the emotional side quests for random people.",
            "No way we'll get true kino, don't get your hopes up.",
            "10 hours playing Mahjong made you a F***1ng completionist.",
            "Yeah, change is both required but can reveal the difficulty in trying to convert to a different medium in the first place. Sometimes stuff works best in the medium its in. After all, the show will probably include a karaoke scene or two, but won't have a plethora of sidequests.",
            "Yeah, mainly due to budget and time constraints. TV is the best visual format for stories as dense as these.",
            "Yep, adaptation does let you potentially mess with the ending. Sometimes it works like with Who Framed Roger Rabbit, Forest Gump, and Jojo Part 5, though we also get stuff like Halo.",
            "Yeah, but how 'all of it' can be depicted in a show versus a game can be quite different. A running gag is 'Kiryu never killed anyone' and then we see a bit of him in the shooting sequence from 1 or one of the many brutal near fatal woundings he does. In the original movie adaptation he just flat out killed people.\n\nSo how they tackle that could already lead to some changes.",
            "That's not corporate speech, that's what actual creatives have said on numerous occasions. You can't really translate a video game (which is non-linear and where the player controls what they see/the focus is on gameplay rather than strict narrative) perfectly to a movie or TV show. \n\nBeing different doesn't really mean it's going to be awful. Look at the Witcher 3. The game deviates so heavily from the lore of the books (and often contradicts it) that it's basically developed into its own series separate from the source material, but it's still easily the best piece of witcher media ever made.",
            "is he wrong though?",
            "Don't be a dingus?",
            "https://www.reddit.com/r/yakuzagames/comments/14lfd0z/ryoma_takeuchi_and_kento_kaku_to_play_kiryu_and/?rdt=41776\n\nI knew I wasn't crazy",
            "Shinji was a childhood friend? Didn't know!\n\nI knew the Jimas were not childhood friends, but since I couldn't place the third one, I thought maybe they'd make Majima a Sunflower orphan to deepen their bond or something (although I wouldn't like that tbh)",
            "I can't believe I'm only just finding out this is a thing.  Especially considering I went through a phase where I was actually trying to collect DVDs of all the Miike films.",
            "The fact that movie exists ALMOST proved the existence of God to me. Then they forgot about Hana chan in future games and I cursed God's name.",
            "It’s so stupid, highly recommend it.",
            "OH MY GOD\n\n\nHow did I not know this existed? \n\n\nAnd the fact that Date is played by the same guy who plays Ryu, the Yakuza from Midnight Diner, just blows my mind. \n\n\nI am going to get insanely high and watch this start to finish this weekend.",
            "Sorta. After the terrible sales of Yakuza 4 and especially Dead Souls, Sega was ready to pull the plug on the Yakuza series overseas until Sony's BuildTheList Campaign which players list which games they want to see in the West. \n\n[One of those games was Yakuza 5](https://www.youtube.com/watch?v=hdouIiMkKjY). Sony and Sega released the game worldwide on Dec 8, 2015, a full 3 years since its JP release, and I assume it sold well enough for Yakuza 0 to get localized as well, and the rest is history. God bless you Gio Corsi, the unsung hero of the old RGG fandom.",
            "Theyre good but 0 was a noticable stepup in quality",
            "Yakuza 0 is one of the best if not the best game so it makes sense.",
            "What is revisionist about it?  The games were so mid to bad they almost pulled out of the West all together.  If we never got Yakuza 0 we wouldn't have any more English Yakuza games.  The later games would be very different.",
            "Y3s gameplay is booty cheeks",
            "And 2 and 4 were better",
            "Thats true, I can think of so many games the PS3 killed by being so bad.  GTA 4, Uncharted 2, Red Dead Redemption, Arkham Asylum, Bioshock, Farcry 3.  Really, I would be amazed if any of those sold 10,000 copies on there.",
            "who can play Ichiban to truly [Henshin](https://imgur.com/vgFOioG)?",
            "And this is directed by Masaharu Take, the guy in charge of “The Naked Director” which is the most Yakuza-esque thing I’ve ever seen outside of Yakuza",
            "Nolan was only the director. Fallout was written by the co-writer of Tomb Raider reboot and Captain Marvel and a bunch of people who don't even have their own Wikipedia pages.",
            "Fallout was not written by Jonathan Nolan. He's an executive producer and directed three episodes. \n\nHere's a list of the credited writers of that show. Jonathan Nolan is not one of them. \n\nhttps://m.imdb.com/title/tt12637874/fullcredits/writer?ref_=m_ttfc_2",
            "I would argue the prime reason fallout was good was that they had heavy collaboration with Bethesda and they put amazing effort into nailing the tone and visuals of the series as much as the format allows",
            "Rings of power aint that bad, at least was rly pretty to look at 😭",
            "I get Rings of Power had flaws, was panned, but I still watched it as an Epic in high tier HD for eye candy. The volcano scene is justification enough for my OLED and 5.1.2 surround sound. Sometimes I'll queue that scene up just to remember how good I've got it.",
            "Rings of Power is pretty good. It doesn't hold a candle to the LotR trilogy, but its so much better than the garbage Hobbit movies.",
            "Ring of power is the only exception, and that were honestly on due to them even attempting to make a original show out of a source that has been deified. \n\nThe show itself was written, directed, and casted pretty well, they were just doomed from the start the moment they picked a LotR series. \n\nYakuza fans will be much more forgiving along as they keep Kiriyu an seemingly indestructible, honorable, campy dude with terrible one liners, and have an really good neon tokyo setting. \n\nI honestly can't see them messing this up.",
            "Halo isn’t made by Amazon, it’s by Paramount and that show was in development hell since 2012 when it originally gonna be a movie for Xbox Live, then a show, then Steven Spielberg was gonna direct the episodes, then it just stalled",
            "Amazon made Fallout, not Halo.",
            "Halo was made by Paramount",
            "Halo was Paramount",
            "With how glaring Fallouts writing flaws got a pass by the majority I'm expecting this to be praised as long as we get a Majima Everywhere, Batting cages, and Saejima foreshadowing reference.",
            "[deleted]",
            "This is apparently made by an American studio but with a mostly Japanese production, kinda like the recent Shogun series.",
            "Well remember it said that it will be a ton of stuff that Kiryu did or didn’t do via consequences so it can be anything.",
            "Surely when they cover 2, that would be a better point to bring in Makoto.\n\nFor 1, it should be left as hints towards Kiryu and Majima's shared past.",
            "My thoughts ",
            "This would make me so damn happy. 😊",
            "Crap, now I have to go watch it! Thanks. 😂",
            "Oof. Misread.\n\nThen… that's weird.\n\nBut also, the article referred to Kiryu as \"*Kazuka* Kiryu\" so maybe there's some typos or mistranslations…",
            "Have a pineapple in every episode with Majima hiding under it",
            "What makes Yakuza great is you can be playing an incredibly intense sorry mission about heavy topics and then immediately get majima on a stripper pole.",
            "Could be misremembering, but she didn't meet them IN Yakuza 0, didn't she already know them before Yakuza 0? So she could still be a childhood friend. Just not from the orphanage. \n\n\"Childhood\" could also mean teen years as well. Kiryu and Nishiki are only 20 in Y0.",
            "That is not that much of a stretch, I could definitely see how they could make it work.",
            "Oof, too soon. Just did this yesterday. The pain is still fresh",
            "For a crime drama, having main character discuss plot while playing majong sounds like a more natural way to infodump",
            "they should do at least one silly substory though :(",
            "Maybe they’ll do a montage of Kiryu living his life and doing all the sub stories and minigames as easter eggs.",
            "Oh damn, that was a year ago, no wonder I didn't remember. I will take the lost on that. I'll edit my comment.",
            "Thanks, was going to dredge this up. The production company has had it on their sheets for months. \n\nThe same spy report (originated from a gossip site in Japan iirc) put Aoki Munetaka on the scene as well. I think he might well be Majima.\n\nCan't wait!",
            "I'm really surprised that some of y'all haven't even see any clips of this movie in Yakuza related videos",
            "Yakuza in a nutshell. It's stupid, highly recommend",
            "Man isn't that crazy? To think that if it weren't for him and the rest of the then-small community's efforts, most of us here wouldn't be Yakuza fans, and with how big a share of global sales we are by now, the series would also be far less lucrative and successful in Japan.",
            "Im glad I made the decision to start with K1 and then go back to 0 after 6. I'm partway through 3 now and all I've been hearing this whole time is how great 0 is.",
            "Dead Souls almost killed the series. Not 1-4.",
            "Sounds like a button masher got filtered",
            "But I like booty…",
            "2 and 4 are the worst games in the franchise by far. Their stories are nonsensical garbage",
            "Luckily most of those were also released on Xbox 360, so they weren't hit as bad as Yakuza. It was only when they ported 0 to PC that the series really picked up again.\n\nUncharted 2 is the only PS3 exclusive and funnily enough it is also far less popular than the others were.",
            "> The Naked Director\n\nWill have to check this out!",
            "It's not \"the prime\" reason but it's \"a\" reason. Jonathon Nolan was already a massive fan of Fallout beforehand. A lot of people criticise Fallout 4 and Starfields writing so Bethesda is definitely not the prime reason the story is good. But you're right, they helped NAIL the visuals and set design.",
            "You could have watched wallpaper engine for a similar feeling ",
            "The show is good. And over-hated. If you go to rottentomatoes you'll see 80% of critics recommending it, while only 30% of the regular folks recommend it. One of them is wrong and in this case it's not the critics. It rarely ever is the critics.",
            "*2013\n\nI recall it was originally going to be aired on Showtime at one point",
            "If we're going by Amazon's track record, this show is likely horrible.  They have like 3 good shows across all their originals \n\nIf you don't like Halo as reference then you can look at The Witcher, Resident Evil, etc.\n\nThere's a chance it's watchable, but the odds are against it.",
            "Amazon is also not making this",
            "I was just talking in the realm of video game crossovers.\n\nAmazons overall record so far isn't great for the most part.",
            "I never said otherwise",
            "I never said otherwise",
            "I will be messaging you in 4 months on [**2024-10-26 12:18:31 UTC**](http://www.wolframalpha.com/input/?i=2024-10-26%2012:18:31%20UTC%20To%20Local%20Time) to remind you of [**this link**](https://www.reddit.com/r/yakuzagames/comments/1d7n1j9/like_a_dragon_yakuza_liveaction_series_announced/l71xu8u/?context=3)\n\n[**CLICK THIS LINK**](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=Reminder&message=%5Bhttps%3A%2F%2Fwww.reddit.com%2Fr%2Fyakuzagames%2Fcomments%2F1d7n1j9%2Flike_a_dragon_yakuza_liveaction_series_announced%2Fl71xu8u%2F%5D%0A%0ARemindMe%21%202024-10-26%2012%3A18%3A31%20UTC) to send a PM to also be reminded and to reduce spam.\n\n^(Parent commenter can ) [^(delete this message to hide from others.)](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=Delete%20Comment&message=Delete%21%201d7n1j9)\n\n*****\n\n|[^(Info)](https://www.reddit.com/r/RemindMeBot/comments/e1bko7/remindmebot_info_v21/)|[^(Custom)](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=Reminder&message=%5BLink%20or%20message%20inside%20square%20brackets%5D%0A%0ARemindMe%21%20Time%20period%20here)|[^(Your Reminders)](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=List%20Of%20Reminders&message=MyReminders%21)|[^(Feedback)](https://www.reddit.com/message/compose/?to=Watchful1&subject=RemindMeBot%20Feedback)|\n|-|-|-|-|",
            "That's good. RGG should be heavily involved then. Sega can really only make suggestions with the Sonic movies but they're involved enough that the new Master Emerald lore came from them to fit movie pacing according to director's commentary.",
            "Aren't the showrunners/writers for Shogun American? It's based on a western book, after all.",
            "I'm pretty sure Oda introduced Kiryu to the bar in 0 but Nishiki was already familiar.",
            "Reina said she'd heard a lot about Kiryu before meeting him for the first time in 0, so I doubt they knew each other beforehand.",
            "After my first or second time doing it I made a save immediately after so that whenever I do legend playthroughs I can skip it lol",
            "If the show is successful maybe we can get the substories as a spinoff",
            "I’ve been gaming for over 30 years now and 0 is easily in the top 3 of the best games I’ve ever played.",
            "Dead souls almost finished off a series that was about to die.",
            "Bro I've played the PS2 games. They feel so much better than 3, I'm sorry 😭😭😭",
            "Love how people say this implying any Yakuza game is hard lol. It's just boring having to throw all the time plus the 180 blocking",
            "The Last of Us?\n\nAnd there you getting Uncharted 2 was far less popular?  It sold more on the PS3 than almost all of those, and got a show before any of them.",
            "Do that, it’s great.\n\nKeep in mind though that it’s heavy NSFW, so either watch alone or with someone who won’t question why there’s literal porn on your screen that you’re watching like a TV show.\n\nIt’s set in the 80s and a lot of the events are unfolding in Kabukicho (real-life counterpart of Kamurocho). Lots of absolutely batshit stuff, but not without some hard-hitting drama",
            "The point I was trying to make wasn’t that Bethesda being involved is what made it good so much as having the people who do the source material of an adaptation involved in some fashion  was  probably a big plus for quality. \n\nAs compared to say, the 90s Mario movie, or the uwe boll video game adaptations.\n\nYeah they had problems beside being divorced from the original material but the lack of involvement certainly didn’t do favors .",
            "It's one of those things where you have a huge amount of losers on the internet bashing it at every single turn. Because usually they have some sort of agenda or are part of that reactionary internet gamergate-esq troll group That just clings onto something like LOTR or The Last Jedi and beat it into the ground. \n\nI thought it was a neat show. I think it has some really cool places to go. It's kinda like how i'm disappointed by the end of game of thrones, but I also thought it was really good still. Fandom gets really out of control.",
            "It did, but it was delayed multiple times before Paramount+ arrived and just dumped it on there.",
            "The Witcher and Resident Evil was made by Netflix, mate",
            "[deleted]",
            "Its record with video game adaptations this year is pretty good, which was my point.",
            "Yes but the cast is made up of mostly Japanese people who speak only Japanese and not a lick of English, with the exception of Anna Sawai and Hiroyuki Sanada. Sanada actively took on a producer role in order to get proper Japanese representation for the show, to make sure the show was as authentic as it can get. A full Japanese cast and Japanese samurai consultants.\n\nFrom the looks of it, it seems that Like a Dragon will go the same route in terms of production value as well.",
            "[Ah yeah you're right actually](https://www.youtube.com/watch?v=RDeFVhq2i80). \n\nI think i remember Kiryu and Nishiki visiting a bar at the start of Y0 and i misremembered that bar as New Serena, but i think it was a completely different bar lol.",
            "Definitely the best way to do it lol, it really is uniquely miserable",
            "Not exactly the same, as it came out on the more popular PS4 a year later, and also didn't have 5 previous instalments worth of background lore behind it.",
            "So basically a normal Yakuza substory🤣",
            "Clarkson's Farm is also good.  That's about the end of the list. \n\nRings of power, Wheel of Time, etc were pretty crap.  There is a reason you haven't haven't heard of many other ones, because they're forgettable to terrible.",
            "Only thing I think is harder is the jingu fight",
            "So?  It was still a top selling game on the PS3 before that.  Why weren't the early Yakuza games rereleased on the PS4 in 2014 to booming sales?\n\n>also didn't have 5 previous instalments worth of background lore behind it.\n\nWhat does that matter?  Are you trying to jump through hoops where you try to find as many minor differences as possible with everything else that exists so you can ignore any actual comparisons and live in a bubble of denial?",
            "In terms of pure bs difficulty I agree, but even Jingu couldn't stand up to my cheese strategy (an inventory full of healing items and a small armory of strong weapons I won from the coliseum when going for completion) so it ended up being a lot less frustrating for me.",
            "Yeah exactly, a top selling game on the PS3 and yet still only 10th across all platforms when it released in 2013. That just shows how terribly all PS3 exclusives did.\n\nAnd if you can't figure out why a game with 5 games of lore behind the story might not sell as well as the start of a brand-new series then that speaks for itself.\n\nAre you actually 12 years old like your username suggests or do you just sound like one? You haven't made any actual comparisons other than calling them bad.",
            "I always had trouble with jingu even with weapons lol",
            ">Are you actually 12 years old like your username suggests or do you just sound like one?\n\nConsidering this account has been active for almost 12 years that would be pretty impressive.  It was actually about the whole Mayan calendar predicting the end of the world in Dec 2012 which I thought was hilarious at the time.\n\n>And if you can't figure out why a game with 5 games of lore behind the story might not sell as well as the start of a brand-new series then that speaks for itself.\n\nPlease clarify then.  From what I can see we are inundated with remakes and sequels since they generally sell much better and are seen as far safer investments by studios compared to brand new franchises.  Should I expect GTA6 sales to be weak since it's got a bunch of games behind it?"
        ]
    },
    "Bro unintentionally a yakuza villain": {
        "title": "Bro unintentionally a yakuza villain",
        "score": 95,
        "url": "https://i.redd.it/nyjriri6j38d1.jpeg",
        "content": "",
        "num_comments": 6,
        "comments": [
            "If you are new to the subreddit, [please read the wiki](https://www.reddit.com/r/yakuzagames/wiki/index/)\n\nReminder that all spoilers need to be tagged with a flair specifying which game is being spoiled. If you want a flair that says something else, you can edit it to say something like [Discussion: Y1 spoiler] or [Majimapost: Y6 spoiler], etc. **THIS INCLUDES CONTENT FROM TRAILERS**.\n\nIf the post is not marked for spoilers, all comments that have spoilers need to be tagged \\>!like this!< along with indicating which game it's spoiling. Example: Y3 >!Kiryu sings!< \n\nIf the post flair is marked for spoilers, the comments don't need to be tagged for the game indicated and the ones before it (So a Y6 spoiler post can have comments with untagged spoilers for Y5, but not gaiden or 7). \n\nIf you see any of the above (or any of the other rules) not being followed, please report it so we can keep this place safe for newcomers and those that haven't finished all the games yet. Thank you!\n       \n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/yakuzagames) if you have any questions or concerns.*",
            "https://i.redd.it/n7wucb29o38d1.gif",
            "https://preview.redd.it/ziu2th2x348d1.png?width=360&format=png&auto=webp&s=f2c6856897e7733d15110c4ee1ad74aa920a552b",
            "with that eye? i can see that",
            "But he is a beast policeman",
            "Something something oppa something something poundmates speed dial"
        ]
    },
    "Credit: @yallkuza on insta": {
        "title": "Credit: @yallkuza on insta",
        "score": 384,
        "url": "https://v.redd.it/w9xrzs2gv08d1",
        "content": "",
        "num_comments": 22,
        "comments": [
            "If you are new to the subreddit, [please read the wiki](https://www.reddit.com/r/yakuzagames/wiki/index/)\n\nReminder that all spoilers need to be tagged with a flair specifying which game is being spoiled. If you want a flair that says something else, you can edit it to say something like [Discussion: Y1 spoiler] or [Majimapost: Y6 spoiler], etc. **THIS INCLUDES CONTENT FROM TRAILERS**.\n\nIf the post is not marked for spoilers, all comments that have spoilers need to be tagged \\>!like this!< along with indicating which game it's spoiling. Example: Y3 >!Kiryu sings!< \n\nIf the post flair is marked for spoilers, the comments don't need to be tagged for the game indicated and the ones before it (So a Y6 spoiler post can have comments with untagged spoilers for Y5, but not gaiden or 7). \n\nIf you see any of the above (or any of the other rules) not being followed, please report it so we can keep this place safe for newcomers and those that haven't finished all the games yet. Thank you!\n       \n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/yakuzagames) if you have any questions or concerns.*",
            "Fake explosions   \nRubber bullets  \ncollapsible knife  \nMicrowave burns can't be that bad  \nRubber bullets again  \nCollapsible katana  \nRubber knee pad",
            "rubber canisters",
            "That knife heat action is even nastier with the bottle cause he just straight up shatters it into their open wound",
            "https://preview.redd.it/l9gp6t7fa38d1.jpeg?width=3464&format=pjpg&auto=webp&s=84645bfbedea0ce129555c073979c912da945227",
            "Kiryu hasn’t killed anyone expect that one guy in one he used as a meat shield but all those heat actions were photoshopped and rubber bullets and the microwave while the store clerk pushed the button he didn’t have to so case closed",
            "Kiryu would never do that to someone",
            "I couldn't stop laughing when kiryu >!goes to the snake flower triad hq and he uses the maitre d as a meat shield!<. That guy looked like he barely knew anything.",
            "Kiryu doesn't kill. Kazuma \"Dragon Engine of Dojima\" Kiryu kills",
            "It's all rubber",
            "Everything is Rubber in the future",
            "Kiryu didn’t kill them it was the explosion!",
            "It's special effects. Clearly, there's a cameraman following him around.",
            "https://preview.redd.it/d1k8n9mh638d1.jpeg?width=2048&format=pjpg&auto=webp&s=12fd447baa7ee90156f151e7f804699de1a78490",
            "Self defense",
            "0-9 sec was clearly self defense",
            "Do we have this in a non stretched format? This is funny",
            "Wasnt a cutscene barrel",
            "It's not a cutscene, therefore it doesn't count.",
            "Yo i think its fake kiryu from yakuza 2",
            "Sounds like a virgin to me 😉",
            "It's a rubber bottle."
        ]
    },
    "Flirting vs Sexual harassment.": {
        "title": "Flirting vs Sexual harassment.",
        "score": 230,
        "url": "https://www.reddit.com/gallery/1dlkw5j",
        "content": "",
        "num_comments": 25,
        "comments": [
            "If you are new to the subreddit, [please read the wiki](https://www.reddit.com/r/yakuzagames/wiki/index/)\n\nReminder that all spoilers need to be tagged with a flair specifying which game is being spoiled. If you want a flair that says something else, you can edit it to say something like [Discussion: Y1 spoiler] or [Majimapost: Y6 spoiler], etc. **THIS INCLUDES CONTENT FROM TRAILERS**.\n\nIf the post is not marked for spoilers, all comments that have spoilers need to be tagged \\>!like this!< along with indicating which game it's spoiling. Example: Y3 >!Kiryu sings!< \n\nIf the post flair is marked for spoilers, the comments don't need to be tagged for the game indicated and the ones before it (So a Y6 spoiler post can have comments with untagged spoilers for Y5, but not gaiden or 7). \n\nIf you see any of the above (or any of the other rules) not being followed, please report it so we can keep this place safe for newcomers and those that haven't finished all the games yet. Thank you!\n       \n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/yakuzagames) if you have any questions or concerns.*",
            "It's funny that they were rlly 6 for yakuza 6. Same with ichiban having a team of 7 and then 8 teammates in his and kiryu's team",
            "*Flirting vs Sexual Intercourse\n\nFixed the title.",
            "What are they some sort of Yakuza 6: The Song of Life? 💀💀",
            "More like Flirting Vs Awkward Conversation\n\nThat part from 6 still goes hard especially when you realise everyone is wearing their suits from the funeral they were just at except Akiyama who just wanted to be included so he went and changed for the occasion. Nothing will top the Yakuza 4 though.",
            "Who would win: the Yakuza 4 or the Yakuza 6: Song of Life",
            "oh no, they are the Yakuza Six, The Singers of Life",
            "Akiyama was in 6?",
            "How long has the number joke been going on? How many people consider the company likes the joke",
            "yakuza 0 would've been a very boring game if they followed the tradition",
            "Oh shit\n\nIm actually into this then, 9 would be awesome for 9, I always like more party members\n\nJust plz don't stiff out one of them this time like poor Joon gi :(",
            "9 will have 9 teammates",
            "What would that make 7 & 8?",
            "As if there was ever any doubt \n\nThey are the Yakuza 4, and they defeated the selfish deeds 4 in a rooftop  fight \n\n\nThe Yakuza 6: The Song of Life never fought The Way of Life 6 in a rooftop fight",
            "At the very start and then in the final chapter to help a bit",
            "It's been in every game since yakuza 4 and we could argue 2 is part of it due to the 2 dragons gimmick (repliqued with the 2 tigers who are supposed to be archenemies of dragons, but I think I'm just looking too deep into it just the ryuji part is enough)\n\nMaybe we could say there's a thing in 3 too since the game was about fighting off the 3 families of the tojo that were fucking around. It's a reach, but that would mean the gimmick is in every mainline game (except 0 but is it really a mainline game)",
            "Kiryu dies of cancer. Saeko leaves the team and is now a sidestory romance character. Joongihan dies or get completely sidelined due to his crime life but seonhee gets to still be there since we didnt play her in y7. Adachi or Nanba dies bc the og trio has to get breaked. Ichiban goes to Australia or Thailand.",
            "Anal",
            "All The Yakuza 6: The Song Of Life did was fighting baby Iwami’s goons💀.",
            ">we could argue 2 is part of it due to the 2 dragons gimmick\n\nNo need to even go that far. Kiryu and Sayama make two.",
            "You just went from my favorite person ever to my most hated person ever\n\nHow could you do me like this bro",
            "> Ichiban goes to Australia\n\nY'know, someone brought this up yesterday and I said it was a good idea. I really dig it.",
            "Iwami No Bocchan could never hold a candle to Bodyguard Captain of the Selfish Deeds 4, bro could beat all of em for real",
            "and in Yakuza 1/kiwami it's just Kiryu",
            "And in 0 they got 0 bitches"
        ]
    }
}