{
    "Q&A and Ruling Megathread - June 17, 2024": {
        "title": "Q&A and Ruling Megathread - June 17, 2024",
        "score": 5,
        "url": "https://www.reddit.com/r/yugioh/comments/1dhrzc4/qa_and_ruling_megathread_june_17_2024/",
        "content": "If you're asking for some information, put your question in the comments of this post. If you're discussing a topic, rather than asking for some information, you can make a separate post outside of this one.\n\nHere are examples of questions which belong in the comments of this thread:\n\n* Questions about the rules of Yu-Gi-Oh!\n\n* \"Is this card fake?\"\n\n* \"What are some good decks?\"\n\n* \"Has there been any news about X?\"\n\n* \"Where can I buy or sell cards?\"\n\n**Resources**\n\n* [Yugioh101 Rules Resources](https://www.reddit.com/r/Yugioh101/wiki/judge_resources) \n* [Discord Servers for most decks](https://www.reddit.com/r/yugioh/wiki/discordrepository) \n* [/r/Yugioh101 Subreddit](https://www.reddit.com/r/Yugioh101/)\n* [/r/Yugioh FAQ](https://www.reddit.com/r/yugioh/wiki/faq)  \n* [/r/Yugioh Discord Server](https://discord.gg/yugioh)   \n* [Yugipedia](https://yugipedia.com) \n* [Official Yu-Gi-Oh! Website](http://www.yugioh-card.com)",
        "num_comments": 128,
        "comments": [
            "Asking again.\n\nAhem. Melodious engine players, do you need need a third fusion to add Etoile to the end board if you already used Bacha for something else?",
            "Does Defense Zone allow Abyss Stungray to protect itself?",
            "How exactly do F.A. cards interact with  Megalith Promotion? Dawn Dragster in particular?",
            "I control F.A. Dead Heat and That Six. Upon resolution of Dead Heat, how many dice results can I change and which?",
            "I've been trying to sell my cards that I had when I was a kid. And someone saw my booster pack wrappers and wants to buy them. Are they really worth anything?",
            "Animation Chronicle releases on the 22nd (saturday). Any chance will see a reveal for AC04-JP005 before the release day? It’s the only “bakura card” left unrevealed. Or do they usually leave some cards unrevealed until release day?",
            "raffleisia has \"meets its activation requirement\" ,rollback doesn't . am i missing something or clarification text or another case of a psct making things more confusing like old darkworlds",
            "Is it alright to ask for SoCal ots locations here?",
            "so when pendelum summoning, does the number on the card itself count as a summonable level as well? for example, if i have 2 and 5, can i only summon 3 and 4? or will i be able to summon 2 and 5 as well?\n\n  \nif a card reads \"draw one card, if the card is a spell: bla bla bla. if the card is a monster: bla bla bla.\" what occurs if you draw a pendelum card? am i allowed to choose which it represents as?\n\nto further this question, if the effect tells me to special summon the monster i draw, but the monster says that it cannot be special summoned, what happens? is it shuffled into the deck and the effect is negated? or would i redraw after shuffling? if the card effect causing me to draw reads \"this effect cannot be negated\" what happens then?\n\nwere pendelum zones themselves removed/conjoined with 2 of the spell slots with the addition of link monsters?\n\n\n\ncan you summon a pendelum monster into a monster zone? if so, does it keep the effect at the bottom? or does that only apply if it is in a spell zone? also, the effect between the pendelum levels, does that only register in the spell and  pendelum zones?\n\n  \ncan a pendelum monster be attacked if it is in a pendelum zone? can a pendelum monster attack if it is in a pendelum zone?",
            "Looking for some similar designs to this. Holiday related stuff, folklore, etc\n\nhttps://preview.redd.it/dzxzon2y7d7d1.png?width=540&format=png&auto=webp&s=d7414a80bfec1f252811cd425898e9858caac7ff",
            "What rarity is this? Also is it Worth anything?\n\nhttps://preview.redd.it/nubykbkb9e7d1.png?width=720&format=pjpg&auto=webp&s=d3323b973280c0a1219c5a2ef8cc62e14874b54a",
            "Can Purrely Quickplays choose (Happy or Delicious) a monster that has target protection (like Dragoon)?",
            "Maybe wrong sub. I was buying Pokémon at target and saw a box of Yu-gi-ho! Rarity collection 2. I bought it and I pulled the quarter century rare apollousa. I cant find anyone that has graded one anywhere online. Seems weird since its the top pull. Not one graded sale ever on ebay, pricecharting, 130point.  Why might that be? I definitely want to grade mine.",
            "https://preview.redd.it/f30tglmwsk7d1.jpeg?width=4000&format=pjpg&auto=webp&s=1093e9446b9769f4a87c754b0f6c5063ddb9ba20",
            "why are we not getting a english release of the duelists of light been waiting months for reprints to make my trickstar deck and now found out its not going to be in english",
            "If i have an optional trigger effect that can activate but I pass priority, and my opponent activates an optional trigger effect, can I chain to it with that same optional trigger effect ?",
            "Can you Cannahawk under Shifter?",
            "Why is Bucephalus II used in labrynth decks in the tcg but not the ocg?",
            "https://preview.redd.it/rix0c80fht7d1.jpeg?width=3024&format=pjpg&auto=webp&s=910bbc1cf9372114775b4f3656cdda0a7a5fbdc7\n\nFake or real? And any general tips for identifying fakes in the future?",
            "If I activate Pot of Duality and my opponent chains Ash Blossom, can I then chain Gamma and will it resolve?",
            "https://preview.redd.it/u9mayjwb9u7d1.jpeg?width=3024&format=pjpg&auto=webp&s=1802528f6a8b906611fb4045c54af77e8813edde\n\nAre any of these cards fake? I have been trying to find these exact ones everywhere but I have not been successful.",
            "Where can the 'old' style secretrares be found? Are there any other cards that use that pattern? Example. Xsaber Urbellum",
            "So question. I have recently gotten back into watching yugioh, I stopped after 5D but I have gone back and now I’m all the way to Arc V. This has prompted me to start dueling with my friends again as we all are “new” to this again (like we have no idea what link monsters are, and I just found out what pendulum monsters are because I am watching that anime) so with monsters effects do we have to tell them the monster effects before they attack the monster or do they have to attack to them find out the effect? Like watching the show they know monster effects until AFTER they attack the monster and trigger said effect. I feel it doesn’t make much sense if you know my monster makes you monster lose attack points if you attack it, before you attack it, then you would just never attack my monster. Do I have to tell them the effect before they trigger it or after it’s triggered?",
            "(idk if I should comment here, but I want the answer) I often create Yu-Gi-Oh Archetype for fun and I'm creating/created this Archetype with this effect \"If you have no cards in your GY and banishment (Quick-Effect): You can place 1 \"Perfectionist\" card from you hand on the bottom of the Deck, and if you do, Special Summon this card from your Deck, also you cannot Normal or Special Summon for the rest of this turn, except \"Perfectionist\" monsters\". My Question is: Will this effect work? because instead of the hand or GY it Special Summon itself from the Deck where it isn't public knowledge.",
            "Hello everyone, I got a {{Mechanicalchaser}} that is equipped with {{Metalmorph}} and attacks a face-down {{Light And Darkness Dragon}}. I would say that LADD can of course not activate its negating effect to negate Metalmorph's initial activation (was activated during my MPI, when LADD was still face-down), but during the Damage Calculation LADD is face up and that's just when Metalmorph's mandatory effect activates on which LADD's negating effect can be chained on, meaning it can negate its ATK boost of 1400 ATK for only this certain attack. Is this correct? Thanks in advance!",
            "Now it obviously wouldn't be the most meta thing, but whats the best possible decklist I could make with an Odd-Eyes/Supreme King deck with the following goals:  \n- Must have at least a Z-arc that is at least occasionally used  \n- Use as little performapal as possible (I know I can't ignore them completely, but I just don't like most of their art)  \n- Make use of all summoning mechanics (or at least cards), preferably pendulums when possible (Ritual, Fusion, Synchro, XYZ)   \n- Can use some pend magician  \n  \nI realize this is quite a big ask, but I'll take whatever I can get (even if its just general tips on how I'd go about doing this).",
            "Does Number 58: Burner Visor's equip effects still apply if equipped by another means other than its own effect?",
            "Do you have to show your opponent the trap you set from hand off of Arias in Labrynth?",
            "If you equip a token to Relinquished Anima, does it assume it's attack?",
            "When No. 90 Photon lord is on the field with no materials, and an opponents monster activates an effect, is it possible to Chain its monster negate (CL2) then assuming no response chain its search effect to add as material (CL3), the intention being to add a material to pay for the cost of the negate once the chain begins resolving. ",
            "[removed]",
            "About the anime. Why Bakura parents dont show up or care about his second personality? Kinda weird",
            "Hello, I got another question about {{Light And Darkness Dragon}}: if it destroyed and sent do the GY, and there are no other monsters in the GY, can it select itself (as it has to be in the GY to activate its effect) and therefore special summon itself after destroying all cards on the player's side of the field?",
            "This will have to depend on what a judge rules. The OCG text of Defense Zone only protects cards in the S/T zone, rather than S/T themselves, so OCG rulings are not applicable in that case.\n\nI personally would say yes for TCG, based on how the TCG text is worded, but obviously, for OCG and Master Duel, the answer is no.",
            "If Megalith Promotion is applied to Dawn Dragster, it becomes lvl 14, since its original level is 7. Keep in mind that Promotion can only target a lvl 4 or lower monster, so Dawn Dragster needs to first have its level lowered to 4 or lower.\n\nAfter the effect wears off, assuming it works the same way as ATK/DEF modifications, Dawn Dragster should return to lvl 7 at the end of the turn.",
            "You can choose 1 of either dice results, and change it. As long as you don't roll a 1 and your opponent a 6, you should be able to always manipulate the result in such a way that you always win the dice roll. (and even then, if you roll a 1 and your opponent a 6, you can force a tie to reroll).\n\nYou cannot change both results.",
            "Generally no.",
            "What booster packs do ya have?",
            "It's impossible to give an answer to this. Just wait and see.",
            "It’s not necessarily a Bakura card. But they may reveal it via Twitter.",
            "As far as I can tell, Rafflesia's OCG text doesn't have any equivalent of \"meets its activation requirement\" in it, so it seems this is a TCG exclusive form of reminder text, that they didn't bother with on Rollback.",
            "It's just because it's an older card. Older cards often had to explain their mechanics since they were new mechanics at the time, same as how contact fusion monsters used to say \"(you do not use Polymerization)\"\n\nAfter a while I guess they assume everyone knows how it works",
            "Rafflesia is made to work with the Trap Hole cards and those mostly have activation requirements whereas Rollback can theoretically copy any Normal Trap card in the game which some don't have an activation requirement",
            "Sure. If you have the Yu-Gi-Oh neuron app, you can sort by distance from you/a certain location. [The official list of ots stores](https://yugiohblog.konami.com/locator/) allows you to do the same. I'd be more specific on the best ones, but I don't live in Cali myself. Still, hope this helps",
            "The majority, if not all of your questions can be answered by reading the Basic Rulebook. https://www.yugioh-card.com/en/rulebook/ Give it a read, it has a lot of useful information about the game you might not know about.",
            "> for example, if i have 2 and 5, can i only summon 3 and 4? or will i be able to summon 2 and 5 as well?\n\nOnly 3 and 4.\n\n>if a card reads \"draw one card, if the card is a spell: bla bla bla. if the card is a monster: bla bla bla.\" what occurs if you draw a pendelum card?\n\nIt's treated as a monster. Monster Cards, including Pendulum Monster Cards, are always treated as monsters unless they're either in the Spell & Trap Zone or attached to an Xyz Monster as material.\n\n>to further this question, if the effect tells me to special summon the monster i draw, but the monster says that it cannot be special summoned, what happens?\n\nDepends on the specific effect. I will say that the effect won't be negated unless the word \"negate\" is explicitly used: just because an effect didn't work properly doesn't mean the effect was negated.\n\n>were pendelum zones themselves removed/conjoined with 2 of the spell slots with the addition of link monsters?\n\nYes. As of 2017, the Pendulum Zones are no longer their own distinct zones.\n\n>can you summon a pendelum monster into a monster zone?\n\nSure.\n\n>if so, does it keep the effect at the bottom? or does that only apply if it is in a spell zone? also, the effect between the pendelum levels, does that only register in the spell and pendelum zones?\n\nWhile the card is in the Pendulum Zone, you only use the effects in the top box, not the bottom box. While the card is treated as a monster, you only use the effects in the bottom box, not the top box.\n\n>can a pendelum monster be attacked if it is in a pendelum zone? can a pendelum monster attack if it is in a pendelum zone?\n\nNo to both questions. Spells cannot attack or be attacked.",
            "There’s a huge amount of folklore-based cards in yugioh, especially Japanese folklore. “Weather report” is a snowman",
            "Secret Rare, about $2.",
            "Yes. If the card was printed at any time within the last 13 years, isn't an Equip Spell, and doesn't use the exact word \"target,\" then it can be used against monsters that can't be targeted by card effects.",
            "Grading modern cards isn't really worth doing, modern cards that have value do so because they are competitively viable, so the only buyers you'll find are people that wouldn't care, and immediately crack the case open to use the card.\n\nFrom my understanding, Pokémon is different in that regard since the high value cards are treated such for their collectability, rather than their competitive viability.",
            "Grading isn't really a big thing in ygo, most people just don't care about it and want to have the shiny cards in their deck instead of a plastic case.\n\nwhich is great, grading is such a scam",
            "Not sure what happened to my text but basically just curious if this is a misprint? And if so, would it be worth anything?",
            "The last duelist packs were in main boxes, such as pyroxene being in dark wing blast. So we will get the cards, just not as the duelist of brilliance",
            "Because TCG sucks, wait for the cards to get get imported in some random reprint set if not a main set even",
            "No. Trigger effects have to be chained in this order:\n\n1. Turn Player mandatory trigger\n2. Opponent mandatory trigger\n3. Turn Player optional trigger\n4. Opponent optional trigger\n\nIf you pass on your opportunity to activate your optional trigger effects, you cannot gain it again, you missed you chance entirely.",
            "\"Returning\" cards to the GY is not treated as sending them to the GY, so yes, the effect of Ulti-Cannahawk fully works under Shifter.",
            "Did those lists that ya saw play any number of Garura?",
            "It's fake. [This is what a real copy would look like](https://ms.yugipedia.com//b/be/DarkMagician-LOB-NA-UR-1E.jpg): the incorrect fonts and spacing are what give the fake away (look at the amount of space before and after the slashes on the cards' ATK/DEF values, and look at the way the \"1st Edition\" text on the fake card touches both the picture and the text box when, on the real card, it doesn't touch either by virtue of having just a little bit of space above and below it).",
            "~~Assuming you're talking about psy-framegear gamma then yes, gamma will negate Ash so your duality will resolve~~\n\n  \nThis is wrong, see my updated response below.",
            "https://preview.redd.it/js6shl3k9u7d1.jpeg?width=3024&format=pjpg&auto=webp&s=ecff5057255a214372ba6638792fc897a21248db",
            "https://preview.redd.it/0u823sem9u7d1.jpeg?width=3024&format=pjpg&auto=webp&s=0a2a49a06cfd5c437c9136fe93ae5f810b7785b3",
            "https://preview.redd.it/ad1qz6rn9u7d1.jpeg?width=3024&format=pjpg&auto=webp&s=4334616674e84524161634f1b9a050c78d7f0b92",
            "All fake\n\n\nChinese cards weren't even made back then, and modern ones don't look like these.",
            "Any Secret Rare printed prior to Battle of Legends Light's Revenge/Code of The Duelist uses the old foil",
            "As long as a card is face-up on the field, both players may read its text in full.",
            "If the card says it can activate from the Deck, it can. See Serpentine Princess being able to Trigger despite being in the Deck. Card text overrides game rules/conventions, but it can definitely become a rulings nightmare.",
            "## [Mechanical Hound](https://ygoprodeck.com/card/?search=22512237&utm_source=bastion&utm_medium=reddit)\n^(**Limit**: TCG: 3 / OCG: 3 / Speed: Unlimited / MD: 3)  \n^(**Master Duel rarity**: Common &#40;N&#41;)  \n^(**Type**: Machine / Effect)  \n^(**Attribute**: EARTH)  \n^(**Level**: 7 **ATK**: 2800 **DEF**: 1500)\n\n**Card Text**\n\nWhile you have no cards in your hand, your opponent cannot activate Spell Cards.\n\n[Card Image](https://yugipedia.com/wiki/Special:Redirect/file/MechanicalHound-SGX2-EN-C-1E.png?utm_source=bastion&utm_medium=reddit) | [Official Konami DB](https://www.db.yugioh-card.com/yugiohdb/card_search.action?ope=2&request_locale=en&cid=6416) | [OCG Rulings](https://www.db.yugioh-card.com/yugiohdb/faq_search.action?ope=4&request_locale=ja&cid=6416) | [Yugipedia](https://yugipedia.com/wiki/6416?utm_source=bastion&utm_medium=reddit) | [YGOPRODECK](https://ygoprodeck.com/card/?search=22512237&utm_source=bastion&utm_medium=reddit)\n\n^(Password: 22512237 | Konami ID #6416)\n\n----\n\n## [Metalmorph](https://ygoprodeck.com/card/?search=68540058&utm_source=bastion&utm_medium=reddit)\n^(**Limit**: TCG: 3 / OCG: 3 / Speed: Unlimited / MD: 3)  \n^(**Master Duel rarity**: Common &#40;N&#41;)  \n\n\nNormal Trap\n\n**Card Text**\n\nTarget 1 face-up monster on the field; equip this card to that target. It gains 300 ATK/DEF. If it attacks, it gains ATK equal to half the ATK of the attack target, during damage calculation only.\n\n[Card Image](https://yugipedia.com/wiki/Special:Redirect/file/Metalmorph-SBC1-EN-C-1E.png?utm_source=bastion&utm_medium=reddit) | [Official Konami DB](https://www.db.yugioh-card.com/yugiohdb/card_search.action?ope=2&request_locale=en&cid=4664) | [OCG Rulings](https://www.db.yugioh-card.com/yugiohdb/faq_search.action?ope=4&request_locale=ja&cid=4664) | [Yugipedia](https://yugipedia.com/wiki/4664?utm_source=bastion&utm_medium=reddit) | [YGOPRODECK](https://ygoprodeck.com/card/?search=68540058&utm_source=bastion&utm_medium=reddit)\n\n^(Password: 68540058 | Konami ID #4664)\n\n----\n\n## [Light and Darkness Dragon](https://ygoprodeck.com/card/?search=47297616&utm_source=bastion&utm_medium=reddit)\n^(**Limit**: TCG: 3 / OCG: 3 / MD: 3)  \n^(**Master Duel rarity**: Ultra Rare &#40;UR&#41;)  \n^(**Type**: Dragon / Effect)  \n^(**Attribute**: LIGHT)  \n^(**Level**: 8 **ATK**: 2800 **DEF**: 2400)\n\n**Card Text**\n\nCannot be Special Summoned. While face-up on the field, this card is also DARK-Attribute. Once per Chain, during either player's turn, when a Spell Card, Trap Card, or monster effect is activated: This card loses exactly 500 ATK and DEF and that activation is negated. When this card is destroyed and sent to the Graveyard: Target 1 monster in your Graveyard (if possible); destroy all cards you control, also Special Summon that monster (if any).\n\n[Card Image](https://yugipedia.com/wiki/Special:Redirect/file/LightandDarknessDragon-AP02-EN-C-UE.png?utm_source=bastion&utm_medium=reddit) | [Official Konami DB](https://www.db.yugioh-card.com/yugiohdb/card_search.action?ope=2&request_locale=en&cid=6821) | [OCG Rulings](https://www.db.yugioh-card.com/yugiohdb/faq_search.action?ope=4&request_locale=ja&cid=6821) | [Yugipedia](https://yugipedia.com/wiki/6821?utm_source=bastion&utm_medium=reddit) | [YGOPRODECK](https://ygoprodeck.com/card/?search=47297616&utm_source=bastion&utm_medium=reddit)\n\n^(Password: 47297616 | Konami ID #6821)\n\n----\n\n^by [^(u&#47;BastionBotDev)](/user/BastionBotDev) ^|\n[^(GitHub)](https://github.com/DawnbrandBots/bastion-for-reddit) ^|\n^Licence: [^(GNU&nbsp;AGPL&nbsp;3.0+)](https://choosealicense.com/licenses/agpl-3.0/)",
            "Metalmorph damage calculation effect does not activate therfore LADD doesn't interact with it",
            "Yes.",
            "Yes because it specifies a normal trap.",
            "If a Token is equipped to \"Relinquished Anima,\" then \"Relinquished Anima\" gains ATK  equal to the Token's original ATK, i.e., the ATK value printed in the effect that Summoned the Token in the first place. Note that this isn't necessarily the ATK that the Token had on the field: for example, the effect of \"Nibiru, the Primal Being\" says that the \"Primal Being Token\" has ? ATK, not a numerical value, so \"Relinquished Anima\" will not gain any ATK if it is equipped with a \"Primal Being Token.\"",
            "You pay cost on activation, not on resolution. No, you can't do this.",
            "Same reason why none of the characters in the show seems to have no parents excluding Yugi's grandpa, it's an old anime trope \n\nIf recall, Yugi's mother did appear in the manga but that's pretty much it",
            "## [Light and Darkness Dragon](https://ygoprodeck.com/card/?search=47297616&utm_source=bastion&utm_medium=reddit)\n^(**Limit**: TCG: 3 / OCG: 3 / MD: 3)  \n^(**Master Duel rarity**: Ultra Rare &#40;UR&#41;)  \n^(**Type**: Dragon / Effect)  \n^(**Attribute**: LIGHT)  \n^(**Level**: 8 **ATK**: 2800 **DEF**: 2400)\n\n**Card Text**\n\nCannot be Special Summoned. While face-up on the field, this card is also DARK-Attribute. Once per Chain, during either player's turn, when a Spell Card, Trap Card, or monster effect is activated: This card loses exactly 500 ATK and DEF and that activation is negated. When this card is destroyed and sent to the Graveyard: Target 1 monster in your Graveyard (if possible); destroy all cards you control, also Special Summon that monster (if any).\n\n[Card Image](https://yugipedia.com/wiki/Special:Redirect/file/LightandDarknessDragon-AP02-EN-C-UE.png?utm_source=bastion&utm_medium=reddit) | [Official Konami DB](https://www.db.yugioh-card.com/yugiohdb/card_search.action?ope=2&request_locale=en&cid=6821) | [OCG Rulings](https://www.db.yugioh-card.com/yugiohdb/faq_search.action?ope=4&request_locale=ja&cid=6821) | [Yugipedia](https://yugipedia.com/wiki/6821?utm_source=bastion&utm_medium=reddit) | [YGOPRODECK](https://ygoprodeck.com/card/?search=47297616&utm_source=bastion&utm_medium=reddit)\n\n^(Password: 47297616 | Konami ID #6821)\n\n----\n\n^by [^(u&#47;BastionBotDev)](/user/BastionBotDev) ^|\n[^(GitHub)](https://github.com/DawnbrandBots/bastion-for-reddit) ^|\n^Licence: [^(GNU&nbsp;AGPL&nbsp;3.0+)](https://choosealicense.com/licenses/agpl-3.0/)",
            "Because that effect is mandatory, it'll trigger on its own ~~but since there are no other monsters in your GY that can be summoned, nothing will happen as the effect  destroyes and special summons the targeted monster, it's all one part~~\n\nYa cannot target Light and Darkness Dragon itself because it cannot be Special Summoned in the first place\n\nEDIT : your field get nuked regardless",
            "Per the first line of its text, it cannot be Special Summoned. Therefore it cannot target itself.",
            "Clearly the TCG card has been poorly translated, and the card should work as intended in the OCG.",
            "Where can I find the OCG text of Defense Zone?",
            "So it returns to 7 even if it was at 3 prior?",
            "Do we know if it does work how ATK/DEF modifiers work?",
            "I’ll look and start typing these. I don’t know when these were cause my brother continued. Ancient sanctuary. Dark revelation. The lost millennium. Flaming eternity. Invasion of chaos. Magicians force. Pharaonic guardian. Dark crisis. Dark beginning. Soul of the duelist. Cybernetic revolution. Metal raiders. Magic ruler. Labyrinth of nightmare.",
            "Well it is likely to be part of this Wedju archetype right? Or somehow support for it. Due to how they order the cards in the set. I.e. it cannot be a “clear” monster since all existing ones have now been made into a card and there cannot be a spell or trap before Clear Phantom?",
            "There’s really no mechanical distinction between the two effects. They work exactly the same, having to meet the activation requirements of the Trap they copy. (There are also “Trap Hole” Normal Traps without specific activation timings.)\n\nAs the other reply stated, the specification is simply reminder text that the TCG didn’t bother to include for Transaction Rollback.",
            "and how about the specifics like the draw one card scenarios? i know the basics ive been in and out of the game since i was a kid, i just never got into anything past gx",
            "Thanks",
            "not that much but some collectors might pay extra dollar or two for it",
            "Only in the tcg.",
            "I had a feeling because either me or my cousin somehow came into a ton of fakes as a kid. Some are very blatant but ones like this stumped my uneducated self. I definitely can see the font and spacing differences now. Thanks for educating me",
            "So the \"you cannot special summon the turn you activate\" doesn't apply until it resolves? Because it's a separate effect from the excavate",
            "Something like this?\n\nhttps://preview.redd.it/kehnfu5rvx7d1.jpeg?width=480&format=pjpg&auto=webp&s=609ea35a5f379e32a98709f4516f61d4bf64ff9d",
            "Thank you so much for this, I just think that it Special Summon itself, is being too much, as it activates in your Deck",
            "So Metalmorph's effect is \"permanently\" but it only applies during the damage calculation? That's why it does not activate and can't therefore be negated?",
            "think about your son changing his personality often. Also how the core bakura behavior is not disturbed? Hes often \"in a coma\" and wake up in weird places.",
            "The effect will still resolve and destroy all cards the player controls. Saying “nothing will happen” is inaccurate.",
            "Oh lord, you're right!\n\nHowever, could it special summon itself, if it there wasn't this first line? (I remember cards with a similiar effect, but cant tell anymore if they'd be able to summon themselves or not).",
            "Sure, ideally, that'd be the case. However, there's precedent for mistranslations causing the card to be ruled differently in the TCG compared to the OCG.",
            "The official card database has a language selector. Switch to Japanese.",
            "There's also [this database](https://texts.ygoresources.com/#13105), which catalogues all mistranslations, and the funtional differences those cause to the cards, and offers a revised text to make the card work like how it does in the OCG.",
            "Yes. When a monster's stat \"becomes\" something else, all previous stat modifications are removed, so in the case of Dawn Dragster, it loses the lvl reductions it had applied to itself before when it becomes lvl 14.",
            "I know level modulation follows similar rules as ATK/DEF modifications for stuff like negates (i.e. if a monster modifies its own level, negating it will negate the level modification, and if the level modification comes from an effect that can modify more than just itself/the effect to modify levels is from another card, it does not matter if it was negated), which is why I assume all the other ATK/DEF modification rules also apply to level modification.",
            "Are these all the original 1st edition or the reprinted ones from 2017/2023?",
            "Could be something random, like a Crump card.",
            "Pendulum Monsters are monsters, hence their name and having ATK, Level, etc.",
            "The basics you are missing about Pendulum Summoning can be found in the rulebook.",
            "Probably as Punishment/Ultimate Slayer target but without Garura, I don't know what reason is there to play it instead of something like the Link-4 Evil Twin",
            "I was wrong earlier. In this case, you can't activate gamma because pot of duality prevents you from special summoning. Even though Ash negates the effects of pot of duality, it doesn't negate the activation of pot of duality, so once pot of duality was activated successfully, you can no longer special summon that turn.\n\n  \nFurthermore, even if pot of duality's activation was negated, say for example solemn judgment, in that same chain in CL3 you still won't be able to use effects that special summon. However, after the chain fully resolves, you will be able to special summon again when you start a new chain.",
            "Yeah, that's the oil Secret Rare foil but know that the TCG quality control has been and still is dropping off for a decade now",
            "It seems they experimented with \"active in Deck\" in the early days and then quickly discarded it. See: https://yugipedia.com/wiki/Special_Summons_itself_from_your_Deck, and https://yugipedia.com/wiki/Activates_from_your_Deck.",
            "It doesn't activate because there are no \";\" or \":\" in that part of the effect.\n\nOnce Metalmorph is successfully equipped to a monster, the ATK increase is Continuous and applies whenever the equipped monster is attacking.",
            "But the effect says \"Destroy all cards, also special summon that monster\"\n\nDoesn't \"Also\" imply that the effect must destroy and summon a monster for it to successfully resolve??",
            "Yes, if it didn't have the first line, it could special summon itself.\n\nI assume you are thinking of something like Colossal Fighter, which can also special summon itself.",
            "And that's unfortunately a very poor precedent.",
            "Thank you that makes sense!",
            "Should be all from the original. We stopped a longggg time ago",
            "There are still 3 Crump cards that have not been made into real cards xD",
            "Well, in the hand yes but in a Pendulum zone they are spells",
            "Yeah, I was inspired when I saw the Familiar-Possessed archetype, I also heard that floo do the \"Our Main Phase\" thing with their effect, I try it with this one, but don't if it is too powerful or not",
            "No, that’s not what the conjunction means. The two actions are independent.",
            "I was more thinking of Toadally Awesome, but I guess it can set itself back into the Extra Deck right?",
            "Double check that because they might be worth something, not a lot but definitely something",
            "Looks like you have your answer now.",
            "Any card in a Spell & Trap Zone is treated as a Spell/Trap Card. That doesn’t make Pendulum Monsters a special exception. You could say the same thing about Dark Magician.",
            "oh, I see, ty ty",
            "I want to say I’m almost positive. Definitely not 2023 because they’ve been in my attic for maybe ten years. And I want to say the same for 2017",
            "You gotta be fucking kidding me LOL. It actually is a Crump card. Did you have some inside knowledge or something?",
            "Create a thread in this sub and post photos of each pack.\n\nThe post will probably be removed later but if ya can at least get a confirmation, ya could try selling them in the TCG card market sub or know how valuable they are"
        ]
    },
    "Is this a deck?": {
        "title": "Is this a deck?",
        "score": 62,
        "url": "https://www.reddit.com/gallery/1dlnklf",
        "content": "So I recently found a tin of yugioh cards at a thrift store and while looking through them I noticed a good amount were sleeved with blue cases. I want to know if these cards make up some deck someone once had. I know nothing about Yugiog so that's why I am asking.",
        "num_comments": 23,
        "comments": [
            "It was probably someone’s playground deck. A version of this was certainly competitive 11-12 years ago but this build is nowhere near viable even for that time. You can look up Mermail.",
            "Generic WATER lightly swarm deck.  Sprinkle in a little bit of beat down.",
            "Wholesome budget deck",
            "It is indeed a deck. A somewhat low budget Mermail deck to be precise",
            "I mean, it’s over 40 cards. Passes the vibe check here",
            "It’s a pretty dated Mermail deck that should be fairly cheap to modernize. With **Tidal, Dragon Ruler of Waterfalls** back at one copy per deck and the boatload of new WATER support, there’s plenty of room to tinker.",
            "Yeah its a deck. Its a pretty weak Mermail deck. All those cards are pretty dated to its probably from like 2014 or so?",
            "60 cards total. Good amount of monster, spell and trap… looks like a deck to me.",
            "Definitely a deck, but a very low power one. Should be fine depending on who you're gonna play with",
            "It is definitely legal as a deck at the very least. Seeing as there are a lot of playsets and synergies, I imagine it was certainly built to be played as a deck.",
            "Hello 2012 budget deck holy cow that’s a funny looking deck",
            "Seriously? Nobody?\n\nNO, THIS IS PATRICK!",
            "No that’s just 60 cards placed in rows and columns on the floor /s",
            "Btw that black card is an extra deck card, so would go on separate pile during a game",
            "B I G - W H A L E",
            "It is a deck, however in my opinion because the limit of cards is between 40 and 60, you should try to stay on the lower side. Otherwise it will be tricky to pull some cards for your strategies.",
            "THATS A BRICK NOW DAYS MAN",
            "...In a matter of literals and textbooks...",
            "That definitely looks like 60 sleeves cards with a theme alright.",
            "57 main deck cards and 1 extra deck card. Congratulations! You have a legal Deck!",
            "Mermail Atlanteans were somewhat competitive shortly after the Deep Sea support came out.  A good number of one card combos that hand ripped for 2 and setup a pretty scary board to deal with using only 4 cards.  It was just very fragile and had almost no room for tech.",
            "Seems nostalgic to me. Didn’t play mermaids but 11-12 years ago was when I dueled my friends in high school. Ah…what sweet memories",
            "Just two?  My brother in Christ, they handripped your WHOLE hand."
        ]
    },
    "Alright, which of them got out of their comfort zone and invited the other on a Date in Vrains while wearing their school uniforms:": {
        "title": "Alright, which of them got out of their comfort zone and invited the other on a Date in Vrains while wearing their school uniforms:",
        "score": 170,
        "url": "https://i.redd.it/174deqgd108d1.jpeg",
        "content": "",
        "num_comments": 10,
        "comments": [
            "It's really hard to tell, seeing as both of them are really socially anxious, owing to their past experiences. Aoi made one friend duringher childhood, but that friend was taken away from here after a misunderstanding, while Yusaku mostly kept to himself on purpose albeit he did have Kusanagi as an important figure in his life. I can't blame him for being the way he currently is, after all the Lost Incident was horrifying for everyone besides Specter.\n\nI'm honestly inclined to believe it was Aoi, she probably figured that she can fix him.",
            "\"Hey, wanna go on a date?\"\n\n\n\n\"Sure! Where to? A nice restaurant? A picnic at the park? A trip to the aquarium?\"\n\n\n\n\n\"What? None of that noise. We're playing Yugioh on the Internet together!\"",
            "Aoi, hands down.\n\nI admit that I'm a huge Vrains hater, but I legit do not think Yusaku really grows as a person throughout the show. He never actually heals from his trauma and his relationship with his friends is lukewarm at best. It's just Ai and Soulburner that attach themselves to Yusaku and he just accepts it. He never made the first move and since we never see them being friends and actually hang out we don't even see him send the first invite. So no, I think he's forever shy.\n\nAoi, on the other hand, we actively see her want to be a better person and understand the Lost Victims and even when she's getting shafted hard she doesn't give up and keeps wanting to help. It's because of that that I can see this translate into her real life where she wants to improve her self-confidence and be like Blue Angel where she can reach out to Yusaku and make the first move.",
            "Aoi FOURTH avatar: Blue schoolgirl...",
            "Credits:\n\nhttps://www.pixiv.net/en/artworks/71045145",
            "Wholesome man!! Good work",
            "So basically like Yusei?",
            "Also, \"While wearing our school uniforms\"\n\n\"WE ARE!?\"",
            "Genuinely this was my biggest problem with bringing in Soulburner in Season 2 as it felt like him being the one to let go of his trauma should have been Playmaker's character development instead after the death of Revolver's father.",
            "Next thing you know she'll become Blue Goth Girl and she starts taking revenge against the writers by winning some damn Duels."
        ]
    },
    "How would you rate the protagonists and rivals archetypes?": {
        "title": "How would you rate the protagonists and rivals archetypes?",
        "score": 58,
        "url": "https://www.reddit.com/gallery/1dlmmrj",
        "content": "Be aware I'm typing on my phone.\nA while ago before it got removed I asked this same question with the protagonists only. I was going do the same thing with the rivals but I found the pic above and it gives me this idea. \n\nSo if hypothetically someone wants to play Yu-Gi-Oh card competitive with one of these archetypes who archetype it be and why? Yes rush duel characters are included. \nI asking for my reasons: \nOne I was curious about which rivals archetypes are competitively viable \nTwo: to between the protagonists and rivals which group have the better deck/archetypes for competitive Yu-Gi-Oh.\nThree: also thought it an fun question to ask. I someone who been off on with Yu-Gi-Oh since ARC V and barely an average player. I use anime decks of Jaden/judai and Yuma since I like both protagonists and series it a nice bonus learning those are the most competitively viable decks with the protags and i am basic like picking the main character in an game pretty much every time basic.  So yeah with that out of the way which archetype/deck is the best of the best!",
        "num_comments": 21,
        "comments": [
            "Ojama 11/10 my main deck of choice",
            "Varis bodies almost everyone on this list. Dragon Link is a long-standing competitive performer, as much as I dislike it. The closest one would arguably be Kaiba, even if only because Blue Eyes took Worlds.",
            "For me, RDA is my main deck, so Jack Atlas is definitely the best, IMO. But for second I'd have to go with Rokkets for how game warping Dragon-link became and how solid the strategy still is, even with all of its bans(could you imagine full power Dragon-link now holy).\nThird place would be Hero due to being such a fun fusion deck. Fourth would be Blue Eyes, because it's just a fun deck for beginners and casuals, sure you will be beaten plot by meta with this, but it's a great deck to start out the game with. Fifth would be Cyberse, due to the cracked staples of Linkuriboh, Pre-Errata firewall, and Accesscode Talker. Next would be Sychron, as while it doesn't have the consistency of RDA and the Resonators, it makes up for it with cracked as hell, near un breakable end boards thanks to Cosmic Quasar Dragon, Crimson Dragon, Barronne, Clear Wing, Accel Sychro Stardust and more. Next would be Utopia for how solid of an OTK strat. This is followed by Galaxy-Eyes, as with the new support, it makes it a lot better than it once was. After this are decks I have very little experience with, like any pendulum archetypes, Ojama, and Little Yugi's toy box deck. Then at last is Dark Magician. Why is it last? For the Master Duel DM wankers who play this. I am so sick of seeing Dark Magical Circle pick apart my entire field one card at a time when I have card effects set to Auto, so they were the bane of my early MD experience.",
            "Okay so for protag:\n\nYugi+ Atem is hard to take into account as their various sub archetypes seeing usage recently(millenium + toy) and magician souls is quite decent.\n\nHeroes is most cohensive strat if you also count the rival's edo phoenix destiny heroes card.\n\nSynchron I think is the weakest and also hard to take advantage of from its good synchro pool.The stardust synchro is good but really hard to summon and usually not worth the effort(until crimson dragon enabling easy access to lv12 accel synchro dragon).\n\nYuma only gives funny otk tools and s0.\nUtopia and the equip + otk gimmick is just okay,not as strong.\n\nPendulum is the strongest from the pend magician performapal and odd eyes card,the deck has strong easy to summon omni negate,ways to flood with advantage and looping potential with some of the pieces,and deck having easy time setting up hidden village lock.\n\nFirewall and cyberse deck is just okay,they can form decent board and easy otk but having to play too many brick and ending up using all the extra deck for link climb and no easy way to recur and recycle all the pieces unlike heroes(from their various gy effect) or pendulum(the mechanic ability to pendulum summon).\nFirewall and accesscode are ones of the most prominient link of the game\n\nFor rival:\nKaiba blue eyes is just bricky and what they do isn't impressive now and blue eyes does not give much generic cards to other strats.\n\nChazz,Kaiba Union has showing in the past and really strong support annoucement recently so the future is good.\n\nChazz LAD dragon sees heavy play in drulers format.\n\nRDA by Jack is quite strong as pure standard deck go but deck does not adapt its endboard well or having specific chokepoint on some cards.\n\nShark is good(mostly because toad is insane),some of the new shark card quite fine.\n\nKeito(galaxy eyes) does not have any efficient combo but his cards sees usage in other decks for endboard pieces(galaxy solider -> nova) and galaxy eyes dark matter dragon to combo.\n\nddd is strong near the end of pend era but the deck is archaic now as pend mechanic is nerfed and the mons it runs look like nerfed version of many modern cards.\n\nDragon link is really quite good with the generic light/dark dragon and many of the dragon mons in anime see plays in link era or even now because the effect on them are good and worth the mat(topologic,borrel card).",
            "Yusaku, his Cyberse deck is basically a cheat (I love him a lot but I have to admit that his plot armor is the strongest)",
            "Judai/Jaden, Yusei and probably Yuma close for the protags. Heroes need the support from non-hero cards to be truly successful but are always at events. Synchrons are just nuts, if you get your combos going it’s GG. Yuma and his Utopia evolutions are pretty good also, not meta relevant or competitive but have some really high power when done right.\n\nVaris would be the best of the lot for the rivals. The strategy doesn’t even compare to the rest of them, it’s so much better. Synchro and Link boss monsters that would derail any other strategy, Borreload Dragon is insane both in design and application.",
            "well Yugi is the only choice; classic anime is good. Never seen the other generations neither I am interested in a series without yugi.",
            "I surprised that Synchrons placed high. My old post  people usually have placed synchrons middle of the road or a least third place behind heroes and utopia/onomatopoeia",
            "From worst to best (omitting Yuga and Luke) Protagonists:\n\n7: Yugi various toy related cards (weak and inconsistent)\n\n6: Yuya “Performapal” (pendulums got nerfed HARD)\n\n5: Playmaker “Cyberse” (firewall was also nerfed)\n\n4: Atem “Dark Magician” (consistent but really low power ceiling)\n\n3: Judai “HERO” (really expensive + need lots of non-Judai HERO cards\n\n2: Yusei “Synchrons”\n\n1: Yuma “Utopia/Number/Onomat” \n\n1 & 2 are pretty interchangeable imo. I think Utopia has a higher ceiling but it also has less room for non engine.\n\nRivals are a lot harder to rank than protagonists because they are mostly weaker:\n\n7/6/5: Manjoume “Ojama” is the definition of jank\n\n7/6/5: Reiji “D/D(/D/D)” MR3 pendulums are asinine\n\n7/6/5: Shark “Water” it’s just random water attribute cards. The only good card in his deck is also a “Number” monster\n\n4/3: Kaito “Galaxy Eyes” has some cool stuff but it’s generally weak\n\n4/3: Varis “Rokkets” not too sure about this archetype but they aren’t relevant in this day and age. Putting it here cus I’ve heard of it being decent in MR4\n\n2: Blue Eyes. Consistent and somewhat powerful. Still gets some play. Not enough to be relevant though.\n\n1: Atlas “Red Dragon Archfiend” Is the deck I’m playing right now. It’s really consistent, plays through interruptions if you’re lucky. And has multiple board wipes and omnis that are easy to get turn one.\n\n\nIf you had to choose one of these archetypes to play, I’d. Say that playing RDA would be best in the physical game (we just got a structure deck). Utopias are about the same price and just as strong, so you can also play that if you truly desire.",
            "If we are talking competitive viability its HEROes, and its not even close.\nJust look at latest tournament standings, of course they are not dominant, but they are present and are a force in the right hands",
            "1-Jack.\n\n2-Manjoume. \n\n3-Rook.\n\n4-Kaiba.\n\n5-Zwijo.\n\n6-Kaito.\n\n7-Revolver.\n\n8-Reiji.",
            "Need an entire list for Chazz/Manjoume alone.",
            "Kaiba watching Reiji combo for 17 minutes to end on three Berserk Dragon sized bodies that negate half his deck:",
            "Wut? Wdym? Every other protag pre-Vrains has a strong plot armor than him",
            "I surprised that Synchrons placed high. My old post  people usually have placed synchrons middle of the road or a least third place behind heroes and utopia/onomatopoeia",
            "> it’s not even close\n\nRokkets (aka Dragon Link) and RDA have better tournament results than HEROes, and, if you count Yubel, then it’s not even a contest.",
            "Yusaku is the only one with a no loss record. Yugi lost, Judai lost, Yusei lost, Yuma lost many times, Astral has lost as well. How do they have stronger plot armor than Yusaku?",
            "HEROs are bloody consistent, but I personally think that Synchrons are better. It’s cheaper, and just as powerful because of cards like Junk Speeder and the ability to summon cards like Baronne de Fleur in Master Duel and Shooting Quasar in the TCG\n\nBtw I finished the rival ranking in my prior comment",
            "Maybe he didn't lose because he actually a good Deck compared to the other protagonists? This is Vrains after all.\n\nThe other protagonists literally have some of the jankiest Decks of all time that if you play IRL, you would be guaranteed to brick 9/10 times, but smh Yusaku has a stronger plot armor?\n\nIf you wanna speak about plot armor, Yusei doesn't have any loss either (he crashed just before losing to Kiryu). Anytime he was about to lose, an \"unexpected\" event had to happen so he doesn't lose. Do I have to mention him winning a relay 1v3 because his opponent couldn't bring themselves to simply pass their turn to make him Deckout?\n\nYugi doesn't even bother to check the card he drew before placing it in the S/T zone. Sure would have been awkward if it was a Monster. Judai was in a situation where he couldn't Summon any Level 4 or lower monsters, and was against a monster that reduces his Fusions' ATK to 0. Topdecks Neos while also having Necroshade in the GY. Talk about luck.\n\nYuma literally transforms his cards mid duel. Yuya gets his first Fusion monster mid Duel too.\n\nBut sure, the one with an actual competent Deck in the Anime is the one to have more plot armor, right?",
            "You I never thought of summoning baronne.well I didn't know of the card when I played synchrons and I was usually trying to summon shooting qusar dragon or ended up satellite warrior or clear, crystal Wing synchro dragon.",
            "Arguably, Soulburner has an even bigger plot armor than Playmaker. A card that stops effect damage that is 300 or lower and a pseudo-Super Poly against a Trickstar player.\n\nAlso, Salamangreat Kernel, the biggest \"fuck you Revolver\" card against said Duelist."
        ]
    },
    "Some more UV Faded cards from my first batch.": {
        "title": "Some more UV Faded cards from my first batch.",
        "score": 106,
        "url": "https://www.reddit.com/gallery/1dlhoq8",
        "content": "These have all been under two UV light bulbs for about 2-1/2 months.  I cut the artwork out of bulk commons to create a shield that will only expose the artwork for fading these cards.  This method isn’t the best because the centering I slightly different on each card but I was already committed once I learned my mistake.",
        "num_comments": 18,
        "comments": [
            "He turned Dark Magician into a synchro lol",
            "how does the foil work with that?",
            "Would faded cards like this still be playable? Might want to try this myself.",
            "D.I.Y Ghost Rares.",
            "Idk, not really a fan of this. It's just like when people cut the cards to make them in 3D... it's just....idk",
            "So can you do the same thing to BE and DM with the older art? however this time can you do 2 of each? 1 full card and the other cover the image so only the card art remains protected.",
            "How are you changing the gold lettering to silver like you did for Dark Armed Dragon?",
            "Are these legal outside of casual.",
            "Legendary Dark Speaker Magician\nDark Level 9 \nSpellcaster Synchro Effect\nATK 2500 DEF 2700\n1 Tuner + 1 non-Effect Monster\n\nFor this card's Synchro Summon, you can treat 1 DARK Spellcaster monster you control as a Level 1 or Level 2 Tuner. If this card is Special Summoned: Add 1 “Timaeus”, “Critias”, or “Hermos” card from your Deck or GY to your hand. If your opponent activates a card or effect (Quick Effect): You can reveal 1 “Legendary Dragon” Spell from your hand; Special Summon 1 Normal monster from your Deck, then this effect becomes the revealed card’s effect when that card is activated. You can only use each effect of “Legendary Dark Speaker Magician” once per turn.",
            "Sun's UV rays \"break down\" the color pigments in the art",
            "Aside from the DM and BE all these cards are still legal for tournament play.",
            "Well when people do that they print it on cardstock",
            "I guess it isn't silver, just the ilumination confusing a little",
            "Except for the synchro blue eyes and dark magician, yes",
            "Dark Magician and Blue-Eyes are not. The others are subject to judge interpretation (wouldnt take them to wcq or higher tier events).",
            "Yes..... With 2 exceptions.",
            "I know that but is the underlying foil also 'bleached'? Never seen one of these in person or in a video, nor do I have the ability to do one myself.",
            "Underside, no. Unless you flip it around"
        ]
    }
}