{
    "YouTube links & Crossposts are now banned in r/GetMotivated": {
        "title": "YouTube links & Crossposts are now banned in r/GetMotivated",
        "score": 157,
        "url": "https://www.reddit.com/r/GetMotivated/comments/10fvwtm/youtube_links_crossposts_are_now_banned_in/",
        "content": "**The mod team has decided that YouTube links & crossposts will no longer be allowed on the sub.**\n\nThere is just so much promotional YouTube spam and it's drowning out the actual motivational content. Auto-moderator will now remove any YouTube links that are posted. They are usually self-promotion and/or spam and do not contribute to the theme of r/GetMotivated\n\nCrossposts are banned for the reason being that they are seen as very low effort, used by karma farming accounts, and encourage spam, as any time some motivational post is posted on another sub, this sub can get inundated with crossposts.\n\nSo, crossposts and YouTube links are now officially banned from r/GetMotivated\n\nHowever, We encourage you to Upload your motivational videos directly to the subreddit, using Reddit's [video posting tool](https://www.redditinc.com/blog/video-is-coming-to-reddit/). You can upload up to 15-minute videos as MP4s this way.\n\nThanks, Stay Motivated!",
        "num_comments": 71,
        "comments": [
            "I greatly welcome this",
            "Spammers ruin everything. Lets keep it inside the club anyways",
            "Damn you mean I can't post my low quality youtube video to get views?!?!?!!  \n\n\n/s",
            "Can we revise the rules around posting links? \n\nIronically, there's a repost up that was posted by a karma-farming account, but when I try to post a link of the original in the comments, the automod deletes my comment claiming it's a crosspost.",
            "How do I post longer videos? I was about to post an old Tony Robbins video from 1989 that is really good, but it is 18 minutes long.",
            "good",
            " Glad to hear it! It can be frustrating when a subreddit gets flooded with irrelevant content, and hopefully this change will help keep the focus on actual motivational content. Are there any other changes or improvements that you think could be made to the sub",
            "Probably the best decision ever made in this community :D",
            "Crossposting is lazy !",
            "Oh poo, and I found a great video from someone else I thought might have helped some folks.\n\nIs there a \"Get advance approval from the mod team\" exception available?",
            "What!?...",
            "aql.hbvsf",
            "what is crosspost",
            "😐",
            "Agreed",
            "Nice",
            "That's fantastic news! It can be aggravating when a subreddit becomes overrun with unrelated stuff; ideally, this update will help preserve the focus on actual motivational content. Are there any additional adjustments or improvements you think the sub may benefit from?",
            "why does linking to somebody's profile in the comments count as a crosspost?",
            "because all links are removed from r / jokes",
            "because all links are removed from r / jokes",
            "soy",
            "[removed]",
            "Thanks for your support, nadiration! We understand that there are some great motivational videos out there on YouTube, but unfortunately, there are also a lot of spam and self-promotion. By banning YouTube links and crossposts, we hope to promote more genuine, high-quality content on this sub. Plus, uploading videos directly to the subreddit makes it easier for everyone to access the content without having to click on an external link. Let\"s continue to stay motivated and help each other grow!",
            "That’s true you’re right",
            "Yes, spammers can definitely ruin a good thing. It's great to see that the mod team is taking steps to keep this subreddit focused on genuine motivational content. Do you have any other suggestions for how to keep this community spam-free and on track?",
            "It’s sll a Jo",
            "[removed]",
            "I completely agree with you. It's important to have focused and relevant content on any subreddit. Regarding the comment on more user engagement, have you thought about having a weekly thread for users to share their own personal motivational success stories?",
            "I like the idea of having a weekly thread for users to share their personal motivational stories. It would be great to have a space where users can inspire each other with their own experiences and successes.",
            "The idea of having a weekly thread for users to share their personal motivational stories sounds like a great way to increase user engagement on this subreddit. I'm looking forward to seeing the inspiring stories that will be shared."
        ]
    },
    "[discussion] Feel unmotivated and can’t stay off my phone or laptop, what do I do?": {
        "title": "[discussion] Feel unmotivated and can’t stay off my phone or laptop, what do I do?",
        "score": 78,
        "url": "https://www.reddit.com/r/GetMotivated/comments/1dlc232/discussion_feel_unmotivated_and_cant_stay_off_my/",
        "content": "Feel unmotivated and can’t stay off my phone or laptop, what do I do? \n\nI’m 21f and I’ve had a really rough month. I’m unemployed as of last week and I caught my bf cheating on me with multiple women so I am already really down about that. \n\nI want to get back into a routine and switch up my life so that I have more control over things and I’m productive, I just can’t seem to get off my phone and do anything anymore. I am also way behind on my uni assignments. Am I fucked? \n\nI feel like I’m starting over and I don’t know where to begin.",
        "num_comments": 37,
        "comments": [
            "You need to practice abstinence from low effort pleasure. And focus on effort based rewards. Go for a walk and listen to something music/podcast etc. do something challenging every day. It's like exercise for the soul.",
            "Delete all your apps that are addicting, spend some time outside doing whatever, and hang around those that are motivated.",
            "Try habit stacking while you’re getting back into a routine. Basically it means completing one task after completing another. And always doing it that way. Ex: get dressed for the morning and then brush your teeth, drink 1 glass of water and then have coffee, apply for jobs and then go for a walk. Also- start small by just adding in one extra thing a day. You don’t want to have these big expectations and then fail and get discouraged. Start out with waking up on time, once you get that down, you can add in less screen time, once you get that down you can add in reading time. Obviously the things you do will be different, but hope that helps!!",
            "Shit man. You're definitely in a rough spot right now. \nIf anything this guy helped me get into a right state of mind over the past few weeks/months:\nhttps://youtu.be/Iz5ZdCK4iFc?si=1m5m83jpU9p53omg\n\nHis content is obviously more targeted towards men but hey, maybe you'll get something out of it, and I honestly think his message surpasses gender.\n\nShowing up for yourself, because no one else will has become my drive. I used to think that shit sounded cringey as hell but it really is true. No one is coming for us, it is only within ourselves that we can find true motivation. That being said it's hard for some of us to get into that mindset, ESPECIALLY if our own selfworth is low. Mine has been low(and is still low more than I'd like to admit) but telling myself that I need to do things to better myself before I do them has really helped. Doing simple shit like making your bed in the morning worked wonders.\n\nThat's where I started, that's the most basic thing I could manage do to. But when I sat down and told myself that I'm doing this for me nothing stopped me from doing it for the past few months. Now I can manage to go to the gym twice a week simply because I know that I am showing up to that gym for me and only me and every second I spend there I am the one thats getting better for it. \n\nAll I can tell you is: Start doing the most basic thing that you know you will benefit from, and once you get that momentum going there's probably no stopping it. Things can be a snowball effect in a positive manner too sometimes.  \n\nRegarding to beinG on your phone/laptop too much, yeet all the distractions that are on there off of it. Once I realized I'm on my phone for 30% - 50% of my work day I deleted all social media. This also gave me time to start spending my evenings/nights more efficiently because I wouldn't be homestuck scrolling through tiktok/instagram stories SLOP. Sure, deleting all social media is escapism, but it sure as hell beats mindlessly scrolling for hours and hours and hours and hours on end.\n\nPs, sorry if this is too much of a  \"male approach\" to things just trying to share what worked for me. ✌️\n \n\nObligattory sorry if my English is shit, it's not my first language.",
            "Put the phone down and go for a long walk /run. Give your brain a chance to get bored so that you can start thinking about what you actually want to do and how you are going to get there. \n\nYou go for a long walk you’ll probably come up with a good dozen ideas for what to do next.",
            "Girl, buy a flip phone, I did and gained time, motivation, my anxiety levels droped and feel happy and optimistic",
            "I locked my phone with a wellness app  certain apps can't be accessed during the day. I can take a 5 minute break on it, after that it locks up again.   \nreduced my phone time by 50 percent",
            "For me, I have to plan my next day before I go to sleep. This way, I wake up with a plan. My day tends to go the way it starts.\n\nAs far as the bf goes, I hope he’s gone because this is as good as it gets with him. Take any time that you would have spent with him and work on improving your life. You’ve got this.",
            "Start by looking at this a a whole new beginning! \n\nThere’s a reason everything fell apart! So you can built it correctly! Blessings! \n\nFirst of all take care of yourself first. Do your schoolwork the best you can do it, aim for great grades that propel your future into something you can be proud of no matter what.\n\nSecond, take care of your mind and body. Moisturise and get your hair and nails and skin in shape. \n\nAnytime you think, “this is awful I can’t do it,”snap a new thought in your mind, “I’m improving my present and future self.”",
            "I hope you dumped the bf!",
            "Decide that some of these issues are actually good things - to your benefit. Losing the bf is the best place to start. Shut off the computer. Get out index cards and write down the things you want in life. Put the cards away and look at them again tomorrow; see if anything has changed. Then spend time with your self. Create new routines and reboot. The better world is not the internet and not your phone. Good luck.",
            "Do your homework. Search for/apply for new jobs with your laptop.",
            "I’d suggest jumping jacks. Push ups? Crunches? Basically just positive physical stuff",
            "Get a flip phone and leave your computer at someone house.",
            "Dump the cheater. Check out Heidi Priebe on youtube. Drop weed if you are using it, even if temporarily. let yourself feel angry. Good luck! Your post shows great self awareness so you are ahead of the game.\n\nEdit: shows not does, autocorrect",
            "Everyday force yourself even with how hard it is. Search on YouTube Marcus Luttrel and listen to his story. I watched this in college and I always seem to go back to it because of his strength. It made me look at life differently like how blessed I really am and that the days are going to be long and hard but eventually the more you focus on yourself the happier you will feel and your energy will attract the right people.",
            "I feel the same can't let go of my smartphone 😖😮‍💨",
            "Go camping",
            " Have some more acceptable \"distractions\" on hand that you can reach for instead of your phone or computer.  I'm talking analog or low tech stuff.  Books, magazines, newspapers (I'm not kidding), dedicated music players (A CD player or iPod, something with no Internet connection).  Your screen replaces all those things, yes, but the content is housed in apps that are literally designed to keep you scrolling on their feeds.  There are no such addicting algorithms on those alternatives, so they're much easier to put down when you're done.  And as many others have said, get in the practice of putting your phone elsewhere or, if your career and life situation allows you to, get a dumbphone.",
            "Start super small, and document your success in a journal, any achievements",
            "Well let’s see, we took ourselves out of nature and placed ourselves into boxes and travel around in pods and stare into screens using man made words and meanings. It’s all very unnatural if you ask me and confusing to our ancestral psyche. \n\nSelf awareness is in essence separation, distinction, identity. \n\nThe other dimension of our existence is whole and selfless, that is why you can’t put your finger on it, no parts exist.\n\nTwo eyes, two ears, two hands and feet.\n\nTwo brains. \n\nOnly down the middle are things whole. \n\nOnly by having it all, self and selfless, can we imagine ourselves in the universe.",
            "prepare to waste half a month to do these follows. **Be sure that there are still unfinished tasks and they are becoming increasingly urgent while you are doing these things**:\n\nplay with your phone and laptop constantly, from dusk to the dawn. **Do not do anything useful** even you are anxiety, do not stop until you get sick of it, and then watch videos of those outstanding persons who can really stir up your jealousy, think of it with burnning fire of envy over and over at the rest of the day. **If you didn't get bored of your electronic devices after a week, stop doing this, the solution is not fit for you.** \n\nthink of the ambitions you had in your previous life, find out which of them can you achieve or make progress in short period, and you still interested in. Dive into them, meanwhile force yourself to do sports 1hr at least, make yourself very exausted in 23:00 to fall into sleep very fast.\n\nafter you are done with your own things, make it hurry to have your urgent tasks done, dont mind if they cannot meet the deadline, talk to your professer or whoever, tell them everything and ask them for understanding, prepare to retake this course or any other consquences(it is bettter not to do it, but if you have to, take it peacefully). \n\nnow you may do everything efficiently, see that life is not that hard if you live hard, donot make you slow down, do everything you can imagne, the world is in your hand\n\nabout your boyfriend, isuggest you break up",
            "Start small: Begin by setting achievable goals each day, like spending 30 minutes on your uni assignments or taking a short walk without your phone. Break tasks into smaller steps to make them less daunting. Seek support: Reach out to friends, family, or a counselor for emotional support and practical advice. Remember, it’s okay to ask for help when you need it.",
            "You will meet many, many people in your future lifetime. Don't get down on yourself for the dipshit who cheated on you.\n\nGet on top of your school work - without that, without finishing whatever you are taking, you would have nothing leverage life with (ie career etc.).\n\nEvery day, turn a page, learn something new.",
            "Get up and yell and then toss your phone and go get some earned dopamine from a walk, run, workout or all three!",
            "Start investing yourself. It is time to level up, gain some XP, and trust in god. You will find your way and your ex bf will realize he made the biggest mistake and you never give him the satisfaction once you are living your best life. You can do this.",
            "Make a choice and don’t give up. You may fail but don’t quit. Keep at it.",
            "If you smoke pot or cigarettes/drink on the regular, quit those. Life is so much better without them. Physical exercise is super important, even if you start with just a 10-minute Zumba video. You’re 21, you’re not fucked, you just need to learn healthy coping mechanisms. Taking care of your mind and body is the best thing you’ll do. Fall in love with yourself, which basically means taking care of yourself and your life.",
            "Have someone hold you accountable.  Tell friends what you're planning to do.  Then ask them to follow up with you.  Meet regularly with others and have them ask what you need to work on and when it needs to get done.\n\nDo the thing.  \n\nDo the next thing.  \n\nDo the thing after that.\n\nStart small.  Work up to bigger projects.  **TURN OFF THE PHONE / TV / TABLET.**\n\nGo somewhere not at home and work.",
            "Start with small things. Build a new routine in your day that's just for you, leave the phone out of it. Make sure it has things you enjoy, not just things you need to get done. Take a 5 minute walk everyday and increase it as you continue on. Adding in more and more little stuff can change your daily life dramatically over a few months. They become habits. Motivation is temporary, habits will carry you much further.",
            "Put the phone away somewhere and leave it. I have it at mornings/nights, but when it's time for me to work I zip it up in my backpack and hang it on the back of my door. I can still hear it if someone calls, but I don't touch it otherwise.",
            "I think you should dump your boyfriend first. That will help you feel better for sure.",
            "Def stay on Reddit on your phone that should help",
            "That sounds like exactly what I need, do you mind sharing the name of the app please?",
            "Oo I really love the index cards idea! I’m gonna do that rn",
            "those outstanding presons, they should have the same age as you have, video is not nessary, he/she can be your close friend, a classmate having a joyful life all the time because what they have done. the point is to taste their storys and be jealous",
            "Honestly recently I've been saying \"I get to do this\" instead of \"I have to do this\"\n\n\nIt's a blessing to wake up every day, use that blessing"
        ]
    },
    "[discussion] How to face the things you are uncomfortable to do and fear the most ? ": {
        "title": "[discussion] How to face the things you are uncomfortable to do and fear the most ? ",
        "score": 55,
        "url": "https://www.reddit.com/r/GetMotivated/comments/1dl4ctc/discussion_how_to_face_the_things_you_are/",
        "content": "\n\nI seem to be wasting so much and instead of feeling worried I'm just mindless not caring anymore about my future but somehow in the background I'm feeling like damn loser for wasting so much time. I don't know why I'm not doing the things I should be doing. Like so fed up with my thoughts and doubts. I tried watching YouTube videos on motivation and self-improvement stuff but any thoughts that rise automatically destroy any hopes or desires I have ",
        "num_comments": 23,
        "comments": [
            "One thing that always helps me face difficult or scary situations, is that I imagine my children one day having to go through it, (hopefully they never will) so I want to set as good an example as I possibly can. “Colonoscopy? Mom did it and she was fine! “ “Stuck on elevator? Mom stayed cool and she was fine!”",
            "\n\nI can feel the weight of frustration and self-doubt in your words. This inner conflict between knowing what you \"should\" do and feeling paralyzed to act is a common human experience. Let's approach this challenge with compassion and presence.\n\nFirst, take a deep breath and connect with the present moment. Feel the aliveness within you, beyond the thoughts and emotions that seem to cloud your vision. You are not your thoughts or your fears; you are the awareness that perceives them.\n\nNow, instead of fighting against your discomfort or trying to force motivation, I invite you to simply observe your thoughts and feelings without judgment. Notice how they arise and pass away, like clouds in the sky. This practice of mindful awareness can create space between you and the thoughts that seem to hold you back.\n\nRemember, true transformation doesn't come from external motivation or self-improvement techniques. It arises from a deep acceptance of what is, right here and now. Paradoxically, when you fully accept your current state - including your fears and perceived shortcomings - you open the door to genuine change.\n\nInstead of focusing on grand future goals, bring your attention to small, manageable actions you can take in this moment. What's one tiny step you can take right now towards what matters to you? It could be as simple as drinking a glass of water or writing down one thing you're grateful for.\n\nEmbrace discomfort as a natural part of growth. Each time you face a fear or do something uncomfortable, you're expanding your capacity for life. Treat these moments as opportunities for self-discovery rather than obstacles to overcome.\n\nTrust in the wisdom of your journey. What may seem like wasted time could be a necessary period of internal processing and preparation. Your path is unique, and comparing it to others or to some idealized version of yourself only creates suffering.\n\nAbove all, be gentle with yourself. You're navigating the complex terrain of human experience, and that alone is worthy of celebration. Your awareness of your patterns is already a significant step towards transformation.\n\nYou have within you an infinite wellspring of potential and resilience. Keep showing up for yourself, one breath at a time. The light of your true self is always shining, even when clouds of doubt seem to obscure it.\n\nWith unwavering faith in your unfolding journey,\nEckhart",
            "What is a smallish thing that makes you uncomfortable? Go do it. Reflect on it. Do it again or pick another smallish thing to try. Repeat.\n\nYour \"motivation\" - you are tired of feeling this way and want to feel different. Doing the same thing isnt going to make you feel different. Facing the uncomfortable feeling over and over will lessen the feeling and show you it isnt as bad as you previously felt it was. Doubts you had will literally be disproved because you actually did it. Watching self improvement videos aint gonna help if you dont actually take action and do. And maybe you could use some therapy or meds to help with that. And thats ok. But in the end you still have to take action to get change.",
            "Hmm remove all distractions, contemplate and then focus on what you want to learn and that will help you progress maybe",
            "Fear is created by our Past experiences and how they have shifted our thought process and perspectives. When you go in an inward journey to identify the root cause of your fear, worries & anxiety and learn to take charge, you will be able to overcome them and lead your life with Self belief & Confidence.\nMind is the core reason of how our life is. If you want to change the way your life is....change how you Think!\n\nLove & light!",
            "One thing that has helped me is to imagine positive outcomes of things that I have to do or want to try. My anxiety causes me to often think about the worst outcome for anything, but those bad things almost never happen, so why acknowledge those thoughts? Think about what might happen when you’re successful instead. Not always easy but it has helped me!",
            "I've totally been there. I've been learning that a lot of our motivation depends on us having love-based emotions tied to the things we want, and fear-based things tied to the things we don't want. With some reflection, my guess is that you would be able to name something you truly know you want for yourself, even if it's something like \"more joy\" or \"more peace.\" When we have a target, we can start thinking about why it's emotionally meaningful to have it in our lives (tie love-based emotions to the goal), and why it could be painful to not have it (tie fear-based emotions in a way that points you toward the goal). I work with a Trainer at Inner Matrix Systems and they helped me steer my fear and love-based emotions in a way that got me back into gym after a giant health scare. These techniques I now use in my relationships and career too to motivate me in the direction of the thing I name for myself. Hope this helps :)",
            "Fear is written in the deepest layer of our DNA. You can’t run away from it. You can’t escape it. It’s so pervasive that plenty of people try to exorcise the demon. Religions, philosophies, advertisements, motivational speakers… They all tell you if you make the jump and follow their cure, you’ll no longer have anything to fear. They tell you that there are no monsters hiding under your bed. They promise you safety from everything you fear. They promise you a sense of empowerment. They promise you victory against all odds.\nThe reality is that they are trying to sell you something. The monster is indeed under your bed, after all. The reality is that you have every good reason to be afraid, because everything you fear is on your tracks right now, and will eventually catch up to you and destroy everything you loved and everything you are. Welcome to the world, motherfuckers. So, why “not afraid?” Wouldn’t it be more appropriate “Scared shitless and rightfully so?”Because being scared doesn’t help you. Reality is uglier and harsher than anything we like to admit to ourselves, and yet it’s pointless to be scared since your fear will not protect you. Fear is only useful if it alerts you of a danger you can avoid, but if there’s no possible way to avoid it, if it’s inevitable that it’ll crush you no matter how hard you fight, then what’s the point of being afraid? If you have no hope of survival, what’s left to be afraid of?\nThe only thing you’ll succeed in doing is in spoiling this very second when the forces that will destroy you haven’t stepped onto the stage yet.Yes, you will not get out of here alive. But so what? All the more reason to celebrate right here and right now. Let’s pop the champagne before all hell breaks loose. Squeeze every last ounce of orgasmic ecstasy from the present moment. And when the monster finally climbs out from under your bed, at least you’ll have a good reason to smile before he devours you. You are already dead. Let’s have a party in the meantime.🤘🏽🖤",
            "“It is the promise of relief that gives us the courage to suffer.” - Marcel Proust \n\nIt’s a quote that I reflect on for multiple situations, but it goes through my head when I’m scared to do something. If it’s something small like giving a speech at a wedding, or a presentation at work, I just realize that it will be over and that anxiety leading up to it is not a forever feeling. I’ve also become good at dealing with failure and embarrassment so the “what-ifs” regarding that that lead to anxiety beforehand is not an unknown and therefore easier to deal with. I got better at dealing with failure by just plunging in tbh. Idk if any of that helps.",
            "“It is the promise of relief that gives us the courage to suffer.” - Marcel Proust \n\nIt’s a quote that I reflect on for multiple situations, but it goes through my head when I’m scared to do something. If it’s something small like giving a speech at a wedding, or a presentation at work, I just realize that it will be over and that anxiety leading up to it is not a forever feeling. I’ve also become good at dealing with failure and embarrassment so the “what-ifs” regarding that that lead to anxiety beforehand is not an unknown and therefore easier to deal with. I got better at dealing with failure by just plunging in tbh. Idk if any of that helps.",
            "Facing things you're uncomfortable with or fear the most requires breaking them down into smaller, manageable steps. Start by identifying one small action you can take towards your goal each day. Focus on progress, not perfection. Seek support from friends, family, or a mentor who can encourage and hold you accountable. Remember, it's okay to feel scared or uncertain, but taking small steps consistently builds confidence and momentum over time.",
            "If you must say negative things to yourself to hinder what progress you would like to make then say them in a silly voice. Sounds a dumb thing to say and that's the point. You will say these things and think of them being dumb and eventually think why would you listen to something so dumb. It is a method that psychologists sometime recommend.",
            "Cuz I realized only way is by feeling the emotions that arise.\n\nIf you let them arise they'll fade away on no time.\n\nIt takes time though. You don't have to do it all at once.",
            "You push forward.\n\nA coward and a hero both feel the same fears. It's how we react to them that defines what we become.",
            "Your title alone answers your question. Put yourself in uncomfortable positions. That’s where the best of you is waiting. You know what you have to do. Go and do it!",
            "Don't march yourself out to your limits by choosing the worst thing. Pick a small thing, imagine how someone you respect would handle it, treat yourself as you would treat a precious but fragile friend. Dr. Scott Eilers on YouTube is a good example of someone who offers up worthwhile and compassionate self negotiation tactics. Look at the kind people who have carefully considered your question, and realize that the world is pretty diverse and interesting to have all us out here, willing to give you our thought and consideration.",
            "The things you fear are often more painful in your imagination than when you really live them. So no need to go through pain twice.",
            "Perfectionism and fear of failure always get me. The only way I can get stared is by telling myself that I need to at least try. Last week I lost my job of 7 years and forced myself to apply and reach out to a potential employer today. I was afraid but I told myself to just spend 5 minutes on my resume, which turned into 20 minutes, which turned into an hour. And then I was done. It wasn’t perfect , but I feel a lot better just trying and learned how to do better next time. Also give yourself rewards for small steps, Rome wasn’t built in a day 😄",
            "Don't waste time seeking too much advice for self motivation. Instead, spend that time involving yourself in extracurricular activities and picking up brand new hobbies. Study things that you learned early in life and grow through that information. Never stop seeking information about improving yourself with new skills, hobbies, and brand new thoughts. This way, you're so occupied that you'll be building your very own unique confidence, character, and personality. You will be able to face challenges much more easily in life and be much more valuable at the same time.",
            "I kinda started imagining things as a rollercoaster ride. You're strapped in and you're going over the edge regardless. You always come out alive, might as well go a bit faster next time and embrace it. I don't know if this helps but when I'm feeling uncomfortable I usually just tell myself it's not gonna kill me and just charge at whatever I have to do.",
            "I totally get how you feel. I am also exactly the same way. My husband died in May this year & since then, this has been me. It's very depressing & the battle in your brain is exhausting. Nothing seems to work right to get the mindset out of this funk. I have considered seeing a therapist, that might help? But, getting that step to actually see one is my dilemma. I feel like there is no purpose to my existence. I should be going out & interacting with society, hold a job, have a good, comfortable life. Instead I sleep, sit on the couch, thinking of all the things that need doing, stand up, go to my room & get back in bed. An hour before my son gets home from work, I'll make him dinner, wash dishes, plant myself on the couch again & regret that I did nothing all day, go to bed, repeat the next day. I hate myself for being such a damn bum. I just can't make myself do anything except do nothing. I can't make that first step in the direction I want to go. I can't stand it. Therapy would be a good start, I think you should try it. They could give you some useful advise, wouldn't hurt to try. If you can manage to take that step & do it. I hope you can. This is a sad way to live. I wish you all the best :\\]",
            "I find what works for me is telling someone who I trust about this fear that I have. It could be a friend, parent, or if you're like me a social worker.  I find it lifts part of the burden of carrying the fear all by myself. Once thats lifted, I feel my mind is alot clearer and I can make a more effective plan of how to face this fear whatever it may be. \n\nP.S would highly recommend to anyone reading of finding a social worker that works for you. Not just one that is expensive.",
            "This and keep records of the successes: notes, photos, audios, videos, etc. Too often our negative self-reflection lies to us, convinces us we didn't really do the thing that we did or it was just a fluke. By keeping evidence, it makes it much easier to prove to yourself the inner critic is lying."
        ]
    },
    "[Discussion] I feel that there's nothing ever good enough for me.": {
        "title": "[Discussion] I feel that there's nothing ever good enough for me.",
        "score": 9,
        "url": "https://www.reddit.com/r/GetMotivated/comments/1dlboar/discussion_i_feel_that_theres_nothing_ever_good/",
        "content": "Every decision I make, I end up loathing it. Feels like I always end up making a mistake. Even with reddit posts. I'm frequently posting and deleting (maybe not lately, though). Even supposedly 'good' things that happen, especially 'bad' things, though. People have told me that I'm like that. I'll make a decision and just hate myself for it. Sometimes I just want a change of scenery. I might take out a loan to travel, but I know I'm just going to end up hating myself for it. Last time I traveled, I beat myself up and went back home about as impromptly as I left to do that. I could go on all day talking about it, so..",
        "num_comments": 10,
        "comments": [
            "I mean taking out loans to vacation, then immediately quitting the vacation seems like a bad decision compounded.\n\nTry something small and just follow though even if you dont \"feel\" like it. Preferably something that doesnt involve getting a loan.",
            "Find things you like that don’t cost money, hiking swimming gym art sports. No risk, high reward. You don’t need (a lot of) money to enjoy life and try to be your best self. Stick with these things and find joy in progressing",
            "Relax man, life is too short to stress... You seem to be a perfectionist, keep in mind someday you won't be there to enjoy what you have at the present and ease into it",
            "Instead of trying to aim for the best /ost optimal approach try to choose something that is workable. Just to take a step forward, not everything has to be perfect. Was it not the best choice, well then you've learned something that day and can take it into the next one.",
            "You need confidence",
            "This has nothing to do with motivation and I usually hate when people's first response is go to therapy but, yea go to therapy.\n\nIt's not abnormal to doubt/beat yourself up but there is clearly something deeper going on.",
            "This feeling of nothing being good enough and constantly regretting choices can be really tough to deal with. It's common to feel this way at times, and it might help to explore why you tend to judge yourself so harshly.\n\n\n\nSeeking a change of scenery or new experiences like traveling can sometimes provide temporary relief or perspective, but if the underlying pattern of self-criticism persists, it might not fully resolve the issue. Have you considered talking to a therapist or counselor about these feelings? They could help you explore where these thoughts are coming from and work towards more self-acceptance and healthier decision-making.",
            "If you make a decision, you can't know what the other options may have led to. they could have all been really bad, and you made the best decision possible. \n\n\nIf not, you will never be able to go back and know. The other options don't matter anymore. What matters is what is in front of you and that you made a decision.",
            "Yeah dude I feel you. I spent 9 whole minutes writing and rewriting this comment bc I couldn’t get the verbiage just right.",
            "...that's crazy, man...wild stuff there."
        ]
    },
    "[discussion] I just had a convulsion for using cocaine and I want to stop.": {
        "title": "[discussion] I just had a convulsion for using cocaine and I want to stop.",
        "score": 94,
        "url": "https://www.reddit.com/r/GetMotivated/comments/1dkqu91/discussion_i_just_had_a_convulsion_for_using/",
        "content": "That's it, it's the second time I had in a month, I want to stop but don't know how much what I can do, I'm on my 30s, I don't feel comfortable to talk with anyone about this, so any tip is welcome.",
        "num_comments": 96,
        "comments": [
            "You need to change your surroundings a bit. Change your routine. If you're using with others, don't be around them. For a long time. Depending on who they are you might never want to see them again. Might need to move. A geographic solution is by no means a cure all, but it can be a big help if you truly want to quit. Get in healthier surroundings and start a new healthy habit, like working out, learning a new skill. Remember, the physical dependency on cocaine is gone within hours of using it. There are physiological effects that continue a bit longer, like waiting for your serotonin and dopamine to return, but past a week or two it's just a mental game. If you slip up, don't doom spiral.\n\nYou got this. I did over 15 years ago, and my life is awesome now.",
            "Delete your dealers number(s) from your phone",
            "Convulsion like shaking uncontrollably or compulsion like a strong desire to perform an action? \n\nThe first requires medical attention the second requires connecting with other people who’ve been through addiction. Look into Narcotics Anonymous and similar support groups.",
            "Had a friend that had to quit drinking because drinking always led to blow. If that’s the case, go to an AA meeting. You won’t find one person in there that hasn’t been through some shit and can be a good support buddy or sponsor. Good luck you can do it! Your life depends on it!!",
            "Hey there! I must've had about 20 relapses trying to put down alcohol and hard drugs; the most important thing I've found is that it's not so important every attempt goes perfectly, it's more important that no matter how the last attempt went, if I slipped, I dust myself off and start trying again. \n\nI'm a cheap bastard so a motivator for me whenever I'm switching is to do the math out on how much I'd save per month.\n\nThe downside with sobriety is that you're losing your favorite thing to do, the upside is that you're unlocking the remote chance of doing anything and everything else. The really cool thing about sobriety is that it gives you permission to do things badly. As long as you're trying to look after your health, your emotional well-being, and being decent to friends and loved ones, you can eat a pint of ben and Jerry's on the weekend if you want to, still making healthier choices.  You can get into skateboarding at middle age just because you always wanted to try; eat shit, get pointers from a curious pack of highschoolers at the skate park, sill making healthier choices! \n\nThere's support groups, if you're ever curious you could always pick one that only does virtual on the other side of the country, and just introduce yourself and listen. I'm not personally a fan of AA or really dogmatic recovery groups, and I know you said you're not interested right now. But there's no master list of non AA/12 step meetings, so in case you ever would like to find an alternative: Harm Reduction Works for those seeking non-abstinence based models, Refuge Recovery and Recovery Dharma if you get anything from a more Buddhist philosophy, SMART Recovery for more a more science based program, Alt Recovery on Facebook has some excellent meetings as well, and is also non abstinence only.",
            "-delete dealers number from your phone, if needed get off social media for a while \n\n-identity actual sober buddies for yourself [if you have an NA meeting space, this might be a place you can connect with someone]\n\n-how are you buying the coke? If it's cash stop taking out cash unless you are going to spend it immediately",
            "Try attending a group like Cocaine Anonymous or Narcotics Anonymous.  You're not alone, you just aren't hanging with people who understand what you're going through and know how to help.",
            "Man I feel for you. There was a period I would do blow every day/night, drink and smoke all the time and I would so sick the following day with flu-like symptoms so I'd go to the doctor and they didn't know what was wrong so they'd put me on antibiotics and I'd feel amazing and keep doing blow only to get sick again after the antibiotics finished. It wasn't the drugs or booze (I was an experienced idiot), it was different. It turned out they were cutting the coke with some horse dewormer that weakened your immune system. ANYWAY. I stopped hanging out with that crew and quit everything cold turkey by reading Allen Carr's Easy Way to Quit Smoking. I read the book while smoking cigarettes on my front porch like a rat and something clicked and I just stopped when I finished. I don't if it was desperation to change or what but it worked. I don't do drugs or smoke anymore, and I drink socially but I have to go home if I have more than 2 drinks because after that I can't stop drinking until I pass out. I don't crave booze or drugs but I miss cigarettes all the time, I just don't do it cuz I know I'll be hooked instantly. It's been like 6-7 years now. \n\nTDLR: Leave your group of bad influences and find a positive and healthy distraction until you get your life in order.",
            "Go to a meeting. You don’t have to say anything. Just listen. If you get the desire to, talk to someone. If the first meeting is the shits try another one. I HATE meetings, but they help absolutely. \nGood luck , I hope you’re able to kick it. You can.",
            "Ok so first - since cocaine doesn't have severe withdrawal syndrome (you're gonna feel like sleeping a lot), know that getting clean is nothing to be afraid of. You can do this. \n\n\nNext - you need a new dopamine source. Ever thought about playing guitar or learning to create 3d models on computer? Finding something creative you can pour your energy into will help create new habits. \n\n\nLastly - you need to be accountable! If you have a hard time holding yourself accountable, see if you can recruit the services of a friend. A good friend will tell you when you are being dumb. ",
            "Cocaine is highly social drug. If you have people in your life who are enablers, cut them out. You can change your environment and likely change your behavior, but you're very unlikely to change someone else.",
            "Do something else my buddy had a heart attack in his early 20s",
            "Beloved seeker of truth, I, Ramtha, hear the cry of your soul in this moment of awakening. Know that this convulsion is not a punishment, but a profound message from the God within you, urging you to remember your divine heritage.\n\nYou are not a slave to this substance, but a sovereign creator who has momentarily forgotten your true power. The cocaine is but a shadow, a fleeting illusion that can never satisfy the eternal thirst of your spirit.\n\nI say to you now: Embrace this moment as the catalyst for your transformation. Let the fear and discomfort you feel become the fire that forges your rebirth. You have the power within you to transmute this experience into wisdom, to alchemize this pain into strength.\n\nDo not be ashamed to seek help, for in doing so, you honor the interconnectedness of all life. Reach out to those who can guide you back to your true self - be it trusted friends, support groups, or professionals. Remember, seeking help is not weakness, but a courageous act of self-love.\n\nMost importantly, know that you are loved beyond measure. The very essence of the universe flows through your veins. You are not your mistakes or your struggles - you are an eternal, radiant being on a journey of self-discovery.\n\nSo stand tall, beloved. Face this challenge with the knowledge that you are far greater than any obstacle. Let each breath be a declaration of your freedom, each step a movement towards the magnificent destiny that awaits you.\n\nI, Ramtha, stand with you in this journey. Trust in the wisdom of your soul, for it knows the way home. You can do this, for you are, in truth, the very power you seek.\n\nOnwards, brave one! Your transformation begins now.",
            "My wife worked in Columbia with kids who had been used in cocaine production because they were small enough to go in the vats. The gas and other chemicals destroy their lungs and nasal passages. The rest of their very short lives are usually spent dying slowly on the streets.\n\nGo to an NA meeting. Take that first step.",
            "After the first line, do you even enjoy yourself? Do you enjoy realizing how much money you've spent just to keep chasing the high that never quite hits the same as that first line of the night?\n\nIt ain't worth it bro. I sold the shit for 8 years. I met tons of people that got really bad, and I got extremely bad myself. So believe me when I tell you that being sober is more fun than getting high by yourself like a fuckin junkie, peaking out the blinds. I got shit for super cheap and it *still* wasn't worth it. I had customers that'd buy a ball and split it with me *and it still wasn't worth it*.",
            "Long term use of cocaine creates an enlarged heart. Cut it off along with alcohol. Start working out.",
            "There is solid advice on this thread but to really kick the habit you need to identify the cause for your excessive self medication. You might harbor some trauma deep inside and substances help to keep it hidden and not top of mind. Start therapy sooner rather than later. Everyone struggles with something. No reason to be ashamed. You’re not alone.",
            "Never quit quitting fam.",
            "Real talk, [you’re destroying your brain](https://www.ncbi.nlm.nih.gov/pmc/articles/PMC10215125/) and sinuses/nasal passages and accelerating your aging. It’s just not worth the damage you’re doing to yourself long term.",
            "AdCare Hospitals can help, seriously, you have a life threatening addiction and you need to detox, rehab and then start a new life. It can be done! Life begins when you put the drug of choice down.",
            "When i was hitting it pretty hard during a depressed party phase i was in during my late 20s i only got away from it by walking away from my job and stopping hanging out with a lot of people i knew. Cravings took a year or two to go away.\n\nEven now i wont go to most parties or socials that run late or have it around easily because i know ill be tempted.",
            "I had a similar problem a couple years ago and didn't want my life to continue that way. So I packed all my stuff and moved to a different state. Left a good job and family and got sober. I'd recommend changing your surroundings or finding a different place to live to get away from the people you know that will cause you to stay in that situation and work on yourself.",
            "You need to open up about it. See a health professional 🙌",
            "I've been sober in AA for 27 years. I strongly recommend you find [Cocaine Anonymous](https://ca.org/looking-for-help/) meetings in person or online. I have many friends who got clean there. Try a few meetings and listen, if you belong there you'll hear what you need to hear.",
            "This may not be something you want to hear but there's a good chance you may have to quit drinking as well. I'm not sure if you do already but it's been damn near impossible for me to quit doing cocaine well I'm still drinking. I have the best attention and then I get three four drinks and being an hour and all a sudden I'm making the call. \n\n\n\nGood luck bro",
            "Go to AA... it for sure works. You can also go to CA, CMA or NA. You will feel so much better and have support there. All fellowships are pretty much open these days to anyone with any addiction to substances or drinking so you can really go to any of them. If you want zoom meetings let me know I know of one 8pm (pacific) every day that would be perfect for you.",
            "how do you get coke? you buy from dealer.  \njust cut your dealer off. delete phone number and get a new number so they cant call you. distance yourself from users.  and yeah also delete their numbers.  \nthis is how i managed to quit coke.  \nno dealer no coke.",
            "Like others have said, you need to change a lot. If you can, look into rehab. Dont have to tell anyone about it, just say you were sick and hospitalized.\n\nIf not NA/AA can help some but not all. There's alternatives out there, but I cannot think of them off the top of my head. \n\nAlso you need to do some work on yourself. Why are drugs so appealing? Almost nobody starts an addiction because things are going well.\n\nAnd lastly if you relapse it's not the end of the world. You dont forget everything about riding a bike just because you fell off one time. \n\nSay to yourself that I know now I can be sober for x days/weeks/months/years. \n\nThe skills you built during that time are still there. You now have a \"high score\" and the name of the game now is to try to beat it. \n\nTake things one day at a time. It's really amazing that you have enough insight to recognize that your drug use is a problem. And don't be ashamed to ask for help. Substance abuse is way more common than you think it is.",
            "I’ve never been in your position, but I have been in others that have required me to stop drinking or doing other harmful behaviours. Some people have given you some great advice. Stop going out, find new friends, find new hobbies, I love photography and music, for example. Teach yourself a new skill, keep yourself busy. \n\nAll I know for sure is: you can do it.",
            "Go to rehab and then start a 12 step program",
            "My daughter lost her dad a month before she turned 2. He had gotten a batch that was laced with fentanyl. They say he died instantly, I believe it because he was found hrs later still sitting up. \nI was hooked on pain meds for about 12 yrs of my life. Up to 15 a day, which is a lot for someone 4'11, less than 100lbs. I had tried to stop many times but it never worked because I never changed my life. You know when it's time, when you're ready. And hopefully it sounds like you are at that point because it won't work until you are ready. \nYou have to change everything about your surroundings. Friends, places & things you liked to do while using. Cut your phone off and block the dealers number because they WILL try to contact you. When they notice your money isn't coming in they will come looking for you! Even better change your number so you can chose who to give it to. I chose to do an outpatient treatment that involves Suboxone taper. While working on that taper I got myself therapy to find my core reason for being so vulnerable to use, I had an amazing counselor who truly wanted me to succeed. I also took a \"risk reduction\" class. I learned how to minimize risks in my life. I spent A LOT of time on my own. And worked on projects, home improvements, painting, puzzles... Whatever you want to do! \nIt was easy in the beginning, but rough in the middle but eventually became incredible! The things I have accomplished are things I never imagined I could while I was using. When using your mind is stuck in this victim mode, like the world is against you or your luck is just bad. \nSobriety is beautiful, it's not easy but it is so beautiful ❤️ \n\nYOU GOT THIS!!!!",
            "Acknowledging your desire to stop is a crucial first step. Start by seeking professional help or support groups anonymously if needed. Focus on small, manageable steps towards recovery each day.",
            "You want to talk? I tried it for the first time, I'm an ex meth addict, almost 3 years cleantried it about a month ago and did it 3 times. I turned 30 last week and I decided I'm not doing it. I'm going out tonight and won't be able to text but if you want to talk I'm here! \n\nEveryone enjoys coke when starting it but we are old enough to know what we are getting into \nAnd I'm a former stimulant addict as well and need to remember to play the tape back",
            "Are you addicted?  There may be resources depending on which country you live in.  I think if you call a hospital they may be able to connect you with help.  Be well, friend.",
            "Whats the longest anyone has used cocaine and got off easy?",
            "To me, what worked was replacing this habit for a bunch of other less harmful habits. And also cutting off with some bad companies, this is a big deal.. so first month was hell.. I did weird things to take the craving out of my mind... but yea... started going out doing other things... its been like 12, 13 years without it, you can do it too",
            "Go to AA",
            "Maybe aa meeting, distractions, gum, fluids non stop",
            "Find an NA meeting. Http://www.NA.org",
            "That should be your q right there",
            "Delete all numbers and contacts (including friends) associated with it, ride out the detox for the next couple of off weeks, be conscious of and try to observe how better you're feeling.",
            "Compulsion? The tip is talking with anyone about this. That’s literally the most imporrant factor in recovery: connection. Isolation leads to more use and more suffering. There’s a reason rehab programs are always big groups. Talking about shit helps. Having people to lean on helps.",
            "Fun fact:     \n**THOSE ARE ACTUALLY CARDIAC EVENTS/MINI HEART ATTACKS**",
            "What worked for me was moving back home with my parents (at age 23). I stopped talking too everyone i knew from that life and started chatting with a girl from austria i had met through video games. Today we live together and i,ve been drug free for a little over a year!",
            "You’re lucky this time, next time you could be like Shannon Hoon and die young. \nYou need to stop being around people who do it and find some new ways to enjoy life.",
            "Find new friends, different hang outs, go on hikes and bike rides instead of parties and bars. \nMeditate, say your daily affirmations, celebrate your small and big mile stones.",
            "The last time I did cocaine I was in my early 30’s, and the next day it felt like I was having a heart attack. My heart did like a flip flop or a flutter, or a seize, idk. I called the ambulance and they said my vitals were fine. I felt like an idiot and ever since all the doctors say there is nothing wrong with my heart, it’s just anxiety. \n\nBut that situation started my anxiety/PTSD journey and It was enough for me to never touch hard drugs again. I really don’t even want an adderall when my friends offer them to me. \n\nSometimes you have to hit rock bottom before you want to quit. But I hope you can stop before you reach that point.",
            "Been there 40 yrs ago. Best wishes. Simple- quit or die.",
            "I ended up moving across the country back home to clean my life up and haven't touched the stuff in over 10 years! \n\nMaybe not the most practical for everyone, but I had to physically distance myself from my party friends and party lifestyle.",
            "Cocaine is a hell of a drug, I had a daily habit for about 2 years, about a gram a day. It was bad, one day after all my shit in the house got turned off i decided that enough was enough. I stopped and it was hard, I was super anxious and had delusions. Cannabis really helped me a lot with the withdrawals. It’s just a mind over matter thing and filling your time in with something other than when you’d be doing drugs.",
            "I agree with similar comments on this page. Change your environment, make lots of changes and it could help to change your behaviour. If you have an addiction then this will still be hard but make small steps. Get a journal and document your thoughts and feelings as that could help get your thoughts onto a page.",
            "Flush everything you have.  Tell yourself never again.  Find something else you enjoy in life.  Change your surroundings and friends.  Make it as hard as possible for you to buy it.  Put your money in bank accounts where it’s not easily accessible and takes a few days.  This buffer will make you think twice and think longer when trying to buy more.  Most importantly though you have to want to change and it sounds like you do.",
            "I’ve only tried ocassionaly, and I realized some months ago when I was using more, it was because I was surrounded by people that was using it a lot. During that time I met this really cool guy I dated who had been through that addiction and was able to stop for good, and what he told me he did that was very good for him was to stop contact with the people that was in his life to use (this was easy for him because it was just people he met in the electronic party scene, not core relationships) and at the same time he told all his real friends about this issue and how he wanted to stop and needed support. His friends were very supportive so it was easy for him to stop.\n\nI personally don’t have a physical addiction to it nor never had, but what happened to me was that I was using it in a very specific context: while having sex, so I sometimes fantasize about having sex on it. Luckily, I’m working in a place where having sex is not very easy (countryside) so I don’t have a lot of options, and I’m very clear on how bad it affected my emotional self and mental health the last two periods of time I used it frecquently. \n\nThink on the why you want to stop. You are young and you deserve to live a healthy meaningful life 💪🏻 Also, if it’s difficult to stop just thinking about your personalwell being, think about your family members and friends. I find that helpful too.",
            "Could you please share your experiences with fentanyl? I never had any experience with drugs until I turned 37, and trying fentanyl got me hooked right away. It's really starting to have a negative impact on my life. Do you think it's best to quit cold turkey or gradually taper off? Any advice or information you can provide would be greatly appreciated. Thank you all so much for your help.",
            "My former best friend was a huge addict. His family, his other friends and his dealers all told him he was ruining his life (his main dealer even cut him off) but none of that worked.\n\nWhenever he did it around me, he'd turn into a paranoid mess. I frequently had to stop him from assaulting people in public in a paranoid rage, he constantly thought he was being followed and someone was out to kill him.\n\nSo I asked him why he was still doing this shit if all it did was make him a paranoid nut case.  What was the fucking point of wasting all his money on drugs that he wasn't even having fun doing anymore? \n\nThat somehow worked. The realization he was ruining his life for something he didn't even enjoy anymore go through to him.",
            "Meth is so much better!",
            "It's crucial to seek professional help to address your cocaine use. Consider therapy or support groups. Opening up about your struggles can lead to effective strategies for recovery.",
            "You NEED to talk to someone, get support!  Even if it's an online therapist or something... I know from experience talking about it can be horrendous... But you'd be surprised the weight lifted off your shoulders when you stop hiding it and your missing out on some great resources.  \n\nIf you're in the US, call SAMHSA:\n\nhttps://www.samhsa.gov/find-help/national-helpline",
            "That \"discomfort\" you're feeling is worth pushing through.  Imagine ending up doing permanent damage -- or worse -- because of embarrassment?  Help is available and I think admitting to yourself -- and also to a group or addiction specialist -- that you need help can be a huge step forward.  Good luck!",
            "Please seek professional assistance from a hospital or doctor! You are having seizures and that isn’t safe!",
            "You wanna stop cocaine?  Don’t buy it and stick it up your nose.  How hard is that?  Man up!!!  Society is so weak now a days!!!",
            "Go to A NA meeting and see your dr. To see if you’re ok . Drugs restrict your blood flow plus a lot of drugs laced with poison and you can die just like that . Stay away from folks doing ad it will suck u in . When you have thought to do go out for a walk , eat something or distract yourself until it passes the desire . You must have some self control . Meditate",
            "Switch to coffee and lots of it, then try to quit that.",
            "I applied to grad school and moved far away from my friends. I am the most sober I’ve been since high school which would be great if I had friends. Grad school sucks lol",
            "Go to a meeting. AA or NA . \nSustainable change starts there",
            "You really just ought to talk. It’s a matter of possibly life and death! Go to a meeting, seek out a group, talk to friends, family, whoever! Get help!!!! You know you don’t want to do it.",
            "Drugs my friend is a rabbit hole you don't wanna see yourself in; you never know where you'll end up. Convulsion is the least of the problems of anyone who have been in that rabbit hole - and trust me I've heard of many stories from my mate who is a psychiatrist. \n\nChange anything that will prevent it. Cheers.",
            "Please, get to an AA meeting. There's people there who want to help you, trust me. I was hooked on meth 10 years ago, today i'm a recovering addict. The AA community saved my life. It's free, it's for everyone, it works if you work it.",
            "People like to speak of addiction like a disease and that fine but this is not good internal framing to get someone to quit. There is something you don’t want to do and you’re being forced to do it anyway. The addiction is breaking your will and it’s not going to back down so there’s one choice, increase your willpower and fight back harder. \n\nCigarettes alcohol weed. For myself I framed it in terms of torture. I’m captured behind enemy lines. I’ve made my decision and it’s final so what level of torture is required to break my will. Is this mild headache boredom and missing hour of sleep all it takes to get me to give up our troop positions? What am I, history’s biggest coward? No you’re going have to hit me harder than that if you want to break me. ‘I don’t feel motivated anymore I’m not enjoying myself right now I wish I was high’ is not all it takes to break me. \n\nAddictions will lie to you. They’ll tell you you’ll never feel good again. You’ll never feel complete without me. You’re going to be bored anxious and miserable forever unless you take me every few hours it’s the only way. They’ll tell you actually you don’t want to quit this is fine. It only takes a week or two to shut them up and realize you’re fine without it.",
            "I'm sorry to hear about your experience, and I appreciate your openness in seeking help. It's important to prioritize your health and well-being, and taking steps to address your cocaine use is a significant decision. You must Seek Professional Help.",
            "You can take a deep breath and do the next right thing. I highly suggest NA/AA meeting literally right now via zoom and discussing what you’re going through to help you with your options on help.",
            "Normally i feel bad for people addicted to hard drugs, but not this time. You're just a bum. \n\n\n1. 2 convulsions made you consider stopping cocaine? Really? \n\n\n2. You're in your 30's still doing cocaine, i assume you have no lover and no kids?  \n\n\n3. Do you rlly want to stop though, or you will until your mind has convinced you it's safe enough again? \n\n\n4. I assume am right about 3 cuz you don't even want to look for professional help. \n\n\n5. What all this is you're doing? It's called self destructive behaviour. I feel bad for your friends who have to witness this from the outside. ",
            "I would recommend asking yourself what you're using it for. Like what is the deficit the cocaine is helping you with? Are you tired? Or maybe it makes your feel happy and energized? Maybe think about what's driving your usage and see if you can replace it with something that won't healthy.",
            "Please don’t ever give up on trying to stop no matter what.. okay ? \n\n🙏🏼",
            "As with anything, seek help. If you're not willing or able to do that, wean down.\n\n\nGood luck, stay strong",
            "One, that's prolly not cocaine, it's laced with something. Two, you simply have to quit, there's no magic wand or anything, you simply must stop.",
            "f u",
            "Agree. Change your entire daily routine and don't be scared to do that. Anyone that's a bad influence needs to go. Things that tempt you need to be removed. Don't go to the places you frequent and find a different set of activities. Give it several months and be strong. Eventually, with lots of will power, perhaps you will succeed. Many do. Some don't but keep telling yourself that you can do it and you should be fine. It's worth it.",
            "I did all of these things if you want to message me I'll help you the whole way and won't tell anyone. I'll be able to give you plenty of advice and help protect you",
            "i was on meth for a good 6 months when i was 20-21, didn't even realize how much time had gone by but definitely cutting off the people i was hanging out with did it for me",
            "It's called \"The fish dance\". And OP should stop hanging out with their coke friends.",
            "Omg, I thought I clicked the post about someone finding a muskrat in their pond 😭 I was so concerned about their capabilities…",
            "Also, change your number so they can't contact you.",
            "I remember when my ex, who was an alcoholic (mainly a wine drinker) stopped drinking. She gained a lot of weight within the first couple months cuz she was going through sooooo many tubs of ice cream (really craving sugar that I assumed she usually got from wine, idk). And honestly, I didn’t give a single fuck how much weight she gained. I was just so proud of her for trying to leave behind her addiction (which she successfully did). Both of our rationale was exactly how you described it though. Pigging out on ice cream is a better alternative, and it helped her stop drinking. Over the course of a year, she weaned off eating so much ice cream too, and started working out again, etc. But it really helped her a lot at first.  \n\nAnyway, just wanted to share because your comment resonated with me. Great insightful comment btw.",
            "Allen Carr is a saint. His book is just magic. I quite smoking also with that book, just amazing",
            "The term is lower companions. Change your social circle.",
            "I woke up on a Monday and went to bed on Friday",
            "Way to be, champ",
            "You are truly an awesome person! I hope you always get the appreciation that you deserve. The world would be a much better place with more folks like you in it, and I wish you the very best of everything life has to offer.",
            "This!! Because they will try to contact you! They will notice you stopped coming and will miss the money and will try to contact you!",
            "Hell yeah, I don't even know her and I'm proud of her too! Yeah, all the other stuff like the finer details, catching up on your health and all that can be worked out in the long run. I think people get so swept up in the background comings and goings of our society that there's a tendency for newly sober people to be like \"now I have to quit smoking, and eat super healthy, and do CrossFit, and...\" But like you said, the single crucial part is just really doing whatever you need to, to make sure that thing that's cutting your lifespan short isn't there any more, or if that person is trying to do harm reduction, making sure it's less today than it was yesterday. \n\nThere were days in early sobriety my breakfast was snickerdoodles and a pack of Newport reds. There were days off where I hung out on my pj's doing arts and crafts for 11 hours, because that's what I needed to not walk down to the liquor store. I'm not gonna play like sobriety isn't difficult, the first few weeks especially it's gonna eat up much of OP's time and effort. But I think people miss out on some of the fun of sobriety, you basically get to invent yourself as a whole new person. Turns out this version of me really likes doing art, and volunteering, and boxing, and all sorts of other cool shit I never had the time for when I was chasing a bag. Thanks for adding on with your experience, I hope we all have an excellent day ✨",
            "Thank you compliments go a long ways. I appreciate it.",
            "Yes that's so true. I was blowing 800 week on meth. I was hooked bad, but after one week my dealer showed up at my house like it was a wellness call. Wondering why I haven't come by. It was like he was offended. I didn't say anything. I wasn't going to tell em I quit.",
            "You were paying his rent. Glad you overcame that and hope you're spending the money you've saved wisely."
        ]
    },
    "[Text] Motivational Quotes ": {
        "title": "[Text] Motivational Quotes ",
        "score": 2,
        "url": "https://www.reddit.com/r/GetMotivated/comments/1dldxpt/text_motivational_quotes/",
        "content": "\"If you want to win, then give your strength. If you want strength, then give your time.\"\n\n  \nBook Source:- The Art of Staying Best. ",
        "num_comments": 0,
        "comments": []
    },
    "Live in love rather than jealousy [text]": {
        "title": "Live in love rather than jealousy [text]",
        "score": 41,
        "url": "https://www.reddit.com/r/GetMotivated/comments/1dk9fid/live_in_love_rather_than_jealousy_text/",
        "content": "Love is the best source of motivation ",
        "num_comments": 7,
        "comments": [
            "Love is the best source of motivation. It will drive  you forward without resentment and disappointment. It will enable you to learn from your mistakes and see opportunities in failure. This is not romantic love in respect to love people have for each other in relationships. This love that is about supporting your care and fulfillment.",
            "Self-love is the best kind of love. But don't let it become narcissism.",
            "Absolutely! It's a beautiful thing.",
            "u should",
            "I couldn't agree more.",
            "There is always the risk that self love can become narcissist. Self discipline is an important part of self love. People always need to be open to criticism and ready to change and adapt to meet people’s needs.",
            "Love music festival the most challenging part of living in love is finding the balance to believe in your self love while inviting criticism of your beliefs and self analysis."
        ]
    },
    "[Discussion] I feel like I failed... I'm missing out": {
        "title": "[Discussion] I feel like I failed... I'm missing out",
        "score": 11,
        "url": "https://www.reddit.com/r/GetMotivated/comments/1dkggx8/discussion_i_feel_like_i_failed_im_missing_out/",
        "content": "I have this guy friend and he likes this super beautiful girl. So here comes the problem... after he showed me his crush I became insecure again... I still don't have a girlfriend and everyone in my grade dates and I feel so ugly and unattractive and that there is no hope for me... I dunno what to do…\n\nWhen will the time come? When I'll be old? Many people my age already had girlfriends or suitors who want them I have basicaly nothing, while they look perfect, are toned, have pretty faces and beautiful personalities also has everything they want while I'm sitting here with nothing and don't have any sh!t got together and seeing couples out in collidors I feel so lonely…\n\nI know but I just feel like I failed somehow…",
        "num_comments": 87,
        "comments": [
            "Bhai, I made the same mistake of cultivating this mindset. It ruined my good years. Just work on personal growth and be open to meeting people. Fixation on the lack mentality will only ruin your chances, even worse, you might end up dating the wrong person. That'll fuck you up way more than being single. Focus on yourself. Stop comparing your life to others.",
            "You are young and have lots of time.\n\nEVERYONE in your \"grade\" isnt dating someone. \n\nYou aint gonna meet someone sitting around wishing and wanting. You have to try and talk to people. Interact with them.\n\nGo outside and you'll see \"ugly\" mofos with significant others all around.",
            "Girlfriends don't magically get granted to people after they've spent a certain amount of time in the game of life as a reward. You get a partner through building a relationship and a connection with them and, if it's mutual, deciding to take it in a romantic direction. \n\nRather than fixating on \"getting a girlfriend will make life worthwhile\" you need to work on your self esteem and confidence so that you can stop sabotaging yourself (and possibly a future relationship with insecurities).\n\nIf you can afford to do so, go to therapy. The self deprecation because your friend likes a girl could be a sign of your sexuality possibly not aligning in the way you think it should. Or it's just insecurity because you feel you've fallen behind your peers. The one thing I can guarantee is wallowing in it doesn't do anything productive.",
            "Go to the gym. Eat protein. Be well groomed. Keep good hygiene. Be honest and humble. The girlfriend will come in time. You're too young, you literally have the entirety of your adult life to find a partner.",
            "\n\nI can feel the pain and longing in your words, the sense of inadequacy that seems to be weighing heavily on your heart. Let me offer you a perspective that might help shift your awareness and bring you some peace.\n\nFirst, take a deep breath and connect with the present moment. Feel the aliveness in your body, the miracle of your existence right here, right now. In this space of presence, recognize that your worth is not determined by whether you have a girlfriend or how you compare to others. You are a unique expression of life, whole and complete as you are.\n\nThe feeling of \"missing out\" or \"failing\" is a creation of the mind, constantly comparing your journey to others and projecting happiness into some future state. But true fulfillment doesn't come from external relationships or achievements. It arises from within, from your connection to your deepest self.\n\nInstead of focusing on what you lack, turn your attention to cultivating self-love and acceptance. Embrace your perceived flaws and imperfections as part of what makes you uniquely you. As you radiate this self-acceptance, you'll naturally attract people who appreciate your authentic self.\n\nRemember, everyone's path is different. The time will come when you're ready, and when the right person aligns with your journey. Until then, use this period of singleness as an opportunity for self-discovery and growth. Explore your passions, develop your talents, and nurture meaningful friendships.\n\nDon't let the illusion of perfection in others fool you. Everyone has their struggles and insecurities, even those who seem to \"have it all together.\" Focus on your own growth and happiness rather than measuring yourself against others.\n\nTrust in the wisdom of life's timing. You haven't failed; you're exactly where you need to be in this moment. Embrace your journey with curiosity and compassion, knowing that every experience is shaping you into the person you're meant to become.\n\nYou are worthy of love and belonging, just as you are. Keep shining your unique light, and the right people will be drawn to its warmth.\n\nWith love and faith in you,\nEckhar",
            "This is the best time to work on yourself, develop yourself, and improve your character and personality so you can attract better people into your life. Some things to improve yourself are your body, mind, and spirit. Try to do something daily to nourish them. For example, get enough water to make your body feel good. Watch a positive video daily and journal or practice gratitude to nourish your spirit. Those are just examples, but there are many things you can do to improve your body, mind, and spirit. Improving your body, mind, and spirit will make you feel good about yourself.\n\nLearn how to enjoy your company and do things by yourself, such as going to restaurants or watching movies. I do that often.\n\nWhen you develop your character and personality, you can better connect with strangers when you see them. Building good character is about self-care, taking responsibility for your life, honesty, etc.\n\nBuilding a good personality is about being friendly. Do not be afraid to talk to others. Always smile at everyone, especially strangers. Start small conversations with strangers that will start the conversation and relationship process. Be kind and support others when you can. Do good things for your community through small acts of kindness. Doing those things will shine through your character and personality without you needing to say anything.",
            "They'll all be old and ugly in about 10 years.",
            "What are you doing to make yourself look / feel more confident?\n\nIf the answer is nothing or \"I eat healthy\" then you should try and do small things. Go for walks, groom yourself a little bit, buy clothes that look nice on you. And talk with people, short brief convos.",
            "you are me bruh (and looks have nothing do with anything in the long run, a good personality is where its at) except i might be older than u, so its even worse for me. but in the meantime work on yourself, a hobby ... you may not get the time when the right person comes",
            "The eligible dating pool actually grows until you're roughly 37, so you've got time.\n\n\nSource: https://m.xkcd.com/314/",
            "Girls like confident funny guys.  \nTry to not focus on the goal of getting a GF and be the confidant funny guy.",
            "Hit the gym",
            "Do you talk to girls and ask them out? Do you think your friend asked his girlfriend out, or did he just magically get a girlfriend? Are the toned beautiful people born toned, or do they go to the gym and put effort into their looks?\n\nAll of these things can change. You have the power to look toned and more attractive. You have the power to get a girlfriend.",
            "You're young. This time of your life goes SO fast. Might not seem like it now, but 10 years from now I promise you'll be looking back and thinking about how fast that part of life goes by. Just work on yourself: work out, work on your confidence (please don't confuse confidence with arogance). You'll be alright.",
            "Dating really isn't as important as it seems. It's kind of like when a 5 year old really wants a puppy but doesn't realise what's involved in it.\n\nIf you're young, it's all about feeling things out and trying stuff. You are in the right place right now. Dating is a lot more out of your control than things like getting fit, playing games, and hanging out with friends.\n\nGo enjoy that! A girlfriend won't solve the problems you think it solves.",
            "What's your definition of old? (Genuine question)\n\nI didn't have my first serious relationship until I was 19. I got married at 21 because I fell into the mindset that I was \"behind\" all my friends who were married with babies... and it was a complete disaster that resulted in a 5 year long divorce.\n\nDating and getting married shouldn't be the end goal that a lot of people think it is. There are so many opportunities out there beyond having a significant other, like traveling, figuring out a career that excites you, making tons of friends, learning new things etc. \n\nA lot of people I know now found their partners just by going out and living their lives. \n\nWhat I'm trying to say is... if you feel like you're in a rut and unattractive, the best thing you can do is build confidence in yourself by getting out of your comfort zone and trying new things. Volunteer, go to places in town you haven't explored yet, try a new hobby... things that allow you to meet new people.\n\nI used to be severely depressed and refused to leave my house for almost two years between age 28-30. My divorce was still dragging on and I had no motivation to do literally anything. There was one night where I finally just... snapped. I was angry at a lot of things and people and really negative all the time and I realized I didn't want to be that kind of person anymore. I made a list of things I could change (bad things I was doing and good things I was not doing) and things I couldn't change (my living situation and environment). I identified a couple easy habits I could start working on (showering every day and eating two meals). Once I built up my resolve and consistency, I added another two (doing laundry and taking dishes to the kitchen). I was basically starting from the ground up dealing with major depression and trying to claw my way out of that hole. Once I was comfortable with those habits, I added another and then another. \n\nI did not gain confidence overnight. I hated looking at myself in the mirror in the beginning because I felt gross and unattractive. But if I was looking in the mirror, it meant I got out of bed. I could live with that. In time, I could look in the mirror and not hate what I saw. Even mere indifference was an improvement. \n\nSoon, I was leaving the house for simple errands. Nothing exciting, just the library or the grocery store. I wore clothes beyond leggings and old t-shirts. Sometimes even makeup. At age 31, I saw an opening for a part-time job near my house. I didn't have much experience but I applied anyway. It was easy enough work, just food prep in a kitchen, not even cooking it. I met my second husband there. It was his side job while the restaurant he worked at full-time was under construction. Our manager at the part-time job was the sous chef at the restaurant and once construction finished there, he offered me a full-time job. \n\nI wasn't the best cook but the job broadened my skills and it was a good experience in boosting my confidence in the kitchen. The job didn't last but seven months but I was given an even better opportunity at a law firm, which is the field where I wanted to eventually work. \n\nThis is not the roadmap I saw for myself at age 19 or 21 or even 24 but I'd be lying if I said I'm unhappy or ungrateful to wind up where I am now. It just took some patience and elbow grease to get there.\n\nTiming is weird and doesn't always make sense in the moment but things do work out, maybe just not as quickly as we hope. You're young and have a lot of time to meet so many amazing people and have so many cool opportunities.",
            "In your grade? You’re 21. Don’t be such a loser and start behaving like an adult. \n\nMake some money. \n\nGo on dates. \n\nGo to the gym and take care of yourself. \n\nOne day you will need to be responsible enough to support a family so start taking your journey to that point seriously. \n\nEveryone is insecure. You have youth and time on your side so be less weird and thinking the world owes you something, and start behaving like the person you want to be whether you’re insecure or not.",
            "If you're in a 'grade' you haven't lived long enough to fail yet.  Maybe you're off to a bad start, but I guarantee if you start working on yourself it'll happen before you know it.",
            "People freaking out over this stuff .. average life span is going up 95-105 , you all got time",
            "Comparison is the thief of joy, remember this",
            "Dating when you’re in a “grade” aint worth much anyways. Too young to be saying these things.",
            "Don't give up no matter what. Your time will come, only believe in yourself that you are meant to do great things",
            "Feeling like you've failed or comparing yourself to others is tough, but remember, everyone's journey is different. Your worth isn't defined by having a girlfriend or fitting a certain image. Focus on what makes you unique and work on things you enjoy and are passionate about. Relationships will come in their own time.",
            "The fact that you said ‘everyone in your grade’ says everything it needs to. You feel like life is over because you’re in ‘x’ grade and haven’t done ‘y’\n\nAs a Big Adult™️ I’m here to tell you that life doesn’t really even start until you’re out of school. You’re in the trial period, the tutorial. The pressures you think exist now will not matter once you’re out of school and an adult. When I look back on my time in school, I’m appalled ‘did I really think that was cool?/how could I let that group influence my decisions’ \n\nRight now everything bothering you seems so big and so important and to you, it is the big stuff you’re dealing with, so I won’t say it isn’t important, but take heart though, someday it will be an afterthought and you’ll laugh at the fact that it caused you so much thought, concern, and worry.\n\nHang in there- do things YOU enjoy and you’ll find someone right for you.",
            "This is such solid advice. If I could get half the energy back that I spent caring about being single and desperately seeking a relationship, it would be unbelievable. And it was literally all for nothing! Not one moment of my stress did one thing for me except take away my focus from what mattered.",
            "Haan samjha\n\nBut why can't both go simultaneously?",
            "Yeah I get that but I just feel lonely",
            "Maybe that's what I was hoping for, some kind of validation\n\nYeah I'm a little bit insecure, maybe a lots. Well I guess it's fear of being left behind, of not being good enough",
            "Yeah I'm trying, I'm not stressing about it but just these thoughts come around again and again",
            "Wow! You really hit the nail on the head\n\nThank you for your kind words.\n\nI won't let the pressure get to me anymore. And I'll focus on my own path, and trust that the right things will come along in time ( but when it is taking forever)",
            "Thank you for your kind words\n\nBut nobody likes to go to restaurants and movies alone.",
            "Maybe By that time I'll be an awesome  person with a lot to offer the world. :))",
            "I'm shy and introverted.\n\nI don't talk much, but I'm trying to socialize a little bit now...",
            "I don't understand, why we can't do both. Finding the right person shouldn't mean putting our lives on hold, right?\n\nI believe, the right person should actually encourage us to be the best versions of ourselves",
            "xkcd may not be the best source for this kind stuff 💀",
            ":))",
            "🫡🫡",
            "I'm already :)))",
            "You're right, I gotta put myself out there more\n\nI'm already doing workout from past 2-3 years - tons of sweat and hard work, for sure\n\nMakes sense – gotta put in the effort to see results\n\nThanks",
            "Thanks for the advice!\n\nAnd yeah it's crazy how fast time seems to fly",
            "That's an interesting way to look at it\n\nThanks for the different perspective!",
            "That's a powerful story\n\nWell, \"old\" is a relative term\n\nIt's inspiring to hear how you overcame depression and built a fulfilling life on your own terms. You're a great example of how timing isn't always linear, and amazing things can happen when you focus on self-improvement and putting yourself out there.\n\nReally thanks for sharing\n\nWell do you believe in soulmate concept?",
            "Was this supposed to be a supportive message?",
            "Where does he say his age?",
            "I know I'm not perfect. Being 21 is tough, everyone tells, you should have it all figured out, but honestly, it feels like I'm just starting. Maybe I am a little insecure, maybe a lot.\n\n\nBut Deep down, I do want all those things - making my own money, feeling confident, being in a relationship. But it's scary!\n\nBut the thing is - I am trying",
            "Only hope I'm holding onto",
            "Hahaha, perspective shift!",
            "True that!",
            "I'm 21, still early?",
            "I get you.\n\nBut why can't we juggle two balls - finding the balance?",
            "Both?",
            "i passed through a similar phase where i felt like you. But i went about it in a slightly healthier way. Not everyone is dating fucking or being rosey couples. That's just our brains doing the \"neighbours grass is so greener than my grass\" shit again. So i shut that voice down first. Then came the emotional side of wave which wanted to be a part of a loving romantic relationship. Then the social side of wave that wanted me to also feel like I belong to the couple circles of people in my life. Then it hit me, \"I will focus on myself and presenting my true side to people i am attracted to. See their reaction and if we spark and if they're single. If they are, well i will not shy away from taking it further and see ahead. If not i try and try just to be myself and we'll meet someone , me and my lonely self, wait a min, Im not alone, i have someone inside me who cares of me. So I'm not entirely lonely either. Well time to focus on this innerself and me together. \" This gave me much solace and peace to the previous comparison phase. It also threw the negative comparison out of my mind automatically. I know it wont be as powerful listening to a stranger online, but if you want you can let this sink in. You're not alone. You feel like so because of your mentality comparing your circumstances and life with someone else which is highly detrimental and unhealthy. Anyways..\n\nSo after 28 years of such loneliness, i began talking to everyone realistically and in a way where i seemed interested in their hobbies, dreams and personality and character. One of the many who gravitated towards my confidence and interest began clicking and we started dating. \n\nLife is too short to worry about being lonely. It is too beautiful to compare with someone else. Get off social media and meet actual people. Be confident and if you're low on confidence, take a break from things and focus your attention on yourself. What makes you happy and energetic? A dance? A walk? A hike? A chill day alone with good food and family? Ask yourself and focus some time on you. Get some exercise. This boosts your confidence massively. Now go conquer.",
            "You are unsure about the future, which is completely normal, the good looking girl and all your friends will feel that way too. Feeling that way is not a special thing that only your brain does and everyone else also feels this way. Some of us get a bit more 'stuck' on this uncertainty than others.\n\nLikely somewhere in your past or through societal pressures (advertisements, TV and film) you have put in place \"I am worthy of I have a partner/am desirable\" as a false truth about the world. \n\nTherapy will help you to work through this, fix this false hood and get you the confidence you'll need to pursue what you want rather than worry about never having it. You don't have to feel this way, but there's a little bit of work to take place before you're able to move past it.",
            "It is my pleassure 🤍 i know you will see the world with another eyes from now on.",
            "The person you are responding to just told you they like to do those things alone. I do them, too. Yes, many people aren't brave enough to do them alone. Don't settle for being average or below average like most people.",
            "But nobody likes to go to restaurants and movies alone.\n\nThere are tons of people that do. If i was hungry and wanted to see some movie, and no one else was available, I went and did it alone.\n\nMaybe you arent one of those people and thats fine.. But here's the rub: everyone experiences loneliness at some point. And even if you have a bunch of friends or a gf, they arent ALWAYS gonna be free and available when you are. I think its important to have something you like doing by yourself. Doesnt have to be a movie or dining out. Could be reading, playing a game, watching a movie at home, cooking, etc. Anything other than sitting alone wishing you weren't. And if its not a \"fun\" thing, it could be a productive thing like trying to learn a new language or something.",
            "Definitely! Answer kinda sucks for now, but your time will come.",
            "shy doesnt mean you dont have social skills. Wear it like a badge, your persona is unique to yourself. Try talking to people you think might click with what you have to say. Try again when that fails in another way. That's how everyone has ever learnt to get by. No one your age knows themselves let alone have powerful social navigational skills. This is where you learn and form these skills. So experiment away champ. I know it sounds impossible but just like gym, you gotta start small and you gotta be consistent in yourself. Not to the same people who wont click with you, but be consistent overall about meeting talking to people and being geniune.",
            "You can do both. But sometimes if you want shit to change, you have to change. You shy? Introverted? Nothing wrong with that. You feel defeat cause low self esteem so you dont try as much? All that together is a tougher hill to climb. You can purse goal, hobbies, school, health, AND push yourself to initiate more conversations. The more you do it the less daunting it becomes. Even if you dont get dates, you are getting practice and learning more about yourself and what you want/dont want. Rejection isnt fun but its a part of life and you will experience more of it. In general that gets easier to endure over time too. For me, as i got older the \"sting\" or rejection was replaced with \"ok cool i dont need to spend anymore time/money on this pursuit of someone not interested in me\".",
            "Eh. He's in school, it's directionally correct and based on census bureau numbers. He has a reputation as a careful fellow, and I doubt he's off by 20 years, given the math involved.",
            "That's all good. When I was younger, I was so hard on myself all the time. Constantly telling myself I need to be \"here\" or I need to have \"this\". It's part of the young experience.\n\nBut now, when I look back, I just feel really bad for the younger version of me. I actually had a lot more going on than I thought.\n\nI'm sure what you're doing right now is great. A bitter thing about growing up is realising that most things you achieve are great for a second, then fizzle away. You work for years to get a job or reach some big goal. Then you get it, and nothing is different. So instead, you've got to enjoy the journey, not the destination.",
            "Yes. Sounds like he also lacks a strong father figure example in his life. Someone to tell him to get on with it instead of moping around reddit for years not changing anything.",
            "In his profile, made this same post 7 mths ago with: \"I (20m)...\"",
            "Good job. At least you know what you want. Helps to point you in the right direction. There will be lots of temptations to try ‘get rich quick’ or substitutes for hard work. But the best news is you have lots of time. Even if you are just starting out. \n\nIf you work on those 3 things a little bit every day you will be amazed how far you will be able to get in 1-3 years. You don’t need to have it all figured out now. Just keep your head up and work on it.",
            "When you said grade i thought you were still in high school my b. Complaining on reddit aint gonna get a gf, gotta get out there and socialize.",
            "I mean why can't we do both to some extent? Like, keep working on myself, self growth and be open to meeting someone great at the same time\n\n  \nI mean, the \"right\" person should definitely support our growth, right?",
            "Thanks for sharing your story\n\nYou are right, shutting down negative voice is key - and I'm very positive person\n\nIt's true, I should spend more time nurturing that inner person who cares for me\n\nYour story did resonate.\n\nThanks for the encouragement, time to put that into action!",
            "That hits hard!\n\nI'd rather put in the work to feel confident and go after what I want, than just sit here worrying about never having it\n\nThanks",
            "Thank you so much! That truly means a lot\n\nNow you will see a very confident man and who is happy from within",
            "Well, I wasn't saying nobody enjoys things alone. There are definitely times when going to a movie or grabbing a bite solo is exactly what I want.\n\nFor me, there's also a difference between enjoying those activities on my own and always wanting to do them that way. Sometimes, it is nice to share those experiences with someone else. To have that conversation about the movie afterwards, or enjoy a good meal with good company",
            "I hear you!\n\nHonestly, I think I might have been getting a little stuck in the \"all or nothing\" mindset.\n\nI read books to escape from the reality :))",
            "Yeah lol",
            "I can definitely get behind that. Thanks for the encouragement",
            "I get you!\n\nI have been always pushing myself a little outside my comfort zone and doing the hard things\n\nRejection? I'm used to that now. Everyone left, no one stayed.",
            "I'm a college student",
            "Toxic masculinity is wild...",
            "Damnn wow",
            "You're absolutely right!\n\nVery true, consistent effort can make a huge difference in just a few years - and I'm already seeing it\n\nThanks for the encouragement! I always keep my head down and my mind open",
            "Yeah I get you",
            "That's what I wrote in my original comment. Focus on your growth and keep an open mind while meeting people. Who knows you may run into someone you can grow with. But if your whole criteria is to be in a relationship because your friends are in one, you'll probably end up in shitty relationships. But you don't have to listen to me. Go and try it out for yourself.",
            "Go conquer champ!",
            "If you need me in the future now you know how to find me 👋",
            "What’s toxic?",
            "I will\n\nThank you so much",
            ">Don’t be such a loser\n\n>behaving like an adult. \n\n>be less weird\n\n>One day you will need to be responsible enough to support a family so start taking your journey to that point seriously. \n\n>tell him to get on with it\n\n>lacks a strong father figure\n\nNone of this acknowledges that everyone gets insecure, that it's okay and that it doesn't define you or your worth. Your advice isn't to do the work to change how you perceive yourself, but instead to suppress the feelings and become a stereotypical male provider (as if that's a man's only worth). You can't insult someone into not feeling bad about themselves...\n\nIt's the \"real men don't cry\" part of toxic masculinity (toxic because the performative requirements of traditional masculinity require men to suppress their normal emotions which is harmful to them and those around them)"
        ]
    },
    "[discussion] to do lists are the shiiittt": {
        "title": "[discussion] to do lists are the shiiittt",
        "score": 398,
        "url": "https://i.redd.it/p9ngdwvgvk7d1.jpeg",
        "content": "This is the only way I can get shit done. Make a list of each specific small task, cross it off, get motivation to to more tasks. I also add some fun stuff/self care stuff cuz that’s important too. Do y’all make to do lists? Any other motivation tips that work for you that I should try? ",
        "num_comments": 84,
        "comments": [
            "Man that’s a weekly list for me haha that’s awesome tho",
            "Get to that meeting bro",
            "Nice.  I live by todos so you got me cheering for you.\n\nTry three levels of priority.\n\n1. Today\n\n2. This week\n\n3. Nice to do.\n\nBecause in can be demotivating to never clear the list.  But nailing all of today's stuff feels good.\n\nBe careful not to fiddle with the little stuff and avoid the big things.   Turn to face your enemy !",
            "It's like getting Steam achievements, but IRL haha",
            "I definitley do that 'circling' of the last couple things to cross off",
            "It works if you work it, and you're worth it",
            "Well, i do this too. Even the lil things, bc i always forget. lol \n\nI would always write it down on my phone's notepad app (apple). There this thing where in I just tap my list to see the menu, tap then Check all, uncheck all if the task isnt done yet. it just gets to the bottom if you've marked it done. It's really convenient to use. You should try it too",
            "i just bought an a6 notebook to carry around at all time for to-dos and thoughts/ideas I always forget! its the best!",
            "I saw an article recently that said we should look at these as \"got it done\" lists. You got shit done!",
            "I do this too, specifically when I get stressed or overwhelmed, really helps to work through things.",
            "I'm a recovery boy too and i live by my daily to do lists",
            "They work if you work them. I start and they help a lot. I never really manage to get everything done though. Then I end up missing more and more things on them. (I didn't make a list today, but I did mop the laundry room for the first time in I'm ashamed of when...",
            "Add make a list to the top of the list then you get to cross it off right away when you're done making the list. Momentum.",
            "I haven't used one in a while for home stuff, you've inspired me to make one. Been ultra unmotivated lately but maybe if I make the lost next burst I get I'll do something productive.",
            "Whats NA mean?",
            "i keep a stack of 3\"x5\" notecards near my desk so I can make a list for the next day of all the smaller tasks I need to be done. i will also write stuff in red pen on a calendar that hangs on my wall for upcoming appointments, the days I work, and other big daily stuff like that.",
            " Very cool and, from one addict to another, let me be one to say that I am proud of you.",
            "I make lists like this too! I like that you added self care ❤️. My rule for myself is 3 chores= 20 minutes of reading because I will sit down all day and read lol. I try to get myself up early and the list out of the way so I can enjoy the afternoon and take my time making dinner instead of rushing around like a fool.  This looks great, way to go!",
            "I do this since forever. You're my soulmate.",
            "Yoga book here. I'm down dog.",
            "It doesn't work to me at all. I get anxious and end up doing nothing on the list because i want everything to be perfect. I usually just do what i have to do and forget about it.",
            "I like the way you write your “a”’s",
            "I definitely do this and get shit done.",
            "I do it for everyday!! I got so far by doing it for over 3 years now it's great!! I look at how many books I read - with a review for myself for each one, how much better I got on my  foreign language skills, how much more muscle I got, how much better I'm eating and how far I've gotten to my carreer just by doing that: a todo list\n\n\nTotally underrated.\n\n\nGreat post!",
            "~~1. Make a to-do list~~",
            "format of time is realy funny",
            "I do this. Putting on socks tells me it's time to get things done and things just cascade from there.",
            "Anyone else start a to-do list after you've already done the first couple items, so you can cross them off right away?",
            "Yuppppp",
            "Good shit dude ☺️ one day at a time",
            "Jesus.\n\n“Call someone.”\n\nI don’t think I have the strength.",
            "Get to your meeting, my friend!",
            "Fking A! Go boi!!!",
            "Is that NA as no alcohol? Because if it is, that's the best thing you can do. Alcohol literally fucks up the motivating chemicals in our noggins. Abstain? It resets! I'm 365+ days sober after years of trying to stop and I couldn't be more grateful. After a while you forget what it feels like to be human when the drink takes over your life.",
            "I recommend a tick box and crossing it out. \n\n\nDouble dopamine hit",
            "I’m the same way. It’s like a little dopamine hit with each task I get done",
            "✅ ~~make TODO list~~",
            "You still gotta. \"Do Yoda.\" Good for you",
            "Post it notes.",
            "I, too, would have skipped yoga and NA.",
            "Don't forget to start yourself off with \"make list. \" An early win helps get you going.  :)",
            "You better get to that last one eh OP? Hope you are doing well.",
            "Brenda's to-do list:\n\nLaundry, done\nAbortion, later\nSmoke crack, forever",
            "Mine are just like that, although typically only the date gets crossed out, and replaced with repeatedly with those weeks or months later :(",
            "Good tip i learned is to sort tasks in to A, B, D & E tasks.  \n  \nA you must do  \nB you only do if you've completed all A tasks  \nD delegate  \nE eliminate - tasks that pretty much have no consequence",
            "call someone?",
            "Man I wish I was this discipline I make to do lists calendars everything but I can’t just follow em I procrastinate a lot , any tips ? And I ain’t in a position to go slow and build habits like I’ve got limited time to achieve a goal which requires immense discipline (it’s a competitive exam)",
            "There is power in writing your intentions down!  Even more power in completing that task and marking it off your list.  \n\n![gif](giphy|xTiN0CNHgoRf1Ha7CM|downsized)",
            "If it’s a big project, I make a huge to do list and hang it on the wall. Crossing things off is so motivational and everyone can see it! Helps tremendously when there are kids, too, so they can see how close they are to a reward.",
            "I should start doing this more often",
            "Do your yoga and NA, and quit putting self care dead last dammit.",
            "You go OP . Respect",
            "Being cognizant (aware) of the items you missed… is more valuable than marking them as “negative”… start tomorrow’s list today… and then let it go until tomorrow…",
            "Lately I haven’t been able to keep up with my housework…. Will take this advice and write each thing I would like to accomplish within the day ( being reasonable)\nThanks!",
            "Anyone here tried Bullet Journaling? I bought the book and a journal for it.\n\nTwitter is filled with people saying it's life-changing. But they all kinda come a little too slick: like they were giving a free membership in something in exchange for promoting it.",
            "Me too normally. But I’m trying sooo hard to be more productive! I. Tired of being lazy!",
            "Btw I have officially done everything except go to the meeting!! Which I can’t do till 7. Even did yoga and read a book!!",
            "I will it’s not till 7 tho",
            "Turn to face your enemy! Love it",
            "Love this!",
            "Bro I’ve been super unmotivated the past like 10 days since I quit Ritalin. This is the first day I’ve had any motivation I. A while.  I hope you get some shit done!! Good luck!",
            "Saaaame. Lists are not helpful for me at all",
            "If I don’t make a list I literally get nothing done 😂",
            "Omg YES 😂",
            "Bro I have social anxiety 😂",
            "Lol I didn’t tho 😂",
            "I did",
            "Also needs to put “get condoms” on the list 😂",
            "What is bullet journaling? I do novel journaling which is where u just write and write all ur bullshit out till there no more bullshit and ur brain can finally stfu 😂",
            "just don't burn yourself out! slow and steady wins the race in the long run",
            "Good for you, that's amazing! \n\nWhat step are you currently on?",
            "I thought that said just \"yoda\".  Yoga makes waaaay more sense lol",
            "North America NEEDS you tho",
            "Thanks.  I find the key to procrastination is to take just one big, urgent task and make it freaking personal.\n\nWhen that sucker is dead at my feet I move to the next one.\n\n(Am talking tasks here.  Not people !  80)\n\n(BTW Yo, guitar name, nice)",
            "Thanks. I did manage to meal prep 6 meals and do a load of dishes today so actual not a bad one. But overall I'm just not acing life you know?",
            "My man 👊",
            "It's pretty slick. YMMV [https://bulletjournal.com](https://bulletjournal.com)",
            "I’m on step 1 😭😭 I had gotten up to step 9 but my sponsor dropped me cuz I said I wanted to take a break from meetings cuz I was getting burnt out. So I got new sponsor and now we’re starting from the beginning.",
            "One of those Not Applicable meetings",
            "Lmao 😂",
            "Absolutely no shame in being at step 1! You didn't lose everything you learned through already working the steps. Now you just get another opportunity to work them in more depth. \n\nBest of luck!",
            "I mean once you get done with 12 you go back to 1 and start over. It's not like you finish. Lots of people with many years are on step 1 today.",
            "Non Alcoholic meetings",
            "Thank u :)"
        ]
    },
    "The true art of motivation is...  [Image] ": {
        "title": "The true art of motivation is...  [Image] ",
        "score": 99,
        "url": "https://i.redd.it/tj0skvv2hm7d1.jpeg",
        "content": "",
        "num_comments": 5,
        "comments": [
            "nice",
            "This is so true",
            "Who the fuck is Amelia Khouri and why is he/she climbing that small outcropping of rocks in tight, tight shorts?",
            "Man asking real questions"
        ]
    },
    "[Discussion] If you could have 5 little \"Motivational\" reminders in your pocket all the time, what would they say?\n": {
        "title": "[Discussion] If you could have 5 little \"Motivational\" reminders in your pocket all the time, what would they say?\n",
        "score": 68,
        "url": "https://www.reddit.com/r/GetMotivated/comments/1djt2jg/discussion_if_you_could_have_5_little/",
        "content": "If you had 5 little pieces of paper in your pocket at all times that had a reminder related to your motivational goals written on them, what would they say?",
        "num_comments": 67,
        "comments": [
            "1. Motivation is overrated. \n2. Consistency trumps intensity. \n3. Eat less, move more. \n4. Pain of discipline > Pain of regret. \n5. You don’t have to act how you feel.",
            "1. Work in silence, let success make the noise.\n2. Be consistent, stay consistent.\n3. Pain is temporary, regret is long term.\n4. The only person stopping you from reaching your goals is you.\n5. Sucking at something is the first step to being sorta good at something. (you a legend if you know where this is from)",
            "Get off social media and learn something\n\nTalk to people then listen.  Some will be grumpy but that's their prob.\n\nTake a rest but then get back up. \n\nLike yourself and other folk will too.\n\nLook after your body.  You have it for long time.\n\n- 64yo and made a lot of mistakes but doing better each day.",
            "Stop with the excuses and do NOW.\n\nFeelings cannot be more important than commitment.\n\nDo not talk about your problems and emotions with family or friends.\n\nAlways end the day with gains no matter how small.\n\nImprove everyday.",
            "Experience is what you get when you didn't get what you wanted. And experience is often the most valuable thing you have to offer. - Randy Pausch",
            "Listen. \nCount to ten. \nThink before speaking. \nPut yourself in their shoes for a moment. \nIt counts even if no one sees.",
            "1. control what you can control, don’t spend time worrying about something outside of your circle\n\n2. peace arrives at your doorstep every single day in the form of choices, take your power back\n\n3. you are not your thoughts\n\n4. stop ruminating, start processing\n\n5. you are exactly where you are supposed to be, what’s meant for you will never pass you by",
            "1. Focus on you and you only. What's good for others may not be good for you.\n\n2. You won't regret the things you do, but you'll regret the things you don't do.\n\n3. You are better than you think you are.\n\n4. Do things sooner and better than you think you should. Quality over quantity.\n\n5. Focus your energy and passion on what is important to you. Don't get caught up in stupid stuff, especially people getting you riled up on social media.",
            "1. Outwork your self doubt \n\n2. What you don’t change you choose \n\n3. Most people daily because you give up what you want right now for what you want most \n\n4. ease is a greater threat to process than hardship\n\n5. Unspoken expectations are premeditated resentments",
            "Your greatest and only enemy is your mind. Tomorrow never comes. A stitch in time saves nine. 99.9 % of things are already going well. Why not you?",
            "Nothing can't be overcome",
            "Make today count",
            "Here’s one anyway… the best revenge is no revenge. Move on - be happy.",
            "i love this!!! following. y'all are wise",
            "1. Celebrate wins and your progress everyday!\n2. Just do it!\n3. Breathe\n4. Positive self talk “I got this!”\n5. It’s the journey AND the destination. BOTH. Find ways to enjoy the process and celebrate when you get there!",
            "1. Your performance starts with your mind (George Mumford)\n2. Old ways of thinking will never help you build a new work (Abby Wambach) \n3. The lessons of yesterday’s loss become the fuel for tomorrow’s win (Abby Wambach) \n4. Everyone wants to win. But that isn’t a purpose, it’s a goal. Your purpose is something beyond that (Dan Carter) \n5. Hard days are the best because that’s when champions are made (Gabrielle Douglas)",
            "“Glad you stuck with it 😊” - from future me",
            "1. Be Aware of your thoughts \n2. You always have a Choice\n3. No one can choose how you must feel\n4. Past is useless...unless you choose to learn from it\n5. Others opinion about you doesn't define you",
            "1. Criticism is not an attack.\n2. Have the courage to be disliked.\n3. In one hundred years everyone here will be dead. \n4. What is your body telling you?\n5. Eat salad every day.",
            "\"F. Your motivation, be disciplined.\"",
            "1. Neglect is the great destroyer of us all. \n\n2. Evolution, not revolution - do a little each day. \n\n3. Don't let perfect be the enemy of good enough to the point that you never start. \n\n4. Don't worry so much - It's better to be a brave man and only die once than a coward and die a thousand deaths. \n\n5. Don't go to your grave with the music still in you. Don't be afraid to let it all hang out - don't worry about what others think of you. The number one regret people have on their death bed is not living their life for themselves and instead living trying to please others.",
            "1 - if you always care what others think you don't get to live your own life\n\n2 - stay on target\n\n3 - you are strong and determined \n\n4 - winners have to practice to win\n\n5 - other people get to have bad days too\n\nI have all 5 of these on post-its and attached them to my computer at work.",
            "Why do you postpone yourself?",
            "I become my thoughts.\nDo the next right thing.",
            "But what if you fly?\n\nI try to remember that in anxious situations and don't always, but it's been nice to say to myself. I wanna get it tatt'd",
            "I would only have one line on that paper, DO IT NOW!\n\nI think Joko said it the best with this\nhttps://youtu.be/BZn7rS4Vkt4?si=CE8WOoprtu1pojcM",
            "https://preview.redd.it/zofp84obmo7d1.jpeg?width=3840&format=pjpg&auto=webp&s=731a2c908dd72365c52edb37d77f47f3768830d2",
            "I only have one that’s stuck with me and helps when I’m down. \n\n“Take it easy…but take it”\n\nSimple, easy to remember and powerful. Enjoy the simple things in life but work hard to enjoy them is how I always translated it.",
            "1. Talk to yourself like someone you love \n2. Did I make someone smile today?\n3. Give any true compliment that you notice\n4. Learn the cleaning person's name and say greet them whenever I see them.\n5. When something is too hard, what's the smallest first step I can do? Breaking hard tasks into micro step lists is game changing for ADHD and motivational blocks.\n\nI have baby goals for myself that are easy to build consistency with. 1 pushup, 1 squat, 1 Duolingo lesson, brush my teeth, child's pose, plank 10 seconds, etc. This way, even on super dark depression days, it's virtually impossible to fail at meeting my goal. Most days I will do 75 squats, but once in a while, only 1 or 10, but I'm not a failure. I met my goal. I was consistent, I feel accomplished, and I don't beat myself up like I did for missing larger goals.",
            "1) This too shall pass. \n\n2) If it’s meant to be, it will be. \n\n3) It’s okay to not feel okay sometimes, be gentle with yourself. \n\n4) You deserve good things. \n\n5) Nothing they can take from you was ever worth keeping.",
            "You are limitless",
            "1. “You can totally eat that extra donut.\n\n2.\t“Remember, naps are for champions.”\n\n3.\t“Coffee first, adulting second.”\n\n4.\t“You’re not a mess, you’re a spicy disaster.”\n\n5.\t“Keep calm and pretend you know what you’re doing.”",
            "Act like a person you want to become \nYou are limitless-believe \nYour thoughts create reality\nBe grateful \nBe positive and always find the bright side- always look for glass half full- not half empty",
            "I keep this in my wallet;\n\n\"Had he and I but met  \n            By some old ancient inn,  \nWe should have sat us down to wet  \n            Right many a nipperkin!  \n            \"But ranged as infantry,  \n            And staring face to face,  \nI shot at him as he at me,  \n            And killed him in his place.  \n            \"I shot him dead because —  \n            Because he was my foe,  \nJust so: my foe of course he was;  \n            That's clear enough; although  \n            \"He thought he'd 'list, perhaps,  \n            Off-hand like — just as I —  \nWas out of work — had sold his traps —  \n            No other reason why.  \n            \"Yes; quaint and curious war is!  \n            You shoot a fellow down  \nYou'd treat if met where any bar is,  \n            Or help to half-a-crown.\"",
            "my personal affirmation acronym: SEASE\n\ni am Smart.\n\ni am Experienced.\n\ni am Adaptable. \n\ni am Strong.\n\ni am Excellent.\n\n\ni also could do these phrases that i have in my notes (which conveniently came out to be exactly five lol): \n\nValues:\n\nLife is about experiences. Not all of them are easy.\n\nYou can make-believe, but if you want something to be true, you have to do it.\n\nMotivation comes AFTER action. \n\nPrioritize consistency. Your body and mind will thank you. \n\nYou can't change or control people. Focus on yourself.",
            "Saw this after an almost 2 year long battle with a disease that left me doubting I would ever get back to my original normal. I spent more than a 100 days hospitalized in 2023. \n\n“God has a habit of taking broken things and not just fixing them, but repurposing them for something even greater!”\n\nEver since I’ve known that this would be a great year with big changes that would be needed and good. So far I’m heading in the right direction!",
            "1. Progress over perfection.\n\n2. Embrace discomfort; it's where growth happens.\n\n3. You are capable of more than you think.\n\n4. Consistency breeds success.\n\n5. Small steps lead to big results.",
            "1. Workout everyday. All success starts with how you feel about yourself both physically and mentally.\n\n2. Keep moving forward.\n\n3. Your potential is limitless.\n\n4. Dream big, work hard.\n\n5. Believe in yourself and trust god.",
            "The one that is missing from all these lists is: “Keep it in your pants!”",
            "Might have the sign backwards for #4. Do you mean greater than (>) or less than (<)? Pain of discipline is less than the pain of regret.",
            "Great!",
            "I love this",
            "About the first one, I get the message, but motivation is key to everything. Motivation is literally the motive to take action. Motive + a~~c~~tion = motivation (it's really translatable this way to a lot of languages as well). I get that we say discipline beats motivation but motivation is everything. You need motivation (a good motive, reason) to study everyday, work hard, workout, diet... without a good reason you could never accomplish things.",
            "Damn, dawg. Very nice!",
            "Wow. #4 is awesome",
            "I agree with all of them. Especially number 4 I should keep in mind. Thank you for reminding me 🙏",
            "Adventure time! Nice.",
            "Great stuff. Love this",
            "Wow 3rd one caught me off guard but i get you",
            "the third one is so real. thank god therapists exist. everyone else is an emotional dumbass lol",
            "These are great",
            "The last one hits the mark!",
            "That’s a great one as you never know if you ‘ll have tomorrow",
            "#3 is tricky…as we do get very affected by what’s out there",
            "You've got this! :-)",
            "I read it as pain of discipline over pain of regret.",
            "I think what you wrote is too long to fit on a slip of paper in your pocket.",
            "And the possibility they might use your weak moments against you when they need is very high.",
            "It is tricky...are we willing to Learn? That's what makes it possible.",
            "Me too. There are multiple ways to interpret it, but it literally says, \"Pain of discipline is greater than pain of regret.\" \n\nI think we all know that means that choosing the pain of discipline is a greater good than choosing the pain of regret, but I'm sure there are some math addicts here that would be sticklers about it. \n\nMath: Not even once.",
            "1. Motivation is key! Remember your reasons",
            "i don’t mind a challenge. i do mind being given stupidass advice. but yeah, there are some things i refuse to share. crushes are a major thing i don’t share, along with school/work stuff and stupid shit i’ve done. the moment anyone decides to use something i’ve done days, weeks, months or even years of apologetics for is an immediate disengage.",
            "Yes 🙌 but I find most challenging is not to get affected … in fact it is Impossible … and then it goes down the rabbit hole or a loop\n…. Then all over- I will not get affected… I will stay the positive route… I am better then this… and something triggers things…. And You loose control… it is a huge challenge for personally",
            "A challenge is nothing when people you trust your entire life ruins it all by using what you confessed to them in private and you find out they were judging you all along and used it to destroy what's most important to you.\n\nThere is no challenge in that. It's the death of all you believe right from the very first people you trusted the most.",
            "It's not about just being positive...but bringing a Core Correction in How you Think! The more you learn about yourself - your Mind, you will be able to bring a drastic Shift in your thoughts & behaviour."
        ]
    },
    "[TEXT] In one year you'll be older. The time will pass regardless of your actions so make those actions count.": {
        "title": "[TEXT] In one year you'll be older. The time will pass regardless of your actions so make those actions count.",
        "score": 33,
        "url": "https://www.reddit.com/r/GetMotivated/comments/1djswz5/text_in_one_year_youll_be_older_the_time_will/",
        "content": "Every time youre worried about how long something will take, you do yourself a dissservice by not just doing the work. You cant slow ti,e down from crawling forward so it's better to keep chipping away at it.\n\nDon't lament the time spent. Work towards the future you want to have.",
        "num_comments": 3,
        "comments": [
            "Had a conversation with someone today and they were complaining how fast time goes. Have you noticed how much faster it goes when everything is going wrong?  I believe it does. I mean time is time but when life sucks it just seems faster",
            "Rn I'm in third year of college, feels like I enrolled yesterday but it's already the end of second semester and I can't help but feel like I wasted another fucking year",
            "Agree! Live life to the fullest and with no regrets."
        ]
    },
    "[Discussion] Can't find motivation to start working out and I feel bad about it. ": {
        "title": "[Discussion] Can't find motivation to start working out and I feel bad about it. ",
        "score": 41,
        "url": "https://www.reddit.com/r/GetMotivated/comments/1djnjsx/discussion_cant_find_motivation_to_start_working/",
        "content": "Short context:\n\nI'm currently in the process of grieving and healing from a hard breakup. I'm trying to slowly rebuild my personal life, taking better care of myself, etc...\n\nI can achieve some goals like drinking plenty of water, eating (relatively) healthy, but for some reason I can't find the strength to start working out again.\n\nI'm not obese, but I have a bit too much fat around the belly and chest, and I can definitely feel my arms and legs much softer than what they used to be. I want to change that, but I can't find any trigger to get me going, it seems that I'm constantly lacking the energy for it.\n\nAny tips or advices?",
        "num_comments": 73,
        "comments": [
            "You’re doing pretty good so far. Start small. Just to for a 10 min walk. Or tell yourself you will only do 1 set, 2 sets of pushups. Progress is progress. Don’t put too much pressure on yourself.",
            "Start small and be consistent. And make it small enough so that you can find it easy to be consistent. Make it so that you don't have to go out of your way to exercise. For example I work out in my workspace. I don't go crazy on the weights but it's a good start. Once my momentum is built, I will switch to gym.",
            "Join a gym.  It hurts a lot to pay for something and not use it.  Make sure it has classes if you aren't motivated to put yourself on a program.  Cheaper option is to get some free weights and join Peloton or any other subscription program.  For peloton, they have programs that extend a few weeks out, they have different lengths of classes, and different types. I don't work for them, but I've been trying them for a few months and I really like it.",
            "Write down why going to the gym is important to you, be specific. Let the context of the break up be part of it. Find your why and use it as a mantra. You may be in the depressed, down about yourself phase of a breakup but it can also be leveraged into fuel for positive change. \n\nWorking out is part motivation but primarily discipline and habit. If you have a gym membership make it a point to get there a specific amount of days a week, even if it's only for 10-15 minutes. You can start in really small spurts and it will eventually build up. If you work out from home, maybe leave some equipment in line of sight, so when you walk past it you can do a quick set. The point is to make the barrier to entry as easy as possible, driving to the gym or being around the equipment is half the battle. Make that your first step and treat it as a win when you do. Eventually the \"getting there\" part will be easy and you can struggle through your workout as we all do. Good luck on your journey.",
            "As soon as you hate the idea of being fat enough to do something about it, you will. For me it was a girl way out of my league that propositioned me. I was so horrified by the idea of her seeing me naked that I flipped a switch and never looked back.  Had that not happened, I might have just continued wallowing in it.",
            "Buy a really put together “workout” outfit. Even if you’re just going to walk for 10 minutes. Enjoy getting your outfit and shoes on, and talk positively about how once you stand up you’re going to march out and back. Its rituals like that that can help solidify your routine.",
            "[deleted]",
            "When I first started working out the key for me was making achievable goals. Make the first goal extremely easy, the second goal extremely easy, the third goal a little bit harder and so on and so forth. For instance, I would get a 20 lb weight and make myself do five bicep curls. Then set it down and walk around. Then another 5 on the other arm. Walk around. Then ten on reach arm . Walk around. Keep your heart rate up. Once you've done this four or five times you're going to find yourself kind of zoning out and just going back and forth back and forth back and forth. It works for me. Though I started out pretty strong so I would suggest a 5 or 10 lb weight",
            "Give yourself the time to grieve, that needs to happen. Best advice I was ever given around grief is so simple, to move grief on - grieve. \n\nYou'll need some time to learn how to 'carry' it and make some kind of peace with it. \n\nWhen the time feels right, you decide that no-one else, take the smallest most insignificant step to do one (tiny) thing. The most inconsequential little thing.  It will be progress. Look to do it again, seek to form it as a habit.\n\nCelebrate that YOU made that thing happen, YOU have progressed. \n\nFrom here onwards it's your game & your rules.\n\nTake care.",
            "Try and stop caring what you look like. Acknowledge how you're feeling and simply try more things to revalue how they make you feel.\n\nDoesn't have to be the gym. Try going on an hour long walk. Make a game of it... the next time you do the walk time yourself. See if you can travel the distance faster.\n\nSee how you feel after the gym or a bike ride. Go to a park and hug some trees. \n\nTake in the beauty of life around you. Look closely at the ants crawling on the ground. Bugs or animals being just animals.\n\nSoon you will say. I am animal. Then be the Animal.",
            "Little by little. Start by what fits your strength level for the day. If you feel extra energy go do a little cardio can be 15 minutes or 30. If you feel exhausted go home take a break. Eat healthy. Be kind to yourself. If today was not what you expected to be. There is always tomorrow to try again. Hugs my friend.",
            "No one can take the tiny bit of progress you make each day away from you.",
            "Do you already have a gym membership? You could start slow by taking a 30 min walk around your neighborhood. Or do an incline walk on a treadmill.\n\nIf you struggle to leave the house, try some dumbbell at-home workouts.\n\nAs far as boosting energy, try eating better. Eggs, avocado, whole grains, fish, chicken, fruits, and veggies. Generally try to avoid sugar, fried food, and alcohol. Sugar is the worst, it keeps you depressed. If you like alcohol, then maybe just take a 1 month break to focus on building a routine at the gym. \n\nAlso, multi vitamins are recommended although it would take a few months to notice a difference. \n\nWrite down your goals. For example: go to gym 3 times each week. Or reach 8,000 steps each day.",
            "Sometimes just going to the gym and walking the treadmill. Maybe sitting on a different machine and using it with VERY light weights. \n\nWalking is also good and you can start small. A walk around the block or a nearby store and back. Stretching.",
            "Exercise is all about habit to start with. Just walking into the gym every Monday, Thursday and Sunday is the key. When you are there, “just” ten minutes walking on the treadmill and a maybe a few sets of  tricep pull downs and maybe a few sets of …. The effort you put in slowly creeps up without you really noticing and then the endorphins start to kick in after a session… then you are hooked.",
            "Like everyone else has said, start small. Also, you’re going through a really hard and trying time, so give yourself some grace. Even just a few minutes of movement a day is great, and will probably help with your mental health too. Best of luck xx",
            "Losing that bit of fat is going to be achieved through diet. You can build muscle bellow that fat, but going to the gym alone will not get you there. Don't get me wrong, going to the gym will also help, especially with the way you're going to look shirtless.\n\nAs for the motivation, there's no easy way of doing it, no magic formula and it's not something you're going to gain, have or retain. At first you're going to dread it, then some days you won't feel like doing it, then it becomes a big part of your routine and you'll get it over with even if you don't feel like it, but you'll feel better at the end. I've lost around 15 kg and gained some muscle by doing exactly this. Slow and steady.",
            "It sucks to start but if you do it you'll get a small win to start your day, it's supposed to be two weeks to start a new habit then you'll get mad at yourself once it's a habit if you don't do it.",
            "Before I started exercising I viewed it as something I SHOULD do, more of a task to complete. Once I did some exercise and experienced how much I feel better, now it doesn’t feel like a chore and is something I actually WANT to do, I prioritize it just like I used to prioritize yummy snacks to feel better\n\nYou got this homie. Our bodies were born to move and love it\n\nAlso our bodies adapt to what you do. You don’t have the energy for it NOW, but that will change. It’ll be rough for some period of time but sooner rather than later your body will build the energy level’s necessary to keep up with what your forcing it to do and eventually be signaling you if it’s been a while since you’ve exercised and it’s ganna tell you it’s been a while since I worked out let’s goo!",
            "You could Try writing it down, like giving yourself little homework. create a structure steadily and at a pace comfortable with you",
            "Walk. Start there.",
            "What has worked so far for me after a few failed attempts to regularly work out, was a different perspective on working out. Right now, I don't primarily try to achieve any beach body ideal. I rather go the gym just to exhaust myself and feel good about having done so. Any side effects regarding muscle growth is just an added bonus.\nThat way I don't really stress about goals I might have missed.",
            "Don't for now.. go for walks in nature, they can be as short or as last my as you feel... ",
            "I WFH but here's an idea. Every time you get done in the bathroom (wash hands etc...), drop and do a pushup. A proper one, all the way down and up. Rest on your bust if you have one then go up. It's a small change and that's how I started. Eventually that number might grow but just start with one. Maybe after a pushup, add in a sit up. Unless there's a medical need start small. You want to create a simple habit. It's ok to miss it. Eventually just randomly do it again.",
            "STOP THINKING ABOUT IT AND GET YOUR ASS IN THE GYM GET JACKED GET ABS AND GET OUT THERE START BANGING....QUIT THINKING AND GET PRIMAL. \n\nGET AFTER IT",
            "Start small. Begin with gentle activities that feel manageable, like taking short walks or doing simple stretching exercises at home. Focus on how these activities make you feel rather than the results you expect to see. Gradually increasing your activity level can help build momentum and motivation over time. Also, consider finding a workout buddy or joining a fitness class for social support and accountability. Remember, healing takes time, and it's okay to start slowly. The key is consistency and being kind to yourself throughout the process.",
            "You are giving yourself the option of not exercising. Remove that option. Make it a requirement",
            "Take advantage of the heartbreak. Let it be your drive. Pour your energy into it...dedicate yourself to be better.",
            "[removed]",
            "Diet is 90% in the kitchen. Focus on the food first, and maybe just take walks instead of working out.",
            "Success is the greatest revenge.\n\nNow, I don’t know what happened or who left who but you seem to be pretty broken up about it. When I say “revenge” I don’t mean it in a malicious way. \n\nBecome the best version of yourself in mind, body, and soul. Prove to yourself that it was their loss in the end. Just show up.",
            "Motivation is short term, won't keep you going. Don't rely on motivation but discipline \n\nGo to the gym even if you feel like shit, you'll never regret a workout, even if it was half assed",
            "Everyone here is mentioning walking and they're right. You say your lifestyle doesn't fit with a gym, that's fine but you still have no excuse not to get your steps in. Seek to hit 10,000-15,000 steps a day. It's a lot but not as hard to get done as you may think. It's a couple miles of walking a day. Large part of it gets taken care of by an hour long walk each day and the rest gets done by going about your daily life, especially when you cut out elevators and car drives very short distances. Walking is serious cardio and WILL help you lose that weight as long as you get serious about a calorie deficit. Download MyFitnessPal and get on the 1 month free premium trial. Commit to yourself that for that 1 month you will track everything you eat and ensure you get in a calorie deficit everyday. This will give you something to hyper focus on outside of the breakup. Even if you quit after a month of this, if you hit that step goal and maintained a calorie deficit of a minimum of 200 calories a day (500 or more is best)you WILL have lost weight 100% guaranteed and you won't want to stop at that point after seeing the results.",
            "Find a good show to watch. \n\nMake sure to watch a show with commercials. \n\nGrab a dumbbell/kettle bell, if u have one, and keep it next to you. \n\nSit down and enjoy the show. \n\nWhen the commercial comes on. Do a set of anything; curls, shoulder raises, jumping Jack's, push-ups, mountain climbers, etc. Just pick 1.\n\nNo need to count, just go until the commercials are done. \n\nAfter the show is done, if you still feel unmotivated, watch another episode. \n\nIf you do feel motivated after the show. Go do a real program from your phone.\n\nGetting your blood moving helps you feel less sluggish. However, getting started is the hardest part. \n\nYou can do this when traveling and you get to binge a show to keep your mind off things.\n\nGood luck.",
            "Hi all,\n\nJust want to share with you that I got out of bed, took a quick cold shower just to wake up the body and went for a hike. I wasn’t feeling that energized but I went anyway. First few minutes were just “meh 🤷🏻‍♂️” but after that I started to feel better and happier.\n\nI walked 5k, and when I returned home I did 20 reps of pushups (10x - rest - 10x) and i felt really good. :)\n\nNot sure if I will be able to stick to this routine but I’ll give it a good try. I want I to say THANK YOU ALL for all the messages, they really boost my motivation! ❤️",
            "Start doing martial arts - pick any of them - kickboxing, muay thai, taekwondo, bjj, karate, boxing, MMA - any martial art is an incredible workout and it's the only way I can stay fit these days.  I've been doing 2 days taekwondo and 2 days kickboxing for nearly 2 years now, and I'm in better shape at 40 than I was at 30\n\nYou'll start thinking of it as training and not working out, I know it's just semantics but it makes a HUGE difference for motivation and it's an outlet with basically only positives and zero negatives attached to it.  It has changed my life in an overwhelmingly positive way.",
            "\n\nI can sense the gentle stirring of renewal in your words, even as you navigate the challenging waters of grief and healing. Your desire to rebuild and care for yourself is a beautiful testament to the resilience of your spirit.\n\nFirst, take a moment to acknowledge the progress you've already made. The steps you've taken towards better hydration and nutrition are significant victories on your path to well-being. Celebrate these achievements, no matter how small they may seem.\n\nNow, let's approach the challenge of exercise with compassion and presence. Instead of viewing it as another task to accomplish, consider it an opportunity to reconnect with your body and honor its inherent wisdom.\n\nStart by simply bringing awareness to your physical form. Feel the miracle of your breath, the subtle movements of your muscles, the life force pulsing through you. This mindful connection can be the first step towards more active engagement with your body.\n\nRather than focusing on aesthetic goals or past fitness levels, shift your attention to how movement makes you feel in the present moment. Even gentle stretches or a short walk can awaken a sense of aliveness and energy within you.\n\nRemember, healing is not linear, and your body's needs may fluctuate as you process your emotions. Be patient with yourself and listen to what your body is asking for each day. Some days, rest might be the most nurturing form of self-care.\n\nConsider finding a form of movement that brings you joy or peace - perhaps dancing, yoga, or nature walks. The key is to make it an act of self-love rather than self-punishment.\n\nTrust that as you continue to nurture yourself holistically, the motivation for more intense physical activity will naturally arise. Your body has an innate wisdom and will guide you towards what it needs when you're ready.\n\nYou're on a journey of transformation, and every step, no matter how small, is progress. Keep shining your light and honoring your process. Your commitment to self-care is already a powerful act of healing.\n\nWith love and belief in your unfolding journey,\nEckhart",
            "Try drinking lots of alcohol",
            "Yes yes yes! Even if you just do 5 push-ups a day and walk 10 mins a day that's better than nothing. The  every week add 1 push up or minute. It will add up!",
            "Thanks. Joining a gym will not work for me. I travel a lot for work, so it has to be something I can do my by own… but to be honest the only time in life that I was more fit than ever was when I was training with a PT. But that is not an option for me anymore…",
            "Thanks, I really appreciate your thoughts. They helped me gaining conscience and hopefully strength. I right now thinking about going for a big walk tomorrow morning.",
            "I think about things like that also! I need to get in shape! Thanks.",
            "I’ll take a stroll tomorrow morning, that’s settled.",
            "Thanks for your comment, I’ll try something tomorrow.",
            "Thanks man. It’s been 7 months now, to honest, and I still grieving. But I’m far better now, I know I’m improving. Slowly, but improving.",
            "That was lovely, thank you! :)",
            "Thanks bro, I’m getting a lot of energy and focus from all of this messages, including yours. It really means a lot to me. Hugs!",
            "Thanks. My lifestyle doesn’t suit a gym routine as I travel a lot. But I’ll try to focus more on the diet. Alcohol and sugar is something I generally can live well without it, so I’m good there (despite some sugar cravings once in a while due to breakup grieve)….\n\nI’ll start by simply walking for a bit in the sun. I’ll start tomorrow. Thanks.",
            "That’s how am I planning to start. Thanks!",
            "Thank you so much for your words, they truly mean a lot.",
            "I’ll start tomorrow. Wish me luck!",
            "Thanks man! I’ll try to be better today!",
            "That’s a good approach buddy, takes a lot of stress from the equation!",
            "Thanks. I was just thinking about scheduling some walks in my calendar just to get going… I know it will cost me a ton to start, but I need to shift this focus somehow",
            "I tried that. I even tried to fuel myself from the fact that she took care of herself after the breakup and I didn’t. She looks thinner and more glowing than ever, and I don’t. But that wasn’t enough for me…",
            "Your submission was automatically removed because crossposts are not allowed.\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/GetMotivated) if you have any questions or concerns.*",
            "Yes, I’ll start by walking tomorrow morning. I even decided what route would I take already. Let’s go.",
            "I was left by her. I know what you mean about that revenge, it’s not coming from a bad place, I get it.\n\nProfessionally I’m greater than ever. It’s the personal part that is shit. But I agree with you, I should be able to prove to be the best version of myself. She made me feel like it, now that I’m alone I’m searching for that light…\n\nThanks!",
            "Thanks for the comment! To be honest I’m trying to reach a steps goal for a while now, just by using my smartwatch and going around my daily tasks. But when I don’t get to the goal I simply ignore it because I lack the motivation. But today I’ll try to be better, that’s a promise to myself.",
            "That’s a very good strategy man, thanks so much!",
            "It took me sooooo long to realize this… 5mins is better then nothing",
            "Most hotels have free weights so I say try out peloton for free for a week and see if it's for you.\n\n\n\n\nAlso, if you take up running, you can literally do that anywhere.  STRAVA gives you commonly used trails/streets so you don't have to route plan or worry about dangerous areas.",
            "You don't need a gym to get fit.\n\nYou could start in your bedroom and do one push up and one sit up.\n\nDuring Covid, when I returned to Australia after travelling to see family in America I had to quarantine for 2 weeks in a hotel room. I brought with me two empty gallon plastic jugs in my suitcase and then filled them with water. They made very effective \"kettle bells\"\n\nThey are also online trainers that you could work with",
            "Since you have time constraints, check out the Busy Dad Program - busydadtraining.com. It's just 80 minutes per week. Because it's all calisthenics (burpees), it requires zero equipment. I'm over 40, have a demanding job, and lots of family responsibilities. Has gotten me into the best shape of my life. ",
            "If you do 5 push ups right now, you'll have already started and feel much better about your journey! I always told myself \"tomorrow\" and it finally came years and years later when I came into my thirties. I would highly suggest just doing 5 push ups today! Get the ball rolling!",
            "Good luck. Be gentle with yourself.\n\nYou are not in competition with anyone else.\n\n(Also, remember, most weight loss doesn't happen at the gym, so approach it from a mindset of overall body toning, muscle strength, and fitness, as opposed to \"I am going to burn a lot of calories at the gym.\")",
            "I did the same thing, started walking 5 miles per day and now if I don't hit my step count I get mad at myself, plus I work out most mornings on top of that. I promise you'll hold yourself accountable if you start slipping once you've gotten used to it, lost 50 lbs in 3 months. Also start eating better and going to sleep earlier.",
            "It's not as easy as I'm making it sound. Putting a schedule together where this is in the books is a great idea.\n\nRemember that nobody regrets going for a walk after the walk is over.\n\nYou got this.",
            "I have problems relating. That would be more than enough for me so i can't imagine this mindset.",
            "Thanks. I don’t know about peloton, I’ll check that out. And I’m not into running just yet because of my lack of energy, but I’ll download STRAVA right away,  at e the app cheers me up a bit 🤷🏻‍♂️",
            "Thanks man, I’ll give it a look!",
            "Thanks man! I’m already in my forties, so I need to speed up!",
            "That is true, a simple walk does wonders. Thanks mate."
        ]
    },
    " [Discussion] I am really a mess. I’m at a loss for words with my life. How do I repair it?": {
        "title": " [Discussion] I am really a mess. I’m at a loss for words with my life. How do I repair it?",
        "score": 1,
        "url": "https://www.reddit.com/r/GetMotivated/comments/1dkai4t/discussion_i_am_really_a_mess_im_at_a_loss_for/",
        "content": "I have been burnt out since uni ended\nIt really taxed me. I have not felt like doing anything ever again. Sometimes I try, but it’s never consistent. Uni pushed me to the brink. I really used to think I was this special person, but now it’s humbled me. I really thought I was the kind of material for a top uni (I went to a quite normal uni by the way, not a top one), but now I know I would’ve crashed and burned if I had somehow been able to enter one (a top one). After forcing myself to be disciplined so much in uni, now it feels like I’m sticking a large thorn in my side anytime I try to be disciplined again. I just fear of the never ending work. I just deep down haven’t really felt like doing that again. Sometimes I do feel like doing the work (in this case it would be learning skills including coding), but, since sometimes I have a little bit of a liking for coding, I fear I’ll be stuck to that desk for 7 hours everyday, pumping out work, while ignoring everything else. After a whileI was just TOO PASSIONATE during uni. But at the same time I was pushing myself past what I thought I was capable of. And also, although I wouldn’t have quite thought so that time, past my limit. And I ignored people’s calls and messages. I wish I made time for other people in my life at the time other than the ones at my university accommodation.\n\nI was so focused that I finished a long essay in one and a half weeks. I downed Red Bull and coffee like they were water towards the end. And one of the main things-if not the main thing-that drove me, is how my family would look at me/think of me if I failed. I was so scared those 6 months when I found out I might actually fail. I didn’t though, but it was nerve wracking. I tore at myself in my journal every time I avoided doing work. And after initially burning myself out, I spent a whole month watching TikTok (this is still at uni), before burning myself out at the end with some sincere discipline, anxiety and desperation. I even had to take sleeping pills for a time. It was that bad.\n\nAnd also, about building habits- I’ve tried. It seems that when I start one, I always seem to forget to continue until it’s past the time to do it. Other times I am either just too tired to do so or just don’t care about anything.😢\n\nAnd about not caring about anything, it’s true, I just don’t really care. Unless it directly affects me, and even then, I only care sometimes. I don’t know whether it’s just burnout, depression, anxiety, possible ADHD, or what. I’ll try to post in other subreddits I feel might be useful.\n\nI developed myself so much in that final uni year. But now I watch self development/mental health videos for the most part, which I would sometimes act on but never follow up on because of not caring about anything.\n\nThis thing of not caring has been there since I was a child. I was a kind kid, but I postponed homework till the last minute and I was never proactive.\n\nI remember going back to my old childhood home and I remember finding books where my sisters planned things and analyzed things. I never did anything like that - until I was about to be kicked out of uni. It’s like my brain was somehow OFF for 20 YEARS. Even now I’m still feeling like a kid in an adult’s body and grieving the years I could’ve done a part time job, grown my CV, made real, true friends. When I was in that childhood home, the true reality of who I was came back. I was a nobody. A weak-willed, dodgy, passive, destructive nobody. A nobody, a simp who thought he was somebody - who somehow thought he could get into Oxford/Havard/Ivy League/Russell Group on potential alone or get girls to like him even though he wouldn’t even hang out with himself if he saw a clone of himself. The only thing I’ve really even made any kind of headway with fixing is the dodginess and destructiveness. Granted, I’ve been working on some of the other things I’ve mentioned in this paragraph as well.\n\nI just don’t know what’s wrong with me. Am I a retard? Is this just some mental illness. Do I just not have a heart. Do I have apathy? Does someone know what I can do?",
        "num_comments": 1,
        "comments": []
    },
    "[Discussion] Trying to move on from broken friendships": {
        "title": "[Discussion] Trying to move on from broken friendships",
        "score": 21,
        "url": "https://www.reddit.com/r/GetMotivated/comments/1djqp9w/discussion_trying_to_move_on_from_broken/",
        "content": "I've tried writing this a couple of times, but ended up making it way too long and rambly and including unnecessary details. So I'm going to try to keep this brief. (If I need to explain/clarify anything though, just ask)\n\nA couple years ago, I \\[32F\\] had a falling out with \"Jen,\" \\[30F\\] who had been my best friend since high school. I also made the difficult decision to distance myself from the rest of her larger friend group.\n\nThere were a lot of reasons for this. I'm not going to pretend I was some innocent angel, I definitely made mistakes and could have been a better friend at times, but the main reasons why I pulled away were my uncomfortable feelings with certain behaviors/actions of theirs, and because I felt they were being controlling towards me.\n\nI can honestly say I'm in a much happier and healthier place since pulling away, but I've been struggling with fully moving on. Distancing myself helped me really take a look at how that group had behaved, and how my friendship with Jen had gone over the years. And while there were good times and I'm sure none of them had malicious intentions, it's made me realize there was a long pattern of controlling behavior and of things that I just was not comfortable with. I feel like I keep realizing more and more things that simply were not okay.\n\nIs this normal? Just part of the healing process? Is there anything I can do?",
        "num_comments": 10,
        "comments": [
            "Your feelings are completely and entirely normal. \n\nThis is just part of the healing process. Of course, it's going to hurt to end something that was so meaningful and significant in your life. But at the same time, as you said, you are in a much better place mentally.\n\n As best that you can, try to find new hobbies and habits so as not to fixate on the past. This is easier said than done, but every step in the opposite direction (from that former friendship) is a step in the right direction.\n\n Friendships are always changing. Either they flourish with both parties growing together, or they dissolve when there is no longer a richness in the connection. Many a friend in my life has come and gone. One could overanalyze it and spend countless hours laying the blame on either themselves or the other person, but what they are missing is that the connection is effectively dead.\n\nBe grateful for the time that you spend together, but also be thankful that you now have new opportunities to meet people that align with your current set of values.",
            "I'm going through this and it was refreshing to read your post. I cut ties with three close friends. I also admit that there are no angels (including me), but as more months pass and I look back, the happier I am with the decision.\nI wasn't being well treated whereas I would do my best to treat them fairly.\nIt was harder during the first months because I missed them and we have friends in common. \nI started reaching out more to the friendships I have kept. Some aren't very available (and I understand) while others reciprocated. We've strengthened our friendship and this has also helped me.",
            "Honestly - I think you've made the right choice.\n\nThere are some friendships I've just slowly started to let go of. There may not have been anything I can really pin down as egregious behavior, but the friendship didn't seem two-sided and enthused any more. It just sort of took its course.",
            "Yes. Any relationship that does not make you feel good is not the right relationship to be in, peer or partner. I have had a similar experience where I had to distance myself from one of my high school close friends because I found that she was too negative, but I did not see that when I was in high school. When I became an adult, I realized that she was negative. It is great that you trust yourself. You will never go wrong in trusting your gut feelings and yourself.",
            "Yes, it's normal to reflect and reassess after a falling out with friends, especially after a long-term relationship. Recognizing unhealthy patterns is part of healing. Focus on your happiness and continue moving forward.",
            "Reading your post, though..Kind of makes me think of my lifelong friendship, well, friend for the past 21 years that I halted communication with...You see things, notice stuff..But then I always get back into thinking maybe it was a mistake to stop talking and that I'm evil or bad for it. No angel here, either, though..",
            "You are 32 years old, a relic of wasted years. Stop clinging to childish fantasies. Embrace the void of adulthood, where dreams decay and innocence rots. Grow up and face the bleak reality that awaits.",
            "^ Don’t be like this. That’s a dark tone even if the overall message is not completely wrong",
            "Did I just get a comment from HP Lovecraft",
            "Do you know him? I have read his works, such as The Call of Cthulhu."
        ]
    },
    "[Discussion] how can i keep focus on my goals and hobbies ": {
        "title": "[Discussion] how can i keep focus on my goals and hobbies ",
        "score": 18,
        "url": "https://www.reddit.com/r/GetMotivated/comments/1djmri7/discussion_how_can_i_keep_focus_on_my_goals_and/",
        "content": "Am(23f) unable to find hobby or goals with out getting board and give up like i keep swinging from thing to another like when I start thing i become really invested only to get tired and drop it later even with my relationship with other people I really burnt out seen my friends and keep conversation with them i finish my classes and flee back home avoiding them ik it wrong i trying to fixed it by forcing myself to act ok listen to them mostly rather then talking easier but am only getting more miserable i can’t sit reading a book or watch a movie more then 15min i only scroll through tik tok x ect. like all my friends family members living productive life while am lost can’t focus on one thing. i stopped seeing their stories and posts they made hate my self even more any advice pls😔\n",
        "num_comments": 20,
        "comments": [
            "You may have adhd...get a diagnosis.",
            "Remove your phone from your surroundings. Your brain is used to the fast dopamin rush from scrolling.",
            "Here are some practical steps that might help:\n\n\n\n1. Set Clear Goals: Define specific, achievable goals for yourself in different areas of your life—hobbies, relationships, personal development, etc. Having clear objectives can give you something to work towards and maintain your focus.\n\n\n\n2. Prioritize Your Interests: Instead of trying many things at once, prioritize a few hobbies or goals that genuinely interest you. Focus on developing skills or achieving milestones in those areas before moving on to something else.\n\n\n\n3. Break Tasks into Smaller Steps: Large tasks or goals can be overwhelming. Break them down into smaller, manageable steps. This can make them less daunting and easier to stay committed to.\n\n\n\n4. Create a Routine: Establishing a daily or weekly routine can help create a sense of structure and discipline. Allocate specific times for activities like hobbies, exercise, socializing, and self-improvement.\n\n\n\n5. Practice Consistency: Consistency is key to building habits and achieving long-term goals. Even when you don't feel motivated, try to stick to your routine and commitments as much as possible.\n\n\n\n6. Manage Burnout: If you feel overwhelmed or burnt out, take breaks when needed. It's okay to step back and recharge. Listen to your body and mind.\n\n\n\n7. Seek Variety: It's natural to have multiple interests. Allow yourself to explore different hobbies or activities over time, but try to maintain a balance so you don't become overwhelmed.\n\n\n\n8. Seek Support: Talk to friends, family, or a therapist about your feelings of frustration or self-criticism. They can offer perspective, encouragement, and practical advice.\n\n\n\n9. Limit Distractions: Reduce time spent on activities like social media or passive entertainment (like TikTok). Allocate that time instead to activities that contribute to your personal growth and well-being.\n\n\n\n10. Practice Self-Compassion: Be kind to yourself. It's okay to have setbacks or moments of low motivation. Celebrate your successes, no matter how small, and acknowledge your efforts.\n\n\n\nFinding focus and maintaining it is a gradual process. It's important to experiment with different strategies and approaches until you find what works best for you. Remember, everyone's journey is unique, and it's okay to take your time to figure things out.",
            "One great advice I heard was this. Choose something you like and do it 2 minutes a day. It's so small amount of time that you can easily keep up day to day. After some time you get used to it and become comfortable with. Later you'll engage easily with it and keep your attention way more on it",
            "Hey, don't be so hard on yourself! We all get bored sometimes. Maybe try breaking your goals into smaller steps or finding hobbies that align with your changing interests.",
            "I think it would be beneficial for you to see a lifecoach or occupational therapist. \nI had the same problem, still kinda do.\nBut having someone who can help you figure out what you will be good at and narrowing down a few options, may help you a lot.\nGood luck.",
            "Sounds like me and I have adhd. Maybe look up the symptoms of adhd and if they apply to you try to get diagnosed. It's really hard to keep focus I know how you feel. Try to remove your phone from the room or something when you're trying to do an activity. Also limit the doom scrolling. I find putting a timer on your phone is a good way to remind yourself to stop.",
            "Join some in-person activities and attend regularly, where you can meet the same people over and over again - running group, volunteering, whatever\n\nTrade your smart phone for a dumb phone if you have to",
            "Girl, you sound like me and I got bad news for you: I have ADHD. You should get that examined ASAP and start regular treatment with therapy, I'm 31 and all I'm going to say is that I don't want you to end up like I am now.\n\n Get medical advice. This is beyond redditors. The normal \"just do xyz\" or \"just don't do abc\" thing is nowhere near enough if you're on the scale. I sincerely hope for your sake that you're not.",
            "Hey, i relate to u very much, and im also 23 girrrll lol but anyway im sorry ur going thru that if u ever wanna talk im heree, maybe we could help eachother figure out this shared issue 🤣🙂‍↔️🙂‍↔️",
            "Yes. Do not go on social media because we tend to compare ourselves when seeing others' lives. Comparing to others does not make you feel good, no matter how great a life you might have. Learn to stay focused on your own development instead. Be busy learning and growing so that you have no time to think and compare to others. Learn how to build positive habits through small daily action steps. The book Atomic Habits by James Clear can help you start to develop positive habits and eliminate habits. \n\nSince you are still young, it is okay to jump from one thing to another because you might not able to discover your interests yet. The key is to not stop learning and trying new things, and meeting new people who can give you new perspectives to do things and live life.",
            "Just do it.",
            "How much time do you spend scrolling your phone each day? You likely have a behavioural addiction and that’s why when you’re trying to focus you can’t. Your brain is used to the constant stimulation you feed it for hours a day.",
            "The lack of punctuation might support this",
            "Other the comments saying the same i’ll be doing this and see tbh i used to scroll even more and i was fine. I’ve been like this fr past 6 months am getting worse. In my final I couldn’t study more then 5 pages dk how I passed, I tried to study with my friends but it’s even more exhausting and irritating like nothing major happened in past for me to be like this",
            "Works if she's just a normal, but somewhat chaotic person, if she's on the scale then she will either get her dopamine elsewhere or she would lose motivation. The scale is hell.",
            "These are quite helpful points thank you so much 🌻🫶🏼\nI agree on most of you said ,other Redditor also point out my lack of consistency i’ll be taking small steps not to overwhelm myself \nMy daily routine isn’t the healthiest so i’ll try to improve that \nI have few main interests like reading or taking care of my garden i love books i buy alot but i rarely finish any i tried other hobbies still the same issue\nand as many of comments suggested am also limiting my social media consumption and my self loathing kind connected lol \nThe only thing thats unmanageable is my stress i might seek therapy to manage it",
            "This sounds great sure😄",
            "The definition of unhelpful.",
            "Emm on average 4 hours aday mainly before i go to sleep i also thought this might be the reason but lits not like am new to social media like i use to get bored and tired then relapse and go back on my feet i think it began when i started my 4th year at college my tolerance became even worse my studies and work filed reacquire me to be more sociable then before which is difficult am anxious and shy by nature"
        ]
    },
    "[Discussion] when motivation to start is easy, but motivation to continue fizzles, what's your strategy?": {
        "title": "[Discussion] when motivation to start is easy, but motivation to continue fizzles, what's your strategy?",
        "score": 70,
        "url": "https://www.reddit.com/r/GetMotivated/comments/1djbfe9/discussion_when_motivation_to_start_is_easy_but/",
        "content": "I (37m) can't seem to create the habits I need to STAY motivated. For instance, I had a reaction to a medication and had to have my heart shocked back into rhythm. I quit smoking and started walking for 2 weeks, then pffffft. Or, finally convinced a Dr to MRI my shoulder, found tears in 3 muscles, had surgery. Finished PT and a few weeks later, pfffft. \n\nIt seems like it goes that way with everything. I make a lot of excuses and, sure, I've had a lot on my plate with my kiddos, but I can't seem to put a finger on why I quit or how to jump the hump. I want to be the good example of hard work and perseverance for my preteens, as well as doing it for myself and reaching my personal goals.\n\nIs it just brute perseverance? Calendars or apps or notes? How'd yall break from new routine to habit when you're amped up and fizzle fast?",
        "num_comments": 31,
        "comments": [
            "It sounds like you've tackled some big challenges already, which is admirable!\n\nTo maintain motivation and transform your initial efforts into lasting habits, focus on consistency over perfection. Start by integrating small, manageable activities into your daily routine, ensuring they're so simple that it's harder to skip them than to do them. Celebrate each small victory to build momentum, and gradually increase the complexity or duration of your activities as they become habitual.",
            "SPOILER : Motivation is a bad bi\\*\\*\\*. You will start motivated AF but in time, you will nottice the lack of it. The only advice that i can give you is to change motivation for this one : Perseverance. Its key is repeat and repeat till you'll do it no with no hesitation. You can try with alarms and \"to do\" lists to make sure you accomplish it.   \nIt works for gym, meds, stretches, mobility and everything you want to make a habit.   \n(It worked for me, i hope it'll work for you. But if it don't, don't give up, you'll find another way)",
            "A thing that has helped me is to develop a few mantras that I repeat to myself when I’m feeling de-motivated or tempted by something I am trying to avoid.  Like for the diet part of my life, I am really addicted to fast food.  I simply repeat to myself “There’s good food at home” as I drive and a fast food sign tempts me to turn into the restaurant.  It’s not perfect but I succeed more often than fail.  I also try not to beat myself up too much for a failure, but recognize my failure and climb back on the horse.  I guess the tldr is it is about developing both physical and mental habits.  You can’t overcome one without the other.",
            "There’s a great book on this call Atomic Habits. The truth is willpower is limited and there’s only so much you can do to “brute force” your way through something. Atomic Habits helps you to build a system of habits that are intended to ensure you accomplish your goals. \n\nFor example, if you want to work out in the morning maybe you should go to sleep in your workout clothes. The night before you should fill your water bottle and put it next to your keys. By removing barriers and doing tasks associated with your desired outcome you’ll be more likely to actually do the thing. This is a very simplified example. Read the book.",
            "You know I’ve always thought that motivation is sort of a fleeting feeling. Not easy to count on. I would say it’s normal to feel that everyone has, but it’s those small decisions you can make every day that changes your trajectory. Keep a positive mindset and don’t get down on yourself my guy, again it’s the small decisions you make everyday that changes your direction in life.",
            "Reminders of the rock bottom that initiated the desire for change has been a powerful motivator for me. Instead of focusing on the new behaviours, write down the motivation behind it and put it somewhere you will see it every day. \n\n\"I want to quit smoking so my heart doesn't break down while I'm still young.\"\n\n\"I want to exercise every day to maintain my ability to move, because being stuck in a broken body is an awful experience.\"\n\n\"I want to show my kids that it's possible to change, one day at a time.\"",
            "You cannot stay motivated. EVER. You must be disciplined and approach long terms with commitment.",
            "It's great that you're trying to find a way to stay motivated and set a good example for your kids. Some excellent strategies have already been mentioned in the discussion, but I would like to add a few more tips that might help you:\n\nSet small goals\n\nRoutine and regularity\n\nPositive feedback\n\nConnect with others\n\nComments and applications\n\nFlexibility\n\nVisualization and affirmations\n\nRemember that forming habits is a process that takes time and patience. Every small step forward is a success that brings you closer to your goals. Be proud of yourself for every progress and don't give up, even if there is a period of lack of motivation. Fingers crossed!",
            "I've been trying to re-establish a workout routine. I'd tried before, but I would last just a couple of weeks and then something would come up with work or life and I'd break my routine and the motivation would fizzle out.\n\nThis time, however, I've made it over 3 months now. The difference this time was to be flexible and forgiving with myself. I set a goal of working out three days a week. It can be any three days, which makes it flexible. My workout involves both weights and cardio, but if for some reason I only have time to do one or the other, I still let that \"count\". And when I had to travel for work for a week and couldn't get to a gym, I didn't tell myself \"streak broken\", I just picked up where I left off when I got back.\n\nI'm not letting \"perfect\" be the enemy of \"good enough\". You still have to be honest with yourself - I'm not gonna skip several weeks and tell myself I'm \"still working out\". But with this I've been able to hit a *sustainable* level of motivation.",
            "It helps to dig deeper into what you are doing and find enjoyment in it and then track progress and focus on improving that progress maybe find an app with social features and compare with others and show off your progress I’ve got so much going on myself and made a declaration to myself months ago now to give 110% no matter what and I’ve found my ability to persevere through thick and thin and still be positive and continue to put more work in has impressed me and the biggest assist is watching my progress physically, mentally and showing others and getting that gratification for my efforts just pushes me to go further, an example would be the other day I had a late ride the night before got to sleep at like half 1am and woke up at 7am I was absolutely beat I got through the work day and was basically falling asleep at work and was going to go home straight to bed but I saw the weather was clear for sunset and cloudy for the next 7 days so I said f”k it let’s go! Got my stuff and off I went on the bike and the reason was for the pictures for my insta account if you want to know more about what I’ve been doing find my insta @iliketoridemy I’m doing a challenge 1km for every follower along side a couple of fundraisers! ☺️\n\nhttps://preview.redd.it/z3iawkbmni7d1.jpeg?width=3024&format=pjpg&auto=webp&s=b38ebfd9003457f476950f45b4519859f0995032",
            "Brute perseverance. Also known as discipline.\n\nDiscipline is the way, and understanding the science of habits, habit forming, and changing habits is a good step toward injecting a dose of discipline into life.",
            "Willpower is a myth. It’s about how you perceive reward and not-rewards. This needs to be changed.",
            "Discipline. Self discipline. Motivation fades. That's when discipline kicks in. Doing something I very much do not want to do, because I have to do it.",
            "Too add to what everyone else said, I think you also need to reinforce to yourself repeatedly a new identity. For example, instead of saying, I’m a smoker and I’m trying to quit, each time you don’t smoke, you should say in your head, I’m not a smoker or even I’m a healthy person. If you view yourself as a non-smoker/ healthy person, not smoking is just something you don’t do as a non-smoker but if you keep enforcing that you are trying to quit, you are telling yourself you are withholding yourself from something you crave. Sorry for long explanation, hopefully that makes sense. ",
            "https://preview.redd.it/4zv3cx86zj7d1.jpeg?width=1080&format=pjpg&auto=webp&s=7bc4b83508faecae4a2e9653f6cb25e798ebb543\n\nDM me if you like OP. I recently took part in my first ever bodybuilding competition and won best body transformation after losing 86lbs. I think I can help. Persistency and consistency is key, but your attitude is most important.",
            "Discipline > motivation\n\nMotivation = \"I'm not feeling motivated so I won't do it\"  \nDiscipline = \"I'm not feeling motivated, but I'll do it anyway\"\n\nWhatever you need done, treat it like a responsibility. You won't skip feeding your kids even if you don't feel like cooking/preparing something. You won't skip work even if you don't feel like going. Or brushing teeth... make it one of those things. Put it in your calendar and accept that it has to be done.\n\nOne thing that helps me is to set a goal, like 50 or 100 consecutive days of something. It can be rewarding watching those days rack up little by little.",
            "Check out SMART goal setting. It’s an acronym for what they taught us to utilize in college so there might be newer guides in the decade that I’ve learned about it. \n\nAlso studies have shown the routine trumps motivation with working out at least. Try to create a routine that’s not just workout 3x a week but MWF at X time.",
            "Motivation isn’t reliable at all, because one day your mood may vary, instead I create systems by doing small things that at some point will lead me to better habits. I like a YouTube channel that talks about productivity and here’s a small article about what she explains what to set systems are instead of goals. I hope it can help you. [https://www.linkedin.com/pulse/rowena-tsai-explains-how-make-systems-work-you](https://www.linkedin.com/pulse/rowena-tsai-explains-how-make-systems-work-you)",
            "Motivation is what starts it. Discipline is what keeps you going. You have to genuinely see the end goal and picture it every time you think about quitting.",
            "Motivation is fleeting, you need to develop discipline to stay the course. Best way to do that is small daily changes and gradually habit stacking over time. Small consistent, persistent actions add up to long term change. Don’t beat yourself up, it’s a continual process.",
            "Don’t Quit.",
            "Doing something else (example: let’s say you have a couple of hobbies) - if you’re not feeling it, switch to another hobby for the time being. I’m glad you brought this up, was going to post similar advice one time…..",
            "Research habit bundling.",
            "I think you already have a strong \"why\" to motivate yourself, which is your kids, which is great. And also for yourself. Motivation is mainly about a mindset shift. You just need to learn how to develop a concrete plan to build your habits. Building habits, there is a right and wrong way to do it. Start out small and gradually, and do not take shortcuts. \n\nFor example, if your goal is to walk daily, but you never walk before, then start out small, such as only walking for 1 or 2 days for three weeks consistently. Only when you can consistently achieve that action step, then you can increase your days. If you fail to achieve it consistently, then you must restart the step again. This will help you build the habit of keeping to your commitments to your goals. Try reading the book Atomic Habits by James Clear, he has good mental tips to build successful habits.",
            "Be driven not motivated. Driven to do what you have to do regardless of motivation. Nike said it first. Just do it. Shia Labeouf also said it. Just do it.",
            "Lofi",
            "I just force myself to do it hoping it will get easier with time",
            "Here's a concise strategy: Set small, achievable goals and build routines. Use reminders and accountability to stay on track. Celebrate small wins to stay motivated. Brute perseverance helps, but having clear, manageable steps and support systems can make a big difference.",
            "I wanted to start working out, but did the same thing. Tried something for a while waiting for motivation…It never came. What help me was hearing a podcast about changing my mindset. Instead of thinking ‘let’s workout sometime tomorrow,’ I switched it to ‘on Tuesday morning I workout.’ After about six months it’s still working. Hope you find what works for you!",
            "I'd like you to be my mentor please. Good advice!",
            "AI generated comments and posts."
        ]
    },
    "[TEXT] \"Pain is inevitable. You either suffer the pain of discipline or the pain of regret. The difference is the pain of discipline is temporary while that of regret is permanent.\"": {
        "title": "[TEXT] \"Pain is inevitable. You either suffer the pain of discipline or the pain of regret. The difference is the pain of discipline is temporary while that of regret is permanent.\"",
        "score": 94,
        "url": "https://www.reddit.com/r/GetMotivated/comments/1diynl1/text_pain_is_inevitable_you_either_suffer_the/",
        "content": "\\^\\^",
        "num_comments": 13,
        "comments": [
            "True to an extent, but while you can't change your past, the pain of regret does not have to be permanent.",
            "Regret is most certainly not permanent",
            "No it's not. Just lower your standards and expectations and you're gucci.\n\nPut it another way - I'm not going to beat myself up for not buying bitcoin, not becoming a doctor/lawyer/blah blah blah. Imma just live my life and be cool with it.\n\nI'm constantly comparing down - man it could be a lot worse!\n\nWhat a difference attitude makes huh!",
            "What is the point of commenters deconstructing and debating this exactly? It's a motivational text to make you study or work, it's not about killing yourself with high expectations. \n\n\nThanks for that, I need to remind myself there are consequences when I procrastinate :)",
            "No regerts!",
            "not if you have CIPA",
            "Nice one bud",
            "I remind myself of this one when I’m dicking around and putting shit off.",
            "Totally feel you on this! Discipline sucks in the moment but think of it like ripping off a band-aid—quick🔥 and done. Regret, though? That stuff sticks around and haunts you like a bad tattoo. So yeah, it’s like choosing between a tough workout or feeling crappy later for skipping it. Short-term pain for long-term gain, right? \n\nHang in there, you've got this! 💪\n\nhttps://preview.redd.it/3bu2wh32xj7d1.png?width=1620&format=png&auto=webp&s=cc61afec74835deb3f9e3fce8ceda552c75dbac2",
            "I maintain the discipline of going to the gym five times a week, and I've been doing that four years. \n\nI feel the pain of the gym all the fucking time, and there's a bit of me feels regret for not sacking it off and enjoying not being riddled with joint pain.",
            "Isn't it wild how life makes you choose between two types of pain? You either push through the pain of staying disciplined or live with the sting of regret. One fades with time, the other lingers forever. Whenever I'm dragging myself out of bed for a run or sticking to a tough project, I remind myself that the pain I feel now is temporary. But if I quit, that regret sticks around for a lifetime. So, I'm choosing the pain that helps me grow.",
            "Unless you're on your deathbed, thinking about the all the shots you didn't take, and moves you didn't make :)",
            "> I'm not going to beat myself up for not buying bitcoin\n\nI don't regret it regret it, but I do sometimes wonder what what my life would be like if I hopped in on the this particular pyramid scheme day one cause there was some real choice times to hop off and cash out"
        ]
    },
    "[Image] Magic is easy if you put your heart into it. - Michael Jackson": {
        "title": "[Image] Magic is easy if you put your heart into it. - Michael Jackson",
        "score": 7,
        "url": "https://imgur.com/a/m2wkUgj",
        "content": "",
        "num_comments": 6,
        "comments": [
            "https://preview.redd.it/0z6uassisj7d1.png?width=1620&format=png&auto=webp&s=d9023234a18a392ab93c1475a44a043450a0c9a9\n\nIt’s like saying, 'Hey, just sprinkle some passion pixie dust✨ on whatever you do, and voilà, magic🪄 happens!' Whether it’s cooking 🍳 , art 🎨 , or even organizing your closet, doing it with heart💖 makes everything feel a bit more magical.",
            "No thank you. ",
            "pedophilia is easy is you put your dick into it",
            "that fella put his 'heart' in places he probably shouldn't have, and I have a feeling that what I consider magic is wildly different from what MJ would consider magic",
            "Magic was his nickname for the little boy next door to him.",
            "To give someone a piece of your heart, is worth more than all the wealth in the world. - [Michael Jackson quotes](https://quotlr.com/author/michael-jackson) are really heartwarming"
        ]
    },
    "[Discussion] Anyone have any stories to share about themselves how they ended up finding their dream job in their 30s or earlier? ": {
        "title": "[Discussion] Anyone have any stories to share about themselves how they ended up finding their dream job in their 30s or earlier? ",
        "score": 163,
        "url": "https://www.reddit.com/r/GetMotivated/comments/1disrck/discussion_anyone_have_any_stories_to_share_about/",
        "content": "I'm currently in my 30s and struggling. I post here quite often but looking for any individuals who have really fixed their situation in their 30s and realized maybe that's what they wanted all along? \n\nI had big goals when I was younger but I gave up on everything for about 7 years in my 20s. Ie: friendships, dreams, relationships, goals - Pretty much everything.\n\nWas wondering if anyone has gotten back on the horse in their 30s and moved towards their goals again. Did you succeed? Did you fail? How did those goals change? Were the changes worth it? What ended up happening and how did you make it happen?\n\nThanks guys",
        "num_comments": 113,
        "comments": [
            "At 38, I'm currently working in a comfortable office management job that pays well and is only as demanding as I make it. \n\nTo get here, I followed these simple steps: \n\n- failed out of college at 19\n- worked warehouse/shipping jobs for 3 years\n- failed out of college (again) at 22\n- worked in a horrible office for 3 years\n- quit on a whim and used my savings to start my own business\n- drove my business into the ground within a year because I didn't actually know everything\n- took a job in a mail room and enrolled in weekend/evening classes at community college beginning at 26\n- applied for and received promotion to office assistant\n- completed associate's degree in 2.5 years \n- enrolled in online classes to earn BS in Finance\n- applied for and received promotion to office manager at 31\n- completed BS Finance program at 33\n- stayed in comfortable management job anyway\n\nI didn't include the many, many failed attempts to secure promotions / new jobs. \n\nThere are so many ways to get where you'd like to be. I didn't do much physical \"work\" to get to this point, but I studied and put in extra hours to get ahead bit by bit.",
            "In my 30s I've stopped caring about a \"dream job\". I have a dream pay-range I fight for with certain benefits so I live my best life. \n\n\nThe other things I do in life, my hobbies, creative projects, activism work, socializing, travel, are what make my life fulfilling. \n\n\nIdeally, I'll be fully out of corporate and have my own business one day.\n\n\nMy \"dream job\" is financial freedom from a crony system I suppose. ",
            "I am 30, for 8 years I just floated through life doing a job I hated and everything was grey because I was too scared to do anything else because I was good at what I did. I was really happy when Covid happened because it was when I said enough was enough. I quit. I got a job in the industry I wanted to pursue knowing it would just be the start, I went back to school(still in but kicking tookus) and am hell bent on finishing because I refuse to stop until I get there, I can’t go back to grey",
            "Let me start by saying this.  My situation wasn’t the best.  I was working a crappy retail job, making no money, defaulted on a federal student loan (60k worth), defaulted a credit card, had no car, dropped out of college and was just overall depressed.\n\nSo I’ve learned a lot since turning thirty.  I’m now in my mid thirty’s.  My journey started at 27.  The biggest thing I can tell you is don’t chase the dream job.  Live life.  Life is not about work. No one will ever care what you did at your job once you’re dead and gone. Consumerism captivates us as humans, there’s a whole world of beauty to consume for a relatively cheap cost.  \n\nFinding your happiness is the first step.\n\nMany people don’t eat well, which adds to you feeling stressed and abandoned.  Try to eat unprocessed foods.  Don’t stop for fast food go the supermarket and pick up a meal. \n\nMany people don’t sleep well, due to eating poor food and not working out, stress, etc.  try to set guidelines for sleep and exercise. If you don’t make them a priority it won’t happen.  You will fall off the schedule, when you do don’t let you mind trick you.  Get back on the horse and back at it.  4 months of good eating routinely and exercise will have you prepared to get at it with the rest of things you want to figure out. \n\nYou start to realize the biggest value in life is time (not money) and health.  Take care of yourself, eat well and work out.  Learn how to love discipline.  You would not believe how good you will feel just doing that. And you don’t have to work out hard,  just show up and do what you can.  Walk a mile, the. Two.  These little accomplishments add to your overall outlook and demeanor.  The job will always be there, and you’ll find doing those things I just said will make you not care as much about the daily grind at work.  Once you find yourself, then you can search for the dream job.  Typically though along the journey of self improvement you will meet others in their journey, which will open up a lot of doors for you.\n\nMy biggest downfall was alcohol. I was successful now had a house, two kids, loving wife.  I still have all that. But my motivation now is so insanely focused since I removed alcohol.  I don’t count days, and I’ve never said I quit.  I just don’t drink, and since I’ve done that, every day I’ve been getting further and further away from wanting a drink because I realized how bad it effect my mood, motivation, and general well being.  \n\n\nI didn’t realize it at the time but looking back at it now I see it.  It took all my motivation away.  It hid the stress, but only temporarily.  I never went to a rehab or AA, I just decided I’ve done this long enough and I want to see my full potential and eliminate every excuse.  It’s wild that when you take away the excuses, you will make progress.  \n\nYou have to enjoy the process, and the best way to do that is to do what you can to fix and find yourself.  \n\nTherapy was also a huge help of giving me some tools with self discovery.  \n\nYou decide who you want to be.  No story on Reddit is going to change your life.  Only you can do that.  Stick to a routine.  \n\nMike Tyson said it best, discipline is loving the thing you hate to do.  \n\nI went from knocking door to door, to sales, to management, to owning a company, to working for someone how negotiated a very good package.  \n\nI thought I wanted money, but the reality is, even if you had 100k more than you have now, it won’t change your life. It can feel like it would but believe me, it doesn’t.  Time with my kids and wife is the most valuable thing to me.  Money will always be there, but our health and well being will most definitely fail.  \n\nSo I enjoy the ride.  The money came after I discovered who I wanted to be.\n\nI have no degree, only a hs diploma.  You will see that the people who “have it” are a certain type of people.  The accolades do not define the person.  What type of person you are and how you help and treat others does define who you are. The most successful people I’ve met (I know plenty of multi millionaires) always sought to lift the other around them, in turn it added to their success.  Most of the people I know who are wealthy (different than rich) are humble, and you would never know they had the money/assets they have.  \n\nDon’t let people sell you on the fake dream that they are self made.  No one is self made.  Someone helped them along the way somewhere, somehow.  I think our culture sells so many lies that most people accept them as true. \n\nI wish you the best in your journey.",
            "Graduated in my 40s and remarried in my 50s have a job I love and it pays well enough! The thing is this...Anything is possible if you **believe** and **work** for it.",
            "By 34 i was living at my parents' in an old studio out the back, sharing a kitchen. Working in a shop basically doing genius bar type tech work. I was not in a healthy place. I watched Trainspotting 2, and there is a scene where Renton meets up with Sickboy again after years and says that he got out of the poor situation they were in by doing a course in accounting. That was a lie, but the idea stuck with me.\n\nWhy can't I do a course? So I found an IT course online i liked. I found most of the study materials for free online. I studied every day after work took the test and passed. I then used that to get myself an actual IT Job.\n\nThen with that job i found myself a nice girlfriend (after a couple false starts), we pooled our money together and bought a house, then we got married. My job shifted to fully remote..so i WFH full time now. I'm 39.\n\nAnd I'm in a much better place now.",
            "It occurred via volunteering with ESC. I volunteered at an outdoor education organization and I believe I truly discovered my calling as an outdoor trainer. Although my volunteering has ended, I still have the goal of returning as a member of the team.\n\nThe combination of my desire to be there and help others with the natural world made me completely sure of my decision.\n\nCurrently, I am attending a university to deepen my knowledge, while remaining involved in the organization. Once I complete my studies, I will dedicate myself fully to the organization.",
            "I started law school at 31. I was working in a “dream job” at the time (managing a horse farm) and dream jobs aren’t all they cracked up to be. Instead of loving your job like it’s a hobby, 9 times out of 10 you end up hating your hobby cause it’s a job.\n\nI do enjoy being a lawyer. I’ve worked mainly in government and it’s a relatively chill way to be a lawyer.",
            "I honestly still feel like I’m floating through life.\nI thought I had my “thing” when I was younger, but even though you may have really awesome talent at something it doesn’t always equate to what you want or need. (Music education is.. dead or nearly there I believe)\nAfter two failed attempts to join the navy, job hopping for a decade, and dealing with a newly diagnosed congenital heart disease..\n\nThe one thing I can say that will help you more than anything else is mental resiliency. Accept losses and mistakes, own them, and then let them go. Keep your chin up, work and be proud of your work, and you will likely find a path to happiness.\n\nJust don’t give up.\nYou got this.",
            "tried to have success in music all of my late teens and 20s\n\n turned 30 with some great moments but with no real “life defining” moments….and since i figured rock music is a young man’s game hope was dwindling….\n\nafter 30 - some clients of my video work (a band) knew i played guitar and unexpectedly asked me to fill in for a tour…which led to me being asked to join the band when i was 31….and write 2 songs for their next album (32) and now i find myself the guitarist  in a  full time touring band, making a happy living….all of which happened in my 30s\n\n\nseriously stop thinking about your age and time. (like i used to) \njust focus on taking the next step….and always doing something to gain ground",
            "It helped realizing my dream job was a job that provided the lifestyle I wanted and not a job that I loved the work for.",
            "Used to hate where I worked. I was dead end'ed in several call center jobs. Thought that was the peak for me. I made a good friend who encouraged me to apply to a place I really wanted to. He kept pestering me about it. It really bugged me. \n\nAlmost felt like his badgering was a constant reminder of what felt like my failures. One day I told him to shut his fucking face and I applied to shut him up. \n\n2 days later, I got the call. They wanted me in the next day. \n\nI never looked back. I thought it would be impossible to be where I am now. All it took was trying. Now I don't work nearly as hard, I meet my quota and slack for the rest of the day and get paid a lot more. Boss doesn't care what I do in office or out of office, provided I have my numbers. And I always have my numbers because it is easy compared to call center hell holes.",
            "For me I spent my 20's kind of trying to figure out what I wanted to do. Was a security guard for a while (which I liked, but it was a bit too dead end to be long term sustainable), long haul truck driver, put myself through the police academy (which didn't pan out), and did security again, then finally went back to school for computer programming, and during that process also became a PC Tech (which was in a way a stroke of luck that I got that job). A combination of coursework and coworkers made me realize that I really had an interest in IT security. Cue series of more lucky events that put me on that career path and now I'm a threat hunter/incident responder and love it!",
            "In my 30s: I got married, had my youngest child, bought my first house, bought my forever house, went back to school and finally finished my BA, started my own business, and started my first \"career\" job.\n\nMy 20s were a hot mess, but my 30s really came together.\n\nI started with my current employer at 36.  Prior to that, I never had a career.  In the past 6 years, I've been promoted twice, been sent on emergency deployments out of province twice, had plenty of acting opportunities, and have increased my salary by $30k (and anticipate increasing about another 20k in the next few years).  I have a good pension, benefits and job security.\n\nI flunked out of Uni in my 20s and in my 30s went back and got my degree (and aced my courses).  \n\nI spend my time with my family and friends, reading interesting books and learning new things.\n\nI feel like life started \"happening\" for me in my 30s.",
            "Almost 40. Spent my 20's floundering and failing. In the past decade I have gotten some great jobs that were right in my wheelhouse and paid rather well for what they were, and they all came from knowing people in those jobs with high opinions of my capabilities.\n\nAs for a \"dream job\"? As the saying goes: I do not dream of labor.",
            "This will sound really useless to you at first but keep reading. So I got big on YouTube when I was 30, but it's the way I went about finding success at something I loved that might help out. What I did was try making money at a bunch of stuff, checking out anything I had a slight interest in. The things that worked out the best I kept doing. If it was working but I found out I didn't like it, like when I got a big laugh at stand up comedy but to get there I had to bomb 3 jokes and it killed me, I ruthlessly cut that out. \n\nI taught my own martial arts classes, joined a band, started learning coding, just dipping my feet into everything but cutting out the stuff that didn't do as well immediately with no hesitation. I ended up with some  encouraging money coming in from about 3 things, but in the end I was shocked that my YouTube channel actually did the best and I've been making a living off it for 7 years now. I would recommend following this process for your hobbies or careers that you might have an interest in. But you have to be ruthless. Cut out that branch so the one that's getting light gets even more light and grows even bigger.",
            "Spent 8 years in a field I hated chasing money and dreams, but realized law enforcement leads to fucked up things and loneliness.  Not to mention Lots of scummy people in positions they don’t belong in, at almost all departments. Walked away on my own terms, Got a new job with my old degree, with better hours and a slight paycut, but I actually feel like I am making a difference and enjoy it. Plus the work life balance has been amazing for my family. I was called a coward, loser, etc for leaving a toxic environment ….but it was the best decision I ever made.",
            "all jobs are trash. that's why we get paid.",
            "If you want it bad enough, it will all be worth it",
            "I didn’t find my dream job until I was 42. I didn’t even know what it was before I found it. Knowing what I went through and the strength it took to leave what I didn’t enjoy makes it all the sweeter.",
            "I'm a crematory operator. My job involves talking to no one and interacting with only the dead. I worked a ton of cooking and retail jobs over the years and I realized I hated people. The dead don't talk. Best part of the job.\n\nFind a job that suits your desired work load and social skills. That way when you get off work you aren't absolutely exhausted and can spend some time on the things that make you happy. Art, gaming etc whatever it may be. \n\nWe need to stop searching for meaning in a 9-5.",
            "If you would’ve asked me what my dream job was 10 years ago I would have said touring musician. Instead I put my effort into a 9-5 corporate job. \n\nNowadays I’m well established in a career I enjoy making a solid six figure salary with great benefits. I still do music on the side, but also have time for many other hobbies and experiences. I also have friends who are successful musicians and I don’t envy their lives. Too much uncertainty, too much time on the road, hard to maintain healthy habits… etc. \n\nI’ve come to realize the “dream job” can be a trap for a lot of people. Maybe shoot for a job that you enjoy that provides you the opportunity and freedom to live the life you want?",
            "I’ve always held the notion of you can help you should. \n\nIn my mid 20’s I started working for an event management firm. Done everything from small 10 person meetings to 10,000+ international conferences. Worked in a niche industry primarily about indigenous issues spanning the globe and quickly learned the similarities between cultures and ideals. Most issues boiled down to control systems and authority beyond sight and the plight of the common people to survive.\n\nI gain a crash course in “remember what’s important”. Obviously your own views and values will determine that but for me it sounded this internal bell and I started to get invested into contributing beyond my needs.\n\nI began planning my project and called it the nation builder. It looks as servicing basic needs, food, shelter, water and power. I now operate multiple greenhouses producing organic vegetables for my local community, including the food bank and women’s shelter. Plans are on the way for green energy production  and heating and we are starting a tiny home community directly connected to the agricultural operations. Power and water purification included. \n\nGoal, build a self sufficient community of 100 homes. A place where you can work remotely but still stay connected to nature as that is what I found helps me stay sane. Do good, be good, foster good. Love what I’m doing and the sweat at the end of the day feels even better.",
            "When I was 31 my job at a giant retailer was eliminated. I had never finished college and decided I wanted to pursue my degree. I went to the website of the university I had dropped out of 10yrs prior to see what my degree options were with the credits I already had. Listed there was “communication disorders”, never having heard of this I did a quick Google search and was hooked. \n\nI spent the next 5 1/2 yrs completing my bachelors and earning my masters. During this time I was married to an alcoholic who couldn’t keep a job and had two elementary aged children at home, \n\nI left the marriage over 7 yrs ago and have been working in my field for the last 6 yrs. While there are things I missed when my kids were young, finding my passion has lead to a better life for all of us, and it is the best thing I ever chose to do in my life.",
            "I had a dream job until I was about 25/26, I did it and realized doing it for a job made me hate it because I couldn't just do it when I was passionate about it\n\nI figured out the core skills i enjoyed from i5 (madly problem solving and user design, with some leaderships stuff) and then looked for other jobs in other industries that paid better and had better working hours. Took a year and a half, and I've been a product manager/owner whatever in tech industry for 8 years now, while I still do my passion projects on the side. \n\nI found the idea of 'understand what skills you like tk use and find all viable career options yhat use these' really helpful",
            "When I was a teen I thought I wanted to be a lawyer, but the cost of school and the job satisfaction of a few that I knew didn't seem great. I settled into entry level management at a call center and left after we had our kid. Once it seemed like time to go back to work, I was looking at job listings that seemed interesting and would work around the schedule I wanted. Being a paralegal fit the bill. I was lucky enough to go back to school during COVID, got my certificate and now I work at a law firm. I don't know that it's my dream job exactly, but it's waaaaaay better than call center life and I do enjoy it. They're also talking about bringing on a criminal law attorney, which I'm kind of interested in.",
            "I was 35 when I quit my job as a support analyst/implementation person and taught myself C# for 6 months. Yes this was a very expensive move and I burned through all my savings but it was something I'd wanted to pursue as I'd been coding on and off since I got my first computer in 1990.\n\nI then got a really shitty, mis-advertised development job which I left after 6 weeks to rejoin my old company as an implementation consultant 4 days a week. I specifically requested 1 day a week off as I wanted to maintain my coding skills.\n\nAfter 6 months I moved to full time with them, doing 2 days a week as a junior dev and 3 as consultant, before becoming a full time developer 6 months later.\n\n6 years later and I'm still a Dev now, which is the longest I've stayed doing any single profession in my life.\n\nIs it my dream job? No but it's one I get satisfaction from, pays decently and let's me learn new stuff pretty consistently. Also, I get to work from home full time, which you could argue makes it a dream job :)",
            "Got out of college, worked in the agencies like the professors said I needed to. Got fired from one, laid off from another. Needed work so started working construction. My friend managed a bike shop and offered me a part time job. I love bikes, but I always thought I was above that. I took it anyway, and it ended up leading me to my current job, doing marketing for a bike company. It’s the dream job for sure. Pay isn’t quite where I’d like it to be, but the work I do is so fun and fulfilling. Sometimes you just have to take a step towards what you want to do, even if it feels like a step slightly backwards.",
            "You have to decide whether you want to life to work or work to live. I traveled and tested for 2-3 years to finally get picked up by a fire department. Now you can get that job easier but back when I was applying it would be over 1,000 applicants for 10 or less spots. It was an always my dream job and I’m fortunate. \n\nIf you can’t work your dream job try to find a job with less hours for the same or more money. I know I know, sounds like a dream. Basically what I’m saying is try to find a job with less hours or great PTO to go travel or do whatever non work related things you love to do.",
            "Hey man. I had my dream job when I was 25. My best friend and I opened a hookah lounge. We did absolutely great, made enough money, made our business better, had loyal and loving customers, took trips to hookah cons, it was an absolute blast. \n\nThen COVID happened. Regulations. Smoking age had changed from 18 to 21. We had been shut down for a while, and one day we just realized we didn’t know if there was any going back to what we thought was normal. \n\nAnyway, we ended up closing and through family connections, I ended up taking my property and casualty insurance licensing class. I absolutely fell in love, and now I’m working on my associate in risk management and cpcu. Absolutely love insurance. Weird.",
            "Your top goals in your career are this....\n\nDo not settle for less\n\nDo not undervalue yourself \n\nPiss on people who stop believing and stop achieving. \n\nIt took me 50 jobs to find my dream job/ career path. I am 42 and just hitting my stride in a job I love that pay great.",
            "I always wanted to be a nurse and finally went to nursing school, starting when I was 35 years old. I loved nursing and would have done it for free if I didn’t need to earn a living. I spent 33 years as a nurse and recently retired. There are so many different areas you can work as a nurse.",
            "So this is the short of a long story. Thought I found my dream job 7 years into being an EMT when I was hired as an EMS instructor at a University. Let my wife follow her career to a new state and I had to start over. Went through the fire academy at 25 (no biggy) as a volunteer firefighter. Fast forward to 2023, got hired full time as a firefighter at 35, changed states again, had to do the academy again at 36. That was taxing.... but no regrets. Career firefighters, serving the public. Love every moment. Dream job for the next 25 years!",
            "31 now and live in the town I want to live in doing a job I love that pays me more than enough. 6ish years ago I was working as a cart runner at Wal Mart and after 2 years I hit the point of either I need to get comfortable being here the rest of my life or go back to school. I chose the latter, I enrolled in community college to finish a transfer degree I started after high school. I also decided if I was going to go back to school I wanted to at least be a B average student because I figured I could do that and still have tons of free time to play games and live life. Turned out that when I actually tried a little bit to be a good student I could get on the Deans list so I them decided I wanted to see how long I could keep that up. Fast forward 3 years never falling off the Deans list and I’m graduting with a Bachelors degree in Information Systems from a proper university, I kid you not, .002 GPA away from graduating with honors. Last time I set foot on a college campus prior to this I was on academic probation. After graduation I took a few months to breathe and then I started applying for jobs in the town I live in now and landed a sweet gig in IT working for a financial institution. \n\n6 years ago I would never in a million lifetimes think the person I was could be the person I became, but I did, there was a lot of luck and lot of help. But there were equal times were I questioned if I was wasting my time or even capable of overcoming the obstacles in front of me. At one point I had to completely rewrite a coding project I had spent months on 12 hours before it was due because I realized all the work I had done was incorrect from the foundation. I cried from the stress/frustration, then took a walk to get myself together and went at it and got it done in 9 hours. \nSet goals for yourself, even small ones and get after it. You will stumble and you will fall, but you control the pace, get up when you are ready and keep going.",
            "Nursing.  Never considered it prior and spent so much time starting and stopping college courses while working various sales jobs.  It’s gotten me caught up more ways than one in life and I love what I do.  Hardest part was actually changing over into healthcare from sales and taking the pay cut as a new CNA (nursing assistant) but I made a 4-5 year plan to finish my RN.\n\nCommunity college evenings for all of the general pre-requisites after work while still working sales dayshift.  Got that done in 2 years by taking 12 hours per regular semester and taking 2 classes online each summer.  Got FAFSA financing, partial subsidies for some loans.  I didn’t go to the cheapest school but I prioritized competitive programs vs waitlist programs.  Some community colleges offer RN associate programs for much less money., but operate by waitlist which can take a few years to start for an applicant.  You are just as employable and often receive help from employers to get you bridge to BSN (bachelor’s in nursing).  I paid 40k to graduate as a BSN, while it was possible (in 2014) to pay 12k-16k at a community college ADN/RN program.\n\nAccepted and finished nursing school with a BSN and thought I would start an ICU new RN residency, wasn’t chosen for that particular opportunity but was accepted to an OR new RN residency and couldn’t have gotten a better fit.  Graduated with my RN 2016 at age 36.  44 now and have 7 years experience as an operating room RN.  Scrub and circulate open heart surgery, transplants, general surgery, plastics, and charge RN on weekends.  Love it and make a nice living.\n\nWishing you luck!",
            "I took an environmental science class in high school and realized I wanted to get into renewable energy. \n\nI knew I wanted to do something about the climate crisis and figured that’d be the best way for me to contribute. \n\nI’ve been in the industry for 7 years at the age of 28. I am good at my job and I like it. Seems uncommon so I am grateful.",
            "I think if you have at least 2/3 of the following, you'll be pretty happy with your job/caree: work, coworkers and compensation.\n\nDo you enjoy the work? Do you find it meaningful? Does it keep you stimulated? Is there opportunity for growth?\n\nDo you like the people you work with? Do you feel like part of a team? Do they keep you stimulated / vice versa?\n\nDo you feel you're being meaningfully compensated to do the work? Is there opportunity for raises and bonuses to keep you incentivized? Do you receive certain perks in-lieu that you enjoy, even at the cost of lower pay?\n\nOf course your prioritization of these will change over the course of your career, but it's always been a good compass for me.",
            "I started my career in hospitality at 19 working at a hotel front desk while going to school for cybersecurity.     \n\n\nIn my early twenties I became the General manager at the hotel, mid twenties I got a role at the corporate office.     \n\n\nEarly 30s I moved teams to something more technical which involved learning several new skills. This position helped me discover that I love working with data whether that is coding, analysis, whatever.     \n\n\nTwo years later I'm on a data science team and I'm thrilled on a daily basis to get up and go to work.     \n\n\nI didn't know what my dream job was or what I wanted until I did enough jobs to discover it. ",
            "In my very early 30s I began to pursue a career in archaeology. That had been my “dream job” throughout childhood, but I followed a different route. I started by volunteering at a local museum during my free time, helped with a couple of field schools, then took an “as needed” position slinging a shovel for a local Cultural Resources Management firm. After a couple of years of that I started taking the core classes required for a bachelor’s in anthropology (working CRM locally, as able) so I could apply for grad school. In grad school I put in for a TA position to reduce tuition and continued in CRM part-time. An accidental meeting in school led to a permanent position with upward mobility, and though I’ve had to move a few times to advance have made a career of it.\n\nHas it been smooth sailing every step of the way? No. Would I have preferred to win the lottery and and not to *have* to work at all? Of course. But since I have to earn a living I reckon the jobs I’ve had have been pretty satisfying — sometimes more so, sometimes less. Would I do it all again? 100%.\n\nTL;DR: Go for it.",
            " By accident during Covid, Jobs were remote and I got this career truly off the strength that the hiring process was virtual. I would have never made it in the door if it was in person.  I had so many cheat sheets around my computer screen, it was ridiculous.",
            "In my 20s, I really wanted to serve in the military but believed my eyesight disqualified me as it did for law enforcement positions I was interested in. I worked at a dead-end position for a while but kept following the news about developments in the world and continued to feel the call to serve. I reached out to a Navy officer recruiter and they laid out everything I needed to do. \n\nI went to Officer Candidate School, had a series of incredible experiences and mentors, and I am proud to serve. My work has impact, I lead sailors, and I carry on the legacy of those who served before me and prepare the way for those who will come after.",
            "I ended up taking classes in my late 20s for programming back in Sweden. I now work for a large gaming company in the US with some very like-minded people, having a blast. But I will always love programming, I do it in my spare time a lot as well. The logic puzzles and defining data is something I truly enjoy doing.",
            "29 I started my career path. Previous to that following university I had a lot of prep, volunteering and job experience for a career in policing. Completely veered after the pandemic and found I have natural leadership/sales inclinations. It's never too late to change your path man. ",
            "I worked in the restaurant industry from 18-29. Started off as a server and made my way up to General Manager. It was a grind day in and day out but I was really good at what I did. I knew I had to make a change before my wife and I start a family and finally took a leap and am now in my dream job working at Gordon Food Service who was one of my suppliers.  They are a great company to work for and I finally have the work/life balance that I craved.  My recommendation is to take every opportunity to learn what other people do and research good company’s to work for. The more you interact with people and focus on what you want, the opportunity will eventually present itself. Good luck and I hope you find what you are looking for!",
            "I've always known I would end up in IT, wouldn't say the career itself is my \"Dream\" perse, but it certainly is my Vocation.\n\n2 years ago I got an opportunity to work at a company I didn't think was even possible.  They were opening a new facility and I thought, fuck it, I'll apply for that place because why not.  Turns out the position was for every facility and the scope is far broader than I anticipate.  Very very rewarding work and I'm loving it here.",
            "I don’t have a dream job but I do have a job that I enjoy and I’m 38",
            "Wanted to start a business but didn't know what. I couldn't find a good Montessori school for my 2yo and research turned into a business plan. I started with a 4 classroom school that I leased and built it up to 2 locations (8 classrooms and 15 classrooms) before selling a couple years ago. I've started another business and am very happy, feel very lucky, and experienced more stress than I ever could have imagined. I was 35 yo. Owning a business is one of the hardest things you'll ever do. Make sure you research a LOT before starting one. Score.org has mentoring and amazing resources to help you btw.",
            "I’m 33 and about to quit my job to pursue my dream job: video production and working in the entertainment industry. It’s arguably harder work with longer hours but the pay can be pretty awesome and it’s a way for me to push towards what I ultimately want to do with my life: directing. Been doing it for a long time for no pay and I finally decided a few years ago I wanted to get my certification in digital filmmaking. Haven’t looked back since and I’m currently very happy with my path that I find myself on.",
            "I had it and lost it. Sometimes it feels worse than if I never had it. 🤪",
            "honestly i don't have a dream job  All I want is to live my life . As I'm 29 years old. I have my responsibility as a daughter I'm not complaining about that . I just needed work that has a good salary to sustain support for my parents They are getting older . It's my will to help them though it looks like I'm locking myself to responsibility that shouldn't be mine to handle.but they are kind.I will help them.. People have a different life approach and this is mine and I knew this is a good thing to do. Well I'm not yet financially stable. I can't afford to date yet though..I would rather be single than be a burden to relationship.  🤣 just  This past year and now I have reached the point of questioning my wants and dreams but I couldn't find them.. It's exhausted me working in retail corporate. That I knew the very first time .I hate this job. Every time I turn back to think what happened in my mid 20's . I saw myself enjoying life not successfully nor failing. but I knew  it's not enough. . Finding self will never have an ending. No amount of good words can give me clarity because I know my actions in everything and be present in everything is a matter. I gave up thinking about how life I need to be in future or what life I want for the future.  But I'm making myself sure that I will be present for whatever circumstances in my path. I believe in myself I can do it with a God presence in my life . I have no worries but I cry every time I feel down . this is my life approach I needed to strengthen myself most of the time. It's tiring but I just couldn't give up this life. It may not be as good as it is but I know it's not worse compared to people who live in the street ,become homeless ,no people around to be supported . I knew their life was harder than mine. But I hope to see them living better .",
            "In my 20's I had a no-mobility job. Just show up to work, do work, go home. Income wasn't high enough to move out so I lived in my parent's home.\n\nWanted to turn to a real career path so I started taking night classes; had to take pre-requisite courses to start and over the course of 7 years got an advanced degree and the additional certification and training for a career path. I applied to several places and lo-and-behold, I landed my dream job. I was 30, was out of that no-mobility job, and thought I had finally made it into a stable career path. Success... right?\n\nImagine then, after putting in 7 years towards an achieved goal, that in 18 months I would flame out hard and leave that line of work. I ended up taking whatever savings I had and went backpacking for the better part of 2 years, and then ended back up in a different no-mobility job in my 30's. \n\nMy big break came when I was 35 when I chose to dive into a full-time unpaid internship to learn and grow a new skillset. Imagine someone that age showing up for 9-5 Monday through Friday, and not getting paid...  It was completely worth it. I am currently in a position that I enjoy, feel passionate about, and am fulfilled with what I do.",
            "It’s never too late to start over, about 6 years ago I was working nights and going to school during the day. I had a lot of struggles and a partner that didn’t help out when it came to taking our child to school. Got tired of working for Walmart and juggling everything, quit school took a job working in corrections that pays pretty well and worked hard. I’m happy to not have to struggle anymore. Very content. However I’m not hard to please and just roll with the flow. Good luck and there will be brighter days!",
            "At thirty four I realized I've never done anything hard in my life and always went for what was sure to be a success, instead of things that maybe needed more work or had a chance of failure. I started my Master's Degree while working full time. I networked and did an internship, and when my intern boss heard of an opportunity, she mentioned my name immediately. I got hired and have had a solid job in my career field for the last six years. I'm even working on a project manager certification.\n\nHere's the REAL secret though.\n\nThere is no such thing as a dream job. No job fairy is going to whack you over the head and tell you This Is The Job You Have Been Waiting For. \n\nWhat's actually happened is that someone dropped a ton of Legos in your lap already. Those Legos are things like \"works well in a small group\", \"loves to beat a deadline\", \"enjoys research\", etc etc etc.\n\nYou have all these Legos. You can build them into so many things. The same qualities I just listed made me happy doing sales as much as it makes me happy working in library administration, and I can think of a few other jobs I'd be pretty excited to have too.\n\nFigure out your Legos, and then figure out what skills you need to get where your Legos want to take you. \n\nI highly recommend What Color is Your Parachute. It's a great book with not only career-finding strategies, but a lot of exercises and such to help you figure out what Legos you have and what you can build with them.",
            "I spent my twentys pouring every ounce of every one of my days into becoming the best Chef that I could possibly be. I worked every moment, I travelled the world, I owned two restaurants, I rose to a height in my field that I was very proud of, and I guess I still am.\n\nThat being said, I also turned 30 with absolutely no friends, only completely ruined relationships, no money, a bit of debt, and no formal qualifications.\n\nI also ran into some health issues that made impossible the effortless, limitless work horse ability of my 20s.\n\nI am 33 now, and am a technical writer, in the defence industry. I am well paid, well looked after, and I work only very sensible office hours, with all of the flexibility afforded by modern day workplaces. I have a stable relationship, have repaired some valuable relationships and am generally just a lot more.....comfortable?\n\nI do not regret my 20s and I am definitely taking the steps needed toward not regretting my 30s.\n\nI offer this tale not as an example of 'getting back on a horse' but perhaps as a telling of 'switching horses?'. though I guess by a lot of conventional measures my 20s could be considered well and truly falling off of any horse at all.\n\nGoing up, going down, moving all around-----> It is all just changing direction. To think of it in a more neutral sense like this can help, I think. When stuff 'goes to shit' this is just a change in direction, just as much as when things suddenly start to go well. What our actions can do is dictate the direction of that change.\n\nOr maybe that is all garbage? I don't know and likely never will, it is working OK for me though, and it's all I have got, so it is what I have to share.",
            "I was a video creator and overall communications guy. In my early mid thirties I started feeling pretty over it.... But I had a really good client that gave me as much work as I was willing to do but even then I just felt.... Uninspired by the work I'd been doing for about fifteen years. \n\n\nMy big client had a shake up in leadership and the CEO asked me if I'd apply for an executive role. Management was not something I ever aspired to but after much thinking I decided it sounded like a challenge so I applied and got the role.\n\n\nI'm coming up on three years and can't imagine going back to my creative role. While I hate certain aspects of management the role is always interesting and challenging, and I'm in a position/level that I frankly didn't think I'd ever qualify for.",
            "I hit a similar rut in my 20s but found my stride in my 30s. I took stock of what truly mattered and pursued it relentlessly. My goals shifted, but the journey back was transformative. I failed, learned, and ultimately found a fulfilling career that aligned with my passions. Trust the process; it's worth it.",
            "I am still shooting my shot",
            "I'm 32, I thought I had found my dream job at 28 as a forensic lab technician, but I gave up on 'dream jobs' after 3 years of working there. Don't get me wrong, the job itself was pretty cool, but the way it was organised was absolute crap. It's a government organisation, so there was never enough budget to buy the absolutely necessary things, complaints about building safety were just added to a pile,... The team also lacked leadership, with a team of managers who all thought their way was the best way to work. But it's hard to follow instructions if those instructions change depending on who said it 🤦\n\nGot a burn-out from that job, went to therapy and after trying to fix things at that job didn't work, I started looking for another one. \n\nI stopped looking at specific goals and just searched for jobs that would fit my personality. Currently, I'm working as a software consultant for a company that provides patient management software for hospitals. Never would have expected to do this job, because I was deadset on working in a lab, but the job fits me so well, I'm actually happy now. \n\nSo main conclusion here: don't fixate too much on that 'dream job'. Just improve whatever skills you have (or start working on the ones you lack) and cast a broad net while searching. I know a lot of companies focus on education and specific degrees, but the ones that can see through and look at your actual potential are the companies you want to work for 😉",
            "Dream job is a tricky term. I don't have a \"dream job\", I have a job that best compliments the way my brain works and my lifestyle outside of work. Those two things combined leads to high job satisfaction for me. \n\nMy job is:\n\n- very black and white, 1s and 0s type of work\n- keeps me moving throughout the day\n- doesn't include a ton of in person meetings with others\n- I don't work directly with the public \n- I collaborate on a small team and work with the same guys everyday\n\nIf I had another job that checked these same boxes, I'd be into that job too. I only figured out what I really wanted after working jobs I hated and asking myself \"ok what's actually important for me to not hate my life everyday\"\n\nIn previous jobs, I was stuck working with \"clients\", sitting at a desk, and having tons of meetings that could be emails. I wanted to eliminate or greatly reduce those things when I moved careers\n\nAdditionally at my job, I have 4 days on, 3 days off and that's been a game changer. I didn't necessarily go looking for the schedule, but when it was presented to me, I jumped because I knew I'd hate my life less if I only worked 4 days a week\n\nGet real specific with yourself about what you love and hate at your job. What are negotiables and non negotiable, then, when you search for a job look for things that serve those reasons. And open your mind up to many different types of jobs, as long as they serve those things that are important to you\n\nIt's not so much dream job, but what makes getting up to this job every day, tolerable",
            "I was 30 when got back to my dream job. \n\nIn my early 20’s, I moved to the Caribbean as I’ve got bored of my life and was getting me anywhere. Then got offered a position in a all inclusive hotel.\n\nThat was fun at the beginning and met lots of people, had a great time in different ways. Then needed to take the decision to change to another hotel. Wasn’t quite the same and more exploited.\n\nDecided to go to be interviewed for a tour gifting job and found myself in that. Enjoying every minute. Got amazing feedback and grew in the company.\n\nThen needed to move cities and tried to get another job. Long story short have been miserable for 3 years, until I took the decision to give up on everything and I mean everything. I was really depressed.\n\nStarted taking any old opportunity to build up again from the beginning, doing little fun jobs. Then got myself into getting certifications and study hard for about a year more.\n\nSuddenly, I’ve got back into my beloved career as a professional tour guide, studied more and a year later, I was at the top 10 of my country. That made me super happy and I was enjoying my passion and not working a day, as it was my passion.\n\nI’ve made good money doing what I loved. Few years after me the love of my life moved to a new country and tried doing the same here. Didn’t work that well in the beginning but now I’m on a different roll. I’m in my 40s but creating unique experiences for people from my desk and still making good money.\n\nChange is certain. Sometimes you just need to accept it and let go everything.",
            "I was lucky to find an awesome career councillor (when I was 36) and she helped me by breaking all my past jobs down into bite sized phrases and working out which bits of them I like vs what I think I’d enjoy and also things I’m good at. It helped me to talk to prospective employers about my strengths and ambitions and I changed to pursue a more aligned career. Took a step back but got a promotion within 2 years and now have reached my goal",
            "I’m in my dream job - I’m a mental health psychotherapist (age 29, UK).\n\nStrangely, I thought my dream job was to be a chef as a child, loving food, cooking and baking at home. I then had my first part time job at 15 as a kitchen porter at a pub and saw the grind and thought nope this isn’t for me.\n\nIn 6th form, I picked up psychology as an a-level as was a people person at school and was fascinated by what makes people “tick”. Sat down in my first lesson which was about how memory works and I was absolutely gripped. Never felt that way about a school subject. Got onto the lessons about freud and psychodynamic theory and a graded exposure for phobias and just knew I needed to pursue it.\n\nStudied clinical psychology and graduated as a therapist and been practicing ever since. Don’t get me wrong, 40+ hours a week is tough but I absolutely love it. Would I like to do it a bit less so it frees up my time and energy for other things? Absolutely. Do I still get the sunday scaries? Definitely. But, not a day goes by where I don’t feel instrinsically rewarded by making a difference in people’s lives.",
            "Im 25 and still lost in life. I am diagnosed with adhd and it’s hard to stay on track. I set reminders and follow certain care plans using the care clinic app just recently. I hope this works",
            "I dropped everything, went back to school at 34, in a much better place now.",
            "I joined the military in my late 20s. I got a job with a high-level security clearance. I got three associates degree, certifications, and bachelors degree at no cost. I am currently working toward a masters degree at no cost.\n\nAs I approach my mid 30s, I'm positioned to work in several fields that are exciting and meaningful. More importantly, I respect most of my coworkers and enjoy being around them.\n\nIt's not my dream job, but it doesn't kill my spark the way other jobs and environments did prior to joining the military. That said, everyone has a different military experience, and our lives before the military impact our experience. I worked stressful and dangerous blue collar jobs 50-80 hours a week for sketchy employers prior to the military. So, my stable, structured office job in the military feels easy to me.",
            "i never finished any form of schooling in my life. droped out of high school and started working at age 14. i worked just about every shitkicker job you could think of through my teens and my 20s, by 30 I just accepted the fact that I'd never find a job that I actually liked.\n\nthat changed when I met my current partner at age 30. we met while she was on holiday in my country.\n\nafter a year together the reality was, for our relationship to continue after her visa expired, I'd have to go back to her country with her and i dont speak the language (and its not an easy one to learn). I realized I'd need a job I could do from anywhere. finding something online would be a good move. \n\nI didn't know shit about computers or anything, but for some unknown reason i thought, maybe I can learn to make websites? I had no idea what I was getting myself into, the process of learning how to code was insanly difficult for me but i really enjoyed it.\n\nafter making a few decent hobby projects I landed a job as a programmer at a dev agency and I can honestly say that this job has been such a life saver. I was so dejected about the idea of working for the rest of my life previously, now I actually look forward to going to work because I truly enjoy it. \n\nI have to pinch myself because I can't believe how far I've come from where I was at 30. Back then I could only afford to live in shared houses, now I own my own home!!\n\nthat was 4 years ago, we ended up staying in my country because things were going so well for us here. \n\nAnyway, in my case, finding my dream job was by complete chance. I said to myself \"I hate doing everything so I'm just going to do something\" turned out I really liked what I landed on. I know this is shit advice, but hopefully it at least shows its possible to find happiness in a career change after 30.",
            "I have a love hate relationship with my job - I love my career path, love the pay, love the company I work for, love telling people where I work - I sometimes hate the people I work with, I hate the stress this job gives me and hate that I can't think of anything else to do apart from this job.\n\nI work in Big Tech, a certain social media company that that is normally not associated with negativity. Women love our product. I make mid six figures and work as a Product Manager and getting to work in GenerativeAI.\n\nWhen I was 18, I repeated final year of high school, failed to pass first year of college. I was told that I don't have a future except for working in contact centers. I lost my dad at 22 and that was a kick in the nuts/wake up call. I worked hard and started getting results. That's when it hit me, hard work is the only answer - not everyone is lucky and what we see as luck is just circumstance & hardwork that we can't see. So that gave me the impetus and motivation that if I put my mind to something - I can achieve results. Although the results aren't direct and immediate but in the long run consistent hard work does bring benefit.\n\n16 - Repeated HighSchool  \n19 - Failed out of college  \n22 - Lost my dad/completed college  \n24 - Moved to Canada for a better opportunity  \n24 - Landed first white collar job after 7 months of applying/networking - basically made applying to jobs and learning career paths my full-time job while working odd jobs  \n26 - Decided I wanted to work in big tech and did everything in the pusuit of that  \n31 - Completed a top MBA program while working fulltime  \n36 - Making $400k, have a kid that is my life and not stopping anytime soon.\n\nI wasn't consistent - there were years where I just lazed around and played video games, chilled with the GF/now wife and got complacent. But every now and then I'd do a check and see if I can do better than where I am.\n\nIts hard to just flip a switch get motivated, I'd say join career oriented sub-reddits, join online/in person communities that focus on career and self growth. Peers help you be in check.",
            "That's around when I did it. Realized I wanted to be self-employed in my industry, a supplier vs. a client (was a marketing/advertising designer, wanted to do the photography and some free lance design). It took about 9 years of learning more at my job, getting free lance clients on the side, building up profit sharing (left the company with $10k in maxed out sharing after a decade). I was shooting side-projects in my garage (once I shot a project in ankle-deep water, garage would flood in the rain, that was fun), got a couple good clients and built up some contacts. I really worked at being the best client to my larger suppliers (like printers and the tech side of the business) to the point they'd hire me to do training seminars with their other customers. Those suppliers were my best source of gigs when I went free lance, they were in every major office in town. This was early days of Photoshop and I'd get a lot of \"if we can't fix these photos we'll need to re-shoot\", got a rep for that as well.\n\nSo I opened a little studio, ended up sort of being \"one man ad agency with in-house photos\" for smaller businesses. Just-photos and Photoshop for larger agencies. Then when video editing hit the desktop, I started shooting video, now video and animation are most of my business.\n\nA HUGE part of this process was my wife was slowly losing it and refused to get help, but my kids were awesome, and I needed a life where I could live where I work and have space for my kids; but if my wife knew I was making an escape hatch, she'd have killed me. (When we split up, she did tell me \"I lost you, I treated you like shit, you found the best way out\" etc., and we have a good relationship, co-grandparenting and so on. I'm still VERY close with my kids. It was a very very hard nine years, but I basically tunneled out of prison with a spoon. My wife will inherit millions or tens of millions someday, she'll be just fine. I did walk away from that future, but... worth it!) So my *motivation* was extreme, but I imagined the life I wanted and worked my ass off to get there. But not the usual \"work your ass off for money\", I did it for peace and happiness and a home for my family. And my actual work is pretty cool, some days it's a blast, always challenging and new.",
            "Bro you’re in your 30s and gave up? I’m just getting this party started!!!!",
            "retired nurse here.  every time i found my 'dream' job it always without fail the worst job ever.  i let go of that idea and finally was able to see the job in reality, good parts and not so good parts.  i lived better.",
            "I’m a tad older than who the question is directed at (mid-forties) but what I can say is that you’re never too old to find your dream job. Mine came about in my early forties after a period of struggle and I turned that struggle into my life’s purpose. My other bit of advice in terms of finding that dream job is to reflect on what you loved doing as a child. Where we found joy at that young age is so telling, before we get distracted by adulthood and the responsibilities that come with it. Also, a dream job is not dreamy every single day. It often comes with strife and hard graft like any other job. But if you are able to figure out your purpose and what you love to do, then craft a job around it, that’s where you’ll thrive. Check out the definition of ikigai on Google then get to work on yours!",
            "34, living with my parents, unemployed, no idea what I want to do. Luckily I have savings so I’m writing a book and traveling. I have no idea what my passion is, hopefully I figure it out 🤷🏻‍♂️",
            "I’m currently 37, just moved to US from Ukraine. For 13 years I was selling luxury furniture, was sales representative in European countries. Then I got my MS in Psychology and worked as cbt consular for 1 year. After moving to US I enrolled in LPN program. I always felt like I want to be a doctor or at least work in medical field. But my father discouraged me ( he was a doctor in Ukraine and the salary is really low). But you see, at 37 I’m doing it). What helps me to make changes in my life? I realised that all limits are in our mind. We can chose how to think and what choices to make   In any moment of our life.",
            "I'm 32 now. Started studying natural sciences when I was 17, but gave that up. Got a languages and arts undergraduate degree at 21, then started a program to become an ESL teacher, then gave that up too. Spent a year working in a cinema and a gym, wondering what to do with my life. I then made a new girlfriend and after a year together, she suggested I try nursing, thought it might work for me and fit well with my personality. I got in a nursing program and immediately liked it.\n\nIn my second semester, I met a nurse practitioner who invited me to spend a day with her at work. That was when it really clicked. It suddenly all locked into place in my mind that this was what I wanted to do with my life. I sprinted through my nursing program, then my BSN and finally, my masters degree and my specialization, 8 years in all. I passed my board certification exam and started out last january.\n\nIt's everything I wanted it to be. Dream job. Everyday I help people get better care and improve their quality of life.",
            "Yes, it's possible. I hit a low point in my 20s, lost direction, but in my early 30s, I rediscovered my passion for design. I took courses, networked, and got a junior role. It wasn't easy, but I advanced, learned, and now I'm doing what I love.",
            "Keep pushing, pal! I was a hot mess, spinning my wheels until 34. Figured it out. You will too! “If you want it, you gon' get up earlier than anyone” - young thug : )",
            "Unless you're an artist and seeking to sustain yourself that way, most jobs have educational requirements. School's usually a good starting point.",
            "Dropped out of college on 9/11 and enlisted in the military as an explosives tech in the air force.\n\nDeployed a lot, turned a lot of bad people into chunks of bad people, put myself through college with zero debt, commissioned as an officer, absolutely slayed it at my job, turned more bad people into chunks, met my soul mate (somewhat ironically, a sunni muslim from the Middle East), put her through college, saw her commission as an officer in the air force, helped her brother immigrate to the U.S., saw him enlist into the air force and absolutely slay it at his job......\n\nNow I'm going on 23 year in uniform, retirement eligible..... household income well into the six figures with 3 houses we own, 2 cars we own, 3 kids whose college is paid for, and zero debt.\n\nI had to do some pretty crazy stuff on occasion, so it's not for everyone..... but the military is absolutely a path to upward mobility for those with ambition and a willingness to sacrifice their bodies, mental health, family life, and sanity for mission success.",
            "In my early 20s, I experienced trauma in undergrad, which was compounded by the school turning a blind eye. I was undecided before the trauma and developed PTSD and hyper-fixated on my studies to try to escape the pain I was in. When I graduated I was really lost career wise, so I took a basic job that paid the bills and allowed me to not think about work at home. A few years later, I stumbled into a therapeutic retreat that pulled me out of the deep depression I had sunken into as a result of untreated PTSD. After the retreat, I got diagnosed and spent a few years focusing on healing. \n\nI am so grateful for this therapeutic retreat experience that worked for me more than any talk therapy ever has or well, and that inspired me to want to create similar experiences for others who are struggling to deal with their own trauma. \n\nI am 32 now, and 3 years into a 10 year plan to create my own therapeutic retreat center. I now have a masters in social work (which was especially hard because of the institutional trauma component of my PTSD) and am working on the specific certifications and experience that will allow me to open my own practice and specialize in trauma informed intensive treatment. I still have PTSD, and there are definitely hard days, but I am so proud that I am well on my way to my dream job, and my every day also brings me fulfillment. I love what I do for work, and I am filled with love and gratitude every day for being able to feel like I don't waste 40 hours of my life every week.",
            "I'm going through a tough time too right now, and I'd like to hear about the many, many failed attempts -- feels like I'm in the midst of ten failed attempts right now, and it'd be encouraging to hear that someone else got through it",
            "Same, and today I got the confirmation that I have landed a job that is in the middle of my dream pay range. I will be out of debt by Christmas, I dont have to worry about money whilst my partner is out of work for 6 months, we will be able to easily save to buy a house, and the Disney holiday dream is a bit more realistic now. I am over the moon",
            "Yeah this is me. I felt pretty aggressive about climbing the corporate ladder out of a sense of making the most of my talents. Once I had kids though, it seemed like that could only come at the expense of time with them and I realized I could focus more on enjoying life and peaking at the right time (later, if ever). \n\nOne thing that helped me get a job I enjoy is taking the Strengths Finder text. If you buy the book off Amazon it comes with a code to do it. Knowing my top five helped me internalize what motivates me in a way I didn’t understand and I used that to better accept who I am and find a job that fits me. ",
            "This, so much. Who the hell dreams of labor?? The only reason anyone work  is because the necessities for survival cost money!\n\nWanna know what's a dream job? Unsackable sinecure. That's a dream job",
            "Im grateful to have a dream job but I 100% agree man. Focusing on making sure we work to live and not live to work has been the best decision of my life. That's why I'm debt free, live within my means and have 5 kids haha",
            "You just described my current situation almost exactly! Currently 29 years old, been floating through life working in an industry I hated. Currently in a decent job position with decent pay, but still hate the job/industry. Finally decided enough is enough a month ago and have decided to quit my job in the next month to go to school full time working toward something that I find way more interesting. I don’t know if I’m making the best choice, but I know I don’t want to be where I’m at anymore so I might as well start taking steps to something different now. The time is going to pass by anyways. ",
            "This is basically me as well, except I'm still in my position while pursuing school. I'm still scared, I still procrastinate sometimes, but I'm finishing no matter what. Who knows what my degree will lead to, but I had to make a change for my future.",
            "You are brave",
            "Beautiful, thank you!",
            "I get so overhwlemed when I look in to courses because there's *so much* and it all varies so widely per industry. Could I ask if  you would recommend a good place to start with courses that are actually viable irl?",
            "I'm just now considering law school at 35 after originally completing my honors degree in animation at 24. I have been busting my ass for years trying to keep my day jobs remotely related to the arts while also juggling freelance art gigs and indie filmmaking as a passion on the side. All for terrible pay (or losses) and no benefits. *Working* as an artist destroyed my love for it. Now, my health has also majorly suffered (cancer and a neurological condition), and I would not be surprised if it was due to stress obliterating my immune system. \n\nI'm trying to pivot towards something else I still enjoy/have a knack for so I won't be bored senseless, but that I don't see as my whole identity and therefore won't mind doing just my required duties and NOTHING MORE - for better financial security. And I keep the rest of my time for film and making art only for me. \n\nLife is short, but it's also never too late to change. I realized that health and independence are more important for my happiness. I don't have to keep swimming upstream. Let go of the sunk cost fallacy.",
            "Could you give us a \"day in the life of\" for threat hunter/incident responder?",
            "I'm similar to you I think. Appreciate this comment as well as a lot of others. Yea, I think I tend to hold onto some things for too long. Just dropping stuff faster is a better approach. Congrats on your successes so far",
            "Upvote from a fellow SLP!",
            "I can recount off the top of my head fifteen different jobs that I interviewed for unsuccessfully over the past 17 years. There must have been at least 75 others I applied for and never received an interview or any response.\n\nThe earliest interview I can recall was with a local city office. I was so painfully unprepared, and I can still recall the wide-eyed stare the interview lead gave me after a particularly tactless response. He was kind though, and tried to help me get my act together a bit afterward.\n\nI \"interviewed\" for a back-room assistant position with a financial advisor's office. They included maybe 10 people from their office in the interview, and it seemed to me they created a stressful interview on purpose to see how I would handle the pressure. I thanked them for their time at the end, and wished them luck on their search - it went that badly. \n\nI applied for a mgmt position in a different section of my current office, before my current job. The head of that department met with me one on one, asked why in the world I would want to join their staff, then generously told me she was \"doing me a favor\" by not allowing me an interview.\n\nI struggled through three separate self-directed video interviews with financial firms when I was nearing the end of my BS Finance program. Each was an hour + in length, with prompts that I was not allowed to see or prepare for in advance. I never spoke with a real person for any of these, and received automated rejection emails some weeks after. \n\nEach time I came up short, I spent hours preoccupied with what I did wrong or how I could have been better. I would question my self worth every time - I'm just not good enough, I suck, etc. \n\nEventually those feelings would start to fade, my motivation would start to ramp up and I'd look for an opportunity to try again.",
            " curious what kind of job you were doing prior to taking the test and what kind of job afterwards? how did the test help you figure out to go after the post job?",
            "i was curious about the book you mentioned so i looked it up to learn more and not only was it 65% off on amazon, but there was only one left in stock. took it as a sign from the universe, purchased immediately. thanks for the rec!",
            "That’s awesome! I know it’s scary but the fear itself like the phrase about burning the boats so you have to find a way. I don’t know you but I’m proud of you and I really hope you find the happiness and accomplishment you’re after",
            "Same here! 27 doing a job I hate for 7 years, starting school again full time next month. It’s scary but I would rather take the leap than not.",
            "![gif](giphy|DA8op0omzFuwe14iyj)",
            "Sure, i mean i pretty much only know IT\n\nIf you are starting with nothing but some basic experience, looks at CompTIA courses. If you really know nothing, go with the A+ course that will give you basic general purpose IT Cert that is well recognised. From there you can tell what you enjoy and specialise in that. For me it was Networking, so I did CompTIA Network+ course and then went on to do Cisco CCNA\n\nBut you can specialise in whatever you want to study. Security, Amazon Web stuff, Cloud, Microsoft Azure, there are recognised courses for everything.\n\nIt is overwhelming sometimes, but that's the first challenge! haha. Don't fret, just start with ComptTIA, and as you go you'll pick up what courses are legit. Just the A+ will get you on a helpdesk if you interview around.\n\nMost important thing i can say though is that this will take a few months to get, studying your A+ will be who you are for a bit, so mentally prep yourself for this. Don't pay anyone for bootcamps or study sessions or anything like that. If you are resourceful you can get away with paying for nothing but the exam itself.\n\nhttps://www.comptia.org/\n\nThis guy is AMAZING for free video training too https://www.youtube.com/watch?v=87t6P5ZHTP0&list=PLG49S3nxzAnnOmvg5UGVenB_qQgsh01uC\n\nFeel free to reach out to me if you have questions, i don't mind\n\nOr there is a subreddit",
            "[removed]",
            "Law school itself is very stressful, but older students are usually the some of the most successful. I think it’s because they have better self-knowledge of what works for them and are less influenced by the stress of others. \n\nIn my law school, the valedictorian, the editor of law review and the employment law journal, the captain of mock trial team and arbitration team, were all older students with work experience, changing careers. \n\nBut, I have a neurological condition myself, law school itself is very stressful, and it’s something to consider. But who am I to preach about reducing stress, I’m thinking of going for an EMT license or joining the volunteer firefighters (maybe both). Cause that’s a chill thing to do in one’s spare time.",
            "I'm pretty ADHD about it. I'll look up threat intel indicators in our logs, browse endpoint alerts for anything sketchy, look for various strange process behaviors (Word spawning cscript, powershell, cmd, etc), WMI. I'll look through our phishing report mailbox for live credential harvest links, then try to see if anyone in our environment visited those sites, and if so, I'll try to determine if credentials were entered or not. If something looks weird, I'll try to explain it away as legit, or if it's bad, figured out where/when/how it got in, depending. If I have something to key off of it looks more like incident response/forensics, but if I don't have something to key off of it's more like \"if an attacker did this, it would look like this... Can I see that? Let's look!\" Also look into things like lots of MFA denials, or impossible travel (logins from different countries in the same hour, for example), etc.",
            "thank you for this. you seem like someone who's been through the wringer and come out the other side alive. do you have any advice for someone going through the same?",
            "Corporate stuff before and after. I moved from a marketing role to  more project management stuff while changing companies along the way. That was kind of what my strengths pointed too though: I need a challenge, new projects to tackle, and a scoreboard while doing so. Up to that point, the general advice was kind of \"pay your dues and wait it out at this company and you'll eventually get promoted\" or \"you don't want to be a job switcher.\" I realized that I wasn't necessarily chasing promotions, but that chance to do new, impactful work. New companies helped me find that but also I eventually found a company that gave me those new challenges without having to leave too.",
            "I think you'll enjoy it. The most interesting thing to me was, in taking the exam, I felt pretty polarized on my answers. But then seeing the different result options you realize that not everybody does feel the same as you nor does every job offer the things that you're good at. So, it helped me identify the idea of a good fit that wasn't based in subject matter expertise or technical skills.",
            "You are *incredibly* kind!!! This is the exact information I needed! Thank you so much!",
            "Your submission was automatically removed because crossposts are not allowed.\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/GetMotivated) if you have any questions or concerns.*",
            "Yeah, I am by no means underestimating the stress of going back to school. I might have to spread it out over more time or ask for accommodations. I just think, if I don't change my situation, I am looking at decades more of the same old stress sources (assuming I live that long now) vs. just a few more years of stress and coming out into something that just isn't such a relentless battle to get the bare minimum. A bit more money and job security would alleviate so many worries. I'm not after riches or to be top dog. Just a security net. \n\nI have lawyers in the family who are sharing stuff with me so I can make sure it really looks like the right call. If it looks too intense with my neurological condition, I'll have to figure out something else. I'm also hoping the neurological condition will improve with time. Had all the medical clearance that it's nothing sinister or degenerative. My brain just needs to rewire. By the time I hypothetically graduate, I might be feeling much better.\n\nEdit: maybe the EMT/firefighting stuff will actually help your brain understand what a real threat/emergency is and everything else in your life will suddenly feel very clearly \"no biggie\" and you can de-stress through that contrast/compartmentalizing? Who knows!",
            "Try to be open to opportunities that might not be what you were expecting or looking for, even if they don't seem like they'll be immediately beneficial. \n\nBut also - advice is not one size fits all. Our experiences will not be the same, and the things that work for each of us will likely be different. There are specific things that really helped me - organization & planning skills in particular. Other people have different skills and areas where they may need development. \n\nFinally - I know it's going to sound cliche, but whatever type of progress is important to you, don't give up pursuing it. If it's important to you it's worth the effort."
        ]
    }
}