{
    "Have a question about the game or the subreddit? Ask away!": {
        "title": "Have a question about the game or the subreddit? Ask away!",
        "score": 4,
        "url": "https://www.reddit.com/r/2007scape/comments/1dlig09/have_a_question_about_the_game_or_the_subreddit/",
        "content": "# Welcome to the daily /r/2007scape question thread!\n\nYou can ask anything about Old School RuneScape here. They are designated for you to ask anything you like that is relevant to the game or this subreddit. Remain respectful to your fellow 'scapers when answering questions; there are stupid questions, but it does not mean you should not be respectful whilst answering them.\n\nKeep in mind that this is not a developer Q&A thread - questions for the game developers should be posted in the weekly developer Q&A posts.\n\nClick [here](https://reddit.com/r/2007scape/search?q=author%3AAutoModerator&restrict_sr=on&sort=new&feature=legacy_search) to view the archive of /r/2007scape \"ask anything\" threads.",
        "num_comments": 39,
        "comments": [
            "How do you guys organize having odd-numbers of swaps?\n\nA lot of setups I'll see for content has two 8 way swaps, but then the one 6 way swap, how do you keep yourself organized and wearing the proper things?\n\nI find if I'm not doing 1:1 swaps for clothing, I'll end up getting garbled.",
            "Is the soulreaper axe worth it after the buff? I've got enough to buy it if I sell some niche gear that rarely gets used like acb and spectral. [Here's my relevant gear that I'd keep](https://i.imgur.com/xOjmTvA.png), Im at the point where I could do a megarare rebuild but I value having good gear to do a variety of content. I'd use the axe for slayer bossing, probably vard and duke, want to learn tob and colosseum. Any other places its good at since it got buffed?",
            "What is the current meta Ironman guide? (If it’s out of date, what are some considerations I should be aware of?)",
            "So I tried the blood spell setup for the song of the elves final boss, and it seems to be good but not enough to cover the damage. Managed to get the boss to around 200 health before I had to teleport out due to lack of food. (18 Pineapple Pizzas)\n\nI think it's part skill issue due to overeating and playing it a bit safe, but don't think it be enough to actually beat the rest of it as the 3rd phase is quite long if you use blood spells on the crystals. While I only gave it one attempt I don't really have the funds to keep trying so think i'll just give up and come back with better gear and stats, mostly unlocking Blood Blitz as it also saves a inventory slot due to costing 2 different runes instead of 3.\n\nHonestly did not expect to get this far as a new player lol.\n\nAm going to go back to doing quests by release date, meaning unlocking barrows gloves and such as well, planning to do mage training arena because I want to train magic, unlock gear, but keep my hp level low.\n\nIf there is any niche gear or such that could help as a ironman I love to know.",
            "Am I missing out on a lot if I just don't do shield of arrav and its associated questline?",
            "For the 4th boss in the DT2 final battle, is it feasible to just ignore the portals and attack the boss? \n\n\nI'm using a Dragon Crossbow with Dragon Diamond bolts and getting overwhelmed. Max hit is a 31, praying EE since no Rigour. \n\n\nWas using Blowpipe before (with Amethyst darts) but had more luck with the DCB.",
            "I saw a post just scrolling about dmm all stars and was wondering what is that and is there vods of it I can watch?",
            "Hespori: the wiki still suggests slash melee as the main way to fight him. But what about his 100% fire weakness? Wouldnt it be at least a viable option?\n\nI'm really curious how it is with as high magic level as 126 but with such a weakness? What would matter more? :)",
            "I've seen some of the promos talking about DMM Apocalypse's \"rewards\" but I can't find any info on them. Have they not been announced yet? Do they not exist? There's a real cash prize pool but I have no interest in that.",
            "Did we lose the ability to recolor individual pieces of graceful at the Brimhaven Agility Arena? Or was that never an option?",
            "If I drop my elite clue with 6 steps and start trying to grind another one from a monster, will new clues drop with 6 steps completed?",
            "A bunch of questions about gear \"sidegrades\"...\n\nIf i already own a Tbow masori/Shadow ancestral, is there any purpose or use cases that warrants me buying BowFa + crystal armor? Is bowfa BIS at Leviathan? This being said I also don't own a ZCB yet, but it's something I'm saving up for, and it's used there too. So is there any argument for buying bowfa and crystal armor just for Leviathan?\n\nIs there any use case for Sang if I have shadow? I sold it to buy Shadow a while ago.\n\nIs there any use case for Harm staff if I have shadow?\n\nIs there any use case for DHCB if I have a lance and Tbow?\n\nIs there any use case for Blade of saeldor if I already own Scythe and rapier?\n\nIs there any use case for Inq mace?",
            "Does anyone know how the DMM Allstars tournament bracket is organized?\n\nThere are so many ways to structure a six-team tournament with a loser's bracket. Do seeds 1 and 2 get a bye? How do the winner's and loser's brackets interact?\n\nThis sheet has a lot of info but not the bracket: https://docs.google.com/spreadsheets/d/1c-bWzfGMiob6hqWD74NRw6KDz6i_Td2RFqRz8DWDkN4/htmlview?usp=sharing#\n\nShow begins at 1:00 pm ET btw",
            "Can I get a discount on tbow if I buy direct from a player? If so, where’s the best place to find a trustworthy seller?",
            "first things first, the best case scenario for this is to have symmetrical switches i.e. the same slots for each gear\n\n2nd, consider vertical switches. for numbers of less than 8, vertical switches make a lot of sense",
            "1: organize your switches. Keep them in consistent positions so that you'll always know where to look and what you're looking at in your inventory. E.g. you may have the weapon be the top left switch of every setup, shield slot  top right, necklace middle left,  etc. As long as it's the same for all setup (at least, for items that you have a switch for every combat style), you constrain the chaos to a specific area in your inventory\n\n2: inventory tags. This is the prime use case for them. They make things more recognizable at a glance. Color each switch with its appropriate RGB color. For hybrid switches, use the secondary color that's a combination of the others e.g. barrows gloves are ranged/melee, so make it R+G=yellow.\n\n3: anti drag plugin. Less chaos if you don't miss your switches. I personally have serious issues trying to play without anti drag on, as I'll frequently slide gear around when I'm trying to quickly switch. \n\n4: consider switching back to a default setup in between your switches. E.g. if your default style is melee and you need to switch range->mage, think about switching range->melee->mage. It will be slower and more clicks, but mage gear will stay in the mage side of your inv and range stuff will stay on range side",
            "It feels much nicer to use now. At the very least, I wouldn’t commit to buying the axe unless you’ll stick at vard until you get an ultor. It’s definitely usable for Duke/tob/Colo but if you aren’t doing vard specifically I’d probably just hold off until you can get a scythe or just do something else",
            "If you plan to grind out Vard and Duke and don't wanna megarare rebuild to keep access to a wider variety of content with all of your gear, then yeah Soulreaper Axe is pretty decent now.\n\nAcb and Spectral are pretty low priority generally. Spectral is almost exclusively for Cerberus, and ACB for Nex (though in my experience Nex before you have at least a ZCB is a lot less enjoyable lol).\n\nThe rest of the gear you'd keep is pretty great. Leaves you with really good gear for Slayer, ToA, CoX, and the Soulreaper will also be useful for you at TOB potentially.",
            "[Bruhsailer's guide](https://docs.google.com/document/d/1CBkFM70SnrW4hJXvHM2F1fYCuBF_fRnEXnTYgRnRkAE/edit) is a step-by-step guide to Ironman progression with a PvM focus. It's up-to-date including Varlamore, but there's a lot of stuff it skips over for the sake of efficiency that you might prefer doing, like Moons of Peril, hunter rumours, and early wilderness content like revs or zombie pirates.",
            "go with the phoenix necklace setup and use a faster weapon like a magic shortbow or chinchompas to tag the pillars that heal her\n\nhttps://www.youtube.com/watch?v=XRZVxU-umX8",
            "As another commenter said, I'd recommend bringing a quicker weapon as a switch to kill most of the healing pillars. I would use a quick weapon on all but the last pillar, and blood blitz the last pillar for some guaranteed heals at minimal cost of healing the boss. This gives you some healing while crucially reducing the boss' healing.",
            "You won’t be able to get barrows gloves",
            "Barrows gloves, assembler, face guard, various diaries, new upcoming quest.\n\nIt’s a pretty quick quest and unlocks some iconic quests and content. \n\nWhy were you thinking of skipping?",
            "Check the wiki dps calculator. If fire spells are better, there's a good chance no one ever bothered to update the wiki because it's not something people think that much about optimizing. That being said, with it having a speedrun CA, I'd be surprised if mage is better since that would make the CA kind of free",
            "Yup fire spells are viable",
            "Don't believe that was ever an option.",
            "Nope. It will have 0 steps completed. When you spawn a new clue by whatever means, your character's steps for that clue type get set to 0. If you want to juggle clues, you need to do it from the start before you put in any work, because generating a new clue just wipes your progress",
            "The problem i have with vertical switches, specifically in this case, is both my range and mage setup have main hand & offhand, but my ranged is 2h.\n\nI was using a vertical setup, but now I'm switching to horizontal to see if that helps, but I feel like I'm carrying more switches than I really need.",
            "ACB nex is totally fine (assuming you’re hybriding with fang), current ACB is stronger than range BIS ever was prior to project rebalance. VW helps a lot tho without ZCB spec\n\nBut agreed I wouldn’t buy ACB unless specifically doing Nex. Maaybe muspah but even then meh",
            "Excellent, thank you.",
            "So I went ahead and tried out the phoenix necklace strat, but now I heal too much and need to get more nightshade.\n\nSo should I rather just use iban's blast as it be way cheaper, but now I have to really make sure I heal enough, or I go back to blood burst.\n\nIt's a hard balance, gonna try out iban's tomorrow. I use chinchopas last attempt and seems to be good.\n\nJust because of my low combat level (69) I feel like any mistake I will make will result in me dying, as i'll be at low health basically the entire time, and worried i'll get nuked with a 24 when the 4 clone phase comes out.\n\nI just need to build confidence and be calm really, I feel like none of this would be a thing while say farming a boss, but for a one time encounter with limited supplies it sure makes my heart beat lol.",
            "I’m very shy about dealing with people for that sort of thing.",
            "Do you mean that with the amazing DPS calc (its really amazing, no /s here!) we don't need any strategy guides at all? I think they are still useful - when the question is not about some specific items vs other items, but very general advice. \n\nYes, I've now checked in the calc. The difference is 3.8 dps on melee slash (maximising str) - vs 4.4 on fire blast in full ahrim with damned. TTK: 83s melee, 71 magic. (Updated the full ahrim setup with damned, thats even better!)\n\nBoth setups are very budget. The difference is serious, I'd say. Probably for maxed players in BiS gear it might be quite another story.\n\nI'd imagine the majority of players who do Hespori are low-to-mid levels who do it for the bucket or anima seeds. And farming exp. And they do need every edge they can find. The wiki guide is actually quite considerate to this group.",
            "I really only bought it to spec on muspah's smite phase and to get some nex combat achievements. I don't think it will be missed much",
            "There’s a clan chat set up for it, you don’t need to do the quest with them, usually someone will just be able to trade you the certificate you need from the other gang. \n\nI’ve done it barely typing on mobile, you don’t really need to interact much. It’s just like posting a question here",
            "make an alt, the quest is f2p anyways",
            "That's why I said \"If fire spells are better, there's a good chance no one ever bothered to update the wiki because it's not something people think that much about optimizing\"\n\n\nIt's still a new update and not everything will have been updated. You are able to update the wiki yourself",
            "If you do hybrid muspah Accursed sceptre is a great budget spec, it’s better dps than a sang hit and gets decent defense reduction"
        ]
    },
    "Hallowed Sepulchre Instances & More": {
        "title": "Hallowed Sepulchre Instances & More",
        "score": 306,
        "url": "https://secure.runescape.com/m=news/hallowed-sepulchre-instances--more?oldschool=1",
        "content": "",
        "num_comments": 467,
        "comments": [
            "* Fixed a bug that falsely claimed players had obtained a Clue Scroll every time they opened a Reward Casket with a Master Clue in their possession.\n\nExcellent, no I don't have to feel as guilty about the master clue that's sat in my bank that has an RC level that I don't have.",
            "Any update on the inquisitor’s armor not giving correct damage for an incomplete set with the mace? Would love a statement on this issue.",
            "FYI /u/JagexBlossom the news link in game takes you to the previous update page for the pride event, not this one https://secure.runescape.com/m=news/a=13/pride-2024?oldschool=1",
            "Just throwing this in here after reporting it in-game a while ago.\n\n[On May 23rd an update was made to change normal-mode ToB Verzik p2 to scale for solo play](https://secure.runescape.com/m=news/minigame-tweaks-skilling-adjustments--more?oldschool=1). Basically two changes if there's only one player still alive.\n\n1. Only one red crab spawns (instead of two). This makes it possible to out-dps Verzik's healing.\n\n2. The zap damage is capped from ~50 down to 14. This makes tick-eating zaps not always necessary.\n\n\\#1 works properly but #2 is bugged. In a solo ToB it functions properly, but if the raid was not initially a solo, it doesn't scale down. The zap continues to hit between 45-50 even with only one player still alive.\n\nThis actually makes duo tobs where one player dies on Verzik *harder* than solos, because you still have to kill Verzik by yourself, but through all of p2 you also have to deal with zaps taking 50% of your hp with no counterplay. Unless your 2nd player dies right at the end of p2.5, it's basically impossible to clear since people don't typically bring sweets for non-solo ToBs and the only real option you have is to tick eat with brews, which are both a limited resource and massively drop your dps. So while the changes properly made solos less annoying, they didn't actually improve the situation where someone in a duo dies, making Verzik entirely uncompletable.\n\nTo reproduce this, do a duo and have one player die during p2 Verzik. Note that the zap is still hitting 45-50 damage. This does not occur when doing a solo ToB.",
            "When do you plan on addressing the bug with the Inquisitor set? Currently, you have to wear all 3 armor pieces to get the 2.5% bonus per piece. If I use the mace for Slayer, I think I only receive .5% bonus per piece for the top and bottom. I believe it was polled so that each inquisitor piece would give its bonus to the mace independently.",
            "The Fishing Trawler change confuses me a bit. Wouldn’t divvying it up based on the players present at the end make more sense? The way they describe makes it seem like folks who log out will still get rewarded or something.   \n\nPerhaps someone can it explain it because I don’t get it.",
            "Still no fix for Inquisitor's set not working like the updated blog said it should. Sad day. Really wish we could get any kind of answer on this.",
            "Please put game status in the launcher",
            "> In other skilling news, the Carpenters’ Clothing has been buffed! Budding Construction workers will enjoy a slight boost to XP rates when wearing individual items, with a +2.5% boost for the full set.\n\nThe wiki has [claimed](https://oldschool.runescape.wiki/w/Carpenter%27s_outfit?oldid=13217034) since the release of the outfit that you get 2.5% for the full set. Was this incorrect or am I misunderstanding what this changes does?\n\nEdit: Reading it back. The items themselves provide more % themselves with no bonus for the full set?\n\nEdit2: Okay, so the actual change is hidden in the Changelog with the blog post being slightly confusing:\n> Carpenters’ Clothing now boosts XP when completing Mahogany Homes Construction contracts, with a 2.5% boost when wearing the full set.",
            "Sepulchre instances sound great! Would be nice to get some word on improved Colosseum hitboxes though, red clicking the air where Sol's spear used to be shouldn't be a thing...",
            "The master clue thing was a bug?! Thank god, I was thinking some absurd RNG was going on or the drop rates were off.",
            "\"Players can now dismantle Ancient Sceptres powered by Quartz to reclaim the component parts.\"\n\nHidden gem. You only need one sceptre now to make use of all the quartz, not four",
            "Heya jmods! Very curious if we can expect updates soon on the following:\n\n* The GOTR changes.\n* The HD mode. \n* The Scorpia changes.\n* Corp grouping mechanics. \n\nFeel like all of these were announced but no news since. Really exited for all of these though!",
            "Are we going to hear any more about the supposed scorpia changes that were hinted at a bit back anytime soon?",
            "No inq armor changes?",
            "Where are the fixes for inquisitor and quiver???",
            "Has the issue with agility courses not working properly on mobile been fixed ?",
            "Anyone have any timeline or info on proposed poll to a few mini game changes including guardians of the rift and wintertodt? I need to spend a good chunk of time at both but putting it of in game it becomes easier with more quality of life improvements etc.",
            "That Mahogany homes bonus coming as I'm about to start my 89 - 99 grind lmao",
            "The in game broadcast links to the June 5th blog post instead of todays.",
            "When are we getting the minigames QoL poll? Does anyone know?",
            "No mention of inquis set not giving 2.5% a piece w slay helm :(",
            "I assume the private sepulchre instances are so people can do 'perfect' runs without traps having been already set off by other players? Seems like a decent unlock.\n\nI'd really like to see better visual indication of trap/teleporter immunity after having just been transported - as it stands things like darts just pass through your player with no explanation... until they don't and back to start you go :')\n\nalso some visual indication of when the blue/yellow transporters are going to change location would be super welcome. the number of times I go to skip a spinning sword and have the blue transporter move at the last tick... absolutely infuriating",
            "I am once again asking \"When minigame QoL poll\"",
            "Wtf is going on with Australian worlds?...",
            "Jagex making fishing trawler even worse is insane. Could make this change to address the abusers and instead just 10x loot and exp. It’s abysmal as is.",
            "My worry of hallowed sepulcher instances is that it will be harder to report the sepulcher bots.  Assuming they actually get banned.  Their post 99 agility levels are pretty impressive.",
            "I am whelmed ",
            "BH changes look nice, wonder how this will affect the playability of it since it can be quite dead at some times. \n\nThere are a few points I wonder are up for consideration:\n\n1) Unskullers, they have the advantage of 4 kept items to increase KO potential massively, but for hardly any risk. I know you have a free skip, but when the world is full of them, you can't avoid it.\n\n2) Ragging, can something be done about players who camp the exits and just double spec you, regen spec and teleback to spec you again. This is just boring to fight.\n\n3) P necks, this just makes fights utterly boring as you literally have to have insane rng to kill them.",
            "Not sure if this would be possible but I feel like I would prefer hallowed sepulchre to be \"instanced\" in the way moons of peril are.  You can see other players but you're on your own trap cycle.  Might make it confusing for newer players when they see someone run through a sword that's in a different spot for them.   Racing players at sepulchre is really fun and makes the grind more enjoyable.\n\n\nThinking about it now, the moons of peril share attack phases across players so they probably weren't a good example.",
            "where wyrm agi",
            "What is the benefit of a private sepluchre instance?",
            "Inquisitor armor fix when?",
            "Still no inquisitor armor fix. what an absolute joke. are you even aware that its bugged and players are losing 5 max hits worth of damage???",
            "##### Bark bark!\n\nI have found the following **J-Mod** comment(s) in this thread:\n\n**JagexBlossom**\n\n- [Oops! All fixed, thank you!](/r/2007scape/comments/1djgb9w/hallowed_sepulchre_instances_more/l9aujdi/?context=3)\n\n- [The players who leave won't get rewarded, it...](/r/2007scape/comments/1djgb9w/hallowed_sepulchre_instances_more/l9aiem7/?context=3)\n\n\n\n&nbsp;\n\n^(**Last edited by bot: 06/22/2024 07:40:30**)\n\n---\n\n^(I've been rewritten to use Python! I also now archive JMOD comments.)  \n^(Read more about) [^(the update here)](/u/JMOD_Bloodhound/comments/9kqvis/bot_update_python_archiving/) ^(or see my) [^(Github repo here)](/u/JMOD_Bloodhound/comments/8dronr/jmod_bloodhoundbot_github_repository/)^.",
            "Any ETA yet on the GOTR and Wintertodt QOL Poll? u/JagexBlossom",
            "Thank you. Now I dont need to camp muspah for a drop I already have. 🫶",
            "Please fix CoX boosting by removing the point cap. Why is this even still in the game? It's such an easy fix and would reduce service related gold buying and selling.",
            "Is it possible to instance with another player? Id love to race my brother in sepulchre.",
            "Still need more feedback? And how long you are going to \"ghost/ingore\" that conversation about inquisitors aren't working like you was telling on blog? :( Any comment u/JagexBlossom ?\n\nhttps://preview.redd.it/ytgigh8pgo7d1.jpeg?width=807&format=pjpg&auto=webp&s=e9bcc455265d4700074cee0510121b42d7b2d2e9",
            "So, is that run energy rebalance still in the pipeline?",
            "Hey u/JagexBlossom has the bug I reported last week with the Accursed Sceptre VS Melee Fremmy been acknowledged by the team and any ETA for a fix?",
            "When fixing run energy? 😓",
            "Great update for Sepulchre. Nothing throws off your rhythm like suddenly facing a pre-started floor.\n\nIt would also be nice to be able to unlock and toggle noted consumables (Sanfews, monkfish) while looting.",
            "wait, the construction outfit didn't work with MH before ? LOL",
            "u/Mod  \nWill there be a fix for the Accursed sceptre inside the ТОА? It still doesn't hit melee baboons like other staves",
            "With the Construction outfit now having a slight buff, when will we be able to sell it back to the store, as with other skilling outfits, for the 80% refund?",
            "Oh sweet another non-update week! Private sepulchre instances so we don’t see the bots as much?!?!? Sweet 👍",
            "Can someone please explain to me the purpose of the “highly requested” Hallowed Sep instances?\n\nI ran many hours of Hallowed Sep on my maxing grind and not once did it ever occur to me that I might want an instance there. In fact, the opposite. I enjoyed seeing other people running with me.",
            "While we’re looking into agility stuff, can we fix mobile agility helper? Or get any news on it?",
            "Wintertodt update when :(",
            "Fishing Trawler nerf lmfao. That minigames needs a massive buff if anything.",
            "Is rs kingdoms based on rs3 lore or osrs lore?",
            "Fix bug that lets 300 total 25hr playtime vote. It’s like we let 10 year olds vote.",
            "Nothing bad could possibly happen due to this change...\n\n*Laughs in mass griefing*",
            "All this thread is are posts of how you forgot or dropped the ball on a previous update and something is either missing or broken. Lmao",
            "While we are doing skill rebalance, can we please repoll receiving amalayse crystals from the Hallowed Sacks?",
            "neat little patch",
            "Fossil island zip-line when?",
            "Can anyone tell me why instanced Sepulchre is important? I've only done the first 3 floors and people are not a hindrance to me whatsoever, so is this helpful for floors 4-5? In fact, racing people encourages me to be more attentive.",
            "as someone that pks on a level 111, the bh changes are great!",
            "Hallowed instance feels like a weird choice. Recently I green logged it, and as far as I can tell this would only make it so I don't get frustrated by seeing bots dodge and weave between arrows/teleport tiles. Would this make every run identical when it comes to those teleport tiles/arrows?  So assuming perfect play a player could develop a set path?",
            "[deleted]",
            "Can we get that guys Torva as a drop from Araxxor?",
            "Is there something I’m not understanding here? Why would fishing trawler rewards be changed this way? Is the meta to now just enter the ship and leave?",
            "Ty for the sep change! It's great to see u revisit content when the most active players give feedback after years",
            "I was working on Mourning`s End Part II during the puzzles I hope it doesn't reset! How long is the update expected to take?",
            "How long is the update going to take?",
            "Still nothing about the agility highlights disappearing on mobile rooftops? Any chance that is now fixed?",
            ">Fixed a bug that falsely claimed players had obtained a Clue Scroll every time they opened a Reward Casket with a Master Clue in their possession.\n\nI fuckin knew I wasn't that lucky. Like 90% of my easy clues yelled at me to do my master",
            "Can you please repoll adding Amylase crystal packs to Hallowed Sepulchre reward shop?\n\nWith the new poll system, it won't fail this time.",
            "idk which jmod thought that fishing trawler needed a nerf, but i really didnt lol",
            "Since you guys are still improving agility when are you guys improving underwater agility and increasing crystal shard yields from other activities in prif?",
            "Basically nothing then",
            "The sneaking suspicion you would have received a master clue appearing on every clue was actually a very nice feature. It let you realize you hadn’t dropped your master when opening clues before you actually rolled one",
            "Who asked for sepulchre instances and what's the benefit? You hardly see anyone there anyway.",
            "Two weeks in a row that could've all been one patch notes...guessing varla P2 was buggy AF ",
            "Currently Morytania diary has the perk of getting bonus slayer xp when killing things on task there, would it possible to add it to other places that are \"marked\" as slayer locations? \n\nOf course requiring similar levels of achievement diary completion.",
            "Could we also get a sepulchre mass world where we all start at the same time then race to the end, maybe reward those who finish in the top places. Make it a mmo minigame",
            "Construction:\n\n> In other skilling news, the Carpenters’ Clothing has been buffed! Budding Construction workers will enjoy a slight boost to XP rates when wearing individual items, with a +2.5% boost for the full set.\n\n1) Please, add to the main article that the Carpenter outfit now works on the contracts reward exp. It is said only in the Changelog, but not in the main body of article. I (as maybe some other people) always read the main article rather than changelog, to get the most complete and detailed information.\n\n2) So, what is the exact boost of the full Carpenter? Is it 2.5% xp, or 4.5% xp total? (The second number is % of individual pieces plus 2.5% bonus). The wording is kinda confusing. If it is still 2.5% total, it is no change at all: it is exactly as it was since the release of MH. I was reading and re-reading this \"has been buffed\" and was totally confused what was the buff and what changed, if anything :)\n\nPlease rewrite this paragraph in the news to make it clear.\n\nAnd... thanks a lot that you made it working as it should!",
            "Hallowed sepulchre is already same-y after a certain number of laps. Why make the most efficient way to do it even more repetitive? I personally think it's a really bad move.",
            "Why is a qol upgrade like the sepulchre change locked behind a reward? Seems like it should just be available to all",
            "When did we vote on these?",
            "I really don't understand the point of nerfing Fishing Trawler loot. It's a moderate-intensity fishing minigame which barely provides more fish than AFK fishing, and less fish than a bunch of other things not related to fishing. I'm pretty sure I get more fish/min from Wintertodt than from Trawler.\n\nIt would already be dead content if not for diaries and the collection log, why make it worse? Just to spite a very rare edge case of people using lots of alts to get... slightly better loot from a thing that doesn't give great loot regardless?",
            "Is there concern that Sepulchure instances will make it harder to catch bots? I report bots regularly that I see running all day long, instances make it easier for them to hide.",
            "Probably an unpopular take, but Hallowed Sepulchre change is terrible. Half the fun is racing other people, and it's supposed to be more skill based training+better loot in exchange for no failure rates compared to more traditional training methods. The place should have been running 24/7 regardless of if players on inside or not, and making the runs 100% consistent timings is just dumb. If anything needed to be fixed about it, it would be the required levels to start floors 4/5. \n\nI'm not ever planning on speedrunning it, but from what I've been told the current records are a result of a bug so they'll likely never be beat anyways, and the best times probably would require you to have someone enter and pre-start the cycle for you to enter on a specific tick anyways.\n\nAt the very least, 200 marks is absolutely too cheap. It should have been priced around 2000+ or so.\n\nJust a terrible change all around.",
            "Thank you for finally adding sep instances! Skillers rejoice",
            "Imagine how poorly designed it would be if the Fight Caves/Inferno/Colosseum did not let you fight the final boss unless you were level 126 combat. Like you could do the whole thing at <126 combat, but you get kicked out after wave 62/68/11 and sent home with some Tokkul/your colo rewards but no chance at a Fire Cape/Infernal Cape/Quiver\n\nThis is the number one design flaw with the Hallowed Sepulchre, not having the main reward available until level 92 makes so many think that the content is not worth engaging with and learning until that point. Which in turn leads to no one doing it because level 92 Agility is a big ask for most accounts who aren't dedicated skillers. I've only ever done HS on Leagues, it's great content, but I have no idea why anyone would go to grind the Inferno with no chance of getting to kill Zuk\n\nJust make Floor 5 available at 82 and nerf the exp until level 92. Or make it so you can Summer Pie into it at level 87 (this is still high, but you get my point, do something to give more players a better reason to do this great content)",
            "Dislike the trawler change",
            "Were any of these changes polled?",
            "Something wrong with the AUS worlds. Can't seem to log into them.",
            "Would love for the clothes pouch (forestry) to allow us to get the benefits of the construction outfit and the lumberjack outfit at the same time instead of having the lumberjack outfit effect overridden by other set effects.",
            "u/JagexBlossom Can the team look into Jagex Launcher not working on Mac computers for the past few hours? Posting here for visibility; there have been multiple posts about Mac users not being able to play, which is especially frustrating during the US holiday today!",
            "Why make fishing trawler worse? Everyone already only does it for the outfit and never touches it again.",
            "Lol so you NERFED fishing trawler???? 😂 What a great update!!",
            "Trawler of all things got nerfed lmfao",
            "WOW ARRAXOR? WHY DON'T THE RS3 DEVS JUST WORK ON THE GAME'S CONTENT AT THIS POINT LMAO ALL YOU DO IS COPY/PASTE RS3 STUFF, SHIT DEVS",
            "So you can't do it in peace to get the 200marks. You have to struggle finding a world with low ping first... Makes sense",
            "Instances after I got the ring. Lmao, I can be \"one of those people who suffered\"",
            "I don't see the point in making Sepulchre instanced. The times I'm there there's almost no one else anyway and even if there was it's not a problem.",
            "HLC agility sweats rejoice :)",
            "love the seppy instances, but i'm worried about the bots still not being addressed. If we are to trust that reporting players actually matters (I sincerely believe it doesn't due to continuing to see specific bots still going strong), with instances, we won't be seeing them as much to report them.",
            "Lovely updates but I don't recall a single one of these items being polled. Why are you ignoring this core pillar of the game?",
            "What a sad update.. stop changing basic things noone cares about and fix issues we are all complaining about.. so many issues and even items not working as explain in polls and proposals and then you find fishing trawler to be more important..",
            "ah yes, changing dark lure description from \"Stops your target from fleeing\" to \"lures your target towards you\" because tormented demons will be lured",
            "Who benefits from hallowed sepulcher being instanced? Why isn't Zalc instanced?  \nedit: ??",
            "We want megarare weapon noxious kits!!! Give us that nostalgia hit my dudes, it feels right",
            "You made construction slower and fishing trawler (something that is already incredibly bad in terms of loot and exp) worse? Are they really priorities right now?",
            "can friends join the private session?",
            "One of my favourite parts of sepulchre was passing another person. Guess I'll never see another player in there again..",
            "Why not juggle the master?\n\nWorst case, you end up with 2 masters you can't do, and you pick which one to keep. best case you complete a new master and keep your old one.\n\nI've had a master step in my bank for ages that wants me to get a fighter torso...\n\nI've done about 5 masters since I got it, because I just drop it before I open my other clues, and if I get a new master, I go do it (luckily I haven't encountered another step that was too hard - although I did juggle 2 masters for about 15 hours in motherlode mine to get full prospector for a step lol)",
            "I just hoard lower tier caskets until I get the master clue requirement (extra motivation to get it)",
            "What's the level? If you focus it now, then that master step will never give you problems :)",
            "Right? Had no idea this was a bug and was hating myself every clue I did lol",
            "It’s dead content, sell your set and move on",
            "at this point we should just forget about it. It's so frustrating that they haven't even used the \"engine\" excuse, absolute silence.",
            "Oops! All fixed, thank you!",
            "Does this also happens if it is trio and 2 players died on P2?",
            "[deleted]",
            "That's what should happen though? You're doing a scaled ToB essentially solo, so it's a case of \"git gud\" unfortunately",
            "Why won't yall even address this?!",
            "The players who leave won't get rewarded, it just means that the players left get the share of the loot and xp based on how many were there from setting off. So if 10 people set off, and 9 people leave, that 1 remaining person will receive a tenth of the loot, and the 9 will get nothing. I hope that helps clarify!  \nedit: typo - oops!",
            "Pretty easy to understand, mate. \n\nBefore this change, you could pile in 50 alts into a trawler and then log them out so all 50 rewards would pile onto the accounts remaining. \n\nIn the mass world, maybe a few people get booted for inactivity or something, so people will see slightly less rewards than what they're used to. But this prevents what I'm assuming is a bug that was abused by some people that knew about it.",
            "Potentially boostable by irons by getting a lot of people to join at the start and then leave during session.",
            "If 100 players started Trawler, but 98 left just before the session was completed, the fish and xp would have been distributed to the 2 remaining players.",
            "My guess is a small group of players had discovered this mechanic and were abusing it.\n\nYou could fill a boat with alts and then leave and boost the rewards for a single acc like crazy.",
            "Imagine if someone set up a fishing bot farm and then made the bots leave at the end. They really shoulda nipped this in the bud a while back.",
            "Before this update, while wearing the full set:\n\n- You'd get the 2.5% bonus when making furniture(including in Mahomies), but not the construction exp bonus during Mahomies when you \"turn in\" the contract\n\nNow:\n\n- You get the 2.5% bonus everywhere, including when turning in the contract",
            "When you complete a contract in mahogany homes you get a big chunk of xp\n\nAn expert contract gives you a 2750 xp drop at the end. Now with the full outfit you'll get 2818.75 xp drop",
            "This change is for Mahogany Homes contracts specifically.",
            "Previously the xp bonus only applied to constructing furniture. It didn't apply to the completion xp per task. Now it does with the full set.",
            "I Think in the post its meant to specify “during mahogany homes”.",
            "The outfit didn't use to boost the xp reward for completing a mahogany homes contract. Now it does.",
            "Hey man not sure if you're aware of this yet, but word on the street is that change is specifically for mahogany homes.\n\nHappy to be the first person to tell you 😎",
            "They have made the outfit no longer work outside of doing mahogany homes",
            "Sorry, I might be being dumb. Why would you want instances for sepulchre?",
            "This is nice and all but I wish it dropped marks of grace",
            "I had a few misclicks in my 20kc to corrupt my quiver, but i never had problems clicking sol. I wouldnt click his spear over his body personally though",
            "Same lol I thought fml why does that have to be the thing I have good RNG on.",
            "Ye I was getting that notification every time I accidently opened an easy clue. Was thinking just my luck.",
            "Hidden mineral, really",
            "The last cache update added some options for a beta of the HD mode, so it's definitely in the works.",
            "HD mode was made up to try to prevent 117’s HD plugin from releasing",
            "what are the gotr changes?",
            "HDs been out for years mate lol",
            "They first need to decide what Scorpia is. It's way too deep in multi wilderness to be a mini boss, but it isn't as difficult nor rewarding as the proper wilderness bosses.",
            "They mentioned in a previous update post that those changes got shelved for the time being, I bet we don't see it before late 2024 or more realistically 2025",
            "Still waiting on the Scorpia unique",
            "Ardy was fixed last night for me",
            "What was the issue? ",
            "Mine was working yesterday after not working for a week or two.",
            "Same here lol, also the exact same levels.   \nGood luck on the grind brother!",
            "97-99 left, I'll take the boost!",
            "Came as I just got 95 construction from MH contracts alone, about 1500 contracts...damn why can't my laziness pay off lol, at least I get it for 4 levels.",
            "I just finished 99 construction 2 weeks ago",
            "I COMPLETED IT A FEW WEEKS BACK I AM SO LIVID (no actually not because the cape is the single best thing in the game lmao go get it tiger)\n\n[obligatory r/ironscape post 74 days ago](https://www.reddit.com/r/ironscape/s/wcD6rYmBwI)",
            "+1 those two indicators would be super nice. I swear it's more often than not that I stand on a blue teleporter and it vanishes instead of protecting me from the sword that hits me the next tick.",
            "Honestly that probably would be better to be done via plugin like with a tick counter",
            "it's not a nerf. just a bugfix",
            "My worry is that I'll never interact someone doing Sepulchre again besides these NPCs. \n\nGive us Sepulchre worlds if half the population is about to vanish into instancescape, it was already hard to bump into people unless they were learners.",
            "For 1. it sounds like they just need to make you auto skulled in BH so it's an even playing field.  Either that or no skulling period in BH.  Either way there should be no way for someone to be skulled fighting someone not skulled in BH.",
            "Unskullers are big annoying when I go black chin bot hunting. They'll look at me and wiggle around like some sort of specimen wanting me to hit them.  And when I type \"hit me,\" they call me a slur lmao",
            "Make unskullers only fight other unskullers.",
            "1. So don't fight them, they won't attack you cause then they'll be skulled with huge risk.\n\n\n2. Definitely needs fixing. \n\n\n3. Skill issue, on your part. They sacrifice massive dps to play it safer. ",
            "I love seeing people at Sepulchre too, but I'll be instancing from now on. Would be awesome if you could have the best of both worlds, but it does sound weird/janky to see someone run straight through a sword.",
            "with varlamore pt 2",
            "Normally you share the sepulchre floor with anybody else on that world currently on the floor, which means that if someone else is already there, the obstacles will already be firing (as opposed to being the first person to enter the floor, where the obstacles will always start the same every time). \n\nSometimes this loses you a few ticks, sometimes it saves you a few ticks. It doesn't really matter that much unless you're going for absolute maximum agility exp / hour records.",
            "Some traps will line up perfectly when you enter but if someone was already inside, the traps will be out of sync. Basically its just a bit more xp if you know what you're doing",
            "Botting easier",
            "i dont think they've even acknowledged theres an issue have they?",
            "how is it 5 max hits? you mean top+bot with slay helm?",
            "Maybe that's why they are ghosting the topic. If that were the case, I wish they would just admit that it would have been too powerful and set the record straight.",
            "they're vewy vewy busy copy pasting a quest from rs3",
            "What bug?",
            "As mentioned below the staff also does not max hit vs melee baboons in TOA",
            "you are highly overestimating how fast jagex responds to these things",
            "Oooh yes. Morytania diary perk perhaps?",
            "It worked with building the furniture, just not the big final chunk of exp",
            "Some players want it for consistency, the fresh instance was designed to be quite smooth since it's the one players would see the most often. \n\nPersonally I agree that over a very long grind grind, the randomness of shared floors was *way* more engaging than doing the same steps over and over. If we're going full instancescape, I'd like a Sepulchre world so that we can retain some of the social interaction.",
            "There's still rng for those things. But flames and swords etc. get consistent cycles.",
            "Yep I believe there's an efficient path to take if you're the only one on the floor. If someone was already on that floor when you entered, the obstacles will already be running, meaning you can't do the efficient route.\n\nThis is only what I've heard though, haven't done it myself",
            "Yes it means as you enter the room everything will always start in the same place",
            "Fresh rooms will give you more consistent runs. When other people are in there, the rooms will be off for you and might drop your xp rates. Also helps to keep things predictable so you can somewhat have it on a side monitor going to 99.",
            "if someone else fucks up a trap it resets the trap or something i believe. so if you're playing perfectly but timmy two fingers fucks up, you're gonna have to compensate for his fuck up in your runs.\n\nassuming you know what you're doing and don't fuck up, this is a good thing",
            "Doing sepulchre efficiently requires that you are the one to load the floor, i.e. no one else is already on a floor when you enter. People memorise timings down to the tick, especially on the early floors, and the obstacles being on the wrong cycle throws that off.",
            "Instances are so you can start with the traps in the same configuration each time, which lets you optimise your pathing.",
            "people for some reason prefer supulchre to be able to be memorized rather than reacted to with regards to floor spawns. i'm unsure why they went this way as oppose to just having sepulchre running 24/7 removing the ability to do these sorts of solves in the first place.",
            "It needs instances because while you don't get flamed when you fuck up, you mess up the floor for everyone else on it as the trap now deviates from its \"set\" path, making people need to deal with the obstacle differently. An instance means no RNG depending on if some idiot was slightly ahead of you.",
            "I'm assuming they'll always start on the perfect tick cycle to get pbs?  Previously you had to have someone else start a set amount of time before you to get pb layouts which was just a faff",
            "I assume there was something broken where you enter the ship on a lot of accounts, then leave and make the 1 person that stays get all the rewards? Possibly some unknown(at least to me) way to boost an iron to full outfit or just a bunch of raw fish?",
            "Apparently there was a glitch where the rewards were decided by the number of people that started the game instead of per person so if some of those people left mid game then it would keep that number for everyone else. Someone posted a video of them abusing this for a snowflake ironman account. \n\nJoin a game with iron + 20 alts.\n\nLogout with the 20 alts\n\nComplete the game with the iron\n\nCollect 21 fishing trawlers worth of rewards",
            "Maybe I'm confused. I don't think their change affects anyone except people abusing the mega scale system, which I personally don't love even in relation to COX.",
            "Next big update is WGS which takes a lot of manpower",
            "I thought my game was bugged last week because it kept telling me I already had an elite clue but I could never find it, turns out it was at deaths office the whole time.",
            "This was a nice side effect. They should let us toggle it as a warning",
            "It makes it easier for people to get consistent “perfect” runs because the instance will load on the same cycle every time if no one is in it yet but if someone is already there then you will be joining at a different point in the cycle and need to adapt. Personally I like seeing other people there so I won’t use it but it seems like a good change so people don’t have to fight over empty worlds/flame people/hop a bunch. ",
            "We got so much content recently and have a massive GM quest coming in a few weeks. I think we can handle a few smaller updates.",
            "You expect a huge update every week? And then you’ll be the first one to complain when things are rushed out full of bugs. ",
            "It's completely optional and opt-in.\n\nSome people would prefer fresh rooms to be consistent on timings. Predictable is somewhat nice when doing it all the way to 99.",
            "One major difference is that combat levels actually make content easier. The hallowed sepulchre experience would be the same at level 1 if you were allowed to do it.",
            "I agree 100%.\n\nThe lockpick already has a scaling drop rate depending on the level of chest. I don't think it would be remiss for the ring to have the same treatment even if drop rate scaled down way more drastically. If you had a 1/10,000 chance of the ring at like 62 agility it could add a spoon chance which is always exciting.",
            "I agree that the progression to reach floors 4 and especially 5 is way too grindy. IMO, they're super fun content and it would be great to make harder content than floor 3 available sooner. Some kind of nerfed XP or reduced (or no?) ring drops would be in order.",
            "Why?",
            "Presumably there was some abusable way to boost through it by logging a bunch of accounts in and letting a single account (perhaps even an IM) receive all of the rewards.",
            "you will survive sometimes losing a couple ticks every 5-10 minutes for the time it takes to get 200 tokens I promise",
            "lmao bro if you don't even have 200 marks yet you're not the type of player sweating/speedrunning the content and you don't need an instance",
            "I don't think finding a free world for 200 marks is gonna be that much of a struggle dude",
            "I'm not quite sure why it isn't just free, but it's not that big of a deal. You only really struggle with people prestarting traps once you get more experienced with Sepulchre, and by then you can easily have 200 marks. If you're already experienced from another account you don't really need the ring(that most people rush) that much and can just rush private instances instead.",
            "It's not hard to get 200 marks.. and you shouldn't even need a private instance until you're fully optimizing runs and just want consistent timings grinding to 99",
            "It's set up in a way if you're new and prioritize other items you can get it after 10th hour of grinding, but if you prioritize black graceful + other items you can get it on your 28th hours ig",
            "Everyone that's good will be in instances making the main worlds mostly empty. If we survived without instances then y'all can get your 200 even easier now.",
            "Think it was part of the bot busting effort. Leviathan bots were also wiped",
            "How is gaining 2.5% exp on mahogany homes making construction slower?",
            "Trawler was probably being abused by loading up a boat with loads of alts and then logging out/afk'ing to boost whoever was remaining. It was probably done by one of those service discords to super charge somebody grinding out the outfit or giving a tonne more exp. \n\nDoubt it seriously affects most people in the mass worlds.",
            "Your priority should be to stay in school and learn to read",
            "If you're several steps into a master you plan on getting the requirement for, juggling and receiving a second will reset your progress on the first. Not an issue if you're planning on abandoning the first, but in that case why isn't it already dropped?",
            "I definitely could do that, and will do once I've got more requirements, but I currently don't have any desire to in all honesty!\n\nOnce I've got my diary cape I'll start doing masters and knocking off clue requirements as they come.",
            "Torso is very easy to get. Just go get it. You are wasting more time juggling than just doing it.",
            "I did the fighter torso in about 2-3 hours over last weekend, and it was actually really fun - was tempted to just keep going and crack out the elite diary step.\n\nMaybe this is your sign to get that torso!",
            "Same :p But I've been afking and doing some fishing/mining, so the casket stacks just keep growing cause I need a smouldering stone, lol",
            "But then you’d have to train RC. Easy choice.",
            "Probably bind blood rune at zeah alter",
            "The whole point of the update was to make it function as a solo if you're last alive no matter the team size. He literally explains that in the start of his comment.",
            "If that were the case, red crabs shouldn't scale down either.\n\nAlso the wording on the update clearly says if only one player *remains*, not \"if only one player enters the raid\" or some such.",
            "Read the second sentence",
            "solo tob is scaled exactly the same hp wise etc as a 3 man. without anyone to share the zap with it will hit 50s though.",
            "That's not what should happen, as per the update post and common sense. Other mechanics in tob dynamically scale down with the number of players in the room, even down to solo (e.g. number of red crabs at maiden, number of exploding crabs at verzik).\n\nNow the number of red crabs at verzik additionally scales down in a duo that has become a solo. The zap, despite the update saying it will scale down when one player remains, does not scale down. That's a bug.\n\nI should not be punished beyond the difficulty of soloing tob for choosing to play with a friend who has a chance of dying on p2.",
            "Ah ok, thanks! So this is to combat what another user said where folks could log in with a bunch of alts?",
            "Thank you for the clarification, I think this is the best approach. Maybe the loot should have been buffed by about 5% to compensate though. It already sucks as it is",
            "How much swamp paste did it take to patch this massive loot & xp leak?",
            "I mean the clarification makes sense as described but isn't sensible. Fishing Trawler is already garbage xp, loot and is dreadfully boring. Nerfing content everyone hates already or making tiny changes don't do anything. This isn't a good change, simply because it effectively accomplishes nothing.",
            "why was this prioritized as a change, over say... a level 3 (or an iron) being able to get 150k+ pts an hour in cox? or irons being able to alt-tank demonics, shamans etc?",
            "yall gonna fix purple boosting then?",
            "Now do megascale raids please",
            "Oh so griefing is now a possibility 🤔 \n\nWhy not just reward an individual player based on performance?",
            "Why waste the dev time on something so trivial and dead content as trawler??",
            "Will this make soloing more rewarding?\n\nPreviously there was very little difference between solo rewards and rewards on the mass world.",
            "lol who was boosting trawler??",
            "I submitted a recovery request for my account the other day and it’s been over 24 hours & I haven’t gotten a reply. Is that probably due to the update?",
            "Interesting.. I wonder if this was abused as an extremely lucrative exploit",
            "they fixed boosting trawler before fixing boosted iron purples?",
            "Who the hell would do that lol",
            "People scaling to mega-boost raids, Jagex: \"I sleep\".\n\nPeople scaling to mega-boost angler outfit, **Jagex awakens**",
            "One group of players discovered/worked out the method. It was patched within 12 hours of testing the limits of it. \n\nAlts are not viable at all for the method. The log out timing is precise and you need max contribution for efficiency. You can do one or two alts as the person staying at most, would be virtually impossible to get contribution or log out on a few more. 5-10 people and voice chat coordination were necessary to get any consistency whatsoever.",
            "My question is, does that matter? You’re still doing 15 accounts of work/time on trawler so why is this any worse than other alt boosting methods? ",
            "> including in Mahomies\n\nThe chiefs are freaks fr fr",
            "that's some gamebreaking xp!",
            "they did not do that",
            "The timings for the various obstacles (fire-spitting statues, flying swords and so on) in sepulchre start when a player first enters the floor (which starts up the sepulchre, since it's not active when no one is there). The typical strategies work for obstacles that start their timing when *you* enter the sepulchre, so if someone else was already in there those strategies are likely off-time.\n\nHaving an instance means you can always have the obstacles start their timing when you enter, allowing for consistent behavior.",
            "When you get a fresh instance the solve for the puzzles is the same every time and you can set PBs etc.\n\nIf you join an instance that's already going due to another player being there you might have to wait for a sword for example that you wouldn't have to wait for otherwise.",
            "the obstacles in sepulchre are only active while someone is on the floor. For the real sweats, a freshly activated floor is preferred probably for some tick perfect running for maximum exp. Instanced floors guarantee no one else is going to throw off the timing.",
            "Sepulcher is already an instance but if there is a player on floor 1 etc when you start that floor you join an instance in progress and join during different cycles. Now you will always get the same cycle",
            "[deleted]",
            "They haven’t really said. They said they’d be polling QOL changes for GOTR and Wintertodt.",
            "Perhaps Scorpia is actually a spider. 🤔",
            "Yeah until we get another big wilderness update poll/blog which probably won't be until 2025 honestly since it seems they're polishing up varlamore part 2 and while guthix sleeps then I assume it's all hands on deck for sailing",
            "Obstacle highlights weren't working, which is moderately annoying when using thumbs to find the hitboxes.",
            "You too.\n\nI've got 6.4k planks to make then I'll be good to go.",
            "Same, 74 days ago on my ironman\n\nBut I am happy for everybody that now gets the 2.5%!",
            "yeah totally, could do all sorts with a plugin, but I like to believe that runescape should be playable without any plugins, it's pretty basic game design to clearly telegraph what's happening to your game state",
            "If a change results in worse loot or xp it’s a nerf, if it’s due to bugfix or design change is irrelevant.",
            "yeah man, can't believe we're going to miss out on all of the socializing that went on in sepulchre (\"can u hop plz\")",
            "How can you tell if someone is an unskulled anti-pker versus just a skiller?",
            "1) I understand that, but this is more of a case in allowing BH not to turn into dead content. \n\n3) They don't sacrifice DPS if they only equip when eating. I don't see how it's a skill issue if an item allows risk free healing & an ability to nullify hits.",
            "has anything been said that it's coming with part 2?",
            "It currently doesn't roll max damage VS melee fremmy in colosseum unless using the special attack",
            "Idk if this is what theyre talking about but the sceptre doesnt max hit against melee monkeys in ToA. It would make sense for it to not work on melee frem aswell.",
            "The fresh instance is probably the smoothest, however the traps are designed to be solved off-cycle too. Whilst you lose a few seconds you will gain some elsewhere.\n\n\nIt's less about efficiency and more about players wanting consistency. The only notable impact in xp/hr is if you were hard forcing the fresh instance timings even if the instances weren't fresh.\n\n\n I strongly agree with Husky here: \n>As for private instances, I really do like the fact that you see other players in the instance while you're doing, this is an MMO after all and I really don't like \"instance-scape\" infact we're considering raising the cap over the coming weeks slowly so that players can more consistently be placed with their friends.",
            "It’s for consistency, not efficiency. Fastest completions/hr is with unrealistic alt manips",
            "Husky commented on this years ago, that the fresh instances timings being easy was no coincidence. With hundreds of game worlds it was the one players were expected to see the most often.\n\n\nHowever the opposite is also true, and Sepulchre is clearly designed for traps to be completed out of sync. It's why pretty much every trap has multiple solves, and rewards deeper knowledge of Sepulchre.\n\n\nThis change is a nerf to those who enjoy the randomness or social aspect of Sepulchre, it was already hard to bump into people. At least give us a Sepulchre world Jagex.",
            "another based s7efen take",
            "People who got sepulchre memorized to the tick are more than able to also do the normal way, it's just \"not optimal xp/h\" for speedrunner sweaties\n\nwell jagex has a history of catering to niche communities and honestly it's a cool thing of them",
            "Cause it's fun",
            ">making people need to deal with the obstacle differently\n\nyou mean react to them as intended instead of just knowing you can close your eyes and 1 tick through half the floor?",
            "Nah, the trash talking is the only argument against instances",
            "> I’m assuming they’ll always start on the perfect tick cycle to get pbs?\n\nGiven it’s not specifically mentioned, I’d assume it’ll start on the exact same tick cycle that it currently does when you’re the only person there.",
            "Outfit is 1/16 regardless of how many people there are, same with Heron at 1/5000-1/2500. This impacts only fish obtained and exp gained.",
            "Yeah that’s probably it, but really both of these options kinda suck\n\nI guess the logic is that since trawler has terrible rewards, it doesn’t really hurt anyone to make them even worse just to fix it when we’re talking such low numbers. I imagine we will see issues of people leaving immediately though… hopefully you still need activity to claim your reward even if it was removed from others",
            "Do you know who posted the video? I know of two YouTubers who used this method but they haven't posted a video on it yet.",
            "They were other players in voice chat, not alts, at most one alt was used as it's hard to max contribution on both as well as log out precisely. No video has been posted yet.",
            "I wish they still revoked status from this type of \"iron\" lmao",
            "they nerfed fishing trawler, not chambers",
            "[removed]",
            "I don't really think so, the most important levels in the Fight Caves/Inferno are Range>Mage>Hitpoints>Defence>Prayer, you could have 99 in all those stats and still not be 126 (most players' combat level is determined by their Attack+Strength+Def+HP+Prayer)\n\nAre you presenting the \"it's the same at level 1\" as a negative? It's great content, I don't see the reason for locking it behind an absurdly high level",
            "This is correct. It required a lot of accounts but gave insane fish and xp per hour. It would be super abusable by bots, so it's good they fixed the loophole.",
            "Speedrunners don’t even loot",
            "Tbf the folks speedrunning HS would never use a private instance in the first place. The best times on some floors are only possible if you’re entering an inhabited instance due to trap timing.",
            "No bots were doing the fishing trawler method, it was only discovered by one group of players a couple weeks before it was hotfixed last week",
            "I misread that part, my bad",
            "Not probably it was definitely being abused.  2 youtubers who haven't posted their vids of it yet abused it to get upwards of 700k fishing xp/hr from trawler.  It required a lot of people to be playing and then logout just before completion to dump all the exp and rewards onto 1 character.",
            "Haha, fair enough then, I’m nowhere near having the requirements for the diary cape (slayer, agility, RC, and fishing reqs are *brutal* lol) and I can do masters pretty easily most of the time. \n\nSo far I’ve only hit 3 roadblocks on masters (though to be fair, I’ve only done like 9 in total lol)\n\n- my first master clue I got “cut a redwood” so I said “fuck it” and grinded out 87 WC more-or-less straight away. \n\nA couple of masters later I got this fighter torso one, which has sat in my bank ever since. \n\nEver since the 1 hour clue despawn change, I’ve juggled the masters, and I’ve been able to do something like 5 of them with the only roadblock being a step that required full prospector. \n\nBut luckily I’d already done a fair bit of that grind, and after selling my coal bag and using the varrock armour for the chest I didn’t have to spent too long on that step.",
            "Diary cape and a few of the other achievement gear teles all together are super good for clue hunting. Not a bad idea to wait until then. I've done *so* many clues since getting mine a couple weeks ago.",
            "I mean I’ve spent probably 5 minutes total juggling it, it doesn’t exactly take much time to drop a clue and pick it up again. \n\nSay I spend 10 seconds to drop it and pick it up again. (I think this is an overestimate but let’s run with it)\n\nCall it 20 times I juggled it in MLM, plus another 5 for other masters I’ve done in 1 go, we’re talking 250 seconds. \n\nI just haven’t wanted to commit a solid 2-3 hours to a specific mini game I’ve never done that also relies on forming a squad. \n\nI don’t get the impression that it’s difficult, just that it requires a solid continuous chunk of time, and I like to be able to drop what I’m doing at a moments notice if I need to deal with something IRL. \n\nI do plan on doing it eventually, which is why I haven’t just dropped the clue, but it’s never quite felt like the right time, so why bother with it if I don’t feel like it?",
            "It’s funny because I’m sitting on the same master clue and I just haven’t found the motivation to go learn and do BA. I know it isn’t as bad as I think it’ll be, but I just can’t be assed to do it",
            "The only thing that holds me back is that “2-3 hours” part. \n\nI have no issue playing for that long, even continuously, but I rarely want to commit to that amount of time up front, and then be stuck online until I’m done. \n\nAs far as I can tell you can’t exactly do it in chunks, you’ve mostly gotta do it in 1 go so you can stay with the team you formed?\n\nThat’s what is stopping me from doing it.",
            "Real gamers have an untrimmed rc cape. Sorry bucko, I don't make the rules",
            "No I understand that, but the difference is your entering a solo instance Vs a group instance, so I'm assuming it takes that into account?",
            "Nah I never have done a solo ToB, I have done a couple of Duo but I was never a fan of it. I'm saying \"git gud\" in quotes as a joke, no need to be offended.\n\nAlready commented on someone else explaining it to me which I now understand is different to what was proposed",
            "Altscapers ruin everything lmao",
            "Yeah the only reason to go is the outfit.",
            "100% dead content other then then outfit place needs a buff. Maybe with sailing??",
            "The problem is if you used 99 other people who all left right before it ended you would 100x the rewards. Someone was doing it the fix was needed after the method was found.",
            "It isn't even a nerf. You'll still get the same rewards as before if you're playing normally. It just prevents boosting with a bunch of friends/alts.",
            "It's so weird how they approach bugs and unintended mechanics, there's zero consistency which encourages people to abuse the fuck out of them as much as possible until it maybe gets nerfed 3 years down the line.",
            "cant have fishing trawler give absurd amounts of loot and xp! lmaooooooooooo",
            "Someone else mentioned that a youtuber was getting 700k fishing xp/hr with the use of this method.",
            "All it does is counter boosting, there's no affect to loot on normal gameplay.\n\nPre-change, say 10 people were playing, 9 of them could log, and the remaining 1 would get 10x the loot.\n\nPost-change, if 10 people were playing, 9 of them could log, and the remaining 1 would still get 1x the loot.",
            "Almost certainly. Jagex doesn't really react to things like this unless it was abused.",
            "I don't really see how it could be lucrative, since you could also just have the 50 alts stay in the trawler and get the rewards on each. Unless you start a trawler with 50 -> log off on 49 -> hop on the 49 that are left -> start a trawler with 49 in the new world -> log off on 48 etc.\n\nI assume it was mainly used to boost irons or something?",
            "Secretly the Jmods are boosting their own purples. uwu",
            "why would they fix their money printer?",
            "ChunkYanille and Hanannie were doing this last week to boost.",
            "Isn’t fishing trawler one of the best ways to farm Heron?",
            "There’s a couple of chunk accounts stuck in trawler hell.",
            "Viable that people would do boosted sales to get the angler gloves faster.",
            ">People scaling to mega-boost angler outfit,\n\nI don't think it affected unique chances, just the normal loot and xp.",
            "Silly really considering 95% of people probably only ever go to the trawler for pet or angler",
            "Ah cool thanks for the info.",
            "has implications if the boosted acc is an Ironman buts it’s generally a small issue yea",
            "They could give it a massive buff and it would still make no difference. It's already a short 99, and pretty much nobody touches the skill post-99 anyway. I'm not even 20m Construction XP (on a main) and I'm ranked in the top 900. For comparison I recently got 200m Farming and I'm not even in the top 900.",
            "NERF IT JAGEX!!!",
            "Almost all obstacles can be solved off-cycle too with minimal to no waiting. (*Almost*, looking at you floor 4 N fire). In fact this is how the WRs are created. \n\n\n If players want consistency fine, but those of us who enjoy the randomness of Sepulchre or some social interaction in our MMO will be a bit nerfed with this change. It'd be nice if Jagex could give us a Sepulchre world to race each other on.",
            "Ahhh, makes sense. Good that they're getting something nice :)",
            "https://youtu.be/ncofgVboXwk",
            "Jagex's HD won't be like 2012 nor will it have new assets. It will be a shader based approach. Think about how much you can change the look of Minecraft with shaders. It will be the same for OSRS. ",
            "Brother you would love [HDOS](https://hdos.dev/) ... They have many of the same plugins as Runelite but I find the performance to be noticeably better",
            "There’s also Part 3 of Varlamore coming still",
            "I'm glad I did it regardless, because construction cape is a huge qol",
            "They aren't placing box traps, or they're just standing near a dropped box trap.  Or they are bad and start sipping potions in anticipation XD",
            "You'd have to dig through j mod comments on blog posts when varlamore released. It was mentioned on one of those that agility was delayed for pt2.",
            "You only roll max damage with left-click attack on powered staves. Manual casting from spellbook can splash",
            "it does max hit against core in wardens fight though, funny enough",
            "nobody actively uses alts for sepulchre. Maybe for 1 stupidly fast time for a laugh then never again. The alt is always better being used for something else.",
            "Is doing randomized public Sepulcher less xp and profit than starting a fresh instance?",
            "we've been asking for this for years. sep is no more challenging with people messing up your floors, you just simply end up waiting for 3,4 or 5 seconds at traps doing nothing. This is not some diverse gaming experience.",
            "Citation going to be needed on \"reacting to stuff\" being the intention for sepulcher.",
            "Oh no, emergent strategies!!! ",
            "I'd have liked to see a very slight buff to the loot just to compensate for this change. But realistically it doesn't even matter tbh, the only reason people actually go there is for the pet and for the outfit(damn angler gloves are so rare)",
            "The videos wont be posted for a month or two.",
            "Agreed. This is right up there with mega boosted raids",
            "Yeah, why do you care? It shouldn’t affect you",
            "you need to take a break man this is a real loser comment",
            "I mean I've been doing sepulchre to 99 and I'd say other people resetting the room before you is just mildly annoying? I'd prefer it to be more consistent with a solo instance but I would not call it a significant change either way... Most worlds you're by yourself anyways. I generally agree to watch the ezscape updates but this is a pretty nothing change.\n\nI'm assuming you're trolling, but if you're not you should probably touch some grass",
            "Higher levels unlock better content. It's a core design principle of the game. Ignore that, and you may as well start everyone with a maxed account.",
            "[deleted]",
            "And how do you know this info? Are you mod ash's alt account?",
            "Surely not somebody like JCW, right. lol?",
            "so the solution is make it worse than it already is for the normies just trying to get anglers on mass worlds, sweet fix",
            "Torso takes 3-5hrs to get. What do you do when your master that you are doing has a step you cant do and you have the torso step on the ground already? Do you now juggling 2?  If you have dropped a master clue at any point while keeping that torso step you have pretty much waisted more time than just getting the torso.",
            "Just know that defender is literally watch a 5 minute guide and marking tiles (and you can label the tiles to say x good or x bad, along with how many logs to grab).\n\nThe other roles have no technique for W306. Just wear tank armour to reduce damage taken or your best ranged armour.",
            "Weirdly, none of the groups stayed together for multiple runs, so it was really 4 chunks of 30-45 minute runs for me.\n\nLuckily I never spent more than 5 mins looking for a group, so that wasn't an issue either.",
            "Which should not be the case. the assumption here is that, when they changed normal tob solo instances to have the same changes as hard mode tob solo instances, that this would carry over to raids where only 1 player is alive. in HMT the crab and zap have been changed, and there being 1 crab still when you're last alive shows that they intended to change this as well. currently you have to bring a stack of purple sweets and spend 5 minutes tick eating zaps in order to get through p2.",
            "Ye I also edited my comment (though not sure if before you replied or not, funnily enough I was in a solo tob at the time) to remove the part where I bitched at you for the offhand comment.\n\nGlad someone else was able to help clear it up too.",
            "I know this method was used by a YouTuber (unsure when the vid will drop) but they used a lot of community members, not alts :)",
            "[deleted]",
            "Nah",
            "I feel like allowing for exploits like this to exist is kind of fun isn’t it though? Adds a level of silly community cooperation to helping people power level.",
            "Who the fuck had 99 people log off so they would get extra loot? Name names because this is a lie. \n\nEdit: I was very wrong. ",
            "Probably based on how much spaghetti code there is to fix it though, can bet this one is a 10 minute fix where others could be a complete rewrite for something that’s seemingly simple",
            "That was peak after one big game; Sustained for most of the method use was at 90-100k/hr. It's silly high, but requires a lot of people, a lot of coordination, and is incredibly easy to screw up.",
            "Yeah but the reason this even worked to begin with is because the amount of fish increased by number of players and then were divided by number of players, meaning that if nobody left you get the same number of fish and xp solo as you do in a group.\n\nWas just hoping they'd have buffed solo play since the whole division of loot seems to be intended to make solo play more rewarding similar to zalcano loot, but just was implemented poorly.",
            "It was used and it'll be on YouTube eventually. The person in question now has the record for a fishing xp drop which most likely was 50k before for everyone who completed Swan Song.",
            "Ehhhhh that’s a pretty big assumption",
            "You wouldn’t get rewards on each though since the 50 alts will likely all fail on the activity meter. Previously it seems one account would still get the loot from all 50 accounts despite being the only one to successfully maintain the ship/acticity meter",
            "It was used to boost one iron and test the limits of the mechanics. It wouldn't be lucrative in any way. If all 50 players stayed in, they'd get the same amount of fish as using the method to put it on one person. Also, it's completely not viable to do more than two alts or so for the person staying. You have to log out in a pretty precise window, as well as get max contribution.",
            "Seriously lol, boosting on a chunk account is the most self-defeating thing ever",
            "Yeah but isn't that a static 1/2500 roll per game? Don't see how alt abuse would be worth anyone's time for that",
            "It is, however, this method doesn't affect it. If it did, it would be hilarious. But the roll is static and you're still only getting one actual roll- That roll is just given with an absurd number of normal rewards.",
            "Maybe statistically (but it's a flat static roll so this wouldn't affect it), but anyone who actually tries for heron by grinding trawler should be institutionalized.",
            "oh no, anyway",
            "Going for heron? I'd like to think anyone playing an Xtreme one chunk wouldn't be abusing alts",
            "I actually forgot the gloves existed on my first run(despite people in public chat constantly talking about it). Had to go back for it later and it took me over 100 runs before I got them. Totally worth it though",
            "Correct. Heron and unique are rolled once per net check, and the boosted account only gets their one roll. The normal rewards are what gets multiplied.",
            "“Juuuust making sure I dont fit in”",
            "Shit I didn’t even consider how the folks doing instances will reduce the opportunities for the rest of us to get better times. That really sucks.",
            "[deleted]",
            "[deleted]",
            "Its literally the best thing I know, the cape hasn’t left my inventory one minute lmao",
            "The powered staff accursed sceptre left click rolls non-max hits on melee fremmy",
            "so what you're saying is it seems to be classified as  a melee weapon. classic tbh",
            "🍝🍝🍝",
            "Sounds like it's coded as a melee weapon? lmao",
            "Not really because the few seconds lost are offset by the few seconds gained. \n\nIt's only notably slower if you are sitting there waiting for everything to go back to the same timings as a fresh instance, due to a lack of knowledge about how else to navigate it. \n\nRandomised Sepulchre not only gives social interactions, but rewards extra Sepulchre knowledge and the opportunity at beating some PBs that are impossible in fresh instances.",
            "The person I'm replying to says there's already a video posted. I'm aware Josh and Hannah won't post theirs until (way) later.",
            "idk , funny enough i did like 2 runs of fishing trawler last night just for nostalgia and I thought it was sad u already got barely an invi's worth of fish per run. i think nerfing it further blows when its such an oldschool method",
            "I don't want to work my ass off to obtain supposedly megarare items when other lvl 3 people will be able to do so effortlessly because they happen to have more money...\n\nIt's people like you who'll eventually enable MTX into the game.",
            "Me: \"this content unlocks far too late in the game that most players realistically won't experience it fully\"\n\nYou: \"SO EVERYONE SHOULD JUST BE MAXED RIGHT OFF THE BAT THEN HUH\"",
            "That’s for consistency rather than world records",
            "On mass worlds you will basically notice no difference in rewards.  On mass worlds you might have 1 or 2 log out just before the end but that difference won't really be noticeable.",
            "I’ve had that happen 1 time so far and yeah, I just juggled both of them. It’s really not a hassle. I was grinding out the rest of prospector outfit, once every 4 trips to empty the sack I took an extra 5-15 seconds to pick up and drop a clue. \n\nAside from that 1 step, I’ve just been able to outright complete 4 other masters\n\nAnd completing a master takes like 15-20 mins tops, there’s no possible way I’ve managed to lose hours and hours when it’s impacted 1 clue so far. \n\nI’m not really worried about losing the progress on 2-3 steps because it doesn’t take that long to do a couple of steps.\n\nWorst case I hit another roadblock and either decide to finally dump a clue, or I have a new short term goal to grind for.",
            "Oh, cool, I might just have to get around to doing it then lol",
            "Ahhh that makes sense, I've never been solo ph2 hard mode so I never knew that was the case.",
            "Fair enough. Sorry for my bitchy reply.\n\nYeah I just assumed it was acting as intended because you entered the raid as a duo, but flopped at  ph2 and your still being punished",
            "I'm guessing it was Josh Isn't Gaming on Chunk Yanille, since he rolled Port Khazard at the end of his last vid (and he has 81 Fishing now, for the Manta Ray chunk task).",
            "\"community members\"",
            "What’s different in Eve?",
            "JoshIsntGaming has a Chunk Locked ironman, he had people on his disc + from Hannanie's community doing this exact thing, which is why it got patched.",
            "as stated in another comment the chunkman \"josh isn't. gaming\" was having his stream chat do this as he rolled the chunk and was far below the levels he needed.",
            "The division of loot was solely to nerf boosting, it had nothing to do with making solo play or masses better lol.\n\nSay you're in a group of trawler and your group gets 500 fish total. 10 people = 50 fish each. Prior to the change, 9 people could log out, giving 1 person the full 500. They didn't like that, so now it's always going to default you to your share rather than getting extra for getting people to logout and boost your rewards.",
            "Perhaps. Most times you see something in the patch notes, it was abused.",
            "Maybe they'd get the activity meter minimum requirement(which is pretty fast to get) and hop then? Or it was literally just a way to boost irons but they haven't really done much about that in the past so it'd be a little weird to start doing that now(I'd love it if they did though).",
            "If you could decrease a grind's time from a month or two to a day or two with mechanic abuse, why wouldn't you?",
            "Didn't break any chunk restrictions",
            "I guess as an iron you could quickly stack up a lot of fish early on, but even then that barely seems worth. Plus if I'm doing that level of abuse I'd probably do a megascale cox or something.",
            "Why would you think that? Even Limp and Verf used alts to speed things up",
            "Rare L take IMO. Verf and Limp happily did",
            "I'm not sure what you mean?",
            "Floor 5 still has skill expression and RNG playing heavily into its PB via the arrow and teleporter runs. However, yeah the upper floors are going to be even more static than they already were.",
            "For people who don't like 117 this is amazing. I don't like 117 because it looks too different but this looks just like regular OSRS but better. I can imagine for people used to 117 this isn't very big news.",
            "I love 117, but to me the Jagex HD update looks significantly better. It also means that HD won't break if the game is updated.",
            "They're a bit behind in plugins (missing any varlamore related content, and the quest helper doesn't have any varlamore quests) but it's still great imo and I use it daily ... Enjoy brother !",
            "Im willing to bet its also tied to the reason it always max hits on the core at wardens despite not being a melee weapon. Was fun using it with mage build in leagues.",
            "Why is it faster to complete an already started Sepulcher than a new instance?",
            "Oh I am not opposed to buffing the drops, my point was that I don’t consider this a nerf at all to the common player. It’s only a nerf to those abusing the system. \nI’m all for a loot buff for trawler.",
            "What are you talking about? I am opposed to mega scales and I’m fine with the fishing trawler change. Please reread what I’ve said thus far",
            "That's not how quotes work. If you want an example, try this:\n\n>Are you presenting the \"it's the same at level 1\" as a negative? It's great content, I don't see the reason for locking it behind an absurdly high level\n\n>-EpicRussia",
            "what are you basing that on? either way, its still less for the average angler enjoyer",
            "Good detective skills :D",
            "Dang what was his xp per hour??",
            "Damn that’s too bad. I like his series. Just don’t watch the streams. Thanks. ",
            "Right, but I'm saying **before** the nerf there was a mechanic to divide loot, which caused this problem, but was nearly irrelevant because the number of total fish in the net was multiplied by the players at the start of the game.\n\nI am wondering if they have moved that multiplier to happen at the end of the game, or if they have gotten rid of scaling entirely since in effect solos had very little difference in rewards vs. masses.\n\nImo, unless they wanted solo loot to be better there is no point in dividing the fish among players vs. giving everybody separate loot rolls like nearly every other mass content in game, but would love to see solo trawler be a bit more rewarding.",
            "I helped use this method, we stayed on as long as possible to get as much fish as possible and log off just before the end.",
            "There is an extreme chunk lock ironman yanille that rolled a fishing trawler chunk a couple of weeks ago.  I did bump into him when he first started the grind, he said something about rewards being misleading and was trying to figure out how to get the most xp possible. \n\nI guess he figured out eventually it splits based on the amount of people left at the end.",
            "you’re replying to NoCurrencies, i’m certain the integrity is key to the challenge for them",
            "\"I am purposely setting out on a journey with self imposed  difficulty, and I will immediately abuse boosting to lower the difficulty\"\n\nI mean it sort of defeats the purpose of a chunk locked account IMO, it's supposed to be grindy",
            "I suppose it's a question of the nature of the \"abuse\" - I'm not up to date on any YT series at the moment, but as I recall both Limp and Verf were using a single alt for PvM purposes, reducing grinds from *near impossible* to *very difficult but still manageable in several months*. Doesn't really compare in my mind to using 50 alts to get a fuckload of fish from fishing trawler, because how does that even speed up heron grind? For that matter, why is heron required for an Xtreme chunk account since it isn't on the fishing trawler log page?\n\nFor my own part, I routinely do things the \"hard\" way because I'm compelled by my own personal twisted sense of integrity. For example, I'm doing my whole Zilyana grind with melee, because kiting a boss just doesn't feel like a valid game mechanic thematically.",
            "[deleted]",
            "Yeah it hardly seems worth the effort for a few fish, it's better to just camp karams anyway",
            "Boosting is boosting, you do whatever people pay you to do. Whether its heron, clog spots, or megascale raids.",
            "I suppose it's a question of the nature of the \"abuse\" - I'm not up to date on any YT series at the moment, but as I recall both Limp and Verf were using a single alt for PvM purposes, reducing grinds from *near impossible* to *very difficult but still manageable in several months*. Doesn't really compare in my mind to using 50 alts to get a fuckload of fish from fishing trawler, because how does that even speed up heron grind? For that matter, why is heron required for an Xtreme chunk account since it isn't on the fishing trawler log page?",
            "I suppose it's a question of the nature of the \"abuse\" - I'm not up to date on any YT series at the moment, but as I recall both Limp and Verf were using a single alt for PvM purposes, reducing grinds from *near impossible* to *very difficult but still manageable in several months*. Doesn't really compare in my mind to using 50 alts to get a fuckload of fish from fishing trawler, because how does that even speed up heron grind? For that matter, why is heron required for an Xtreme chunk account since it isn't on the fishing trawler log page?",
            "he thinks you're not being genuine because you don't share his beliefs, because he's stupid",
            "Yeah this looks fking amazing and I’m so gassed for it, never really got on with 117 as it looks too rs3 for me, but jagex managed to keep the os feel with theirs. Obvs we’ve just had a teaser but im excited.",
            "It isn't always due to the random nature, but it can be. \n\n\nThis applies mainly to the upper floor PBs where there is far less skill expression and you are gated by trap timings. The default trap timings of a fresh instance are good, but there are better ones that exist in non fresh instances.",
            "Love his series, looking forward to the vid!",
            "Gotta update that flair so we know it's you!",
            "You could get like 700x kp/hr lmao",
            "I believe he managed to get the chunk completed before the patch, it was mostly just to speed up the \"get a manta ray\" challenge for his chunk.",
            "How much fish/exp are we talking for the account that stayed? Kinda curious.",
            "We did an absurd amount of testing and figured out a LOT. Most of which is that the trawler mechanics make no god damn sense, LOL.",
            "For me personally, yeah",
            "You can also argue the point is to find the fastest way to do something within the limited chunks which he very much did.",
            "Hard disagree. The fun part of accounts like that isn’t the grindfest just for the sake of grinding, it’s having to come up with and execute weird and unique solutions to problems because of the restrictions",
            "Wouldn't that logic apply to UIMs using ways to store their items? It's just finding mechanics to make their grind as fast, easy, or efficient as possible.",
            "That's a totally fair opinion, I personally don't see the point of grinding low xp methods for the sake of it but that's why I don't do it and barely enjoy watching :)\n\nIn this case especially I don't mind it because it's interesting to see how the mechanics work of this RSC era minigame work and can be misused.",
            "As others said, only one alt was involved- The rest were members of his community, most of the games being done with not many people.\n\nTo me personally, I way more enjoy just figuring out obscure mechanics and how to break them. I also personally love chunk accounts finding really silly ways to get something done efficiently. It's not for everyone, but yeah.",
            "I don't think it was a Heron grind, it was an 81 Fishing grind with only the Trawler as an unlocked training method.",
            "The grind was/is fishing to 81 for Manta Rays & banking resources for cooking xp. And it was more a community effort using actual accounts rather than alts.\n\nI personally thought it was cool, also to see how far these rsc age game mechanics can be pushed. But it's completely fair to not like the method and not want to do it yourself if you were in a similar situation :)",
            "Spirit of the game means nothing to a lot of the community yeah",
            "Against your idea of the spirit of the game, sure. It was a broken mechanic that was abused in a way that fostered a community which is what my idea of the spirit of any MMO is about, and it did not harm any other players/economy/etc.",
            "Is having like 30 people scouting imps for you also not in some way abusing multiple accounts?  Im sure theres plenty other ways more than one account can help a self restricted player\n\nAlso, is being a log the qualifing factor for all xtreme accounts? No quest cape is a log but they’re requirements, bis items are requirements when not on a log etc",
            "Heron wasn't a requirement, just fish and cook Manta for the elite diary.\n\nThere weren't alts used and alts really wouldn't be viable because you need enough accounts doing bare minimum to keep the boat from sinking. The majority of the Trawler grind ended up just being community pings for anyone willing to donate time at Trawler to boost exp within the busted mechanics found. Most of the time it was a group of ~10 people hanging out in voice resulting in a ~30k exp drop every 6ish minutes. Near the very end (last 2 levels or so) Hannanie was reached out to and she wrangled up a huge crew of people with the hopes of setting the world record for highest single exp drop in the fishing skill, which was achieved! However there were some limitations as once you got around 75k exp the game would get insanely laggy while checking the net and around 80k exp you'd get force logged out and would receive nothing. \n\nIt was a rare opportunity for a Chunk YT community to be able to donate time and hang out together to expedite a future video by using some pretty novel and janky old mechanics. To me the process of figuring out an unknown mechanic for the first time on a 20 year old mini game and pushing it to its limits is a far more interesting video than waiting 2 months to watch a 3 minute super cut of 200 hours of Fishing Trawler.",
            "Hah, I'm not half as talented as Josh - I should be somewhere in the upcoming trawler vid tho since I helped and that's awesome :)",
            "From what I remember, 70k+ xp drops per trawler trip which would be like 700k+ xp/hr.\n\nThis required a lot of accounts and reliable log offs, so wasn't easy to do. It would've been super easy to abuse with bots, which we obviously didn't.\n\nThe exact numbers will be in a YouTube video at some point, I hope :)",
            "when i saw your comment the other day about how you considered gwd kc a currency and grinded ecu keys i knew you were a real one lol",
            "I get the sentiment in this context yeah",
            "Yeah someone else said the same, I was OOTL on the details obviously",
            "Yeah someone else explained it in another comment, it's actually a neat story!",
            "And it resulted in an immediate change by Jagex, literally ruining the game for the sake of a youtube series.",
            "Fair points, I forgot all about the lucky imp grinds by Settled and Verf. Others mentioned that Heron itself was not the grind in question, yeah. Nice progress on the 807 btw! When max?",
            "That's actually a neat anecdote! It does seem silly that they'd patch this but leave megascales",
            "Yeah I can definitely see why they'd fix that then(despite requiring many accounts).",
            "The majority of the mechanic being used was done at ~100k exp/hr getting 8-14k drops per game with 5-10 people. Even with 5-10 reliable people, a lot of games still got failed LOL.",
            "My own restriction only means anything if I follow it to the letter! I mean with respect to alting, that's got nothing to do with my restriction, but \"integrity\" as you said. You'd expect a correlation there amongst restricted accounts, but opinions vary widely on this subject apparently",
            "Cheers, Probably never because im very bored of playing it hahah",
            "As someone who spent a good 12 or so hours at Trawler over 2 weeks and received nearly 0 fishing exp (you're bound to miss a logout at some point), it ended up being a surprisingly good time because of the friends and community. I was able to get in a fair amount of bolt tipping for nearly 500k fletching exp plus went through about 5k swamp paste for the cheapest (and slowest lol) 25k construction exp you can get."
        ]
    },
    "DMM Allstars all Teams final Setups": {
        "title": "DMM Allstars all Teams final Setups",
        "score": 1183,
        "url": "https://www.reddit.com/gallery/1dlja80",
        "content": "",
        "num_comments": 582,
        "comments": [
            "The knife and teak log in JCW inventory made me smile.",
            "Skilly bringing along the full DH set is so true to his character lolll love that man",
            "2 DH sets from team burgers. B0aty really is content maxing this event lol",
            "interesting how only Faux team has blood furys",
            "JCB is a king haha really enjoyed him during the week. \n\nLove to see this become a yearly thing to hype up DMM, take on the feedback from participants and go again next year was really fun following it all week especially as someone who works night shift too, was 24/7 top notch osrs.\n\nThink it will be a big fumble by Dinos team to not win it tbh well rounded team and great gear.",
            "Im gonna fucking lose it if Skill Specs gets a DH bomb kill. Especially if it's on Torvesta\n\nThat's all I want from this finale",
            "I see that infernal cape switch and I respect it.",
            "Coxie, Muts, Torvesta, and Mammal with the doors and Skilly with the DH. This is going to be good",
            "Jcw is a funny guy man. The B0aty burgers have been straight content all week",
            "Jcw is going to win",
            "Dino Nuggets had some CRACKED RNG this week wtfffff who’s handing out the reach-arounds?",
            "I think that CG grind was well worth it for Faux’s team. That crystal with BOWFA is gonna slap",
            "I can’t believe only 1 team went to ToA for fangs!",
            "The fact that Faux’s team didn’t attend a single breach, didn’t engage in any kind of PvP, basically played scared/hide and seek all week.\n\nTo see them rank 2 is an absolute shock.\n\nI feel like overall talent will trump gear.\n\nDino/Oda will probably win, but man the content from the Devils & Burgers this week was some of the best you’ll ever get.",
            "When is finals",
            "What's with the knife and log in the inventory of JCW?",
            "Why does Gunschilli have so many empty inventory spaces? Why do some of them have empty inventory spaces at all?",
            "Screenshots from Fauxs stream so excuse the quality :)",
            "TIL that Oda can notice pidswap from the noise he hears from the ring of recoil\n\nI fcking lost it when he was telling Rhys it and Rhys is sitting there thinking what kind of janitor PVP sorcery am I listening to\n\nOverall PKing wise the man is built different than anyone in the tournament. Rhys Westham and Oda are in their own tier in this tournament. Dino Boaty Ditter probably in the next tier along with some other guys\n\nThe breach RNG could carry Team Dino all the way though. Team Faux has nice gear but no elite spec weapons and no augury should be too much to overcome",
            "3 of the 4 zurial staffs in Dino’s team is scary",
            "Faux’s team had the best strategy but provided no entertainment value. No memorable clips unlike the other teams.",
            "Jcw setup lmaooo what a sigma",
            "I don't really see anyone with less food, even though some died a lot more? How come?",
            "Is this also the order they will be fighting in?",
            "Donator is the only player without a fury",
            "odas team rng at zammy was painful to see",
            "Honestly skill specs is so insanely funny. Freezing the skeleton, freezing Donator in team fights, screaming all units all units, wanting to kick Alfie through the moon door. Dude is a comedy genius, unintentional or not",
            "Damn cute little karambwam by roidie. KKonas have the most consistent gear while Snakes seem to have the higher top end. We’ll see if the blood furys pay off.",
            "Gunschili's inventory just feels downbad. Copies going in with the Bulwark is a fucking vibe though 🤣",
            "Which teams has the cox prayers?",
            "Rune dragons was a clever move. Mika did a bunch of black drags on the last day for stats and in hope of a vissy, but actually he may aswell have been at rune drags for the hope of dragon crossbows.",
            "oda forgot to put the imbue scroll back on his suffering afufufufufufufufufu",
            "Not the broodoo shield hahahaha",
            "Its a shame how much of the even comes down to very small portions of extreme luck. Dinos team having 3 staffs 2 vls while killing significantly less mobs than Solos team is just so meh.",
            "Why does Pip have a steel crossbow?\n\nFaux's team all have Fbow and crystal armour but really poor spec weapons.",
            "A Cold One is the only person with an infernal cape. Port Khazard is also in max (ancestral, etc), his fights should be really interesting to watch",
            "Oda’s team put the blood fury on a guy with veracs, a zamorak godsword and no freezes instead of the VLS haver!",
            "I’ll be surprised if Solomissions team doesn’t win.",
            "The Dino team gear is above and beyond right? Won’t it be a wipe because of the overhealing or no",
            "Solo's team got absolutely spooned with ancestral. Same with Dino's team. 3 Zuriels and 2 VLS? Aight.",
            "Apologies if I’m blind or simply don’t know but why does tovesta and alfie have bolts without a crossbow",
            "Dino’s team should win but I wouldn’t be surprised if Faux’s team wins instead",
            "Why is there one member of the first three teams with full verac's? Is there a strat or does verac's just genuinely have good DPS through prayer?",
            "Let’s go solo! You guys got this 🙌",
            "When’s the finally?",
            "Surprised that Oda isn't bringing a gmaul, I'd have expected him to try to go for that KO potential",
            "If donator didn’t spend so much time throwing maybe the burgers would have stood a chance",
            "Calling it now, Oda v Dino finals. Overall standings:\n\n1) Oda\n2) Dino\n3) Solo\n4) Torvesta\n5) Faux\n6) Boaty",
            "Snakessssssssss",
            "Whatever team has Rhys will win.",
            "Could anyone tell me when are the finals?",
            "[deleted]",
            "Rooting for anybody except Dino. Dino is awesome, I just want an underdog to win :)",
            "So gassed for this!",
            "2 pair of dclaws is gonna be tough.",
            "How late is the Finale?",
            "suffering seems pretty good",
            "Nuggets had the best RNG (by far holy shit), but the KKonas had the best strategy I think. Fangs, crystal and blood furies across the team look menacing. \n\n\nWarriors have some crazy NHing talent but I don't know if it's enough to make up for their gear. I know Oda mentioned that CG was definitely the play late into the tournament, but it was too late to switch plans.\n\n\nBurgers are chads for bringing DH.",
            "Im wondering if everyone will have enough bolts",
            "I'd love to see overall drops from CoX to see who got fucked the most with drops.",
            "3/5 odablocks team using climbing boots instead of gray boots??",
            "I swear Oda, V and guns have climbing boots on, not grey, lmao",
            "KEEN!",
            "Why do so many of them have mithril/adamant seeds? Or is it something else and I'm just being dumb?",
            "You can see the boots from each player to see who plays osrs on low and high brightness.\n\nAs a low brightness player, I'm very disappointed that I'm in the minority.\n\nI might switch to a higher brightness to see how it is.",
            "Gl to all of them. May the best clicker win! 🎉",
            "Good luck to all of them. May the best clicker win! 🎉",
            "Boaty with the imbued heart",
            "Is this the order that they’ll go? If so then the Warriors are advancing. Going top two pker’s off rip. Yeeesh. But as I’m typing this I’m realizing it’s done in order of captain then drafted but I’m not gonna stop.",
            "Torvesta team is cooked",
            "Jcw with the log and knife xD",
            "Skilly rolling into the final with full dharoks is exactly what I wanted to see",
            "As someone who knows very little here is my super uneducated guess:\n\n1. Dino\n2. SoloMission\n3. Faux\n4. Odablock \n5. Boaty \n6. Torvesta \n\nReasoning:\n\n- IDK anyone on Torvesta's team except Torvesta. Torvesta seems okay at pking but I place Boaty above him. TBH I have not really noticed anything from his team except they logged out a lot mid-fight.\n- Boaty's team is second last for probably obvious reasons. \n- Odablock's team next because I'm 99% sure someone is going to tilt and ruin team morale. I think Oda is great at PVP but in a team setting it's very questionable\n- Faux's team next because they seemed weakest out of the remaining 3 teams. People have said blood fury is going to be huge so maybe they will come in first.\n- I place Dino's team above SoloMission because I think they have the best gear now? Otherwise it would be 50/50 between the two for me.\n\nAgain this is a super ignorant take as someone who watched a lot of DMM allstars but is not super experienced at the game at all. Either way it's been a lot of fun and I hope they do this event more often and continue to refine it to work out the kinks.",
            "Does this event mean we won't have a regular DMM like we've had the last few years?",
            "Fauxs team looks stacked lowkey.",
            "Seems maybe like going for Crystal and bofa might end up have being very worthwhile over this dmm.",
            "god daaamn that 4x BOFA I wanna see that!",
            "Am I missing something or shouldn’t eliop have port’s gear?  Eli is their strongest pker by a pretty good margin",
            "Don't forget the woodcutting cape",
            "73 arrows. WC cape. Knife log. A true skiller PvP setup",
            "Is it a meme?",
            "73 d arrows is also a nice touch",
            "He was roasting skill specs so hard last night it was hilarious",
            "I'm already looking forward to him risking it every fight, that man has no fear",
            "He has the room for it after dying so many times LOL",
            "He said his team goal was the most clips and they definitely achieved that and more",
            "Getting skilly on the dh was mandatory",
            "Imagine a full team of DH bombs coming your day lol",
            "They pretty much camped them and ragged anyone that tried to farm them during the week.",
            "5 bowfas, 4 fangs, and blood furies are about to go hard in these war of attrition fights",
            "Gunschili randomly has one as well",
            "Gunschili also has one",
            "More interesting watching this than actual DMM so might take away from it a bit haha. Actual DMM is a cluster fuck by comparison.",
            "is JCB a meme for his name or something? I've seen it used quite often but I'm not sure what it's referencing as I only know him as JCW.",
            "Two rune crossbows is pretty bad though.",
            "Dino already said he won't be joining again because of all the drama.",
            "Skilly needs a dh kill against Torvesta for sure. Payback for gielinor games lol",
            "Oh my god, that shit would be the stuff off osrs legend. So hyped for this!",
            "The OSRS community would explode if Skilly bombs torvesta for 80+\n\nWould definitely make it as a top 5 RuneScape moment of all time.",
            "Glad someone mentioned it. Leave it to a cold one to do the inferno in dmm lmao",
            "Coxie with a quiver too",
            "He got quiver too just didnt bring it for the finale",
            "I was hoping to see port khazard get a quiver and infernal on day 1 just for the flex",
            "Who has it? I just looked at everyone twice and still missed it",
            "I swear they nerfed Dinh's flicking before and made it so it takes 2 seconds to activate after wielding or something, am I crazy?\n\n  \nEDIT: Apparently this only applies to the 20% dmg reduction passive which is a PVM only effect.",
            "Jcw ragging Skiddler's firemaking in the final hour was amazing. Skiddler was trying to get total levels for the seeding for fights and jcw spent the entire time making fires in front of him.\n\n\nEdit: Clip - https://kick.com/jcwrs?clip=clip_01J0XYBEBR1RFNBJB04DJV1V9Z",
            "Dude I was looking forward to JCW because I like his solo content but I wasn't ready for how funny he would be on this team! The way dude talks just has me on the floor sometimes",
            "I think he already did with all the amazing clips he's provided this week! Absolute legend of the game!",
            "They also got fed by the burgers tbf, 2 max sets and a vw from them alone.\n\nListening to Westhams stream they don't have many prayers though which could be big.",
            "Nah their rng was actually bad outside of breaches. \n\nOver drop rate on:\n\nZenytes, prayer scrolls\n\n- got many corrupt dragon claws which slowed down how much they could do raids and stuff... Couldn't get a t bow or shadow for days while Port Khazard was running t bow CoX day 2 lol\n\nAnd then some of the rares:\n\n- They got a Kodai but can't use it cause no one wanted to waste 7 hours at MTA\n\n- 2 ancestral hats which could have been literally any other drop\n\n- masori chaps that they can't use .. any non-masori item would have been great\n\n- Arma hilt but over drop rate on godsword shards so they couldn't make it\n\n- no Arma armor piece to fortify the masori chaps so they can't take them\n\n- no Sara drops\n\nFelt like they were doing so much content but not getting any drops. PKs and breaches saved them.\n\n- but they also have rune crossbows so that will make things difficult for ranged.",
            "3 staffs and 2 VLS yeah they should be embarrassed if they lose",
            "They have the lowest combat stats of any team, 2 of them have rune crossbows, and theyre missing augury and rigour for most of them. They have some of the best gear but lacking range dps and not maxing when they could have + no cox prayers is going to cost them the win",
            "People have been memeing Faux all week saying their strat was bad but holy shit their setups are stacked. I think their main issue is the physical PvP talent more than anything, cuz if you can their load outs to say Boatys team or Dino they easily win",
            "They have really weak spec weapons though.",
            "If they use it well, if they let someone step under they're going to get destroyed.",
            "Bowfa being 4 tick with everything else being 5 tick is very very hard to utilize well. The more hits you miss, the more your dps advantage is lost.\n\nI actually think the opposite - they tried to 300 iq their strategy, but skipping out on prayer scrolls at chambers is going to hurt them.\n\nFang is only useful if you are in melee range, and they will spend a lot of time not in melee range these fights.",
            "IMO bowfa takes a lot more skill to do well with considering the paper defense. You really gotta hit your tank flicks. I’d bet most of those guys would be better off with tank bolt",
            "Torvesta's team also has crystal / bowfa on 4/5 members.",
            "in an NH fight melee is severely underutilized",
            "Need to not be frozen to use it, and in NH fights melee is the least used aside from specs. Realistically the bowfas they’ve got are a way better drop",
            "Two did but only one got enough drops for it. Dino's team was stuck at cox since they prioritized those drops and just didn't really get any of them to be able to switch over.",
            "Dino went too, but he just couldn’t complete half his raids, and his one purple was masori which they couldn’t fortify.",
            "Do they get prayer scrolls too",
            "Yeah they went for voidwaker instead lol",
            "They had plans to go to 2 of the breaches as a full 5 man on 2 of the days, but one of them Roidies internet was too unstable for him to play the game, and idr what happened the other time. Otherwise yea they just sent Ditter+maz to go harass teams leaving the breaches.",
            "yeah why total level was used to seed teams in a pvp tournament is a bit weird imo really benefitted the two teams that weren't active pking wise.",
            "Money on tor team",
            "The devils content best you’ll ever get? Lol what they played scared as fuck the whole tourney the only exciting thing they did was baiting donator into multi trolls south of CoX but they didnt capitalize on the kill sadly. Aside from that they did fuck all",
            "Saturday 5PM UTC time ",
            "He can't resist skilling even in the final",
            "JCW is a skiller, and he thought it would be funny to bring stuff to tick manipulate mid fight. Also a WC cape. Naturally all the Burgers agreed because they’re in it exclusively for fun.",
            "He’s 3 ticking the Bulwark, it hides when he switches to it. \n\nhttps://clips.twitch.tv/DreamySnappyKumquatJKanStyle-EZEbPv4ogjyjdg9l",
            "Na he has same amount of food not as good at switches so he left out his mage switch but honestly Zgs paired with veracs might be a good combo",
            "Limited food and potions for everyone. Each death they had this week meant they have to bring less food. Also gunschili like a few others are using a venge setup rather than tribrid with mage, so he has less gear switches",
            "he isnt bringing many switches your not aloud replace gear with food just because you choose not to bring any.\n\nhe would have had to have died a tonne to lose that much food like others are saying",
            "You start with 10 food 1 brew 3 restores(?) and then you lose 1 food per 4 deaths.",
            "For every death they had leading up",
            "Some of them died a couple times so as penalty they lose some food. They probably didn’t have many switches in mind or have lost too much food so their invent looks like that.",
            "Oda is legit one of the biggest janitors in this game lmao",
            "I gotta see this Oda magic. Is this in one of his videos or VODs?",
            "Can someone please link a clip or vod timestamp of oda explaining this",
            "Lol putting Dino Boaty and Ditter in their own tier shows ur lack of pvp knowledge sorry.",
            "Meanwhile the burgers' strategy were to farm clips and boy was it an entertaining week thanks to them.",
            "Skiddler flaming ditter then immediately getting a blood shard was a phenomenal clip tbf",
            "Not really sure it was the best strategy. They didn't farm weapons from the breaches. Didn't farm prayers from CoX. Didn't farm spec weapons/voidwaker. They are ahead on some aspects but behind on others. Almost every player maxed hours and besides Donator, no one really died for anything crucial. I think it's closer than you think",
            "Completely disagree. This is a format issue and not a team issue, kills aren't incentivized and deaths set you back pretty bad.",
            "yeah i like faux but making him a captain in a pvp mode was a bad choice in the end, he was always going to focus on the pvm as he doesnt know pvp. his team was pretty forgettable throughout the week.",
            "I feel like Faux's team was less of a clips/youtube team and more of a streamer team, I watched them and they were actually some of the most chill osrs streams I've seen in a long time listening to them just hanging out and bantering a bit. No huge moments but not boring either, basically how most good streams go.",
            "[This interaction](https://x.com/X19FBG/status/1802268470190518526) was probably the funniest thing coming from that team but that was basically it pretty much. \n\nI genuinely don't know what Faux or Torvesta's teams did since they basically didn't even do any breaches.",
            "Haha try to look again!\n\nEveryone with 4 or more deaths is missing 1 food or more. VtheVictim, Dino for example are on 9 instead of 10\n\nDonator and skillspecs also",
            "No, that's just the order of the draft pick. Their order in the fights is based on their seeding, you can see it under 'rankings' in the [official public spreadsheet](https://docs.google.com/spreadsheets/d/1c-bWzfGMiob6hqWD74NRw6KDz6i_Td2RFqRz8DWDkN4/htmlview?usp=sharing#).\n\nIt should be Nuggets vs Burgers, then winner against Snakes. And Devils against Warriors, then winner against KKonas.",
            "curious about that too.",
            "Blood fury is on average a 6% heal on melee hits only\n\nConsidering the total amount of hp in a fight is 10x22 + 60 + 99 = 380\nAnd melee can be used at best like 50% of the time…\n\nIn a best case scenario the blood fury is worth like 15 hp in a fight\n\nNo way that was worth the time investment compared to cox prayer scrolls, which are a flat 8% dps buff for all ranged and mage attacks",
            "he just isn't bringing many switches as he is venging he has similar amount of food as everyone else just not bothering with mage.\n\nthey had decided that from day one from watching them.",
            "Solo team they all have both iirc. Fauxs team none have. Unsure otherwise. Any team with ancestral or d claws dinh b like odas at least a few of them have some.",
            "I believe Torvesta's team ended up with 3-4 Arcanes and 1-2 Dex's.",
            "Oda’s team has most of the prayers they might just be missing one, but they def got all the Dex and I think all the Arcane but might be missing one",
            "Don't think anyone in that team had DS2 done, it's a really big time investment.",
            "It’s imbued, just looks different because of brightness settings",
            "It's definitely uncharged, but I can't tell if it's imbued or not.",
            "I went in routing for them but he's legitimately such a toxic spaz it's hard. I feel bad for V and Cold cause they're such chillers and have to deal with him. Also his voice is like there's some kind of tumor in his nasal sinuses. Ew",
            "Watching Oda, Victim and A Cold One lose their mind from getting some extremely cursed rng from Zammy was both hilarious during the grind and sad af because they were actually mentally broken by the end of it.",
            "well the opposite is make it two weeks+ and everyone just has max gear for the fights. the rng kind of makings it interesting as teams have to pick and choose what they go for.\n\nWest ham was also super active pking and got a ton of gear off it.",
            "Nah, thats the essence of runescape. This tourney isnt about figuring out whos the best pker, its about making a ton of good content",
            "Kinda a given to have RNG play a part in a short event in an RNG based game.",
            "I think dino's breach luck was pretty great, only the first one went bad, and the final breach was kinda shit for everyone except oda. Their luck in pvm grinds was pretty terrible though. I swear dino was at artio, spindel, and venenatis for half the event",
            "Dinos team did really well on most breaches, I think it could be that they killed the most breach mobs out of all teams.",
            "wait till you find out about the rng in pvp",
            "This is a horrific take, ngl",
            "Have you been watching? Dino's team basically won 4/6 breaches I would say, they farmed way more than any other team. Yes they are still pretty lucky but it's deserved for how well they played it.",
            "probably playing on high brightness. Look at his barrows gear vs the others color.",
            "thats an rcb, probably just some weird brightness settings",
            "I’m really excited for people to learn how good Port is at PvP.\n\nHe may be the 2nd best PKer behind Westham here. Or top 3 if you wanna argue Oda.\n\nAnd this being LMS style with lots of hard food and momentum fighting is huge over deep wildy brew fights",
            "Makes sense because that guy will use melee attacks the most. Blood fury only affects melee",
            "I think Solo or Dino are in the best position. Solo's team has better setups but Dino's/Westham's skill may push them above. Maybe Faux. Faux's team has 3 phoenix necklaces",
            "dino's team don't have cox prayers tho",
            "its definitely stacked in there favor yeah, the low amount of food could screw you with bad rng pretty fast though.",
            "Hardly any cox prayers and also not maxed combat stats + rune crossbows",
            "Just seeing the gear does not tell you the full story. Solos team did by far the most CoX and Dino's team won I would say 4/6 breaches.",
            "Solo snakes had Port K and Coxie running Cox pretty much nonstop for at least half the week.",
            "Don’t be surprised if Oda wins",
            "Dino’s team should win by their gear, which will make it even more humiliating when they lose.",
            "Dino’s team has the best combination of gear and pkers, so they should definitely be the favorites, I agree. But I would much rather like to see an underdog victory by Faux’s KKONAs for the simple fact that they’re grown, more mature and less prone to trash talk. \n\nThe nuggets are a very young and arrogant bunch who know they’re the most talented and parade as if they’ve already won. Not to mention all the drama and blatantly obvious stream sniping they were doing.\n\nTo lose to a group of PvMers/Ironmen like the KKONAs or the Torvesta Devils would shatter their egos and humble them immensely. Now that would be box office appeal.",
            "Veracs won a DMM tourney once. It’s incredibly effective for the skill required, especially when using vengeance/suffering. \n\nTeams were allowed 1 vengeance user, teaching newbies how to NH fight is significantly harder than teaching them how to bolt rag/veracs while ocassionally clicking vengeance. \nThe play here is to put your least experienced pkers in a setup like this where they could easily outlast/outdamage lesser skilled NHers.",
            "The finale is tomorrow at 1EST I believe.",
            "Maul too inaccurate. Spec energy will be very valuable.",
            "Granite maul without ornament kit uses 60%spec, not worth it and dude had terrible hits with it during the week.",
            "KO potential is nice but in most of Odas fights he will shit on people so hard that once you have done a decent amount of damage, you just want to add more constant damage so the opponent is just eating through their food without being able to hit... this is just as useful as a KO.\n\nThis is the biggest difference in a fight to the death vs a fight for a KO with unlimited food (or being able to teleport away).",
            "You cannot put their loss on Donator. From the start B0aty drafted for content and they actively encouraged Donator to get out there and take fights. I think they have to come away happy with their performance regardless.",
            "I think this is an impossible final because team faux gets a bye in the first round. so they can get 4th place at worst",
            "Rhys AND Oda? Man 3-4 ancestral pieces is not gonna cover the gap in skill between those two and the rest of the teams",
            "will be interesting to see how they get on i do feel like him and oda smoked anyone they got on in singles during the week just didnt have the rng on ko's",
            "He had some terrible breaches and calls but I think if he just focuses on mechanics and lets oda or victim make calls they'll do well",
            "I don't know much about Rhys. How good is he compared to oda/westham/dino",
            "10 am pst, 1 pm eastern",
            "everyone has to wear their team's colored boots",
            "If someone is low they can still trade them around I think\n\nIt's allowed for pots/food, so I don't see how bolts is any different as long as they are the same ones provided in the pictures/setup",
            "Oh yeah and add breach RNG to that aswell!\n\nAdd in the Zamorak godwars RNG just so we can laugh at Oda's teams absurd bad luck aswell",
            "Torvestas team got 6 bulwarks",
            "To move tiles while frozen",
            "Pvpers will often freeze someone then stand under them while only leaving to hit back, which lets them control the fight. For example, if they have a 4t weapon and you have a 5t weapon, they can get 2 hits to your 1 very easily. By dancing out/back under, it's hard to land spells or consistently melee, while their weapon of choice is hidden so you can't land prayers very easily.\n\nSeeds still move you when frozen, so the strategy is often to seed into freeze back to neutralize the advantage.",
            "Its god awful, they have it that high cause most of these guys are blind from being chronically online, do urself a favor and stay low brightness",
            "Regular dmm starts 19th July",
            "No Cox prayers at all though",
            "I don’t think he is. Eli is great at multi and Port is cracked at NH. Very possible they consider Port to be a better NHer than Eli",
            "You can 3 tick into the Bulwark, and it hides it from view.",
            "He's 3 ticking the dinhs",
            "He is a skiller so it is to tick manip.",
            "Risking in the first fight and dying with 12 food and a full brew left. The skilly way.",
            "I hope he pulls it off. I hate how everyone bashes him. Kids needs a win",
            "He took one less food voluntarily to fit it in haha",
            "That clip of Skilly catching the freeze on someone and then his teammate yelling “you froze me!!” 💀💀💀",
            "All other goals were secondary I assume.",
            "Yeah day 5+ i think skid and mad were camping it and driving people out. Bank and altar over there made it hard to contest with low supplies.",
            "only one other person was in the area while they were there the whole time they trained there.",
            "The low food count kind of makes it momentum based actually",
            "I disagree, this is not war of attrition type fights. Go look at what a typical NH pker takes to Rev caves, easily about 250 hp more than what's in these setups (about 550 hp worth of food versus the ~300 they have here). These fights are going to go quickly, much more quickly than where I think having blood fury/fang/bowfa start to make a difference over having good spec weapons or good robes/staffs for better chance of catching freezes.",
            "But really bad spec weapons for his team.",
            "None of Faux’s team have Rigour or Augury though, which is a huge deal.",
            "Not a single vls or zuriels among them though. No spec weapons at all- claws, vw, nothing but fang. They’re really playing the outlast game which isn’t a bad idea. I’m pumped for it but rooting for oda myself but wouldn’t mind seeing an underdog upset",
            "0 of the busted pvp weapons though, I think morrigans javelins and vls are better",
            "Look at their mage and spec weapons vs the first three teams. They're going to get dd'ed and dawg fucked before their blood furies can even proc.",
            "What’s bad about that is blood fury is definitely more suited to people with VLS on the team, that blood fury will go underutilized in just verac/zamorak godsword lol!",
            "yeah for sure the team aspect added a really fun dynamic.\n\ni do wish actual deadman still had the singles tournie at the end really enjoyed watching that",
            "They’re the burgers so I’m guessing JC-Burger",
            "I personally think thats going to cost them the win, doesnt help that they have the lowest combat stats of any team as well. They put off maxing so long that they never were able too",
            "While not having internet for like 24 hours. He probably has the least hours of anyone in the tourny. Mad lad.",
            "cold one’s inv",
            "The pvp of skilling lmao",
            "Not just making fires, bro with tick manipulating just to fuck with skiddler even harder. He was lighting the fires so much quicker he was doing underneath skiddler as he attempted to light his logs.",
            "Clip?",
            "They got fed by donator*",
            "\"no one wanted to waste 7 hours at MTA\" lmao this statement was funny, just envisioning all of the \"no, you do it,\" and \"I'm not grinding that\" that would have taken place within their voice calls lol. But, tbh, I can't blame them; MTA isn't the most exciting content.\n\nDo you know how many rigour/augury scrolls they have?",
            "Between the VW steal, their super early rev cave rng, and their breach rng, I think they're still hella up considering they realistically were one of the weakest pvm teams. IDK why tf donator was running around with VW like that tbh. Their rng got them the most important stuff, massive pvp weapons and dps beyond the other teams. That's exactly what they want as the more skilled pvpers. ACB/arma gear, etc doesn't seem remotely comparable to 5 of the best ancient weapons and multiple VW.\n\nExpected Solo's team to have a massive gear advantage since they seemed easily the strongest pvm team and got the early corrupted gear. But from the video, they went 6x drop rate on zenytes (kinda insane to be that dry), and under drop rate on ACBs, leaving them almost unable to use Dragon bolts. Looks like they went dry on the heavy ballista too since you'd expect them to be better than rcbs and they should have hit drop rate during zenytes. Dissapointed in their loadouts tbh, but i think they're fully stocked on prayers atleast, and got the armour sorted.",
            "their venenatis/spindel luck(unluck) was just disgusting as well at the beginning of the event",
            "Yeah it’s wild. They absolutely couldn’t get a drop anywhere to save their lives, minus the breach. Luckily for each of days 2-6 they had by far the best breach strategy of any team which paid off with the high roll RNG, because if it didn’t they were absolutely screwed. \n\nMuts spending all his online time grinding scaled raids to never get purples, or killing demonics to never get zenytes was tough. Poor dude couldn’t catch a break. They sunk a bunch of hours into their voidwaker too. They like 3 KC’d a craws bow and spooned another one early on day one, and then just never got a PvM drop again. \n\nHuge vw+kodai PK though so that spoon helped. But team very lacking on prayer scrolls because the CoX luck was horrific.",
            "Don't forget that the voidwaker also took an insanely long amount of time on spindel/venenatis. Dino was basically locked out of doing other content for like two whole days trying to finish it up.",
            "Javelins",
            "Really felt like they had the worst tactic overall but got saved by breach RNG\n\nThey should have focussed more on raids. I mean even Oda and Rhys duo'd them. They said that they were unlucky at raids but I really doubt they did more than other teams. Most of the time it was just Raikesy solo\n\nTake away the breach RNG to a normal level and you're looking at 1 vls and 1 zuriel staff while missing a bunch of prayers\n\nThey got lucky",
            "They have 0 ko weapons and 0 prayer scrolls",
            "0 prayers is a huge missing part, and no real ko i think they will get fairly stomped tbh.",
            "But the thing is they don’t have rigour and augury pretty sure unlike other teams",
            "I was watching Faux pk earlier. Lookin rough",
            "They got memed for it because it's a full week of potential content and they chose for an absolute snoozefest of a week\n\nIf you do that you better make sure you win",
            "they kinda deserve to be memed though, for a tournament consisting of only content creators, it's pretty lame to avoid all breaches as a strategy",
            "Really depends on the momentum RNG in the first few seconds of the fight, crystal has really bad defence so if they cant catch a freeze and start getting slapped hard early they're gonna be too busy eating for the bowfas to really come through",
            "If you don't have the momentum and freezes melee is worthless. If I know you have fang I'm just going to perma DD and diagonal step. Now if you do get momentum it goes hard but with how low food everyone has and the garbage defense stats of crystal, they could very well die to a top tier brid before they get any meaningful damage off with a fang",
            "Almost every team went for prayer scrolls, every team but Faux's has some amount of prayer scrolls. Solo's twam has 10/10, Oda's team I think got 9/10, Dino's team only has 4/10",
            "Meanwhile you have Oda and Rhys sending it as a 2-man in multi on the last breach to get rewarded with a VLS",
            "This also isn’t a knock on Faux. He did what he knows.\nBut I agree, total level probably shouldn’t have been included.\n\nTomorrow should be entertainment.",
            "Total leve wasn't the only thing considered, Kills, Deaths, and a few other things added into it.",
            "That's when the livestream starts. The actual thing starts an hour later.",
            "Where will it be streamed?",
            "What's the strategic advantage of this?",
            "He's going to be bolting on ranged pray overwhelming majority of \nthe fight. It's not good combo",
            "Why does the finals limit players to only 1 brew?",
            "He’s done a lot of “how to pk” YouTube vids",
            "Since you're the second to ask, I'm looking for it but I'm just hearing \"how come westham gets dino erect\" on repeat\n\nThis will take some time\n\nEdit: So on Oda's Kick VOD. They start talking about it with 45:50 to go untill the end of the vod. Its between 45:50 and 43:30\n\nSo apparantly you can hear the rhythm of the recoils changing when pid swaps",
            "They aren't alone in their own tier. Just saying that those guys aren't in the tier Rhys/Westham/Oda are in\n\nI can't be bothered going through all 30 names and putting them in a tier sir. I edited the comment to make it more obvious",
            "B0aty was right to play for the 90 hours of great content rather than the 2 hours of finale content",
            "Every clip to come from them was pure banger content",
            "That was amazing.Skiddler went in on him lmao.",
            "Well actually Skiddler not freezing his vyre and helping Ditter kill chili costed them an opportunity to set back O’s team as chili held all their supplies and bolts etc etc. but skiddler just kept attacking his vyre cluelessly.",
            "I think they’re gonna get steam rolled",
            "Yeah I was a bit disappointed in the overall lack of PvP, but it's hard to blame people for focusing on PvM because stats and gear are essential for the finale. I think the people who were actively PKing throughout the event like Westham and Donator were doing it for fun/content rather than efficiency. Solo did mention though that next time they will make it so kills grant you extra food in the final which should hopefully help.",
            "I think they thought people were going to die more tbh but that didn’t work in their favor mostly",
            "Yeah having pvp captains like Dino makes sense when this is a group Ironman mode... Dino couldn't get to Arma so it takes all types",
            "Faux seemed pretty open about planning with at least Maz so he was definitely taking pvpers advice as well. This is just the strategy they thought would give them the best chance to win.",
            "I think Mazhar and Ditter were the ones drafted for the plan though weren't they? I'm sure Faux had some input on it but his main goal when he got those two was their DMM expertise.",
            "You keep saying Faux doesn't know PvP. He's literally played every single DMM? He has just as much experience in this as a lot of these guys. Sure he's no Dino/Westham but he's not a nobody.",
            "[deleted]",
            "Torvestas team was actually pretty great. The Purpp and Mr.Mammal combo had my dying laughing at times, Purpp is a legend haha. \n\nThrow in poor Alfie having the most socially awkward week of his life with the conversations they were having was top notch",
            "I believe it is 5 or more deaths, the first death loses pneck and every 4 after that loses a piece of food.",
            "[i built a scuffed bracket](https://i.imgur.com/uvhwWry.png) for easy visualization",
            "I believe he was asking about the order within teams.  As in B0aty fighting first.",
            "Depends on which format they go with\n\nIf it is already locked completely the winner of Nuggets vs Burgers should go up against the 2nd seed, so against the KKonas\n\nCould also be an NBA type format where it's not locked yet and its completely depending on who wins the 1st round matchups. For example Nuggets beats the Burgers? Nuggets being the 3rd seed, it's the highest possible one advancing from round 1 so they go up against the 2nd seed (Kkonas). But if the Burgers win they get slotted vs the Snakes\n\nThat way the 1st seed always gets to play the lowest seed that advances",
            "It is definitely charged and imbued",
            " Oda, dino and rhys, all werent too mature in the past days. Id still blame dino for most of that drama tho.\n\npeople that caused most drama this toruny:\n\ndino>oda>rhys",
            "6 hilts in a row is the must cursed rng I've witnessed live",
            "they did zammy for the entire night, sad rng man",
            "RNG gonna RNG but forreal. Tuned into Oda at close to midnight while he was doing Zammy and that man was defeated. Seemed like SotD’s weren’t boosted this DMM.",
            "Yeah Oda's team will need Oda and Rhys carrying HARD as the other 3 got subpar sets already compared to other teams",
            "I wish more players had been actively pking like Westham. It seems like most people got in a few fights around the breaches but then just did everything they could to avoid pvp the rest of the week. \n\nI think there probably shouldn’t have been the food/Phoenix necklace penalty for pvp death. That made pvp a negative sum game for everyone involved. Trade 5 kills back and forth with someone and you’re both worse off at the end. \n\nNext year I hope instead of a penalty for pvp deaths they give a benefit for pvp kills. Like maybe you get to upgrade a piece of food from a shark to an angler for every 3 kills or something like that. Make it positive sum so more people will participate.",
            "Only rng im complaining about is breach rng. 15minutes shouldnt give more progress than the whole week combined, OR it needs to be higher risk. (F.e. only possible to get pvp weapons while skulled)",
            "I know but I wouldve liked if the breaches werent as important as they were. More focus on the rest of the week and less on the 15minute breaches.\n\nOr make the breaches higher risk (f.e you can only get pvp weaps when skulled at breaches)",
            "Read my comment slightly more careful and youll see that what im complaining about is specifically the breaches. They have a way too big influence on the outcome for how small their time is. They should either be higher risk or lower reward.",
            "Solomissions team killed far more.",
            "You clearly havent been watching solos team. They free farmed much more. F.e the last boneyard breach they farmed almost the whole breach while Dino got a vls and a zuriel in the first 5minutes and pvpd after that.",
            "Oda won the prayer switches on literally every fight he had during the tournament, including those with Westham. Most of the time he won damage done too.",
            "Uh… you do realize oda is the best pker in this tourney right? Westham is at 2. Rhys at 3. And 4 is up for grabs",
            "Yeah, and the Snakes also have pretty excellent gear, and everyone has rigour and augury.",
            "By the numbers, Solo’s team killed more beach monsters than any other team. Dino’s team definitely got spooned",
            "Oda v Dino so they can squash their beef",
            "[deleted]",
            "Oda will die round 1 and blame being sniped",
            "Can't speak to the others, but Westham has been very open in saying he doesn't care if he wins on Saturday and it was more about the event for him. And that there are tons of very strong pkers in the tournament. \n\n\nThe harshest of his trash talk was directed at Dino. ",
            "> less prone to trash talk.\n\nHave you met Ditter",
            "What a weird comment lol",
            "Did they pk you at revs or something",
            "I am honestly surprised there are teams without one\n\nFor example Torvesta's team. Aint no way all of them are good enough NHers to warrant not having a venger\n\nHaving someone in a good tank/veng setup kind of guarantees that person to at minimum go even with just about everyone in this tournament except for the elite pkers.",
            " yeah makes sense ty",
            "Did Oda lose his gmaul? Because he had one with ornament kit.\n\nHe had terrible hits because his stats weren't maxed among other factors\n\nThe way I see it his team has the 4th or 5th gear (burgers have the absolute worst obviously) so I thought he'd try to go for other strategies other than just outlasting his opponents",
            "I’m not upset about their performance, but to quote sick nerd: if donator maybe wasn’t high the entire time he was playing he probably wouldn’t have died so much. \n\nBut if they do lose it will absolutely be because of the guy who lost multiple max sets lol",
            "Losers bracket tho",
            "My man Westham gonna have something to say about that",
            "I'm just trying to say I'm a Rhys fan.",
            "Donator completely avoiding/refusing to fight Oda, only to gift a max set to Westham was definitely a sight to see",
            "the problem was not rhys calls, it was his teammates not being able to follow them.\n\nRhys is used to playing with people that can multi pk, so hes used to give good calls for people that can multi pk.\n\nHe can't give good calls when he has someone like oda in his team (no offense, out of all the streamers i watch oda the most, but hes actually so braindead from time to time. And that showed in the breaches this tourny).\n\nRhys calls are not bad at all, hes the shotcaller at one of the strongest multi clans in game.",
            "You're not supposed to put Dino in that list of people tbf\n\nTier 1 of this tournament is Oda/Westham/Rhys\n\nNext tier is a bit more blurry but probably includes Dino Ditter Boaty Torvesta Khazard",
            "I don't watch a lot of content creators, but what I seem Rhys do is very impressive. Like, I wouldn't believe a human could do what he does if you told me.",
            "The worst mechanic in PvP imo",
            "Now to see if that will benefit him at all lmao",
            "It doesn't work if someone is attacking you lol.",
            "What's the strategic advantage of this?",
            "In one of skillys vids he asks westham for advice and he says \"if you just clicked the fish in your inventory you'd be really good\"",
            "He's a meme, but golly, do I love that m(eme)an!",
            "Kid? He's like 30.",
            "I think most people know he's a great pker he just likes to play risky which doesn't always pay off. He has been so much more aggressive in his plastyle than most others in the tournament which is fun as hell to watch but probably not the best strategy.",
            "If you're going to have empty slots, might as well sacrifice a food if it'll let you do more damage than that food would be worth",
            "Skillspecs was the clip MVP of the tourney for sure. The skeleton barrage, dying and returning in pink elegant to save B0aty's ass juggernaut charging through multi to get a bank key off the ground while screaming \"FUCK THE BANK KEY\", the phone call to Torvesta after forcing him to log out in multi, the list goes on and on.",
            "That and the skeleton freeze were some of the best moments from the week.",
            "For those who haven’t seen it. [One of the best clips of the tournament](https://kick.com/skillspecs?clip=clip_01J0PBVHAJ91CB9YWY3D55WVXK)",
            "\"All units ALL UNITS!\"",
            "best part is he didnt even freeze donator, it was someone from a different team",
            "Surely they killed that one other person if they were constantly sending two?",
            "Momentum also benefits fang/bowfa which have insane accuracy. That said I think 3 zstaffs and 2 vls are still better just cause they're busted.",
            "Are they allowed to restock after rounds or no",
            "You're exactly right\n\nGo watch the practise that Faux did vs Oda. Oda did a challenge where he only had 2 food in his invy and he still won.\n\nThe amount of extra hits these top tier pvpers can get off on you is absurd. They're not eating on 50-60 hp while you are. Instead they are getting off extra hits knowing that you aren't hitting back. \n\nThey choose their moments well to eat and really maximise every tick\n\nAs long as Rhys/Oda/Westham don't get RNG screwed, they should be able to put away anyone despite some gear differences",
            "Fang is actually a good spec in attrition. Low ko potential but similar expected dps to vls.",
            "Importance of spec weapons is somewhat diminished due to the fact that nobody has lightbearer",
            "Oof yeah thats rough",
            "Yeh the end being 1v1s was great but DDoSing ruined it like it ruined most good parts of dmm",
            "It's a good guess but reality is dumber. Sick Nerd just thought it'd be funny if he was a tractor, that's it. [Donator thought the same thing as you though](https://kick.com/donator?clip=clip_01J0GA6VKX17YKQJ394G2PVYAV).",
            "https://kick.com/jcwrs?clip=clip_01J0XTEF5ZEHRBEMWERMBX10YQ",
            "https://kick.com/jcwrs?clip=clip_01J0XYBEBR1RFNBJB04DJV1V9Z",
            "at least his name is accurate",
            "Convinced Donator was a deep undercover operative for the nuggets. Bro gave them so much shit",
            "3 augury and 1 rigour I believe",
            "You say that \"no one would want to do it\", but there's a couple of kodais that made it to the final. People did do it",
            "Donator attacked West is the funny thing.",
            "Burgers whole team philosophy was to have fun with the game mode. Getting a voidwaker and leaving it in the deposit box would have been super boring, so of course donator was running around with a VW looking for fights.\n\nI think all the other teams were playing to win, boaty and team were playing to entertain.",
            "And when they did get drops they were worthless like the 2 hats, masori chaps, Arma hilt, and Kodai butt plug\n\nAnd the corrupt weapon RNG was rough too. T bow and shadow were the only ones that worth getting and it felt like it was the only one that they didn't get multiple of. \n\nBut the craws bows were good at least",
            "Yea they spent more time PKing on DMM for some crazy reason. Should have been grinding raids nonstop without ever seeing another player like the good teams did.",
            "Ah, no prayer scrolls is gonna hurt. No KO I’m not sure will be as big of an issue given the format though.",
            "With just 10 food (and it not renewing between bouts) raw KOs will be extremely rare no matter the gear. This tourny is all about outlasting",
            "Dont think they would be good at KO unless you count on mammal ddsing. Outlast and outeating with a fast set up",
            "Oof really?\n\nThat honestly makes the gear advantage a complete non-factor. Rigour and augury are busted. I think Oda's team has 9/10, with one person lacking augury which i assume will be gunschilli then",
            "Faux can hold himself in pvp. Yesterday he was learning a new pvp technique he isn't used to with the bowfa. But even then, everyone else on his team can pvp, even roidie. There's a reason roidie wanted to hide his pvp training last week.",
            "They’ll go down as being a snooze fest during the game and the finale",
            "This will almost certainly happen. \n\nAll of the other best pkers (westham, dino, Oda, solo, port) have vestas longswords and rhys has a voidwaker\n\nThey’re gonna get stomped",
            "Gotta risk it, plus they got immediately focused on that breach. V the Victim and Gunshcilli got ragged on hard right away. Clearly Oda’s team progressing is something other teams didn’t want",
            "What does total level have to do with the finale? I’m not familiar with the rules outside of deaths during the week impacting how much food you have. Assuming the matchups are decided by teams’ total level?",
            "I know, and Fauxs team highlighted the flaws in it. If you played it safe and just farmed levels you would come out on top of 3 of the 4 ranking categories like they ended up doing.",
            "Don’t know why they didn’t just do it as a round robin. The fights aren’t going to last that long.",
            "I'm guessing most of the participants will stream their own perspective (twitch or kick mostly), but the official tournament stream will be on the OSRS twitch channel. ",
            "None, it’s just funny",
            "No idea it’s not like any of these teams haven’t seen each other’s load outs",
            "I think he’s gonna use it to hide what he’s actually switching to, but obviously it’s on stream so whoever’s facing him can see the clip and know it’s gonna be a bulwark",
            "Because the final would take 10 hours otherwise.",
            "The better question is why are you forced to take 3 restores for a 1 brew fight.",
            "B0aty is just like that as a person (kinda always has been) but also being so successful has allowed him to be like that... even in Gielinor games he doesn't care if he gets out because he doesn't need to win the prize pool... he has made BANK from streaming OSRS and is set for life both irl and in-game (he could take donations any-time and make billions in a single stream but hes humble and barely likes taking GP from others).",
            "B0aty consistently delivers.",
            "Skiddler flames everyone, i wish he was on a team with more on par shit talkers honestly. Would have been amazing to hear him and skillspecs for example on the same team. Instead all he really had was ditter to back and forth with, who isnt entertaining whatsoever.",
            "Fully agree",
            "I just mean his whole view on the week was always going to geared to the pvm side and avoid pvp as he has little knowledge of it. \n\nWhich played out kinda bad from a content point of view as all the best moments were during some form of pvp. Which is a pity as i love Skiddler and there aint many clips of him lol\n\nPVM/Ironman knowledge is pretty common these days i don't think he brought anything unique to the week in that regard really.",
            "very possible, either way Faux made the overall choice to approach it that way the same way Boaty built his meme team.",
            "Playing dmm doesn't make you good at pvp. I've watched the guys pvp streams prior to this week and yesterday and he is bad. Definitly up there as one of the worst in the competition.",
            "A flaw off the seeding system more then their team being pvpers. I don't see how any fans of Faux can even deny they played a very safe game plan. \n\nLowest deaths due to playing it safe and high total level the only area they came up bad on was kills again due to playing it safe. They had the lowest kill participation out of any team by far. \n\nThe Burgers were yeeting themselves into every situation possible and making great moments doing it.",
            "Yeah those clips were funny af tbh. The 1 tick deafen was incredible lmfao. More so just that they basically didn't show up to any breaches, and then the one time they did they got logged by the burgers and just sat there for 3 hours lmao.",
            "Honestly that's what a lot of people thought. It wasn't worded very well in Solo's announcement video\n\nThe rules were 1 death= pneck, death #4 is a food, death #8 is another food\n\nThe video left it open for interpretation where what you said was completely viable. But no everyone with 4 deaths lost a food",
            "Ohh I see. The teams got to decide their order freely, they don't have to go in the order of the draft pick. Some of them mentioned on stream what order they're going in, but afaik it hasn't been compiled anywhere for all to see.",
            "Charged/Uncharged changes the shape. If you open the picture in fullscreen you can clearly see that both Oda and Gunschilli have uncharged rings. Skiddler from the Faux KKonas also has an uncharged ring in the picture, which they talked about on stream but he ended up charging it before the time ran out.   \n  \nI wouldn't be surprised if Oda's team is allowed to charge it if they have the recoils in the bank though.",
            "Dino made a single comment after winning a fight and he \"caused the most drama\" lmao. The Oda stans are ridiculous. The drama is from Oda's community.",
            "Team got absolutely horrible rng. Poor dudes lost so much time and sanity. We’ll see if they can make it work with their setups. Thammy Scepter pop off maybe lol.",
            "Ditter got 10 odium shards from chaos fanatic before seeing a single malediction. Then Faux/Roidie got like 7 odium shards from scorpia before malediction. They were saved that they pked 3 shards.",
            "Additionally, the day prior to their last zammy trip, Oda and Rhyss had like 4-5 dex scrolls in a row while chasing 1 final augury scroll lol that was depressing to watch",
            "And this is after hitting 5 dex dupes at COX earlier that day LOL",
            "Not really. All of their team have D crossbows, most of the opponents have rune crossbows",
            "Agree, dying was too punishing so there was really ever only to be 5 or 6 guys seeking it out. The rest were always going to be too afraid to be caught out by those players.",
            "Also pvp weapons of choice at certain milestone? E.g. weapon of choice at 5, 10, 15 team kills or something to negate troll rng",
            "i think it should tbh as you want to encourage all the teams to go to it and encourage multi fights, i would say a breach just shouldn't appear anywhere near singles.",
            "Put breaches deep in multi and make attacking breach monsters give skull.",
            "Eh idk if I agree. Faux’s team ignored most breaches but are looking stacked. The PvP weapons are huge advantages but so are things like blood fury’s, bowfas, and fangs.",
            "Did you count?",
            "Westham is the best nh here by far. 1013 might be the only one better than him in the game.",
            "And they have Port.\n\nWho is secretly a NH ace.",
            "Westham was cool and practicing with Faux after event today. He's clearly not only trying to win",
            "So he’s rooting against Dino’s team. Who cares lol",
            "I don't think he lost the maul, but it would be easy to reattain anyway. Maul handle was in the emblem shop assuming they still had points, and lol gargoyles. He probably just opted to camp vls instead and go for outlast over ko potential.",
            "Yeah thats about the level of intelligence i would expect from an alcoholic knobhead who eats his own cum. Donator is “high” 24/7 and would arguably perform worse sober as that would be outside his norm. I dont condone smoking or drinking but that comment by sicknerd is just stupid and i dont even like donator",
            "I am too",
            "Nah, rhys was way too aggressive and took pointless fights. He didn't quite understand until chili/victim explained to him that the top objective was to play as passive as possible and farm pvp weapons, not pk mystic sets that aren't going to help in the finals. Solo/eliop played it perfectly with solo making the macro/positioning calls and eliop making the micro calls in fights. Rhys just caught up thinking people were criticizing his micro decisions (who to focus, etc), but his macro decisions were just really poor.",
            "Rhys was kind of terrible on the calls\n\nMaybe he’s used to a different dynamic like you said but what he brought to this event was not what was needed. He didn’t handle the situations and team dynamics well",
            "The problem with Rhys is his ego. He makes excuses that don’t make sense because his ego is too massive",
            "Put some respect on Skill Spec's name! He's tier 2, no?",
            "It's not great, but without it getting a freeze is a guaranteed log anywhere.",
            "Good memes",
            "Green magic",
            "Yeah tbf to him he handles it better than anyone would and I really like him and I'm onboard with the meme to a certain extent but the other content creators bash a little unnecessarily I think",
            "Kid needs a break is just an expression where I'm from haha. I'm only 2 years older than him, not old enough to call him a kid",
            "Or he couldve skipped the antivenom and brought 3 sanfews instead of super restores and not been down a food, but hey its skillspecs",
            "The fucking phone call man",
            "Aww man do you have the elegant and phone call ones?",
            "The clip of skillspecs getting piped as he gets vw specd is my favourite",
            "Can you link the bank key clip?",
            "It's not multi, so no, that doesn't mean they were getting kills. Just means it's very hard to \"win\" the area",
            "I was just mentioning that it wasn’t really a fight of attrition",
            "Between rounds, yes, but not between fights\n\nIf Rhys and Dino are 1v1 first, and Rhys wins with 1 food left, Rhys then has to face the next competitor on Dino's team with only 1 food in his inventory\n\nIf Rhys's team beats every player on Dino's team in this manner, then they get a full restock of food for the next round",
            "No spec bar on bowfa or the staffs they’re using though. Kind of a big deal. They won’t be catching any of the better players off prayer with a fang spec.",
            "Yeah I asked Skiddler about it on stream and he said they’ve done the DPS calculations and figured their setup without Rigour/Augury is still stronger than the weaker setups with the prayers. Let’s see if they’re right lol.",
            "That’s great, thank you for the clip haha. I mostly watched the devils for the Purp and mammal after dark. So much good content this week",
            "That is quite unfortunate; pretty big disadvantage without prayer scrolls. Thank you for the answer though",
            "2 rigour at least. Muts and Dino both with one. Raiksey may have one too since they had planned to prioritize it on the raiders first, but not positive he got one early enough in the week to use it.",
            "Ye, I know that Rhyss grinded out a master wand for Oda's team as an example. But you know that wasn't my quote, I was simply agreeing with the sentiment\n\nPlus, that isn't even what was said lol. Obviously there are people that \"would\" do it; it is, after all, no different than a pvm grind in terms of a time-investment. It's just guaranteed after X hours instead of being an rng grind; and it simply isn't exciting content unlike pvming. However, what was said is that nobody from Dino's team \"wanted\" to do it. And, tbf, with 3 zuriel staves, they kind of didn't need to.",
            "Idk enough about donator tbh. Just felt from the clip i watched, there were atleast 2 better choices to be using it on that team for content and he looked helpless. If Ray is donator, then this guy was one of the last guys in the event I'd have been excited to see use a VW.\n\nIdc that he lost it. But he was also really cut up about losing it, so i don't see who wins in this situation besides westham.",
            "Imo with the format, ko weapons might be the game changer, without restocking between fights, lets \"a good pvper\" take out several people without burning through his own food, without ko weapons you'll always burn your own food too, even if you outlast",
            "You’ll be disappointed today then lol",
            "i think you will defo see some of the actual pkers slap the inexperienced guys down off guard they don't know the combos to look for or when to eat that well so i think there will for sure be a few sudden kos on the cards",
            "~~there are no karambwans and no triple eats.~~ people will get koed for sure.",
            "They only have 300 food, outlasting isn't going to go very well. Spec weapon damage is going to be the most important",
            "The teams were given an average rank based on pvp kills, pvp deaths, combat level, and total level. Highest 2 average ranks get a bye in the bracket, other 4 teams face off each other, winner plays one of the 2 higher ranked teams.",
            "You are seeded based on a variety of factors (most kills, least deaths, etc). Total level was one of those factors. Your seed placement determines if you get a bye (skip first fight) and who you go against bracket wise",
            "Oh yeah including PVP deaths.. Can't die if you just hide the entire tournament\n\nIn what is supposed to be a PVP centered gamemode, the seeding system really didn't make sense\n\nPVP kills should heavily outweigh anything else",
            "He could theoretically swap to dh axe. 3t dh bomb would go fucking crazy",
            "prayer i guess, a good pker with some luck could face 3 people will need his prayer to last a few fights",
            "B0aty is for the people",
            "Except the ginger loves taking his viewers soul...runes and jars",
            "Sick nerd is a peak twitch creator",
            "[deleted]",
            "The devils attended every breach, they just sat there doing nothing or killing maybe 1 boss for half of them",
            "yes i was talking about order within teams, just wanted to know if it was confirmed. Thank you",
            "I literally saw his livestream. He checked multiple times so i know it's charged",
            "Seems a little biased when Dino in front of his entire stream goes \"That's a streamsnipe. I just got stream sniped\" on his first death\n\nOda was actually quite wholesome whenever Westham/Dino found and attacked him early in wildy. Meanwhile the same situation from Dino's POV and the hate and frustration was quite blatant\n\nThen there is the constant whining when people come in his chat & troll him with the \"you're stream sniping\". Not just from Team Oda, but others aswell\n\nDino is a whiner (might be on purpose to milk it, at this point I truely have no clue) so it really just makes for a massive invite to all toxic trolls to come in and annoy him\n\nHe really just crawls into the role of victim way too blatantly to the point where even his own subs are calling him out for, ESPECIALLY if after that one day full of drama he brings it up again and again & tries to bait Oda ingame\n\nDino was the biggest letdown of the tournament. He constantly feeds into the drama and at times blatantly looks for it, to then immediately play the victim for the next hour\n\nLoved watching all content creators and wish more of them streamed, but Dino is a little rat",
            "Dino called oda a bitch after artio ragged oda and he had to leave??? How is that not flaming lmao. Dino was literally talking shit from the heart and trying to act like he hadnt been holding it in. And oda only hit him once or twice in wild like that, dino AND westham somehow always hit oda but go on",
            "Yeah will probably come down to how victim does as Rhys/Oda are both more then capable of taking out the other teams main pkers. \n\nHe is a bit of a dark horse and did really at getting escapes off all week.",
            "Yeah the problem is the couple of players looking for fights were people like Westham and Oda. Half the field ain't winning that fight in 10 attempts let alone 1 so why risk it? ",
            "And faux team is not stacked lol. They have 0 good spec weapons on thwir whole team and it will cost them the final.",
            "If you watched both streams its quite obvious. F.e. the last boneyard breach Solomissions team practically free farmed the full breach while Dino got a vls and zuriel in 5 min and went Pking after.\n\nSame with the GE breach, solos team literally full farmed for 20min while Dino farmed for 5min and was caught up in the giant multi battle afterwards.",
            "Rhys/Westham/Oda all perfectly know what they are doing. Saying someone is the best by far is just straight up silly\n\nThey are all on the same level, the rest is RNG",
            "Yeah the different dynamic being a clan full of replaceable mystics and black dhide rag sets and survivability not being a primary concern outside of obvious clumping for barrage/chins. Rhys is use to throwing bodies at other clans not playing conservatively with limited resources etc",
            "idk man, I kinda get why he is upset, when he calls solo mission like 10 times and 2 minutes later Oda still hasnt attacked the right enemy. Rhys is just super competitive and wants to win this, so he gets upset when things go wrong.\n\nThat breach wasnt even that bad apart from that situation, but odas followers convinced him with donation-texts, that rhys has just a big ego, cant admit when hes wrong and that oda should do shotcalling... which is not really helping anyone other than the other teams. That Odablock did not listen to calls at all and ran around in circles for 10mins after regearing was never the topic for his followers.\n\nI watched oda the most and generally sympathize with him a lot more than with other streamers, but when he went off against rhys, it was just cringe really. It was odas fault and he fully blamed rhys for it, just because his chat told him so. I watched it live and 90% of odas chat called him cringe. It was just the donos that stirred up the shit further and further.",
            "I laughed so hard. Torvesta's dry replies were so fucking funny, Skill Specs and Torv interactions are peak OSRS content for sure.",
            "Is there a clip of this? I missed it, was watching Solo’s team all week",
            "Just watch skillspecs daily run down on youtube. Great content, well made.",
            "I know I'm just poking fun at the failed kill on gunschilli that turned into a successful blood shard drop :)",
            "You're right about that, my mind glossed over them only having 1 brew.",
            "That is a good point, I don't think that would switch the others to be better in an outlast fight but makes ko potential even worse. In their benefit entity hider is not allowed so they will sometimes get fang specs off prayer when dd under.",
            "The dps calcs dont take into account the defensive bonuses from the cox prayers either, which are pretty decent. though osrs has pretty much always been about the offense not defense. \n\nI think them all having blood furys + being the only team kitted out with fangs is gunna be interesting.",
            "They ran a lot of raids but bleh luck lol",
            "A lot of people watching got to see exciting content they otherwise wouldn't have seen? Just because you're a hater doesn't mean everyone is. I haven't had so much fun watching OSRS streams in years as I did watching the burgers this week. That includes Donator btw, who was the one that farmed the Voidwaker in the first place for the majority of it.\n\nEDIT: Also Skill Specs used it earlier but he went to sleep and gave it to Donator to continue the content.",
            "You could choose to swap an angler for a karambwan. Pip and coxie among others opted for this for one slot",
            "I have seen a Bowfa shred through that 300 damage as well to be fair. But yeah spec damage absolutely will matter.",
            "Interesting. Is there rules for the entire finale somewhere? Really curious how it works between rounds, do you go back to your first round inventory setup after advancing or will everyone have predetermined supplies for the next rounds?",
            "Also makes no sense they punished deaths (less food), rather than reward kills (more food for example). This way any non pkers were scared to fight.",
            "JCB with the 3t DH bomb on Westham to avenge his fallen comrades and win the bracket. THE GOAT",
            "Also players like oda can use the restore doses for redemption procs, which is easier than you might expect with all the recoil damage\n\nhttps://m.twitch.tv/clip/ConsiderateBoldCoffeeANELE-KMbj-M7GCgLoh5R1",
            "Well my original point was about entertainment value not desire to win everyone else approached it in a way that ultimately produced good content. \n\nFaux's team took a pragmatic approach they ended up being quite boring in the end. And i feel a big reason for that was just his lack of PVP knowledge.",
            "Fang Specs are budget VLS specs, especially when food is super limited.",
            "I did watch quite a bit of both POV, and I have the opposite feeling. Don't really think you can make a claim that confidently when you don't have any data on it.\n\n  \nI get that it's a pretty non-important topic here, I hope this doesn't reflect how you view important things.",
            "True. But KO potential aside, players like Oda as an example who can 1T a VLS from either staff or crossbow have an advantage here to me. All it takes is one fat VLS spec and it’ll be hard to recover. Especially with how much DPS you lose healing with hard food.",
            "Can't be THAT many with how many hours Westham/Dino wasted pking\n\nHate that I have to call it wasted because its supposed to be a game mode about pking. But if Donator didn't troll his max set, all of it really was for nothing\n\nI do want to see the stats of this tournament though! How many raids did each team do etc, see how the RNG played out",
            "What are you even on about? I'm saying the guy was not a good pvper compared to others on the roster, that's not hate, it's just honesty. I don't even know what your first sentence is addressing.\n\nI appreciate he earned it. But as we both alluded to, skilly with a VW is better content. Boaty is also a pretty solid pvper, so presumably a kill or two would have been cool to see. All i saw (and I imagine from youtube this is what most people saw) from Ray was him dying frequently, and losing a VW, which upset him greatly. Just seemed he wasn't the right guy for the weapon. But again, this is from someone who didn't watch any of donator's streams and have no idea if he can actually pk when he plays against easier opponents.",
            "oh, i didnt realize that was part of the food rules. nice",
            "Solomission has a video on YouTube covering the rules if ya wanna check that out",
            "Oh yeah.. Feel like people mainly were looking forward to watching all these teams square up at breaches\n\nBut making deaths cost food not only made 2 teams ignore the breach throughout, but also really effected the way breaches were played. Team Solo/Dino/oda eventually just accepted that they just had to afk farm it while not fighting\n\nOnly the Burgers threw a wrench in those plans by actively ragging Team Oda for 3 breaches in a row lmfao\n\nThis week was hype, but it could have been so much better if some teams werent locked up in CG for half or raids for 90% of it. PVP part was completely missing",
            "Oddly fitting name, that 0 hit on mage pray lmfao.",
            "It's not even budget, low ko chance but people are camping tank gear.  Most of these fights are gonna come down to attrition and fang actually out dps vls.\n\nBeing able to 10 tile against rcbs is also great.  I think if they play this out right it's a toss up between them and nuggets.",
            "In the end of the day it is a pvp tournament and the better pvpers will do very well.  Oda is absurdly good and his team might win the whole thing. I don't think they did great in the first phase, with the Nuggets and Kkonas building up advantages but they have 2 of the best pvpers of all time. \n\nIt's also osrs, it's very possible someone just splashes 20 times and gets wrecked even if they are good. It's very possible that every venge jcw does the opponent hits max and he the others they miss.  Skill specs is likely going to die without doing much but maybe his dharocks kos someone. People act like the best pvpers always win but I guarantee you Oda, Rhys, Dino, Westham, Ditter, etc. have all died 100s of times to people a lot worse than them. I've seen people do 50 damage with over 400 earned and people do 400 damage with 100 earned.  Tomorrow will be a lot of fun but it won't crown a pvp champion.",
            "~45 or so as Raikesy and Muts were grinding solo and then they did a few together last two days. (53 CoX KC between them but 5ish were together so double counted).\n\nDino was at toa more than CoX but we don’t talk about what happened there.",
            "Awesome, thank you so much! Been stuck at work with 4 12s in a row so haven’t been able to follow the tourney much but going to try and stay awake to catch the finale",
            "VLS specs would beat out fang specs I believe, but the fang wacks would be better.",
            "I forgot about the range distance. If they can utilize that it can be huger! Like fighting bots in LMS",
            "Vls specs will be about 10-15% more dps than fang spec.  non specs will likely be similar amount worse than fang. If the only melee hits are specs, vls will win and has more ko potential.  On the other hand if fights get drawn out and the vls doesn't ko, fang will out dps the vls around the 8th hit likely.",
            "Normally melee is the least used in NH but with them having the blood furys will be interesting to see if they are going to try to camp fang as much as possible."
        ]
    },
    "When I was 9 years old, I once planned a trip from Varrock to Port Sarim over the course of an entire school week with a friend. ": {
        "title": "When I was 9 years old, I once planned a trip from Varrock to Port Sarim over the course of an entire school week with a friend. ",
        "score": 1108,
        "url": "https://www.reddit.com/r/2007scape/comments/1dljk9p/when_i_was_9_years_old_i_once_planned_a_trip_from/",
        "content": "My friend from school and I played RuneScape pretty regularly together. We were familiar with the castle of Lumbridge, the path past dark wizards into Varrock, and some of Varrock itself (mainly the town center and the West Bank). \n\nWe had heard from other players that there were ships that could take you all across RuneScape at Port Sarim, and after looking at the map, we decided we should wait until the weekend because it looked like ‘an incredibly long trip.’ We spent our allotted play time during the school week fishing and cooking the best food we could and ensured we packed our best armor in case we came across any monsters on our perilous endeavor. \n\nThe weekend came, and off we went. We managed to make it. It was a glorious adventure. \n\nWe ended up finding the charter ship and quickly realized the boat rides cost more than we had in our banks. We teleported back to lumbridge via home teleport and resumed killing men around the castle. Pretty sure that account was hacked like two weeks later. \n\nTl;dr RuneScape as a child was such a magical experience. ",
        "num_comments": 97,
        "comments": [
            "It’s crazy to me that home teleport has been out since 2006, and that I distinctly remember runescape pre home teleport…",
            "My brother and I did a very similar trip to the end of the wilderness circa 2005. And I smithed us both sets of bronze armor and when we made it to the fence together it was so exciting. \n\nWalked back into varrock like champions chanting \n“We are the first noobs to make it to the end of the fence!”\n\nBut agreed that it was such a magical time to play.",
            "Great story. Thanks for sharing. I'm not sure how to feel about your name and flair, though",
            "Reminds me of the time my friend took me to Taverly Dungeon. I'd been to Taverly before but had no idea there was such a huge dungeon underneath it. \n\nAs a kid it really seemed like such a dangerous place, especially running past the dragons etc. The Black Demons blew my mind and he told me that you could get a Dragon Med helm from them. \n\nOne weekend I slept over his house and we pulled an all-nighter safespotting the Black Demons with a Rune Halberd. The kills took so long you'd log out from inactivity if you didn't move the camera lol.",
            "It was a different time wasn’t it….I remember when a friend in our RS group got 70 wcing and we all were just thinking of how much money we were going to be bringing in that we started making plans like “I’m going to buy all of Varrock!”",
            "An incredibly long trip I’ll never forget was trudging from Varrock east bank to the barrows with my buddy Ramsey. \n\nNo digsite pendant, no lumberyard tele, no ring of the elements, no fairy ring, no kharyll house portal, hell - we were too dumb to take the boat shortcut, or to have access to the resistance hideout shortcut. \n\nJust, walking, with no stamina potions, waiting at the gate next to the homie Ulizius for 100 run before we braved the swamp, praying to Jagex for a Guthans Warspear. \n\nBack when my total level was closer to my age than the current year, simpler days.",
            "My best friend when I was 9 was a kid I met in class. At that age, he had 99 magic and a fire cape. He actually still plays and maxed an iron man account a few years ago. Meanwhile, 9-year-old me was out there telling people my password and getting scammed.",
            "My home life was shit so when I was 11 years old I would wake up at like 7 am on a sat/sun and go to the nearby university and spend the entire day there playing rsc until 8pm when they closed. It was a computer lab for pre-med students so the computers were high end and they never kicked me out; probably assumed I was someone's child. True story.",
            "I used to do expeditions into Morytania and Karamja and never came back alive.",
            "My first day playing I was 8, and I thought the guy I was talking to to  start Ernest the chicken was a real player",
            "I still think about how there use to be no in game map. That shit was on a second tab or browser and it got me killed once or twice lol",
            "Does anyone remember when we use to be able to left lick the run icon, and rest to gain run energy faster?? Or am I not remembering correctly?",
            "Thanks for the heartfelt story Mr. HorsesMakeMePiss.",
            "I went to wildy before the ditch/home teleport were a thing and I remember getting stuck to the far east over varrock for literally a week. I would go south (by looking at my wilderness level go down) but I was so far east I would hit a wall. I didn’t figure out that I needed to go west to end up over varrock for like 15 hours. I was probably like 10 years old and remember being terrified.",
            "Me and my bro did the same, Lumby to Eagles peak. We even stopped for 'rest' with fires, brought food supplies and all 😂\n\nTook all of 30 minutes",
            "Back in my day we didn't have home teleport\n\n\nWe'd have to brave the perilous trip back to lumbridge by foot\n\n\nSome say a black knight lurks around there even!",
            "What a story!!",
            "I used to think the random mysterious box (that constantly stacks up to 25) was an infinite money hack lol",
            "Now when i think about it it would have been nice when the whole map was hidden and you had to explore it to unlock the map just like in horizon or other games. That would make the exploration part even better and make the new players curious. Maybe the could bring this even now out",
            "Back in the OG days, when your screen was 720p, and the sky was black, RuneScape felt so big.\nNow I play on a 42\" screen and can see Falador from the top of Lumbridge castle 😂",
            "My neighborhood friends and I used to fantasize about what all we would buy if we had $1M. I distinctly remember sitting on his side yard steps outside having the conversation.",
            "Were you guys members during this journey? I don’t think f2p can even access charter ships, they only go to members areas besides port sarim.",
            "I used to hate paying the goblins between Al Kharid and Lumbridge. Some times I couldn’t even afford to pay the fee and would have to walk around 😂 Then I found out doing a quest will get you free passage and I thought that was the best thing ever. Also only played f2p back in 2004, couldnt afford membership. Good times!",
            "Reminds me of the time when I got stuck in the karamja volcano and died to the skeletons there because I didn’t see the rope.",
            "When I first played my irl friend though I’d we logged in super late after dark and joined empty servers we would find tons of gold in chests turns out he was wrong lol, we ended up in the wild and died losing full steel gear",
            "omg this is so cute i love it",
            "I did a similar prep week for a camping trip into the wild. I remember training my fire making level because I didn't want to be caught by a pker while trying to light a fire.",
            "Kids these days have it easy. They don't even remember the dark times of Falador massacre. People fucking died during it",
            "Getting stuck in an area with no way out was a legitimate worry",
            "You probably remember your first teleport. I remember finally getting the magic level and spending most my money on a law rune and telling my cousin bye, I’m heading west. I made it to the members gate at Fally then teled back.",
            "Draynor Manor pre home teleport was a nightmare. My friend had to come show me how to get out. And then we both died to a tree. Good times.",
            "But do you remember sleeping bags?",
            "Wow.\n\nWhenever I use home tele, I think “back in my day, we had to DIE to get to Lumby”\n\nTo think that was only two years max is nuts.",
            "I swear I started playing in like 2007 but I also remember home teleport being introduced, so I guess it was more like 05/06",
            "My first account got stuck in draynor manor. I remember trying to get out and the chairs following scared me so I just logged out and made a new account, while making a mental note to never go there again.",
            "The day they came out with the home teleport happened coincidentally at the same time that I was lost and unable to find the exit to the under ground pass. I had been stuck in there forever it seemed and was so glad of the escape",
            "I heard 9 years old and was assuming some super old shit. I was playing when I was 14 back when everything was 2d sprites and dragon slayer just came out. Home tele didn't come out until after I had quit and come back because I went to play EQ then WoW.",
            "Was it really as early as 2006? I very distinctly remember pre home teleport. I thought home tele was like, 2008 or 2009.",
            "My brain honestly still sees it as a “new feature”. Human time perception is fucked up.",
            "I remember when monkey madness first came out if you didn’t bring a teleport the only way to leave was south of the graveyard (which I learned about maybe 2 years ago) or by dying",
            "Right, my immediate thought was \"ha, dude really dated himself with the home tele, he's still a kid\" but no, no not really. That was still nearly 20 years ago at this point.",
            "I thought it came out way after that lol. I remember getting stuck in draynor manor for like 3 days before I found the back door. I could’ve used a home tele then",
            "Bra. I feel old",
            "Same",
            "Rs classic and staking/PKing evolving has been a crazy ride",
            "Huh, I thought they introduced the home teleport during rs2 beta when people were getting stuck in random places",
            "I remember getting lost and just starting a new account because I had no idea where I was haha",
            "For real? My head was questioning this story just because I remember home teleport coming out at what felt like, a much later date.",
            "It came out in 06............I've been playing a lot longer then I thought......... ",
            "I remember it being a controversial addition. And I remember getting eaten by bugs because I thought I'd be safe in the swamp caves. I had a tele, after all!",
            "This changes everything",
            "What the fuck",
            "What is this \"horse\"? Is that some sort of high level slayer creature?",
            "Omg I'm still traumatized by that swamp destroying all my food before I could make it to barrows.\n\nI was blown away when I made a Barrows teleport in my POH not long ago. Seems like such a cheap work around.",
            "I remember this",
            "This was like right before RS3 I think",
            "What about the jester outside of falador you could rest at!",
            "That was later in rs2 in like 2010 or something. Polypore staff era",
            "They had to be members yeah",
            "I once got stuck in the general store, upstairs a few days into playing when I was a kid. I didn't know you could rotate the camera.\n\nThe next day my friend told me to just home teleport. I'd forgotten it was a thing in my panic. \n\nI figured out the camera rotation a week later.",
            "There was a house near the ranging guild where if you went up a ladder and then went down it from the other side it placed your character behind a table unable to access the ladder.  If you got tricked into going there you had to have a friend come with teleport runes to let you escape",
            "Not middle school me making an entire new account because I thought my account was bugged. Never went back for a very long time haha.",
            "The first time I quit runescape was because I got lost in lumbridge swamp",
            "My mate was in fally castle before the white knights got updated, logged in and he was behind something like boxed in. Had to be manual moved by a mod to get out",
            "Still remember it like it was last night, I was exploring karamja, no idea where I was, poisoned by a tribesman trying to find my way home safely. As is tradition, I had my entire cashstack on me and slowly died to the poison. Never did find my out way",
            "I remember my first home teleport too. \n\nI was only past the bridge and killing goblins before I discovered an icon in my mage book that wasn’t greyed out. \n\nI was so amazed by the character animation. I remember telling my older brother about it and he said “yeah it takes you back to lumbridge” and I was like oh wow this place is called lumbridge? \n\nDamn. I’m so high, I had to reminisce this out in words for some reason.",
            "Ernest the chicken fucked me up so bad",
            "That's one of my earliest runescape memories. I randomly found draynor manor. And back then it was packed. There were like 20 people doing the quest. The basement puzzle with the levers was impossible for us dumb school children.\n\n\nWell, it was indeed horrible as I couldn't figure that out nor could I find the exit. And the cherry on top? I didn't actually pick up the quest. I just entered the building and started randomly interacting with the environment. All the quest items are there, you just won't progress.",
            "Oh ya",
            "Yeah September '06",
            "I heard its like a mythical unicorn",
            "Yes it was. Now that u jog my memory, this was some of the best times for me in Runescape. Everything didn't seem so much of a \" I gotta spend 3 days grinding this to get this\" back then it was more of a , \" what am I going to do today\" something different than yesterday, and just as fun\"",
            "Resting came out way before RS3, resting was 2009 and RS3 was 2013.",
            "I remember this !!",
            "The polypore staff blew my mind. It cost less than 1m to hit 40's against other players in the safe clan wars portal lol. Simpler times",
            "Resting was more than 2 years before Polypore staff lol. It would honestly be a good addition to OSRS especially the Musicians part, that was dope. They'd have to nerf it a bit probably",
            "God I wish I could go back to being a stupid kid. Everything was so exciting to discover.",
            "I remember going down the cave in Karamja and not being able to get out. I took me the help of a friend to know where the rope was and how to get out",
            "I played for nearly two years before I knew you could rotate the camera.  Man did I feel dumb when I figured that out.",
            "One time after an up date, I don't know how it happened but I got stuck between the building and a wall/fence at the house that is directly west of the edge vill bank. There was no home teleport and I had nothing on me to get out. I wrote support and it took a week. Then I logged in and I was back in lumby. This was pre home teleport.  There is also now a break in that fence that you can get out.",
            "first time I quit was back when random events weren't optional and I ignored the frogs. got sent to there swamp cave and couldn't figure out how to leave.",
            "It was humbling realizing that my account is old enough to buy alcohol legally.",
            "I still play osrs that way haha\n\nATM I'm just farming cause Elden Ring DLC. But usually I randomly pinball between stuff. My playtime is ridiculously long for how little progress I've actually made lmfao",
            "He was 17",
            "This but the gravedigger / coffin one, spent days trying to figure it out and finally just quit for awhile.",
            "Never in my life have I feared a chicken so much",
            "I didn't need to think about this lol. We getting old boys.",
            "Not sure whether to downvote you for reminding me… or upvote in solidarity",
            "My account can almost rent a car without age related surcharges lol",
            "( ͡° ͜ʖ ͡°)",
            "Lmao that's funny and relatable. You should add me. I'm trying to get a clan together that will voice chat daily on discord. May need some help getting it set up if interested",
            "17 iq",
            "Remember: Growing old is unavoidable. Growing up is completely optional.",
            "Brother 🫡",
            "Your RSN the same as your Reddit? Mine is\n\nI'm in a clan ATM, very chill and weirdly frog-themed, everyone just kind of vibes and does what they want. We even have a Granny in the clan that most smiths cannonballs for hours hahah",
            "This... Made me emotional for zero reason.",
            "Hahaha no , my in game name is JohnWaynnee"
        ]
    },
    "Mobile UIM inferno": {
        "title": "Mobile UIM inferno",
        "score": 301,
        "url": "https://v.redd.it/wkil0r41w18d1",
        "content": "",
        "num_comments": 45,
        "comments": [
            "Awesome mate! I am also mobile and learning inferno. When is the best time to drop the runes to show safespots?",
            "I'm picturing some dude laying on a couch looking at his phone just sweating profusely. Good fuckin job matey.",
            "Bruh, is this on tablet or phone?\n\nI can’t phatom doing this on a phone",
            "I fucking suck at this game",
            "We're friends in game!\nBig gz man that's amazing.",
            "Teach me your ways… farthest I’ve made it is wave 57 and it was by sheer luck.",
            "Sick",
            "nah, absolute god gamer, I'm always amazed by how good some people are on mobile. I'm curious, are you able 1t flick on mobile? Were you using a tablet or a phone and do you use a stylus? Besides tile markers, which I heard are coming to mobile soon, what would be the best improvement to end game content like inferno?",
            "Big gz. I would have picked up those runes on the ground and died lol",
            "Thats pretty sick man gz",
            "You make it look so easy! On mobile too! Good stuff!",
            "Pssshhh. You basically have two mouses (thumbs). This isn't impressive. /s",
            "silly question, but aren't uim supposed to have like a looting bag or something for all their stuff?",
            "Mans doing it on mobile, meanwhile I'm too chicken shit to do it period lmao",
            "Man that's crazy. I would hook up a bluetooth mouse and keyboard for that.",
            "Right at the start, drop a rune 4 tiles from the edge, run for 3 ticks (6 tiles) and drop, then run for 5 ticks (10 tiles), then 3 ticks again.",
            "The new mobile UI they had in beta allows you to mark tiles. Hopefully that will come out soon and you won't have to drop runes to achieve the same result",
            "I did it during the double mage wave because you can just stand around with protect mage active and take your time. I did my log out break before that wave. I also dropped them one tile into the arena from where this guy did so that I could actually click the tile without worrying about picking up the rune.",
            "Lowkey I did zuk on the toilet",
            "iPhone 13 Pro Max my guy",
            "It's actually easier on good phones because there's less travel time and more precise screen taps. Tablets tend to be pretty bulky and awkward to hold, a midsized phone you can hold in both hands easily and use both thumbs comfortablely",
            "It's a huge learning curve, but you can do it if you put your mind and effort into it ❤️",
            "Learn alternating your prayers, it is the biggest game changer",
            "Yeah, someone told to practice prayer switches with the Colosseum before inferno.",
            "Not OP but also inferno mobile cape:\n\nYou can 1t flick on mobile and it’s arguably easier because your other hand is free to do anything else in the middle (like moving if needed) without having to move the cursor like you would have to do on pc. \n\nI personally don’t use a stylus because I like holding my phone and prefer the use of my thumbs but I know some people use stylus. \n\nHonestly, I personally am not pining for any plug-ins for PvM. Like if they come, I may use them, but I mostly think a lot of the common PvM plug ins are really unnecessary and are more of a crutch. No issue if people enjoy them, play however you want. It’s your game, tailor it to your experience. But for me, nothing I look at on stream and think “I need that”. Mostly just feels like clutter. \n\nThe plug-ins I do wish we had were more QoL based things like !kc and chat commands etc rather than the ones for making PvM easier. But they’ll be here soon so no sweat. Damage tracker for PvP would be very nice too. Same for self-entity hider so you can see your opponent’s gear switch when they dd you. You’re kind of trolling in fights if you don’t have those and your opponent does. But it’s not a humongous difference atm.\n\nAlso like you said, tile markers will be here soon, and while they’re not something I care much about, I know that is highly sought after.\n\nOP may have differing opinions though of course.",
            "Yes learning 1 tick flicking and alternating prayers was the biggest thing that helped with inferno (mostly did lazy flicking though). And like the other guy said, it is very easy to alternate while targeting other npcs or moving around.",
            "I have eight fingers, and two mouses",
            "Inferno is a safe death, so my stuff was at hespori",
            "Sorry if this is dumb question,  but do you mean start of the wave or start of inferno attempt?",
            "Been waiting on this update myself to finish up getting my cape. Spent a week of sending inferno and got to Zuk 6 times, 2 of the times getting to healers. Sure I could have probably sent another 5-10 attempts and got my cape, however I didn't utilize dropping anything to mark the safe tiles so I had to use a decent amount of mental effort to pay attention to the safe tiles. I am willing to bet having them clearly marked with tile markers will make the final fight significantly easier. We will see though!",
            "Taking a shit and taking care of shit.\n\nLove it\n\nHow numb were your legs though ?",
            "LOL amazing",
            "Well, i have a shit phone but guess i’m fucked then",
            ">more precise screen taps\n\nBro how small are your hands?\n\nI have an XL sized Pixel phone and my thumb can hit anywhere in like 1/4 of the screen. I genuinely have no idea how people do anything other than afk skilling without a stylus, tablet, or both.",
            "Why? Is Coliseum easier than Inferno?",
            "Thanks for the well thought out reply! \nWow, I never thought prayer flicking on mobile could be easier in any way than on a computer, but the fact that you can move or do other actions as you'rw flicking is pretty huge. \nI get what you mean about plugins making the game too cluttery, but I just can't imagine doing something like ToA without knowing your true tile, puzzle solves or just item tags, I much prefer how the inventory looks without them, but I'd rather have them on than mess up my switchea during akkha. I guess the plugins aren't essential per se, but they do make the game way way easier. I'm sure most osrs players would agree with me that achievements on mobile are much more impressive than a  computer. Wish I was good enough to do raids or other endgame content on mobile when I'm not home.",
            "ahhh thanks, so basically you have hespori as a bank lol:D gz btw",
            "Start of wave 69 ^^^^",
            "Not bad considering I logged out at zuk earlier that day hahaha",
            "Way less punishing because it is much shorter so you can get more practice in. For example: fire cape took me 4 attempts which made me rage quit for months, then I finally got it and fully learned CG days later. Can just get way more practice in",
            "I haven’t tried either yet, but I’m going to go for the colosseum and practice when I do.",
            "Colosseum is a lot more punishing and the death fees add up, but you do make a ton of money back if you get good drops leading up to SOL.\n\nIt took me about 2.5-3 weeks and around 180 deaths before I got my first quiver. I just got my first infernal cape today and it took 5 days and around 20 runs. \n\nThe colosseum definitely made learning the inferno a lot easier because I was used to prayer flicking. Inferno is just a slog and honestly the waves aren’t that hard. Colosseum can destroy you pretty quick and often when you get bad A/B spawns in later waves",
            "Thank you. Congratulations again ",
            "No problem. Thank you, dude."
        ]
    }
}