{
    "Sketchbook Saturday - share your latest work!": {
        "title": "Sketchbook Saturday - share your latest work!",
        "score": 3,
        "url": "https://www.reddit.com/r/ArtistLounge/comments/1dlprtp/sketchbook_saturday_share_your_latest_work/",
        "content": "Every Saturday we share our latest work, sketches and in progress pieces.\n\nIf you would like critique on your work please let people know, otherwise let's all just celebrate and share some positivity!",
        "num_comments": 2,
        "comments": [
            "Thank you for posting in r/ArtistLounge! Please check out our [FAQ](https://www.reddit.com/r/ArtistLounge/wiki/faq/) and [FAQ Links pages](https://www.reddit.com/r/ArtistLounge/wiki/faqlinks/) for lots of helpful advice. To access our megathread collections, please check out the drop down lists in the top menu on PC or the side-bar on mobile. If you have any questions, concerns, or feature requests please feel free to message the mods and they will help you as soon as they can. I am a bot, beep boop, if I did something wrong please report this comment.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/ArtistLounge) if you have any questions or concerns.*",
            "https://www.reddit.com/r/Coloring/s/HfsFk2wNAd\n\nJust trying to improve as a hobby artist... it's super relaxing 😌"
        ]
    },
    "[Jun 17] Weekly Thread - Start Here - What are you up to outside of art?": {
        "title": "[Jun 17] Weekly Thread - Start Here - What are you up to outside of art?",
        "score": 6,
        "url": "https://www.reddit.com/r/ArtistLounge/comments/1dhoxqs/jun_17_weekly_thread_start_here_what_are_you_up/",
        "content": "\n\n## Welcome to the r/artistlounge weekly thread!\n\n​\n\nWe hope everyone's week has been good! What have you been up to this week? Please feel free to share - art-related or not. \n\nHow would you feel about a community discord sheet? One where everyone who has a discord can add, so those looking for discords can be redirected? We had one a few years back and are thinking about starting it up again.\n\nIf you have any ideas for future weekly threads topics please feel free to share!\n\n​\n\n### This week's prompt\n\n​\n\n**What are you up to outside of art?**\n\nWhat do you get up to outside of your creative work? Artists seem to have a wide range of interests and it is something that has a strong impact on your work. Let us know what you're into and how it's going!\n​\n\n*(As a reminder, you do not need to stick to the prompt)*\n\n​\n\n​\n\nThe rules are more relaxed here. If you have any quick questions that don't warrant a full post, need some moral support and want to discuss general mental health, want to vent or rant about something, or just talk about something completely off topic, feel free to chat in the comments here. We ask that you please still follow our rules of kindness towards all others and do not write about serious mental health issues, nor use this space to advertise. If you need further help feel free to reach out to the us via mod mail.\n\n​\n\n​\n\n### Read me before you post in r/artistlounge\n\n​\n\nPlease ensure that you have read our subreddit rules in full, which can be found in the side bar and wiki.\n\n​\n\nFor a full breakdown and description of all our subreddit has to offer please check out our wiki page [here](https://www.reddit.com/r/ArtistLounge/wiki/index/).\n\n​\n\n#### Flairs\n\n​\n\nPlease add a user flair to let people know what type of art you   specialise in and use the post flairs to help guide the help you need.\n\n​\n\n#### FAQ\n\n​\n\nOur FAQ is split into two sections. [The main FAQ can be found here](https://www.reddit.com/r/ArtistLounge/wiki/faq) featuring in depth answers to many of our most common questions and the [FAQ Links page](https://www.reddit.com/r/ArtistLounge/wiki/faqlinks/) features a curated selection of previous useful threads.\n\n\n#### Megathreads\n\n\n* [AI](https://www.reddit.com/r/ArtistLounge/comments/1931as3/ai_discussion_megathread/) - For most discussion about AI. Only posts with significant, new information/discussion will be kept up and not redirected here.\n\n* [Drawing Tablets/Laptops](https://www.reddit.com/r/ArtistLounge/comments/1bmu8ye/drawing_tablet_megathread/) - For all discussion about drawing tablets/laptops.\n\n* [Sketchbook Saturday](https://www.reddit.com/r/ArtistLounge/comments/1dgc4xa/sketchbook_saturday_share_your_latest_work/) - Share what you've created over the week.\n\n* Weekly Threads - This thread is for anything that doesn't warrant a individual post. Rants, vents, simple questions, off-topic discussion etc.\n\n​\n\nI hope that we can all help each other grow and succeed on our journey through art. Thank you for making this such a special creative corner of the internet. <3",
        "num_comments": 14,
        "comments": [
            "Inscription into art school.... And man that's a hard thing to do + seeing friends and role playing with other friends! Not much drawing these days...",
            "The community discord sheet sounds interesting, but why was it removed years ago? If it wasn't used, misused, or didn't work for some reason or another, then what would the new implementation look like?\n\nAs for what I've been up to outside of art and work, I've been preparing to install some chassis bracing on my car (we're a decent ways into track season!), taking some steps towards learning the Godot game engine, and I have been ramping up my fitness and gym activity. A diversity of experiences really helps one's creativity and artistic journey, in my opinion, so I aim to capitalize on it this summer.",
            "Thank you for posting in r/ArtistLounge! Please check out our [FAQ](https://www.reddit.com/r/ArtistLounge/wiki/faq/) and [FAQ Links pages](https://www.reddit.com/r/ArtistLounge/wiki/faqlinks/) for lots of helpful advice. To access our megathread collections, please check out the drop down lists in the top menu on PC or the side-bar on mobile. If you have any questions, concerns, or feature requests please feel free to message the mods and they will help you as soon as they can. I am a bot, beep boop, if I did something wrong please report this comment.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/ArtistLounge) if you have any questions or concerns.*",
            ">What are you up to outside of Art\n\nJob searching and playing video games",
            "\"What are you up to outside of Art\"\n\n\nReceived a package I was waiting for from a antique store in Japan called \"Pet & M co.\"\n\n\nIt contained a very obscure/rare Silver Medal designed after L.C.Wyon's 1870 One Yen pattern coin,\n\n\n(L.C.Wyon was a master Engraver for the British Royal mint he was famous for his golden jubilee coin designs made for Queen Victoria https://en.m.wikipedia.org/wiki/Leonard_Charles_Wyon)\n\n\nOnly 2,000 were struck in 1999 by Perth mint as a part of their Historic world coins series.\n\n\nAside from the medal they also sent a small chiikawa & a bag of green tea for free.\n\n\n They are very thoughtful people.",
            "2 months ago I started doing bike training with the Apple Fitness app more regularly. I try to do one every day. Now that I’m in a somewhat better shape, I discovered I love that! So I just ordered a nice spin bike to replace my cheap one I had for several years. It’s awesome to release the stress and frustration of everyday problems!",
            "I’m doing a lot of meditation again. It honestly helps so much with my creative focus.",
            "I play the piano. I also am a decent cook. Generally I have a vegetable garden but I'm being treated for cancer so that's our rn \n\n\nI read quite a bit as well. And spend time with y grandkids. We have a pool, so I'll have friends over to swim. \n\n\nI create plein air poolside 🤗",
            "Deep cleaning my theatre, it’s summer, only theatre happening in summer in Alaska is for tourists. Yard work, long days make the weeds grow tall. Trying to catch a king on weekends but not stressing over it.",
            "I do programming, but it's always art related.",
            "Been learning to roller skate. 😁",
            "getting back to working on my fanfiction , playing video games and attending therapy groups. ",
            "This week we were fixing up our yard for summer. DH built a lean to for wood for the fire pit, and I got the raised garden beds weeded and planted. The trees are pruned. And a truck will deliver mulch and topsoil on Monday. We still have the front garden to deal with, but at least the back is presentable."
        ]
    },
    "I have a confession to make...": {
        "title": "I have a confession to make...",
        "score": 102,
        "url": "https://www.reddit.com/r/ArtistLounge/comments/1dlgr20/i_have_a_confession_to_make/",
        "content": "I'm lazy, I hate practicing so... I just … don't  \nMy technique isn't perfect, in fact I suck at perspective, and can't draw anything without a reference.  \n  \nBut I'm perfectly happy with my art and what I create. And don't really care if I get better.  \n  \nLike, I'm not being down on myself, I truly LIKE my art, but it's also undeniable that I'm not perfect, and that what I can do is limited by my ability... but most of the time... I just don't care.  \n  \nI don't WANT to do more or different, I'm quite content doing what I do. And Oddly, my ability and art has gotten better over the years, despite my near active avoidance of anything even resembling practice.  \n  \nI just draw the things I want to draw and am happy.  \nHell, I still even somehow manage to sell commisions and stuff!  \n  \nAny other Lazy artists out there?  \nThat are not perfect, but perfectly happy with where they are at?",
        "num_comments": 42,
        "comments": [
            "Doing your art is practice, it's just not dedicated training to improve areas you are unhappy with kind of practice.",
            "I think that's more than fine, if you are happy, you're happy.\n\nThe issue is usually when you're unhappy, but also not willing to put down the practice. Or when you have a unrealistic opinion about your own skills.\n\nBut if you are happy with it, that's it really.\n\nMusic was this for me, when I was a teenager. I was happy to just make my noise and that was it.",
            "Most of the best books on practice I have all say one thing at the end & that's to just draw what you love. \n\n\nPossibly the best advice to give imo.",
            "What you're doing is practice, you're just not calling it that.\n\nnoun: practice    1.    the actual application or use of an idea, belief, or method, as opposed to theories relating to it.",
            "Jokes on you that is practice",
            "Oh heck yes. Can’t say im like this with my drawing but I’m like this with my guitar. I don’t really care to necessarily improve certain things but i’m happy to be good enough to write songs for myself and I get a lot out of that expression of self",
            "The truth is, many people would love to be in your position, you don't have to qualify it by calling yourself lazy. You're doing something that makes you happy in a way that makes you happy. There's literally zero things wrong with that",
            "Hey, if you're happy, you're happy, and that's all that matters. 😊",
            "100%. Art is for the artist, first and foremost. What's the point of getting better if it makes you miserable.",
            "Making art should make you happy. If you’re happy, you’ve achieved more than most.",
            "Honestly I was this way with the bass guitar. But I enjoyed just derping around for enough years that I eventually did get pretty decent at it. Just took a hell of a lot longer than if I'd practiced more.",
            "I highly recommend as mentioned, create artwork for yourself, as a rule of thumb. I paint , draw , in several different mediums , no not the best but I’m happy. You’re on the right track. Just enjoy yourself, that joy comes out in your artwork and people can see that.",
            "Art is ethereal and doesn’t need to conform to anything. I’m the same as you in that my stuff is ok, nowhere near good enough to sell (or probably to give away) but that’s not why I’m doing it. I have a technique I enjoy and I am improving but not because of some drive to perfect the technique, it just so happens that I enjoy it. I find art therapeutic and the act of creating it is its own reward.",
            "Dear Diary,",
            "I feel the exact opposite. I will suffer through any amount of tedium and bullshit if it gets me somewhere. But nobody actually agrees on anything for practicing fundamentals, except drawing boxes. That shit does nothing for you after you understand it. At least in boxing we outline the fundamentals, and understand working them. No one in art can teach worth a damn, because they just fell into something that worked. It frustrates me endlessly.",
            "Thats all ok and perfectly fine.  I always hear people say you have to learn the rules and then you can break them. I don’t believe that to be true. In art there are no rules. That’s what makes creating art so wonderful.",
            "Omg this is me 🥹🥳 i just saw a minute clip of Maria Bamford standup “why does everything have to be so good” and this post is a nice follow-up to that..not that that was what you were saying…it just resonated with me like that did 🫶",
            "Part of me is a lazy artist as well, so you're not alone. 👍🏽",
            "I relate to the first paragraph alot. But also, i turn into a completely perfectionist when im working on a piece. Often times i leave my work unfinished bc of this 😅",
            "Yup. I mean I'll work on one painting for months. So it's freaking finished when it's finished. I'm doing pet portraits so definitely using photo references and using projector to do rough sketch. I've done drawing the non lazy way enough. Thats why I started painting. Tired of hands aching trying to blend prismacolors. \n\nI only recently heard of practice studies. There's no way I could do that. It would just be the painting. No way i could make myself start over.",
            "Honestly same though like my art is probably a 6/10 or C tier but I think it has enough redeeming qualities to be good lol. We don't need to all be professional masterpiece makers some of us are great just being the casual self loving flawed artists we are",
            "I don't get practice that isn't just drawing when you want to draw as you usually would. Like I feel like forcing myself to draw when I'm not in the headspace for it, working on something challenging, would not be conducive to improvement",
            "If you're happy, you don't have to actively practice. You're basically doing \"trial by fire\" practicing just continuing to do what you do.",
            "This isn't lazy, this is just enjoying your craft!",
            "I want to get better but I'm not in a hurry. I'd rather draw whatever I feel like drawing, and I admit I've reached a semi-comfy spot in my art/my relationship with my art, despite knowing I have a lot of technical issues to improve. And I do consider myself lazy lol. I only draw what and when I feel like drawing.",
            "Making art is practicing though? I don’t understand this",
            "Thank you for posting in r/ArtistLounge! Please check out our [FAQ](https://www.reddit.com/r/ArtistLounge/wiki/faq/) and [FAQ Links pages](https://www.reddit.com/r/ArtistLounge/wiki/faqlinks/) for lots of helpful advice. To access our megathread collections, please check out the drop down lists in the top menu on PC or the side-bar on mobile. If you have any questions, concerns, or feature requests please feel free to message the mods and they will help you as soon as they can. I am a bot, beep boop, if I did something wrong please report this comment.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/ArtistLounge) if you have any questions or concerns.*",
            "Yeah, I'm lazy a bit as well. I mostly just paint and don't practice sketching at all. My sketches and layouts are done really fast and carelessly. I tell myself it helps to loosen up, haha.",
            "I mean, if you are happy, that's wonderful. Honestly, I think that's the most important part.\n\nBut for me, the more I draw, the more I start to hate my work. I've been stuck in this mindset since the beginning of this year. It's totally fine to not be perfect, but I just don’t want to accept that I can't do anything better. So, I keep practicing and practicing, and then I don't want to draw anymore.",
            "Thats two words",
            "I get how frustrating it can be to just be endlessly told to go draw boxes, but people *do* agree on fundamentals, they're just bad at articulating exactly what to do sometimes. I don't think the vast majority of artists just \"fall into something that works\", they just try and fail a million times at a bunch of different methods until something clicks.",
            "The rules are the fundamentals. When you learn how they work you can push them in fun new directions.",
            "The art community online (or at least a small segment of it) has been infested with the idea that you must drill thousands of pages of exercises completely divorced from making actual images as part of the git gud sigma grindset or quit. No in-betweens accepted.\n\nThat approach DOES work for some people. Other people just incorporate what they're learning into their \"real\" art pieces and practice that way. Or some mix of the two. But certain people online aggressively reject anything but a very specific approach as qualifying as study or practice. Some of them treat these drills as more like a hazing ritual to be endured before you earn the right to draw something you find interesting than an actual effective learning strategy. For those types, the pain is the point.\n\n(I agree with you of course)",
            "Yes I know and you can make art without knowing the fundamentals.",
            "lol. You are the art world’s version of a flat earther.",
            "Naive art is an entire genre/historical tradition. And of course folk art from various cultures throughout history.\n\nIt's not what I'm personally aiming for/working towards but it's definitely a real thing to create art, even quite beautiful art, without any sort of fundamental study.",
            "Hahaha ok. Thats fine because I make a living with my flat earth art. I have sold to galleries and have painted over 50 murals so say what you want i dont give a fuck.",
            "You are going off on a tangent here. The person I responded to said there are no rules in art. I disagreed saying the fundamentals are the rules. Now if they had said there are no rules in how you make art I would have agreed. But that was not what they said.\n\nI suppose I could have conceded that yes people can make art without knowing the fundamentals. That’s true. Is any of it good? Not usually. But they still use the fundamentals. Why? Because the fundamentals represent our breakdown of how humans understand visual language. \n\nEven five year olds smearing paint on paper have a sense of form and space. Is it good? No, cause they don’t actually understand the rules. But we all have an inherent sense of what the fundamentals are and that is expressed in our taste for art."
        ]
    },
    "It's weird as a casual artist being stolen or scammed": {
        "title": "It's weird as a casual artist being stolen or scammed",
        "score": 15,
        "url": "https://www.reddit.com/r/ArtistLounge/comments/1dlpyga/its_weird_as_a_casual_artist_being_stolen_or/",
        "content": "I am not a fantastic 10k followers popular artist im a \"hey look at my ocs and this doodle of a pokemon\" kind of artist, but I've had multiple times in my travels online where I've screwed over.\n\nI've been unpaid before when I decided to draw for someone which is weird but okay you scammed a hobbyist are you proud of yourself? I've had art I've done for a streamer I used to mod for just flat out stolen and resold on her dumbass merch store. And I've had people either repost or use it as examples in their slam posts about mediocre art like thanks for insulting me but don't steal my shit bro.\n\nIdk if this has happened to other artists who are just casual hobbyists or if in just unlucky. I've learned from these experiences but still it's just weird to go through",
        "num_comments": 4,
        "comments": [
            "I’m sorry that you went through this.\n\nBut yes unfortunately it’s super common.\n\nIt’s not just common online - it’s common around you in real life as well. \n\nIf you do any kind of art people expect freebies. \n\nIf you are good at baking cakes or cookies friends \nand family will ask you to do that for free for them. If you are good at programming and know your way around pc people will ask for advice or want them to fix their devices for free.\n\nSo let this be a life lesson to value your time!\n\nno matter your skill and level. Only do projects that either pay you upfront at least half with a contract or you are absolutely okay to do it for free.\n\nBut don’t sell yourself short. No ones time should be exploited. \nIf you do something as friendship favour ask yourself if that friend would do the same for you. Would that friend do whatever hobby they do for free for you.\nWould they give you their books for free because they are done reading? Would they come across the city to help you move for free?\n\nSome friend may be absolutely worth the effort because they already did countless of things for you. Bought you coffee or icecream just because they wanted to spend time with you and knew you were short on money. So sometimes if you want to make them a gift that’s fine- but then expect that as soon as it leaves your hand they may resell it.  but if it’s something they asked you to do - always put some kind of compensation and rules to it. \n\n\ni know we all fall into this trap because we believe they are better artists out there - and that’s true they will always be better artist out there; but that doesn’t mean your effort isn’t worth appreciating. \n\nAfter all if it was easy why don’t the people do it themselves? \n\nIt’s still time, and recourses being used that cost you money and effort. And yeah, I hear you say : but I already have a tablet and the program and would use it anyway. But eventually it needs replacing, so it’s not different from using traditional medium paint.\n\nAnd most importantly time has the most value here. Because time is something no matter how much you gain it will never come back to you. So don’t waste your free time on things that don’t feel good or rewarding after. \n\n\nI hope that helps :)\n\nGood luck on your journey onwards",
            "Thank you for posting in r/ArtistLounge! Please check out our [FAQ](https://www.reddit.com/r/ArtistLounge/wiki/faq/) and [FAQ Links pages](https://www.reddit.com/r/ArtistLounge/wiki/faqlinks/) for lots of helpful advice. To access our megathread collections, please check out the drop down lists in the top menu on PC or the side-bar on mobile. If you have any questions, concerns, or feature requests please feel free to message the mods and they will help you as soon as they can. I am a bot, beep boop, if I did something wrong please report this comment.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/ArtistLounge) if you have any questions or concerns.*",
            "Start doing DMCA takedowns.",
            ">I've had art I've done for a streamer I used to mod for just flat out stolen and resold on her dumbass merch store.\n\nYou should be getting some of that money or be able to get that taken down"
        ]
    },
    "Why does my art feel amateurish?": {
        "title": "Why does my art feel amateurish?",
        "score": 44,
        "url": "https://www.reddit.com/r/ArtistLounge/comments/1dlhzbi/why_does_my_art_feel_amateurish/",
        "content": "As the title says every time I make a new artwork it feels like there’s no growth or anything changing. Each new artwork I produced feels super amateurish and doesn’t feel like it should be at the level I’m expecting myself to be. Am I thinking too linear with my art or should I be trying to strengthen my base foundations?",
        "num_comments": 32,
        "comments": [
            "Took a glance. To be frank and to not sugarcoat, you should go back to the foundations. Every aspect can be improved, from anatomy to poses to form construction to colors. Don’t think of it as a step back, think of it as a potential huge step forward.",
            "go back to foundations and work from real life or decent reference. ",
            "Your art feels amateurish because you lack fundamentals. Instead of drawing from your imagination, draw items from real life. Chairs, food, the room you live in. Work to make your observational drawings as detailed as possible. You must train your eye to understand the nuances of physicality and reality before you can draw from your imagination.",
            "Strengthening base foundations pretty much ALWAYS helps if you go then return with those principles you practice in your art. Also are you drawing the same type of thing over and over? You might be kind of stuck in a rut and should try something new. Like, if you always draw people, work on architecture or animals or plants or something. Not that you will magically better at one of those things, but looking at different parts of the existing world and observing them and drawing them contributes to your overall skill and might also give you some new ideas or just lead you a different direction when you return to what you usually work on.",
            "Likely because it is. Anatomy would help a lot",
            "Not gonna sugarcoat it for you, your art looks like its amateurish because it is. I took a glance and saw you try to draw a bunch of very different topics from humans to monsters. My advice is to go back to the beginning, learn the fundamentals, do the boring stuff and then come back in all your artistic glory. I recommend scott robertsons how to draw book, you can look it up free on internet archive and its got  basically everything you re lacking atm. ( he made a sequel you can check out in a year or two as well). Best of luck!",
            "Can you be more specific about which aspects you're not happy with? It's difficult to guess otherwise.",
            "After glancing at your account, if you only focus on one thing to improve on - shadows and shading. The others are right, you should delve into basic fundamentals, which includes proper shading, but if you just want to focus one step at a time, that's what I would focus on first to easily see growth.",
            "Yup work on your foundations training, even manga artist- you can tell if they have had foundations training- you can just feel the sense of perspective, solid objects and believability in the poses and gestures. \n\nYes stylization is super fun. Art is about thinking- when you draw new things- and force yourself to draw say- complex things like a car why the part look this way to why things are solid or why all the lines converge.\n\nEven drawing a spoon in a glass of water- you have to notice the refraction of the light, the different thicknesses of glass- how objects distort behind the glass- through light science- these are advanced topics and knowledge you may not be there yet but just go out and have fun and study- them or whatever is most interesting to you- color, anatomy, perspective- gesture, mark making- form. \n\nArt is about thinking- when you are thinking about these new visual properties- believe me your drawings will change and get better reflecting your new found knowledge of the academic realism .",
            "A quick tip: Try to have the lines underneath a shape thicker, and the lines on top thinner. It's a cheat to some degree.",
            "To add to other comments, I want to also advise to try copying artworks you like. While you are doing that, you can analyse 'how it's done', using of lines, shades, etc.\nAncient artists learned that way too, don't feel bad about it. You must learn deeply from the nature & other artists' works first, to be able to break fundamentals (if you want) and to discover your own way lately. This is the way.",
            "May be creativity block try to get some inspiration around, go to social gatherings talk about ideas get inspiration it might help to get better",
            "Commenting as a complete rookie, but I think that's where I can help:\n\nLook at the work of someone you admire, and try to identify the main difference between your works.\n\nAt a glance, I'd say you could do with focussing on light/shadow. Not only does it create depth and detail, but it can quite often replace outlines entirely in certain areas.\n\nBe bold, be brave, try new things and never give up!",
            "If you do stylized art I would recommend the fastest way to learn anime art by Oridays on YouTube. I’ve watched many videos and tried many things but what’s special about oridays is that he really explains a way to learn art in a way that is applied in stylistic way which for me has helped a lot recently. I did many studies of anatomy and a lot of other things but I didn’t see much improvement and oridays did help me realize a lot about why so I think if you are doing especially a more stylized type even if it’s not anime in particular that video will help you a lot.",
            "What education do you have in the foundations? If none, you need it. Find a reputable school or course",
            "study fundamentals. amateur art doesn't have a strong base in foundations/fundamentals. even pro artists study nearly daily.",
            "Draw shapes, and practice gesture drawing. Just get a cheap sketch pad and a pen and go at it whenever you can. Keep 3D space in mind! It helped me a lot, I’m not the best but I did see some improvement!",
            "Thank you for posting in r/ArtistLounge! Please check out our [FAQ](https://www.reddit.com/r/ArtistLounge/wiki/faq/) and [FAQ Links pages](https://www.reddit.com/r/ArtistLounge/wiki/faqlinks/) for lots of helpful advice. To access our megathread collections, please check out the drop down lists in the top menu on PC or the side-bar on mobile. If you have any questions, concerns, or feature requests please feel free to message the mods and they will help you as soon as they can. I am a bot, beep boop, if I did something wrong please report this comment.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/ArtistLounge) if you have any questions or concerns.*",
            "Base foundation can also mean drawing \"through\" the form, considering and drawing out dashed lines of what your character, for example, looks like from behind, where the circular lines of their head or hip land behind them and behind what we can see in the 2D space.\n\nStudying basic principles of animation (books by Preston Blair) and learning to see your art in 3D to draw through the forms will help you solidify your style so your art can look professional.",
            "Study gesture drawing, anatomy, perspective, color theory, composition. Draw from life a lot.\n\nGetting good at visual arts is a shit ton of work. It is hard but rewarding.",
            "It seems you like drawing characters, so learning basic shapes and gesture drawing will give you a good boost, the benefit is that you would naturally try to apply your knowledge by drawing characters and you would be motivated to make them look good by learning more, so it's a good cycle. Buy yourself something like a Body-kun and Body-chan figurines, even knockoffs will do, this is to have a fast and tangible way to see a a general pose, basic shapes and perspective (check perspective lessons, and tie them into basic shapes). Don't try to shove everything into your head like anatomy, composition, color, but keep a curiosity about them. Don't bury yourself under constant lessons and learning hours, you would get better results by combining a bit of studying with drawing what you like while applying what you've learned to your best current ability, and try to jump higher with a next drawing. Don't forget to give your brain time to process and settle in the information, you would see improvements fast, but don't measure yourself in days and weeks, several weeks to months is a realistic pase of improving without rushing like it's a video game. Have fun",
            "Take classes that will propel you forward fast esp if ypu get a good teacher",
            "I may be a bit late, but I'd like to offer a deep perspective.\n\nI think the true issue at heart is that you need self discipline and understanding of yourself and the things you create.\n\nAnyone can say, \"Improve fundamentals\" but what does that really mean at the core? Learning how to practice is a more valuable skill than practicing itself.\n\nThere have been many times I've seen a \"This is my progress over a year\" and to be honest, it looks like less than a few days worth of progress. The reason for this is because they have poor practice methodology and execution.\n\nThe first hurdle is investment. How often do you spend practicing? I don't mean drawing or painting. But more importantly, study. Watching a course or a video on design principles, and really looking at the major problems in your work. How are you expected to paint a figure in great light, with the perfect pose, incredible composition, and anatomical structure, if you don't understand the concepts on how they work? Break these fundamentals down and laser focus on them. Dedicate time to this process as it is a period of growth. The key is that you can accelerate that growth. Make your one years worth of progress one day.\n\nThe next step is what to laser focus on. Usually its the thing you dislike most in your work at the time. Don't like the lighting? There are experts that have made videos on understanding light. They are your gateway to understanding. Your wings to discovery. Once you see the process, can break it down, and apply it to your own work; your one year begins to quickly become one day.",
            "Idk if you watch Steven Zapata on YouTube but i recommend his stuff- especially if you enjoy drawing from your imagination. Imo- I really like that you seem to be working from your mind, and I think his advice and videos will help you not get locked in the fundamentals rabbit hole I see some artist get stuck.\n\nPersonal advice- your best pieces seem to be the ones with a limited colour palette. I think it’s bc you have to think about light/ shadow and value much differently. I’d encourage you to explore that more.",
            "Someone who actually posts their art making one of these posts, impressive",
            "Try here first: Walt Stanchfield Drawn to Life Vol 1",
            "try ask The Art Mentor Yt",
            "🤔 so basically you don't like something about your art piece, which makes it so you're not satisfied with it and you describe that unsatisfying feeling as amateurish perhaps.\n\nDo you like the idea you had? Try drawing that feeling something arises more intensely, What was that feeling in the idea? Happy, sad, angry, scary, gentle, rough, intense, smooth, natural, unnatural, uncanny, pretty, cute, beautiful, emotional, cold, familiar, unfamiliar, powerful, weak, friendly...\n\nWhat color describe that feeling? Gentle and sad=blue\nAggressive and intense or deep= red\n\nWhat shapes describe that feeling?\nAngry,determined=pointy        soft cute gentle=round\n\nWhat things arise what feeling?\nScary= teeth, meat eating animals, sickness\nFriendly and cute= cats, baby animals, small things, chibi, smiles\n\nI'd build feelings of the idea first, only then I'll know what I want the skill level to be at and what it is exactly I want to do.",
            "People are saying you need to go back to the foundations, but that's not super helpful imo because you do have a relatively good understanding of figure drawing, design theory and anatomy but your art is really flat and stiff. I suggest practicing gesture, textures and most importantly foreshortening and perspective. I feel like you would benefit from that the most, but it also depends on what your vision for your art is."
        ]
    }
}