{
    "Update : now more than 1,000 people dead at hajj": {
        "title": "Update : now more than 1,000 people dead at hajj",
        "score": 3816,
        "url": "https://www.theguardian.com/world/article/2024/jun/20/more-than-1000-hajj-pilgrims-die-in-mecca-as-temperatures-hit-high-of-51c",
        "content": "",
        "num_comments": 552,
        "comments": [
            "[And Allah has provided you shade out of what He created, and has given you shelter in the mountains. He has also provided you with clothes protecting you from the heat ˹and cold˺, and armour shielding you in battle. This is how He perfects His favour upon you, so perhaps you will ˹fully˺ submit ˹to Him˺.](https://quran.com/en/an-nahl/81)**\n\n**Offer not guaranteed, protection not to be taken literally, all rights reserved, side effects may include death, heat stroke, dehydration, dizziness, dry mouth, not FDIC insured, may result in loss of principal, offer void in Utah, some restrictions may apply, consult your doctor before beginning any new religious pilgrimages.",
            "Religion is cancer.",
            "Always a great idea to bake in 50C sun to worship a non-existent god.",
            "Allah needed them more than we did.",
            "I'm convinced that everything wrong in the world can be attributed to zealots trying to one-up each other.  The greater the cognitive dissonance, the deeper the stupidity, the more points these fools get.  Muslims, MAGATs, you name it.  The stupider the move, the higher the respect.",
            "Religion is so amazingly stupid.",
            "People make bad decisions.",
            "Darwin is always gonna Darwin",
            "This is absolutely \"god awful\", and I mean that in all senses of the phrase...",
            "Natural Selection hard at work",
            "Virgins in heaven: here we go again",
            "Natural selection in real time.",
            "Once upon a time, these massive deaths were due to stampedes or accidents.\n\nClimate change is real. It does not discriminate. Hopefully people will listen.",
            "It’s tragic that so many have been groomed since childhood to believe that praying is more important than their own lives",
            "https://en.m.wikipedia.org/wiki/Apostasy_in_Islam_by_country\n\nReminder in SA and surrounding countries you can’t even leave Islam",
            "I mean... If you keep going after the first few hundred die, it's a little bit your own fault.",
            "My God, the crazy bastards are going for the record!",
            "Death cult.",
            "Kind of ironic that they're dying because if the climate-change related heatwave partially caused by the oil production that made Saudi Arabia rich to build the hajj facilities they're dying in.",
            "Can we expand this idea to all religions?",
            "They would have lived if they had worshiped and respected Nature or the Sun instead.",
            "Some religions in particular have a big distinct advantage…\n\nTo get people to do stupid things.\n\nIt was useful in the past and still useful to coerce people to go to war and sacrifice their lives.\n\nAnd for getting people to die walk in circles…",
            "Gotta run around the box with a pagan rock in it",
            "Those are rookie numbers.   You gotta pump those numbers up.   ",
            "Oh no! Anyway",
            "The most deadly hajj in…nine years.",
            "Well, I guess that's ***one*** way to prove your devotion.  I can only imagine in that kind of heat that the delirium they must've been experiencing towards the end was interpreted by them as the road to Jannah (Muslim heaven).  Probably just as well - I think I'd rather not be aware of reality at the end of that kind of death, either.",
            "Isn’t religion wonderful? lol",
            "A question, why don't they worship at night when the temperatures are this high? Is it a requirement for them to do it in the day or something?",
            "Tens of thousands of unofficial pilgrims denied access to relief because they couldn't afford the permits. Wonderful country and wonderful religion, turning a pilgrimage into a cash cow.",
            "If only Allah could have intervened somehow",
            "Paradise awaits them lol.",
            "Do they have a “fast pass” line for rich people like me Disney Land?\n\nI don’t see some Saudi prince baking his brain out.",
            "The One True Religion:  Darwinism.",
            "Oh no!\n\nAnyways, all that to point at a magic space rock. That's just not right.",
            "on a brighter note Global warming should keep making those numbers even better over time.",
            "To borrow a line from the late great Bill Hicks: \"Well, 1000 less doorknobs in the world.\"",
            "Thoughts and prayers 🤷‍♂️",
            "# now more than 1,000 people dead at hajj _________\n\nThe god of Abraham thrives on human sacrifice.",
            "I bet they'll be considered martyrs by their family and community as well. Not the dupes they are",
            "doing the other lords work...",
            "Well, that is just terrible.",
            "Lets a tell the christian nationalists that jebus now all wants them to worship in tightly packed saunas",
            "Natural selection",
            "This is just terrible. Sad people are so brainwashed to kill themselves for an imaginary person. More sad their friends and family will explain it away because of Allah. I would bet a billion dollars their leaders didn't have any issues looking down on them in their air-conditioned five-star hotels and royal courts.",
            "Bummer. On a side note: I have always maintained that Stupid should hurt. Perhaps we are heading in that direction again.",
            "Allah will provide 🙄",
            "Don't stop now fellas, five figures is the goal",
            ">Each year tens of thousands of pilgrims try to join the hajj through irregular channels as they cannot afford the often costly official permits\n\nSo not only do you have to make a pilgrimage to a specific place, it also has to be done dependant on lunar cycles, AND you need to the money to get an *official permit* to do so? What kind of racket is that?",
            "These are truly idiots who think their maker is calling them. They consider this an honorable death. Smh",
            "I have to wonder if life insurance classifies this as suicide?",
            "Well, they get to be with their god now. So, net win?",
            "[it’s worse than people realise](https://www.bbc.com/news/articles/cxrrzp479r4o.amp)\n\nMany of the dead are not on official Hajj visas, opting for cheaper tourist visas, which means they don’t get the facilities (tents with air-con, water, shade and cooking mists) and aren’t registered. So likely the deaths are much, much higher.\n\nThe policy for people doing the Hajj not on an official visa is arrest them.\n\nThe whole thing is nuts.",
            "Saudi Arabia has the money to make this pilgrimage a lot safer and they don't.",
            "The hyper-empath in me is uncomfortable with some of the \"oh no...anyway\" comments because at the end of the day they are human beings deserving of SOME amount of respect on that level.\n\nBut if someone is so devoted to something they have never actually experienced to such a degree that just stepping out into the blasting heat to BEGIN the journey, let alone being in the severity of heat at the destination, isn't met with an \"oh hell no\" it's kind of a deserved end, a la Darwin Awards. Like what were they expecting to happen...?",
            "lol religion is so ridiculous",
            "I feel like a god worth worshiping wouldn't actively take people out while they were in the process of doing it, but what do I know?",
            "It's like religion turns you into a zombie. Like Jesus...",
            "If they're not upset about it, I don't see why I should be.",
            "Oh no!\n\nAnyway...",
            "Doesn't the scary-looking monolith protect them?",
            "Oh ye of little faith. Actually do you die if you have little faith,  Or too much faith?",
            "Weirdly this is not mentioned in any news channel here in The Netherlands (afaik)",
            "And barely a mention in much of the media",
            "Yea...they're going to see Allah. Why aren't people happy? Think of all those virgins Allah is going to have to find at 72 per (male) person.",
            "If you die from the heat doing Hajj, is that an automatic ticket to paradise? It should be.",
            "Considering Saudi Arabia has tons of money you think they would do something about this.. but once again the religion of peace doesn't care about human suffering",
            "Sometimes you gotta sit it out. This is one of those times.",
            "Holy crap. My elderly parents were going to be there for the Hajj this year but their plan got cancelled due to external circumstances at the last minute. I had warned them of how dangerous it can be (I am an ardent atheist) but that didn't deter them.",
            "Committed, you gotta give them that.",
            "Well that's fucking awful. *1000+ people,* I have no words.        \nJust… awful. \n\nFor any reason. But you know how I feel about this one.",
            "my heart goes out to thier Families.",
            "Let them cook.",
            "I guess they won Hajj '24?",
            "We need to find a reason for christian nationalists to congregate in death valley.",
            "A good start.",
            "Not bad. A couple of hundreds of millions of Muslims more and we are done here.",
            "Shouldn’t be too crowded next year.",
            "Pointless death",
            "They died with smiles on their face lol",
            "> the pilgrimage [...] all Muslims with the means must complete at least once.\n\n> thousands of pilgrims [...] cannot afford the often costly official permits\n\nThat should count as \"without the means\", hence they are exempt.",
            "It's natural selection.",
            "Dude cancel it! They are only proving the barbaric nature of their religion by letting so many die needlessly.",
            "I can’t even imagine losing my life for some religious rite. I wonder if there was any regret amongst those about to perish in that extreme heat.",
            "Why isn’t allah helping?",
            "You might as well go to Death Valley in the middle of summer and worship Mickey Mouse, you’ll get the same outcome.",
            "Fucking climate change.\n\nI feel for their families.",
            "Why didn’t their God protect them?  They are doing this all for him!",
            "You can call them idiots, but if there is no free will then they had no choice but to die. And since we have no free will then we couldn’t save them.  And the world turns…",
            "Inshallah",
            "That’s really sad. I’m sorry they suffered and died.",
            "How do you think they'll end up blaming the Jews for this?",
            "Natural selection at its finest!!!\n\nThe more the merrier!!",
            "Can we expand this idea to all religions?",
            "At this point they know better and are just committing suicide, guess they're going to hell.",
            "Must be God's will lmao",
            "#Where is your god?\n\nWhy didn’t he save you? \n\nWhy did he allow this?",
            "Those are rookie numbers!! We have to pump those numbers up boys!",
            "It's just sad nothing else.",
            "Praise Allah!",
            "Guys, while i understand the catharsis of bashing the religion I think climate change is the more pressing issue here. Religion is a stain but 1,000 people should not be dead from the heat.",
            "Oh well, too bad so sad 🙄",
            "Why did allah put kabba in a desert hell fire shithole and not beautiful tropical beach ??? Hmmm I guess allah knows best 🤔",
            "My question is, how the hell were they given visas?",
            "Insh'allah, I guess? 🤷‍♂️",
            "All for a stupid religion…… sad…..",
            "Darwinism in effect",
            "At least a few were because of people selling full trips with accommodations to vulnerable people and then just taking the money and running. These aren't just people who hung out in the sun, insisting that their faith would protect them from physics. BBC had a good segment on it, along with the steps the Saudi government has been taking to keep people out of the worst of it. \n\nIt could have been avoided, but let's not lose our own humanity while we talk about it.",
            "Darwin is not working fast enough",
            "Maybe this is God's way of telling you to stop worshipping a cube in the middle of the desert.",
            "I don't understand, why everything in this group is about organised religion?\nI think we should change the name from 'Atheism' to 'Anti-religious'.",
            "Imagine being so brainwashed you go to a pilgrimage and die there…",
            "No surprise. It happens every time. Saudi Arabians have the lowest avg IQ of 7 Arab nations.",
            "Hopefully the Indoctrination of whoever these fools procreated has been broken",
            "The theists can just rely on their faith and commit. That's all their God asks of them so proceedbyball means. No one should stop them from exercising their beliefs.",
            "Do they get any virgins for dying while on Haj?",
            "If folks are willing to blow themselves up for it, do you think more people will flock here to die and get a free ticket to their heaven?",
            "Now I'm thinking about not going.",
            "God’s anger, as they say.",
            "Dis they not believe hard enough?",
            "👍",
            "There are about 2 000 000 pilgrimers of primerily older people, 70-80 year old not being uncommon. I would be surprised not to have close to 1000 deaths over the 2-4 week they stay there. On top of the old age, the heat and stress of the event will also add up.",
            "If only there was a higher power who could intervene...",
            "Morons",
            "I happened upon a YouTube video that explained Hajj, and even described without commentary it is absolutely ridiculous, combining multiple superstitions that predate Islam and other religions by hundreds if not thousands of years, the origins of which are mostly unknown. \n\nIt was 100% like the Mormon origin story, where a conman (or strongman, take your pick) co-opted Abrahamic beliefs and then added pagan, animist and multi-theist beliefs designed to appeal to everyone and to get them all under the same tent.",
            "Nah didn’t y’all hear? This is  all a democrat hoax! \n/s",
            "A good god might issue a heat warning or close shop at a time like this to save his/her disciples.",
            "Americans and hundreds of Egyptians are among more than 1,000 dead at the annual hajj pilgrimage in Saudi Arabia.⁠\n⁠\nThe death toll is the highest at the hajj since a stampede in 2015 killed more than 2,000 people.⁠\n⁠\nRead more: https://on.wsj.com/3RBHoah",
            "Prolly the few chosen ones their god wanted by its side.",
            "They’re in a better place now. Absolutely anywhere.",
            "Hopefully they’re having a blast exploring new planets created just for them with all the noisy buffets their little hearts desire ❤️",
            "Mysterious ways... 😂😂😂😂",
            "How many people have died in other years? Just for reference",
            "I guess they picked the wrong god…",
            "Funny part is people wishing this was them",
            "Whatever they were praying to are doing it was answered .sad my sympathy to the families.",
            "FTFA:\n\n\n> The national meteorological centre reported a high of 51.8C (125F) this week at the Grand Mosque in Mecca.",
            "Why nobody is talking about it.",
            "It was 57 Celsius in Qatar yesterday. That’s approximately 135 degrees Fahrenheit. Human bodies can’t cool down in that kind of heat.",
            "Feel horrible for saying it, but natural selection manifests itself every single day.",
            "Sounds like genocide. Call the UN.",
            "Allah is having a cookout.",
            "This is honestly a brilliant way for the state to rid itself of weaker citizens and free up resources for more useful ones. I wonder if that's why Mo put it in his cult handbook.",
            "Genocide!",
            "This is as lol-able as it is frightening.",
            "Since the Kingdom funds prayer leaders, none of them will even dare mention the idea that maybe this is divine retribution for profiteering off *the* industry at the heart of greenhouse gas emissions and ongoing climate change.",
            "It’s great when religions have built in population control.",
            "Of course the deaths are actually about official registration of pilgrims, i.e. money and monopoly.",
            "Religion is so fucking wild man.  ",
            "When ideology overrides logic and common sense.",
            "“Okay people, we’re moving this to a different time of year-“ Speaker is shot for blasphemy.",
            "Why do they not just give people water and shade/cooling? Are they stupid?",
            "Skin ☪️ancer",
            "Womp womp.",
            "The Sun god must be battling Allah",
            "It's part of Allah's plan.",
            "I'm an ex Muslim. As far as I know, one of the Muslim's \"biggest dream\" is to die there. It's like a \"golden ticket\" to go to Heaven",
            "Religion is a huge scourge on modern society.",
            "It really is a shame that these zealots will sit there and die in the heat just to go visit a black rock they attributed to their imaginary deity. The amount of times I've heard Muslims say something along the lines of \"my god will protect me and provide me comfort\" only to have the literal opposite thing happen, as they go to appease their god. In other words, Allah isnt even doing the bare minimum when they are simply going to worship him. Common sense and intelligence has flown the coop.",
            "But at least they died doing what they love most: talking to a 6th century, desert warlord, genocidal paedophile. Isn't that the way we all want to go?",
            "Coachella sucks this year",
            "Can they do american Christians next?",
            "Sucks for them, no sweat off my back.  Im enjoying a vodka tonic as I enjoy my life and read this.  For a sane person to do insane things, that takes religion.",
            "Well allah will create 72 x 1000 = 72.000 virgins in after life brothel",
            "Yet it's every Muslim wet dream to complete this requirement!",
            "Terrible disaster.  No more, please",
            "Over a thousand new Darwin Award winners.",
            "Their families should be rejoicing at the will of their god. No sympathy needed.",
            "I doubt American Christians would do anything remotely close to this, unfortunately.",
            "Liie mosquitoes being attracted to a glowing mosquito trap",
            "Come on you guys. Stop mocking them. Don't you know that it was what Allah willed ? 🤡",
            "Considering that there are three million pilgrims, 1000 dying is not that many. Context matters.",
            "Glad to see the top comments are criticizing Islam and religion at large without being weird about it. Too many posts in this sub about Islam end up crossing the line into bigotry, saying things they never would about western (white) Christians.",
            "Poor brainwashed souls. They gave their lives to the brainwashing.",
            "Lol at the scumbags here celebrating the death of these innocent pilgrims from their moral high horse. Fuck outta here.",
            "Oh no, anyways 🤷‍♀️",
            "Too add to this, I bet that SA Muslims think this is good.   Muslim's are insanely tribal and when other groups die for whatever reason, its a reason to rejoice.",
            "Natural selection at it's finest.",
            "Allah rewards those who worship him. \nAllah is Merciful. \nPraise Allah. \\s",
            "where was their god to save them.  Ah yes, he is welcoming them in to afterlife.",
            "Religion kills. So does crack, but at least smoking crack makes more sense than religion.",
            "Are they dumb?",
            "Well, they seem to be improving on things!",
            "Man, that's more than jonestown",
            "This is just sad. These people died for no fucking reason.",
            "Allah's will.",
            "Hajj gets crazy. [Over 2000 people](https://en.m.wikipedia.org/wiki/2015_Mina_stampede) died in one crowd crush alone in 2015.",
            "Heaven running outta virgins?",
            "God makes clothes?",
            "Sun God is merciful. It could have been worse.",
            "👍",
            "Let em die off, with all we know now if they want to force themselves into submission to nonsense fuck em",
            "Stupid mfs",
            "I wish every religion had something like this.",
            "God's yearly marketing campaign is not working out so well.",
            "🤷‍♂️",
            "How many die in an average year?",
            "Natural selection at this point.",
            "Darwin awards for everyone!",
            "So? They knew the risks. Took them. Lost.",
            "Bet none of them will take this as a sign not to worship there…",
            "Mashallah",
            "God is committing a genocide on Muslims!",
            "Where's your god when you need him?",
            "*It was God's will*\n\nbut, but, but... a small child survived.\n\n*Oh Allah the merciful, you are the most humble and loving. Only you could provide this miracle.*",
            "It’s gods will n all that.  It’s a test.",
            "Allah taking them straight to paradise.",
            "People from poor countries actually paid for this privilege",
            "Suicide.",
            "Natural selection",
            "The reason these people are dead is because they're stupid\n Darwin won AGAIN.",
            "\"So how'd you get here\"\n\n\"I died walking in circles around a box to make God happy\"\n\n\"...ok...\"",
            "The definition of a completely senseless and unnecessary death. Go ahead guys, Allah is great.",
            "I am an atheist, obviously. But if I WAS going to practice a religion I would choose one that required me to take a pilgrimage to a nice temparate climate.",
            "Isn’t Allah will after all ?",
            "All part of gods plan",
            "And this pleases allah?",
            "You forgot to put that last paragraph in small print.",
            "Unfortunately all this verse means is that the canon explanation for these deaths is probably that the people that died deserved it. God has the power to protect them, and killed them instead. The suffering of their families is deemed acceptable. Even if they want to say that their god took them to heaven, it's like, ok; this is a death cult.",
            "all about that sweet sweet submission.",
            "That is absolutely hilarious. Haha.",
            "> offer void in Utah\n\n💀💀💀",
            "\n[\"Checks will not be honored.\"](https://i.redd.it/sblx6amc2z1z.jpg)",
            "I’m reading this in the micro machines guys voice ",
            "He’s taking credit for clothes and armor? It’s not like we’re born with them. \n\nAnd where is my armor?",
            "When you complain to gord in heaven, he looks up at you scornfully, from his sewing machine. \n\n\n\"Son of a bitch. Look! Look at the fine print in the biblay! I specifically said 'no guarantee I will protect you!' Fuck your ass! Son of a bitch!\"",
            "*virgins ethically sourced from 4chan",
            "*** and please use common sense. I gave you intelligence hoping you could manage some of these things for yourselves.",
            "\"Ask your parent or guardian before logging online.\"",
            "Offer void in Utah 🤣🤣",
            "Tbf Mecca isn't in the mountains iirc.",
            "Apparently, to die at this pilgrimage is considered a blessing, so this may get absolutely worse",
            "I love how instead of just making them able to withstand these things, god had to take credit for the creations of man. As if it was by their grace and not mans suffering that clothing was made.",
            "Now read all that in 2 seconds",
            "“Offer void in Utah and everywhere that is hot &  cold “ FTFY",
            "I consider it a virus because of its method of replication. It converts a host and the host makes more of them. Hmmm",
            "This one is skin cancer.",
            "I've considered it a mental illness for a while now and feel it should be treated as such.",
            "A plague upon humanity!",
            "At least this cancer is destroying itself.",
            "Too slow for my taste",
            "I’m torn. My brain flip flops. I finally purged all the religion from my system and love life way more because of that. And i despise religious hypocrisy and idiocy. But also I look at the mass public, the ignorant, the innocent, and wonder if religion is the only thing that keeps these people from going  completely wild in society? They say it’s the opiate of the masses, but is it also the only thing that keeps mentally ill society from running rampant? It’s pretty clear these days (at least in the US) that morons who only have the Jesus myth to fall back on, rarely have anything else that guides their moral or civil behavior.",
            "Terminal if you’re muslim apparently.",
            "Ever notice on reddit that when it is Christianity that is the subject of scrutiny, it's called out by name,  but when it's Islam, religion as a whole is called out?",
            "They obviously didn’t believe enough!!\n\n/s",
            "Mental illness. But close.",
            "The one positive here, is that in order to continue their mandatory pilgrimages, they might start caring about climate change!",
            "Guys! He said the thing! Let’s throw upvotes at him!",
            "I wonder why religion teaches people that believing in something without evidence is a virtue? There must be some purpose if only there was some way to divine what it is... Pun intended.",
            "Humans* are often a cancer would be more correct. I mean at least half the reason these people are over heating is because our actions (religious and not) are overheating the planet. Religion is often* a cancer would be more correct too. To say religion is a cancer is to disregard the myriad of ways it has carried the human race, human cultures, altruistic behavior, good principles, among other. But yea it is often a cancer I’ll give you that. ",
            "From what I read, the Saudi's set up a perfectly reasonable accommodation for the pilgrims and the people dying are the ones who chose to ignore it and do it their way.",
            "I always thought we would evolve out of religion, I guess not.",
            "Some people need a religion and I'm terrified of a world where they don't have access to one",
            "Is this religion tho? Or just heat killing people at a culturally significant event?",
            "Worse",
            "Sometimes, it's heat stroke.",
            "The real universe is far more awe-inspiring, humbling, and miraculous than any form of ignorant superstitious nonsense.",
            "If anything, those Marvel movies nail it with regards to God's. \n\nThat last Thor :thundershicken movie...  right from the beginning. Theists want to believe, in a maltheist is just a thiest. \n\nGod(s) don't care. Cause they don't exist.",
            "I mean, it would make sense if they were worshiping the sun lol",
            "Allah isn't there, but Darwin is all over it.",
            "[removed]",
            "😂 Darwin awards all around",
            "It’s God’s will that they die trying to worship him /s",
            "Doing the Lord's work.",
            "Bad idea even if god were real. \n\n“It was a test. And you failed.”\n-god",
            "Think science won that one.",
            "Even if the god wasn’t non-existent I think he’d understand if you just stayed home and worshipped him rather than risk life lol ",
            "Reported a high of 125F. That makes Arizona look cold!",
            "Meh.",
            "If they're lucky, they might have a heat-induced vision before they pass out from the heat. Did you ever see that one episode of ST:TNG?",
            "At least places like the Pamir mountains or Mount Sinai look impressive.\n\nMecca is just a cube with some high rises and desert around you.",
            "Hey, you can't invent natural selection.",
            "https://www.youtube.com/watch?v=RQMoaoiT_es",
            "It's a better idea if you do believe that God does exist though.",
            "It was like a buffet for Allah, all of them right there in one place. It made it easy to take as many as he needed.",
            "There is nothing that has happened that Allah has not willed  \n  \n/s",
            "Allah knows best ☝️",
            "That's the saddest part. People are happy this happens. Like the suicide bombers that are giddy with excitement when they get to be next.",
            "Well said",
            "No, I wouldn't blame ***everything*** upon them.  In fact, I just think they're just the most useful tools (read \"fools\") in the collective toolboxes of the uber-aggressive power-hungry control-freaks who have no morals, and thus no qualms about manipulating these shallow-minded idiots into doing self-destructive things that ultimately benefit the string-pullers.",
            "Oh, dear! Anyways ...",
            "Even a monkey finds shade when it gets hot.",
            "They put the \"win\" in \"Darwin\"",
            "Meh, technically Darwin only applies when offspring didn't get a chance to exist or reach adulthood. It's mostly old people who die from heat exhaustion, so no life-threatening impact on the children of the dead.",
            "Is climate change the change we need to rid us of religious zealots?",
            "\"Religion - raising new entries to Darwin Awards since the dawn of time.\"",
            "Again? Virgins?",
            "akshually, the word virgin was a mis-translation of the word for raisin. These mofos killing themselves for a handful of dried grapes XD",
            "We’ll just end up with heat resistant Muslims.",
            "Climate change in effect.",
            "It's those *without* the Hajj visa that are the ones dying - they didn't pay the extra \"survival\" charge that gets those that *do* pay it some nice air-conditioned hospitality.  The Kingdom wins by not only selling the destructive resource, but also selling the means to escape its effects while doing the required pilgrimage.",
            "I wholeheartedly second this motion!",
            "New genuine Ark experience!\n\n(Sponsored by OceanGate)",
            "Yeah lets just call for all religious people to go kill themselves. What a truly wonderful idea...",
            "Not all are problematic.",
            "Well the problem is also that stupid is relative and can be worth pursuing even when so.\n\n\n\nLike If your parents or env think it's stupid to pursue some passion of yours, art, dance, knowledge, etc.",
            "On second thought, let’s not go.  Tis a silly place.",
            "Coffee is for closers and also haram",
            "There's always next year!",
            "You can do it guys!!",
            "Muslims have to prayers by certain times. \nIt’s quite stupid to do 5 prayers every day. \nThat’s like calling your wife and telling her how hot she is 5X per day.,",
            "Capitalism, ***FUCK YEAH!!!***  (/s)",
            "Compared to the Hell on Earth they just went through, \"Paradise\" isn't a terribly high bar to clear.",
            "Actually, they basically do.  They have a regular visa to allow foreigners to enter the country, and a more expensive \"Hajj\" visa that gets worshippers air-conditioned accommodations, among other benefits.  Many poor Muslims can't afford that one of course, but stories like this ensure decent sales of it no matter how high the price.",
            "Of course they do, you purchase packages that comes with different facilities. You assume the VIPs are in same class as the farmer from some rural area who saved all his life to perform Hajj?",
            "Should've prayed a 6th time that day",
            "*Stargate* (the TV series) taught me that pretty much *every* \"god\" does.",
            "Yup.  Really hoped after the first 500 people died, there would be an end.",
            "That's \"God love\" for you.",
            "Many people have no choice - they were raised to be stupid.  Just look at what right-wing lawmakers do to education budgets and rules for proof.  Let's spend taxpayer money requiring large posters of the Ten Commandments in every classroom rather than updated science texts, amirite?",
            "“They weren’t true believers.”",
            "Allah never burdens you with more than you can carry 😵",
            "Religion",
            "tbf, in Islam it is stated that you may only hajj if you have the financial means. These are more fanatical than regular muslim.",
            "The thing is that, you are not actually required to go to hajj if you dont have the financial means. These guys did not, but still went. They are more moronic, and fanatical than a regular muslim",
            "Nope",
            "Seek help",
            "Maybe it’s not a the most productive to celebrate the death of innocent people, even if they got backwards views",
            "EXACTLY!",
            "Their cult mentality is what encouraged them to stay out in the sun and not drink water tho?",
            "They weren't, but their devotion made them go anyway.  Those with visas had access to air-conditioned accommodations, these poor souls didn't.",
            "Thank you. All the insensitive and ignorant comments are gross",
            "What would you like them to say?",
            "Literally!",
            "Yeah. That's what's frightening...",
            "When it's that hot and people are exposed to the sun/outdoor conditions, there is no amount of shade or cooling that will stop heat stroke.",
            "Blah blah Allah something something",
            "mmmm no restrictions on alcohol consumption is the best-est",
            "No more deaths at the hajj?  Tell them to go home",
            "If it wasnt \"that many\" news outlets wouldnt be reporting on it",
            "There is less deaths at God damn drug riddled tomorrowland, put that into context \n1000 dying out of 3m is ALOT",
            "> Too many posts in this sub about Islam end up crossing the line into bigotry, saying things they never would about western (white) Christians.\n\nSuch as?",
            "Reddit should have a default “cattle auctioneer speed read” text style option",
            "^^^**Offer ^^^not ^^^guaranteed, ^^^protection ^^^not ^^^to ^^^be ^^^taken ^^^literally, ^^^all ^^^rights ^^^reserved, ^^^side ^^^effects ^^^may ^^^include ^^^death, ^^^heat ^^^stroke, ^^^dehydration, ^^^dizziness, ^^^dry ^^^mouth, ^^^not ^^^FDIC ^^^insured, ^^^may ^^^result ^^^in ^^^loss ^^^of ^^^principal, ^^^offer ^^^void ^^^in ^^^Utah, ^^^some ^^^restrictions ^^^may ^^^apply, ^^^consult ^^^your ^^^doctor ^^^before ^^^beginning ^^^any ^^^new ^^^religious ^^^pilgrimages.",
            "^(Offer not guaranteed, protection not to be taken literally, all rights reserved, side effects may include death, heat stroke, dehydration, dizziness, dry mouth, not FDIC insured, may result in loss of principal, offer void in Utah, some restrictions may apply, consult your doctor before beginning any new religious pilgrimages.)",
            "In Allah we trust, all others pay cash!",
            "[If scatman can do it, so can you.](https://youtu.be/Hy8kmNEo1i8?si=0kbIlF8OjqtfEvGB)",
            "\"Where is my water buffalo? Why don't I have a water buffalo?\"",
            "You didn’t get any? \n\nI came out my mom swinging a claymore.",
            "And they are not quite an inanimate object but not really fully alive either. \n\n\nImagine living like nothing matters because this is just the tutorial. ",
            "It is literally a meme based on the original definition of meme by Dawkins",
            "A bit like mind rabies, then. Or just outright zombism.",
            "It's kind of like an oncogenic virus, so you're both right.\n\nStuff like HPV will force an infected cell to divide in order to make more copies of itself, if only because the virus \"needs\" that set of cellular machinery to be active in order for the virus to replicate. This makes more virus, but it also causes dysregulated cell division which is bad.",
            "Contagious mental illness. That's terrifying.",
            "Religion is a software virus that infects the human brain.",
            "Also, if God was real he'd be like a computer virus breaking coding to perform miracles unexplained by natural law. A bug to be weeded out.",
            "Its genuinely interesting to think about it this way. Theres a process of natural selection in play for sure. Part of why Buddhism is so much less successful than other major world religions. Is because it puts no major emphasis on having lots of kids and converting people. Christianity and Islam are the most successful because they are the best at replicating. Not because they offer anything better or more true.",
            "Luckily I was vaccinated by Carl Sagan when I was young.",
            "Successful parasites don't kill their hosts.  Whoopsie.",
            "Sounds like a multi-level marketing scheme.",
            "I’d prefer not to be collateral damage",
            "You don’t have to be mentally ill to be religious. It’s all about your upbringing and how you were raised, if you were indoctrinated into a theology or not",
            "Their own family might kill them if they found out they are atheist. Surely some must be atheist.",
            "Life is terminal, don’t waste it on nonsense!",
            "That’s an interesting and totally unscientific anecdote. I’m for equal opportunity. So to clarify my statement, all religion is cancer.",
            "Thanks, I really needed them.",
            "It helps average people with little feeling of self fulfillment to elevate themselves above the hoi polloi. By subscribing to this club I become superior to anyone not in my club.",
            "Behaving a certain way because otherwise sky daddy will punish you is no real instilling of altruism or principle. Religion is an expression of control by people who have none and deserve none. Control the woman, the kids, those damn gays that make your boner happen when you think about them. God is love and if you don’t agree we’ll behave violently! Idiots.",
            "No, some people need community and mental health care. Religion is a problem not a solution. Lying to yourself and living in a fairytale won’t really help anyone.",
            "Religion is culture the same way brands show up for the pride parade. They’re just there for the money.",
            "Very well said. It boggles my mind how people sacrifice the one life they have at the alter of superstition instead of trying to understand and appreciate the real world around us.",
            "This is more or less how I respond to the question when it gets asked. When you bow your head to pray to God you close your eyes to the true beauty of the infinite universe.",
            "If god is real and he created the universe then why do people worship at man made structures at institutions ran by people? Shouldn’t they be worshipping nature or in nature at least?",
            "Except for the guy with an elephant face and 8 arms.  That guy is pretty sweet",
            "I would argue many religions view the universe as God.",
            "Always thought the same, at least you know it exists and all life on earth is dependent on it.",
            "Haha. Lets bring back worship of the one true God, Ra.",
            "Pro: Actually exists\n\nCon: Can actually kill you when angered",
            "In action",
            "wut",
            "\"Oh, I know I shouldn't...  ok, maybe one more.\"  -Allah probably",
            "Also they were nice and warm from the heat lamp provided by the holy one, blessed be He.",
            "And come pre-cooked both mentally and physically!",
            "Gotta stock up on all of those virgins they promised everyone in the afterlife",
            "They stay virgins no matter how much sex you do to them\n\nClassy",
            "Are we talking 72 grapes, or a grape of 72 Raisin? Asking for a friend.",
            "Love it!",
            "Believe it or not \nSmoking is haram",
            "sounds almost as if it's about indoctrination and control, rather than the truth...",
            "However that's probably not a bad strategy with your wife though.",
            "them damn electric cars are really hitting their oil revenues",
            "The God is different, the grift is the same",
            "thank \"god\" the buddha wasn't supernatural but was just a flesh and blood human, phew",
            "Never underestimate the lengths that the desire to be seen as \"holy\" by their peers will drive people to. If the people around you see you as such, then surely God ***must*** also see you that way, amirite?!?  🙄",
            "KSA has an incentive to under report. Screwups make the royal family look incompetent, and that is not a good look when there are others around that would gladly take charge.",
            "I'm not really sure why everyone's upset. \n\n\n\nPeople die. \n\n\n\nThey chose their adventure of their lifetime. And committed to it till death. \n\n\n\n\n\nIt's be like people hoping and choosing to not reproduce because most important stuff we interact with are wispy constructs.",
            "Why? Let the idiots self select.",
            "Why didn't they anticipate high temps and stop pilgrims from entering? Give them relief and temporary accommodation? This is just cruel.",
            "Even assuming that nurture is the primary influence, they were raised to be Stupid by people who are already Stupid that should have been culled by The Law. Their lines should have been culled centuries before. See how that works? Not to mention that fact that if they're too dim to see beyond their imbecile parents and culture, the end is the same. They'll end up being the lowest common denominator in any culture.",
            "If only you had to pass a \"free will\" test before people were allowed to vote",
            "Alternatively: they're the only ones who ***were,*** which is why they \"ascended.\"",
            "Nah. Think of it as evolution in action",
            "Why do you assume that these people are innocent? \n\nThey’re clearly so fanatical that they put themselves in this situation to begin with. That doesn’t sound like the actions of an innocent person.",
            "Just report and move on, they'll get permabanned soon.",
            "If they have backwards and destructive views, they're not innocent",
            "I'm actually pretty shocked to see this here, it's literally \"Death to the non-believers\" with the non taken out. You'd think by abandoning religious zeal people would have become less extremist but looks like we now have atheists that want all theists dead?",
            "That's the thing I'm confused by, why did Saudi Arabia let them in?",
            "Exact numbers of people who died.\n\nReasons for their death.\n\nWhy no precautions were taken.\n\nWhy newspaper, media not talking about it.",
            "If it bleeds it leads.",
            "You do it with the hat symbol ^\n\n^^like ^^this\n\nThe only issue is that as far as I know you need it in front of all words",
            "Because Allah can't afford a longer ad spot to fit it all in at a regular speed",
            "SMALLER!",
            "[I will never not think of this video when I hear that song.](https://youtube.com/shorts/mCUFwIhPdUA?si=Mi6NIaNKmhGiuEzh)",
            "Self-cesarean.\n\nNice.",
            "The guy from that Islamic cross-post said it clearly, Dunya is World in Arabic.\n\nThis World is NOTHING \n\nThey couldn't care less for this world, its future and even the the improvement of their own lives and well-being. Because to them suffering in Life 1 unlocks Life 2 and Jannah (Heaven) which is all that matters to them.\n\nThey'd sacrifice everything for a promise.",
            "You're an inanimate fucking object!",
            "It's \"the game\" (which we all just lost), but not with the winning condition \"do not think about the game\" and instead the winning condition \"think about the game all the time\".",
            "The Rabid Rabbis sounds like a great band name",
            "When I was much younger I had a recurring dream that zombies were coming out of the shag carpet at the church and trying to eat me (never seen a zombie movie at the age). My brain was just able to process it and tell me to nope the fuck out at the age of four. ",
            "\"The demon-haunted world\"",
            "*Ophiocordyceps unilateralis has entered the chat*",
            "Very true. It’s hard to shake especially if your parents raised you to base reality on it.",
            "It’s opt-in mental illness. You make a commitment to lie to yourself every day, and to vehemently defend your lies to anyone who will listen. And if they ridicule you for it, it’s because you’re a tool of evil!",
            "I become more than human!   \nI will be immortal, never cold, hot, lonely, scared, tired....   \n\n\nIt certainly doesn't lack for claims.",
            "\"The abolition of religion as the illusory happiness of the people is the demand for their real happiness. To call on them to give up their illusions about their condition is to call on them to give up a condition that requires illusions.\" - That Commie Guy",
            "Reminds me of John Denver. Even today, Christians keep assuming he was one of them because he mentions god in some of his songs. But it's well documented through numerous interviews that he was an atheist through and through. And that when he mentions \"god\" (like in, say, Rocky Mountain High*), he's talking about the wonder and beauty of nature all around him and the awe and humility it inspires. \n\n*That song was all about a Perseid meteor shower he and friends witnessed from a Colorado mountain way above the tree line. So, even when he's talking about being \"high\", he means it literally, not as an allusion to drugs. 8)",
            "The oldest religion known to man...worshipping Nature, the Sun, Moon, and stars. You know, the Universe.",
            "And grants prayers for peanuts! 8)\n\nIt's still woo woo though -- aka ignorant superstitious nonsense.",
            "Except that the universe is not sentient, conscious, nor aware. It does not guide us or give our lives meaning...any more than a rock does. It is merely a stage that we are self-aware enough to perceive.",
            "There's some archaea at thermal vents that might not have ever depended on it. Most life though, yes.",
            "If God exists,  his morals are too low to worship: https://groups.google.com/g/net.religion/c/Huxl-JwCozs/m/vQyiydJfkjAJ?pli=1",
            "so they just have really durable hymen or do they reset?",
            "When I was a Christian growing up everyone I knew fantasized about being a martyr for Christianity. It was this disturbing trend where people dreamed of losing their life for Christ.",
            "It's like keeping up with the holy Jones's.",
            "IMHO, you're just making a case for your own \"culling.\"",
            "Categorically a mephistophelean statement and you should honestly reevaluate your morality if you genuinely think this opinion makes you in anyway a good person",
            "\"Guilty until proven innocent\" is a destructively cynical POV.  Just look at Gaza for example: a large number of Palestinians did ***not*** support Hamas before they attacked, but Netanyahu treated them all the same (much like you just did Muslims) and now I'll wager the support for Hamas has skyrocketed.  It's a self-fulfilling cycle of hatred and distrust. \n\nMany Muslims are perfectly peaceful people, just like many Christians or Jews are not bloodthirsty control-freak assholes.  How about following The Golden Rule, and give the benefit of the doubt until proven otherwise?",
            "I'm not knowledgeable on SA's security precautions, but I think illegal immigration is certainly a common enough issue - although in this case it's more a temporary migration.",
            "I don’t think SA would have much of an issue with illegal immigrants coming in, I mean why would you choose SA as your safe haven 😳\nSo the authorities probably don’t worry too much",
            "Okay, well it is noteably more than in other years, but okay.",
            "Which is why most muslims could not give two fucks about the environment down here in audition world.",
            "same for Christians. Had a boss tell me he was 'living for eternity'",
            "Yup. I grew up believing exactly that. We were taught that the world matters less than a grain of sand and that the eternal life is all that matters. I guess for people who believe that there is an eternal life 2.0 after they die, it makes sense to not care about this world.",
            "Can't entirely blame them considering how hard life in this world is - *of course* they're looking for a better one.",
            "YOU RETRACT THAT BIT ABOUT MY CUNT FUCKING KIDS",
            "Yeah. Something my SO and I talk about pretty much every day (she’s a social worker) is how your entire persona and life are dependent on your parents (or lack thereof) and how you were raised. It’s actually kind of insane.",
            "Yup. It seems to be a religious tradition to co-opt anything good and disavow anything bad. I often heard from Muslims how Islam invented washing hands, telling the truth, caring about people, not committing war crimes, and being a good person in general. That is why they claim all the old prophets from the bible stories like Adam, Noah, Moses etc were all actually muslims because they did good things. Religious people in generally don't seem to understand that people can be good without believing in their fairy tales.",
            "the Animists are the closest religion that matches modern science. Every living thing is connected. DNA proves they are correct. Worshiping ancestors, their successful  struggles and journey through life is why you are here today, again, correct. No need for a sky daddy",
            "If God is real I would be gob smacked if he gave 2 shits about us or Earth. The universe is infinitely large, to think a deity capable of creating all of this and still care on a personal level for each and every human is the height of hubris. We're a spec of dust in the grand scheme of the cosmos.\n\nEarth could explode today and nothing would change for 99.9999999999999...99999% of the universe",
            "Finally, the hard question was asked.",
            "They've got regenerating hymens.\nHouris are pretty much magical woman shaped sex toys.\n\n(Note: Created in heaven, they're not former people as is often assumed.)",
            "we should help those people.\n\ncan we come up with some hajj like activity for christians?",
            "You’re comparison is not a good one. Every single person who died on Haaj chose to be there. Any one of them could have turned around or sought shelter as soon as they felt how hot it was. Everyone of them chose to be there",
            "It’s not peaceful to prop up, legitimatize, or continue oppressive systems. \n\nThe ‘Good Germans’ who looked the other way if the face of atrocities were not innocent nor are the people you are talking about. \n\nMany of these people are so fundamentalist that they are literally the laws trying to limit the number of people there so they can walk 10 miles, climb a mountain, then stand outside and pray for hours. That is not the behavior of an innocent or even someone looking the other way. That is the behavior of an extremist.",
            "Well you're guilty of being a dumbass because you're yet to prove your innocence so... \"Many x are perfectly peaceful\" and they're still religious psychos even if peaceful. No amount of peace towards me excuses their complacency with the actions of their fellow cultists that aren't peaceful.",
            "A quick Google suggests that non-Hajj visas are also issued during this time, which to me sounds like it's just asking to be abused.",
            "Normally you would be right, but some quick research says that many people choose cheaper non-Hajj SA visas then try and go on the Hajj anyway. On the one hand, they're idiots, on the other KSA are at fault for issuing the damn things in the first place.",
            "That is why they all fail",
            "Lol. The Bible literally burdens humanity with the responsibility to care for the world. What a terrible “christian.”",
            "I had a former co-worker tell me \"it's a privilege to suffer like a fucking dog,\" as it brings you closer to \"god\".\n\nHe got pissed when I called him a masochist & a waste of oxygen.",
            "Ironically the religion promising this is what makes life shit for them. ",
            ">  Islam invented washing hands\n\nExcept the Arabs didn't do that. Because they didn't have ready access to water, they only used their right hand because the left one was used to wipe their ass. It's why they call the left one the \"dirty hand\". This still remains the case in many Muslim enclaves some 1,400 years after Muhammad lied about Allah.",
            "A news story came out a while ago regarding The Quran they had. They ran a carbon dating on said book. Turns out The Quran is 200 years older than Muhammad! That Story Disappeared ASAP!!! Another Fairytale guarded over truth! I'm sure the Death Threats came in by the thousands.........",
            "They more like were worshipping the things they didn’t understand, and though it must be magic/divine, not because they had a soo deep connection to the universe/earth/nature.",
            "Look at it like this. Do you care about every creature you see? The millions of ants near your house? Do you think about the lives and drama of the creatures you don't? Let's just limit it to humans you meet every day. Let's say you did. How exhausting would that be? If a God exists best thing they did is leave us to our own devices. Maybe nudge here and there but mostly just leave alone.",
            "According to Islam, all women are sex toys.\n\nThey have to stay in a mobile tent and live inside a enclosed room and even cover their eyes so that men do not bust",
            "Pilgrimage is pilgrimage. The big 3 for Christians are Rome to Jerusalem, Canterbury to Rome, and the Camino de Santiago.",
            "Walk through Death Valley. The valley of the shadow of Death. 🤔",
            "Please. Christians don't *read* their bibles.\n\nAnd statistics prove doing so seems to frequently create more atheists.",
            "frankly he was just a terrible person but yea",
            "Nah, it's just an excuse - human are too often shitty to other humans.  If it ain't religion that works as the convenient excuse, then they'll find another - e.g. race, nationality, size, etc.  Humans are deep down insecure AF, and they constantly compensate by dumping on others for whatever \"reason\" they can come up with.",
            "To be \"adroit\" ( a droit-to the right) is good, but if you're sinister (sinistra-to the left) you're bad!",
            "There's an interesting documentary on YouTube about the origins of Islam and whether or not it predates Mohammad. The title escapes me at the moment, but it was very good.",
            "I'd rather just do the crawl from Caesars to the Venetian",
            "That certainly was a major factor with this atheist!",
            "Exactly, but also, it doesn’t matter if religious people read the texts or not. It’s how they choose to express their faith in the world, and how that affects other people. Historically, murder and subjugation in the name of a god’s love.",
            "Oh, they read them. They make a whole big production about reading them, bit by bit, every week in church and bible study.\n\nWhat they don't do is *think* about what they're reading beyond what they've been told to.",
            "> they'll find another - e.g. race, nationality, size, etc.\n\nAnd there's a lot of overlap between religious bigotry and the other things you mentioned (thinking along the lines of Southerners justifying slavery and racism through the lens of religion, or people believing America is favored by god and other countries are just godless hellholes, no pun intended).",
            "Don't all the abrahamic religions have their origins in polytheism tho?",
            "> Oh, they read them. They make a whole big production about reading them, bit by bit, every week in church and bible study.\n\nI'm not convinced they do. They get told to read a thing, and so they've read the message saying to read a thing... the message says *why* they should read the thing, and that's good enough for them.\n\n> What they don't do is think about what they're reading beyond what they've been told to.\n\nAnd thus is the difference between ignorance and understanding.",
            "Not really. The earliest stories in the Torah are all centered around a single God figure. Even when you get to Abraham himself, who was Mesopotamian, there is no mention at all of his past beliefs, if any. One could infer that he was a polytheist before his encounter with Yahweh, but there is no textual evidence to support the supposition. Christianity branched directly off of Judaism, which was wholly monotheistic by that point. Really, Islam is the only one that you can make a supportable argument for.",
            "judaism didn't originate until around 500 bce though.  Before then the semitic religions were very polytheistic, including ishtaar inanna yamm just to name a few."
        ]
    },
    "What a pathetic excuse of a country": {
        "title": "What a pathetic excuse of a country",
        "score": 899,
        "url": "https://www.reddit.com/r/atheism/comments/1dlgpn6/what_a_pathetic_excuse_of_a_country/",
        "content": "Recently a mob cheerfully lynched a man then set his body on fire in Pakistan for \"blasphemy\". It's not the first time an incident like this has occurred over there and it certainly won't be the last. The man they murdered was no minority either - he was a sunni muslim.\n\nYet somehow the guy who wanted to set up a gay bar there is declared mentally ill and sent to an asylum. The entire thought process is dysfunctional.\n\nReminder that Pakistan is the only country in the world created solely on the basis of religion.\n\nEdit: Ok it seems they may not be the first to do it but they're definitely the largest in the world, with more than 230 million people.",
        "num_comments": 144,
        "comments": [
            "Isn't Pakistan the place where inbreeding is promoted, too?",
            "Religion is like poison, or cancer to a society.",
            "When you take your religion and put it over life, can you really call it a religion?",
            "Pakistan's Indus River, which is fed from Himalayan glaciers, will run dry in a few decades. (Same is true for 11 other rivers that come from Himalaya ice melt). (Pakistan is also hotter climate than Iran. ) Gonna be a lot of thirsty people there. Meantime, not a safe place to visit.",
            "One of the first countries to die *en masse* due to climate change, not that that's any solace. Allah won't save Pakistan from the wet bulb globe temperatures, or from decline of the glaciers that once fed the Indus. The brightest/best educated know.",
            "And pathetic excuse for a religion as well.",
            "And we'll find out (as we always do) that this was actually revenge for some personal affront or slight and had nothing to do with Quranic nonsense.",
            "I honestly feel bad many of it's citizens. There are plenty of perfectly reasonable people living in the country who have to live in constant fear if there government murdering them of their family on some bogus \"blasphemy\" charge. In a country of over 200 million people, not everyone is going to be so blind to their governments wrong doings. Let's wish for the best for all the Pakistani people.",
            "Unfortunately if the christian riech gets there way in the USA, we can probably call our selfs the christian Pakistan.",
            "The christians claim the USA was created the same way. VOTE AGAINST THE FUCKING REPUBLICANS, forget any antipathy you may have against voting. This year you must vote. It is not hyperbole to talk about the 2024 danger. The Apostle Mike Johnson will destroy us all",
            "Get ready because this is coming to America soon with all the braindead religious zealots getting their way lately.",
            "When you are raised in poverty, sent to religious school only to learn the Koran through parrot mantra until indoctrinated. Never travel, never leave your region and times this by millions of people in rural and regional areas, you then get a significant %  of your population that are very ignorant of life and the world around them and easily manipulated into group violence. Not all of Pakistan is like this, with very moderate and well educated society, but a significant portion is ultra religious and poorly educated.",
            "Afghanistan leads the line for most pathetic example of a country. The current government is running it into the ground,  and when one faction takes over, all ethnic groups are fighting each other. No wonder the British Empire gave it up way before most colonies sought independence from the oppressors.",
            "Isn’t that what we want in America? The state being controlled by the church?",
            "So happy they have nukes",
            "Backward country",
            "I'm ready to pay the piper when I say this but, history repeats itself. \n\nThis is just another day for them, they live in an entirely different realm of existence from us and now that even the starving children across the world have wifi and Google and they can see better than anyone why religion needs to die with this older generation.  It's going to take years before the last of the churches are turned into museums just they did with the world war 2 camps in Germany but this time.....on every single street corner and then one by one even the pretty ones will be assimilated into parking lots.",
            "Jan 6th",
            "Religion is the Number One cause of War, in the world's history. It is also the Number One cause of murders and death in history.",
            "USA has a political party trying to copy that",
            "Its built on stolen land, commits ethnic cleansing and genocide, is racist and sexist and homophobic, and is the worst country to regularly serve on the UNHRC",
            ">Reminder that Pakistan is the only country in the world created solely on the basis of religion.\n\nThe Vatican?",
            "Some religions are just more primitive, backwards and aggresive than others, one religion is the worst.",
            "Cultures a bitch.",
            "Pakistanis are like Indians but muslims who take the religion more seriously than the country where it was founded in Saudi Arabia.",
            "And who gave these people the authority to judge and condemn? Allah? No, they are delusional and have committed murder so they better not condemn murderers of any kind for they are exactly like them",
            "What did he do that’s so blasphemous? Do you have some references?",
            "What about Iran? It's a theocracy.",
            "In India, it's common for widows to be forced to marry men who douse them with oil and set them on fire so the new husband, flush with inherited wealth from his recently deceased wife, can now buy himself a younger, prettier wife. India has one of the highest rates of death of women from cooking fires.",
            "I call people like that low IQ tribalistic monkey brains because their small brains never evolved into higher states of the mind. Empathy, compassion, and love.",
            "It is not that one country is worse than another, its religion itself. There are Christians that would burn people and have for less. All religions have fanatics. You cannot point a finger at one and say they are bad.",
            "Notice how most former British colonies have some form of religious extremism",
            "Coming soon to a red state near you..",
            "ignorance and violence.   pakistan is ignorance and violence.",
            "They're so weak and fragile. Their feelings get hurt too easily and then they resort to violence.",
            "If Project 2025 and the rest of the christofascist agenda gets implemented, the US will be on their way to this as well!",
            "Islam is the greatest danger to modern society",
            "I thought you mean the mob in Reddit. And I thought these mob is getting out of hand but I am not too surprised.",
            "What a pathetic excuse of a ~~country~~ species",
            "These are the real enemies of civilization. Not the Pakistan people in general, but Islam.\n\nThis shit doesn't happen only in Pakistan. Islam will be a tragedy everywhere it is law, at least.\n\nIf, as the muslim \"moderates\" so stupidly assert, it's only a matter of interpretation, I dare say; let's gather them all in one place, and have a more than honest discussion about what the real islam is, or is not, and make sure we extirpate the evil in it.\n\nI've read the whole thing, including the hadidth. There's no way this religion is compatible with this cosmos.",
            ">Reminder that Pakistan is the only country in the world created solely on the basis of religion.\n\n>Edit: Ok it seems they may not be the first to do it but they're definitely the largest in the world, with more than 230 million people.\n\nI think important to remember Pakistan was created, at least in part, due to the underlying ethnic tensions in India. Given the ongoing[ Hindu Nationalist](https://en.wikipedia.org/wiki/Hindu_nationalism) movement in India, I'm not sure they're were wrong. There's even an entire genre of songs of dedicated to [bulldozers](https://www.codastory.com/authoritarian-tech/india-bulldozers-muslim-neighborhoods/) due to them being used by the BJP to knock down Muslim houses, and the wiki page notes accounts of [notable violence](https://en.wikipedia.org/wiki/Violence_against_Muslims_in_independent_India#Major_incidents) pretty every other decade since the 60's in India. Of course all the really means is that both Indian and Pakistani religious extremism is horrible.",
            "Surely you could count Israel as created solely by religion?",
            "Is there a country anywhere in the world, that does not have a significant number of ex pat Pakistanis. \n\nThe country is an utter shithole, where the population are desperate to leave said shithole. Though often bring some of their barbaric backward customs with them.",
            "L community",
            "America did that with Blacks in the early 20th century.",
            "And Israel, but yeah it’s what god wants for the devoted to kill in his name.",
            "well islam is satanic, what do you expect",
            "Are you forgetting Israel lol",
            "Everyone on here was cheering the deaths of those ppl that died of heat stroke on pilgrimage to Mecca the other day. Atheist are more alike to theists then they would like to admit.",
            "Dangerous mix; religion and inbreeding",
            "[Yeah](https://upload.wikimedia.org/wikipedia/commons/thumb/7/7b/Global_prevalence_of_consanguinity.svg/2560px-Global_prevalence_of_consanguinity.svg.png)",
            "Many cities in the UK who have high rates of Pakistanis have higher rates of congenital defects due to cousins breeding",
            "You mean like... opiates?",
            "Not just to a society. To families too. It recently ripped mine apart",
            "Well said",
            ">can you really call it a religion?\n\nyes, because thats the whole point of religion, **after**life so as long as you are following the rules to go to \"the good afterlife\" you can justify whatever fucked up shit you do.\n\nreligions ARE MADE to be put over life.",
            "Genuinely what is the thought process behind being gleeful over millions of people suffering or dying? We had floods last year that displayed millions of people. All due to climate change, which America and parts of Europe contribute the most to. The richest in America fly their private jets and the poorest in the villages of Pakistan have to flee their homes. What about this is karmic justice to you? What have they done to deserve that? \n\nI know painfully well how fucked up this country is due to religion and the Mullahs capitalizing on it. I am a queer atheist born and raised here. Yes I have feared mobs like these ever since I was old enough to hear of an incident like this. Yet I know of all the activists who risk their lives daily protesting the government that turns a blind eye to this. I know of my professor who had us write an essay about the failings of the blasphemy law last semester. I know of cis and trans women (the most vulnerable people) involved in Aurat March (the local feminist movement here) who dare to stand against the organized religion. \n\nI can give a million examples here. \n\nI just don't get why you think you are superior for having the fucking luck to get born in a country that hasn't suffered political instability for decades. A country that hasn't been involved in the Afghan War, where the US paid Pakistan billions for a decade to train our people in Madrasas to become the anti-Russian force. That's where it all fucking started and that's the Taliban who's hands we've been suffering at for decades now.\n\nI would gladly exchange living here in a heartbeat for a country where I don't have to fear for my life for not believing in a God who would have me stoned to death for loving someone. But I can't. My friends can't. There are millions who can't. Maybe try not to paint everyone in a country of 230 million+ people with the same broad brush?",
            "Try not to say that out loud in Pakistan.",
            "All religions are fake, this is no different from all the women killed in Salem burned alive as witches. So take it easy on Pakistan. America isn’t to far removed.",
            "Vanilla ISIS",
            "Y'all-Qaeda",
            "When I was deployed there, we always looked forward to joint patrols with the ANA (Afghanistan National Army) because they would never bother to show up, so the mission would be canceled",
            "Paved (somebody's lies about) paradise, put up a parking lot.",
            ">Religion is the Number One cause of War, in the world's history.\n\nThat's a difficult case to make. Number one reason to justify war maybe? I understand the sentiment though.\n\n>It is also the Number One cause of murders and death in history.\n\nIt would be hard to establish the facts for murder (especially if we consider the murders in war having already been counted against that)\n\nDeaths. Don't think so. Child mortality has historically been pretty high and has traditionally been caused by poverty, disease and parasites.\n\nThough you could perhaps make the argument that Religion is a disease propagated by parasites that inflicts poverty on humanity. So there is that. 😉",
            "Mosquitos have killed more humans throughout time than cancer, war, famine and disease combined.",
            "A good chunk of Pakistanis originate from India, they left for the newly-formed Islamic country after partition.",
            "The claim was that he destroyed pages of their holy book.",
            "I don't think the people in Iran are nearly as fundamentalist as the regime, especially the younger generation. Pakistan is a whole different genre of insanity.",
            "He said “created”. He’s incorrect anyways. Vatican City is a sovereign country.",
            "Shia Islam, as trash as it is, is much, much better than Sunni Islam.",
            "Horrific... Monsters....",
            "Has there ever been an MRI brain study of religious people vs a control group?",
            ">You cannot point a finger at one and say they are bad. \n\n You can absolutely rank religions by harm.  \n\n The question is what parameters do you set? Which religion has been most harmful over a certain span of time is absolutely something that we can do. \n\nReligion is a poison in itself. Doesn't mean we can't discuss which particular group might be the worst offenders- past or present. ",
            "Yes, you can",
            "Because former French colonies are any better? They’re probably worse on average because former British colonies include countries like Canada, New Zealand and Australia which are a lot more secular. More like Europe than the US, let alone Pakistan or India. Look at Haiti, look at the entire Sahel. Plenty of jihadis in the Maghreb too.",
            "Not just islam, but all religions and superstition. It will be the ruin of us all if we let it.",
            "That explains the war crimes Pakistan did to Bangladesh",
            "Jew is both the name for the ethnicity and the religion.\nIsrael was created for the Jewish ethnicity. Look up Zionism for more info.",
            "India /s",
            "Israel is based on the Jewish ethnicity/national group, not religion. Many of its founders were atheists. It is, officially, a secular nation.\n\n\n  The average level of religiosity is on par with the Czech republic, with roughly the same number of phd's per capita as Canada. \n\n\n Gay rights are well established, and women have the highest level of economic parity in the middle East by far. \n\n\n It is beyond misleading - and offensive to the millions of Israeli atheists - to mention it in the same breath as genuine regressive theocracies.\n\n\nYou can still hate Israel, its people or its politics. But they are the least religious, most atheist-friendly people in the region (and indeed, relative to most of the EU) by a considerable margin. ",
            "Are you claiming that satan is real? \n\nWhat on earth does 'satanism' mean to you exactly? ",
            "Nope",
            "Those idiots gave their live because of their idiotic beliefs and they took part on their own free will. This guys live was taken from him and against his free will. Sounds quite different to me.",
            "What must it be like to be so simple that seeing a few comments on reddit makes you assume everyone on a particular message board or of a particular leaning agrees with those views you read and didn't like? \n\nAnd if you are just realizing that Athiests are people just like everyone else (subject to the same foibles as any other human) then congratulations on finding that missing bit of the puzzle. ",
            "Thank you! The comments on that post were disgusting",
            "They tend to lie together!",
            "Sounds like the US south!",
            "The bible belt?",
            "[deleted]",
            "What is this a map of?",
            "All Qataris shag their first cousins. This map is not correct.",
            "Worse.  I can give narcan for opiates",
            "Not all Americans voted for or like Trump, not all British like or voted for Thacher, not all people living in Pakistan are beneath anyone else on this planet, etc. The 2014 Tsunami was horrible. I hope you are able to continue to exist and thrive.\nAn adoption an https://en.m.wikipedia.org/wiki/Overview_effect for everyone on this planet, is preferred, but our owners prefer Enshittification.",
            "Or in a progressive American university, somehow.",
            "The last officially recorded lynching in America was in 1981. There are several nonprofits who claim lynchings never stopped. We can all sit here and say we're better than Pakistan but our history of hanging black people from trees would suggest otherwise.",
            "Don't take it easy on Pakistan, it deserves all the shit it gets.",
            "And we seem to be heading towards getting rid of the separation of church and state in this country.",
            "All religions are fake, but not all religions are made equal. It would be absurd to say that christian societies are worse than muslim ones.",
            "Talibangelicals",
            "I feel it",
            "I mean if he did, I kinda can understand why they would get mad over it. There’s no need to do such a thing. They brought that on themselves. And if they did do it to a Quran, why the hell would you do it in Pakistan? People kill their own daughters and sisters over there in the form of honour killing (not promoted by islam, seems to be more of a cultural thing).",
            "Most of the Iranian expats I’ve met here in the states have been lovely people. Their government and Sharia is the real problem.",
            "It's due to the fact that Sunnis are fundamentalist by nature (there's no liberal interpretation of the Koran allowed), while Shia have imams of various degrees of liberalism. There's even one Shia sect (Ismaili's who follow the Aga Khan) who are barely Muslim at all.",
            "It is. And it's pretty incredible. The art is breathtaking.",
            "Well I'm not visiting either one.",
            "Is it? I don’t think it’s that simple. I’d much rather live in Turkey than in Iran or Iraq. There are several pretty secularised Sunni majority countries (especially in the former Soviet Union).",
            "They tried, couldn’t find the brain",
            "Well ... yes but it's good to point out that perhaps there is more danger to society from Islam than a bunch of Buddhists ...",
            "Oh no here come the atheist fundamentalist lol",
            "That's exactly what the other guy with the same name as you said!",
            "% of people who are products of consanguineous relationships",
            "The map probably counts all the foreigners living in Qatar as well? Qataris are a minority in Qatar.",
            "They may _burn_ you, but certainly not set fire to you.",
            "Damn Pakistan feels like a parallel 1950s USA",
            "You can look at what's happening in Pakistan and say \"this is awful, I'm very glad we stopped doing it, because it was awful here, then, too\". People shouldn't look at Pakistan and say \"Ah well, we used to do it too, no big deal\". It's still very much a big deal.",
            "Yep. Louisiana passed a law that requires every classroom to display the 10 commandments.",
            "Depends on the country and the time period. The 2025 agenda of the 'Ya'll Queda, MAGA lovers\" are attempting to go backwards into theocratic rule in America.",
            "That's absolutely ridiculous, Christian women in the past didn't have it any better than Muslim women in the past.\n\nIslam never had a mass burning of women for witchcraft, a deeply msygonist and fatal outbreak of violence against women fueled by sexism in the bible.\n\nPlenty of western people would happily take women to a place like we see in Saudia Arabi or Iran.\n\nIf the Amish were Muslim instead of Christians, people in the US would freak the fuck out. As it is, Christians can be as sexist as they want and that's freedom of religion and their extreme life style is held up as a Christian standard.\n\nJust like everyone acts like it's totally normal to marry off teenagers in America but people in the ME are fucking evil goat herders for doing the exact same thing.\n\nI guess for once we can at least use racism to advance women's place in society, let's see how far we can take that. 14 states in the US have raised the age of marriage to 18, how long do you think it will take to get to all 50?\n\nHow is our society so biased that we act like burning thousands of women as witches, didn't happen?\n\n\"Suffer not a witch to live!\"",
            "That's a good one 😂",
            "I just choked on my drink",
            "You think what they did to him is okay?",
            "You're full of shit",
            "Who cares about the details of their make-believe?  Pointing out differences only grants them legitimacy. It all goes in the same crazy pile of crap and should be treated as equally repugnant. Same for all religions. The only reason why one would be more 'liberal' than the other is some external social force keeping them in check. Give any of them an inch and they will take a mile.",
            "Plus all the loot plundered and rebranded as donations. I was astonished by how many artifacts that Egypt donated to the Vatican Museum.",
            "Far from it friend. \n\nYou sure do seem upset though. \n\nWhat exactly is troubling? Your initial complaint seems to be 'gee willikers, athiests can be mean just like religious people!'\n\nIf that is truly a revelation for you, then congratulations on discovering atheists are people just like everyone else. \n\nIf that isn't your point, what on earth were you trying to contribute to the discussion? ",
            "Thankyou. Deleted double-post. Sorry about your penis.",
            "I'm guessing that 'consanguineous' word means Alabama mode in moron",
            "You'd be surprised how many places do. Mob violence and prejudice are a lot more common than people care to admit.",
            "that got passed wtf that’s really just. sad",
            "It’s difficult. On one side, god will punish them for what they did (I’d imagine it’s a Quran), but on the other hand, this can’t be allowed to happen again, so maybe a severe punishment like this is a good thing. A deterrent. At the end of the day, by doing this, you are provoking them intentionally. You should be aware of how they would have perceived it. I have 0 sympathy for them. There was no reason to do such a thing. Literally, 0 reason and yet they did? \n\nSo the answer you, yeah, I think it’s okay if we take everything into consideration.",
            "Lmao, why you so triggered bro. Pls explain how I’m full of shit? Coz if you have a source for Islam promoting the honour killings, I’d love to see it",
            "Based on the map, I think we should reconsider Alabama as the incest stereotype. That's theocracy mode.",
            "“ Alabama mode in moron “. I fuckin wheezed 😂😂",
            "that got passed wtf that’s really just. sad",
            "But it's not even been proven yet that he did burn it. \n\nOne of the (islamic) ways to get rid of a koran is by burning it. And to light someone on fire isn't allowed as it's a punishment reserved only for god.\n\nWhy can this not be allowed to happen again? Why is burning a koran so much worse than burning someone alive? There was no justified reason to kill him either, yet they still did just that.",
            ">I mean if he did, I kinda can understand why they would get mad over it. There’s no need to do such a thing. They brought that on themselves.\n\n>this can’t be allowed to happen again, so maybe a severe punishment like this is a good thing. A deterrent. At the end of the day, by doing this, you are provoking them intentionally. You should be aware of how they would have perceived it. I have 0 sympathy for them. There was no reason to do such a thing. Literally, 0 reason and yet they did? \n\nThat's why you're full of shit. \n\nIt's a book, unless the guy stole it there should be no retaliation at all. He definitely didn't deserve to be lynched and set on fire for destroying a book.",
            "reply’s no work all i’m gonna say",
            "Again, if he did do it, then yeah. And Islam introduced, innocent unless proven guilty, so they would need evidence for it. Ontop of that, I’m not a 100% certain on that, but I did hear something about burning a Quran if it was getting old or something. And again, your burning gods words. If you’re doing it out of malice or hatred or a bad reason, then of course people are not gonna take kindly to it. We see it as gods words. And there’s no reason to do it unless you’re trying to provoke a reaction. I explain why the death would make sense. As a deterrent. My stance here ain’t gonna change",
            "Fair enough",
            "Idgaf if it won't change it's concerning that you would put  a book over a person's life. Why should non muslims have to respect your dumb book?"
        ]
    },
    "The longest a person has clinically died and come back to life is 17 hours (back in 2008). And we're supposed to believe 2000 years ago, without modern day medical skills and technology, that a man died for 3 days and came back to life. ": {
        "title": "The longest a person has clinically died and come back to life is 17 hours (back in 2008). And we're supposed to believe 2000 years ago, without modern day medical skills and technology, that a man died for 3 days and came back to life. ",
        "score": 336,
        "url": "https://www.reddit.com/r/atheism/comments/1dllaog/the_longest_a_person_has_clinically_died_and_come/",
        "content": "And no, we're not supposed to ask for evidence that such an unbelievable event happened. No, we're just supposed to have blind faith. Just have faith that this happened, that's good enough apparently. \n\nIf you just think about it a little bit, it's ridiculous to believe the bible actually happened. Old or new testament. But billions of people don't question or think about it. They just have faith. ",
        "num_comments": 160,
        "comments": [
            "Why are you comparing science with the magic in a myth?",
            ".... and don't forget that his daddy required that he (the back from the dead guy) die to keep him (the daddy) from committing genocide again and that he (the back from the dead guy) is the same entity as his daddy (the genocidal maniac daddy) .....\n\nYa, there's no making sense of their poorly conceived lie.",
            "To be fair, their ability to determine if someone was actually dead or not was equally crude.  There was a fad in victorian london to put bells connected by a wire into coffins because sometimes people werent quite dead yet when they were buried.  [would you like to know more](https://en.wikipedia.org/wiki/Safety_coffin)",
            "Who was clinically dead for 17 hours in 2008? That sounds interesting.\n\nI was under the impression that the longest anyone ever went without a heart beat and still survived was more like 1 hour.",
            "The Romans killed the wrong hippy and Jesus' home boys were like you gotta lay low for a few days and then pop back up. It will be hilarious.",
            "The \"dying and rising God\" is a common religious motif. Both Osiris and Inanna died, spent 3 days in the Underworld, then rose from the dead. \"Religion is Myth-Information.\" :D\n\n[https://en.wikipedia.org/wiki/Dying-and-rising\\_deity](https://en.wikipedia.org/wiki/Dying-and-rising_deity)",
            "Someone 2000 years ago:\n\n\"Oh man, grave robbers got to the grave of our cult leader and stole his body, what should we do?\"\n\n\"Just say he came back alive, that will save us face and give us more credibility.\"\n\n\"Genius.\"",
            "Billions of people just can't cope with the reality that once you die, that's it.",
            "When you literally believe in magic, anything is possible.",
            "Almost everything said about Jesus is made up . There are a grand total of 3 to 4 sentences in all written history that mentions Jesus. Some of these sentences may not even be referring to him.",
            "He got super wasted at a party and woke up 3 days later in a cave.",
            "I mean if they were just arguing that someone died for three days and came back, and nothing more, it's a hell of a lot more believable than what they're actually wanting us to believe. \n\nBut I kind of feel like you're missing the point - the whole idea is it's a miracle.  It's not supposed to be possible.",
            "Ahh Bob, he’s the son of God.",
            "Fair enough, but that was just the first part of the grift.\n\nTelling people that if they only gave enough money and let themselves be led like sheeple, he’d be back has worked for literal millennia and counting.\n\nDamned clever, diabolical even, if you ask me.  Which I’m fairly sure no christain would.",
            "There is one possible answer to this, I think. If I can find it again, there was a study done about being crucified, and they found out that the strain on your chest would likely cause unconsciousness fairly quickly. This could theoretically reduce heartrate enough to simulate death, including the spear. So now he's unconscious, pierced lung, at least, and dropped into a tomb.\n\nThe only problem is he'd never be strong enough to move the stone on his own. Not after being out like a light, starving for three days, and a hole in his chest.",
            "It's not uncommon for religous cults to consider someone \"dead\" if they are cast out of the cult. It's not much of a stretch to believe that if someone considered \"dead\" is accepted back into the cult, they are \"reborn\" or aluve again.",
            "> And we're supposed to believe 2000 years ago, without modern day medical skills and technology, that a man died for 3 days and came back to life.\n\nNo we are not and you are granting way to much to the nutty religious storytellers. \n\n[Richard C Miller's book](https://www.amazon.com/Resurrection-Reception-Christianity-Routledge-Religion/dp/1138048275/) is quite compelling in framing the NT passion and resurrection in terms of the  hellenic environment in which it arose.  Once you see it this way, the Christian mythology is transparently just more of the time and place and genre. \n\n \nI quote from the blurb\n\n> ... Miller argues, early Christians would have understood the resurrection story as fictitious rather than historical in nature. By drawing connections between the Gospels and ancient Greek and Roman literature, Miller makes the case that the narratives of the resurrection and ascension of Christ applied extensive and unmistakable structural and symbolic language common to Mediterranean \"translation fables,\" stock story patterns derived particularly from the archetypal myths of Heracles and Romulus. \n\n&nbsp;\n\nThe gospels were not history and were not meant to be taken as history. \n\nThe issues you raise are irrelevant. It does not matter what you think about the mechanics of resurrection, it is simply all myth. \n \nThis work has been rumbling along for decades now. Brodie, Crossan, MacDonald, Pervo.  The whole corpus of work has lead us to this.",
            "You hit a pet peeve of mine. The died for three dies implies 72 hours. He was dead for around approximately 36 hours. Late Friday afternoon, all day Saturday and back up early Sunday. Yes technically three days but really only a day and a half.",
            "The problem is when you said  \"and we are supposed to believe\"\n\nWe are not supposed to anything.\n\nJust drop it because it doesn't matter and go outside and enjoy here and now. Don't waste your time with trying to prove the crap is just weird and you will not win against \"just believe\".",
            "I didn't even believe that Jesus Christ, the man, existed. Resurrection? Yeah, sure, whatever.",
            "He had special superpowers silly and an imaginative story tellers. Basically none of this is true and just ridiculous.",
            "If he was a cyborg,  maybe he was in resting mode. When the 'angel' (elohim) visited the tomb before the women got there, a new powerpack was inserted to bring him out of resting mode, creating the flash of light that supposedly happened.",
            "Yes we are, some chick named Mary MAGAdelene (profession Prostitute) said so.",
            "I do love reading about these cases and find them fascinating. One of the great mysteries of life is the experience of its natural conclusion-death. Always interesting to read about what they saw/heard/experienced during that brief period of time. Personally m, I see it as purely psychological or subconscious reflex or survival instinct kicking in.",
            "Everyone always goes for laughs with the \"undead Jesus\" take, with him being a zombie.\n\nHe was a *lich.*\n\nHe and his acolytes amassed enough power to perform a ritual to resurrect Lazarus, an actual undead. This was the final piece prior to the choreographed death of the necromancer himself, setting him to be reborn a lich. I can only assume that every death under the guise of the religion thereafter is only adding more souls to the legion empowering his dark magic.",
            "I think you are missing the point.  If it were clinically possible,  it wouldn't be a miracle---not saying it happened  (pretty damn sue it didn't)--but if it were possible,  then Jesus wouldn't have performed a miracle. \n\n\nThe sun never stopped in the sky, water never becomes wine, the blind aren't healed with a touch,  no one walks on water.  For a Christian,  that is the point.",
            "Some scholars posit that, if the crucifixion story is at all accurate, his resurrection and some details of the passion are best explained by mesical conditions someone going through that likely would have experienced. Namely hypothermia can account for the resurrection, and his watery blood from the spear wound being caused by pericardial effusion.",
            "The way I remember it told, His groupies open it up after 3 days and He was gone, not He rose from the dead 72 hours after being put away.  \n\nBut who knows, Jebbus may have arisen 10 minutes after they rolled the rock over, and was screaming in the dark for 3 days before He got out.\n\nThere is a reason graves used to have a little bell for the not quite deceased to be rescued “saved by the bell”   /s",
            "Either the dude wasn’t actually dead, or they took the body and spread rumors he escaped",
            "A christian once said to me, \"How are we supposed to present evidence of something that happened 2000 years ago?\" He was talking about the resurrection.\n\nThe irony that he believed it anyway was lost on him.",
            "Apparently not..... according to Matthew 27:51-53 tells us what happened right after Jesus Christ died: \"Then, behold, the veil of the temple was torn in two from top to bottom; and the earth quaked, and the rocks were split, and the graves were opened; and many bodies of the saints who had fallen asleep were raised; and coming out of the graves after His resurrection, they went into the holy city and appeared to many.\"\n\nSo apparently, resurrection was rather common place with no evidence for such, but clearly the Jeez wasn't the only one.\n\nOddly though, no mention of such from the other 3 which is weird cos if one of my relatives came back from.the dead and wandered into my house for dinner I'd probably freak the feck out and have told someone \n\n🤷‍♂️",
            "If I had a nickel for every time I saw someone on Dr. blitz’s livestream tried to claim that they died and came back to life in a longer timespan than the record, I would have 2 nickels.",
            "They had to create a story where the guy was seen as a superhuman. So people believe that he is the son of God. The chosen one.\n\nAt the time, nobody was educated. Imagine how many stories of miracles would go around.\n\nToday, however, people still believe because they want the hope of cheating death. They will believe anything: reincarnation, ghosts, angels, miracles.",
            "More to the point, he was supposed to be dying for my sins. If he suddenly decides he didn't like being dead, and renegs on the deal, wtf happens to my sins?",
            "OP, do you have a link to info about this person who was dead for 17 hours and came back, please? I have never heard of such a case. Thank you.",
            "Are we to believe that a god turned in to a swan and had sex with a human woman?\n\n\nNo...? What a pointless argument to have.",
            "But .. but .. but...\n\nMagic sky daddy.",
            "By the third day, a corpse begins to liquefy.",
            "He rolled the rock back…..as a zombie",
            "There is nothing special that Jesus supposedly did that others have not done with much better evidence and credibility also there is nothing exclusive to what his followers from that time are claimed to have believed.  \n  Anyone who says what people want to hear or claims authority can get devout followers.  \n  People can do and say things that change the world for the better - and they can be killed for it.  \n  People can do magic tricks and have them called miracles.  \n   Masses of people can think there was a miracle when there was none.  \n Grieving families can be convinced a living stranger is someone who was reported as dead.   \n  People can be considered dead then not be dead.  \n  People have been horrifically tortured and killed - even by Christians.  \n  Real people can inspire myths and legends.   \n  Many people who were not the messiah or a prophet claimed to be.  \n  People can be very wrong about something they \"know with all their heart\" - people believe lies.  \n  People can die and kill for things that are untrue.  \n  People can have similar claims about the supernatural and the unexplained.   \n  We know myths can grow and about religious idea merging / syncretism.  \n  Children can be born to virgins with IVF. ----  \n  There were other dying and risings god claims.   \n  There were other sacrificial gods.   \n  There were other crucified gods.",
            "Yeah, and in that 17 hour case, she was declared clinically dead based on no heartbeat, but it is not known if there was still residual brain activity during the 17 hours until her heart restarted.",
            "“Well first of all, through god all things are possible, so jot that down.”",
            "How long is three days?",
            "But what if aliens?  \n/s",
            "Why are you arguing this? Christians don't believe Jesus \"clinically died\" and was resuscitated. They believe he was DEAD dead and magically came back to life. When you believe in magic, it doesn't matter what happened for 17 hours in 2008.",
            "Its not just that. Only 2 or 3 people witnessed the resurrection along with \"500 others\". That last bit is contestable though. Its not like he came back and walked around talking to people for a day or so.",
            "Wasn’t even 3 days and no one went in there til then , he could have gone a day before.  It’s crap",
            "god used a Devine defibrillator to bring him back",
            "Well once you’re accepting magic and that god can basically do anything there’s really no point in trying to make it make sense.",
            "Ah but that's why it's a miracle.\n\nNo, no, you need to be asking questions about Noah and Methuselah, neither of which claimed to be literal godspawn.",
            "My uncle was dead for 12 minutes. He died in the hospital waiting room, there because he wasn't feeling well, a heart attack got him. Brought him back ASAP.",
            "What the Bible describes is magic. It would be weird to believe all the other magic described in the book and then think bringing back the dead is impossible.",
            "Is the duration supposed to be impressive here? People die and come back every day now, you probably know someone who had died.",
            "As they say it's beyond human comprehension",
            "My best friend in the entire world, and also one of the smartest, most logical thinking person I’ve ever met, is a VERY devout Christian. I grew up deep in the church, I have always been very knowledgeable in the Bible, and I just made my way into atheism as I got older. But my friend, is unwavering in hood faith. \n\nNow, he’s completely aware that there are contradictions and fallacies in the Bible, because he understands that men wrote the book. He’s aware of the council of Nicea, and how so many other books didn’t make it into the canon. His rationale is that, the point of faith is that 1.) with physical, undeniable, incontrovertible evidence, faith becomes moot, and “free will” is invalidated l; and 2.) a lot of the stories and teachings are parabolic, not to be taken literally.\n\nIt should be noted that he is not bigoted, and is accepting of the LGBTQ community. We have had oh so many discussions and debates about this. We’re so diametrically opposed on this issue, while we both accept that we’re never going to chance each other’s minds. He is aware of the inconsistencies, but is adamant that it’s by design, to really test your faith. But he’s happy, and that’s what matters. \n\nI do love the dude, and I love that we can have those conversations while respecting each other’s beliefs (or lack thereof). \n\nHe’s also wary of people who try and force their beliefs onto people, as well as people who are so public with their beliefs.",
            "It was MAGIC though!",
            "Well yeah.  It's magic. Didn't need science for that.",
            "Completely dead, or mostly dead?",
            "Maybe he was just tired",
            "I love Blind Faith!\nWhat’s your favorite song?",
            "I think that is more believable than a talking snake.",
            "The rot a body goes through in 3 days, especially one that was abused prior to death and dead on a cross for a long time before…is gross",
            "Can't you have a little faith? Lol",
            "The story isn’t supposed to be logical, obviously Christian’s believe it to be a demonstration of gods power, I don’t understand what your point is?",
            "Lots of ppl question if jesus returned from the dead. But it’s the cornerstone of Christianity that actions on earth matter because the Bible asserts you have an immortal soul that continues after death. The New Testament’s message of rising from the dead was a mechanical means via story to demonstrate actions matter beyond physical presence on earth. The net question to reduce it down, do your actions in life have consequences beyond what man can put upon you for ramification? If we don’t have an immortal soul and our actions don’t matter beyond our physical presence, that leaves us only limited by our individual conscious to govern our actions. Science asserts a persons conscious is a blank slate at birth and requires the passing of generational knowledge to shape what a person feels about their behaviors. Ironically, the Bible is just that, a means to pass generational knowledge to shape and govern behavior. The family unit traditionally passes the generational knowledge but with both parents typically working to achieve and sustain material possessions such as food, clothing and shelter, the family unit is questionably affective. We should be very grateful to have the rise of the federal government as stewards of our generational knowledge to shape our individual conscious for future generations since the family unit and religion are no longer viable mechanisms.",
            "I agree that it's just made up, I think we have to be fair and point out that back then the definition of death was harder to discern. There was no stethoscope and no way to really tell things like brain death back then.",
            "Could have eaten a blow fish or something.  Heart rate like 5 beats a minute.  Probably didn't bury him put in a pile of bodies the followers found him and carted him off to his wife.",
            "and over the years a multitude of people have been buried alive after people believed they were dead but their vital signs were to weak to be seen.",
            "I in too many drama reddit .  I start reading it and I was like yea cause it’s magically , it’s just a drama and I saw the site name lol 😝",
            "They took him off the cross after six hours and didn't break his legs, so he probably never died.  He probably just fainted into a deep coma due to blood loss and woke up later after a few days of recovering in the cool, dark, quiet cave.",
            "Faith. 🤷‍♂️ \nWorks in mysterious ways!! 😂",
            "Have you heard of the Swoon Hypothesis? This is the only explanation that makes sense to me.",
            "In the immortal words of George Michael theres only one thing you need.  “You gotta have faith-a-faith-ah”",
            "The case you reference, the patient was \"brain dead\" for 17 hours. It's a little more complicated than \"she died and came back to life.\" While she had no brain activity, she was being ventilated and had a pulse. She was also therapeutically cooled after an earlier cardiac arrest with rosc. It is not as though her heart stopped and she didn't breath for 17 hours. That would be miraculous of course. 17 hours would be unbelievable enough, 3 days is ludicrous.",
            "Honestly, that's really not one of the points in the story I'd be hanging up on. Sure, he \"died\", but nobody ever declared him clinically dead, that didn't even exist. They just claimed he was dead when he actually wasn't, and after three days he got up.",
            "Jesus was only three days, actually only 36 hours, but who's counting? Anyway, Lazarus has him beat at 4 days.",
            "Maybe they were too dumb to understand the difference between death and extended sleep?",
            "Well… lots of things in the Bible probably did happen.\n\nThere probably really were Jews who moved to Babylon after Judah fell.\n\nThere probably was an editor of the early versions of the books that became the Torah who combined the national myths of Israel and the national myths of Judah into a combined work for a new combined population of northern and southern Jews once Israel (the northern nation) fell.\n\nThere probably really were kings and priests who went through centuries of debate about centralizing religious worship in Jerusalem vs some of the other traditional centers of worship.\n\nI find this book fascinating for a look at who really wrote the Old Testament and what was really happening when it was written: https://www.amazon.com/Wrote-Bible-Richard-Elliott-Friedman/dp/0060630353\n\nOn the New Testament front, there probably really was an apocalyptic Jewish preacher named Yeshua who thought the end of the world was coming soon.  There really were people who knew him and passed down stories about him.  It’s likely he did not consider himself the son of god and that’s a later addition spun after he died.  And in fact the earliest copies of the earliest books of the New Testament make it seem like even the resurrection might not have been part of the story.\n\nLots of books by this guy I find fascinating in this topic: https://www.amazon.com/Did-Jesus-Exist-Historical-Argument/dp/0062206443",
            "I get you, and your frustration. But that's the wrong way to look at things imo. If you believe in a god, you basically believe in magic. For all intense and purposes. So there is nothing, you have a reason for to not except as possible. Everything is possible with a god. Literally everything!",
            "Consider this scheme to escape the Roman Empire manhunt:\n\n\nYou have a price on your head. Your cousin was trapped and killed. \n\n\nYou enter Jerusalem to a heros welcome, the people believe that you are the Messiah and will free them from Roman rule. After dressing in common garb all your life, you are wearing a flamboyant expensive garment. Before the authorities can arrest you, you disappear. \n\n\nLater that night, a member of your movement turns snitch and tells the Romans where to find you. They arrest a man wearing the flamboyant garment, but someone has beaten him senseless and bloody. He is judged and crucified quickly. \n\n\nBut you are still in hiding, having taken a suspected mole, and beat him senseless and redressed him in the flamboyant robe. Three days later, you steal his body and spread a rumor that you were resurrected. \n\n\nYou then adopt his identity and head for Greek cities. Just to be sure, you can identity a second time.  \n\n\nJust playing out a true crime drama, based on how you could fake a death and resurrection...",
            "70% of the world today is just as gullible and superstitious as we were 2000 years ago.",
            "Congrats you just figured out its all a bullshit fantasy story like any other.",
            "The resurrection story has been documented at least 12 times in other cultures well before Jesus walked the planet.",
            "Isn't the point that he didn't just get resuscitated?",
            "It’s all ridiculous.   If there was a loving god who created us and needed us to do certain things to get to heaven, why the hell would it be so confusing.   Why would there be thousands of religions with billions of followers all believing they are doing the things they need to so they can go to heaven or some afterlife that’s good, just to find out they got dipped in the wrong pool? Just to find out all the sacrifices they made were for the wrong business? \n\nAccording to religion we are God’s children.   Imagine giving your children a 1,000 + page book with literal, non literal instructions, translate it several times and have disagreeing  advisors telling them what it means and ask them to follow exactly what you want to get an inheritance.   Everyone would think you’re a dick.  If there is a god he’s a dick.",
            "It's an allegory for the sun",
            "If you can believe a virgin gave birth you can believe anything",
            "Nobody dies and comes back to life at all. If your heart isnt pumping it doesn’t mean you’re dead.",
            "You left out the part that no one SAW him come back to life. A couple of women found his tomb empty and assumed he had come back to life. And THEIR account was written down decades later by someone else who wasn’t there and didn’t talk to the “eyewitnesses”.",
            "So says you but who are you to say jack shit.",
            "No one stole his body. There was absolutely no technology for body stealing back then. The only **logical** explanation possible after his body was found missing is that he had magically “risen”.  Duh!",
            "Even if there is truth to a guy rising from the grave 3 days later, whats more probable:\n\n- An invisible skydaddy ressurecting him\n\n- People being absolutely dogshit at determining if someone is actually really dead",
            "My friend, the apostles would not have been prepared to die for this if they did not see it with their own eyes. As for why there is no scientific explanation, that is the whole point. There is no scientific explanation, but we know from the apostles willingness to die that it must have happened. Therefore, the raising of Christ from the dead must have been through a divine power. May the peace of Christ be with you.",
            "People really don't like Jesus for some reason. That's so odd to me. Even when I was an atheist, I still respected my main dude, JC.",
            "And why isn't OP more clear? I thought this was another \"checkmate atheists\" post, because it had to be magic and couldn't be explained by science.",
            "Trying to justify it and get it clear in one’s head? It’s perfectly reasonable. To many, it isn’t a myth.",
            "Many Christians believe that God changed after Jesus \"died\" into brotherly-love Godru, but they conveniently forget the Crusades, Hundred Years' War, and basically every war between Christian nations. Where's the brotherly-love?\n\nIs a message so simple *that* easy to forget?",
            "_Daddy chill_ 🤚",
            "Immediately came to mind for me as well. Hey, hey, ring the corpse bell. Heck they found a woman alive at a funeral home just this year in the US.\n\n\n\nI know that's not really the point of the post though.",
            "Yeah I don't think someone being assumed dead and then turning out to be alive after a few days is that far fetched, especially pre-modern medicine.\n\n\nI mean, even in modern times people have occasionally been mistaken for dead and then woken up in the morgue. There was even an incident where an old woman woke up at her own wake. In these cases though, the person wasn't dead to begin with.",
            "If you want to read a disturbingly long list of know cases, click the link. ‘In 1896, T.M. Montgomery, who supervised the disinterment and moving of the remains at the Fort Randall Cemetery, reported that \"nearly 2% of those exhumed were no doubt victims of suspended animation.\"’\n\nIt’s frightening to think that 2% of people buried before the 20th century might have been alive. And it’s been known in the 20th century (and 21st) for funeral home/embalmers to find live people.\n\nhttps://www.snopes.com/fact-check/just-dying-to-get-out/",
            "This is a actually where we get the phrase “saved by the bell”🔔",
            "[Velma Thoma](https://www.telegraph.co.uk/news/newstopics/howaboutthat/2032591/Woman-comes-back-to-life-after-being-dead-for-17-hours.html)s. There's a whole of people who've experienced [Lazarus Syndrome](https://my.clevelandclinic.org/health/articles/24876-lazarus-effect) on the [wiki page](https://en.wikipedia.org/wiki/Lazarus_syndrome).",
            "This is the Truth.",
            "Blue-eyed fair-skinned Jesus with perfect teeth and Calvin Klien undies?",
            "all the long hairs look alike?",
            "Meh, you're close, but there is disagreement among scholars on this (even secular ones) to this day.\n\nFor starters, Osiris did not return to life. He was dismembered and then later reassembled (minus his johnson) and animated to rule over the underworld (to learn the difference between animation and resurrection of the dead see: Advanced Dungeons & Dragons 2nd Edition Players Handbook pg 208 and 235).\n\nSecond, the earliest confirmed documentation of the myth of Osiris is from Plutarch ca. 70 AD, so it's inconclusive, at best, as to whether the Osiris or Jesus resurrection story came first. \n\nFinally, Inanna died *in* the underworld before being released by her sister, and comparisons to the resurrection of Jesus are tenuous at best.",
            "“Kill god in the spring, bury him underground, he returns three days later.” Literally, the mindblowing story of vegetables.",
            "What’s sad to me is they’ll never know they were wrong. It’ll just be over for them.",
            "I think religion is nonsense but still don’t think we can really say that with any certainty. Really it’s not necessarily a comforting thought that there might not be any escape from the troubles of existence, if you don’t have some weird certain belief that you’re going to some paradise if there’s some continuation of experience.\n\nIt’s quite possible there’s nothing, but existence is wild and improbable to begin with, it wouldn’t be too insane for something as bizarre as this life to be followed by something. I just don’t think, if there is, that it’s a place where anyone who enjoys sex, wasn’t baptized, or followed a different religion will go to a land of eternal suffering, lol",
            "More people need to understand this. Literally every story about Jesus is made up. It’s all fiction.\n\nMaybe some is loosely based on reality, but not much, and even if it, the details are all made up.",
            "It wasn’t even three days later!  It was one day and two nights. \n\nHe died Friday night, and rose before dawn on Sunday.  Maybe 36 hours, tops.",
            "The wine was spiked!",
            "Who hasn’t?",
            "To be fair, tithing was a thing for the Hebrews before Jesus too.",
            "I know just the guys for the job. Twelve guys in fact.",
            "I tell you it was his home boys!",
            "Great point. It’s a metaphor and the Bible is filled with of them.  Metaphors are fictitious  descriptors, not to be taken literally.  For example : couch potato.  Humans are not actual vegetables and everyone knows that being a couch potato is a metaphor for chillin on the couch doing nothing. But with religion, the nutters apply literal meaning to metaphors.  They lack critical thinking skills and will insist that a couch potato literally exists because a book full of metaphors told them so.  And when we ask them for proof of this magical furniture vegetable, they tell us to have faith and be patient because If we’re good, we’ll get to meet the couch potato when we die. \n\n\nAll hail  the Couch Potato 🛋️🥔",
            "I still don’t believe he ever existed. And even if there was a historical Jesus, he certainly wasn’t the son of any god.",
            "The ggggggggggggggrandfather of David Copperfield.",
            "> some chick named Mary MAGAdelene (profession Prostitute)\n\nThe Bible doesn't say she was a prostitute. She and the other women who travelled with Jesus and his gang were probably wealthy widows who financed his ministry. Jesus was most likely her toyboy!",
            "damn ...I knew it all the time, but those bastards wouldn't believe me, so they fed me these not tasty pills until everything was drowsy and I couldn't hear the whispers of the lich no more...I must help my friend to find more souls after all! Can you hear him too??!\n\n/s\n\n\nI like your story very much ;⁠)",
            "Maybe they did a Romeo and Juliet on him using Belladonna…",
            "Who was this Matthew and why would anyone believe the translation done by a king of England/Scotland (by default) who cheated on his wife with at least three other *men*?",
            "Right? None of the other 3 felt the zombies were important enough to mention?",
            "But it makes a good campfire story! 🔥",
            "*scribbles furiously before remembering that I'm an illiterate fisherman following around a carpenter who rubs dirt in people's eyes*",
            "> Its not like he came back and walked around talking to people for a day or so.\n\nWhile the gospels say he only appeared to his disciples for a day or two before zooming skywards Acts 1:3 says it took him 40 days to convince them it was really him. That was some doubting. About Danny DeVito claiming he was really Arnie Schwarzenegger reincarnated level doubting!",
            "Especially since there was no Jesus!",
            "Maybe there was a hidden back door. He legged it to Mary Magdalen’s gaff and got back in time to be resurrected?",
            "If not for faith, why is he so devout? Having faith does nothing except assuage our fears. It seems that he recognises that fact. I don’t understand the logic behind his reasoning- if he doesn’t have blind faith.",
            "Especially in a hot climate.",
            "In that case, it’s a fairytale. But Christians actually *believe* that shite. I don’t get it 🤷🏼‍♀️",
            "They had those trumpet like things to listen to your heart. Also people knew how to feel for a pulse since the Stone Age.",
            "The Onion enters the chat.",
            "Probably did it for the life insurance money.",
            "It means you ARE dead. FIFY.",
            "No believer is discussing the viability of this event. Only the non-believers. Like discussing what flavour of ice cream is your favourite. There's no argument there...or discussion. No one is going to argue with you about your opinion, no matter how inciteful you attempt to be. Do you need someone to tell you that you are right? You seem to have all the confidence you need.",
            "I'd never considered that when I was a believer, but for how many cases existed of people being buried alive, that tracks.",
            "No we don’t, my friend. You weren’t there and neither was I. We don’t know *what* the apostles were thinking or willing to do. We don’t even know that there were apostles. I hate hearsay and when people make assumptions based on rhetoric and declare that “it must be true”. Hell, we don’t even *really* know who shot Kennedy…",
            "The actual person or the mythologized man/god?",
            "WHEN you were an atheist? What changed your mind?",
            "I love godru so much lol",
            "You listed a bunch of stuff people did, not what they allege that God did. In the Old Testament God did or ordered every sort of evil. Then Jesus comes along it's all different. Some Christians explain it as people just needed a harsher God in the past. Others say that in becoming man God gained empathy and changed, which conflicts with God being all knowing.",
            "*What* *the* *hell* *is* *even* *that!* 🗣️",
            "Rather than boxing? Whodathunkit.",
            "yes but those are all technicalities IMO. The main idea is the fact that *something* exceptional happens after 3 days (and exactly 3 days), which, at least for me, proves that this is just the continuation of previous myths. And anyone who actually interprets this literally (as someone who was clinically dead for 3 days and came back to life) didn’t « get it » at all",
            "Thanks for the corrections.",
            "Which infuriates me to no end. I *want them to know* how stupid all their religiosity was during their one life. 😡",
            "Nah, he just combined it with the burning bush",
            "From god-zilla to godru. 👍🏻",
            "\"He's different now\" is not a solution to ex-genociders",
            "Idk about you but if I’m all powerful, I’m gonna do something to stop people from doing mass-murder in my name.",
            "I dunno, having a kid made me less genocidal /s"
        ]
    },
    "God wants you to die in the heat": {
        "title": "God wants you to die in the heat",
        "score": 482,
        "url": "https://www.npr.org/2024/06/21/nx-s1-5013582/hajj-heat-deaths-saudi-arabia",
        "content": "Hundreds die during this pilgrimage. Religion is too powerful on the gullible. Religion makes you put your own life at risk. But god needs you to pay homage even if it kills you. ",
        "num_comments": 64,
        "comments": [
            "Allah is well aware of global warning and is culling the weak to grow a race of heat-tolerant Muslims.",
            "I read where the Saudi government had rest & water aid stations set-up along the road, but you had to register your hajj to get access, and thousands and thousands of the people refuse to register, so they can't use the aid stations.  Most of the casualties are Egyptian, and it costs ~US$6000 to get an official hajj permit.  And, of course, there are also independent operators that cost less, promise more, and then abandon the people they con in the desert.\n\nHumans are a stupid, stupid species.",
            "As if he cares. Guy is a sadist.",
            "Darwinism gonna Darwin",
            "Families of the dear departed are delirious  with joy that their beloved family member has died fulfilling his religious  duty.\n\nNote I did not say his/her as women are denied the opportunity  to die for their faith",
            "To the family of the deceased they believe that it was someone’s will and the souls will be rewarded ",
            "God's doing Darwin's work.",
            "Dumb people dying for their imaginary friend. Will always make me laugh",
            "In general God just hates people.",
            "Either god wanted them to die in the heat…or he can’t help them…either way…god is either weak or an asshole.  Religious people will say that he is doing that as a test…to see who is really committed to coming to Mecca. In other words he is running the Squid Games.",
            "All the kook kids are doing it",
            "I must be missing something. If they're so sure of their religion, they should be happy for their departed. After all, they're going to see Allah, and they're going to get their 72 virgins...so be happy for them.",
            "Hey, they're dying doing what they want to do.   \n\nProbably better than dying at your desk.   Which is what I'll probably do.",
            "They can’t complain. It’s all part of his plan.",
            "Allah is a Zionist.",
            "And nothing of value was lost.",
            "A billion people could get called home, experience Paradise early, and relieve pressure on our earthly abode. Everyone wins.",
            "Drop in the bucket for all the children they will make and indoctrinate to continue their cult.",
            "Hopefully the young being indoctrinated learn through this insanity.",
            "So..\n\nThe stone at the corner of the kaaba existed before the prophet (peace be upon him)\n\nIt was part of a pre-Islamic religion. Scholars, please correct me if I'm wrong on that. \n\nOne must be aware, that we are mortals, and at some point we must pass away, whether through accident, illness, when it's our time, we must leave the mortal coil. \n\nDying doing the hajj, is probably a sensible a way as any. \n\nNot saying people SHOULD do it, but it's sort of a poetic way to go. Circling a stone. \n\nHow else to die? \n\nCircling the route of the rat race? 😂 The money-capital-money cycle? \n\nI rather like the sky burial myself, let the animals have me! I don't want the humans to have my body. \n\nAnyway...have fun.",
            "Religion of the very stupid",
            "Well, they won't do it again......",
            "😂😂😂",
            "Yes the imaginary man in the sky wants you to die in the heat while you worship him! Thats why I dont worship him.",
            "Said this to my husband last night. What sort of God allows a thousand faithful followers to die so horrifically?",
            "Muslims believe everything is a devine decision and it is God's will that everything happens. How these morons reconcile why Muslims would die at a time of their only chance in life to attend Mecca. Millions save up all their lives for this chance only to be killed by the suns heat. The sun, that god apparently controls.",
            "But think about how many virgins you get in the afterlife when you give your life up to the great Twizzler in the sky!",
            "Heat waves kill anybody outside.  The issue at Mecca was that visitors underestimated the heat, they assumed Mecca is always hot and it was normal, and they didn’t understand the locals meaning when the locals said it was hot. When people that live in a hot desert say it’s hot, it’s really hot.  The area is now in the middle of an effort to warn people about the heat, going so far as to say that Allah doesn’t want them to risk their lives to visit Mecca, etc.",
            "If a religion order you to do some ritual that would kill you, it usually means the religion is false.",
            "Weird way of natural selection to go about it.",
            "Remember Genesis? YHWH let his chosen people wander the desert for 40 years, while Google Maps tags it as about 2 weeks to cross from Egypt to Jerusalem by foot.",
            "I think it's called being raptured.",
            "A \"martyrdom operation\" or \"martyrdom opportunity\" as I think I've heard it called. Fortunately they're only taking out themselves.",
            "How can something that doesn't exist, care one way or the other 🫢 \n\n\nIf someone wants to put their life on the line for the sake of religion, who am I to stop them.",
            "Oof.",
            "May god forgive you",
            "99% of r/atheism are posts taking something idiotic from a theistic dogma and just not realising that they are absolutely idiotic, let it go. You are arguing against flat earther level morons. Come with me to a magical place… where we just don’t argue with idiots anymore. Take a deep breath, close your eyes, breath out, open your eyes, find something new, intelligent and just walk away. For the last time. They don’t matter, never did, you are better than that.",
            "Humans are weird, but indeed the heatwaves are TERRIFYING these days!",
            "Your obedience to nothing will cost you everything.",
            "God created Arakis to train the faithful.",
            "Allah is well aware of global warming and is culling the weak to grow a race of heat-tolerant  __INTOLERANT__ Muslims.\n\nNeeded to quote you literally, sorry.",
            "This might be the best 👌  reply I've seen. 😆",
            "Why is this not surprising? Follow the money.",
            "Very stupid indeed.",
            "That's humanity in a nutshell. Thousands of brainwashed cultists visit a dangerous place in a deadly time of the year to pray to a god that doesn't exist or care about them. Other humans find a way to exploit the gullible and make money off it. Some people get rich, others die, and the circle of stupidity continues as it has for thousands of years.",
            "Why do I get the feeling Trump would do the same thing and have a MAGA rally out in Death Valley 30 miles from civilization with no shade and water stations and the same thing would happen to his sheep?",
            "How is it so easy to convince people to believe in a God no has seen before? God doesn't talk to people directly through the sky so everyone can hear a loud echo voice from the sky. I have never heard God's voice God never talked to me. I grew up believing because I was taught. And even then I was a bit suspicious. The Adam and eve story never made sense to me. Evolution makes more sense",
            "No wonder the book says that a majority of hell inhabitants are women.",
            "Where did you get the part about women dying during hajj are not considered martyrs? I haven’t come across this.",
            "darwin + god + handshake meme",
            "How is it so easy to convince people to believe in a God no has seen before? God doesn't talk to people directly through the sky so everyone can hear a loud echo voice from the sky. I have never heard God's voice God never talked to me. I grew up believing because I was taught. And even then I was a bit suspicious. The Adam and eve story never made sense to me. Evolution makes more sense",
            "He's worse than Hitler.",
            "They’ll be sad that their loved ones are gone from their lives and will be missed. They’ll be fucking ecstatic that they’re going to heaven.",
            "Underrated comment ",
            "Yes ialam took some pagan rituals. One of is this rock. Yes we are all mortal but this is literally you dying on purpose. Either that or being completely ignorant. There is nothing that says here “it was his time “. If he was hit by car-fine. But purposely going somewhere to spend time on 50 degrees knowing how fatal that can be is not poetic at all. Purposely dying in these scorching heat conditions is not even sensible. But i do understand that because you put this pilgrimage so high on your pedestal of worshipping, dying there is something special, for you.",
            "How is it so easy to convince people to believe in a God no has seen before? God doesn't talk to people directly through the sky so everyone can hear a loud echo voice from the sky. I have never heard God's voice God never talked to me. I grew up believing because I was taught. And even then I was a bit suspicious. The Adam and eve story never made sense to me. Evolution makes more sense",
            "Didn’t he pretty much just do this in Las Vegas?\n\n> Six people were hospitalized for heat-related illnesses after attending a Donald Trump rally in Las Vegas Sunday in sweltering 104-degree temperatures, according to officials.",
            "Same. I never once had a prayer answered - nothing but crickets.",
            "No, the point was that women do not attend hadjj, as it is a male only affair.",
            "I like the argument that it's just evolution.  If at night you and the caveman Bois are sitting around the fire and hear a bustle in the hedges, most will think it's nothing. Then get eaten by a bear.  The caveman who thinks there must be something in the bushes, be it demons, monsters, ghosts, ect, runs and hides, and survives.",
            "Edit. I have become aware that recently women can attend hajj. It was once a male only event",
            "That's a fair take, though one we really should have outgrown by now. Evolution is slow, sure, but it's depressing how many people will ignore obvious evidence because they prefer faith over facts."
        ]
    },
    "The Bible was written before glasses were invented": {
        "title": "The Bible was written before glasses were invented",
        "score": 44,
        "url": "https://www.reddit.com/r/atheism/comments/1dlu42v/the_bible_was_written_before_glasses_were_invented/",
        "content": "Now I’m not sure whether or not the Bible were written by actual people who believed what they were writing all those years ago, but Christians love to go on about how according to historical records Jesus actually existed, so I’ve been thinking of various reasons the people who wrote the Bible wrote what they did.\n\nThen I realized that was a time before glasses. Also before several mental illnesses such as schizophrenia were diagnosed, not to mention the prevalence of alcohol which even the Bible discusses. Combine those and a floating log can very quickly become a man walking on water.\n\nCould also have just been mass hallucination lol.",
        "num_comments": 19,
        "comments": [
            "The bible is a collection of writings that are largely oral traditions from various religious sects. It was almost never written, first hand, by the person the book is named after.",
            "1024: Floating log is a man walking on water \n\n\n2024: Floating log is the Loch Ness Monster",
            "And don't forget about the psychedelic mushrooms growing in the Middle East back then",
            "I’m just picturing some eagle-eyed atheist in a tribe around a fire like “THE VOLCANO DOESN’T HAVE HUMAN FEELINGS!”",
            "There is a new body of work that exactly addresses the issues of reading and writing the bible while having degraded vision.  It is quite interesting. \n\n[Candida Moss lays it our here](https://www.amazon.com/Gods-Ghostwriters-Enslaved-Christians-Making/dp/0316564672/). \n\nBasically, if some dude like Paul, for example, got old and was still cranking out epistles but could no longer see well enough, he would be using reading and writing help, possibly slaves or former slaves.  \n\nAnd if that were the case we might expect to see some bias creep in due to the facts that the slaves disintermediated the author from their own work.",
            "Don't write it off as a mental illness or lack of glasses. People back then were not dumber than today and knew pretty well that one can mistake something for something else due to poor vision. The knew people can be mad and see what nobody else sees.\n\n\n  Scientology was created when everybody could buy glasses for cheap. Did it help?",
            "Jesus walked on ice \n\nPeter fell through thin ice",
            "Don't understand the prevalence of lead in these people's diets",
            "Then everyone played the scribe equivalent of \"telephone\"...no wonder it's all fucked up.",
            "Even now people refuse to believe the earth is round and other various fundamental facts about existence.\n\nDon't try to rationalize irrationality. You will just give yourself an incorrect idea about how people will actually behave.",
            "Landsborough, D., 1987. [St Paul and temporal lobe epilepsy](https://www.ncbi.nlm.nih.gov/pmc/articles/PMC1032067/). Journal of Neurology, Neurosurgery & Psychiatry, 50(6), pp.659-664.\n\nMurray et al, 2012. [The role of psychotic disorders in religious history considered](https://neuro.psychiatryonline.org/doi/full/10.1176/appi.neuropsych.11090214). *The Journal of neuropsychiatry and clinical neurosciences*, *24*(4), pp.410-426.",
            "there even is a plant that excretes volatile oils that catch fire without burning the plant down if a spark comes close to it on windstill days.\n\ndictamnus albus",
            "Also, people lied to have a good story.",
            "Also John of Patmos was pretty obviously high on the hallucinogenic mushrooms found on the island of Patmos",
            "Cool. Do Harry Potter next.",
            "Yeah. People have always been smart and dumb. Lots of people believe in easily disproven things today. Look at flat earthers. It doesn’t mean anything.",
            "There is NO way that dude wasn't tripping balls writing that"
        ]
    }
}