{
    "Bitte die Regeln lesen!": {
        "title": "Bitte die Regeln lesen!",
        "score": 458,
        "url": "https://www.reddit.com/r/BinIchDasArschloch/comments/q9xet8/bitte_die_regeln_lesen/",
        "content": "Hallo, \n\nIn letzter Zeit merkt man, dass immer häufiger gegen die Regeln verstoßen wird und man hat auch den Eindruck, dass viele die Regeln nicht kennen.\n\nInsbesondere gegen Regel 4 (jeder Topkommentar soll ein Bewertungskürzel BDA, NDA, KAH oder ASA enthalten oder bei zu wenigen Informationen INFO)\nwird momentan unter fast jeden Post verstoßen. Der Bot, der den Beitragsflair als Gesamtbewertung bestimmt, kann nur die Kürzel erkennen, also werden Kommentare ohne Kürzel nicht mitbewertet, daher hat diese Regel auch ihren Sinn. \nZuvor wurde der Verstoß auch angemerkt, aber einige hat das nicht interessiert und immer wieder gegen Regel 4 verstoßen.\n\nAußerdem solltet ihr auch an Regel 1 denken. Seid kein Arschloch, beleidigt und greift niemanden an! \n\nWir werden daher von jetzt an bei Verstößen härter eingreifen. \n\nEuer Mod-Team",
        "num_comments": 149,
        "comments": [
            "BDA Könnt ihr mal die Acronyme in die Sidebar schreiben. Ich hab keine Ahnung was ASA und KAH ausgeschrieben sein sollen.",
            "ASA\n\nIch würde (mal wieder) zum besten geben, dass es einen Unterschied zwischen \"Topkommentar\" und \"Top-Level Kommentar\" gibt, so rein sinntechnisch.\n\nDas eine kann man machen, beim anderen hat man immer noch keinen Einfluss darauf. (Sorry, die Spitzfindigkeit sind mir die Downvotes wert...)",
            "NDA\nGuter Reminder",
            "Liebe Mods, bitte macht aus dem Debatiersub in den Regeln einen Debattiersub. Danke.",
            "[deleted]",
            "Was heißt eigentlich WIDA? Lese das des Öfteren und finde dazu einfach nichts 😄Scheint ja einfach BDA zu sein, aber komme einfach nicht drauf, was die Abkürzung genau bedeuten soll 🤔",
            "ASA die OPs downvoten, die sie für Arschlöcher halten. Das sollte idealerweise auch wenigstens diesem Regelsatz hinzugefügt werden. Up- und Downvotes sollten davon abhängen, wie interessant die Fragestellung ist. Hier im Sub sind wenigstens 9/10 der OPs mit den meisten Upvotes stinkuninteressante Selbstestätigungsposts der Sorte \"bin ich das Arschloch wenn ich bösen Menschen die Stirn biete\".",
            "Kann mir jemand erklären, wie die Abstimmung funktioniert? Habe es im Faq an der Seitenleiste nicht gefunden.\n\nIn folgendem Thread überwiegen die NDA Antworten sowohl in absoluter Zahl gegenüber den BDA Stimmen als auch bei den Upvotes. Dennoch wurde der Thread mit BDA getaggt.\n\nhttps://www.reddit.com/r/BinIchDasArschloch/comments/s3pl0u/bida\\_wenn\\_ich\\_mich\\_nicht\\_testen\\_will\\_ob\\_ich/",
            "BDA  Meckern ist nie gut.",
            "Wie würde man an einen OP antworten, um eine Nachfrage zu stellen, ohne die man das geschilderte Verhalten nicht einordnen kann?",
            "Was heißt denn TL;DR ?",
            "Können wir mal irgendwo einen deutlicheren Hinweis posten, dass Arschlöcher *nicht* runtergewählt werden sollen (zumindest der Post selbst)? Steht zwar in Regel 4, wird aber offensichtlich missachtet, was dazu führt, dass interessante Posts in denen der OP nunmal das A ist, begraben werden.\n\nVielleicht sowas wie auf r/de, wenn man dort mit der Maus auf den Runterwähl-Pfeil geht (nur hovern), dann kommt die Meldung \"Dies ist kein 'Widerspruch'-Knopf\". Hier könnte man also sowas wie \"Dies ist kein 'Arschloch'-Knopf. Bitte Regel 4 lesen\" implementieren",
            "Leider werden - trotz oder vielleicht sogar wegen des - Unsichtbarmachens des Downvote-Pfeiles noch immer Beiträge downgevotet, obwohl sie zum Thema gehören und nur einfach \"anders als der Mainstream\" sind. Bitte justiert da nochmal nach!",
            "Könnte der Verfasser dieses Post den Post so Editieren das die Kürzel auch ausgeschrieben werden bitte",
            "👍",
            "Regeln befolgen. Ist notiert.\nBy the way danke für die umfasende Erklärung.",
            "Wieso wird mein Post bereits wenige Sekunden nach dem Posten gelöscht?",
            "Thank you for addressing this issue. It's important to remember that rules are in place for a reason and it's up to all of us to follow them to maintain a positive and respectful community. Let's work together to make this a better place for everyone.",
            "Info: Warum darf man Querdenker, Antisemiten und ähnliche nicht beleidigen? Ergibt für mich keinen Sinn. Keine Toleranz für Abschaum",
            "Hilfe, ich habe eine Story von über 15k Zeichen. Was mach ich jetzt damit?",
            "[deleted]",
            "Idee:\n\nIch vermute, dass viele Nutzer nur die Überschriften der Regeln lesen. Das ist zwar deren Fehler, aber es würde euch Arbeit ersparen wenn ihr selbst was dagegen tun könnt.\n\nRegel 4 könnte um das abzufedern in 3 Regeln aufgeteilt werden damit die einzelbestandteile sichtbarer werden, zb:\n\n* Top-Level Kommentare mit Bewertung flaggen\n* Keine Mehrfachbewertungen\n* Downvote keine Arschlöcher",
            "BDA\n\nUnd was wenn ich schlicht weg keine Bewertung zu einem post abgeben möchte sondern schlichtweg eine Frage zum Thema habe?\n\nUnd damit meine ich jetzt zB Fragen wie   \"Verstößt Person A hier nicht gegen §XY STGB?\"",
            "Wurde von meiner Homepage hierhin geleitet, habe dann direkt kommentiert, my bad",
            "[removed]",
            "Und was bedeutet ASA usw. Das steht nirgends",
            "[removed]",
            "KAH\n\nWie lange kann ein Post eiglt bewertet werden, bis die Auszählung erfolgt?",
            "Bda- bist das Arschloch \nNda- nicht das Arschloch\nAber was sind die anderen zwei?",
            "BDA\n\nRegel 4 hat zwei Teile. Zum einen die Bewertungen zum anderen die Votes\n\n\nGegen den zweiten Teil der Regel wir auch massiv verstoßen. Vielleicht, weil es nur als Anhängsel formuliert ist und kein Bot an diese Regel erinnert.",
            "Durchgreifen nicht eingreifen",
            "[removed]",
            "Darf/sollte/ kann - man nach einem Urteil noch was dazu sagen?",
            "BDA",
            "[deleted]",
            "ASA",
            "Info: Blöde Frage... Im englischen Original AITA gibt es die Regel, dass keine Posts zu romantischen Beziehungen als Hauptthema gemacht werden dürfen. Ich habe hier aber schon ein paar solche gesehen. Bin ich dann korrekt in der Annahme, dass diese Einschränkung hier nicht gilt oder habe ich es nur nicht begriffen?",
            "BDA kann man nicht einfach aufhören so zwanghaft an der originalseite zu hängen und aufhören mit diesen Kürzeln, solange man aus dem Kommentar selber deutlich herauslesen kann was gemeint ist?",
            "INFO Kann mir jemand erklären, was „WIDA“ und „OP“ bedeutet ?",
            "[removed]",
            "NDA Hallo, warum werden meine Posts nie veröffentlicht? Danke",
            "[deleted]",
            "BDA",
            "Hallo was bedeutet eigentlich WIDA?",
            "[removed]",
            "Mir ist leider zuletzt vermehrt aufgefallen, dass Regel 4 nicht nur in Bezug auf die fehlende Wertung, sondern vor allem auch auf die Downvote-Regel gebrochen wurde. Gibt es da Ansätze, wie man dagegen vorgehen könnte? Denn da sehe ich leider das Potenzial, dass \"aneckende\" Urteile immer seltener fallen, weil man einfach keinen Bock auf die ganzen Downvotes hat...",
            "[removed]",
            "Sorry das ich Frage, ich bin neu bei Reddit und weiß nicht, wie ich irgendeine BIDA Geschichte schreiben soll. Würde es mir bitte jemand erklären? Danke",
            "BDA sorry hab erst seit gestern Reddit... wo stehen denn die Regeln? Ok diesem thread entnehme ich zumindest mal Regel 4.. vor jeden kommi son Kürzel machen.. und was ist mim Rest? ^^'",
            "Bei den Kürzeln der Sidebar ist mir aufgefallen, dass diese meiner Meinung nach unvollständig sind. Wäre es nicht angebracht neben den bereits vorhandenen noch eins für jemand anderes ist ein Arschloch zu haben?  Oder wird dies durch NDA impliziert, da es sich meist um eine kontroverse moralische Situation von zwei Parteien handelt und somit bei NDA automatisch nicht OP sondern die andere Partei das Arschloch ist?",
            "Ich bin ganz neu bei Reddit und auch in diesem sub Reddit.  Was heißt denn bitte top Kommentar ? Also der Kommentar der am meisten geliket wurde?",
            "Was ist wenn ich wissen will ob jemand das Arschloch ist  und ich weiß schon vorher, dass ich es nicht bin? Geht das auch?",
            "ASA weil sie die Regeln nicht lesen!",
            "Wirklich!!",
            "Wir haben das ja schon geklärt, aber nochmal für alle, die sich die gleiche Frage stellen:\n\nASA = Alle sind Arschlöcher\nKAH = Keine Arschlöcher hier",
            "Naja, dann sollte man halt generell eins der Kürzel oder Info reinschreiben.",
            "Was heißt ASA?",
            "Wichtigeres gab es nicht",
            "Name checkt aus",
            "Glaube er zählt das erste Kürzel das vorkommt, aber ich pinge mal u/Phteven_j \\- der ist das Brain hinter dem Bot.",
            "Wär ich das Arschloch",
            "Ich glaube das ist bei regel 4 unter arschlöcher nicht downvoten schon untergebracht.",
            "Hallo. In diesem Fall bin ich mir auch nicht sicher, ich habe u/Phteven_j unseren Botschreiber darauf angeschrieben, und melde mich nochmal, wenn ich eine Antwort habe.\n\nZwei Sachen kann ich dir so schon sagen:\n\n1. Steht in einem Kommentar mehr als eins der Kürzel, kann der Bot diesen Kommentar nicht auswerten, die Wahl ist daher ungültig.\n\n2. Wie in den Regeln schon erwähnt, sind up- und down votes kein Wahlmittel. Down votes sollen eigentlich nur genutzt werden, um Kommentare die nichts mit dem Thema zu tun haben, oder sich nicht an die Regeln halten runterzuwählen.\nDaher wird auch das nicht in die Wahl mit einbezogen.\n\nBei deinem Beispiel passt es aber auch mit den ungültigen Kommentaren nicht, daher warte ich wie gesagt noch auf Antwort vom Botschreiber.",
            "Mit \"Info\". Wenn Info im Kommentar enthalten ist, kannst du Fragen stellen etc.",
            "too long, didn't read, deutsche Abkürzung: ZL;NG",
            "Ich leite es an die anderen Mods weiter.",
            "Das einzige, was wir noch machen können ist \"contest mode\", aber das ist mehr für Kommentare. Da werden keine Scores gezeigt und die Sortierung ist auch zufällig.\n\nDie unsichtbaren downvotes funktionieren leider nur in lightmode :/\n\nWir warten mal ab, wie das mit dem unsichtbaren downvote button läuft und melden uns später mal wieder.",
            "[Siehe hier](https://www.reddit.com/r/BinIchDasArschloch/s/8wvDS9OS7Y)",
            "Du darfst die nicht beleidigen. Das ist eine Sache des Anstands. Solche Leute solltest du melden oder bei schweren Fällen eine Modmail an uns schreiben. Wir kümmern uns dann darum.",
            "Die Story auf 3000 Zeichen kürzen",
            "Der Bot braucht die Kürzel um ein Urteil berechnen zu können.",
            "Deinem Kommentar fehlt eine Bewertung.(Siehe Regel 4)\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/BinIchDasArschloch) if you have any questions or concerns.*",
            "Alle sind Arschlöcher Das steht unter anderen in den Regeln (Regel 4), in den Automod Kommentar unter den Posts, im Glossar",
            "Deinem Kommentar fehlt eine Bewertung.(Siehe Regel 4)\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/BinIchDasArschloch) if you have any questions or concerns.*",
            "Meines Wissens 2 Tage",
            "ASA -alle sind Arschlöcher\nKAH- kein Arschloch hier\n\nKannst du auch angepinnt unter jeden Post und in den Regeln finden.",
            "NDA - OP ist keins, aber die andere Seite\nBDA - OP ist eins, die andere Seite nicht\nKAH - beide Seiten sind keine\nASA - beide Seiten sind A\nINFO - ich brauche mehr Information oder ich hab keine Meinung, dafür aber einen Hinweis",
            "Na sicher",
            "Gibt es dazu auch eine Begründung?",
            "Nein, die Einschränkung gilt nicht. Posts zu romantischen Beziehungen sind erlaubt. Aber dabei ist Regel 14 zu beachten. Also nicht BIDA, weil ich XY (nicht) date, BIDA, weil ich ABC (nicht) attraktiv finde. Und im Vordergrund sollte die Frage nach dem Urteil stehen und es sollte nicht vordergründig nach Ratschlägen gefragt werden. Dafür wäre r/Beziehungen da.",
            "Und warum nicht? Dann ist ja langweilig",
            "Nochmal: der Bot erkennt nur die Kürzel, ohne Kürzel geht das Urteil somit nicht in die Gesamtbewertung (siehe Beitragsflair von Posts älter als 2 Tage) ein. \n\nAußerdem gab es vor ein paar Monaten eine Zeit, als über die Hälfte keine Bewertung schrieb. Daher setzen wir das streng durch.",
            "WIDA: wäre ich das Arschloch\nOP: Original Poster",
            "Dein Beitrag erscheint uns absurd, weswegen er entfernt wurde, weil er gegen Regel 5: hypothetische Situationen verstößt.",
            "keine Ahnung, ich glaube du wurdest von Reddit gesperrt",
            "BDA heißt Bist Das Arschloch",
            "Ok",
            "\"Wäre Ich Das Arschloch\"",
            "[removed]",
            "Dein Beitrag wurde entfernt, weil er als rassistisch verstanden wurde.",
            "Ich habe die Frage an die anderen Mods weitergeleitet. Wir diskutieren nun mögliche Lösungen",
            "Dein Beitrag wurde entfernt, weil er gegen Regel 1: Seid freundlich verstößt.\n\nMan sollte gegenüber allen freundlich sein, nicht nur gegenüber OP. Nächstes mal einfach anders umschreiben dann passt auch alles. Zbs \"Mist\" wäre noch akzeptabel :)",
            "https://www.reddit.com/user/zuzieey7719/comments/wbbs37/wie_postet_man_auf_reddit_mobil/?utm_source=share&utm_medium=android_app&utm_name=androidcss&utm_term=1&utm_content=share_button\n\nDer Titel muss BIDA/WIDA enthalten.\n\nNach dem Posten sendet dir ein Bot eine Nachricht in deine Inbox (nicht als Kommentar). Auf die musst du antworten. Dann ist dein Beitrag freigeschaltet.",
            "Wenn du die mobile App benutzt, geh auf r/BinIchDasArschloch und tippe auf der Subseite auf community informationen anzeigen",
            "Eigentlich sollte das durch NDA impliziert werden. Trotzdem danke für die Anregung.",
            "Wenn du unter einen Beitrag kommentierst, ist es ein Top-Kommentar. Wenn du einem anderen Kommentar antwortest nicht.",
            "Achso und ich finde die ursprünglichen Regeln leider nicht , wo finde ich diese denn ?:)",
            "Kannst du auch, trotzdem sind alle Regeln weiterhin einzuhalten. Also BIDA/WIDA im Titel und du musst  der Botnachricht eine Begründung geben, warum die Person das A sein könnte.",
            "Du glaubst nicht, wie häufig Leute in den Modmails nicht wissen, dass es Regeln gibt.",
            "ASA = American Surgical Association\n\nKAH = Killer Aal Haifische",
            "Sind bei mir im Browser auch sichtbar. In Rule #4, und nochmal extra unterhalb der Regeln im Glossar.\n\nDas im Post erwähnte INFO kommt allerdings an beiden Stellen nicht vor.",
            "Ist der Unterschied von NDA und KAH hier das KAH besagt, dass Niemand im Unrecht ist?\n\n(Tut mir leid für diese eventuell doofe Frage. Bin gerade eben auf dieses Su reddit gestoßen)",
            "es gibt auch neue nutzer???",
            "Stimme ich dir bei einem Top-Level-Kommentar zu, ein Topkommentar muss kein Top-Level-Kommentar sein und hierfür würde Regel #4 nicht gelten, da der Topkommentar durch Upvotes bestimmt wird, während der Top-Level-Kommentar vom Ersteller direkt unter den Post geschrieben wird (und auch nur dann Regel #4 greift).",
            "Alle Sind Arschlöcher",
            "Nee, es muss nur eins geben sonst wird es manuell Flair brauchen",
            "Ich sehe hier gar keine Regeln, gibt es da eine Sonderseite? Regel 4? Wo denn?\n\nUnd da eigentlich regelmäßig für Arschlöcher gehaltene OPs runtergewählt werden, würde ich dringends einen Sticky empfehlen der im Titel für jeden sofort ersichtlich erklärt, warum das hier dämlich dämlich dämlich ist.",
            ">Wie in den Regeln schon erwähnt, sind up- und down votes kein Wahlmittel. Down votes sollen eigentlich nur genutzt werden, um Kommentare die nichts mit dem Thema zu tun haben, oder sich nicht an die Regeln halten runterzuwählen. Daher wird auch das nicht in die Wahl mit einbezogen.\n\nwie unten beschrieben, stimmt das Wahlsystem so wie du es erklärt hast nicht mit der technischen Umsetzung überein (und ich finde es sogar schlechter, dass dadurch beispielweise ein einziges DBA mit 20 Upvotes 10 andere NDA Votes mit jeweils 15 Upvotes überstimmen würde. das System sollte überdacht werden, aber zumindest die Regeln müssen dringend angepasst werden.\n\nLiebe Grüße!",
            "danke <3",
            "Wie gesagt: Das Problem ist halt, dass Downvotes offensichtlich nicht (nur) für Spam und Thema verfehlende Kommentare genutzt werden, sondern (auch) für Kommentare, denen man nicht zustimmt. Auf Dauer werden dadurch unliebsame Meinungen gewissermaßen bis zur Unsichtbarkeit downgevotet.",
            "Jo danke. Hab's gestern doch noch gefunden",
            "Dankeschön!",
            "Is \"bist kein Arschloch' und \"kein Arschloch hier\",nicht das gleiche?",
            "[deleted]",
            "Danke für die schnelle Erklärung 👍",
            "Das müsstest du im AITA subreddit nachschauen 😬",
            "Dein Beitrag wurde entfernt, weil er als rassistisch verstanden wurde.",
            "Vielen Dank  auch für die ultraschnelle Reaktion.",
            "Super vielen Dank, habs gefunden 👌",
            "Alles klar danke für die Klarstellung.",
            "Wenn du in der Mobile App bist, schau auf der Hauptseite unter Community Informationen.",
            "yo check your dms i sent you my anus bro",
            "Unterbewertet..",
            "Das ist eine gute Anmerkung, darüm kümmern wir uns!",
            "Genau. NDA impliziert, dass jemand anderes in der Geschichte das A ist. KAH bedeutet, dass niemand sich falsch verhalten hat.\n\nGenauso bedeutet BDA, dass jemand in der Geschichte sich nicht falsch verhalten hat, während ASA bedeutet, dass alle sich doof verhalten haben zu einem gewissen Grad.",
            "Typisches Beispiel für KAH sind Missverständnisse zwischen Leuten die sich aber alle okay verhalten oder valide Werteunterschiede zwischen datenden Partnern wie zb. X will Kinder Y nicht jetzt trennt sich X und Y formuliert Trauer aus Vorwürfe zu machen und X fühlt sich schuldig und fragt \"BIDA?\"\n\nASA wäre zb... A drängelt mit Hupe und Lichthupe auf der Autobahn  während beide n LKW überholen und schneidet B danach beim Überholen und statt zu bremsen gibt B gas und knallt voll rein.. und dann fragt einer der beiden \"BIDA?\"",
            "Ja gibt es",
            "Tja, das ist schon sehr kompliziert. \nIch muß zugeben, daß ich keine Ahnung hatte, was der Bot mir von wegen Bewertungen und Topkommentar mitteilen wollte, da mein Komme tar mit einem Vote ganz sicher KEIN Topkommentar ist. \nZum Teil klingen offizielle Aufforderungen und Erklärungen auch unhöflich- was ich verstehen kann, wenn alt eingesessene User sich immer wieder über Regeln hinwegsetzen, aber es gibt auch neue User die dann doof dastehen und sich fragen, was es mit dem unhöflichen  oder ungewohnt - sachliche ?!- Ton auf sich hat.\nIch habe aber in meinem Fall aus dem Kontext erschlossen, was man von mir will, aber daß es bei manchen Verwirrung hervorruft kann ich schon verstehen. \nAußerdem habe ich den Beitrag den ich kommentiert habe per Email von Reddit empfohlen bekommen und habe an keinem Punkt diese Regeln angezeigt bekommen. Nicht im Beitrag selbst und auch nicht bei dem clicken auf antworten und schon gar nicht in dem oder um das Texteingabefeld herum. \nWenn man dann also wiederholt etwas zu den Regeln gefragt wird, kann die Antwort auch zuvorkommender klingen. 🤷 Nicht \"zum wiederholten Male... Aber noch mal...\" Man könnte schreiben \n\n\"Oh, es tut uns leid, daß man unsere Regeln nicht vor oder bei dem Antworten mit der App (oder auch bei der Browser-Version?) angezeigt werden und du deshalb vielleicht die Regeln mit den dazugehörigen Erklärungen nie gesehen hast. Das.liegt vielleicht daran, daß man auch antworten kann, wenn man dem SUB nicht beigetreten ist. Wärst du beigetreten, hättest du die Regeln angezeigt bekommen (Ich rate nur, keine Ahnung ob man die Regeln dann angezeigt bekommt)\nDas war wohl unser Fehler, also hier nochmal die Erklärung und *Link zu den Regeln*\"\n\nUnd wenn das Anzeigen der Regeln bevor jemand antworten clickt und/oder beitritt technisch nicht realisierbar ist, sollte man vielleicht ganz anders an die Sache rangehen. \n\nEs kann einem natürlich auch einfach egal sein, weil man so oder so genug User hat und man auf den ein oder anderen, der wegen so etwas nicht Beitritt auch verzichten kann. Denn letzten Endes  ist das ein kostenloser Service und User haben ohnehin kein Anrecht auf irgendetwas - also auch nicht auf Höflichkeit und nette Kommunikation. Dann sollte man das allerdings auch nicht von den Usern fordern.\n\nIch sag' ja nur . 😂 So - ganz kurz praktisch... 😘\n\n[Edit Jan. 10th 2024: Einen Fehler korrigiert und eine Formulierung geändert.]",
            "Hast du recht, da hatte ich das vorher offensichtlich falsch im Kopf. Wir arbeiten dran!",
            "Hey - danke für die Frage. Ich hab den Post gecheckt und es scheint normal aus. Unser Bot zählt nur den Kommentar mit den meisten Upvotes (genau wie bei AITA) und in diesem Fall hat Dragaril die meisten bekommen. Reddit benutzt ein anti-Spammer Funktion das heisst \"Vote Fuzzing\" damit die Votes sich etwas ändern. Wenn du den Post neu lädest werden die Zählungen +/- ein Paar Punkte höher oder weniger werden. \n\nHier ist der Algorithmus der Bot benuzt (auf English weil ich Amerikaner bin lol)\n\n    keywords = [\"BDA\", \"NDA\", \"ASA\", \"KAH\", \"Nda\", \"Bda\", \"Kah\"]\n\n    for comment in post.comments:\n\t\tkeyword_count = 0\n\t\tused_keywords = []\n\t\tif comment.is_root and comment.author and comment.author.name != username and comment.author.name != 'AutoModerator':\n\t\t\tfor keyword in keywords:\n\t\t\t\tif keyword in comment.body:\n\t\t\t\t\tkeyword_count += 1\n\t\t\t\t\tused_keywords.append(keyword.upper())\n\t\t\tif (not top or comment.score > top.score) and keyword_count > 0:\n\t\t\t\ttop = comment\n\t\t\t\tif keyword_count == 1:\n\t\t\t\t\tmanual = False\n\t\t\t\telse:\n\t\t\t\t\tmanual = True",
            "Da können wir leider nichts mehr machen. Viele Menschen verwechseln downvotes mit dislikes. Die Reddiquette erklärt das eigentlich auch.",
            "Nda ist du bist nicht das a, aber der andere,  kah ist niemand das a",
            "Warum soll ich das Arschloch sein?",
            "gg",
            "this is the funniest shit ive ever read lmao",
            "Okey, vielen Dank für die Erklärung (auch noch nach 8 Monaten🙈) ☺️!",
            "cringe kpop fan",
            "das war sakastisch",
            "super!",
            "vielen Dank für die technische Erklärung, leider finde ich das System (wie ich weiter oben bescrhieben habe) nicht ganz fair, wie man an dem Beispiel sieht.",
            "Ist halt nur die Frage, was dann eine Regel bringt, deren Nicht-Einhaltung keinerlei Konsequenzen hat... ;)",
            "Jo ich verstehe auf jeden Fall - das System fängt mit /r/AmItheAsshole erst an und ich habs hier fast genau kopiert. Wir könnten es einfach ändern wenns alle möchten, ist ja nicht meine Entscheidung :)",
            "Ist nur da, damit wir Leute daran erinnern können, wie man Voten soll.\n\nWir können es ja gar nicht durchsetzen, da wir nicht sehen, wer wie was Voted, sondern nur Leute davon so halbe abhalten können, falsch zu Voten (mit Unsichtbaren Downvotes etc.)\n\nIch wäre auf ein Gegenvorschlag gespannt",
            "Danke für die Erklärung. \n\nFür einen sinnvollen Gegenvorschlag habe ich leider zu wenig Einsicht in die Moderatoren-Seite und was technisch so möglich ist. Mein nächster Schritt wäre vermutlich, zu schauen, ob ich die Downvotes nicht komplett abschalten kann oder so etwas und mir für Themaverfehlungen irgendein anderes System überlegen... aber ich bin sicher, dass euch da was besseres einfällt ;)",
            "Downvotes ausschalten geht nicht. Es ging mal auf old reddit mit CSS Tricks, wo man dann tatsächlich keine Downvotes mehr drücken konnte. The_Donald hat das so gemacht.\n\nVielleicht lässt sich was mit der Dev Plattform machen, wenn sie dann Verfügbar sein wird.",
            "Wie gesagt: Ich bin mir sicher, dass euch etwas besseres einfällt als mir ;)"
        ]
    },
    "Antwortet dem Bot, damit euer Beitrag online gehen kann! - Wie poste ich?": {
        "title": "Antwortet dem Bot, damit euer Beitrag online gehen kann! - Wie poste ich?",
        "score": 67,
        "url": "https://www.reddit.com/r/BinIchDasArschloch/comments/14jmd29/antwortet_dem_bot_damit_euer_beitrag_online_gehen/",
        "content": "PSA\n\ndenk beim Posten von Beiträgen bitte daran, unserem Bot seine Frage zu beantworten, damit dein Beitrag online gehen kann!\n\nNachdem du auf „Posten“ geklickt hast, wirst du in deiner Inbox eine Nachricht von unserem BIDA Bot vorfinden. Er stellt dir eine Frage. \n\n**Du hast nach Erhalt der Nachricht 30 Minuten, um zu antworten!**\n\nAntwortest du nicht, geht dein Beitrag auch nicht online. \n\nWozu ist die Frage gut? \n\n- Die Antwort ist unter anderem eine Art tl;dr für die Community. Sie ist außerdem eine Spam-Kontrolle für uns Mods. \n\n\nDenke beim Schreiben eines Posts auch an den Wordcount, **mache den Text leichter lesbar, indem du Absätze einbaust** und beschreibe dein zwischenmenschliches Problem ausführlich, ohne zu ausschweifend zu sein. \n\nViel Spaß beim Posten und auch beim Urteilen - und immer freundlich bleiben.",
        "num_comments": 23,
        "comments": [
            "Wo ist denn die Frage? Habe keine Frage bekommen",
            "Ok danke",
            "Sorry, aber wo finde ich meine inbox !? Bei meinen Nachrichten ist nichts dabei 😕???",
            "Hä?",
            "Danke fürs Posten! Dieser Kommentar ist eine Kopie deines Posts, sodass Leser deinen originalen Text sehen können, falls dein Post gelöscht oder bearbeitet wird. Dieser Kommentar beschuldigt dich NICHT irgendetwas kopiert zu haben.\n\n\nPSA\n\ndenk beim Posten von Beiträgen bitte daran, unserem Bot seine Frage zu beantworten, damit dein Beitrag online gehen kann!\n\nNachdem du auf „Posten“ geklickt hast, wirst du in deiner Inbox eine Nachricht von unserem BIDA Bot vorfinden. Er stellt dir eine Frage. \n\n**Du hast nach Erhalt der Nachricht 30 Minuten, um zu antworten!**\n\nAntwortest du nicht, geht dein Beitrag auch nicht online. \n\nWozu ist die Frage gut? \n\n- Die Antwort ist unter anderem eine Art tl;dr für die Community. Sie ist außerdem eine Spam-Kontrolle für uns Mods. \n\n\nDenke beim Schreiben eines Posts auch an den Wordcount, **mache den Text leichter lesbar, indem du Absätze einbaust** und beschreibe dein zwischenmenschliches Problem ausführlich, ohne zu ausschweifend zu sein. \n\nViel Spaß beim Posten und auch beim Urteilen - und immer freundlich bleiben.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/BinIchDasArschloch) if you have any questions or concerns.*",
            "ok",
            "Ist es irgendwie möglich, die Antwort zu ändern/ändern zu lassen?",
            "[removed]",
            "Bei mir erscheint keine Nachricht dieses Bots - was muss ich jetzt tun?",
            "Danke für die Erklärung",
            "Ich habe keine Frage erhalten, wie lange dauert das ca. bis man die bekommt?\nEdit: Schon gefunden, Problem gelöst!",
            "Wann hast du einen Beitrag verfasst? Ich sehe keinen. Bei Fragen zu einem bestimmten Beitrag bitte DM an BIDA",
            "Uns erreichen mitunter mehrmals täglich Fragen wie: „Warum wurde mein Post gelöscht?“, u. ä., weil die OPs nach dem Posten nicht dem Bot geantwortet haben.\n\n&#x200B;\n\nDies ist ein Reminder.\n\n&#x200B;\n\nBei Unklarheiten immer mal wieder in die Regeln schauen, oder dem Mod-Team eine Nachricht schicken.",
            "Die Antwortmöglichkeit besteht nur einmalig.",
            "Dein Post wirkt unglaubwürdig, deswegen wurde er entfernt, da er gegen Regel 3: keine Shit-Posts verstößt.",
            "Habe vor kurzem einen Beitrag verfasst, leider keine Nachricht vom Bot bekommen.\n\nSoll man dann am besten es einfach nochmal versuchen?",
            "Ich habe gar nichts gepostet; lediglich eine Benachrichtigung erhalten die mir ein Rätsel war. Bin auch nicht beigetreten bei „bida“.",
            "Ich weiß, wer du bist. Schau, ob du den BIDA-Bot geblockt hattest. Ich schalte den Beitrag erstmal frei.",
            "Reddit macht Reddit Sachen und schlägt mitunter Usern verschiedene Beiträge vor. Bester Zeitpunkt BIDA beizutreten.",
            "Oh sorry, hab deine Nachricht nicht rechtzeitig gelesen und schon nen zweiten Beitrag geschrieben, kannst den zweiten dann gerne löschen, danke!",
            "Finden sie ich „bda“ wegen meiner pampigen Schreibweise? 😁 peace out ✌️",
            "Ja."
        ]
    },
    "BIDA weil ich bestimmte Aussagen nicht rassistisch finde?": {
        "title": "BIDA weil ich bestimmte Aussagen nicht rassistisch finde?",
        "score": 685,
        "url": "https://www.reddit.com/r/BinIchDasArschloch/comments/1dl4g44/bida_weil_ich_bestimmte_aussagen_nicht/",
        "content": "Ich m 29 Jahre mit Migrationshintergrund gerade immer wieder an eine Kollegin 27 ohne Migrationshintergrund.\nEs kommt immer wieder zu Situation, bei denen sie mich im Nachhinein fragt, ob ich das nicht rassistisch fand oder das es sogar rassistisch sei. Als Beispiel: 76 Jährige Patientin fragt mich vorher ich komme. Im Nachhinein meinte meine Kollegin dann „total rassistisch, dass die Leute immer wieder sowas fragen.“\nAnders Szenario: 20 Jähriger deutscher Patient guckt auf mein Namensschild und fragt mich dann „Sind Sie Albaner“ Woraufhin ich antworte „meine Eltern kommen ursprünglich von dort.“ Daraufhin hat der Patient dann den Doppelkopfadler „gezeigt“, auch da meinte später meine Kollegin, dass das rassistisch sei, ein Symbol zu zeigen, obwohl man man selbst kein Albaner sein.\nLetztes Beispiel: 40 Jähriger Patient guckt auf mein Namensschild, will sich bedanken und spricht dabei meinen Namen völlig falsch aus, was vollkommen okay ist. Fragt mich daraufhin auch wie das korrekt ausgesprochen wird, was ich ihm natürlich sage, fragt dann auch, wie lange ich schon in Deutschland bin, weil ich so „gut“ deutsch spreche. Habe ihm dann auch gesagt, dass ich hier geboren bin. Später kam dann meine Kollegin wieder zu mir und sagt „total rassistisch, dass er denkt, du bist hier nicht geboren bist“\nIch hab ihr schon oft gesagt, dass ich solche Dinge nicht rassistisch finde und das sie mir sowas nicht immer wieder sagen, hilft aber nicht. Wir haben auch einen dunkelhäutigen Kollegen, der auch immer wieder das selbe Problem mit ihr hat. Ich meine, klar man muss bestimmte Sachen nicht fragen, aber wenn die Menschen eben neugierig sind, hat es überhaupt nichts mit Rassismus zu tun. Ich frage meine Patienten auch manchmal woher sie ursprünglich kommen, aus Interesse eben, nicht weil es rassistisch motiviert ist.\nMittlerweile nerven mich diese Leute, die meinen, mir sagen zu müssen was ICH als rassistisch zu empfinden habe und was nicht.\nJetzt bin ich aktuell am überlegen, ob ich unseren leitenden Oberarzt frage, ob er mich so einteilen kann, dass ich keine Dienste mit dieser Kollegin habe. Bin ich deswegen ein A und überreagiere? Oder ist es gerechtfertigt, dass ich es schon fast rassistischer finde, wenn mir jemand ohne Migrationshintergrund sagt, was ich, jemand mit migrationshintergrund, als rassistisch zu empfinden habe?\n\nSorry für den langen Text und danke im Voraus für eure Meinung 🙏🏼",
        "num_comments": 418,
        "comments": [
            "Hi, danke für das reinschauen bei r/BinIchDasArschloch! Bitte bleibt freundlich und haltet euch an die Sub-Regeln.\n\n OP hat folgende Begründung gegeben, warum er/sie denkt, dass er/sie ein Arschl*ch wäre oder ist:\n\n > 1. Weil ich nicht mit der Kollegin arbeiten möchte\n2. bin ich mir nicht sicher, wer das A ist",
            "NDA, ihr Verhalten finde ich dir gegenüber ehrlich gesagt relativ respektlos. Du bist ein erwachsener Mensch, wenn du etwas als rassistisch empfändest kannst du das benennen - und sie darf dir das auch gerne zutrauen und ihre ungebetenen Loyalitätsbekundungen für sich behalten. Im übrigen denke ich auch, dass Neugier oder Interesse an der Herkunft seiner Mitmenschen wenig mit Rassismus zu tun haben, ich kann hier zumindest keine herkunftsbezogene Auf- oder Abwertung erkennen. Ist aber auch unerheblich, ich finde das hast immer noch du als möglicher Betroffener zu entscheiden.",
            "NDA - Ich finde es viel eher rassistisch, wenn davon ausgegangen wird, dass alle Ausländer/migras/whatever eine homogene Masse seien die alle die gleichen Meinungen haben. Sowas regt mich richtig auf.\n\nAussagen finden nicht im luftleeren Raum statt und sind daher situativ zu bewerten - ich hätte an deiner Stelle auch kein Problem mit den Aussagen gehabt. Ironischerweise wurde ich erst gestern von meinem Hausarzt gefragt, woher mein Nachname kommt. Honestly dass ein Hausarzt überhaupt Interesse an einem zeigt, finde ich toll, er wollte halt irgendwie smalltalk führen.",
            "Natürlich NDA\n\nSind immer die weißesten Weißen, die sich dazu berufen fühlen, stellvertretend empört zu sein.\nPeinliches Virtue Signalling, man will ja schließlich zu den „Guten“ gehören.",
            "NDA, Ich habe selbst einen \"komischen\" Nachnamen, wo ich sehr oft gefragt werde, wo der Name herkommt oder wo ich 'herkomme'. Solange es nicht eindeutig abwertend von den Leuten gemeint ist, finde ich es nicht schlimm und in den allermeisten Fällen frägt man sowas auch nicht wegen einem rassistischen Motiv sondern rein aus Interesse. Manchmal kriegt man auch einen blöden Spruch reingesteckt aufs Herkunftsland bezogen (bei mir geht es meistens um Fußball und das Essen), dann drückt man halt einen zurück und gut ist. Für mich überhaupt kein Grund, sich da angegriffen zu fühlen. \n\n\nZu deiner Kollegin: Ich habe schon sehr oft mit Leuten wie deiner Kollegin über ähnliche Situationen geredet und manchmal wurde ich am Ende des Tages selbst als Rassist dargestellt, weil ich nicht auf den \"Rassismus\" eingehe. Klar, Rassismus kommt vor und ist scheiße aber solche Menschen setzen immer an der komplett verkehrten Stelle an und tun niemandem einen Gefallen außer sich selbst. Ganz ehrlich, die Menschen, die sich von sowas am meisten angegriffen fühlen und sich am wenigsten in Leute mit Migrationshintergrund rein versetzen können, sind irgendwelche 100%ige Deutsche, die meinen, mit ihrer überfühligen Art die Welt verbessern zu müssen und dabei zum Beispiel MIR vorschreiben zu wollen, was ich als Rassismus zurückzuweisen oder zu akzeptieren habe. \n\n\nWichtig ist, dass DU dich davon nicht angegriffen fühlst und dass kann dir niemand vorschreiben, außer du selbst.",
            "NDA, die Kollegin klingt als habe sie White savior- oder Main-character-Syndrom",
            "NDA\n\nIch Frage sowas auch teilweise wo Leute gebürtig her kommen oder wo ihre Wurzeln sind, einfach um Interesse an der Person zu zeigen und sich besser kennen zu lernen. Gerade wenn jemand dann doch woanders aufgewachsen ist, ist das teilweise total spannend etwas über Herkunft, Lebensgeschichte und Kultur zu erfahren wenn man selbst nie dort war.\n\nAlso nicht alle von uns Deutschen fragen das aus böser Absicht 🤦🏼‍♀️",
            "NDA. Immer witzig wenn \"Weiße\" denken, sie müssten Menschen mit Migrationshintergrund die Welt erklären. Dabei merken sie selbst nicht, wie viel rassistisches Gedankengut sie damit unbewusst verbreiten. Inzwischen sehen sich diese Leute ja sogar als Vorreiter in Sachen Rassismuskritik.",
            "NDA: Kollege du hast eine äußerst gesunde Einstellung. \n\n1. bestimmst du was dich empört/ stört oder beleidigt. \n\n2. ist es eine äußerst positive und gesunde Einstellung zum Leben zu erkennen dass die meisten Menschen Dinge nicht böse meinen, manchmal sind sie neugierig, manchmal wissen sie etwas nicht besser. (Natürlich bezogen auf so gewöhnliche Fragen wie du sie gestellt bekommst)",
            "NDA - sehr anmaßendes Verhalten von deiner Kollegin dich so zu „entmündigen. Als ob du nicht in der Lage weder für dich selbst einzustehen.",
            "Nein, NDA, und du bist nicht der einzige Migrant der dieses permanent darauf auf sein sich rassistisch Diskriminiert zu fühlen mehr als lächerlich findet.",
            "Ganz klar NDA\n\nWichtig ist, wie du dich fühlst. Ich finde es toll, dass du so cool bleibst und einfach drüber stehst. Gerade ältere Leute meinen es meistens nicht böse. Selbst wenn es böse gemeint ist, finde ich es immer noch super, dass du cool bleibst. Alltagsrassismus ist definitiv real, aber du brauchst keine Kollegin, die das für dich einordnen oder bewerten möchte. Bleib einfach, wie du bist.",
            "NDA. machen ja auch bio-einheimische untereinander, jemand hat einen dialekt oder einen seltsamen nachnamen oder auch nicht, und man fragt halt ob der aus ner anderen gegend kommt. finde das auch normal, man stellt verbal kontakt her und klopft mal die ersten offensichtlichkeiten nach gemeinsamkeiten und unterschieden ab. von diesem punkt aus mögen auch assis sich rassistisch profilieren, die mehrheit macht das aber nicht. und ja gewisse sprüche hört jeder menschen mehrfach beim kennenlernen von unterschiedlichen menschen, ist so. kannte jemand, der heisst \"freund\" mit nachnamen, der hörte auch bei jedem kennenlernen denselben witz. das macht den gegenüber nicht unsensibel oder feindselig.",
            "NDA\n\ndie Hybris des ins lächerliche überspannte Zeitgeist. Ständig belehrend, ständig repektlos, ständig sich selbst als etwas besseres darstellend.",
            "NDA , Die Kollegin ist allerdings sehr übergriffig, wenn sie Dir und deinem Kollegen vorschreiben will, was Ihr zu denken und zu fühlen habt.\nVielleicht solltet ihr das mal deutlich sagen.",
            "NDA\n\nIch denke, deine Kollegin ist hier rassistisch. Sie achtet den ganzen Tag darauf ob irgendwas grob in diese Richtung erwähnt wird. Sie sieht andere Leute und denkt: oh, Ausländer, dunkelhäutig, etc, da werde ich jedes noch so kleines Riff weitgehend umfahren.\n\nDu und andere sehen andere Leute und Denken: Mensch, fertig.\n\nDeine Kollegin sollte lernen urteilsfreier zu denken.\n\n\nHatte auch mit einer ehemaligen Freundin ständig riesen Diskussionen darüber wie ich mit meiner afrikanischen Verlobten(!!!) Witze mache bei denen wir beide lachen.",
            "NDA\n\nWie du sagst, ihr Verhalten ist ja fast schon schlimmer. „Oh mein Gott guckt mal, ich setze mich für den Kollegen mit Migrationshintergrund  ein, bin ich nicht ein guter Mensch?“\n\nDas sind doch alles komplett legitime Fragen/Interaktionen.",
            "KAH. Ich glaube, Du solltest deiner Kollegin Hanlons Rasiermesser erklären: Nimm niemals böse Absicht an, wenn Inkompetenz auch eine Erklärung ist. Manche Menschen haben halt so einiges an Veränderungen nicht mitbekommen und treten deshalb in Fettnäpfchen. Aber Ihnen dann böse Absicht zu unterstellen bringt rein gar nichts. Wenn überhaupt kann man sie freundliche, am besten indirekt ohne, dass sie es merken, korrigieren. \n\nDas gilt aber auch für deine Kollegin. Sie meint es gut, erreicht aber genau das Gegenteil.",
            "Nda, Migrationshintergrund mit kopftuch hier, krieg solche fragen und komplimente von älteren auch immer und die sind zwar irgendwie nervig, weils immer das selbe ist, aber ich nehm das jetzt nicht als rassistisch wahr. Die leute wollen bissl konversation treiben und das bietet sich halt an. Und mit dem \"sie sprechen aber gut deutsch\" wollen sie nett sein und ein kompliment machen. Sowas den leuten als rassistisch anzukreiden ist unfair, vorallem, weils meistens ältere kaliber sind, die mit anderen gesellschaftlichen normen sozialisiert wurden.  \nUnd davon abgesehen, wenn ich jemanden aus einem anderen kulturraum witter dann frag ich auch oft, woher die person kommt. Is besonders spanned bei leuten, die als erwachsene hier her kommen, wenn sie etwas über ihre eindrücke und die unterschiede zwischen den ländern erzählen. Oder halt generell über ihre herkunftsländer. \nAnsonsten, wenn du es der kollegin lang genug sagst, dass die leute nur bissl plaudern wollen und du das nicht rassistisch findest, dann entspannt die sich auch irgendwann. Vielleicht hat sie noch nie echten rassismus miterlebt und kann das nicht so einordnen. Den oberarzt jetzt desswegen zu bitten, dass du mit ihr keine schichten willst würde ich nicht machen. Das geht dem nur auf die nerven, weil so extrawürstchen die einteilung mühsamer machen und wenn das rauskommt, is die kollegin vllt noch offended und macht dir unnötig drama, dass du einfach nicht brauchst.",
            "Nda, \n\nmeine Meinung:\n\nDu bestimmst natürlich, was dich verletzt und was du rassistisch findest. \n\nEs gibt halt einige Personen, die solche Fragen für rassistisch halten, sich verletzt fühlen, zb in dem Buch Rassismus von Nelly. Die Autorin spricht genau diese Fragen an, dass die für sie und viele die sie kennt als rassistisch empfunden wird.\n\nZb in dem Buch von Piketty Rassismus messen schlägt dieser vor, dass man statt \"Woher kommst du eigentlich?\" lieber die Frage stellen soll \"Woher kommen deine Vorfahren?\".\n\nDaher mehrere Möglichkeiten mmn:\n\n1. Für dich ist es nicht rassistisch. Allein du entscheidest für dich! Du lässt diese Fragen zu.\n\n2. Siehe die Nelly. Es gibt Betroffene (deine Kollegin ist keine Betroffene), die es als rassistisch sehen und daher ist dir wichtig, dass diese Menschen diese Erfahrungen nicht durchleben müssen und du weist die Patient:innen darauf hin.\n\n3. Egal wie du dich entscheidest. Du bestimmst, was du fühlst! Deine Kollegin hat kein Recht dazu dir das vorzuschreiben.",
            "NDA das entscheidest immer noch du allein. \n\nIch habe aber auch Freunde, die es stört in jedem Gespräch gefragt zu werden, wo sie denn herkommen. Vor allem wenn es gleich nach dem Kennenlernen erfolgt. Ich verstehe, dass man das als nervig empfinden kann und dass man sich darauf reduziert fühlt. Das muss aber jeder selbst für sich entscheiden. Ich hab mir nur vorgenommen Menschen erst nachdem ich sie etwas besser kenne nach solchen Dingen zu befragen, denn im Endeffekt ist es ja egal woher man kommt. \n\nWenn du aber kein Problem damit hast, hat auch niemand anders zu entscheiden, dass das ein Problem ist. Das ist bevormundend. \n\nSag ihr, dass du das selbst regelst und wenn etwas für dich Grenzen überschreitet, wirst du selbst dagegen vorgehen.",
            "NDA. Deine woke Kollegin soll sich mal ihre Arbeit kümmern und nicht andauernd Dich und Deinen Kollegen belästigen.",
            "Hab auch Migrationshintergrund und manchmal hab ich das Gefühl es gibt echt nur zwei Arten von Deutschen in dieser Hinsicht:\n\n\n\n\n\"So lustig, Araber sind so krass laut untereinander,  man denkt die bringen sich alle gleich gegenseitig um auf der Familienfeier, dabei erzählen die sich nur von ihrem Tag\"\n\n\n\n\nTyp 1: \"OMG wie kannst du sowas nur sagen? Als ob das was mit der Herkunft zu tun hat wie laut man ist\"\n\n\n\n\nTyp 2:\"Ja stimmt, diese Kamelficker sollte man samt Kindern vor ein Erschiessungskommando stellen wenn die das nächste Mal meinen als Gast in unserem Land rumschreien zu müssen.!!!!11\"\n\n\n\n\n\n\nWieso gibt es hier *gefühlt* in der großen Masse keinen normalen, natürlichen Umgang damit, dass Menschen, Kulturen, Regionen, Mentalitäten und Umgangsformen unterschiedlich sind und dass das was normales und schönes ist?\n\n\nEntweder es wird tabuisiert und totgeredet dass Chinesen nun mal anders drauf sind als Nigerianer oder es wird mit Verachtung auf alles geschaut was nicht der deutschen Norm entspricht.\n\n\n\n\n(Und ich weiß dass es natürlich nicht so ist, das ist alles nur überspitzt).\n\n\n\n\nNDA, deine Kollegin soll mal bitte Gras anfassen gehen und ihr Handy beiseite legen.",
            "NDA\n\nManche nervt das manche nicht. Das sind auch eher soziale Konventionen und subjektive Wahrnehmung als objektiv böse gemeinte Diskriminierung. Deine Kollegin muss da nicht den White Saviour spielen.\n\nIch persönlich finde dieses woher bist du gefrage eher nervig bei oberflächlichem Kontakt. Meine Arbeitskollegen frage ich sowas schon, die wissen auch wo meine Eltern her sind.",
            "Ganz klar NDA.\n\nUnd ich finde es toll, dass du das so siehst. \nManchmal wollen Leute einfach nur nett sein und ein Gespräch anfangen. \n\nIch war neulich geschäftlich in NRW unterwegs.\nIn Aachen haben mein Kollege und ich dann eine Bar besucht. Dort ist den anderen Gästen dann unserer schwäbischer Dialekt aufgefallen und wir wurden daraufhin in ein nettes Gespräch verwickelt. Da ist die Frage ja auch nicht rassistisch.\n\nEs ist doch nicht verwerflich jemanden nach seinen Wurzeln zu fragen ,wenn man erkennt, dass diese eben wo anders liegen. \n\nEs ist doch am Ende der Kontext der eine solche Frage rassistisch macht oder nicht.",
            "NDA - hab genauso Migrationshintergrund und alle Beispiele, die du genannt hattest, sind absolut nicht rassistisch. Ich hatte mal einen Fall, bei dem ich mich auf ein schulisches Praktikum (ewig her, vermutlich 15 Jahre oder so) beworben habe. Der Eigentümer hat bei der Schule angerufen, um zu erfahren (wegen meinem Namen), woher ich komme. Das ist tatsächlich rassistisch, da er sich mit mir nicht einmal in Verbindung gesetzt hat.",
            "Ich bin adoptiert, aus Indien, Schweizerin. Manchmal geht Alltagsrassismus an mir vorbei, da ich dicke Haut habe und eher zu wenig reagiere als zu stark, da meine Adoptiveltern das in meiner Kindheit kleingeredet haben.\n\nIch unterrichte Deutsch für Migrant:innen. Dass die am 1 Tag fragen woher ich komme und warum mein Familienname französisch + rar ist (und zu. Herkunftsland nicht passt), ist das voll normal. Für mich 0 rassistisch und oft auch ein Vorteil: ich bin die Brücke zwischen dem für sie neuen Land (dass für mich meine Kultur ist) und dem Erleben der Welt als Person of colour under/oder Migrat:in. Ich musste um meine Integration kämpfen… Kontext ist also wichtig. Pflege, ältere Leute, Kinder, Migrant:innen mit wenig Sprache sagen auch mal was politisch nicht ganz korrektes. Freundlich erklären oder politisch korrekte Wörter vermitteln ist da konstruktiver als sich aufzuregen.\n\nOP: wir können sehr gut einschätzen was wir NICHT RASSISTISCH finden, würde ich sagen. Wo die Grenze ist/Alltagsrassismus beginnt, ist manchmal schwer, aber was für uns ok ist, ist unser Massstab. Fragen „fandest du das rassistisch“, ist für mich ebenfalls ok, gerade von Aussenstehenden. Aber deine Kollegin geht etwas zu weit. Sie soll die nicht dein Empfinden absprechen.\n\nNDA.",
            "NDA. Keine dieser Situationen war rassistisch. Unterschiedliche Hintergründe sind nun mal vorhanden, das kann man auch benennen… solange man es nicht mit einer Wertung verbindet, sondern Interesse, ist das doch toll. Übrigens habe sogar ich als Deutsche im Ausland schon mal ein Kompliment für mein tolles Deutsch gekriegt. Ist schon „interessant“ wie schnell die Kollegin an Rassismus denkt und euch „Ausländern“ erklärt, was ihr zu denken habt. Klingt wie das Rassismusbezogene Äquivalent von Mansplaining",
            "NDA, sie soll mal „white savior complex“ googeln",
            "Für mein erfinden währen die Sachen auch eher rassistisch, aber wenn du kein Problem damit hast, ist es ja quasi ein \"Victimless Crime\", also NDA, das einzige, was man vielleicht als Arschlochhaft empfinden KÖNNTE, ist, dass andere Leute mit Migrationshintergrund, sowas vielleicht rassistisch finden und du durch das durchgehen lassen, diese Leute bekräftigst, die dann andere Leute dasselbe fragen, die das dann rassistisch finden. Aber glaube das ist weit hergeholt.",
            "NDA diese woke Dummheit, ständig für andere eingeschnappt und schlimmeres zu sein, ist wirklich unerträglich…",
            "NDA - sehr verständlich, dass du davon genervt bist wenn das sehr häufig vorkommt und deine Hinweise es nicht ändern. ich wär auch genervt. andererseits denke ich, im aktuellen Wandel der Gesellschaft sollte man doch dankbar sein für jeden einzelnen Menschen, der sich aktiv gegen Rassismus stellt.  \nKann das nerven? na klar. Viele Dinge können nerven. Mich nerven Menschen die sehr offensiv freundlich sind - besser sie interagieren einfach gar nicht mit mir. Dennoch sind die mir tausend mal lieber als einer der explizit unfreundlich zu mir ist.  \nAlso klar, lass dich gern versetzen und du wirst schon nicht das Pech haben dann stattdessen nur mit AfD Fanboys zu arbeiten die dich mies behandeln. Ob es in Bezug auf Kollegialität das richtige Signal ist kann ich nicht gut beurteilen ohne den Betrieb zu kennen.",
            "NDA. Selbst als überzeugter Linker finde ich das einfach nur affig. Es wird immer Menschen geben, die alles übertreiben müssen. Interesse an einer Person zu zeigen, und das vor allem nicht abwertend, ist doch was Gutes. Wie sollen wir Migranten integrieren können, wenn wir den kulturellen Austausch entnormalisieren?",
            "NDA - klingt für mich als hätte sie einen typischen 'white woman saviour' Komplex und definiert sich wahrscheinlich viel darüber sich stellvertretend für andere zu empören.\nIch finde es dennoch etwas übergriffig von ihr dir erklären zu wollen was dir gegenüber rassistisch sein soll.",
            "Unpopular opinion, aber mMn kleines BDA. \n\nDie von deiner Kollegin angesprochenen Vorfälle mögen für dich unproblematisch sein, aber das ändert nichts daran, dass sie trotzdem rassistisch sind. Andere können sie durchaus als problematisch empfinden, und ich finde es gut, dass die Kollegin sensibilisiert ist. Wenn du darauf negativ reagierst, sendest du für sie ein falsches Signal. Sie kann nichts für deine persönlichen Probleme mit ihr.",
            "Glasklares NDA\n\nDeine Kollegin ist ein wokes Arschloch. Dein letzter Satz ist sehr richtig. Es ist total rassistisch von ihr dir vorzuschreiben was du als rassistisch zu empfinden hast. Sie meint sie hat die Weisheit mit Löffeln gefressen und weiß besser was Menschen mit Migrationshintergrund zu empfinden haben. Typischer \"white saviour\" Komplex.\n\nKeine der Beispiele, die du genannt hast sind auch nur annähernd rassistisch. Vor allem ältere Semester, die die jetzt gerade vermehrt im Krankenhaus sind und so langsam aussterben, kennen noch ein Deutschland mit weniger Migration und ein fremder Name war damals meist von zugezogenen Menschen. Die meinen das auch nicht böse wenn sie fragen. Die meisten sind ehrlich neugierig.\n\nEinzig wenn auf deine Antwort dass du in D geboren bist die Frage kommt \"Ja, aber wo kommen Sie wirklich her?\", wäre ein Beispiel wo man etwas verstimmt sein kann aber auch hier ist das meistens nur ein flappsiger Ausdruck und kein Rassismus. \n\nIch finde Menschen wie deine Kollegin erweisen dem Kampf gegen Rassismus einen Bärendienst. Die Leute stumpfen so gegenüber echtem Rassismus ab.\n\nIch bin westeuropäischer Ausländer (arbeite auf Intensiv) und alle halten mich für einen Deutschen. Spreche akzentfrei deutsch und mein Name könnte glatt aus Deutschland sein. Ich fänds cool wenn ich abundzu mal gefragt würde wo ich her komme. Wenn die Kollegen dann sagen, ach du bist Deutscher für mich, dann finde ich das wiederum rassistisch (nicht wirklich). 😜 Ich frage die Patienten allerdings auch nicht wo sie \"herkommen\" sondern frage wo sie ihre familiären Wurzeln haben. Die \"echten\" Ausländer können so immer noch erzählen wo sie herkommen und die hier Geborenen können mir erzählen wer aus ihrer Familie wann nach D gekommen ist. \n\nDu könntest, bevor du zum lt. OA gehst und ein Fass aufmachst erstmal das Gespräch mit der Kollegin suchen und ihr klar machen dass ihr Verhalten dich stört und sie bitten es zu unterlassen. Wenns dann noch immer nicht klappt kannst du immer noch zur Stationsleitung gehen.",
            "NDA hier sind wir wieder an dem Punkt, das sich Leute die nicht betroffen sind mehr über so Firlefanz aufregen, als Betroffene über ernste rassistische Äußerungen.\nDu hast deine eigene Grenze was du als rassistisch empfindest. Sie hat das Recht sich über Rassismus aufzuregen, aber ich glaube sie sollte noch mal die Definition davon lesen.",
            "NDA\n\nDeine Kollegin ist die mit einer Störung … wie kann man sich so wichtig nehmen.",
            "NDA\n\nDas Thema \"ist diese Situation als rassistisch einzustufen?\" muss meiner Meinung nach immer individuell bewertet werden (ich Türke, m, 38).\nAußerdem ist immer zu differenzieren zwischen rassistisch oder dumm. \n\nMeine Einschätzung:\n- die alte Person Nr. 1: nicht rassistisch, völlig normal \n- der 20-jahrige mit dem Adler: rassistisch (wenn auch positiver Rassismus - mich nervt sowas) und dumm, weil er ein politisches Symbol bringt ohne deine Einstellung zu kennen.\n- der letzte: nicht rassistisch wegen der Sache mir deinem Namen. Und dumm wegen der Frage mit den Deutschkenntnissen\n- und am wichtigsten deine Kollegin: dumm weil sie sich aufspielt und DIR erzählen will, wass rassistisch sein soll. Und meiner Meinung nach sogar rassistisch, weil sie dich nutzt, um moralische Überlegenheit auszuspielen",
            "NDA sie ist whiteknight-Lisa",
            "NDA, den Satz mit dem deutsch finde ich aber schon ziemlich scheiße, weil die Leute Mal bitte für fünf Mark mitdenken können, dass nicht jeder, der nicht Müller oder Schmidt heißt, hier vor drei Jahren mit dem schlauboot angekommen ist.",
            "NDA deine Kollegin übertreibt komplett und ist vermutlich eine klassische SJW.",
            "NDA Ich finde das ja immer sowas von extrem unnötig, dass einem andere Menschen erklären möchten was man selbst als rassistisch empfinden muss. Z.B. die Frage nach der Herkunft. Leute wtf? Was ist so schlimm oder gar rassistisch daran? Es ist einfach nur Interesse an der Person. Jemand der wirklich ein Rassist ist, der hält automatisch Abstand von ausländisch aussehenden Menschen, oder sagt etwas freches und beleidigendes.\n\nMeine Eltern stammen z.B. aus Russland. Manche Menschen fragen mich ob ich aus Polen oder Russland komme. Ich finde daran überhaupt nichts schlimm. Warum denn auch? Ich sage dann das ich russische Wurzeln habe. Meistens sind es Landsmänner die so eine Frage stellen. Die freuen sich dann einen Landsmann getroffen zu haben. \n\nLass mich raten, die Kollegin ist Deutsche und hat nicht mal selbst Migrationshintergrund?",
            "NDA\n\nSie stempelt Dich ja gerade zu ab, wie Du Dich als Opfer zu fühlen hast. Bäh. Obwohl Du Dir den Schuh gar nicht anziehen möchtest und auch nicht musst.",
            "NDA\n\nDeine Kollegin gehört für mich zur anstrengenden Kategorie \" politisch zu korrekt\".\nFinde keine der Aussagen der Patienten rassistisch. Sie führen Smalltalk. So sehe ich es jedenfalls.",
            "Da isser, der weiße Mensch, der dem Schwarzen erklärt, wie er sich fühlt...\n\nNDA Niemand sollte Dir vorschreiben, wann Du Dich angegriffen fühlen sollst. Wenn Dir ein Gespräch falsch erscheint, dann kannst Du das für Dich allein beurteilen und entsprechend reagieren. \nWarum andere immer Bestätigung suchen mit \"das war/ist rassistisch, stimmt's? Stimmt's??\" das werde ich nie verstehen.",
            "NDA, es Sind immer die Deutschen die rumheulen und alles rassistisch sehen. Ausländer sehen das viel lockerer und oft meistens lustig oder neutral :)",
            "NDA. Da versucht jemand mit biegen und brechen gratismut zu bekommen. White Knight par excellence. Finde es übrigens sehr rassistisch wenn sich solche Leute stellvertretend für \"vermeintliche Minderheiten\" hinstellen und so einen Schwachsinn behaupten. Hat die sonst keine Probleme oder Wehwehchen mit denen sie sich den ganzen Tag beschäftigen kann?!",
            "Bitte einen Bewertungskürzel in euren Kommentaren verwenden (NDA, BDA, ASA, KAH) oder Info bei fehlenden Informationen. Ohne Kürzel kann der Bot euren Kommentar nicht werten und dieser fließt NICHT in die Gesamtbewertung mit ein. Siehe Regel 4! NDA:Nicht Das Arschloch, BDA: Bist Das Arschloch, ASA: Alle Sind Arschlöcher, KAH: Kein Arschloch Hier, Info: Es fehlen Informationen\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/BinIchDasArschloch) if you have any questions or concerns.*",
            "Danke fürs Posten! Dieser Kommentar ist eine Kopie deines Posts, sodass Leser deinen originalen Text sehen können, falls dein Post gelöscht oder bearbeitet wird. Dieser Kommentar beschuldigt dich NICHT irgendetwas kopiert zu haben.\n\n\nIch m 29 Jahre mit Migrationshintergrund gerade immer wieder an eine Kollegin 27 ohne Migrationshintergrund.\nEs kommt immer wieder zu Situation, bei denen sie mich im Nachhinein fragt, ob ich das nicht rassistisch fand oder das es sogar rassistisch sei. Als Beispiel: 76 Jährige Patientin fragt mich vorher ich komme. Im Nachhinein meinte meine Kollegin dann „total rassistisch, dass die Leute immer wieder sowas fragen.“\nAnders Szenario: 20 Jähriger deutscher Patient guckt auf mein Namensschild und fragt mich dann „Sind Sie Albaner“ Woraufhin ich antworte „meine Eltern kommen ursprünglich von dort.“ Daraufhin hat der Patient dann den Doppelkopfadler „gezeigt“, auch da meinte später meine Kollegin, dass das rassistisch sei, ein Symbol zu zeigen, obwohl man man selbst kein Albaner sein.\nLetztes Beispiel: 40 Jähriger Patient guckt auf mein Namensschild, will sich bedanken und spricht dabei meinen Namen völlig falsch aus, was vollkommen okay ist. Fragt mich daraufhin auch wie das korrekt ausgesprochen wird, was ich ihm natürlich sage, fragt dann auch, wie lange ich schon in Deutschland bin, weil ich so „gut“ deutsch spreche. Habe ihm dann auch gesagt, dass ich hier geboren bin. Später kam dann meine Kollegin wieder zu mir und sagt „total rassistisch, dass er denkt, du bist hier nicht geboren bist“\nIch hab ihr schon oft gesagt, dass ich solche Dinge nicht rassistisch finde und das sie mir sowas nicht immer wieder sagen, hilft aber nicht. Wir haben auch einen dunkelhäutigen Kollegen, der auch immer wieder das selbe Problem mit ihr hat. Ich meine, klar man muss bestimmte Sachen nicht fragen, aber wenn die Menschen eben neugierig sind, hat es überhaupt nichts mit Rassismus zu tun. Ich frage meine Patienten auch manchmal woher sie ursprünglich kommen, aus Interesse eben, nicht weil es rassistisch motiviert ist.\nMittlerweile nerven mich diese Leute, die meinen, mir sagen zu müssen was ICH als rassistisch zu empfinden habe und was nicht.\nJetzt bin ich aktuell am überlegen, ob ich unseren leitenden Oberarzt frage, ob er mich so einteilen kann, dass ich keine Dienste mit dieser Kollegin habe. Bin ich deswegen ein A und überreagiere? Oder ist es gerechtfertigt, dass ich es schon fast rassistischer finde, wenn mir jemand ohne Migrationshintergrund sagt, was ich, jemand mit migrationshintergrund, als rassistisch zu empfinden habe?\n\nSorry für den langen Text und danke im Voraus für eure Meinung 🙏🏼\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/BinIchDasArschloch) if you have any questions or concerns.*",
            "[removed]",
            "[removed]",
            "[removed]",
            "[removed]",
            "[removed]",
            "[removed]",
            "[removed]",
            "[removed]",
            "[removed]",
            "[removed]",
            "[removed]",
            "NDA - deine Kollegin ist die Rassistin, weil sie für dich und deinen Kollegen bevormundend entscheiden will, was rassistisch ist.",
            "NDA ich würde sie ganz klar darauf ansprechen, dass du es rassistisch empfindest, dass sie als Nichtbetroffene dir quasi auferlegt was rassistisch ist. Sag ihr, dass du es schätzt, dass sie dir beistehen will, dir das aber zu viel ist und du das als übergriffig empfindest.",
            "NDA, aber warum sprichst du nicht einfach mal mit dieser Kollegin drüber? Ich schätze mal sie meint das irgendwie nett. Sie hat eine Meinung dazu und meint dich und auch andere da irgendwie Supporten zu müssen. Sprich es ordentlich an, sag das es für dich kein Problem ist und du das auch nicht so siehst wie sie. Wenn sie es dann immer noch macht sagst du es ihr halt nochmal bisschen aggressiver und dass sie dich damit in Ruhe lassen soll. Ich denke das wäre ne bessere Möglichkeit anstatt dem ganzen aus dem Weg gehen zu wollen. Kannst du aber natürlich auch machen",
            "NDA\n\nIch verstehe deine Kollegin schon iwo (nur sie übertreibt halt), aber der Punkt ist, sie redet mit dir darüber und fragt dich wie du das siehst und wenn du verneinst, muss sie nicht versuchen die andere Person rassistisch darzustellen. Viele Fragen deine Fragen ja auch einfach aus Interesse und wissen auch nicht, wie sie es anders (\"nicht rassistisch\") formulieren sollen. \n\nGegen Rassismus aufstehen ist ja gut, aber wenn mir jemand versucht meine eigenen Gefühle abzusprechen (in deinem Fall hast du eben keine negativen Gefühle gegenüber solchen Fragen), dann ist es halt auch übergriffig von deiner Kollegin. Verstehe also, wenn du mir ihr nicht mehr zusammen arbeiten willst.",
            "NDA - Finde dein Empfinden nachvollziehbar. Ist schon irgendwie leicht rassistisch dir aufdrängen zu wollen, was du aufgrund deiner Herkunft als rassistisch empfinden solltest. \n\nIch weiß nicht, ob du das auf die Ebene von Vorgesetzten tragen solltest. Da wird dann schnell ein größere Fass draus als dir lieb ist, wenn’s blöd läuft.\n\nAber hast du ihr mal Klipp und klar gesagt, dass du von ihr nicht künstlich zum Opfer gemacht werden willst? Vermutlich hilft der Zusatz, dass es ihr ohne Migrationshintergrund nicht zustehe darüber zu sprechen und sie mehr zuhören und verstehen sollte, statt zu versuchen dich über Sprache zu dominieren. Das holt sie vermutlich in ihrer Denkwelt ab, ob man das inhaltlich korrekt findet ist eine andere Sache.",
            "NDA. Was bildet sie sich ein für dich zu entscheiden was du dulden kannst und was nicht?",
            "NDA\n\nSie kann es ruhig Dir überlassen, wie Du bestimmte Aussagen empfindest. \n\nVielleicht will sie was von Dir.",
            "NDA\nDeine Kollegin scheint das nicht böse zu meinen, daher tendiere ich sogar dazu, zu schreiben, dass keiner DA ist.\nIch finde es eigenartig, wenn man sich nicht für sein Gegenüber interessieren darf: Aussprache des Nachnamens, Nachfragen,… das ist doch nicht schlimm. \nMein Vater hat auch immer viel nachgefragt - wenn der im Krankenhaus war, kannte er die Namen der Pflegekräfte und hat so manch spannende Geschichte gehört, weil er sich interessiert hat.\nEr hätte das niemals herablassend oder aber als Grundlage für eine Kategorisierung genutzt, er war lediglich interessiert, egal, wo die Menschen herkamen.\nNeugier und Interesse am Mitmenschen kann sogar helfen, gegen Rassismus vorzubeugen.\nDeine Kollegin scheint in Dir wohl ein Rassistenopfer zu sehen. Zieh Dir den Schuh nicht an!\n(Ich werde übrigens auch oft gefragt, wo ich herkomme 😅)",
            "NDA. Liest sich als ob Du selbstbewusst bist.",
            "NDA ist es nicht grundsätzlich so, dass gerade die weißen Angelikas und Jochens uns alle belehren wollen was Rassismus ist? Hat in den Staaten mit weißen Libertären Frauen angefangen und hier machen es die Linken, die bei ihren Demos einen Ausländeranteil von 0,002% haben. Hat bestimmt irgendwas mit kollektiven Schuldgefühlen zu tun..die sie sich einreden. Hauptsache man belehrt, die Migranten selber was Rassismus ist..",
            "NDA\n\nVerstehe dich total. Es ist einfach nicht alles immer rassistisch, ganz egal was Jana oder Max jetzt denken. Das Verständnis von \"gut von anderen denken, nicht immer vom schlimmsten ausgehen, nachsichtig sein\" geht verloren, heutzutage wird alles als Angriff oder Kampf empfunden, und sei froh wenn nicht sofort irgendwelche Vorgesetzten involviert werden... \n\nIch selber habe Migrationshintergrund und eine Kollegin auch mit Migrationshintergrund, mit der ich mich eigentlich sehr gut verstehe. Eines unserer Gesprächsthemen in letzter Zeit war Religion und Herkunft. Wir konnten tagelang miteinander normal reden, aber weil sie eine Interaktion mit jemandem hatte, den sie als Rassist empfindet, war es plötzlich \"naja ..\" von mir um nachzufragen, ob die Annahme des Christentums ihres Bruders für ihre Eltern eigentlich was erfreuliches war oder nicht. Die Reaktion machte im Angesicht unserer Gesprächshistorie absolut keinen Sinn. Es ist außerdem sehr unangenehm, plötzlich als schlechter Mensch dargestellt zu werden wegen etwas, das gar keine Rede wert ist. \n\nLeute, die dir einreden, dass Menschen immer alles schlecht meinen, muss man so viel wie möglich meiden. Ob jetzt den Chef drauf ansprechen eine gute Idee ist, weiß ich aber nicht.",
            "NDA \nKlingt für mich nach so einer komplett am Leben vorbei denkenden Person",
            "Info Ich möchte jetzt dringend wissen, wie man den Doppelkopfadler zeigt.",
            "NDA\n\nGott segne dich! Das klingt für mich nach einer komplett normalen, menschlichen Einstellung! Leider ist das heutzutage nicht normal. Leute haben nichts zu tun und meinem sich als Messias aufspielen zu müssen und andere zu belehren. In Wahrheit geht's denen aber nur um sich selbst! Tatsächlich merkt man bei anderen Menschen was sie für Motive und Absichten haben und wenn du bei dieser Kollegin und Ihren Fragen und Aussagen kein Gutes Gefühl hast liegt das mit Sicherheit daran das sie diese Themen nur benutzt um sich aufzuspielen und als was \"besseres\" zu empfinden. Und sowas nervt gewaltig!",
            "NDA\nDu kannst selbst entscheiden, was dir zu viel ist und was nicht.\n\nIch persönlich bin auch Kind von Migranten, aber eben in D geboren und aufgewachsen, Deutsch war mein bestes Fach, habe später Jura studiert und bin generell einfach sehr deutsch gestrickt.\nIch hasse all die von dir aufgezählten Punkte (außer das mit dem Adler, da kenne ich mich nicht aus).\n\nIch spreche Hochdeutsch seit ich ein kleiner Fratz war und ich hasse es zutiefst, wenn Menschen, die gerade noch so Schwäbisch oder irgendeinen anderen Dialekt sprechen, die audacity haben, mir zu sagen ich könne gut deutsch. Ich kann halt besser Deutsch als die (die sowas sagen) 😅\n\nUnd auch dieses ständige “Wo kommst du her, nein, wo kommst du WIRKLICH her?” Habe schon oft trocken mit “aus einem deutschen Krankenhaus” geantwortet und evt. rutscht mir mal “aus meiner Mutter” raus.\n\nAber das alles sage ich nicht, um dich irgendwie zu überzeugen, du kannst es so sehen wie du möchtest und da hat kein anderer mitzureden.\nIch sage es, weil ich diejenigen repräsentieren will, die es eben anstrengend finden und auch rassistisch. Nicht full blown Nazi mäßig, aber eben diese latente Anspielung auf eine angebliche Andersartigkeit, also Alltagsrassismus. Aber ich bin nicht anders.\n\nIch habe nur eine schönere Bräune und vollere Haare. Ansonsten bin ich genau wie ihr haha.\n\nSpaß beiseite, ich wurde halt auch in der Schule deshalb ausgegrenzt (war ein Bonzengymnasium und ich das einzige Migrakind) und genauso erging es auch meiner Schwester. Wir haben es auch im Beruf oft erlebt (in meinem Studium war ich die einzige POC Person. Und ich bin nichtmal so braun!) und das sind eben Erfahrungen, die prägen. Mich zumindest.\n\nIch würde dir empfehlen, deine Kollegin höflich zurecht zu weisen, aber bitte vergiss nicht, dass nicht alle das so unproblematisch finden wie du. That’s it, have a nice day",
            "KAH - verstehe, dass du das nicht magst. Aber die Kollegin meint es vermutlich nicht böse. Ihr Verhalten reicht für mich nicht zum A. Ich würde nochmal mit ihr das Gespräch suchen und unmissverständlich und mit Nachdruck klar machen, dass du ihr Verhalten unangemessen und übergriffig findest. Versuche den Konflikt mit ihr zu lösen. Sie beim Oberarzt anzuschwärzen wird vermutlich nicht gut ankommen. Ich bin selber GF und möchte, dass meine Mitarbeiter Konflikte selbst unter sich lösen. In sowas reingezogen zu werden ist für Chefs auch unangenehm. Für mich ist da bei eurem Konflikt noch keine klare Grenze überschritten.",
            "NDA, du kannst selbst entscheiden, ob du etwas rassistisch findest oder nicht. Selbst wenn die Kollegin selbst einen Migrationshintergrund hätte, könnte sie nicht für dich sprechen oder erwarten, dass du ihre Ansichten teilst. \n\nFragen nach deiner Herkunft oder anderem können rassistisch gemeint sein, es kann auch einfach Neugier sein. Das erkennt man weniger an der Frage (wie die Kollegin meint), sondern mehr am Tonfall, Mimik etc.\n\nAber dass sie anscheinend genau das von dir erwartet könnte man schon fast so auslegen, dass sie ihre Ansichten als \"Nicht Betroffene\" für wichtiger hält als deine Ansichten als \"Betroffener\". Man könnte das weiter spinnen, aber das lasse ich sein, immerhin kenne ich sie nicht und auch solche Belehrungen können unterschiedliche Gründe haben.",
            "NDA, kann dir als Ausländer und als Rassist sagen, dass das alles nicht rassistisch ist. \nSpaß beiseite, finde die Frage \"wo kommen Sie her\" immer ultra guten Einstieg für Smalltalk. Das mag ich. Wenn es heißen würde \"verpissen Sie sich dorthin, wo Sie herkommen\" dann wäre das zwar gemein, aber da ich weiterhin an meinem Geburtsort lebe, wäre es kein weiter Weg:D",
            "NDA\n\nNiemand sollte dir vorschreiben, welche Situationen du als rassistisch bewertest und welche nicht. Ich vermute, deine Kollegin will ein guter Ally sein, aber sich damit auch ein Stück weit brüsten, wie aufgeklärt sie ist. Wenn sie dabei deine Grenzen nicht wahrt, dann hat sie das Prinzip nicht verstanden. Nicht nur, dass sie nicht anerkennt, dass du in der Lage bist, Situationen danach zu bewerten,ob sie rassistisch sind oder nicht, sie realisiert auch gar nicht, dass es auch Coping-Strategien gibt, wo absichtlich unterschwelliger Rassismus ignoriert wird, damit es einen nicht ständig runterzieht (ich will nicht behaupten, dass du das tust, aber sie sollte sich der Möglichkeit bewusst sein, wenn sie „so aufgeklärt ist“).",
            "[removed]",
            "NDA. Ich stimme dir zu, dass das Verhalten deiner Kollegin sehr nervig sein kann. Besonders wenn sie dir aufdringlich weiß machen möchte, etwas sei rassistisch, obwohl du es nicht so siehst und sie dadurch einen noch rassistischeren Eindruck auf dich macht. \n\nIch glaube, der beste Schritt wäre es, deine Kollegin darauf anzusprechen, dass sie es lassen soll, überall Rassismus hinein zu interpretieren. Vielleicht auch mit Einbeziehen deines dunkelhäutigen Kollegen, falls ihr Verhalten auch für ihn ein großes Problem ist, so kann sie zumindest nicht mit der \"Das sagst du, aber eigentlich...\"-Schiene kommen. \n\nSprecht euch lieber aus, sonst würdest du dich im Grunde nur in deiner Schichtwahl einschränken und das eigentliche Problem wäre auch nur verdrängt, statt gelöst. Vor allem kann sie daraus lernen, dass (oberflächlich) gut gemeint, nicht automatisch gut gemacht ist. Und manchmal kann es auch zu Situationen kommen, in denen ihr, trotz des Wunsches andere Einteilungen zu haben, noch zusammenarbeiten müsst. \n\nAber ich kann dich auf der anderen Seite auch verstehen, ihr lieber ausweichen zu wollen. So etwas fällt niemandem leicht anzusprechen und vielleicht macht sie auch ein Drama daraus. \n\nSchlussendlich könntet ihr aber beide davon profitieren, es ausbesprochen zu haben.",
            "NDA derartige Fragen sind schon tendenziell rassistisch, aber oft nicht böswillig gemeint, meist Neugierde oder Naivität. Es kommt auch auf den Ton an. Aber letzten Endes kann dir niemand deine Gefühle zu diesen suggestivfragen nehmen, dass du es für dich nicht so empfindest, das darf jeder betroffene selbst für sich entscheiden, wie es aufgenommen wird. Man kann den Leuten halt nur vor den Kopf gucken.",
            "[removed]",
            "NDA\n\nIch habe Freunde weltweit und frage daher immer aus Interesse nach. Mehr über mir fremde Kulturen zu lernen ist doch total spannend. Und wie sonst sollen Vorurteile abgebaut werden ohne Dialog? \nDeine Kollegin ist da irgendwie fehlgeleitet unterwegs. Wahrscheinlich denkt sie das sie sich so verhalten muss um ins weltoffene Bild zu passen. Das sie dir aber irgendwie ihre Meinung aufzwingen will was du rassistisch zu empfinden hast oder eben nicht irritiert nicht. Das sie frage stellt um dich besser zu verstehen kann ich ja sogar noch nachvollziehen. Aber das sie es nicht einfach auch mal unterlässt sich darüber aufzuregen was sie gar nicht betrifft finde ich fast schon “anerzogen” aus den Medien oder so.",
            "NDA - deine Kollegin hat einen an der Waffel, ist bösartig linksextremistisch und versucht dich gegen normale Menschen aufzuhetzen.",
            "[removed]",
            "NDA \nTypisch deutsch . Bei uns auf der Arbeit auch viele von denen.",
            "[removed]",
            "NDA ich finde wenn jemand Interesse am der Herkunft eines ausländischen Mitbürgers zeigt ist das fast das Gegenteil von Rassismus. Wenn ich im Ausland darauf angesprochen werde woher ich komme macht es mir eigentlich großen Spaß von meiner eigenen Herkunft und Kultur zu erzählen. Meinem Freund, der aus dem EU-Ausland kommt, geht es genauso. Um genau zu sein haben wir uns durch ein Gespräch über unsere jeweilige Herkunft kennen gelernt. Und weil wir beide totals Rassisten sind und jeden Menschen hassen der nicht aus unserem jeweiligen Heimatland kommt (/s) führen wir seid einem Jahr eine sehr glückliche Beziehung",
            "\"Liebe Kollegin, ich finde es toll, dass du dich um meine Person sorgst, und dass du dein Bewusstsein für Rassismus schärfen willst. Ich schlage vor, wenn ich mich irgendwann rassistisch diskriminiert fühle, spreche ich dich an, und dann überlegen wir gemeinsam, was zu tun ist. Vorerst bitte ich dich aber, mir die Entscheidung zu überlassen, was ich als rassistisch empfinde, und was nicht.  Ist das OK für dich?\"\n\nNDA.",
            "NDA - hab selbst Migrationshintergrund und diese Leute gehen mir mächtig auf die Nerven. Rassismus ist nicht Leute darauf anzusprechen, wo ihr Name herkommt oder welchen Hintergrund sie haben, sondern diese Leute aufgrund ihres Aussehen oder Hintergrunds zu diffamieren oder schlecht zu machen. Es ist unerklärlich, warum so viele Leute auf die Idee kommen, dass alles um uns herum rassistisch sei - unabhängig davon, dass es seltsam ist, das Aussehen eines anderen dadurch dauerhaft zum Thema zu machen... Naja. Sprich es mal bei ihr an, dass du es seltsam findest, dass sie dir als offenbar weiße deutsche Frau, erklären will was rassistisch dir gegenüber ist und was nicht.",
            "[removed]",
            "[removed]",
            "[removed]",
            "NDA, gerade die Frage nach der Herkunft finde ich immer sehr interessant und hat überhaupt nichts mit Rassismus zu tun, sondern mit Verständniss woher die jeweiligen Ahnen kommen. Das ist übrigens für \"nicht migrations Hintergrund\" Bürger ebenso interessant, da Deutschland als solches ja nicht alzu lange existiert und es zwischen Sachsen, Franken, Schwaben, Friesen, Bayern und wie Sie alle heißen natürlich gravierende kulturelle Unterschiede gibt die sich oft in der Mentalität wieder spiegeln. \n\nGerade US Bürger reagieren immer irritiert wenn man Sie nach der Herkunft fragt und meinen \"Amerikaner zu sein\" Natürlich ist es von enormer Bedeutung sich seiner historischen Abstammung bewusst zu sein.",
            "NDA. Deine Kollegin ist zurückgeblieben, keine Spur von Rassismus hier.",
            "NDA. Morgen ist Weißbrot rassistisch. Übermorgen Schwarzbrot. Ist an Attentiongrabbing geknüpft mach dir keinen Kopf denen kannst du es nicht recht machen",
            "NDA, empathie ist ja schön und gut, aber du bist die Person die entscheidet ob es dich verletzt oder Angegriffen fühlst von etwas.\n\nFinde es auch von deiner Kollegin eher übergriffig, das sie entscheidet was für Dich Rassistisch ist, wo bei mir die Frage aufkommt ob sie das weiß was Rassismus eigentlich ist und das nicht nur 2-3 x auf Sozial Media oder von Opa Bernd gehört hat.",
            "NDA\n\nIst mir auch aufgefallen dass sich sich gewisse weiße Menschen anscheinend schützend vor die armen \"People of Color\" stellen müssen. Es erinnert mich etwas daran wie weiße Leute anderen weißen Leuten erzählen wollen, dass es jetzt rassistsche ist Rastalocken zu tragen, während man vermutlich in ganz Jamaika niemanden gefunden hätte, der eine Problem damit hat und es Rastalocken sowieso in diversen Kulturen gab.  \nIst schon ironisch dass die vermeintlich besonders toleranten Leute den vermeintlich Diskriminierten vorschreiben wollen, was genau rassismus und diskriminierung ist und wovon sie sich beleidigt fühlen müssen.. Fast so als würden sie denken sie wären was besseres... Aber das wäre ja absolut rassistisch....",
            "NDA. Hört sich aber bisschen nach Münchhausener Syndrom an😅",
            "[removed]",
            "[deleted]",
            "Nda- du denkst wie alle die ich kenne die Migrationshintergrund haben.\n\nDer Deutsche stellt sich seit ein paar Jahren gerne hin und sagt alles mögliche sei rassistisch ohne noch zu wissen, was das bedeutet.",
            "NDA, habe auch Migrationshintergrund und kenne ähnliches. Meine Mutter kommt vom Balkan, selbst andere Menschen aus Ex Jugoslawien fragen woher einfach weil es sie interessiert. Es gibt in Deutschland oft nur die 2 extreme, die ich bin kein Rassist aber und die die überall Rassismus sehen.",
            "NDA\nSich für andere aufzuregen scheint so ein Frauending zu sein...",
            "NDA.    \nBin komplett bei deiner letzten Aussage; als deutsche einfach für Ausländer sprechen - und das nicht nur ungefragt sondern nach mehrmaliger Aufforderung es zu lassen - ist definitiv rassistisch. Sie scheint ja gerade zu besessen zu sein von eurer Hautfarbe; würde sie denn wenn ein weißer Migrant (zB aus der Schweiz oder Großbritannien) solche Fragen gestellt bekäme auch so ein Fass auf machen? Vermutlich eher nicht, denn denen kann sie nicht so gut unterstellen, diskriminiert zu werden.",
            "NDA. Manche Leute sind da mittlerweile komplett bescheuert.",
            "NDA \nZiemlich rassistisch von ihr dir als Person mit Migrationshintergrund vorschreiben zu wollen was du rassistisch zu finden ha… ok ok. Ich konnte es nicht lassen :D",
            "NDA .. deine kollegin spielt die Rassismus Polizei .... Hat wohl sonst nichts womit sie sich identifizieren kann. Von Rassismus hat sie allerdings keine Ahnung",
            "NDA, Das ist doch schon sehr auffällig wie die Dame sich verhält kompensiert die irgendwas?",
            "NDA - mit Tendenz zu KAH\n\nWäre es möglich, sich mit der Kollegin auf einen Kaffee (o.Ä.) außerhalb der Arbeitszeit zu treffen?\n\nEhe die Mistgabeln gezückt werden:\n\nIch halte deine Kollegin für unsicher und unreflektiert. \nMöglicherweise ist sie ein bisschen unempathisch und versucht auf diese Weise gegenzusteuern. \nVielleicht ist sie intellektuell eher im unteren Durchschnitt zu finden - was erstmal nicht zwingend ein Problem sein muss, sondern eine erste (variierbare) Einschätzung ist.\n\nMöglicherweise ist die Kollegin während der Arbeitszeit gestresst / reizüberflutet und kann neue Informationen kognitiv nicht gut verarbeiten. Deswegen schafft sie es bisher nicht, deine Bitte umzusetzen.\nSie meint es vielleicht nicht böse, sondern ist einfach überfordert und in Ihrem eigenen \"Film\" gefangen.\n\nVielleicht hat sie auch einfach Angst vor Eskalationen aufgrund von Fremdenfeindlichkeit und ist mit dem Gedanken überfordert.\n\nOhne genauere Details zu kennen, würde ich zunächst von den o.g. Bedingungen ausgehen und sie deshalb außerhalb der Arbeit sprechen (falls nicht schon geschehen) und nicht zwischen \"Tür und Angel\" oder während der Arbeitszeit.\n*Außerhalb der Arbeitszeit* ist hier der entscheidende Faktor.\n\nRein faktisch hat deine Kollegin recht, laut allgemeingültiger Definition handelt es sich bei den von dir beschriebenen Situationen um Rassismus - *aber!* (und das ist der springende Punkt) **dir macht das nichts aus**.\nDu empfindest die Fragen und Kommentare nicht als Angriff oder Abwertung.\n\nErkläre deiner Kollegin ruhig, daß du ihr Mitgefühl zu schätzen weißt, es dich jedoch stört, während der Arbeit immer wieder auf Rassismus angesprochen zu werden.\nSag ihr, daß du ein toleranter Mensch bist und nichts gegen rassistische Fragen hast. Du wirst die Menschen nicht umerziehen können und das möchtest du auch gar nicht. Du möchtest ihnen einfach ihre Fragen beantworten, damit sie dich als normalen Menschen sehen und beim nächsten Mal vielleicht weniger vorurteilsbehaftet sind.\n\nWenn du das Gefühl hast, daß eine Situation aufgrund von Rassismus eskaliert, weißt du, daß sie *anschließend* hinter dir steht und du dich an sie wenden kannst. Sag ihr, daß du es zu schätzen weißt, daß sie ein weltoffener Mensch ist und sich Gedanken macht.\n\nAuf diese Weise holst du sie emotional ab und bewahrst deine Grenzen.\n\nOptimalerweise könntest du sie dann fragen, was genau sie bedrückt und weshalb sie bei dir wegen des Rassismus nachfragt.\nVielleicht kann sie es dir erklären oder sie findet die Situation unangenehm und lässt dich in Zukunft vielleicht damit in Ruhe.\n\nWichtig ist: ruhig bleiben. Geduldig mit ihr sein. Tolerant mit ihr sein.\n\nDiese Chance eines Gesprächs auf Augenhöhe würde ich ihr geben, ehe ich mich an die nächsthöhere Instanz wende. \nFalls sie nämlich Pech hat, verliert sie dadurch ihren Job oder zumindest an Ansehen innerhalb der Firma.\n\nSollte sie anschließend, auch nach erneuten Erinnerungen, kein verändertes Verhalten zeigen (eine Umgewöhnung braucht ggfs. etwas Zeit) kannst du immernoch zur nächsthöheren Instanz gehen.",
            "NDA. Solche Fälle habe ich auch im Bekanntenkreis. Solche Menschen ignorieren halt, dass der Kontext wichtig ist und nur daran zu erkennen ist, ob genau diese Aussage bei der Person einen rassistischen Hintergrund hat. Wenn deine Kollegin also die Patientin danach nicht fragte spielt sie sich nur auf und stellt ihre Moral über die der anderen. Würde ihr mal klipp und klar sagen, dass du dich von ihrem Verhalten gestört fühlst und sie aufhören soll sich wie n Moralkindermädchen aufzuführen. Wirst dich ja wohl selbst verteidigen können wenn es drauf ankommt.",
            "NDA\n\nAuch wenn ich hier jetzt verallgemeinere, aber es sind komischerweise sehr oft weiße Frauen, die sich in solchen Fällen stellvertretend für alle anderen angegriffen fühlen und meinen, sie müssen die \"Armen Ausländer\" beschützen.\n\nVirtue Signaling vom feinsten.Wir können für uns selbst sprechen und entscheiden, was wir rassistisch finden und was nicht.\nMeine Eltern kommen aus Russland, was man auch an meinem Namen merkt. Meine Freunde sind zu einem gewissen Teil auch Ausländer. Ganz normal, das man da dumme Sprüche bringt. \nWas meinst du, wie oft ich scherzhaft Ivan oder Putinversteher genannt wurde? Meine Güte, man lacht drüber und sagt nen dummen Spruch zurück. Alles nicht böse gemeint und wir sind trotzdem die besten Freunde.",
            "NDA und vielleicht KAH. Ich kenne die Situation, habe sie oft als Außenstehender miterlebt. Was einem bewusst sein sollte ist, dass die Intention deiner Kollegin ja grundsätzlich keine schlechte ist. Sie hat vermutlich einfach nicht den richtigen Blickwinkel und aus ihrer Sicht ist die Vorgehensweise gut. Ich denke, vorausgesetzt, dass sie bei sowas Grips hat, dass ein klärendes Gespräch hier helfen könnte. \nNatürlich ist deine Reaktion dazu auch völlig okay, es hat ja auch etwas Übergriffiges.",
            "NDA natürlich.\n\nDas Problem könnte hier woanders liegen: Deine Kollegin fühlt bzw denkt selbst rassistisch, will es aber nicht, weil es ihr Nachteile bringt oder weil sie sich rational entschieden hat, keine Rassistin sein zu wollen. Sie überkompensiert. \n\nZu den Gründen könnte man jetzt spekulieren. Beispiele: Eine für sie wichtige Bezugsperson ist Rassist oder sie hatte eine extrem traumatische Erfahrung.\n\nFalls sie noch andere auffällige Verhaltensweisen zeigt, könnte auch eine Persönlichkeitsstörung vorliegen.",
            "klassisch NDA und deine kollegin IDA, weil es ein unding ist, partei ergreifen zu wollen indem man die getätigten Aussagen immer so negativ wie möglich auslegt und sich dabei dann noch über das Urteil der eigentlich potentiell geschädigten zu stellen rundet das ganze perfekt ab. klassischer move der neuen linken oder wie ich sie nenne identitäre linke.",
            "[removed]",
            "NDA wer überall Rassismus sieht und hört, der hat damit innen drin selber ein Problem.",
            "NDA \n\n\"dass ich es schon fast rassistischer finde, wenn mir jemand ohne Migrationshintergrund sagt, was ich, jemand mit migrationshintergrund, als rassistisch zu empfinden habe?\"\n\nSag ihr genau das. Da sie offensichtlich sehr darauf bedacht ist, dass du dich nicht rassistische angegriffen fühlst, sollte das doch wirken.\n\nAllgemein versteht sie mMn nicht was Rassismus heißt. Interesse an anderen Nationalitäten ist 100% _kein_ Rassismus.",
            "NDA und daran ist auch nix rassistisch. \nEs ist doch reines Interesse was die Leute zeigen und der jüngere dachte hat ein Landsmann getroffen. \n\nManchmal kann man auch übers Ziel hinaus schießen und deine Kollegin macht das beispielhaft. Man sollte auch wenn man was gegen Rassismus hat, nicht krampfhaft alles als negative sehen. Leute sind neugierig und das jemand ein Namen falsch ausspricht und sogar noch nachfragt wie man ihn richtig ausspricht ist doch sehr respektvoll. \n\nSprich mit deiner Kollegin und sag ihr einfach sowas wie. \n\nDu ich danke dir das du dir Sorgen machst, aber das müsse sie nicht. Du merkst das ihr das Thema Rassismus wichtig sei, aber man trotz dessen nicht leichtfährtig mit dem Thema um sich werfen sollte. Wenn jemand rassistisch sein sollte, wärst du in der Lage selbst damit um zu gehen doch dankst ihr trotzdem führ ihre Fürsorge.",
            "[removed]",
            "NDA.",
            "NDA\n\nNicht rassistisch sein bedeutet nicht dass ich so tun muss als würde ich nicht bemerken dass jemand einen Migrationshintergrund hat und ich darf mich auch dafür interessieren. Es ist nicht hilfreich rassistische oder andere negative Motive zu unterstellen wenn es genausogut möglich ist dass den Leuten vielleicht nur Feingefühl fehlt oder sie wirklich nur das Gespräch suchen, ist ja so ähnlich mit allen anderen Dingen die einen abheben von der Norm. Tattoos, Piercings, bunte Haarfarben oder was auch immer sind oft ein \"anker\" für ein Gespräch. Klar haben sich das tätowierte ausgesucht und ist nicht ganz vergleichbar mit Herkunft und co. aber mir geht es um die Intention der Fragenden. Wenn die Intention nicht boshaft oder abwertend ist sehe ich keinen Grund jemandem rassismus vorzuwerfen, deine Kollegin scheint Rassismus ehrlich gesagt nicht wirklich ernst zu nehmen, das ist für mich ein schwerwiegender Vorwurf und den muss ich SEHR gut begründen können. \n\nDu musst dich so nicht von ihr behandeln lassen, sie drängt dich aufgrund deiner Herkunft in eine Opferrolle und das ist absolut nicht in Ordnung und hört sich für mich nach einem toxischen Arbeitsumfeld an. Ist nicht deine Aufgabe sie zu belehren aber ich glaube auch hier wäre es konstruktiv auf eine Aussprache mit ihr und deinem Vorgesetzen gemeinsam um einmal klipp und klar aufzuzeigen wie ihre eigenen Aktionen abwertend und respektlos sind. Kann ja gut sein dass sie auch gute Intentionen hat aber ihr scheint es wichtiger zu sein sich als Retter der Migranten zu stilisieren als ein echter Verbündeter zu sein.",
            "Absolutes NDA\n\nIch habe auch Migrationshintergrund (Oma und Opa sind 1971 eingewandert) und habe mich noch nie respektlos behandelt gefühlt, wenn mir jemand derlei Fragen stellte. Ich finde sie vollkommen legitim und auch ein Zeichen von Interesse. Tatsächlich sind die Leute eher interessiert, wie ich „zusammengesetzt“ bin, worüber ich mich bisher immer herrlich amüsiert habe (im netten Sinne). Egal, ob sie mich fragen, wie man meinen Namen richtig ausspricht, ob eines meiner Eltern wohl Deutsch ist (helle Augen und Taint) oder warum ich denn Schweinefleisch esse 😮 (nicht anklagend),…. Ich antworte einfach locker darauf und fühle mich nie irgendwie beleidigt. Derlei Fragen kommen auch gerne mal von Nicht-Deutschen und es entwickelten sich in der Vergangenheit recht nette Gespräche. Alles kein Problem und völlig ungezwungen. Ich bin zu einer Zeit ausgewachsen, als man derlei Dinge noch ansprechen konnte, ohne sich schuldig zu fühlen oder vor Wut rot anzulaufen, weil das sich echauffieren ja so modern ist. Alles sehr anstrengend. Bleib weiterhin so locker und lass dir von solchen Menschen nicht die Laune verderben. ",
            "NDA. Natürlich ist manches Verhalten der Patienten grenzwertig, aber das zu beurteilen ist deine Sache als Betroffene. Als dritte dir zu sagen wann du dich betroffen zu fühlen hast ist der eigentliche Rassismus, finde ich, weil es dir im Kern unterstellt, du seiest zu hilflos und zu dumm um das selber beurteilen zu können, und brauchst die Hilfe des white saviors.",
            "[removed]",
            "NDA, ist doch fast schon rassistisch von der Kollegin, Dir zu unterstellen, dass es dir rassistisch vorkommen müsste, wie du behandelt wirst.",
            "[removed]",
            "Info: Ich glaube sie versucht Anschluss zu finden und das evtl über einen gemeinsamen Aufreger. Könnte das nicht sein? \nÜbrigens hat sie Recht zwei der Fälle fallen vollständig, einer teilweise unter die Definition von Alltagsrassismus. Es ist voll okay zu fragen wie man einen Namen ausspricht. Es ist nicht okay anzunehmen dass jeder kompliziert klingende Nachname ausländisch ist und man dann überrascht sein sollte.\nVielleicht gibt es hier kein Arschloch. Sie versucht vielleicht unsicher eine Arbeitsfreundschaft aufzubauen und du schaffst es nicht ihr zu sagen, dass du mit ihr eigentlich gar nicht reden willst. Ich würde vielleicht erstmal diese Beobachtung machen: ist sie einsam? Fehlt ihr generell Anschluss?",
            "NDA sag ihr es ist rassistisch dich zu bevormunden, dass sie hier einen Art moralischen Ablasshandel auf deine Kosten macht und dass du kein Interesse an ihren Kommentaren hast. Am besten ein Gespräch zu 3. Mit dem Oberarzt wo du sie vorführst. Ihr Verhalten ist unprofessionell, problematisch und hindert dich an der korrekten Durchführung deiner Arbeit da du dich auf so einen Unsinn konzentrieren musst anstatt Patienten Doku etc.",
            "[removed]",
            "NDA, die Kollegin sollte dich eher fragen und daraus lernen, wie die Situation zu bewerten ist, und nicht behaupten, dass deine Patienten rassistisch sind. \n\nKenne das mit internationalen Studenten, dass man sich über seine Heimatländer unterhält - das ist normaler Smalltalk, wenn man jmd anderes nicht kennt, aber man einen auf eine bestimmte Herkunft hindeutenden Namen hat.",
            "[removed]",
            "NDA ich finde dich, von dem was du schreibst bodenständig und auch so, wie man mit sich umgehen soll. Man muss nicht immer alles auf eine waagschale legen. Deine Kollegin hingegen lebt in einer hypersensiblen bubble.",
            "NDA! Deine Kollegin dagegen…",
            "NDA. Du kannst ihr sagen, dass du es rassistisch findest, dass sie dir nicht zutraut selber zu bemerken, wann dinge für dich rassistisch sind und dass du keine Frau ohne migrationshintergrund brauchst die dir die Welt erklärt. Ich finde das bevormundend. Als wärst du nicht in der lage es selber zu begreifen.\nDas gleiche bei dem anderen kollegen. White savior complex",
            "[removed]",
            "[removed]",
            "NDA\nich habe selber migrationshintergrund und ich weiss nicht was zur zeit mit de los ist, aber irgendwie wird diese rassismus suche zu einer behandlungswürdigen latenten krankheit.\nmein eindruck ist, dass mittlerweile sich um dieses thema eine so große „industrie“ von vereinen, ngo, aktivisten und selbsternannten weltretter entwickelt hat dass die allein zum selbsterhalt das thema immer tiefer den leuten einreden müssen. die sehen rassismus und ungleichheit überall, wo wir noch nicht mal drüber nachdenken würden.\naber so kann die eigene existenz gerechtfertigt werden",
            "NDA spätestens wenn du ihr gesagt hast, dsss dss nicht not tut...ich msg solche 'white knights' auch nicht unbedingt die meinen für minderheiten sprechen zu müssen.\n\nBei nem spannenden Namen frag ich immer wo der Name herkommt, weil er nicht aus dem deutschen Sprachraum ist. Das spart einem das 'ich bin hiet geboren'",
            "NDA\n\nDie Kollegin ist rassistisch, weil sie schon so denkt😂 wahrscheinlich negativ gepolter Mensch der damit sein Ventil hat. Oder anders gesagt gibt ihr sowas Energie um zu funktionieren😅\nAber ganz ehrlich würde ich um sie auch einfach einen Bogen machen, wenn möglich.",
            "[removed]",
            "NDA - du kannst ja selbst entscheiden was du schlimm findest und was nicht. Is im Endeffekt auch bisschen rassistisch von ihr weil sie das ja zu anderen \"deutschen\" Mitarbeitenden nicht sagt. \n\nAllerdings sind die Situationen die du jetzt geschildert hast auch tatsächlich einfach rassistisch. Eben nur nicht böse gemeint. Und du hast dann eben auch das Recht das nicht schlimm zu finden. Und es ist eben komisch von ihr, dir das gegenüber immer wieder so anzusprechen wenn sie weiß, dass du damit kein Problem hast.",
            "[removed]",
            "NDA\nDeine Kollegin steckt scheinbar tief in der linken bubble.",
            "NDA. Das ganze Thema Rassismus wird, so wichtig es auch ist, momentan viel zu sehr aufgebauscht, vor allem von Menschen die selbst keinen Migrationshintergrund haben. Für mich persönlich (habe keinen Migrationshintergrund) ist das ein ganz normales und i.d.R. interessantes Thema zu fragen wo Leute herkommen. Sich darüber aufzuregen ist auch absolut künstlich. Wie du schon festgestellt hast, gibt es halt auch genügend Menschen die immer allen irgendwie einreden wollen, dass etwas rassistisch ist, was nicht mal die \"Betroffenen\" bzw Angesprochenen so interpretieren...\nDas lässt leider die wirklichen Rassismus Probleme etwas im Hintergrund verschwinden, weil immer mehr Leute nur noch genervt sind. Aber dass schafft die aktuelle Popkultur mit (Anti)Social Media ja bei den meisten Themen einfach zu übertreiben. (Gendern, etc.)",
            "[removed]",
            "[removed]",
            "NDA ! Niemand außer dir hat das recht für dich zu entscheiden, was du als rassistisch empfindest und es kotzt mich an, dass irgendwelche weißen Kartoffeln immer wieder der Meinung sind, Ausländer/POC/Personen mit migr. Hintergrund bevormunden zu müssen.",
            "NDA.\nAber ich kenne das, wobei man mir dann unterstellen will, Rassistin zu sein, wenn ich sowas frage.\nFür mich gehört das zum \"kultursensiblen Umgang\" denn wie soll ich bitte den pflegen ohne zu wissen aus welcher Kultur jemand kommt. \nEin Kenianer hat eine andere Kultur als ein Mensch aus Somalia. Eine Chinesin eine andere als eine Vietnamesin. (Und nein, damit will ich nicht sagen, dass für mich alle gleich aussehen... Aber ich gehe nicht vom Aussehen alleine aus auf eine bestimmte Kultur oder Religion).\nUnd auch wenn man in D geboren ist: die Eltern  bringen ja nun auch ihre Herkunft/Religion in die Erziehung mit ein.\nBei strengen christlichen Eltern gibt es auch einen Unterschied zwischen katholisch, evangelische, freikirchlich, etc. \n\nIch versuche meine Frage immer so wertschätzend wie möglich zu formulieren, die meisten empfinden es auch so, Probleme machen da eher die lieben weißen Kolleg:innen, die sich berufen fühlen, mich zu maßregeln.",
            "[removed]",
            "NDA. Es ist eher rassistisch, dich aufgrund deines Migrationshintergrunds ständig unter Artenschutz zu stellen und dich zu bevormunden bzw. Situationen für dich zu bewerten. ",
            "NDA. Deine kollegin reduziert dich auf deinen migrationshintergrund und ist demnach rassistisch 😌 (im ernst mach dein ding und ignorier sowas)",
            "NDA. Nichts rassistisches zu lesen. Deine Kollegin ist unentspannt.",
            "NDA.\n\n>fragt dann auch, wie lange ich schon in Deutschland bin, weil ich so „gut“ deutsch spreche.\n\nDas hingegen ist internalisierter Rassismus & zumindest etwas, was die Kollegin zurecht anspricht, damit eben (so blöd es klingt) Menschen mit Migrationshintergrund in Deutschland als Deutsche normalisiert werden. Und das geht nur über die notwendige Awareness.",
            "Was ist mit diesen ganzen ähnlich beschriebenen Ragebait posts in letzter Zeit? Ich glaub einfach null, dass auch nur einer davon wirklich passiert ist.\n\nBDA.",
            "NDA\n\nHabe selbst im Ausland gelebt, mein Name ist fremdländisch und meine Frau ist Nichtdeutsche, unsere Kinder können Deutsch, aber besser ihre Muttersprache.\n\nDas ist normaler SmallTalk.",
            "NDA\nImmer diese vorauseilende Pseudobetroffenheit 🙄",
            "NDA \n\nIch bin durchaus jemand, der der Meinung ist, rassistische Redefiguren und Vorstellungen, und durchaus auch Mikroaggressionen müssen als rassistische Mechanismen benannt werden.  Ich bin da wahrscheinlich ziemlich weit auf der woken Seite. Was bei diesem Diskurs aber oft zu kurz kommt: man kann sie Sprecherabsicht nicht außer Acht lassen, als Erwachsener kann man es durchaus auch mal mit \"es war ja gut gemeint\" bewenden lassen, gerade in so einem Arzt/Patient-Verhältnis oder überhaupt in einem Zusammenhang.  Wir leben alle in einer Gesellschaft die dir überkommenen rassistischen Denkmuster noch überwinden muss. Da ist es gut und wichtig, auch solche Gedankenlosigkeiten zu hinterfragen und zu problematisieren, aber es kommt aufs Maß an. Ich verstehe schon, was Deine Kollegin, meint, aber so zu tun, als ob man nicht wahrnähme, dass das Gegenüber einer anderen Community angehört, ist kein Antirassismus sondern nur Vogel-Strauß-Methode. \n\nDer Kontext in irgendeiner Art Pflegeeinrichtung, wie Du ihn beschreibst, ist auch wichtig: die Leute sind halt froh, irgendein Thema zu haben, über das sie mit Dir reden können.",
            "NDA. Du darfst immer selbst entscheiden von welchen Aussagen du dich angegriffen fühlst oder halt auch nicht. Deine Kollegin klingt nach einer dieser Personen, die unbedingt super politisch korrekt sein wollen und dabei komplett über die Stränge schlagen.",
            "NDA...Willkommen in der Links Grünen Ideologie.\n\nDauert nicht mehr lange dann bist du auch ein Rassist, weil du das alles nicht als Rassistisch empfindest.\n\nKann diesen ganzen Blödsinn nicht mehr hören!",
            "Ich glaube da gehen ein bisschen die Definitionen von Rassismus auseinander. Rassismus ist ein struktuelles Problem, aka die systematische Benachteiligung von Personengruppen, die nicht auf Anhieb als Deutsche identifiziert werden können (STARK Vereinfacht). Das ist wohl das, was deine Kollegin beschreibt. Natürlich sind deine beispiele rassistisch.\n\nMusst du dich deswegen diskriminiert fühlen? Nein, musst du nicht. Gefühlter Rasissmus (evtl. näher an Diskriminierung) und systematischer Rassismus sind unterschiedliche Sachen.\n\nDeine Kollegin ist trotzdem das A, wenn sie nicht aufhört, dich damit zu nerven, obwohl du schon meintest, das sie das lassen soll.\n\nNDA",
            "NDA, Deine Kollegin hat einfach nur nen heftigen Knall, ganz einfach!",
            "Nda. Achte einfach mal drauf wer immer Rassist schreit. Immer die Gruppen die garnicht davon betroffen sind. Das ist wie wenn sich ein bayer darüber beschwert das sich einer über hessen lustig macht",
            "NDA. Definitionsgemäß ist es zwar rassistisch, Menschen bei ausländischen Namen nach der Herkunft zu fragen, wenn man das bei einer Frau Müller nicht machen würde. \n\nAber du hast sie gebeten, das nicht dauernd zu thematisieren, und das sollte sie dann auch respektieren. Dir ungebeten dauernd Diskussionen über den kleinen Alltagsrassismus aufzudrängen ist auch überhriffig.",
            "NDA\n\nAber mich würde interessieren wie deine Kollegin gesellschaftlich einzuordnen ist (alter vor allem).\n\nZu ihrer Verteidigung: es gibt so Leute, die sehr oft und lange nachfragen, woher man käme, obwohl die Antwort Ludwigshafen, Essen, münchen, Hamburg, usw. hieß. Das wäre dann doch ab n gewissen Punkt rassistisch. \nVermutung meinerseits: deine Kollegin ist zu sehr sensibilisiert auf solche Themen, dass sie die normale gesellschaftliche höfliche Frage nach nem kulturellem Kontext ggf. Nicht als solche wahr nimmt.\n\nEs liegt an dir, ob du das selber umsetzen möchtest, sie da zu sensibilisieren. Musst du natürlich nicht. Ich glaube aber, sie würde sich freuen.",
            "Dass jemand glaubt, du könntest aufgrund deines Namens nicht aus Deutschland sein, ist halt schon hart ignorant. Den Rest sehe ich eher wie du, auch wenn manche von sowas genervt sind.\n\nIch vermute deine Kollegin bekommt es halt mit, dass du nur aufgrund von Oberflächlichkeiten anders behandelt wirst und findet das schlimm. Gleichzeitig merkt sie aber nicht, wie sehr sie selbst mit dem Thema rumnervt. Von daher: klares NDA.",
            "NDA, offenbar ist deine Kollegin rassistisch und überkompensiert das ansonsten würde sie nicht alles rassistisch wahrnehmen...am besten von ihr fern halten.",
            "NDA\nNur deine Kollegin hat ein echtes Problem",
            "NDA. Ich denke deine Kollegin ist Rassistin weil sie anscheinend oft in diesen Kategorien denkt.",
            "NDA ich komme aus Polen, und wenn mich jemand auf meine Herkunft anspricht, dann freue ich mich total und finde, dass das ein Zeichen von Interesse ist.\n\nMein Nachname wird so gut wie nie richtig ausgesprochen, was mir auch völlig Schnuppe ist.\n\nIch falle aber nicht als Pole auf, weswegen selten jemand fragt, wo ich herkomme.",
            "NDA aber deine Kollegin eindeutig. Immer wieder interessant dieses Phänomen zu sehen, dass ausgerechnet weiße Wokies meinen Jedem erzählen zu müssen was rassistisch sei.\nDiese Leute sind Gift für jede gesunde Gesellschaft, da sie nur spalten können und anderen Rassismus einreden wollen, obwohl es nur Neugierde an der anderen Person ist.",
            "NDA Du hast vollkommen recht.... Das was sie da macht ist bevormundend und spaltend!\n\nJe mehr unnötige Kleinigkeiten als \"problematisch\" gebrandmarkt und als \"durch identitätspolitische Maßnahmen zu lösen\" betrachtet werden.....je weiter geraten die wirklich wichtigen Dinge aus dem Fokus der Politik.\n\nWir brauchen mehr Zusammenhalt in der Gesellschaft.....und das erreichen wir nicht damit, jedem Mitmenschen irgendeinen \"Ismus\" zu unterstellen, ohne sich aber irgendwie mit ihm auszutauschen.....",
            "NDA. Ich habe selbst einen untypischen Namen, auf den ich regelmäßig von Fremden angesprochen werde. Ich sehe das eher als Eisbrecher um ins Gespräch zu kommen.\nDeine Kollegin hat einfach nur einen an der Klatsche.",
            "Nda\n\nSag der dinkeldörte,dass sie sich um ihr Zeug kümmern soll, wenn sie keiner fragt.",
            "NDA und ja, deine Kollegin befeuert kräftig Rassismus.",
            "NDA, klingt nach nem typischen whiteknight die sich selbst wichtig machen will...",
            "NDA\nDie alte ist wohl krankhaft vom Rassismus verfolgt.",
            "NDA. Schuldkult knallt bei einigen extrem rein.  Musste das auch erst lernen als wir nach Deutschland kamen.",
            "NDA\n\nDeine Kollegin klingt mega nervig. Wie jemand, der regelrecht nach Problemen SUCHT. - Und sie dort \"findet\", wo eigentlich gar keine sind.\n\nIch meine ist streng genommen sogar rassistisch, dass sie immer gleich dich fragt, wie du das empfandest. Sind doch immer Leute wie deine Kollegin, die das sogenannte \"Othering\" kritisieren. Nach dem Motto: ,,Hey, du bist doch auch so einer. Was meinst du denn dazu?\"",
            "NDA. Rassismus ist für mich (mit Migrationshintergrund übrigens) immer mit Abwertung verbunden. Das ist aber nicht automatisch der Fall, wenn man nach der Herkunft fragt. Es *kann*, *muss* aber nicht rassistisch sein. \n\nViele politisch links stehende Menschen missbrauchen den Rassismus-Diskurs dafür, sich als moralisch überlegen darzustellen.",
            "Rassistisch wäre, wenn ein Patient von dir nicht behandelt werden will, weil du nicht Egon Müller heißt und blond bist.\n\nAnsonsten kommt es halt immer auf den Ton an und auf die Situation. Klar kann eine Frage nach der Herkunft rassistisch sein, wenn ich darauf eine Entscheidung treffe. Z.B. vermiete ich dir eine Wohnung weil deine Eltern nicht aus deutschland kommen? oder mir deine Hautfarbe nicht passt.\n\nEs kann aber auch ganz normales Interesse am Menschen gegenüber sein. \nIch habe selbst keinen deutschen Nachnamen. Ich werde hin und wieder darauf angesprochen.\nIch frage dann auch immer nach woher der andere Mensch kommt auch wenns er Müller heißt. Ist auch sehr interessant… Manche heißen nur in 2ter Generation Müller und die Mutter kommt dann aus ursprünglich aus Peru oder so. Alles schon erlebt.\n\nIch finde es verbindet Menschen, wenn wir unsere Geschichten miteinander teilen. Solange wir dabei neugierig und offen und nicht abwerten oder gar ablehnend sind. \n\nLetztendlich musst du bewerten wie die Situation war.\n\nWas deine Kollegin angeht. Ich weiss nicht ob ich sie als A bezeichnen würde.\nIhre Absicht ist sicherlich nicht negativ und sie hat weder einen Vorteil für sich noch eine böse Absicht dir oder deinem Kollegen gegenüber. Zumindest erschließt sich diese mir aus deiner Schilderung nicht.\n\nIch würde sie daher mal freundlich fragen, wo sie herkommt und ein wenig über ihre Geschichte sprechen. \nVielleicht versteht sie dann, dass es auch ein freundliches Interesse sein kann.\n( Und wenn sie sagt „deutschland“ dann lass dich davon nicht abspeisen. Gerade deutschland ist ja so unterschiedlich in seinen Regionen…. ) \n\nIch verstehe aber auch, dass dir die Situation auf den Senkel geht.\nDu kannst dich auch versetzen lassen, wenn du es nicht nochmals mit ihr im Gespräch versuchen willst.\n\nIch sehe auf jeden Fall KAH.",
            "Absolut NDA\n\nMenschen, welche andere bevormunden und meinen, dass diese nicht selbst auf sich aufpassen können sind deutlich nerviger als Personen, die einfach Interesse an dir bzw. deiner Geschichte haben. \n\nIst doch selbstverständlich, dass man (wenn man denn anders aussieht als 70/80% der Bevölkerung) mal von anderen Personen gefragt wird, woher man kommt und wie eventuell der Lebensweg war. Genauso wie auch die Frage, wie man denn den Namen richtig ausspreche (Kulturoffener kann man doch garnicht sein wtf??).\n\nWenn ich als komplett weißer Typ in nem asiatischen Land oder einer afrikanischen Stadt leben würde hätte ich doch auch kein Problem damit, wenn ich nach meinem Leben & Ursprüngen gefragt werde, da man halt einfach anders aussieht als die anderen. \n\nSolche Menschen wie deine Kollegin möchten einfach die komplette Gleichstellung von farbigen- & nicht farbigen und Frauen & Männern, und sind meist einer sehr feministischen politischen Meinung angeschlossen, obwohl das wirklich schöne im Leben doch die Unterschiede zueinander und Einzigartigkeiten sind. \nEine Gleichberechtigung ist selbstverständlich absolut wichtig & notwendig, eine Gleichstellung jedoch zerstört die Menschlichkeit.\n\nZuviel gelabert aber so pseudo-Gutmenschen wie deine Kollegin gehen mir einfach mächtig auf die Eier.",
            "NDA. Du bist einfach reflektiert. Good for you.",
            "NDA\nRassismus wird besiegt in dem man nicht drüber redet.\nPermanent die „rassen“ Karte ziehen ist schon eher rassistisch.\nWas würdest du nur tun wenn sie dich nicht permanent daran erinnern würde jetzt doch bitte empört zu reagieren.",
            "NDA - Das sind halt einfach eure unterschiedlichen Auffassungen und Meinungen darüber, was rassistisch ist und was nicht.\n\nAllerdings, so finde ich, schadet sie damit irgendwie allen, die wirklich darunter leiden. Wenn die Messlatte für rassistisches Verhalten immer niedriger gelegt wird, dann entwertet das schon irgendwie das Problem an sich und macht Leute überdrüssig. Es sind natürlich Fragen, die aufgrund von Äußerlichkeiten und gewisser Stereotype gestellt werden, aber das ist doch wir entfernt von Rassismus. Da fehlt doch einfach diese bösartige Komponente, die Ablehnung, Hass, fiese Unterstellungen... 🤷🏼‍♀️",
            "NDA, deine Kollegin ist eine von diesen verrückten Neu-Linken",
            "NDA. Bin 100 % auf deiner Seite. Ich frage auch manchmal „Wo kommst du her?“ und interessiere mich einfach dafür wie man sich auch für die Herkunft eines Bayern, Schwaben oder Sachsen interessiert. \n\nIch weiß, dass diese Frage rassistisch gelesen werden kann. Ich finde es aber einfach spannend, ob jemand mit türkischen Eltern aus Wanne-Eyckel oder ein Schwabe aus Wattenscheid kommt, der durch seine Eltern schwäbisch spricht. \n\nNo-Go ist für mich „Du kannst aber gut Deutsch!“, finde aber auch nicht rassistisch. Rassistisch wäre es, wenn man den anderen auf Grund seiner Hautfarbe, Name oder Deutschkenntnisse diskriminiert. \n\nEs ist ein heikles Thema, das ich gerne umschifft. Es gehen aber viele Gespräche flöten. Für mich ist es spannend, was den andsren Mensch ausmacht, und da gehört nunmal auch die Herkunft und die der Eltern dazu.",
            "NDA. Ich finde aber Leute sollten endlich mal checken, dass \"etwas rassistisches sagen\" nicht gleichbedeutend mit \"ein völliges Arschloch sein\" ist. Natürlich ist die Annahme, dass du aufgrund deines Namens oder deines Äußeren nicht in Deutschland geboren sein kannst, rassistisch. Dem liegt zugrunde, dass man, vielleicht auch unbedachterweise oder unbewusst, davon ausgeht, das Deutsche ein bestimmtes Aussehen oder bestimmte Namen haben, das also ganz klar erkennbar ist, wer deutsch ist und wer nicht. Das stimmt halt nicht, weil jeder die deutsche Staatsbürgerschaft haben kann. Auch diese Neugier, dass man immer fragen muss und Leute als fremd und damit Objekt der Neugierde wahrnimmt, ist rassistisch. Ist halt Alltagsrassismus, den wir alle in uns tragen. \n\nDas heißt aber a) nicht, dass die Menschen die dich das fragen, böse sind. Im Zweifelsfall wissen sie es nicht besser, oder meinen es ganz unschuldig. Trotzdem ist ihre Annahme eben rassistisch. Das kann beides gleichzeitig existieren. Und es heißt b) außerdem nicht, dass es dich unbedingt stören muss. Du nimmst es halt locker, oder siehst ganz natürlich, dass die meisten Leute sowas nicht böse meinen und steigerst dich da nicht rein, oder oder oder. Das ist natürlich dein Recht und finde ich auch verständlich. Deine Kollegin ist das A, weil sie dir vorschreiben will, wie du dich zu fühlen hast und dich nervt mit ihren Kommentaren, obwohl sie checken sollte, dass es bei dir nicht landet, und dass es nicht ihr Job ist, dir vermeintlich was über Rassismus beizubringen. Trotzdem macht die Tatsache, dass es dich nicht stört, es nicht weniger rassistisch.",
            "NDA, mit Rassismus hat das nix zu tun. Wenn man den aber überall sehen will, sieht man ihn natürlich. Ich finde dieses \"sie sprechen aber gut deutsch\" auch nervig. Aber von Rassismus ist das meilenweit entfernt. Menschen wie deine Kollegin sind schuld daran, dass das Wort jegliche Bedeutung verliert.",
            "NDA - das Syndrom was du beschreibst würde ich fast schon als neuartige Krankheit definieren. Solche Leute wollen sich damit profilieren wie weltoffen sie sind und wie viel schlechter alle anderen sind - gleichzeitig projizieren die eine opferrolle in (in dem Fall) Dich hinein, um für dich einzustehen- obwohl absolut übertrieb und überhaupt nicht notwendig. Ein total (sorry) beklopptes beschützersyndrom. \n\nAußerdem relativieren diese Leute Rassismus. \nDas ist genau so, wie jeden zweiten als nazi zu beschimpfen weil er gewisse Vorurteile oder kritische Ansichten auf gewisse Themen hat.\n\nBeides ist ein politischen Problem und Phänomen(im entfernten Sinne zumindest)",
            "NDA - Sie hat zwar schon irgendwo recht das so manches davon auf verinnerlichtem Rassismus basiert, aber zum einem nicht alles und zum anderen hilft es auch keinem das sie das dann anmerkt. Und ob dich das zu stören hat ist nochmal eine andere Sache wo sie sowieso nix zu zu sagen hat. Das sie dich darauf immer wieder hinweist kann schon sehr nervig sein und das sie trotz mehrfacher Bitte nich aufhört geht gar nicht - da dann zur not ne höhere Instanz zu mobilisieren klingt sinnig.",
            "KAH- vielleicht hat sie ja Freunde/Bekannte etc. Die das alles anders sehen und ist deshalb sensibilisiert. Ich wäre in ihrem Team. Warum muss man ständig über Herkunft reden? Finde dass kann man machen, wenn man jemanden besser kennen lernt oder die Person es selbst erwähnt. Aber, klar kannst du dich anders einplanen lassen. Auf Dauer wird man sich nur gegenseitig auf die Nerven gehen.",
            "NDA.\n\nIch würde ihr in bester Dürrenmattscher Manier den Weg weisen: \"Was ich als rassistisch empfinde,  bestimme ich.\"",
            "NDA \n\nFind ich übrigens witzig. Reddit-User sagen anderen auch gern was sie rassistisch finden sollen. Können die Downvotes sehr gern hageln kommen - aber es geht nicht nur dir so lol\nGibt sicher einige die sich da selbst an der Nase greifen können - manche werden echt überkritisch",
            "NDA sie ist ein typisches Beispiel für \"antirassismus=rassismus\" und den antrainierten deutschen anti-nazi-reflex den so viele Leute mit Migrationshintergrund an uns beobachten und lustig/dumm/reif zum ausnutzen finden. Sie meint es gut und wahrscheinlich auch ehrlich, aber sie ist einfach ein bisschen hirngefickt und unreflektiert.\n\nWenn du sie grundsätzlich nett findest, hilf ihr diese Hirnwäsche zu überwinden... oder auch nicht, ist ja nicht deine Aufgabe :).",
            "NDA, finde es relative cringe wenn sich leute auf die diskrimination nicht zutrifft immer so darauf aufgeilen es bei leuten wo es doch zutrifft immer anzusprechen, wenn die andere person so etwas nie anspricht... Es sollte an dir liegen solche themen anzufangen und sie soll sich an deine bedürfnisse anpassen was diese thematik angeht. Natürlich meint sie es nicht böse, aber sowas soll man ansprechen wenn man das gefühl hat die andere person redet auch gerne über diese thematik, sonst zieht es die andere person ja nur runter dann auch noch ständig daran erinnert zu werden.",
            "NDA\n\nDu entscheidest, was du deiner Person gegenüber als rassistisch empfindest.\n\nDas Gleiche gilt natürlich auch für deine Kollegin, allerdings gibt ihr das nicht das Recht, dir zu sagen, was du empfinden sollst.\n\nSprich mit deiner Kollegin, erkläre ihr, dass sie diese bevormundenden Kommentare lassen soll. Falls das nicht hilft, schau, ob du den Dienstplan ändern lassen kannst.",
            "NDA- bin selber Ausländerin mit einem (in Deutschland) Namen der ziemlich schwer auszusprechen ist. Die Fragen wo man herkommt ist meistens reine Neugier und wenn es dich nicht stört warum stört es deine Kollegin? Du weißt ja selbst wo deine Grenzen sind",
            "NDA; ist trotzdem Alltagsrassismus. Finden halt andere Menschen mit Migrationshintergrund trotzdem scheiße immer gefragt zu werden woher sie kommen.",
            "NDA. Woke medienmanipulation. Sehr schlimm geworden.",
            "NDA, der typ hat wohl nen white savior complex",
            "NDA\n\nTrotzdem sagt deine Denke sehr viel über deine Rassismus-Definition aus, leider.\n\nEs ist grundsätzlich rassistisch jemanden mit einer anderen Hautfarbe zu fragen, wo er denn \"wirklich\" herkommt. Ich als Weißer wurde das noch nie gefragt... \n\nEs ist rassistisch zu sagen, dass du gut Deutsch sprichst. Die Leute erwarten von dir, dass du nur ein dummer Kan... bist und trauen dir nicht zu, dass du ihre Sprache kannst. Zu mir wurde noch nie gesagt, dass ich gut Deutsch kann, weil ich weiß bin...\n\nVermutlich meinen es die Leute nicht böse, aber ihre Fragen deuten auf ein rassistisches Weltbild hin und vermutlich tickst du selber so und nimmst es deswegen nicht als Rassismus wahr. Du bist halt ganz normal wie sie, rassistisch eben und würdest aufgrund von Herkunft oder Erscheinung die selben Aussagen treffen.\n\n(jetzt bitte keine Vergleiche wie das im Urlaub läuft, denn du schilderst eine Situation in Deutschland und nicht in Tokio)",
            "NDA, wobei ich nicht finde, das jemand einen Migrationshintergrund haben muss um Sachen rassistisch zu finden. Grundsätzlich ja immer gut wenn möglichst viele Leute gegen Rassismus sind und den auch als solchen benennen.",
            "NDA - sie kann nichts dafür, sie hat es so in der Schule/Studium gelernt. Kenne auch eine die mir erzählen wollte dass es keinen Rassismus gegen Weiße geben kann, weil....\n\nSolche Frauen/Mädels haben einfach einen Komplex und das ganze streßfreie sorgenfreie Leben wird mit Themen wie Klimaschutz/Politik/Feminismus gefüllt.",
            "NDA. Linke Irre.",
            "NDA mit Tendenz zu K A H.\n\n\nNatürlich kannst du selbst für dich sprechen und für dich entscheiden, was du als rassistisch empfindest. Sie hat dir da nicht reinzureden, vor allem als selbst nicht Betroffene. Sie könnte stattdessen ja auch an deiner Meinung interessiert sein und einfach ein gleichberechtigtes, offenes Gespräch mit dir führen. Das wäre bestimmt interessant für beide Seiten. :) Aber so nicht. \n\n\nIch unterstelle deiner Kollegin allerdings zumindest gute Absichten, wenn auch bei schlechter Ausführung. Und wenn man ihr Verhalten mal gesellschaftlich betrachtet, empfinde ich es schon als Fortschritt im Vergleich zu \"früher\", dass sie (als Person, die wahrscheinlich noch nie von Rassismus betroffen war) sich so sehr - vielleicht zu viel - darüber bewusst ist. \nVielleicht über das Ziel hinausgeschossen, aber immerhin.",
            "NDA aber das das „Kompliment“ wie gut man doch Deutsch spricht finde ich schon rassistisch.",
            "Ja bot,  du bist BDA",
            "NDA\n\nSie kann das gern rassistisch finden und du nicht, das ist völlig in Ordnung, da sie aber immer wieder auf dich zukommt, um dir ihre Meinung kundzutun, obwohl du das anders siehst und ihr das auch klar so kommuniziert hast, bist hier sicher nicht du das Arschloch",
            "NDA\n\nWas du als rassistisch dir gegenüber empfindest ist deine Entscheidung. \n\nNatürlich ist es wichtig rassistisches Verhalten zu benennen und Menschen die davon betroffen sind beizustehen und zu unterstützen, aber wenn du, als der, dem es passiert ist, das nicht als rassistisch siehst, sollte deine Kollegin sich da nicht einmischen.",
            "NDA aber deine Kollegin hat garantiert irgend ein Problem wenn sie alles für rassismus hält…",
            "NDA\n\nBesonders ältere Menschen stellen solche Fragen, nicht weil sie rassistisch sind, sondern Interesse an Mitmenschen zeigen.",
            "Toll das sie sich stellvertretend empört, dann musst du das nicht tun.\nNDA",
            "NDA\n\nSag deiner Kollegin es ist rassistisch, davon auszugehen, dass \"die Ausländer\" nicht für sich selbst einstehen können.",
            "NDA. Kommt immer drauf an, wie man fragt. Wenn es echtes Interesse ist, ist das sicher nicht rassistisch.",
            "NDA Ich finde du hast eine gute Einstellung. Die meisten Situationen die du beschreibst scheinen einfach normale Unterhaltungen zu sein. Ein Mensch hat eine, relativ oberflächliche, Unterhaltung mit einem anderen Menschen. Wenn jemand einen unüblichen Namen oder so hat fragen halt manchmal Leute (ohne großen Hintergedanken) danach etc.\n\nEhrlich gesagt find ich deine Kollegin fast rassistischer als die Leute in den von dir beschriebenen Situationen. Sie hat doch immer deine Herkunft im Hinterkopf. Mach einfach weiter so wie bis jetzt und ignoriere sie.",
            "NDA\n\nDas Wort rassistisch wird inzwischen so inflationär genutzt…",
            "NDA - deine Kollegin klingt total anstrengend und sucht ja schon fast zwanghaft nach Problemen, wo keine sind. Klingt für mich nach der Sorte Mensch, die sich moralisch aufspielt, um sich besser als diese „Rassisten“ zu fühlen. Ich kenne leider einige solche Menschen und man kann es denen auch einfach nicht klar machen, dass vieles aus Unwissenheit oder Neugier gefragt wird und es vllt nach einer Weile nicht mehr so interessant ist, immer das gleiche zu erklären, aber es überhaupt nichts mit Rassismus zu tun hat. Wenn ein Deutscher einen sehr ungewöhnlichen Namen hat, wird ja auch hin und wieder gefragt, woher der Name kommt oder wie man ihn ausspricht. Und vieles ist ja auch als Kompliment gemeint und überhaupt nicht als Abwertung. Du machst da rein gar nichts falsch!",
            "NDA Finde daran auch nichts rassistisch. Sind doch eher Fragen aus Interesse. Jedenfalls so wie du es erzählst.\nKrank. Heutzutage darf man nkcht mal mehr jemanden was fragen, ohne gleich einen Stempel zu kriegen.",
            "NDA. Ich freue mich ehrlich gesagt über Deinen Post, weil es mich immer interessiert, wo jemand herkommt oder seine Wurzeln sind. Ich frage aber oft nicht, gerade weil ich denke, dass ich falsch verstanden werden könnte.  \n\n\nBei Personen aus Ländern, wo kein Rassismus unterstellt werden würde, z.B. bei französischem oder englischem Akzent (oder aus Deutschland bei einem Dialekt) frage ich allerdings immer sofort, ohne mir Gedanken zu machen.",
            "KAH weder du noch deine Kollegin. Dass dich das nervt ist völlig nachvollziehbar. Hast du mal versucht das Thema bei Ihr anzusprechen? Eventuell fühlt Sie sich dir auch verpflichtet \"beizustehen\". Es wird an so vielen Ecken zur Wokeness aufgerufen, dass es nicht verwundert wenn manche in so eine übertriebene und unsensible Richtung tendieren.",
            "NDA. Du bist betroffen, sie nicht. Ergo obliegt es durchaus bei dir.\n\nMal abgesehen davon kann ich Leute die sich stellvertretend diskriminiert fühlen absolut nicht ausstehen, die sind für mich gleich DA.\n\n>76 Jährige Patientin fragt mich vorher ich komme. Im Nachhinein meinte meine Kollegin dann „total rassistisch, dass die Leute immer wieder sowas fragen.“\n\nIch weiß auch nicht warum man hierbei gleich auf Rassismus kommen muss.\n\nIst es nervig wenn man in Deutschland geboren wird und ständig diese Frage zu hören bekommt, nur weil man einen etwas dunkleren Hautton oder einen nicht geläufigen Dialekt hat?\nBestimmt.\n\nDarf man sich deswegen beleidigt fühlen und es den Leuten übel nehmen?\nDefinitiv.\n\nMuss es immer böse Absicht oder gar Rassismus sein?\nNein. Meist ist es eher eine Mischung aus Ignoranz und unpassendem Small Talk und nicht von böser Absicht geprägt.\nMan könnte hier vielleicht unterschwelligen Alltagsrassismus unterstellen, aber die Brücke finde ich mehr als nur ziemlich brüchig.\n\nHabe die Frage tatsächlich auch schon mal versehentlich gestellt, das waren aber Bayern und ich dachte sie kommen aus Österreich.\nDie haben sich aufjedenfall rassistisch beleidigt gefühlt. Und zwar zu Recht. **/s** *(obviously)*",
            "NDA und die Kollegin sollte m. E. einfach mal die Klappe halten (eventuell mal dezent deutlich mitteilen?), schließlich geht sie das letztendlich nichts an - vor allem, wenn es dich diese Aussagen / Fragen nicht stören.",
            "NDA  \nDas ist doch ne ganz normale Frage  -.- wenn jmd nur fragt um dann drüber herzuziehen, ok, das ist klar daneben aber generell ist das doch nur Neugier. Oder Smalltalk.",
            "NDA\n\nEinerseits sind manche Beispiele schon irgendwie auch Alltagsrassismus, aber sie als Biodeutsche (?) hat nicht über sowas zu urteilen wenn du in dem Moment sagst dass du als \"Empfänger\" der Aussage das nicht so empfindest\n\nIch hasse diese stellvertretende Empörung für andere...\n\nBei mir ist das mit meiner Behinderung auch so ein Thema, was man selbst als negativ empfindet entscheidet man immer noch selbst als betroffene Person, und nicht irgendjemand anderes\n\nVor allem frag ich mich dann immer ob das auch wirklich echte Zivilcourage wäre wenns mal drauf ankommt, oder ob die Leute einem das in dem Moment dann nur als Solidarität verkaufen wollen",
            "NDA - und deine Kollegin sollte sich mal Gedanken darüber machen, wie sie auftritt. Ich finde ihr Verhalten anmaßend und bevormundend und denke, dass man ihr mal ordentlich die Wacht ansagen müsste. \n\nWenn sie diese Dinge als rassistisch empfindet, dann ist das ihre Sache, aber dir und scheinbar auch anderen Kollegen abzusprechen, dass es euch nicht stört, finde ich sehr schwierig. \n\nIch muss auch ehrlich sagen, dass ich mich gar nicht mehr richtig traue, Menschen nach ihrer Herkunft zu fragen oder Ähnliches, weil ich mir einfach nicht sicher bin, ob das rassistisch aufgefasst wird oder nicht - weil es eben Menschen gibt, die dieses wertfreie Interesse als Rassismus klassifizieren.",
            "NDA Habe auch Migrationshintergrund und würde die von dir beschriebenen Situationen wie deine Kollegin als eher rassistisch bzw. als Mikroaggressionen bezeichnen. Aber das ist halt meine Meinung und nicht deine. Wenn du die Situationen in Ordnung findest, kannst du das der Kollegin trocken sagen und wenn es nervt sogar nett darum bitten in der Richtung keine Kommentare in deiner Gegenwart zu machen und dass du stattdessen auf sie proaktiv zugehen würdest falls was wirklich wäre. Rassismus kann vor allem bei Mikroagressionen eine unglaublich individuelle Sache sein. Das, was weiße Leute gegen Rassismus am ehesten tun können, unsere Erfahrungen nicht abzusprechen, auch wenn es bedeutet, dass mal was nicht rassistisch ist. Ansonsten haben mal wieder weiße Menschen die Deutungshoheit und das finde ich ehrlich gesagt rassistischer als jede andere Mikroagression.",
            "Ja, zum Glück haben wir Menschen auf der Welt, die ihren moralischen Kodex allen aufzwingen möchten, auch wenn er von 95% der Welt nicht geteilt wird.\nRassismus Inflation ist das und wenn es mal wirklichen rassismus gibt, interessierst niemanden mehr, weil mit dem Begriff einfach nur um sich geworfen wird.\nKlares\n\nNDA",
            "NDA, ich kann dich sooo gut verstehen! Ich kenne selbst solche überkorrekten Lenas, die glauben, immer besser zu wissen, wie Minderheiten sich zu fühlen haben, als Angehörige von Minderheiten selbst.\n\nz.B.: Ich bin schwul und mit anderen Schwulen kommt es halt schonmal vor, dass man sich gegenseitig aus Spaß ein wenig ärgert. Ein Freund und ich haben das miteinander gemacht und sowas gesagt wie \"du kleiner Homo\" etc., was ganz klar ein Witz unter Freunden war. Da musste natürlich diese Lena wieder eingreifen und uns erklären wie schlimm das sei und dass wir wohl mit unserer eigenen Orientierung nicht klarkommen würden und dass sie das so traurig mache etc.\n\nSolche Damen denken, sie seien Jeanne D'Arc und müssten die Welt retten. Dabei sollten sie vor allem mal einfach die Klappe halten.",
            "BDA für Karmafarming",
            "NdA keine Sorge, du bist der Normale hier. Ich würde das mal grob als woke ideologie mit ein bisschen white saviour complex einordnen. Ich weiß nicht was in den letzten Jahren passiert ist, aber diese extreme Fokussierung auf alles, das rassistisch sein KÖNNTE ist nicht normal, kindisch & einfach unnötig. \nDas nimmt einem doch jede Lebensfreude, wenn man ständig überall eine böse Absicht bzw. ein Feindbild hineinprojeziert. \nIch würde die Kollegin nochmal ausdrücklich bitten, das in Zukunft zu unterlassen. Oder mal sowas sagen wie \"Finde ich ziemlich rassistisch von dir, mich hierbei zu bevormundunen.\" Dann sollte das aufhören.",
            "Info: du hasst doch sowieso deine Patienten laut deinem letzten Post, dann ist es doch egal wenn deine Kollegen sie auch noch rassistisch finden?",
            "Du bist NDA,  du bist einfach nicht besonders sensibilisiert auf das Thema. Deine Kollegin hat Recht, dass sind alles Microaggressionen, die in diesen Bereixh fallen. Das heisst nicht, dass es dich persönlich stören muss.",
            "NDA. Die Frage wie lange du in Deutschland bist sollte man m.M.n. unterlassen wenn jemand akzentlos spricht, oder sogar das Akzent von einer deutschen Region übernommen hat. Das mit dem Adler kann ich nicht einschätzen, ich weiß nicht welche kulturelle Bedeutung das hat bzw. wie das empfunden wird wenn es Personen aus anderen Balkanländern anwesend sind. Aber ganz übeles Verhalten sehe ich hier auch nicht. Ich denke, es gibt durchaus Patienten die viel schlimmere Sachen sagen wenn sie z. B. unzufrieden mit ihrer Behandlung sind oder betrunken ins Krankenhaus kommen.",
            "KAH Wir haben in den letzten Jahren doch alle gelernt, was rassistisch ist und dass wir um gute Allies zu sein, einschreiten sollen. Als weißer Mensch ist man nunmal privilegiert und schon per Definition ein Rassist. Die Fragen deiner Patienten sind sehr rassistisch und wäre ich deine Kollegin, wäre ich direkt eingeschritten und hätte dem Patienten gesagt, dass das nicht in Ordnung ist. Du darfst dich allerdings so fühlen wie du möchtest und bist daher auch kein A.",
            "BDA",
            "NDA\n\nDeine Kollegin hat keine eigenen Probleme und ist übersensibel",
            "NdA, nur die Patienten. Außerdem ist rassistisch hier der falsche Begriff, es ist faschistisch. Trotzdem hast du als „Betroffener“ nicht die alleinige Deutungshoheit, sondern auch die, die solche Übergriffe miterleben müssen",
            "Stimme dir grundsätzlich zu. Bin aber bei der Frage nach der \"Herkunft\" selbst immer ein bisschen zwiegespalten. Ich denke, es kann schon eine Wertung mit sich bringen i.S.v. \"du hast einen anderen Namen, also kannst du nicht \"einer von uns/deutsch\" sein.\" Oder was meinst du? \n\nWeiß nicht wie ich das entscheiden soll. Am Ende kommt es aber auf die Sicht der Betroffenen an also...",
            "Sehe ich absolut genauso. Davon abgesehen finde ich es persönlich eher rassistisch wenn Nicht-Betroffene meinen den Betroffenen ungefragt sagen zu müssen ob etwas rassistisch oder unangemessen ist oder nicht (aber den Betroffenen dabei natürlich NICHT um seine Meinung/Sichtweise fragen). Man kann halt auch gut sein wollen ohne es tatsächlich zu sein bzw. Wie heißt es so richtig: „Das Gegenteil von Gut ist Gut gemeint“.",
            "Du gehst also zu Leuten die aussehen als haben sie einen Migrationshintergrund und sagst „sie sprechen so gut Deutsch, wie lang sind sie schon in Deutschland“?    \n\nAber du hast recht das ist situativ, wenn OP gebrochenes Deutsch spricht obwohl er hier geboren ist macht die Frage sinn, wenn es seine Muttersprache ist und er ganz normal spricht finde ich die Frage doch sehr unsensibel, etwas anmaßend, bis rassistisch.",
            "Beste Antwort auf den Post finde ich. Danke!",
            "Peinlich auf jeden Fall, aber ich würde jetzt nicht alle weißen in einen Topf werfen, Rassismus und so ^^",
            "This ☝️\n\nDarf ein etwas längeres Zitat:\n\nAus dem Roman \"Stern der Ungeborenen\" von Franz Werfel, veröffentlicht 1946, verfasst aber noch vor 1945 ( wichtig!):\n\n\"Zwischen Weltkrieg Zwei und Drei drängten sich die Deutschen an die Spitze der Humanität und Allgüte. Der Gebrauch des Wortes ‚Humanitätsduselei‘ kostete achtundvierzig Stunden Arrest oder eine entsprechend hohe Geldsumme. Die meisten der Deutschen nahmen auch, was sie unter Humanität und Güte verstanden, äußerst ernst. Sie hatten doch seit Jahrhunderten danach gelechzt, beliebt zu sein. Humanität und Güte erschien ihnen jetzt der beste Weg zu diesem Ziel. Sie fanden ihn sogar weit bequemer als Heroismus und Rassenlehre. […] Sie waren die Erfinder der undankbaren Ethik der ‚selbstlosen Zudringlichkeit‘. Zur Erholung hielten die Gebildeten unter den Heinzelmännchen philosophische Vorträge an Volkshochschulen, in protestantischen Kirchen und sogar in Reformsynagogen, wobei ihr eintöniges Thema stets der brüderlichen Pflicht des Menschen gewidmet war. Ohne Pflicht ging’s nicht, wie ja die deutsche Grundauffassung vom Leben in der ‚Anbetung des Unangenehmen‘ bestand. Sie waren, mit einem Wort, echte Schafe im Schafspelz. Da sie aber selbst dies krampfhaft waren, glaubte es ihnen niemand, und man hielt sie für Wölfe.\"",
            "Ok aber es gibt halt Leute, die das nervt. mich z.B. \nSo gut wie jede erste Koversation mit jedem geht auf mein Anders-Sein ein, man muss erstmal seinen Stammbaum auspacken, und es kommt dazu dass man jedes Mal wieder erinnert wird dass man doch nie wirklich \"dazu gehört.\" \nEs ist nicht wirklich rassistisch (kann ja auch zwischen zwei Weissen passieren), aber irgendwie finde ich, das gehört sich nicht. Wenn ich jemanden gut kenne, oder oft sehe, dann mach ich das gerne. Aber sonst... Ich meine, wäre ich Dr Müller blond und weiß, würde das nie jemand fragen. \n\n\nOP natürlich NDA, dass kann jeder selbst beurteilen wie man das findet.",
            "Meistens weiße junge Frauen aus gut stituierten Elternhäusern, die damit ihr unbewusstes schlechtes Gewissen beruhigen wollen. Die führen sich dann als Anwälte 'benachteiligter' Gruppen auf und es ist ihnen egal, welche Meinung die Leute selber dazu haben. \n\nSowas von NDA!",
            "Ah, das kenne ich. Ich hab auch einen Namen der etwas \"ausländisch klingt\". Dazu sehe ich auch noch ein bisschen südländisch aus. Bei mir kommt lustigerweise noch hinzu, dass ich tatsächlich Migrationshintergrund habe, aber aus Deutschland (bin Österreicher). Das führt dann immer zu erstaunten Gesichtern wenn ich sowas sage wie \"ich habe ja auch Migrationshintergrund\", dann kommt die Frage \"ach, woher denn?\" Und wenn ich dann \"meine Oma war Deutsche\" sage sind alle verwirrt.",
            "Ich habe witzigweise ein sehr typisch deutscher Nachname. Ich bin allerdings hier eingewandert. Man hört aber auch sofort von meinem Dialekt dass ich nicht hier geboren bin.",
            "Same here - ich finde das einfach super interessant wo Leute herkommen- wie es dort ist, was hier anders ist - auch völlig egal ob EU/Weltweit oder die nächste Stadt in DE - einfach aus Interesse an der Sichtweise des jeweiligen anderen.",
            "Same. Hatte mal ne Freundin aus dem Kosovo, die hatte echt viele Geschichten zu erzählen.  \nAndere Kulturen sind doch total spannend.   \nSind lustigerweise auch immer die besonders Deutschen die sich im Nahmen der anderen entrüstet zeigen müssen.",
            "Am besten einfach fragen wo der Name herkommt. Könnte ja auch einfach nur angeheiratet sein",
            "Und deswegen fragst du das ganz als erstes? Aus Interesse an der Person?\n\n[X] Zweifel",
            "Und dabei kommen dann so Späße bei rum wo bspw gesagt wird dies oder das dürfen nur schwarze (weil kulturelle Aneignung bspw ist ja ganz böse). Wenn man sie dann fragt wie schwarz man dafür sein muss*, dann kommt als Antwort \"das sieht man doch\" XD\n\n*Man kennt das ja, wenn schwarze und weiße sich vermischen, dass die Kinder in der Regel weniger schwarz sind als das schwarze Elternteil. Und es gibt Menschen deren Hautfarbe dadurch so aufgehellt ist, deren Gesichtsstruktur eher Europäern entspricht, dass sie mehr als weiße statt als schwarze wahrgenommen werden. Aber solchen Sachen wird im besten Fall aus dem Weg gegangen. Im schlimmsten Fall erhält man die Antwort oben.",
            "Jeder weiß, dass nur ein guter weißer Deutscher versteht, was wirklich Rassismus ist. Deswegen sind sie in ihrer unendlichen Güte zum Glück bereit allen anderen zu erklären, wie das mit dem Rassismus funktioniert und wann sie sich beleidgt fühlen müssen. z.B. wenn eine weiße Person Rastalocken trägt, dann ist das auf jeden Fall ganz wichtig..",
            "Dasselbe gilt für woke Heteros, die glauben sie müssten Homosexuellen erklären, wie man \"richtig\" LGBT ist.",
            "Wir sind mal mit der Oma meiner Frau an einer Schwarzen vorbei gegangen.\n\nSie hört nicht gut und redet deswegen sehr laut.\nIm Vorbeigehen sagt sie der Frau: \n\nFÜR EINE NEGERIN SEHEN SIE WIRKLICH GUT AUS",
            "Wie war denn der Witz? 😄",
            "ich hab mal ein essay darüber gelesen, dass es vielen dieser fliegenden affen des zeigeistes es aller beobachtbaren handlungskonsistenz nach garnicht darum geht, ein besser und rücksichtsvollerer mensch zu sein, sondern vor allem, um vor dem sozialen territorium als besser und rücksichtsvoller als die anderen wahrgenommen zu werden... dh wenn mans auf die gleiche narzisstische weise ausdrücken wollte, ginge es ihnen darum, auf kosten der minderheiten, die als alibi herhalten, die eigene moralische überlegenheit immer wieder auszurufen.",
            "Warum glauben Menschen, sie hätten das Recht darüber zu Urteilen, wie 2 nahestehende Menschen miteinander umgehen?\n\nMein bester Freund (wir stehen uns näher als Brüder und kennen uns seit über 23 Jahren) hat vietnamesische Wurzeln. Wir kloppen uns auch mal ab und zu Sprüche um die Ohren. Wir nehmen die aber nicht ernst, weil wir uns kennen und weil wir wissen, wie wir ticken. Und sollte mal doch ein Spruch zu weit gehen, dann wird das angesprochen und sich entschuldigt. Aber da hat sich kein anderer einzumischen",
            "Dies. Und wenn man sich antirassistisch bildet, sind all die Fragen, die OP bekommt, immer der Aufhänger dafür, wie man es eben nicht macht. Deiner Kollegin fehlt da die Praxis oder das Feingefühl zu differenzieren. OP, deine Kollegin nervt dich immens aber sie möchte dir einfach ally sein. Sag ihr, dass du sowas in Zukunft nicht mehr hören möchtest. Und wenn du anerkennen kannst, dass all diese Fragensteller keine As sind, dann kannst du das vlt auch deiner Kollegin zugestehen. KAH\n\nDein Text hier übrigens kippt gut Öl ins Feuer. Einige hier sehen sich gleich wieder darin bestärkt, ihren Alltagsrassismus weiterhin nicht zu hinterfragen. „Sie sprechen aber gut deutsch.“ Pisst jede*n zweiten aus meinen kreisen an, schön dass es für dich anders ist.",
            "Danke für deinen Beitrag. \nIch wünschte Leute würden die Möglichkeit zwei wählen, weil immer wenn ich diese Aussagen höre, fühlt es sich so an als würde ich nicht dazu gehören.\n\"Sie sprechen aber gut deutsch\" ist das beste Beispiel. Weil es wird immer der Schluss weggelassen. \"...für einen Ausländer\". Ich bin nur braun und kein Ausländer, bitte akzeptiert es endlich.",
            "Das war doch mal ein nüchterner Beitrag. Ich gehe nur mit den Möglichkeiten nicht ganz d'accord.\n\nWenn ich in der Situation nicht betroffen bin, parallele Verhaltensweisen aber selbst erlebt habe, kann ich sie dennoch als rassistisch auffassen?\n\nWarum ist der Blick von außen überhaupt falsch? Womöglich bin ich als Nicht-Betroffener näher an denen, die solche Aussagen tätigen und weiß daher unter Umständen sogar besser, welchem Mindset sie entstammen.\n\nOhne Frage, seine eigene Empfindung anderen überzustülpen ist unnötig. Ich meine hier allein die Einordnung.",
            "Also... Wenn ich bei Interesse überlegen muss wie ich die Frage am besten formuliere, damit sich der andere bloß nicht auf den Schlios getreten fühlt, dann frage ich lieber gar nicht. Das ist mir zu doof, ganz ehrlich. Wenn so eine Banalität schon dazu führt, dass man sich rassistisch behandelt fühlt, dann denke ich gestaltet sich jegliche Kommunikation am Ende auf Dauer schwierig. Wär mir zu doof und dann lass ich es lieber.",
            "Lol der ging noch die extra rassistische meile, bevor er die bewerbung gekübelt hat.",
            "SJW? Super Jesus Weiße?",
            "Deinem Kommentar fehlt eine Bewertung.(Siehe Regel 4)\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/BinIchDasArschloch) if you have any questions or concerns.*",
            "Deinem Kommentar fehlt eine Bewertung.(Siehe Regel 4)\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/BinIchDasArschloch) if you have any questions or concerns.*",
            "Deinem Kommentar fehlt eine Bewertung.(Siehe Regel 4)\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/BinIchDasArschloch) if you have any questions or concerns.*",
            "Deinem Kommentar fehlt eine Bewertung.(Siehe Regel 4)\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/BinIchDasArschloch) if you have any questions or concerns.*",
            "Deinem Kommentar fehlt eine Bewertung.(Siehe Regel 4)\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/BinIchDasArschloch) if you have any questions or concerns.*",
            "Deinem Kommentar fehlt eine Bewertung.(Siehe Regel 4)\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/BinIchDasArschloch) if you have any questions or concerns.*",
            "Deinem Kommentar fehlt eine Bewertung.(Siehe Regel 4)\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/BinIchDasArschloch) if you have any questions or concerns.*",
            "Deinem Kommentar fehlt eine Bewertung.(Siehe Regel 4)\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/BinIchDasArschloch) if you have any questions or concerns.*",
            "Deinem Kommentar fehlt eine Bewertung.(Siehe Regel 4)\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/BinIchDasArschloch) if you have any questions or concerns.*",
            "Deinem Kommentar fehlt eine Bewertung.(Siehe Regel 4)\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/BinIchDasArschloch) if you have any questions or concerns.*",
            "Deinem Kommentar fehlt eine Bewertung.(Siehe Regel 4)\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/BinIchDasArschloch) if you have any questions or concerns.*",
            "Deinem Kommentar fehlt eine Bewertung.(Siehe Regel 4)\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/BinIchDasArschloch) if you have any questions or concerns.*",
            "Deinem Kommentar fehlt eine Bewertung.(Siehe Regel 4)\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/BinIchDasArschloch) if you have any questions or concerns.*",
            "Deinem Kommentar fehlt eine Bewertung.(Siehe Regel 4)\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/BinIchDasArschloch) if you have any questions or concerns.*",
            "Deinem Kommentar fehlt eine Bewertung.(Siehe Regel 4)\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/BinIchDasArschloch) if you have any questions or concerns.*",
            "Deinem Kommentar fehlt eine Bewertung.(Siehe Regel 4)\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/BinIchDasArschloch) if you have any questions or concerns.*",
            "Deinem Kommentar fehlt eine Bewertung.(Siehe Regel 4)\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/BinIchDasArschloch) if you have any questions or concerns.*",
            "Deinem Kommentar fehlt eine Bewertung.(Siehe Regel 4)\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/BinIchDasArschloch) if you have any questions or concerns.*",
            "Deinem Kommentar fehlt eine Bewertung.(Siehe Regel 4)\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/BinIchDasArschloch) if you have any questions or concerns.*",
            "Da spricht entweder de Pälzer oder de Schwab",
            "Bitte keine Ferndiagnosen stellen.",
            "Deinem Kommentar fehlt eine Bewertung.(Siehe Regel 4)\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/BinIchDasArschloch) if you have any questions or concerns.*",
            "Deinem Kommentar fehlt eine Bewertung.(Siehe Regel 4)\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/BinIchDasArschloch) if you have any questions or concerns.*",
            "Deinem Kommentar fehlt eine Bewertung.(Siehe Regel 4)\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/BinIchDasArschloch) if you have any questions or concerns.*",
            "Deinem Kommentar fehlt eine Bewertung.(Siehe Regel 4)\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/BinIchDasArschloch) if you have any questions or concerns.*",
            "Deinem Kommentar fehlt eine Bewertung.(Siehe Regel 4)\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/BinIchDasArschloch) if you have any questions or concerns.*",
            "Deinem Kommentar fehlt eine Bewertung.(Siehe Regel 4)\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/BinIchDasArschloch) if you have any questions or concerns.*",
            "Deinem Kommentar fehlt eine Bewertung.(Siehe Regel 4)\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/BinIchDasArschloch) if you have any questions or concerns.*",
            "Deinem Kommentar fehlt eine Bewertung.(Siehe Regel 4)\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/BinIchDasArschloch) if you have any questions or concerns.*",
            "Deinem Kommentar fehlt eine Bewertung.(Siehe Regel 4)\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/BinIchDasArschloch) if you have any questions or concerns.*",
            "Deinem Kommentar fehlt eine Bewertung.(Siehe Regel 4)\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/BinIchDasArschloch) if you have any questions or concerns.*",
            "Deinem Kommentar fehlt eine Bewertung.(Siehe Regel 4)\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/BinIchDasArschloch) if you have any questions or concerns.*",
            "Deinem Kommentar fehlt eine Bewertung.(Siehe Regel 4)\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/BinIchDasArschloch) if you have any questions or concerns.*",
            "Deinem Kommentar fehlt eine Bewertung.(Siehe Regel 4)\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/BinIchDasArschloch) if you have any questions or concerns.*",
            "Second this",
            "Bei solchen Leuten wie der Kollegin von OP hilft ein \"Boah, jetzt halt doch mal die Fresse!\" merklich.\n\nDas ist zwar äußerst taktlos aber wirkt wahre Wunder.",
            "100 %",
            "Das.",
            ">Es ist rassistisch zu sagen, dass du gut Deutsch sprichst. Die Leute erwarten von dir, dass du nur ein dummer Kan... bist und trauen dir nicht zu, dass du ihre Sprache kannst.\n\nWas ein Blödsinn!! Menschen, die eine andere Herkunft haben, sprechen meistens mit Akzent. Unabhänging von der Hautfarbe. Ich hab mehrere Jahre in der Schweiz gearbeitet und wurde ständig gefragt, wo ich herkomme. Ich bin so weiß, n Tick heller und ich wäre transparent. \n\n\"Nicht rassistisch\" zu sein bedeutet doch nicht, dass wir die Wurzeln unserer Mitmenschen völlig ignorieren müssen. Damit nehmen wir ihnen ein Stück ihrer Identität und DAS finde ich wirklich rassistisch.\n\nUnd was ich noch viel rassistischer finde, ist es, jemandem mit Migrationshintergrund vorzuschreiben, was er als rassistisch empfinden \"muss\" und was nicht.",
            ">weder du noch deine Kollegin\n\nDann wäre das korrekte Urteil ‚KAH‘.",
            "Dann hast du meinen letzten Post nicht richtig gelesen. 1. hab ich mich korrigiert und gesagt, dass hassen das falsch Wort war\n2. War das nur auf bestimmte Arten von Patienten bezogen: wie zb Ungeduldige, respektlose, schreiende, gewalttätige, Patienten die nur wegen einer Krankschreibung kommen oder Sachen die auch am nächsten Tag abgeklärt werden können.\nEs gibt nämlich Patienten die aus gutem Grund in die notaufnahme kommen und leicht als „guter“ Grund übersehen werden, wegen der vorherig genannten. Oder Patienten die sich nicht beschweren, dass da gerade 3 Notfälle eingeliefert wurden, einfach „kack frech“ vor einem dran gekommen sind. Und und und",
            "bro, wer hat dir denn weh getan!?",
            "Himmel, wie anstrengend.\nDa ist mir der OP aber deutlich lieber, als solche, die überall nur Schlechtes sehen wollen.",
            "Warum dann NDA?",
            "Naja, wenn sie anfängt Menschen als Rassisten abzustempeln, die halt nichts rassistisches getan haben, dann geht das wieder zurück. Du schürst ja nicht anderes als Hass gerade. \n\nWürdest einen guten P.C Principal machen",
            "Also kann Op die Patienten nicht darauf hinweisen ob es rassistisch ist und braucht dafür einen weißen privilegierten Rassisten der das für ihn macht……",
            "Wieso ist das faschistisch? Das hat doch eigentlich wenig mit Faschismus zu tun",
            "Ich sehe es eigentlich immer nur als Interesse an der Person. Dass es heißt, „du kannst keiner von uns sein“ ist ja schon reichlich hineininterpretiert. Es kann ja genauso gut heißen „du hast ja noch einen zusätzlichen, interessanten Aspekt in deiner Geschichte / Familie“.\n\nIch hab zB auch eine Bekannte, die einen deutschen Namen hat aber eben „von …“ heißt und sie wird auch dauernd gefragt, wo „…“ denn liegt und ob sie adlig ist etc.\n\nWenn es abwertend gemeint ist, merkt man das viel mehr an der Person insgesamt, da muss gar nichts konkret rassistisches gesagt werden. Denn die meisten „echten“ Rassisten zeigen es eher am Tonfall und den Taten. Deswegen find ich es auch nicht sonderlich hilfreich zu sagen, diese oder jene Frage ist rassistisch sobald man sie einem Ausländer / einer Person mit Migrationshintergrund fragt.",
            "NDA\nIch frage auch andere deutsche nach dem woher\nEs hat sich in den Situationen niemand drüber lustig gemacht, woher OP kommt, das ist eine völlig überzogene Reaktion der Kollegin.",
            "Wenn es dieses „Du kannst nicht einer von uns sein“ ist, dann ist es rassistisch. Wenn es einfach nur ein „Menschen haben eine Herkunft und Geschichte“ ist, dann ist es einfach nur Interesse.",
            "Ganz ehrlich, ich frag doch auch einen mir unbekannten Herrn Maier der nicht meinen Dialekt spricht auch, woher er kommt....ach aus Berlin? Da hat es Sie aber weit in den Süden verschlagen! Der Liebe wegen oder wegen dem Job?....und schwupps Small.talk gestartet. \nStändig und überall Rassismus und niedere Beweggründe zu unterstellen, hat in meinen Augen bereits etwas neurotisches, wenn nicht gar wahnhaftes.\nIch fasse doch die Frage ob ich tatsächlich aus Bayern stamme, weil ich Hochdeutsch spreche ja auch nicht als rassistisch auf.",
            "Mein Nachname ist ebenfalls nicht deutsch, wobei da nur Punkte über dem Vokal fehlen. Sehe absolut deutsch aus und der Name ist schweizerisch. Werde trotzdem immer mal wieder gefragt, wo der Name denn herkomme, weil der hier ungewöhnlich ist. Hat nix mit Rassismus zu tun, die sind einfach interessiert. Kommt aber auch immer drauf an, wie man fragt.",
            "Würde auch tendenziell eher um die Herkunft der Familie fragen, um eine etwaige Geburt der einzelnen Person in DE mit einzupreisen. Dass das ganze heißen soll, dass jemand ja nicht aus DE kommen könne legt da finde ich schon einen Interpretationsschritt hinein der ja gar nicht da sein muss.  \nIch hatte in den letzten Jahren öfter mal mit geflüchteten Menschen gearbeitet und hatte ehrlich gesagt den Eindruck, dass viele sich über ein ernsthaftes Interesse an ihrer Herkunft durchaus gefreut haben und da auch oft gern erzählen (klar, insbesondere bei etwaigen Kriegstraumata brauchs da schon auch Fingerspitzengefühl dass man nicht in schmerzhaften Punkten raumbohrt).",
            "Wenn jemand einen anderen Deutschendialekt spricht, Frage ich auch woher er kommt also aus welcher Region.\n\nDas hat nichts mit Rassismus zu tun sondern mit Interesse an der anderen Person.",
            "Da brauchst du nicht zwiegespalten sein. Für Ausländer, bzw. Deutschen mit anderer Herkunft ist es ziemlich einfach einzuschätzen wie man sowas meint.",
            "Es ist ja kein \"du kannst nicht von hier sein\", sondern schlicht eine Heuristik die angewendet wird. Und wenn auf die Antwort \"München, Maxvorstadt\" kein \"nein, ich mein wo du EcHt herkommst\" kommt, dann passt das doch.\n\n\nDeutschland, oder eher die Gemeinden in der BRD, sind halt nicht seit 200 Jahren phänotypisch heterogen, da kann die Frage schon mal aufkommen. Ich mache seit 15 Jahren Dienstreisen in aller Herren Länder, und oft ist klar, dass ich eben nicht von da bin. Die Leute fragen, ich antworte, und man führt ein nettes Gespräch. Es ist halt anzunehmen, dass Langnase Weißbrot mit deutschem Sonderzeichen im Nachnamen kein gebürtiger Koreaner, Südafrikaner oder Brasilianer ist.\n\n\nDiese Verurteilung von dieser wirklich simplen und bei Fehlannahme leicht zu korrigierenden Heuristik können sich eigentlich nur Berufsempörte oder Leute die nicht viel Reisen leisten. Der Rest fragt, korrigiert ggf. die Annahme, erfreut sich am interkulturellen Austausch und macht weiter.",
            "Witzig, du bekommst downvote und alle anderen upvote.\nIch als in Deutschland geborener mit Migrationshintergrund stimme dir zu. Klar haben die, die auf deine Aussage antworten irgendwie Recht und es ist Interesse.\nDas ist aber halt auch nur die halbe Wahrheit.\nWenn Menschen mich fragen woher ich komme, antworte ich: Deutschland. \n\nEs kommt fast immer die Frage: woher kommst du wirklich?\n\n\nMeine Mutter ist deutsch und mein Vater aus der Karibik.\n\n\nAha und wie ist es da so?\n\n\nSchön war da aber nur ein paar mal im Urlaub.\n\nSo ein Gespräch habe ich noch nie zwischen deutschen gehört, also ist, das dies eine normale Konversation sei falsch.\nWenn ein weisser deutscher sagt er ist aus München, dann fragt keiner mehr wo er denn wirklich herkommt. Oder wenn ein Elternteil aus Polen kommt, wie es dort denn so ist.\n\n\nKeine hellhäutiger/weisser deutscher wird einfach so gefragt ob er Moslem ist. Mir wurde auch schon oft gesagt das ich ja so gutes Deutsch spreche.\n\nOb es jetzt direkt Rassismus ist müssten Professoren klären.\nAber es ist eine klare Abgrenzung meinerseits, das ich nicht dazu gehöre. Es zeigt mir immer wieder das es nicht reicht zu sagen ich bin Deutscher. \nUnd mich zu fragen wie die Karibik so ist, weiß ich auch echt nicht mehr was ich davon halten soll. Ist ja nicht so das keiner weiss wie die Karibik aussieht. \n\nEs gibt liebevolle Menschen in meinem Freundeskreis, die jeden Menschen gleich behandeln. Diesen Unterschied merkt man. Die haben mich sowas nie auf diese (oberflächliche) Art und Weise gefragt.",
            "Also ich kann dich zumindest beruhigen was diese Frage angeht: Die kriegst du auch als blonder Weißer. Die Leute ziehen wegen Studium, Arbeit etc. in neue Städte. Die Frage wo der andere ursprünglich herkommt ist da recht naheliegend, gerade als Gesprächseinstieg wenn man sonst nichts übereinander weiß. Klar könnte man auch fragen \"Und welche Hobbiies hast du so?\", aber das ist nunmal deutlich persönlicher als der Geburtsort.",
            "Ich denke, wenn Dr Müller in Albanien lebt, wird er genau solche Fragen auch zu hören bekommen.",
            "Auch wenn ich mit deutschen Spreche fragen die meist woher ich komme, weil ich einen südländischen Akzent (ganz leichtes schwäbisch) habe. Manchmal sucht man einfach nach irgendwas worüber man reden kann oder vielleicht interessiert es einen auch einfach.  \nIch interessiere mich z.B. sehr für die Asiatische Kultur, deswegen frage ich bei Asiatischen Menschen tendenziell auch woher sie kommen. Das heißt nicht dass die Leute nicht Deutsch sind oder nicht dazu gehören oder anders sind, aber oft sind diese Menschen dann z.B. dort mal zu besuch bei der Familie oder essen noch gewisses Essen aus der Kultur usw. worüber man sich dann weiter unterhalten kann und in der Praxis ist das auch der Fall.",
            "Natürlich wird man das als Weißbrot auch gefragt. Ich bin beruflich super viel unterwegs und werde ständig gefragt, wo ich herkomme, weil ich nen leicht(?) schwäbischen Akzent habe.",
            "Bin ich grundsätzlich bei dir. Allerdings fragen mich Kartoffel Leute hier in HH auch gerne, woher ich komme, weil man hört, dass ich ursprünglich aus dem Süden komme. Ist halt ein einfacher Gesprächspunkt. Aber mich nervt es auch oft genug, weil ich einfach Hamburger sein möchte.",
            "Übertreibs nicht. Kann sein, das dich das nervt, aber es ist halt nicht jeder so ne Mimose.\nWenn es die Leute wirklich interessiert, was ist daran schlecht? Kultur und Herkunft sind nunmal Dinge, die jemanden stark prägen und dir viel über die Person sagen. Natürlich darf man die Person nicht darauf reduzieren, aber es ist nun mal Teil von ihr.\n\nMeine Eltern sind aus Russland, man hört es am Namen und ich sehe halt auch aus, wie der größte Holzrusse, den du die vorstellen kannst. Kanisterkopf, Kampfsportler, Ringerohren, Kurzhaarschnitt, das volle Programm. \nIch seh nicht aus, wie jemand der ein Abi und ein abgeschlossenes Ingenieurstudium hat.\nMeine Herkunft hat viel dazu beigetragen, wie ich bin, warum ich meine Hobbies verfolge und wie ich aufgewachsen und erzogen wurde.\n\nSo funktioniert das nun mal, wenn man neue Leute trifft. Man sieht ihnen oft nicht an, wie sie tatsächlich drauf sind, was für einen Charakter sie haben etc. \nMan macht sich aufgrund seiner früheren Erfahrungen, äußeren Einflüsse und dem Aussehen der Person ein Bild, wer oder was er / sie sein könnte. \nBeim Kennenlernen werden solche Fragen nunmal gestellt. Ich glaube, das ist ein großer Unterschied, ob ich auf die Frage nach meiner Herkunft Russland oder Ukraine sage, oder nicht (unterstütze den Krieg übrigens in keinster Weise)?",
            "Tja. Ich habe \"Binnenmigrationshintergrund\", mein Vater war Ostfriese, meine Großeltern mütterlicherseits kamen aus Sachsen, und ich wohne im Rheinland. I'm an alien...",
            "Wo steht das ich das als Erstes Frage? 🤔",
            "Manchmal frage ich mich deswegen, ob die Hufeisentheorie nicht doch wahr ist. Wenn man sowas von Personen, die sich als links bezeichnen hört, dass sich die Kulturen nicht mehr vermischen dürfen und alle am besten in parallelgesellschaften leben sollten, frage ich mich immer, ob die nicht in Wahrheit rechtsextreme sind, die sich als linke ausgeben, um dumme Forderungen zu stellen und linke zu diskreditieren.",
            "“Wenn schwarze und weiße sich vermischen”\n\nSag mal hackt es bei dir? \n\nSorry, aber genau mit so einer Aussage zeigst du, dass du eben noch ein wenig aufzuholen hast beim Thema Rassismus. \n\nIst doch völlig egal wer mit wem Kinder bekommt. Hier von einer Vermischung zu reden erinnert an übelst Rassentheorien.",
            "OMA NEIN 🫣 ufff ich wäre so schnell im Boden versunken",
            "naja immer was mit der punchline, dass er jetzt der eigene oder sonstjemandes freund ist. ihn hats genervt, aber ich find die meisten alltags-kreativen impulse sind halt einigermaßen berechenbar, das kann man niemand zum vorwurf machen.\n\nder psychologische sinn hinter smalltalk ist, man probiert oberflächlichkeiten aus um zu sehen, ob man sich damit zusammen wohl genug fühlt, um ggf auch etwas sensiblere informationen austauschen zu können. dh ja es gibt einige kritikpunkte an smalltalk, aber ohne den geht halt idr auch nicht mehr.",
            "Das Ganze scheint mir ein Wiederbeleben des \"Am deutschen Wesen soll die Welt genesen\".",
            "Falls Dir der Titel oder Autor wieder einfällt, könntest Du den vielleicht hier posten? Klingt nämlich interessant",
            "Joa, Ich sehe die kollegin auch als wohlmeinend wenn auch ein bissl über das ziel hinaus schiessend an. \n\nUnd das \"sie sprechen aba gut deutsch\"... ich versteh schon, dass das leute anpisst, aber man macht es sich selbst damit nur unnötig schwer. So eine 60 jährige Dame, die in ihrem Leben nur marginal mit Nichtautochtonen zu tun hatte und jetzt nicht aus den intellektuellen Kreisen kommt meint sowas nicht böse. Da lächel ich, bedank mich und erklär ihr halt, dass ich hier geboren und aufgewachsen bin. Dann sagen die \"asooo\" und das wars. Dann hatten wir eine nette Unterhaltung, jeder hat sein Gesicht behalten, und die nette Dame hat mal ein bisschen was neues kennengelernt.\nIst mir lieber als Leute, die sich was weiss ich schon über mich denken und nur einsilbig ohne jede Höflichkeit - von Freundlichkeit ganz zu schweigen- mit mir reden.",
            "Fühls!\nIch hab früher unironisch das Präteritum beim Sprechen verwendet, braucht mir keiner erzählen, dass ich gut Deutsch kann. \nDas hab ich erst abgelegt, nachdem ich in BaWü nie wieder darauf gestoßen bin/stieß. Man passt sich halt an.\n\nAber natürlich kann ich das, ich kann’s sogar besser als diejenigen, die das immer sagen.\nUnd dazu spreche ich noch 4 andere Sprachen also psst.",
            "So war mein Beitrag nicht gemeint. Sry war etwas komisch formuliert. Alles natürlich nur immer meine Meinung zum Thema und ich möchte niemanden was aufzwingen.\n\nIch sehe es ebenfalls als völlig in Ordnung bzw sogar gut an, wenn die Kollegin dem:der Patient:in gesagt hätte, dass sie das nicht okay findet/ sich unwohl dabei fühlt oder oder oder.\n\nGenau dieses Umstülpen/ Aufzwingen ist nicht in Ordnung. \n\nIch finde es sonst gut, dass die Kollegin sich mit dem Thema Rassismus beschäftigt.\n\nIch bin auch kein Betroffener und äußere mich dazu. Da möchte ich mir auch nichts anmaßen.",
            "Ist das so oder sollten wir viel mehr auf unsere Sprache achten?\n\nGerne ein paar Beispiele:\n\nDer Hartz IV Bezieher wird als Sozialschmarotzer bezeichnet, weil er ein paar hundert Euro pro Monat bekommt (obwohl wir die hintergrundgeschichte nicht kennen), aber der Millionär, der sein Geld versteckt, ist ein Steuerflüchtling?\n\nWir sagen schnell, deine Haare sind schön lang oder so. Umgekehrt Menschen die kurze Haare haben, sind hässlich? Oder du bist aber schön dünn, sprich wenn du mehr wiegst, bist du hässlich? Deine Haut ist aber makellos, darf man nicht altern, darf man keine Makel haben?\n\nWir sagen Fußball und Frauenfußball. Wieso diese Aufteilung?\n\nWir sagen Schl..., H...s, oder oder oder als Beleidigung, wieso greifen wir im Jahr 2024 immer noch die \"Reinheit\" der Frau an?\n\nJungfernhäutchen... Komplett falscher Begriff, der immer noch verwendet wird.\n\nWir haben das Wort Mobbing erst vor ein paar Jahrzehnten erfunden, vllt fehlen uns immer noch viele Wörter?\n\nBist du schwanger? \n\nWer kümmert sich um die Kinder? Komischerweise wird dieses hauptsächlich Frauen gestellt.\n\nDu musst mit 20 deine:n erste:n Partner:in schon längst haben. Jede:r hat in deinem Alter einen Führerschein/ Führerschein ist normal.\n\nRichtige Männer müssen xyz.\n\nDas ist doch schwul.\n\nLehrjahre sind keine Herrenjahre.\n\nEtc etc etc\n\nEgal ob bei Rassismus, Sexismus, Klassismus, Lookismus, Ableismus, Ageismus, Adultismus, etc überall findet man Formulierungen, die Menschen verletzen.\n\nWir können natürlich nun sagen, dass das immer so war und wir einfach darauf scheißen \n\nOder wir achten mehr aufeinander und versuchen andere Menschen nicht so zu verletzen.\n\nDu wirst auch irgendwann alt, du kannst auch eine Krankheit bekommen, du kannst auch arbeitslos werden, etc. Daher würde ich stark auf Rücksichtnahme plädieren. Lass uns mit betroffene Personen reden und nicht über sie :)",
            "Hä dann frag halt nicht?\nKein Migrant denkt sich “menno, ich hätte so gern zum 100. Mal erklärt, dass ich in einem deutschen Vorort vorm Wald gezeugt und von einer deutschen Hebamme auf die Welt begleitet wurde”\n\nJunge",
            "Verständliche Reaktion, die Debatte ist noch nicht soo alt und überfordert definitiv einige. Finde ein paar der nachfolgenden Beispiele selbst etwas... Oof.\n\nInzwischen finde ich es aber auch nicht verkehrt, nicht mehr ungefiltert jeden Gedanken zu verbalisieren (wozu ich durchaus neige). Manche Äußerungen können nerven, falsch rüberkommen, an traurige Umstände erinnern. Manchmal ist Fresse halten darum nicht schlecht. ;D",
            "Das Highlight war die Ansprache von meinem Praktikumsbetreuer, bei dem ich Chemie hatte. Er hat den Unterricht so angefangen: \"Manchmal können wir Deutschen echte Arschlöcher sein.\" Danach hat er erzählt, dass besagter Unternehmensleiter angerufen hat und hat die Ansage abgeschlossen mit \"da gehst du nicht hin!\"",
            "Social Justice Warrior",
            "Korrekt und korrigiert. Ich bitte diesen Fauxpas zu entschuldigen",
            "Es geht nicht um Rassisten, es geht um strukturellen Rassismus. Das ist ein grosser Unterschied. Aber wenn man sich mit dem Thema nicht auskennt, lohnt sich kein Diskussion",
            "Kann er, ist aber nicht sein Job und viele haben auch keinen Bock darauf das 24/7 zu machen. Im Krankenhaus mit alten Leuten würd ich das bei sowas eh nicht bringen. Seine Kollegin ist aber trotzdem alles andere als hilfreich, weil sie nicht etwa mit den Leuten darüber spricht, die OP so behandeln, sondern weil sie ihn selbst mit dem Thema nervt. Und dann noch nichtmal auf seine Meinung hört.",
            "Meine Frau, ohne Migrationshintergrund, wird von Patienten ständig gefragt woher sie kommt. Wenn sie sagt aus Deutschland, fragen sie nach den Eltern und deren Eltern, immer weiter. Alle Deutsch. Manche Patienten glauben dass nicht, fragen dann, ob sie im Sommer zur Familie fahren würde oder ob sie bei der EM für Deutschland sei oder XY.\nDie Patienten denken sich nicht viel dabei und sind wohl eher interessiert, aber dass sie es nicht glauben und aufs neue solche Fragen stellen ist schon schräg.",
            "Das stimmt. Jemand der Hansen heißt würde in Bayern vermutlich auch gefragt werden, genau wie ein Dimpflmoser in Hamburg 😂",
            "Doch solltest du aber, und auch wenn DU das nicht so empfindest werde ICH dich schon noch erziehen und belehren damit du schnallst das du da eben DOCH offendet sein solltest! /s",
            "Persönlich denke ich, dass ist ein Fall von “der Ton macht die Musik,” da mon m.E. in den meisten Fällen schnell merkt, ob das eine neutrale oder interessierte Wissensfrage ist oder ob jemand einen rassistischen Angriff heraushauen will.\n\nLetzteres geht natürlich gar nicht und dann ist Solidarität aus der Umgebung auch gut und angebracht, aber ansonsten ist eine Frage eben einfach eine Frage. Da muss nicht jedesmal Drama angespielt werden.\n\nOP klar NDA.",
            "ja fair. Ich meine letztlic ist auch niemandem geholfen, wenn man gar nicht nachfragt. Wahrscheinlich ist es am Ende einfach eine Frage der Art und Weise.",
            "Zu deinem letzten Absatz kann ich mangels Erfahrung nicht viel sagen, aber zum ersten frag ich eher nach der Herkunft des Namens.  \nMein Vorname ist russisch, habe aber AFAIK keinerlei russische oder slawische Vorfahren.",
            "Man merkt halt das du den Unterschied nie erlebt hast: wenn du jemanden fragst woher er kommt und er nennt dir Stadt/Dorf X in Deutschland ist alles in Ordnung. Wenn du dann fragst \"Und ursprünglich? Wo kommen deine Eltern her?” ist das ein Othering für Menschen mit Migrationshintergrund und die erleben das quasi täglich.\n\nDa kannst du dich und andere auch nicht rausreden, die Message beim nachfragen ist immer \"Du bist anders und ich will wissen warum\". Welche Intention dahinter steht ist tatsächlich zweitrangig da die Auswirkung gleich bleibt.",
            "Was soll die Asiatische Kultur bitte sein? Wtf",
            "Kartoffel Leute??? Ist das Hamburger Slang?",
            "\"Ach aus Hamburg also? Und deine Eltern?\"",
            "Kartoffel Leute, den Begriff finde ich Klasse. Ich möchte ab jetzt nicht mehr Deutscher sondern Kartoffel Mensch sein 😆",
            "Wooah, I'm an alien, I'm a legal alien, I'm a Friedensachs' im Rheinland.",
            "Fühle ich. Mein Papa aus Sachsen, meine Mama aus Unterfranken. Lebe in Hamburg.",
            "Wenn du dich wegen einem Wort so aufregst, bitteschön. Steht dir frei.",
            "Ich glaube, du hast ihn falsch verstanden.",
            "Du bist wohl ein Bekannter der nervigen Kollegin des OP? Hauptsache aufspielen, selbst, wenn es nicht mal halbwegs passt.",
            "Wie soll man es denn sonst nennen,ist doch nichts schlimmes.....",
            "Hey cool. OP könnte dich bestimmt mit seiner Kollegin bekannt machen, ihr hättet viel zu besprechen.",
            "So kann man übrigens auch herrlich aus dem Kontext reißen. Zitier mir bitte die Stelle, wo ich sagte, ich habe etwas dagegen wenn schwarze und weiße miteinander Kinder bekommen.",
            "Und hier meine Damen und Herren ein Paradebeispiel zum momentanen Thema ☝",
            "Ihr seid echt dumm wie Steine",
            "Och Klaus...erst sorgfältig durchlesen, dann denken, ggfs. nochmal lesen und dann antworten. \nMit so einer Aussage zeigst du,  dass du eben noch ein wenig aufzuholen hast beim Thema Leseverständnis",
            "Sinnerfassendes Lesen ist nicht deine Stärke.",
            "Gut gesagt!",
            "ich hab schon 2 nachmittage vergeblich versucht das wiederzufinden. ich fasse es sogut zusammen wie ich mich erinnere. der autor hat die gesellschaft eingeteilt in 4 klassen: parasiten, bürger, visionäre und fliegende affen. es war auf englisch und ein unbekannter autor auf einer webseite ohne wiedererkennungswert. ja schubaldendenken hat seine nachteile, mit einer prise salz kanns aber manchmal nützen, komplexe situationen auf handhabbares zu reduzieren.\n\nparasit: extrem egoistischer und rücksichtsloser mensch. kann dumm oder auch klug sein, die klugen bis sehr klugen parasiten sind die gefährlichen.\n\nbürger: mehrheit der bevölkerung. gutmütig aber einfältig, schmiedet keine komplexen pläne für das eigene leben und kann sich deshalb auch garnicht vorstellen, dass andere (parasiten) sowas tun würden. auch würde das anerkennen von negativen komplexen plänen den bürger aus seiner komfortzone ziehen, auch deshalb leugnet er sie lieber.\n\nvisionär: mensch der wieauchimmer eine signifikante charakterliche reife erlangt hat, und versucht seine vision eines utopia auf eine zustimmungsfähige bis heilsame art umzusetzen. visionäre kennen ihre abgründe und wissen zu was jeder mensch imstande ist, und arbeiten auf das bestmögliche hin. visionäre würden gruppendynamisch automatisch die bürger inspirieren und die fliegenden affen zu sinnen bekommen, deshalb müssen die parasiten verhindern, dass visionäre in der öffentlichen wahrnehmung fuß fassen können, oder aber durch unterschiedliche dynamiken chrakterlich korrumpiert werden.\n\nfliegender affe: mensch im zustand zwischen bürger und visionär. klüger als ein bürger aber hat nicht die reife eines visionärs. ein fliegender affe versteht grundsätzlich die bedeutsamkeit von moralischen werten, wenns darauf ankommt ists ihm aber wichtiger die lorbeeren zu ernten als die arbeit dafür zu tun. durch diese gesteigerte bedürftigkeit als etwas besseres zu gelten werden sie praktisch zu den idealen erfüllungegehilfen der parasiten, die sie vor ihre ideologischen karren spannen. sie realisieren nicht dass sie benutzt werden, solange sie auf ihre kosten (narzisstische anerkennung) kommen.",
            "Stimmt, so gesehen. :D Ich denke, sie geht einfach overboard. Ich denke aber auch, dass das symptomatisch ist für Probleme, die sehr lange sehr wenig adressiert wurden. Es scheint ja auch einige krude Haltungen von so Super-FeministInnen zu geben. Ich setze einfach darauf, dass sich das mit der Zeit \"herausebnet\".",
            "Man kann mit Menschen über all die Themen reden, völlig wertfrei. Abet umso mehr man auf alles und jeden und jede Splittergruppe achten muss, desto schwieriger und komplexer gestaltet sich Kommunikation.\n\nMenschen die ALG 2 beziehen, bzw Bürgergeld, bezeichne ich nicht als Schmarotzer. Das ist keine Frage aus Interesse, sondern eine Wertung die Abwerten soll. Das ist etwas völlig anderes als jemanden zu sehen und sich zu fragen wo derjenige ursprünglich wohl herkommt, einfach weil es einen interessiert oder man sich nichts weiter dabei denkt.\n\nBei Fußball kann ich mir vorstellen, dass Herrenfußball eben Fußball heißt, weil besonders im Profibereich wohl die Männer zuerst waren? Kann mit gut vorstellen, dass dir Frauen erst später nachgezogen haben. Das Problem ist nicht, dass das eine Fußball und das andere Frauenfußball heißt. Viele tun sich schwer damit zu akzeptieren, dass Frauen im Fußball sehr sehr sehr sehr sehr viel weniger verdienen als Männer. Die Männer verdienen eben sehr viel Geld durch Werbung, Merch der Vereine, Tickets, weiß der Geier was sonst noch. Frauenfußball ist dafür eben nicht im Ansatz populär genug für. Man kann aber auch niemanden zwingen es zu schauen, sich ein Ticket für ein Spiel zu kaufen. Da haben die Damen einfach leider pech.\n\nViele der anderen Dinge die du schreibst sind bezogen auf das Geschlecht bzw die unterschiedliche Sozialisierung. Frau und Mann sind nun mal unterschiedlich. Ausnahmen gibt es immer und überall, aber dass eher Frauen sich dahingehend etabliert haben sich um die Familie zu kümmern und gerne soziale Berufe machen wird kein Zufall sein. Ich sage nicht, dass man an starren Rollenbildern festhalten muss. Jeder kann leben und sich selbst definieren wie er möchte. Aber es ist nicht alles schlecht, falsch oder unwahr was Rollenbilder oder geschlechtsspezifisches angeht.\nWenn jemand für sich selbst sagt \"ein Mann muss si und so sein\" dann darf derjenige das für sich selbst so sehen und das anstreben. Alle anderen müssen das ja nicht (wir reden jetzt mal von Erwachsenen), die dürfen wiederrum sich selbst definieren und erfinden wie sie wollen. Im Leben muss man einfach auch lernen mit Menschen umzugehen die gedankenlos sind oder eben nicht nett bis asozial. Was du dir wünscht ist eine Utopie die niemals in der gesamten Menschheit ankommen wird. Zu sagen die Gesellschaft muss sich an allen und jeden anpassen (sprachlich gesehen) funktioniert nicht. Man kann sich nur Gleichgesinnte suchen für sein eigenes, privates Umfeld.\n\nWenn man sagt \"(deine) lange(n) Haare sind schön\" bedeutet das im Umkehrschluss doch nicht, dass kurze hässlich sind..... In dem einen Fall ist es ein Kompliment, weil die Frisur der Person einfach echt gut steht, im zweiten Fall ist es eine persönliche Vorliebe, die sich durchaus aber auch unterordnen kann. Vielleicht sollten wir lieber damit aufhören Dinge im Sachen hinein zu interpretieren die man nicht gesagt hat?",
            "Man kann ja aber nie wissen was genau letzten Endes sowas auslöst. Ich rede sowieso im Normalfall mit keinem wenn es nicht sein muss. Ich denke alle sind irgendwie irgendwo zu empfindlich geworden. Mir fehlt halt auch das Verständnis, wenn Rassismus Auswucherungen annimmt wo dann gesagt wird Wandern sei rassistisch und vergleichbare Ungetüme, auch wenn das wieder ein anderes Thema ist.\n\nAls ich meine Ausbildung gemacht hatte wurde ich auch dauernd gefragt weshalb ich den Job als Frau mache. Hat es mich genervt? Auf Dauer irgendwo schon, ja. Trotzdem habe ich niemanden Sexismus oder sonst was vorgeworfen. Indem wir so banale Fragen dämonisieren oder tabuisieren spalten wir uns doch untereinander wieder mehr voreinander ab, wo man doch eigentlich versucht zu vereinen.\n\nEs kommt nicht auf den Inhalt der Frage an, sondern wie man diese stellt. Der Ton macht die Musik. Denn nicht jeder meint das eben rassistisch oder sonst was. Ich mag mich jedenfalls nicht stigmatisieren lassen, nur weil man meint mir Rassismus vorzuwerfen wenn ich fragen sollte woher jemand kommt. Nichts anderes tut man schließlich, wenn man jedem das einfach pauschal unterstellt.",
            "Was alle völker der erde eint ist, dass es überall arschlöcher und coole Leute gibt.",
            "Werd mir auch nicht sagen lassen, dass eine Frage nach der Herkunft ansatzweise eine Mikroaggression ist. Muss ein Du-Problem sein, als ein wirkliches.",
            "Es reicht ja schon innerhalb Deutschlands zwischen zwei Dialekten umzuziehen. Man hört mir definitiv an, dass ich nicht „von hier“ bin und ich werde ständig gefragt. Ich bin übrigens sehr Deutsch…",
            "Exakt dies! Wie häufig ich schon von Hubers, Maiers und Schmidbauers nach meiner Herkunft gefragt wurde, weil ich keinen bayrischen Dialekt spreche, kann ich gar nicht mehr zählen. Und das obwohl ich der erstgeborene Bayer der Familie bin.\nGleichzeitig Frage ich auch jeden, der noch nach Oberpfalz schmeckt, woher er kommt um Smalltalk zu betreiben. Diese Unterstellung, mit der Herkunftsfrage eine Form von Rassismus zu betreiben ist für mich völlig befremdlich",
            "Oft reicht schon der Dialekt um gefragt zu werden",
            "Doch damit ist geholfen. Wenn ich darüber sprechen will, sage ich es schon selbst.",
            "Das ist mir jetzt unangenehm, aber ich bin selber Migrant und komme nicht aus Deutschland. Ich durfte mich auch schon \"Sie kommen aber nicht von hier?\" fragen lassen. Oder auch \"das ist ein komischer Akzent, wo kommen sie her?\".\n\nIch empfehle weniger Rassismus zu sehen wo keiner ist und den zu bekämpfen den es tatsächlich gibt. Man merkt sehr schnell wer ein Problem mit Ausländern hat und wer schlichtweg Konversation betreibt. Man darf sich halt nicht von manchen an der eigenen Moral erstickenden Leuten einreden lassen, dass die ganze Welt (oder zumindest Deutschland) nur aus Rassisten besteht.\n\nDas es daneben auch echte Rassismus-Erfahrungen gibt steht auch außer Frage. Aber wie gesagt, man merkt sehr schnell wo der Wind herweht.",
            "Ich glaub da braucht es schon eine sehr dünne Haut und fast schon das Bedürfnis danach hier eine Opferrolle zu konstruieren.\nMein Vor und Nachname sind auch eindeutig nicht deutsch und jede darauf Fußende Nachfrage nach meinem \"Ursprung\" habe ich bisher als ehrliches Interesse erlebt. Die Leute hören etwas, dass sie nicht einschätzen können und würden es gern wissen. Das ist schlicht Austausch und auch Normalisierung - niemand versucht mich damit anzugreifen und mir das Gefühl zu geben ich sei \"anders\". Es ist schlichte Neugier. Etwas, dessen ich häufig genug selbst schuldig bin, weil ich einfach gern Dinge lerne, die ich bisher nicht weiß. \nDaraus immer direkt n drama zu machen, als wollte einen jemand ausgrenzen oder nieder machen. Warum geht man mit so einem Weltbild durchs Leben?",
            "Sorry das ist wirklich nicht als Angriff an dich gemeint aber ich muss dir widersprechen. Ich bin selber ausländischer Herkunft und werde oft wegen meines Namens oder meines Aussehens gefragt \"woher ich komme\". Die Formulierung hat sich halt eben so eingebürgert und beinhaltet in der Regel keine versteckten Botschaften mit dem Inhalt \"du gehörst hier nicht hin\" sondern eher Interesse. Wo du dabei geboren bist ist vollkommen wurst. Man wirkt exotisch und wird halt danach gefragt. Ich bin hier geboren und aufgewachsen und habe sogesehen wenig mit meiner Herkunft zu tun und antworte dennoch auf die Frage \"woher ich komme\" freundlich mit \"ich bin Italienerin\". Dass das Nachfragen bei dir eine negative Auswirkungen hat, tut mir leid, liegt aber primär an dir selbst. Warum fragst du? Weil du unterbewusst dieser Frage Böswilligkeit unterstellst... Du kannst aber genauso gut bewusst hingehen und dem Nachfragenden Mitmenschen Wohlwollen und Interesse unterstellen... Alles eine Frage der Perspektive und persönlichen Einstellung. Menschen die es böse meinen, werden es dir deutlich zeigen... Jedem anderen aber eine Böswilligkeit zu unterstellen bringt niemandem weiter und sät Zwietracht.",
            "Ich weiß nicht genau ob du nicht verstehst was Kultur an sich ist?  \nHier mal was zum Lesen: [https://www.dwds.de/wb/Kultur](https://www.dwds.de/wb/Kultur)  \n  \nEin einfaches beispiel:  In Japan gibt es besondere formen des Theaters, oder z.B. den Shintoismus, mit entsprechenden Schreinen. Abseits von Menschen die sich wie ich aktiv für die Kultur interessieren ist es ziemlich unwahrscheinlich dass man sich mit jemandem darüber unterhalten kann, außer die Person ist eben selbst aus Japan bzw. hat japanische Wurzeln.\n\nDas hat auch nichts per se mit Asien zu tun. Ich war z.B. oft in Schweden und Island und auch dort ist die Kultur  (siehe oben) und die Geschichte des Landes sehr spannend, aber naja du bist da vermutlich die falsche Gesprächsperson.",
            "Ne, ist ein Bekannter, abwertender Begriff für Deutsche im Süden bzw. Osteuropa. Ein bisschen ironisch von jemandem, der “nur Hamburger sein will”, aber naja.",
            "Umgekehrt, komme aus Hamburg und wohne in Unterfranken :D ist immer direkt klar, dass man bei geschmeckt ist.",
            "Das Problem an dem Wort vermischen ist insofern problematisch, da es impliziert, dass Dinge getrennt sind und zwei Sachen zusammenkommen die nicht zusammen gehören. \n\nEs sind Menschen. Völlig egal ob schwarz, weiß oder sonstwas. Indem du von vermischen sprichst machst du Unterschiede zwischen den Menschen und impliziert ggf. sogar noch, dass diese ja eigentlich gar nicht zusammengehören. Ich weiß, dass du das nicht aussagen wolltest, aber so KANN es von anderen gelesen werden wird genau so von rechten Rassenspinner*innen gebraucht. \n\nIch habe sicherlich etwas überreagiert, aber da mich das Thema persönlich betrifft reagiere ich da allergisch. Ich hoffe du kannst meinen Punkt nachvollziehen und dich in Zukunft evtl anders ausdrücken.",
            "Ich weiß zumindest nicht wo ich gesagt haben soll, dass ich etwas dagegen habe, wenn schwarze und weiße miteinander Kinder bekommen. Wird vermutlich ein Geheimnis bleiben.",
            "Ich glaube nicht. Ich habe nicht gesagt, dass die Person diese Meinung vertritt, sondern lediglich, dass sie sich (anscheinend unbewusst) rassistischer Sprache bedient und daher wohl etwas Aufholbedarf hat.",
            "Vielleicht wäre ihm fortpflanzen lieber gewesen? Ich fand das hätte zu animalisch/triebgesteuert geklungen, während ich wiederrum finde Vermischung kann durchaus etwas positives sein. Kunst, Kulinarik, Kultur, überall positive Vermischung. Ich sehe keinen Grund mir diese positive Belegung nehmen zu lassen.",
            "Puh weiß nicht? Vielleicht Kinder bekommen?",
            "Zitier mir bitte die Stelle, wo ich sagte, dass du etwas dagegen hast.",
            "Wer genau jetzt? 😂",
            "Inwiefern? Meine Aussage war, dass die Person rassische Sprache verwendet hat ohne sich dessen bewusst zu sein und deshalb einiges zum Thema aufzuholen hat. \n\nDie Antworten darauf bestätigen meine Wahrnehmung. \n\nMit keinem Wort habe ich gesagt, dass diese Person die Meinung vertritt, dass die Menschen sich so nicht fortpflanzen sollten. Das ging nicht aus der Aussage hervor.",
            "Warum nicht?",
            "Ich gebe dir in einzelnen Sachen auch Recht. \n\nWir bekommen ja nun ein Gespräch hin ohne uns fertig zu machen, was ich gut finde :)\n\nZb dein Punkt mit der Zersplitterung. Da gebe ich dir Recht, dass man eine Verbundenheit, Zugehörigkeit oder wie man das auch nennen möchte braucht.\n\nBasierend darauf steht doch die Frage \"Woher kommst du\" für die Zersplitterung. Man könnte diese Person ja auch als \"deutsche Person\" lesen. Stattdessen sorgt ja die Frage für die Trennung mmn. \n\nEbenso der Punkt mit dem Fußball. Wenn man beides Fußball nennt, entsteht doch eine Verbundenheit, Zugehörigkeit und Co. Stattdessen sorgt doch die Aufteilung Fußball vs Frauenfußball für die Zersplitterung. \n\nBezüglich des Erfolgs: in den Jahren 2023 und 2022 hat ein Spiel der Frauen Nationalmannschaft die höchste Einschaltquote gehabt. Die Männer Nationalmannschaft bzw männliche Klubmannschaften hatten in beiden Jahren geringere Einschaltquoten.\n\nAuch da sehe ich es ähnlich und würde eine Hartz IV Person niemals als Schmarotzer betrachten oder darauf reduzieren, aber, wenn man in den letzten Wochen die Nachrichten betrachtet, Reden von der CDU hört, denken ja scheinbar einige so. \n\nEbenso der Punkt mit dem Steuerflüchtling in dem Zusammenhang. Es findet da eine Verschiebung zu den Reichen statt. Hier wird ein Bild vom bösen Staat konstruiert, der dem Millionär das Geld unrechtmäßig wegnehmen möchte. \n\nZb unterschied Männer/ Frau:  Siehe zb Statistiken a la sexuelle Gewalt, Femizid, gender pay gap, Verteilung in Führungspositionen, Verteilung in Hauptrollen, Verteilung Hausarbeit, Vergewaltigung, haben öfter ein Problem mit dem Selbstbild etc etc etc. Dieses sind ja nicht einfach nur sozial konstruierte Sachen, sondern sie haben einen großen Einfluss. \n\nAber natürlich nicht nur für die Frauen; auch viele Männer leiden darunter. Siehe zb Statistiken Suizid, Körperverletzung, Mord, Ertrinken im See, Alkoholabhängigkeit, Spielsucht, Drogenabhängigkeit, mehr Probleme mit sozialen Beziehungen etc. Dieses sind ja auch hier nicht einfach nur sozial konstruierte Sachen, sondern sie haben einen großen Einfluss. \n\nWäre es dementsprechend nicht besser, wenn man die Unterschiede reduzieren würde? Siehe auch Wörter \"Junge\" und \"Mädchen\" so findet beim weiblichen Kind schon im Wort eine Verniedlichung statt. Und ja es ist klar, dass allein die Sprache nicht alles lösen kann, aber vllt kann sie einen Teil dazu beitragen?\n\nOder wer sagt den berühmten Satz \"Willst du mich heiraten\". Da findest du im Netz sehr viele Wörter/ Aussagen/ und Co die komplett geschlechtsspezifisch sind. \n\nAuch bei dem Punkt mit dem Aussehen würde ich dir erstmal Recht geben. Könnte es sein, dass das Problem nicht darin liegt, dass der Satz einmal fällt, sondern dass der Satz ständig fällt bzw vermittelt wird? Zb lange Haare. Stell dir vor du wärst eine Frau und hättest kurze Haare. Bei deinen Freundinnen, bei Frauen im TV/ Serie/ Werbung/ Märchen/ Gespräche wird immer und immer und immer wieder gesagt wie schön und toll und mega lange Haare sind. Verändert das einen? Kann es einen kaputt machen?  Ich glaube, dass das wiederholte und das ständig präsente dort einen großen Einfluss hat. Zb in dem Buch von Elisabeth Lechner Riot do not diet lässt sie mehrere betroffene Personen sprechen und dort kann man deren Gedanken nachlesen. \n\nAuch da würde ich dir zustimmen, dass eine Welt ohne Verletzungen eine Utopie ist. Aber ich glaube, dass man noch sehr weit weg ist von dieser Utopie. Ich möchte hoffen, dass man noch besser kommunizieren kann und weniger Verletzungen verursacht.",
            "Noch eine Ergänzung, wo wir uns vielleicht auch schnell einigen können.\n\nIm Buch wozu Rassismus von Aladin El Mafaalani, Osnabrücker Soziologie Professor, schlägt dieser als Möglichkeit zur Verbundenheit Kanada vor.\n\nDort wird der Nationalismus anders gedacht. Du lebst da also bist du Kanadier. Vielleicht dann deutsch Kanadier oder türkisch Kanadier, aber auf jeden Fall Kanadier. Dort soll es so sein, dass bereits im kindergarten die Flaggen gezeichnet werden, die nationalhymne gesungen wird, immer und überall klar vermittelt wird dass alle zu dieser Nation gehören. Vor dem Schulunterricht soll die Nationalhymne gesungen werden. \n\nEr führt ein anderes Land oder auch Kanada? noch auf (leider vergessen welches, aber ist auch in dem Buch), dort ist es üblich dass einmal die Woche in jeder Klasse über die Verletzungen der letzten Woche gesprochen wird. Sprich die Kinder es lernen sich zu äußern, sich zuzuhören und Rücksicht auf die anderen Personen zu nehmen. Und das halt auch von klein auf. Vielleicht wäre das auch eine gute Möglichkeit, wenn man das von klein auf macht. \n\nOder es gibt in Dänemark seit 1993 Empathie Unterricht, was in dem Buch nicht genannt wird.\n\nSprich dann a eine Möglichkeit zu Verbundenheit und b eine Möglichkeit für einen besseren Austausch und mehr Empathie.",
            "Also dass alle zu empfindlich sind, empfinde ich nicht so. Dass es absurde Auswüchse gibt schon, wie ich an anderer Stelle kommentiert habe.\n\nWenn sich allerdings eine bestimmte Menge dahingehend äußert, dass sie nicht jedem ihre Herkunft mitteilen möchte, dann kann man das vielleicht einfach mal annehmen. Auch wenn man selbst an der Frage nichts verkehrt findet und sie unter neutralen Umständen auch nicht verkehrt ist.\n\nDasselbe gilt meiner Meinung nach für Äußerungen, gegen die man sich selbst nicht wehrt/wehren möchte, obwohl sie für andere problematisch sind. Selbstverständlich musst du das nicht zum Thema machen. Allerdings haben solche Aussagen neben der persönlichen und situativen Dimension auch immer eine gesellschaftliche. Du bekommst vielleicht verwunderte Kommentare, die nächste bekommt aber womöglich den Job nicht - weil sie eine Frau ist. Mal abgesehen davon, dass das auch absolut outdatet und unnötig ist, denn ich gehe nicht davon aus, dass du als professioneller Samenspender arbeitest oder irgendwas, das einen Penis und ein Y-Chromosom unabdingbar macht.",
            "Ich lebe seit 12 Jahren in Berlin, melde mich aber am Telefon immernoch mit Grüß Gott, Frage beim Bäcker zu Fasching nach Krapfen und sage Kina und Kemie und nicht schina und Schemie😂 sonst rede ich weitgehend Hochdeutsch, aber die drei Beispiele reichen schon, dass ich regelmäßig gefragt werde 😅",
            "Ich finde es beeindruckend das du anderen dieses empfinden absprichst.   Mein bester Freund ist schwarz und ich habe den Unterschied zwischen dem normalen \"wo kommst du her\" und dem \"du siehst anders aus als ich, erkläre dich warum du anders aussiehst obwohl du in Zeitz geboren wurdest\" mehr als einmal erlebt. Aber du bist ja selbst betroffener und darfst anderen das absprechen oder so.",
            "Es gibt keine asiatische Kultur, es gibt verschiedene Kulturen. Ich störe mich an deiner Formulierung weil du ja ach so interessiert bist aber da nicht Mal differenzierst. Das ist schön hart ignorant, aber ja, wahrscheinlich bin ich dafür der falsche Gesprächspartner.",
            "Mag sein, dass es in den genannten Regionen so verwendet wird, aber \"deutsche Kartoffel\" ist ein Begriff der aus Norddeutschland kommt, und absolut nicht abwertend ist",
            "Die Unterfranken sind da besonders speziell 😂 wo wohnst du da?",
            "Das ist die Seuche unserer Zeit: Es wird reflexhaft auf irgendwelche Schlüsselwörter reagiert, ohne sich wohlwollend zu fragen, was das Gegenüber gemeint haben könnte.",
            "Ich habe nicht gesagt, dass du etwas dagegen hast. Aber du hast einfach rassentheoretische Sprache verwendet.",
            "Du scheinst mir genau so ein überkorrekter Mensch zu sein wie die Person über die OP gesprochen hat.  \nStimmt, es gibt verschiedene Asiatische Kulturen. Du hast mich ertappt. Eigentlich wollte ich hier nur mein Rassistisches Gedankengut injizieren und den Leuten in ihr unterbewusstsein programmieren, dass alle Asiaten gleich sind. Dank dir ist die Welt jetzt zum Glück ein besserer Ort geworden weil du allen die Augen geöffnet hast was echter Rassismus ist, nämlich zu sagen dass man sich für Asiatische Kultur interesiert, statt genauer zu differenzieren was man damit jetzt exakt meint.  \nDu bist ein wahrer Held unserer Gesellschaft und ich ein ignoranter Rassist ;) Danke für deinen konstruktiven Beitrag zum Thema.",
            "Ich wohne in Berlin, ich kann dir sagen, dass kein deutscher den Begriff je benutzt hat, sondern immer Ausländer, um sich über deutsche lustig zu machen. Dann wurde der Begriff überwiegend von Alman ersetzt.",
            "Also ich komme aus dem nördlichen NRW vom Land und \"Kartoffel Leute\" kommt bei mir in jedem Fall abwertend an.",
            "Volkach bei Kitzingen, in welches Viertel hat es dich gezogen? Bzw wo war eine bezahlbare Wohnung frei?",
            "Dann komm mal aus der Stadt raus, in den ländlichen Gegenden hört man das durchaus mal",
            "Ja, aber die Person die kommentiert hat, hat halt Migrationshintergrund und Hamburg und mein deutscher vom Land. So wichtig ist mir das jetzt ehrlich gesagt aber nicht. Deutsche Kartoffel ist weiß Gott nicht zu vergleichen mit anderen degradierenden Begriffen wie dem N-Wort oder so.",
            "Gerade in Hamburg kann ich mir auch vorstellen, dass man den Begriff auch mal hören kann, da Seemänner den Begriff sehr gerne untereinander verwendet haben."
        ]
    },
    "BIDA Weil ich mich vorbeigedrängelt habe?": {
        "title": "BIDA Weil ich mich vorbeigedrängelt habe?",
        "score": 112,
        "url": "https://www.reddit.com/r/BinIchDasArschloch/comments/1dl7pi6/bida_weil_ich_mich_vorbeigedrängelt_habe/",
        "content": "Hallo ihr Lieben,\n\nganz komisches Ding heute. War in einem Supermarkt, wo ich normalerweise nicht einkaufen gehe. Dort waren die Gänge wirklich enorm eng, sodass man sich gegenseitig andauernd aus dem Weg gehen musste, damit jemand vorbeikann. Was ich auch gerne getan hatte. Vorher auch mit anderen Kundinnen und Kunden, man begegnete sich mit einem Lächeln und ließ sich vor oder nach, kein Problem.\n\nNunja, bis ich auf den Gang zu den Chips kam. Dort hatten zwei junge Frauen wohl ein emotionales Wiedersehen oder so - jedenfalls haben sie sich in die Arme genommen und standen so dort länger herum und haben jedem den Weg blockiert. \n\nDa habe ich dann freundlich gefragt, ob ich denn nicht mal kurz vorbeidürfte. \n\nDie Antwort war jedoch nicht, was ich erwartet hatte. Diese war \"Nimm einfach nen anderen Gang, wir sind jetzt hier.\"\n\nIch wollte aber ehrlich gesagt keinen anderen Gang benutzen, da ich es einfach nicht einsah - insbesondere, weil der Umweg relativ schwierig gewesen wäre, da der Laden sehr verwinkelt aufgebaut ist und ich derzeit erneut einen Gichtanfall im rechten Fuß habe, was das Laufen nicht wirklich einfacher macht. \n\nAlso habe ich erneut freundlich gefragt und gemeint, dass ich mich ja für sie freue, aber sie könnten ihre \"tolle Wiederkunft doch kurz unterbrechen, wenn jemand anderes durchwill\".\n\nDas wurde ignoriert. \n\nNun habe ich dann geseufzt und mich an ihnen vorbeigedrängelt. Die Worte, die ich darauf vernahm, waren \"Was fällt dir ein, du *H-Wort*?\". Worauf ich erwiderte, dass ihnen der Markt nicht gehört und sie doch gefälligst Rücksicht zu nehmen haben. \n\nDas wollten sie wohl überhaupt nicht hören und haben beide enorm starke Schimpfwörter hinterhergeschrien.\n\nJetzt bin ich wieder daheim. Ich muss zugeben, dass ich wirklich sehr wütend war. Aber mittlerweile, wo ich mich etwas beruhigt habe, frage ich mich nun, ob ich eventuell das Problem war? \n\nDanke für jeden Input. \n\nLiebe Grüße.",
        "num_comments": 79,
        "comments": [
            "Hi, danke für das reinschauen bei r/BinIchDasArschloch! Bitte bleibt freundlich und haltet euch an die Sub-Regeln.\n\n OP hat folgende Begründung gegeben, warum er/sie denkt, dass er/sie ein Arschl*ch wäre oder ist:\n\n > 1. Ich glaube das Vorbeidrängeln ist nicht okay und 2. ich glaube mein zweiter Satz danach war auch nicht zivilisiert",
            "NDA, gar keine Frage. Zumal null Einsicht seitens der beiden Damen bestand und du zunächst freundlich gefragt hast",
            "Ganz klar NDA!! Was für dreiste unangenehme Menschen es gibt,  ist schon krass....",
            "NDA. Naja, du hast es ja freundlich versucht. Manche Leute denken halt sie sind der Mittelpunkt des Universums.",
            "NDA - du warst freundlich und sie wurden direkt ausfallend. Solche Leute haben dein schlechtes Gewissen nicht verdient.",
            "NDA\nKlingt nach sozialem Abschaum die beiden Zeitgenossen. Einfach ignorieren und nicht weiter Gedanken drüber machen.",
            "NDA - tut mir leid, dass die sowas passiert ist. Echt asoziales Verhalten der anderen",
            "Ja, das war ziemliches Arschlochverhalten von dir, weil du deine Rolle als NPC nicht kennst oder einsehen willst. Die beiden Damen waren offensichtlich Maincharacters und da stört man nun mal nicht bei so einem emotionalen Moment, egal wo.\n/s\nNDA",
            "Ganz klares NDA. Ich wäre zum nächsten Mitarbeiter gegangen und ihm das erzählt mit der Hoffnung daß er etwas schneid hat und die dann raus wirft.",
            "NDA und alles richtig gemacht.",
            "OMG, das hätten die beiden verbal nicht überlebt 😁\nNDA.",
            "Nda. Wenn man sich aus dem Weg gehen kann, dann hätte man sich auch kurz dünn machen können um den Weg frei zu machen. Leute, die sich in engstellen breit machen (auf, vor und nach Treppen, direkt neben Hindernissen usw) während es alternativen gibt wo sie nicht stören, sind immer die Ärsche.",
            "NDA und ein herzhaftes \"Schnauze\" zum Abschied wäre mehr als angemessen gewesen.",
            "NDA - gibt es nicht viel zu überlegen.",
            "NDA bei dem h-wort direkt kopfnuss geben 🤟",
            "NDA, musst Du da echt fragen?",
            "NDA, und bei der Frage nach dem H-Wort einfach sagen, dass du es schon wüsstest, wenn die unfreundliche Dame deine Mutter wäre.",
            "NDA, alles richtig gemacht.",
            "NDA\n\nselbst wenn du denen noch eine Respektschelle verpasst hättest, wärst du für mich nicht das A.\n\n\n\n\n\n\n\n\n/s  (Gewalt ist natürlich falsch)",
            "Nö, würde die beiden wegen Beleidigung anzeigen. NDA",
            "Danke fürs Posten! Dieser Kommentar ist eine Kopie deines Posts, sodass Leser deinen originalen Text sehen können, falls dein Post gelöscht oder bearbeitet wird. Dieser Kommentar beschuldigt dich NICHT irgendetwas kopiert zu haben.\n\n\nHallo ihr Lieben,\n\nganz komisches Ding heute. War in einem Supermarkt, wo ich normalerweise nicht einkaufen gehe. Dort waren die Gänge wirklich enorm eng, sodass man sich gegenseitig andauernd aus dem Weg gehen musste, damit jemand vorbeikann. Was ich auch gerne getan hatte. Vorher auch mit anderen Kundinnen und Kunden, man begegnete sich mit einem Lächeln und ließ sich vor oder nach, kein Problem.\n\nNunja, bis ich auf den Gang zu den Chips kam. Dort hatten zwei junge Frauen wohl ein emotionales Wiedersehen oder so - jedenfalls haben sie sich in die Arme genommen und standen so dort länger herum und haben jedem den Weg blockiert. \n\nDa habe ich dann freundlich gefragt, ob ich denn nicht mal kurz vorbeidürfte. \n\nDie Antwort war jedoch nicht, was ich erwartet hatte. Diese war \"Nimm einfach nen anderen Gang, wir sind jetzt hier.\"\n\nIch wollte aber ehrlich gesagt keinen anderen Gang benutzen, da ich es einfach nicht einsah - insbesondere, weil der Umweg relativ schwierig gewesen wäre, da der Laden sehr verwinkelt aufgebaut ist und ich derzeit erneut einen Gichtanfall im rechten Fuß habe, was das Laufen nicht wirklich einfacher macht. \n\nAlso habe ich erneut freundlich gefragt und gemeint, dass ich mich ja für sie freue, aber sie könnten ihre \"tolle Wiederkunft doch kurz unterbrechen, wenn jemand anderes durchwill\".\n\nDas wurde ignoriert. \n\nNun habe ich dann geseufzt und mich an ihnen vorbeigedrängelt. Die Worte, die ich darauf vernahm, waren \"Was fällt dir ein, du *H-Wort*?\". Worauf ich erwiderte, dass ihnen der Markt nicht gehört und sie doch gefälligst Rücksicht zu nehmen haben. \n\nDas wollten sie wohl überhaupt nicht hören und haben beide enorm starke Schimpfwörter hinterhergeschrien.\n\nJetzt bin ich wieder daheim. Ich muss zugeben, dass ich wirklich sehr wütend war. Aber mittlerweile, wo ich mich etwas beruhigt habe, frage ich mich nun, ob ich eventuell das Problem war? \n\nDanke für jeden Input. \n\nLiebe Grüße.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/BinIchDasArschloch) if you have any questions or concerns.*",
            "NDA Natürlich warst Du nicht das Problem. Normale Menschen lassen andere vorbei und machen Platz, wenn sie den Weg blockieren.\nIch hätte mir an Deiner Stelle den Filialleiter kommen lassen und hätte ihn gefragt ob das hier bei ihm im Laden so Gang und Gäbe ist das man beleidigt wird. Karen Style. \nAlternativ einfach mit dem Wagen 🛒 die beiden wegrammen und so den Weg frei machen.",
            "NDA - du hast es freundlich versucht",
            "NDA  :  freundlich angefragt und von denen agepflaummt werden?  die hätt ich doch sowas von verschäucht",
            "NDA\n\nEinfacher Fall",
            "Schön, dass du so reflektiert bist und versuchst auch zu analysieren ob du einen Anteil an der Situationen hattest. \nNicht jeder Mensch ist dazu bereit. Es hilft aber die Welt ein wenig Arschlochfreier zu machen.\n\nIn diesem Fall bin ich bei NDA, auch wenn man A S A geben könnte.\n\nIch war baff als ich die Antwort der Damen gelesen habe. Mein Impuls wäre es auch gewesen dann einfach vorbei/hindurch zu gehen. Kein normaler Mensch rechnet mit so einer Antwort.\nLetztendlich ist das aber auch eine impulsive Handlung und die Handlung an sich war nicht ok.\n\nDennoch halte ich dir sehr zu gute, dass du darüber nachdenkst und das die Antwort wirklich total unverschämt und frech war. Daher NDA.",
            "NDA - Asozial. Nur weil die \"Da jetzt sind\" gibst für niemanden Chips oder wie? 🤦🏼‍♀️",
            "NDA, aber leider ein schwarzer Tag für die Gleichberechtigung.",
            "Bei so einen eindeutigen Fall bin ich schon geneigt zu sagen BDA für's Karmafarming",
            "Bitte einen Bewertungskürzel in euren Kommentaren verwenden (NDA, BDA, ASA, KAH) oder Info bei fehlenden Informationen. Ohne Kürzel kann der Bot euren Kommentar nicht werten und dieser fließt NICHT in die Gesamtbewertung mit ein. Siehe Regel 4! NDA:Nicht Das Arschloch, BDA: Bist Das Arschloch, ASA: Alle Sind Arschlöcher, KAH: Kein Arschloch Hier, Info: Es fehlen Informationen\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/BinIchDasArschloch) if you have any questions or concerns.*",
            "[removed]",
            "[removed]",
            "[removed]",
            "NDA, nächstes mal vielleicht nicht dran vorbeiquetschen, sondern die vor dir herschieben. aus dem gang. aus dem laden. vor den bus.",
            "[removed]",
            "NDA\n\nWas für ne Frage... :D",
            "NDA,...dafür musst Du aber mindestens 3 der Schimpfwörter erzählen...😅",
            "NDA\n\n\nIch frage mich dennoch, warum sone offensichtliche NDA-Bagatelle hier so lang und weit erklärt und/oder überhaupt diskutiert werden muss.",
            "NDA. Kann mir genau vorstellen wie die aussahen...",
            "NDA, direkt wegen Beleidigung anzeigen.",
            "NDA - Bin sehr stolz dass du so ruhig geblieben bist. Ich hätte die vermutlich erstmal schön umgerempelt beim vorbeigehen....  \nWas manchen Leuten so einfällt... Asozial...",
            "NDA. Die beiden sind einfach nur rücksichtslose Gesäßviolinen.",
            "Klar NDA. Gibt Menschen die bei jeder kleinen Scheiß einen Grund sehen Streit anzufangen. So Leute sind einfach respektlos",
            "NDA\n\nDie sind halt einfach nicht gesellschaftsfähig. Der Supermarkt ist zum Einkaufen da, und wenn man ihn zum Quatschen missbraucht, hat man dabei darauf zu achten, dass man niemanden dadurch stört.\n\nDanke, dass du ihnen mal einen Realitätscheck gegeben hast.",
            "NDA. \nKrass… Ich glaube, nach dem 3. Schimpfwort hätte ich die Polizei gerufen wegen Beleidigung. Sorry, was ist das bitte für asoziales Verhalten…",
            "NDA- ich drängle mich oft an Leuten vorbei weil die sich einen Dreck um die anderen Menschen kümmern. Also dass die sich überhaupt nicht umschauen, ob jemand vorbei möchte oder einfach mal vorausschauend handeln wie: ich stehe etwas abseits, überlege was ich haben möchte und gehe dann erst ans Regal und nehme es. Genau so gehe ich auf dem Bürgersteig immer so in der Menschenmasse, dass immer noch an der Seite eine Person schnell durch laufen kann wenn sie schneller geht, ein Notfall ist oder anderes. Und wenn die Leute sich einen dreck um andere kümmern warum sollte man selber dann Rücksicht auf solche nehmen?",
            "NDA, was ist das denn ? 😂 wie kann man sich so verhalten",
            "NDA. Die beiden Frauen entstammten wohl der untersten Schublade.",
            "NDA, deine Selbstkontrolle ist enorm, ich hätte denen Dosenobst an den Kopf geschmissen",
            "[removed]",
            "NDA alles richtig gemacht. Leute die den Sinn eines Supermarktes nicht verstehen muss man auf ihr Fehlverhalten hinweisen. Ich hätte die einfach übergemäht aber gut vorbei schleichen und beleidigt werden ist natürlich auch eine Taktik.",
            "NDA.  \nBei solchen oder ähnlichen Situationen frage ich immer erstmal in normaler Lautstärke: \"Darf ich mal bitte?\", was meistens reicht. Reicht es nicht, dann folgt das ganze ein zweites Mal, in etwas gehobenerer Lautstärke mit etwas energischerem Unterton. Wenn das dann immer noch nicht reicht, dann haben die Betroffenen halt Pech gehabt. Ich hab schließlich auch noch was besseres zu tun.  \nMan muss nicht immer jeden mit Samthandschuhen anfassen.",
            "NDA. Leider ist es zunehmend üblich geworden, dass viele Menschen meinen, sich im öffentlichen Raum, aber auch in Verkaufsräumen etc. maximal nach ihren spontanen Bedürfnissen ausleben zu müssen, ohne Rücksicht auf die Freiheit der anderen Menschen in ihrer Umgebung. Interessanterweise spielt dabei auch immer das Bedürfnis nach Selbstdarstellung eine Rolle. Man will mit seinem Verhalten gesehen werden und es muss am besten noch “instagramable” und möglichst theatralisch sein, damit man hoffentlich dafür “bewundert” wird. Wobei man dann doch meist nur das Verhalten kopiert, was man in anderen Reels, Videos, TV, Daily Soaps, Filmen, Werbung etc. gesehen hat. Ist im Grunde schlicht pubertäres Verhalten, verstärkt durch Social Media et al. und sogar oft verlängert bis ins mittlere Alter hinein.",
            "NDA Hätte mich direkt nach dem ersten Fragen vorbeigedrängt",
            "NDA, deswegen Soziales Pflichtjahr für alle. Damit solche F#tzen auch mal etwas Zivilcourage und Respekt fürs Umfeld eingeflöst kriegen. Könnte mit 5 bar im Strahl kotzen bei solchen Menschen.",
            "NDA das die solche Beleidigungen von sich geben ist echt nicht schön.",
            "NDA\n\nAlles richtig gemacht. Ich hätte ja beim ersten Werteurteil das meine Würde angegriffen hat wie beim H-Schimpfwort sofort auch von meinen Recht auf 50 Tagessätze Strafzahlung gebrauch gemacht. Lass dir so was nie woeder bieten",
            "NDA befummeln können die sich zuhause",
            "NDA\n\nEs gibt halt einfach Leute, denen kannst du es nicht recht machen, abgesehen davon, dass das auch nicht deine Aufgabe ist.\n\nIch war neulich in einem Supermarkt und bin angeranzt worden, weil ich  NICHT um ein Durchlassen gebeten hatte. Ich bin einfach umgedreht und habe einen anderen Weg genommen.\n\"Eiiiinfach mal was sagen!\", wurde mir garstig hinterhergerufen.",
            "[removed]",
            "NDA\n\nNur kurz die Karen-Versammlung gestört",
            "NDA,\n\nAnzeige wegen Beleidigung und Hausverbot wären d\nDinge, die ich mir bei solchem Klientel wünsche.",
            "NDA\n\nDass du überhaupt fragen musst 😂 Was kommt morgen: ,,Als ich bei der Arbeit heute auf die Toilette wollte, hat sich mir ein Kollege in den Weg gestellt. Infolgedessen habe ich mir in die Hose gemacht. BIDA?\"",
            "NDA\n\nGenau das! Spätestens beim beschimpfen wäre nein schlechtes Gewissen vorbei! \n\nUnd es gehört zur Nettiquette nicht im Weg herum zu stehen, gerade in engen Läden und wenn viel los ist!",
            "Der NPC wäre mit Vollgas in die rein und ohne Reaktion weiter gegangen.",
            "Entschuldigung, ich habe halt selten so viel Selbstbewusstsein wie heute und kann mit Konflikten sehr schlecht umgehen, daher war es etwas, was mich selbst überrascht hatte. Ich dachte daher, das die Frage auf diesem Sub okay sei.",
            "Wunder mich auch immer, wie unselbstsicher viele sind. Dann gibtes das Gegenteil: Leute die würden dichdirekt weg takeln und sich keinen einzigen Gedanken machen.",
            "Was hat das mit Gleichberechtigung zu tun?",
            "Deinem Kommentar fehlt eine Bewertung.(Siehe Regel 4)\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/BinIchDasArschloch) if you have any questions or concerns.*",
            "Deinem Kommentar fehlt eine Bewertung.(Siehe Regel 4)\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/BinIchDasArschloch) if you have any questions or concerns.*",
            "Deinem Kommentar fehlt eine Bewertung.(Siehe Regel 4)\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/BinIchDasArschloch) if you have any questions or concerns.*",
            "Deinem Kommentar fehlt eine Bewertung.(Siehe Regel 4)\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/BinIchDasArschloch) if you have any questions or concerns.*",
            "Deinem Kommentar fehlt eine Bewertung.(Siehe Regel 4)\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/BinIchDasArschloch) if you have any questions or concerns.*",
            "Dein Beitrag wurde entfernt, weil er gegen Regel 1: Seid freundlich verstößt.",
            "DURCHgegangen.",
            "Ja mach dir halt keinen Kopf um die beiden. Wer mit solchen Wörtern um sich schmeißt, ist ganz andere Sachen gewohnt und hat deine Höflichkeit die du ihnen danach trotzdem noch entgegengebracht hast, nicht verdient",
            "Natürlich ist die Frage ok, aber bei dieser Geschichte ergibt sich die Antwort eigentlich von selbst. Du solltest echt an Deinem Selbstbewusstsein arbeiten. Selbstverständlich sollte man seinen Mitmenschen immer freundlich entgegen treten ABER wenn Dich jemand wie Dreck behandelt musst/solltest Du Dir das nicht gefallen lassen UND dann im Nachhinein auch noch überlegen müssen, ob es Deine Schuld war.",
            "Logo ist die Frage okay, Trouble wundert sich nur, dass man überhaupt daran zweifeln kann, dass der Fehler bei den blöden Puten liegt."
        ]
    },
    "BIDA weil ich das Paket vor die Tür gestellt habe": {
        "title": "BIDA weil ich das Paket vor die Tür gestellt habe",
        "score": 2,
        "url": "https://www.reddit.com/r/BinIchDasArschloch/comments/1dludme/bida_weil_ich_das_paket_vor_die_tür_gestellt_habe/",
        "content": "Hallo, ich habe ein Paket für die Nachbarn unter mir angenommen. Wir mögen uns nicht, hatten schon Diskussionen, aber man kann sich grüßen und normalerweise auch Pakete gegenseitig annehmen.\n\nIch wollte gerade los und hatte zufällig an der Eingangstür den Hermes-Mann getroffen. Er sagte, niemand öffnet im Haus. Ich sagte, ich kann das Paket annehmen, obwohl ich eigentlich los wollte. Ich habe gesehen, dass es für den Nachbarn ist, aber der Hermes-Mann ist sehr nett und ich wollte ihm den Gefallen tun. Ich bin also nochmal hoch zu meiner Wohnung und hab es in meine Wohnung gebracht.\n\nDa ich die Nachbarn nicht gerne sehe, wollte ich die Übergabe hinter mich bringen. Ich bin am folgenden Tag um 19 Uhr dort hin und habe geklingelt, weil ich es vorbei bringen wollte. Es hat niemand geöffnet.\n\nAm darauf folgenden Tag wollte ich das wieder tun und habe vorher aus dem Fenster geschaut. Man kann bei den meisten Nachbarn in die Küche schauen und ich sah dort, dass die Mutter in der Küche sitzt. Die Küche ist in allen Wohnungen direkt neben der Eingangstür, das sind vielleicht 5 Meter. Also bin ich mit dem Paket runter und war sicher, dass ich es heute übergeben kann und habe 3 mal geklingelt und auch etwas gewartet.\n\nEs hat niemand geöffnet. Das hat mich ziemlich gewundert. Ich wollte eigentlich gerade wieder los, habe aber schnell nochmal aus dem Fenster geschaut und habe dann auch noch die Tochter in der Küche gesehen, die auch das Paket bestellt hat. Man kann von dort eigentlich nicht die Klingel überhören und ich habe die Klingel ja selber in ihrer Wohnung von außen hören können.\n\nIch bin also runter und habe ihnen das Paket einfach vor die Tür gestellt. Muss dazu sagen, dass ich im 4. Stock und sie im 3. Stock wohnen. In den Fluren ist praktisch kein Verkehr, also es ist sehr unwahrscheinlich, dass es geklaut wird.\n\nIch weiß, dass ich auch länger hätte warten können, aber ich muss ehrlich sagen, dass diese Nachbarn und ich wirklich eine große Antipathie gegeneinander haben. Ich will niemandem was Böses, aber die Zündschnur ist dann schon etwas kurz.\n\nAlso BIDA, weil ich in Kauf genommen habe, dass das Paket evtl. geklaut wird und ich nicht länger gewartet habe, bis sie es selber holen kommen?\n\n  \nPS: Mir ist klar, dass ich im Falle eines Verlusts haftbar gemacht werden kann",
        "num_comments": 6,
        "comments": [
            "Hi, danke für das reinschauen bei r/BinIchDasArschloch! Bitte bleibt freundlich und haltet euch an die Sub-Regeln.\n\n OP hat folgende Begründung gegeben, warum er/sie denkt, dass er/sie ein Arschl*ch wäre oder ist:\n\n > BIDA, weil ich in Kauf genommen habe, dass das Paket evtl. geklaut wird und ich nicht länger gewartet habe, bis sie es selber holen kommen?",
            "NDA aber im Fall, dass es geklaut wird, wirst du ggf dafür belangt",
            "NDA\nAber nimm keine Pakete mehr für die an",
            "Bitte einen Bewertungskürzel in euren Kommentaren verwenden (NDA, BDA, ASA, KAH) oder Info bei fehlenden Informationen. Ohne Kürzel kann der Bot euren Kommentar nicht werten und dieser fließt NICHT in die Gesamtbewertung mit ein. Siehe Regel 4! NDA:Nicht Das Arschloch, BDA: Bist Das Arschloch, ASA: Alle Sind Arschlöcher, KAH: Kein Arschloch Hier, Info: Es fehlen Informationen\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/BinIchDasArschloch) if you have any questions or concerns.*",
            "Danke fürs Posten! Dieser Kommentar ist eine Kopie deines Posts, sodass Leser deinen originalen Text sehen können, falls dein Post gelöscht oder bearbeitet wird. Dieser Kommentar beschuldigt dich NICHT irgendetwas kopiert zu haben.\n\n\nHallo, ich habe ein Paket für die Nachbarn unter mir angenommen. Wir mögen uns nicht, hatten schon Diskussionen, aber man kann sich grüßen und normalerweise auch Pakete gegenseitig annehmen.\n\nIch wollte gerade los und hatte zufällig an der Eingangstür den Hermes-Mann getroffen. Er sagte, niemand öffnet im Haus. Ich sagte, ich kann das Paket annehmen, obwohl ich eigentlich los wollte. Ich bin also nochmal hoch zu meiner Wohnung und hab es in meine Wohnung gebracht.\n\nDa ich die Nachbarn nicht gerne sehe, wollte ich die Übergabe hinter mich bringen. Ich bin am folgenden Tag um 19 Uhr dort hin und habe geklingelt, weil ich es vorbei bringen wollte. Es hat niemand geöffnet.\n\nAm darauf folgenden Tag wollte ich das wieder tun und habe vorher aus dem Fenster geschaut. Man kann bei den meisten Nachbarn in die Küche schauen und ich sah dort, dass die Mutter in der Küche sitzt. Die Küche ist in allen Wohnungen direkt neben der Eingangstür, das sind vielleicht 5 Meter. Also bin ich mit dem Paket runter und war sicher, dass ich es heute übergeben kann und habe 3 mal geklingelt und auch etwas gewartet. \n\nEs hat niemand geöffnet. Das hat mich ziemlich gewundert. Ich wollte eigentlich gerade wieder los, habe aber schnell nochmal aus dem Fenster geschaut und habe dann auch noch die Tochter in der Küche gesehen, die auch das Paket bestellt hat. Man kann von dort eigentlich nicht die Klingel überhören und ich habe die Klingel ja selber in ihrer Wohnung von außen hören können.\n\nIch bin also runter und habe ihnen das Paket einfach vor die Tür gestellt. Muss dazu sagen, dass ich im 4. Stock und sie im 3. Stock wohnen. In den Fluren ist praktisch kein Verkehr, also es ist sehr unwahrscheinlich, dass es geklaut wird. \n\nIch weiß, dass ich auch länger hätte warten können, aber ich muss ehrlich sagen, dass diese Nachbarn und ich wirklich eine große Antipathie gegeneinander haben. Ich will niemandem was Böses, aber die Zündschnur ist dann schon etwas kurz.\n\nAlso BIDA, weil ich in Kauf genommen habe, dass das Paket evtl. geklaut wird und ich nicht länger gewartet habe, bis sie es selber holen kommen?\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/BinIchDasArschloch) if you have any questions or concerns.*",
            "Danke dir, war mir klar, habe es im Text ergänzt!"
        ]
    }
}