{
    "2008. Fourteen. Seems crazy now. ": {
        "title": "2008. Fourteen. Seems crazy now. ",
        "score": 812,
        "url": "https://i.redd.it/2ajjp2q7y08d1.jpeg",
        "content": "",
        "num_comments": 31,
        "comments": [
            "Looks like an album cover for a 🔥 Midwest emo band",
            "I both want to forget and want to return.",
            "This is a cool picture. It brings back all sorts of feelings/nostalgia.",
            "Man I’m the same age as you and looking at this pictures makes me weirdly nostalgic",
            "High school cigarettes are the best cigarettes",
            "I look at old pictures and cant believe Im the same person. Its really crazy youre right😭",
            "In 2008 I was 16/17. Damn, what a good time the 2000s were.",
            "Here’s the [song](https://www.dropbox.com/scl/fi/pz55kmtjraoazlzku700f/Play-It-School-Shirt-Smells-Like-Smoke-Mix.mp3?rlkey=lket4i69vjstxocnc8ztxivvv&dl=0) I made for this album cover based on the suggestion and other comments.",
            "Not a cellphone in sight just living",
            "The hair is giving 80’s.",
            "I feel like I had the same shirt (also a lot of brooding myspace pics in playgrounds/parking lots)",
            "If you said this was from 1979 I would believe you.",
            "This goes crazy honestly",
            "Same bro, same.",
            "This sub has turned into “here’s a cool pic of me that’s not from the past 5 years”",
            "Seems like fourteen to me.",
            "this pic goes so hard, just a night out chillin in a park",
            "Are you smoking.",
            "Smoking might not be good for you, but it makes you look cool as hell",
            "1995-2010 was pretty great 🥲",
            "\"The cigarette scent, it was everything then\"",
            "Fissure Price",
            "🇺🇸🏈!",
            "Saaaame.",
            "We had them in ‘08 of course. They just didn’t really do anything. iPhones I guess were around but not for 14 yr olds.",
            "Little Dikes",
            "Might steal that if i ever start a band, which i wont but, i can dream.",
            "I'm sure in '08 I was still rocking my Blackberry.",
            "As the great Coach Norton once said, “If you can dream it, you can do it.”",
            "I was!  My ex around 2010 “why don’t you just get an iPhone”"
        ]
    },
    "I’m upset at whoever authorized this haircut (1996)": {
        "title": "I’m upset at whoever authorized this haircut (1996)",
        "score": 640,
        "url": "https://i.redd.it/lowzrvtuh08d1.jpeg",
        "content": "",
        "num_comments": 65,
        "comments": [
            "We all had bad hair in the 90s, babe",
            "That fly outfit more than makes up for it.",
            "What is that demonic box you’re playing with?",
            "you win the prize for most interesting toy though",
            "It's adorable",
            "My mom brought her photo albums to give to me a year ago. She pulled out one picture and asked...\n\"Did I give you this haircut?\"\nI said yes. \nShe apologized...",
            "It’s the “sitcom kid” hairdo!",
            "Are you playing with one of those things the Ghostbusters used to store their captured ghosts in?",
            "You shouldn't be! Cute 😍",
            "My 3 year old currently has the same hair cut 🤣 but it’s because she did not start growing hair until after age 1 and then refuses for me to put it in a ponytail so I had to cut bangs.",
            "You seem to be having fun, but I’ve never seen a child’s toy quite like that before.",
            "Yah, totally blame mom",
            "My mom gave me a Mrs. Brady haircut at the ripe age of 4…. A stylish mullet for a 4 year old girl. The 80s and 90s were a wild time for hair.",
            "Someone was a John Denver fan!!",
            "You look like a tiny Dr Who",
            "Everything seems like a good idea until the dopamine dies down, but who had time to think twice about anything when sleep is for the weak?!\n\nStraight lines! Bright colours! Polyester everything, unless it's spandex! Flashy lights in all the colours, plus lasers! Big up, but not big out. Matchy-matchy and tighty-toighty ONLY. Boom boxes over backpacks, tracksuits over trousers, crimping over curling. Walking is out, and rollerblading is **in** dudes and dudettes!\n\nNo time to cut hair - grab a bowl, get it done, and you go girl!\n\nCocaine's a hell of a drug...but never more than it was in the 80s. We're just lucky so many survived to tell the tales.",
            "Kids have a lot of opinions at this age and flail. Haircuts are hard.",
            "Maybe, but that windbreaker is bangin'!",
            "Not to hijack your post, OP, but here’s [me](https://imgur.com/a/KeTpF8l) as your sister-from-another-mister in ‘97 🤣",
            "That looks like the smile right before the baby realizes Kevin is not on the plane.",
            "That's a cute hair cut for a toddler. Do you still have this haircut?",
            "It’s perfect and I love it!",
            "Whomst amongst us didn'tst have a bowl cut at one point in our childhoods?",
            "Aww you're so cute <3",
            "It was badass AF back then. I only wish my parents had approved of those shenanigans. Instead, my big bro got a perm.",
            "“The wind didn’t stand a chance”",
            "It was the times.",
            "It's cuz you WOULDN'T BE STILL!!",
            "Oh but how cute you were!",
            "What's the most you ever lost on a coin toss?",
            "That jacket tho… that’s some high quality shit",
            "I had THE exact haircut at this time LOL",
            "hoooly crap i had that exact same box and completely forgot about it until now, all those different latches were soo satisfying to play with",
            "Think we could file a class action lawsuit?",
            "Forget the hair, I'm too busy being jealous of that windbreaker and the box!",
            "It was the law back then",
            "You're super cute!! \nI thought your hand was in your shoe at first😂",
            "You're super cute!! \nI thought your hand was in your shoe at first😂",
            "Certified drip tho.",
            "So freaking precious. It’s a whole vibe!",
            "Oh my god you were the cutest little mushroom in the patch!",
            "Slick jacket!",
            "You looked like Robert Irwin did as a kid",
            "Damn, that’s so cute",
            "Almost obligatory at that age for kids with straight hair! The main concern is just to get it out of their eyes when it annoys them. Snip the fringe and done. They won’t sit still for much longer than that anyway…..",
            "It was congress, between 93 and 98 there was mandate that all children under 10 have ugly hair. It only ended when the \"shaved head with two inch bangs\" thing got too popular",
            "The jacket though!!!!",
            "So CUTEEE",
            "P sure Oliver Tree stole this look",
            "I came to say this! Not surprised it was the first comment I saw lol I had this cut myself for a few years. My mother cut it as well. A lot of our mother's probably cut our hair!",
            "Also those bright as hell windbreakers!",
            "In the 70s and 80s too. We just don't know what to do with our hair. It's our faith as mankind.",
            "that is the quintessential 90s wind breaker with those classic color combo!",
            "There’s my people! You literally took the words out of my mouth. I was like, “fuck the haircut, what parent posed you with the lament configuration??”",
            "Ha! It's used to teach fine motor skills",
            "It’s just a toy that teaches children different locks. It’s good for fine motor skills.",
            "It's a box with all kinds of locks/door knobs/sliding bolts/etc for mechanical play",
            "It looks home made by a loving parent, perhaps.\n\nMy brother loved flipping switches when he was a kid, so my dad made him a board with different types of switches, that turned on lights, and made sounds, to keep him occupied, and stop him from flipping the light switches in the house on and off.",
            "My daughter would love this lol",
            "I was just telling my niece the other day that my mom cut my hair when I was a kid! Lol too funny",
            "I used to cut my toddlers hair likes this. It was just a few years ago. It's practical, easy and affordable.",
            "OG fidget box",
            "It slightly blows my mind they aren’t aware of them. They’ve been around forever. They also make books with strings to tie different knots. They had all different types of learning toys like this when I was a toddler in the early 90s.",
            "I remember once she was cutting it and then suddenly said, \"Oh no...... Uuhhhhh.... Go grab a hat and meet me in the car.....\" She took me to a professional and never cut it again lol I think I was maybe 12/13, somewhere around there. I ended up having to, not shave exactly, but cut the back of my hair really short, like a boy cut, with longer bangs in the front. Not quite the \"Karen\" cut.... Being from the 90s I am SURE you know what I mean!"
        ]
    },
    "An Cringeworthy Photo Shoot For A Hairdressers Back In 1971.": {
        "title": "An Cringeworthy Photo Shoot For A Hairdressers Back In 1971.",
        "score": 909,
        "url": "https://i.redd.it/2cp7lfrmay7d1.jpeg",
        "content": "",
        "num_comments": 82,
        "comments": [
            "Looks like handsome squidward...",
            "Kind of looks like that woman from Shrek that works at the Poison Apple",
            "I'm kinda getting Rocky Balboa as the Bride of Frankenstein vibes here.  I hope that's not hurtful.",
            "The photos were taken by a gay couple i used to be friends with back then. They owned a hairdressers near where i lived. The photos were in the shop window for about a year. I got a lot of flack from my friends as you can imagine and my family remind me of these pictures regularly.",
            "Looks like a bodybuilding nanny",
            "Marge Simpson's much less well known brother, Mortimer",
            "\"Maw, Imma get the tamatoes\"",
            "Wow. How did this even happen? It’s like a helmet.",
            "Ah, the Gentleman Beehive. Very distinguished.",
            "Eraserhead's cousin",
            "Who is this guy? He's just beautiful 😍",
            "what are you",
            "I mean, I'd look pissed too if I got that hairdo",
            "A young miss Trunchbull",
            "Never go full Saiyan",
            "\"I called this one, Fireball.\"",
            "When you wanted an Afro but you’re white",
            "Why doesn't that woman have a shirt on",
            "Sarah Huckabee Sanders",
            "lol you look so mad though I love this",
            "[https://dreamworks.fandom.com/wiki/Doris?file=Doris.jpg](https://dreamworks.fandom.com/wiki/Doris?file=Doris.jpg)",
            "You’re so mad about that hair, huh?",
            "Magnificent head of hair",
            "This style somehow evolved into the feathering we did in the mid 1980’s.",
            "Got that Dark Hadou/ Akuma energy going on.",
            "Jason Segal !",
            "She looks nice",
            "the fact that there is no shirt is worse than the hair, imo",
            "I can just feel this person got older and started making comments on the hairstyles of today",
            "Some of these comments are going to put me in the hospital lmfao 😂",
            "Like a hot Arnold Horshack",
            "Guido",
            "You looked like an Ancient Greek statue but with the hair slicked back slightly.",
            "Gene Simmons does not look happy",
            "That spot also kind of looks like a tear..",
            "OMG, that is a man?! I genuinely thought I saw a female, albeit a very ugly specimen.",
            "if this was in colour and you were facing more forward it would feel like a [thispersondoesnotexist.com](https://thispersondoesnotexist.com) image",
            "Weren't you in Mr Kotter's class?",
            "Dollar store John Travolta",
            "you just made me think of this one niche bo burnham moment \n\nhttps://ibb.co/hDDW6pr",
            "The Original Bowlcut",
            "This is someone’s mum",
            "This is ex NZ prime Minister John Key",
            "That's a male hairstyle???",
            "Dear god",
            "[Buddy Pine](https://static.wikia.nocookie.net/disney/images/9/96/Profile_-_Syndrome.png/revision/latest?cb=20200926220437)",
            "Le helmet",
            "An model did not look the good.",
            "Brooklyn?",
            "Snappy headline",
            "The original Blue Steel look",
            "She doesn’t look happy about it",
            "Like a Robert Crumb comic character.  Nice.",
            "A young Chris Penn auditioning for Fame.",
            "The “wolf man blowout”",
            "Young Frankenstein, 4 years early",
            "Gene Simmons.",
            "A not An.",
            "All I can see is Gene Simmons",
            "It's really very similar. You got it right off the top of your head",
            "I'm glad I'm not the first or only person to see that.",
            "😂😂😂 best episode",
            "Doris! I was thinking the same thing 😂😂",
            "Not hurtful.I would say that is pretty accurate.",
            "How old were you there? This pic makes you look about 25-30, but I’m guessing you were much younger.",
            "I’m sure your friends appreciated it and you tho and you can appreciate the funny memories with it thanks for sharing :)",
            "Nanny McSwole",
            "Helga.",
            "Genius.",
            "bahahahahha",
            "More like a Royal Guard at Wesminster or wherever the queen now king live in London.",
            "My first thought was Heat Miser with that hair",
            "Ah yes the lady Diana hairdo. I've hated that hairstyle since it's heyday. That and Rod Steward rooster mullet are the worst crimes against hairstyling in recent history.",
            "But there IS a chain.",
            "A handsome woman.",
            "Shine on, you magnificent hunka-hunka-burning love!",
            "I was 17 in the picture. There are some other hairstyles they done on me that day. But this is by far the worst.",
            "I SAID ITS NAP TIME",
            "Farrah Fawcett.",
            "lol thank you!",
            "One, two, three, annnnd sleep…",
            "You will go to sleep or I will PUT you to sleep."
        ]
    },
    "2007 - 2024": {
        "title": "2007 - 2024",
        "score": 1040,
        "url": "https://www.reddit.com/gallery/1dkshxs",
        "content": "",
        "num_comments": 60,
        "comments": [
            "Edward Scissorhands",
            "Take away the hair and you’ve barely aged.",
            "I like your smile.",
            "Nine Inch Bangs",
            "2007: Mom, this isn't a phase. This is me!\n\n2024: Wow, my emo phase was cringe! I'm a happy, functioning, normal adult.",
            "Wow",
            "Beautiful eyeballs!",
            "The dead souless look in the eye really gives the portrait ambiance.",
            "This looks like a computer generated suspect from the 90s. \n\n“He had emo hair”\n\n*Picture morphs*\n\n“That’s him”",
            "Wow it took nearly 20 years to remove that wig, glad you made it king, keep it up",
            "I thought this was baby Matt Smith",
            "I'm going to guess your heart was in Ohio when this was taken",
            "senses fail enjoyer vibes",
            "From scissor hands to Daniel Craig.",
            "We would have got along in 2007",
            "The blunder years are NOW! Where your style gone dog? You let the dream die.",
            "I went to HS with you I believe.",
            "What a glow up. Definitely a blunder, lol.",
            "[removed]",
            "Cringe teen to Russian face.",
            "I am absolutely the female equivalent 😂",
            "THE FRINGE GAPS PAIN ME!!! I HATE HAVING THOSE",
            "So, which year was the blunder??  😂",
            "Looks like Hans Moleman",
            "I wish my Harley came with a seat belt!",
            "Today you look like you know where a gun is hidden, and that gun was used in a shooting.  You may have done it, but you know about it.",
            "RIP",
            "Dear god…",
            "📌",
            "I kept wondering why you looked so familiar in the ‘07 pic and who you remind me of… then I realized that literally all my emo friends looked the exact same back in the day. Male or female, everyone had the same haircut lol",
            "Y’know, the thing about a shark, he’s got lifeless eyes, black eyes, like a doll’s eyes.",
            "You always had nice eye. Glad to see the other one matches it.",
            "So how much did you worship Tom DeLonge?",
            "Now looks like a more in shape Luca Doncic.",
            "Same vibe tbh",
            "Looks like emo Dreads",
            "Lmfao",
            "You can take the boy out of emo, but you can’t take emo out of the man lol",
            "Hide the lighters and matches",
            "You still look like you're going to kill and dissect neighborhood pets, just a tad less conspicuous than before. Like 4% less. The eyes are the other 96.",
            "[removed]",
            "Edward macaroni fork (damn, I’m old)",
            "Once an emo boy always and emo boy",
            "Honestly, the only thing that’s changed is the hair 😂 my playlists look pretty much the same.",
            "Yeah whoever took the photo did me dirty",
            "It’s been a downward spiral ever since",
            "Yeah I was blessed with my dad’s psycho eyes. Everyone thinks I have a problem with them.",
            "[removed]",
            "Considering you said you are from Australia, any chance you are a parkway drive fan? Cause I get that vibe from you",
            "I know so many friends who are just like you. The only thing that’s changed is their hair and most the piercings are gone.",
            "Linkin Park rules!",
            "I was just teasing.  😂 That 2007 haircut was something…..",
            "Absolutely love parkway. Saw them in a YMCA for $8 back in the day. \nJust paid over $100 to see them in a couple of months in an arena.\nNot a massive fan for their newer albums but I’ll always have love.",
            "I’be got so many mates that used to have stretchers and now they just have dirty big saggy holes left in their ears lol.",
            "r/usernamechecksout",
            "I saw them back in the day in I think it was a town hall and I dont remember who the support was but I remember them doing a heavier version of bulls on parade which was pretty awesome.",
            "I saw MCR for 15$ back in the day, with Alkaline Trio ,Reggie and the Full effects and strike anywhere as the headliners. The price of their tickets nowadays makes me sick.",
            "That’s the grossest isn’t it"
        ]
    },
    "Cake day blunder": {
        "title": "Cake day blunder",
        "score": 499,
        "url": "https://www.reddit.com/gallery/1dkd6ex",
        "content": "It's my cake day today, just wanted to re-post the best picture of prime me since its been a few years. You're welcome. Also a picture of me today to know I've made smarter choices. ",
        "num_comments": 26,
        "comments": [
            "He bangs!",
            "tf…. first thought someone scribbled on the photo XD",
            "Ole sketti bangs",
            "Ok, I’m a little upset I can’t view the second pic.",
            "Here is the second picture. Not sure why it didn't load.\n\nhttps://i.imgur.com/XespYGS.jpeg",
            "Cant see the current pic, assuming you still have Maruchan instant lunch bangs",
            "Enough frosted tip to open a Cinnabon.",
            "Happy cake day 😉",
            "Was your stylist MS Paint?",
            "Love the hair! 🤣",
            "You can only get that color with stale urine.",
            "Period",
            "That looks really bad",
            "That is one serious blunder",
            "The early 2000s evolution to perfect emo hair was a long and winding",
            "I legit thought you photoshopped this photo and did a really bad attempt at blocking your face.",
            "100% same. Took me a minute and a zoom in to understand.",
            "I thought it was MS Paint, but pretty much same.",
            "Yes! Came to the comments just for this!",
            "Same! I was convinced it was yellow highlighter or something. 😂",
            "View comment I made.",
            "Did you choose that, uh, *creative* hairstyle to distinguish you from your twin?",
            "A glow up so nice you did it twice!",
            "Nope, just young me with angsty bangs",
            "100%",
            "Same story with the lip piercing?"
        ]
    }
}