{
    "Quer ser moderador de uma comunidade brasileira? Está criando a própria comunidade? Leia este post": {
        "title": "Quer ser moderador de uma comunidade brasileira? Está criando a própria comunidade? Leia este post",
        "score": 37,
        "url": "https://www.reddit.com/r/brasil/comments/1djiyxl/quer_ser_moderador_de_uma_comunidade_brasileira/",
        "content": "Como estão todos? Esse post é para chamar a atenção para comunidades brasileiras que estão precisando de moderadores.\n\nPara quem tiver interesse, vocês podem conferir uma lista delas no r/precisodemods e, para tornar as coisas mais simples, vamos destacar algumas aqui. Essa lista inclui subreddits que já possuem moderadores, mas estão em busca de novos membros para se juntar à comunidade. Além disso, você também pode dar uma olhada no r/AdoteUmSubreddit, onde encontrará subs que estão atualmente sem moderação.\n\nSe você está interessado em ser um moderador, mas não sabe por onde começar, o r/modsbr é um ótimo lugar para explorar, ou então, entre em contato com a u/amazonika aqui no Reddit. Ela vai poder ajudar. Mesmo que os subreddits listados já tenham moderação, se você estiver interessado em algum deles, a u/amazonika pode te auxiliar a entrar em contato com os moderadores ou até mesmo a recuperar uma comunidade que não está sendo devidamente moderada. O mesmo serve para se você tem vontade de começar uma comunidade do zero e precisa de ajuda.\n\nÉ isso! Seguem alguns exemplos de sub atualmente procurando mais moderadores:\n\nr/MarketingDigitalBR\n\nr/AgiotasClub\n\nr/amigosimaginarios\n\nr/HojeEuAprendi\n\nr/QueFofo",
        "num_comments": 13,
        "comments": [
            "Agiotas Club. Parece que achei meu lugar.",
            "ganha salario minimo e VR?",
            "Eu tenho umas comunidades e sou só eu. Tô doido perdido.",
            "Agiotas Club que sonho..",
            "Olá. Fique pensando...\n\nQual a ideia de ser mod de um sub? Ou, o que essa experiência pode oferecer de volta?\n\nValeu.",
            "[removed]",
            "vou dar uma olhada, sempre tive vontade ter ser mod de algo especifico",
            "r/biologia",
            "ahahaha mesmo?",
            "KKKKKKKKKKKKKKKKKKKKKKKKKKKKKKKKKKKKKKKKKKKKKKKKKKKKKKKKKKKKKKKKKKKK",
            "Sua mensagem foi removida devido a não adequação as regras de civilidade. \n\nO r/brasil exige interações respeitosas entre os usuários.",
            "Se quiser falar sobre me chama no chat :)"
        ]
    },
    "Porão dos jogos - O que você tem jogado?": {
        "title": "Porão dos jogos - O que você tem jogado?",
        "score": 0,
        "url": "https://www.reddit.com/r/brasil/comments/1dl62tb/porão_dos_jogos_o_que_você_tem_jogado/",
        "content": "Reservado para jogos, físicos ou virtuais, PC ou console, free-to-play ou tradicionais. Compartilhe! Se for possível, faça uma pequena resenha sobre o jogo, ou explique o jogo. Também destaque o nome do jogo em \\*\\*negrito\\*\\*. Caso queira mencionar spoilers, use \\`>!um spoiler aqui!<\\`.\n\n&#x200B;\n\nTambém convidamos vocês para conversar sobre jogos no r/gamesEcultura, r/rpg_brasil e no r/tabuleiros.\n\n&#x200B;\n\nAlém disso, também convidamos para conhecer o nosso canal no Discord [clicando aqui](https://discord.gg/rbrasil)",
        "num_comments": 19,
        "comments": [
            "DLC do Elden Ring.",
            "Disco Elysium, to perdido no começo ainda. Mas gostei bastante do estilo de monólogo interno afetado pelos seus status, igual RPG em geral e BG3.",
            "Fear & Hunger 1 e 2. Jogos muito bons, com temáticas pesadas. Se deixar de lado a parte de que são meio bugados (jogo raramente fecha do nada), é uma experiência bem única e desagradável (no bom sentido). Recomendo pra quem gosta de dificuldade, de survival horror (é de RPG Maker, mas é desse gênero) e de jogos que não te deixam em paz.\n\nAs temáticas incluem tortura, gore e a palavra de 7 letras que começa com \"es\" e termina com \"pro\". Mas até tem como baixar mods pra censurar.\n\nEdit: Por falar nisso, se alguém já jogou, eu terminei uma run somente com armas de fogo do F&H Termina, matando todos os inimigos do jogo e sem nenhum aliado ou ghoul. Infernal, mas satisfatório pacas.",
            "Atualmente tenho jogado no meu Miyoo Mini Plus:  \n  \n- Game Boy Advance: **Pokémon Unbound**, **Pokémon Pinball Ruby & Saphire**  \n- Pico-8: **Combo Pool**, **Breakout Hero**, **Pinballvania**, **Marble Merger**, **Bubblegum Spin**, **NEMO**  \n- Nintendo DS: **Mario Kart DS**",
            "minha obsessão por sci-fi me fez instalar Starfield, e puta merda, a qualidade técnica do jogo é horrível. simplesmente podre.",
            "Finalizei Final Fantasy XIII-2 ontem e agora voltei pro Robotics;Notes DaSH (que havia dado uma pausa) como parte da minha maratona das VNs da franquia SciAdv. Considerando que dia 28 sai o Early Access  do FFXIV Dawntrail, e considerando que só falta finalizar umas rotas do Robotics Notes e qje não tenho ainda o Anonymous;Code comprado, vou jogar alguma coisa da Bethesda no meio tempo entre finalizar R;N e o lançamento do Dawntrail",
            "Um pouco de wow, baldurs gate 3, uma pouco de assassin creed(estou re-jogando a trilogia do Ezio)",
            "No Man's Sky, Total War Warhammer III e Victoria 3.",
            "Dark and Darker",
            "To jogando Fortnite. Já tinha jogado anos atrás e peguei de novo porque to mexendo na UEFN, mas o joguinho é viciante mesmo. Esses dias quase comprei uma skin de Star Wars de 60 reais 🤡. Felizmente me resta alguma sanidade.\n\nTambém to jogando o Resident Evil 4 original. Sempre zero pelo menos uma vez ao ano, geralmente por essa época.",
            "Estava jogando Ghostwire Tokyo, mas acho que vou pausar pela dlc do elden ring",
            "**Immortals Fenyx Rising**. \n\nHá quem diga que é um clone mal-feito de *Zelda: Breath of the Wild*, mas embora as influências de *Zelda* sejam óbvias, eu diria que a estrutura de *Immortals* está mais próxima de jogos como *Banjo-Kazooie*, *Super Mario 64* ou o *Tomb Raider* original, mas em mundo aberto. O mapa é dividido em sete grandes regiões, e cada uma é subdividida (embora não explicitamente) em pequenas \"galerias\", áreas ligadas a alguma lenda, evento ou personagem da mitologia grega, com estátuas, murais, monumentos, etc. Cada galeria é recheada de desafios que, muitas vezes, têm algum tipo de conexão com o tema. Uma área dedicada a Odisseu, por exemplo, pode conter um desafio de arco e flecha que envolve atirar uma flecha através dos buracos de cabos de machados. \n\nO jogo em si consiste em passear pelo mapa resolvendo os puzzles e completando os desafios de combate/plataforma de cada galeria. Conforme você completa os objetivos, os narradores (Zeus e Prometeu) contam histórias da mitologia grega ligadas à área em que você está.\n\nEu adoro isso, pois traz uma atmosfera de \"parque temático\" para o jogo, embora seja algo que muita gente criticou. É um jogo bem casual, totalmente diferente de um *Zelda* ou *Elden Ring* da vida. É ideal para sessões curtas, fácil de pausar para zerar outra coisa e retomar depois de dias ou até meses.",
            "Minha vida e tempo fora.",
            "O mesmo aqui. Joguei umas 2 horas e acho que não vou continuar não.",
            "Esse R;Notes é bom? tenho ele no backlog tem uns anos mas nunca comecei por achar que vai ser bomba.\n\n  \nFora isso, Dawntrail é o que importa, to dropado de jogar qualquer coisa até lá.",
            "Sim é, e no caso eu tô jogando a sequel, o que você quer é o Robotics;Notes Elite mas ele requer ter jogado Chaos;Head Noah e no mínimo assistido o anime de Steins;Gate pra tirar o máximo proveito dele. E o anime de Chaos;Head é ruim btw. Só se atente ao fato de que ele tem um começo lento, os primeiros caps são mais puxados pra slice of life e construção de mundo.\n\nDe resto, também pegue o patch do Commitee of Zero (isso vale pra qualquer sciadv btw), não sei se pode postar link aqui então é melhor ir atrás pelo google, é o site cuja URL vai formar a frase sono me dare no me se tirar os pontos. Conserta bugs e melhora a tradução e a consistência de nomes com o resto da franquia. Eles também tem um guia para as rotas.\n\nE eu não sei bem como é o seu background, o que curte ou não, então acho melhor botar o aviso genérico de que é uma visual novel. É basicamente um livro interativo, muita gente já acharia que não é bom só nisso.",
            "nnn eu já joguei chaos;head e stein;gates, eu não assisto anime...\n\neu to jogando subahibi no tempo livre do final de semana e to pretendendo jogar fata morgana quando terminar, tenho bastante vn comprada na steam, steam deck virou praticamente um livro\n\n  \n> E eu não sei bem como é o seu background  \nEu sou bem casual com VN, comecei pra lá de 2010 com danganronpa/999, são duas séries que eu acompanho, mas ja joguei stein, chaos;head, clannad... to tentando aumentar o catalogo principalmente de jogo mais antigo, talvez eu jogue higurashi um dia... por ai vai, eu perguntei se valia a pena pq ele me parece um jogo mais recente da sciadv e pelo review que eu li parecia meio bomba",
            "O pessoal só pega mesmo é no pé do Robotics;Notes DaSH, tem até review mista na Steam. E como tô jogando agora, yeah,  ele tem problemas e entendo muito bem todoa os problemas que as pessoas podem ter com ele. Esse também é o que você referemciou como \"moderno\", é até o penultimo jogo lançado, o mais recente sendo o Anonymous;Code.\n\nJá o Robotics;Notes Elite, que é o terceiro jogo da SciAdv, seguindo Chaos Head e Steins, é muito bom e é muito bem avaliado por todo mundo que jogou. Em questão de qualidade, pode ir sem medo no Elite.",
            "Vou jogar nas férias etão, eu tenho o elite e o dash, paguei uns 30 reais uns meses atrás no bundle deles."
        ]
    },
    "Só a nata": {
        "title": "Só a nata",
        "score": 138,
        "url": "https://i.redd.it/ak6tiyef438d1.jpeg",
        "content": "",
        "num_comments": 122,
        "comments": [
            "5\n\nQuem não gosta de ouvir as mentiras do Velho Vampe!?! kkkkk \n\nO Luva não sabe mais do que três frases, não acho que ele falaria por muito tempo.",
            "O número 5 é a escolha mais racional desde que não exista vampetaço fora da internet",
            "Depois do número 4 é o Joselito sem noção?",
            "Do lado do Luva, ele não sabe conversar, deve se calar em menos de 15 minutos.",
            "Cássia kiss e Luciano hulk são as aero moças",
            "Não acho que o Regis Tadeu ficaria conversando. Com certeza ele colocaria um fone de ouvido pra não conversar e nem escutar ninguém. \n\nMas eu indicaria Manowar pra ele ouvir durante o vôo e saber mais sobre a banda e deixar de ser um palhaço que não conhece Manowar.",
            "5 e trocaria uma ideia com o Vampeta",
            "Meu Deus...Régis Tadeu e Gilberto Barros parecem as melhores companhias diante de todo resto.",
            "Na turbina",
            "Nesse vôo aí eu prefiro ser sugada pra fora",
            "5 é tankável",
            "Não conheço ninguém e durmo em qualquer lugar,  \n\nTanto faz",
            "3",
            "5 é a única resposta possível.",
            "3 pq Felipe Neto é ok e não conheço quase nenhum outro",
            "Aham, tá. Mas responde uma coisa, OP. Quem tá pilotando é o Celso portifólio?",
            "5...unanimidade! 😁",
            "Sentaria ao lado do Vampeta e chutaria o banco da frente o voo inteiro. ",
            "Nesse voo eu abriria a porta do avião e pulava.",
            "MeoDeos. se eu estiver a bordo vou da um jeito de derrubar o avião.",
            "5 tambem, melhor lugar o Luva vai repetir uma ounduas frases e o vampe vai contar historias de veracidade duvidosa e boa",
            "Bom saber quw o 5 é unanimidade",
            "20h so mamjando  o vamp",
            "4 ou 5 não tem escapatória kkkk",
            "Do lado de fora do avião, por favor.",
            "atiro o Pablo Marsal pela janela e sento do lado do caneta azul",
            "5. E pago bebida pro Vamp pra ele soltar as histórias",
            "Ia falar 3, mas vi m4rç4ç do lado. acho que o 5 é viável.",
            "Prefiro ir na asa do avião.",
            "Alexandre de Moraes",
            "Tem direito à fones de ouvido e álcool?...hahahah",
            "Perderia o voo",
            "Qualquer 1. So dormir que qualquer um se torna toleravel",
            "Fácil. 5",
            "Só falta falar que o Faustão é o piloto e paulo Kogos o copiloto. Juntou a nata das chatices em um só lugar.",
            " forte no 5",
            "Sento na cabine do piloto e me preparo para realizar o 9/11 brasileiro",
            "5 com tranquilidade. Vampeta deve ter muita história \"de pescador\" pra contar.\n\nOs outros eu nem sei quem é metade deles.",
            "2 fácil!",
            "6\n\nTeorias da conspiração e Anabolizantes... A melhor perca de tempo!  \n>! (Pra quem gosta dessas coisas: Tô so brincando..) !<",
            "Prefiro ir no trem de pouso.",
            "2 \n\npra nao correr o risco de ouvir a voz do monark\n\nembora exista o risco de ouvir o vinheteiro",
            "3",
            "4",
            "Nando moura é o número 3 ou o número caneta azul?",
            "4",
            "2 ou 5 só pra ficar o mais longe possível do Manoel Gomes\n\nedit: acho q vou de 2 msm pra ver o Nando e o Nelipe brigando kkkkkkkk",
            "Eu escolheria 2\n\nPorém tem uma vasta gama de estratégia para os outros lugares\n\nPor exemplo se eu sentar no 5 (vorrrrta) eu consigo dar tapas no fneto?",
            "Meu Deus",
            "Depende... pra onde é o vôo?",
            "Tô inclinado a ir no 3, mas não sei quem são os da esquerda. É o Pablo Marçal?",
            "com Regina Duarte e Antonia Fontenelle na cabine de comando",
            "6",
            "Com meu fone de ouvido com bateria 100%? Qualquer assento, mas o 5 é provavelmente o menos pior.",
            "Que avião é esse com cinco fileiras e sem corredor? Dito isto, 5.",
            "Eu abriria a porta de emergência e pularia do avião kkkkkk",
            "Mn pq o ( 6 ) não pode ser entre o Bambam e o Kid 😩\n\nTbm seria massa sentar perto do Joselito e ver ele descer a porrada no Felipe Neto e no Vinheteiro qd começarem com palestrinha.",
            "Tem gente pagando 120 mil pra ficar um voo ao lado do charlatão, e a gente aqui escolhendo qualquer coisa pra não ter nem perigo dele abrir a boca KKKKKKK",
            "Eu passaria o voo todo no banheiro",
            "2 é o pior assento, o Nando Moura ia encher o saco do Felipe até o final do vôo.\n\n5 ainda pegaria resquícios da discussão.\n\n1,3,4 teria que ficar escutando as histórias de pescador do Pablo Marçal.\n\n\nAcho que sentaria no 6.",
            "Derrubava o avião",
            "Caralho hahahaha parada dura",
            "4 joselito e o menos nocivo",
            "Se pudesse usar um fone com cancelamento de ruído, 6.  Ia maratonar Senhor dos Anéis versão extendida e o Hobbit no volume máximo.",
            "Ahh 4 ou 5 né, imagina escutar as histórias do joselito",
            "Sentar o Vinheteiro na porrada é uma opção?",
            "Asa do avião",
            "na saída de emergência pra eu pular mais fácil.",
            "4 ctz heeeheheheheehhehehehhe",
            "Ninguém escolheu o 1, que provavelmente são os únicos que vão calados no vôo.\nBom pra dormir",
            "Por incrível que pareça, 6. O pessoal de trás (sim, até a porra do Monark) são mais tranquilos e tem mais chance de colar o Monark. É só fazer o Monark não falar de política e está de boas.",
            "3 é, não ironicamente, o inferno",
            "Assento 1, ainda cantava KASSINÃO com Gilberto para o tormento do Régis.",
            "Ô bolo de cenouro, qual o problema do Toninho Tornado? Literalmente um dos melhores comediantes de pegadinhas que a gente tem desde o falecimento do Marquinhos (que Deus o tenha).",
            "6, se tá no inferno, senta na pica do capeta",
            "Sentaria do lado do Regis (1) e finalmente descobriria o porque do Pink Floyd nao ter tocado no Woodstock.",
            "3, se eu tô na mesma fileira do Felipe Neto, eu tô na primeira classe. Ele e o Maurício tem cara de que iriam ficar quietos com cara de cu o voo inteiro, melhor tipo de passageiro.",
            "5 sem pensar duas vezes.",
            "Pular do avião é uma opção?",
            "Num tem um lugar mais perto do kid não ? Pago a mais pelo acento de for necessário. 😊",
            "4 sem dúvida! Eu pagaria pra sentar do lado Joselito só pra ver ele azucrinar o otário do Pablo Marçal.",
            "Acho que o 5 é o menos pior",
            "3. Falaria que estava em dúvida sobre ser de direita ou de esquerda e começaria uma divisão entre o Felipe Neto e o Pablo Marçal. Arranjaria um jeito de distorcer o negócio falando que se ganhasse uma grana seria uma benção de Deus e o caminho certo a se seguir.",
            "Número 5, e ia tentar trocar uma idéia com o Joselito também, já que sou um grande fã kkkkkkkkkkkk",
            "Pqp. Vou na asa, do lado de fora.",
            "Desculpa manos, mas o Nando Moura é engraçado dms pra n sentar (nele) com ele. Eu vou no 2",
            "Daí o menos pior é o Monark",
            "1.\n\nEu curto muita música experimental. Bota um death grips e eu tenho certeza que o regis morre de aneurisma cerebral.",
            "6 iria monarkar junto com o Monark",
            "AÊÊ KASINÃO!",
            "6 o monark é gente boa.",
            "Receba! Receba o assento 5.",
            "Mas ficaria puxando assunto com o Vampeta do teu lado, mas olhando parece ser o lugar menos nocivo para a saúde.",
            "Mas você ia ficar ouvindo o barraco entre Felipe Neto e vinheteiro na sua frente",
            "Mas eu quero sentar na poltrona 5 justamente pela perspectiva do vampetaço... ;)",
            "Exato, só fazer o luva ficar calado e escutar as histórias de futebol do vampe.\n\nFora a possibilidade de encher a cara e dar risada o voo inteiro",
            "Vai ficar bem na frente do Bam Bam griteiro. Boa sorte",
            "Sim. Possivelmente o local mais perigoso do vôo.",
            "Obs: ele vai falar um receba a cada 10 min, gritando: \"receba!!! Uuhhh, graças a Deus!\"",
            "Ahahahahhahah",
            ">Mas eu indicaria Manowar pra ele ouvir durante o vôo e saber mais sobre a banda e deixar de ser um palhaço que não conhece Manowar.\n\nBoa pedida",
            "https://preview.redd.it/zxky97ln148d1.jpeg?width=275&format=pjpg&auto=webp&s=ea47925135fbb5e33ba14409e3b182a5c64e9ede",
            "Pablo Marçal e Nando Moura são os piores nesse. Jamais consigo imaginar o Marçal calar a boca.",
            "Também acho",
            "2 é um inferno",
            "Esse é o maior problema dos brasileiros. Essa falta de senso crítico para escolher suas influências.\n\nO cara parece ser gente boa. Ele tem um perfil de gente boa. Mas é uma péssima influência.\n\nTem milhares de caras como o Monark na internt, que parecem gente boa, mas as ideias são nocivas. São uma péssima companhia.",
            "Receba! A balinha em formato de avião",
            "Bam Bam tem cara de ser aqueles moleque que vai a viagem toda chutando o banco da frente",
            "Ainda assim é menos pior do que os números 1, 2 e 3 que são intankáveis",
            "Ou seja, essa é a escolha correta. Você desafia o Joselito a fazer uma merda e o voo cai. Você morre, claro, mas vira um herói por salvar a humanidade de todos os outros.",
            "Solução B: põe um remédio de dormir na água deles. Resolvido ^ - ^",
            "Mini rolas.",
            "![gif](giphy|LcYgw3iE0oJt6)"
        ]
    },
    "Centros Comerciais": {
        "title": "Centros Comerciais",
        "score": 56,
        "url": "https://v.redd.it/ny5fnxl1z38d1",
        "content": "",
        "num_comments": 27,
        "comments": [
            "XKCD relevante\n\nhttps://xkcd.com/1138/",
            "Acho que o número no Piauí tá errado, que eu saiba aqui tem pelo menos 7",
            "Isso é voz de IA, né.",
            "Fujo de.\nShoppings sao o resultado de falta de politicas públicas para deixarem nossas areas comercias, nos centros das cidades, agradáveis para o ser humano.\nSe nossas cidades fossem feitas pras pessoas, e nao carros, esse numero seria menor.",
            "193 shoppings em sp ta doido, fui em 15 no máximo.",
            "Odeio shopping Odeio shopping Odeio shopping Odeio shopping Odeio shopping Odeio shopping Odeio shopping Odeio shopping Odeio shopping Odeio shopping Odeio shopping Odeio shopping Odeio shopping Odeio shopping Odeio shopping Odeio shopping Odeio shopping Odeio shopping",
            "12 shoppings no meu estado, qual será a definição de shopping?\n\nPor alto eu lembro de uns 5 que na capital + cidade vizinha que tem esse aspecto de shopping grande, que muita gente coloca a roupa bonita pra visitar\n\nSe levar em conta centro comerciais, pelo menos os que tem shopping no nome, o número sobe",
            "Bem isso.  Só reforçando a ideia.  \n\n\nMas, o interessante é olhar os lugares que fogem a regra, por exemplo DF.  Pq tem tanto shopping lá? Acúmulo de riqueza e lavagem de dinheiro.",
            "Isso tá certo mas tem a questão econômica também. Santa Catarina tem menos gente que Pernambuco e Ceará e tem mais shoppings, e SP tem mais ou menos 9x mais shoppings que os dois mesmo tendo \"só\" 5 vezes mais gente.",
            "Eu também acho que a maioria ali é meio estranha. \n\nNão sei se na prática há uma diferença entre estabelecimentos que são categorizados como galerías ou shopping.",
            "https://www.buser.com.br/destinos/pontos-turisticos/shoppings/pi\n\n\nSó nessa lista tá dizendo que tem os dez melhores do Piauí. Então pode ser que tem mais.",
            "Estado de SP, não só capital.",
            "Eu não tenho nada contra, nem nada a favor. \n\nJá houve uma época em minha adolescência que amava shopping, no entanto sempre me trouxe um pouco de ansiedade.  \n\nE estava conversando sobre isso com um colega no outro dia, já notou que o cinema nunca é próximo da entrada dos shoppings. Você tem que andar por três andares de comerciais até poder ver um filme caro. Não tem Ad block.",
            "Eu gosto. Moro em uma cidade que não tem nada pra fazer. Um shopping seria uma opção.",
            "Putz, um video que podia ser um mapa, aí me manda essa. Se é um centro populacional e político não foge à regra...",
            "Em Teresina, há cinco. Desses, três se encaixam na categoria de shopping center tradicional, com cinema e tudo mais. Os outros dois são mais parecidos com camelôs, mas têm boa estrutura, com elevador e escada rolante. Um deles até tem uma estação de metrô.",
            "Putz, eu ainda esqueci do Piauí Shopping Center kkk, esse também existe, mas quase ninguém vai lá",
            "to ligado, só fiquei surpreso pelo numero",
            "Teresina Shopping não tem esse problema, a entrada principal dá direto na praça de alimentação e o cinema fica bem do lado dela.",
            "Dica: todo cinema tem alguma saída alternativa (as vezes padrão) da sala, que te joga pros corredores de banheiro, funcionários, ou alguma loja maior. As vezes, eles deixam esses corredores de funcionários e etc abertos pra cortar caminho. Eu fazia isso em BH e cortava o equivalente a 7 minuto de caminhada passando num corredor que cortava vertical. Mas depois fecharam 😔",
            "No caso de Teresina é o que salva na minha opinião kkkk",
            "Pois é, e o OP claramente não entendeu a tirinha também, o analfabetismo funcional com um toquinho de teoria da conspiração exemplificado.",
            "kkkkk, pq ninguém vai?",
            "Moro em Fortaleza. Shoppings têm ar condicionado, são limpos e geralmente seguros. Daí que gosto também. Mas raramente vou hoje em dia: só costumava ir para livraria, lojas de CDs e cinemas. As lojas de CDs acabaram, quase todas as livrarias fecharam e com streaming eu raramente vou ao cinema. Maldita internet! /s",
            "Ficou anos largado, com uma estrutura péssima. Então o governo assumiu, fez uma daquelas reformas que levam séculos, e foi reinaugurado recentemente. Mas, depois de tanto tempo, as pessoas perderam o interesse. Se eu não me engano, lá só se vende roupas, tanto que o nome do lugar antes era Piauí Center MODA.",
            "Shopping pra mim é só cinema, muito difícil eu ir lá fazer qualquer outra coisa",
            "Por isso que odeio, tudo que tem no shopping eu consigo fazer em casa ou comprar pela internet. Mais barato, mais gostoso e de qualidade melhor.\n\nAté assistir um filme é ótimo no meu setup, claro que não é um imax, mas tbm não gastar um rim pra ver um filme."
        ]
    },
    "O ciclo eterno da democracia liberal": {
        "title": "O ciclo eterno da democracia liberal",
        "score": 552,
        "url": "https://i.redd.it/l7ww79sesz7d1.jpeg",
        "content": "",
        "num_comments": 105,
        "comments": [
            "Eu me lembro de ter lido uma frase do MLK que seguia esse exemplo sobre a luta pelos direitos civis.",
            "Estamos vendo em tempo real a parte do centrista sem inspiração que se recusa a dar um jeito nos problemas sociais causados pela gestão anterior mesmo tendo prometido mudanças, uma parte considerável da população considerando eleger mais direita pensando que com isso vai melhorar alguma coisa, e vamos de ciclo interminável.",
            "E eu ainda tenho que ouvir que lula é comunista KKKKKKKKKKKKKKKKKKKKKK",
            "Imagine uma mãe que diz ao seu filho adolescente: “você quer lavar a louça agora, ou em 15 minutos?”. É mais ou menos isso que o “andar de cima” está fazendo.\n\nA democracia liberal é a forma mais sofisticada de dominação já criada por uma classe. Ela legitima o exercício do poder, ao mesmo tempo em que estabelece uma estrutura burocrática que esconde e/ou despersonaliza *quem* o exerce. \n\nRevoluções surgem de insatisfações crônicas, generalizadas e irreconciliáveis com o *status quo*. As pessoas começam a se dar conta de que suas insatisfações não são *problemas* da ordem social, mas características que lhe são intrínsecas. Depois disso, é só questão de tempo até a maioria insatisfeita se dar conta de que é maioria e o sistema entrar em ruptura.\n\nO grande trunfo da democracia liberal é justamente se apresentar como uma ordem social construída pela vontade da maioria. Uma ordem legitimada pelo Estado de Direito e seu aparato burocrático, que dão um ar de impessoalidade, imparcialidade e objetividade ao exercício do poder. Com isso, qualquer ideia *verdadeiramente* revolucionária é prontamente rechaçada, uma vez que a ordem vigente se apresenta como uma conciliação dialética de vontades individuais. \n\nA ordem revolucionária é fruto de insatisfações compartilhadas que superam a incompatibilidade dos objetivos de diferentes grupos e classes sociais. A ordem democrática se apresenta como capaz de promover a conciliação desses objetivos para superar as insatisfações e, portanto, deslegitima aquilo que seria o alicerce de uma revolução.\n\nOra, se acreditarmos que a democracia proporciona uma ordem social capaz de conciliar meios-termos entre diferentes ideias, perspectivas e vontades, apenas os extremos não estariam amparados e representados por essa ordem. Os extremos, no entanto, já são irreconciliáveis de qualquer forma. Assim, qualquer ideia revolucionária é imediatamente marginalizada nos extremos e isolada da “maioria”. É por isso que, dentro da lógica da democracia liberal, a teoria da ferradura parece tão intuitiva: qualquer ordem social que subverta a “vontade da maioria” será necessariamente opressiva e autoritária. \n\nResta saber, porém, se as democracias liberais realmente são a expressão da vontade da maioria ou, melhor ainda: se a vontade da maioria pode ser conciliada e expressa numa ordem social estável e coerente. Acho que, atualmente, a resposta está mais clara do que nunca…",
            "Daqui pra frente só pra trás!",
            "Não OP, isso não é boa explicação dos fenômenos. \n\nO principal problema aí é a existência da Argentina na imagem. Mas tirando isso, muito das merdas que temos hoje em dia foram as consequências de ações tentando lidar com os problemas sociais de épocas passadas.\n\nÉ aquele negócio, toda ação tem uma reação. A gente geralmente espera pegar a coisa com menos danos.\n\nUm exemplo disso é o problema de moradia ter piorado em lugares que aplicaram a péssima ideia do rent control. Ou países fechando usinas nucleares por motivos ambientalista, o que hoje em dia está fazendo a Europa novamente dependente de carvão. \n\nAté em políticas que foram em grande parte positivas tem consequências negativas. O plano real realmente contribuiu para a desinstrualização. Algumas regulações necessárias aumentam os processos de produtos etc.\n\nQuem diz que uma política só tem benefícios está mentindo para você ou te obrigando a seguir um purismo ideológico irreal. Dá para debater se X é um ponto negativo real, mas é impossível algo não ser negativo para ninguém.",
            "Grandes corporações são as principais responsáveis pela manutenção desse ciclo. Já passou da hora de os governos serem \"bonzinhos\" e quererem negociar com o empresariado (herança dos EUA).\n\nNa China, por exemplo, o empresariado tem que \"andar na linha\", ou vai em cana (que nem ocorreu com a Evergrande). Só que isso vem a um preço alto de não ter liberdade individual alguma por lá.\n\nSerá que dá pro Brasil inventar algo novo que possa romper esse ciclo?",
            "Não tá a surgir nenhuma extrema direita no Canadá a \"extrema direita\" que tá a ganhar suporte é uma que não  se importa com casamento gay e de o manter legal.\n\nNão sei porque França tá á frente da Holanda no ciclo de extrema direita. Macron é neo-liberal ele suporta os gays e coisas do gênero por que ele suporta a liberdade de escolha mas também suporta NATO e intervenção externa tanto como a EU e o \"oeste\". \nHá um surgimento em estrema direita mas foi só nas eleições da EU á pouco tempo.E Macron não é centrista.\n\nIsto é demasiado simplista.",
            "Sim, e a solução é uma ditadura comunista que vai resolver todos os nossos problemas e o povo vai viver feliz para sempre.",
            "Leia Hegel ao invés de Marx e você vai parar de acreditar em bobagens como essa.",
            "Algumas perguntas:\n\n- O que a Irlanda está fazendo lá? Onde que a extrema direita está crescendo por lá? \n- Por que os países nórdicos que são democracias liberais não estão no infográfico? \n- Qual é a sua alternativa à democracia liberal?\n\nEdit: se o meu padrão de vida tivesse estagnado no padrão Canadense eu estaria MUITO feliz.",
            "Basicamente. E tem gente que ainda acha/acredita que Lula/PT é comunista. No máximo é centro-esquerda.",
            "Os exemplos dos países vs onde estão no ciclo está perfeito ",
            "Seu argumento derreteu com “creates fertile ground for fascism. Fat-right win elections” \n\n[Relevante](https://www.hoover.org/research/fascism-ism-left-not-right)",
            "Opinião impopular: para quebrar o ciclo, não basta eleger alguém verdadeiramente de esquerda, mas alguém verdadeiramente de esquerda que não acredite em crescimento econômico infinito.\n\nr/degrowth",
            "Pior que é exatamente isso.",
            "você já ouviu falar que a história é ciclica?",
            "Argentina tá errado aí",
            "\"A social democracia é a ante sala do facismo\"",
            "Onde está o momento em que os países reconhecem o casamento gay? Ou o direito ao aborto?  \nDistorcer os fatos para desmerecer a democracia é a coisa mais fácil que tem.",
            "O problema que não existe média de massa de esquerda, a mídia sempre vai ser dos poderosos.\n\nIsso faz com que, a centro esquerda tenha que ficar se moderando eternamente.  Organização de base vai ser isso sempre, porque a mídia é do dinheiro e no máximo ela faz concessão pra esquerda retornar algo ...",
            "Eu não entendo inglês ao ponto de conseguir ler tudo isso... fica difícil 🙃",
            "Eu li um livro uma vez sobre isso. Tem um vídeo ótimo no Youtube sobre isso tb.",
            "Eu li \"...ter lido uma frase do muleque que seguia...\" e fiquei pensando, tá, mas que muleque? Até eu perceber que era o Martinho Lutero Rei.",
            "O mais engraçado é centrista que fica \"nem Lula, nem Bolsonaro\", sendo que o centro é o Lula.\n\nAlias, Lula agora tá tendendo pra centro-direita. O novo centro é o Boulos. Centrista tem que apoiar o Boulos.",
            "Oxi, nn tava sabendo q o bolsonaro era centrão?",
            "Excelente comentário.\n\nO que eu vejo como solução para esse problema é a descentralização sistemática do poder do Estado. É muito difícil conciliar 200 milhões de pessoas, mas é mais fácil 10 milhões, ou 100 mil, ou 10 mil. Antigamente, era difícil ter essas pequenas partições de poder porque inevitavelmente a maior partição engolia as menores. Mas hoje as pessoas estão cada vez menos dispostas à violência e cada vez mais educadas sobre os horrores da guerra. É na verdade mais fácil justificar um conflito entre países grandes do que um conflito entre pequenas regiões, porque a maioria das pessoas não vai estar envolvida no conflito. Mas se uma população de 10 mil pessoas entrarem em guerra, elas vão sentir o peso dessa guerra muito mais fácil. Num mundo globalizado como o nosso, isso seria um tiro no pé.\n\nMas o problema é que ainda existe uma identificação muito forte com a bandeira. Mesmo o brasileiro médio, que critica todo dia o país, reclama quando vê movimentos separatistas. Como se houvesse uma ordem divida, ou um dever natural, que obriga certas regiões à fazerem parte do Brasil. Eles falham em notar que essa separação é benefício deles, porque eles se veriam mais representados pelos políticos eleitos, e em menos conflito durante suas vidas. Eles preferem manter por perto pessoas que claramente não querem estar perto, só para manter a ideia de \"Brasil\" intacta. Como se essa ideia tivesse algum valor que elas mesmo não conseguem expressar.",
            "Eu até tinha essa visão até entender que existe alguns grupos com poder politico extremamente grande que influencia significativamente a política brasileira ( e de muitas \"democracias\"). \n\nEmpresas vão fazer lobby pra aprovar leis que são puramente benéficas pra elas em detrimento do futuro do pais e da classe trabalhadora. Por outro lado, existem leis que seriam puramente benéficas para a classe trabalhadora e para o futuro do pais, mas que não são aprovadas por esse mesmo lobby. Essas empresas não estão interessadas industrializar o pais. Elas estão pensando em fazer a maior quantidade de dinheiro o mais rápido possível, a qualquer custo, desde que quem pague esse custo não seja eles. \n\nOs pros e contras acabam sendo secundário em comparação com as batalhas de influencia que realmente regem o pais. Alguns politicos até tem algum interesse em avançar essa bagaça, mas o que realmente melhora a vida da população brasileira é movimentação política capaz de pressionar os governantes. Mas infelizmente e devido a diversas mudanças na legislação e sócio econômicas, está cada vez mais difícil a população se organizar de forma efetiva.",
            "Cara... WTF?",
            "Mas a China só consegue fazer isso, e é o monstro que é, porque aconteceu um negócio chato em lá 1949.",
            "Off topic porém como que eu coloco o meu estado embaixo do nome? Tô procurando isso a dias mas não tô achando (ou talvez eu só seja lerdo mesmo)",
            "Eu me pergunto de onde partiria esse algo novo, nao dá para esperar absolutamente nada de político, nao dá para jogar pelas regras da democracia burguesa, as cartas já estão marcadas, o povo irá perder sempre.",
            "O governo nao negocia com o empresariado, o governo É o empresariado (e representa os interesses do empresariado)",
            "> Só que isso vem a um preço alto de não ter liberdade individual alguma por lá.\n\nTu tava indo tão bem...",
            "Tú tá usando a China como um exemplo de país que supostamente quebrou o ciclo do populismo de direita? Sério?\n\n\nA China tá lá, com um populista que governa à 11 anos já. Usando extamente as mesmas táticas de erosão do Estado que populistas de direita na Europa e nas Americas estão utilizando. ",
            "Entre todas as nações no mundo, você realmente acha que o Brasil vai inventar algo novo? Sério mesmo?",
            "> resolver todos os nossos problema\n\nVocê já parou para analisar essa sua linha de raciocínio? Conseguiriam enfiar na sua cabeça que tá melhor viver na merda que é o sistema atual porque qualquer alternativa não pode ser menos que perfeita.\n\nUm regime que mantém a classe burguesa sobre controle e foca em melhorar a vida da população? Besteira, ainda haverão problemas, ainda haverá pobres, é melhor manter o bom e velho capitalismo tardio, quem liga se as pessoas não têm poder de compra, não tem casa própria  e os serviços públicos estão cada vez mais precarizados? Se mudar é pior.",
            "Isso, só que não ironicamente ",
            "O OP falou isso?",
            "Nenhum governo vai resolver todos os problemas, a questão é quando todo mundo vê as causas do problema e a classe dirigente não resolve pq tem acordo com os setores que se beneficiam do problema. Daí a única solução é algum tipo de ruptura, um bom exemplo disso seria a revolução de 1930.",
            "Porque agora tá bom pra caralho né. China dá de 1000 a zero no Brasil, prefiro viver numa ditadura comunista e ter qualidade de vida do que numa ditadura da burguesia e vender o almoço pra comprar a janta, pq herdeiros precisam que seus tataranetos continuem ricos não é mesmo?",
            "É só ler Marx direito mesmo que dá para parar de acreditar em bobagens como essa do post",
            "> Edit: se o meu padrão de vida tivesse estagnado no padrão Canadense eu estaria MUITO feliz.\n\no sujo olha pro mal lavado e diz \"eu taria feliz se tivesse na tua posição\"\n\nPra eles, eles que tão na posição de sujo. Pare de comparar pessoas que vivem em realidades diferentes, pois elas tem padrões diferentes.\n\n>Qual é a sua alternativa à democracia liberal?\n\nDo jeito que ta indo, vai ser fascismo que vai vir com força.",
            "Depende de qual tipo de canadense você é. Do branco protestante? Uma maravilha. Do descendente dos inuítes? Esse vive na merda.",
            ">alguém verdadeiramente de esquerda que não acredite em crescimento econômico infinito\n\n\n\n\nEste alguém se chama SOCIALISTA.",
            "Deus do céu, qq porra isso tem a ver.",
            "Usa o app google lens",
            "Tem uma música sobre isso. E também uma receita de bolo que é bem boa, que leva essa temática.",
            "Eu ainda estava pensando \"a qual mlk ele está se referindo?\"",
            "Nem Lula, nem Bolsonaro. Bolsonaro.",
            "> centrista que fica \"nem Lula, nem Bolsonaro\"\n\nEsse é o famoso direita enrustida.",
            "Boulos é centrista?\nOk, if you say so...",
            "De repente o Bolsonaro deixou de ser direita e o Lula deixou de ser esquerda",
            "Brasil já passou por um período de poder de Estado sistematicamente descentralizado, como você descreve. \n\nHoje se chama de \"Primeira República\", ou \"República Oligárquica\" ou por vezes \"República do Café-com-Leite\", durou mais ou menos de 1890 até 1930, e foi um dos períodos de maior desigualdade e talvez **O** período de maior estagnação política, econômica, social e moral da história desse país (e olha que a competição é feroz).\n\nJustamente pq essa descentralização do poder não resultou em nada além de um feudalismo moderno na qual cada Barão tinha autoridade quase que irrestrita sobre o seu próprio feudo, o povo era **inteiramente** excluído do processo político, e a política nacional se tornou essencialmente um grande *country club* de latifundiários loteando o país entre si. \n\nFoi a era do Coronelismo, do Voto de Cabresto, dos partidos estaduais (Partido Paulista, Partido Mineiro, Partido Fluminense, etc etc) que monopolizavam completamente a política e formaram essencialmente uma nova nobreza tropical (ironicamente, a Primeira República deu luz a um regime MUITO mais aristocrático do que o Império que ela derrubou).\n\nE como resultado, o país ficou parado no tempo por quase 40 anos, e teve que passar os próximos 50 correndo atrás do prejuízo dessa estagnação política e econômica. O Golpe de 1930 ocorreu justamente pq o regime dos oligarcas já estava completamente insustentável, pq todos já viam que a modernização e industrialização do país **exigia** um Estado central mais forte, senão iríamos ficar presos nesse regime semi-feudal pra sempre.\n\nEntão não, cara, não seria uma solução muito boa não.",
            "É um bom argumento, realmente esses casos são raízes mais comuns de problemas sociais do que eu citei. Mas eu falo isso porque geralmente esse posts geralmente caem facilmente em um rodinha de \"OP está 200% certo e é isso mesmo\", sendo que tem nuances. E é melhor uma crítica fundamentada do que um críticas desonestas ou simplesmente comentários ainda mais rasos de simplesmente concordar. \n\nMas é, concordar com o que você falou em quase 100%. Mas ainda assim é bom entender que o nosso lado ainda assim pode errar propondo políticas com muitas desvantagens, mesmo tendo boas intenções. O meu comentário também serve de alerta a soluções que usam de \"boas intenções\", mas são caixinhas supresas para o que tu falou (Novo Ensino Médio).",
            "E segue forte assim por causa de eventos chatos como o de 1989",
            "Puta negócio chato aquele lá meu",
            "Pois é.. aqui a gente teve um em 64, mas primeiro, era a mando dos EUA, e principalmente, milico é incompetente e corrupto, não fizeram um projeto de país",
            "r/brasil - ícone com 3 pontos na vertical - alterar 'flair' de usuário\n\nEu só fiz isso em r/carros e r/futebol.",
            "Ué, um país que bloqueia a Wikipedia a base de firewall tem liberdade individual?",
            "Quais táticas? Dê alguns exemplos por favor das táticas populistas de erosão do estado que o Xi usa.",
            "Populismo é um termo sem significado algum. E pra sua informação, o Xi Jinping não governa sozinho, MUITO longe disso na verdade.",
            "É o melhor exemplo. Os avanços sociais lá são inacreditáveis. Ninguém diria que o povo de lá em menos de 100 anos alcançaria o que alcançaram em termos de qualidade de vida, e ainda tem muito pra correr atrás.\n\nSe comparar como se fossem pessoas não é como um classe média ficar melhor de vida, é literalmente um mendigo, que vive a vida fodido, ficando tão rico quanto o cara que já era rico há séculos.",
            "Ué, porque não? Brasil já foi líder mundial em diversas questões, já botou medo nos estados unidos no século passado tanto que EUA teve que intervir \"para não ter outro Japão do mesmo lado do mundo\", segundo o próprio kissenger. O Brasil é o país do futuro, basta a classe trabalhadora entender no seu papel histórico e seu passado que podemos nos libertar do imperialismo que nós fode e com isso libertar a América Latina inteira e abalar o mundo. O Brasil e seu povo, não nossos governantes, é terra de gente que lutou muito e teve várias vitórias e esteve muito avançado em diversos momentos históricos, mas a ideologia dominante nos fez esquecer isso.\n\nEsse viralatismo é muito sem sentido.",
            "Inventar algo novo?\n\nNão precisa inventar algo novo, basta deixar de seguir o neoliberalismo.\n\nSó isso.\n\nA solução é fácil: \n\nO estado investe na saude, na educação, na industria, na ciência e na tecnologia.\n\nO povo com saude e educado, vai trabalhar e ganhar bem numa industria que cresceu, gerar novas tecnologias pro país, que por sua vez mais ficar mais rico, pegar o dinheiro e recomeçar o ciclo.\n\n^((e antes do \"mimimi mas é só industria\"... Obviamente não é só isso, pro usuário que pensou isso, deixe de ser burro, otário e imbecil))\n\nA China fez isso e deu certo.",
            "Beleza, vira-lata, vai lá comer sua ração.",
            "Mas quem rejeita alternativas menos que perfeitas toda hora é justamente o pessoal de esquerda. Colocam social democrata, progressista, centrista, liberal, etc no mesmo saco que conservador/fascista, porque são \"aliados do capitalismo\" e supostamente \"direitistas enrustidos\". E aí se isolam em uma bolha política que não chega a lugar nenhum e depois ficam com narrativas como a desse post em que os \"centristas\" são os culpados pelo fascismo. \n\n\nPor exemplo nos EUA tem muita gente de esquerda que se recusa a votar no Biden e provavelmente essa vai ser a diferença que vai permitir que o Trump seja eleito novamente.",
            "aiii eu sei que o primeiro comentario foi ironico, mas ai tu tbm utilizou irnonia. Ai eu me perdi, nao entendo mais. Só vou mandar um gif do david lynch como resposta /s\n\n![gif](giphy|3oEjI99om0HWpMfnC8|downsized)",
            "Conseguiram enfiar na sua cabeça que um sistema que só consegue se sustentar se reprimir todas as liberdades individuais e que causou milhões de mortes vai melhorar a vida da população.  Não sou contra qualquer alternativa. Sou contra alternativas que já foram colocadas em prática e que só resultaram em tragédia. No dia que apresentarem uma alternativa realmente melhor e não esse lixo de sistema totalitário que vocês idolatram, aí eu vou respeitar alguém que fale em derrubar o capitalismo. ",
            "Uma pessoa não precisa falar tudo explicitamente para que se possa entender a ideologia dela. Dá para reconhecer o discurso de um comunista de longe.",
            "Mas olha você tem esse conceito etéreo de liberdade, na China você não poderia ler a coluna do Sakamoto e a do Pondé no mesmo jornal\n\n/s",
            "Nossa, que surpresa que um Estado absolutamente centralizado e totalitário dá de 1000 a zero num Estado híper-burocrático e corrupto... por que será? Sai da bolha, irmão. Não existe ditadura boa, tu só fala isso porquê nunca viveu sobre uma. Lambe-botas de imperialista.",
            "Que não foi só retrocesso nas últimas décadas, tiveram também avanços, inclusive econômicos e trabalhistas. Isso logicamente não desconsidera a existência e possibilidade de retrocessos.",
            "me lembro de um episódio do Castelo Rá Tim Bum sobre isso também, a Celeste até chorou.",
            "Então, o que você descreveu não é uma descentralização. Muito pelo contrário, nessa época havia uma centralização de poder em São Paulo e Minas Gerais. O poder que os coronéis exerciam sobre as terras deles tinha, por trás, o apoio do governo federal brasileiro. Se o povo se rebelasse, por exemplo, haveriam forças armadas do país todo lutando contra essa rebelião, e não somente as forças de um coronel. E, aliás, é justamente o que aconteceu: vide Revolta de Canudos. Existe todo um sistema que apoia esse poder local, não era de fato descentralizado.\n\nOutro ponto importante é que esse período da história era muito menos globalizado e muito mais pobre, dificultando que qualquer população conseguisse comparar a própria situação de vida com a de outras regiões, dificultando o entendimento dos direitos deles, e incentivando os países e regiões a terem regimes fechados. Hoje em dia, uma região pequena não consegue sobreviver bem sozinha se ela for muito pequena. Pode ver que a maioria dos países pequenos são muito globalizados, não por escolha, mas por falta de opção, porque não tem uma indústria desenvolvida para todas as necessidades modernas. As exceções geralmente são regimes totalitários, que frequentemente são alimentados por forças políticas de países maiores como Estados Unidos, China e Rússia, ou por motivos religiosos, que é um problema que independe do tamanho do país.",
            "De fato. Tiveram que evitar uma revolução colorida.",
            "Burguesia ficou naquela né, puta mundo injusto meu",
            "Revolução e golpe são duas coisas bem diferentes, independente do espectro político do movimento que resultou em revolução ou golpe. O Brasil nunca teve uma revolução (nem mesmo a de 1930).",
            "KKKKKK o que a gente teve aqui não teve absolutamente nada a ver com o que teve na China.",
            "Acessar wikipedia é sinônimo de liberdade?",
            "Puxa vida, a única fonte de informações do universo? Como podem ser tão cruéis?????????",
            "> O Brasil é o país do futuro\n\nE nunca do presente...",
            ">basta a classe trabalhadora entender seu papel histórico e seu passado\n\n\nDe novo isso. Esse papo de revolução é o discurso de Arrebatamento da esquerda. \n\n\nVai acontecer espontaneamente, qualquer dia desses. Os ~~fieis~~ trabalhadores vão ~~pro Céu~~ viver em uma utopia enquanto os ~~pecadores~~ burgueses vão pro ~~Inferno~~ campo de reeducação.",
            "Viralatismo? Kkkkkkkkkk é realmente um pergunta.\n\nO Brasil não é esse \"ban ban ban\" no mundo, ele tem voz por ser uma potência regional e ter uma \"economia\" grande. O que nós somos bons é em apaziguar situações e negociar (em partes). Nós sompre fomos um povo calorozo e educado (em partes), mas nós nunca fomos um povo inteligente como um todo. Claro que tivemos algumas estrelas aqui e ali, Vila Lobos, Machado de Assis, Vital Brazil e vários outros, entretanto, nunca tivemos um bom conhecimento geral.\n\nAgora, uma coisa é certa, desde de 1940 nós somos a \"cadelinha dos EUA\", eles pedem para latir e a gente late. Nós nunca fomos uma \"ameaça\" a grosso modo para eles, só um impecilio (na visão deles) de vez em quando.",
            "O problema não é essa moleza de resolver porque não há um único culpado. Enquanto de fato politicas neoliberais ferraram o Brasil em diversas aéreas, elas não são a única por trás. O problema vem muito mais do controle de poder de uma minoria populacional (as elites), combinadas com políticos públicas fracas e uma boa quantidade de corrupção no meio do que os \"neoliberais\" daqui (que são meio patéticos honestamente).\n\n\n> A China fez isso e deu certo.\n\nEntão... você já ouviu falar de Deng Xioping? Porque foi ele o responsável pela China de hoje.",
            "A direita faz exatamente a mesma coisa. Qualquer um com pensamento diferente daquele \"geral\" da direita é chamado de comunista, defensor de bandido, e vários \"istas\" por aí. E o centro vai pra onde o senso comum vai. Digo isso de forma geral, pois existem pessoas de esquerda, direita e centro que ainda tentam analisar e ver boas soluções seja lá qual for o lado associado a elas. Mas são poucos os que fazem isso.",
            "Mas ele falou de ditadura?",
            "Tem um gibi da turma da Mônica sobre isso também. Infelizmente não deu pro Chico Bento virar presidente e fazer reforma agrária.",
            "Aliás, coincidentemente Rá Tim Bum tb é uma música que também tem a ver com bolo. Não é sobre rico ficando mais rico nem pobre ficando mais pobre, nem a direita ficando mais à direita, mas é sobre o aniversariante ficando mais velho.",
            "Sim sim\n\nNegocio era comparar a questão do governo centralizado e autoritário mesmo",
            "A Wikipédia não faz mal nenhum a ninguém. Não tem motivo pra bloquear, não é que acessar é sinônimo de liberdade, mas não poder acessar significa que o governo é autoritário.",
            "100% sem a menor dúvida, neste ou em qqr planeta da Galáxia",
            "Sem dúvida alguma",
            "Não é a única mas eles tbm bloqueiam ou censuram as outras q falam do 4 de Junho de 1989.",
            "Pero Vaz de Caminha foi o primeiro a lançar essa já faz uns anos",
            "Não tem 1 (hum) comunista sério nesse país que ache que a revolução vai acontecer espontaneamente e miraculosamente. Tu ta, sem querer, repetindo um discurso bosta de George Orwell sobre a revolução.\n\n\nAlém disso, tu tira onda com a religião Cristã, mas uma classe que tá organizada pra carai nesse país são os Evangélicos, pq eles fizeram trabalho de base, e é por isso que a gente tá virando o Talibã.",
            "esquerda séria fala em construção revolucionária, nada de \"vai acontecer espontaneamente\". é algo que exige muito trabalho até ter condição de acontecer.",
            "Er... O Socialismo é uma ditadura, mas uma ditadura do Proletariado sobre a burguesia. A gente odeia o termo ditadura pq a propaganda dos EUA ensinou que \"quem eu não gosto é ditador, mas o nosso grande lider é o salvador da democracia\", mas a gente vive numa ditadura burguesa, então meio que \"ditadura\" tá sempre implícito ",
            "a wikipedia é tipo a fábrica de propaganda estadunidense 😭😭",
            "Ótimo, tem mais é que bloquear propaganda estadunidense mesmo. O firewall Chinês é uma das melhores coisas que fizeram, soberania nacional é importantíssimo.",
            "a wikipedia é de todos e é pra ser imparcial, se pensa que não é imparcial o suficiente você pode simple contribuir para melhorar o conteúdo. Desde que não sejam usadas fontes tendenciosas a contribuição é válida",
            "Kkkkkkkkkk"
        ]
    }
}