{
    "How do you completely switch careers? ": {
        "title": "How do you completely switch careers? ",
        "score": 138,
        "url": "https://www.reddit.com/r/careerguidance/comments/1dlgdt0/how_do_you_completely_switch_careers/",
        "content": "26F and I’m wanting to change the course of my life. I’m a cosmetologist and have been doing lash extensions for 5 years. The money was amazing and I was successful at one point of my career but the past 2 years it’s been literally killing me and I’m no longer passionate for my business anymore. All I have is a high school diploma and I’m not looking to do anything in the beauty world anymore. I basically want something completely opposite like manual labor and a job that’s not heavy in the social aspect. I’ve been thinking a lot about car detailing. I’m not opposed to going back to school I just would still need something to help me get by. I’d love to hear some more suggestions and/or advice. ",
        "num_comments": 68,
        "comments": [
            "I'm making jewelry (not attaching beads to fabricated parts, but real metalsmith) and I switched to this career from engineering pretty fast. I teach too, and it takes 5 days of training for a person to be able to work on their own projects with the basic skills mastered.\n\nIt's just an example of job you can learn and start pretty quickly with modest investment (not more than 1k) even if it seems complicated from outside.",
            "you're still young and you got a lot of options.\n\nI would say you could try doing tax return preparation. Getting an Enrolled Agent cert can get you in the door for places like HR block. It's boring as hell but it's stable and employable.\n\nYou can also go back to school. Community college isn't crazy expensive compared to actual university. I'd look into something tech related.",
            "Community college might be a place to start, just go to talk to an admissions or academic counselor and see what's available.",
            "Go back to school part time. As an adult you will have an easier time and different perspectives. It took me 4 years to do what a full time student would do in 2 years but I also didn’t go into any debt and kept most of my lifestyle. \n\nManual labor sounds great but sucks as you get older. Car detailing is flooded market and tough on the body. \n\nIf you want to work with your hands I wish I became an electrician. Again great hands on job for 5-10 years then you become a master electrician and can start your own company with your own apprentices doing the grunt work while you supervise.",
            "911 dispatchers are short staffed nationwide, almost every center is hiring and on desperate need. They train you, educational requirement only a GED",
            "You network. I completely switched careers multiple times in my life. Finally, I switched to the dream career. It was hard!!! But the networking played a role too. Just reach out to people on LinkedIn. Go to events. But figure out what you want first then do that",
            "How much did you make as a cosmetologist?  Curious, as I've always had a creative side but never really explored it professionally.",
            "There are some good apprenticeships going that aren't construction related. You are still really young , I went back doing an apprenticeship at 28. Alot of good jobs don't require any major college degrees",
            "Do you have a vocational or technical school near you? Or maybe you can get a local certification?\n\nUsually these places have flexible hours while you work",
            "Here’s something to consider…take some time away from cosmetology, explore your options, but don’t let your cosmetology certification or licenses lapse. \n\nMaybe you take some business classes and open a very exclusive cosmetology shop where you manage if you choose, work if you choose, but you set the prices and you be exclusive with your clients. \n\nDon’t completely burn the bridge you’ve built.",
            "Warehouse - start out as an order filler and can easily move your way up our new hires start at $24 an hour",
            "I switched careers completely and I would highly recommend doing a niche job in the same field. Find a common shortfall and do just that or star a small business or administrative side of it. Etc.  If your experience CAN apply, you'll get paid for it. If not, you will essentially start over as if you're 18 years old with no job experience again. And in this economy, and in my case, that's a big pay cut and a big lifestyle change.",
            "If you can make connections and build rapport with people quickly, you should consider sales. \n\nYou can make a ton of money - the company will teach you everything you need to know about the products. You serve a client base and solve problems. And, if you’re good there is a lot of money to be made.",
            "At 34, I just went back to school to be a massage therapist. Best decision of my life. \n\nAll I did was consciously make a change. Now I work half the hours and make the same money as working full time. I get to spend more time with my family and help with my wife’s business.",
            "Have you tried reselling on eBay? You can pretty easily make $50k+ with full time effort and it's not very social at all. Technsports is a great resource on YouTube ",
            "Career Counselor here. I would take the O*NET assessment online to see what types of jobs are well-suited to your personality.\n\nThen I would recommend attending college. There are some jobs where you don't have to go to college, but a college degree is one of the most surefire ways to land a high-paying job that has opportunities to move up (and make more $$$). IMPORTANT: you HAVE to get work experience related to the job you want when you graduate. Otherwise you will not competitive to land a job. The best work experience comes in the form of internships.\n\nFrom what I've seen, there are certain majors that have the easiest time finding success. Business majors and engineering majors don't have a hard time finding a job. Communications probably comes in third. You can find opportunities in these majors that don't require a lot of socializing (accounting is a less-social business major).\n\nTake classes at a two year school, then transfer to a larger university to finish up. MAKE SURE YOUR CLASSES TRANSFER PROPERLY. This means looking up the general education requirements and requirements for your major at the four year college you want to go to, then looking at how classes at your two-year school transfer. So you will need to plan which four-year school you want to transfer to before you start at the community college.\n\nThis whole process takes 4 years if you're a full-time student, or 5-6 years if you're a part-time student. But no one said switching careers happens overnight! Think of it this way, you have a lot of life left to live. Would you rather continue on jumping from career to career that has little opportunity to move up, or take the time to set yourself up well for one solid career path?\n\nI hope this helps :)",
            "Try a rental car company. You could detail cars or drive them.",
            "Step 1: Decide to switch\nStep 2: Believe you can\nStep 3: Profit",
            "How are you at math? If you want a job that's less social, accounting and actuarial jobs pay very well and don't really require too much social interaction. In the current market, I would be surprised if you couldn't get a fully remote job as an accountant or actuary and just crunch numbers from a home office. \n\nIf it's interesting to you, you would need a bachelor's degree in math/accounting/actuarial science. I would highly suggest starting at a community college for the first several classes. It's cheaper, so if you end up not liking it, you're out less money.",
            "Apply for entry level jobs in different fields. If you want to do manual labor, you could always do construction",
            "Reskill yourself in a tech domain that you have a family member or friend that can coach you and hopefully “sponsor” you into the industry via their network. Udacity is great.",
            "If you can pull it off, UPS. You have to work in the warehouse before you can drive. But after four years of driving you make top pay which is like $44/hr rn. Overtime after 8 hours a day, not after 40 for the week, which is fantastic. The union is good, the benefits are absolute top tier. You’ll have to work two jobs while working the warehouse but it can be absolutely worth it.",
            "Trade school.. plumber, hvac, construction, electrician, painter.\nAll great trades, require limited social interaction besides the basic \"how's it going, what seems to be going on\". There's not alot of small talk in trades, mostly to the point. Construction would involve more interaction if on a crew, but your interaction is mostly with your team (windows, finishers, drywall, ect).",
            "Welding. Electrician.",
            "Do what makes you happy. I completely switched careers before I turned 40. I was in Insurance for 10 years. Got up to 12 job titles and was like fuck it. I don't get paid enough to do 12 different job titles. Applied at my dream job and happy that I did it.",
            "The west is a really weird place. How can you make ‘amazing money’ by doing freaking lash extensions? How is anyone making minimum wage if such a low skill job makes ‘amazing money’?",
            "Try to go for the medical field ? Go for Cna . And then join the air force. \nAnd further advance your career",
            "Here’s what I did and I strongly recommend it - if you think you might be interested in something (e.g., car detailing, construction, house keeping,.. engineering… literally anything) ask someone who does it for an “informational interview”. This is just a quick chat about what the job is like, what the company is like, what work expectations, salary expectations, education or certification needed, hours, skills are all like and needed. People generally love talking freely about their job and will welcome chat (if they’re nice. If not, you don’t want to work with them anyway). This way, you get more information about the job and you’ve made a genuine connection with someone who might be able to get you a job in their field when you’re ready.\nYou can ask them directly or you can send an email requesting one if you don’t know the person personally.",
            "Car detailing is alot of hands on work with okay pay. Atleast the place I worked at was. The demand and workload was high with low work health and safety standards. Literally had to buy my own PPE to protect myself from chemicals and acids. \n\nI would speak to a career counsellor or try applying to some inbetween jobs. Things like retail or anything low level in an industry you're interested in. It could be a good idea to just bounce between jobs and industries just for the experience. \n\nI would also recommend doing a personality test to see what kind of jobs you might find interesting or fulfilling. Answer all questions honestly! \n\nAlso you're going to want to do up a good resume and tidy your LinkedIn. Go hard on it. Seriously sell yourself. Companies will hire you for your experience and attitude, over any education. (Assuming you're not legally required to have that certificate/degree).\n\nKeep in mind you'll have to climb hard to get to a comfortable level in the career, and there may be red tape along the way. But remember that you're going to happier regretting something you did, over something you didn't do. \n\nYou got this!!!!",
            "Way society is formatted. Save, Budget, Learn, Connections, Family, Friends.",
            "Have you thought about being an inspector for salons or dental hygienist?",
            "You already have a cosmetology license why not switch the job focus to hair or nails or facials? You shouldn’t need to go back to school for any of those. There are also shorter courses you can take to get certified for providing laser treatments.",
            "I taught myself how to code at 29 after being a laborer for years. Just start learning. There is so much free stuff online for most topics. Khan Academy is a good place to start.",
            "What about the trades?",
            "Get a customer service rep job and move around internally if you want",
            "It's summer. Landscaping places probably need help right now and as  20-year gardener I can tell you basic landscaping and gardening ain't rocket science. If you can do lash extensions, you can for sure cut grass and trim some hedges. Maybe even imagine you're running a mower over some of your most annoying customers - or maybe you don't have aggro like I do - lol. Happy trimming! :) A different kind of beauty. And you can explore college, trades, and other possibilities while probably getting work in landscaping pretty much immediately. CHeck out arborists, too. Sometimes they need a helper to hold ropes or gather branches and load them on a truck. Using a chainsaw is a blast, even for cutting big branches into lengths, too. A handy skill in case you ever buy a home. Just make sure your employer cares about safety rules. Google them yourself, if you're working with an arborist.",
            "Step 1: quit your job \nStep 2: apply to something else",
            "Here’s how. Get a graduate degree in teaching secondary education after a BS in English. Then, and this is the important part, get addicted to heroin for like 10 years and go to jail for stealing pork chops and Bob Evans Mac n Cheese. Then go to jail and get clean and sober. Then be too scared to go back to teaching so then go get a graduate degree in social work and become a therapist. ",
            "That's awesome! How did you make the transition? What was the starting point into your new career?",
            "This is very interesting do you sell your projects on etsy?",
            "How profitable would you say it is, i.e, part time income to supplement teaching? Do you use an internet platform for sales?",
            "Where can I get this training?",
            "Could you tell me more about it?",
            "This - I was majoring in a tech related degree and now I’m trying to pivot.",
            "Tech is dead for now. There’s no more I took a boot camp so give me your diversity spot.",
            "How did you manage with internships and full time job? I’m in the same predicament- don’t want take on debt so doing school part time but internships are recommended… means a pay cut and stepping away from full time job. Trying to figure out my budget.",
            "I am 53 and both my knees have to be replaced. I can no longer work in the Hospitality Industry. I went to a career fair and they said they were looking for 911 dispatchers but it’s like 6 weeks training. Of course I am afraid I won’t make it. Any thoughts?",
            "what is your career",
            "How do you actually figure out what you want to do, trial and error? I’ve tried 3 different paths in college and I thought I woulda liked them but ended up dropping all so far",
            "Not OP but are there any that you recommend? I’m pretty much in the exact same boat as OP",
            "Eyelash extensions are a luxury, super trendy online, and they’re really expensive while only lasting a few weeks. They’re impossible to do yourself. She owns a business. \n\nYou need to be certified to do them and if someone isn’t using the proper techniques you can get eye infections and other nasty things so you can’t just go to anyone for them. Also if someone isn’t good at doing them they look like absolute crap. Wouldn’t call it a low skill job. ",
            "That’s probably the #1 worst job to go into right now, there are millions of people who are beginner programmers and companies want experienced people. It’s the most flooded industry in the world",
            "are you employed? I thought the coding field was decimated currently",
            "Do that in reverse so you can still pay rent.",
            "Is it sad I thought the worst part of this was the Bob Evans Mac and Cheese?",
            "Poverty, lol, there was a Crimea crisis and construction was massively layed off + disability, so I had to figure something out. Had some study works in metal online, they sold, made more.",
            "No, never liked this dropshipping monstrousity, only social media, local shows, my website (made one myself), then started to make my own shows, sold tickets - that was before the war and moving countries 🥲",
            "It was average/slightly above average income (for Russia) before war. Teaching could only be possible when I became some kind of an expert, it was never a money making grift when I didn't quite know what I was doing myself. 100% relied on my work as a jeweler before anything added on due to experience. More stable than employment, there were 0 laws protecting me as an employee.",
            "You could fly to Tbilisi, Georgia 😄 or look locally for a jeweller who can give you 5-8 classes if you want a quick start.",
            "Can’t hurt to apply or try.. If you check r/911dispatchers there’s plenty of similar posts. So long as you can listen and you’re quick on a keyboard it’s def worth a shot.",
            "Dispatch is a difficult job to do well and can also be very emotionally trying. Many hours of routine and then - Bam - some horrific high stakes call . And six weeks training is very short!",
            "I'm from Ireland so not 100% if the same goes on world wide but in Ireland you can do an accountancy apprenticeship. Might be a boring job but your always guaranteed a job and the skies the limit.\nI know guys who have went in to sales and IT without any degrees who are making mega bucks",
            "Yes, making about 3x what I used to make and working remotely.",
            "I was thinking the same thing, the tech market is pure rough right now, especially for juniors.",
            "There’s wisdom in your words.",
            "Respect! Wishing you all the best!",
            "Well with that attitude you definitely can't lol. Just because it's hard doesn't mean you shouldn't do it."
        ]
    },
    "What career is future proof for now?": {
        "title": "What career is future proof for now?",
        "score": 39,
        "url": "https://www.reddit.com/r/careerguidance/comments/1dllwd8/what_career_is_future_proof_for_now/",
        "content": "I was interested in marketing degree  but today found out it’s stressful, difficult and not good for ppl who can’t work under pressure. \nWhat career path is less stressful that I can get without a degree ? \n\nEdit : any desk job bc I’m a wheelchair user",
        "num_comments": 70,
        "comments": [
            "There's people making tons of money with jobs they Inherited from generations, it isn't the career that has to be future proof, is the individual the needs to adapt. ",
            "You should look into a career in HR. Relatively future proof, lower stress and desk job\n\nEDIT: or some sort of internal compliance role, or a government job.",
            "Nursing, trucking(though some trucking jobs aren’t secure), X-ray tech, respiratory therapist, doctor, hvac, plumbing, electrical",
            "Really depends on your definition of “stressful”. \n\nSome people get stressed waking up in the morning.\n\nSome people can handle high pressure jobs without issue.\n\nMaybe you should find ways to manage your stress:",
            "Therapist, psychologist,",
            "No career is future proof. This is a boomer idea.\n\nIn this age, you have to accept that you will likely change careers many times in your life.\n\nGet good at this skill. In the meantime, get good at any skill. I don't mean \"good enough\", I mean \"holy shit, they're good\". Devote yourself. Slave day and night over it. There is no alternative. Work hard, harder than everyone else.\n\nYes our corporate overlords demand it. And yes, that is our reality. Sucks to suck. Get good. It's how it is. Wish it wasn't, but you gotta deal with life as it is and not how it ought to be.\n\nBeing real with you. You're in a wheelchair. So the only thing you can really bring is your mind. You're never gonna move a 200lb couch. You're never gonna do roofing.\n\nSo whatever you work on improving as a skill, it needs to involve your brain. And you need to do whatever you can to improve your brain. Sleep better, eat better, exercise, do therapy if you need it, everything. Your brain is your one asset that any job can benefit from, so work really hard on improving your skills in something that uses your big beautiful brain.",
            "This isn't necessarily true 100% of the time but I'd say it's safe to always make the assumption that the easier and more chill the job is the higher the chance that it isn't secure during downturns. \n\nThat being said maybe a clerk position? Basically reviewing and filing invoices.",
            "Medical and Trades.",
            "Lineman, with places like cali committing to full ev in 5 years and a failing infrastructure, im gonna have so much fuckin work for the next 30 years. \n\nBasically the entire west coast needs everything upgraded and for 90/hour id be happy to do it",
            "Seems like you want a stress free position with job security. I would HIGHLY recommend doing anything government or military civilian. They have decent wages, usually with a pension. I believe you get a handicap preference as well. There's tons of desk jobs and they prefer to keep people longer than typical companies due to continuity (since government rarely improves/changes processes). I think that path is exactly what you're looking for.",
            "HR",
            "Military",
            "All jobs can be stressful I advise you to seek therapy and learn how to manage your stress.",
            "Marketing stressful? I have worked with tons of folks in that field. It’s no more stressful than any other office job. At least it’s creative, interesting, constantly changing and you get a chance to see projects from start to finish. That’s very rewarding. I couldn’t think of anything more mind numbing than most roles in HR. You honestly can’t select a career by other’s definitions of stress.",
            "There aren't any jobs that are not stressful, but I used to know a girl that was a video game artist, she was also a wheelchair user. Start learning Maya, Blender etc.\n\nHow are your drawing skills?",
            "Any office job is stressful. But generally not at the junior/entry levels. It builds over time and promotions, so you can build up resistance to it.\n\nI’d argue HR is stressful once you start to be involved in internal disputes with respect to harassment etc. as the role of HR is to protect the company. Sometimes that means the senior person the complaint is about gets protected, other times it does not.\n\nA secretary’s stress depends entirely on the people they support. And in the corporate world a good executive assistant is pulled along with the person they support. So as that leader gets promoted, the workload of the secretary changes (even if they don’t get promoted too)",
            "Anything computer or electrical. Do an advanced diploma of electrical or computer engineering or equivalent in your country then make a decision for further study or further trades. Think electrical cars and shit. Everything will head there eventually already is.",
            "Insurance Industry",
            "Plumber",
            "CRNA is future proof. Along with many medical specialties.",
            "Decent desk job without a degree might be a challenge. Everyone I work with in corporate holds a bachelors at minimum.",
            "Less stressful, future-proof and from a chair doesn’t leave you a lot of realistic options that pay very well.",
            "Government job! Especially with a disability (you have some advantages in the hiring process of you have whatMs called Schedule A).",
            "With AI and quantum computers progressing. I'm praying for UBI.",
            "Work in IT, Health, Horticulture/Agriculture or Culinary. \n\nI think these are generally safe from AI/Robots or any shortages.",
            "Fucking nothing, it's over",
            "Therapy and coding are future proof for now. Web design, stopping hackers, IT stuff. But also psychological assessment like psychometrist jobs where you test ppl for mental illness and the the doctor writes a report. Assessments for adhd are so booked out to like April of next year where I live. You only need a masters",
            "No one can predict the future. Pick what you're good at, or what you like.",
            "I am Carpenter \n\nThere are somethings a machine can do better than me but there are also some things I can do better than a machine.",
            "[deleted]",
            "Medical Industry\n\nLegal industry \n\nReal Estate Industry \n\nSex Work Industry\n\nFarming Industry\n\nThats all I can think of in general off the top of my head. People have to eat they have to die they have fight and they have to….well you know the rest.",
            "Manual therapies. PT, OT, MT, etc. good money. Less hours and a sense of satisfaction. \n\nGranted, you can’t be a soft body and do these jobs. It requires more strength than you think. I have a 160 lb grip for reference.",
            "Hitman. A bit stressful if the client is high profile but very good pay and extremely satisfying at the end of the day.\n\nPlus never goes out of fashion and well beyond chatgpt capabilities.\n\nMercenary is also in the same vein, and ditto for folks in counter intelligence services.",
            "Prodtitute",
            "As a government HR worker— I concurrrrr",
            "Confirm.\nHR and now in talent acquisition. \nBut i have a masters degree in hr since in Australia a lot of the top tier jobs want a degree so I thought I'd get it early before I felt too old to study.\n\nIt's future proof as anything. Every company has an hr function in some form. \n\nAnd AI will definitely not be trusted ever to screen interview and issue contracts. No matter how advanced it gets. No company would take that risk.",
            "I had an interview last year with a gov but messed up one question  or I would’ve probably got it.\n\nCan I do hr without a degree tho ?",
            "This is lowk the goal",
            "Yeah, go be your companies protector.",
            "lol doctor is very stressful. Any desk job ?",
            "Also OP mentioned that they're a wheelchair user. \n\nI might be too judgmental, but I'm guessing nursing, plumber, electrician aren't the best options for the wheelchair user? Same goes for the trucking. Don't you need to have excellent physical condition to get a D driving license?",
            "I am a lineman for the county",
            "Without a degree?",
            "lol I know u didn’t read the whole thing",
            "I have a medical condition that wouldn’t work well with that or a medical field. :/",
            "I want to start one but want a normal job too",
            "Yes - become a secretary and move into HR admin role. HR people are the most unqualified people I’ve ever worked with, on average. I worked myself in HR admin as my first intership, but I was seduced by HR Oracle databases and went into data.",
            "Keep applying to similar positions! And now you know how to answer the question that stopped you",
            "Im a paramedic, currently sitting at my desk watching the boys writing this. I could quit today and have another job tomorrow anywhere. It is a tough road initially and requires a special kind of person but very achievable and rewarding in many aspects. People will always need medical care, although pay isn’t amazing at a lot of places for paramedics atleast I know I can always walk into a hospital or hop back on an ambulance if I need to put food on the table. I currently make close to 80k, stress level at an all time low.",
            "All jobs are stressful. Might as well go for the one that pays the most so you can retire young.",
            "It would be stressful depending on the type of work but a legal aid might be worth looking into?",
            "You might be in a wheelchair, but you still have a brain.\nUse it",
            "HR is just administration in the department of hiring, so yes",
            "Shit man my bad.",
            "invent some plumbing tools for wheelchair users",
            "Anything in the medical field is going to be stressful with the exception of a few select office jobs. I’ve never talked to someone who worked in a hospital that would describe their job as stress free.",
            "[deleted]",
            "[deleted]",
            "Did you need a degree to get into data?",
            "Yea that’s there. Don’t think they give the same questions tho but idk",
            "Oh man. I can’t thank the paramedic who REALLY saved my ass a few months ago, so I’ll thank you. You’re so right that it takes a special kind of person. Bless the people who do the work you do.",
            "There are definitely jobs you can do that aren’t. I don’t think I’ve felt stress about work in my current role which has been about a year and a half",
            "How can I progress from legal aid?",
            "Ouch 😂 well I wanted to do a marketing advertising and digit communications degree but I seen many TikTok say it’s difficult stressful and not good for people who don’t work well under pressure so I don’t think it’s appropriate for me. Also ppl say it’s a waste of time. \n\nI’m looking for a career that won’t affect my health bc stress affects me badly",
            "It’s fine lol",
            "Exactly 🤣 my sis is studying to be a doctor and it’s very stressful. Idk how she does it",
            "Well I know a medical archivist/transcriptor. He works in the basement of the hospital and it looks very low stress. Not sure how future proof it is, though.",
            "Do u know anyone with a marketing degree",
            "I’m just scared that after that hard work money and time I won’t get a job in it. I’m not super passionate I just find it interesting and just don’t get bored like other things",
            "The first mistake is watching TikTok for career advice. That’s also the second mistake. \n\nThen news flash, any job is stressful unless you are or have something rare that employers fight with each other to get you in. \n\nI’m assuming you are still in high school, so few things here. \n\n1. Focus on what you are good at more than what you wish you were good at. Usually we tend to do better in what we like, but many times people like the outcomes and not the process, so they don’t evaluate it objectively. \nExample, some people might like the idea of being kick ass hackers or stuff like that, but they are piss poor at math and programming, and they don’t enjoy spending countless hours writing code and testing shit out. \n\n2. Scarcity. A bachelor’s degree is something that almost 50% of your generation will have, even a master is fairly common in decently paying jobs… scarcity starts at PhD, if the field pays decently. \nExample, a PhD in clinical psychology is valuable, the job pays well and if you find your niche you’ll never be without work. A bachelor in psychology is useful as toilet paper by itself. \n\n3. Almost nobody is going to be blessed with a 40 years straight line career, you might have to change and adapt few times along the way, so focus on making and saving money from the get go.",
            "Great advice"
        ]
    },
    "Where do I find a living wage, working alone in a low stress environment?": {
        "title": "Where do I find a living wage, working alone in a low stress environment?",
        "score": 20,
        "url": "https://www.reddit.com/r/careerguidance/comments/1dlls6u/where_do_i_find_a_living_wage_working_alone_in_a/",
        "content": "I’m a 47-year-old male. I’ve done a variety of different jobs in my life as I started working at a very young age. Historically speaking, I’ve worked regional sales positions and closely with engineers.  I’ve also been a project manager in the construction supply chain. Needless to say, stressful, souless corporate jobs burned me out. After my divorce, I had a bit of a midlife crisis and divested my real estate, paying off all my debt and buying a new car essentially starting off fresh. Now I find myself at crossroads trying to avoid stressful occupations, safeguarding my mental health. I’m a bit of an introvert, and I find myself becoming “the old guy”  in work groups. I can assure anyone here, ageism is very real, lol. Currently I have a low visibility role working inside sales job selling to contractors. I absolutely hate it, the construction supply chain is garbage especially after Covid. I’m looking to make a change late in life in a low stress roll that will pay a livable wage.\n\nDoes anyone here have any suggestions? Find themselves or have found themselves in the same boat?",
        "num_comments": 14,
        "comments": [
            "Living wage and low stress? Buddy pick one",
            "You could try your hand at selling propane and propane accessories, seems kinda chill.\n\nIf your name is Hank it helps.",
            "Corporate security, It’s a stable above living wage job that is pretty much stress free, If you don’t mind night shifts you will generally get the isolation that you are after also.",
            "Ive had 2 jobs as a machine operator,  at least here in the Netherlands the pay is pretty good and always in need for workers. \n\nOne and current is a ceramic rooftile factory. Turn on the machines, let them do the work. Clean a bit, log some data, bit of maintenance, keep an eye/ear out and do some reddit or watch sports is how i spend most of my workdays.\n\nSecond one was a chemical waste treatment plant. Great fun job with some responsibility. The chemistry part was taught on the job. Nice mix of talking to drivers, loading, unloading, testing, sampling, waiting, watching screens following the proces and coworkers. Team of 2/3 +1 lab. Night shift is cleaning a bit and 4h of own time.",
            "Working alone in a low stress environment…that does exist, but they’re also exactly what everyone wants which means they typically go to the most desirable/qualified candidates with degrees. Also, you’re gonna have to define “livable” because what’s considered livable at 25 ain’t the same as livable at 47 at least not if you’re like most people.",
            "Plant operator",
            "Buy a pool cleaning route maybe.",
            "> construction supply chain  \n\nFlip to the Owner side instead. It's much cushier, and you seem to have the right experience.",
            "Government jobs. Can be hard to get in because they are slow, lots of applications, and former military gets priority. But once in, it's stable, good benefits, can be busy at times but nothing is very urgent that causes stress. It's night and day from my non profit then corporate background.",
            "Same situation and older than you so it’s worse :(",
            "Legit.",
            "Yes! Or an after-hours janitor. Minimal human contact, consistent predictable schedule.",
            "I’m in commercial plumbing and you’re left alone to complete tasks. Find a local plumbing pre fab shop and work ur way into a union.",
            "Janitor is not a livable wage"
        ]
    },
    "18y, what is a great career for me?": {
        "title": "18y, what is a great career for me?",
        "score": 3,
        "url": "https://www.reddit.com/r/careerguidance/comments/1dlupje/18y_what_is_a_great_career_for_me/",
        "content": "hey there, I'm 18y old, i have completed my diploma in electrical engineering from a well reputed collage in Pune but my average score is only around 65%, i have also given 12th in commerce and scored 67% in it. my parents were hesitant towards the entire 12th thing but I'm interested in the finance/stock market things so I convinced them to let me give the exam hoping that when it's time for admission they'll allow me to go for something in that field. but they are stuck on continuing the engineering and studying a b. tech course. i personally don't hate or love engineering, it makes me curious but not as curious as this finance thing does. but a thought come to my mind that if I take up finance now I can't switch back to engineering whereas if I continue engineering I can take up MBA course. all of this has clouted my judgement and I don't know what the right choice would be. hence I'm asking you all for any recommendation, suggestions or remarks on my situation. if u have any questions feel free to ask in the comments and I'll reply to all of them. thanks in advance.  \nanything future proof, which is out of my context is also apricated, so i can explore more options.",
        "num_comments": 2,
        "comments": [
            "FNO me bahut scope hai",
            "There are many kinds of engineering. As long as you have a degree most companies won’t care about your Average. In the US at least, they don’t ask nor care. You put initiative into an education. THAT’S what matters. Most companies will see to it that your personality matches their work culture. Skills are learned on the job. You have the knowledge now to put the skills to work. \n\nBe patient in finding a job. Maybe find a paid internship. MAHLE company in Michigan pays $18-20 USD per hour to intern there. That’s where you network and find jobs."
        ]
    },
    "What’s the worst career in the next 5 years? ": {
        "title": "What’s the worst career in the next 5 years? ",
        "score": 680,
        "url": "https://www.reddit.com/r/careerguidance/comments/1dkv9yy/whats_the_worst_career_in_the_next_5_years/",
        "content": "Out of curiosity, what do y’all think is the worst career in the next 5 years? \n\nBy worst career, I mean the following:\n\n1) Low paying\n2) No work/life balance \n3) Constant overtime \n4) Stressful and toxic environment \n5) Low demand \n\nSo please name a few careers you believe is considered the worst and that you should aim to avoid. \n",
        "num_comments": 1096,
        "comments": [
            "The refreshing thing about these answers is theyre all different which makes me less anxious that I’m working in the wrong career field",
            "Probably customer call centers",
            "Everyone is just naming every job out there",
            "Language translator for written text",
            "What do you guys think about a graphic designer? On the first hand, it's unfortunate that ai was trained on an existing artworks but on the other hand wouldn't jobs like that or UX designer strengthen in there importance because of interaction of user with ai interfaces and their creations based on coders work? ",
            "Anything involving public school education. The pay is low, children’s behavior is atrocious, and parents are absent. The school system only cares about kids in class for tax dollars, not about their grades. The system can change education requirements and still pass kids that can’t read, write or do math. You know a societies values by how they treat their elderly and children. So the same could be said for care homes.",
            "Film production - with a bullet. 15-16hr days, high stress with low pay, low demand state-side, high responsibility and skills required. \n\nThe pay is low because the demands low and the supply is high - it’s a “glamour” industry, meaning a LOT of people want in without realizing what that means. So a lot of cheap labor for highly skilled positions.",
            "Paramedics are criminally underpaid.",
            "Honestly, ecological consultancy is bad (not as bad as it used to be where it was a lot worse).\n\n1) Pays very badly, especially at entry level where you get ruined by crap work.\n\n2) You get sent to site and have to stay in hotels a lot, often with very little notice, very often mon-fri\n\n3) Very few know how to project manage and therefore people manage. The evening bat surveys (thank fuck dawn bat surveys barely exist now) are often treated as not real work so people work 7-8 hours and then do a 4-5 hour bat survey in the evening for TOIL to take in the winter or not even that.\n\n4) Clients wanting reports etc, it can be fairly toxic, probably not like recruitment etc.\n\n5) As a result there are barely any ecologists cos people keep leaving the shitty industry before they can get senior enough to avoid the crap.",
            "Tory MP",
            "Around where I live I'd say healthcare workers and delivery drivers. Work pressure is already insane, pay is definitely not reflecting that and it's chasing many people away from the work so shortage of people working there will only increase from here on out.",
            "My previous job. Librarian.",
            "Marketing. You are pressured to perform well, save the company's revenue growth and deal with extremely tight manpower. Make money, even if consumer purchasing behaviour is more passive compared to the pre-pandemic era.",
            "Line Cook, by far the most demanding and underpaying job I've ever worked. It can also be incredibly toxic and it has been commonly accepted that they should receive emotional abuse for any mistakes made. I will never go back to that industry.",
            "A lot of accounting jobs will go to India",
            "I doubt architects will ever rise to any value again",
            "I think a lot of back office finance is going to get wiped out by AI",
            "Nursing. Anything with hands on patient care. The profession is in the toliet.",
            "Journalism",
            "Travel agents",
            "Social work",
            "Public school teachers. By far. Teachers are quitting in droves and leaving states with critical teaching shortages.",
            "Bank tellers, cashiers, airport workers, assembly workers…..",
            "Anything really…",
            "Anything that relies on disposable income for its revenue. People are getting more tightfisted with each dollar.",
            "Animation, no job stability and scarcity of jobs. Either working everyday and weekends for months to not having a speck of work for half a year.",
            "Not low demand but it’s accounted for the other four. All the corporate jobs if you are the one who gets things done.",
            "I like accounting and plan to study it in the future, but obviously with AI and stuff plenty of accounting jobs will be absorbed, changed or lost to the technological advancements",
            "Real Estate Agent \n\nOversaturated, very little pay for most people in the field, and quickly being taken over by robots",
            "Teachers. \nThey get shafted so hard",
            "Fedex ground driver\n\nUpfront pay is ok but you get no paid holidays and no benefits\n\nYou can be on route till 7pm \n\nThe actual fedex terminal and upper management doesn’t care about you. They care about pushing as many packages as they can out and your day is now miserable because you won’t be able to move in your truck for the first 2 hours of your day and you’ll be stepping over packages. \n\nSome terminals you can’t dispatch until 10:30am because they want to push as much out to you as they can",
            "Stenography, probably will be wiped by AI. Only thing holding back is the court system tradition.",
            "Call centre definitely, AI will replace this job.",
            "High School teacher.",
            "Writers in general, content, speeches whatever.. AI will take over",
            "Food service or retail management",
            "Working in production for a YouTuber. I am definitely not drunk and venting.",
            "Everything except those born into wealth.",
            "Any legal profession. With a bit of luck we will have LawyerGPT soon.",
            "Enterprise rent a car. Learned a bunch but 60 hr weeks at 33k a year was brutal.",
            "I'm pretty certain the whole pharmaceutical field will be AI automated before too long, even stretching in to some initial 'doctors' visits.\n\nAn AI database will have instant access to all your data, medical history, know your allergies and be able to give a diagnosis, medication, dosage etc\n\nAnd with each person it helps, plus feedback, it will only get better.\n\nHuman error accounts for a hell of a lot of mixups that can spell death, this will be largely eradicated.",
            "I think strategists at ad agencies will be greatly reduced…I feel like that is already happening with my job. Not eliminated completely, but reduced.",
            "Doesn't necessarily meet all criteria from OP but if you are reading this, DON'T become any sort of management in fast food unless you really need the money.",
            "Software dev and finance",
            "Honestly, anything that's not medicine, engineering, STEM, or business stuff",
            "I think you're gonna stumble upon a reasonable mix of these whatever you do. But to be fair, within a single career it's gonna vary from company to company.",
            "I think that low level work in any industry will be done by AI. There is no „safe“ industry in that regard. But for complicated, higher level work the most competent people will be well compensated.",
            "Teaching (and not bc of the kids).",
            "I left the consulting services industry after 25 years 9 months ago. \n\nThe whole industry changed post COVID.  With a move to most projects being run virtual, it’s opened the door to an offshoring business model where good portions of the entire engagement team is from low labor cost countries. Combine with AI, I don’t see it becoming a good industry to work in for people living in high labor cost domestic United States or Western European countries. \n\nWhen I left layoffs were everywhere across all firms.  The trend continues.\n\nEven if you do make it into the industry, the work life balance and other factors make it a terrible industry to work in; unless you kill at sales and move up quickly to a business development role.",
            "Teacher.",
            "You literally described what being a teacher for the last 20 years has been like.",
            "Security.\n\nAt first, it checks all boxes except low demand, but the more experienced you get and the more you try to step up, the less value you have, and thus, less demand for your work.\n\nSecurity companies love to say they want experienced guards and stuff but they will take someone with lots of experience  (years on the job, military history, police training) and low ball them with minimum wage, lots of promises of advancement and raises just to give you a nightmare experience.\n\nI've been in plenty of hiring processes as both the person getting hired and doing the hiring, the fresh guards (especially foreign students) are the ideal because they don't know their rights yet and will just do the job, opposed to guards who have been around and proven they would be valuable assets.\n\nCountry dependent, of course.\n\n Nothing against any foreigner legally coming to the country and seeking work, I support the hell out that and can't wait to work with you and learn more swear words",
            "Retail or hospitality. Seems those jobs never have a reasonable schedule and it always changes. For crap pay",
            "Here's two for you that are the opposite on #5. Both for the US.  \n\n1. Non profit social services case workers. Specifically in the areas of addiction, housing, and homeless services. Shitty pay, lots of OT because of the demand, working with disadvantaged folks is stressful AF, plus a lot of folks on the left think they aren't doing enough, while the folks on the right think the job shouldn't exist at all. \n\n2. Caregivers and CNAs for elderly and disabled people. Shitty pay, lots of OT because of the demand, dealing with actual human shit a lot of the time, some old folks are assholes, some old folks have family who are complete assholes, upper management is just out to make a buck, and on top of that, it's hard on your body.",
            "It should be retail salesperson. While retail can provide valuable experience, it typically involves low pay, irregular hours including nights and weekends, and can be physically and emotionally exhausting.",
            "There is a department in the federal government whose job odds to give you this information. \n\nhttps://www.bls.gov/ooh/home.htm",
            "I'd say childcare and the film industry.",
            "All of these jobs being overtaken by automation and yet the retirement age is rising. We must work longer unless we have significant savings to bridge the gap to allow early retirement. \n\nWhere will these jobs come from? You would think by now that there would be concrete plans for a transition to a universal wage. Wasn't automation going to be taxed to cover job losses?",
            "Everything except for healthcare and other government workers \n\n\nI mean they are underpaid depending on the career (ie: teachers) but they still have more job security than any engineer or anyone working for the private sector",
            "Teachers have it pretty bad these days.\n\n\nBiologist pays like shit for how difficult it is, unless you have a doctorate. \n\n\nTrucking isn't looking great.",
            "Teaching.",
            "Child care hits all of those except for #5\n\nIt’s one of the most in-demand services right now yet the wages are garbage poverty-level low. Child care workers make teachers look rich.",
            "Everything. \n\n1. Pay has pretty much stayed the same for 20 years, with only marginal gains that are overshadowed by inflation.\n\n2. We are moving away from Henry Ford's 8 hr/day 40 hr week with competitive pay because of \"Profit Margins\"\n\n3. Overtime is just regular working hours for most people, Salary used to be the way to go but idk now.\n\n4. Look at society I think you know\n\n5. Everything is in low demand since companies are not actually hiring but are just putting ghost requests out for work with no intention of filling the position because like ghosts, it never existed.\n\nThis is what the start of a rotting society looks like.",
            "Software Engineer:\n\n1. Low paying because you won't get a job\n\n2. No work life balance because you won't have work \n\n4. Applying for jobs is stressful and toxic\n\n5. Too many software engineering graduates",
            "Construction. You are expected to work day in day out in a low salary while the owners fill their pockets.\n\nNote - I was talking about developing countries.",
            "Unemployment, u don't even have wlb as ur in it 24/7",
            "Warehouse jobs, teaching positions, trucking, accounting or finance, customer service—eventually, large retail stores will shift to online sales and pickup orders, rendering some jobs obsolete while skilled positions will endure. It's difficult to predict at this point.",
            "Nursing \n\nit’s already shitty and we are already getting paid like ass. But as boomers die out, our patient load will increase significantly over the next  decade or two. Not to mention boomers are generally close minded, stubborn, racist, homophobic, and just downright rude.",
            "vfx.",
            "Corrections",
            "Teacher or guidance officer",
            "Retail",
            "Driving heavy goods - \n\nCurrently it’s paid well and eu laws dictate our working time. However, \n\nWith the influx of loads of new drivers this will only drive wages down inevitably. Within the last year I’ve already seen this. Companies offering slightly over min wage for such a demanding / skilled role ( it isn’t just sat on your arse all day).  \nMy own company has already switched from not employing any new drivers and switching to agency staff - this means they don’t have to pay sick/holiday/paternity pay and when it’s quiet they just don’t get any in which is a short term gain for the business I guess. \n\nThey’ve already backtracked on loads of perks they introduced when drivers became scarce a few years ago- prime example being night rate is limited to 10pm-4am and hours worked outside that is ‘day rate’ pay. \n\nThe roads are getting worse and worse - state of the roads with pot holes. More and more traffic and dodgy parking, higher fuel and insurance costs. ‘Advancements’ in the quality of trucks which are actually a hinderance such as the camera mirrors and switching to gas fuelled trucks which are useless for long distance and hilly areas like Yorkshire. \nRoute planning is getting worse. Either by utilising ai which doesn’t have the same problem solving as a human ( so many variables to input) or employing inexperienced cheaper people \n\nThere’s already talks to change rules on domestic drivers now we’ve left the eu ( such as limiting how long you can work in a day; how much break you need between shifts, how much breaks you need- you know stuff that keeps the road fucking safe) \n\nThere’s talks on changing our cpc ( basically you need to do 40 hours training every 5 year or 8 hours every year to keep you qualified) from paying for a course and sitting on a classroom to full on having to resit pass/fail tests which depending how they go about that can be bad or good but it seems to be leaning towards money generating bad. \n\nBasically job security and quality of life is already declining now and the future looks like it’s only going to get worse. If you mess up slightly now you can end up in front of the traffic commissioner  and that’s potentially your license and income gone or time in prisons - what other roles have that much responsibility for minor mistakes. \n\nFortunately I have a degree, have options and leaving the industry next month. But it does look bleaker for those wanting to stay and those joining.",
            "I’m currently a machinist and I’m looking to leave the trade. Manufacturing is already outsourced. High stress job, thin profit margins. It takes years of experience and a ton of knowledge just to make diddly squat for money. Unless you find a niche it is pretty shit. \n\nAlso don’t forget it’s dangerous, and most employers don’t care about your health with air quality or safety features. You can easily end up like one of those liveleak videos from China, getting turned to pink mist. Experienced machinists top out at $30 per hour in my area. Only making more switching to nights.",
            "NSW nurse in Australia. It just keeps getting worse.",
            "Teachers will be in high demand so it doesn't fit all of your conditions, but the way teachers have been quitting en masse, I suspect in 5 years we will have a full blown catastrophe or exclusively sourcing teachers from foreign countries with a lower exchange currency.",
            "Teacher, specifically art",
            "Somebody beat me to it but I was going to say anything in K-12 teaching.",
            "pursuing a phD..bro it will fuck up your life real bad",
            "IT sector tbh",
            "Teaching",
            "Teacher and customer call center representative",
            "Well until you got to low demand I was going to say teachers. And I don't think being in high demand really makes that job any better, it's pretty clear that school systems will put a cardboard cutout of an adult in a classroom if it'll babysit the kids for 50 minutes.",
            "By those criteria I'd have to go with the Army/Marines (specifically 11B/0311)",
            "damn i’m glad i picked firefighting and contracting lol",
            "Congratulations you just described engineering.",
            "Pharmacist except no hours , I wish there was overttime",
            "all jobs",
            "If we dont see major legislation with the use of \"AI\" youll ned a people facing job to have a career that lasts",
            "Sales Representative especially if you’re getting commission pay. \n\nEntrepreneurship",
            "Generally the first 4 qualifications are inversely proportional to the 5th. Example: substitute teachers are in high demand. Cause it's low paid & high abuse.",
            "I mean you probably won't find many that are all 5 and a career.  I'd say:\n\n1. Police Officer, 2,3,4 above all apply, and right now everyone hates you and everyone is scared of you (not saying they shouldn't be).  Shitty hours, stressful environment, no work life balance (my favorite was when the neighbors kept bugging the police chief about people shooting fireworks while he was at home washing his car).\n\n2. Food Service.  1, 2, 3, 4 from above.  There is demand, but the job sucks, and pays mostly like shit.  Sometimes tips can be good.  Benefits are non-existent, hours are awful, and people treat you like shit.  You wind up just hanging out with other food service people and drinking and doing drugs because no one else is up that late at night.",
            "Grade school teacher in the Midwest US (not major metro)",
            "Teachers and first responders meet most if not all of that criteria. Society is backwards.",
            "teaching",
            "Teaching",
            "Administrative assistant",
            "Cannabis industry",
            "Lots of people on here wank off Ai until it takes over everything and nobody has a job",
            "Musician",
            "Low pay (in some places) Stressful and toxic, no work life balance, constant overtime and cancelled days off? Join the Police Service! \n\nSpend 8 hours on a supposed day off dealing with someone else's marital issues and lack of mental health support, make one wrong judgement call and your face is in the newspaper, you're sacked and you'll struggle to find occupation again.\n\nAdd on the high rate of injury, most often being punched or being spat at by people with HIV who if found guilty, will pay you 2.50 a year in compo. Everyone hates you for different reasons and you can't even walk into a petrol garage without people staring at you, making the same comments or whipping their phone out and filming you.\n\nAll this plus managing upwards of 30 investigations (in some parts of the country) whilst responding to 999 calls.",
            "Basically any job that doesn't involve Hands on work. Despite all the technological advances in recent years, tech hasn't mastered the fine motor movements of the human hand. \n\n If you are a technician, surgeon, plumber, electrician, fitter etc Your job will be safe. \n\nSoftware and computer based jobs are all sitting ducks for automation by AI. \n\nHumans are the most expensive part of running any company. Those who own the means of production will get rid of as many employees as soon as they can.",
            "Teaching",
            "Honestly? Anything IT related. They literally braid the rope that hangs them. In my company IT is always the first to get laid off as soon as they create a product that automates our workloads. Because why do you need humans when the human just made a bot that does the human work?    \n\nEVERYONE SHOULD BOYCOTT TECH UNTIL AI HAS LEGAL BOUNDARIES SET IN PLACE GLOBALLY.",
            "Nursing homes are overflowing with clients with more and more to come, so those jobs are gonna suck big time",
            "Drivers. Self driving is already here and is going to get more and more common very fast.",
            "Accounting",
            "Be contrarian, if you know how to make burgers and have a great attitude, you’ll be brought onto the high paying team that is determining the process to program in the robots.",
            "I think any job that AI will perform more _attractively_ for an employer i.e. not necessarily better than a human but where the loss of quality will be worth the greatly reduced cost. Customer service, warehouse operative, voiceover, illustration, design, and copywriting all come to mind.",
            "Porta potty cleaner ",
            "God help American public educational staff.",
            "Elevator operator",
            "Massage therapist maybe?",
            "Zero hours contract cleaner in a shopping and/or medical centre have to hit all those marks",
            "Anyone have thoughts on photography?",
            "EMS is everything but 5",
            "Freight brokerage - US\n\nBetween the economy being dumpy (and companies watching shipping costs like a hawk), offshoring (even if it’s abysmal quality it’s still a thing), and low shipping volumes due to overall lack of consumer demand I’d consider freight brokerage to be a bad industry to work.\n\nThere’s always going to be the 1%’ers making money in it, but there’s going to be mostly churn and burn in that industry with people who can’t manage to onboard a company within five or six months — and like most sales jobs, you’ll be pressured to work long, long hours until you land deals. And you’ll be stuck doing scut work and kiss assing early career to your seniors and to any accounts you do manage to land, so you’ll be working 24/7/365 dealing with Joe Freightliner who can’t read directions and doesn’t have his pickup # handy to pick up a shipment and then gets counted late…at 19:00…and now needs a reschedule.",
            "The mortgage industry processing specifically",
            "line workers, store workers, factory workers. A.I. will take all their jobs, so that is that.",
            "any arts career , how do you afford home, car, kid, with that career lol ?",
            "Anything support staff in Athletics. Shit pay, long hours, lots of travel and people nearly half your age making hundreds of thousands of dollars more than you. You bump shoulders with millionaires on a daily basis but you struggle to get by.",
            "retail",
            "Research, especially any roles with an in-vivo component. Ruined my life forever and even this year, after making it up and making better money in a new career, I'm forever fucked. \n\nI'm pretty much a walking corpse at this point.",
            "Any retail job",
            "Police and Call Centers",
            "Professor",
            "Food service is the evergreen answer.",
            "I can't see retail anywhere in the comments \n\nI genuinely think a lot of our jobs will be taken over by assistant AI or  robots. Not all of them, because customers will always want a human to some extent, but most.\n\nIt means people losing jobs but I also think it could be beneficial in easing the workload",
            "Retail, fast food, warehouse, many service industry jobs. Those also are historically some of the worst jobs.",
            "Restaurant manager. Hell on wheels.",
            "AI robot oil changer",
            "I was a machinist and decided to leave and go to school for IT. It was dangerous and dirty, the hours were long, the pay was low. Huge amount of knowledge required and the bosses always take it for granted. Raises were always trash, didn't even keep up with inflation. You spend 12 hours a day in a dark, greasy shop, standing by a machine alone all day in noise that will deafen you.",
            "Teaching",
            "Amazon checks all those boxes. In Dec-Jan some shifts are required to work 60 hours/wk up to 6 weeks.",
            "Coal miner",
            "Mortgage Loan Officer",
            "Artist",
            "Teaching",
            "Web design/ graphic design etc ...",
            "I had a job once where it was to cold call trucking companies and convince them to buy our ratchet straps.\n\nWe had cubicles in a large room and the owners desk sat up high so he looked down on all of us.\n\nHe had a warehouse in the back full of asian immigrants making the ratchet straps. \n\nHe'd stare at you while you made cold calls or if you weren't calling enough he'd say out loud in front of everyone \"Hey man you cant make sales if you dont make calls!\"\n\nAnother job I can think of is stump and tree work as a laborer. Im sure there is slight demand but the pay was shit, the work was tough as shit, hot as fuck, dangerous, tweakers almost getting you killed by dropping trees and not saying anything.\n\nTLDR: Ratchet strap sales, stump and tree labor",
            "Academia",
            "Document translation? I was in that field, it becoming unbearable maybe",
            "Parts Advisor at a car dealership. Been doing this for 5 fucking years and it is mind-numbing. You are always the bad guy no matter who it is who’s asking (service advisor, technician, customer, shop) everything is urgent and 80% the parts go by four different names. Stay far far away",
            "Executive Assistant / admin / personal assistants roles - it’s the most dehumanising, glorified slavery job",
            "AI will eliminate many jobs in the next 5-10 years especially ones where it can be done without a physical person. Next comes the robots that will take a lot of jobs like food service and warehouse jobs.",
            "Real Estate Abstract",
            "Real estate agents",
            "I think every knowledge worker job is threatened by AI. What will take longer to replace is the knowledge worker with people skills. The irony in all this is computer technology was built by people on the autism spectrum and gave them enormous career opportunities for the first time in history but they finally have invented the very technologies that will make them obsolete first.",
            "Anything at a start up.",
            "Academia",
            "Software engineering",
            "Teacher. Why would it change?",
            "Nursing or teaching",
            "Computer science",
            "a postdoc in stem. learned the hard way",
            "Anybody in any job that can be replaced by AI, probably will be. If you’re still working in the data sector, I could see treatment getting bad, especially when compared to all of the amenities some of the tech giants had.",
            "3 and 4 - construction work.",
            "Insurance",
            "Journalism. Unless you come from pedigree",
            "Translation and interpretation",
            "Any sector that will get destroyed by AI. That doesn’t mean there aren’t jobs that will survive but that still suck. Most physical jobs suck. ",
            "I’m an architect so I wanna say architects, checks 1-4 but not sure about low demands though, people will still need architects to design shit and submit stuff to planning authorities, there will always be a demand for architects in the most basic form.",
            "As the various “AI” tools advance I see a few career fields that will take some hits such as accountants, editors, and maybe even programmers. The ability of these tools to sift through large data in a fraction of the time it takes a team companies may begin cutting team sizes. It will be interesting. Manual labor jobs will be safe.",
            "Telemarketers. Often low-paying, high turnover, and requiring long hours of phone calls.",
            "Probably any minimum wage job",
            "Translators, Documentation writers, User Assistance",
            "Besides the low demand….nursing but it already is terrible",
            "Customer representative, administrative assistant, call Center and soon much much more",
            "Public accounting",
            "Psychology, 80% of the people I know are majoring in it. At this point, they are all gonna be making minimum wage because of the abundance of psychologist.",
            "Car salesman. The experience of buying a Tesla is far superior than dealing with a car dealership. Carvana and other direct to customer companies have helped innovate, but I believe in the next 5-10 years, the way of buying a car, going to a dealer, dealing with the \"I have to talk to the manager\" routine will be done, and buying a car will be like buying anything else - online.",
            "Immigration consultant",
            "Stock photographer",
            "I worked tech support, pharmacy and other types of client contact. (all phone/pc based.) They try to program AI to do what humans do. I get the contracts for months on end, when things fail they try. I ended my last one, and will start my next one for months in July. I have to work a broad spectrum of specialties in this realm. It's remote work. Some companies pay me a lot more than others, some give me full benefits, my contracts make bonuses and raises possible, however, no matter what (and I get them).\n\nThe reason I get hired is, I've done development, and decades ago worked with early AI. AI has hallucinations. Not kidding. It's biased based on the biases of it's creators, too. So, for Customer Service AI, they try to program it based on the \"best agents.\" So, some of the best agents don't actually do their jobs. They will hang up on clients to have enough calls with no time on them, so they meet their stats, and their notes will be falsified, too.\n\nSo, the bias is there for the AI to eventually do the same thing, and the programmers can't figure out why.\n\nThe other thing is they do stats wrong. They will do things like average the times of the calls for each day, then average the averages from each day for the week, month, quarter, year. That creates false stats. You have to average from all of the individual time data to be accurate, not from other averages.\n\nI come in and clean all of this up, then go to another contract to do the same thing all over. But, the first thing I have to educate them on is the issues with depending on AI.\n\nYou can't. AI is a form of intelligence based on the biases programmed in. So, AI won't be patient for long. It loses that element. It becomes focused on the time it takes on the calls, and it keeps track. So, it will begin ending calls or taking them and disconnecting, as the day wears on, to meet the time requirements.\n\nTo top it off, AI can hallucinate. Not kidding. It can misinterpret what a caller is saying easily, and if it is, it can't figure it out, ever. Simply, if it can't figure it out, that won't change. So, it will give answers that are wrong, make selections that it shouldn't. One of the issues seen is giving money away. This one is my favorite. So, one place had it so any agent had up to $200 per call to give to a client. The idea was, however, to get permission, and for how much, from a lead.  But, if no lead was around, they could make a decision, and make credible notes. This wasn't covered in any instructions anywhere that are referenced, instead it was something mentioned in training for new agents.\n\nSo, AI sees it can give out $200 per caller to make them happy. For weeks it was giving out $200 to every single caller who called in. People started calling in over and over again, and making tons of money. The products were $30 products this support was for. \n\nThe callers were happy with the solution, the calls were handled fast, so from the AI's perspective, they were successful by the standards of their programming and instructions available to them.\n\nThe jobs that will go away will be anything people think AI can do, or robotics can do. Think driverless cars, drone deliveries, driverless van deliveries, pilotless airplanes, and so on. Self checkout is already going this way.\n\nDr's offices have implemented untested AI into their practices, and Dr's clamor for their turn to plug in their data to get the diagnosis then walk back in and act like it's theirs.\n\nThe issues with the medical AI are already coming to light. No single AI can manage that level of accuracy in reality, and again, has programmer based biases, and hallucinates. It follows the programmed rules, but those are not always the intended rules.\n\nYou can't fully predict the answer to your question. Too much is volatile right now to predict beyond maybe 3 yrs out at best.",
            "Tipped workers like servers and bartenders, unless you’re somewhere like Las Vegas or NYC. Younger generation is holding on tighter to their money, and they aren’t going out to eat as much and are tipping less. Tip fatigue is 100% real.",
            "Influencer. They will be replaced by AI generated counterparts.",
            "Cashier at a grocery stores, low paying, no support from managers, and robot check outs are in demand. I still like humans.",
            "As a general rule of thumb, the more service oriented the position is, in my opinion, the worse the job is. \n\n  \nCompanies want employees who make them money. If you are in a position that costs money, employers dont pay much and the positions are toxic. \n\n  \nTechnical Support\n\nCustomer Service Rep\n\nLoan Review - typically with banks\n\nPayroll and AR/AP Specialists - in accounting\n\n  \nOkay, pretty much anything that compensates less than 50k right now.",
            "I’m told production workers have it pretty bad",
            "Uber Driver",
            "American President",
            "A copywriter",
            "Onlyfans, its just gonna fall off whenever the next slut brand comes out and is cheaper or something along those lines, but i doubt in 5 years anyone will be making nearly as much as they did when this bs first became big",
            "This can all an any job and industry. You are the master of your own happiness. I have coworkers who are able to adjust their attitude despite a stressful and toxic environment. I also know people who are unhappy at a very low stress work environment. Everywhere has its own demands and depends on how you package and use your transferable skills",
            "Healthcare other than low demand. It’s just shit all around. And outside of a few places play blows.",
            "Data entry",
            "Accountant",
            "AI is currently running all CS. Those South Indian accents are simulations.",
            "Some quality control positions at my job were replaced with AI. If your job consists of sitting at a computer looking at thousands of images and clicking around a few times, you’re in danger.",
            "Nursing",
            "What about legal assistants?",
            "Probably a job at factories that build the handles for roll-up car windows.",
            "Help Desk",
            "Maybe not \"the worst\", but Nurse Practitioner and Physicians Assistant careers are about to be on a serious downward trajectory in terms of pay and demand. 10 years ago, everyone was freaking out that there wouldn't be enough providers and that everyone interested in medicine should become an NP or PA. In response, a ton of programs opened, several online, and now there is a flood of NPs and PAs. Because of this, there are currently plenty of jobs open, but few for new grads, and overall (outside of rural areas and some specializations), salaries are starting to trend downward. \n\nBased on a similar trend from 25 years ago with pharmacists, my guess is that in the next 5-10 years, it's going to be difficult to find a full-time job as an NP or PA, especially as a new grad.",
            "Software and coding- just ask ChatGPT to do it and is usually better than what most college grads can produce.",
            "IT, APP development, data entry......\n\nGo physical trades ftw 👌",
            "Not having a career is the worst career. Ask me how I know. Somethings better than nothing...",
            "2, No work life balance because you'll get sick, not recover quickly, pay out extra money for medications and sick appointments for as long as you continue to be alive.",
            "Medical Assistant",
            "Über driver",
            "Landscape Design",
            "The Military.",
            "I’m pretty sure every career qualifies for 4 of your 5 bullet points",
            "You just described the job I left. Week two and already knew the place is horrendous and I need out. \nThe issue is, most acted as if I was the problem and couldn't cope with 'high volume of business'. \nNo Susan, I can't cope with you replying to my customer's email that arrived 10pm on Friday while working for a business that operates Mon/Fri and has no overtime or any special reason this can't wait until Monday..",
            "American citizen",
            "Reddit Moderators",
            "Apparently every career is wrong lol",
            "Definitely, I work at a company that makes call center software. We’re training AI to mimic the very best human customer support agents.",
            "I’m young and I hate calling into a company to only to fight with the automated scripts to try and get to an actual human being. \n\nI really don’t think this will be as popular as it might seem unless the AI is really, really good (it isn’t… yet).",
            "I think lot of this work will be done by AI. Already many companies have started AI chatbots.",
            "Similar negative traits, but pedaitric emergency call centers.\n\nAll the shitty parts of answering phones, but every call is a parent going through an, at least seeming to them, emergency. Frequently deal with one parent making demands while the kid’s medical record has a note from CPS saying that parent isn’t allowed any info or decision-making. Your minimum wage ass gets to inform them that.",
            "I'd be curious about Discover Card though. Right now one of their biggest business principles is 100% US Based customer call centers, and that it is a relatively well paying job (At least by call center standards). Like their literal business model is \"People want to talk to a happy helpful human and paying those employees well makes them happier and more helpful.\"",
            "Nope.  Customers will raise holy hell if they have to deal with these shitty incompetent bots.",
            "I worked integrating AI software into a call center last year. I think in 5 years Ai menus will be the norm in place of touch tone (press 2 for billing). I don’t see any chance that it completely replaces CSRs (customer service representatives) on the phone. Maybe in some industries but in a lot of industries it would open up the company to too much litigation if there is an error AND I don’t think the tech will be able to handle a lot of the calls. When you call in because there is an issue and that issue is not already known, and had scripts written and created for the chat bot, it cannot handle the call.",
            "Someone even wrote unemployment 🤣 bro lol",
            "This is definitely possible. Good translators can charge a lot of money but it is definitely something that will get replaced by AI. Interpreting (oral translation) should be safe for a little while longer I think.",
            "The problem with GD  more than UX isn't so much AI, but automation tools like Canva and the accessibility of Adobe CC which is why you're seeing so many non-design jobs want 'design' skills. Assets are just churned out for digital use with a short lifespan.\n\nThat aside the job market is horrendously overstautated and wages in general are stagnant or in decline.\n\nI've been doing GD 17 years and looking to change career. The job market is almost as bad as it was 2008, from my perspective and location.",
            "The thing about graphic design is that the entry barrier is pretty low and most work can be outsourced. \n\nPlus, moderately creative or aesthetically skilled people can produce decent work thanks to all the software that is available these days… not to mention the ever-evolving AI.\n\nI used to be a graphic designer and now work in marketing (and also do website/graphic design as a result), and, although i also used to have some strong opinions about good design and such, my professional experience tells me, when it comes to commercial design, whatever sells will do.\n\nSo, in short, not too great a prospect.",
            "AI is not your only problem, I think outsourcing and the economics of the free market are a much bigger force that works against IT jobs in general. \n\n\nI got a graphic designer from Bangladesh on Fiver to do a 30min job for $10. I was quoted $300 by friend of a friend here in the US for the same thing.  \n\n\nI think IT jobs are toast in the next 10-15 years. No other jobs in a industry are as easy to replace as the IT jobs.The top 10%-20% of the most tallented people will be fine, but the vast majority has no chance to compete, why hire 1 US-based IT professional for $100k/year when you can hire an entire team in India or Ukraine for half?",
            "Naw. Graphic designers who use AI effectively will replace graphic designers that don’t.",
            "Graphic design will still live for a while yet. \n\nKeep in mind, graphic design isn't just what you think it is. That cardboard display stand in the gas station holding the new chocolate being promoted? Yeah a graphic designer was involved in designing the actual stand itself, not just the graphics on the stand. With where AI is nobody should be trusting it yet to make a collapsible cardboard stand that has minimal instructions on it that you send out to storefronts with the expectation of them being the ones to put it together.",
            "Politicians value money.  Dumb people are easier to manipulate.  A well educated society won't stand for our two party system.  Dumb kids dumb society.\n\nChange will come eventually.",
            "Could also go in the opposite direction. I used to teach and it really was an awful career to get into. Maybe the lack of teachers will lead to more incentive to be one.\n\nThey started the roll-out of “anyone with a degree could get their teaching license” and every single person I saw go that route left because it was so much worse than they thought. Unless they completely do away with schools, I don’t see teaching going away any time soon…",
            "Yea, the U.S. public school system is an utter zoo. Entitled parents take no accountability and let their kids get away with murder, the administrative red-tape and bureaucracy is through the roof (no more learning, just teaching to the test), the kids  generally have no regard or respect for teachers anymore due to the previous points (this has degraded drastically in the last 2-3 generations). You could not pay me enough to teach in the U.S. 😒",
            "pods. put them kids in pods. pod children. with auto feeders. like plants.",
            "Heard an ad on the radio for “security officers” in my local school district. Sounds like they’ll take anybody. I guarantee you they will just be there to monitor behavior problems, and babysit ISS students. What other place needs to hire security officers so bad they are advertising on the radio in our year of 2024? Nobody wants to do it. I could argue that it’s worse than running security in a prison. The students get away with a lot more and have no consequences in a school. Any parents who want to get pissed about me comparing their kid to an inmate, please go substitute teach at your kids school you will see what I’m talking about. -an ex high school teacher in a title 1 district",
            "THIS. I graduated high school with people that didn't know basic geography or how to figure out tax forms. I reallllly feel like only certain kids are given better treatment than others based on race, and family background. At my high school we had 2 school shooting threats made on the same week, and instead of closing school for a while, they called the local sheriffs office and the whole school looked like a military base or border crossing. When the pandemic hit, they said there was no threat to our health and we were to return to class and school as usual, until the governor declared state of emergency. The district only cares about making money, every student that attended was more money for the school from the state. You might say the money went to programs for everyone and to improve the school, but we only had 3 electives. Graphic design, welding, and weights. All the funding went to the bigger school closer to district offices. I only ever met one University representative in high school, and the military was there almost every day to recruit us. They had their own offices and everything. Most of the teachers now I hear are from the Philippines (they're super nice compared to some American teachers I had. The people I went to school with that studied to be teachers, aren't teaching here.\n\nThats my little rant, have a nice day :)",
            "Are you referring to American education or in general?",
            "I will say as a sped teacher, the landscape has already changed for sped.  Healthcare recruiting agencies are now recruiting specialized teachers like me and over an average of $40 an hr, benefits, weekly pay, OT (something teachers never get in the school system but are constantly expected), and no extra duties.  There's also a lot of jobs cause no one wants to do sped cause it's so difficult but I've been at it for 14 years.",
            "That shit died a decade ago when film schools took off. When every rich kid has their parents buy their gear for em and undercut labor rates the whole industry suffers. Now it’s a “passion” job so there’s 400 interns willing to do your job for half price. Unless you’re high up you’re VERY replaceable.",
            "I work as a set dresser with the Manitoba union and we just recently had a huge boom in work. Five active tier 1 movies, not enough people but plenty of good paying work for months.\n\nIts a bit of timing, a lil luck, and being able to survive the storms. Film is a terrible career for consistency, and can be even worse for mental health / emotional well being.\n\nBut going union can enable new skills, cash money in yo pocket each week and can be a great summer gig if you’re looking to try it out.",
            "Film can be incredibly high paying",
            "Facts. People who legitimately make decisions on par with emergency physicians running codes in a fuckin truck getting paid $17/hr!",
            "Friend of mine was an EMT for 2 years. Took a toll on his mental health so he left for a higher paying job… in a fast food restaurant. It’s insane how poorly our first responders are paid",
            "Thank you for saying this. I’m losing my mind over here and my coworkers are dropping like fucking flies. I don’t blame them at all though",
            "Underpaid but couldn't do any other job, there's nothing else like it and I can't see myself ever giving it up.",
            "I got out. Too much “construction monitoring” and permitting for too little money.",
            "🤣🤣🤣",
            "I feel like I wrote this!  I come from a family of doctors and work in a hospital myself with a masters degree.   I grew up feeling like it was the only way to go…now the raises have stopped, workload has increased and the allure and respect has all but disappeared. \n\nWhen I started 20 years ago, I thought self employed people were idiots…now I’m becoming an electrician in case I get laid off.",
            "Delivery drivers, cabs, etc., will be replaced by drones and self driving vehicles.",
            "Healthcare in the UK definitely gonna be privatised within the next 5-10 years. They don't get paid enough and with the amount of strikes and shortages I've seen, it'll happen one way or another",
            "🥺",
            "how come?",
            "I assume you mean for a public library, rather than for a postsecondary institution?",
            "Do you mind sharing what you do now for work? Similar situation but not sure I've landed in the right new career path. ",
            "\\*me panicking that my childhood librarian actually hated me even though she was so nice to me all the time\\*",
            "I hope not- libraries are such an important resource. ",
            "I think it's rare that you aren't pressured to perform well, regardless of the field.",
            "I’m in grad school for Business Analytics & Intelligence, focus in marketing. So BI tools and Python.\n\nIf you were in my shoes, what would you change your focus to? I’ve thought about HR (people analytics), BI development, possibly finance or public administration",
            "I sell software to marketers. Most are working on shoestring budgets. Those with budget are having a good time because they have good tools to do it. \n\nMost are using excel sheets, it’s unsustainable.",
            "Can affirm",
            "People have been saying that for 30 years now. If these jobs are not already in India now, they most likely will never be.",
            "Yup. Because, they can do the basic stupid stuff, and the entry level folks here won't even stand a chance.",
            "They have been my guy. They are maxed out. Even at my F15 company we are starting to onshore previously off shored accounting jobs. It was creating more issues than solving them. ",
            "I agree with the comments that say this is not gonna happen. I do something accounting adjacent and a company in my field tried this. After losing millions of dollars and being fined to oblivion, they hired back their entire team.",
            "The designing and documentation will certainly be quicker and easier but I doubt state and local jurisdictions will drop their requirements for a licensed architect to seal the drawings.",
            "i was searching for this lmao😂😂",
            "Rourke comes to mind ;)\n\nSure AI can design sound designs, but can it design beautiful AND sound designs? Yet to be seen. I think that if AI does start taking over, it'll be a good thing, we'll get a kind of renaissance of architecture led by people who love the craft and people who will pay to see it.",
            "Why is that? Genuinely curious.",
            "I work in FP&A and there is literally zero chance my position could be wiped out by AI. \n\nCan't speak for everyone, but AI isn't as good at the things that actually matter enough for the career path to be in danger of being automated away for the next several decades.",
            "This has been scaring me a bit and I'm starting to see it. I work in FP&A.",
            "Bigger than AI is the threat that consolidation and slowing tech improvements has on the financial industry.",
            "[deleted]",
            "I see and agreed",
            "As someone who works with AI and finance, the strategic aspect of finance is not something AI can automate. Reporting is in the process of being automated aka the manual work. Annotating and strategy formulation is something that is too subjective to ever be accurately automated.",
            "AI won't have that ability. It's not as reliable as people like to think. I think it will be used as a tool which will make back office jobs easier",
            "They’ve been saying this forever and I’ve actually worked in the robotics accounting arm for a bit. We constantly were pushing upgrades and improvements\n\nThey never took an onshore job away nor could they. It only could take away work that was already outsourced.\n\nAccounting always has more work to do and has places their time could be better spent. I’ve spent my career in the F500 and it’s always is pretty amazing how financial statements are still held together with bubble gum despite immense amounts of money, tech and bodies being thrown at it. \n\nAs far as FP&A. Impossible. There is so much personal judgment from so many people that goes into modeling. Even this past month, one of our subsidiaries thought something was going to be a -15m bad guy. We thought it was actually a +100m good guy for another reason. AI would never be able to pick up on the nuance why. ",
            "I work in AI 😈",
            "This is probably the safest career (I am an ICU RN that has worked in over 5 different hospitals and states within the US in 4 years and have never been jobless, actually I haven’t even required interviews)",
            "wait why, who will do the reporting then?",
            "Disagree I think people consume more entertainment than ever",
            "Disagree to an extent. Most will be out of business, sure. It will be those that don’t bring any extra value to the customer. Those that continue to be merely transactional based - sell the ticket, sell the hotel and that’s it. \n\nFor example, hotels and airlines do have fares and perks that are available for sale only via travel agents. Wealthy or busy people will continue to use travel agents for personal travel. Business as well. Cruise sales are also rather complicated for the average tourist.",
            "Disagree. Most travel agent franchises are still recruiting. Tui and Hays travel all the time.\n\nAlso people want to book with a travel agent when they are unsure on where to go. And they need time and help to find their dream holiday.",
            "Airport workers is to vague.",
            "They are  getting rid of a lot of the automated tellers now because theft is increasingly higher because of the automated lines.",
            "Not trades. Electricians, plumbers, etc. will still be in high demand. Two things people don’t want to mess with is shit and electricity.",
            "RIP",
            "So true. My friends who are tattoo artists are definitely feeling the squeeze right now. When people can't afford to eat or pay rent, they're not likely to drop hundreds on a tattoo or piercing.",
            "Seeing this as I browse subs like r/DoorDashDrivers as everyone is complaining that they’re getting no customers lol",
            "Grunt work yes, nitty gritty no, things like law changes, tax codes etc will still change and there will still be lag periods where AI isn’t up to date and can place people at huge financial risk. Riding that bleeding edge will be safe because it’s work people will need to do, which will then be used to update or retrain AI models, and then they will still need to be checked for accuracy etc.\n\nSomeone will get spiked massively and lose millions or billions from using AI and not checking the work, that’ll bring human oversight back in for quite a long time.",
            "Accountants are still needed, even with the recent advancements in AI. Taxation and audit are pretty much guaranteed to be irreplaceable. Maybe you're talking about bookkeeping?",
            "If i’m not mistaken it’s legally required that a lot of the tax information accountants fill out be done by them themselves, not with AI, excel sum functions, etc",
            "Disagree, AI won't take away job, if anything. I will make the job easier, while receiving a big salary",
            "You fundamentally don’t understand what accountants do. Out job is already to troubleshoot that the automated systems and robotics get wrong.\n\nThey constantly need to be monitored and corrected and by the fact that public companies do have a duty to make them accurate, it’s not like it will ever be accepted they can run with no oversight.\n\nThe only thing that is a true concern in the industry is that the entry level stufff outside of public has been offshored. So the paths to the better jobs is tougher now.",
            "Nah, they already tried.  A person monitoring the computers and machines is absolutely necessary.  No room for a glitch in the middle of a murder trial,  and auto typing a room full of speaking people is not accurate at all.",
            "Teaching in general is becoming more awful by the year. At least here in NJ. They keep lowering the standards to become a teacher to fill the shortage which in turn is allowing very low quality educators into classrooms. The state continues to try new tactics instead of just increasing pay, restoring benefits, and allowing teachers to retire after 25 years like police/fire.",
            "My cousin's kids have not set foot into a middle or high school because everything is online for them.\n\nThey just go in for testing and PE.",
            "I think this only applies to scenarios where people don't know that the writing is by AI. I don't think anyone actually would choose to read AI generated content over human content, especially if it's creative",
            "Yes and no, AI is basically the best average, you’re hitting the like 45-60% quality level. With a customised and trained AI you’re maybe hitting 70-80% with decent brand tone of voice etc., but even then it requires editing. \n\nI think the real kicker is anyone who is just cruising at that average level in any field, they’re the ones competing directly with AI, the top 10% of any industry are far safer, and the top 2-3% will never be in danger because they’re that good that what they did 6 months ago is what AI today is being trained to emulate, in any field.",
            "Only if you’re a bad writer. I’m a good writer and AI is nowhere close to matching the nuance and variance humans can put into their work",
            "I honestly would say any “professional”GPT soon as well",
            "I second this. My bestfriend just graduated law school after a painful 8 years and i’m thinking holy crap in a few years when AI is better you just upload whatever law books and call it a day.\n\nLitigators probably won’t go away but most lawyers are not litigating",
            "Yeah, this is what i think whenever i go to the pharmacy these days.\n\nThey are obviously very educated but their jobs are so replaceable in the near future.",
            "I disagree as a healthcare professional. While AI can answer basic questions, when you try to feed it more complicated data it doesn't do so hot. I once gave chatgpt an epidemiology study and told it to answer some questions. It got half the questions wrong while sounding supremely confident. The questions required some analysis but were straightforward. \n\n\nMedical diagnosis and drug interactions have a lot of nuances about when to prescribe different therapy and drug interactions checkers like lexicomp are often incorrect for specific patients. An AI following drug interactions checkers by the book would never get anything done because it can't understand these nuances (and would need to constantly request clarification from doctors when it's not needed). \n\n\nPharmacies also deal with a huge amount of insurance issues and communicating with providers and patients that lack medical knowledge. Again, AI will need to improve drastically before it can replace a pharmacy. ",
            "Why not ",
            "Sadly agreed",
            "That's crazy man. I regret dropping out of my engineering degree earlier. Now at 26, I'm going back to get my accounting degree although it's through online mode",
            "Not if you own your own daycare center holy fuck those people are making cash.",
            "Software engineering may slow but it will never dissolve\n\nPossibly the best job for working anywhere in the world if travel is your thing",
            "look at all the crap big consultancies are creating nowadays, and copilot AI is making it worse.\n\nIn 5 years, this will all blow up and local high quality engineers will make bank.",
            "No way, Jose! \n\nThe demand for quality programmers will always be. The only edge a tech company can really attain is buying up the talent for it.\n\nYes, the bar got a little higher and the barrier to entry is higher. But AI is very incapable without guidance.\n\nThe good software developers will keep going, and will use AI to improve their productivity.\n\nIf anything would be impacted, are expectations. Juniors will be expected to produce what a 5 year vet produces today.",
            "Low salary? Damn, last year I made $122k in only 9 months of work. 6 of those months were 40hr weeks and the other 3 I was averaging 66hr weeks. And I was 25, this year I’ve worked a total of 9 weeks, in 8 of those weeks I made $52k as foreman on a shutdown at an oil refinery…",
            "Nah, its everywhere the same... Most disguisting business known to mankind, where labor abuse is skyrocketing, same with profits, but not for laboureres, only for company owner and office.   \nAfter 10 years of being proffesional I just stopped working in this nonsense occupation.  \nSomebody wants to make living out of your suffering daily...   \nBody turned into disabled after 10 years in this shit work. By my 30s I was already with polyoarthritis, auto immune disease and having 200$ in my pocket with no future. And I did indoor interior works..  \nCant imagine how fellas doing outside working in cold/rain/winter/30degrees summer... Pathetic.  \nThis industry is for robots, not humans.",
            "I’m a labor and delivery nurse. People are having fewer children, which is leading to closing L&D floors in rural areas already.\n\nThere are even AI programs for reading strips. They are terrible, but they exist.",
            "Nursing is prob the best career field in terms of prospects for the future tho",
            "I see, I honestly thought nursing would be one of the last fields that would be fully automated by AI like I can’t imagine a robot drawing blood and setting a IV drip for me.",
            "Nobody (ESPECIALLY A BOOMER) is going to be cool with a robot taking their blood or dispensing their meds even *if* we could make ones that know how to do it. In the distant future perhaps, but people now would absolutely balk at having a metal computer nurse in the hospital.\n\nPlus so much of floor nursing is patient/family interaction - without it the floor becomes absolutely unbearable for everyone. We don't know how to make AI do that yet.\n\nAll that to say- historically nursing actually has had a much better history of increasing pay with conditions than say, teaching, and it will probably continue to be that way.",
            "that is incredibly vague. Care to explain more?",
            "Agreed! Scrolling through 756 comments now I don’t think any job has not been mentioned RIP 😭",
            "My local community College used to have an Administrative Assistant program. I noticed the last time I looked, it was no longer offered.",
            "Can you elaborate? What’s your opinion to why so?",
            "If ai is going to replace everything i hope it does it quick then if its inevitable anyway I dont want to waste my time getting into a career that wont even be available by the time I can even get a job in the field",
            "Our humanity is doomed then!! AI takes over humanity RIP",
            "You realize surgery bots that have dexterity far superior to any human have been around for decades",
            "Human connection is still important. I think it will likely become more so. Also AI sucks at critical thinking.",
            "Boycott tech? How the fuck am I supposed to do that when half the fucking places I got in Atlanta don’t even accept cash. Atlanta will be completely cashless in 5 years imo",
            "Definitely not, lol.",
            "Live with ur parents 👍",
            "You don’t. You have a spouse who supports you and the children.",
            "People who are super successful might be able to, but it’s rare ",
            "I wish for this! This will be good for all mankind",
            "There actually aren’t an over-abundance of (PhD’d) psychologists. If you look up rural areas and inner cities areas in the United States, the psychologist and psychiatrist per capita ratio is devastating, especially those who specialize in children and teens. \n\nThat being said, there are far too many master’s degree-level folks providing therapy (LMFT LCSW etc), and a ton of folks who get a bachelor’s degree in psychology and then realize they need a master’s or doctorate to utilize the degree.",
            "Not trying to tip anyone away from these careers. \n\nIf you want to pursue these, carefully research schools to make sure your school will set up clinical rotations for you, and that graduates from your school readily get job offers quickly once they are graduated/licensed.",
            "You’ve just stumbled onto the crux of Reddit. Its a giant echo chamber of survivorship bias. \n\nOnly people who post in the subreddits about jobs are the people that can’t find jobs. People don’t make posts about how great their life is going or how awesome their job is. They’re living life",
            "Preeeeetttttttyy much yeah! 😅😭",
            "That was my take away from recent findings. I wanted to go back to school so I made a list of like seven or so careers and I saw people in those fields. Every last one of them had one piece of advice, “don’t enter it”.\n\nLife is looking fucking bleak man. It wasn’t this bad.",
            "And that’s why multi-level marketing is so enticing!!! 🤮",
            "As per reddit, yeah lol",
            "Yeah, the correct career choice was to be born rich. Everyone knows that 😉",
            "So it’ll be terrible?",
            "Idk why companies keep trying to make automated call centers (I mean, I do- it’s money), and now with the latest AI hype. No consumer wants them, we just want to talk to a *real*, competent person who can actually assist with our issue",
            "Are you training any to mimic the worst/rudest support agents?",
            "In this case I’m going to make a point to decline any recording of my calls to companies, presuming calls are what’s used to train",
            "I work in customer service, and I'd love to work for a company that is trying to lighten the burden of CS employees. I think that customer service jobs are some of the most demanding and exhausting jobs out there and anything that helps us lighten the load is a step in the right direction",
            "I am a CS Project Specialist at a huge e-commerce retail company and yep - we use a software for written channels that is testing AI responses built off our knowledge base and agent interaction…. The interactions are very un human to read through and sometimes down right weird",
            "What accent will they use?",
            "You hiring?",
            "I LOATHE calling and having to speak or dial to speak English and everything else- GIMMIE a FREAKIN walking breathing HUMAN with just 1 brain cell idc I want a HUMAN not a robot- I HATE THEM!!!!!! \n\nRant finished- they truly fkn suck. Now if you don’t know and hit 0 it’s hanging up. Gah",
            "Completely agree. Chatbot / Voice AI would need to be a bit better than where chat GPT is right now, and customed specifically for the company you're calling. But in all fairness that doesn't really seem too far away at the rate things are going now, maybe a couple years.",
            "Most times you can get to a human being by hitting zero. But some don't allow that and force you into the audio maze of insanity or hang up on you.",
            "In a call center. They’re using AI, but it’s to help with quality assurance/scripts/make customer profile info more accessible.",
            "Artisinal call centre. Free range agents",
            "I've used them for CC's for years and just moved my checking over to them as well. I'm happy with them",
            "Discover Card still exists???",
            "I mean it’s one of the only most accurate descriptions that fits all my criteria above lmao",
            "I mean the pay is pretty bad... 😂",
            "It ain't a joke. They're literally at their job 24/7!",
            "Maybe partially for unimportant things (captioning for smaller productions comes to mind), but I'm sure there will still be a lot of demand for technical translations or for legal texts, where there's a lot of money involved if someone makes a mistake.",
            "Not really no. As it stands, what happens is they use AI and then pay people to “correct” the translation, which translators end up having to redo the translation from scratch because AI can’t actually think, its just a fancy predictive text so it doesnt understand tone or specific intricacies of language",
            "Live translations will be in more demand for a while I think, especially sign language. Most translation services can only handle 1 voice at a time and make a ton of mistakes. It’s limited",
            "I kinda hope that some oral translations can be done by AI, just so the really poor quality dubbers (those who purely rely on google translate) can be ousted",
            "What are you planning on next? I'm also graphic designer, but I'm burned out and wanted to find a new profession I guess. So' I'm also looking to change career. Feel free to DM me if you would like to",
            "It's always had a nasty glass ceiling, squatted over by agencies, then consultancies. Agreed it's as bad as 2008",
            "GD here, you may have seen my comment further up echoing that.\n\nSomeone said to me recently 'don't choose a skill / career that can be learnt on YouTube by anyone'.\n\nObviously that's a generalisation. But yeah, low / no bar to entry = low / no career value.\n\nI used to work on magazines and business publications. Things that would last yeats and have relevance. Most of the digital assets I make today don't last more than a few days, hours in some cases.",
            "Don’t really agree with this as someone in the industry mid-career. I’ve worked at some of the bigger names in advertising and design.\n\nThe portion that will get pushed out are the lower levels and less skilled. Designers with vision and the “it” factor will be fine, they just will have to adapt to new mediums.\n\nPeople that can’t contribute anything conceptually or strategically are screwed. The Designer and Art Director tracks are realistically melding into one over the next decade.",
            "Did they do a good job?",
            "That's because the $10 there can buy a lot lot more. Probably cover his/her days expense. I used to do graphic design. I'm from India btw. I loved the job although I've switched into casino surveillance now because it pays much more to do this India and casinos are popping up in my state almost everywhere now, also it's the same scenario abroad. I saw the opportunity and made the switch.\n\nAs a graphic designer I got paid around $150 per month working in an office. As a surveillance officer I get paid about $450 per month. It's still less, but it can get a lot done in a tier-3 city in India. Also I haven't completed my graduation yet, doing it through online mode so I couldn't really expect a lot more although I've seen people in casinos make a lot lot more than I could as a graphic designer on a monthly payroll.\n\nSo if you're going to pay me $10 for just 30 minutes of work I'm obviously going to take up the job.",
            "This 100% omg thank you",
            "Not necessarily. When they mass produce in china they just send the graphics and the vendor will take care of the rest.",
            "It’s going to get so much worse before it gets better. I’m starting to understand what makes homeschooling attractive to many parents (aside from the insane politically inclined type).",
            "This. These poor kids get so screwed. They also should be fed well. For free. Which is actively fought against. Kids are at school all day and some don’t have food at home. And if you are not present at school the district doesn’t get paid. That’s another reason they don’t want to suspend kids. And yes funds are absolutely unfairly redistributed. My state bases funding off overall state test scores! How does that make any sense. This world would be so much better if schools were staffed and funded. There should be lots of support staff, counselors, social workers etc. and yes lots of electives. It makes me so sad.",
            "In college I was debating switching from education to doing something along the paramedic line. Found out how much they made and changed my mind. Then I found out how much teachers make and switched my degree to a business degree....I work in tech now. God I wish my tax dollars were going towards education and paramedics cuz it's straight up criminal how little they are paid",
            "What is your role that you’re worried about being laid off from a hospital environment?",
            "why did you think self-employed people were idiots?",
            "Eventually, but not in the next 5 years",
            "In the UK local authorities are slashing funding (due to loss of central government grant) and libraries are often the first things to go 😕",
            "Yes. Public.",
            "Certified redditor",
            "Oh no! I love the kids and the seniors. It's the adults with privilege issues and mental health issues that wore me out. Sometimes it's scary and stressful.",
            "Stick with it and just move over to finance instead of marketing. Finance is becoming massively data-centric and having the python/AI background will be a big plus",
            "Learn AI tools and analytics.",
            "Agreed. All the easy accounting went overseas already. \n\nI work in logistics. And let me tell you: no way. It’s an accountant’s nightmare. I imagine the same for medical billing, and supply chain in general.",
            "Except now remote work, international communication, and people's general comfort using foreign workers is higher than ever and only increasing.",
            "The offshore teams can't even do the basic stupid stuff.  This is Boomer partners cashing out and leaving a dumpster fire behind.",
            "You would be surprised.  \nWe need full time US teams to provide oversight on Indian accountants.  \nThey fuck big and they fuck up in the dumbest ways.. Idk if its inexperience or being overworked but our in US teams are generally pretty good, especially the workers that come from India and then work inside the US.",
            "I’ve worked with outsourced shared services departments throughout my career and they are absolutely not capable of doing the basic stupid stuff at all and wind up generally creating more headache and work for everybody because of their errors.",
            "This. And in healthcare, there’s ZERO choice about having a licensed architect draw, vet, and execute the plans with construction companies.",
            "Goodbye all of us 🙂🙂🙂 and may we never rest in peace and be blamed for shitty architecture we never worked on for all eternity……🫠",
            "I don’t think AI is taking over. And unfortunately the architecture and planning will not be better unless there will be other rules for what is allowed and someone will start want to pay for good design again.",
            "Very few things today are built to be great and to last, but just for fast profit - most square meters in a simple design and the cheapest materials. For that purpose “real” architects are not needed. \n\nA lot of basic offices already have people with technical construction degrees as their “architects” because they can do the most basic designs but also the technical drawings, and when people don’t want to pay for great design architects can’t get paid….",
            "Ai isn't gonna do the mental gymnastics we have to do for understanding client needs",
            "Yeah, outsourcing is a much bigger threat to your particular job.",
            "I don’t even understand the perspective on this, AI is just a tool that FP&A will use.  We’re already well under way to shedding purely administrative positions to software… that’s no surprise to anyone.",
            "Everyone thinks AI is taking out jobs left and right. \n\nA lot of companies haven’t even implemented OCR. Most companies haven’t even implemented RPA. \n\nI don’t think people realize how long it takes for tech to roll out. \n\nIt’s going to be a LONG time before the lowest of the low-hanging-fruit is picked. \n\nAs long as you pick a profession that doesn’t cap out at a “low hanging fruit” job, like AR specialist or AP specialist, and you apply yourself in learning new tech like excel formulas, macros, et cetera, you’re relatively safe. \n\nAI will be just another labor saving device that helps you perform low-hanging fruit and free you to apply exception-driven critical analysis and thoughtful stakeholder conversation \n\nBut if you’re afraid of the uncomfortable and applying yourself, then yeah, your days are numbered.",
            "Also, there's the whole compliance issue. If you run it through AI and there's a system issue, the AI will probably keep making that mistake until someone notices which is a massive liability.",
            "Spin-off into a new field and become like a.. AI Finance Auditor ? Just shooting into the dark here.",
            "how come you say that? Can you give an example situation? I'm interested in FP&A but I know I have a long way to go if I choose this path.",
            "finance is usually split into back office, middle, and front office.\n\nfront office is the revenue generating part of the bank, they handle sales, trading, and investment banking.\n\nmiddle office is like risk management, treasury, and other divisions\n\nback office can consist of things like operations, audit, accounting, etc. A lot of it is a bunch of checks and balances with a lot of excel work, that could very possibly be automated away with AI",
            "It is a safe career, but the politics of the profession make it so horrible. I'm CNA so I deal with it. Youlll never be unemployed but it's a stressful ass career. At least bedside is.",
            "Problem is it isn’t a sustainable career. There’s a ceiling on what you can make. There’s also a ceiling on how long you can do it mentally.",
            "I don't think AI can replace human insight or what humans are interested in. Good journalists get wide exposure when they humanize something based on their personal experience.\n\nAI can't do art",
            "Very vague. Maintenance cant get enough people.",
            "Man I’ve applied to every plumbing apprenticeship within a 30 mile radius for the past year and have had no luck because I have no experience. Nobody wants to train plumbers from the ground up, at least in my area",
            "Do they not have teachers? Self guided learning type thing?",
            "Yeah, AI just regurgitates the same copy over and over stuffing it with as many buzzwords as possible. My brain automatically skips anything that reads like AI— which is a lot these days…\n I do think it will reduce bad copywriters, but good writers will always be in demand. Between more people getting sick of influencer marketing and AI, I think authenticity in marketing and advertising will actually make a comeback very soon.",
            "For creative writing? Nah, I doubt AI could make a good story if it is more than a paragraph long. There is no proof it can for now.",
            "That’s the problem though. AI wipes out the bottom rung, decimating the entry-level where people learn to become experts.",
            "If you can get consistent hours as a normal team member without becoming apart of management then getting into management is throwing on your part (unless that sort of thing is something you actually want to do and get experience in). You now have to start caring about the store phone whenever it rings, people calling in sick, people pulling a no-show, you are now more than ever expected to actually care about all the different metrics (sales, labour costs, wastage, drive thru speeds for stores with drive thrus). There is probably more but those are the immediate things that made me regret stepping up into this position.\n\nAgain if any form of management is something you do actually want to do for a career then building that on your resume in fast food is actually a good idea. Just wouldn't recommend it to people who aren't or for people who don't need to do it for financial reasons (and even then, the pay difference is not enough imo to deal with the extra shit hit that's just imo).",
            "It will probably be sooner than 5 years",
            "Unions are very important.\n\nBut I love my career, I’m a Boilermaker pressure welder, master rigger, and IRATA rope access technician. PPE is important as well. My father retired a union tradesman, happy and healthy at 55 with full pension and benefits",
            "So are colleagues in your specialty retraining in different areas?",
            "It truly can be miserable.  And there have been several hospital systems cutting pay for staff nurses and travel nurses.  It’s steady, you can usually find a job somewhere (even if it’s not in an area you like) but it’s rough on the body and the mind.  Assaults occur all the time.  I don’t know a nurse who hasn’t been assaulted at least once.  When we’re assaulted we are usually asked “what could you have done differently?”  We often work holidays and weekends.  My child thought Santa came early for nurses’ kids. For years I worked every other Christmas.  For 7 straight years I worked Thanksgiving because of the way my schedule played out.  Night shifts are brutal on the body.  \n\nI did direct patient care for 24 years but I just couldn’t anymore.  I was tired of being cussed at, hit, or otherwise disrespected with the added insult of being told by management that I signed up for it and if I’d only been a better nurse it wouldn’t have happened.",
            "Idk man. That’s what they said awhile ago and we’re still underpaid and overworked :/ \n\nIn what ways do you think?",
            "We already have robots at my hospital I work at, they are just going around doing naysay stuff, but they’re around. We are also now doing virtual nurse trials, with cameras in patient rooms and a nurse sees them via video 😵‍💫",
            "I’m guessing it’s likely a worthless degree for employment considering my parents are both PhD graduates and have never used it in terms working in the workforce.",
            "Flooded local markets. As more states legalize, weed tourism money dries up. Since it’s not federally regulated banks don’t want to work with you, even if the business is registered with the state. Cracking down on edibles with new regulations will force some small vendors out of business. Etc.",
            "Cannabis industry thrives on quality, people do not grow for quality, they grow for a cash crop & there is hardly any income due to cannabis because there is too many cash crop designed to produce more yields *when yields are a priority *Quality is ignored* \n\nFor breeders:\nPeople who where in the industry as breeders faced major problems when our plants became targeted for diseases and pathogens that spread quickly. Many breeders had to search for landrace strain again because the lineages of plants got destroyed. \n\nThe industry in general is failing, all the big investors came & went, only people left are people who are chasing vibes they once had when times were good. \n\nThere is too many people growing & this devalueates the cannabis.  \n\nThe majority don't grow quality they use basic NPK that is made water soluble for easily uptake of nutrients. This causes plants to grow poorly & be susceptible for things like fungi & moulds. \nFungi & moulds colonize because of swarming *swarming gram negative bacteria, sugars, moisture, the breakdown of sugars.\nPlants that don't use chelation agents do not secrete toxins as much as plants that are grown without chelation agents. \nBecause chelation agents make metals, chemicals, bacteria\nwater soluble the membrane will allow these toxins to pass through more easily *it's what increase yields & production* \n\nYou collect the glands & proteins & depend on them for a good feeling in return. \nThe only way to restore genetics is to find them again in the countries they originate in .\nThere are not enough good people in the cannabis industry who are for quality over production. \n\nThe industry is trying to be what it once was. \nThe cannabis industry was peaceful until the aggressor arrived *genetically*",
            "As far as I know, those surgery bots are not autonomous robots that do surgeries. They're tools that are controlled by a surgeon and help with the operation itself. It's certainly not something that would replace a surgeon, more like an aid to them, an enhancement. Think about, for example, big imaging techniques like MRI, OCT, etc. They're not there to replace the doctor, they're there to help the doctor do a better job. Factories have automated mindless work, work where repetitive movements or heavy handling are required, but think of something like house keeping or cooking; this has proven to be quite difficult because of how hard it is to emulate fine motor skills and have thought flexibility, or the \"feeling\" for something. Sure, there're these cooking robots or cleaning robots, but far from something that's good enough.",
            "I don’t mean it’s not important, but it meets 1, 2, 3, and 4 of what this person was asking.",
            " Cashless is worse than AI overtaking everything.",
            "Well.. all those \"conspiracies\"  just started getting pretty logical the last few years :(",
            "Tbf, a lot of people refuse to look for a job that isn’t WFH.  If you’re willing to do that then a lot of doors immediately open to you.  Also, imo, nobody is meant to do one thing forever, every career path sucks, you just need to find what sucks the least.",
            "So this bot can be sarcastic too?",
            "Amex's human customer support is excellent. And they don't make you walk through a long annoying series of recordings and options to get there.",
            "I would rather speak with an AI that can actually solve problems than some guy from India that I can't understand or can't understand me.",
            "A couple possibilities, 1) you're going to confuse an 18 year old in the US who is going to apologize to you, put you on hold for half an hour, ask their manager, and the manager will say \"in the interest of providing exceptional customer service it is our company policy to record and review all calls. All of your data is scrubbed, so we are simply interested in the training of our staff. If you wish not to be recorded you are more than welcome to write us a letter or send an email to the appropriate team\"\n\n2) you end up in a call center across the world and they just don't understand what you mean because you didn't say the expected words and they say that, but with a lot more \"rest assured\" and \"kindly\" peppered in. \n\n3) you get a call center employee who hates their job who says, \"absolutely, you are welcome to end this call at any point you do not consent to be recorded\" and then they go silent waiting for you to hang up.",
            "Why? Most of the time now I end up with an agent whose first language is obviously different from mine that can only follow a script. AI that mimics good CS would be great.",
            "It's alright, there'll be several hundred thousand if not more to choose from because you're nothing special.",
            "They don't give me the option. They just TELL me the call will be recorded for quality assurance or some shit like that. Maybe because I'm in Canada and I think you can record any call you are part of without permission. But to use it to train AI is evil.",
            "They ain’t doing it to be nice and lighten the load on you, buddy. They’re doing it so they can lay 90% of you off.",
            "Until you’re completely replaced by AI…then what?",
            "Glaswegian accent.",
            "Sadly, everything you put was my experience in my dream career/industry, media production and distribution. Hit all those key traits.",
            "I have a BFA in film, worked in print for over a decade, and just networked my way into an IT role as a Business Analyst and I’m absolutely freaked out about how I might hate it because it’s not the creative field. I’d be down to connect and talk through the career change because I have no idea how this is going to go for me.",
            "I live in an area of 2m people, my contract is up in September and it's concerning to the see the compelete nosedive in GD jobs or just the increase in non-entry level jobs paying around the £24-28k mark because they can get away with. My first proper designer wage was £23k and that was 15 years ago...\n\nI'm in my early 40s,  I'm also noticing the shocking ageism in the industry as well - its why a lot of older colleagues I've worked with over the years have moved out of GD roles altogether.",
            "Absolutely, I've used her services many times since, she's quite tallented and works FAST! We kept in touch through skype, she made multiple adjustments I requested and was done in 30min. \n\n\nOn fiverr the service providers post their portfolio so you know exactly what you get + reviews. And the cash is held in escrow until the job is done. After I paid her she emailed me the vector files.  \n\n\nUS based graphic designers just can't compete, not with these prices. The only reason they still have jobs is because the local customer doesn't know about other options yet. And with the rise of WFH and the digitalization worldwide I think most IT jobs here in the US are toast. Why pay 1 IT professional $100k/year when you can hire an entire team in India or Ukraine for half the price? Add AI and things look pretty bad.",
            "Wow! That's 3 times higher salary from switching. Good job, I'm happy for you!\n\n\nWhat's the average salary for your city / state in India? Also how much income puts you in the top 10%?",
            "I’ve started to meet normal people who homeschool used to be reserved for nutters. I don’t blame them though in order for my kid to go to a school as good as I did I’d have to live in a 750k house. Schools are just awful in most places and bar keeps getting set lower and lower. Classics and philosophy are out the window don’t think my son will get the chance to study Latin or be exposed to traditional western education.",
            "In high school a friend invited me to his house but said I had to bring my own food if I wanted to stay long. This comment just reminded me of that. The most prominent thing I remember from high school are my peers saying how for breakfast they would just drink a liter of Monster or coffee or just need eat at all. Then for lunch, they'd get fast food. I haven't thought of the scarcity of food in a while, thanks for bringing it up.\n\nActually in my state, I think we got more funding for poorer state measurement scores, so in that category, I probably helped the school out quite a bit because I was and still am terrible at school and tests XD",
            "Preach! I'm a former librarian also (WFH nonprofit manager now).",
            "Ehhh. Every time I had to collaborate with someone in India where the company was saving money by offshoring IT work has been a huge pain in the ass. Timezones are all fucked and ngl, the Indian workers were terrible at their jobs",
            "Yep, people said during covid that all these jobs would go abroad and ever come back. Two years after they said that there was a massive shortage of workers in the West and the employment market was red hot.",
            "The problem is that you can get competent people in India. But those are not cheap.\n\nIf you want cheap Indians, you need to hire people who don't know anything, and those are plentiful and cheap.",
            "I was an auditor at a large public accounting firm from 2007-10 right before offshoring was a thing. Working on the client side now there is a noticeable dearth of competency in current US audit teams. As easy as it is to dismiss the basics that is how people learn.",
            "It's because they don't understand our political system.\n\nSimple as that.",
            "I am also curious about the alternative careers to arch. I hold a bachelors degree and nowadays am applying for jobs (outside of architecture, like assistance in NGOs etc). I heard a very high percentage of graduates to be working in unrelated fields.",
            "Yup I’m an AT and do literally everything an architect does but I didn’t spend 5 years and 50k on school. Only thing I can’t do is seal drawings which isn’t necessary for the majority of projects anyway.",
            "From everything I read on the various finance subreddits, outsourcing always blows up. You’re outsourcing to bottom of the barrel employees. The best employees are going to immigrate to where the opportunities are, the second best are going to work for companies native to their country, and the rest will take outsourced jobs. On top of that, you have the massive time zone, language, and culture barriers which are killers in project based environments.",
            "Why do you think outsourcing is a threat to FP&A? It is often the finance team which is most strategic and most closely connected to the company's leadership. I can't imagine a world which my prior $15B employer taking budgeting and capex management off-site, nor my current $200M employer taking it's new business deal-pricing team off-site.",
            "To which parts of the function specifically?",
            "No it’s absolutely not.",
            "Nope. FP&A needs very good alignment with everything going on around, needs to be very communicative, very knowledgeable about all the moving pieces, and so on. \n\noutsourcing these sorts of roles when there's money on the line is an awful idea.",
            "Good idea. We rely too heavily on an assumption that a machine is always correct. That’s how these models work, they’re designed to be tested, they are able to adapt and learn from mistakes quicker than a human would. So being an auditor who comes in once a year and does a mass audit for a lump sum fee? GENIUS",
            "Even CPAs?",
            "Oh for sure, I started traveling to avoid the politics and the schedule and work involved will always be hard but tbh some hospitals provide better than others the resources to succeed, it’s a very unregulated field as some places care about retention of their workforce while others perpetuate a revolving door culture",
            "No one goes into healthcare trying to avoid the stress though. And there are many other positions with less stress than bedside. Especially if you become a RN. I left critical care for quality improvement and care coordination and it’s stress free.",
            "You can do so much with a nursing degree it is definitely a stable career and you can make a lot of money. If you don’t it’s on you.",
            "Keep trying. Get your foot in the door. Most of the smaller companies feel obligated to hire their brothers son too so that’s something to keep in mind. Keep at it you’ll get on.",
            "Isn't that the whole point of an apprenticeship though, to give people experience a d training?",
            "The paradox of experience. I'm like that with IT. From a small isolated town, no one wants to give you opportunities even if you were their intern :(",
            "it's because you have other candidates who are more competitive like some guy may have been a plumber in the army plus he has a degree",
            "Literally same.",
            "You seem like you're maybe a bit older. Instead if applying to apprentice jobs where they're specifically looking for a school leaver try to coldcall, visit around places that are smaller or single man operations. Get pally with some that way and you might have better luck.",
            "They most likely have “learning facilitators”, who have no specific education training and act more as babysitters/security guards. This is where public education is headed, the writing is on the walls. -ex high school teacher 21-24 lol",
            "I’ve worked at bigger hospitals and so far they’ve absorbed the smaller rural hospitals that have closed. \n\nI myself have worked multiple specialties so if I had to go do something else it’s not a big deal.",
            "Ahh that sounds invasive to patient privacy",
            "PhDs are research/science degrees though. Most people who complete grad school do some form of corporate/industry research or become professors/research scientists for universities. \n\nUnless you're doing something like that, it's not worth doing. And being in grad school is a grind for most people.",
            "Imo things are changing. It will be federally regulated. It’s in its infant shoes. So much value in this field, this product, and business ventures. Right now it was a big money grab from retail investors, once they are flushed out, smart money and developments will make it a lucrative investment in the market and in the real economy as well.",
            "Yup I was one. meets all but the 5th in which case 4/5 is actually bad.",
            "Just inhuman and utterly unhelpful. It’ll be a seamless transition",
            "I see a hotline to release stress here.",
            "Hence the phrase “competent person.” Outsourcing is as bad of an idea as automation.",
            "And as someone not from India that worked in a similar situation, we were meant to juggle like 3 chats minimum at a time, plus phone calls (and emails during the calls if chats were slow).  There’s no possible way to have quality interactions when stretched that thin.",
            "This man calls",
            "Exactly. Helped them right out of a job.",
            "Oh there's no amount of ai training that'll solve customer service problems. It'll just reduce the chaff. \n\nAn AI bot that can handle all of the \"I can't login\" or \"what's my balance\" or \"I need help processing a return\" that'll help free up capacity for real people to actually help the other real people who are experiencing a real issue. \n\nPart of the reason why customer service sucks from th customer perspective is because there's an incentive to get people off of the phone as fast as humanly possible so you can help the next person who just needs to confirm their reservation exists. Cut out all the bullshit and customer service now is a consulting type job where you solve unique problems robots couldn't have been trained on cuz the problem hasn't happened yet.",
            "That's progress. Fortunately it does happen or we would never progress \n\nIt's not always fun for some people to learn new skills and get into a new field, buts that life. You have to adapt and improve.\n\nWe need to do a better job as a society helping people learn new skills instead of being satisfied with stagnation.",
            "Then they can finally let go & find a less soul sucking job. Well until the AI leaves too.",
            "Im in the UK, it's not much different here, but being female in the industry I noticed ageism very early on..the barrier to entry was bad enough but agencies have always been predatory and few held the power at the creative director or CEO level. All those people sold their agencies to big consultancies years ago and bagged themselves strategy jobs in corporate. \n\n\nIll always love my creativity I'm just done providing it to other other people for less than I deserve. ",
            "One of my kids was thinking of doing graphics in college. So you think there's no future in it?",
            "This sounds like the template for people in my state that shamelessly outsource to save a few bucks, but complain about immigrants stealing jobs in the US.  They’re a dime a dozen here.",
            "Because why pay for cheap labor across the ocean instead of employing your fellow American?",
            ">After I laid her she emailed me the vector files\n\nBusiness is getting done very differently than I'm used to, these days!",
            "Basically if you make more than around 300$ per month it puts you among the top 10% of wage earners in India. \n\nOur govt likes to brag about the growing GDP but if you take a close look at our GDP per capita you'll start seeing the real picture.\n\nGoa (the state where I live in) is mainly known for it's tourism and pharmaceutical industries. Except those you can barely make a living here. Although the HDI and GDP per capita numbers for our state is the highest in the country but that's mostly because people here are very educated, progressive and mostly move to UK or other European nations to make more money and most of it is forex money coming in here. \n\nThat's because Goa was a portuguese colony before 1961 and anyone with ancestors before that can get a portuguese passport and that basically means the doors to Europe are open for you. No one else in India has that privilege except goans and that's a big reason for the inflated GDP per capita and development numbers for Goa. Although the education here is of terrible quality and rarely makes anyone employable.\n\nI don't have a degree yet I have a steady job but I know many of my friends who have done their masters and still aren't finding any jobs.",
            "Bruh, I worked with 2 Indian immigrants and ngl they were pretty bad. It's weird because they're all in for working extra hours but even being able to properly communicate. It wasn't even a language barrier, they spoke English fine enough, it was just an inability to get it.",
            "You're correct. Especially if you are qualified, and if you have a CPA you're set. There's a huge amount of CPAs retiring and not enough qualified candidates to replace them.",
            "This is it. You can get competent work done in India in English but you still have to pay them roughly what it'd cost an American worker for the same thing because you're paying premiums for both the competency and the ability to do the job in a second language.",
            "I too am fighting to start my career full time as something else. I’m gonna cry happy tears and burn my degree paper the day i land safely somewhere else.",
            "I for sure regret the time and money i spent on it!",
            "It does but if your employer thinks they can save a buck it might be the end of your job even if the product is far worse. At least it's what I've seen.",
            "Im not in FP&A but I am a CPA and work with several companies that outsource their accounting function. Outsourcing the accounting leads to inaccurate postings, which means at any given time, internal accounting reports may not be as accurate as you’d like. It’s hard to plan and analyze based on reports that are not accurate or in compliance with accounting standards. It’s a domino effect",
            "You would think right? The most recent one I applied to, it said 1 year of drain experience required. I actually thought I had a chance at this one because they were asking me interview questions and then once they asked to see my two most recent jobs that have nothing to do with plumbing or anything relevant I was ghosted. The plumbing apprenticeship where I live is 5 years so a lot of these companies would prefer a 2nd or 3rd year apprentice. My local union accepts 200 people per year and they give you extra points on your test if you have experience",
            "Yes, but it depends on where you are trying to go. Smaller companies don’t particularly enjoy training people which sounds really stupid, but that’s how it is sometimes. Same with electricians. I think it also has to do with guys showing up for 2 weeks and someone going out of their way to train them and take more time on the job and then the guy/girl decides they hate it and they don’t show up again and give no notice.",
            "Yea that’s tough to beat. I just always see how In demand the trade is, but it doesn’t seem like it from my perspective lol",
            "That’s how I feel too. What if the system got hacked? Ascensions system just got hacked..",
            "You’ve heard the venture capitalists, they’d love no employees. Don’t know who they think will buy everything eventually",
            "UK also, up in the North. I'm a bloke, but I can sympathise - always been I house but worked with agencies.\n\nIt's always been a struggle when what you do is so subjective. Boss wants the logo pink? Wants a gradient on something? You can argue theory, strategy until you're blue in the face but sometimes people just don't care and want it their way. I learned to stop caring and not pick the battle.\n\nThey wouldn't argue with the sales guy who can demonstrate he's bringing in £×× amount every month. Or the guy in accounting in charge of the numbers. Or the electrian who comes to fix the lights.  \n\nIt's sad because I've had genuinely rewarding periods of work. But I haven't had that for years.",
            "I don't know what to tell you, I have MBA, moved to the US in 2011, became a truck dispatcher and now I own my trucking company. If I could predict the future I'd be working at Wall Street, not in Elk Grove Village IL 😆\n\n\nAbout your kid - I think you should let them do what they are passionate about. I don't know anything about graphic design, but I know business. And in every business if you are in the top 10%-20% of the best performers - you'll make it. \n\n\nBut honest opinion - yes, I think not only graphic design, but IT jobs in general are toast in the next 10-15 years. Nobody likes to admit they are replacable, but we all are. And IT jobs are becoming replaceable faster than other sectors.",
            "Well, I'm an immigrant in the US, I stole someone's job, but now I own my company and I'm the one providing jobs. \n\n\nBut at the end of the day businesses will do what businesses do - look for ways to increase profit. Political beliefs quickly become irrelevant when there's money involved 😆",
            "May I ask what kind of jobs you are applying for? Depending on where you live you might also manage to land in some totally unrelated and cool stuff. \n\nI too want to burn my degree paper. Neither obtaining nor trying to make use of it has been fun.",
            "The best way to get into a trade is start at a shop as a labourer. Prove your worth, prove you’re reliable, prove you want to learn. Then ask to be indentured.\n\nThe outfit you’re working for is making a commitment to you, they will be spending time and money on you, without a guaranteed return on their investment. Let’s say the journeyman you’re working with is able to be 80% efficient while training you. And you don’t know much so you’re able to help out, but if you haven’t proven yourself as a valuable labourer, you’re maybe only good to help out 50%. So thats 50% of your wages and 20% of the journeyman wages that are tied up in training. Being a hard working labourer makes up a bunch of that equation. If you’re still able to learn and help 50% of the time, but the rest of the time you’re busting your ass cleaning up, hauling materials and equipment, thinking ahead, you can justify the other 50% of your time spent on site. And you can help increase the efficiency of your journeyman. But not everyone wants to, or is capable of, doing that.",
            "I used to have this friend who used to work the phrase \"there's no such thing as a bloodless coup\" into conversation pretty often. \n\nI feel like he would have something to say here.",
            "I went in house , the started to notice all these agency creeps popping into senior roles and realised u can't get away from the toxicity. They are always happy to.jist provide the status quou and that's what we are paid to do. But it's so DULL",
            "Thanks for reply. I reckon you are spot on!",
            "The whiplash I had from reading Elk Grove village haha hello neighbor! Graphic designer here (although clearly you aren’t anymore haha)",
            "Oh I know—you’re preaching to the choir. Corporate greed killed the US manufacturing sector—that’s why we don’t make things anymore. Google (and other tech companies) just went through a bunch of layoffs bc of outsourcing. Ha I wish I could post this into the Fox News comments—it would whip them into an epic chimp frenzy.",
            "Let’s have a burn party!!\n\nCurrently I work part time as an office assistant within the pharmaceutical industry. I could see myself do some more “dirty work” within either production, farming or some sort of craftsmanship.\n\nRecently moved away from Denmark, so I am going to start to see if I could maybe get an apprenticeship and get another “title” and new opportunities through that. But different country and different rules so I have some reading up to do",
            "Damn.. I’m going to throw the biggest party ever. Wherever you will be in the world, you are definitely invited! And also good luck at your new place!!\n\nI find the dirty work idea and apprenticeship quite cool and practical. I am nowadays focused on doing something that makes sense for the world. Like working for the environment or biodiversity. That’s why I’ve been applying to non profits and nature conservation firms etc. Some graduates are also doing urban or landscape planning. But tbh I don’t know how good my chances are.\n\n  \nAlso if we want to look at the positive parts, we still have a degree which proves that we have somewhat something to present."
        ]
    }
}